{"BRAVO! Italian Restaurant & Bar": [["Rachel P.", "Bravo is definitely one of the nicest restaurants in Jackson, and one of my favorites in the North Jackson area. It's a great spot for a date night if you're looking for dinner, but the lunchtime vibe is much more casual. It's a great spot to grab lunch with a colleague. I've done dinners here with groups before, as well, and it's always worked out really nicely! They do a great job accommodating groups as long as you plan ahead. It's an \"Italian\" restaurant, but definitely a Mississippi take on Italian. The portions are very generous, so be prepared for that. Bring your appetite. Everything I've eaten here has been genuinely super delicious. The pastas and salads are always on point. I'm a huge fan of all their seafood dishes. The desserts here are so good, but HUGE so plan on splitting them! Rather than get dessert, I usually opt for one of their after dinner drinks with kahlua or some other liqueur. They're all really, really well made. Like I said, this is definitely one of the nicer spots in town. Think white tablecloths. Don't show up in your Nike shorts, is what I'm saying. The servers here are super professional and knowledgable. They're always ready with a recommendation for a wine pairing and they know the menu extensively. It might not be the most creative menu in town, but it's a delightful and reliable place. If you're looking for a date night or need to head somewhere nice with out of town guests, Bravo is an excellent choice."], ["Gary J.", "Current title: \"Bravo!\"-- is inaccurate and self-aggrandizing.  More appropriate title: \"This will do but there is much better elsewhere!\"I ordered the veal parmesan.  I made better Italian dishes using sub-rate utensils from Family Dollar in my small and low-rent college apartment with McCormick packets.The patrons seem to be of upper middle class origin.  The kind that likes to feel rich but are not rich.  Everything is a la carte.  This business makes representations that it is a classic Italian eatery but fails to deliver.  The only thing that makes it similar to classic Italian haunts is that everything is a la carte and exceedingly expensive. Now that the rant is out of system, let us coldly and logically examine \"Bravo!\"  Nestled in a swanky shopping center in north Jackson, Bravo carries the promise of exquisite dining as the wine glasses ring at the counter.  The restaurant has a rather lengthy and impressive wine menu.  The bartenders act with expert timing, although they refrain from Kung Fu fighting. The food you might ask?  I observed 3 dishes and ate one.  My first observation was a splendid bowl of catfish and andouille in a gumbo (not even remotely Italian, but we will leave this here).  The next was salmon presented in an organized manner with an excellent looking cream drizzled over it.  My final observation was the pork chop, served bone-in, over mashed potatoes, and covered in a delightful mushroom gravy. I ate my veal parmesan--begrudgingly.  A fellow dinner guest allowed me to taste the pork chop.  This was a very incredible bite.  A bite for the ages and to be indelibly recorded in the  annals of yelp.  However, I did not order the chop because the waiter, in a stroke of fate, failed to suggest it to me. The pork chop quickly stole the limelight of our eyes and our conversation.  It was plated perfectly, at a healthy 8 oz, and bespoke its imminent greatness.  Meanwhile, I muscled through my so-called veal parmesan [sic].  Allthewhile, I was eyeing the pork chop.  After time, the artificial candle light reflecting downward brought out the sheer redness of the marinara.  It was as if the veal was looking to me longingly it kept catching me stare at the pork chop on the other plate.  When dinner was over, I had only eaten the meat of the veal and allowed the dry pasta and wilted greens served alongside of it to grow cold into the night.  As the waiter brought the check, I looked over at that young couple by the window and reflected how much in common I had with that veal parmesan."], ["Ryan K.", "Bravo! is a great local stop in north Jackson with an award-winning wine selection.  While I can't say I was put over the top with all of their dinner entrees, their pizzas, appetizers, and deserts are fantastic.  Of particular note, the Shrimp Basil Pesto wood-fired pizza: savory, rich, and filling for the price.I'd recommend Bravo on the later side of the evening when you need to cool down with a great glass of wine and a very friendly staff."], ["Ryder T.", "I am having a really hard time deciding if this is a 3 or 4 star place. I'll settle on four stars because the food is good and is genuinely good quality. The service is typically very good too. From time to time they will have a special that truly delights.For a very long time, Bravo! Was basically the only nice restaurant in town, and to some extent, I feel that they have just coasted along on that reputation. I don't really know that much has changed as more restaurants have popped up. That is not a terrible thing, but now we are used to going places where we can try new and exciting things all of the time. Bravo is not *exciting* but it is still very good.This is a lovely white tablecloth sort of place. The waitstaff is typically a cut above other restaurants in Jackson, so this makes it a safe bet for a nice date.One of the cool things about Bravo! is that even if it is not culinarily that cutting edge, Jeff Good keeps the business side interesting with promotions that are appropriate for a nice place. You have to pay attention to their emails or twitter, but one creative promotion they did was a \"cellar clearance auction\" where you could bid on very nice bottles of wine from their cellar. If I recall correctly I got what was probably the best bottle of wine I have ever had for half off.It is worth knowing this restaurant, but there are just much more exciting places in town as well."], ["Kayla C.", "Hiding in the upstairs level of the Highland Village is where you'll find Bravo. They're known for their Italian food, and rightfully so. I've been to Bravo several times and have always had a great service and dinner. I took my parents here for their first time and they fell in love. We had the sampler appetizer plate, which was almost filling enough! It had goat cheese, rosemary mushrooms, eggplant, cooked garlic, and lots of other goodies to stick our forks into. For my dinner I ordered a small tomato basil soup and a half Spinach and goat cheese salad. I always get the salad, it's absolutely wonderful. The dressing is a warm balsamic and ummmmm just yum. I got a half size and I was more than satisfied. They offered us free dessert for asking us to move tables when we first arrived, so why not? The menu had so many options it was definitely had to choose. I saw they had after dinner drinks so I ordered a toasted almond. It was SO good as I love almond flavors. It was a shaken mixture of Khalua, half & half, and amaretto. Some other things probably. The table ordered the brownie with ice cream and I got a bite of that too, so yum. Overall, our waitress was SO sweet and fun. I will bring my family back here."], ["Elizabeth B.", "Came to Bravo! Italian Restaurant & Bar yesterday for my brother's late birthday Lunch. It was good, I had the Tri-Colored Tortellini w/Chicken, it had Artichokes, Mushrooms, Spinach, Red Onion & Roasted Red Peppers in it and it had a Tomato-Cream Sauce on it. The Pasta was good and the cheese inside was good, however I would of liked to have, had a few more mushrooms and artichokes in it. I also had Tomato Basil Soup, it was good but I wanted a little bit more basil flavor in it. Then I had the Tiramisu and a Single shot of Espresso, they were the best thing I had at the restaurant. Can't wait to come back and have more."], ["Dom T.", "I was offered a gift certificate and a chance to make things right from my last visit, but decided to give the place a second chance on my dime with some friends. This wouldn't be a fair rating if it was paid for by Bravo. We had four different appetizers and all were delicious. The staff was courteous and pleasant to deal with. I didn't notice any employees on their phones, which is always nice. Bravo, perhaps my last time there was just a bad night for you. Or perhaps someone decided to tighten things up around there. Either way, good job! I not only recommend Bravo but will return, very hungry."], ["Sam S.", "Bravo is my wife and my absolute favorite restaurant in Jackson. The food is always perfect, service is top notch. If you haven't tried it yet you need to. The restaurant has a fancy feel without being over the top. The atmosphere is great for small groups, families, and especially couples. The servers are at friendly, professional, and efficient. This is one of the few restaurants that can always keep my drink cup full (a true feat since I drink water ridiculously fast) There is a bar area that I've never sat at, as well as traditional seating. The restaurant doesn't take reservations. It can get a little crowded on weekends after six, but it is worth the wait. As far as food there is everything from the ten dollar range up to mid thirties. I'm a bit of a cheapskate, so I've really only tried the sub twenty dollar options. My favorite is the chicken sweet potato Gorgonzola salad. My wife really enjoys the shrimp and pesto pizza. As appetizers go they bring you bread with olive oil for free. My favorite to order are the fried polenta - fantastic if you like mushrooms, and the fried brie.  They have a really impressive wine selection. I've only tried a few of the cheaper wines - around 24 bucks a bottle, and have been incredibly happy with the taste of them. For desserts you have got to try the peanut butter pie... Simply amazing. They have other options that are great as well, but the pie is crazy good. I have been personally greeted by the owners several times, which is really a nice sign in a restaurant. You can even check out the full menu with prices online, which is great. To conclude, I am sure you will be happy if you choose to eat here."], ["Camille M.", "The grilled chicken salad with Gorgonzola, diced sweet potatoes, dried cranberries, walnuts and vinaigrette rocks! The tomato basil soup is really yummy too- very creamy and rich. I also highly recommend the pizza and the Caesar salad. They have a full gluten free menu for those of you with special dietary needs. Love coming to bravo when I'm in Jackson. Great happy hours too! This is an easy, fun spot.. One of my Jackson stand-bys!"], ["James J.", "View: the view is not spectacular.  But , I like the atmosphere.   It is very upscale but not crazy prices.  It is right off interstate 55 in North Jackson Mississippi. Prices: prices are not too bad.  You can get an entree for twenty bucks or less.Waitstaff is good.  I have never had bad service.   I read some of the reviews about the service being bad but that has not been my experience. Food: I like the bruschetta and I have them add cheese to it.  I also like the paneed redfish.  it is lightly flowered and is really good.I have eaten here a lot ad if you like wine they have a wide selection. I would recommend this place to eat.  So if you are coming to Jackson you should try this place."], ["Orlean S.", "Visited Bravo for the first time over Memorial Day holiday. Thankfully it wasn't busy and we were seated fairly quickly. The décor is nice but not fancy. The server was extremely nice and relatively attentive. With many high dollar restaurants you never know how much food will you get - is it enough you don't need to order side items or will you pay a lot and still leave hungry? So each of us ordered an appetizer; me the grilled portobello mushroom and my guest the pecan crusted brie. Both were surprisingly large and enough to share. The Brie was especially tasty. Then we each ordered a half spinach salad which was a nice size and very appetizing with goat cheese, candied nuts, and sweet dressing. The main course for both of us was the specials for the night; Crab crusted amberjack for me and salmon with fried green tomatoes for my guest. For $28 I was underwhelmed at the portion size of my plate. It was a small piece of amberjack with about 3 sliced new potatoes. I was left guessing what \"crab crusted\" meant as I saw no crab. The salmon special was better in both size and presentation. While the size of the fish wasn't notable, there was about 4 fried green tomatoes along with corn and a couple of green beans. But again, not what I was expecting after the large plates of appetizers and salad.For dessert we finished with the flourless chocolate torte and a brandy alexander with ice cream. The torte was very chocolaty with a nice presentation. (If you want the best flourless chocolate cake try the Bonzo at Anchuca, Vicksburg.)Overall it was a nice experience and I will return, even though it was the highest price I've ever paid for a meal in Jackson. But I didn't leave hungry! To do it over again I would share an appetizer and probably order a vegetable side with my main course. I would try the redfish and stay away from the crab crusted special."], ["Brandon T.", "Every time I looked over this restaurant in reviews I was thinking it was Bravo's Italian Cucina, the chain restaurant found in several major cities. But it was definitely not when I checked out the website! The quality of food and calibre was entirely different from what I was expecting! The ambience was one of the classiest I have been to in Jackson with dim candle lit lighting, white table cloths, and huge windows overlooking the highway. The menu was on the pricier side and it may or may not be worth the price. I enjoyed the dining experience, but the meal itself was only average. ."], ["John B.", "The paneed redfish is one of the best meals I've ever had! I get it every time I go there. The tomato-basil soup is so good as well."], ["Bonita M.", "Was disappointed in my penne & blacken Chix dish same for bread which I had to ask forservice was good but a delightful meal would have been better.my 1st trip to Jax MS & had higher hopes for a nice dinner"], ["Sweet O.", "Bravo, I loved you. Notice the past tense. You still have an incredible wine list, but much like your sister restaurants, Broad Street and Sal & Mookie's, you are bordering on being a has been with a tired menu, hit or miss service and are way over priced. Honestly, I have recently (and regrettably) had a better meal at one of the Jackson area chain restaurants. You are slip sliding away and that is sad."], ["Ieisha E.", "The last time I went was a year ago. It was good. I love they presentation of the food. They really make things fancy. Even chicken and mashed potatoes. The servers were very nice and it was a cozy little place"], ["Brandy P.", "My absolute favorite place to eat when I go to Jackson.  Great location.  Beautiful establishment.  Bar area where you can watch the cooks.  Great Italian chocolate milk and the salads are great!"], ["Leilane V.", "I absolutely love the vibrant professional atmosphere at Bravo's.  The food and the service is fantastic and great value for money."], ["L T.", "This was a nice place for lunch, but nothing that knocked my socks off, either. Our antipasto plate had some great marinated red bell peppers and garlic, but no olives, which I thought was a little strange. I also had the four seasons pizza, which was nice.If you're not from the Jackson area, the restaurant can be a little hard to see from the interstate -- I recommend finding Julep, which is easy to spot on the corner of Northside & Frontage, and entering the shopping plaza from that entrance."], ["William O.", "A wonderful locally owned restaurant. & Bar.  I celebrated my Birthday there in 2013.  It is a great place to take the family.  Excellent wine selection. Their pizzas are \"to die for.\""], ["Leila F.", "I have to say this is the best place I have been to in Jackson... so far. If that changes I will edit this review.  The wine list is decent. The food is really good.I found the service quite professional and friendly. The first time I was there, I have to admit I was skeptical. The place was so large....And so many people...how could they keep up such good quality as reputed? Well they do have great food. Why will I not give it five stars? Because of small inconsistencies that may not be readily apparent unless you go here often. Sometimes you order a dish and it is perfection. The next time, it has something missing... the warmth, or the crispiness, or the sauce has slightly changed. I am very sensitive to these things. And I imagine this has to do with the size of the place. Someone different probably cranked out my favorite dish all three times I ate it. Or it sat for a bit longer. Or it was rushed a bit.  After that I changed dish and the same thing happened all over again. I am not talking about anything major...it was still delicious.   Like I said, I will try a few more places to see if I can find something better...that five star place. But I will probabIy keep coming back here as well. This is a delightful place to eat with fairly high standards across the board. I find it justly priced as well. The owners must be very nice people, which to me is important, because the employees seem happy and seem to enjoy their jobs."], ["Lawrence Z.", "The food and service are mediocre, but let's talk about their selling points:1) Wine -- they have the BEST wine selection I've seen in Jackson, MS.  Kudos to their sommelier.2) Dessert -- they have the BEST tiramisu I've had in Jackson.  Their cappuccino is great too."], ["Christopher T.", "Came here for dinner on a Tuesday night I believe it was. The bread that came with the meal was really good! We also ordered this deep fried block of Brie cheese crusted in pecans. It was just not for me though it was good - I am just not a big nut fan, especially pecans so I am a bit bias.For main we had this lemon chicken thing wrapped in some kind of fried shell. Sorry that I cannot be more specific. This wasn't really all that good and I wouldn't order it again.The place kind of sits in a mall..kind of hard to explain. The atmosphere is casual with a mixed crowd. The only disconnect on the decor was from the main dining room to where we were sitting, the bar/lounge area. It felt completely different. It had the appearance of a cruise ship - tacky tacky..like maybe something like Carnival. Nothing classy like Norwegian or Celebrity."], ["Jennifer C.", "Ok food, ok atmosphere, pricey.I prefer amerigo's for italian food. i only come here if everyone else in the group wants to go here for lunch."], ["Ashley G.", "I don't know how everyone doesn't give this place 5 stars. This is one of my all time favorite restaurants. It's more upscale than most of the other restaurants in Jackson but not super pricey. If you are looking for a place with a decent wine list in Mississippi (which is hard to come by) Bravo is your stop. The food is also amazing. They menu offers a wide range of selection from pizzas to fish to a variety of pasta selection. Everything is delicious. Whenever I go I always get the tomato basil soup as an appetizer and the tiramisu for dessert. I normally switch up the entree because I always want to try something different. The tiramisu is hands down the best tiramisu I have ever had. I love tiramisu and try it often at other place but this has always been my favorite."], ["Jake D.", "i have only been to bravo for brunch, so i can't remark on their dinner menu. HOWEVER, in terms of brunch, they are awesome. Jackson has a dearth of breakfast places (with bars), and Bravo steps up.  The service is great, the food is creative (for Jackson), and their drink menu is amazing."], ["Kristin H.", "Dining at Bravo was a last minute choice as the day we travelled to Jackson, the whole town seemed to be closed for the Thanksgiving weekend.  Needing to eat after a 3 hour drive, a friend suggested we meet at Bravo.  when we walked in, there was no host to greet us, but a woman who I can only guess was a manager who came to seat us. As she took us to her seat, I saw she had been sitting at the bar eating, and when we sat down, I noticed she was still somewhat chewing. OOO-kayyyy...We sat down and ordered mimosas and bellinis, a must if I am out on a weekend and there is a brunch menu.  Small for 7 bucks, but I still had 2!  We all ordered our lunch.  I got an eggplant napoleon with sun-dried tomato pesto and goat cheese.  The dish tasted like someone had taken a pre-made one out of the walk-in and put in on the plate.  It was too cold, and difficult to cut into.  The flavors were good, but I would rather it had been at least room temperature.  I started with the tomato soup, which was wonderful. I could have had a few bowls of that and been quite happy.  The hubs had a BLT club. It was a standard sandwich, nothing to write home about.  My mother had the crabcakes. These were good, but a crabcake lover like myself, a lot of filler went into these.  A little less cake and a bit more crab would liven them right up!Service was good, not great.  He was friendly, but his pacing was off. He tried to take my mothers plate away as she was still eating.  I always appreciate if a server would ask if I was still enjoying my meal. Then it doesn't sound too hurried and we can all finish our lunch at our pace.  If I go back to Jackson, I most likely will not be dining here. There were many other places I wanted to go but were closed on a Saturday afternoon for Thanksgiving weekend. By far the most bizarre excuse I had ever heard!!  Jackson as a whole was a disappointment. Maybe it was the food."], ["Baron M.", "Another great place from Mangia Bene. They have three of the tastiest places in town, plus they give back to the community (maybe that is why it costs just a bit more vs the competition ha). Bravo is no exception. Every time we have come, they have had a professional staff with great food. Sometimes they run some neat specials (like the wine bottle special they are running right now, which we are planning on trying out this Friday) from time to time and it seems that you can get an early bird discount (last time I checked) for dinning in early."], ["Beth P.", "When I have folks in from out of town, this is the first place we go!  Plus excellent Sunday brunch time, try the breakfast pizza."], ["Skip R.", "One of the best restaurants in Jackson. They don't take reservations, so you will have a wait most times you go there. They are busy, so you won't get the fastest service either. But they are busy because it is very good food. I would rather wait for a great meal rather than get a poor meal in record time. Slow down and enjoy the experience. They use super fresh ingredients and that shines in the quality of the food. I can vouch that the sweep potato fries with cinnamon apricot yogurt dipping sauce and the pecan crusted fried brie with dried cherry marmalade are outstanding. My favorite salad resides there in the Bravo field greens salad with citrus dressing. You can't go wrong with whatever you choose off the entree menu. I have had several pastas including the chicken mushroom with penne pasta. It is really outstanding. The best entree I have had at BRAVO is the pork chop zatarainaise. It's a perfectly cooked pork chop with a creole mustard cream sauce that will knock your socks off.  Be sure to save room for the banana creme brule for dessert. It is unrivaled IMO."], ["S H.", "This place blows. It's hard to serve decent food when the ingredients are of such crap quality- 23 dollars for crab cakes that's not lump crab meat is a scam. Also the servers seem unprofessional. Not going back!"], ["Dee K.", "I have been to this place at least 100 times and am ready to go 1000 more. Food is great, ambiance is classy and romantic. Some tables are a bit too close but then again it's a small place. Appetizers are big to a level where if I am not too hungry I can manage with soup and appetizer and not miss the main course. Keep in mind I am a girl and don't eat too much. Wine list is extensive and bread pudding is out of this world. Cream brulle is another of my favorite here. Cajun pasta with andouille sausage, salmon pizza are some of my favorites there. They have a great pizza oven and most of the pizza choices are great. Love it for food, drinks and classy deserts."], ["Brian K.", "I once loved this place....but that has changed. The service was once A+ but it is no longer that. The last 3 times I visited this place I have had to  repeat myself over and over because my waiter or waitress can't seem to get it together. The last time I visited after I was seated it took the waitress 20 minutes to come greet my party during brunch. The kitchen is good, the food comes quick, it is usually good, but the service needs to step it up. This was once my favorite place to dine, but its not what it once was."], ["Sonia C.", "Good food, but over-rated. We ate here a few times when my husband was in medical school. It's a nice place with good food and decent service, but it doesn't live up to its reputation.  They do have some interesting dishes, like fried polenta and they have some nice salads. The pizza Margherita is good, and I'd order it again. They also have a vegetarian plate, which is appreciated. If you decide to go,  have realistic expectations - good, but not great."], ["Gregory G.", "This is a Jackson Mississippi hidden jewel and I am going to uncover it for you. First let me say this place has a great atmosphere with lots of energy. The servers at Bravo I would have to say are the best.  And the food is \"A\" rated. I have eaten at some really great italian restaurants in Chicago, this one should be relocated to the \"Windy City\", but then you would miss out on the Mississippi warm and friendly hospitality you receive when entering the door. Their menu is extensive and if you don't find anything mouth watering on their Wine list, you won't find it in Jackson. So if you are visiting Jackson Mississippi and looking for a really great place to eat, Bravo should be on your list. Now it can become crowded during normal dinner times, but wait until 7:30pm and you should be fine. Enjoy!!!!!!!"], ["Tony S.", "Great food, but the service, while adequate, was slow. We tried the glazed chicken, the fried oyster salad, crab cakes, pork chops, and a salad with goat cheese. Everyone was VERY pleased with the meal, but we waited way too long for simple things like a glass of water and some lemon wedges. Also, the host was really unhelpful, unprofessional, and had us wait almost twice as long as his previously estimated wait time (50 minutes). Thankfully, there's a lounge and a bar. So, definitely check it out, but make reservations."], ["Brett S.", "Way over priced for a very mediocre restaurant! The previous night we ate at Amerigo's which had top notch waiters and delicious food. This p,ace was a couple of dollars more and not anywhere near as good.  Also the waitress was not very professional and food was served across the table. By the way did I mention it was noisy?"], ["K P.", "Had a light early dinner in the lounge. Open and comfortable. Food was excellent and atmosphere was very relaxing. Good service as well. Still one of my absolute favorite Jackson eateries."], ["Bart C.", "Upscale crowd of mostly late 30's to mid 50's professionals. Very nice atmosphere, very attentive staff and well prepared food. Fish of the night was a lobster topped Lemon fish, a black and bleu risotto or a pan seared New York strip. I had the crabcakes and my wife had the linguine with andoulle and shrimp. Joshua was our server. Very good experience overall."], ["Frank S.", "I think this place is very good.  For years I never went here but made the first dinner last year and have gone back twice since.  I had no problems with the waiters.  The drinks are great but cannot recommend one as I don't recall the names.  Food is excellent all around.  Nice atmosphere and in a good location, easy to get to,  which is Highland Village, right off the interstate at Northside Drive."], ["Michael O.", "Far and away the best restaurant in Jackson. Good honest drinks,very good wine list,the menu is excellent and the flavor sense of the dishes is one of the best I've come across anywhere and I travel about 150 days a year through out the country . It's a must try in Jackson"], ["john m.", "Good Italian food. Nice atmosphere. The bar is packed on Thursday nights. The get all of their baked goods from there sister bakery BroadStreet Bakery located accross the freeway."]], "Ole Tavern on George Street": [["Tony T.", "This place looks dark & mid-evil (we mean that in the best way possible!)!The building itself is a beautiful 100+ year building and it show cases its age and beauty via exposed brick and mortar walls and rich wood décor!      Located right next to \"Two Sisters Kitchen\", we ate there and walked right on over to ye \"Ole Tavern\". It has a very laid back feel and the staff make you feel like this is the place you wanna take a load off. A great selection of beers some of which are local non-mainstream brews. Overall, a nice joint to visit but its the ambiance and the laid back attitudes that puts it one over the top!"], ["Kayla C.", "Went for karaoke one Wednesday night. Nice environment. There's an upstairs and downstairs.  We spent the most time upstairs. The staircase is very slim, so be careful! The beer selection was good. They have a couple arcade games, too."], ["Jonna B.", "This place felt like I had been there 100+ times, even though last weekend was my first time. The bar tender (Wes) was super cool, and my drink was never empty. I'm glad I was brought here, and I'll be returning again for sure!"], ["William D.", "The only redeeming quality was the burger.  It did take about 30 minutes to come out and you cannot order it medium rare but it was tasty.  Service was slow and not that friendly.  The place has potential but the service is awful."], ["Bill S.", "Kitchen closed on the weekend.  Not from here and didn't expect that. I guess I need to ask from now on if establishments serve food all 7 days of the week.  Otherwise, cool place with lots of nice vibe."], ["Charlotte P.", "It has an old time Pub feel and look, but, offers plenty of \"Fine Dining\" choices as well! We were greeted and seated promptly by friendly staff. I had the Soup of the day, which was Shrimp and Corn Chowder.....AWSOME...then I had the Fried Green Tomato and Bacon Sandwich which had \"comeback\" sauce on it! It was delicious, but, it was a little too much sauce, so, next time I'll get sauce on the side! Darrell had the daily special which was Seafood Pasta..... I had to stop him from licking the bowl! Lol! It's GOOD y'all! We'll DEFINATELY go back!"], ["Dee N.", "Went to this restaurant and was nicely greeted and seated. When asked what was good, the waitress was kind and very helpful and the food came out quite quickly. I got the house burger based on her recommendation and it was huge but it was mediocre at best. The fries were also not seasoned and overalls oily. When it was time to pay, the waitress failed to bring a to-go box and took over 30 minutes to get us our check. Will I come here again? Definitely not."], ["Ellen O.", "We ordered the fried green tomato appetizer and LOVED it.  I ordered the lump crab meat melt and my friend ordered the black and blue burger, they were sold out of the crab so I did the tuna and pasta stuffed tomato instead.  Wow.  They were both excellent.  I highly recommend this place to hang out with a friend or two, eat, drink and enjoy Mississippi."], ["Mike P.", "Love this place cool place to have a beer and some good food.  Never disappointed coming here"], ["Coral E.", "Got a chance to try this tavern for lunch and I was not disappointed.  While busy, we were still seated promptly and had great, friendly service.  I ordered the chicken salad sandwich with onion rings. Sandwich was on one if the best croissants I've ever had (not to mention massive) and sat a good 4 inches tall packed with delicious chicken salad. The onion rings were delicious.  Not too thin, not too thick and with a great crunchy batter on them and served with awesome comeback sauce.  I will definitely be eating here again!"], ["Phillip M.", "Great blue plate lunch specials and the gumbo is awesome!  There is a downstairs bar to unwind after work and an upstairs bar with band stage for the late night crowd."], ["Kenneth H.", "Great pub feel.   Monte Cristo to die for.   Dark wood, exposed brick walls, good music playing - while I was only here for lunch before a business meeting I would most certainly come back for a beer after work.  And the Monte Cristo sandwich is sinfully good - one of the best I've had in the country."], ["Psonya H.", "I eat here often for lunch, and the food is great.  If you want a burger, this is the place to get it!  Also, the seared tuna sandwich is awesome.  Put it alongside some sweet potato fries, and its a winner.  The specials are good, especialy when they offer the crab melt, and the onion rings are excellent!  For dessert, try the fudge brownie and you won't be disappointed.  Lastly, the service is always friendly. Negatives would be that the place somehow smells of smoke, so I don't often sit in there.  There's also no wi-fi.  Also, if you go at noon, be prepared for service that isn't as fast as you'd like.  If your break is only an hour, go at 11:30, or later at 1.  The lunch rush will not be your friend."], ["Scott C.", "Stopped by for lunch while in town for the Mississippi Blues marathon.  It was terribly cold outside and the cold worked its way inside.  Most of the patrons had jackets on.  The food was decent and the waitress/bartender was awesome.  I am glad we stopped in."], ["Clinton R.", "Hit and miss.   The food is good and sometimes they do a good job on the service side.   Other times the wait staff might just look at you when you walk in and act like you are disturbing their conversation.  Maybe it depends on if the owner is in the building or not.    Could be a 5 star pub."], ["Mb A.", "Great lunch special of catfish! Burgers looked great. I'll try them tomorrow"], ["Kyle G.", "Pitiful lunch time service and not all that great of food. The ambiance (ole towne pub) earned them the second star, otherwise I'd tank them completely. Maybe they're decent enough as a bar or dive, but don't waste your time there for lunch."], ["Trenton T.", "Dude... Blackened catfish po boy and fried okra so good great laid back bar too!"], ["Lori R.", "we ended up here after it got cold at the Liberty bowl game. At first when we sat down I thought it was going to be an awful experience. Several of the wait staff just standing around talking and nobody came over to take our drink order. Finally the bartender came over and said \"If nobody else is going to wait on you I will\" -- After that he must have said something to the staff because they were very attentive. The food was pretty good. It was bar food. We'd go back again, maybe but the staff needs to be more attentive to the customers"], ["Jamie-Lee J.", "Good beer, good food, and extremely kind staff and clientele overall. I can't overstate how courteous everyone was to me. I was there on a trivia night, was immediately \"adopted\" by a team, became buddies by the end of the night. When I told the group I'd walked from my hotel, they all jumped into action and arranged a ride home for me, fearing I might not be safe. The security guard drove me home in the bartender's car. Totally not what I expected, but I appreciated the care. Friendly, classy folks."], ["Herman S.", "The name of this business is \"Ole Tavern on George Street\". In it's many incarnations over the years this has always been a very warm inviting pub style vibe. It's a great venue to see bands & have respectable bar food. The King George burger (may not be on the current menu, but ask if you don't see it) is an impressive 1/2 pound burger with bacon, 3 cheeses, a fried egg & Jalapenos on a sweet Jalapeno Bun. It's a very tasty burger, easily in the metro areas top 15 burgers. It's fried rather than flame grilled but tasty. The shoestring seasoned french fries are are abundant & awesome. Probably my favorite french fries in the area."], ["Meg C.", "Went here for lunch several days while working at the capital. Even though there is really only \"Two Sisters\" and here in walking distance I was pleasantly surprised.  *they do not seem to be open weekends but nothing in Jackson seemed to be. Loved their croissants on most sandwiches, they either make them in house or get from a local bakery frequently because they were amazing. Portion sizes are large for the price and the lunch service was quick for how busy they seemed to get. Seasoned fries are a pumped up Arby's curly fries.  \"Home fries\" are what I grew up knowing as \"steak fries\" in New England. I did not try them but my co-worker enjoyed his. They have a nice selection of salads and their own twist on tuna and chicken salad  i am a chicken salad freak and this is top three the best I ever had you can tell it was roasted chicken amped up. They have unique condiments as well and I am one of those who HAS to have some on every sandwich/burger they have pesto mayo, avocado mayo to name a few. Their chicken club was great and I had it with a pretzel bun one day, not the best I've ever had but still great. The two waitresses working the days I were there were friendly and attentive! Would recommend to anyone looking for a great lunch spot while downtown."], ["Andy S.", "The bartender I have had here now for three visits is one of the few in the Jackson metro that seems to be able to properly pour a pint of Guinness.  Huge 2 floored bar with a patio that I could see being busy during the summer.  Upstairs had a stage for bands and a set of stairs that is seriously scary after a few pints and in the dark trying to run to the ATM to get more cash.  Had a shrimp po boy here and it was fine for pub food; nothing too memorable but nothing that made me regret eating it either. I vaguely remember about 8 taps last visit which includes Guinness and a couple of the Lazy Magnolia brews. Trivia on Mondays and Ladies Night is Thursday.  Seems to be populated by a good mix of business, locals, college students, and out of towners, now if only more showed up during the weeknights.  Bonus: Ty, the aforementioned bartender, will leave Fox Soccer Channel on for the soccer fans."], ["Steve J.", "I went in for an early dinner.  I had read how great the seared tuna sandwich was.  It was ok. I have had better  The waitress was friendly, but it was kind of a weird atmosphere.  It is nothing special, but just an ok place."], ["Alli B.", "Great lunch spot! The seared tuna sandwich is amazing but make sure you seared tuna not tuna sandwich or you'll end up with a tuna fish sandwich.  You might end up with a tuna fish sandwich but get the meal for free!The service is good. They also offer good sides to sandwiches instead of ordinary french fries, however the menu just changed and they charge extra for different sides like sweet potato fries or fried okra.  Overall, extremely good.  One of my favorite lunch spots."], ["Rod S.", "Great food and great service. The grilled chicken po-boy and onion rings were awesome. Very busy with the locals for lunch but worth the wait."]], "Mellow Mushroom": [["John S.", "This is a wonderful location! The service is always wonderful and the food is really great tasting....The Every Daley is by far our favorite to order when we head to this particular location....The staff is super friendly and always smiling. The restaurant is kept very clean...We will be back the next time we are in town for sure!"], ["Amy S.", "I don't go throwing around 5 stars for restaurants all too often, but this Mellow Mushroom certainly deserves it.  Over the past few years, we have eaten here at least a dozen times and each time has been a 5 star experience. Now I never can remember the name of the pizza we order because they do not have it on our Mellow Mushroom menu in Jacksonville, FL.  I've actually called here several times from Jacksonville to ask them what goes on the pizza so I can tell them how to make it in my hometown.  LOL  One of these days, I'm going to remember to make a note of it in my phone so I don't have to keep calling and asking. Anyway...  the pizza has chicken, applewood smoked bacon, pineapple and pepperoni.  At least that's what I can remember.  It may have something else but I'm not positive as I sit here writing this review.  It has the standard red sauce and has mozzarella.  It's always cooked to perfection and has the freshest of ingredients.  My mouth is watering now thinking about it. Service here is always exceptional.  Every server we've had has gone above and beyond.  True southern hospitality.  The service is what gives makes this a 5 star review rather than a 4 star!If you're interested, they also have free wifi here.  This is a plus for me since we're from out of town and I'm often looking for a place where I can sit with my laptop for a couple of hours."], ["Urs M.", "This place destroyed me. I had had Mellow Mushroom in New York and loved it, so getting it in Mississippi should have been great. I ordered a small vegan Holy Shiitake Pie for lunch which came to $15 and some change. The staff were good people. Friendly, smiling, knowledgeable, etc. They kept the restaurant neat and clean and welcoming. (Except for that mushroom statue by the podium... Creepy.) The pizza only took 20 minutes to bake, but by then I was starving. I was expecting the box to smell like straight-up truffles, but I got nothing. Something as pungent as truffle oil only takes a drop or two to make an impression.. not even a fart in the wind. I should have taken this as foreshadowing, but I was still optimistic.I was really looking forward to it because fungi are the best. The base was garlic and olive oil. I avoided the garlic the first time because it gives me heartburn. Should have listened to myself. Mushrooms and truffles are some of the greatest things in life, but not minced garlic. You know the kind that comes in a jar that your grandma keeps in her fridge for two decades? That stuff. The smell, taste, and texture of pre-minced garlic is death in a jar.Not only that, but I wasn't crazy about the crust. It was so dense and weighted me down. The Daiya cheese didn't do me any favours either. I normally love the stuff and put it on everything, but it became a white goopy mess. Never again. I ate the mushrooms off and threw my $15 heap of nothing in the trash.This pizza was so bad that it took a toll on my mood until dinnertime. \"Hey, Pie.. You don't look so good.\" That's all I heard for the rest of the day."], ["Brian H.", "Given Cameron a big high five! Great dude! Had the philosopher's pie! Wow, they hooked my pie up! Generous on the ingredients. Told him I wanted to drink some local beer, had one from Mississippi, and also had one from Louisiana very delicious ice cold"], ["Nick W.", "Great place for pizza and beer (or a family dinner if you prefer). The Thai Dye is our favorite pizza. We have only had good experiences here. Great environment and service. Our server was kind enough to hand me the remote to the tv and let me find the Grizzlies game. Can't beat that."], ["Jim B.", "Received 2 $10 off cards in the mail today and thought we would give it a try. I ordered the large mellowturanian to go. Pizza was ready when I got there and server was very nice. My wife and I both agree that the pizza had no flavor. I'll give it another try since I have another $10 coupon and hope to write a better review next time."], ["Steve G.", "Great draft beer selection. 3 IPAs on tap.  Pizza was vey good.   One of the better locations they have"], ["Kevin H.", "Food was great. Had buffalo chicken pizza and was most excellent. Also got Key Lime Pie which was also outstanding. The wait staff was quick and friendly. Service was incredibly prompt & food was prepped & ready quickly. If you are in to adult beverages, they have a good selection of beers."], ["Paul T.", "The one consistent is that the food is fresh and hot, and the service is prompt and outstanding. If you're health conscious, there's something for you. Our favorite is the veggie hummus appetizer and the spinach salad entree. Best in town. The servers are hard working and outstanding. Always greeted promptly at the door too. Great food with the best service. We always go back!"], ["Michael L.", "Always fun and friendly here. I love the pizza and the people. Some places making you feel unwanted especially close to closing. However, at this place I've always been made feel welcome and will be coming time and again. If your in the mood for pizza and don't mind spending a few bucks more I highly recommend checking this place out!"], ["David L.", "I, too, need to comment on the wait staff.  Perfunctary in his concern and slow in waiting on us.  To be consistent, the food was slow in arriving too.Not an enjoyable experience."], ["A C.", "Cool place, different environment. Patrick was nice and friendly, good at creating beer cocktail. It's good to sample beer before you buy. Many meatless choices for vegetarians on their menu."], ["Susan B.", "Always good. The food and service is always consistently good. I love the atmosphere and music. Nice large booths too so everything isn't crammed on the table. Great family atmosphere."], ["Stacy B.", "Awesome menu selection, especially for a gluten-free, vegetarian. Sarah was a very attentative server. Great tasting food w nice food presentations."], ["Tom J.", "I would like to review the food here, but unfortunately we never got that far.  After waiting for a few minutes to be seated, we got to our booth.  I was surprised it took that long to be seated, as there was no one else waiting.  We got the cursory, \"someone will be with you in a moment,\" but no greeting other than that.  OK, not a great start, but the food is always good at Mellow Mushrooms.We had a Mellow Mushroom in Savannah.  The staff was awesome and yes, they were eclectic.  So we had high hopes for this location.After waiting for 5 minutes, no one came to check on us.  5 more minutes goes by, still waiting.  We noticed other tables were being waited on, including the table right beside us.  5 more minutes go by and by this point the kids were fit to be tied.  After 20 minutes of not even an acknowledgment from the staff, we got up and left.  Not sure if this is an off night and honestly I don't care.  We hit Soulshine Pizza two miles down the road and had an awesome experience.  Smart diners will follow suit."], ["Yvette A.", "I had not had a baked potato pizza since high school (18 yrs ago) and their version is by far better than the one I remember! The crust was amazingly moist as the pizza was cooked perfectly. I had this after trying their spinach salad that was equally enticing with fresh apples and nuts. My waiter (Vernon) was so attentive and informative in regards to the wide variety of draft beers, additional menu items, dressing suggestions, and added ingredients that make their crust that perfect combination if chewy and crunchy. This was a great experience all around and I will definitely be coming back for more!"], ["Bryan M.", "I travel every week to a different city for work.   I must say. ... This is absolutely the worst pizza I have ever eaten.  You have to be taking mushrooms to like this.  Gave 1 star because the salad and service was good. Little Cesar is better. ."], ["Bethany K.", "The food was okay. The wait for it was ridiculously long. Not once did the waiter come by to let us know why it took over an hour to get the food to the table. We went on a Tuesday night. I can only imagine what busy nights are like."], ["Jeff R.", "Mellow Mushroom is a chain that has so far kept its \"locavore\" credibility in my mind. Great pizza, great apps and a huge selection of draft beer."], ["Tammy G.", "Wait staff was amazing. Trivia was excellent! A must for good beer and service in Brandon!"], ["Brandi S.", "I love the Kosmic Karma! It's not a meaty pizza, so us cheese and veggie lovers will enjoy it. The ingredients in all of the menu items are fresh and quality and the staff are pretty attentive. The atmosphere is cool, but can be crowded with kids at time. I have enjoyed it on several occasions and never had a bad experience there. I did take out tonight, but dining in the bar is also fun."], ["Rob T.", "This place is very close to the hotel I use when I'm flying in/out of Jackson.  Wish I had come there before. I was just looking for some take out to bring back to the room and sat at the bar to place my order. Their draft beer selection is impressive, bartender friendly, \"mellow', cute, and she had no problem offering me a couple of samples. I could have had another pint and settled in for the evening if my pizza didn't get handed to me before my first pint was down.The pizza rocks and is way better than any of the other pizza places in the area."], ["Stephanie M.", "Amazing pizza! Highly recommend the Funky BBQ pizza, better than California Pizza Kitchen! The crust is perfect not too thick with Parmesan cheese melted on! Great for kids!"], ["James R.", "First time visit and I'm a fan.  Great atmosphere and it appears one of the few places in the Jackson, MS area where you can get a variety of decent beers.  The wait staff was quick with a smile and service and the Mighty Meaty was excellent!  Seat cushions could use some repair (ours was pretty torn) and it is a little pricey but I'll definitely go back again."], ["Andrew L.", "Mighty meaty is by far the best pizza there."], ["Chad L.", "Been here many times and the food and service has always been good!"], ["W E.", "Good food,"], ["Shannon N.", "Great \"mellow\" atmosphere. The staff is young, but does work hard and seems to enjoy their job.  Very pleasant server, willing to answer any of my questions, and even offered suggestions.  Kept my drinks filled, even checked on us during our meal to be sure everything was okay.Had stuffed portabello mushroom for appetizer.  Full of flavour!!  Mushroom was on top of spring greens, and was drizzled with very good, very rich, sweet balsamic vinegar.  Pizza was excellent.  I am usually not a crust-fan, but this crust was a little different; crispy outside, chewy inside.  The flavours are wonderful (had the Funky Q), and not salty at all like almost all other pizza places.  Kitchen staff did not hesitate on special order with second pizza.  Made it the way we wanted.Will return again when coming back to Mississippi.  Loved the service, loved the staff, loved the food."], ["Cynara S.", "I'm glad I revisited this place before firing off my first impression.   Sitting in the side room at a tiny booth for two was a terrible experience and almost ruined me on the place...until the food came....\"DANG, this is GOOD\" we both exclaimed with wide eyes.  Wasn't expecting that .  Great food can definitely save a mediocre atmosphere. The food is simply made with fresh ingredients and the pizza crust is to die for.  I've never had a better Calzone in my life and the Hoagies are top notch. On our second visit, we sat in the dining room where you can see the pizza being made.  The guys tossed that dough in the air with mad skills and it was like dinner and a show!  (Also explains the general dustiness of the place...due to the flour flying) Our experience was so much more enjoyable that  I would suggest lying if necessary and saying you need a table for 3 so that you can get a nice booth...later you can apologize for your \"3RD\" not showing up!"]], "Cerami's Italian Restaurant": [["Samantha G.", "Best food and service we have had in ages and the desserts were amazing. Loved everything about it."], ["Alison G.", "The atmosphere is awesome, the service is great, the food is yummy! The owner is a really nice guy too, he sent take out food for our shuttle driver just because. I loved how friendly everyone was at this restaurant. I felt like a celebrity. I'll be back if I happen to be back in this area. God bless!!!"], ["Patrick R.", "For the price, I think the food quality is lacking, but maybe I did not try the right dish.  I'd be willing to maybe give it another try but I know that the Chicken Alfredo is a no go."], ["Jacquelyn H.", "Our entire family loves Cerami's. My husband I are big fans of the tuna with steamed veggies.When we do order pasta we usually opt for the whole wheat penne.  Our boys go for the linguini with red sauce and meatball, flatbread pizza, or linguini with butter.The salad wagon has crisp greens, olive salad, marinated onions and gorganzola cheese with 2 italian dressings. A delicious blend of flavors!!Cerami's is probably our most visited restaurant in the area and we have never been disappointed."], ["Dave M.", "This place is so awesome, the stuffed mushrooms are awesome. The owner is very personal."], ["Gretta M.", "This is, by far, my favorite Italian restaurant in Mississippi. I lived in Mississippi for 28 years and love to eat. So, I pretty much consider myself an expert on this. I order something different every time i go in there. My favorite appetizers are the stuffed mushrooms and the MEATBALLS!! Honestly, you can make a meal out of just those 2 things, and I have doe it before. My favorite entrees are shrimp Cerami, lasagna, and anything they have for the nightly special. Let me tell you...their nightly specials are where they truly shine at this restaurant. Also, I truly don't know how anyone couldn't love the salad wagon. It's probably one of my favorite things.There are only a few things on this salad bar and for good reason! What they have on there is the perfect flavor combo. Lettuce, marinated thinly sliced onions, olives, Gorgonzola cheese, and your choice of regular or creamy Italian dressing. For dessert....get the canoli! Then again...I love their tiramasu, as well. My point is...just make sure you have room because dessert is a must at this place! I no longer live in Mississippi but I do drop by for a glass of wine and a bite to eat when I'm in town. The atmosphere is so friendly and welcoming. Everyone is so sweet there."], ["Dale F.", "I was able to just make it through the door (8:50 pm) just before their Wednesday evening closing...kind of early, but the way it is middle of the week in Jackson, MS.They were very accommodating.I ordered the Lasagna which comes with self serve salad. Salad was nothing to write home about, very few items to select, bread was just above average, but the Lasagna was very good. Thick sauce and all the ingredients were very tasty. Lasagna made like my mom use to make, but a better sauce.This is anonymous so my mom will never know.I will return when back in Jackson......"], ["Gary A.", "My colleague and I needed to get some good food before driving to Meridian.  I checked Yelp and decided this was the place.  I saw the special on the board in front, but after it was described to me, I decided to get something else.  I asked the waiter if they had clams, since I didn't see it on the menu.  Amazingly they did.  Then I asked if they could make linguini and clams.  He said they could with a white butter sauce.  BOOM!! There it was in a few minutes.  Presentation excellent... actually the best I've ever seen.  Taste was superb.  I would have given them five stars for taste and service except for the wimpy salad bar.  Good taste...bad appearance and selection.  They left a card asking for comments.  COMMENT:  Put linguini and clams on the menu!!"], ["Simi C.", "I wanted to like this restaurant so so badly because it's so close to me and I've been in need of comfort food more so than usual lately but it just did not cut it. For one, it is a family restaurant meaning it is not going to be your romantic night out. There is a bar area that seemed to be a little too noisy for my taste. I ordered a glass of white wine and was accidentally given the red wine version of it. No bigger..the server easily swapped it out for me with no fuss. We ordered the ravioli as an appetizer--taste was average and appearance was below average. They looked like they were store bought/frozen. The salad wagon was slightly filthy to me--the onions needed to be refilled and overall, it just did not look very appealing to me. Dinner dishes were ok, not awful, but also not worth the price in my opinion. I'd say if you're craving Italian, save it for the other Italian restaurant on the other side of town--it's worth the drive."], ["Emily M.", "They had a special a while back, it was chicken in a garlic cream sauce over pasta.  Was literally the best pasta dish I've ever had.  When I was 6 months pregnant we went to Cerami's and they no longer had the garlic chicken special advertised, but I had seriously been dreaming about that dish..... I thought I would go out on a limb and just ask the waiter about it.  He checked with the kitchen, and they made it for me!  Told me if there was ever a special that I just loved to always ask for it bc they usually have all the ingredients on hand and don't mind making something that's not on the menu.  This definitely took them from a 4 star to 5 stars in my book.  And in response to the negative review- they do get incredibly busy if you go on a weekend at prime dining time.  I think your experience was probably an isolated event, and I would encourage you to give them another chance.  Try going on a week night or go earlier on a Friday or Saturday."], ["R F.", "I visited this place on a Saturday evening.  It's located in a quiet strip mall area.  The ambience was nice.  There were families, couples, and singles in the restaurant. The waiter was nice. I had the shrimp pasta dish which was very good and was enough to share.  The salad boat is unlimited and pretty good as well.  The bread basket and sweet tea weren't my favorites but my overall experience was pretty good and I would return.  They also have a variety on the dessert menu which I enjoyed."], ["Lillian M.", "The atmosphere is truly Italian...yes, the expected Italian colors  and photos of Italian scenery, but also statues of the Virgin Mary, the Sacred Heart, St. Joseph and the saints and rosary beads are positioned in cozy nooks. The music was not exactly an Italian genre, but it was Italian style -- live and romantic. Umbrella-covered carts hold the romaine, olives, onions and cheese for the \"endless salad\" that you fix yourself. Our waitress was very attentive, and the friendly maitre d' stopped by our table as well because we had mentioned this was our first visit. The linguini and meatballs entree was everything we could have hoped for... generous portion, large meatballs that were moist but held together well with a delicious tomato sauce of a just-thick-enough consistency. The eggplant parmesan was the best I've ever had. The slices were consistent in size, about 1/4 inch thick, perfectly breaded, no greasiness, no bitterness, no hint of added sweetness, absolutely delicious. Canoli for dessert.... a perfect Italian meal. My husband adds a comment about the men's restroom... adequate, nothing to write home about, but a very interesting feature was a message from \"The Godfather\" painted on the wall: \"Leave the gun, take the canoli.\""], ["Darren S.", "Ate here for the first time tonight using a groupon. I've never had such poor quality food at a restaurant, much less one claiming to be Italian. They even burned my wife's pasta! And if you don't order an entree, you pay $8 for a \"salad bar\" consisting of lettuce, two cheeses, and two dressings! No thanks. Stick to Amerigo's."], ["Tracey W.", "Fantastic food and atmosphere ! I thought I made the best Italian creamcheese cake until now. I submit to defeat ! Omg ,was the absolute best cake . I regret that I didn't take a picture to post on here for you all to see. The salad \"wagon\" is great.  Everyone in our party loved their entre. Lasagna, canollini, shrimp alfredo, clams and linguini, all very good."], ["Cindy W.", "Very good, authentic Italian.  Missed Cerami's for years, but now Fred has his groove back."], ["Gary A.", "The BEST Italian restaraunt in the Jackson Metro area.  The food is excellent, it's got a nice atmosphere!"]], "Anjou": [["Jennie B.", "First of all, this ace is great! For what I would expect from a semi-fine dining French bistro, it's on par, any critiques are because I'm being super critical hoping management may pay attention to become better, however I recommend this place to anyone looking for a basic introduction to French cooking and recipes. Great variety and favors. Great service. Great environment.Okay now the constructive criticism...The waiter made me feel awkward, not sure why, his conversation wasn't as friendly as it was forced. But he was nice although he took the order of a table seated after us before he even found out if we wanted appetizers. The food was between ok and great. I had the escargots. It was swimming in clarified butter and seasoning and not in the shell. I've had better. My recommendation, ease off on the butter and seasoning. I could barely taste the escargots through the lemon butter flavor. Okay so there's a picture from a while ago on here if the escargot, I'm assuming that is what mine should've looked like, but there was so much fat in the bowl you couldn't see the snails or the holes holding them.The fried oysters on the other hand were light and rich with the cheese, however the spinach needed some salt. For my entree I had the Crawfish crepe with \"vegetables.\" My pet peeve is going to a place and ordering something with \"vegetables\" and they only give me one vegetable. I only had broccoli with my crepe. I recommend changing the description on the menu or actually using more veggies.The crepe was to die for. It was filled with two kinds of cheeses and topped with the sauce and crawfish, tomatoes and sausage and mushrooms. It wasn't the prettiest plate, but the flavor makeup for it. I expected to be able to see the crepe. Creative plating can fix this. Overall I give the 4 stars due to the great flavors and pleasant service. Only 4 because there can still be some improvements made."], ["Ryder T.", "I started this review out thinking that two stars sounded really harsh. The more I write, the more I realize it is deserved. This place does not stand out in any good way.I have had lunch here several times, and dinner once. The lunch crowd is usually fairly full, but I haven't noticed it hopping for dinner - I may have just come at the wrong time. The atmosphere makes it seem like a much better restaurant than it really is. The tea isn't even that good.The food is nominally French. I have not had anything that stands out, so no need to go over it. Even the dessert is generally flavorless. Their catering is very poor. Do not get too excited about going to an event there. Most recently I had some sort of fried chicken on top of some mediocre mashed potatoes. It was edible, but the catering is definitely 1-2 stars.I notice in the sidebar that one review says that it is in a good location. This is false. It is in ridgeland behind the Township development. This is currently a massive construction site. It is reasonably easy to get to if you are already in Ridgeland on the correct side of the interstate, but otherwise, it is fairly out of the way. It is also a nightmare to park.Don't bother checking it out."], ["Tom H.", "Went for Sunday brunch and was impressed.  We started with the French Riviera Squash Beignets and had an artichoke soup.  For entrees we shared the crab meat omelet and a beef provencal dish with capers.  Loved the service and ambiance and the food was well prepared save, per my opinion, a little lack of seasoning.  Next time I will bring my travel size Tony Chachere Creole blend to add and all will be perfect!!!"], ["Christopher S.", "Very nice food and ambiance. Good french-american menu, lots of good choices including Steak and Duck. Nice wines, full bar, and ability to eat the full menu at the bar. Good wine list, lots of reasonable selections.  Great brunch on weekends and patio seating. They care about you at Anjou!"], ["Anjali K.", "My husband and I visited Anjou over this past weekend while visiting family in Mississippi.  Based on the reviews, we were really excited to try some French style food since our trip to New Orleans was recently canceled.Upon entry into the old AJ's building, we felt the atmosphere and furniture were exactly the same.  Some changes included the wall decor that reflects 'Anjou\" and the menu of course.Based on the previous reviews, my husband and I tried the Anjou and New Fashioned.  I really enjoyed the Anjou and would highly recommend it.  However, we were slightly disappointed to find that the New Fashion did not have the giant ice cube as mentioned in other reviews.  The giant ice cube is a big deal in our house right now, so we were really hoping to capture that experience again.  Regardless, both drinks were very tasty!We went to a late lunch around 2 PM on a Saturday.  We were left waiting at the entrance, as well as our table.  Our waiter was extremely nice, genuine, and definitely took care of us.  We just felt that the wait times were a little on the extreme side.Anjou provides a great bread to start.  Unfortunately we waited so long that our bread came out with our entrees.  However, it was still good bread.I ordered the croque madame.  I'm a sucker for a fried egg and really enjoyed this sandwich!  The bread was delicious, and the egg was the perfect topper.  The fries were really good, but entirely too salty.  I was wiping off salt before eating them.My husband ordered the beef brunch with eggs entree with French Onion soup.  The soup was outstanding!  We both really enjoyed sipping on it, despite the 60+ degree weather outside.  He mentioned that the eggs and steak were 'just ok' though.I give Anjou a 3 because the food and beverage were tasty, but we were left wanting just a little more in terms of service and flavor."], ["Chris G.", "Food is good, peaceful atmosphere. Everything except Lamb was great. I sat on back porch and enjoyed a warm spring evening.  This isn't the place to go find the fun crowd though.  At least not tonight"], ["Phil H.", "A group of 8 of us dined here on 7-3-15. All agreed that the food and service exceeded expectations. I had the beef bourguignon in crepe. Delicious. My companion had the rockfish. Said it was great. The house Merlot was Dynamite. Never had it before; won't have it again. Switched to Pennywise Cabernet. Much better. Of course, wine is a matter of personal taste. Server was attentive and efficient. Look forward to returning."], ["Nolen G.", "Anjou is a great addition to the \"fine dining\" roster here in the Jackson area.We ordered a wide variety of food to sample.The French Onion soup is amazing, the beignets were interesting (they looked like Hush Puppies for us less cultured) and the salads were very good.Entrees.....we had Steak Frittes au Pauvre...again, for those of us that don't know, that is a NY Strip with peppercorn sauce and fries.  $27.  It was a nice big steak for the money and was cooked perfectly.My wife had the seared Tuna.   It was a nice large piece of fish on a bed of cous cous.  Very good. $26The bread was excellent and the wines are reasonably priced.Overall it was a great dining experience.  I will return and sample more of the menu.French food is good food.  Very much like what you would find in New Orleans without the Creole flair."], ["Michael T.", "The menu has changed. Granted it fits the local population, scot Irish used to meat and potatoes and meat and potatoes and potatoes.    The light fare is heavy now"], ["Bret A.", "A winner: this place has it all:  Location, atmosphere, terrific service and food!  I was in Jackson on a business trip and decided to try Anjou in the Ridgeland area.  The setting is very nice as it is located on a small lake with both indoor and outdoor patio seating.  There are ducks on the lake and a walking path so it is fun to people watch as well.  Inside is a trendy, upscale restaurant with tables placed far enough apart to lend the feeling of privacy as well as open space.  I saw a couple on a date, a business group and a mixture of families and adult diners.  It looks welcoming and comfortable - not stiff at all. There is also a full bar area with its own seating available. The service was excellent - attentive without being intrusive.  One nice feature, since there was extra food at every course leftover, my waiter kindly offered to box it for me.  If I had been a local, I could have had another entire meal!   I am a fan of outdoor seating and the weather was pleasant so I chose to sit out on the patio. The wrought iron tables and cushioned chairs have umbrellas if you need the shade.  There are string lights around the patio that provided a nice, festive atmosphere.  You can order menu items or a set $30 meal that provides 4 courses which I ordered as it was a good value based on the menu pricing and was a good representation of their food. The fixed price meal has a smaller serving of the appetizers and salad than if you ordered from the menu directly, but was more than plenty for one! They bring you a fresh, warm french bread loaf to start.  I started with a cheese board ($15 on the menu) which contained 3 wedges of drunken goat, a brie type, and a muenster type cheese along with a very good and flavorful, rosemary infused jelly and French bread.  The French onion soup cup ($4 cup/$6 bowl on the menu) was very good with the cheese melted and toasted on top and plenty of onions in the broth. A cup is on the smaller size which is perfect for the meal.  My platter of steak frittes, sliced grilled hanger steak with crispy fries ($27 on the menu) was huge.  The steak was good, but I would definitely try one of the toppings to give it extra flavor.  The frittes were really crunchy, fantastic French fries. Finally the dessert was a chocolate tart or cheesecake tart.  I ordered the chocolate.  It was wonderful and very rich with a flaky crisp crust.  This was a fabulous meal with great service and the evening, outdoor seating was very pleasant.  A real gem!!!"], ["Nita R.", "Still one of my favorite restaurants!  Great wine list by the glass.  My salmon was perfect and my hamburger loving husband love his medium rare burger.  Terrific service.  We usually sit in the bar area for a more casual vib  interesting Interesting that my 3 favorite restaurants are associated (Char, amerigo's and this one)"], ["Victoria T.", "The service was great but the food was terrible. I don't understand how it has 4 1/2 stars ... Everything we got was wayyyyy too salty. I did not enjoy my meal at all.. I would not come back"], ["Camille M.", "Why out of all the fabulous restaurants in Jackson/Madison would I eat at the same restaurant twice in five days?.... Because we have Anjou! French Proprietor, Anne and her father, the executive chef both knew just what the metro needed and now we can't get enough of this place! Located in the former AJ's, the decor hasn't changed: Dark walnut floors, wide dining chairs, although the french may laugh, a huge bar area with plenty of signature cocktails to boot.  The Anjou, is a must-try:  grey goose, chambord, pineapple  - mind you the cocktail comes out purple with shaved ice and a bit of froth. My parents loved the \"new fashion\", similar to an old fashion with the single large ice cube. The wine list is reasonably extensive and priced well. For appetizers, I recommend the vegetable soup with pesto, in a chicken broth base with green beans, kidney beans, potatoes -delicious, yet light. My father loved the French onion soup- just as the native French would prepare- excellent. The seared tuna entree was just perfect- and a hearty fillet at that, served over cous cous with calmatta olives and tomatoes. Our favorite entree was the scallop, shrimp & crab crepe which was light, I prefer the bechemel on the side. The service was outstanding. All of the bartenders, Dane, tameka, our waitress and Anne made our experience all the better. Very friendly and attentive, but not overly,  which is good!get a res!"], ["Pamela G.", "Went here last night with a group of 10.  We had a reservation, thank goodness, because the place was packed.  Our table was ready on arrival and we were seated immediately.Tameka was our server and she was wonderful.  Gracious, knowledgable about the menu and able to answer all our questions.I started with the mussels and was very pleasantly surprised.  I have had mussels in the past, love them steamed in white wine and garlic, but have never had them with a little cream added to the wonderfully scented broth.  Who knew how much difference that cream would make?!  The broth was silky, fragrant, and the cream added a \"heft\" that I loved.  Totally worth the cardiac angiogram  I probably now need.  But hey, it's not something you eat daily and I will be back for more of these as a treat.The French onion soup is to die for.  Dark, rich broth.  Succulent onions.  Topped with a crouton and melty gooey cheese.  You may need help to keep from doing a faceplant right into the bowl!My entree, like a couple others already, was the tuna steak over couscous.  Super fast sear on the very fresh tuna and the couscous was a wonderful partner to make for a flavorful, light dinner.The prices for the serving sizes were very good (I shared my mussels with my friends, ate only 1/2 of my generously sized bowl of soup and saved 1/2 of my tuna and couscous for lunch today).  You will not leave there hungry, that is for sure.The wine list is extensive and they do offer quite a few reasonably priced wines by the glass.Can't wait to go back again!"], ["Daniel G.", "I was pleasantly surprised!  Great food!  Great service!  Even though it is a French meets Southern vibe, I still enjoyed the awesome quality!  Would love to see more traditional French!"], ["Karen P.", "We eat at Anjou weekly. They also do a beautiful job with take away. Between my husband, sister, niece and I we have tried everything on the menu and have never been disappointed. From apps thru dessert BIG YUM :-). Everyone at Anjou is very friendly and knowledgeable."], ["Leilane V.", "What a great find.  Exceptional bar - great atmosphere.  My new favorite!"], ["S B.", "Maybe in a restaurant packed city like New York this one would only get four stars.  Make no mistake though it is a very good restaurant.  I've travelled up and down the south during this trip and it's the best that I found while here.  The prices are moderate.  The food was absolutely excellent.  The food was prepared very creatively and tasted phenomenal.  If I'm in Jackson, I will be back!"], ["Tim P.", "This place is the perfect spot for good food, intimate atmosphere and great service.  I've only been for lunch and just once but if I lived in Jackson it would be my go to place for the times I don't feel like cooking.  My barometer for a good restaurant is food as good or better than I can cook at a price that doesn't feel like a car note.  My lunch was $20 but that was my choice.  The tuna was worth the $15 price tag.  I'm a Frite snob so I tried them to see if they were truly French and YES they are; as good as the left bank.  They offered catsup and I asked for aioli.  I was told they didn't have it but the chef sent me hollandaise and I'm telling you the hand cut Frites with Hollandaise was a gastronomic delight.  I told the server and the owner they should up the price of the Frites and offer Hollandaise all the time.  Folks would wait in line.  Oh, how I wish they were in downtown Memphis."], ["S H.", "Nice but maybe a bit unprofessional waitstaff. Some problems- charcuterie plate had dry prosciutto and other slices of meat that were way to large. Actually, all the portions are way to large. I think the two of us would have been happy sharing one entree. 15 percent less food with 10 percent less price and I would be happy. Seared duck breast was delicious as well as the sautéed kale. Seemed like a place for old people- I think next time a drink at the bar with some small dishes would be nice. I'm just happy it's not a complete abortion of a place which seems to be the norm around Jackson."], ["Mark G.", "Yet another of the Jackon mini-chain ala Char and whatever their Mexican and Italian themed places are called this week. It purports to be \"a classic bistro,\" yet the the \"bistro\" (or even brasserie) options, Steak Frites, duck, escargots, etc., are iffy at best, and frankly, iffy is a bit generous. The boring stuff - seared tuna, fish de jour, etc., are your standard mass-market, Sysco-truck bland/safe/nothingness. Their \"Cotriade\" would not pass muster at...well, wait - actually, I suppose it does pass muster at a place that does not know exactly what it is or serve it to people who are familiar with it. All and all, just another chain-ish corp dinner-slinger - when cook \"A\" leaves, replace with cook \"B\" and hand [whoever] the printout of the cooking instructions from the home office (\"what do you mean you accidentally put an extra 1/4 tsp of canola oil in the 55 gallon drum of house vinaigrette?!? Look, pal, if you want to get all creative and shit, do it on your own time and with your own food costs!\") If it's a group, all on expense accounts, yeah, OK, fine, it might be better than the hotel restaurant or Olive Garden (and it might not, too), and besides, what are the odds that it would be your last meal? For all others, especially \"foodies\" expecting anything more, I'd recommend a pass. The service was friendly, even sweet, but these were just nice, polite order-takers, not waiters/waitstaff, if that makes sense (IOW, no, Mr. Very Nice Order-taker, there really is no, ahem, vodka that I'd prefer in my Plymouth martini, since you do not have Plymouth...but tell the Very Nice Beer Opener Lady thanks for asking!). Also, on a positive note, the staff all appeared clean and literally no one in our party had even the slightest signs of any food-borne illness(es), so there is that in their favor.Also, for Jackson visitors: apparently many of the locals rating this place consider this \"fine dining.\" Regardless of your opinion(s) about the place, it is not, nor does it seem to claim itself to be, \"fine dining\" - it claims to be a bistro and while I do not agree that it is one, its \"swank level\" is about bistro-level - IOW, for God's sake, don't wear flip-flops, board shorts and a wife-beater, but don't freak out about not wearing a jacket, either. If you and your date are both 20, in love, and have never even been to Alabama, yeah, this place will impress her. If you and your date are 30 and she is even reasonably certain that \"bon jour\" means something in French, this place won't horrify her, but don't count on any swoonings, either."]], "Martin's Restaurant & Bar": [["Connie M.", "Best place in town to have a stiff drink in an old lounge type environment. Bar staff is quick and professional. Best priced and tasting bar food. They also serve a home cooked plate lunch to die for. Fresh made burger buns. Where else can you get an order of wings and one of the 100 plus variety of beers they carry for less than 10 bucks? Last but not least the entertainment that comes through there reminds me of a night out on 6th Street in Austin TX or Beal St in Memphis TN. Come see the live music or hang with the regulars at happy hour you won't be disappointed . #ILOVEMARTINS"], ["Keandra R.", "Friday night, live brass band, am I back in New Orleans?!The Southern Komfort Brass Band definitely started off my St. Patrick's Day weekend in Jackson off right!  They need a standing night here....it would surely make for some regular fun for the locals."], ["Jason F.", "I stopped by here with my wife late on a Saturday in order to have a few drinks and listen to some blues music.  Having never been here before I was trying to figure out if we were in the right place whenever we first walked in.  You see we were in a small crowded bar area with lots of people smoking and no stage.  After a second I figured that there had to be a bigger area and walked towards the back room which did have a stage and a bar.  It was dark back there and fairly empty whenever we arrived.  So while I saw the setup on the stage I still had to ask the employee in the DJ booth if we had missed it.  He let me know that it had not even started even though it was about a quarter past ten and the show was supposed to start at ten.  So my wife and I sat ourselves down at the bar and ordered a few drinks.  I have to admit that I was pretty impressed with the bottled craft beer selection, especially for what felt like a dingy hole in the wall place. Our bartender ended up being decent even if he had no clue on the prices for a couple of the bottles that I ordered.  After we were there a little while the room started to get a little more crowded and finally at about 10:45 we were about to hear some of the music that we had been waiting on.  Thankfully both my wife and I were fans of the music and we were glad we stuck it out and didn't go elsewhere. The bottom line for me is that I might head back here again in the future.  I was pretty happy with their beer selection as well as the music that we heard.  What did bother me was the lack of promptness and I am not sure if it was the musician or management that held up the performance but if you have an advertised time then you should probably stick with it."], ["Rusty D.", "Some kind of local hang out. Has regular entertainment, went for the first time on Sunday evening no entertainment"], ["Frances L.", "Martin's is a downtown Jackson bar frequented by a mixed crowd of nine-to-fivers and college kids from Millsaps, Mississippi State and occasionally Jackson State University. They feature live acts frequently enough and one can host a karaoke party if they chose to. Plenty of seating either at the tables or at the bar. Bartenders are friendly folks and you can buy a pack of cigs at the counter.Wow. It's kind of strange to see people smoking in bars again, but there they are! I don't mind smoking indoors, but I really wish that there was a better ventilation system so that the blue haze wouldn't hover 4 feet above everyone's head.Looking at the place after having lived in San Francisco for 4 years, the beer and spirits are pretty inexpensive by comparison, but for local Jacksonians, the prices are actually quite standard.If you get itchy for a slight change of scene, there's Hal and Mal's about 10 feet across the street lot."], ["Pete J.", "In March of 2004, I was driving cross-country, moving from New York to San Francisco. It's a big country, & I was hell bent on exploring as much of it as I could, but I was also keen on keeping my budget on a shoestring, so I'd arranged to crash with friends & friends of friends the whole way.I was maybe 10 days into my trip & heading towards Jackson when I called my friend Justin (I'd never met the guy, but he'd been vouched for by one of my very good friends who was living in Austin, TX at the time --- she'd gone to college with him). On the phone, as he was guiding me into town, he asked me one of those no-brainer questions: \"Do you like Ted Leo?\"\"PSH. Do III like TED LEO?! Damn, son, who DOESN'T like Ted Leo?!\"(actually, I pretty much said \"Yeah\" or something like that)\"Good, cause he's playing tonight for $8 at this dive called Martin's\"It turned into one of the unforgettable experiences on my trip, as much for the show & the company as for the bar itself. Dirt cheap beer, chain smoking staff, hipster clientele...it's like it stepped right out of the deep Mission & into Jackson. I got good & drunk for about $15 & had myself a nice long slurry conversation with Ted after the show.I'm sure he was impressed, too..."]], "Fenian's Pub": [["Derek N.", "This Pub has an authentic feel with all the Irish flare. They recently started serving lunch again and the new menu is great. Lots of local ingredients are incorporated. They also offer karaoke, pub quiz, and live music. A solid beer selection makes this pub one of my favorites in Jackson!"], ["Ryder T.", "Have I never written a review for Fenian's?It is a perfectly acceptable place to grab a beer.Sometimes I feel that their prices are a touch too high, but honestly, if that is a big problem, just grab a couple of beers at McDades beforehand. There is nothing particularly special about this place besides it was the only place to get a drink in Belhaven for a long time. There are other bars now, but they are in restaurants, so this si still the only dedicated drinking establishment for about 3/4's of a mile (thats driving, not as the crow flies, to The Old Tavern on George Street).They have Karaoke, open mic nights, small performances etc. Good standard bar activities. It gets crowded on weekends with a crowd that ranges from dirty to fratty. It is a really democratizing place in that sense.At the end of the day though, it is a perfectly acceptable place to grab a beer."], ["Rachel P.", "As a Belhaven Heights resident, Fenian's is a go-to neighborhood spot. Nestled on the corner of Fortification and Jefferson, Fenian's is a short walk from almost anywhere in Greater Belhaven and not far from Fondren and Downtown as well. The drinks are what you might expect from a pub-- a good variety of beers (though, as far as local or quality craft beers, they could improve) and all your standard cocktails. Nothing fancy or gimmicky in sight. Their menu is limited and contains mostly what you'd consider typical bar food-- fries, burgers, etc. It's all good, though I wouldn't say anyone goes to Fenian's *for* the food. Rather, most people find themselves here for the company and the atmosphere. The bar offers tons of seating, with lots of large tables to accommodate bigger groups. The porch is great for sitting outside during warmer months. Monday night karaoke is always a good time. On Thursdays, an Irish dancing troupe often will host an evening of entertainment and free dance lessons. Oftentimes, they'll have live music. As a venue, it's dark and intimate and great for dancing. Overall, there are fancier and \"nicer\" bars in Jackson but for a casual and less expensive night with friends, Fenian's is a great option."], ["Charlotte P.", "I used to go to Fenians after work years ago, but, didn't really think of it for Lunch. However, my husband and I went at lunch and was surprised to see such a variety of menu choices! He had the \"Bookmaker\" which had REAL Roast Beef Slices! None of that thin deli meat stuff! I had the \"PubClub\" that was just as fresh and piled high. Both were delicious and the Waiter was so friendly and had a great knowledge of all items on that menu! The only problem I have is that it's not handicap accessible:-(  I'm disabled and those stairs were difficult."], ["Patrick R.", "Very hard to navigate to this place and when I got there it took forever to be served.  I ordered the shepherd's pie, which tasted bland and was a very small portion for $10.  Just a horrible experience and horrible service.  Steer clear of this place if not for the overrated food and drink but it's not in a very good area either"], ["Judy R.", "Fenian's is Jackson's version of Cheers- go a few times and everyone will eventually know your name! Monday night karaoke is my favorite in town, and usually it ends with the entire bar singing along. I've even gone here alone several times (not something I am very comfortable doing) but it wasn't long before I had made new friends. Live music is always fun and if you're lucky you'll get to see some Irish dancing. The food is like a bonus, but it fits perfectly in this cozy, relaxed, atmosphere."], ["Erin L.", "Great place to grab drinks with friends & their brunches are delicious! The pb&j french toast is a must!"], ["Sean B.", "Fenian's is a great pub. The staff is attentive and friendly. The food isn't an afterthought either, everything I've had on the menu is worth ordering again. Try the boxty or the scotch eggs. I could have their boxty one meal a day and not ever tire of it. I've never been stuck without a drink waiting on a server to notice me even on the busiest nights. The kitchen is open pretty late too,  11 most nights Ive been there, which is a huge plus. Good music often as well, and at a volume you can live with. If you want to listen, sit in the back and enjoy, if not, sit in the front and you can still talk without having to shout. I never travel through Jackson without a stop at Fenians."], ["Chris M.", "Very cool place to hang out after work or late night.A bit of advice - If you plan on drinking it up - take a cab, or have a designated driver as Jackson Police likes to hang around outside.  One night they set up road blocks all around the area.  Drink Responsibly my friends."], ["Joe R.", "Excellent whiskey selection but costs as much if not more than downtown Chicago bar prices  (10$ for Glenlivet). Inside is a true dingy Irish pub.Other thing to consider bar itself is quite small, mostly tables, so the amount of mingling is hampered"], ["John M.", "The side salad was truly out of this world! Amazingly fresh vegetables and my favorite Wishbone dressing made this a side salad to remember. Unfortunately, I ordered other items. I got chili on an alleged boxtie that I still haven't found yet. The chili had enough salt to preserve it until Jackson becomes awesome during the Armageddon. At $6.50 a pop, warm Guinness helped me wash down all this salty goodness. Save yourself about $70 and buy a few Celeste frozen pizzas at your favorite gas station instead."], ["John B.", "I'm from San Francisco, and had just driven up from New Orleans, so I'm used to larger cities with a lot more bars. Jackson seems pretty limited in selection of bars to me, but Fenians was a nice little gem. Really liked it."], ["Eliza T.", "One star for friendly service One star for cool atmosphere and live band.1/2 star for food...all of which were rather disgusting (boxtie and stew) or mediocre at best (fried okra)EAT ELSEWHERE, then come here afterwards for cold Guinness and hot live bands!"], ["Charles B.", "Fenian's is a very authentic, very tasty Irish pub in downtown Jackson. We had a great meal:- fried dill pickles- sheppard's pie- an irish potatoEverything was tasty & served fast! We were dining LATE so it was wonderful that they were still serving their entire menu.The live music was amazing as well! A couple of guys an acoustic guitar - they had a great sound, and really seemed to have some fans there!"], ["J. R. H.", "AOK, but I didn't get the vibe of a good Irish pub...not necessarily Fenian's staff fault, as there were plenty of them, faults and staff. Still, I was there early in the evening...no appreciable Irish pub vibe going on a Friday by 6pm...hmmm. To be fair, service was top notch, full bar, food was...well they have boxtys listed..none I've ever seen in any other Irish pub. (this must explain the reason for lack of that authentic feel). What the food was...decent, so they shoot, they score...it's in the back of the net...counts as a decent place to go. Guinness is fresh too. And did I mention the little train track dangling from the ceiling? Strange touch of decoration that I guess the other reviewers couldn't notice for reason of their much larger crowds."], ["Kristin B.", "Jackson's only Irish Pub!Set upstairs from a liquor store, it doesn't look like much from the outside. There's a balcony with some seating that fills up pretty quickly, but walk inside to a darkened pub atmosphere. There's tables and one large booth in the back corner, opposite of the stage area where musicians play for no cover price every night. The bar is, of course, a full service one. Get Guinness on tap! Also order from their menu, which is pretty big for a bar. Scotch eggs and The Bookmaker are two things I'd recommend. For desert get the chocolate mousse cake and expect to share it with friends - it's large and rich."], ["Alan S.", "For Jackson's lack of a bar scene, Fenian's Irish Pub is one of the more fun places to grab a few drinks.  It's a great place to go during the weekdays because you can usually find a decent crowd on any given night.Monday and Tuesday are solid  because of the Karaoke and Open Mic Night.   It's kind of difficult to get service on weekends because it's such a small bar and it can get overcrowded.  It usually gets way fogged out with cigarette smoke too, but if you have enough jagerbombs you don't really notice it anymore.Go with a group of friends, get there early, and snag a table and you'll probably have an awesome time.Oh yea, they serve food too..."], ["Cam B.", "I've been witnessing this place's downward spiral for several years now. Food is terrible, the service isn't much better, and the prices are too high. Place becomes a crowded college kid/ hipster hang out late in the evenings, so if that's your thing, have at it. Not a bad place to have a beer (sometimes the staff knows how to pour a Guinness properly) before going to dinner someplace else, but that's about it."], ["Troy D.", "Excellent atmosphere and food!  Go for the traditional Irish fare down the center of the menu. It will not disappoint!"], ["Emily I.", "Great neighborhood place to grab a drink and run into friends.  Most of the bartenders are longtermers, and can make a perfect cocktail/shot or just pour a nice beer.  Pretty decent live music on the weekends, and now that its non-smoking, the crowded atmosphere is not nearly as lethal.  A classic Belhaven establishment that is always a sure thing."], ["Dena S.", "Great little bar/restaurant that is non-smoking (maybe I should give it a 5 just for that!) We had Spicy Drummers, which are spicy battered fried chicken wings. They are listed as an appetizer but came with standard steak fries, carrots, celery and blue cheese. I thought the wings were decent sized and the batter didn't bother me much, as it was very light. They were very flavorful and served very temperature hot - but not all that spicy. We also had Shepards Pie, which was excellent but kind of a small portion.  It was also served very temperature hot. In any event, we felt the quality of the food was high, and we're looking forward to returning to Fenian's."], ["Joel M.", "Surprise, surprise, Jackson doesn't have a nightlife. But wait, an Irish Pub! That must be good. Nope. If you want to eat low quality food prepared hastily and with 12lbs of salt per serving, this is your place. Gentlemen, Ireland is about 4000 miles northeast. Give it a visit. It will only help us all. If your not hungry and just want a Guinness, stop by the ATM first because they are $6.50. Staff was very nice and plenty of parking."], ["Shawn L.", "Good food. Great atmosphere. Great music. I love the train set!"], ["Jean W.", "Great Food. Cool atmosphere. Model train runs in ceiling. casual dress."]], "Majestic Burger": [["Michelle G.", "My family and I come to Majestic Burger quite often, and by quite often we mean EVERY weekend. The food never disappoints and there is so much variety that you're ought to find something for you!I, personally, get the fish sandwich with blackened salmon. You'd think a place called \"Majestic BURGER\" would only be experts in burgers, but actually they're experts towards EVERYTHING. My salmon is always so moist and full of flavor! Not only do we come for the food, but the lovely atmosphere and staff. The waitors/servers are ALWAYS so kind & welcoming. I want to specifically mention a lovely young man that goes by, CW. He ALWAYS takes us under his wing when we enter, he knows our order by heart, we have lovely conversations, and he calls us \"his two favorite girls.\" (as my mother and I come a lot) We love and adore him so much, and he makes our lunch or dinner much more wonderful!KEEP UP THE GOOD WORK MAJESTIC BURGER."], ["Emily S.", "Not sure if this place closes at 9:30 like Google says or 10:00 like it has on Yelp... But when we came in there at 8:45 we could tell our business would not be appreciated. Almost all of the workers gave us dirty looks and once we placed our order my friend heard the cook complain about how it was 8:45. So we decided to cancel our order and leave. We have been here plenty of times before and had good experiences until now. Won't be returning for awhileMr. Sandifer,It was Thursday Oct 1 @ 8:35 pm when we came in the restaurant."], ["Jonna B.", "I thought the atmosphere was really cool, but that's not what I came for. I came for a majestic burger, and that is what I did not receive. The waitstaff was a little on the rude side, and I could see them making fun of customers. Their burgers were far past well done and my husband's bun was hard as rock. They did bring him a new bun, but it wasn't much better. The only saving grace was the onion rings. They were delicious. I probably won't return, at least not for quite some time."], ["Hal R.", "My wife and I really enjoyed this place. We essentially got the same thing by building our own. Both of ours consisted of a fried egg, bacon, and a sourdough bun. The buns can be huge so be weary if you don't want a face full of bread. The friend egg and bacon combo is definitely the way to go. We also had an app of fried pickles. Apparently there is a \"half order\" that doesn't show on the menu. If there is less than four of you, go for that. You'll end up with a pound of leftovers. The staff was friendly and helpful. It looked as if they needed some help though. I'll be happy to make a return trip."], ["Philip D.", "Ordered a burger and fries to go. Was staying at Springhill Suites. Hands down the worst prepared French fries. Soggy and limp. I would recommend cooking a little longer. Burger was ok."], ["Leslie W.", "Wow. This experience was so not what I expected to be. What I expected was ordering a delicious burger at a counter and having a seat. First, you are seated. My first question to my friendly waitress was if they make their veggie burgers. Apparently, they don't make any of them. The patties are ordered. Bummer. I decided to go with the turkey mushroom swiss with a side of the Greek seasoned fries. I think the best part was the bun. While I did like the Greek seasoning, the fries weren't great. Both the burger and the fries were underwhelming for $13. My friend got redfish tacos. While the strips of redfish were a nice size, it's unfortunate that even the more entreeish options don't come with a side. I don't feel moved to go back. There are several better burger and casual dining options in the area. The quality of the food is not in line with the price point. I do want to give my waitress credit for being really nice. It's a cool atmosphere."], ["Cris W.", "As a resident of Cordova, TN, we have access to a great many offerings of burger in the Memphis area. That said, we tend to be burger snobs. This is the only reason I'm granting Majestic 3 stars instead of 4.While the meat on Majestic's burger is 'pretty good', it's as good as most places - average. However, the bright spot about their burger is the BREAD. The sweet sourdough is absolutely fantastic! And, IMHO, the bread makes the sandwich. Any ole subpar meat would have been good in Majestic's sourdough. If we were local, I'd be identifying their bread source to buy it myself. If Majestic would invest in top quality beef and charge a bit more for the sandwich, their offerings would be phenomenal.We had the fried portobello and pickles for appetizers. Both were great. Not too salty as is the case with pickles, generally.Service was friendly & prompt.We will return, but not for the meat. It will be for the bread."], ["Elizabeth G.", "Bad service, good food! The food keeps me coming back, but the service disappoints me every time. If they covered their bases, the restaurant would be a knock-out! (Managers, are you listening?)The fried portobello bites are tasty and served with an onion-blossom type sauce to dip them in. The burgers are great, but be careful about the bread. I got the wheat bread and it all fell apart on me. I tried the sweet sourdough and it's similar to Hawaiian bread. This last time I got the new york chicken sandwich with pepperjack cheese, bacon, and avocado with a side of sweet potato fries. YUM!"], ["Rabun J.", "I eat here pretty regularly for lunch and it is always good. You have to get the sweet potato fries!"], ["George H W.", "Really disappointed with the fare tonight. Treated guests to a meal and the only thing majestic tonight was the ticket. The fish taco shells were hard and cold. The blackened red fish was hard and dry. Seemed like the ranch dressing was watered down. In summation I was sorely disappointed. Not up to the standards which Majestic Burgers had cultivated on previous trip. Don't know if there has been a change in management or the staff was just tired after a long day, but Majestic will not be on my short list for casual dining anytime soon. Oh and I  might add that the Burger was considerably less than majestic."], ["Tho,as E.", "Bad experience tonight at a restaurant I usually enjoy. Ordered take out and brought home a burned and inedible mahi sandwich. It's a $12 sandwich so I called and returned for a replacement. There was no apology, no offer of a refund or some other comp that most any restaurant would offer to someone inconvenienced enough to return takeout. I showed it to the manager because it really was ridiculous that the first sandwich was allowed to leave the kitchen. He offered some lame excuse about the seasoning causing it to burn on the outside which doesn't explain why it was over cooked to the point that it was gray and completely dry. And certainly doesn't explain why they went ahead and served it to me anyway. The excuse for the extremely small size of the filet was that their supplier sent it to them that way. Still no word on why they served it. When they get it right the place is good, but consistency is lacking as is the ability to make it right for an unhappy customer.  A burger place can't get by on a really good bun. It matters what's in the middle."], ["Peter C.", "Very mediocre! Slow service and poor food. Overly battered fried mushrooms. Mini-burgers were covered in a too sweet mayonnaise. I will not go back."], ["Nolen G.", "We have been enjoying Majestic Burger on Sundays for lunch after church.  We have a pretty large group so I have been able to sample lots of different items on the menu lately.I am putting together at top sammich list in Jackson and the blackened red fish was recommended by a friend who knows their stuff.I grabbed one and wrapped it in the famous Majestic Burger sweet-dough bun and added a side of sweet potato fries.  I had my Redfish blackened for the sandwich and had it dress like they recommend.  The fish was perfect and the bread was awesome.  I really like this bun.  That said, next time I order it, I am going to get the wheat bun.  It is the same size and shape with a sweet flavor, but I like the texture better and I think it will compliment the fish better.Other big positives around the table for the Cobb Salad.....my Dad says it is the best in town and he eats a lot of salads.  My wife loved her burger with Wheat bun and jalapenos.  I had a 1/4 of it and I agree, it was cooked right and very tasty.Lastly, the location and service are great. I love the small bar and the decor.  Nicely done."], ["Matthew H.", "My dining companion was extremely happy with the portabello sandwich (on sweet sourdough). I had the blue cheese burger (which was a bit small). Our two sides were the fries (ample portion) and onion rings (stingy portion). Overall, it was a positive experience, and I'd recommend Majestic over your local Five Guys.One note for those who like it bloody, they only serve their burgers one temp, medium well."], ["Kayla R.", "Food is ok. Fried pickles are great. Make sure to get your burger on sweet sourdough. Really good. Only complaint: they need more help. Three times. Slow service (on non peak times) every time. Get it together, guys. Sad because the food isn't bad."], ["Gary S.", "Poor service. Had to ask to get order taken and then had to ask for the drinks we ordered. When we got the drinks at least 2 of them were wrong. Cannot recommend this restaurant"], ["Braxton B.", "Food was good, hot made fresh. Service is quick and attentive. Expo is in the dining area so food is delivered fast and accurate. Business is steady during peak lunch and dinner hours. No Veterans Day Specials of any type, kinda strange for a burgers and bar joint, but c'est la vie. Large TVs give a sports bar feel, but it is more of a grill than bar. Portions are healthly, but not too much. Food tastes fresh. I come here often for lunch during the work day."], ["David B.", "When you're at a place called Majestic Burger, how are you not going to order the Majestic Burger?So that's exactly what I did. Making certain my burger would be as majestic as possible, I took the waitresses's recommendation on their most popular bun, the sweet sourdough.The sweet sourdough bun was soft and tasty with just the right hint of sweetness. The burger pattie tasted like good meat and the comeback sauce did not disappoint. I also enjoyed my side of sweet potato fries, which were sliced long and thin. Solid meal overall."], ["Chris G.", "If you've never been to Majestic Burger, then you don't know what you're missing. Go try the Portobello bites -- they're SO GOOD! Had I known how good they were going to be, I wouldn't have even bothered to order a burger!"], ["Anthony T.", "I'm going to start with how good my burger was and how close it was to my hotel. Those two thing are worth 5 stars but service is worth -5 stars; yes the rating system need to change. The young lady was working really hard but she need help, they had 3 hostess just sitting folks will people are waiting to order is one problem. I ordered ketchup three times before I didn't get it and yes I ate the worst fries on the world without ketchup. Yes, I was tired and hungry and didn't want to go anywhere else except sleep. This place was packed and will continue to do well until they have some competition or until people demand better service and I going to start by not visiting them again. That's really said because the burger was really good and Ashley was really working hard. She needed some help; so I guess management chose $$$$$$$$$$$$$$$$$$$$$ over customer service."], ["Kristen M.", "I was very disappointed with the service at majestic burger. The manager (Ashley Lewis) was incredibly rude. We simply asked to change a television channel and were told very aggressively that it was impossible and that's just the way it is. It was a simple request that was met with lots of hostility. Having been long time patrons of majestic burger this level of rudeness was startling and we will not be returning."], ["Gigi G.", "Great food and service.  Bar tender was knowledgeable and provided great recommendations. The Texan burger was great"], ["Amy P.", "Salmon BLT on wheat with avocado is where it's at! The loaded fries however are far from loaded but maybe Pluckers has just ruined this for me."], ["Shelley W.", "Good service and good burgers.  My burger was a little rare but they fixed it right away.  Will eat there again."], ["Rob B.", "A very good burger, in an area where good burgers are not hard to find.  Service was great and fast.  It was a little loud, but, it was lunch rush and they were very busy!  I suggest the \"Texan\"!"], ["Melissa H.", "We were pleasantly surprised at the food options offered. We both had salads which were very fresh and the dressing tasted like it was homemade.  My burger was served on an awesome wheat bun and my boyfriends fish sandwich was better than expected. I would recommend!"], ["Will R.", "Burgers were really great, but our service sucked. We both thought our waiter looked like a cool dude and would be good, but after our initial introduction it all went down hill! We both ordered a Make-Your- Own Burger, I ordered mine with avocado and an egg. After a couple of bites I noticed I did not have the egg, so after waiting about 5 minutes for our waiter to come back by I pointed it out to him, he took my whole plate (actually a basket) to the back and a couple of minutes later emerged with the exact same burger (complete with the bites missing) with an egg added to it!  To me, this was just adding insult to injury! I understand not wasting food, but its kind of disgusting to think what may or may not have been done to that burger in transport, Kind of like watching you food be delivered to the wrong table and then the pick it up and bring it to you! Another thing we noticed was that the Waiters and Waitresses would stand back in the corner, by the drink machine, and just congregate, laughing and messing around! It is just unprofessional to do this out in the open in full view of everyone eating here, not to mention when we needed our waiter, he was hanging out here and not paying an attention to us! I also believe the burgers are slightly over-priced for what you get, they are really good burgers and I'll maybe be back but just a little over what they should be priced at, the additions that you can add to a burger should also be a little less, if I got a burger the way I really wanted it would cost me about $20 for 1 burger!!!"], ["Megs M.", "This food was delicious. But the service was HORRIBLE. We had a few(6 burgers) togo orders from our office. From start to finish the service was rude and offensive. Not only was I told several times over the phone that \"I would just have to hold\" BEFORE even taking my order, but on several occasions I, the co-worker who picked it up, and the co-worker who called regarding the item left off were spoken to as though we were inconveniencing her(Ashley). We later discovered that she is actually the manager. Usually we allow for the fact that we are calling in a LUNCH order. However, when my co-worker arrived the restaurant had barely anyone in it. She then waited on the food for at least ten minutes and the entire time it was sitting behind the counter. When she approached Ashley to get the orders, she was again told that she would \"just have to wait\". When something was left off of our order we were told they don't do refunds. Our Business will NOT be ordering from them again, small or \"large\" orders. They have lost us as customers."], ["Baron M.", "I stopped here to grab some take out on the way back home since the location nearest me is closed on Sundays. I was very impressed with the speed of getting my food and I was doubly impressed when, 15 minutes later, I got home to find everything was still pipping hot and tasted great. I can't really rate them on their restaurant, but just sitting there for the few minutes I did, I found it to be very clean, with a friendly staff, and it appears to have a full bar!"]]}