{"Wraps": [["Greg M.", "My son Noah Munck saw this place when a group of us here from California for an event stopped at Starbucks.  Wasn't sure what to expect.  By far the best Chicken Gyro I have ever had.  Noah said his Lamb Gyro was ridiculously good and his best ever.  So... just go!"], ["Ryder T.", "It is an experience to go to Wraps. For instance, a while back a little controversy erupted when the owner made some anti-Semitic comments to a local Rabbi. They apparently made up about it and so it is safe to go there again. I was excited, because the food was sloppy delicious the first time I went. My most recent visit involved the owner emerging from the kitchen with a knife and jovially threatening to cut some bits of anatomy from the man working the cash register who cowered in what was probably only mock fear. This sort of banter will probably color your visit too, especially if you come with a group.Price is reasonable. Menu is limited but the quality was not what you can get elsewhere. Wraps is somewhat (or used to be) entertained with another greek restaurant in town, Krilakis, but I am not sure the relationship anymore. You may be better off finding Krilakis (it was in \"downtown\" Ridgeland, last I checked).Quality has definitely declined. The lamb was *ok* but the chicken was tough. Granted they did admit they were scraping the bottom of the barrel on the chicken (end of the lunch time) but still, it was pretty bad.Service was entertaining. While they kept forgetting to bring out fries, the proprietor did come over to regale us with tales of his mother banishing him to Jackson (from NYC) (truly the Rothschilds of dingy Greek diners). He peppered this with a few colorful jokes and free dessert. That Baklava was on point. Probably the best I've had in Jackson. Of course, the unexpectedness, the freeness and the fact that I was almost hand fed it by the owner made it that much better too.However, we go to restaurants to eat primarily and the quality of the food just isn't good enough to make it. Stop by for the experience though!"], ["Duan C.", "Considering the hype behind the Rabbi's experienced at the restaurant - this update is strictly in regards to the service I received from the proprietor.My service wasn't as bad as the Rabbi's - but it wasn't downright welcoming either. I guess I was so excited behind the portions of the food I was not paying that much attention to them, as were they to me either. I'll put it to you like this - when we walked in - I wasn't greeted with an \"Hello, welcome to...........\" When I paid out - I was thanked and that was it. So in regards to the customer service I received, I can honestly say I have received better at other places."], ["Ruhi R.", "Going into the place, it gives off a slightly shady vibe. It's a hole in the wall, but while being a stand alone building. The gyros are good, nothing great, but it's good for the money. I really enjoyed their chicken gyros and fries. I would come back to this place but for takeout, not to sit. The good is a good price for the money."], ["Michelle S.", "The atmosphere is top notch sketchy. We chose to sit outside. Lady at the register didn't have change for a $20 so I had to use a credit card. Most employees were pretty friendly, but it was obvious they were Greek.  Food was okay. I got a gyro and fries-- fries were good and gyro was a little salty. Sauce was good. The only complaint about food was that it didn't have paper wrapped around it so I felt like I was eating a large taco. For drinks it was all canned drinks or water-- and soda selection's were slim pickings (coke, coke zero, diet Sunkist).I'm scared to know what their health department rating is."], ["Grace B.", "The absolute best Greek Salad I've ever had! Chicken was incredibly marinaded.  Such nice owners too. Think I just found my favorite place to eat"], ["Ann C.", "Wraps are so tasty and perfectly seasoned and cooked.  The chicken is fabulous and so is the traditional gyro.   Fries aren't the best but the salad is amazingly delightful.  Atmosphere could use a little update and deep cleaning. There is a very sweet pleasant blonde lady working in there who makes the experience even better."], ["Calvin M.", "The food is ok. It's just like any other standard Greek fast food I've been to. Really nothing special about it. All was well until I asked for some hot sauce. Turns out they charge $1 for it. I was told since they make the hot sauce on site, it's not free. That just wasn't right. And to top it off, the sauce wasn't even hot. I probably won't be coming back."], ["Chris V.", "A must visit. Don't let the exterior fool you; Wraps is a gem with great gyros and hummus. I only wish we had one where we live in Louisiana. I'd be a regular."], ["T N.", "Food is MEH, service is horrible.  They charge extra for every little thing and they act like they are doing you a favor by serving you."], ["Ben S.", "Food is as disgusting as the employees. I love Greek food and made the mistake of wandering into this place after arriving in Jackson. It's unsanitary and the employees are rude. Oh and the fries were soggy. How do u screw up French fries?!? Stay away....far away"], ["Heather P.", "Everytime we travel through Jackson we make it a point to stop in Wraps. We have only ordered the Gyros and fries so that is what I will chat about.Service is always fast, you step up to the counter, order, take a seat and in about 5 minutes your food is delivered to your table.They don't skimp here.    Most gyros I have gotten it's hard to find the feta.  Not here, you want feta you're getting it.I'm lucky if I can finish half of the gyro.Yes the place is a bit \"divey\" but it's what makes this place just cool.  Odd quotes and such on the walls."], ["Jeff F.", "Food is average at best, service is horrible. Owner does not care about customers. Feels like they are doing you a favor by serving you."], ["Edie K.", "Best gyros in town! Great salads, pita mozz, and fries. Can't go wrong with anything on the menu"], ["Chris-Amanda B.", "Delicious! Our family stopped here while passing through Jackson; we have had Greek before, but this was far more delicious. The fries were great, but the lamb wrap was amazing! Great food! Great service!"], ["Dan B.", "We found this place on yelp, while traveling through Jackson on our way from jazz fest to memphis. At first, we had difficulty locating it because there is no business name sign, only a large Greek flag that had blown over onto the roof the day that we visited.Walking in, the place is quaint.  Plastic tables and chairs grace the smallish room and there are drawings and sayings all over the wall.  We were greeted by a friendly waiter who took our orders at the cash register, and the food was brought to our table within minutes. I got the lamb gyro, while my son got the pork.  They were both succulent and deliciously moist and flavorful.  I consider my self a middle eastern food expert having had it all over the world for all of my life, and this was probably the best gyro I've ever had.  My son's was equally delicious, my first time having a pork gyro.  Mine came on a whole wheat pita, which was a nice option.We got some hummus to go, which was also great.  Would definitely recommend!!!!"], ["Amy L.", "I love restaurants that are eclectic, delicious and locally owned and Wraps fits the bill perfectly.  Don't let the appearance deter you, it is WELL worth paying a visit.  I have had the Greek Gyro and the Chicken Spanicopita, both of which were out of this world delicious!  The pitas are warm, soft and fluffy, the meats are high quality, flavorful and tender and the sauces are creamy with distinct flavors.  I will be going there often for sure.  The staff is warm and friendly and make you feel like family the minute you walk in the door."], ["Peter G.", "Atmosphere is eclectic divey. Lots of random pictures and paintings decorate the walls. Girl behind counter was basically it as far as employees. That said she was very knowledgeable about the menu and very helpful in picking out an item. I had the lamb gyro with a Greek salad, gyro was great, tzatziki sauce was wonderful. Salad had a great dressing, beware some of the olives are pitted others not so much.I wouldn't recommend this place if you have young kids. Zero booster or high chairs and extremely small bathrooms."], ["Diam N.", "much like his gyros, the owner's a sloppy mess of shit, covered in an unidentifiable white liquid, who hates jews"], ["Audrey S.", "Prices are about a dollar more expensive than what is says on Yelp. Regular gyro is $6.75 and you can't get a cup of water, you have to buy a bottle."], ["John Eung Soo K.", "Great gyro, great company. Owner is a riot. You can really tell everything is made fresh."], ["Yoori C.", "I got a mixed lamb and chicken gyro for $6.25 + tax. You order at the counter and take a seat in a booth or table. They have a bunch of pictures and interesting quotes all over the walls. (i.e. \"Red, white, and blue are the colors of freedom, except when they're flashing in your rear view mirror.\" in addition to a few others about the economy, friends, society, etc.)The place is pretty narrow and probably sits about 7 parties of no more than 4. Both meats were soft and juicy with fresh lettuce and tomatoes. The tzatziki sauce was pretty good too. I would recommend Wraps if you're looking for a quick meal at an average price. It was nice to eat something that wasn't fried for a change."], ["Beth A.", "I want to rate this place highly, I do. Nothing better than a local hole in the wall with great food right? And the food was good. And it was ready relatively quickly. But my experience was horribly bad, due to the rudeness of the worker behind the counter. She was mean, and angry. She also substantially overcharged us, and acted terribly inconvenienced when she had to issue a refund. I left with a pit in my stomach, the kind that you get after a confrontation with someone, or after you've been bullied. Yes, it was just that bad. If there had been even a hint of a smile, I'd give it 3 or 4. But when I tapped the bell to get her to the front to issue our refund, I saw and heard her yell, \"Jesus!!!\" before she came out. My husband is orthodox Christian, so that made him feel kind of ashamed that an orthodox establishment would have workers that behave that way. The really good food is why I didn't give a 1 rating. :( If mean people don't upset you like they do me, by all means go there. I'll never ever go back. So much negativity! (For reference, our visit was late January 2014, on a Friday night, so no owner seemed to be present.)"], ["Liz C.", "My husband and I are stationed in Meridian and we both had a serious craving for Greek food, gyros in particular. So after reading the amazing reviews for Wraps, we decided to go there. I'm not sure if maybe we just went on a bad day...or have eaten at enough of other good gyro places that we know what a true gyro tastes like and have become a little picky. The bread was covered in butter, making me feel like I was eating a fast food burger. The meat was extremely salty, to the point where I just couldn't eat anymore after 3 bites. Even the feta cheese I got on mine was extremely salty. I couldn't even taste the tzatziki sauce because the salt was so overbearing. There was no taste at all...but salt. I started to pick it apart and eat just lettuce with tzatziki sauce to try and let my mouth take a break from the salt over load...and even then there was no relief! We are pretty healthy eaters so maybe we just aren't used to a salt overload? Either way...we will never eat here again. The fries were not \"fresh cut\" as advertised...they were just like any other fries you can get at any food place. The thing is....the fries had less salt on them than the gyro did! The place had a nice, laid back feel to it. The plastic chairs are actually really comfy! It has a nice \"hole in the wall\" feel that we love. But that's about the only positive thing I can say. With the price of two gyros, fries and drinks at this place we could have gotten a much better meal in a nicer place. Typically the \"hole in the wall\" places have some of the best food I've ever had but this place is an exception to that rule. They have these little quotes all over the walls that I guess employees or guests write and put up, and although some were funny, a lot were not very family friendly. We don't have kids and don't care about it, but if we did have kids, I wouldn't want them reading some of the stuff they have on their walls. So, I guess if you are used to their salty gyros and that's all you know, then that's awesome. But if you've had a truly good gyro before and have a craving for one...don't go here."], ["Baron M.", "As far as the Jackson metro market goes for gyro's, this is as good as I have found. The portions are large, sometimes huge, yet still flavorful. I end up going here about once or twice a month and I always end up with the same thing - the regular gyro. To me, it is good enough that I don't really even feel compelled to try the rest of the menu, though the red snapper (I believe) gyro sounds quite tempting. The fries are generally done right, though sometimes I ask them to make them a little crispy. They come with some sea salt and a nice flavor. The inside is fun, though seating can get a little tight. I wouldn't suggest a group of more than 4. Possibly 5 if you can snag a chair from another table. Some days it can be standing room only, but they are still, generally, quite fast getting your order out. I am marking it as cheap, but it can get pricey, depending on what you get or add (I think feta is $2.50 extra on a gyro that doesn't already have it, dessert is a bit over $4 after tax, etc)."], ["Kristin B.", "This place is awesome.Wraps is a local hole in the wall Mediterranean gyro place with about 6 tables inside and 3 outside.  You grab your drinks from open coolers located by the door, or the pitcher of iced tea on the main counter. The prices reflect the setup - quite affordable. In fact I was surprised that they even took cards at the register!My brother recommends the veggy wrap - All the regular veggies of a typical gyro, minus the meat, but has fries in it instead. Strangely delicious. I'd recommend the fish gyro though - delicate fish (talapia I think?) seasoned just right and melts when you bite into your gyro. And of course the regular ol' gyro is pretty tasty too - though like Shannon says, the meat is cut kinda chunky.They're  big too - come hungry. I can't ever finish the side of fries.Wraps is located outside of the Maywood Mart shopping strip in what I believe was previous a Pizza Inn."], ["Heather S.", "Drove through here on my way from San Diego across the country.  Without making any comment on the very modest interior design of this place, I have to say this is the BEST hummus I have ever had in my life, even in Greece. Was disappointed there was not more vegetarian on the menu, but understand this is not California.  The hummus made up for everything."], ["Arthur M.", "Real good wraps and real weird inside."], ["Jared M.", "We were on a road trip and found ourselves pleased we chased this restaurant down. I wish I could give you more. Next time I am driving through I will try this place again."], ["Dimi J.", "We were out of town and stopped by because of the good reviews. First if all, this place is hard to find. Its directly behind the Subway and not visible from the road. Place is small maybe 10 tables inside. Cool greek music. We got the food to go. The food was very good. I had the gyro salad and it was great. Highly recommend it. They should really consider using the Romaine lettis. I was very happy with the overall experience especially for the price. $11 for large gyro salad, fries and side of sauce on dinner menue. The lady at the counter was very nice."], ["Carlos G.", "Great food entertaining interior.  Can't go wrong."], ["Tom J.", "Great gyro and fries.  Only downside is the bread could be a little less moist."], ["James H.", "Huge tasty gyro. Ill be back. Good place to take out."], ["Dave W.", "He turned me down for the lunch special that ends at 2 pm. It was 2:00 on my phone and 2:02 on the wall clock. Bad business decision especially since he knew I was a new customer. Really great food though, so I gave it a good review."], ["Michael H.", "Wow!  I had the Yianni's and it was da bombdiggitty. Also, Greek salad was perfect!  Its a small little restaurant that has some funny quotes all around.  So while enjoying what I thought was great fast greek food, laugh at the sayings or log onto pieceofourpie.com for a smile."], ["Lawrence Z.", "Yanni's gyros and wraps are the BEST!I recommend the TJ's, and the shrimp gyro."], ["Shannon N.", "This tiny little hole-in-the-wall is wonderful if you like gyros.  The atmosphere is definitely a mom-and-pops kind of place.  Full of pictures of Greece, and lots of quotes/sayings posted on the wall.  It has limited, but comfortable seating.The gyros are great.  Portion-wise, they are quite large.  The meat in the gyro is flavourful and the tzaziki sauce was not over garlicked like many other places I have been to.  The pita is not like a flimsy pita that is typical in Greek-American restaurants.  It was slightly thick and slightly sweet.  It was a nice slight addition to the rest of the taste  The only drawback to the gyro is the size of the meat.  Most gyro shops slice their meat into strips, whereas the meat is chopped into small pieces.  We also had an appetizer of melted cheese in pita.  It had feta and mozzarella melted, with a surprising touch of basil.  It was wonderful warm, but when it cooled the mozzarella cooled and hardened.  I suggest eating this as soon as it reaches the table.Overall, the food was pleasant, but portions are huge, and the atmosphere was homey.  Would return again."]], "Krilakis": [["Linell B.", "I work just a few buildings down from Kriliakis and it's my go to \"oh man I'm hungry and forgot to pack a lunch\" spot.Just about every time I go I get the lamb gyro and I've never been disappointed. While I'm not exactly a gyro connoisseur, Krilakis's is the best I've ever had. It's a little messy, but that's part of the fun.I've never had the hamburgers, but my wife and mother have had them and loved them. They take a few extra minutes to come out because they're freshly ground and made as you order then, but I'm assured it's well worth it."], ["Jennie B.", "This is not the most authentic Greek restaurant, but for Mississippi I believe it's the closest I've tasted.The lamb is always fresh, food is cooked to order and they are super friendly. I have had the burger, it's not out of this world but it is good. I usually have the lamb gyro without lettuce and tomatoes. It comes packed with lamb and the Tzatziki is above average, however I think it would help to put it on the side for to-go orders. The warm lamb made the sauce warm and it lost some of its freshness.For the serving size I think the prices are spot on. Their fries are homemade from fresh cut potatoes, I love that!Overall, I definitely recommend this place for a quick friendly taste of Greece in the Ridgeland, MS area they fit the bill.."], ["Andrew C.", "Yooooooo. This place right here, it's that crack! My and the roommate were lookin for a place to enjoy some good eats on a Friday night. He had eaten here before and suggested it. I'm so glad he got me hip to this place. The lamb gyro was on point. Best lamb gyro ya boi has ever had. I'll definitely be back. They've gained a loyal customer."], ["Lauren C.", "Love love love this place!  We've been going here since they opened in Byram. They are in Ridgeland now but we make special trips out there just to get salads. Always super nice people and the food is always awesome. Never had anything I was disappointed in."], ["Paul P.", "Clearly, this is not run by a Greek family, because nothing is made on-house, or authentic.I got the hummus and pita starter, and they both looked, and tasted, like they were from a grocery store. The pita's were really think and had been toasted so that the edges were almost crisp, and the hummus was so thick, and not whipped at all.I also got the gyro and salad combo. The salad had two olives, and had thinly sliced soggy tomatoes. And it was saturated in dressing, rather than just drizzled and then tossed to get a good coating. And the gyro was just not very flavorful. It was about as bland as the hummus, and tasted more like onions than anything else.I travel every week for work, and absolutely love Greek/Mediterranean food, and eat it probably twice/week while I travel. This was a huge disappointment."], ["Jonna B.", "Krilakis is one of the better gyros I've had. The one downfall, and this is strictly personal, is that there is SO MUCH FOOD in such a tiny foil package that it's hard to handle the gyro gracefully. Every bite will leave your face covered in tzatziki sauce. Their pita melt is also a good choice for an appetizer. It's loaded with ooey gooey feta and mozzarella cheese. Really, everything I have had is good. The staff is always friendly and the food always comes quickly. They have a nice outdoor seating section that is shaded (which is a huge deal in this Mississippi heat!) and plenty of space inside as well. If you find yourself this particular area of Ridgeland, definitely give Krilakis a shot."], ["Gary S.", "Best gyro I've ever had! I've never had lamb this tender. I went with a group for a mid-week lunch and everyone was very happy with their meals. I had a small greek salad and an original gyro. The table also shared hummus/pita, fries, and baklava (we were hungry!). Everything was amazing, except the hummus was a bit dry. Service was friendly and although it was busy the food came out quick. They have a nice menu with salads, burgers, appetizers, and a large selection of gyros from traditional lamb to chicken, pork, etc.  Toppings, pita bread, meat was all very fresh, very flavorful. The restaurant is clean with plenty of seating indoors and a small, shaded patio outside.  This has to be the best Greek food I've ever had, and I travel a lot! I can't wait to get back for another lunch... maybe tomorrow."], ["Chris M.", "Pretty decent and served the purpose for a quick stop on the way to New Orleans. The lamb gyro was good if unremarkable. There is a write up of the place that talks about the tzatziki sauce being really good. Umm, ok, not really. Couldn't   taste it on the gyro as it was so mild. It was a decent overall though and seemed to be fresh. The hummus to me did not taste fresh and wasn't very good. I would not order it again. Decent place though for a quick stop.  The staff was very nice and the food came out very fast."], ["Mallory L.", "Always delicious! Usually do takeout and Get the veggie with cheese. But no fries too much carbs with them. The only complaint I have is that sometimes the pita is doughy inside. But something I can look past for the most part. Parking is sometimes difficult especially during lunch time since it's right off Jackson avenue. Great place! Definitely one of my favorites for a quick bite"], ["Phil H.", "I was very pleased with the food and the service.   Great place. Great atmosphere.  Great for kids. We will be back. JC Gyros and Hamburgers."], ["Scott H.", "I usually do not like reviewing places on just one visit. However, since I do not live anywhere near here I am going to go ahead and do one. Basically, I found this place via Yelp and it's really good reviews. I went in and ordered the combo that had a Lamb Gyro and a greek salad. The Greek Salad tasted pretty decent and the Lamb Gyro left quite a bit to be desired. The meat tasted almost unseasoned and the sauce they put on it did not have much flavor like I am accustomed to. Also, I asked that they add Feta cheese to the gyro. They charged me $1.50 to do so and put none on there. That really rubbed me the wrong way. I pointed this out to the girl at the front and she got me a small ramekin of it. It was actually some of the strongest feta I had ever tasted. A little too strong actually. Other complaints I had were the fact that there was only 1 other table that had occupants in the place at 7:15 yet the floor was dirty with food and straw wrappers that were on the floor. There is no excuse for that in a slow restaurant. The unsweet tea was also terrible as it tasted like straight up water. They also charged my AMEX for a drink that I never requested as well. The total came to like $16.00. I left very full, but the food was not that great at all. Had the food been priced at about $10.00 I may have felt a little better about it. Sure my company was paying the tab but I spend company money as if it were my own. Another turn off was the place was crawling slow yet my Gyro came out within 1 minute. It was warm which means that everything is precooked and just sitting under a heat lamp or above boiling water or something. Basically it is definitely NOT prepared fresh. Based on my experience, I am giving it 2 stars which is pretty generous. Apparently many folks think they have awesome burgers. The other table that was occupied were eating burgers and they did look pretty good. My advise is to go with one of those because they have to be better than the gyros. If I come back to town I will definitely not be back."], ["Sam P.", "Whenever I want to grab myself a salad, I always choose this place. The meat is perfectly grilled, and their salads are a #1 pick for any meal!"], ["Steven C.", "My first trip here was great with a fresh greek salad. My second was horrible. I called ahead for a gyro combo and was told it would be ready in 10 mins. I arrived 10 mins later and waited 15 more for my food. Every time the kitchen door opened the \"cooks\" were just sitting around talking and joking. The girl who finally helped me was really rude and short. The actual food was bad. The gyro meat was super soft and soggy. I love gyros but couldn't even finish mine due to the texture. Fries had good taste but were very stale."], ["Andrea S.", "It was okaaaay. My Salad was way overdressed.  Gyro meat was thin and crumbly.  I ate all my food, but wished I went to Keifers the whole time. Servers were not in uniform making it difficult to figure out who worked there."], ["Max P.", "Being that it is only a block from my house, this place is by far the best Greek restaurant in the Jackson area! If you want to be blown away, go ahead and try the Greek Chicken Salad. Also, you can bring your own beer and wine."], ["David O.", "I won't keep this review long. All I have to say is that this is hands down the best Greek food in the Jackson area. It's a small restaurant, good atmosphere, and very reasonably priced. Staff are great too. If you like Greek food and you haven't eaten here, you should plan a visit."], ["Ross H.", "Probably get take out from here at least once a week. I've had at least one of every gyro and they never disappoint. The only problem I've ever had with this restaurant is them forgetting to include tziki sauce in my order. By far the best Greek restaurant in the Jackson Metropolitan area."], ["Brandi S.", "Great place for lunch or a casual dinner. Order at the counter and choose a seat. They have a patio near a fountain that made for a very peaceful lunch. The staff was friendly and the restaurant was clean and nicely decorated. What sold it for me was the food! The gyro and fries were really good!!! Fresh, perfectly seasoned, and large portions for less than $10 with a drink is a steal. I will certainly be back and maybe even take advantage of the BYOB offer"], ["Missy L.", "I disagree wholeheartedly with the other reviews.  My lamb gyro was closer to authentic than I've had in a long time.  The lamb was chipped or shaved rather than cut in strips.  The tzatziki sauce had the tang of greek yogurt with grated (not diced or minced) cucumber."], ["J O.", "The reviews don't lie. This place is my new go to Greek joint. It's also BYOB which is good for the cost conscious. The gyros are great. I prefer the melted feta from Kiefer's but this is much closer to my house. The parking doesn't result in door dings like the poorly laid out lot at Kiefer's. Also, the bum factor is non-existent at Krilakis. The burger is excellent with great bun but will come after your guests who order gyros. I'd prefer all plates to arrive at the same time, otherwise you watch people eat. They have a gyro combo with fries and soft drink which is very reasonable at around $9 before tip. Speaking of fries... They are worth the trip as well. Perfectly cooked and seasoned with sea salt. My wife doesn't care for their veggie gyro with the fries in it though. Overall worth checking out if you haven't and immensely better than Kristo's which is close to the same area."], ["Mike B.", "My son and I stopped in on the way home from Middle of Nowhere Mississippi to wait out rush hour traffic and to stop the pleas of \"Daddy, I'm hungry\" emanating from the back seat.  I'd eaten at Krilakis in the past, when it was located in Byrum, so I was confident that it was as good as I remembered.  While everyone raves about the burgers (and trust me, they are as good as their reputation), I was in the mood for Greek.My son is a huge fan of \"dip\", so I ordered the hummus. And as a cheese lover, I had to order the pita melt.  Pita bread, mozzarella and feta? Perfection.  For the entree, we chose the mixed gyro. Given a choice, K would have had just chicken, because that is his default food selection if pizza is not an option.  The food came out promptly, and the hummus was by far my favorite. It is the perfect consistency, and the seasoning is spot on. Not too salty, with just the right amount of garlicky goodness.  The gyro came with a mound of hand cut fries, which K promptly dunked in hummus.  While it is not your typical culinary combination, it seemed to work well for him. In short order, the hummus was decimated, and there was a huge dent in the aforementioned mound of fries.  The pita melt was hot and cheesy.  My only complaint is that the feta didn't come through quite as much as I'd hoped.  Mozzarella is a wonderful cheese, but very bland in comparison, so I'd hoped the feta would provide a little more bite.  Still, it was good and I would have it again.The gyro was almost an afterthought after making our way through everything else.  But what a pleasant afterthought.  The pitas are soft and delicious, and the tzatzki creamy and delicious.  It's always an added bonus when proportions are done well.  Often, gyros are drowning in sauce and it becomes a bit of a mess.  In this case, there was just enough to get the flavor in each bite of the grilled chicken and lamb laden pita. Overall, it was a great meal, and some of the best Greek food I've had in the South. I'm sure there are better places out there, and I know for a fact there are much worse. Two things kept me from giving Krilakis five stars: the lamb and chicken were a little dry for my taste, and the decor was a little lacking. Barring the menu and a few odds and ends on the wall, I could have been in Anycuisine USA. Perhaps it's just me, but I like to see a bit more character in local establishments"], ["Ben R.", "Delicious gyros and salads, but the burgers are horrible.  I have eaten here several times and plan to come back, but I will stick to the gyros.  While they are delicious, the burgers, which many have praised, are dry, unwieldy, and tasteless.  Possibly one of the worst I have ever had.  Sorry y'all."], ["Nolen G.", "I was told I had to go by Krilakis to try the burger.  Greek place for a burger?  Well, the source of the tip is a highly reliable foodie so I took her advise and rolled in last night and ordered the 2 cheese burger.  Feta...mozzarella and about a 1/2# burger.  I'm in.Burger came after the appropriate time it takes to cook a 1/2 pound, hand formed patty of raw chuck into a 1/2 pound of perfectly cooked ground goodness.The bun.  Oh man, the bun.   Ever had that sweet bun at Mugshots?  Take that bun and make it 3x better.  It is the daddy of sweet buns.  Not too sweet, not too big, just right.  I asked the owner and he said the buns come from a bakery in Texas.  I like Texas.  I like these Texas buns.Cheese was great and not overpowering at all.  Perfect and I highly recommend it.As for the Greek food....truly the best Hummus and Pita in town that I have had (and I have been to most of them)My wife had a Chicken salad and I am sad I did not get a picture.  Large, fresh and the meat was plentiful.Kids got the Pita Melt (awesome) and the Jr. KC..which is a small chicken Gyro without onions.I was hoping we would have leftovers but we mowed it all down.  I did not get the fries but they looked great.This burger is SOLIDLY in the top 5 under $10 burgers in town.  I will have to go back for another, but I will say, you will NOT be disappointed."], ["Jesse M.", "Wasn't impressed. Sorry but the Gyros were OK but I expected more for a 5 star rated place. Went there for lunch and there was not a crowd, only about 3 other tables. Food was fast and service was good but nothing spectacular. The fries were limp and undercooked and the Gyro was runny. I don't know maybe I caught them on an off day. I felt the gyro was rather flat tasting and didn't have anything really good going on. It wasn't bad at all but it wasn't the best either. I may go back but I am going to explore other options first."], ["Lauren D.", "Where to start? I started eating here with my husband that loves gyros. I was never really a fan of gyros, so I always got the burger. Best burger ever. One day I tried my husbands gyro and it was amazing. I can no longer get a burger because the gyro is just a must have! Service is always great. I highly recommend krilakis!"], ["James B.", "My daughter recently started working near here.  I was visiting her and yelped to see the restaurants in the area.  Krilakis came up and thank you yelp.  First, the hummus is very, very good.  Next, the burgers are as described in the other reviews.  Worth the wait and among the best in Metro.  The gyro meat is very good whether on a salad or in a pita.   Friendly staff.  It is BYOB for some reason but don't let that keep you from going.  Go and enjoy."], ["Michael A.", "One of the best burgers I've ever had at any price.  The fries were amazing too.  My daughter and I had the two cheese burger."], ["Scott M.", "Quite possibly the best burger of my life! The patty was probably an inch thick and cooked perfect! Delicious!! The fries were hand cut and awesome! I WILL be back for another Krilakis burger!!"], ["Sarah C.", "The reviews don't lie. Awesome burger. Great salad. Fries were excellent. We are still talking about how much we enjoyed dinner three hours later, which is what prompted this review. Thanks for the great meal."], ["Matt S.", "Krilakis might not look like much from the outside, but the food is outstanding. The gyros, salads and even burgers are great, and service is fast and friendly."], ["John L.", "One of my favorite restaurants in Jackson(okay, Ridgeland, but I'll forgive them). The menu has great choices, but I always get the krilakis gyro. It's superb and unlike other restaurants isn't just a cloan of kiefers. The French fries are great too. AND best of all you can bring your own wine. Only complaint is they use Styrofoam cups and plates for their salads (more of an issue on the salads, but real plates and cups are always much nicer to eat and drink from). It's always clean and the service is usually pretty quick even for a casual restaurant like this."], ["Will B.", "Krilakis is the BOMB! We first discovered this place when it started out in Byram, MS, but we are still loyal Krilakis fans even after the move to Ridgeland. The food is PHENOMENAL. The owner of the place is a super nice guy, proud of his quality business (every right to be proud!). Though Keifer's may have more atmosphere, if you are looking for great Greek food in the Jackson/Ridgeland area, I don't think you can beat Krilakis."], ["Dustin T.", "surprisingly good greek food for Mississippi.  I thoroughly enjoyed the gyro.  Can't say enough good things about it."], ["Matt M.", "Since we have moved here this place has been a regular spot. There food is always fresh and made with wonderful favors!! A must visit"], ["Mrs. M. J.", "Do yourself a favor and GO! BEST Greek place, by far, I've ever been to. SO. GOOD. Fresh, soft pita bread. Rich, flavorful, perfect hummus.  Mozzarella and feta pita? Perfection again. In fact, everything was perfection. My husband got the lamb gyro salad with the most tender lamb he's ever tasted.  I got the mozzarella feta burger and every other burger from now on will pale in comparison.  The bun is huge and soft and sweet, and there's so much real FLAVOR. Please go."]], "Bill's Greek Tavern": [["Merritt L.", "Classic!!if you get take out, Bill gives you almost 3 servings of fish... and that's only the fish.I'm not a fan of the vegetables, but the salad is awesome.\"God Bless America!\""], ["Steve P.", "What a treat...this place has personality; you are met with \"God Bless America!\" and something about speaking Greek.  Gus puts a smile on your face and the team kicks into a high level of efficiency!  Now on to the gastronomical portion of the rating; my #1 question with every restaurant is always, \"what is the absolute best item on your menu?\"  As noted with others--the answer was \"tilapia.\"  So I went with it, to go, I might add.  I was asked if I wanted something to drink so I grabbed a beer, never thinking the food prep would outpace my beer consumption pace.  Think again at Bills!Quick, focused and when I unbundled my bounty at the Hilton I was pleasantly surprised with the volume of fish, as noted by someone else--three servings plus a couple shrimp.  The tilapia was excellent...veggies are good fillers, nothing special, the salad and the \"Comeback\" dressing were great!  I spend lots of time on the road, I very frequently depend on Yelp for guidance...no let down here.  I will be back!Ciao"], ["John D.", "I went there for lunch, it doesn't look I much on the outside but on the inside the food was great.  I had the Tilapia and shrimp dinner, huge proportions with a great taste.The atmosphere was fun and laid back, thumbs up to Bill."]], "Athenos Greek And Lebanese Restaurant": [["Edwin G.", "Great food. Highly recommended if you're in the mood for Greek food. Fresh and delicious. Best Greek in Madison"], ["Harvey S.", "Not bad, quick service, and a few menu items that aren't on any other menus for Greek food. Will update when I try the other items."], ["Meghan K.", "Best Greek in Madison! This place was seriously delicious. I got the chicken shawarma and my husband got the shrimp kebobs. Both were seasoned really well, and the portions were huge for the $$. Loved Kristos, but this place is definitely my new fave!"], ["Kim C.", "So glad there's a good Lebanese restaurant here in Madison now! They have a great menu, we had the kibby, meat grape leaves, chicken schwarma and gyro plate. The Lebanese iced tea was also very refreshing. The service was excellent with a great family friendly atmosphere! Will definitely return!"], ["Rachel T.", "We have been to several Greek Restaurants around Madison & Jackson & this by far is the BEST !!  Lamb Shank was tender & fabulous!!  Keep it up !!"]], "Aladdin Mediterranean Grill": [["Rachel P.", "If you're looking for Greek or Mediterranean food in Jackson, your options are sadly kind of limited. Don't be bummed though, because Aladdin is nestled right here in the heart of downtown Fondren and it is one of the best dining experiences you can have in town!Let's start with the atmosphere. Walking up to Aladdin's, you'll walk through the front porch sitting area first. If the weather's nice, absolutely grab a seat here! It's such a pleasant place to sit and there are several tables as well as big comfy seating as well. If you choose to sit inside, you'll have your choice between lots of tables as well as some cushy booths as well. It's a small space, but if you've got a group of friends, they're always willing to push some tables together. I've walked in with groups of eight or nine before and had no issue getting seated pretty quickly. The servers are typically really nice. I've been here dozens of times, and I've had maybe one or two dining experiences in which the service was a little lackluster. That's not to say the server wasn't friendly or attentive though! Like I said, they're all usually super nice and the food gets delivered to the tables really quickly.About the food... Omg. So good. This is authentic Mediterranean cuisine, for sure. I love that it stays true to it's Mediterranean/Greek roots while still being a true Jackson, local spot. You can get a sweet tea with your hummus, and you won't be disappointed by either. The homemade falafels are my favorite thing on the menu. The falafel plate is vegetarian and comes with rice and veggies. It's plenty of food for one person and so good! The homemade hummus is reeeeally good and it comes with most dishes. They'll bring you some fresh, warm bread to go with it. YUM. Other excellent dishes: chicken dolmas (served hot!), beef schwarma, gyro, lamb kebab. Everything is so good! And the menu is huge. I could come here every day for a month and not get bored. The desserts are really great too! Get the tiramisu to split with friends. Or get one all for yourself! Oh, and it is super reasonably priced! You can get a gyro for $5. The falafel plate will run you about $9. The most expensive items are the lamb dishes, but even then, nothing goes above $20. NB: This place does NOT serve alcohol, but they do let you brown bag which is so nice! You can grab a bottle of red wine across the street at Fondren Cellars and enjoy it with your meal with some friends. Talk about a perfect evening!"], ["Jeana S.", "Hands down the best Mediterranean in Jackson! The food is always super fresh and delicious. I really enjoy both the chicken shwarma and the dolmas. Another reviewer mentioned this, but I'd like to reiterate that their dolmas is served hot unlike most places. But now I won't eat it any different way! Most plates comes with rice, hummus, and a side salad. Their meats are always seasoned and cooked perfectly. Now that I've thought about it, I've never had a bad dish here! I also love love love the mint tea! The interior is great for a small or large group, and the service is great! I highly recommend this spot to anyone!"], ["Sebastian B.", "The restaurant feels very authentic. The dolmas were to die for. I've had dolmas before, and they have usually been cold, but these were very fresh and warm. For my meal I got the lamb kebab \"sandwich\". The lettuce was very fresh, and the tomatoes seemed to be just cut. The lamb meat was so tender and juicy. I tried their fresh baklava, and it was the best baklava I've had, still hot from the oven.Overall I loved it! 10/10 would devour again."], ["Ranjit S.", "Didn't taste anything like Mediterranean at all. I ordered the shawarma plate and was left disappointed. The chicken was too dry and the hummus and rice weren't better either. Nice ambience but not very good food!"], ["Jim D.", "The reviews I read led me to believe I was in for a wonderful Mediterranean  meal. The restaurant has a nice ambiance from the front outdoor eating to the colorfully decorated interior. We were seated immediately and the friendly helpful staff provided attention throughout the meal. I ordered the chicken shawarma with Greek salad and extra humus. The plates arrived timely and were very colorful with a small bowl made of humus containing olive oil.  The humus was tasty. The Greek salad contained cucumbers, tomatoes, and black olives with a smidgen of tasteless feta and a store bought Italian dressing. Warm pita was provided with the meal. I don't know why but they were cut into strips. I prefer the whole so I can separate the sides and fill it like a pocket. All of this could still make a decent chicken shawarma but the biggest disappointment was the chicken. This was not the stacked, marinated, slow grilled meat you would anticipate but rather pan fried, dry over cooked chopped chicken with a light spice on the outside. I think there is a lot going for this restaurant, I hope they work on their shawarma recipe."], ["Kita H.", "In a strange turn of events, two folks from Dallas hoping for some good ole fashioned Mississippi-style food ended up having Mediterranean food for dinner :P Yes, we made the fatal mistake of visiting on a Sunday night and apparently, hardly anything is open in Jackson, MS on a Sunday night (being more of your traditional, family-like town). However, this place was open late (until 10 or 11p) and boy, am I glad it was.The location is convenient to access right there on the main strip of the city, adjacent to the government buildings a few blocks down. The decor has your typical, Mediterranean style feel which is always fun, if not in some kitschy way. We were seated quickly although the booth was a bit small for my very pregnant self ;) What really matters, the food, knocked my socks off. I enjoyed a pretty standard dish of lamb gyro meat with rice, Greek-style salad, and hummus + pita bread. Absolutely ate everything- to the last drop. I did request the yogurt sauce (Tzatziki) to dress the meat simply because I personally love it but honestly the meat was moist enough not to really ~need~ it. Hubs loved his food too- he enjoyed lamb kabobs.Oh yeah, don't forget the baklava!"], ["Tina L.", "Mediterranean in Mississippi? Expect the unexpected, it's great, love the sautéed vegetables, the hummus with wheat its, the red lentil soup, the help, the prices, all good, don't miss it!"], ["Angie S.", "We've never really had Mediterranean food and we were definitely not dissapointed. We had the fried cheese appetizer per waitress recommdation and it was AWESOME. Salty, but it comes with fresh veggies that even it out perfectly. We also shared the big combo and it was fabulous, came with pork, shrimp lamb and chicken. Then a huge box of pita bread and hummus which was delicious. Our adorable waitress was the nicest person ever and gave us so many tips and answered every question. This is one of our new favorites and we will definitely be back. So so good."], ["Cody M.", "I just ate here a few months ago. This is one of the best, local, authentic restaurants in Jackson. The hummus is made to perfection, and the meat is cooked consistently well. You will not be disappointed by the more authentic cuisine Aladdin offers."], ["Richard L.", "I've come here several times during and after work at the hospital, and have yet to have an experience other than service that is kind, and food that is consistently well made. I don't know how they do it but it's extreme in it's consistency. I'll be coming here many more times. It's great for groups and more private affairs as they have open tables and booths."], ["Ann M.", "Want authentic cuisine? You'll find it here! I've never been disappointed with an experience at this eclectic little Mediterranean restaurant. The felafel and homemade hummus are unbeatable. Also, they make a killer beef schwarma. Definitely a unique experience in the Jackson area."], ["Michael D.", "This is quite the spot! I love feeling transported to another area while dining, the ambiance is as great as the food! We had a great server, Katie, she was hilarious! Which makes dining all that better! You can never go wrong with pita and hummus!"], ["Nicole M.", "Driving to Georgia from Texas and decided to stop here. It's a little off the beaten path but worth searching for. The fried kibbies were delicious. The hummus was flavorful. Everything tastes fresh. Prices were very reasonable for how much we got. Wasn't too much food at all. Perfect amount with the rice side salad and pita bread it came with. Service was friendly and accommodating of Penny (my dog). We sat on the patio since we couldn't take her in the restaurant. During our meal they also made sure penny had reasonable se"], ["Brian K.", "The service was great, very accommodating and friendly. But, the food was simply average and even poor. The lamb was dry and tough, but the Falafel was simply ok. I wouldn't go our of your way to eat here, but as a passing through it did provide better options than the standard highway fare."], ["Phoebe T.", "After reading the reviews about this restaurant, we decided to give it a try. We were traveling through, coming from a weekend in Birmingham Alabama, and headed back to Louisiana. The restaurant was located off of interstate 55. We were traveling on interstate 20, but the detour to this restaurant only took a few minutes. The restaurant's waitress was very helpful. We asked for a suggestion, and she gave it. I had the lamb chops and my husband had a combination plate. The food was delicious. The hummus with the best I've ever tasted.  We will definitely be stopping by again when traveling through."], ["Denise C.", "Customer service is exceptional,  greeted with warmth and friendly staff.  The food is wonderful, lamb chops cooked to perfection and the hummus is to die for!  This is my second time dining here, would.eat here more  often if it was not so far from my house, but well worth the drive!!  Would recommend this restaurant to everyone in the Jackson area.  A must eat if you love Mediterranean food and a must try if you have never tried it, I guarantee you will not be disappointed!"], ["Anna W.", "Every dish I've gotten at Aladdin has been delicious and fresh!  Their chicken schwarma is always a top pick for me- it is very flavorful.  Also, you can brown bag here and pair some merlot with your food!"], ["Dale G.", "The location of this restaurant is definitely not ideal, but once you get past that I think you'll be in for a pleasant surprise. The food was tasty, especially the hummus and tabouli. Our waiter was truly professional and attentive."], ["Scott R.", "I love this place! I've had better gyro's but the service, freshness, cleanliness aspects of this place are all outstanding. The more exotic Greek dishes are amazing. The gyros and falafel are good too but not the best in town IMO. I like walking in and ordering to go and sitting on the little couch watching the kitchen make the food. This guy runs out of a VERY small kitchen and everything is clean, efficient and the kitchen crew works like a well- oiled machine. That goes a LONG way with me."], ["Cherry D.", "came on a busy friday night. had high hopes for this mom and pop place, but left disappointed. i liked the flavors of my beef shawarma plate. but the hummus tasted sour, and the salad didn't have the typical kalamata olives, feta cheese, and quality olive oil that i'm used to eating. ordered an appetizer with hummus, baba ghanouj, grape leaves, and tabouli. the pita bread tasted like something from the grocery store. my friends ordered the kabab combo, and the shrimp plate. they weren't impressed with their food either. thought the meat was dry, and the shrimp was overcooked. overall bill was reasonable, at $66 for three entrees, one appetizer, and three sweet teas. we did not finish our food and did not even want to bring our leftover food home. i'm glad i tried this place out, but not planning on going back."], ["amc a.", "Lambchops were nicely done, but very small.  Chicken moist and seasoned well.  The one thing that sticks out most are the dolmades....I have never had these warm. Very odd. For lunch the two combination meals were pricey - over $35. Service was very attentive, but we were also eating at a late lunch."], ["Orlean S.", "If all you want is a gyro, then you might try Keifers or Krilakis, but for a complete Greek/Lebanese meal you must try Aladdin Mediterranean Grill on Lakeland. Since Petra is closed, Aladdin is busier than before. For an appetizer I can recommend the fried Kibby or Spinach Pie. The Kibby has a hard outer shell and filled with ground beef. The Spinach Pie has a soft, fried exterior and filled with spinach and goat cheese. Both come with a dipping sauce, but the thick Lebna sauce (yogurt sauce similar to Tzatziki) for the Spinach Pie is outstanding. You might as well order 2 Spinach Pie's because they are to die for. I would not recommend the Dolmas (stuffed grape leaves) as they are too small - the size of cigarillos.For the meal, I've tried the Lamb Kabob Plate, Combination Plate, and roasted leg of lamb. But I think the Gyro Plate tastes better, contains more food, and even is cheaper than the others. The plate is filled with meat, rice, salad and hummus. Pay the extra to upgrade to a Greek salad (with feta and olives) or Tabouli. Nothing has an overpowering taste - the rice, salad and hummus are all mild and delicious. Strangely the Gyro Plate comes with no yogurt sauce, which is a necessity in my book. But ordering extra Lebna was quickly fulfilled - just make sure they don't bring you an entire Lebna appetizer.The tea has a hint of mint which is nice. Make sure to end your meal with a couple of pieces of Baklava."], ["Mallory L.", "We used to go here or get take-out all the time. We do not much anymore probably since we moved further out to madison. The greek salad is my favorite with chicken schwarma. the dressing is a must and get it containers of it to go as well. Fresh food and delicious. 10-15 minutes on to-go orders and friendly staff. I will probably go here next time I'm back in the area. Really tangy flavors on the salad."], ["Chaitanya K.", "When in the Jackson metro area, I go to Aladdins whenever I crave Mediterranean food. It is definitely not the best I have had but does the job. The falafels are tiny but delicious. The chicken shawarma is more like grilled chicken chunks than authentic shawarma but does ok on the taste. Service is quick, friendly and attentive."], ["Chad M.", "Kabob combo was simple and extremely flavorful.  No generic seasoning here.  Careful attention to each meat's accents was given - the lamb was great, the beef was amazing, the chicken was zesty and subtle at the same time.  Spice didn't overpower - flavor won here. The hummus that comes standard with the entree was fantastic.  These people know what they're doing when they craft these dishes - they're thinking of the customers tastebuds!Finished it with the baklava. Loved that it wasn't the size of a small couch...it was an apropos portion to finish a great experience. My server was personal, friendly, prompt, and seemed like she'd love to take care of everyone.  Stay simple on your visit - you won't be disappointed."], ["Stephen S.", "My wife and I have ate here 20-30x in the past two years and we live one hundred miles away.  Best Middle Eastern food by far in the state.  Best kibbeh in the South.  Service is impeccable and friendly and the mint flavored tea is a nice touch."], ["Aisha C.", "This was the only menu we looked at that a vegetarian section - they had us at that alone. We shared the falafel plate and the vegetarian dolmas plate - so delicious! I absolutely loved these dolmas - great flavor and they didnt fall apart like most do. The wheat pita was soft and warm - i could eat it everyday. We also tried the baba ganouj which was great - slightly mashed with perfectly balanced flavors. The prices are decent - especially for the quality of good. The service was also good. If ever traveling thru Jackson again we will certainly stop at Aladdins for a bite. They also had a nice porch for dining, but it was too cold this time of year for that..."], ["Kerry W.", "I have been here a few times. The atmosphere is casual/relaxed Greek Mediterranean style. There is a patio for outside dining which was tempting. Today I had to order lunch and dinner. Night time internet classes will keep me glued to every word of the instructor and I could not possibly tear myself away for a meal. (Sarcasm) So lunch is Hummas with Lamb plate $10.69. The lamb has a mysterious flavor but I do get I believe to be a smoked paprika taste, it was a little spicy but even though I have a mild tolerance could handle it. The basmati rice was light and fluffy and lightly seasoned or flavored with saffron. If I was to criticize anything it would be two things on the lunch plate: the lamb was not drained of grease before it was placed on the hummas so it leached into the rice the second item I would criticize was that I was not asked what dressing for my salad and it arrived with one I will not eat.  Finally dinner is the house special Big Combo (4 shrimp, 2 lamb chops, and chicken kabob chunks. I asked to substitute the basmati rice for the Hummas because it is so good. Under full disclosure, I tried the food before it got cold. Reheating any meat especially shrimp and lamb is very bad and the worst way to reheat will have to happen in the hotel room tonight, forgive me other foodie guru critics!  I will be forced to use the microwave. The shrimp have a good fire grilled flavor. The shrimp size is u 40-60. I love lamb and could not wait for dinner to taste, I know that lamb has the best flavor at a medium for cooking. I ordered medium and it was well done, it was way over cooked. The flavors were great, but the experience could have been better.  The waiter was very nice and attentive but did not come back to ask about the salad dressing. It is 2:00 pm so it was at a slow time."], ["Mark A.", "One of the best Middle Eastern Restaurants ever. We came here from Dallas. They have hosted us very successfully. The waiters and the manager are awesome. They actually serve halal food. They have halal certification and they have no problem showing it in case of asked."], ["Edward D.", "I went out with siblings to shake things up from the normal eating habits (fast food, and Southern home cooked meals...) and our taste buds were entertained well.  Our favorite was the hummus (which came with all our entrees). The place as a whole was in need of repair. The seat cushions in the booths were tattered. The walls were \"Holy\" ( and not with Jesus' Blessing). we highly recommend this restaurant for friends who want a unique experience. The menu is extremely affordable, and the portion size is abundant. The service is attentive."], ["Nick G.", "Fresh, flavorful. Excellent falafel, salad and soup. Perfect stop when driving through on I-55 since it is about two minutes off the highway."], ["Divya G.", "Excellent food! And fantastic service. We stumbled upon this place and we were more than satisfied. Definitely try the Greek tiramisu and the Burma, it's to die for!! I was surprised by the authenticity and the variety of dishes offered here. Most definitely willing to recommend this place and come back here."], ["Mazen B.", "Parking was a challenge but that is the only complaint I have about this place. Food was amazing. Had the meat Shawarma and Chicken Shawarma. Both were very tender and juicy. Just the right amount of seasoning and the taste was yummmmm. Looking forward to going there once again."], ["Melissa M.", "We picked up dinner to go here when family was in town.  We shared two dishes - the Alladin special appetizer for 2 that included hummus, baba ganoush, Lebna, falafel, tabouleh, veggie grape leaves, kibby, and hummus.  For the price, we felt the portions were small - the 3 dips were in the small portion of a 3 section take out container.  There were 2 kibby, 3 falafel, and 3 grape leaves.  The tabouleh, Lebna, and hummus were all very good.  The fried foods were small and somewhat dry.  We also split a combination plate - chicken and gyro meat, more hummus, and a salad.  They included 5 or 6 pitas.  We ended up making gyros with the meat, salad, hummus, and Lebna that were pretty good.  Everything was somewhat dry - even the pitas and meat.  Maybe if we had eaten it there it would be different.  On a side note, they have a new small grocery next door with some interesting options like bulk dates, dried chickpeas, sheep milk feta, and other things not readily available."], ["Bilal Q.", "The food was absolutely superb. I cannot recommend their food enough especially the chicken kabab platter. Everything was perfectly cooked and seasoned just right.Their food actually surpasses many Middle Eastern restaurants in Astoria, NY.  The staff was remarkably attentive and helpful, I highly recommend Aladdin to anyone looking for a great meal."], ["layne l.", "Falafel is delicious!"], ["Chris M.", "Pretty good Mediterranean food. It is actually better than Kiefers. It's a more authentic and advanced menu. We stop here most times when we drive through Jackson. Would really give it 3.5 stars."], ["Jennifer W.", "I actually liked this place a lot when I was visiting Jackson for work and so I ate here twice! I'm not sure if this is the exact location I went to, but I know they are all owned by the same people and so I'm hoping the food is the same across all of them. Here are the things I tried and my feedback:- Hummus - Very good hummus, doesn't have a strong flavor by itself so it easily pairs with anything else. I got their wheat pita bread and it was fresh and very very good.- Qudsia - Chicken and fava beans on top of hummus, makes the hummus a little more tangible as an appetizer. Had this the second time!- Meat dolmas - These were alright, I wasn't very impressed. I have liked dolmas before when they were seasoned really well but it was bland meat inside bland grape leaves with no flavor to them. Meh.- Spinach pie - VERY yummy. I really liked the filling in this and the pastry was light and really good.- Falafel - AMAZING!! You have to get the falafel here, even if you haven't tried them before. Very flavorful, not greasy, just yummy yummy yummy.- Hummus with lamb - Lamb was very good and tender, came with a small cucumber salad which was pretty good.I added this spicy sauce you can ask for on the side to a lot of what I tried here because their biggest weakness was underseasoning on some dishes that had the potential to be phenomenal. They also didn't have eggplant for baba ganuj which was disappointing. Hoping when I go back they'll pick it up and I can give 5 stars!"], ["Dabney R.", "Initially wrote this place a moderately good review about 4 years ago on another dining app, but unfortunately made the mistake of saying Keifer's was better \"for real Greek food like gyros and hummus.\" I am back now to redeem myself and clarify my initial misgivings. I believe what I meant is that Keifer's has better Greek food (while \"real\" was not the best word choice as it is definitely Americanized) while this place has better Persian/Turkish, etc. While I still believe Keifer's hummus, gyros, tzatziki and feta dressing slightly edge Aladdin out, the food here has grown on me more and more through the years. They also have good gyros and hummus, but what truly makes the menu is the lamb. Doesn't matter whether you order it in kebab, wrap, chop, or plate form, it's delicious. I usually get the Hummus with Lamb and make sure to ask for labna or tzatziki to go with it (it doesn't come with any yogurt sauce, which I've always thought was strange.) For starters, definitely get the spinach pie and baba ganouj, both are phenomenal. The mint tea is a nice touch and the baklava for desert is better than Keifer's. Overall wonderful Mediterranean food, especially for Jackson, which doesn't always do the best by ethnic food."], ["Justin W.", "Try this place out, you'll definitely enjoy it!  I met up with some friends there for dinner one night.  A couple southerners and a couple foreigners, and everybody liked it a lot.  I would gladly go back if I'm ever in town again.  It was not busy at all when I went on a Friday night a few days before Christmas."], ["Danna R.", "Best falafel ever!  Nice atmosphere.  Another server would have been helpful, our server was great but very busy.  Everything was very tasty."], ["Roger L.", "Probably the best restaurant in Jackson in terms of food, service, location, atmosphere and value. Literally everything on the menu is delicious and made in house. Can't say enough good things about this place, including the fact that it it BYOB."], ["Eric G.", "I took my mom here to break her out of the habit of going to the same restaurants all the time. She is not very adventurous on her own. I was a bit skeptical if Jackson had any good Mediterranean but I was quite pleasantly surprised! We started with the Aladdin Special, a  sampler platter with hummus, baba ganuj, Lebna, grape leaves, tabouli, falafel and kibby.The hummus was well seasoned, although not a smooth as I would have preferred. The Baba Ganuj was not bad but not memorable either. The Lebna was very good. The grape leaves were a little over cooked but not bad. The kibby was also very good. It was my first time trying it so I don't know what it was supposed to taste like but I liked it. The star of the sampler platter, though, were the falafel! Those were some of the best I have had. Very well seasoned, cooked perfectly.For main courses, my mom had the Lamb Chops and they were perfectly cooked and seasoned! I had the chicken shawarma with a side of hot sauce (can't remember what it was called) but it was VERY spicy and the flavor went well with the chicken. Although the chicken was seasoned well, it was a bit overcooked and somewhat dry.To end it, we tried one of the \"blendies\" drinks made with strawberry on top and avocado?!?! on the bottom.  It was surprisingly tasty but I would have liked it to be a bit colder as the strawberry section was colder than the avocado. Once I mixed them together, the temperature was more to my preference and I enjoyed it. Overall, a great first experience with Greek food in Jackson. I will definitely be back!"], ["Denise H.", "Very good service.  Menu had a ton of options- very nice.  I had the vegetarian plate.  Falafel was cooked to perfection. Hummus was great too.  Was in town for work glad I found a healthy lunch.  Would come back for sure."], ["Christopher L.", "In Jackson for a couple of days on business, I found Aladdin Mediterranean on yelp and decided to give it a try. I eat mediterranean food often in Atlanta, where we have Israeli, Lebanese, and Palestinian varieties to choose from.  Aladdin presents a large menu with many nice touches such as haloumi (they call it \"fried cheese\") and mint-infused tea. I ordered the vegetarian plate (hummus, baba ganouj, and tabouleh).  My companion had chicken kabobs.  All the food was fresh and delicious, and was served promptly. The haloumi was sliced a bit thicker than is customary and did not have the traditional slight crustiness on the outside, but it was still delightfully \"squeaky\" and came with a nice garnish of tomato and cucumber slices.The reason for no fifth star is that the restaurant is \"bring your own bottle\" but this fact is not advertised on their website. It would not have deterred us from going if we had known, but was nonetheless disappointing when we arrived to not be able to have a beer or some wine. The second reason is that the waiter didn't seem to be too familiar with the menu - he would have been of no help to someone who was not already familiar with middle eastern food.  However, if you're looking for solid mediterranean fare in Jackson, you will be happy with Aladdin!"], ["Kashif A.", "Lamb chops! Enough said!"], ["L. H.", "Went back again for another amazing meal!  I got the chicken schwarma (spelling?) with some grilled veggies and baklava. THE BEST!  Everything was cooked perfectly and tasted wonderfully. I've been to a lot of Mediterranean restaurants all over the country and this is hands down my favorite."], ["Jen L.", "I didn't expect to find much authentic Middle Eastern food in Jackson. Not only was it authentic, but my half Lebanese husband claimed \"they have the best Baba Ganoush he's had in the states. And that's including living off of the best Lebanese restaurants in the LA and NYC area. This is a great place with a wonderful staff. It's not too expensive (unless you eat there every day like we've been doing)!"], ["Sydney M.", "Delicious! Can't find dolmas as good as these anywhere! Unless, of course, you visit the Mediterranean.  Don't know, never been.  The hummus, baba ganouj, tabouli, falafel, and pita, ALL superb.  I always get the Aladdin's Sampler Appetizer as a meal for myself because I'm a huge fan of vegetarian mediterranean dishes.  I've had the Chicken Schwarma (maybe?) and it was good, too. I was just wishing that I could have had some dolmas, as well. The restaurant (last time I went there) is BYOB. And they even had a grocery in the back that you could look through and shop.  I doubt anything I buy and then try to cook would taste half as wonderful as the talented chef's food at Aladdin's."], ["Jennifer L.", "The atmosphere and the service was very good.  Our waiter was extremely helpful and recommended several good entrees. I chose the lamb kebab plate and my friend chose the beef shawarma plate.   It was a good sized portion and the waiter brought us a mix of wheat and white pita bread.  My only regret was that I wish I asked them to cook the lamb medium rare, as the lamb was fairly dry. Everything else's was fantastic though, and I look forward to my next visit,"], ["Brandy P.", "One of my absolute favorite places to eat when I visit my family and friends in Jackson."], ["Jane M.", "Best hummus I have ever had-- maybe best Mediterranean food all around.  Had the gyro sandwich and a side plate of the veggie stuffed grape leaves.  Everything was so fresh, tender and delicious.  Would make it a point to stop in Jackson again just to eat here."], ["Brett S.", "Inexpensive and tasty. We had the beef shwarmma and the Chicken also. The beef was a bit chewy. The tabouli was  was  good and the Greek salad also hit the spot. I think the best was the mint ice tea.The service was fair and the place was clean and nicely decorated."], ["Jane R.", "A favorite option for a dinner out for me... I'm both vegetarian and wheat free, so I'm thankful for the great selection of decent restaurants in Jackson that I can eat at--and this is one of them. My favorite dish is the sauteed vegetable plate (on saffron rice topped with feta). And the fried cheese appetizer is AMAZING...addictive! I love that you can BYOB for no cork fee... have a nice dinner with wine (there's a liquor store literally next door) on the cheap! My only complaint is that once, I ordered that same vegetable dish I always order and it came without the cheese (my favorite part). I asked about it and was told they were out. I was annoyed, because the dish was really bland without it, and they hadn't even told me. I think they took off 50 cents? Gee, thanks. And the staff were clearly talking about me and all staring in my direction and it was just awkward. But next time I came in the same waitress joked with me, \"We have the cheese!\" so whatever... I let it go. :)Just be sure to ask if all ingredients listed will in fact be included in your meal!"], ["Hannah R.", "Coming from the Baton Rouge area where there is a large variety of excellent Middle Easter/ Lebanese restaurants to choose from, this place is nothing to write home about. I had the chicken shwarma and though the dish wasn't bad, I guess I had higher expectations. I'm used to shwarma and gyro meat coming off a skewer, not diced up chunks of meat. The pita wasn't fresh and the rice was pretty plain. I love hummus and theirs is nothing special, though not bad.  The restaurant itself is quaint and in a good location and I found the staff to be pretty pleasant, so no complaints there."], ["Kate W.", "Everything is wonderful here! Fresh ingredients, great service, and it's byob! The atmosphere is really nice and cozy. Get the hummus! They let you pick your pita bread - wheat or white or both!"], ["Sara W.", "I Love Mediterranean food, and was so excited about going to Aladdins with my husband. The server was good,but the food was disgusting!! My husbands beef Shwarma tasted life old horse meat(when I said that to him he said horse meat would have tasted better) the hummus was gross, the salad dressing just tasted like olive oil and that's it. The rice that came with my food tasted days old and I ordered falafel and those you could tell came frozen in a bag that they just heated up...all in all DO NOT EAT HERE!!  The food is not fresh and its like they never use any kind of seasonings!"], ["Dave W.", "Really a great restaurant. The gyro wrap is my favorite. The sweet tea has a mint flavor added to it. It's great."], ["Marissa A.", "I absolutely loved this place!! The restaurant was beautifully decorated with such a laid back and cool atmosphere. It was byob so we bought a bottle of wine from the liquor store conveniently placed next door! The food was awesome I got the gyro plate and the meat was tender and juicy my sister got the falafel plate and that was also a hit as well! The hummus was great and service was prompt and friendly! I recommend this place to any one!"], ["Darin W.", "Reasonably good food, their gyros are a bit oily though. Would probably go back again"], ["Stephanie B.", "This place has great food! I have yet to have anything I didn't like. When I come to Jackson for business, I make sure to stop here at least a couple of times! My favorite thing to get is the vegetable dolmas plate. The hummus here is the best I have ever had! It's good to-go too."], ["Jennifer T.", "Aladdin Mediterranean is my favorite Jackson restaurant. I love it! It is consistently good. I usually get Musabaha for an appetizer. It's hummus with whole chickpeas stirred in with their olive oil relish on top. I have literally cleaned out a plate of hummus with their fresh pita bread. They offer either wheat or white pita. I get the white, the texture is better to me, but for die hard wheat fans, the wheat is good. I have had their lentil soup, and most of the time, I've had it, it's been good, flavorful, and comforting. I get the combination plate of chicken kabob, schwarma, and gyro meat. I love the gyro meat, it's soft and spicy a grilled so nicely, and you can eat it with the hummus that comes with your meal. The chicken and beef are marinated in something amazing and grilled. Usually my chicken is juicy and tender and my beef is falvorful. The hummus is very creamy and I wish I could figure out how to get the creamy consistency of Aladdin's hummus at home. The meal comes with a salad with a homemade italian dressing. I usually get an extra side of dressing to dip my meat it, because it is fantastic! I think I could literally drink a cup of their dressing. It's that good.  I haven't eaten the salads there, but I've seen them, and they look beautiful. I have had the gyro and it's delicious. I have also had the falafel and while I like it very much, Keifer's wins on the falafel, hands down. I usually have great service when I go to Aladdin's. If I could I would eat Aladdin's weekly, that's how much I enjoy it. Portion sizes are reasonable and so is the price of the food. You can also go next door and buy a bottle of wine and bring it in to drink. Fabulous... Again... my favorite place to eat in the city. Truly."], ["Maggie W.", "While I like Greek food, I'm not a huge connoisseur.  I did love their gyro more than any I've ever tried."], ["Alli B.", "Good Mediterranean.  Everything was good that my group of 8 ordered.  Recommend to others!"]], "Kismet's Restaurant": [["Shari C.", "Love the Catfish appetizer. Lightly breaded and seasoned just enough. Yummy.I prefer the French Dip Pita to the Gyro (personal preference), but its consistently moist roast beef and plenty of melted cheese and onions. Friendly neighborhood eatery with wonderful comfort food that always hits the spot."], ["Cynthia M.", "Excellent service and food. The Greek Salad was outstanding. We'll be back!"], ["C H.", "I use to work here. This is the best gyro place around, and you cant get a gyro deluxe at the other K restaurant in Jackson."], ["Big E E.", "Only greek restaurant in brandon. Typical gyros stuff but love their curly fries  i recommend eating the curly fries in the restaurant. They are not good cold"], ["Amy S.", "Years ago I would have gladly given Kismet's 4 stars, but the past few times we've been there the service has been pretty bad.  They still continue to make one helluva good gyro sandwich; it's really amazing and continues to be one of the best I've had (Keifer's in Jackson is still #1 in my book).  I often don't feel like driving to downtown Jackson to Keifer's since Kismet's is much closer to where my parents live, so I come here to get my gyro fix and just deal with the poor service.I think the poor service stems from the fact that they mostly hire teenagers.  Teenagers who would rather stand around gossiping than serving the actual paying customers.  This just annoys me to no end.The restaurant is clean and the decorations are really cool.  Very eclectic.  I seem to always spot something new and interesting each time I'm here.Parking can be a pain since it's located next to Kroger and they share the same parking lot.  it's not that big of a deal, just don't expect to park right in front of the place.I do recommend Kismet's if you're looking for a good gyro, just be prepared to deal with teenage employees who don't really want to be there."], ["Jeana S.", "It's a shame that Kismet's is just not as good as they used to be. My husband used to eat here all the time. We hadn't been in about a year and decided to eat here while we were running some errands in downtown Brandon a few days ago. We ordered hummus as an appetizer which was very below par than the last time we had it. Then we both ordered a gyro salad for the entree. It was alright. The cucumber dressing definitely made the dish interesting, but I still couldn't get over how much better it used to be. Maybe we just visited on a bad day."], ["Theresa D.", "I got the grilled shrimp wrap and side of curly fries. Not horrible, but don't get it. Got the spinach artichoke dip for an appetizer. It was what you would expect and not much more. Our waitress was nice and attentive. If you go stick to what everyone says is the reason they go..the gyro. I tasted the deluxe gyro and it was great. Wish I had ordered it."], ["Matt S.", "Great little mom and pop joint. Friendly staff, eccentric decor, good food. Greek with a southern spin. May disappoint purists I suppose, but I certainly enjoy it."], ["Bryce H.", "The pineapple chicken wrap is the best."], ["Charlie B.", "Great little local Greek Resturant, one of the best Gyro sandwich I've ever had.  If your real hungry & open to a twist on the classic Gyro, try the deluxe Gyro.  Great salads too!"], ["James B.", "Consistently good food and service.  Good selection of burgers, wraps, sandwiches and salads.  They also have daily soups and specials.  Gyro with curly fries is usually the way to go.  Background music is always good and varied."], ["Dale A.", "Been here several times. Great hummus. My favorite is the portobello burger. The staff is friendly, and eager to please."], ["Mechele P.", "Food was over cooked. Staff not friendly."], ["Sarah J.", "Love their sandwiches and fried mushrooms. It's just a shame they don't deliver."]], "Zeek'z House of Gyros": [["Trent L.", "Awesome! I have been twice (only because I just found about it two weeks ago!). Fast, friendly service.I had the Philly Cheese both times and wow! Also, the Falafel is really, really good. Nice to see this place succeeding close to home! Keep up the great work!"], ["Aaron Ray A.", "I ate here for the first time yesterday.  It was not bad.  The service was good.  I had the falafel wrap.  It had a little more spices than I am use to in a falafel and the texture was a little courser than I am use to but it was still good.  If you are looking to grab a quick bite and in Flowood you should check them out."], ["Ian M.", "I was very happy to have a Greek place closer to home but this place is \"penny wise dollar foolish.\"  Save a penny by scrimping on ingredients but lose dollars when customers don't come back.I got a Gyro, fries, and pita feta.  I was actually able to roll the Gyro up to about the size of a Taco Bell burrito (there's a picture on my page).  The fries were excellent but again not really enough to share which for the price it should have been.The Pita Feta had feta covering about 60% of the pita in the middle.  So that's about 40% crust.It has the same menu as Keefers and someone told me it was a former cook from Keefers that opened the restaurant.  All of the food tastes the same as Keefers but is not as well prepared as Keefers.  The restaurant is not as nice and homey as Keefers.  The food portions are significantly smaller than Keefers.So, I think I will stick with Keefers."], ["Shane C.", "It's the best Greek in town because it is the only Greek in town. Zeekz is a welcome change to Mexican, Mexican, and Mexican in Dogwood.Overall, Zeekz is just OK. The pita bread is not special and tastes slightly better than grocery store pita bread. The hummus options are pretty good. The Falafel is really good. The cottage fries are unseasoned. The gyro meat is ordinary.By far my biggest disappointment is that there is no Greek salad dressing. This is like a pizza restaurant without tomato sauce. There is a creamy feta dressing. But no Greek vinaigrette or oil & vinegar. Other than the ranch-like feta dressing, the salad dressing choices would imply you're at a typical American restaurant.And that's what Zeekz seems to be - a typical American restaurant that has some Greek food on the menu. This is no Keifer's, Krilakis, or Taziki's.  I'm glad we have Zeekz instead of another Mexican or sandwich place. I'll be an occasional customer. But if I want great Greek food, I'm driving to Krilakis."], ["Tiffaby H.", "Great food!!! For the area!! My only complaint is that I don't wee get the warm and fuzzy service white people seem to get! I only noticed this because I frequent the place and yet NO ONE EVER SEEMS TO REMEMBER ME!!?? And a new white customer can come in and ask a million questions and it's like they see them every week. I ask a question or ask for a little more time and it always seems to be a bother? Now no I won't stop eating here because of this, I've been black my whole life and loved MOST OF MY LIFE THE SOUTH, so it's jut a typical white establishment no one is trying to be negligent or biased it's just very typical. I write this so that your black customers may start to feel more welcome and actually want to stay and sit and enjoy the Music instead of hurrying to leave. You all are very unwelcoming to Black people. And again I DONT think it's intentional. Otherwise I'm glad to have the place on this side of town."], ["Amanda E.", "I am not really sure what the negative reviews are about on here. My husband and I just enjoyed a great lunch there. If you have been to another particular Greek restaurant in Jackson and like it then you will like zeekz  I had the grilled chicken salad and my husband had the gyro. Both were good and almost identical to the other restaurant. The most important judgement factor for me was the feta dressing. It is almost the sole reason for me to go eat Greek food. I will have to say that the sauce at zeekz tastes nearly identical to the other place. So for me- it's a Win! I'm pumped that I don't have to drive all the way state street to enjoy a cottage fry with feta sauce. Give it a try!"], ["Kathleen D.", "We love Greek food. And we were desperate to find good Greek in the jackson area. So when I spotted this place I was really excited!! Then we looked at the menu. The soup of the day was Gumbo. And the Hummas is 2 slices of bread for almost $7.  The menu gave me a hard time finding anything I would normally find at a Greek restaurant. It's purely a wrap restaurant. All additions to the wraps are really expensive. The onions on the wraps are raw. The wrap is small and comes out on an empty plate. The souvlaki was incredibly bland. It has no taste to it can't even taste the taziki. The meat had no taste but was spicy. They are very proud that they use gyro seasoning on the souvlakis....  The potato was yucky, weird huge slices of bland potato with no lemon or anything. The waitress was nice enough, the guy at the counter was kinda not.My husbands dislikes Peta pit but right now he wishes he was eating at a Peta pit instead of this place. Very very very disappointed, I really wanted this to be our Jackson version of Tazikis.This is not Greek food."], ["Spencer D.", "Pita was fine, feta was great, my pita club was skimpy with only 2 thin slices of turkey.  Not worth the money tonight.  Waitress was apologetic, mgr didnt even come to table.  Bad experience"], ["Jeana S.", "I've eaten here two or three times now and it's great! I usually order the Hummus Trio for an appetizer and a gyro of various types, and each time it's been delicious. The interior is beautiful, and the staff is super kind. I definitely recommend it!"], ["Jamie F.", "I have been here several times since they opened, and  they are better every time! They had a few service problems with training new employees at first, as any new restaurant does, but things are rocking and rolling over there now! The food has been good every time! I have tried several different items, and really do love it! The atmosphere is really nice and open. Thursday's they have live music on the stage! Great new place!"], ["Jeffrey W.", "Great place to grab a gyro and a pitcher of beer. The appetizers are great. I recommend the PitaMozz or Humus Trio. I have been here numerous times and never had bad service. Servers are prompt and friendly. The food comes out quick, hot and fresh. I enjoy the gyro with the feta sauce. I have tried other wraps and haven't been disappointed yet.  I also appreciate the great selection on beer on tap and bottles. Thumbs up all the way. I recommend everyone give it a try. You won't be disappointed!"], ["Chad L.", "Well, I had been waiting for months for this place to open as I love Kiefers and the owner of this place was once a cook there. However the reason I give them 1 star is b/c I made a detour on my way home today (Sunday) out of my way in excitement to eat here.  I was not sure actually if they were opened on Sunday's or not (didn't think to look here first) so I figured what the hell!  So it's raining and thankfully I decide to drive by the front door first b/c they have a hand written sign on the door saying sorry we are closed!  So I look at what the normal hours should be and they are supposed to be open until 9 or 10pm!  There are workers inside cleaning so the only thing I can think of is they were slow so they just decided to close. I am a business owner myself and you CAN NOT stray from your posted hours like that!  This is how you tell customers don't come back!  I also tried calling to see why they closed and they just let the phone ring. I am sure I will try again and if it's good and open I will repost with a better rating."], ["Tara H.", "Brand new, just opened today. Food was very good. I had a regular gyro and my boyfriend had the grilled chicken. We also had the Pita Mozz appetizer. I had to bring half of mine home because I was full. There is a spacious dining area with a small stage. According to the website, there will be live entertainment once a week.  It's nice to have a Greek cuisine option in this part of town."], ["Ross R.", "Great food and atmosphere! I've had turkey, souvlaki, and regular gyro. All were very good! They have a band on Thursday nights each week! If you're in the area definitely need to give them a try!"], ["Bryce H.", "My food was good but my wife's was cold. Also no kids menu so that was a little challenge. Service was so so but it appears that they are still learning. Food took longer to come out so just be patient."], ["Sean A.", "This is a new greek restaurant in flowood that looks amazing. They have 4 different types of hummus and many different options for gyros. The atmosphere is really cool."], ["Bill P.", "Don't know why there are bad reviews...this place is great...Gyros are the best in town"], ["Jason B.", "This place is a joke.  I got a 8 dollar falafel wrap?   Thing was about 5 inches long had 3 fried balls in it and a slice of lettuce and a slice of onion.   It seems to me that if I can make something at home for 1/10th of the cost and it will taste 10 times better why bother dining out?"], ["B F.", "If you're looking for a traditional gyro with flavor, Don't go here! Very bland. Meat had no flavor. It was eating bread with something shoved in it. The chicken gyro was over powered by honey mustard. Hummus trio wasn't that bad. Overpriced for the flavor. Was hoping we'd have a decent Greek restaurant in the neighborhood. No such luck. Definitely NOT a Keifers!"], ["Polly W.", "After hearing so many good reports about the new restaurant Zeek'z house of gyros I decided to go and give it a try I was greeted with a energetic friendly staff in a comfortable atmosphere served delicious hot food at a moderate price all the buzz about Zeek'z is spot on !!! I give it an A plus and will definitely go back !"]], "Keifer's Restaurant": [["Christopher S.", "Great Greek food, but get here early - it will fill up at lunch!We love going to Keifers!  The food is good, and they have traditional Greek food (gyro) or Greek/American food (chicken or hamburger in a gyro).Seat yourself and they will come and take your order.  Try the pita bread or the big cut fries as an app as you struggle to order (lots of good choices!).Prices are very reasonable, this is a fun, no-nonsense restaurant.  The staff are SUPER friendly and aim to please, and lines can get long, so be patient.  The food is worth it, so give it a shot!Note, this is a seat yourself restaurant, and it fills to capacity at lunch.  If you can't find a place to park, park in the Hospital ramp next door!"], ["Ryan W.", "Interesting and popular. I was passing through Jackson for work and decided to use the On The Road app from food network. This place was visited by Cat Cora, so I decided to give it a try. Cat knows great Greek food.Located next to a hospital, it gets crazy at lunch time. Ask for a menu up front, then seat yourself.The salad with Feta dressing was stupendous. It's seriously good dressing. The open face Gyro was very tasty. Was it earth shatteringly good? No. I prefer the feta dressing to their tsiki sauce and wish I had asked for more. The meat was savory and hand carved as real gyro should.It was a very good meal, and I recommend. They only lost a star for serving generic condiments like monarch ketchup. A few cut corners, but overall a very nice place."], ["Randy R.", "The Beat Greek food on Jackson! I live in Chicago.  I've been to a ton of Greek and Mediterranean restaurants.  This is still one of my favorites.  Try the pita with mozz and the chicken gyro.  Love their seasoned home fries.  I guarantee you won't be disappointed."], ["Ruhi R.", "I have been frequenting Keifer's for years. Also, working across the streets makes it easy to stop in for a quick, affordable, and delicious lunch. I've tried just about everything on the menu, and I always resort to the regular gyro or the chicken gyro and cottage fries. The reason Keifer's is so special is because of the friendly staff, the stomach filling food, and the always satisfied feeling you get when you leave. I have yet to have a bad experience and that's why I always show my patronage to this Jackson staple."], ["Sweet O.", "Keifer's, you were my first so I remembered you as the best. My memory is either faulty or you are just a shadow of your former self. The cottage fries were a study in excessive grease. The suvlaki wrap was chockfull of iceberg lettuce, skimpy on the beef and barely any dressing. The service was absent. I will always treasure the memories of the burlap laden walls and bathroom with a tub of the Keifer's of my youth."], ["Melissa B.", "I love Keifer's. The porch is a great place to spend time with friends when the weather is nice, and the food is excellent."], ["Meredith H.", "I've been a regular at Keifer's for awhile now. I love coming with friends and sitting on the patio. Though the beer selection is limited, Keifer's has the basics on draft (Michelob Ultra, Shocktop, Bud Light and a few others). The menu has a fairly large selection of different gyros, appetizers and salads. I prefer the Chicken Yavne or Suvlaki but haven't had a bad gyro yet. Also, get the cottage fries. They're a staple with any Keifer's meal. This place is great for a quick bit to eat or a first date. Definitely sit on the patio if the weather is nice. The service can get a little spotty if it's a busy night but your food will come out fast and it will be good."], ["Billy V.", "Where are all the reviews? This place is great and an institution. This is my only review ever and I'm writing this because Mr Y@elp messed up somehow.  Always a very good meal. Gyro, cottage fries, Greek gyro salad. Eat outside for a quieter experience."], ["Minna Z.", "Keifers is definitely one of the best finds in the Jackson area. Their staff is always friendly, and it has a wonderful, chill environment both indoor and outdoor. I have tried many of their different wraps, and none have ever disappointed. My all time favorite is the Turkey Melt. Their feta dressing is the equivalent of liquid gold. I highly recommend ordering cottage fries with a side of feta!! Those things are huge, so I suggest splitting it with someone. Although...it is so overwhelmingly good that you may not have the self control to only eat half."], ["Neelesh T.", "Went to Keifer's for the first time with family including 3 ravenous boys. Overall, it was a good experience. We ate in. The chicken pita, gyros and falafel were good. The fried potatoes were not. Prices are a bit high for the overall quality."], ["F M.", "Love Them!!!! They give generous amounts of meat!!! Love their Feta sauce too!!!! I'm hungry. Please deliver!!!"]], "Greek Parthenon": [["Remy O.", "Here is another of my favorite spots to hit in the Jackson area.  Aside from Pho, I love hummus.  And at Greek Parthenon the hummus (**** stars) is off the chain.  I also enjoy that they have a Mediterranean store which offers tahini and other delights for you to take home and cook yourself.You will find the owner walking around and he is very approachable and full of dining suggestions.  I recommend the grilled fish of the day (**** stars)  and dont forget to grab a snack on your way home from their bakery."]], "Vasilios Greek Cuisine": [["Merritt L.", "Had redfish with scallops. The redfish is much better and much more fresh than seafood r'evolution's. Fresh fish delivered daily. Vasilio's is a lot like Bill's Greek Tavern in Jackson, except a little more consistent. It is a classic and casual institution of Madison. Serving staff is very amicable and personable. The perfect place for a low key, private, \"neighborhood\" atmosphere. Especially for a mid-week dinner after a long day of work."], ["Terri H.", "I don't think I ever have eaten at the same place twice on the same day . Vasilio ' s is the exception. We stopped for a quick lunch I had a gyro lunch special the gyro was fantastic and the fries were had cut from a real potato. .my friend wasn't very hungry and had the Humus appetizer said it was the best she ever had.. so we made plans to have dinner there that night.. I had the black fish , she had the redfish  both we cooked to perfection..my blackish had a lemon butter sauce that yummy. We had calamari and pita with feta for appetizers  that were delicious. .and split  a baklava that was sinfully  delicious. .. it is our new favorite  place"], ["Jerry S.", "I don't know what the others are talking about, we are Greek and were traveling to New Orleans and randomly found this amazing place.  Everything was delicious! The spanakopita, the redfin seafood platter, veggies with feta, keftethes (meatballs)... What a treat! And everyone was very nice. The atmosphere was perfect, lots of flair of Greece, music and paintings.  That's our new favorite spot on the drive down to New Orleans now!"], ["Matt M.", "Never again! Food is not fresh, it's the nastiest food I have had since moving here. The place is a joke. The staff can not take the order correctly. The chicken in my gyro was paper thin. Frozen chicken strips ! I can cook better than this geeezzzz. Sad just plain disgusting !!!!"], ["Mary D.", "We went here with the kids for dinner.  Excellent redfish, grilled feta, superb  spanikopita, great pita and hummus and the best dessert ever: baklava cheesecake .  Great restaurant.  Not cheap but worth it."], ["Jessica S.", "Will not be coming back here. Food is not authentic and is the worst Greek food that I have ever had. Food is also over priced. Greek salad is nothing but shredded lettuce with meat over it, had no feta, no Greek olives, and no tomatoes."], ["Harry P.", "As a Greek American, I would stay away.  a gyro Greek salad which my mother would laugh at the owner. If the owner is Greek, you should be ashamed to call this Greek food because I am embarrassed. \"NA\""], ["Stephen W.", "Wonderful redfish. Perfect example of a quality Greek restaurant.  So authentic that it closes for a month each summer so the owners can visit Greece."]], "Kristos": [["Dustin C.", "AWESOME FOOD!!! Every Time I go in janelle knows my order and is always smiling!! She cares so much every time!!  My order is sometimes not correct but the customer service is so awesome I don't even care! Bradley at the front desk might take some skills from janelle on customer service and learn to not tell a guest NO!! Other then that I will keep going 3-4 times a week!!"], ["Matt H.", "I've dined at Kristos several times now both at lunch and dinner. One thing to remember is that, as the sign says, this is AmeriGreek, not traditional Greek food. There are many Americanized Greek items (or is it Greekized American items?) on the menu that would make it a good restaurant for those who aren't sure about eating Greek food. You can get a traditional Lamb Gyro with Tzatziki sauce and find it plentiful and tasty. They also have things like a Ham & Cheese Gyro, which clearly isn't traditional Greek fare! You can also get Redfish, Catfish Tacos, Shrimp Po-Boy, or a Cheeseburger here. There's something for everyone. I've had the Gyro, the Catfish Tacos, the Greek Quesadilla (love this one). They were all great, had good portion sizes, and are reasonably priced for Madison.The atmosphere is interesting. It is an old remodeled house. Some of the tables are pretty close together, but it doesn't seem to crowded. The also have an outdoor patio with a TV that is a GREAT place to dine when the weather is good.The service has improved since the new owners started changing things. The last several times I've been the waitresses have been great."], ["Allen T.", "Good food. The service can sometimes be a little slow. But the food is really good.  Friendly staff. Good gyros."], ["Jerry S.", "We found this place randomly while following directions to a different Greek restaurant, haha... The building looked so nice and it said Greek Cuisine on the sign so we had to try it!  Turns out, it's not traditional--mostly your basic pub fare with a Greek twist... I had the red snapper which was a little small and just mediocre, but the feta plate was a nice piece of Greek feta which was great! All in all, the young staff were nice and responsive and I think if I hadn't walked in craving a traditional Greek meal I'd have loved it!"], ["Jenna W.", "The food was really good but the service was terrible!The server took our drink orders and returned 5 minutes later to ask us again what we wanted to drink because she \"got stopped three times!\"I had to ask twice to have my drink refilled (the only time I got a refill was when I asked for it, it was never offered)We had to search for someone to get a to go box ans our check when it became apparent they wouldn't be returning to our table. Our server was actually hanging out at the bar chatting with someone."], ["Rebecca B.", "A few months ago, we had written Kristos off as a viable takeout option. I'm pleased to say that 2 more recent trips have shown a real turn around in service. Quicker and far more pleasant people are manning the front of the restaurant now - it no longer feels like I've imposed upon the employees' good times by going there. Had to update the review - still a little pricey but back in the rotation."], ["Ross C.", "I don't understand how this place isn't given 5 stars by everyone. The staff, the presentations, prices, and the food were amazing!"], ["Jared D.", "My wife, daughter, father-in-law, and myself have eaten there twice in the last week. The food is great, the people are friendly, and not as expensive as it probably should be. We will be back every chance we get."], ["Beth M.", "One word..no...Most awfully set up and serviced restaurant ever...I've experienced better run lemonade stands."], ["Katie A.", "The mozzarella pita appetizer is really good.  It has a very tasty side sauce. The gyros are amazing. The lamb was cooked just right.  The baklava is pretty good as well. Kristos is definitely a place we will return to."], ["Coral E.", "We are fairly regular visitors to Kristos.  While the sweet potato fries are good, the curley fries are our favorite.  Always had good food and our go-to pitas are the shrimp, the club and the turkey.  The outdoor patio is always nice to sit at- especially when there's a football or baseball game on and the service is always good."], ["Caroline B.", "The food is sub-par and a bit overpriced. They do have a nice patio and staff but if you want really good Greek food you'd be much better off somewhere else."], ["Brian H.", "The service was friendly and my girlfriend seemed to enjoy her quesadilla, however that's the only positive things I have to say. The menu was juvenile compared to other Greek restaurants. The fajita wrap I got was incredibly dry and bland. They really need to rethink their menu if they want to compete with the other Greek places."], ["Chad S.", "I'm going with A-Ok here because Kiefers is downtown and Kristos is trying to fill the Madison Keifer's void. Pitas are smaller than Keifers and soda/tea are $2.25. Service was good and the paito was great. We didn't try the appetizers but maybe next time. For Gyro action, you might want to dine at Keifers. As my wife said, \"dainty portions\"."], ["Baron M.", "Price ended up being a little higher than I expected (drink prices I think), but the quality of the food was good. The Greek meatball gyro was tasty, the fries were much too soggy. Next time, I'm going to ask them to cook them crispy (maybe this is a Greek thing? I have to ask Wraps, Keifers, and Krilakis to crisp them up, but not Kiefers downtown...). Also, two people could easily split the fries. They were so soggy, I had to knock off a star. We had two orders at the table and they were both the same way. It was a shame too because they had soooo much potential (thin, curly fries with Greek seasoning). Anyway, I will certainly go back next time I am in the area for lunch. Maybe they can get that forth star!"], ["Tam D.", "We visited this place on a suggestion.  I ordered the Greek burger with sweet potato fries.  The burger was tasty and fresh, the fries were waffle and large enough for 2 to share.  It was $10, not a bad deal for dinner.  My dining companion ordered the chicken gyro but commented that it wasn't great.  The service was attentive and accommodating.  4 stars for being out of all draft beers at the time! Will give them another shot."], ["Donald S.", "Average food, immature service.My experience.  Quality of the food: Gyro was average, falafel was average, and pita with feta was good.  The portion size was small.  The wait time after our order was placed was very long.  Service was inflexible to the simplest of request.  Overall a poor value.  I won't be back."], ["Michael H.", "Overpriced and was not as good as I was expecting"], ["W E.", "I love this place during lunch.  I like the pita-moz to start with then I get either the first wrap on the menu or the second one.  One is a standard gyro the other is a greek meatball gyro.  I enjoy everytime I go to this place.  Great food.  Has a very nice outdoor area."]]}