{"Spice Avenue": [["Meredith H.", "This was my first time at Spice Avenue and definitely was not disappointed. We went during lunch and the buffet was awesome. The chicken tikka and butter chicken were well seasoned and delicious when paired with the warm naan. Some dishes were lukewarm but new batches are brought out frequently. The outside looks a little grim but it does not reflect inside. The restaurant is clean and well run. Our water glasses were never empty and the servers are very accommodating. Spice avenue is now my favorite place to get Indian food in the Jackson area."], ["Ruhi R.", "Indian food can be a hit or miss, but this place is a hit. It has a great buffet, with an eclectic mix of Indian food. The chicken tikka, butter chicken, and goat curry are just some of my favorites. The naan is always hot and fresh and they are give for free during the buffet. The samosas are crispy and the aloo mix within it is very good. I highly recommend this place for authentic Indian food, much better than Ruchi to me."], ["Tara M.", "This place is solid. I am a little discouraged by the other reviews,  I lived in NYC right near Curry Row and this place is up there with them. In my experience of Indian restaurants this place is much better than what you find in most cities Jackson's size. I have gotten take out, dined in and had the  buffet all are great. My favorite dishes include the Cholley Bhatura, vegetable Biryani,  Tikka Masala wrap and drums of heaven.  Another note, if you go in on Friday or Saturday night you will find the place full of Indian families from all over the state eating here."], ["Chaitanya K.", "Being Indian, I avoid eating Indian food in restaurants as I prefer home cooked Indian food. But being a traveling consultant, my spice cravings take over at times. During one of my cravings, I visited Spice Avenue for dinner. This is your average Americanized Indian restaurant. Nothing great but not too bad either. One of my suggestions would be to try their tandoori chicken. It is very well seasoned and grilled."], ["Dalin M.", "Eh. It's ok, for Jackson I guess. The chicken tikka massala had a slightly unusual flavor. Cinnamon or something. Not bad, but not what I was expecting. Doesn't come with a side of rice, even though that is pretty standard for most Indian restaurants. My naan was a little undercooked as well. Service was ok, though a little slow and nervous seeming."], ["Daniel G.", "Want to feel like you've eaten at an Indian restaurant at an airport...where you pay 5 times more for a small portion of food?  This is the place for you!I've been to this restaurant 3 times now, and every time I leave thinking...\"why did I go here...I vowed not to come back???\"  I always leave feeling cheated. I will eat at expensive restaurants.  Spending a decent amount of money on an experience is not uncommon for me.  With that said; the experience at Spice Avenue is not fancy. It actually feels a little dingy....nestled next to a fan store with bars on the window. The service is pretty good...although the folks poring water and changing plates aren't dressed particularly nice.  If you want service and don't mind paying for it, try it out. The food is not bad, just your typical Indian fare....nothing special."], ["Melinda C.", "Hubby and I are fans of Indian food.We were visiting my SIL and BIL for the Thanksgiving week and had my Mom along. And we had their 3 year old daughter, our niece, along for the lunch brunch too. Enough background info.Our BIL thought we'd like this place. The food was authentic. Naan was served, freshly made and hot, at each table. Even Mom liked the rice and several of the dishes. The spicy food didn't bother her at all. My favorite, chicken tikka masala and raita, were available, so I was happy. Hubby tried most of dishes offered and enjoyed them. Our BIL was right, we liked this restaurant a lot."], ["Rose K.", "Well, just ate at the lunch buffet because I was craving Indian, but unfortunately the craving was not satisfied. For starters, the food was lukewarm right off the buffet table. How??? I have no idea, but it was. The only items that were spiced well and delicious were the chicken masala and chicken tandoori. Delightful. Everything else fell short of every expectation I had for the restaurant. Nothing else was spiced or even tasted like anything. BTW Indian food has an array of wonderful spices and flavor notes, but only two items on this buffet fulfilled the criteria. And the naan was okay. Nothing special. So in conclusion, this buffet is okay if you like lukewarm chicken masala and tandoori and don't mind paying $13. Otherwise, find another Indian restaurant."], ["D.j. J.", "Stopped in for the lunch buffet, I d have to say it was pretty legit. All the basic dishes plus naan. Very friendly staff and a clean environment. I rcommend it."], ["Steve T.", "This place is pretty good for the Jackson area, but it is alright in terms of flavor at other Indian places I've been to in major cities. I had the mutton biryani and was good. All-in-all, it was a great experience here. I probably will go back again to try their lamb curry that I heard so much about."], ["Jil W.", "Our favorite restaurant in Jackson. I highly suggest the goan curry and the tandoori fish. Get the naan bread & be careful with the red sauce they bring out at the beginning....its great, but REALLY HOT."], ["Lin H.", "Ate here last Friday and was again impressed. The decor is not too fancy but all seems clean and the food is absolutely top notch.  Last week I had goat Bryant and it was GR8! My husband LOVES the hickey tikka masala and our friend Jeannie got the goat curry.  Even our non ethnic friend Ruthliked the pander cheese wrap! Wat can I say?  Wen we r in the area, this is where we come.  And that's hard for me cause I LOVE Keiffers & Walkers!"], ["Jennifer C.", "Great samosas, good butter chicken. better than ruchi indianThis place used to be a hole in the wall and now they made it kind of pretty-ish and very clean for a strip mall restaurant, but unfortunately the prices have gone up with the decor. the food is not as good as it used to be but i still like it.you'll end up spending bw 10-15 dollars/pp when you leavetry the mango lassis"], ["Stephanie M.", "Sweet Indian food that is without flavor.I love Rucchi and I want to like this place but their buffet is not nearly as good.Every thing I have ever had from here is sweet and without any seasoning.The plain decor is fine and I do like the glasses they serve water in.The music is usually loud and distracting.Food is boring to average."], ["Greg T.", "Addicted.  I rarely eat at spice avenue for dinner, but  the lunch buffet has my perennial favorites, as well as a few dishes that change to keep you on your toes.  If you have never eaten Indian this is a great place to try it out.   The buffet has a great description of each dish.  I recommend the Garlic Naan!"], ["S H.", "Pretty good for Jackson. At least it's good honest food and not some microwaved crap I can do better at home. The samosas where freshly fried and delicious. Seems that it is popular with the Indian locals."], ["Alan S.", "I am in awe of the negative review of this place.  They obviously didn't get  Chicken Tikamassala,  Palak Paneer, or the infamous DRUMS OF HEAVEN.  Maybe it's not the most aesthetically appealing restaurant, but the beauty is in the food.  Far from bland, in fact, packed with deliciousness,  Spice Avenue is some of the best Indian food I've ever eaten.Make sure to order the Drums of Heaven and some Garlic Naan (bread) with your meal.  If you are grossed out by the restaurant then you are a wus, but it's good for take out as well."], ["minimalist -.", "One of the two best ethnic restaurants in Jackson (the other is Aladdin on Lakeland Dr.).   Don't let the bait shop look of the exterior deter you (the inside has been renovated since they opened)  Spice Avenue has consistently good curries and several out of this world tandoori dishes (lamb Sikh kabob is a spicy standout).  I've been a dozen or so times and never had a bad meal.  The drums of heaven are a must if you are ordering appetizers and of course piping hot naan straight from the oven. The only negative experience I've had is when the wait staff all but pushed our party out the door the moment it turned 10 PM.  But the food is so good I'm willing to overlook this annoyance."], ["Chris M.", "I am a huge fan of Spice Avenue.  When I first discovered the place, more than half of the space was filled with Indian grocery items.  They have slowly gotten rid of the grocery store, and converted into a restaurant only.The food here is as fresh as any Asian food you will find in Jackson.  The Tandoori dishes arrive at your table still sizzling...filling the air with aromatic smoke and steam.  Their lunch specials are amazing.  The service is impeccable, but sometimes a little slow.If you like Indian food, this is the place for you.[c]"], ["Lucy S.", "The buffet would almost be perfect if it a) included samosas and b) went up abt 5 pts in the spicy scale...right now we're at a 3 ...and that doesn't wreak as much havoc on my sinuses as I prefer."], ["Kristin B.", "While I'm a long time diner at what is now called Ruchi Indian, and while both are run by Indian families, I'd have to say Spice Avenue is more flavorful and authentic.They lose a star for not having a lunch buffet though."], ["William S.", "Ate here last night and it was incredible. The only problem is that it is 80+ miles from my home. Great food, great service, I recommend the Seekh Kabob and Keema Naan. Go with a group like I did so you can sample lots of items. Everything we got was excellent. Went again and got the lamb vindaloo which was outstanding!"], ["Lacy W.", "Indian food is not my favorite but as Indian Food goes... this place is the best.  Also it's a good sign since real Indians from India eat here."], ["B P.", "I would give this place 5 stars, but they took away the vegetarian plate that I so enjoyed.  Their buffet does not have all the vegetarian dishes served on the veg platter.  However when my spouse and I have eaten here, we have always enjoyed what we have tried. The chicken is fabulous, no matter which flavor you choose.  One of our favorites is ordering garlic naan, which they serve up with fresh garlic and hot off the grill!  Fabulous!  And you can never go wrong finishing up your meal with a dessert there.  They are all good.  Service is good too."], ["emily f.", "i too, am appalled at the one star comment!  and why does every ethnic restaurant \"have\" to be a buffet?  can we not enjoy a sit down experience as well?  anyways...on to the review...i like to go here with my boyfriend and we always get the dinner special.  you get your choice of 2 meat or veggie entrees (comes in small bowls...i love the lamb curry and he likes the chicken vindaloo) and it comes on this big silver tray with an assortment of side dishes including rice, the vegetable of the day, lentils, chickpea salad, and rice pudding.  it also comes with naan and the yellow lentil cracker/chip thing...i always forget what that word is!  but it is delicious.  and the naan is SOOO yummy!!!and yes, the eating area is in the middle of a grocery-type environment, but in my opinion it just adds to the charm.  the waiters are also very helpful if you have questions about the food itself.  also, they ask you how spicy you want everything, and whether or not you want bones in your meat.  (i guess some people are picky like that.)  but i think without the bones it's a dollar or 2 extra.UPDATE: just went there tonight and they have completely changed the decor!  no more grocery store environment...very swanky!"], ["Margaret S.", "The first time I visited this restaurant it was awful, but I went a second time and had a fantastic meal! My significant other and many friends visit this restaurant often, and I recommend: Onion Bhajis, Vegetable Pakoras, Butter Chicken, and Goat Curry. The combo plates, either veggie or meat, are a great deal b/c they come with rice, daal, chickpea salad, and galub jamun in addition to 2 dishes, either meat or veggie or one of each. Attentive, friendly service and delicious food."]], "Taste of India": [["Tiffany S.", "I came here because of the Yelp reviews and was not disappointed. I ordered the goat curry (hot) and the garlic naan. Fantastic! And reasonably priced for the amount of food you get. Come prepared to share! This review is for dinner (ordered from the menu; not a buffet) on a Weds night about 7pm. Service was friendly and food came out in the amount of time I'd expect for freshly prepared food. I had a great experience and will visit again when I'm in Clinton."], ["Natasha K.", "Let's start this off with my ordering experience just now and I'll update once I pick up my food and try it. First off, the website and menu don't seem to be accurate at all, nor does the online ordering work. Then when I called to order over phone the lady said they don't even serve the items I was requesting (which I was reading off their supposed \"Indonesian\" menu options (yes I know it's an Indian restaurant but look at their online ordering menu); she also said they don't serve coconut naan, which was on their regular online menu also, so that was disappointing. She was friendly but couldn't make out what I was saying half the time because it was so loud in the background of the restaurant and she kept talking to other customers while on the phone with me. I sure hope their food is good....ok just tried the food and it was good! Decent sizes but a little pricey. The tandoori chicken was tender & perfectly seasoned. The restaurant was filled with Indian people, which I always take as a good sign :)"], ["Lee H.", "This is a preliminary review; consider it 3-stars with a bullet.  I plan to be back to let them earn another star or two. Like any newly opened establishment, if you visit in the first two weeks or so you can expect a few kinks. When we got there the place was packed with people literally out the door because there's not much room to wait. We were seated in about 10 minutes, not bad. The dining room is rather small, but nicely furnished with booths on each side and tables in the middle. Since I am no Indian food expert, the waitress patiently explained the menu. I am no redneck either, but her description of tandoori as \"fajita style\" and advice to choose a lamb curry based on the \"flavor of the gravy\" seemed somehow appropriate. After ordering an appetizer sampler plate, entrees, and water to drink, it became clear that the big party in the center of the restaurant was consuming all the resources. We waited a while before the water showed up. Once the big table got their food, our waitress returned to say our food would be out shortly. Clearly the kitchen was working at capacity. I asked about the appetizer. Oops, it was forgotten. No biggie, we'll get one next time. Then the entrees showed up. It was apparent that they were coming out as soon as they were ready. One entree, a few minutes later a dish of rice, then the other entree, but it was fine.  The food is the star here. The tandoori chicken was so good and flavorful. My son ordered it mild, but it was still slightly spicy, succulent, and full of flavor. The kadhai lamb was tender and the rich gravy was garlicy and delicious. Worth the wait!I suspect over the next few weeks this place will have more staff and create a smoother dining experience. I'll be back to check it out  soon!"], ["Mansi J.", "We stopped by this place for dinner while we were driving from Louisiana to Arkansas. We reached at 9.35PM and the lady there who took care of us was very welcoming and considerate even so late. Since it was late, we were damn hungry and had no other options for indian food nearby, we just entered this place without any expectations. Usually, indian food isn't up to our expectations whenever we eat out, but here the food was excellent!!! We ordered dal tadka, paneer makhani and tandoori roti. I have never had such amazing Indian food anywhere in the US.. Yesss no where in US!  I am very picky when it comes to food. The dal tadka had this authentic North Indian Punjabi taste and paneer makhani was delicious too! The rotis were to die for... Hot , crispy and with loads of butter on the top of them :D .. Rice came complimentary with dal tadka.. The lady who served us was very friendly (don't know her name) and she provided us with onions, lemons and green chillies.. Total dhaba style! It was like cherry on the top :))I felt as if I was back in India!I recommend this place to each and everyone out there! I would definitely visit this place again even if I will have to drive some extra miles!"], ["Kayla R.", "My boyfriend and I decided to check this place out because we love Spice Avenue and Indian food in general. We were seated promptly. It's a medium sized room with a the middle having open tables for seating and the sides have booths. The ladies in the staff wear these beautiful vests adorned with tons of costume jewels and sequins. No surprise considering there's an Indian fashion store attached. Nice touch. Speaking of staff, they are all very friendly. You can tell that they're young and new to serving, though. But it's ok. I ordered the Butter Chicken in medium. I'm pretty sensitive to spice and this was enough for me. It was garnered with fresh cilantro in a small silver bowl. The sauce was good. The chicken was tender. My boyfriend had the Chicken Tikka Misala in Indian hot. Super hot. But he said it was very flavorful. One thing that is different here is that the naan is not free like Spice Avenue. But I have to say it is better. For plain naan it's 2.00. Then they have an assortment also available for varying prices. There's also an Indian bazaar and clothing store connected. I'm definitely coming back to peruse that. They also have a lunch buffet. So I may be back to try that. All in all, it's ok. Spice Avenue is closer for me. So if I did come back it would be because I'm closer or to check out the bazaar. But if you're close and you like Indian, check it out."], ["James H.", "I would eat here every day if I worked in town.  Food quality is stellar and consistent.  This is my fifth time to eat here. Tons of flavor.  Lunch buffet is great and not hot.  4 or five meats to choose from, all fresh.  All are different flavors.  The buffet has different food every day. If you aren't eating here, then you are missing out.  This place is great for two or a group of 8 to 12.  Service checks on you frequently.  The connected store is fun to walk through after a meal."], ["Mary Tabor B.", "If you want a true taste of Indian culture with no dramatic Americanization, this is the place. They serve food in communal, easy to share plates, so it is great for big parties. They also give you an \"Indian hot\" option, which is fun if you can't find the right amount of spice usually. It was a fun place to eat!"]]}