{"Pastabilities & More": [["Cindy T.", "I've visited Pastabilities & More several times now, at both the new location and the previous.  I do have to say that I really like the new location, it's easy to find, has plenty of space while still feeling \"cozy\".  I'm really excited that they have expanded into the space next door for events with the catering side of the restaurant.  Everything I've had so far has been outstanding.  Freshly made in house sauces.  You can build your own entrée, choose the pasta, the sauce and the entrée to combine it with.  I love the Eggplant Parmesan.  Nice sized portions on everything I've seen so far.  They also have interesting specials, today it was soft shell crab po-boys.  You don't see that everywhere around town!  The owners and staff and super friendly and very accommodating.  Great place to take the family!"], ["Renee L.", "Very nice workers and very good fresh food! The price is very affordable as well. It's a new hidden gem in Clinton. We will be back!"], ["Jake L.", "Took the family there. The food was very good. I had angel hair, white sauce and chicken. It was a good portion, excellent pound cake. I would go there again."]], "Mazzio's Italian Eatery": [["Ashley G.", "Buffet Pizza and Salad Bar? Yes please. This is my favorite pizza in Mississippi and if I get it in a buffet form, even better! They have all the normal pizza types (pepperoni, cheese, mushrooms) to the more fancy (jalepenos, hawaiian, even dessert). The service is very accomodating and you can normally request a type of pizza and they will make sure it's at the buffet. Overall this place is a good lunch spot and I will always enjoy it!"], ["Scott R.", "Absolutely terrible, do not waste your money. Un clean, food is abysmal,Always some cook or waiter standing outside smoking cigs. Grosses me out"], ["Jason B.", "ok salad bar and ok pasta ok pizza was not bad.  waitress was very nice."], ["W E.", "No! Next choice please"]], "Pizza Hut": [["Molly M.", "Delivery was prompt and arrived at exactly the time i was given on the mobile site where i placed my order. Pizza arrived hot,always a plus. We ordered one large pepperoni lovers,one large meat lovers,and one of the new special pizzas, the \"garden party\". Pepperoni and meat lovers were their usual delicious selves of course. The Garden Party pizza was very good,seemed a bit overloaded on the thin and crispy crust however due to the large amount of veggies but no bother,was very good. If i could complain about anything it would only be that the balsamic drizzle on this new pizza set the sweetness level into overdrive,since the veggies on it are all very sweet. This pizza is Sweet SWEET SWEET. All in all, great pizza,prompt delivery as always, and of course will order again as usual."], ["Tori R.", "Ordered a medium Pizzia and cheese sticks online called to add extra marina with my cheese sticks arrived 10 mins past expected time to find out  delivering the wrong pizza delivery girl advised me my Oder was delivered to the previous customer. Next delivery guy then brought me the pizza I ordered but no cheese sticks with marinara sauce The pizza was cold and soggy after calling upset that I got kids cranky and hungry and 2 missed deliveries already called in to address the issues employees were rude over the phone and told me they would recook and deliver it to swap out the pizzas so I have to put the Pizzia away from the hungry kids so i can get wat I have paid for. Waiting 40 mins for the final delivery took my Pizzia and asked me if i had any other pizzas?! Poor poor poor customer service I'm not one to complain and I think this is maybe my 3 review but just really got under my sink to have it all happen and not to even apologize I work in customer service and it's just unacceptable!"]], "Little Caesars Pizza": [["Eric T.", "Cheap and fast, the pizza is nothing to write home about, but for a quick eat it works.  There pretzel pizza is however good as is some of their specialty pizza.  Great for kid parties etc..,"], ["Amy S.", "If you are looking for a hot, large cheese or pepperoni mediocre pizza for only $5, then Little Caesars is your place!  They have a drive thru at this location, so I've never actually been inside.  Just pull up to the window, tell them what you want, and within mere seconds your order will be in your hands.  Service is friendly and you'll always get a smile.  It's fast, easy, and convenient.  Oh, and I did mention mediocre, right?  But hey, you get what you pay for.Even though the pizza is mediocre, I do really love their crazy bread.  Sometimes I'll go there just for that and that alone.  Good stuff!  If you haven't tried it before, grab some the next time you go for your mediocre pizza.  =)"]], "The Pizza Shack": [["Ryan K.", "The Pizza Shack blew me away.  For my first visit, I had simply \"heard\" it was good.  Stepping in, I took a look at the menu, and chose a personal pizza.  Not knowing those were really pretty big, I got the garlic cheese sticks to go along with it.  Long story short, for 6 dollars and change I got a whole pizza pan worth of cheesy breadsticks.  I ate like a pizza king for 3 days.Recommended:  Chicken Curry delight, The Greek."], ["Ian M.", "The pizza is incredible.  Thick and loaded with toppings the small is plenty for a normal adult.  The price seems a little steep for a small pizza but then you get it and realize it's the weight not the diameter.The restaurant area could use a little work, maybe some tile or a coat of floor paint.  And hot?  Yes hot.  A little A/C would be nice.  It is Mississippi after all.Very close to Finians Pub so if you have a teeny too many marteenys grab a slice while you wait for your cab."], ["Melissa M.", "Yum.  These pizzas are for the serious pizza lover.  I'm a vegetable fan and ordered a personal size - Veggie Deluxe with mushroom, tomato, bell pepper, onion, and green & black olive. The box was hefty, to say the least.  The pizza was hot on a medium deep crust and LOADED with vegetables. It was probably 3\" thick.  Two slices was a meal for me.   We also got a BBQ pork pizza and a Greek pizza that had feta, olives, artichoke hearts, and gyro meat.  These were different than anything I've had and delicious, as well. They do not skimp on the toppings and the taste is spot-on.  The vibe is casual, so you can drop in any time.  Pizza Shack is a local place, so if you are in Jackson, you need to try it!"], ["Blue A.", "Can I just say this was TOP 5 best things I have ever ate. In the history of everdom! Seriously, I pinky promise...this was one of the MOST DELICIOUS THINGS I HAVE EVER ATE. WOW!First off - this place is super casual. It's the type of place I'd come to after a night of drinking (not even sure if they are open late)...it's got a large menu...and there was a ton of movement in here around lunch time. Mainly takeout, but some dine in tables as well. All different kind of folks - from young to elderly, all races, all genders. Pizza Shack's demographics are simple: EVERYONE that loves delicious, affordable grub.I got 6 wings...because I hadn't had wings in a long time. I got the mild sauce. And yes, they were delicious. They didn't ask me what kind of sauce I wanted, and they just brought Ranch. That's cool...I really wanted bleu cheese, but the ranch worked out great.While the wings were great - they weren't TOP 5 of all time worthy. No, no. They were SOLID (as in...GET THEM!) but the real start of the show was:DOUBLE.CHEESEBURGER.PIZZAWHOA.Double ground beef - which was in perfect little meat balls. Seasoned exceptionally and stacked on there generously. A sweet tomato sauce unlike any I have ever had. Chopped up pickles and onions mixed in with ooey, gooey American cheese. Then the most heavenly thing ever: a top crust of crispy,melty cheddar cheese...all the way to the edge (admit it those little burnt cheese ends are THE BEST). Seriously, this was incredible. Thin crust, but the toppings are so thick this is more like a deep dish pizza. The small was too much for me to eat - I left half of it. I would of taken them home, but I don't think eating it cold would do it justice.Awesome lunch - worthy of a nap afterwards. Will be back to try something else when I am in town!"], ["Donna N.", "My pizza cost me my first born child, but it was worth it.  I ordered a veggie pizza with added pepperoni and it cost me $20 for eight slices.  But you know what?  It was worth every penny!  My pizza was so heavy and loaded with toppings that I had to keep a tight grip on the box.  It wasn't too doughy and it was wasn't too crispy.  It was just right.  This will be one of my go to places when I return to visit later in the year."], ["Sarah T.", "I love the pizza here. You can't really go wrong, even if you're lactose intolerant like me! The quality of the pizza and sauce could really stand alone. It's a quirky little place with some bangin' pizza to match. Definitely try this place out!"], ["Rachel P.", "I am not kidding when I say I judge the people I meet in Jackson by whether or not Pizza Shack is their absolute favorite pizza place. Not only in Jackson, but in the WORLD. Okay, I'm being a little hyperbolic but Pizza Shack is seriously so legit, you guys. I can't imagine getting pizza anywhere else in town. First of all, the pizzas are BIG. They boast that they are \"Mississippi Style,\" rather than New York or Chicago style, and let me tell you-- I think \"Mississippi Style\" must be my favorite style. The toppings and cheese are piled on, so be prepared. When you order, go for one of their specialties rather than a basic cheese or pepperoni and be ready for a very special experience. I have tried all of their pizzas (wow, that's quite a feat to admit to) and I don't have a negative thing to say about any of them. My favorites include the chicken alfredo, the chicken curry delight, the thai chicken, and the cajun joe. Even their \"traditional\" pizzas, like the Hawaiin or the vegetarian, are uniquely and excellently prepared. The ingredients are quality, the crust is thick and flavorful, everything is fantastic. They've also got a small but respectable selection of beers both on tap and by the bottle available for purchase. Their fountain drinks are Pepsi products.The interior of the restaurant is modest at best. I mean, it's called Pizza *Shack*, y'all. There are picnic tables outside, though, and that's a really fun place to sit and enjoy some pizza with pals when the weather's nice. Pizza Shack is located right in between Kat's liquor store and Fenian's pub, so it's the perfect beginning to any fun night you've got planned.Pizza Shack is not your cheapest option, but it's by far the smartest decision you could make this week. It's perfectly reasonably priced-- in fact, it's a downright steal when you realize how MUCH food you're getting for your buck. I literally daydream about this place, and it's probably the restaurant I frequent more than any other place in the Jackson Metro Area. Go to Pizza Shack RIGHT NOW and experience it for yourself!"], ["William H.", "Holly Molly is all I can say. This place has ruined it for me now pizza anywhere is just OK!! The carnivore is a must if you like sausage. You have to go."], ["Gary J.", "Look nowhere else for pizza in the Metro Jackson Area- or southeastern United States for that matter.This pizza \"shack\" is more of a Meccha for those religiously devoted to fantastic pizza.  It would by more appropriately called \"Mystic Pizza.\"  The Julia Roberts' romantic classic movie title squandered this name which should have been reserved for this establishment. This restaurant did not just leave me full, it left me spell-binded.  It now has a mystical hold over my tastebuds and summons my inner pizza loving spirit. I have read the complaints below about the price. These commentaries overlook the fact that two slices of this pizza will feed even the beefiest of our friends. Essentially, yes--it is going to cost you.  However, you will be rewarded two-fold for your dollar.Trust me. Bite in. Absorb it. No need to abandon your loyalties to the commercialized  big pizza chains.  One bite of this mystic pizza and you will forsake all of these devotions. Embrace the mystic hold this round shrine of rich cheese and abundant protein will have over you."], ["Anna W.", "Nice little pizza dive in the Belhaven area.  The pizza is so amazing, and it is especially fun to go when the weather is nice and you can sit outside.  Last time I got Bar-b-que chicken pizza and got extra ranch sauce--- it did not disappoint.  This is especially a great place to eat if you live in Belhaven because you can just walk there!"], ["Bradley A.", "The Carnivore is a great name for a meat lovers pizza.  And I love the pizza places that just pile on the extra ingredients instead of spreading them out--and this place piles them on.  There specialty pizzas are loaded down with ingredients. The supreme (sub jalapenos for bell peppers) was great as well. Solid pizza place."], ["Danielle H.", "I have eaten pizza all over this fair country, from the west coast to the east, and the pizza from Pizza Shack is some of the best I've had. I ordered the deep dish/pan pizza style, with cheese and green olives, and I was nothing but impressed! The crust was that perfect burnt-cheese-crunchy style, the green olives were on-point and the cheese was of high quality.My boyfriend and I were starving and really just wanted pizza close to our hotel, but we ended up really liking Pizza Shack and will definitely eat here again if we ever return to Jackson!"], ["Molly G.", "Super greasy pizza. I prefer Sal and Mookies or Basil's in Fondren (although Basil's isn't open often)."], ["Giovanna F.", "We got our pizza to go. I didn't get the oozing cheese as others had mentioned. The pizza layers were a bit odd for me. Crust, sauce, toppings, cheese, then more toppings. Almost too much toppings. I guess I am just a pizza purist. I like keeping my pizza simple (thin crust, sauce, cheese and a few toppings). If i ordered the thin crust it probably would've just collapsed in my hands. That's what this pizza did. I picked it up and all the toppings slid off. The sauce wasn't anything special. The sauce and cheese make a pizza. I didn't get that here. It was all about packing on the toppings. It looks good in photos but eating it is another story. My mother in law had a the Asian chicken salad. It was just plain lettuce, canned chicken, a few sesame seeds, red peppers and crunchy things. Don't order salad here either. I was surprised that they even had Asian chicken salad on the menu. Doesn't really go with Italian."], ["K H.", "Recently heard that they had opened a location in Byram.  Since the old location on Fortification was so good, I thought that location would be also.  A huge disappointment.  Terribly slow service.  There were not many others dining in but seemed there were a good number of care outs.  The employees seemed to be talking among themselves and not taking care of business.The diet Coke spigot was empty and the diet dr pepper spigot leaked all over my hand.  The pizza was not good.  There was almost no sauce and the meats were stacked up.  just a big glob of cheese and meat.  It just was not appetizing.  I won't be going back to the Byram location-- a major disappointment!"], ["Count D.", "This is my favorite pizza place for non-traditional Neopolitan/D.O.C. pizza I have ever eaten at, in the entire USA. Period.The gloriously generous amount of toppings, the piled on cheese, the variety, the friendly staff; everything about this place and the pizza are phenomenal. I just love the pan-finished crust. I didn't notice it first few times but my most recent visit it was very evident on the double cheeseburger pizza.It's now my mission to try all the different kinds of pizzas they offer at least once. My current favorite: the curry chicken pizza.If pizza shack had a location closer to me (Clinton), I would need a coronary because I would go like every day. I can't resist!"], ["Coral E.", "How do I not have a review already for Pizza Shack??!!  Probably my favorite pizza in the Jackson area.  Saying that, I highly recommend the Turkey Club and Chicken Alfredo pizzas........and the Sloppy Joe.  Pizza Shack does it all well.Great atmosphere, great service and don't forget the newer location off of Old Canton Road - it's just as good and great for a bigger group.  They also have a great selection of beer and bottled soft drinks that you can't find everywhere."], ["Jacquelyn H.", "Great location and really good salads and pizza.I had a customer service issue several years ago and the owner went out of his way to make it right.Everything is made to order and tasty. Good selection of beer too."], ["Maria W.", "Good pizzas, but too much cheese and not really enough flavors. My dad loves this joint and glad Jackson has upgraded. I cannot stand that the staff loves to stare its quite annoying. Eating outside is enjoying, but they don't have a separate smoking and non-smoking area. I don't like the smelling smoke when I eat, ewww. Anyways, expensive beer, and ok pizzas. I've tasted better, but honestly I had to give it to Jackson for FINALLY DOING SOMETHING DIFFERENT!!!! I would recommend."], ["JJ S.", "Really good pizza. Local place so it does cost more than a chain place would. However they also have better quality ingredients than chain places. The carnivore is a meat lovers dream. Another must get is the pulled pork. It has a tangy BBQ sauce and some cheddar mixed with the mozzarella. Can take a while during rush hour meal times."], ["Duan C.", "When I was working downtown, I would go here for lunch.I would usually get the classic italian sub sandwhich or the chef salads, both were pretty tasty. I would never give the pizza a try, due to two things, the price or didn't have the taste for pizza.Well one day, me and the better half went to the Jackson Free Press' - Best of Jackson Award show and sampled some of the grub. Pizza Shack had a booth set up and were giving away samples of their pizzas. I tried the Cajun Joe, which is made up of nothing but goodness! I know it had andoulie sausage, but I was too busy salivating over how damn good the pizza was.They load you down with toppings and the cheese, sauces are fresh.We ordered the large supreme and it was worth the $19. We couldn't even finish the thing.I took pictures of the large supreme we ordered, god I wish these guys delivered!Anywho, check'em out and see what they have to offer for yourself. I doubt you will be disappointed."], ["Amy L.", "Ordered a couple of pizzas to go today. Even gave them the order in handwritten form. Neither pizza turned out right and there wasn't another person in the place. This is like the third time this location has screwed up a simple order. The Colonial Mart location never has an issue getting the order right."], ["Russ M.", "GREAT PIZZA! Suggested by me brother and SIL, Pizza Shack is the real deal Pizza Place. Local, one of a kind, small with a funky decor including some cool original art. But, the star is the food! Lots of choices for specialty Pizzas. We had the supreme which was absolutely yummy. Like other Yelpers have described, lots of toppings. Brother and SIL had a shrimp alfredo pizza, it too was delicious. I was impressed that the shrimp were not overcooked. Also, the pizzas are bigger than most. The \"medium\" was the size of a large at many pizza places.I just wish they would open a branch in Tuscaloosa."], ["Rachel F.", "Man this place has some solid pizza. I had missed you Pizza Shack. One thing to be said about Jackson, MS is definitely the awesome food. This spot is amongst those. You can't go wrong with any of the pizzas. Or even the amazing cheese sticks with pepperoni and jalapeno (or whatever floats your boat toppings wise) makes for a pretty great meal. The pizza is crisp at first bite but nicely soft on the inside. They don't play around on the toppings either. You probably won't need as much as you think. I personally love the BBQ chicken. Yum. Also love that they moved down by Fenian's. Still walkable for Belhaven folks, but now it is easy and convenient to grab a bite and then grab a beer. Granted, the patio area isn't quite as awesome as it was at the State street location, but what can ya do. And it is a bit of a dive - be aware if that isn't your deal. For a more upscale spot try Sal and Mookies. But Pizza Shack is great value for the money. YUM!I will see you next St Paddy's Day!"], ["kashif s.", "Great pizza.Pizza is on my top ten list of foods. Anywhere I go I'm sure to try the local pizza.As someone else stated...I don't think I've had a heavier pizza! Thing must have weighed 10 pounds.Although I love extra cheese, I think one can make do with regular cheese on this bad boy!"], ["Louis F.", "I really want to love this place (everyone else does), but it is very hit or miss. I've discovered the best chance for delicious success is to order a small pizza, otherwise they end up a sloppy, soggy, greasy mess.   But when they are good, they are very good.Nothing bad to say about the service, or staff. It is a really friendly, local place, and I love their new location on Fortification (and that they took over a previously unoccupied eyesore).Small Buffalo Ranch Chicken is my favorite menu item"], ["Jennifer C.", "Good pizza, ok wings, GREAT price. There's nothing special about the crust or the toppings, but it's a great local joint and has really good prices compared to sal and mookie's down the street . easy to order out.Pizza to try: Greek with chicken and/or gyro meat, make sure to ask for all the toppings including artichoke, onions and feta cheeseBBQ Chicken pizza - my friends love this pizzaCheese sticks -really good, my favorite thing to order here. so cheezy and perfect.My husband says the wings are ok, they are not very crispy. plus down the street there's a wing place called wingstop now that has better wings that are crispier and offers good french fries."], ["Preston M.", "Seriously the best pizza in Jackson. It's not Chicago deep dish but it does not matter. They overload the toppings on their pizzas and that's a GOOD thing in my book. The sauce is usually very good. Usually. Nice variety of beers on tap and bottled. Plus a nice patio area.Definitely check this place out if you like pizza!"], ["Jakob c.", "The BBQ chicken pizza is so good I would eat it off of Robin Williams' hairy chest. I moved from Jackson to Austin, TX five years ago and I always have to munch out here on visits. When I eat pizza in Austin, I close my eyes and try to pretend it's Pizza Shack. The pizza eats like a d@mn lasagna there are so many toppings. I'd eat one with horse meat on it if it came from their oven. I want to punch myself in the face right now I want one so bad. Mmmm. Pizza Shack. Melty cheese everywhere."], ["Kristin B.", "I'm a veggy pizza fan, tried and true, but I'd have to say that Pizza Shack always delivers a slightly soggy crust on the veggy pizzas (likely to avoid burning the more delicate toppings.) Instead, try the carnivorous types - they are always crisp and delicious.I like grabbing their turkey club sandwich at lunch time - I swear the put a whole turkey between two slices!"], ["Toni F.", "The employees at Pizza Shack are super nice! Even when you screw up and call your order into the wrong store. Sorry bout that. Thanks for being cool about it. I love the classic Pepperoni. Its stacked high with toppings. The Margarita is my next favorite and my husband loves the Cheeseburger. All of the pizzas are great!!!"], ["Chris and Tami T.", "So we had some Pizza Shack because we were hungry and it was late. OK, look.  Chris has told me so many stories about Pizza Man in Covington, LA that any restaurant that starts with PIZZA and ends with either a locale or an animate noun I have to enjoy with a great deal of pause because allegedly Pizza Man is the best in the world and we won't go there until TOMORROW so it's really hard for me to concentrate, clearly.I think the named locale of this pizza was appropriate.  It's pretty shacky pizza.  It's a good place to go if there is no other shelter and it's cold/raining.  But you probably don't want to have a wedding there.  BTW I am marrying pizza man."], ["Trey F.", "After traveling all over for the past 3 years. There is still no better pizza in my opinion."], ["Russ F.", "I ate there for the first time last week and had the Carnivore. Excellent Pizza"], ["Darius M.", "Hands down the best pizza in Jackson.  I usually get the Carnivore or BBQ Chicken w/ Bacon Pizza.  The staff is friendly and the service is good.  My only gripe would be that the prices are getting a little high; but it's not bad for an every now and then thing."], ["deidre s.", "Preeety Damn Delicious Pizza. Ordered the chicken curry pizza w/ pineapples w/ my co workers and I think we stopped mid convo just to gobble up every last peice. And Thursdays are 3$ pitcher of bud/bud light. Get a pizza, get a pitcher, sit on the patio, enjoy :)"], ["Ron M.", "By far the best pizza in Jackson!  Barbeque chicken is my personal favorite, but I really don't think you can go wrong in choosing a pie.  The \"shack\" definitely doesn't provide the same atmosphere as the popular Sal and Mookie, but I suppose that is part of its charm.  I always seem to lean towards hole-in the-wall local favorites over the grander-scale tourist traps.  Their awesome patio feels far more intimate than the crowded booths and tables at most places.  This restaurant is a prime example of why it always helps to ask around (and yelp!) instead of settling for mediocrity."], ["Alan S.", "Awesome pizza and wings, good price. They have a large selection of specialty pizzas and wing flavors, the Greek being my favorite pizza.  They load up on the toppings and serve a variety of beer as well; both can be enjoyed outside on the patio.I strongly recommend the pizza rather than one of their subs.  Also, when it's busy, do not expect quick service.  It's perfect if you want take out or if you just want to chill and drink a few beers while waiting."], ["Su B.", "Best pizza in town! Need a safer location, but amazing pizza!!!"], ["Big C.", "This joint is THE BUSINESS! Cold beer, delicious pizza (get the Thai Chicken) and a hole in the wall feel with the option of outdoor dining on a nice day. And rumor has it they're opening a location up in Colonial Mart."], ["Gary A.", "The pizza is top notch, not the average run of the mill pizza.  The atmosphere is a \"DIVE\" but in a good way,  the way you'd expect a pizza-joint to be.  The have some really great topping combinations!"]], "BRAVO! Italian Restaurant & Bar": [["Rachel P.", "Bravo is definitely one of the nicest restaurants in Jackson, and one of my favorites in the North Jackson area. It's a great spot for a date night if you're looking for dinner, but the lunchtime vibe is much more casual. It's a great spot to grab lunch with a colleague. I've done dinners here with groups before, as well, and it's always worked out really nicely! They do a great job accommodating groups as long as you plan ahead. It's an \"Italian\" restaurant, but definitely a Mississippi take on Italian. The portions are very generous, so be prepared for that. Bring your appetite. Everything I've eaten here has been genuinely super delicious. The pastas and salads are always on point. I'm a huge fan of all their seafood dishes. The desserts here are so good, but HUGE so plan on splitting them! Rather than get dessert, I usually opt for one of their after dinner drinks with kahlua or some other liqueur. They're all really, really well made. Like I said, this is definitely one of the nicer spots in town. Think white tablecloths. Don't show up in your Nike shorts, is what I'm saying. The servers here are super professional and knowledgable. They're always ready with a recommendation for a wine pairing and they know the menu extensively. It might not be the most creative menu in town, but it's a delightful and reliable place. If you're looking for a date night or need to head somewhere nice with out of town guests, Bravo is an excellent choice."], ["Gary J.", "Current title: \"Bravo!\"-- is inaccurate and self-aggrandizing.  More appropriate title: \"This will do but there is much better elsewhere!\"I ordered the veal parmesan.  I made better Italian dishes using sub-rate utensils from Family Dollar in my small and low-rent college apartment with McCormick packets.The patrons seem to be of upper middle class origin.  The kind that likes to feel rich but are not rich.  Everything is a la carte.  This business makes representations that it is a classic Italian eatery but fails to deliver.  The only thing that makes it similar to classic Italian haunts is that everything is a la carte and exceedingly expensive. Now that the rant is out of system, let us coldly and logically examine \"Bravo!\"  Nestled in a swanky shopping center in north Jackson, Bravo carries the promise of exquisite dining as the wine glasses ring at the counter.  The restaurant has a rather lengthy and impressive wine menu.  The bartenders act with expert timing, although they refrain from Kung Fu fighting. The food you might ask?  I observed 3 dishes and ate one.  My first observation was a splendid bowl of catfish and andouille in a gumbo (not even remotely Italian, but we will leave this here).  The next was salmon presented in an organized manner with an excellent looking cream drizzled over it.  My final observation was the pork chop, served bone-in, over mashed potatoes, and covered in a delightful mushroom gravy. I ate my veal parmesan--begrudgingly.  A fellow dinner guest allowed me to taste the pork chop.  This was a very incredible bite.  A bite for the ages and to be indelibly recorded in the  annals of yelp.  However, I did not order the chop because the waiter, in a stroke of fate, failed to suggest it to me. The pork chop quickly stole the limelight of our eyes and our conversation.  It was plated perfectly, at a healthy 8 oz, and bespoke its imminent greatness.  Meanwhile, I muscled through my so-called veal parmesan [sic].  Allthewhile, I was eyeing the pork chop.  After time, the artificial candle light reflecting downward brought out the sheer redness of the marinara.  It was as if the veal was looking to me longingly it kept catching me stare at the pork chop on the other plate.  When dinner was over, I had only eaten the meat of the veal and allowed the dry pasta and wilted greens served alongside of it to grow cold into the night.  As the waiter brought the check, I looked over at that young couple by the window and reflected how much in common I had with that veal parmesan."], ["Ryan K.", "Bravo! is a great local stop in north Jackson with an award-winning wine selection.  While I can't say I was put over the top with all of their dinner entrees, their pizzas, appetizers, and deserts are fantastic.  Of particular note, the Shrimp Basil Pesto wood-fired pizza: savory, rich, and filling for the price.I'd recommend Bravo on the later side of the evening when you need to cool down with a great glass of wine and a very friendly staff."], ["Ryder T.", "I am having a really hard time deciding if this is a 3 or 4 star place. I'll settle on four stars because the food is good and is genuinely good quality. The service is typically very good too. From time to time they will have a special that truly delights.For a very long time, Bravo! Was basically the only nice restaurant in town, and to some extent, I feel that they have just coasted along on that reputation. I don't really know that much has changed as more restaurants have popped up. That is not a terrible thing, but now we are used to going places where we can try new and exciting things all of the time. Bravo is not *exciting* but it is still very good.This is a lovely white tablecloth sort of place. The waitstaff is typically a cut above other restaurants in Jackson, so this makes it a safe bet for a nice date.One of the cool things about Bravo! is that even if it is not culinarily that cutting edge, Jeff Good keeps the business side interesting with promotions that are appropriate for a nice place. You have to pay attention to their emails or twitter, but one creative promotion they did was a \"cellar clearance auction\" where you could bid on very nice bottles of wine from their cellar. If I recall correctly I got what was probably the best bottle of wine I have ever had for half off.It is worth knowing this restaurant, but there are just much more exciting places in town as well."], ["Kayla C.", "Hiding in the upstairs level of the Highland Village is where you'll find Bravo. They're known for their Italian food, and rightfully so. I've been to Bravo several times and have always had a great service and dinner. I took my parents here for their first time and they fell in love. We had the sampler appetizer plate, which was almost filling enough! It had goat cheese, rosemary mushrooms, eggplant, cooked garlic, and lots of other goodies to stick our forks into. For my dinner I ordered a small tomato basil soup and a half Spinach and goat cheese salad. I always get the salad, it's absolutely wonderful. The dressing is a warm balsamic and ummmmm just yum. I got a half size and I was more than satisfied. They offered us free dessert for asking us to move tables when we first arrived, so why not? The menu had so many options it was definitely had to choose. I saw they had after dinner drinks so I ordered a toasted almond. It was SO good as I love almond flavors. It was a shaken mixture of Khalua, half & half, and amaretto. Some other things probably. The table ordered the brownie with ice cream and I got a bite of that too, so yum. Overall, our waitress was SO sweet and fun. I will bring my family back here."], ["Elizabeth B.", "Came to Bravo! Italian Restaurant & Bar yesterday for my brother's late birthday Lunch. It was good, I had the Tri-Colored Tortellini w/Chicken, it had Artichokes, Mushrooms, Spinach, Red Onion & Roasted Red Peppers in it and it had a Tomato-Cream Sauce on it. The Pasta was good and the cheese inside was good, however I would of liked to have, had a few more mushrooms and artichokes in it. I also had Tomato Basil Soup, it was good but I wanted a little bit more basil flavor in it. Then I had the Tiramisu and a Single shot of Espresso, they were the best thing I had at the restaurant. Can't wait to come back and have more."], ["Dom T.", "I was offered a gift certificate and a chance to make things right from my last visit, but decided to give the place a second chance on my dime with some friends. This wouldn't be a fair rating if it was paid for by Bravo. We had four different appetizers and all were delicious. The staff was courteous and pleasant to deal with. I didn't notice any employees on their phones, which is always nice. Bravo, perhaps my last time there was just a bad night for you. Or perhaps someone decided to tighten things up around there. Either way, good job! I not only recommend Bravo but will return, very hungry."], ["Sam S.", "Bravo is my wife and my absolute favorite restaurant in Jackson. The food is always perfect, service is top notch. If you haven't tried it yet you need to. The restaurant has a fancy feel without being over the top. The atmosphere is great for small groups, families, and especially couples. The servers are at friendly, professional, and efficient. This is one of the few restaurants that can always keep my drink cup full (a true feat since I drink water ridiculously fast) There is a bar area that I've never sat at, as well as traditional seating. The restaurant doesn't take reservations. It can get a little crowded on weekends after six, but it is worth the wait. As far as food there is everything from the ten dollar range up to mid thirties. I'm a bit of a cheapskate, so I've really only tried the sub twenty dollar options. My favorite is the chicken sweet potato Gorgonzola salad. My wife really enjoys the shrimp and pesto pizza. As appetizers go they bring you bread with olive oil for free. My favorite to order are the fried polenta - fantastic if you like mushrooms, and the fried brie.  They have a really impressive wine selection. I've only tried a few of the cheaper wines - around 24 bucks a bottle, and have been incredibly happy with the taste of them. For desserts you have got to try the peanut butter pie... Simply amazing. They have other options that are great as well, but the pie is crazy good. I have been personally greeted by the owners several times, which is really a nice sign in a restaurant. You can even check out the full menu with prices online, which is great. To conclude, I am sure you will be happy if you choose to eat here."], ["Camille M.", "The grilled chicken salad with Gorgonzola, diced sweet potatoes, dried cranberries, walnuts and vinaigrette rocks! The tomato basil soup is really yummy too- very creamy and rich. I also highly recommend the pizza and the Caesar salad. They have a full gluten free menu for those of you with special dietary needs. Love coming to bravo when I'm in Jackson. Great happy hours too! This is an easy, fun spot.. One of my Jackson stand-bys!"], ["James J.", "View: the view is not spectacular.  But , I like the atmosphere.   It is very upscale but not crazy prices.  It is right off interstate 55 in North Jackson Mississippi. Prices: prices are not too bad.  You can get an entree for twenty bucks or less.Waitstaff is good.  I have never had bad service.   I read some of the reviews about the service being bad but that has not been my experience. Food: I like the bruschetta and I have them add cheese to it.  I also like the paneed redfish.  it is lightly flowered and is really good.I have eaten here a lot ad if you like wine they have a wide selection. I would recommend this place to eat.  So if you are coming to Jackson you should try this place."], ["Orlean S.", "Visited Bravo for the first time over Memorial Day holiday. Thankfully it wasn't busy and we were seated fairly quickly. The décor is nice but not fancy. The server was extremely nice and relatively attentive. With many high dollar restaurants you never know how much food will you get - is it enough you don't need to order side items or will you pay a lot and still leave hungry? So each of us ordered an appetizer; me the grilled portobello mushroom and my guest the pecan crusted brie. Both were surprisingly large and enough to share. The Brie was especially tasty. Then we each ordered a half spinach salad which was a nice size and very appetizing with goat cheese, candied nuts, and sweet dressing. The main course for both of us was the specials for the night; Crab crusted amberjack for me and salmon with fried green tomatoes for my guest. For $28 I was underwhelmed at the portion size of my plate. It was a small piece of amberjack with about 3 sliced new potatoes. I was left guessing what \"crab crusted\" meant as I saw no crab. The salmon special was better in both size and presentation. While the size of the fish wasn't notable, there was about 4 fried green tomatoes along with corn and a couple of green beans. But again, not what I was expecting after the large plates of appetizers and salad.For dessert we finished with the flourless chocolate torte and a brandy alexander with ice cream. The torte was very chocolaty with a nice presentation. (If you want the best flourless chocolate cake try the Bonzo at Anchuca, Vicksburg.)Overall it was a nice experience and I will return, even though it was the highest price I've ever paid for a meal in Jackson. But I didn't leave hungry! To do it over again I would share an appetizer and probably order a vegetable side with my main course. I would try the redfish and stay away from the crab crusted special."], ["Brandon T.", "Every time I looked over this restaurant in reviews I was thinking it was Bravo's Italian Cucina, the chain restaurant found in several major cities. But it was definitely not when I checked out the website! The quality of food and calibre was entirely different from what I was expecting! The ambience was one of the classiest I have been to in Jackson with dim candle lit lighting, white table cloths, and huge windows overlooking the highway. The menu was on the pricier side and it may or may not be worth the price. I enjoyed the dining experience, but the meal itself was only average. ."], ["John B.", "The paneed redfish is one of the best meals I've ever had! I get it every time I go there. The tomato-basil soup is so good as well."], ["Bonita M.", "Was disappointed in my penne & blacken Chix dish same for bread which I had to ask forservice was good but a delightful meal would have been better.my 1st trip to Jax MS & had higher hopes for a nice dinner"], ["Sweet O.", "Bravo, I loved you. Notice the past tense. You still have an incredible wine list, but much like your sister restaurants, Broad Street and Sal & Mookie's, you are bordering on being a has been with a tired menu, hit or miss service and are way over priced. Honestly, I have recently (and regrettably) had a better meal at one of the Jackson area chain restaurants. You are slip sliding away and that is sad."], ["Ieisha E.", "The last time I went was a year ago. It was good. I love they presentation of the food. They really make things fancy. Even chicken and mashed potatoes. The servers were very nice and it was a cozy little place"], ["Brandy P.", "My absolute favorite place to eat when I go to Jackson.  Great location.  Beautiful establishment.  Bar area where you can watch the cooks.  Great Italian chocolate milk and the salads are great!"], ["Leilane V.", "I absolutely love the vibrant professional atmosphere at Bravo's.  The food and the service is fantastic and great value for money."], ["L T.", "This was a nice place for lunch, but nothing that knocked my socks off, either. Our antipasto plate had some great marinated red bell peppers and garlic, but no olives, which I thought was a little strange. I also had the four seasons pizza, which was nice.If you're not from the Jackson area, the restaurant can be a little hard to see from the interstate -- I recommend finding Julep, which is easy to spot on the corner of Northside & Frontage, and entering the shopping plaza from that entrance."], ["William O.", "A wonderful locally owned restaurant. & Bar.  I celebrated my Birthday there in 2013.  It is a great place to take the family.  Excellent wine selection. Their pizzas are \"to die for.\""], ["Leila F.", "I have to say this is the best place I have been to in Jackson... so far. If that changes I will edit this review.  The wine list is decent. The food is really good.I found the service quite professional and friendly. The first time I was there, I have to admit I was skeptical. The place was so large....And so many people...how could they keep up such good quality as reputed? Well they do have great food. Why will I not give it five stars? Because of small inconsistencies that may not be readily apparent unless you go here often. Sometimes you order a dish and it is perfection. The next time, it has something missing... the warmth, or the crispiness, or the sauce has slightly changed. I am very sensitive to these things. And I imagine this has to do with the size of the place. Someone different probably cranked out my favorite dish all three times I ate it. Or it sat for a bit longer. Or it was rushed a bit.  After that I changed dish and the same thing happened all over again. I am not talking about anything major...it was still delicious.   Like I said, I will try a few more places to see if I can find something better...that five star place. But I will probabIy keep coming back here as well. This is a delightful place to eat with fairly high standards across the board. I find it justly priced as well. The owners must be very nice people, which to me is important, because the employees seem happy and seem to enjoy their jobs."], ["Lawrence Z.", "The food and service are mediocre, but let's talk about their selling points:1) Wine -- they have the BEST wine selection I've seen in Jackson, MS.  Kudos to their sommelier.2) Dessert -- they have the BEST tiramisu I've had in Jackson.  Their cappuccino is great too."], ["Christopher T.", "Came here for dinner on a Tuesday night I believe it was. The bread that came with the meal was really good! We also ordered this deep fried block of Brie cheese crusted in pecans. It was just not for me though it was good - I am just not a big nut fan, especially pecans so I am a bit bias.For main we had this lemon chicken thing wrapped in some kind of fried shell. Sorry that I cannot be more specific. This wasn't really all that good and I wouldn't order it again.The place kind of sits in a mall..kind of hard to explain. The atmosphere is casual with a mixed crowd. The only disconnect on the decor was from the main dining room to where we were sitting, the bar/lounge area. It felt completely different. It had the appearance of a cruise ship - tacky tacky..like maybe something like Carnival. Nothing classy like Norwegian or Celebrity."], ["Jennifer C.", "Ok food, ok atmosphere, pricey.I prefer amerigo's for italian food. i only come here if everyone else in the group wants to go here for lunch."], ["Ashley G.", "I don't know how everyone doesn't give this place 5 stars. This is one of my all time favorite restaurants. It's more upscale than most of the other restaurants in Jackson but not super pricey. If you are looking for a place with a decent wine list in Mississippi (which is hard to come by) Bravo is your stop. The food is also amazing. They menu offers a wide range of selection from pizzas to fish to a variety of pasta selection. Everything is delicious. Whenever I go I always get the tomato basil soup as an appetizer and the tiramisu for dessert. I normally switch up the entree because I always want to try something different. The tiramisu is hands down the best tiramisu I have ever had. I love tiramisu and try it often at other place but this has always been my favorite."], ["Jake D.", "i have only been to bravo for brunch, so i can't remark on their dinner menu. HOWEVER, in terms of brunch, they are awesome. Jackson has a dearth of breakfast places (with bars), and Bravo steps up.  The service is great, the food is creative (for Jackson), and their drink menu is amazing."], ["Kristin H.", "Dining at Bravo was a last minute choice as the day we travelled to Jackson, the whole town seemed to be closed for the Thanksgiving weekend.  Needing to eat after a 3 hour drive, a friend suggested we meet at Bravo.  when we walked in, there was no host to greet us, but a woman who I can only guess was a manager who came to seat us. As she took us to her seat, I saw she had been sitting at the bar eating, and when we sat down, I noticed she was still somewhat chewing. OOO-kayyyy...We sat down and ordered mimosas and bellinis, a must if I am out on a weekend and there is a brunch menu.  Small for 7 bucks, but I still had 2!  We all ordered our lunch.  I got an eggplant napoleon with sun-dried tomato pesto and goat cheese.  The dish tasted like someone had taken a pre-made one out of the walk-in and put in on the plate.  It was too cold, and difficult to cut into.  The flavors were good, but I would rather it had been at least room temperature.  I started with the tomato soup, which was wonderful. I could have had a few bowls of that and been quite happy.  The hubs had a BLT club. It was a standard sandwich, nothing to write home about.  My mother had the crabcakes. These were good, but a crabcake lover like myself, a lot of filler went into these.  A little less cake and a bit more crab would liven them right up!Service was good, not great.  He was friendly, but his pacing was off. He tried to take my mothers plate away as she was still eating.  I always appreciate if a server would ask if I was still enjoying my meal. Then it doesn't sound too hurried and we can all finish our lunch at our pace.  If I go back to Jackson, I most likely will not be dining here. There were many other places I wanted to go but were closed on a Saturday afternoon for Thanksgiving weekend. By far the most bizarre excuse I had ever heard!!  Jackson as a whole was a disappointment. Maybe it was the food."], ["Baron M.", "Another great place from Mangia Bene. They have three of the tastiest places in town, plus they give back to the community (maybe that is why it costs just a bit more vs the competition ha). Bravo is no exception. Every time we have come, they have had a professional staff with great food. Sometimes they run some neat specials (like the wine bottle special they are running right now, which we are planning on trying out this Friday) from time to time and it seems that you can get an early bird discount (last time I checked) for dinning in early."], ["Beth P.", "When I have folks in from out of town, this is the first place we go!  Plus excellent Sunday brunch time, try the breakfast pizza."], ["Skip R.", "One of the best restaurants in Jackson. They don't take reservations, so you will have a wait most times you go there. They are busy, so you won't get the fastest service either. But they are busy because it is very good food. I would rather wait for a great meal rather than get a poor meal in record time. Slow down and enjoy the experience. They use super fresh ingredients and that shines in the quality of the food. I can vouch that the sweep potato fries with cinnamon apricot yogurt dipping sauce and the pecan crusted fried brie with dried cherry marmalade are outstanding. My favorite salad resides there in the Bravo field greens salad with citrus dressing. You can't go wrong with whatever you choose off the entree menu. I have had several pastas including the chicken mushroom with penne pasta. It is really outstanding. The best entree I have had at BRAVO is the pork chop zatarainaise. It's a perfectly cooked pork chop with a creole mustard cream sauce that will knock your socks off.  Be sure to save room for the banana creme brule for dessert. It is unrivaled IMO."], ["S H.", "This place blows. It's hard to serve decent food when the ingredients are of such crap quality- 23 dollars for crab cakes that's not lump crab meat is a scam. Also the servers seem unprofessional. Not going back!"], ["Dee K.", "I have been to this place at least 100 times and am ready to go 1000 more. Food is great, ambiance is classy and romantic. Some tables are a bit too close but then again it's a small place. Appetizers are big to a level where if I am not too hungry I can manage with soup and appetizer and not miss the main course. Keep in mind I am a girl and don't eat too much. Wine list is extensive and bread pudding is out of this world. Cream brulle is another of my favorite here. Cajun pasta with andouille sausage, salmon pizza are some of my favorites there. They have a great pizza oven and most of the pizza choices are great. Love it for food, drinks and classy deserts."], ["Brian K.", "I once loved this place....but that has changed. The service was once A+ but it is no longer that. The last 3 times I visited this place I have had to  repeat myself over and over because my waiter or waitress can't seem to get it together. The last time I visited after I was seated it took the waitress 20 minutes to come greet my party during brunch. The kitchen is good, the food comes quick, it is usually good, but the service needs to step it up. This was once my favorite place to dine, but its not what it once was."], ["Sonia C.", "Good food, but over-rated. We ate here a few times when my husband was in medical school. It's a nice place with good food and decent service, but it doesn't live up to its reputation.  They do have some interesting dishes, like fried polenta and they have some nice salads. The pizza Margherita is good, and I'd order it again. They also have a vegetarian plate, which is appreciated. If you decide to go,  have realistic expectations - good, but not great."], ["Gregory G.", "This is a Jackson Mississippi hidden jewel and I am going to uncover it for you. First let me say this place has a great atmosphere with lots of energy. The servers at Bravo I would have to say are the best.  And the food is \"A\" rated. I have eaten at some really great italian restaurants in Chicago, this one should be relocated to the \"Windy City\", but then you would miss out on the Mississippi warm and friendly hospitality you receive when entering the door. Their menu is extensive and if you don't find anything mouth watering on their Wine list, you won't find it in Jackson. So if you are visiting Jackson Mississippi and looking for a really great place to eat, Bravo should be on your list. Now it can become crowded during normal dinner times, but wait until 7:30pm and you should be fine. Enjoy!!!!!!!"], ["Tony S.", "Great food, but the service, while adequate, was slow. We tried the glazed chicken, the fried oyster salad, crab cakes, pork chops, and a salad with goat cheese. Everyone was VERY pleased with the meal, but we waited way too long for simple things like a glass of water and some lemon wedges. Also, the host was really unhelpful, unprofessional, and had us wait almost twice as long as his previously estimated wait time (50 minutes). Thankfully, there's a lounge and a bar. So, definitely check it out, but make reservations."], ["Brett S.", "Way over priced for a very mediocre restaurant! The previous night we ate at Amerigo's which had top notch waiters and delicious food. This p,ace was a couple of dollars more and not anywhere near as good.  Also the waitress was not very professional and food was served across the table. By the way did I mention it was noisy?"], ["K P.", "Had a light early dinner in the lounge. Open and comfortable. Food was excellent and atmosphere was very relaxing. Good service as well. Still one of my absolute favorite Jackson eateries."], ["Bart C.", "Upscale crowd of mostly late 30's to mid 50's professionals. Very nice atmosphere, very attentive staff and well prepared food. Fish of the night was a lobster topped Lemon fish, a black and bleu risotto or a pan seared New York strip. I had the crabcakes and my wife had the linguine with andoulle and shrimp. Joshua was our server. Very good experience overall."], ["Frank S.", "I think this place is very good.  For years I never went here but made the first dinner last year and have gone back twice since.  I had no problems with the waiters.  The drinks are great but cannot recommend one as I don't recall the names.  Food is excellent all around.  Nice atmosphere and in a good location, easy to get to,  which is Highland Village, right off the interstate at Northside Drive."], ["Michael O.", "Far and away the best restaurant in Jackson. Good honest drinks,very good wine list,the menu is excellent and the flavor sense of the dishes is one of the best I've come across anywhere and I travel about 150 days a year through out the country . It's a must try in Jackson"], ["john m.", "Good Italian food. Nice atmosphere. The bar is packed on Thursday nights. The get all of their baked goods from there sister bakery BroadStreet Bakery located accross the freeway."]], "Domino's Pizza": [["Renee R.", "This is for the on line ordering it was easy s far as delivery I haven't experienced that yet from this location. But High street is great. .."], ["Iesha M.", "I order from my job which is right around the corner and it took them 57 mins to bring me my food and then to top it off they got my order wrong and my bread sticks were very dry"], ["Talia G.", "This is the only pizza I eat... Always fast always good... I love it always... I have never had a problem with ordering or even with my pizza... My family orders pizza at least once every other week..."], ["Jonathan L.", "HORRIBLE service here. Amazing how different the service can be one store to the next."]], "Cerami's Italian Restaurant": [["Samantha G.", "Best food and service we have had in ages and the desserts were amazing. Loved everything about it."], ["Alison G.", "The atmosphere is awesome, the service is great, the food is yummy! The owner is a really nice guy too, he sent take out food for our shuttle driver just because. I loved how friendly everyone was at this restaurant. I felt like a celebrity. I'll be back if I happen to be back in this area. God bless!!!"], ["Patrick R.", "For the price, I think the food quality is lacking, but maybe I did not try the right dish.  I'd be willing to maybe give it another try but I know that the Chicken Alfredo is a no go."], ["Jacquelyn H.", "Our entire family loves Cerami's. My husband I are big fans of the tuna with steamed veggies.When we do order pasta we usually opt for the whole wheat penne.  Our boys go for the linguini with red sauce and meatball, flatbread pizza, or linguini with butter.The salad wagon has crisp greens, olive salad, marinated onions and gorganzola cheese with 2 italian dressings. A delicious blend of flavors!!Cerami's is probably our most visited restaurant in the area and we have never been disappointed."], ["Dave M.", "This place is so awesome, the stuffed mushrooms are awesome. The owner is very personal."], ["Gretta M.", "This is, by far, my favorite Italian restaurant in Mississippi. I lived in Mississippi for 28 years and love to eat. So, I pretty much consider myself an expert on this. I order something different every time i go in there. My favorite appetizers are the stuffed mushrooms and the MEATBALLS!! Honestly, you can make a meal out of just those 2 things, and I have doe it before. My favorite entrees are shrimp Cerami, lasagna, and anything they have for the nightly special. Let me tell you...their nightly specials are where they truly shine at this restaurant. Also, I truly don't know how anyone couldn't love the salad wagon. It's probably one of my favorite things.There are only a few things on this salad bar and for good reason! What they have on there is the perfect flavor combo. Lettuce, marinated thinly sliced onions, olives, Gorgonzola cheese, and your choice of regular or creamy Italian dressing. For dessert....get the canoli! Then again...I love their tiramasu, as well. My point is...just make sure you have room because dessert is a must at this place! I no longer live in Mississippi but I do drop by for a glass of wine and a bite to eat when I'm in town. The atmosphere is so friendly and welcoming. Everyone is so sweet there."], ["Dale F.", "I was able to just make it through the door (8:50 pm) just before their Wednesday evening closing...kind of early, but the way it is middle of the week in Jackson, MS.They were very accommodating.I ordered the Lasagna which comes with self serve salad. Salad was nothing to write home about, very few items to select, bread was just above average, but the Lasagna was very good. Thick sauce and all the ingredients were very tasty. Lasagna made like my mom use to make, but a better sauce.This is anonymous so my mom will never know.I will return when back in Jackson......"], ["Gary A.", "My colleague and I needed to get some good food before driving to Meridian.  I checked Yelp and decided this was the place.  I saw the special on the board in front, but after it was described to me, I decided to get something else.  I asked the waiter if they had clams, since I didn't see it on the menu.  Amazingly they did.  Then I asked if they could make linguini and clams.  He said they could with a white butter sauce.  BOOM!! There it was in a few minutes.  Presentation excellent... actually the best I've ever seen.  Taste was superb.  I would have given them five stars for taste and service except for the wimpy salad bar.  Good taste...bad appearance and selection.  They left a card asking for comments.  COMMENT:  Put linguini and clams on the menu!!"], ["Simi C.", "I wanted to like this restaurant so so badly because it's so close to me and I've been in need of comfort food more so than usual lately but it just did not cut it. For one, it is a family restaurant meaning it is not going to be your romantic night out. There is a bar area that seemed to be a little too noisy for my taste. I ordered a glass of white wine and was accidentally given the red wine version of it. No bigger..the server easily swapped it out for me with no fuss. We ordered the ravioli as an appetizer--taste was average and appearance was below average. They looked like they were store bought/frozen. The salad wagon was slightly filthy to me--the onions needed to be refilled and overall, it just did not look very appealing to me. Dinner dishes were ok, not awful, but also not worth the price in my opinion. I'd say if you're craving Italian, save it for the other Italian restaurant on the other side of town--it's worth the drive."], ["Emily M.", "They had a special a while back, it was chicken in a garlic cream sauce over pasta.  Was literally the best pasta dish I've ever had.  When I was 6 months pregnant we went to Cerami's and they no longer had the garlic chicken special advertised, but I had seriously been dreaming about that dish..... I thought I would go out on a limb and just ask the waiter about it.  He checked with the kitchen, and they made it for me!  Told me if there was ever a special that I just loved to always ask for it bc they usually have all the ingredients on hand and don't mind making something that's not on the menu.  This definitely took them from a 4 star to 5 stars in my book.  And in response to the negative review- they do get incredibly busy if you go on a weekend at prime dining time.  I think your experience was probably an isolated event, and I would encourage you to give them another chance.  Try going on a week night or go earlier on a Friday or Saturday."], ["R F.", "I visited this place on a Saturday evening.  It's located in a quiet strip mall area.  The ambience was nice.  There were families, couples, and singles in the restaurant. The waiter was nice. I had the shrimp pasta dish which was very good and was enough to share.  The salad boat is unlimited and pretty good as well.  The bread basket and sweet tea weren't my favorites but my overall experience was pretty good and I would return.  They also have a variety on the dessert menu which I enjoyed."], ["Lillian M.", "The atmosphere is truly Italian...yes, the expected Italian colors  and photos of Italian scenery, but also statues of the Virgin Mary, the Sacred Heart, St. Joseph and the saints and rosary beads are positioned in cozy nooks. The music was not exactly an Italian genre, but it was Italian style -- live and romantic. Umbrella-covered carts hold the romaine, olives, onions and cheese for the \"endless salad\" that you fix yourself. Our waitress was very attentive, and the friendly maitre d' stopped by our table as well because we had mentioned this was our first visit. The linguini and meatballs entree was everything we could have hoped for... generous portion, large meatballs that were moist but held together well with a delicious tomato sauce of a just-thick-enough consistency. The eggplant parmesan was the best I've ever had. The slices were consistent in size, about 1/4 inch thick, perfectly breaded, no greasiness, no bitterness, no hint of added sweetness, absolutely delicious. Canoli for dessert.... a perfect Italian meal. My husband adds a comment about the men's restroom... adequate, nothing to write home about, but a very interesting feature was a message from \"The Godfather\" painted on the wall: \"Leave the gun, take the canoli.\""], ["Darren S.", "Ate here for the first time tonight using a groupon. I've never had such poor quality food at a restaurant, much less one claiming to be Italian. They even burned my wife's pasta! And if you don't order an entree, you pay $8 for a \"salad bar\" consisting of lettuce, two cheeses, and two dressings! No thanks. Stick to Amerigo's."], ["Tracey W.", "Fantastic food and atmosphere ! I thought I made the best Italian creamcheese cake until now. I submit to defeat ! Omg ,was the absolute best cake . I regret that I didn't take a picture to post on here for you all to see. The salad \"wagon\" is great.  Everyone in our party loved their entre. Lasagna, canollini, shrimp alfredo, clams and linguini, all very good."], ["Cindy W.", "Very good, authentic Italian.  Missed Cerami's for years, but now Fred has his groove back."], ["Gary A.", "The BEST Italian restaraunt in the Jackson Metro area.  The food is excellent, it's got a nice atmosphere!"]], "The Lost Pizza Company": [["Sidney T.", "Lost Pizza Co. is the best pizza I've had in MS. I loved the thick crust and fresh toppings. Great service and nice atmosphere. Reasonable prices. Before I go back home, I'm making sure I get some more pizza from them."], ["Jeana S.", "Lost Pizza isn't anything special. I've eaten here a couple times and tried at least five different pizza options, but they all taste like something I could get at Domino's or Pizza Hut. A small plus is that they have a nice beer selection. The restaurant is always clean and the decor is nice. The service is pretty good too. I don't have much to complain about nor praise. I guess the best word to describe Lost Pizza is average."], ["Ryder T.", "Y'all, the pizza is basically just Domino's. Its doughier though.Not even sure that it deserves the two stars.**Edit** No it does not deserve two stars.See I-55 location for similar review."], ["Jonna B.", "I ordered spaghetti and it came out freezing cold. I told the waitress it was cold and she said \"well that's how we serve it.\" Well that might be how Lost Pizza Co. serves it, but that's not how the rest of the world serves it. If I wanted cold spaghetti, I would have made it at home and let it sit out a few hours. The cinnamon sticks tasted like they were baked at the same time as another pizza, so they tasted like onions. Customer service was lacking tremendously. The only reason this review has two stars is because I think the atmosphere is cool."], ["Matt H.", "One of the best pizza places in the entire Jackson Metro area. Pizzas are fabulous. The thick crust is much better than thin. Toppings are plentiful. I find they are a bit light with the sauce. If you order it with extra it's free. If you go up to the counter for it after you've gotten your pizza it costs 75 cents.The tamales are also a great choice here. They are definitely real Delta tamales.There's a funky hippy like vibe to the place."], ["Kitty D. C.", "Great restaurant!  I went today at about 2 pm and there was only one other party there.  We ordered mild buffalo wings, breadsticks with cheese, and a thick crust pizza half-cheese/half-pepperoni.  Our food was served quickly.  The wings were DELICIOUS!  Very meaty and the sauce was perfect.  The breadsticks and pizza were really good as well.Good service and clean bathrooms.  Nice."], ["Robert B.", "Can't imagine getting worse service. They got our order wrong and our servers just turned and walked away without offering to correct our order or offering to do ANYTHING else to correct the problem. We won't be going back. EVER."], ["Brice B.", "This was the first time I've visited this joint. Sunday night dinner. The pizza was deliciuos, but the service once youre rinished  at the counter is nonexistent."], ["Susan B.", "Pizza was great! We went after they first opened on a Friday night and they were packed. We had to wait for a table but not for long. One of the children with us got the kids spaghetti and loved it. The other child had the kids cheese pizza and was very pleased. Both kids meals were perfect size."], ["Crystal S.", "The pizza was pretty good, and we did not have to wait that long for it, but there are no servers.  If you want a beer or two then you have to go to the register, stand in line, and order again. Nothing bad to say about the pizza but there were only about 8 to choose from, however, they did have a build your own and other things on the menu as well."], ["Allison H.", "We loved this place.  The service was great. The pizza was fantastic.  We have a child with a peanut allergy.  They were very helpful with checking ingredients, and making sure the staff changed gloves, utensils and used clean cutting boards for our order.  One of our favorite pizza places now.  Will definitely return here."], ["Randy H.", "This was our second visit to this restaurant and glad we gave them another chance (2 months ago, we must have caught them on a bad night).Tonight Visit:- Entered at 8:04pm- Service was friendly and helpful when placing our order.  - We ordered a medium pepperoni thick crust pizza, a large salad, sub-sandwich and two soft drinks.- Environment was casual, restaurant was about one third full. Restaurant was clean and inviting.- Beverage bar was neat and clean. Bar had everything we needed (straws, napkins and variety of beverage flavors to choose from. . All food was served within 13 minutes; hot & fresh. The food was very good.- Server followed-up with our table a few minutes later. She noticed that the food runners had forgotten to bring the potato chips with my sandwich, so she brought them out right away.- When we were leaving another employee thanked us and invited us to return. It's really nice to have another quality restaurant choice in the neighborhood! With food and service like this - we'll come back often!"], ["Lauren D.", "First time to try this today for lunch. Pizza was great, however they need to improve on their customer service skills. The person that took my order wasn't very friendly and it was my first time here, and she acted like she was in a hurry. The person that brought my food to me didn't say a word even though I thanked her. Good food but could step it up on the service."], ["David S.", "Good lunch special, gets you in and out quickly with a salad, pizza and drink.  Friendly service, decent pizza and quick service make it a favorite place for lunch during the work week."]], "Fratesi's Italian Foods": [["Brandon M.", "This is by far the best Italian food in the Jackson area. Everything made from scratch! I haven't had a bad meal yet. Try the seafood lasagna or the eggplant Parmesan. The house dressing makes the salad, and the bread is amazing."], ["Matt H.", "I had eaten at Fratesi's quite a bit years ago, but had not been in some time. My wife and I went by for dinner on a Friday night. Short version:Overpriced, below average service, food just OK, don't order Shrimp Scampi. The house dressing is the sole standout, but order it on the side!Long version:First of all, parking is not great. When we came in, there was mass confusion amongst the staff regarding who would seat us. Three different people asked how many were in our party. Then they argued about where to seat us.It's dark in here. We saw many patrons using cell phone flashlights to read the menu and their bills.The waitress was very nice, but had no idea what the specials were, did not seem to know the menu, and only made a few infrequent appearances at our table. My iced tea glass suffered long dry spells. The warm bread was very good. The house salad came with a huge amount of minced olives on it, which I don't care for, but to each his own. I have loved Fratesi's house dressing since the first time I had it years ago. It is absolutely fantastic (as long as you like garlic)! However, both salad bowls were literally half full of this dressing. I would suggest you ask for dressing on the side! You will love it!The food was just OK. I ordered the Rigatoni Supreme which was a generous helping of rigatoni topped with a good amount of grilled chicken, grilled shrimp, and grilled sausage. All of the grilled items had good flavor, but the red sauce was a bit bitter and needed salt. Some of the pasta on the edge of the plate that did not get topped with sauce was cold.  My wife ordered Shrimp Scampi. It consisted of 5 shrimp and a plate of pasta. Most of the pasta had no sauce at all. It had no garlic flavor. It was basically buttered noodles with a few shrimp on top. This dish definitely needed help! With no appetizers, one tea, one water, the two entrees (which include salad) came to a total of $39 and change. I really don't think it was worth that much. Had the food really stood out, I would have been happy to spend that, but it was just OK."], ["Odie S.", "A dive with mediocre food at best. Don't bother. There are so many other places to eat w better food and definitely better atmosphere! If I could give less than one star I would."], ["Melissa M.", "Love this place for a casual Italian meal in a low-key environment. It's small (and dark) but if you hit it at the right time, before 7 or so, it's no waiting. My #1 choice is the chicken and artichoke lasagna.  My cholesterol level just shot up 10 points typing that but it is SOOOO good.  Heart the seafood lasagna is also.  Other than that I've had the salad with grilled shrimp (very good) and the rigatoni supreme (shrimp. sausage, chicken on pasta with red, white or a combination of sauces).  Loved the rigotini with combined sauces.  The meals include a salad of iceburg, olives, tomatoes and a garlicy/parmesan dressing that is very good.  Plus there's the hot bread and butter.  For the price ($16-18 entree) it is a great option in the RIdgeland/NE Jackson area."], ["Roger L.", "Really like this place for a low key dinner.  Yes, it's dark inside but it adds to the ambiance and atmosphere in my opinion.Both the house dressing and their in-house made Caesar dressings are delicious, not to mention the garlic butter and bread.  Entrees are moderately priced and I usually leave with a togo box if I don't split my meal with someone.Service can be very hit or miss as they have some younger people working on their waitstaff who sometimes aren't as attentive as they should be.Check out the cheese fritters appetizer and seafood lasagna entree. You won't be sorry."], ["Howard J.", "Used to be good food and good service.  Tonight's visit was far from satisfactory. I got the Combo Pizza and my wife got the Spinach Artichoke dinner. My pizza was skimpy with no meat at all. Her dinner had absolutely no spinach. She was half way through with her dinner and still no bread. I finally got up and found our waiter to get some. The people at the next table also had problems with their dinner. The wait staff seemed to be young and inexperienced and the kitchen was obviously having problems."], ["Carmen H.", "I LOVE Fratesi's. If you want something rich and super filling, do yourself a favor and get the seafood lasagna. My husband and I both love that and they also have a really nice alfredo. It's a pretty dark restaurant, but they have chianti bottles on the table with candles in them which makes it decently romantic as well. The tiramisu is also nice. If you go at a busy time, you may have to wait in the hallway which is a little awkward since it's not a huge space."], ["JarrodandJessica G.", "Horrible service and terrible food! Used to be a favorite but something has changed for the worst. We WON'T be going back!!!"], ["Dacre K.", "Doesn't happen very often, but I wanted to go back even just the day after coming here. My brother happened on this place when driving through a couple weeks ago. Recommended it, and rightly so. Doesn't look too Italian, but the food far surpasses any pre conceived impression. You're not going to impress anyone too much by bringing them here with the decor: cheap, dark, romantic, candle lit, but the food makes it well worth it."], ["C W.", "I randomly happened upon this place  it was fabulous! The place is cute, the food was delicious, and the people were really friendly! I would highly recommend this place!"], ["Margaret S.", "We happened upon this place one night and really liked it. The food is very homey and unpretentious; the red sauce is smooth and slightly spicy and just perfect. The spaghetti is great, the eggplant parm is great, and the chicken canneloni is great. I always get their house salad with tons of green olives and their homemade vinaigrette dressing. The tiramisu is home-made and is really great. If you want down-home, Southern Italian food, come here."]], "Sbarro Italian Eatery": [["Kristin B.", "Generic mall-style pizza."]], "Rossini Cucina Italiana": [["Shawn S.", "My favorite Italian restaurant.  The atmosphere is great and the food is Devine.  The tortellini is my favorite.  The prices are not bad for the amount of food you get. We always have leftovers for lunch.  The deserts are also delicious."], ["Jeana S.", "I ate here for a work event, and overall the experience was mediocre. I had the meat lasagna which was overpriced for the quality. It tasted just a little better than a frozen lasagna you can get at a grocery store. Seeing that we had a big group, the service was good. The overall look of the restaurant is ok. I probably wouldn't was eat here again."], ["Autumn S.", "Absolutely wonderful! The food is divine and the service was excellent and polite. My only critique is they don't offer sweet tea. You have to sweeten it at the table which is just not possible. Other than that, everything was wonderful. I ate by myself and spent about $25 including the tip which was $5."], ["George H W.", "Nice clean restaurant. Decor rather spartan, but I assume it's more in keeping with the small eateries in EUROPE. Not very picey. Very attentive wait  staff. The service is prompt. Maybe because I was hungry but the salad was very nice.Fresh crunchy lettecue. Small basket of buttered bread was fresh and tasty. I chose a glass of Zinfandel an it was nicely chilled. Oh almost forgot the sorbet to clean the palate was a welcomed touch. Well my first choice didn't make the grade ,wasn't impressed with the eggplant parmesean  Ah but the seafood pasta knocked it out the park. So the 4th star."], ["Kim C.", "We were very impressed with this place! Greeted by the hostess with a big smile, we enjoyed the authentic \"non-chainy\" cuisine. I had the chicken scallopini which was excellent, while my husband had the delicious chicken Alfredo. The crab cake appetizer was also very tasty. My 12 month old devoured many servings of warm garlic bread! The complimentary bruschetta and sorbet was also a plus. We had excellent service and will definitely return!"], ["Duan C.", "We had a Groupon for this place and decided to cash in when Olive Garden had a forty-five (45) minute wait. Nice place - cute lil bistro. Food was good - portions are small - price is above average considering portions. My wife really liked them. Didn't like the Ceasar salad, she thought it had too much vinegar. I had the Butter Garlic Shrimp Pasta - my wife had the Shrimp Alfredo. Bevarges included, a sweet tea and I had a Peroni - we had a $30 Groupon, plus $25 remaining - its was $55 between the two of us with tip. They are worthy of 3.5 stars - but Yelp hasn't set that up yet."], ["Carmen H.", "My husband and I went with our Groupon on a random Thursday. We were able to be seated in one of the curtained, more romantic tables, which we enjoyed. When we were seated we were brought a bruschetta to try that tasted fresh and delicious.We got the calamari to start. It was crispy and tasted like it was freshly done. The marinara it was served with was definitely about average. It speaks well of their marinara based pasta dishes (which we did not have.)We both ordered the caesar salad. The dressing definitely tasted homemade and was more in an authentic style rather that the bottled type. The bread that came with it was fought over at our table. For dinner I had the veal scallopini which seemed to be served piccata. It was yummy and authentic. My husband got the chicken alfredo. It was a very creamy alfredo sauce and was quite a generous portion. He took the remainder to go for a second meal.The star of the show in my opinion was the tiramisu. I thought it was the best I've had in Jackson and I would prefer it over even Amerigo. It was 100% homemade and reminded me of something my grandma would serve. Service was a little rushed, mainly because I feel like our food was probably coming out of the kitchen too fast. Granted, it being a weeknight a lot of people may have preferred it that way. We just like to eat slow when we're having a big meal. Next time we'll ask and I'm sure we'll be accommodated.We will definitely be back!"], ["Cassie P.", "Hopefully we hit it on a bad night.  It was close to Thanksgiving.  My entree was so bad I only ate one bite (other dishes were ok).  When I sent back a full plate and told the server I couldn't eat it, instead of offering to remake it or exchange it she acted like I just didn't have a sophisticated enough pallet to appreciate their food.  Also, they clearly did not like that we brought our two children with us.  They gave my 2 year old a glass goblet of ice water and when I asked if they could give him a to-go cup with a lid, the server said she didn't think they did that (Every restaurant does that). I had to point out to her that I could see that another table had to-go cups.  Like I said, hopefully it was just a bad server on a bad night."], ["Piet O.", "My lady's brother Jim introduced us to Rossini's the day after Thanksgiving. Needless to say, we were in a mood for quality over quantity!Rossini's seems to occupy the entire ground floor of a pretty red brick building. The decor and furnishings are simple and sparse in that sort of expensive way.The menu, quintessentially Italian, was interesting. We ordered a bottle of Malbac, which was excellent, but unfortunately I have forgotten the name of it.The service was friendly and brisk, but distinctly lacking in the \"knowledge\" department, not even understanding basic culinary terms, and unable to answer questions without reverting to the chef.I had veal limone with fresh vegetables and mushrooms. It was absolutely excellent. Jenna had veal Marsala, also with mushrooms, and she was very happy, as was Jim with his salad (he is on a diet, pity him.)We will be back next time we are in Jackson."], ["Chad S.", "First time to eat and we used a Groupon. I got the Chicken Cacciatore. I chose this because the description sounded very rustic Italian. Best decision ever. The meal came with salad, bruchetta, bread, and sorbet. Ended the meal with tirimisu. Gotta say that I was impressed with the meal. Seems like they home cooked Italian for us."], ["Hugh P.", "Can't say enough good things about Rossini. Great food  Great service.  Everything is homemade andone of the best Caesar salad with anchovies I have ever had.  A friend from Chicago who really knows his Italian food says the veal is the  best he's ever eaten and I  say the same about the meatballs."], ["Fifi F.", "This restaurant will FAIL. My family, friends and colleagues will never go there again. I will never recommend anyone to go there. Stick with Amerigo, Char and Bravo!My friends warned me not to go there because of their low quality food and bad service. But I had already purchased the Groupon deal, so we decided to give it a try. We went on a weekend evening around 8 pm. The entire restaurant was empty except for one table beside us. We ordered the \"Feed Me Tony\" tasting faire as well as another pasta dish. It was a mistake. There was no variety in the tasting dishes. It included a Chef Boyardee inspired beef ravioli , a mediocre sorbet, a plain pasta with spinach, pasta with a SINGLE piece  of shrimp, a piece of overcooked chicken marsala, a piece of honey mustard chicken, and a slice of cheesecake. We also ordered a separate seafood pasta dish that was disgustingly salty. They claim this food is home cooked, but the quality begs to differ. Even our waitress felt badly about the food choice of the \"Chef\". The WORST part of the night was the host. She was an older female in her mid 50s to 60s who was racist, obnoxiously loud, and uneducated. We had questions about the Groupon deal, but instead of answering them, she made several rude comments towards us. I was calm and polite even though I could see the desperation in this old woman's face to make money in the sparsely populated restaurant. The highlight of the evening happened after we walked out. She flipped us off! It shames me to see that Mississippi has people like this. Again, I will never recommend anyone to go there. A horrible experience to the say the least..."], ["Tracey W.", "My daughter and I loved the food and quiet atmosphere . They have several small curtained,quaint  tables for a romantic night. But you must reserve ahead to get one. I had the lasagna and it was wonderful . My daughter had the spaghetti with meatballs. The best meatballs I have ever tried. The waitress was friendly and helpful for our first time experience. Loved the sorbet served to cleanse our palate. The garden salad was great, much better than the Caesar salad . We didn't try a desert but they did have three very good looking deserts to offer. We would love to go back again . Hope you try and enjoy as much as we did !!"], ["Frank S.", "Only been once but the food was great.  Quiet atmosphere.  I had the lasagna, very good.  Reasonably priced, nice wait staff.  Nice building, very elegant."]], "Papa John's Pizza": [["Sheryl R.", "Sometimes a fresh hot pizza is in order. Besides from Chicago Papa Johns is my favorite pizza spot. The pizzas are always made with the freshest ingredients always fast and friendly service. I love when you order pizzas you accumulate points 25 points equal a free pizza! I ordered a large sausage pepperoni bacon and chicken pizza with veggies as usual 100% satisfied!"], ["Baron M.", "Good pizza, garlic sauce, decent prices, fast service. Nothing to complain about, but not a lot to brag on about for a pizza chain."], ["Llecram P.", "The pizza is really good and has good prices."]], "Olive Garden Italian Restaurant": [["John S.", "This is a pretty good location.... The food is hot, fresh and tastes good...The service is pretty good here... Our order comes quickly and we hardly have to wait....Everyone is very friendly and polite... If you come on a weekend you'll have a longer wait..."], ["Donna H.", "First you have to realize this is American food with Italian flair.  Joy our server provided exceptional service.  The giant rigatoni with three meat sauce was delicious, there was spiciness the menu didn't warn about.  I like spice and it was the best thing I have had at Olive Garden, since they eliminated the sausage and peppers rustics.  The baked tilapia was cooked just right and was hot even with the last bite.  The salad was fresh today, as were the bread sticks.   Best meal here in awhile!  Best service ever!"], ["Amy S.", "It's an Olive Garden, so I don't really need to talk about the food.  You should know what to expect.  With that being said, our food orders have always arrived hot and in a timely fashion.  We've experienced excellent, attentive, friendly service each time we've been here.  The berry sangria is nice and refreshing; we tend to always order a pitcher.  The restaurant is clean and well-maintained.  As with most chain restaurants of this type, there's generally a 20-30 minute wait if it's a Friday or Saturday night, but that's expected and not something I complain about.In my opinion, this is one of the better Olive Garden Restaurants."], ["A K.", "This restaurant has had much improvement.  Had not been there in over a year because of poor service and mediocre food, how things have changed! I must first say that we were met at the door with a waitress with a smile (Asia) who took us right to our table. She was pleasant and made us feel as if it was a pleasure to serve us. We just wanted soup and salad and she brought a great salad and bread then returned with hot soup that we enjoyed very much. This was so much improved we complemented the manager (Andrew) and said because of this improvement we will be  back. Give them a try, things are looking better for this restaurant."], ["A C.", "I was greeted upon entering. Hostess was very friendly and served well. Good food, changed menu."], ["Chaitanya K.", "I avoid going to chains but was forced while working late and Olive Garden was one of the few that I found that had its kitchen open till 10 PM. I wish I had looked longer and found something better. Firstly, I don't what it is but the place smells funny. Ordered the garlic rosemary chicken which felt like eating premade frozen food. I won't be back."], ["Bob M.", "See tip - greeting staff were great!  Food was okay, the waiter was bad - did not keep table serviced properly. Refilled drinks when we were done eating."], ["Jenniffer H.", "I have not been here in a while so today the fiance and i decided we wanted italian. We arrived to find out we had a wait, which is ok by me as long as I can sit at the bar and have a drink. So I'm sitting, and sitting. One bartender, two bartender, a manager ... none even acknowledge us. They walk past us like we are not even there. Finally my fiance walks up to one of them and asks if we can please place a drink order. About that time our thing is going off. Now we are at our table. I have my bottle of wine almost on my second glass ... no salad no bread (been sitting here for about 15 minutes) I hope the food is spectacular if not I WILL NEVER BE BACK AGAIN!!!"], ["Melissa E.", "I have eaten at this location many times around four years ago and I loved it! However it seems times have changed. My boyfriend and I went to eat here, and I was disappointed. We waited 20 minutes before our server even showed up to get our drink order. He brought out the salad and breadsticks right after taking our order, but the breadsticks were cold and hard as a rock! We were eating around 3 in the afternoon and it took 45 minutes to get our food. The food was good when we got it, but as soon as we got it the server dropped off our checked and hounded us while we were trying to eat to pay. Over all not a good experience at all!"], ["Lee H.", "We waited 20 minutes to be seated, but that wasn't too bad for a busy lunchtime. Having looked at the menu while we waited, we ordered our meals as soon as we sat down. It still took a long while for the entrees to come. The food was good, and just what you expect from Olive Garden. It was a pleasant lunch, enjoyed by all, but the slow service keeps this restaurant off my favorites list."], ["N J.", "Take-out: promised 25-30 minute ready time for food, and ended up taking an hour to get ready.  They flat out forgot the order...since I am just visiting Jackson, I will be never going there again anyways."]], "Amerigo": [["Craig T.", "Five stars for the cheese fritters alone.  I can make a complete meal from that particular appetizer.  If I was stranded on a deserted island and could only take one appetizer with me, it would definitely be the cheese fritters from Amerigos. There are plenty of other tasty dishes here - the Arugula with Flame-Grilled Apples salad made me do a complete 360 on the value of arugula; the pasta dishes are wonderful; the pizza is an unsung and under appreciated hero in the Jackson pizza world; the tiramisu is still my favorite in the area; the wine selection is great; the specials are always on point.  And everything is reasonably priced.Amerigos will also always occupy a warm spot in my heart.  It was the setting for my first date with my sweetie.  We dined there the evening we got married.  We actually met George Clooney in the bar of Amerigos that night.  (He was in town filming O Brother, Where Art Thou.) He was sitting at the bar with a baseball cap slung low over his brow trying not to attract attention and at the same time attracting a lot of attention form a gaggle of girls at the other end of the bar.  My bride's grandmother was dining with us and was just about to have a fit to meet Clooney so my wife figured \"why not\"?She took her grandmother to the bar and told Clooney that she had just gotten married and her grandmother was there and wanted to meet him.  He was very gracious and wished my wife and I a warm congratulations, took her grandmother's hand and said how nice it was to meet her.  Her grandmother slowly walked away and made it to the other end of the bar before squealing, \"I'm never going to wash my hand ever again!\"Of course I reduced the whole story later on to this:\"Yeah, my wife met George Clooney on our wedding night but she went home with me!\""], ["John A.", "This place is a favorite.  Every time I come to Jackson!!!Artichoke dip (huge chunks of artichoke). Smoked chicken ravioli.  Tiramisu."], ["Sarah T.", "This place is seriously the best! Early bird specials cannot be missed. This place makes my ALL TIME favorite dish ever! It's the salmon with black bean and corn salsa that will literally take you to paradise. I could seriously eat four of these and I totally would. The house wines are delicious and it's probably one of the coolest date spots nearby. It feels like you could be in Italy. We always go here for our family events or celebrations. It's great for groups and even kids. You won't meet a rude or unhelpful employee here, so nothing will make it a bad experience! Trust me :)"], ["Alicia J.", "I'm not going to act like I'm an authority on Italian food. I live in a culinary city with a weird lack of anything that isn't chain Italian or super high end Italian, so I've really only tangoed with what friends and family have made.But Amerigo really hit the spot after 12 hours of driving with a dog breathing down my neck. I got the house-smoked duck and sausage pasta, which rekindled my love of anything on a bed of angel hair pasta. My handsome date got the lasagna, which was so delightfully cheesy and garlicky and lasagna-y. Amerigo and their surprisingly good house wine was everything we needed and I'd go back in a heartbeat."], ["Carter P.", "We stopped in for a family dinner (11 of us) on an extremely busy Sunday night.  They had a table for us about 45 minutes later and the server was very friendly.  She had worked very hard to make sure all of us were taken care of, which was an impressive feat.The recipes are good and what I remember them having from visiting several years ago.  It would be nice too, though if they brought a few of the edgier dishes popular in New Orleans Italian to Amerigo's.  We had dishes which were mostly parm cream sauce based and I personally had salmon with spinach and green beans.  The food was good, but not a lot of variety across the menu.When they delivered the food, they made sure to bring it out at once.  While this seems in good taste, it did create two issues for us.  For those who ordered simpler to prepare (and flavorful) dishes - their plates came out extremely hot.  Maybe due to sitting under heat lamps waiting for the other  (longer to make) dishes.  Also, the two young boys with us (who had waited 45 mins in a restaurant to eat) were served spaghetti with red sauce at the same time as the adults - about 1.5 hours after arriving.  This was great for selling wine to adults but led to children wining as well from hunger.Great staff, suggest adding more adventurous Italian entrees and bringing each person's order out as its ready (instead of sitting under heat lamps) - with more focus on ensuring kids are fed first."], ["Ian M.", "My wife and I came here for New Years Eve.  I always forget how incredible this place is.  The wait was about 45 minutes which seemed a little long but then it is a very popular place.The wait staff was very attentive and friendly.  The atmosphere was warm and very comfortable.  I had the Filet, butterflied (sp), with blue cheese.  It comes served with fettuccine alfredo.  I requested the asparagus instead of the green beans.  It was as tender a steak as I had ever had.  Which is great but the steak was served without the blue cheese.  I didn't want to make my wife wait to eat so I requested a side of cheese.  Also, the asparagus did not come out with my meal.  The beans did.  It took a while to get the asparagus to the table and when it did arrive it was incredibly salty and there were only 8 skinny stalks.The reason for the 4 stars instead of 3 is because the food that was served was amazing.  The wait staff was very efficient and friendly.  It just seems like there might be an issue in the kitchen."], ["Pete F.", "Hands down one of the best tiramisu in Mississippi. It's well worth the wait during the weekend, but if dessert is all your craving, order it to-go!"], ["Crystal S.", "I've never ever had a bad experience at this place! 5 stars don't come cheap! This quickly became my favorite place when we move to Ridgeland, ms a few months ago.  The place is small but wow the food is amazing.. They are always packed! And it's not just the entrees, the desserts are amazing! The key lime pie, literally melts in your mouth! My 6 yr old even loves this place. Delicious Italian food from scratch and you can tell!"], ["John C.", "Awesome Food.  I had the ribeye.  My wife had the lasagna, and the kids had the pizza.  All of us loved it.  Hard to satisfy my family."], ["Rachel M.", "Grew up near Jackson but went to visit family for the weekend and finally got to try Amerigo's. It has an upscale feel to it and the food is great! The server kept our drinks filled and got our food to us so fast!"], ["Kelson L.", "Amerigo is an upscale Italian restaurant. I went there for dinner 2 friends. The inside is a little darker than I would like. The other thing was that the tables were really close together. Other than that, a nice atmosphere.Our server was cheerful and quickly offered us drinks before rattling off the specials. I almost went with the salmon she mentioned but ended up ordering the ribeye despite it being an Italian restaurant with a plethora of pasta. My choice didn't disappoint as the portions I received were very generous. My only qualm was the beans were pretty salty.  I didn't get dessert personally but my 2 friends both got the tiramisu.  I tried some of it and it was very tasty. I think the portion of that is a bit much for a single person so splitting it between people is probably the best idea if you choose to get it."], ["Latoya S.", "First time being here and I came on a Sunday. It was busy with a 39 min wait. The staff was very friendly. I ordered the chesse critters as an appetizer. If you love cheese, this is the appetizer to get. It is a big cheese ball. You can order the small or large portion. I got the small which include 3 of them. Also the critters are fried! For my entree, I ordered  the chicken piccala. It was GREAT! For dessert I ordered the tamasla... Which is awesome too! I will return!!!"], ["Coral E.", "One of my favorite places to go for dinner (but go early, it's not just popular with me)!A local Italian food chain, the Amerigo's in Ridgeland boasts some of the best service around.  The cheese fritters and artichoke dip are musts for appetizers.  For dinner I just can't seem to get away from the Crawfish Pasta, Goat Cheese Penne with Shrimp or one of their pizzas.  I've never had anything I didn't like, and neither has anyone I've been with.  They also do great tasting menu events throughout the year that are super fun and super delicious!"], ["Gigi C.", "The service has always been good, but I don't go to Amerigo's anymore since I adopted a vegan lifestyle. I really wish they would consider adding some real vegan options to the menu. I'm not talking about a bunch of sides thrown together or a bland penne with tomatoes and onions. A real meal. If they did, I would go back to being a regular."], ["Kenneth C.", "Not Impressed. This place is popular and I can't understand why except that there aren't really many choices for Italian in the Jackson area other than Cerami's and Bravo (very good). The service is usually good but the food is below average for Italian. We have eaten here with friends several times and the pasta has always been very mushy. The Tira Misu is very good though."], ["Stephanie K.", "This place was awesome! The service was prompt, the food was delicious, and the prices were very reasonable. It was a fantastic experience!"], ["Doug B.", "After a meal that didn't live up to the great reputation Amerigos has in the community, our waiter and the manager rectified the situation by providing dessert. Nice ambiance and Now the highlight of the meal was the tiramisu. Very good dessert with the sauces. It deserves the four stars by itself. Will definitely return for another try."], ["Brittany S.", "I went with 5 other ladies while in Jackson for training. They were almost full at 6 on a Monday night and the tables are pretty close together... We all enjoyed our food for the most part. I got a small order of cheese fritters. I really didn't care for them, but every one else at the table seemed to like them. Our waiter was very nice and handsome,  which made the fact that the service was slow slightly less annoying :)."], ["Newly P.", "No sure why there's all the fuss about this place. On the one and only visit I paid to Amerigo, I ordered the pizza and salad combo and came away underwhelmed. I thought my Italian pizza--thin crust with very little topping--was lacklustre. The bread with olive oil dipping was good though. I do agree with other reviewers who say this is a place for old Italian ladies to see and be seen. The steady stream of diners continued while we ate, and people were coming in even as we were leaving an hour later. For me though, it's just another restaurant crossed off my list of \"Things to do in Jackson.\""], ["Simi C.", "Perfect spot in Jackson for a romantic dinner with your sweetheart or a celebration dinner with family! The parking lot is always crowded, even on weeknights, which is rather indicative of their popularity amongst locals. Once inside, the bar area is usually flowing nicely with guests grabbing a drink during their wait or with those finishing up their meal and offering seats to those waiting. I've dined at the bar once with my hunny and the service was impeccable. We had the most attentive bar tender who even offered to give us a smaller portion of the carne pizza (I forget the exact name) since we wanted something to snack on with our drinks; for dinner, he had our pasta dish nicely split into two bowls. Absolutely delightful. When a regular guest complained about the pasta, the same bartender had the meal removed from his bill. I have also dined at a table a few times and while the service has been good there, as well, I'd have to say my experience at the bar has been the best one yet at Amerigo.On to food, if you don't like Italian, you're not totally out of luck. The pizzas are delicious and I'm sure you could find a few other appetizers to suit the non-Italian seeking palate. I, for one, love all things carb, and I have yet to be displeased with a dish. I always swap out the marinara sauce for alfredo (hi calories!!) so they can easily handle such substitutions. My hunny enjoys their steak and their soup of the day is always a nice starter, as well. Word of advice: On Valentine's Day, when the whole world wants to eat Italian, Amerigo's gets pretty crowded but you will eventually get a seat-- it's worth the wait in my opinion!"], ["Lei B.", "I had high hopes with this place but I just thought it was ok. I was lucky enough to have one of my coworkers join me for dinner. We ordered a small order fried eggplant appetizer with craw fish. I was so disappointed when they brought I out. It was two very thin slices of eggplant. After being breaded and fried you can't even taste the eggplant itself. The craw fish was good though but I don't think the sauce combined the two  items very well. My pasta was just ok. I forgot the name of it but it had peas, ham, mushrooms, and grilled salmon with fettuccine noodles in a cream sauce. The bowl was huge and overflowing! My coworker ordered the pork loin chop and it was served on a piece of smoked cedar wood. His dish was really good. Her cut me a piece and it was soo juicy and full of flavor.Their wine selection by the glass was pretty good. I ordered a Guntrum 2007 riesling, which our waitress recommended. I loved it. I had to remember it so I can find it later. Experience overall was nice. Our waitress was so sweet and very attentive. The only thing I regret was no ordering the tiramisu, since that's all the rave, but I was sooo stuffed! Oh well there will be other trips to Mississippi."], ["Hannah R.", "I was sadly underwhelmed by this place. I had heard so much about how it was the greatest italian restaurant in Jackson and worth the price tag. Some items I tried were spot on: the cheese fritters are AWESOME. Much better than fried mozz sticks. The calamari was good, hard to really screw that up in my opinion. The complimentary bread and olive oil was also pretty tasty. For my meal, I decided to order some pasta since I figured that would probably be an Italian restaurant's specialty. Man, I was disappointed. I got the tortellini with grilled chicken. First of all, the tortellini kind of tasted weird. Secondly, the chicken was about 1/4\" thick. No lie. I've never seen chicken breast that thin and unappealing. And it wasn't just my dish, others in the group that ordered pasta with chicken also had flat, dry, flavorless chicken. The place wasn't all bad - the service was very friendly. The atmosphere is pretty nice but as others have said, a little cramped. This definitely seems like an establishment for old housewives to frequent and be \"seen\" at. Definitely a bit of a snobby vibe but not overwhelmingly so. I would go back , the salads looked really good so I'd probably opt for that next time. I would be hesitant to recommend this place to someone looking for \"great\" Italian since I've had much better meals at even chain restaurants, but I really haven't tried many other Italian restaurants in Jackson so maybe Amerigo's mediocrity is considered good around here."], ["Nicole B.", "Sometimes the one star rating is just too much. The food was not prepared properly and the service was poor. If your looking for rich Italian food, this is not the place to go. The atmosphere is wonderful and the Teramasu was really good for not being prepared in house; however, for lunch it left me wanting more than just dessert and coffee."], ["Ieisha E.", "I live close by this restaurant. I always wondered why is it always so packed.?? I still wonder why . I visited this restaurant about a year ago. The service was pretty good. I ordered the crab cake for an appetizer and it taste good. My main dish was lasagna. I didn't really enjoy it at all. The taste was just not what I expected. It lacked quite a few ingredients or maybe just had the wrong ingredients. I guess I'm used to the perfect stouffers brand that I buy in the store but maybe I'll try again one day. There has to be some reason why they are always packed at night"], ["Eric L.", "One of my favorites in the Jackson area.  Delicious Italian food - haven't had anything that I didn't like.  Excellent service.  Full bar.  Dark, cozy atmosphere.  Great date night place.DO NOT LEAVE WITHOUT THE TIRAMISU.  Simply divine."], ["Amber J.", "AN IMPOSTOR!  A different version of TiramisuI was very excited to find chef made Tiramisu! But as with so many others, it was not authentic in any way.  Not really sure how they can call it Tiramisu and at an Italian restaurant....- it comes with two sauces? a chocolate and a white-both fine sauces but Tiramisu has no sauce other than the espresso the lady finger should be soaked in...- Couldn't taste the espresso at all- the marscapone layers were replaced w/a thick sweet cream cheese mixture- no lady fingers but a thick sheet cake- the cocoa dusting was barely reminiscent of a pinch.- $8 very disappointing...crushing actually.My search continues."], ["Trey F.", "Great choice. Better have reservations though."], ["Angel B.", "We had a WONDERFUL dinner tonight. I had the tortelini w/lump crab meat, spinach & spicy cream sauce. It was delish! My hubby had shrimp scampi w/lump crab meat (order extra for $4) w/white wine garlic butter sauce & his outta sight! The tiramisu is the best thing ever!! Our meal was $110 for 4 people. Service was prompt & friendly."], ["Matt M.", "Wonderful food! Ask for waiter , Josh! Also the butter crunch desert is the best desert in this world!!!"], ["Jennifer C.", "Awesome tiramisu!!! Come here for dessert. Best tiramisu ever. Sits on top of a bed of melted dark and white chocolate.Food is pretty good though. By far the best Italian restaurant in Jackson. Foccacia for dipping bread. for some reason, everywhere in jxn loves serving foccacia bread as an appetizer. it's ok. would prefer white baguette/italian toasted loaf. but works. whatever you do, save room for dessert.What to order:calamari - good light frymussels - ask for the bread to be toasted with out the garlic butter which is a little salty. but if you're craving mussels, i actually like bonefish grill better (for jxn)tortellini with crabmeat - very creamy, hearty and goodgoat cheese apple salad - nice to split with someone as a starter, you can make this at home thoughwhat is not that great:goat cheese pastaduck?/sausage? pasta"], ["hobo s.", "If the rest of my colleagues wanted to go back here, I would either go or not.  That pretty much sums it up.  Maybe I just ordered so-so items, but I wasn't impressed.  Crab cake appetizer was fine.  Pretty good even, but nothing crazy.Did I mention how a waitress took our order, then when she realized we weren't her table, instead of telling our waitress our drink order, she just let our waitress find out for herself?  Then our not-waitress tried to squeeze through two tables (ours and the next one) and knocked over my water.  Didn't splash us, but didn't move us either.  We helped move things so she could change the tablecloth (i.e. paper) and then didn't even get me another water.  There's more.  She then proceeded to squeeze through this same location throughout our meal.  I swear I didn't punch her.So, the entree..  Some grilled mixed veg (peppers, eggplant), I don't remember the fish, and some mashed potatoes, all served on the ceder plank that the fish was grilled on.  The potatoes were a bit too smooth, but everything was fine.  My problem was that by the time I got through most of the veg and some of the potatoes the fish was limp and not hot, nor crisp anywhere.  I don't want overcooked fish, and I know it is a delicate balance, but I shouldn't have to eat my fish the second it is set down in front of me to have it hot.  Anyway the food is fine, the atmosphere is a bit cramped and snobby.  While I would come back if necessary, I wouldn't make plans to come back.  I really hope that their pasta is amazing though.."], ["Lindsay B.", "My boyfriend and I were visiting out of state and needed a good Italian restaurant for carbo loading. I found this place on Yelp and made a reservation for 6:30p on Friday night.Unfortunately, my GPS guided us wrong. I called them up and got directions, eventually, from them. Ended up being 10 minutes late to the reservation. They didn't seat us for another 20 minutes after that. On top of that, they sat us facing the entire restaurant, with our backs to the walls. Made me feel very self conscience eating. It was a very packed place, with lots of seating but very small aisles.We ordered 2 different beers, one of them being Southern Pecan. That was great! Never had it before. We both ordered the same pasta dish, mine without chicken, his with. They were both good and a nice amount.Unfortunately, when we went to a bar afterwards we ordered the same Southern Pecan and it came to us as a different colour and taste. Not sure what happened there but we're pretty sure that the waiter brought us not Southern Pecan at the restaurant. We've been wondering what it was for a while now!The staff was very good and accommodating. Even asked if we wanted a second bread basket, which we very much enjoyed. Once we got our food though, we didn't seem much of them again. I have to assume that it was the night before a race so everyone was looking for an Italian restaurant for pasta, and that it was also Friday night.If we ever find ourselves back in Jackson again, we'll definitely go there!"], ["Randy L.", "Friends took us here. Nice atmosphere. Extensive menu. Coming from LA (that's not Louisiana), prices are reasonable.  Complimentary bread and herbed olive oil was very good.  I ordered the special cedar-planked salmon with crab.  It was very good.  Sauteed vegetables were very good. Asiago potatoes are off the hook.  My wife had the chicken Marsala.  It was very good, and a generous portion.  Our friends had the chicken Vesuvio, which was very good, and the veal lasagna.  I didn't try the lasagna, but he said that it was good.  Didn't have room for dessert.  Our server, Jennifer, was outstanding."], ["Lisa P.", "The best tiramisu I have ever had in my life, hands down. Great atmosphere and great food."], ["Margaret S.", "The best tiramisu in the world, served with two sauces: dark chocolate and a light custardy sauce. The. Best. Evar. Their key lime pie is also good, but the tiramisu is the star. You can also buy this by the pan, which lots of folks do at Christmas. They need advance warning for this, though.The food-food is good, too, though pricey. They have really, really good fettucini alfredo and lasagna (you can also buy this by the pan with advance warning, and they will actually make it in *your dish* if you take them one) as well as steaks and great fish. Good wine list and efficient staff. ALWAYS packed!"], ["Sonia C.", "I like this restaurant. The food is good quality and the service is excellent. They have the best bruschetta I've EVER had. I would definitely recommend ordering that. Some of the pasta dishes can be a but oily, but everything I've had has a good flavor. Good place!"], ["Brett S.", "I was visiting and went to this restaurant with relatives. First thing that gets your attention is the superb waiter service. They are true professionals. For dinner we started with the goat cheese salad (Superb) and followed by lasagna and Capellini pomodoro. This second choice was the best I have ever tasted with fresh hand cut tomatoes. While looking around I saw that others had ordered various steaks and over sized drinks. Coffee at the end of the meal came in very large cups that were mug sized. The one negative is that the place was slightly noisy so I would likely give this place 4 1/2 stars. Still a high rating for me."], ["Jordan I.", "I recently took my girlfriend here. There was a decent wait, but not more than expected for a Friday night. Our server was very polite, yet a little awkward at communication. The food was incredible. Previously I was a huge fan of Biaggi's, but this place is so much better. Both meals and the  appetizer were great! I highly recommend this restaurant. Will say it is a little loud though."], ["Buster B.", "Amerigo's is probably the best Italian restaurant in Jackson, and it's a great place to take your parents, to go on a date, or just out with friends. The lighting is kind of dim, so it's not really good for kids. The specials are usually your best bet, although the items on the menu are pretty good, too. The food is a little pricey, but the portions are pretty large. The staff are good and usually have good recommendations. Oh, and they also have some good vegetarian options.The tiramasu is amazing! Don't eat all of your dinner - save room for dessert!They take reservations, so be sure to call ahead because the wait for dinner on the weekends can be long."], ["Bart S.", "One of my favorite restaurants in the area.  Great food and service."], ["Terrianne B.", "We were just passing through Jackson and used YELP to find this place.  The salads were fresh and the house dressing impressive. The salmon was cooked perfectly and the asiago cheese mashed potatoes are to die for.  The canelloni was very good and the Imperial pasta was excellent.  The only complaint was that the bread was just plain at best."], ["Alivia T.", "If you visit this restaurant, be sure to get the cheese fritters! Absolutely fabulous appetizer. Dessert? The #1 dessert in the state, apple crumb cake, it's divine!"], ["Quincy S.", "Best Italian in the area.  The selection is great, the desserts are wonderful and the service is good.  Amerigo has been around for a long time and despite my many visits, I've never left disappointed.  Their lasagna is very good!  One of my favorite places to get it.  I rank it ahead of other Italian eateries like Olive Garden or Spaghetti Warehouse simply because the entire experience is very nice.  You'll enjoy the atmosphere and variety of foods on the menu."], ["Alli B.", "Very good food and service!  Gone a couple of times and everything my group has had was extremely good."], ["Alfred K.", "This restaurant came highly recommended by locals so I was excited to give it a try. The prices vary a bit - the seafood specials were over $25 and steaks over $35, but the pasta dishes were very reasonably priced around $10-$15. The food was okay - I was told to get the Lasagna which I did, and it was just okay for me. I personally like my lasagnas a little moist, but here it's so baked that the edges were chewy. Good if you like that, but it just wasn't what I was in the mood for. The dessert - tiramisu sitting on a pool of white and dark chocolate - was pretty good, but far from amazing. Considering it's what they're supposedly famous for, I was pleased but not exactly impressed. I guess I've just had better."], ["Gary A.", "I don't know what the hype about this place is all about. If you want ready awesome italian food don't waste your time here. Take a short drive to Cerami's across the Rez."]], "The Manship Wood Fired Kitchen": [["Darius W.", "One of my favorite restaurants to visit for lunch. Slowly becoming our office's daily routine. The lunch menu is full of options and you cannot beat the daily specials.Spacing is cramped in front so large parties should utilize the back area of the restaurant. Servers and bartenders  knowledgable, courteous, and quick!"], ["Melissa B.", "I went to the Manship for the first time a few months ago, and was highly disappointed. My friend and I had to wait a very long time for the server to come to our table, and then he forgot to put in our food order. We waited for over an hour before we finally flagged him down to ask about our food, and he just said, \"whoops,\" and laughed. The table behind us got a free appetizer just for knowing him, and all we got was a \"whoops\" for our food not getting put in. No apology, nothing. I called the manager afterward because I didn't want to make a scene, and he was friendly and apologetic and said he had seen the whole thing and it was unacceptable. He took my address and said that he would send me a gift card for my troubles and said for me to tell him when I came in again so they could give me better service. The gift card never came and I have been too angry to go back. The food may be good, but what we ordered was pretty bland and definitely not worth paying over $30 for a meal just to be disrespected. I expect better service in places that claim to be high quality."], ["Craig C.", "Great food, great atmosphere, and great service. A one of a kind gem.I loved the bar and the huge selection of bourbon and scotch. Glad to see a restaurant step up their game on all aspects of dining."], ["Blue A.", "This is a really nice spot in Jackson - and while the vibe is casual, it does look fancier than most places. Our server was extremely nice, made some great recommendations and checked in on us from time to time. This is one of the cases where great customer service really made the overall experience so much better.Blue crab sandwich - this was a whole soft shell crab, inside a sandwich. I love crab - but I've never had a whole soft shell crab. This was interesting! It's a pretty big sandwich, and I managed to do some good damage on it, but couldn't finish. I think this was one of the specials - so it might not always be on the menu.It came with a side of parmasean fries - eh. I should of picked another side. These were very thin cut fries (I prefer thick cut fries). I know for next time to try one of the other sides that looked great.Ended the meal with some blackberry cobler - They have a free dessert as the Check In offer on Yelp! Got this one and it was delicious! Possibly my favorite part of the meal.There's a nice cocktail and beer list as well - I can see this being a great happy hour spot. Might have to drop in for a drink next time I am in town."], ["David R.", "Great libations and wild game!The Manship Wood Fired Kitchen is located on the first floor of the Belhaven Medical Office Building.  The parking garage is accessible from Manship St. or Poplar Bvld.I arrived during happy hour when cocktails are half-price; I took advantage of that. I started with a drink called the \"Best Damn G & T\".  My preference for a G & T is prepared with Bombay Sapphire Gin.  This G & T was sweet and refreshing; it was not overly sweet.  I saw cooper mugs at the bar and knew my next drink would be one of my favorites, the Moscow Mule. The bartender did a good job with the drinks.I like duck and had to try the duck wings.  The duck wings looked and tasted like they were braised in a citrus glaze.  Six meaty and tender drummettes, garnished with scallions and an orange slice. Although there appeared to be other good entree choices on the menu, since I like wild game, I ordered the rabbit ravioli.  Ravioli stuffed with ground rabbit and topped with Pancetta and what looks like snap pea shoots; it was a great choice.There are a few selections for desert, I was deciding between the peach cheesecake or peach cobbler. I went with the peach cobbler.  Prepared with peaches grown in Mississippi, the cobbler is served in a small cast iron skillet, topped with vanilla ice cream and garnished with mint leaves.  The cobbler was on the cool side when it arrived at my position at the bar, but still good and complemented by the vanilla ice cream.The desert was on the house with my Yelp check-in.I would visit again."], ["Cody M.", "One of the best additions to the food culture of Jackson in the past couple years. I had my rehearsal dinner here, and experienced exceptional service, food, and atmosphere throughout the whole thing. Their food is absolutely delicious, and ranges anywhere from a nice tender steak to a perfectly seasoned fish to a hot and sizzling pizza. They have food for every price range, especially if you hit up their happy hour when you can get discounted drinks and pizza. This will be one of Jackson's staples in the upcoming years if it isn't already."], ["Melissa A.", "Great food and service.  Pretty restaurant with fun patio.  Nice to grab a quick pizza at the bar or sit down for a slow dinner."], ["Linnea W.", "Oh my gosh j have died and gone to Heaven. Jackson suddenly feels like a soft Chicago . Great environment . Delicious menu."], ["Dana R.", "My favorite restaurant in the Jackson area! My favorite entree so far has been the Tuna filet. The wine and craft beer selection is long and wonderful! Also, the Crawfish bisque they have on the summer menu is delicious. Oh, and for an appetizer- I highly recommend the crab cakes. Roumalade sauce served with it is fantastic!"], ["Rachel P.", "This place is straight up fantastic. I've been for lunch, brunch, and dinner several times and have never been anywhere close to disappointed. Everything is masterfully done.Let's start with the atmosphere-- the restaurant is relatively small, but still maintains a spacious and open vibe. There's seating at the bar as well as some high top tables for smaller groups when you first walk in. Then, in the proper dining room, there are both booths as well as tables. This is an excellent location to bring a group, especially if you're celebrating. Situated right in Belhaven between Fondren and downtown, this place is central to all the going's-on's here in Jackson, and is a perfect place to start your evening.But let's talk about the food. I eat out relatively often and can be a bit of a food snob, I'll admit. This place regularly blows me away. Everything I've had has been phenomenal. The first time I ate here, I had the steak and it was by far the best steak I've had in town. Better than any of the restaurants \"known\" for their steak! Since then, I've had a variety of dishes from salads to brunch to pizza and everything has left me raving. The menu changes regularly, and features a bevy of local vegetables and produce which I LOVE. I wish more Jackson restaurants would do that. It shows a certain pride in this city, which goes a long way with me. This is a fantastic date locale. It's classy, not stuffy, and quiet enough that you can hear yourself chat but not so quiet that no one chats.Their bar is fully stocked and their drink menu is extensive. They offer a fantastic variety of wines and beers, but I've always been most impressed by their unique and finely crafted cocktails. Service, for me, has always been great. The only time it's ever been a bit slow was when I stopped in for a late lunch but that's to be expected at any restaurant when the wait staff is switching from lunch to dinner mode. Even when it's a bit slow, the wait staff is always incredibly friendly and helpful-- always ready with a recommendation or a menu suggestion. Overall, I can't say enough good things about the Manship. It's one of the most excellent restaurants we've got in town, and I'm so glad to have it here in the neighborhood. Check it out! You won't regret it!"], ["Amanda W.", "I ordered a to go dinner. I was surprised and disappointed to see that each to go item, they would charge $.50 per item. So my 3 items added an extra $1.50 just for it being a to go order. I ordered the smoked wings appetizer, the shrimp bisque, and the couscous side item. I ordered the shrimp bisque based on the recommendation from the lady taking my order. I was not impressed. There was basically no shrimp and instead of a creamy sauce it was more of a broth. The smoked wings were pretty good though I had expected more from the white barbecue sauce, it was peppery and fairly spicy (and not in the tasty way) in my opinion.The couscous was something to brag about though. This is also a recommendation from the lady who took my to go order. I wanted the Parmesan truffle fries but she said they were a special and they no longer carried them at this moment. She offered the couscous as a substitute, and she actually got this one right. It had small cut mushrooms with some Parmesan and some truffle oil. Recommended! I did enjoy the look of the restaurant, especially the outside patio area."], ["Ryder T.", "Soon after The Manship opened, I had dinner there and was very impressed. Jackson has had a lot of good restaurants (and still does) but this one really took the cake in all ways. The food was amazing, the service top-notch and the atmosphere felt like I was in a much bigger more impressive city. Prices are reasonable for the quality of food!They have an excellent brunch - probably the most creative and tasty brunch in Jackson right now. The happy hour is also not to be missed. Half off cocktails and pizzas is perfect for an after work drink and snack or a full blown early dinner date! The last time I went to the happy hour, the mixologist (I only use the term because he was actually our waiter at the time, not the bartender, though he had come up with many of the cocktails) was happy to hang around and tell us about how the cocktail combinations had come about. The staff is always knowledgable about where the food comes from and how it is prepared.The only issues I have had with them is weekday lunch - but this is a more difficult time for most restaurants. The food was excellent, of course, but the service was a little lacking. That is to be expected at a busy lunch place like this, however.MAC & CHEESE LIST - This Mac & Cheese is different. It is not your standard comfort food style, so if you are looking for Velveeta (no judgement zone - sometimes we are!) this is not your place. Today it was Pancetta Mac & Cheese (see pic) which was awesome, but it has been a different formulation in the past. Definitely good, but lighter on the cheese than most places. Worth getting for sure though.MUST HAVE DISHES IN JACKSON - The Best Damn G&T. Like the name says, it is the best G&T you'll have, at least until you figure out how to make it yourself. They make it with top notch gin and Jack Rudy tonic. I wouldn't advise the new BDG&T version 2.0, the tonic is gross."], ["Blanca V.", "The food was great! Had the shrimp scampi and angel hair pasta...service was okay just would of liked for our waitress to let us know more about dessert instead of assuming we wouldn't be interested. I heard about the desserts because she was explaining them to the table next to us!"], ["Andrew B.", "LMAO I just looked at the page and the special offer is for a free \"desert\" instead of \"dessert\". That advertising is paying off!Way to go Yelp"], ["Tiffaby H.", "The food is always good! Great lunch specials if you want a gourmet meal on a budget then this is the place! This location has an extensive bar area and hard to find liquors great for happy hour too which is 3-6!"], ["Aminah M.", "We found this place on Yelp and we were not disappointed. The ambiance and decor were great but the knowledgeable waitstaff and Delicious food are what make this place a winner for me. We ordered the Mediterranean shrimp salad and the farmers market pizza and added sausage. We ate at lunch and the portion sizes were great. Everything was super fresh and tasty. The salad was fresh, presented well and the shrimp were just melt in your mouth good. The pizza was a tad greasy, but it didn't take away from the flavor. We got the free desert for checking in, and ordered the cobbler. It was DELICIOUS. The crust was so light and crumbly I could eat 2 of those by myself. In short no complaints. My server Brandon was not only knowledgeable but he was also super friendly and just made our dining experience A1.   I'll be back to check out dinner for sure"], ["Kevin W.", "Duck wings and ribeye deckle will absolutely never disappoint. I chose the cowboy special tonight and am overly stuffed and happy.  Throw in some crab beignets and this place is by FAR the best, freshest and imaginative menu in Jackson. Add the fact that the price point is perfect."], ["Rob J.", "My wife and I love to use yelp to find not so hidden treasures across the country.Today, we found Manship! The Duck wings and greens were excellent. You should share your meal and be wise...and leave room for the cobbler!Nobody does cobbler like Mississippi!"], ["Ryan K.", "The Manship Wood Fired Kitchen was the second restaurant I ever visited in Jackson.  Over the past year, I've been back more times than I can count, and I always take my friends and family when I have visitors in town.  The Manship's service, atmosphere, and plate presentation is really great, offering a wide variety of options for different types of eaters without making the menu overwhelming.Hands down, the Manship serves the best pork belly dish I've had in Jackson... and I've had a lot of pork belly.  The Manship has daily menu rotations and seasonally modifies their dishes with local flare.  Recommended:  The pork belly, smoked Caesar salad (with extra anchovies), the Funghi, Farm Egg, and Bacon pizza, and any of half-fish specials."], ["Micah S.", "Every time I come to the Manship, I try something different. And every time I try something different, I love it. This is definitely one of Jackson's best and most creative restaurants. Worth trying!"], ["Melissa M.", "I've wanted to try this for awhile and happened to be nearby today.  The place is bright, clean, and well appointed.  Love the abstract art from local artists hanging in their gallery.  Our server was quick and friendly.  We'd gotten a gluten-free menu from the host, but our server went the extra mile and took it back to the chef who told him the dish we wanted was not gluten free and also cooked in the same oil as non gluten-free items. Fortunately we aren't that sensitive but we appreciated his thoroughness in verifying the items.  I ordered the salmon salad but asked for the kale to be changed for the local lettuces, omit onion, and add feta.  They did this without a charge (although they did leave onions on - no problem as I could easily remove them.)  My dining partner had the simmons catfish with parmesan fries.  Our order came quickly given the lunch rush.  My salad was very good.  The portion was relatively small, but it ended up being enough.  It included lettuce, finely diced cucumber, kalamata olives, roasted red pepper, and a feta vinaigrette.  My son had 3 nice sized filets and a cup of fries.  He liked the fish but really raved about the fries. He said the parmesan permeated the entire dish, not just the fries on top.  Being yelpers, I pulled the listing up and saw a free dessert with entree offer with check in.  We had the chocolate mousse.  It was excellent and a nice sized serving.  It was a complex dish with several layers and flavor profiles - chocolate, crust, ganache, cream, raspberry drizzle, and mine.  And it was complimentary, so there's that!  I will go back and try something else.  It was above average food and service.  Prices were a little steep for lunch (2 entrees, no drinks was $35 with tip) but it was very good."], ["Jon D.", "Very good, prices are a little high but you get what you pay for - worth the price. I had a wedge, shrimp and grits, and a baked apple. Would go lighter next time as my meal was a little heavy. Delicious nonetheless. Free Dessert with Yelp check in was a big bonus. I'll be back, no doubt."], ["Jessica S.", "Very nice atmosphere. Wait staff was nice. I ordered the salmon but it was really salty. As were a few other things I ordered. Aside from that it was pretty good."], ["Shane S.", "This place is great! It has only been opened for a year and half, but they have received awards such as Best New Chef, Best Restaurant, even the sous chef has gotten accolades. The Manship is a huge space, but also welcoming with a more than competent wait staff. The drink menu is extensive and eclectic. The shrimp and grits were out of this world, the pimento cheese is a perfect creamy texture with a little heat. My crawfish pizza was amazing. The crust was just crisp enough to hold up to the buttery sauce. They have a great happy hour with half price pizzas. The strawberry tart with ice cream was the perfect compliment to finish the meal. The Manship is one of the very few reasons to visit Jackson again."], ["Ann M.", "The manship is one of my favorite sit down dinner spots in Jackson, and it's my all time favorite happy hour! Half off pizza's and drinks- YES! Every pizza I've eaten so far has been divine, and the porch-swing and heat index always hit the spot. As for dinner, simple sides like their any gratin potatoes or and veggie dish have satisfied my appetite. Personally, I go for the brocollini and some divine crab beignets . The duck and the filet are terrific, as well as the salmon and redfish. We used the Manship for our wedding rehearsal dinner and were so pleased! The services were great, and all of our guests were extremely happy with their food. I recommend them for events, for happy hour, and for a fun date night! Definitely in my top five for favorite Jackson restaurants."], ["Lisa G.", "Food was amazing as well as the staff. Everyone was very friendly and helpful, from explaining the artist & artwork on the walls to the best recommendations of what to eat. Jake was my server and did not disappoint with the rabbit ravioli with pancetta and chocolate silk tower for dessert! He even brought me a spoon to not miss out on all the goodness of the most flavorful sauce! Telling everyone at the conference to try this place out."], ["Scott A.", "Best steak in Jackson. The reduction sauce on the steak is amazing. I had the Prime cut. Best Mac and Cheese I've ever tasted. My wife got the Greek chicken, little dry in the middle but lots of great flavor. Also had the red shrimp appetizer. Really good but not very many. Only thing missing from the meal was bread to soak up the sauces. The apple dessert was very tasty as well. Great atmosphere."], ["Amin A.", "Actually a 3.5 starWas visiting Jackson because corporate hq is centered here and had to attend training. Prior to arrival I mapped out all the restaurants that I wanted to try and Manship just so happened to be first on the list.  Day one after training I went to the hotel, changed, and went to manship to check out the Jackson food scene with 2 other colleague . The decor was beautiful and the restaurant very clean underneath a hospital it was apparent that the customer attraction was young professional- the restaurant was very busy-  we were seated immediately. The waitress introduced herself and said that the restaurant had many different foods but many dishes have a bit of Lebanese twist and spice added., since the chef was Lebanese. We ordered the tuna dip, and duck wings as appetizers. The duck wings were very good and greasy but had barely any meat on them. The tuna was actually a very good dip. For an entree I ordered the Rabbit pasta- to my surprise rabbit was a little salty of a meat- but furthermore the pasta dish was incredibly small- this was unexpected for a 18 dollar dish. My colleague got the strip steak which tasted remarkable but was a very little bit. The third colleague ordered a pork shoulder- which I cannot comment on because I do not knowingly eat pork. The desert was the best thing i got Tiramisu which was free with checkin was absolutely delicious maybe the best thing I got  Anyway with 2 appetizers, 1 entree, 2 drinks- 62 bucks. Not bad - it just didnt really satisfy portion wise. Regrets: I would get the pizza.I would return."], ["Landon M.", "First time here this evening while visiting Jackson, pleasant experience. The staff adhered to the reservation notes well. Charcuterie and cheese assortment were great. Salad and entrées were well but a bit on the large side. Red fish was cooked perfectly, seasoned well. The sirloin was cooked spot on med rare, only complaint is it was over sauced when it could have stood on its own. Very nice wine selection, especially northern Italians. Bar service was top notch cocktails were well, plethora of digestifs and probably the best Scotch whiskey list in town.  Slides in to one of my top five when in jackson."], ["Shenika C.", "I visited the Manship one afternoon for lunch. I ordered the shrimp po-boy and although it was slightly salty, I enjoyed it. I wasn't impressed with the parmesan fries. Very nice atmosphere and I definitely will eat here again."], ["Cherry D.", "Had lunch here on a Saturday afternoon with a couple of friends. We ordered the chicken, pork, and beef entrees, as well as a couple of alcoholic beverages. The pork was a little on the sweet side for my liking, so I ended up not eating my dish. The beef had a good Mediterranean flavor and it was really moist. But the chicken was on point! I would definitely go back for the chicken. My mouth is salivating just thinking about the chicken. Can't wait to go back."], ["Kris A.", "We were in town from New Orleans celebrating our anniversary so the pressure was on to find the perfect restaurant.                            The restaurant and bar area were full when we arrived with one party waiting but we were sat right away thanks to the convenient reservation I made on my Yelp app a few hours earlier;)On to the service/food experience...First of all the seasonal menu is amazing and I had a really hard time narrowing down my choices because I wanted one of each! We asked the server tons of questions and he answered all of them patiently and honestly. After thorough discussions with the server, browsing through Yelp photos and some meditation, we ordered: the white bbq wings, marinated crab claws, burrata apps, ribeye deckle, parm reggiano fries, mushroom bacon egg pizza entrees and for dessert the chocolate mousse and tiramisu. If youre having as hard of a time deciding as we did, here's the breakdown:Wings were delicious, nothing out of the ordinary thoughCrab claws are the only thing we wouldnt order again.  They were tasty but we expected them hot which thru us offThe burrata was the best Ive ever had. Ribeye deckle are medalions that melt in your mouth and is AMAZING. The pizza had generous amounts of exotic mushrooms, nice chunks of meaty bacon and a perfectly cooked poached egg that just made the bite velvety deliciousness. I am a french fry connoisseur and I wouldnt change a thing about these. Perfect size with perfect amount of salty cheese in a perfect portion. I even left a few which is hard for me to rationalize still today. Our desserts were complimentary thanks to our yelp check in!  The tiramisu is more of a dulce de leche with a slight taste of Bailey's. It was good, just not your typical espresso soaked. The mousse was excellent with a dollop of raspberry that complimented it well. Overall it was an awesome anniversary dinner and we would recommend Manship to everyone in the area. ($160 after tip: 3 andygator draft beers + 1 heavens milk martini not mentioned)"], ["Darren S.", "Now that I have a toddler, we have to make every date night count. The Manship is our most consistent go-to spot for a great experience. You can enjoy The Manship any way you'd like: cocktails and small plates, pizza and beer, or steak and wine. Whichever route you choose, you'll find fresh, local ingredients and the wood-fired grill accentuating everything. We've had excellent service every time, and the decor is bright and clean, contemporary but still comfortable. The open kitchen adds a nice buzz to the room."], ["Claire S.", "Extremely mediocre and pricy not for the portion but because it was kind of gross. Chicken was terribly dry with no flavor whatsoever, yet sitting in fat. Pizza suffered from the same dry chicken and artichokes were incredibly tough. Waitress never did a quality check, which was probably the worst part. She didn't have a full section and never once asked if everything was okay. Mac and cheese was probably the best part and even then - it was 2/10 at best. Won't be back. Won't recommend it to anyone. Best part was the drinks, which were well made."], ["Leon S.", "Food is good....service is slow....shrimp bisque (has  curry in it).... Steak, a u gratin potatoes, fish, and shrimp ravioli is is good .....the personnel aren't too attentive or just don't care ....I still tipped 15%....total of 150$ for 4"], ["Christopher S.", "When this place opened, there were long lines for lunch and dinner...with good reason!This is an excellent restaurant - upscale, great food, local products in the dishes, and full bar.  The Pimento Cheese appetizer is outstanding - fresh and homemade!This is American - Mediterranean fusion, meaning they have woodfired pizzas, brisket specials, sandwiches, and some typical Med dishes (some Med Chicken and other dishes...to be honest, I can not get past the salads, pizza, and sandwiches...oh and the daily specials are excellent).You probably will need a reservation, and they accept Open Table (love the iPhone App).Good service, good food, local ingredients, full bar - 5 Stars."], ["Phil S.", "Great service.  Food was great.  Asked for something a bit off menu and they handled it like it was completely normal.  Bryan behind the bar was working his tail off but not missing a beat. Would definitely go again when back in Jackson."], ["Christine G.", "I was brought here after a job interview, absolutely fantastic food! It was nice enough to sit outside. The staff was nice and accommodating, always a plus. I got the beef Poboy, absolutely delicious. 2 others got the chicken shwarma and nothing was left. The Spanish fries were amazing. A touch spicy, but that's ok. For the dessert, I got Tiramisu. A little on the creamy side than what I'm used to, but that's ok (others weren't a fan). There was also this lemon tart thing with sherbet which was also delicious. If I ever end up back in Jackson, definitely a place to go!"], ["Brenna M.", "Yelp has not let us down yet! It helped us find this awesome little restaurant, Manship Wood Fired Kitchen. We had Grouper with Polenta & Tomatoes/Veggies, Italian Crab Claws, Parmesan Truffle Fries & their Brisket as well as a Pepperoni Pizza with 2 Fried Eggs. Ridiculous. Food Porn. Oh, and their Bread with Seasoned Olive Oil is fantastic. Our three year old devoured the Italian Crab Claws & Brisket!"], ["Vicky O.", "Our evening at The Manship was not good at all! Our waiter never introduced himself as our waiter (he just appeared and asked for our order) nor told us his name (our receipt says his name was Brandon). In fact, his first few words to us included labeling my friend 'sassy'. We should have known then what would follow...Let's back up...I made a reservation, arrived on time and still had to wait to be seated. Not very long, maybe 10 minutes, but what's the point of a reservation if you have to wait? I wasn't a big deal so I let it go. Anyhow, as I was led to the very back of the restaurant (by the kitchen) I passed by 2 open tables that could have fit our group.  I let that go too. My friend and I waited at least 20 minutes to place a drink/appetizer order along. Thirty minutes later only  one of the two appetizers had been received. The other appetizer never appeared and our waiter was so inattentive that we had to flag down another server...whose only response was that he would ask our waiter about the food.  After an hour of bad service we did not bother ordering entrees and took our business further down State Street to Surin, where the service was EXCELLENT!Also, if you choose to eat at The Manship (which we  will no longer be doing)  DO NOT EAT THE BREAD! Our table was in the back next to the bread station (the worst table possible even though we made reservations and there were other tables open!!!) and ALL of the servers handle it with their bare hands. Gross. Gross. GROSS. The funny thing is even though we were so close, our waiter never bothered to provide us with any bread during our one hour stay. And when we asked for our check, instead of asking what the problem was or if we wanted anything else, he handed us our  checks (the only thing he did promptly) with a vibe of  'good riddance'. That is not okay.I will say that the pork belly was pretty good (Table 100's is better IMO) but the culture  of bad service is unforgivable for any dining experience. We will no longer support this business and I plan to share my experience, good and [mostly] bad, with other Jackson foodies."], ["Bill B.", "To start you must try the Porter. Brewed just down the road in Hattiesburg.  Best I've had in a long time. Nora, Caroline and I shared the pasta with lamb special, the shrimp with grits and two veggies, spinach and asparagus.  All first rate. I started with the Caesar. The dressing was a bit under done but still good. The croutons were great. I usually don't eat them but these are a don't miss. Afterward we had ice cream with strawberry tart. The tart is really tart but the perfect compliment to the vanilla.I'll be back."], ["Elizabeth C.", "Great food! We were totally stuffed but still had to order some of the delicious desserts. Our server, Alex, was a doll."], ["Sassy P.", "Grouper was the best fish I've ever been served!!!"], ["James H.", "Their Gin and Tomic is great! I haven't had anything that I haven't loved. It's quite good. Prepare for a short wait at times though."], ["Abigail H.", "Favorite happy hour in Jackson. Incredible food, great drinks. And the service there is wonderful. Take any recommendations they give you."], ["David M.", "On my first visit, I had the fried catfish plate and Parmesan reggiano fries.  The catfish was extremely hot and fresh.  The coating was unusual - a little heavier than what I'm used to but still very good.  The fries were the best part of the meal - covered in just the right amount of parmesan.The environment is really nice.  It's clean, bright, and casual but still feels like fine dining. As it was lunch, I didn't try the cocktail menu but they had a wide variety of interesting options. I think what I like best is that it's locally sourced as much as possible and everything is really, really good quality.  I'll be back to to try the dinner menu soon."], ["Allen T.", "This place is excellent. If I have someone visit from out of town, this is the place I take them. Menu always changes and I have never had anything I do not like. Great service and great food. If you are in Jackson, you should not leave without checking this place out."], ["Christian And Angela C.", "Excellent food. Don't forget to check in for the free dessert.We had the red fish, lamb pizza, and rabbit ravioli. Also the Jerusalem artichokes, carrots, and braised greens as sides. All was excellent. Fish was light and flaky. Pizza wasn't too greasy but the lamb is strong just as a warning. Rabbit ravioli was a bit small but again not too greasy and the rabbit isn't too strong. Just slightly chewy and very tasty. Artichokes aren't actually artichokes but actually sun chokes like fingerling potatoes. Carrots great. Greens good but a tad salty.Minus one star bc my parents didn't like the server Patrick and the tirimasu was pretty meh. To be fair two people recommended the apple cheesecake so must try that if ever back in Jackson."], ["Vim I.", "So glad to see that more and more local-focused restaurants are coming to Jackson. It's been a while since I've been back to the city, so I was pleasantly surprised to see to the new Belhaven building.We tried to make dinner reservations for my sister's bday at Manship for Saturday night, but they were full, so we went for lunch instead. So glad we did. First off, the ambiance is wonderful--very laid back but well thought out decor. A huge blackboard is displayed right next to the open air kitchen--listing the locally-sourced ingredients at Manship.I had the Fennel Sausage pizza since they have a wood fired oven. It was delicious as it sounds. The crust was crispy and flavorful just as it should be.My sister got the duck leg, egg, and polenta brunch special--that was out of this world good. And the boys went with the Italian Panini sandwich and Roast Beef sandwich--which they were really pleased with. The waitstaff left something to be desired--didn't refill water until we asked, switched up the order, and almost spilled the sandwich on one of us. That's the only reason I knocked off a star.Otherwise Manship is well worth going to."], ["Luke C.", "Regular spot for me and my wife. Always pleased with the food and service. The local sourcing of ingredients is particularly appealing. You're doing it wrong if you don't order the au gratin potatoes."], ["Brandon M.", "Went in tonight for dinner and the meal was terrific. We started with the pork belly which had a fantastic flavor. Our party had the pepperoni pizza, Amberjack, salad, potatoes au gratin and spinach. Each was perfect. We finished the night with blueberry cobbler which was a perfect end to the night. Mitchell was our waiter and all his recommendations were on point. Stephen, the GM, made sure to check in with us several times to make sure the meal was great. All in all this was an outstanding meal!"], ["Shay R.", "Filet was delicious! I got my order To-Go and the steak was perfect. Fried okra was also delicious."], ["Emma D.", "4 adults came for dinner.  We arrived early to beat the crowd.  The bar was fairly crowded.We all ordered something different.  The Frito Misto, a fried food appetizer, had a few nice plump oysters and some regular size shrimp along with many popcorn shrimp or something fried, plus some fried squash, artichoke hearts and some very tough fried asparagus.  It was accompanied by two OK dipping sauces.The pizza was so-so; the filet was a filet.  Other than an overpowering sauce the duck breast was tasteless despite an appropriate amount of fat.  The salmon was bland.  We shared side dishes.  The roasted cauliflower was charred but essentially raw and barely warm throughout.  The spinach had been barely wilted and contained an overabundance of stems and garlic.  We enjoyed excellent coffee and the house merlot was good.  All in all I would not recommend The Manship and do not plan to return.The music was not well chosen and was much too loud to allow for pleasant conversation.The desserts were all quite good - tiramisu, chocolate mousse with raspberry sauce and cobbler with iced-cream.  The cobbler was remarkable for not being too sweet.Our service was excellent."], ["Molly G.", "I love this restaurant! Happy hour is a great deal... Pizzas for $5 and cheap fancy drinks! The best drink is the Porch Swing. It's a sweet adult lemonade with alcohol. Careful, though, the drinks are strong! I also love the Jerusalem artichokes and the broccolini. The tabbouleh is thick and mushy-- you might want to skip this dish. The bread is to die for."], ["Krystal C.", "This establishment was great. Well lit, clean, excellent atmosphere. The bread brought to the table was fresh and served warm. I ordered the chicken wrap. The chicken was well seasoned and juicy. The pita was fresh and toasted just right. The tzasiki sauce was excellent. The truffle fries were fantastic. I wish I could have snuck an extra order home for later. My husband enjoyed his fried oyster po boy and home fries as well. Highly recommended."], ["Susan L.", "As a foodie, I thoroughly research via yelpRestaurants trying to find a great choice. On our way to Florida, stopped in Jackson MS. Manship was everything the reviews said; it is so worth the stop! From the porch swing drink, the pork belly app, and the Egg, bacon pizza, everything was delicious. It is so refreshing when a chef takes passion in the fresh, best ingredients and takes pride in using them in the most creative and delicious way! Spectacular!"], ["Orlean S.", "Visited Manship for the first time early on a Sat evening. Parking is a chore at the Belhaven building. The interior of the restaurant is clean and modern. Even though they weren't yet busy, because I had no reservations we were placed next to the bar. I chose Manship not because of the menu online but because of the outstanding pictures of actual dishes they post on Facebook. There is nothing on their appetizer menu that appealed to me. I heard people mention the tuna dip and the waiter recommended it. It really is tunafish with a smoky taste plus saltine crackers and some fancier bread crisps. It tasted OK but I would not order it again for $13. For a salad we ordered the wedge and Mediterranean. The wedge was standard, but I was not impressed with the Mediterranean. I guess I was expecting a Greek salad but this was very different. It had little dressing and was crunchy due to the chickpeas. I would not order it again.Finally for the main courses we had the duck breast and red snapper special. The duck was tasty yet a little chewy as duck often is. The snapper was outstanding - a light flavored fish over risotto and a few squash slices in a wonderful broth. Both dishes need a side so we shared 3: broccolini, fried okra, and tabbouleh. All 3 were terrific. The broccolini was well seasoned, the tabbouleh was good with a little more tang than is usual, but the standout was the fried okra. This should be on the appetizer menu. They were delicious whole fried okras with a roasted red pepper dipping sauce. They are addictive. Overall the Manship was a nice experience. It's too bad the standard menu isn't more to my liking - lacking in appealing appetizers and a larger selection of seafood entrees. But the main course was outstanding - I definitely would return again. Even though we had 3 different people try to take our drink order, the wait staff was pleasant, friendly and attentive."], ["STEVEN W.", "Great happy hour prices.  I had the Scallops, they were a little salty and would not recommend. However, the server asked to redo them and I ate them as is.  The bread before the meal was great.  They have a huge selection of alcohol.  The pizza was great and looked delicious.  I would try this place again."], ["Tom M.", "Oddly enough EVERYTHING was great .I had a bone in ribeye with a veal reduction sauce with a farm fresh fried egg on top.My goodness was it good!"], ["Patrick C.", "Outstanding food & bartenders! See Brian and Josh. Very knowledgeable & experts in mixology!"], ["Rachel D.", "I came here on a Monday night, definitely a little crowded but we were seated immediately. My friend recommended the \"porch swing\" OMG. Heaven sent. It was amazing and had a great flavor - not too overbearing with lemon. We ordered the pimento cheese and bread as an appetizer as well as the pork belly over creamy polenta. Both were great and not much was left on our plates. The pork had great flavor and the pimento cheese spread was a great addition to the garlic bread. I ordered the gulf shrimp as my main course. Angel hair pasta with olive oil and Italian spices with lots of shrimp. The shrimp were cooked to perfection and the spices on the pasta really topped it off. Our server was outstanding as well. This place definitely stands out as a favorite! Will be back the next time I am in Mississippi!"], ["Jess D.", "four stars because it looked and smelled awesome, but don't let the two dollar mark symbol fool you. it is very expensive. at least for my budget. but restaurants with same symbol have half the price"], ["Beth P.", "I have now eaten here often for both lunch and dinner, my best test for is a local place going to be consistently good - and this place passes with flying colors!  Service and staff always friendly and the food from salad to sides to entree has never disappointed."], ["Jonathan V.", "My family and I went to the Manship last night and we were absolutely blown away by everything they had to offer.  The service and the food were impeccable. I highly recommend  the Ribeye Deckle or the Duroc Pork Shoulder for your entre.  After having a bad experience the first time we went I was hesitant to go back, but I can honestly say that after the amazing time we had last night we will be going back on a regular basis."], ["Jose R.", "This place is a true gem. Stopped by with friends and the appetizers were flawless(do not miss the duck ham and the pork belly both were to die for!) The entree portions were delicious and we ordered the range of steaks, duck and fish, all were perfectly seasoned and cooked. The side portions can be shared and the risotto shiitake and grilled cauliflower were simply delicious.We ordered two desserts to share and they were also outstanding, this place is fabulous."], ["Josh C.", "This place is a breath of fresh air to the Jackson dining scene. Had a great meal here, and was treated so well by the staff. I recommend grabbing a few things, and sharing them. (Mary Katherine was a really fun, and knowledgeable server. She really helped us hone in what we wanted, and if I could poach her for my restaurant, I totally would have!)"], ["Jason W.", "I'm from California I found this place on yelp while visiting family here Jackson.  Driving up it was hard to tell what everyone is talking about, but when you walk in its a beautiful restaurant.  I came here on Friday and like it so much I came back on Saturday.  Tried the BBQ wings, the greens, the duck, and the mac&cheese.  Everything was so good and the waiters and staff were really cool.  Everything here is fresh and local.  If they ever decide to build one of these in L.A."], ["Javan C.", "All I have to say is \"meat and cheese\" the selection here was awesome and simple. I had the five selection of meats and cheese it was great. For desert had the peach caramel dessert. A must try if your I'm the area."], ["Maddie P.", "Excellent! We split the the small house Italian salad and the fried soft shell crab BLT sandwich. Both were wonderful! The fried okra was the whole okra stalk with red pepper relish and my favorite thing we ordered. They have an unofficial kids menu and my picky kids loved the hamburger and cheese pizza. The hamburger looked good, but one taste of the pizza and we kept sneaking bits from the kids! Excellent, friendly and fast service."], ["Jason M.", "Casual fine dining, pleasant atmosphere, excellent service and outstanding food. Had the 8 oz filet and it was out of this world. If you're looking for a classy evening in Jackson that won't completely destroy your wallet, this is it. Will definitely be back again!"], ["Sam L.", "New restaurant in new Baptist Medical center. Staff is friendly and very responsive. The lunch entrees we got were the special of the day of brisket, potatoes, and Brussels Sprouts with bacon. Tasted fresh and a great deal for $11. The steak kabob could use a little more refining. Price of $14 comes with 1 side but no starch (rice pilaf would go great) which can leave you leaving unfulfilled. The meat was cooked very well, but 2 main drawbacks: way too much oil is left in dish intended to be part of the sauce and not enough bell peppers to add some crunch to the dish."], ["Rich R.", "Couldn't believe I found this in Jackson Mississippi - the food was amazing, drinks superb and service to boot. The bacon, mushroom and egg pizza rocks.....what the won't tell you on the menu is the pizza has a nice hint of truffle on it.....excellent.... Ask the bartender for a signature cocktail to start, you won't be disappointed. Apparently the largest selection of spirits in Mississippi - maybe but I can't confirm that badge but I can confirm they are well stocked with whatever you want, even small batch varieties of gin and bourbon."], ["Peter C.", "They know how to cook here. Most everything I have had here has been delicious. Some of my favorites are the duck leg confit, the pork chop, the pork shoulder, and the rabbit ravioli."], ["Eats S.", "My work buddy and I are foodies from LA and have been in Jackson filming a movie for the last month and only discovered this place this past weekend. We were greeted with a smile by our server/bartender Nick. Although he was very busy at the bar, he was always very attentive. The food was amazing and delicious! I was kicking myself wondering why I didn't discover this place EARLIER! We ordered the Pork Belly app, the Caesar, the mushroom risotto, the prosciutto pizza, and the Pannacotta dessert with Red Wine poached pears with a raspberry drizzle with phyllo crisps. Everything was spot on, plenty of flavor, and all the right balance of textures. The pizza comes with four silicone ramekins of condiments - fresh dried fragrant oregano, grated parmigiano, large sea salt flakes (Maldon?), and what every pizza should have sprinkled on it, red chili flakes. Nice touch! The prices are fair, you're getting great quality, delicious food so you should pay accordingly, you get what you pay for.We are here for another week and plan to be there practically every night till we leave! The manager Steven does a great job of trying to get to know all the patrons and makes sure that everyone is having a great experience under his watch. This place is truly a gem! Highly recommended."], ["Kent S.", "I cannot believe how amazing this meal was.  Truly exceptional!  The duck wing appetizer is confit and the crisped and tossed in a perfect soy citrus glaze.  The scalloped potatoes were possibly the best potatoes I have ever had anywhere.  The special tenderloin small plate they had  was amazing too.  cooked sous vide and then grilled, topped with a curried jicama concoction.  We went here on the way to New Orleans.  We went to quite a few highly recommended restaurants while we were there and we thought this was the best meal of our whole trip."], ["Elizabeth B.", "The food at the Manship is wonderful; I've liked everything I've eaten.  They also have a great happy hour with half price cocktails and pizza. The bartenders are really friendly and great at recommending cocktails to try, and their Best Damn G&T is to die for. My only complaint--and the only reason it gets less than 5 stars--is that the hostesses are absolutely abysmal. They're not attentive at all when you walk in. Recently, my friend called to make a reservation, and the hostess told her no reservation was needed that evening because the restaurant wasn't crowded or booked at all. Well, when my friend arrived, despite all but 3 tables being empty, the hostess said they couldn't be seated for 45 minutes b/c all the tables were for reservations. The hostesses really bring down what is otherwise an amazing restaurant and definitely one of the best in Jackson."], ["Christina M.", "Upon entering the restaurant on a Friday early evening we were asked by the hostess if we were there for happy hour. We replied that we were really there for dinner and were seated in the back of the restaurant. The menu stated that happy hour was from 3-6 and included 1/2 price pizza and discounted cocktails. My husband ordered a beer and a pizza and I had the shrimp and grits. Service was ok. Food was good. However when the bill arrived we were charged full price for the beer and pizza. When we mentioned to the waitress that it was still happy hour time and could we get our discount, she replied \"no, that's only for people sitting in the bar or patio\" and would not give us the discount. She said this happens to a lot of her customers and the conversation is always awkward but there wasn't anything she could do about it. Not sure why sitting in one place qualifies for happy hour prices when another location does not, wish this was made clear by the hostess when we were seated."], ["Ryan D.", "I rarely ever write reviews, but the Manship boasts amazing food mixed with great service. I tried the calamari (excellent tomato sauce) had the hanger steak with grits. Everything about this meal was perfect. The chef has opted to avoid superfluous amounts of sauces and veiling ingredients and has chosen to instead perfect the meats with basic seasonings. The entree sizes are perfect and the wide variety of addon side items allow for dozens of combinations. The atmosphere is also excellent and the staff is top notch. This is something Jackson has needed.Update: noticed that I had $20 tacked on to my final bill without any knowledge of why only to realize it was their corking fee. FYI"], ["Betty D.", "Great ambiance, great service, great food. Fully loaded bar with lots to choose from. I've been on the hunt to find the perfect fries in Jackson, and my hunt has come to an end. Duck Leg Confit was also crispy and amazing. Highly recommended!"], ["Tiffany L.", "Great atmosphere inside.  Menu is kind of limited.  I had a tuna panini and it was good. The roasted brussels sprouts were the best part."]], "Angelo's": [["Doug B.", "Totally exceeded my expectations.  The pizza, which was what most people were eating, was very good.  Thin crust, too sloppy to pick up, but delicious.  The crust may be the best I ever had.  It was hollow and soft.  I started with the sauteed spinach, which was a great surprise.  Just slightly salty, with lots of garlic and parmesan.Drinks are reasonably priced.  Service was fast.  Our server was a bit quirky, but he got the job done."], ["Nolen G.", "Love me some Angelo's. The pizza is superb. Any type. The crust is always perfect. We love the spaghetti \"gravy\" too. It's not the normal thick sauce most places have. It's the Angelo family recipe. Cold cold beer and good music is always flowing. Great place for kids too."], ["Eileen M.", "Stop here after trying to find someplace to eat lunch and ended up here. We were seated quickly and they brought out the food really fast. I ordered the Greek salad with no olives, while my mom ordered the soprano sandwich. We split each meal. The salad was pretty average but the sandwich was very good. It was chicken, some veggies, and melted mozzarella on top of bread.  My father ordered the brisket plate with Mac and cheese and coleslaw. His meat looked very dry and his aides a little old. Overall the pizza at the table next to us looked delicious . Order the pizza!"], ["Jeff P.", "Great place for lunch !!It's a bbq place but I'm a big fan of their salads.. Their pulled chicken/  pulled pork salads are great. Its well prepared and delicious. They also have some good Italian options such as ravioli which are pretty good. They have a very delicious meat sauce which is used in their pastas etc.. just ask for a sample if you're not sure. Unlike your good ol' marinara this one has some flavor and body to it..The place is always somewhat packed which is a good sign :)"], ["Jason W.", "My girlfriend and I had Sat dinner here and it was a great experience. It is an excellent representation of a Southern family restaurant. The spaghetti was great with a large helping and giant meatballs. The sauce was hearty and flavorful. My GF enjoyed the Seafood pasta and there were generous amounts of shrimp and crab. I think we also got the stuffed Ravioli and those were very good and well stuffed. Service was extremely fast. Prices for entrees were fair and great value, $10-$16. There was a large and unique selection of pizza and subs. I would definitely return, except that it's a long way from where I live. The owner greeted us and thanked us for visiting, as well as assuring we were happy. I noticed they had a lot of good lunch specials as well."]], "Biaggi's Ristorante Italiano": [["Shari C.", "Loved the soup of the day. Italian Sausage and Potato. (Tastes a lot like Olive Gardens \" Zuppa Toscano\".)"], ["Matt H.", "As a general review after several visits, the food is good, not great. The service has been...OK, but not good.The atmosphere gives the impression that you will be having a really special dining experience. The price would lead you to expect that you will be having a really special dining experience. Even the way they package left-overs in these fancy little boxes gives the impression that you are at a high-end restaurant.Let me be clear, I don't mind paying a great deal of money for a fabulous dining experience. However, for the prices here (which I consider to be the high side of moderate) I expect food and service that is a bit better. I don't expect 5-star food and service, but better than somewhere like Applebee's. On our latest visit, we ordered the Jumbo Lump Crab Cakes appetizer. They seemed to be under cooked and the consistency was off. I had the Lobster Fettuccine and as another reviewer posted, \"the sauce was like milk both in consistency and taste. That rich flavorful Alfredo that normally comes with it was watered down or made improperly.\" I can't find it on the menu, so it may have been a special. It was good, not great. There was very little seasoning to it and very little crab. The portion was large though.My wife's dish was so unmemorable that we cannot recall what she ordered. Obviously nothing particularly great or particularly bad. That really sums up our overall dining experiences here, not particularly great, but not particularly bad either. It is perfectly adequate. I probably only go here once every year to year and half and that is just about long enough to forget that I was a bit disappointed last time.  I think for the prices, it should be a bit better. There are better meals with better service to be had here in town for the same price. One Italian place in particular comes to mind, but I don't want to mention their name in the Biaggi's review."], ["Ryder T.", "It is a chain Italian restaurant. It is fine.Some other reviews have noted that sometimes they rely on too much sauce or cheese and too much salt. I'd definitely agree here. One particular instance was a salmon salad, nothing fancy, just a bit of salmon dropped on top of some mixed greens. The salad, however, had way too much olive oil and lemon juice. So much that it really interfered with the salmon.There are definitely some tasty dishes but nothing is going to blow you away here.The food is generally well prepared, however. The service is lovely and the price is not atrocious for lunch or dinner."], ["barb G.", "The lasagna noodles were so overcooked, they look and taste almost like mush. They can do better."], ["Doug B.", "This is a small chain in with locations in random (mostly affluent-ish) suburbs.   Open view of kitchen.  We had great service here.After trying samples of the soups, chose the Chicken Florentine soup.  Bread was very good.  Enjoyed the subtle flavors in olive oil.   Chicken Marsala was very good.  Chicken Park was huge.  12 desserts to choose from."], ["Brandon T.", "Biaggi's is my favorite restaurant in Madison. Their half pasta option is available all day and are the perfect size and price for lunch and dinner. During lunch, they also offer a pasta and salad lunch combination which is pretty affordable. My favorite dishes are the Squid Ink Pasta dish or the Bolognese dish. The environment is very impressive with a very open floor plan."], ["Jennie B.", "10/05/14 This is our fave place to eat however today we felt like we were eating in a completely different restaurant. This review is atypical of my previous experiences but it was so horrible it is worth voicing!The service: The waiter just didn't give us the attention like we mattered. He wasn't that busy, but even when he did come to our table he didn't ask or offer anything outside of taking our order. The manager was young, not-confident, lacking genuine concern for customer satisfaction and again didn't ask or offer us anything outside of fixing our problem bass on our suggestion. The chef and or cooks had to have been short cutting because everything was horrible!The food: My entree was the Lobster Fettuccine and not only was the lobster still blue but the sauce was like milk both in consistency and taste. That rich flavorful Alfredo that normally comes with it was watered down or made improperly. The manager brought me my bowl, and it was incredibly obvious as the liquids sauce sloshed around that it wasn't right. He should've never placed it in front of me.My brother's ravioli was over cooked and under salted. The filling was mostly gone and the pasta was a hardened yellow color. The manager did offer to replace my entire, so I ordered the Beet, Goat cheese and Arugula salad. My brother had finished eating by the time they got it to me so it was not comfortable with him having to wait for me. There was some in identified ingredients in the salad and the arugula salad was not only old and rotting but the tough core of the Arugula was not chopped ours.My brother and I were in shock.  They messed up 3 dishes. They offered free dessert and we turned it down. Free or not we wanted to get out of there first because I was starving a needed to get food somewhere else and 2nd because we couldn't trust them to remake anything.It's clear based on this incredibly horrific experience that the chef and cooks, manager and server cared nothing about the quality of our food or experience.I only hope they can redeem themselves, they'll only get one chance from me if I work up the guts to take the risk. It was our favorite place and just a few months ago we went once a week and now I'm not planning on returning anytime soon."], ["Allen T.", "Food quality and flavor is not good. Service is average.  Location is good.  I would not recommend this place. Much better options in the surrounding areas."], ["Michael D.", "HORRIBLE. Potential good time gone bad. The food was cold, our ticket was wrong, and the server kept copping an attitude. As I'm writing this, I've waited 45 minutes to leave. Get your team together and get on the same page. I will not be back. - EDIT: The bald waiter was horrible, almost seemed drugged out. On a positive note, Heather was wonderful and very pleasant."], ["Richard L.", "Popped in on a cold rainy day for a friend's birthday shindig, and it was all I expected, great food, great service. I got the 4 cheese ravioli, it was dangerously cheesy, but perhaps my palate isn't as sophisticated but it just tasted like 1 cheese ravioli extraordinaire with heavy cream sauce. A colleague mentioned it was a chain, which I found surprising as it had that boutique feel. It's a great place for families and parties as tables and booths can accommodate quite a large number of people. I'll definitely be coming back."], ["Ashley W.", "This place is amazing !!! From the outside appearance, to the wait time (5mins), to thee food, atmosphere and ambiance. I tried the lobster & crab pasta, that's wrapped in spinach, (I forgot he actual plate name). But it was beyond delicious. I requested for it to be made pasta, which they did not, but it was Sooo worth it! I've never had anything Soo spectacular. I adore this place! I do intend to return."], ["Eric F.", "Good service. Disappointed in adult entrees. Kids pizza and apps were best things we had."], ["Lisa W.", "Gets 5 mostly because it is excellent considering it's a chain . Very few have this consistent quality of food and service which is why I prefer to avoid most chains. Menu always has some original creations, servers area always accommodating to tastes."], ["Latoya S.", "First time here and the food was great! Atmosphere is very nice and romantic like. The inside is beautiful. Felt like I was fine dining. The waiters were awesome and very professional. I had the chicken pietra and I was concern about the honey mustard sauce in it. But once I got it and taste it. The sauce is awesome! I would definitely come back again. The alcoholic beverage I got was Sicilian margherita. It was LOVELY!!"], ["Cynara S.", "What's happened to my Biaggis? I am sincerely hoping this was an off night but it was bad enough to prompt this update.  Update sounds deceiving as if they'd risen.  Oh no,  far from it.  Last Tuesday night...they fell...Fell flat on their face with a splat.  The manager did his best to apologize but alas the damage was done. Wait staff and service was still very good but somebody needs to kick some tail in the kitchen.  A gracious waiter and apologetic. manager can't overcome poorly prepared food.  Faster is not always better.  I hesitated to update this review but I gotta rep of telling the truth.  You can believe me when I say it's great...Cuz I also tell ya when it ain't.  ya know?"], ["Chris M.", "My experience wasn't great. Our server seemed VERY new, and the manager wasn't much better: I wasn't informed that they were out of tuna until everyone else's food was almost ready. When asked if my new order (tilapia) would come out at the same time, we were told \"Obviously not, I haven't put it in yet.\" I waited an additional 15 minutes for my food, and when it came it was under cooked (it is somewhat difficult to under cook Tilapia). I sent it back and they made an additional order for me, to go. I ended up eating a caesar side salad and bread service for dinner. Ultimately I received my meal for free, which is fine, what bugged me was when the manager informed me that \"This should make you happy.\"Biaggi's is a chain, Italian restaurant. And you get exactly what you would expect from that experience. Flavors are very rich, too rich at times (caesar salad, breaded tilapia). Flavors are somewhat confused (see bread service including olive oil & kraft parmesan cheese product for dipping).I won't be back, my poor experience aside, Olive Garden food is better."], ["Stacy K.", "We have enjoyed eating at biaggis  for years and we have never been disappointed with the food, until now. We were aware that the restaurant was under new management, but we decided to give it a try. It was absolutely terrible. My husband and I decided to split the \"special\", pasta with gargonzola sauce and grilled chicken. Kraft Mac and cheese would have tasted better than our meal. Chewy noodles, chicken cubes, and salty bacon, along with a processed cheese sauce made up this \"special\". No garnish, color, or vegetables to be seen on our plate. The only reason we didn't complain was because our manager seemed overwhelmed as he followed his employees into the bathroom (a steady stream of kitchen staff and waitstaff kept going into the bathroom. To say we're disappointed is any understatement. Wow, we will never go back."], ["Tuesday F.", "Biaggi's was always a favorite of mine. However, this last visit was disappointing. The quality and portions have changed dramatically. Including my favorite, terimasu."], ["J.E. B.", "I've only been here twice, but it is my go-to place when passing through the Jackson area. I'm not a fan of chain restaurants, and I probably would not have went here the first time had I not been with a group, but it surpassed my expectations in every way. It damn sure ain't no Olive Garden or Carrabba's. It's also in a pretty nice part of town (there's a Rolex dealer next door, and a Brooks Brothers within walking distance).During my last visit, I sat at the bar with my girlfriend. The bartender, whose name escapes me at the moment, was awesome. He was a young guy, late twenties, and I believe he had recently graduated from nursing school. This guy is a rock star at what he does; very personable and a good conversationalist. If I'm not familiar with the menu and I get the feeling that my server has similar tastes, I'll hit them up for suggestions. Everything he recommended was great. First we tried a peach on prosciutto appetizer. Peaches on cured ham sounds crazy, right? It was da BOMB! My girlfriend and I shared an entree: baked ziti. I'm not a big pasta guy, but I enjoyed it.The app and entree were great, but honestly, the real reason I came here was for dessert. So diabetes runs in my family, but YOLO. I love bread pudding. If a restaurant has it on the menu, I'm ordering it. I had it both times I've dined here. The first time, I had their standard white chocolate bread pudding. It's so good, I don't even know where to begin. It's like jumping off of Mount Everest wearing a wingsuit, while Jimmy Page plays a thirty minute extended version of the Stairway to Heaven guitar solo. IN YOUR MOUTH. Hands down the best I've ever had. The bartender recommended I try the bread pudding bomboloni, which was basically flash fried pieces of bread pudding with rum sauce and vanilla ice cream, sprinkled with cinnamon and brown sugar (if I recall correctly). IT.WAS.AMAZING.. Like Zeus himself came down from Olympus and shot a sugary lightning bolt in my mouth. If i lived near this place, I'd probably dessert here every day. And when I had to have my leg amputated below the knee because of diabetic necrosis, I wouldn't even be mad."], ["Ieisha E.", "I have no complaints. This is a great restaurant. The food always tastes good. The presentation always looks great. I have visited quite a few times and my favorite so far is the lasagna bologanise . (I know I spelled it wrong but close enough). I have yet to try any of the deserts. Overall this place has a great staff,food, and atmosphere."], ["Cindy M.", "A friend and myself met at Biaggi's yesterday for lunch.  This being my first time dining there.  We were seated quickly in a booth.  Our waitress showed right up and took our drink orders and brought bread and butter, which looked wonderful, however neither of us had any since we are watching what we are eating.  Our waitress answered all our questions about the menu and took our order and kindly removed the bread and butter temptation.  I had the Oven-Roasted Talapia and my friend had the Dijon Crusted Salmon both are on the Lighter Side of the Menu section.  They were really good, I would order mine again.  While we ate and visited our waitress checked on us several times and a gentleman, I'm assuming he was the manager.  We really enjoyed the food, the service and after eating sat at our table chatting for at least another hour.  It is what I always describe as a day well spent and I'm glad we chose to meet for lunch at Biaggi's."], ["Shanon S.", "Been twice and loved my meals both times!  Definitely recommend the Capellini de Mare and the Shrimp and Crab Cannelloni. The Mediterranean Salad was enough for an entree!  Will definitely be back."], ["Christopher S.", "Very good restaurant.The staff care, and go out of their way to make things right.  The bartenders are friendly, and suggest their own cocktails.They will make you anything you want, off the menu. Incredibly fresh!!!!Great specials, and very fresh tasting food.  You would forget that this is a chain restaurant, and a great find in Ridgeland!"], ["Michelle F.", "Completely satisfied! Food and service was fabulous. We had stuffed mushrooms for an appetizer. I'm not a big fan of mushrooms but this appetizer was phenomenal. We have eaten here several times and have always had great service and food in a timely manner. Baked Penne Sardi and Lasagna Bolognese are a few of our favorites."], ["Daniel L.", "This was a nice business lunch place. Lunch is hard to do right - it is either overwhelmingly pretentious and you feel like you need a tuxedo to be at the table, or it is something cheap and sloppy. Biaggi manages to find the happy medium and offer it up in a well decorated, relaxing, but still very nice and formal business casual place. The waitress was very nice and kept refilling teas and water, which is always an important part of any meal. I went with the half and half lunch special - half of a Caesar salad, half of the chicken piccante pizza. The salad was laughably small, just funny how small it was. The pizza was overwhelmingly large - I eat a lot and I could not finish it. The pizza was amazeballs though.The chicken piccante pizza is spicy grilled chicken, smoked bacon, leeks, Montchevre goat cheese, on Italian cheese. Yummy, delicious, amazing. Everything blended together well and the goat cheese finish was just impressive. Strong, lots of flavor, I can't help but thinking about it and wanting it again. It was that good.You should really think about the chicken piccante pizza. The salad won't fill you up, but the pizza will."], ["Coral E.", "Love Biaggi's.  Have always had fantastic service, really great food and you can't beat the bread they bring you.  Actually....the cocktails are pretty darn good too!  Yes, it can be a little loud and crowded - but that's because it's good!"], ["Letty E.", "Blah. The most generic, flavorless Italian food. Lasagna tasted frozen. Not one ounce of love in that food."], ["Cameron Y.", "After a long weekend in the Jackson area I needed a nice comforting meal before heading to the airport. I was staying at the Hyatt in this same shopping center so I decided to give this place a try.I was immediately excited when I saw the combo options of soup/salad or salad/pasta, so I tried the wedge salad and the butternut squash ravioli. The wedge was just as I was craving. Pretty standard. The ravioli was not at all what I was expecting. It was in a very light olive oil and butter sauce with large pieces of walnut and small cubes of squash. The cubes of squash tasted like nothing, and the walnuts added texture, but took away from the spices used in the butternut squash filling.This place kind of has an Olive Garden feel to it, and sadly, I prefer Olive Garden..."], ["Kris A.", "I eat here about once a year when I visit Jackson. Every time we order the mussels because they are AMAZING! I have never eaten anything similar. We asked for the recipe and it was so long I said forget it, Ill just have to order two orders for an app and so that's what we do now. I like the lobster pasta and the squid ink linguine doesn't bother me like other reviewers, I think it gives it a unique touch. All of the desserts are good and it has a nice atmosphere too."], ["JAN k.", "We had a GREAT meal and a GREAT time. Ask for Brian as a server. He added so much to our meal. Wedge salad with blue cheese dressing. Delicious. I had tube pasta with red sauce and Sausage. It came with a scoop of goat cheese on top. I scooped off the cheese and  used the spread on my bread and it was devine. Hubby had the garlic shrimp dish with the spaghetti in the middle of the plate and nearly licked the plate. Dessert was apple thing with a butterscotch sauce substitute and a scoop of Ice Cream. BTW share the salads and order a half order of pasta it you are a small eater or like bread dipped in oil. DEFINETLY ask for BRIAN! Will return the next trip to Jackson. Price was appropriate."], ["Joshua S.", "The atmosphere is great for dinner for two or for large groups.  It isn't a very kid friendly restaurant though, but that's not because of the restaurant, simply because of the typical crowd you'll find there.Overall the food is at best average.  The selection isn't very good, and a lot of the meals taste very plain.  When I think of Italian food, \"plain\" isn't what usually comes to mind, but unfortunately that is what I've found at Biaggi's.  If I'm with a group and they want to go there, it isn't so bad that I refuse, but it isn't a restaurant I ever suggest. It isn't terrible, and worth a shot if you want to try it out, but I don't highly recommend it."], ["Scot D.", "Thoroughly enjoyed this stop on our way back home. I felt the staff was very friendly and enjoyed the atmosphere. I loved the bread and Stromboli. The pizza was good, not the best I've had, but I still enjoyed it. Would definitely go back if the opportunity presented itself."], ["Michael H.", "Biaggis. What can I say? The food was pretty good - butternut squash risotto. They can use some work on the drinks; my advice is not to have a drink containing St. Germaine on the menu if you're unable to get it. I, instead, had a sidecar and a capherinia.There were 14 of us and the hostress would not allow us to sit until the entire party had arrived. Strike one.To make a long story short, a little before 7 the manager came out and tried to get us to leave, stating the table had been booked for a 7:15 reservation. Two of our party had shown up late (the reservation was for 5:15 but that should not matter - and they would not accommodate them because of the lateness; i.e get them a chair. They then had a audacity to stick a gratuity on the bill (which I can see because of the party) but if you really stick it to your patrons you should remove a gratuity. Strike two.The manager kept saying that, in no way, was he asking us to leave. In my book, if someone tells me that my table has been reserved - and I'm waiting for my dessert - then you are essentially asking me to leave. Strike three.The waitress was apologetic - until the end. She even began crying. When she came back with the receipts, she threw mine down on the table - and I'd been nice and not said a word to her. However, one guy in our party commented that we'd be going somewhere else next time. The waitress, in passing, said 'Please' in a voice loud enough for us to hear.I won't be going back."], ["Joe M.", "The entrees were decent and the portions were reasonable. The ambiance was nice (we sat in front of the brick oven).   The dessert was ok to say the least. Tiramisu was too soggy and wet. The banana foster was disappointing. The waiter appeared to be new (a rookie).  The hostess was nice."], ["Darius M.", "This review is almost two months late, but I would be remiss if I didn't take the chance to leave a positive review about my visit.This was my second visit to Biaggi's and I must say that it was a better experience than I remember the first time.  The first visit wasn't bad by any means, but it just seemed like this visit was far superior to it.This visit was on a Friday night, so it was extremely packed; about a 30-45 minute wait.  Our waiter, a very enthusiastic gentleman named Brian, was phenomenal.  He made sure that the specials were thoroughly explained and was exceptional when it came to taking care of our needs.  My dinner companion started to get a little perturbed and stated that his attention was a little much; borderline stalker. LOLThe food was great.  We had an appetizer that everyone on the staff called the \"best appetizer on the menu\" named Shrimp and Crab Arancini. While it was good, I think there may have been better selections.  But that just leaves an opportunity for me to go back and try them all.  The entrees were great.  My dinner companion had the Sea Bass and I had a pork and pasta that was a special that night.  The flavors for both were great.Then came the finally of the evening; a good desert.  I ordered the cheesecake and my friend ordered the Torta Cioccolata.  The cheesecake wasn't the best I'd ever had, but it was pretty darn good and the Torta was as much chocolate as any one person could ever want.All in all, this was a very nice experience.  I've read a couple of other reviews that bashed the place, but I can't see why.  Maybe they need to go back and ask for Brian as their waiter.  No way you can have a dull experience with him."], ["Lawrence Z.", "This was the worst culinary experience in Jackson, Mississippi.Everything was so mediocre.  You are definitely paying a premium for the decor and location.Food was terrible.  Service was mediocre.  Ambiance was mediocre.The lamb chops were undercooked and closer to raw--my girlfriend and I don't get food poisoning!"], ["Annica J.", "Everything that we have had here has been very good."], ["Alli B.", "Big portions and tons of variety for everyone.  Can accommodate large groups."], ["Allen G.", "Great for lunch. Quick service and you can't beat the Pasta & Salad meal."], ["Marci W.", "Went to Biaggi's years ago in Champaign, IL so I was excited to try it again. I took the waiter's advice and got the ZITI AL FORNO and loved it. My MIL decided on the filet mignon salad and enjoyed it as well. Jason was an exceptional waiter. Look forward to returning."], ["stephen c.", "Everything I've had is good. Zetti Forno is probably my favorite, but I tend to not stray from what I know when it comes to Italian."], ["Author Sandra L.", "I've eaten at Biaggi's 3 times and I have been very pleased with the service. My first time eating at Biaggi's was for an NP Nite Out and the food as well as the service was top notch. I have taken my family there on 2 other occasions and they love it too! The atmosphere is relaxing and the waiters are always ready to provide whatever the customer needs. Two thumbs up!"], ["Skip R.", "One of the finer places in the Madison-Ridgeland area. Biaggi's is in a super nice part of town and the atmosphere is lovely. The basket of different varieties of bread is very, very good. The simple table side made condiment of olive oil, pepper, and Parmigiano Reggiano cheese is so good.  I can tell you the calamari is always fresh and seasoned nicely. I have had several of the pastas and all were good. However, there is a clear star of the show here. It is the fettuccini with lobster. The pasta is made with squid ink, so it is black. It is tossed with mushrooms, herbs, and huge chunks of lobster meat. It is finished in a delicious cream sauce. Don't forget to get an extra basket of bread. You won't want to leave any of the sauce in the bowl. I get this almost every time I have the pleasure of dining here. I think you will enjoy Biaggi's. Give it a try the next time you find yourself in town."]], "Sal and Mookie's": [["Jonna B.", "When we go to Sal and Mookie's, it's often with a big group and they always accommodate us. The drinks at the bar are made strong (which isn't a bad thing) so be sure you have someone to drive your home. The pizza isn't bad, but I prefer to build your own calzone. It's a great atmosphere for friends, pizza, and drinks because you can sit outside as well as inside and the service has always been great. They have a Sal and Mookie's on the coast, but it's nothing to write home about. Be sure to check this spot out if you're in Jackson/Fondren!"], ["Meredith F.", "I've been on the search to find my go-to pizza place in Jackson, and have been meaning to try Sal and Mookie's since friends always speak so highly of the place.Pros:- Came with my family at 5:30 on a Saturday. It was already starting to get packed, but we were seated quickly. Hostess was very kind and friendly, too.- The inside is bright, clean, and family friendly. I was expecting it to be more dive-y, so this was a pleasant surprise. - WINE!!!! OMG, WINE. AND COCKTAILS. I'm always super disappointed in many restaurants for only serving beer (boo, MS strict wine/liquor license laws!) and have almost come to expect most places to have just that.- The spinach salad was on point!Cons:- It's pretty loud in this place. Ambiance is fun but nothing special. Great for kids, though.- The pizza we got was pretty bland. It's like they didn't use any spices whatsoever on it. For what hype this place gets, I expected more adventurous flavors.Although Sal and Mookie's won't become \"my\" pizza place, I'll probably be back for a date night with baby in tow. The wine list and casual atmosphere pair together nicely for that. -"], ["Gary J.", "Better than a Hot Pocket but not as good as that Dominoes supreme you really want (and should pick up instead). Perhaps the biggest drawback to this pizza joint is the price.  I retreated to a sufficiently dark and serene place in order to search my heart before I rendered the final verdict.  I weighed the pros and cons, the price, the quality, and the service ad nauseam.  In the final analysis, we are left with a 3-star rating.  Also note that this is this author's third experience here. First, this place is cool.  It has all the trappings trendy post-modernist architecture.  The premises commands this response: wooden faces engraved tall and proud oaks, the slightly retro-hipster dress and appearance of the wait staff, and the quintessentially modern (yet, ethnically suggestive) logo bearing the image of two chefs with a pizza (you'll recognize it immediately, its a cross between the Pringles guy and Mario).  Ergo, it is a great place to take a first, second, or third date.  Scratch third--hold at two.  Second, this place holds itself out as a traditional pizzeria.  Unfortunately, Sal shows it hand early by exposing the mundane and dehydrated pepperoni pizzas on display in the foyer as your hostess approach your table.  Granted, its not as unsightly as those spinning under a blatant heat-lamp, but it is offensive enough to discourage you. The initial wave of wait staff, hosts, were generally disorganized and seemed confused.  A party of less than five should not have proved to be such an insurmountable variable.   The server never bothered to refill beverages unless pressed (this sounds petty in the printed word but we all know what this means).  However, the server was surprisingly adapt at providing answers to questions about the menu.  I wish he or she could have been more consistent. Thirdly, this place is confusing.  There is a mysterious tomato image next to almost every other menu item.  After consulting the Da Vinci Code, the party and I finally concluded that it reflected vegetarian options after losing those precious minutes of dinner discussion.  This was far too great of a mental exercise than I care for in a purported, \"down-to-earth\" pizzeria menu. However, what this place cannot deliver in pizza, it makes up for it stromboli form (inconsistently). Notice the confusing \"Strom\" next to each entree which means you have have the option of ordering it as a stromboli or pizza.  I came to eat pizza and not decode menus. Fourthly, where the HELL was the server or the wait staff during this time to provide that essential guidance?  Whatever he or she was doing, it did not entail providing much needed clarity to the menu.  I would be willing to bet it violated his employment contract as well. Finally and ultimately, stop here if your in the mid-north eastern quadrant of Jackson.  At $15 a head, my stromboli was much, much better than the best pepperoni hot pocket i've ever had but less than the best Dominoes i've had recently."], ["Irene R.", "I stopped here with the family because several people suggested it.  As a Native New Yorker I was not impressed with the pizza.  The crust was soggy and the pizza overall was bland. The ice cream was just Blue Bell, not the homemade ice cream I was expecting.  At least our waitress was nice."], ["Brandon T.", "I'm a big fan of this restaurant. They have great specials and offer a student discount. The environment is a very family friendly style pizza joint with the red checkered table cloths. The Gambino is the only pizza I'll order now. I highly recommend it."], ["Isaac S.", "The pizza was good and i really wanted to try the ice cream but a fly was caught in the closed ice cream holder and that more or less killed my desire for the ice cream, but again the pizza was good, not quite NY style but good nonetheless."], ["Rachel P.", "Sal and Mookie's is an extremely popular restaurant here in Jackson, and for good reason! First of all, it's a huge venue which is great because it definitely gets crowded for dinnertime. They offer plenty of large tables, making it an excellent choice if you're heading out with a group of friends. Marketing themselves as an old-fashioned pizza and ice cream joint, Sal and Mookie's has a lot to offer. The pizzas are definitely good, from what I've had. It's sort of a Jackson-Does-New-York-Style-Pizza situation. The ingredients are fresh, the crust is crispy and the sauce is hearty. The other dishes I've tried have all been good. The seafood and pasta dishes are delicious, and the portions are HUGE. You will definitely be asking for a box at the end of your meal, trust me. Sal and Mookies offers a really good variety of quality, local beers, but it's definitely on the pricier side if you're just looking for a place to grab a drink. Splitting a pitcher and pizza with friends is a great deal though. Since they're located right in Fondren, this is a really fun place to grab a good meal with friends before heading out for the night."], ["Ryder T.", "Sal & Mookies is good, but it's popularity has gotten ahead of itself. This is part of the Jeff Good triumvirate - Bravo, Broad Street and Sal & Mookies. Bravo was one of the original high end restaurants in Jackson. Broad Street and Sal & Mookies target a more casual demographic. There are a lot of great things about this restaurant, but I am giving it a 3 star rating because it is usually just slightly disappointing, and slightly overpriced.Sal & Mookies focuses on Pizza and Panini. The pizza is New York style - thin crust, often too thin and soggy. Recently I overheard the selection of toppings described as \"weird\" and I guess that is about right. The selections are not always what you would expect, while quite good, sometimes they just miss the mark. If you order pizza, make sure to eat it all - this pizza does not keep well. The bar side - dubbed The Pie Lounge, is quite good actually. It is a small bar area but has a nice covered patio. While the bar is nothing fancy, it does offer inexpensive beer and a perfectly acceptable range of liquors. It doesn't seem to be a \"regulars\" sort of place, but I feel that it is an often overlooked place for a cheap, quiet drink.One great thing about this restaurant is the ice cream. There aren't a lot of places to go get a scoop of ice cream on a hot day, and this is an excellent choice.Lastly, it is very important to mention that this place is super family friendly. There are always big groups and families there having a great time!"], ["Donna N.", "I went out to dinner with my aunt and my cousin on a recent visit to Jackson and fell in love with this place.  We were seated outside on the patio, but there no mosquitos and it felt so good outside.  How did they do that.l???  I didn't want to eat anything as I was not hungry, but I could not resist the pizza.  It was so hot and gooey.  The restrooms and the inside of the restaurant were immaculate when it comes to cleanliness.  Dixie, the waitress, was also a sweetheart.  I look forward to my next visit as I want to try dessert!"], ["Kendon D.", "Wouldn't waste your time. We passed through on a road trip and ended up not eating. The waitress got our drinks and then was a ghost. It was around 330pm or so and we waited for over 15 mins for her to come back and take our order. She went over and got a table of 2 ice cream, then a table of 4 their ice cream...it was really slow, only 4 table including us. We left a $5 on the table and decided to head out! Went around to the take out area in the \"Pie Lounge\" and there was 3 people cutting up and jacking around (what it seemed like to me) and I told the guy that I left the $5 for the drinks on the table. He seemed concerned and offered a gift card...appreciate the offer but hey, I won't be back!"], ["Wes M.", "Good pizza. Always good service. Great family spot. Cold beverages. Love sitting out on the covered porch when we go."], ["Abigail H.", "Really great lunch special. $5.50 for a big slice of pizza and a salad. Not my favorite pizza in town, but still good. Good service and good ambience. And UMC employees and students get 15% off if you show your badge. So definitely worth the visit."], ["Tiffany N.", "Great vibeGreat serviceGreat customersGreat food. Really there's no bad thing I can say about this place. It's delicious. The prices reflect the quality. You will not go home hungry and disappointed. Our waitress checked on us frequently and was super nice. The pizza was DEFINITELY NEW YORK STYLE YEEAAAAAHHH. and you have so many options from the menu or you can make your own. And let me say, I come from the home of the toasted ravioli and the cheese toasted ravioli was the best I've had since leaving St. Louis  OMG I can taste it now....bear with me while I fantasize. Fiancé took me here for our valentines day dinner. It was actually the day before valentines day and we didn't have to wait to be seated. The crowd here is awesome and eclectic. There's many cultures, races, blended families...it's beautiful and everybody always seems to be having such a great time!! Would definitely recommend this for a family night out if you have children. And don't pass up dessert. That would be unpatriotic. Either go to the ice cream bar or order off the menu. You can't fail. We (...I lol) had the ice cream sandwich. I chose chocolate chip with vanilla ice cream and it was BOSS. the cookies were homemade and the ice cream was made from a cow and I really appreciate said cow for producing the best thing ever. Plus, they decorated my plate with raspberry sauce swirls and heart sprinkle. Soooo cute I almost didn't eat it...haha psych! I smashed it within minutes! My taste buds were happy but mannnn my stomach wasn't. I'm lactose intolerant, but ask me if I cared....exactly. Not one care that night."], ["Latina R.", "Visiting my mom and decided to try this place and wow! Service was wonderful and fast. Food was great!"], ["J O.", "New York style pizza with NYC beer prices. Pizza is pretty good but was a bit greasy. The beer prices are absurd. Jeff Good should be ashamed of himself. Lucky town brewery is a block or two from this place and Sal and Mookies charges 7$ a pint and $27 a pitcher for Ballistic Blonde . Other pitchers were as high as 28$. That is a nothing but straight greed and highway robbery. #FindItFondrenWe were there during a big event in the Fondren area. The restaurant was pretty busy but we were seated immediately. The bar was empty and very few people were drinking beers. I wonder why?Seriously though...  Mellow Mushroom can make a pie just as good and has a better beer selection at half the price. You don't need a police escort for parking there either."], ["Robert W.", "Great place for the family! Garlic Breadsticks and Cheese filled Ravioli for starters. We had the Meat Packing District pizza, wow! Ice Cream bar was a great bonus too."], ["Matt M.", "Best pizza joint in town. Hands down! I love the New York style, and the sauce and cheese they use is too notch. It's my go to place when I'm craving pizza."], ["Flavio S.", "The meat packing district pizza is definitely my favorite. The plethora of meats and cheese is just heaven. Big foldable slices with the perfect amount of crunch in the crust. The staff and is friendly and definitely welcoming. Also, I appreciate the large amount of parking available when it gets busy."], ["Minna Z.", "This is one of my favorite restaurants in the Fondren area and one of the only places that is opened on Sundays in the Fondren area. The 4 Train is our favorite. We usually get half 4 Train and half of something different to try. We then live off of leftovers for the next few days and it is the best week ever. They also have great daily lunch specials at a very affordable price. I usually get the daily slice special (you can choose from 3 different pizzas) with a side of a Caesar salad and then dip my crust in the leftover Caesar dressing. Their staff is always friendly. They have great draft beers and happy hour specials as well. Although they are always busy, they have plenty of seating so the wait is never too burdensome. Great pizza, great beer, and great staff means 5 big ole stars from me!"], ["Jake S.", "Probably the best pizza I have ever had. Great bar as well! They have a really good selection of local craft beer. Must try the Stromboli."], ["Kellie S.", "Stopped here while passing through and they had the best mozzarella sticks that I've ever had!! Absolutely amazing!! The pizza was pretty good too."], ["Jason B.", "If it's New York style pie you are seeking this is the joint.We came for lunch on a Tuesday and was happy to see there was a lunch special. A slice and a side for $5.50 is a good deal.We both had the \"park avenue\" slice with a side salad. The other option was a beer cheese soup(yes I said beer and cheese!) which looked delicious. Slices are thin and flavorful topped with pepperoni mozzarella and clumps of ricotta. The only disappointment was that the salad shared the same plate and arrived warm. Green goddess dressing was cool, tangy, and garlicky. Washing it all down was the ubiquitous southern sweet tea, which was perfect!I felt compelled to try the ice cream(just so I could report of course) and settled on the pecan bar sundae. I switched it up a bit and replaced the customary vanilla with praline ice cream. This pair was topped with hot fudge and mounded with fresh whipped cream. Ice cream was good, but the bar had an off flavor I could not place, and chalked it up to maybe day-old baked goods?Overall this place was good...good price, good atmosphere, good service...but it doesn't make the list..."], ["Alison L.", "The pizza was great, but as a pizza lover it wasn't as great as I was told it was going to be. It was really greasy. I love chucks of meat as much as the next carnivore but these were almost too big. I'll stick to the Mighty Meaty from Mellow Mushroom, whole pieces of bacon have my heart. Also, the spinach and artichoke dip had huge chunks of artichoke in it which made it kind of unbearable. And the tea wasn't sweet. BUT other than that, the service was great and it really is going at least once."], ["Sydney M.", "Great lunch deal: $5.50 for a slice of pizza (a choice between 3 options, a red sauce, white sauce, and/or a veggie) and a side of soup or salad.  The beer is overpriced in my opinion, but Mississippi's laws and taxes may be to blame for that.  Other drink prices are standard.The pizza is okay.  Maybe New York style ain't my thang.  Honestly, I would prefer a fast food pizza (don't judge!), but it's a fun place to go with large groups. The porch is nice to sit on, and the service is amazing.  It's also a nice place to walk to from UMMC."], ["Sweet O.", "There is nothing special about this pizza joint but they hype and the price! The place needs a good steam cleaning/ pressure wash to boot. I know good pizza, have had outstanding pizza, just not here. Apparently the Jackson public has fallen for the snake oil the owners sell - shameful! Do yourself a favor and order a dominos' pizza and a some of your favorite micro brew for half the price and all of the taste!"], ["David O.", "I'm only giving it four stars because of the price. The food was great, they have a good beer selection, and they even have good pairings for beer and food. I haven't tried the pizza and that's mostly because it was like $19 for a regular 6 slice and I'm a college student and can't really afford to eat like that. In their defense, the panini I had was great (Tony Montana). Look forward to eating here when I actually have money one day."], ["Sothy P.", "The best tiramisu and spaghetti/meatballs in town.  Love the homemade taste of the meatbals/sauce.  Warm and friendly atmosphere.  Great staff.  Always a wonderful dining experience.  Their chicken wings are pretty awesome too!  I wouldn't say their wings are better than Fusion's wings.  They're both awesome, but just in different ways.  Definitely will have to stop by Sal and Mookie's along with a few other restaurants when we're in town."], ["amc a.", "The Riker's Island pizza was really good except the crust was buckling under the weight of the toppings and juices and grease. Very generous with the toppings. Crispier crust and this could easily be a fave spot. The large easily fed 4 people. The fried ravioli - those kinds of apps are typically throw away apps, but theirs tasted like they put effort into them - fried lightly and with care. Sunday brunch cocktails were very affordable less than $7 each.Vanilla ice cream mix was delicious and the pecan bar was good - small portion and served cool. Would be better hot."], ["Ronald D.", "This is probably the most perfect pizza restaurant I've ever experienced. From decor to service, we found no faults. From step risers to assist children to view pizza and ice cream preparation to wire risers to keep table uncluttered, attention is to detail for patron comfort. The pizza variety boggles the mind. We had a traditional pepperoni pizza and a weird pizza concoction of spinach, cheeses, mushrooms and other ingredients I didn't recognize. Being an anything but pepperoni pizza preference person, I have to admit the pepperoni was delicious as was the \"weird\" choice we chose. We will patronize anytime we get close to Jackson."], ["Tricia R.", "Jason was our server and I couldn't ask for better. He was very accommodating and friendly. The cheese sticks were fabulous, very chunky with robust marinara sauce. The pizza was great, the crust being the best part. Then there was the ice cream. For ice cream freaks like the two I was with, it was simply heaven. And all of this in a hip atmosphere with cool music. The only thing missing was a stretcher to carry my rolly Polly, Vienna sausage feeling body to the car. I will be back-soon!! Oh, and did I mention I decided to forgo my vegan diet for the day and just be vegetarian? I could not go and not sample the savoriness."], ["M C.", "I went here because the locals really recommended it when I arrived to Jackson... I went ahead and ordered the Tony Montana Panini which was amazing! (A bit spicy but still amazing!) I also went the following day and got their lunch special which was not bad at all (one slice of pizza and a salad... I had to add a slice because one wasn't enough lol) I didn't get a chance to try the ice cream, but it looked amazing as well! Definitely must go of you're ever in the Jackson area!"], ["B W.", "This was the perfect dinner stop after a long road trip. The pizzas were delicious but nothing could top the lemon ice box cake for dessert!"], ["Kenneth C.", "Hands down; the best Pizza in Mississippi. Cool bar. Ice cream parlor.  Nice selection of beer. The Meat Packers District Pizza is my personal favorite."], ["Nathan S.", "After moving to Jackson from the northeast, my wife and I have concluded that we love Sal and Mookie's because it is authentic and traditional, yet isn't afraid to appeal to the local flair. This is our second trip to this place and we walked away even more impressed than after the first visit in April. The traditional Italian stuff is great--just like we were used to back home--and the appetizers are fantastic. I highly recommend the antipasto platter followed by the Greek salad."], ["Judy D.", "Today was not a good day for pizza-cold dry and if you don't enjoy brown lettuce not a good salad day either. Waitress was having a great time playing with her hair so at least somebody was having a good time."], ["Keke W.", "I have been meaning to log into Yelp and rate this place since December 2013! This is hands down the Best Specialty Pizza place in Jackson MS. My cousins and I went on a suggestion and boy, were we thankful! We ordered two different pizzas and both were simply amazing. The Rockaway Beach and the Riker's Island pizzas were so good that I tried to go back the next day because I couldn't get it out of my mind! Unfortunately for me, the next day was a Monday and they were closed :( This will become a favorite of mine as I often frequent the Jackson Area year-round."], ["Dawn M.", "One of my most favorite Jackson restaurants. I had heard great things about them while I was working in F&B out west in Las Vegas, and I couldn't wait to try them upon my return. It was well worth it. I prefer thin, New York style pizza, and I think they do a fabulous job of providing that in the Deep South. Their paninis are great, and their burgers are fabulous. Don't miss out on their house-made Green Goddess dressing. It's awesome not just for salads but also for pizza and fry-dipping as well! They've created a casual atmosphere that is also family friendly. You can enjoy a tasty drink or a great local or regional craft beer while the kiddos mind their manners to earn the ice cream bar. Plenty of seating inside or outdoors on their climate-adjusted porch or Pie Lounge patio. Another hit from the Jeff Good-Dan Blumenthal food line. If you want upscale or sandwiches, try their restaurants Bravo or Broad Street Deli."], ["Maria W.", "Yummy yummy and YUMMMY! Wow, they have some really good pizzas and ice cream. I haven't eaten carrot cake ice cream before in my life til I tried it here. It is wowing good and over the top. Great food and apparently everybody and they momma goes here because I saw my spine doctor, and teacher here. I don't know maybe MS is a small state."], ["Steph B.", "Yes....the meat packing district is awesome....be sure to ask for a shady spot in the summer. We came at a not so busy time and everything was good and quiet"], ["Melissa E.", "Great food and service!!! Our server Gabe was great! We asked to be moved to another table because we had an air vent making us really cold and he was very understanding and nice about it. We ordered the mozzarella sticks to start with which were really good. Then we had a pizza that was half of their specialty meat market and half Franklin. The ingredients were fresh and the crust was perfect! The restaurant is beautiful and spacious inside and very clean! Overall a very unique and delightful experience!"], ["Nolen G.", "Now that I have been to all of the obvious places on my Jackson Top 10 burger list, I am now running around hitting the outliers that folks tell me about that are \"really great\"This week's stop was Sal and Mookies.....yep, the pizza joint in Fondren.  The menu has 7 custom burgers on it.  I has an inside tip that the Satriale's burger was seriously good.  \"75% ground chuck & 25% hot Italian sausage  ( 1/2 lb total), flat-top grilled and topped with prosciutto,Provolone, and sautéed onions & peppers $9.95\"Since it has the pork in it, they will only cook it \"done\" so don't ask.Other than the fact that it was a bit dry from the \"done\" temperature, it was a really good burger.  The flavor of the patty with the sausage mix is really good.  The bun was good.  Not sweet, plenty moist.I liked the fact that I could substitute a Caesar for fries at no extra cost.I have been there quite a few times for Pizza and I always left feeling like I was a bit overcharged for what I got.  I think the burger and salad are a great value.   Good portions of both burger and salad."], ["Ieisha E.", "Pizza wasn't all that. Great atmosphere. I love how there is a IceCream bar. I had Alfredo and it was pretty okay. My hub had some type of sub with fries and he really enjoyed it."], ["Paeton W.", "Cheese pizza was bland, as was pepperoni & sausage. Margaritas were dreadfully off. Lemon icebox cake was plain- not worth the calories. But the people with me made for great company & the waiter was pleasant. Will try something else next time though.:)"], ["Erica J.", "Pizza was great, server was very knowledgeable, quick service.Awesome atmosphere.***LEMON ICE BOX CAKE BROUGHT ME TO LIFE;  I NEED IT EVERYDAY!!!"], ["Chye M.", "Great NY Style pizza. We love the cheese pizza with half spinach & tomato and the other half Italian sausage & tomato. Really good food, KID FRIENDLY!! It's not cheap but you DO get what you pay for! The food is definitely worth the price. My kids and I absolutely LOVE this place!!"], ["Doug B.", "Great pizza - and this comes from a Chicago-deep-dish pizza fan - and even better service. Chris made the experience for us. He's a great sever and very knowledgable.  I would recommend everyone five this place a try. Ask for Chris as your server and tip him well."], ["J K.", "Was in Jackson for work and needed a good spot to catch the final half of the Saints game, get a beer and some tasty food...well Sal & Mookies fit the bill!  They had an excellent selection of beers on tap, I'm a sucker for new local brew...and well, of course the pizza was beyond awesome!  A great little joint I'll recommend to anyone headed to Jackson for whatever the reason!"], ["Eric G.", "I'd say 3.5 stars is a solid score for here. The service is without a doubt good. I really like New York style pizza and this place is better than most hole in the wall New York style pizza joints. We had garlic breadsticks and pepperoni pizza finished off with Spumoni. The garlic breadsticks were good not over bearing with garlic, however the marinara sauce had great flavor so I was looking forward to the pizza. We got the pizza and the crust was sweet, but I wish I could have tasted more of the sauce. The pizza wasn't too greasy as some New York styles are. The Spumoni ice cream was a nice way to finish off our lunch. This is a kid friendly place as they hand out wiki sticks for children to make designs and stick on the wall, for the adults they have a few draft beers available."], ["Coral E.", "Great place for delicious pizza (haven't found a specialty pizza I didn't like), great salads, pasta & paninis and great dessert.  My favorite thing to get is the Donald Trump panini with a caesar salad.  Yum!!!  Great service as well!"], ["Shakita R.", "Some of the best pizza I've ever had! Sal & Mookies provide a great family friendly atmosphere. The icing on the cake is the complete ice cream bar. Really enjoyed it."], ["Desmi L.", "Found this place on Yelp and by far the best meal I had in Jackson. Our server Chris was friendly and very helpful. I wish I knew I could get half/half pizzas. Oh well next time. Pizza was great, fresh toppings and the crust was awesome. We had the John Bleeker, grilled chicken w/sundried tomatoes and caramelized onions. Yummy! If your passing through don't skip this place."], ["Bob G.", "Enjoyed a nice evening with friends tonight at Sal & Mookie's. After a 20 minute wait for a table, which is pretty normal on a Friday night, we were seated in the side room, in a corner table... honestly, not the best spot for dinner. However, the table wasn't the priority, as a nice dinner with great friends was more important. I ordered my usual Meat Packing District Stromboli, which is great, and always more than I should eat in one seating. The service was great, as usual. Sal & Mookie's is always a great place to go."], ["Andrew K.", "This was my first experience with this place. I am sorry to say that it was a very average experience. I got half one specialty pizza and half other specialty pizza. (Can't remember the unique names) I got carry out and warmed it later. It actually looked better then when I picked it up. Don't even know how to describe the taste other than average - nothing special. I have had much better ny crusts around the country. Maybe I am spoiled because I do get to eat at dozens of restaurants like this one all over our great country. The best part of the experience was the cop out front who helped me park. Employees inside seemed just ok. Toss up if I will give these guys another shot. They do have a unique concept though."], ["Jericho C.", "This place freaking ROCKS!  Great food; great service; great music.  I did the ziti Alfredo with chicken and panchetta.  It was bananas!!!"], ["Eric P.", "Amazing pizza, courteous staff, and awesome ice cream selection are just a few of the things that will keep you coming back to Sal and Mookies!"], ["Stephanie T.", "Went for a special lunch with my daughter as this is one of her favorite places. Things were going well food and service-wise until we got up for ice cream. While we were up (5 minutes tops) an over zealous busboy cleaned off our table and it was given to someone else! We had some boxed up leftovers on the table which were thrown in the bus bin and covered in bus bin water. I caught the busboy (bus man) right before he walked away from our table and he very unapologetically handed them back to me, dripping. Talk about gross. The manager saw it all go down and didn't offer much beyond \"sorry\" and a new bag for my leftovers which I'm not really sure I want anymore since they've been through the nasty bus bin. I had to ask for a replacement drink for me while we finished eating. My daughter wasn't offered one. Thought I would at least get the ice cream comped or something for basically being shoved out and our leftovers ruined. Nope. Go for decent food but be wary of over zealous busboys and ineffective management."], ["Matt W.", "Being from Chicago, I was skeptical at first, but this place has really GOOD pizza. The service was fast and friendly. Josh was very polite, and had good suggestions. The manager was friendly and thankful for the positive comments. I would highly recommend checking out Sal & Mookies! ...Plus they have really fun toys for the kids!Oh, and the home-made mozzarella sticks were GREAT!"], ["Win B.", "In town for a soccer tournament. We had a large group of about 25. Excellent service given our size group. Good food. Great place for kids. Authentic New York style pizza."], ["Jon M.", "Excellent pizza and amazing ice cream."], ["S H.", "Tried this place several times and each time it gave us gas!!!- Must be uncooked dough or something...Skip unless you want your farts to smell like pizza."], ["Austin C.", "Wow, wow, wow. This pizza is amazing, good beer selection, and dessert that cannot be beat. Had a very friendly waitress who was able to help us out with our selections (it was good to know we could do a half and half specialty pizza). Got the meat packing district, and can not say enough good stuff about it. I made sure to leave a slice for the next day, but more so that I had room to try the pecan bar. Talk about amazing. It's like heaven, plain and simple. If only there was a place like this in Dallas, I'd be in trouble. Cannot reiterate enough, amazing pizza, amazing dessert, and a plentiful beer selection (featuring some local Lazy Magnolia!). If you're in the mood for any of the above, Sal and Mookie's is a great place to go."], ["Melia D.", "Hands down, Sal & Mookie's serves up the best pizza in Jackson. The crust is perfect: crisp on the outside, chewy on the inside, and the ingredients are fresh and delicious. My husband and I custom order our own pizza: cheese with roasted red peppers, caramelized onions, and goat cheese. We'd really like Sal & Mookie's to put this on the menu and name it after us. :)We're also fans of the CBGB's (Italian plum tomato sauce, mozzarella, pepperoni, roasted garlic, and red onions). The menu is so extensive that you're sure to find something you like. It's on the pricey side for casual dining -- around $25 for a large pizza -- but we consider it a worthwhile and regular splurge. Sal & Mookie's is a great place to have a birthday party; I've held one of my own and have attended two friends' parties here. The restaurant has a lively, colorful family atmosphere, and the ice cream bar offers a broad selection. Eating on the patio is pleasant when the weather is nice. You can also have drinks at the adjacent Pi(e) Lounge and order off the menu. This is one of my top five favorite restaurants in town."], ["Crystal H.", "This place was wonderful!  I will come back here any time I visit Jackson.  The service is super friendly, the food came out piping hot and really quickly.  The cocktails were priced just right and not skimpy on the booze. An overall fun place, with good people and great food."], ["S B.", "Good food and atmosphere.  It doesn't stand out though.  That's the reason for three stars.  It is a great restaurant to visit if you are in the Jackson area for a while."], ["Jennifer C.", "Decent NY style pizza, horrible pasta, not sure about the sandwiches, overpricedI agree with the previous poster. Prices are a bit much. They aren't as expensive as I thought they were after visiting NY and going to some pizza places up there, but then again the pizza is amazing up there. This place tries and actually does okay although they are a little sparse with their basil (they should just chop it up and put it on the pizza instead of whole leaves - 1 per slice). Also, the cheese is sparse if you order fresh moz.I'm not a fan of the manager either. The first time I went there he was actually kind of rude. So as much as I'd like to go back (although my husband thinks their pizza sucks) I doubt we'll be going that much. Pizza shak down the street has much better prices although admittedly, the pizzas are quite different. If you are really craving NY style pizza then this place should do the job. but then again, so would sbarro's if you're just looking for pepperoni."], ["Baron M.", "I could have sworn I already wrote something here, but I guess I didn't! Anyway, they have great food. I have not had anything bad here, ever. Maybe one day I had a few ice crystals in my ice cream, but that is as close to \"bad\" as I have seen. The only thing keeping this from being 5 stars is that the prices are very high for our area. Beer is priced high, pizza is priced high, entrees are priced high! It is all great quality though (well, the beer is beer, they aren't making it any more special) and you can feed two people on one pizza, so I can't complain that much."], ["Joshua S.", "This place has some awesome pizza!  My personal tastes are a little boring (limited to meat/cheese for the toppings) but friends of mine are more experimental and seem to love nearly every pizza they come up with.  The ice cream is incredibly good as well.  The full bar adds a nice touch.  My wife loves the \"Uptown Barbie.\"  The only drink I don't recommend ordering from Sal and Mookie's is a mojito.  I've tried it a few times and it is consistently far too sugary.On every occasion the waiters/waitresses have been very friendly and timely, and the orders have always been correct.  That always helps."], ["Jeff R.", "Great spot with wonderful outdoor seating. Great menu - pizza are fantastic."], ["Kate W.", "I want to give it a good review because I'm a fan of bravo and broad street... But this pizza is not new York style pizza. I really wish it were, but there is a huge difference in new York and this pizza. The dough is kinda tough. And if they had a brick oven, it would taste so much better."], ["Darci B.", "I would give this 3 1/2 stars, but I can't...their prices are particularly high. Their food is excellent, but I'm not sure $12 for a Stromboli is worth it.I got the chipotle chicken BBQ Stromboli because it was different, and man, was it good!My husband got the Cuban sandwich and has previously had the chicken parmigiana.  They were both good, but not GREAT. I haven't tried their pizza, because I can't see paying $25 for a large pizza.The atmosphere is good and the staff was incredibly friendly and helpful.We will probably go back, but not anytime soon."], ["Dawn O.", "One of my common hot spots! Food is great, drinks are pretty good & the atmosphere is laid back & sociable. Great place to meet up with friends. The 4 Train (with chicken) pizza is awesome! Don't be afraid to try it! I also like the Zydeco & the CBGBs pizzas."], ["Annica J.", "I just wish they were open on Mondays.  Get the chicken wings for sure!  Everything that we have tasted has been a huge hit and of course the kids love the ice cream bar."], ["Dale J.", "Excellent food & service! Flexible on adding to or taking from their set pizza toppings. Great tastes. A must try if you're in the Jackson, MS area!!! For great service, Ask for Lorianna's area."], ["Herman S.", "The atmosphere of the place is a good vibe. I really dig the Muffaletta Panini (muffaletta on the thin, pressed-grilled, focaccia bread). I wish they offered a cardboard grease catcher like in the bottom of a Pizza Hut box to absorb any grease from their Pizza. Everytime I've ordered any pizza with meat it's served on a metal pizza pan and once cut the grease collects on the pizza pan and thus continually soaks into the crust of the pizza, making the crust saturated with grease. I've much prefer it if they had some sort of grease catcher between pizza and pan. The ice cream is ok, not great.  The large kitchen windows are great for kids to watch their pizza's being made."], ["Scott M.", "We're visiting from Georgia and visited Sal and Mookies after reading Yelp review.  All I can say is wow!  Everything from the salads to the pizza was the best we've had since leaving New England. The service was spot on and the entire staff made us feel welcome.  Oh and by the way......try their cheese cake too."], ["Alan S.", "I may not be giving Sal and Mookie's the credit they deserve.  It's got a great atmosphere with plenty of indoor and outdoor seating, and they serve a good variety of draft beers (yet they were out of 4 or 5 of the 10+ drafts available).  The service was excellent and the food is great.  Menu is a bit overwhelming, but it's got plenty of options. The problem with this place is that the prices are ridiculous.  I mean come on... Six bucks for a pint of beer--yeah right.  And I don't care what you put on a pizza, if your ingredients cost your customers 20 bucks or more for regular size pie, that's not legit."], ["Mark S.", "I like this place.  Very kid friendly.  Great service.  Pizza was really good.  Very relevant menu choices.  Not just the same old topping combos."], ["Amy L.", "Good pizza and great sandwiches, but you can find equally as good in town and not nearly as expensive.  Wait staff is friendly and attentive."], ["DeTria T.", "If you are craaaaaaaaaving ice cream like I was, this place would not be my first choice, HOWEVER, it is a very nice restaurant with a great vibe.  I loved the way I felt walking in, the friendly staff and the way that it is decorated.  I would definitely eat a regular meal there, but I don't plan on going back for the ice cream."], ["Shannon N.", "Great extensive menu, but extremely disappointing.My first visit to Sal & Mookies was not spectacular, but it was not unpleasant altogether, so I thought I wold give it another try just so I could form a more valid opinion on my own experience here.The atmosphere is clean and cozy, not too bright and not dark where I would have to squint to see the menu.  Always a good sign.  The menu is great, full of options for choices to choose from.Our server quickly mentioned he is new to the job, so he had to ask his manager a few quick questions about some things on the menu that we asked about.  He had kept our water glasses filled, and even checked on us often while we had waited our food.  Great server for someone who is new on the job.However, our pizzas had taken well over 50 minutes to arrive, and were both not hot.  One was the Riker's Island pizza, turned out to be luke warm, and the other was the Arthur Avenue, not even warm at all.  The roasted eggplant on the Avenue was not exactly roasted, whereas it was completely burnt.  The salad, which we had ordered as an appetizer, had come out the same time as the pizzas.  The first time we had visited this restaurant was not long after they had opened a few years ago.  The service was quite good then, but the food was mediocre.  I thought my judgement then was a bit too quick at that time, especially since they had recently opened then and may have needed to so some quick adjustments like all new restaurants.All I can say is kudos to the customer service, but blech on the food."]]}