{"Wraps": [["Greg M.", "My son Noah Munck saw this place when a group of us here from California for an event stopped at Starbucks.  Wasn't sure what to expect.  By far the best Chicken Gyro I have ever had.  Noah said his Lamb Gyro was ridiculously good and his best ever.  So... just go!"], ["Ryder T.", "It is an experience to go to Wraps. For instance, a while back a little controversy erupted when the owner made some anti-Semitic comments to a local Rabbi. They apparently made up about it and so it is safe to go there again. I was excited, because the food was sloppy delicious the first time I went. My most recent visit involved the owner emerging from the kitchen with a knife and jovially threatening to cut some bits of anatomy from the man working the cash register who cowered in what was probably only mock fear. This sort of banter will probably color your visit too, especially if you come with a group.Price is reasonable. Menu is limited but the quality was not what you can get elsewhere. Wraps is somewhat (or used to be) entertained with another greek restaurant in town, Krilakis, but I am not sure the relationship anymore. You may be better off finding Krilakis (it was in \"downtown\" Ridgeland, last I checked).Quality has definitely declined. The lamb was *ok* but the chicken was tough. Granted they did admit they were scraping the bottom of the barrel on the chicken (end of the lunch time) but still, it was pretty bad.Service was entertaining. While they kept forgetting to bring out fries, the proprietor did come over to regale us with tales of his mother banishing him to Jackson (from NYC) (truly the Rothschilds of dingy Greek diners). He peppered this with a few colorful jokes and free dessert. That Baklava was on point. Probably the best I've had in Jackson. Of course, the unexpectedness, the freeness and the fact that I was almost hand fed it by the owner made it that much better too.However, we go to restaurants to eat primarily and the quality of the food just isn't good enough to make it. Stop by for the experience though!"], ["Duan C.", "Considering the hype behind the Rabbi's experienced at the restaurant - this update is strictly in regards to the service I received from the proprietor.My service wasn't as bad as the Rabbi's - but it wasn't downright welcoming either. I guess I was so excited behind the portions of the food I was not paying that much attention to them, as were they to me either. I'll put it to you like this - when we walked in - I wasn't greeted with an \"Hello, welcome to...........\" When I paid out - I was thanked and that was it. So in regards to the customer service I received, I can honestly say I have received better at other places."], ["Ruhi R.", "Going into the place, it gives off a slightly shady vibe. It's a hole in the wall, but while being a stand alone building. The gyros are good, nothing great, but it's good for the money. I really enjoyed their chicken gyros and fries. I would come back to this place but for takeout, not to sit. The good is a good price for the money."], ["Michelle S.", "The atmosphere is top notch sketchy. We chose to sit outside. Lady at the register didn't have change for a $20 so I had to use a credit card. Most employees were pretty friendly, but it was obvious they were Greek.  Food was okay. I got a gyro and fries-- fries were good and gyro was a little salty. Sauce was good. The only complaint about food was that it didn't have paper wrapped around it so I felt like I was eating a large taco. For drinks it was all canned drinks or water-- and soda selection's were slim pickings (coke, coke zero, diet Sunkist).I'm scared to know what their health department rating is."], ["Grace B.", "The absolute best Greek Salad I've ever had! Chicken was incredibly marinaded.  Such nice owners too. Think I just found my favorite place to eat"], ["Ann C.", "Wraps are so tasty and perfectly seasoned and cooked.  The chicken is fabulous and so is the traditional gyro.   Fries aren't the best but the salad is amazingly delightful.  Atmosphere could use a little update and deep cleaning. There is a very sweet pleasant blonde lady working in there who makes the experience even better."], ["Calvin M.", "The food is ok. It's just like any other standard Greek fast food I've been to. Really nothing special about it. All was well until I asked for some hot sauce. Turns out they charge $1 for it. I was told since they make the hot sauce on site, it's not free. That just wasn't right. And to top it off, the sauce wasn't even hot. I probably won't be coming back."], ["Chris V.", "A must visit. Don't let the exterior fool you; Wraps is a gem with great gyros and hummus. I only wish we had one where we live in Louisiana. I'd be a regular."], ["T N.", "Food is MEH, service is horrible.  They charge extra for every little thing and they act like they are doing you a favor by serving you."], ["Ben S.", "Food is as disgusting as the employees. I love Greek food and made the mistake of wandering into this place after arriving in Jackson. It's unsanitary and the employees are rude. Oh and the fries were soggy. How do u screw up French fries?!? Stay away....far away"], ["Heather P.", "Everytime we travel through Jackson we make it a point to stop in Wraps. We have only ordered the Gyros and fries so that is what I will chat about.Service is always fast, you step up to the counter, order, take a seat and in about 5 minutes your food is delivered to your table.They don't skimp here.    Most gyros I have gotten it's hard to find the feta.  Not here, you want feta you're getting it.I'm lucky if I can finish half of the gyro.Yes the place is a bit \"divey\" but it's what makes this place just cool.  Odd quotes and such on the walls."], ["Jeff F.", "Food is average at best, service is horrible. Owner does not care about customers. Feels like they are doing you a favor by serving you."], ["Edie K.", "Best gyros in town! Great salads, pita mozz, and fries. Can't go wrong with anything on the menu"], ["Chris-Amanda B.", "Delicious! Our family stopped here while passing through Jackson; we have had Greek before, but this was far more delicious. The fries were great, but the lamb wrap was amazing! Great food! Great service!"], ["Dan B.", "We found this place on yelp, while traveling through Jackson on our way from jazz fest to memphis. At first, we had difficulty locating it because there is no business name sign, only a large Greek flag that had blown over onto the roof the day that we visited.Walking in, the place is quaint.  Plastic tables and chairs grace the smallish room and there are drawings and sayings all over the wall.  We were greeted by a friendly waiter who took our orders at the cash register, and the food was brought to our table within minutes. I got the lamb gyro, while my son got the pork.  They were both succulent and deliciously moist and flavorful.  I consider my self a middle eastern food expert having had it all over the world for all of my life, and this was probably the best gyro I've ever had.  My son's was equally delicious, my first time having a pork gyro.  Mine came on a whole wheat pita, which was a nice option.We got some hummus to go, which was also great.  Would definitely recommend!!!!"], ["Amy L.", "I love restaurants that are eclectic, delicious and locally owned and Wraps fits the bill perfectly.  Don't let the appearance deter you, it is WELL worth paying a visit.  I have had the Greek Gyro and the Chicken Spanicopita, both of which were out of this world delicious!  The pitas are warm, soft and fluffy, the meats are high quality, flavorful and tender and the sauces are creamy with distinct flavors.  I will be going there often for sure.  The staff is warm and friendly and make you feel like family the minute you walk in the door."], ["Peter G.", "Atmosphere is eclectic divey. Lots of random pictures and paintings decorate the walls. Girl behind counter was basically it as far as employees. That said she was very knowledgeable about the menu and very helpful in picking out an item. I had the lamb gyro with a Greek salad, gyro was great, tzatziki sauce was wonderful. Salad had a great dressing, beware some of the olives are pitted others not so much.I wouldn't recommend this place if you have young kids. Zero booster or high chairs and extremely small bathrooms."], ["Diam N.", "much like his gyros, the owner's a sloppy mess of shit, covered in an unidentifiable white liquid, who hates jews"], ["Audrey S.", "Prices are about a dollar more expensive than what is says on Yelp. Regular gyro is $6.75 and you can't get a cup of water, you have to buy a bottle."], ["John Eung Soo K.", "Great gyro, great company. Owner is a riot. You can really tell everything is made fresh."], ["Yoori C.", "I got a mixed lamb and chicken gyro for $6.25 + tax. You order at the counter and take a seat in a booth or table. They have a bunch of pictures and interesting quotes all over the walls. (i.e. \"Red, white, and blue are the colors of freedom, except when they're flashing in your rear view mirror.\" in addition to a few others about the economy, friends, society, etc.)The place is pretty narrow and probably sits about 7 parties of no more than 4. Both meats were soft and juicy with fresh lettuce and tomatoes. The tzatziki sauce was pretty good too. I would recommend Wraps if you're looking for a quick meal at an average price. It was nice to eat something that wasn't fried for a change."], ["Beth A.", "I want to rate this place highly, I do. Nothing better than a local hole in the wall with great food right? And the food was good. And it was ready relatively quickly. But my experience was horribly bad, due to the rudeness of the worker behind the counter. She was mean, and angry. She also substantially overcharged us, and acted terribly inconvenienced when she had to issue a refund. I left with a pit in my stomach, the kind that you get after a confrontation with someone, or after you've been bullied. Yes, it was just that bad. If there had been even a hint of a smile, I'd give it 3 or 4. But when I tapped the bell to get her to the front to issue our refund, I saw and heard her yell, \"Jesus!!!\" before she came out. My husband is orthodox Christian, so that made him feel kind of ashamed that an orthodox establishment would have workers that behave that way. The really good food is why I didn't give a 1 rating. :( If mean people don't upset you like they do me, by all means go there. I'll never ever go back. So much negativity! (For reference, our visit was late January 2014, on a Friday night, so no owner seemed to be present.)"], ["Liz C.", "My husband and I are stationed in Meridian and we both had a serious craving for Greek food, gyros in particular. So after reading the amazing reviews for Wraps, we decided to go there. I'm not sure if maybe we just went on a bad day...or have eaten at enough of other good gyro places that we know what a true gyro tastes like and have become a little picky. The bread was covered in butter, making me feel like I was eating a fast food burger. The meat was extremely salty, to the point where I just couldn't eat anymore after 3 bites. Even the feta cheese I got on mine was extremely salty. I couldn't even taste the tzatziki sauce because the salt was so overbearing. There was no taste at all...but salt. I started to pick it apart and eat just lettuce with tzatziki sauce to try and let my mouth take a break from the salt over load...and even then there was no relief! We are pretty healthy eaters so maybe we just aren't used to a salt overload? Either way...we will never eat here again. The fries were not \"fresh cut\" as advertised...they were just like any other fries you can get at any food place. The thing is....the fries had less salt on them than the gyro did! The place had a nice, laid back feel to it. The plastic chairs are actually really comfy! It has a nice \"hole in the wall\" feel that we love. But that's about the only positive thing I can say. With the price of two gyros, fries and drinks at this place we could have gotten a much better meal in a nicer place. Typically the \"hole in the wall\" places have some of the best food I've ever had but this place is an exception to that rule. They have these little quotes all over the walls that I guess employees or guests write and put up, and although some were funny, a lot were not very family friendly. We don't have kids and don't care about it, but if we did have kids, I wouldn't want them reading some of the stuff they have on their walls. So, I guess if you are used to their salty gyros and that's all you know, then that's awesome. But if you've had a truly good gyro before and have a craving for one...don't go here."], ["Baron M.", "As far as the Jackson metro market goes for gyro's, this is as good as I have found. The portions are large, sometimes huge, yet still flavorful. I end up going here about once or twice a month and I always end up with the same thing - the regular gyro. To me, it is good enough that I don't really even feel compelled to try the rest of the menu, though the red snapper (I believe) gyro sounds quite tempting. The fries are generally done right, though sometimes I ask them to make them a little crispy. They come with some sea salt and a nice flavor. The inside is fun, though seating can get a little tight. I wouldn't suggest a group of more than 4. Possibly 5 if you can snag a chair from another table. Some days it can be standing room only, but they are still, generally, quite fast getting your order out. I am marking it as cheap, but it can get pricey, depending on what you get or add (I think feta is $2.50 extra on a gyro that doesn't already have it, dessert is a bit over $4 after tax, etc)."], ["Kristin B.", "This place is awesome.Wraps is a local hole in the wall Mediterranean gyro place with about 6 tables inside and 3 outside.  You grab your drinks from open coolers located by the door, or the pitcher of iced tea on the main counter. The prices reflect the setup - quite affordable. In fact I was surprised that they even took cards at the register!My brother recommends the veggy wrap - All the regular veggies of a typical gyro, minus the meat, but has fries in it instead. Strangely delicious. I'd recommend the fish gyro though - delicate fish (talapia I think?) seasoned just right and melts when you bite into your gyro. And of course the regular ol' gyro is pretty tasty too - though like Shannon says, the meat is cut kinda chunky.They're  big too - come hungry. I can't ever finish the side of fries.Wraps is located outside of the Maywood Mart shopping strip in what I believe was previous a Pizza Inn."], ["Heather S.", "Drove through here on my way from San Diego across the country.  Without making any comment on the very modest interior design of this place, I have to say this is the BEST hummus I have ever had in my life, even in Greece. Was disappointed there was not more vegetarian on the menu, but understand this is not California.  The hummus made up for everything."], ["Arthur M.", "Real good wraps and real weird inside."], ["Jared M.", "We were on a road trip and found ourselves pleased we chased this restaurant down. I wish I could give you more. Next time I am driving through I will try this place again."], ["Dimi J.", "We were out of town and stopped by because of the good reviews. First if all, this place is hard to find. Its directly behind the Subway and not visible from the road. Place is small maybe 10 tables inside. Cool greek music. We got the food to go. The food was very good. I had the gyro salad and it was great. Highly recommend it. They should really consider using the Romaine lettis. I was very happy with the overall experience especially for the price. $11 for large gyro salad, fries and side of sauce on dinner menue. The lady at the counter was very nice."], ["Carlos G.", "Great food entertaining interior.  Can't go wrong."], ["Tom J.", "Great gyro and fries.  Only downside is the bread could be a little less moist."], ["James H.", "Huge tasty gyro. Ill be back. Good place to take out."], ["Dave W.", "He turned me down for the lunch special that ends at 2 pm. It was 2:00 on my phone and 2:02 on the wall clock. Bad business decision especially since he knew I was a new customer. Really great food though, so I gave it a good review."], ["Michael H.", "Wow!  I had the Yianni's and it was da bombdiggitty. Also, Greek salad was perfect!  Its a small little restaurant that has some funny quotes all around.  So while enjoying what I thought was great fast greek food, laugh at the sayings or log onto pieceofourpie.com for a smile."], ["Lawrence Z.", "Yanni's gyros and wraps are the BEST!I recommend the TJ's, and the shrimp gyro."], ["Shannon N.", "This tiny little hole-in-the-wall is wonderful if you like gyros.  The atmosphere is definitely a mom-and-pops kind of place.  Full of pictures of Greece, and lots of quotes/sayings posted on the wall.  It has limited, but comfortable seating.The gyros are great.  Portion-wise, they are quite large.  The meat in the gyro is flavourful and the tzaziki sauce was not over garlicked like many other places I have been to.  The pita is not like a flimsy pita that is typical in Greek-American restaurants.  It was slightly thick and slightly sweet.  It was a nice slight addition to the rest of the taste  The only drawback to the gyro is the size of the meat.  Most gyro shops slice their meat into strips, whereas the meat is chopped into small pieces.  We also had an appetizer of melted cheese in pita.  It had feta and mozzarella melted, with a surprising touch of basil.  It was wonderful warm, but when it cooled the mozzarella cooled and hardened.  I suggest eating this as soon as it reaches the table.Overall, the food was pleasant, but portions are huge, and the atmosphere was homey.  Would return again."]], "Krilakis": [["Linell B.", "I work just a few buildings down from Kriliakis and it's my go to \"oh man I'm hungry and forgot to pack a lunch\" spot.Just about every time I go I get the lamb gyro and I've never been disappointed. While I'm not exactly a gyro connoisseur, Krilakis's is the best I've ever had. It's a little messy, but that's part of the fun.I've never had the hamburgers, but my wife and mother have had them and loved them. They take a few extra minutes to come out because they're freshly ground and made as you order then, but I'm assured it's well worth it."], ["Jennie B.", "This is not the most authentic Greek restaurant, but for Mississippi I believe it's the closest I've tasted.The lamb is always fresh, food is cooked to order and they are super friendly. I have had the burger, it's not out of this world but it is good. I usually have the lamb gyro without lettuce and tomatoes. It comes packed with lamb and the Tzatziki is above average, however I think it would help to put it on the side for to-go orders. The warm lamb made the sauce warm and it lost some of its freshness.For the serving size I think the prices are spot on. Their fries are homemade from fresh cut potatoes, I love that!Overall, I definitely recommend this place for a quick friendly taste of Greece in the Ridgeland, MS area they fit the bill.."], ["Andrew C.", "Yooooooo. This place right here, it's that crack! My and the roommate were lookin for a place to enjoy some good eats on a Friday night. He had eaten here before and suggested it. I'm so glad he got me hip to this place. The lamb gyro was on point. Best lamb gyro ya boi has ever had. I'll definitely be back. They've gained a loyal customer."], ["Lauren C.", "Love love love this place!  We've been going here since they opened in Byram. They are in Ridgeland now but we make special trips out there just to get salads. Always super nice people and the food is always awesome. Never had anything I was disappointed in."], ["Paul P.", "Clearly, this is not run by a Greek family, because nothing is made on-house, or authentic.I got the hummus and pita starter, and they both looked, and tasted, like they were from a grocery store. The pita's were really think and had been toasted so that the edges were almost crisp, and the hummus was so thick, and not whipped at all.I also got the gyro and salad combo. The salad had two olives, and had thinly sliced soggy tomatoes. And it was saturated in dressing, rather than just drizzled and then tossed to get a good coating. And the gyro was just not very flavorful. It was about as bland as the hummus, and tasted more like onions than anything else.I travel every week for work, and absolutely love Greek/Mediterranean food, and eat it probably twice/week while I travel. This was a huge disappointment."], ["Jonna B.", "Krilakis is one of the better gyros I've had. The one downfall, and this is strictly personal, is that there is SO MUCH FOOD in such a tiny foil package that it's hard to handle the gyro gracefully. Every bite will leave your face covered in tzatziki sauce. Their pita melt is also a good choice for an appetizer. It's loaded with ooey gooey feta and mozzarella cheese. Really, everything I have had is good. The staff is always friendly and the food always comes quickly. They have a nice outdoor seating section that is shaded (which is a huge deal in this Mississippi heat!) and plenty of space inside as well. If you find yourself this particular area of Ridgeland, definitely give Krilakis a shot."], ["Gary S.", "Best gyro I've ever had! I've never had lamb this tender. I went with a group for a mid-week lunch and everyone was very happy with their meals. I had a small greek salad and an original gyro. The table also shared hummus/pita, fries, and baklava (we were hungry!). Everything was amazing, except the hummus was a bit dry. Service was friendly and although it was busy the food came out quick. They have a nice menu with salads, burgers, appetizers, and a large selection of gyros from traditional lamb to chicken, pork, etc.  Toppings, pita bread, meat was all very fresh, very flavorful. The restaurant is clean with plenty of seating indoors and a small, shaded patio outside.  This has to be the best Greek food I've ever had, and I travel a lot! I can't wait to get back for another lunch... maybe tomorrow."], ["Chris M.", "Pretty decent and served the purpose for a quick stop on the way to New Orleans. The lamb gyro was good if unremarkable. There is a write up of the place that talks about the tzatziki sauce being really good. Umm, ok, not really. Couldn't   taste it on the gyro as it was so mild. It was a decent overall though and seemed to be fresh. The hummus to me did not taste fresh and wasn't very good. I would not order it again. Decent place though for a quick stop.  The staff was very nice and the food came out very fast."], ["Mallory L.", "Always delicious! Usually do takeout and Get the veggie with cheese. But no fries too much carbs with them. The only complaint I have is that sometimes the pita is doughy inside. But something I can look past for the most part. Parking is sometimes difficult especially during lunch time since it's right off Jackson avenue. Great place! Definitely one of my favorites for a quick bite"], ["Phil H.", "I was very pleased with the food and the service.   Great place. Great atmosphere.  Great for kids. We will be back. JC Gyros and Hamburgers."], ["Scott H.", "I usually do not like reviewing places on just one visit. However, since I do not live anywhere near here I am going to go ahead and do one. Basically, I found this place via Yelp and it's really good reviews. I went in and ordered the combo that had a Lamb Gyro and a greek salad. The Greek Salad tasted pretty decent and the Lamb Gyro left quite a bit to be desired. The meat tasted almost unseasoned and the sauce they put on it did not have much flavor like I am accustomed to. Also, I asked that they add Feta cheese to the gyro. They charged me $1.50 to do so and put none on there. That really rubbed me the wrong way. I pointed this out to the girl at the front and she got me a small ramekin of it. It was actually some of the strongest feta I had ever tasted. A little too strong actually. Other complaints I had were the fact that there was only 1 other table that had occupants in the place at 7:15 yet the floor was dirty with food and straw wrappers that were on the floor. There is no excuse for that in a slow restaurant. The unsweet tea was also terrible as it tasted like straight up water. They also charged my AMEX for a drink that I never requested as well. The total came to like $16.00. I left very full, but the food was not that great at all. Had the food been priced at about $10.00 I may have felt a little better about it. Sure my company was paying the tab but I spend company money as if it were my own. Another turn off was the place was crawling slow yet my Gyro came out within 1 minute. It was warm which means that everything is precooked and just sitting under a heat lamp or above boiling water or something. Basically it is definitely NOT prepared fresh. Based on my experience, I am giving it 2 stars which is pretty generous. Apparently many folks think they have awesome burgers. The other table that was occupied were eating burgers and they did look pretty good. My advise is to go with one of those because they have to be better than the gyros. If I come back to town I will definitely not be back."], ["Sam P.", "Whenever I want to grab myself a salad, I always choose this place. The meat is perfectly grilled, and their salads are a #1 pick for any meal!"], ["Steven C.", "My first trip here was great with a fresh greek salad. My second was horrible. I called ahead for a gyro combo and was told it would be ready in 10 mins. I arrived 10 mins later and waited 15 more for my food. Every time the kitchen door opened the \"cooks\" were just sitting around talking and joking. The girl who finally helped me was really rude and short. The actual food was bad. The gyro meat was super soft and soggy. I love gyros but couldn't even finish mine due to the texture. Fries had good taste but were very stale."], ["Andrea S.", "It was okaaaay. My Salad was way overdressed.  Gyro meat was thin and crumbly.  I ate all my food, but wished I went to Keifers the whole time. Servers were not in uniform making it difficult to figure out who worked there."], ["Max P.", "Being that it is only a block from my house, this place is by far the best Greek restaurant in the Jackson area! If you want to be blown away, go ahead and try the Greek Chicken Salad. Also, you can bring your own beer and wine."], ["David O.", "I won't keep this review long. All I have to say is that this is hands down the best Greek food in the Jackson area. It's a small restaurant, good atmosphere, and very reasonably priced. Staff are great too. If you like Greek food and you haven't eaten here, you should plan a visit."], ["Ross H.", "Probably get take out from here at least once a week. I've had at least one of every gyro and they never disappoint. The only problem I've ever had with this restaurant is them forgetting to include tziki sauce in my order. By far the best Greek restaurant in the Jackson Metropolitan area."], ["Brandi S.", "Great place for lunch or a casual dinner. Order at the counter and choose a seat. They have a patio near a fountain that made for a very peaceful lunch. The staff was friendly and the restaurant was clean and nicely decorated. What sold it for me was the food! The gyro and fries were really good!!! Fresh, perfectly seasoned, and large portions for less than $10 with a drink is a steal. I will certainly be back and maybe even take advantage of the BYOB offer"], ["Missy L.", "I disagree wholeheartedly with the other reviews.  My lamb gyro was closer to authentic than I've had in a long time.  The lamb was chipped or shaved rather than cut in strips.  The tzatziki sauce had the tang of greek yogurt with grated (not diced or minced) cucumber."], ["J O.", "The reviews don't lie. This place is my new go to Greek joint. It's also BYOB which is good for the cost conscious. The gyros are great. I prefer the melted feta from Kiefer's but this is much closer to my house. The parking doesn't result in door dings like the poorly laid out lot at Kiefer's. Also, the bum factor is non-existent at Krilakis. The burger is excellent with great bun but will come after your guests who order gyros. I'd prefer all plates to arrive at the same time, otherwise you watch people eat. They have a gyro combo with fries and soft drink which is very reasonable at around $9 before tip. Speaking of fries... They are worth the trip as well. Perfectly cooked and seasoned with sea salt. My wife doesn't care for their veggie gyro with the fries in it though. Overall worth checking out if you haven't and immensely better than Kristo's which is close to the same area."], ["Mike B.", "My son and I stopped in on the way home from Middle of Nowhere Mississippi to wait out rush hour traffic and to stop the pleas of \"Daddy, I'm hungry\" emanating from the back seat.  I'd eaten at Krilakis in the past, when it was located in Byrum, so I was confident that it was as good as I remembered.  While everyone raves about the burgers (and trust me, they are as good as their reputation), I was in the mood for Greek.My son is a huge fan of \"dip\", so I ordered the hummus. And as a cheese lover, I had to order the pita melt.  Pita bread, mozzarella and feta? Perfection.  For the entree, we chose the mixed gyro. Given a choice, K would have had just chicken, because that is his default food selection if pizza is not an option.  The food came out promptly, and the hummus was by far my favorite. It is the perfect consistency, and the seasoning is spot on. Not too salty, with just the right amount of garlicky goodness.  The gyro came with a mound of hand cut fries, which K promptly dunked in hummus.  While it is not your typical culinary combination, it seemed to work well for him. In short order, the hummus was decimated, and there was a huge dent in the aforementioned mound of fries.  The pita melt was hot and cheesy.  My only complaint is that the feta didn't come through quite as much as I'd hoped.  Mozzarella is a wonderful cheese, but very bland in comparison, so I'd hoped the feta would provide a little more bite.  Still, it was good and I would have it again.The gyro was almost an afterthought after making our way through everything else.  But what a pleasant afterthought.  The pitas are soft and delicious, and the tzatzki creamy and delicious.  It's always an added bonus when proportions are done well.  Often, gyros are drowning in sauce and it becomes a bit of a mess.  In this case, there was just enough to get the flavor in each bite of the grilled chicken and lamb laden pita. Overall, it was a great meal, and some of the best Greek food I've had in the South. I'm sure there are better places out there, and I know for a fact there are much worse. Two things kept me from giving Krilakis five stars: the lamb and chicken were a little dry for my taste, and the decor was a little lacking. Barring the menu and a few odds and ends on the wall, I could have been in Anycuisine USA. Perhaps it's just me, but I like to see a bit more character in local establishments"], ["Ben R.", "Delicious gyros and salads, but the burgers are horrible.  I have eaten here several times and plan to come back, but I will stick to the gyros.  While they are delicious, the burgers, which many have praised, are dry, unwieldy, and tasteless.  Possibly one of the worst I have ever had.  Sorry y'all."], ["Nolen G.", "I was told I had to go by Krilakis to try the burger.  Greek place for a burger?  Well, the source of the tip is a highly reliable foodie so I took her advise and rolled in last night and ordered the 2 cheese burger.  Feta...mozzarella and about a 1/2# burger.  I'm in.Burger came after the appropriate time it takes to cook a 1/2 pound, hand formed patty of raw chuck into a 1/2 pound of perfectly cooked ground goodness.The bun.  Oh man, the bun.   Ever had that sweet bun at Mugshots?  Take that bun and make it 3x better.  It is the daddy of sweet buns.  Not too sweet, not too big, just right.  I asked the owner and he said the buns come from a bakery in Texas.  I like Texas.  I like these Texas buns.Cheese was great and not overpowering at all.  Perfect and I highly recommend it.As for the Greek food....truly the best Hummus and Pita in town that I have had (and I have been to most of them)My wife had a Chicken salad and I am sad I did not get a picture.  Large, fresh and the meat was plentiful.Kids got the Pita Melt (awesome) and the Jr. KC..which is a small chicken Gyro without onions.I was hoping we would have leftovers but we mowed it all down.  I did not get the fries but they looked great.This burger is SOLIDLY in the top 5 under $10 burgers in town.  I will have to go back for another, but I will say, you will NOT be disappointed."], ["Jesse M.", "Wasn't impressed. Sorry but the Gyros were OK but I expected more for a 5 star rated place. Went there for lunch and there was not a crowd, only about 3 other tables. Food was fast and service was good but nothing spectacular. The fries were limp and undercooked and the Gyro was runny. I don't know maybe I caught them on an off day. I felt the gyro was rather flat tasting and didn't have anything really good going on. It wasn't bad at all but it wasn't the best either. I may go back but I am going to explore other options first."], ["Lauren D.", "Where to start? I started eating here with my husband that loves gyros. I was never really a fan of gyros, so I always got the burger. Best burger ever. One day I tried my husbands gyro and it was amazing. I can no longer get a burger because the gyro is just a must have! Service is always great. I highly recommend krilakis!"], ["James B.", "My daughter recently started working near here.  I was visiting her and yelped to see the restaurants in the area.  Krilakis came up and thank you yelp.  First, the hummus is very, very good.  Next, the burgers are as described in the other reviews.  Worth the wait and among the best in Metro.  The gyro meat is very good whether on a salad or in a pita.   Friendly staff.  It is BYOB for some reason but don't let that keep you from going.  Go and enjoy."], ["Michael A.", "One of the best burgers I've ever had at any price.  The fries were amazing too.  My daughter and I had the two cheese burger."], ["Scott M.", "Quite possibly the best burger of my life! The patty was probably an inch thick and cooked perfect! Delicious!! The fries were hand cut and awesome! I WILL be back for another Krilakis burger!!"], ["Sarah C.", "The reviews don't lie. Awesome burger. Great salad. Fries were excellent. We are still talking about how much we enjoyed dinner three hours later, which is what prompted this review. Thanks for the great meal."], ["Matt S.", "Krilakis might not look like much from the outside, but the food is outstanding. The gyros, salads and even burgers are great, and service is fast and friendly."], ["John L.", "One of my favorite restaurants in Jackson(okay, Ridgeland, but I'll forgive them). The menu has great choices, but I always get the krilakis gyro. It's superb and unlike other restaurants isn't just a cloan of kiefers. The French fries are great too. AND best of all you can bring your own wine. Only complaint is they use Styrofoam cups and plates for their salads (more of an issue on the salads, but real plates and cups are always much nicer to eat and drink from). It's always clean and the service is usually pretty quick even for a casual restaurant like this."], ["Will B.", "Krilakis is the BOMB! We first discovered this place when it started out in Byram, MS, but we are still loyal Krilakis fans even after the move to Ridgeland. The food is PHENOMENAL. The owner of the place is a super nice guy, proud of his quality business (every right to be proud!). Though Keifer's may have more atmosphere, if you are looking for great Greek food in the Jackson/Ridgeland area, I don't think you can beat Krilakis."], ["Dustin T.", "surprisingly good greek food for Mississippi.  I thoroughly enjoyed the gyro.  Can't say enough good things about it."], ["Matt M.", "Since we have moved here this place has been a regular spot. There food is always fresh and made with wonderful favors!! A must visit"], ["Mrs. M. J.", "Do yourself a favor and GO! BEST Greek place, by far, I've ever been to. SO. GOOD. Fresh, soft pita bread. Rich, flavorful, perfect hummus.  Mozzarella and feta pita? Perfection again. In fact, everything was perfection. My husband got the lamb gyro salad with the most tender lamb he's ever tasted.  I got the mozzarella feta burger and every other burger from now on will pale in comparison.  The bun is huge and soft and sweet, and there's so much real FLAVOR. Please go."]], "Bill's Greek Tavern": [["Merritt L.", "Classic!!if you get take out, Bill gives you almost 3 servings of fish... and that's only the fish.I'm not a fan of the vegetables, but the salad is awesome.\"God Bless America!\""], ["Steve P.", "What a treat...this place has personality; you are met with \"God Bless America!\" and something about speaking Greek.  Gus puts a smile on your face and the team kicks into a high level of efficiency!  Now on to the gastronomical portion of the rating; my #1 question with every restaurant is always, \"what is the absolute best item on your menu?\"  As noted with others--the answer was \"tilapia.\"  So I went with it, to go, I might add.  I was asked if I wanted something to drink so I grabbed a beer, never thinking the food prep would outpace my beer consumption pace.  Think again at Bills!Quick, focused and when I unbundled my bounty at the Hilton I was pleasantly surprised with the volume of fish, as noted by someone else--three servings plus a couple shrimp.  The tilapia was excellent...veggies are good fillers, nothing special, the salad and the \"Comeback\" dressing were great!  I spend lots of time on the road, I very frequently depend on Yelp for guidance...no let down here.  I will be back!Ciao"], ["John D.", "I went there for lunch, it doesn't look I much on the outside but on the inside the food was great.  I had the Tilapia and shrimp dinner, huge proportions with a great taste.The atmosphere was fun and laid back, thumbs up to Bill."]], "Aladdin Mediterranean Grill": [["Rachel P.", "If you're looking for Greek or Mediterranean food in Jackson, your options are sadly kind of limited. Don't be bummed though, because Aladdin is nestled right here in the heart of downtown Fondren and it is one of the best dining experiences you can have in town!Let's start with the atmosphere. Walking up to Aladdin's, you'll walk through the front porch sitting area first. If the weather's nice, absolutely grab a seat here! It's such a pleasant place to sit and there are several tables as well as big comfy seating as well. If you choose to sit inside, you'll have your choice between lots of tables as well as some cushy booths as well. It's a small space, but if you've got a group of friends, they're always willing to push some tables together. I've walked in with groups of eight or nine before and had no issue getting seated pretty quickly. The servers are typically really nice. I've been here dozens of times, and I've had maybe one or two dining experiences in which the service was a little lackluster. That's not to say the server wasn't friendly or attentive though! Like I said, they're all usually super nice and the food gets delivered to the tables really quickly.About the food... Omg. So good. This is authentic Mediterranean cuisine, for sure. I love that it stays true to it's Mediterranean/Greek roots while still being a true Jackson, local spot. You can get a sweet tea with your hummus, and you won't be disappointed by either. The homemade falafels are my favorite thing on the menu. The falafel plate is vegetarian and comes with rice and veggies. It's plenty of food for one person and so good! The homemade hummus is reeeeally good and it comes with most dishes. They'll bring you some fresh, warm bread to go with it. YUM. Other excellent dishes: chicken dolmas (served hot!), beef schwarma, gyro, lamb kebab. Everything is so good! And the menu is huge. I could come here every day for a month and not get bored. The desserts are really great too! Get the tiramisu to split with friends. Or get one all for yourself! Oh, and it is super reasonably priced! You can get a gyro for $5. The falafel plate will run you about $9. The most expensive items are the lamb dishes, but even then, nothing goes above $20. NB: This place does NOT serve alcohol, but they do let you brown bag which is so nice! You can grab a bottle of red wine across the street at Fondren Cellars and enjoy it with your meal with some friends. Talk about a perfect evening!"], ["Jeana S.", "Hands down the best Mediterranean in Jackson! The food is always super fresh and delicious. I really enjoy both the chicken shwarma and the dolmas. Another reviewer mentioned this, but I'd like to reiterate that their dolmas is served hot unlike most places. But now I won't eat it any different way! Most plates comes with rice, hummus, and a side salad. Their meats are always seasoned and cooked perfectly. Now that I've thought about it, I've never had a bad dish here! I also love love love the mint tea! The interior is great for a small or large group, and the service is great! I highly recommend this spot to anyone!"], ["Sebastian B.", "The restaurant feels very authentic. The dolmas were to die for. I've had dolmas before, and they have usually been cold, but these were very fresh and warm. For my meal I got the lamb kebab \"sandwich\". The lettuce was very fresh, and the tomatoes seemed to be just cut. The lamb meat was so tender and juicy. I tried their fresh baklava, and it was the best baklava I've had, still hot from the oven.Overall I loved it! 10/10 would devour again."], ["Ranjit S.", "Didn't taste anything like Mediterranean at all. I ordered the shawarma plate and was left disappointed. The chicken was too dry and the hummus and rice weren't better either. Nice ambience but not very good food!"], ["Jim D.", "The reviews I read led me to believe I was in for a wonderful Mediterranean  meal. The restaurant has a nice ambiance from the front outdoor eating to the colorfully decorated interior. We were seated immediately and the friendly helpful staff provided attention throughout the meal. I ordered the chicken shawarma with Greek salad and extra humus. The plates arrived timely and were very colorful with a small bowl made of humus containing olive oil.  The humus was tasty. The Greek salad contained cucumbers, tomatoes, and black olives with a smidgen of tasteless feta and a store bought Italian dressing. Warm pita was provided with the meal. I don't know why but they were cut into strips. I prefer the whole so I can separate the sides and fill it like a pocket. All of this could still make a decent chicken shawarma but the biggest disappointment was the chicken. This was not the stacked, marinated, slow grilled meat you would anticipate but rather pan fried, dry over cooked chopped chicken with a light spice on the outside. I think there is a lot going for this restaurant, I hope they work on their shawarma recipe."], ["Kita H.", "In a strange turn of events, two folks from Dallas hoping for some good ole fashioned Mississippi-style food ended up having Mediterranean food for dinner :P Yes, we made the fatal mistake of visiting on a Sunday night and apparently, hardly anything is open in Jackson, MS on a Sunday night (being more of your traditional, family-like town). However, this place was open late (until 10 or 11p) and boy, am I glad it was.The location is convenient to access right there on the main strip of the city, adjacent to the government buildings a few blocks down. The decor has your typical, Mediterranean style feel which is always fun, if not in some kitschy way. We were seated quickly although the booth was a bit small for my very pregnant self ;) What really matters, the food, knocked my socks off. I enjoyed a pretty standard dish of lamb gyro meat with rice, Greek-style salad, and hummus + pita bread. Absolutely ate everything- to the last drop. I did request the yogurt sauce (Tzatziki) to dress the meat simply because I personally love it but honestly the meat was moist enough not to really ~need~ it. Hubs loved his food too- he enjoyed lamb kabobs.Oh yeah, don't forget the baklava!"], ["Tina L.", "Mediterranean in Mississippi? Expect the unexpected, it's great, love the sautéed vegetables, the hummus with wheat its, the red lentil soup, the help, the prices, all good, don't miss it!"], ["Angie S.", "We've never really had Mediterranean food and we were definitely not dissapointed. We had the fried cheese appetizer per waitress recommdation and it was AWESOME. Salty, but it comes with fresh veggies that even it out perfectly. We also shared the big combo and it was fabulous, came with pork, shrimp lamb and chicken. Then a huge box of pita bread and hummus which was delicious. Our adorable waitress was the nicest person ever and gave us so many tips and answered every question. This is one of our new favorites and we will definitely be back. So so good."], ["Cody M.", "I just ate here a few months ago. This is one of the best, local, authentic restaurants in Jackson. The hummus is made to perfection, and the meat is cooked consistently well. You will not be disappointed by the more authentic cuisine Aladdin offers."], ["Richard L.", "I've come here several times during and after work at the hospital, and have yet to have an experience other than service that is kind, and food that is consistently well made. I don't know how they do it but it's extreme in it's consistency. I'll be coming here many more times. It's great for groups and more private affairs as they have open tables and booths."], ["Ann M.", "Want authentic cuisine? You'll find it here! I've never been disappointed with an experience at this eclectic little Mediterranean restaurant. The felafel and homemade hummus are unbeatable. Also, they make a killer beef schwarma. Definitely a unique experience in the Jackson area."], ["Michael D.", "This is quite the spot! I love feeling transported to another area while dining, the ambiance is as great as the food! We had a great server, Katie, she was hilarious! Which makes dining all that better! You can never go wrong with pita and hummus!"], ["Nicole M.", "Driving to Georgia from Texas and decided to stop here. It's a little off the beaten path but worth searching for. The fried kibbies were delicious. The hummus was flavorful. Everything tastes fresh. Prices were very reasonable for how much we got. Wasn't too much food at all. Perfect amount with the rice side salad and pita bread it came with. Service was friendly and accommodating of Penny (my dog). We sat on the patio since we couldn't take her in the restaurant. During our meal they also made sure penny had reasonable se"], ["Brian K.", "The service was great, very accommodating and friendly. But, the food was simply average and even poor. The lamb was dry and tough, but the Falafel was simply ok. I wouldn't go our of your way to eat here, but as a passing through it did provide better options than the standard highway fare."], ["Phoebe T.", "After reading the reviews about this restaurant, we decided to give it a try. We were traveling through, coming from a weekend in Birmingham Alabama, and headed back to Louisiana. The restaurant was located off of interstate 55. We were traveling on interstate 20, but the detour to this restaurant only took a few minutes. The restaurant's waitress was very helpful. We asked for a suggestion, and she gave it. I had the lamb chops and my husband had a combination plate. The food was delicious. The hummus with the best I've ever tasted.  We will definitely be stopping by again when traveling through."], ["Denise C.", "Customer service is exceptional,  greeted with warmth and friendly staff.  The food is wonderful, lamb chops cooked to perfection and the hummus is to die for!  This is my second time dining here, would.eat here more  often if it was not so far from my house, but well worth the drive!!  Would recommend this restaurant to everyone in the Jackson area.  A must eat if you love Mediterranean food and a must try if you have never tried it, I guarantee you will not be disappointed!"], ["Anna W.", "Every dish I've gotten at Aladdin has been delicious and fresh!  Their chicken schwarma is always a top pick for me- it is very flavorful.  Also, you can brown bag here and pair some merlot with your food!"], ["Dale G.", "The location of this restaurant is definitely not ideal, but once you get past that I think you'll be in for a pleasant surprise. The food was tasty, especially the hummus and tabouli. Our waiter was truly professional and attentive."], ["Scott R.", "I love this place! I've had better gyro's but the service, freshness, cleanliness aspects of this place are all outstanding. The more exotic Greek dishes are amazing. The gyros and falafel are good too but not the best in town IMO. I like walking in and ordering to go and sitting on the little couch watching the kitchen make the food. This guy runs out of a VERY small kitchen and everything is clean, efficient and the kitchen crew works like a well- oiled machine. That goes a LONG way with me."], ["Cherry D.", "came on a busy friday night. had high hopes for this mom and pop place, but left disappointed. i liked the flavors of my beef shawarma plate. but the hummus tasted sour, and the salad didn't have the typical kalamata olives, feta cheese, and quality olive oil that i'm used to eating. ordered an appetizer with hummus, baba ghanouj, grape leaves, and tabouli. the pita bread tasted like something from the grocery store. my friends ordered the kabab combo, and the shrimp plate. they weren't impressed with their food either. thought the meat was dry, and the shrimp was overcooked. overall bill was reasonable, at $66 for three entrees, one appetizer, and three sweet teas. we did not finish our food and did not even want to bring our leftover food home. i'm glad i tried this place out, but not planning on going back."], ["amc a.", "Lambchops were nicely done, but very small.  Chicken moist and seasoned well.  The one thing that sticks out most are the dolmades....I have never had these warm. Very odd. For lunch the two combination meals were pricey - over $35. Service was very attentive, but we were also eating at a late lunch."], ["Orlean S.", "If all you want is a gyro, then you might try Keifers or Krilakis, but for a complete Greek/Lebanese meal you must try Aladdin Mediterranean Grill on Lakeland. Since Petra is closed, Aladdin is busier than before. For an appetizer I can recommend the fried Kibby or Spinach Pie. The Kibby has a hard outer shell and filled with ground beef. The Spinach Pie has a soft, fried exterior and filled with spinach and goat cheese. Both come with a dipping sauce, but the thick Lebna sauce (yogurt sauce similar to Tzatziki) for the Spinach Pie is outstanding. You might as well order 2 Spinach Pie's because they are to die for. I would not recommend the Dolmas (stuffed grape leaves) as they are too small - the size of cigarillos.For the meal, I've tried the Lamb Kabob Plate, Combination Plate, and roasted leg of lamb. But I think the Gyro Plate tastes better, contains more food, and even is cheaper than the others. The plate is filled with meat, rice, salad and hummus. Pay the extra to upgrade to a Greek salad (with feta and olives) or Tabouli. Nothing has an overpowering taste - the rice, salad and hummus are all mild and delicious. Strangely the Gyro Plate comes with no yogurt sauce, which is a necessity in my book. But ordering extra Lebna was quickly fulfilled - just make sure they don't bring you an entire Lebna appetizer.The tea has a hint of mint which is nice. Make sure to end your meal with a couple of pieces of Baklava."], ["Mallory L.", "We used to go here or get take-out all the time. We do not much anymore probably since we moved further out to madison. The greek salad is my favorite with chicken schwarma. the dressing is a must and get it containers of it to go as well. Fresh food and delicious. 10-15 minutes on to-go orders and friendly staff. I will probably go here next time I'm back in the area. Really tangy flavors on the salad."], ["Chaitanya K.", "When in the Jackson metro area, I go to Aladdins whenever I crave Mediterranean food. It is definitely not the best I have had but does the job. The falafels are tiny but delicious. The chicken shawarma is more like grilled chicken chunks than authentic shawarma but does ok on the taste. Service is quick, friendly and attentive."], ["Chad M.", "Kabob combo was simple and extremely flavorful.  No generic seasoning here.  Careful attention to each meat's accents was given - the lamb was great, the beef was amazing, the chicken was zesty and subtle at the same time.  Spice didn't overpower - flavor won here. The hummus that comes standard with the entree was fantastic.  These people know what they're doing when they craft these dishes - they're thinking of the customers tastebuds!Finished it with the baklava. Loved that it wasn't the size of a small couch...it was an apropos portion to finish a great experience. My server was personal, friendly, prompt, and seemed like she'd love to take care of everyone.  Stay simple on your visit - you won't be disappointed."], ["Stephen S.", "My wife and I have ate here 20-30x in the past two years and we live one hundred miles away.  Best Middle Eastern food by far in the state.  Best kibbeh in the South.  Service is impeccable and friendly and the mint flavored tea is a nice touch."], ["Aisha C.", "This was the only menu we looked at that a vegetarian section - they had us at that alone. We shared the falafel plate and the vegetarian dolmas plate - so delicious! I absolutely loved these dolmas - great flavor and they didnt fall apart like most do. The wheat pita was soft and warm - i could eat it everyday. We also tried the baba ganouj which was great - slightly mashed with perfectly balanced flavors. The prices are decent - especially for the quality of good. The service was also good. If ever traveling thru Jackson again we will certainly stop at Aladdins for a bite. They also had a nice porch for dining, but it was too cold this time of year for that..."], ["Kerry W.", "I have been here a few times. The atmosphere is casual/relaxed Greek Mediterranean style. There is a patio for outside dining which was tempting. Today I had to order lunch and dinner. Night time internet classes will keep me glued to every word of the instructor and I could not possibly tear myself away for a meal. (Sarcasm) So lunch is Hummas with Lamb plate $10.69. The lamb has a mysterious flavor but I do get I believe to be a smoked paprika taste, it was a little spicy but even though I have a mild tolerance could handle it. The basmati rice was light and fluffy and lightly seasoned or flavored with saffron. If I was to criticize anything it would be two things on the lunch plate: the lamb was not drained of grease before it was placed on the hummas so it leached into the rice the second item I would criticize was that I was not asked what dressing for my salad and it arrived with one I will not eat.  Finally dinner is the house special Big Combo (4 shrimp, 2 lamb chops, and chicken kabob chunks. I asked to substitute the basmati rice for the Hummas because it is so good. Under full disclosure, I tried the food before it got cold. Reheating any meat especially shrimp and lamb is very bad and the worst way to reheat will have to happen in the hotel room tonight, forgive me other foodie guru critics!  I will be forced to use the microwave. The shrimp have a good fire grilled flavor. The shrimp size is u 40-60. I love lamb and could not wait for dinner to taste, I know that lamb has the best flavor at a medium for cooking. I ordered medium and it was well done, it was way over cooked. The flavors were great, but the experience could have been better.  The waiter was very nice and attentive but did not come back to ask about the salad dressing. It is 2:00 pm so it was at a slow time."], ["Mark A.", "One of the best Middle Eastern Restaurants ever. We came here from Dallas. They have hosted us very successfully. The waiters and the manager are awesome. They actually serve halal food. They have halal certification and they have no problem showing it in case of asked."], ["Edward D.", "I went out with siblings to shake things up from the normal eating habits (fast food, and Southern home cooked meals...) and our taste buds were entertained well.  Our favorite was the hummus (which came with all our entrees). The place as a whole was in need of repair. The seat cushions in the booths were tattered. The walls were \"Holy\" ( and not with Jesus' Blessing). we highly recommend this restaurant for friends who want a unique experience. The menu is extremely affordable, and the portion size is abundant. The service is attentive."], ["Nick G.", "Fresh, flavorful. Excellent falafel, salad and soup. Perfect stop when driving through on I-55 since it is about two minutes off the highway."], ["Divya G.", "Excellent food! And fantastic service. We stumbled upon this place and we were more than satisfied. Definitely try the Greek tiramisu and the Burma, it's to die for!! I was surprised by the authenticity and the variety of dishes offered here. Most definitely willing to recommend this place and come back here."], ["Mazen B.", "Parking was a challenge but that is the only complaint I have about this place. Food was amazing. Had the meat Shawarma and Chicken Shawarma. Both were very tender and juicy. Just the right amount of seasoning and the taste was yummmmm. Looking forward to going there once again."], ["Melissa M.", "We picked up dinner to go here when family was in town.  We shared two dishes - the Alladin special appetizer for 2 that included hummus, baba ganoush, Lebna, falafel, tabouleh, veggie grape leaves, kibby, and hummus.  For the price, we felt the portions were small - the 3 dips were in the small portion of a 3 section take out container.  There were 2 kibby, 3 falafel, and 3 grape leaves.  The tabouleh, Lebna, and hummus were all very good.  The fried foods were small and somewhat dry.  We also split a combination plate - chicken and gyro meat, more hummus, and a salad.  They included 5 or 6 pitas.  We ended up making gyros with the meat, salad, hummus, and Lebna that were pretty good.  Everything was somewhat dry - even the pitas and meat.  Maybe if we had eaten it there it would be different.  On a side note, they have a new small grocery next door with some interesting options like bulk dates, dried chickpeas, sheep milk feta, and other things not readily available."], ["Bilal Q.", "The food was absolutely superb. I cannot recommend their food enough especially the chicken kabab platter. Everything was perfectly cooked and seasoned just right.Their food actually surpasses many Middle Eastern restaurants in Astoria, NY.  The staff was remarkably attentive and helpful, I highly recommend Aladdin to anyone looking for a great meal."], ["layne l.", "Falafel is delicious!"], ["Chris M.", "Pretty good Mediterranean food. It is actually better than Kiefers. It's a more authentic and advanced menu. We stop here most times when we drive through Jackson. Would really give it 3.5 stars."], ["Jennifer W.", "I actually liked this place a lot when I was visiting Jackson for work and so I ate here twice! I'm not sure if this is the exact location I went to, but I know they are all owned by the same people and so I'm hoping the food is the same across all of them. Here are the things I tried and my feedback:- Hummus - Very good hummus, doesn't have a strong flavor by itself so it easily pairs with anything else. I got their wheat pita bread and it was fresh and very very good.- Qudsia - Chicken and fava beans on top of hummus, makes the hummus a little more tangible as an appetizer. Had this the second time!- Meat dolmas - These were alright, I wasn't very impressed. I have liked dolmas before when they were seasoned really well but it was bland meat inside bland grape leaves with no flavor to them. Meh.- Spinach pie - VERY yummy. I really liked the filling in this and the pastry was light and really good.- Falafel - AMAZING!! You have to get the falafel here, even if you haven't tried them before. Very flavorful, not greasy, just yummy yummy yummy.- Hummus with lamb - Lamb was very good and tender, came with a small cucumber salad which was pretty good.I added this spicy sauce you can ask for on the side to a lot of what I tried here because their biggest weakness was underseasoning on some dishes that had the potential to be phenomenal. They also didn't have eggplant for baba ganuj which was disappointing. Hoping when I go back they'll pick it up and I can give 5 stars!"], ["Dabney R.", "Initially wrote this place a moderately good review about 4 years ago on another dining app, but unfortunately made the mistake of saying Keifer's was better \"for real Greek food like gyros and hummus.\" I am back now to redeem myself and clarify my initial misgivings. I believe what I meant is that Keifer's has better Greek food (while \"real\" was not the best word choice as it is definitely Americanized) while this place has better Persian/Turkish, etc. While I still believe Keifer's hummus, gyros, tzatziki and feta dressing slightly edge Aladdin out, the food here has grown on me more and more through the years. They also have good gyros and hummus, but what truly makes the menu is the lamb. Doesn't matter whether you order it in kebab, wrap, chop, or plate form, it's delicious. I usually get the Hummus with Lamb and make sure to ask for labna or tzatziki to go with it (it doesn't come with any yogurt sauce, which I've always thought was strange.) For starters, definitely get the spinach pie and baba ganouj, both are phenomenal. The mint tea is a nice touch and the baklava for desert is better than Keifer's. Overall wonderful Mediterranean food, especially for Jackson, which doesn't always do the best by ethnic food."], ["Justin W.", "Try this place out, you'll definitely enjoy it!  I met up with some friends there for dinner one night.  A couple southerners and a couple foreigners, and everybody liked it a lot.  I would gladly go back if I'm ever in town again.  It was not busy at all when I went on a Friday night a few days before Christmas."], ["Danna R.", "Best falafel ever!  Nice atmosphere.  Another server would have been helpful, our server was great but very busy.  Everything was very tasty."], ["Roger L.", "Probably the best restaurant in Jackson in terms of food, service, location, atmosphere and value. Literally everything on the menu is delicious and made in house. Can't say enough good things about this place, including the fact that it it BYOB."], ["Eric G.", "I took my mom here to break her out of the habit of going to the same restaurants all the time. She is not very adventurous on her own. I was a bit skeptical if Jackson had any good Mediterranean but I was quite pleasantly surprised! We started with the Aladdin Special, a  sampler platter with hummus, baba ganuj, Lebna, grape leaves, tabouli, falafel and kibby.The hummus was well seasoned, although not a smooth as I would have preferred. The Baba Ganuj was not bad but not memorable either. The Lebna was very good. The grape leaves were a little over cooked but not bad. The kibby was also very good. It was my first time trying it so I don't know what it was supposed to taste like but I liked it. The star of the sampler platter, though, were the falafel! Those were some of the best I have had. Very well seasoned, cooked perfectly.For main courses, my mom had the Lamb Chops and they were perfectly cooked and seasoned! I had the chicken shawarma with a side of hot sauce (can't remember what it was called) but it was VERY spicy and the flavor went well with the chicken. Although the chicken was seasoned well, it was a bit overcooked and somewhat dry.To end it, we tried one of the \"blendies\" drinks made with strawberry on top and avocado?!?! on the bottom.  It was surprisingly tasty but I would have liked it to be a bit colder as the strawberry section was colder than the avocado. Once I mixed them together, the temperature was more to my preference and I enjoyed it. Overall, a great first experience with Greek food in Jackson. I will definitely be back!"], ["Denise H.", "Very good service.  Menu had a ton of options- very nice.  I had the vegetarian plate.  Falafel was cooked to perfection. Hummus was great too.  Was in town for work glad I found a healthy lunch.  Would come back for sure."], ["Christopher L.", "In Jackson for a couple of days on business, I found Aladdin Mediterranean on yelp and decided to give it a try. I eat mediterranean food often in Atlanta, where we have Israeli, Lebanese, and Palestinian varieties to choose from.  Aladdin presents a large menu with many nice touches such as haloumi (they call it \"fried cheese\") and mint-infused tea. I ordered the vegetarian plate (hummus, baba ganouj, and tabouleh).  My companion had chicken kabobs.  All the food was fresh and delicious, and was served promptly. The haloumi was sliced a bit thicker than is customary and did not have the traditional slight crustiness on the outside, but it was still delightfully \"squeaky\" and came with a nice garnish of tomato and cucumber slices.The reason for no fifth star is that the restaurant is \"bring your own bottle\" but this fact is not advertised on their website. It would not have deterred us from going if we had known, but was nonetheless disappointing when we arrived to not be able to have a beer or some wine. The second reason is that the waiter didn't seem to be too familiar with the menu - he would have been of no help to someone who was not already familiar with middle eastern food.  However, if you're looking for solid mediterranean fare in Jackson, you will be happy with Aladdin!"], ["Kashif A.", "Lamb chops! Enough said!"], ["L. H.", "Went back again for another amazing meal!  I got the chicken schwarma (spelling?) with some grilled veggies and baklava. THE BEST!  Everything was cooked perfectly and tasted wonderfully. I've been to a lot of Mediterranean restaurants all over the country and this is hands down my favorite."], ["Jen L.", "I didn't expect to find much authentic Middle Eastern food in Jackson. Not only was it authentic, but my half Lebanese husband claimed \"they have the best Baba Ganoush he's had in the states. And that's including living off of the best Lebanese restaurants in the LA and NYC area. This is a great place with a wonderful staff. It's not too expensive (unless you eat there every day like we've been doing)!"], ["Sydney M.", "Delicious! Can't find dolmas as good as these anywhere! Unless, of course, you visit the Mediterranean.  Don't know, never been.  The hummus, baba ganouj, tabouli, falafel, and pita, ALL superb.  I always get the Aladdin's Sampler Appetizer as a meal for myself because I'm a huge fan of vegetarian mediterranean dishes.  I've had the Chicken Schwarma (maybe?) and it was good, too. I was just wishing that I could have had some dolmas, as well. The restaurant (last time I went there) is BYOB. And they even had a grocery in the back that you could look through and shop.  I doubt anything I buy and then try to cook would taste half as wonderful as the talented chef's food at Aladdin's."], ["Jennifer L.", "The atmosphere and the service was very good.  Our waiter was extremely helpful and recommended several good entrees. I chose the lamb kebab plate and my friend chose the beef shawarma plate.   It was a good sized portion and the waiter brought us a mix of wheat and white pita bread.  My only regret was that I wish I asked them to cook the lamb medium rare, as the lamb was fairly dry. Everything else's was fantastic though, and I look forward to my next visit,"], ["Brandy P.", "One of my absolute favorite places to eat when I visit my family and friends in Jackson."], ["Jane M.", "Best hummus I have ever had-- maybe best Mediterranean food all around.  Had the gyro sandwich and a side plate of the veggie stuffed grape leaves.  Everything was so fresh, tender and delicious.  Would make it a point to stop in Jackson again just to eat here."], ["Brett S.", "Inexpensive and tasty. We had the beef shwarmma and the Chicken also. The beef was a bit chewy. The tabouli was  was  good and the Greek salad also hit the spot. I think the best was the mint ice tea.The service was fair and the place was clean and nicely decorated."], ["Jane R.", "A favorite option for a dinner out for me... I'm both vegetarian and wheat free, so I'm thankful for the great selection of decent restaurants in Jackson that I can eat at--and this is one of them. My favorite dish is the sauteed vegetable plate (on saffron rice topped with feta). And the fried cheese appetizer is AMAZING...addictive! I love that you can BYOB for no cork fee... have a nice dinner with wine (there's a liquor store literally next door) on the cheap! My only complaint is that once, I ordered that same vegetable dish I always order and it came without the cheese (my favorite part). I asked about it and was told they were out. I was annoyed, because the dish was really bland without it, and they hadn't even told me. I think they took off 50 cents? Gee, thanks. And the staff were clearly talking about me and all staring in my direction and it was just awkward. But next time I came in the same waitress joked with me, \"We have the cheese!\" so whatever... I let it go. :)Just be sure to ask if all ingredients listed will in fact be included in your meal!"], ["Hannah R.", "Coming from the Baton Rouge area where there is a large variety of excellent Middle Easter/ Lebanese restaurants to choose from, this place is nothing to write home about. I had the chicken shwarma and though the dish wasn't bad, I guess I had higher expectations. I'm used to shwarma and gyro meat coming off a skewer, not diced up chunks of meat. The pita wasn't fresh and the rice was pretty plain. I love hummus and theirs is nothing special, though not bad.  The restaurant itself is quaint and in a good location and I found the staff to be pretty pleasant, so no complaints there."], ["Kate W.", "Everything is wonderful here! Fresh ingredients, great service, and it's byob! The atmosphere is really nice and cozy. Get the hummus! They let you pick your pita bread - wheat or white or both!"], ["Sara W.", "I Love Mediterranean food, and was so excited about going to Aladdins with my husband. The server was good,but the food was disgusting!! My husbands beef Shwarma tasted life old horse meat(when I said that to him he said horse meat would have tasted better) the hummus was gross, the salad dressing just tasted like olive oil and that's it. The rice that came with my food tasted days old and I ordered falafel and those you could tell came frozen in a bag that they just heated up...all in all DO NOT EAT HERE!!  The food is not fresh and its like they never use any kind of seasonings!"], ["Dave W.", "Really a great restaurant. The gyro wrap is my favorite. The sweet tea has a mint flavor added to it. It's great."], ["Marissa A.", "I absolutely loved this place!! The restaurant was beautifully decorated with such a laid back and cool atmosphere. It was byob so we bought a bottle of wine from the liquor store conveniently placed next door! The food was awesome I got the gyro plate and the meat was tender and juicy my sister got the falafel plate and that was also a hit as well! The hummus was great and service was prompt and friendly! I recommend this place to any one!"], ["Darin W.", "Reasonably good food, their gyros are a bit oily though. Would probably go back again"], ["Stephanie B.", "This place has great food! I have yet to have anything I didn't like. When I come to Jackson for business, I make sure to stop here at least a couple of times! My favorite thing to get is the vegetable dolmas plate. The hummus here is the best I have ever had! It's good to-go too."], ["Jennifer T.", "Aladdin Mediterranean is my favorite Jackson restaurant. I love it! It is consistently good. I usually get Musabaha for an appetizer. It's hummus with whole chickpeas stirred in with their olive oil relish on top. I have literally cleaned out a plate of hummus with their fresh pita bread. They offer either wheat or white pita. I get the white, the texture is better to me, but for die hard wheat fans, the wheat is good. I have had their lentil soup, and most of the time, I've had it, it's been good, flavorful, and comforting. I get the combination plate of chicken kabob, schwarma, and gyro meat. I love the gyro meat, it's soft and spicy a grilled so nicely, and you can eat it with the hummus that comes with your meal. The chicken and beef are marinated in something amazing and grilled. Usually my chicken is juicy and tender and my beef is falvorful. The hummus is very creamy and I wish I could figure out how to get the creamy consistency of Aladdin's hummus at home. The meal comes with a salad with a homemade italian dressing. I usually get an extra side of dressing to dip my meat it, because it is fantastic! I think I could literally drink a cup of their dressing. It's that good.  I haven't eaten the salads there, but I've seen them, and they look beautiful. I have had the gyro and it's delicious. I have also had the falafel and while I like it very much, Keifer's wins on the falafel, hands down. I usually have great service when I go to Aladdin's. If I could I would eat Aladdin's weekly, that's how much I enjoy it. Portion sizes are reasonable and so is the price of the food. You can also go next door and buy a bottle of wine and bring it in to drink. Fabulous... Again... my favorite place to eat in the city. Truly."], ["Maggie W.", "While I like Greek food, I'm not a huge connoisseur.  I did love their gyro more than any I've ever tried."], ["Alli B.", "Good Mediterranean.  Everything was good that my group of 8 ordered.  Recommend to others!"]], "Domino's Pizza": [["Meaghan C.", "Best pizza delivery service EVER. Always great quality and the delivery men/women are always so polite. We are regulars with Dominos and know most of the staff by now and they always have a conversation with us when they deliver to us!"], ["Aimee S.", "Every since Dominos changed their crust up a bit, they have been our favorite!  Not only do their pizzas taste superb, they are so reasonably priced. With a blended family with fours boys, plus a motley crew of friends that are always over we don't mind the splurge! :-) If we over order, like we sometime do, we are able to keep the pizza for late night snacks or fast breakfasts. If the kids aren't with us, sometime we freeze it does great a week or so later after being warmed in the toaster! Always yummy!  As a marketer and a BIG FAN of Gorilla Marketing, another thing we enjoy about Dominos is watching their themed \"assembly line\" on their website. That way I can tell the kids exactly when the pizza is on it's way! :) And the process distracts them from asking me! AimeeMarketing Guru from Brandon, Mississippi"]], "O'Charley's Restaurant & Bar": [["Ashley W.", "I love their spicy cheddar jack wedges. And their salads are more than delightful. Awesome for lunch or dinner. Free pie on Wednesdays!! Can't beat that."], ["Tiffaby H.", "This restaurant is quickly going down the gutter! What was once one of my favs is now disgusting and smelly and just bad overall. The only saving grace is the alcohol menu which you will definitely order from because the food is so bad now that you will need the alcohol to kill the taste I only give it a one from my love of a past time wen Prime Rib and O'Charlies were two of my favorite things"], ["Michael A.", "Nothing special.  Good food at a reasonable price. If your looking for someplace clean that has decent food with a good selection this place is good.  Would come back again if in the area.  Wednesday they have free pie."], ["Marcie O.", "Don't come in at 2 p.m. with a party of 5! We waited over 20 minutes to be seated while 3 parties of 2 were quickly shown to tables. The manager had a nonchalant attitude, and we left after noticing an entirely open section."], ["Arkansas G.", "Don't like to wait to be seated, so I order out there for lunch.Good food, decent prices.Love the rolls!!!"], ["Coral E.", "Working in the downtown Jackson area for the past 7 years, O'Charleys was a very regular haunt for lunch with our group, until the service and food started to go down a few years ago.  We gave it a couple of tries with the slow service, frazzled waiters and not-so-great food and finally stopped going.  Well, yesterday my co-worker and I decided to see if things had changed and had a really great experience.  We were quickly seated when we arrived, received great service, food was back up to par and the atmosphere was nice and the restaurant clean.  If you're like me and have put O'Charley's on the back burner in the recent years - give them another try!"], ["Cristian S.", "Good place. Busy but they moved fast. Huge Margarita for $3 at happy hour. Food was fresh and very good. Had the salmon. Service (Christy) was excellent. Will come back."], ["Elena H.", "Great service. Good food. $4  draft beer during happy hour. Super friendly atmosphere. The hot rolls are yummy!"], ["Maria W.", "Yummy, I love those rolls. I could sit here and just eat nothing but their rolls. VERY CLEAN AND NICE FRIENDLY STAFF."], ["Nikki H.", "Great food and great service!  Our glasses were always filled and the manager even walked over and asked how the food was. It's not cheap but not expensive either. Try the Better Cheddar Bacon Burger! It's delicious!"], ["Shannon N.", "Just flew into town and wanted a quick bite that's not from a diner. I should have stuck with the diner.It was mostly clean, with an exception of a pack of Newort cigarettes in the lobby area, and large crumbs and crumpled napkins under a few tables.  Decor is, of course, chain-like.The food was decent, as one would expect from any O'Charleys. The service was horrific though. Our server did not come to our table for 15 minutes to take our drink order. We quietly informed him we had a birthday boy in our party, asked if he can bring a slice of cake at the end of our meal. He just nodded.  Our food took an exceptionally long time, my plate had a dried puddle of red goo, and it took another 20 before we could see the manager.  Manager did not apologize for the dirty plate, kept insisting it was dried pico de gallo sauce that had dried under the heating lamp. Umm, no. Pico de gallo is not a sauce, and if the \"sauce\" did dry under the heat lamp then my fish should not have been room temperature. Thanks for giving my husband for the smaller portion of the fish when he asked for the larger portion, and charging us for the larger one. Thanks a lot for charging us a soup that we did not order. And thanks for not bringing our 6 year old boy his cake that we had asked for when we had ordered our meal. I believe we shall heading to the nearby Waffle House the next time we come back."], ["Janie S.", "The service is extremely slow but is consistent with the general area. Waitress was nice once she finally came around. I took a very long time for the food to come out. Fish was hot but sides were cold."], ["Chan M.", "The food is great. This location saved my hope for all OCharleys. I have ordered take out and dined in. The wait staff is friendly, funny, and very knowledgeable. The pasta dishes or good , but I love their chipotle BBQ chicken strips. A great brunch, lunch, or dinner option in Pearl."], ["Kevin L.", "I ate at O'Charley's twice while on business in Jackson, MS. Great service at the bar! My food arrived promptly (Cajun sirloin done medium with sweet potato fries and broccoli one night and a bacon cheeseburger the other) and was cooked exactly how I ordered it. Despite what yelp says, this restaurant does have a full bar with liquor.The bar was dead both nights I was there but they were weeknights. YMMV on the weekends."], ["Kelly H.", "In a word, reliable, This is overall perhaps the most consistent chain out there - and I think that's a good thing, I lived about a half mile from one back in my Richmond days - and I can walk into this one and feel like I never missed a beat. Best menu items are the cedar plank salmon and the O'charley's Grillers (their version of sliders). Also of note - this location is convenient to a number of business class hotels and makes for a good, quick dinner. One more thing: This location is in a semi-dry county. The do serve beer but no wine or full bar."], ["Ryno H.", "This review is for awhile back,  My sister and I stopped here for drinks and a quick bite ,while waiting for a cousin to arrived at the airport. It wasn't that packed so we were seated. We order drinks and was looking thru the menu. Our drinks arrived and so was the hot bread. I started eating one and my sister picked one up and noticed that there was something like a brown onion baked into the bread. She took a closer look and it was a COCKROACH glazed and baked into the bread roll. We didn't make scene nor went crazy, just disgusted , we flagged down the waitress and showed it to her. She looked horrified and grab the whole basket and took off without any words or explanation.  After about 10 mins, a manager came out and too explain , stating that that have never happened before and swears that this was the first ever time. He than says our drinks is on the house and that was it. Well we was NOT looking or wanting anything to be comp to us, especially after the roach was in the bread, which means there is more than one roach. As we all know, there isn't just ONE roach, they come in packs and kitchen have to be very nasty in order for any kind of critters to be around hanging out.  The manager just walked off and left us  at our table, of course we ran outta there. Like I said, we don't want any comps or free food, but could of got a better explanation. My sis might still have a pic of it."], ["Lolethia U.", "Ok the service was great...no complaints about that.   But the huge cockroach on the wall beside me was a major turnoff.  Granted it wasn't a German cockroach...but a \"water bug\" as we call them here in NC, but it still kind of ruined the whole going out for dinner experience.  But after driving 45 minutes to get there and waiting the obligatory 20 minutes for a table we weren't going anywhere else.  Oh well at least the server killed the \"offending dinner guest\", for us  :)"], ["Clay C.", "This O'Charley's is a regular stop for my wife and I.  Their homemade rolls are excellent when they are hot out of the oven.  Their salads are very good too.  I recommend the grilled tilapia, prime rib, and chicken strips.  The food at this restaurant has always been very good.  The service though can vary from great to not so great depending on the server."], ["Chad L.", "Same as the rest of them.  Nothing wonderful about the place but the food is pretty consistant.  The cheese wedges are one of my favorits and my wife loves their salads, chicken tenders, and potato soup."], ["Kristin B.", "National chain...It's ok. A little pricier than most of its ilk but not by much. The potato soup is delicious but not terribly healthy (it never is) and the buttered rolls are hot and good."], ["Ted M.", "Really, for the price this steak was just plain sick. Reminded me of the delicate texture of a worn tire. Wish I would have looked a little harder and found a better bang of my buck."]], "Newk's": [["Ruhi R.", "Pretty good Newks location. I frequent this location often. Always fast service and nice servers. Even when they have gotten my order wrong they have been receptive and quick to fix any mistake.Newks food is more about convenience and quickness. I do love the sandwiches, which are always warm and toasty. The salads are usually too drenched with dressing so I ask for it on the side. All in all, not a bad place to eat for a quick, filling, and cheaper lunch. I've been coming here for years and will keep coming."], ["Leon S.", "No pizza dough on a Sunday night? Seriously ? I think the doctor needs to overhaul this place"], ["Yaya N.", "Service was fast and efficient... Tried the spicy scilician... Pretty good... Could def do without the capers... Good overall.."], ["Allison M.", "Everytime I go here the food is great and I honestly regret eating Subway today at all. The staff is usually very helpful although I have picked up on tension between employees before and it was awkward. I also wish that they fixed my sandwich the same way consistently. The condiments seem to vary (even if I specify) but it's usually not a huge deal. I love this place!"], ["Connie L.", "First time here. The sever greeted us and took our drink order promptly. He was very polite. He came back to take our order very quickly, which was nice, but I felt a little rushed since it was our first time there and I wanted to look over the menu.  The shrimp poboy was fine. Ethan ordered the saints chicken/shrimp it was a little over priced in my opinion, and it was mediocre at best. We would eat here again....I'd like to try some of the other items on the menu."], ["Priya S.", "Look, around Clinton there's not much to eat out and very few places to really go enjoy a quality, fresh meal. Newk's is one of those places. I LOVE their broccoli n' cheese soup, so much that every Thursday they serve it, me and my roomie make a point to come here and specifically have it. It's creamy, heavy and delicious.The chili chicken pizza is quite delicious but spicy, not your typical pizza. The pesto sandwich is very good, although it can get quite bready. Another favorite of mine is the chicken Caesar salad, huge portions of chicken and greens. One tip for the salad, is get the dressing on the side, they give way too much. I love the sweet tea here, and they have a nice selection of unsweetened, Splenda, and sweetened. The cakes looks horrible and honestly I don't think anyone buys those things. They sit in a glass container near the cashier and I don't think they've ever changed them out. Gross!"], ["Charles B.", "Very disappointed in this location. Part of the order delivered quickly but it took 19 minutes from the time on the ticket to get the cup of coffee ordered. So everyone sits at table waiting on one persons cup of coffee.  If you do not have the entire order, do not deliver any of it!"], ["Pat T.", "Although the sandwiches are great, I really love their pizzas!  Great lunch spot!"], ["Dale G.", "It was 8:30 pm late for a meal. We opted for a 10\" sausage & pepperoni pizza to go. Total time from ordering to getting our pizza to go was 6 minutes. Great crust, super sauce and tasty toppings! We were traveling through the area, when we see a Newk's we will stop again."], ["Lee H.", "Great Toasted Turkey Sandwich with Bacon! Yum."], ["Nicole W.", "Newk's, where has your relish bar been all my life? Oh, how I love your large black plastic cups, bread and butter pickles, croutons, and gherkins. Your sweet tea keeps me coming back for more. The Newk's Favorite Salad was more than I could bear (or finish). Seriously, this place is great for groups, or separate ticket parties. The relish bar could be a meal in itself. They make their croutons in house. This place has something for everyone, including Mediterranean and American goodies."], ["Dan R.", "I would have rated this place 5 stars if it were professionally managed. The salad and soup were very good. The decor is very nice, also a good setup with a separate sink outside the bathroom. We had the soup and salad combination. My wife ordered the Caesar Salad with Lobster and Crab Bisque, I had the Simply Salad with Black Bean Soup. Both were very good. The entire bill was around $15. No tip and we drank water. We dined on a Sunday evening between 5 & 5:30. I counted at least 8 people working. I would have really liked this place if they had done just a couple of things different. Friendly-A greeting and welcome with a smile. The male cashier was polite, but not overly friendly.While were seated and eating, no one came by and asked how the food tasted. I would have loved to tell them how good it tasted. When we left I don't think anyone noticed. How about, \"thank you, hope to see you again\".Cleanliness-There was one big table that needed cleaning when we arrived, and it was only getting cleared at the time we left. Meanwhile several other customers had left and none of those tables were cleaned. We also noticed the table next to ours had been cleared, but still had food crumbs on it. I could accept all the above if the place was busy. It wasn't. There were only  4-8 tables occupied the entire time we were there. Lot's of employees standing around. One girl came out to clean the tables, meanwhile there were seven people milling aroundthe back. I hope this place is around in a year, I really liked the food.IMO they need a change in management and attitude."], ["Sabrina R.", "Don't get the lobster crab bisque. I found the 2 times I've eaten here less than satisfying. The food is not that great. I found myself saying ehh. I've been to the newks in Brandon and byram. I won't come back."], ["Jennifer T.", "I like Newk's. I don't love it. It's a chain.  I have nothing against chains. I ate most recently last Friday, January 4, 2013. I had the tomato basil soup. Now, I loved that soup. It was absolutely fantastic and I could have made a meal just out of the soup. I also like the roasted garlic and bread sticks as well as the Splenda sweet tea.  However, most of what I've gotten at Newks is just ok. However, I have gotten soup that if not eaten quickly enough, turns very watery and I find that off putting and frankly weird."], ["Rob B.", "I love coming here.  My wife and I usually get the half sandwich and bowl of soup deal.  The service has always been good, and the food fresh and fast."], ["Dave C.", "Best soups on the planet"], ["Jim S.", "What a great lunch! Best looking, and largest, salad I have ever seen. The pizzas were great too. Wish we had a Newk's in NC!!"], ["David P.", "The Mediterranean pizza is simply the best! Must try it with feta cheese."], ["Lee H.", "This is the preferred sandwich shop around town. More extensive menu, cleaner and generally better service than McAlister's."], ["Johnny D.", "nice clean soup/sandwich/salad place in clinton, ms similiar to a panera bread type restaurant. everything tastes pretty fresh and healthy. good place to hang out and talk with friends."]], "Mediterranean Grocery & Cafe": [["Courtney C.", "Great food and amazing service, on both visits. The market has a good selection of middle eastern fare: zataar, labne, akawi, etc. Above all, really really nice people and great prices for the amount and quality of food that you get."], ["Jennifer K.", "Oh, what a treasure this place is!I am a big fan of Mediterranean food and this place does not disapoint. I had the cold plate with a side of gyro meat in order to try a little bit of everything and boy, I was glad I did. Everything is incredibly fresh and tasty. The real stand out for me is the tzatziki sauce - HOLY CATS!! I have never tasted anything so good."], ["DiorAddict S.", "This place is just \"alright.\" I went there once sometime in 2009 and the food was absolutely delicious so when I saw a groupon for this place, I was excited to try it again. I went there for lunch. Our food was plentiful but just \"ok\". Also, who the hell puts pickles in a gyro!? And the owner offered to make my gyro \"spicy\" which is fine because I love spicy food but instead, what I got was a messy Chilli (think the kind you find in Chinese buffet to add \"spice\" to food) inside my gyro! It was pretty nasty. I didn't eat. In retrospect, I wouldn't have even paid for it had the owner not been so kind, attentive, and nice. Nothing special. Went there for dinner because I realized my groupon was not for lunch, the food was again just \"ok\". My fish fillet was old and tasted weird so I didn't eat it. We were given free dessert to make up for it. My guy liked his so thats why i didnt give this place just 1 star. The owner was so nice! I just think this restaurant really needs some professional help because the food literally tastes sooo blah!! It's like his wife makes it in the back with no actual professional training. I love the owner so it is really sad that the place has gone from being full every Friday night to total crap. The owner gave us \"15% off entree\" card but I just tossed it out. I'm sorry but until I see this restaurant on \"Kitchen Nightmares\" and reformed I won't be going back. Alladins is cheaper and much more flavorful. The only reason I don't go there as often is because there is not one nearby. :("], ["Eric L.", "Not a huge fan of Mediterranean fare, but this place is good.  Live music on Friday nights.  Cozy hole in the wall place that gives great service and food."], ["Julian V.", "THIS PLACE IS THE JAM Y'ALL.For Jackson, this is about as good as Mediterranean food is going to get. I gave it four stars because well, I lived in New Orleans, and I've tasted better Mediterranean food (Lebanon Cafe, Mona's). That's not to say that this Mediterranean food is not good. It's SO good. Shin e. is right, they do have a grocery section which is nice, unfortunately, Jackson doesn't have a huge need for Middle Eastern groceries, so some of the items may have sat on the shelf for a lil' while. The stuff in the case is solid though. The desserts are for the most part really good. The tiramisu is AWESOME, but I'm not sure that it justifies the $5.99 pricetag. Try a chocolate pecan bar instead, they're really good (but I'm not sure that it's a middle eastern thing) The hummous is SO SO fresh, you can taste the lemon and olive oil. Do yourself a favor and get some to-go for later in the week. Okay so pricing is a little pricy, but in all fairness the portions are pretty huge. The best time to go is for lunch, where you can get lunch plates in the neighborhood of $6-9. Dinner gets a little pricy with plates ranging from $10-$20. I had the kebab which was good, but not the best I've ever had. Then I tried my brother's dish, and realized I made a mistake choosing meat. This place is called Mediterranean Cafe and Fish Grill, and griling fish  is a fine art that they have perfected. True, they use frozen fish, but they do a pretty good job at making it palatable. Hell, even more than palatable. I would recommend getting the pasta with fish. The pasta is done in this mediterranean sauce that I'm not familiar with, but it's delicious, and there are also grilled vegetables with it too. DEF. worth the visit. The owner (Elias?) is a very accommodating guy.One last tip, this place is BYOB! Which is amazing! (Except on Sundays). There's a liquor store in the strip, but I'd recommend shopping elsewhere for wine selections."], ["Chad S.", "The owner Elias is your best friend you always missed. This place has great lunch & dinner. But you should be ready to have grilled fish or shrimp....because its great. Also BYOB with liquor store next door. They do serve beer!The grocery items on the wall add to the ambience.Deli case has some great little items to take home. I used to be hooked on several things from here.Update on 07/06/2010---- try the crab cakes!! but get the meal instead of the appetizer...better value"], ["Mike L.", "I now count 6 restaurants in the Jackson area that server middle eastern food. How wonderful!The space. It is great if you want to meet someone there and talk business - not great if you are looking to be entertained. The restaurant is a wide-open square with stained concrete floors. The walls are lined with shelves of interesting food items. A flat screen tv displays above the bar. They also have a 150-person banquet room available, but I've never seen it in-use.Yesterday I had a gyro, hummus, eggplant dip and stuffed grape leaves. They include a small cup of extra cucumber sauce, which is nice.  My friend had a kabob plate with 3 sides and enjoyed it.  I have had the grilled fish in the past. All of the food is delicious and I am full every time I leave. So food is good, portion size is good.One of the things I enjoy most is browsing the food items. I have purchased tahini, two types of eggplant, cans of grape leaves, and some wierd desserts.  All in all this is a great place to pop in and have a relaxed lunch."], ["Herman S.", "All the reviews above are spot on. Everything is very healthy & very fresh tasting. I agree that this is probably the best Mediterrean place in the Jackson area, though they all have different slants & specialties, so its not totally fair to compare. The lunch specials are the way to try it cheaply, at night it is a bit pricey, but you get a nice amount of food. Also, with your lunch you can get any two sides: a bit of hummus/pita, lentil pilaf, etc.. The fish, Shrimp, grilled chicken, lentil pilaf are all quite nice. Elias (the owner) really is into pushing healthy & is delightfully a bit of a \"Seinfield Soup Nazi.\" \"You want  a diet coke refill?, How about a water?..Try the Tabouli, its the healthiest thing you can put in your body.\" But he's otherwise friendly. I often grab a few figs from the grocery for dessert. Don't be afraid to try something you might not normally. This is a place that can suprise you."], ["cheryl w.", "I just happened upon this great grill and deli today for lunch....what a find!  I picked up hummus, favo bean spread, and almond chicken salad with wheat pitas for my husband and my lunch.  We both loved it all.  We'll be back for lunch and/or dinner.  Didn't find it any more pricey than any other Jackson restaurants that are locally owned and serve freshly made food."], ["Sarah S.", "When it comes to Middle Eastern food, I'm a fairly harsh judge since I spent the better portion of the past four years in SoCal, a Middle Eastern haven.  I visited the Mediterranean Cafe twice in one week (three times if you count the trip for groceries), so obviously this place has something going for it!  The veggie sample was delectable with spanikopita, falafel (with a little bit of a bite), hummus, tziziki, & grape leaves.  I love their baklava.  I tried a pistachio roll dessert that was not so great.  The packaged halva was also less than tasty.  Their lentil pilaf is oily but SO good and their baba ganoush is good.  So why three stars?  Well, I bought some dried chick peas and almonds and found mealy moths in them when I got home.  The owner was kind to give me a refund when I returned.  Just inspect before you buy!"]], "Quiznos": [["Coral E.", "I love a Quiznos - and this is one of the best locations I've been too.  The team at this location is always super friendly and get your order to you quickly.  Don't be put off by the line at lunch time - it moves fast.  All of their sandwiches are fresh and delicious.  My personal favorite is the Turkey Bacon Guacamole.  They also have a cute outdoor eating area."], ["Ashleigh H.", "DO NOT EAT HERE. I recently ordered 60 regular boxed lunches for a local university football team. We paid for each box to come with a regular sized sandwich, cookie, and bag of chips. Instead, I received a small sandwich and no cookie in half of the boxes. When I called the next day to be reimbursed for the missing cookies and small sandwiches, I was told that I could not be helped. After contacting Quiznos' corporate offices, the owner was willing to come to a settlement. Less than an hour later, I received another phone call from the catering manager who actually berated and harassed me for \"lying\" about the service I received. He even told me I sounded young and that I sound like I have issues... I can't make that up. He even threatened to have his girlfriend speak to me on the phone. I have never in my life dealt with such an unprofessional business. I will NEVER again do business with this Quiznos. You would think for an order of over $300 an effort to maintain business and some sort of professionalism would have been made. I am immensely disappointed and flabbergasted with this experience. I just talked to corporate again so hopefully something will be done. Save your time and money though and go to Subway."], ["Llecram P.", "I think this is the best Quiznos I ever been. They have tasty subs and great sodas. The service is great. The usual I would recommend is the spicy baja chicken. There are a few things that need some work like more soda options and better chairs and tables because they are pretty wobbly and small."]], "The Froghead Grill": [["Amanda C.", "Great taste! Great price! Awesome atmosphere! For everyone! I always order the chicken club wrap with sweat potatoes and honey bunny sauce on the side. Yummy. I usually dip my wrap in the sauce too!! Check it out. It will not disappoint."], ["Calvin M.", "The gumbo is very watery. Looks like they didn't make the rue with flour. They should at least add corn starch to thicken the gumbo. So it won't taste like a soup. The pacific wrap is like a chimichanga. It was ok. Nothing special about it. The fries weren't crispy. It tasted like steak fries.But it's Clinton. It's not like there are a lot of food choices around here."], ["BJ M.", "This is the only time I have eaten at this restaurant. The restaurant parking lot had a lot of trash in it which did not leave me with a positive impression. My meal was cold when it arrived. The bread pudding I had for dessert was served with a few dollops of whipped cream instead of the ice cream described on the menu. I will not visit this restaurant again. ICK!"], ["Karen L.", "Wow that was good! The pacific wrap was perfect.The red beans and rice was official! Very good flavor. The workers were very helpful. I would eat there again.!Don't forget the brownie with ice cream."], ["Prakash A.", "Being at a college near by I heard lots of great talk about this place so eventually I took my girlfriend to eat here. After being sat down a waitress came sat in the booth with us to take our order which was unconventional and strange but nonetheless we were there to enjoy a meal. After placing and order of mozzarella sticks we waited a few minutes to look over what we wanted as our entrée. The waitress then comes back and takes my order first which was unconventional as well usually starting with the lady. After taking my order she said and what would this lady want(addressing my girlfriend). I thought it was extremely rude addressing my girlfriend in that manner but we overlooked that as well. We waiting a few more minutes for our entree. My girlfriend ordered the chicken parmesan poboy which was edible but I wont make the mistake of ordering a voodoo burger because it was horrible. The taste was what you would think a bacon dog treat would taste like. On top of the burger being putrid the fries werent even warm and they were flimsy. The manager came out after I told the waitress I didnt like my burger and understood so she said she would send me out a wrap. A wrap never came but she sent me a sliver of a bread pudding im guessing. They took 20% off the bill which was nice, I did tell them I didnt mind paying for the food since I had ordered it. All in all this is somewhere we wont be returning anytime soon. On a good note the cups are plastic if you get soda which you can take home!"], ["Amber D.", "Good prices. Good food. Good service. Nothing to write home about but a good place for a fast tasty deep fried meal."], ["Lisa B.", "Stopped in while on a long road trip. Relaxed atmosphere, fast and friendly service. They had a good selection and a kid's menu. Bathrooms were fairly clean. The food was good and definitely a nice change from fast food on the road!"], ["Kendra Y.", "Great pacific wrap, bully wrap and sweet potato fries with honey butter dip. Nice casual dining. Pricing was good! My kiddos loved seeing the real frogs! Was a nice stop on our road trip. Waiter very kind. We love to eat local restaurants!"], ["Andrew L.", "Three stars, but just three. We had a basket of fried mushrooms...overcooked. My wife had the grilled shrimp, tiny, but she said tasty. I had a bowl of the gumbo; over salted. A very mediocre meal with tip was nearly $40. Also, the portions were quite small. Hmm, maybe 2.5 stars. Oh, and very noisy."], ["Andy M.", "I give them a four for their Easter feature lunch.Their menu is pretty long.The decor has many frog figurines."], ["Bobby M.", "Unreal, Pacific wrap was perhaps one of the best things I have ever eaten. I really wish we had something like this in Memphis.  The portion was huge. My buddy got the Voodoo wrap and said it was also great. The queso was also awesome."], ["Cindy C.", "The BBQ Pork Hoppers were very good - lots of delicious meat and fries too! My husband had the Jalapeño Mama burger and loved it.  Our waiter was very attentive and pleasant. This is our favorite place to eat in Clinton."], ["LaTrina W.", "THE FROGHEAD GRILL! One of my favorite places.  I had The Hurricane for a change. My favorite sandwich was The Fredrick with crispy chicken. The Hurricane did not disappoint. They were pretty busy so the service wasn't the best but they are usually very attentive. I've introduced a lot of my friends to this place and they love it to. Give it a try.....you'll love it!"], ["Dominicques B.", "Wow great food great service! I got the crab cake platter and mash potatoes. The crab cakes were so delicious and very filling. The mash potatoes I were thinking they were bland but I was VERY wrong they were fluffy and garlicky and oh so good. This is a wonderful little spot!"], ["Tim G.", "Great good and great service. The bread pudding is incredible! Highly recommended. Hard to find reasonably priced good food."], ["Mary M.", "Best burger I have ever had. We are traveling through and wanted something different . I got burger and rest of family got other things..Service was Great.Our server was friendly and took care of our every need. he was GREAT!"], ["Mike P.", "Came saw multiple open tables waited 10 minutes and left.  Guess they had the velvet rope going on today.  Several others did the same looking at open tables and being put on a wait list like me and left for a nearby restaurant.  To much competition to act or run a business that way.  Food is usually good here today musta been a bad day"], ["Dreka G.", "Service was horrible. We were there 15 minutes before someone took our order. The burger was ok, no to the chicken strips... basically I'd rather go to Applebee's...Sorry."], ["Dustin D.", "These are the best burgers in Clinton! And, having a staff with such great attitudes makes for an excellent experience. They are top notch."], ["James C.", "Service , what service the fried pickles are good but that's about all I can say was good . Well over priced for the food you get . It's just a fast food joint in  disguise."], ["Susan H.", "Very near and unique little place to stop in for lunch or dinner. I have had their po boy previously and really enjoyed it. This time I had the bully wrap which was grilled chicken chopped up, bacon, lettuce, tomato, and a special sauce I think it was called toad sauce. It was very good but by the end of the wrap I was stuffed. I ordered the queso and chips as my side and didn't care that at all. My boys had a grilled cheese with fries, the bread was tough & a little brown for their liking. The kids came with a frog sticker and they thought that was pretty cool. My teenage daughter had the chicken club wrap, which included fried chicken, bacon, provolone, ranch, lettuce, & tomato with a side of sweet potato fries that came with a brown sugar sauce (absolutely delicious according to her nonetheless she loves sweet potato fries). Really enjoyed and will definitely go back but will order a different side. Lots of best and different things to try on their menu."], ["Cinda H.", "My parents live in Clinton and we frequent Froghead Grill regularly.  Wonderful salads, great burgers, sweet potato fries with addictive \"honey bunny\" sauce my kids can't get enough of.  I am hooked on the Pacific wrap.  Homemade remoulade is to die for!!!!!  Would like bottles of that to take home."], ["Justin G.", "The good:-One of the more unique places in clinton. -pretty good selection of food optionsThe bad:-while the food is not bad, it's not that great either.-sometimes the water tastes gross-service is generally pretty slow at night (better at lunch)"], ["Jenna H.", "I would give this place 3.5 stars. We stopped in Clinton on our way back to Texas and only had Applebee's or Froghead Grill to choose from for dinner, so we chose Froghead (why eat at chains when traveling?!). It was much better than expected. Excellent chips and queso, garlic mashed potatoes, and chicken fried chicken. The gravy was a little too watery, but overall it was a great value for the quality. Neat atmosphere, friendly staff too."], ["Jason W.", "I wouldn't even give this a 1 star if I could! How do you cook a bad hamburger? You cook it to taste like shoe leather! Don't waste your time eating here! McDonald's would have been a better choice!"], ["Niki L.", "This place is so much better than having to settle for applebees. **The service was a little slow but that was OK with me once I saw their menu. Everything looked so good. We ended up getting the fried portabello mushroom strips with parmesan cheese and a side of ranch and horseradish dip... The best fried mushrooms I've ever had. I got the Bayou Salad which was spinach, crawfish, sun-dried tomatoes, bacon, feta and parmesan cheese, and remoulade dressing. It's now my favorite salad I've gotten in an American style restaurant. My boyfriend got a huge po'boy. They had like 5 different kinds. His was shrimp and steak with red onions and pico de gallo with dressing. It was delicious, I had the leftovers for breakfast. They had a ton of appetizers, sandwiches, wraps, soups, and salads too. There was nothing on the menu I didn't like. This place was really good and is now one of my favorite places in this town. They have beer too. Yay! ** Every time I go back it gets better and better. The service has been excellent. I would give this place 4 1/2 stars. Get the sweet potato fries!! They come with a frosting and cinnamon sauce! The ranch chips and fried pickles are really good too!"], ["Al K.", "An associate and I were in town on business and there were not too many places to eat and didn't want any fast food chains.  We chose this because of the name and took our chances. It is not fine dining but had a pleasant experience.  Had the chicken fried steak and it was done really well with no complaints.  The wait staff was the best and on par with better restaurants.  In fact it was the staff that made it a pleasant experience."], ["Scott H.", "Good po-boys. Friendly staff. Good prices"], ["Heather S.", "Don't let the name freak you out this is the best restaurant in Clinton, MS and in the Jackson Metro area in my opinion.  So great that spouse and I drive there from Ridgeland at least once a week to eat.  I am professionally finicky so if I like some place it is consistently good and they don't mind if you take something off one of their sandwiches or salads!  Finicky people run to this place, we've finally found someone to cater to us!Food is always good and service is beyond awesome.  Counter order during the lunch hours and after five they do 'table order service'.  All food delivered to your table at the correct temperature.Lunch specials are always good.  I prefer the Thursday chicken spaghetti.  If you call in early they will save you a portion to be picked up later in the day.Best fried dill pickles in the Jackson metro area.Best chicken salad in the Jackson metro area.Best Red Beans and rice in the Jackson metro area.Beer on tap or in bottle.Hardly ever get to eat desert because the portions are sized to fill you up."], ["Mac W.", "A \"one off\" restaurant that's doing it right.  Good food, good service.  Recommend it!"]], "The Manship Wood Fired Kitchen": [["Darius W.", "One of my favorite restaurants to visit for lunch. Slowly becoming our office's daily routine. The lunch menu is full of options and you cannot beat the daily specials.Spacing is cramped in front so large parties should utilize the back area of the restaurant. Servers and bartenders  knowledgable, courteous, and quick!"], ["Melissa B.", "I went to the Manship for the first time a few months ago, and was highly disappointed. My friend and I had to wait a very long time for the server to come to our table, and then he forgot to put in our food order. We waited for over an hour before we finally flagged him down to ask about our food, and he just said, \"whoops,\" and laughed. The table behind us got a free appetizer just for knowing him, and all we got was a \"whoops\" for our food not getting put in. No apology, nothing. I called the manager afterward because I didn't want to make a scene, and he was friendly and apologetic and said he had seen the whole thing and it was unacceptable. He took my address and said that he would send me a gift card for my troubles and said for me to tell him when I came in again so they could give me better service. The gift card never came and I have been too angry to go back. The food may be good, but what we ordered was pretty bland and definitely not worth paying over $30 for a meal just to be disrespected. I expect better service in places that claim to be high quality."], ["Craig C.", "Great food, great atmosphere, and great service. A one of a kind gem.I loved the bar and the huge selection of bourbon and scotch. Glad to see a restaurant step up their game on all aspects of dining."], ["Blue A.", "This is a really nice spot in Jackson - and while the vibe is casual, it does look fancier than most places. Our server was extremely nice, made some great recommendations and checked in on us from time to time. This is one of the cases where great customer service really made the overall experience so much better.Blue crab sandwich - this was a whole soft shell crab, inside a sandwich. I love crab - but I've never had a whole soft shell crab. This was interesting! It's a pretty big sandwich, and I managed to do some good damage on it, but couldn't finish. I think this was one of the specials - so it might not always be on the menu.It came with a side of parmasean fries - eh. I should of picked another side. These were very thin cut fries (I prefer thick cut fries). I know for next time to try one of the other sides that looked great.Ended the meal with some blackberry cobler - They have a free dessert as the Check In offer on Yelp! Got this one and it was delicious! Possibly my favorite part of the meal.There's a nice cocktail and beer list as well - I can see this being a great happy hour spot. Might have to drop in for a drink next time I am in town."], ["David R.", "Great libations and wild game!The Manship Wood Fired Kitchen is located on the first floor of the Belhaven Medical Office Building.  The parking garage is accessible from Manship St. or Poplar Bvld.I arrived during happy hour when cocktails are half-price; I took advantage of that. I started with a drink called the \"Best Damn G & T\".  My preference for a G & T is prepared with Bombay Sapphire Gin.  This G & T was sweet and refreshing; it was not overly sweet.  I saw cooper mugs at the bar and knew my next drink would be one of my favorites, the Moscow Mule. The bartender did a good job with the drinks.I like duck and had to try the duck wings.  The duck wings looked and tasted like they were braised in a citrus glaze.  Six meaty and tender drummettes, garnished with scallions and an orange slice. Although there appeared to be other good entree choices on the menu, since I like wild game, I ordered the rabbit ravioli.  Ravioli stuffed with ground rabbit and topped with Pancetta and what looks like snap pea shoots; it was a great choice.There are a few selections for desert, I was deciding between the peach cheesecake or peach cobbler. I went with the peach cobbler.  Prepared with peaches grown in Mississippi, the cobbler is served in a small cast iron skillet, topped with vanilla ice cream and garnished with mint leaves.  The cobbler was on the cool side when it arrived at my position at the bar, but still good and complemented by the vanilla ice cream.The desert was on the house with my Yelp check-in.I would visit again."], ["Cody M.", "One of the best additions to the food culture of Jackson in the past couple years. I had my rehearsal dinner here, and experienced exceptional service, food, and atmosphere throughout the whole thing. Their food is absolutely delicious, and ranges anywhere from a nice tender steak to a perfectly seasoned fish to a hot and sizzling pizza. They have food for every price range, especially if you hit up their happy hour when you can get discounted drinks and pizza. This will be one of Jackson's staples in the upcoming years if it isn't already."], ["Melissa A.", "Great food and service.  Pretty restaurant with fun patio.  Nice to grab a quick pizza at the bar or sit down for a slow dinner."], ["Linnea W.", "Oh my gosh j have died and gone to Heaven. Jackson suddenly feels like a soft Chicago . Great environment . Delicious menu."], ["Dana R.", "My favorite restaurant in the Jackson area! My favorite entree so far has been the Tuna filet. The wine and craft beer selection is long and wonderful! Also, the Crawfish bisque they have on the summer menu is delicious. Oh, and for an appetizer- I highly recommend the crab cakes. Roumalade sauce served with it is fantastic!"], ["Rachel P.", "This place is straight up fantastic. I've been for lunch, brunch, and dinner several times and have never been anywhere close to disappointed. Everything is masterfully done.Let's start with the atmosphere-- the restaurant is relatively small, but still maintains a spacious and open vibe. There's seating at the bar as well as some high top tables for smaller groups when you first walk in. Then, in the proper dining room, there are both booths as well as tables. This is an excellent location to bring a group, especially if you're celebrating. Situated right in Belhaven between Fondren and downtown, this place is central to all the going's-on's here in Jackson, and is a perfect place to start your evening.But let's talk about the food. I eat out relatively often and can be a bit of a food snob, I'll admit. This place regularly blows me away. Everything I've had has been phenomenal. The first time I ate here, I had the steak and it was by far the best steak I've had in town. Better than any of the restaurants \"known\" for their steak! Since then, I've had a variety of dishes from salads to brunch to pizza and everything has left me raving. The menu changes regularly, and features a bevy of local vegetables and produce which I LOVE. I wish more Jackson restaurants would do that. It shows a certain pride in this city, which goes a long way with me. This is a fantastic date locale. It's classy, not stuffy, and quiet enough that you can hear yourself chat but not so quiet that no one chats.Their bar is fully stocked and their drink menu is extensive. They offer a fantastic variety of wines and beers, but I've always been most impressed by their unique and finely crafted cocktails. Service, for me, has always been great. The only time it's ever been a bit slow was when I stopped in for a late lunch but that's to be expected at any restaurant when the wait staff is switching from lunch to dinner mode. Even when it's a bit slow, the wait staff is always incredibly friendly and helpful-- always ready with a recommendation or a menu suggestion. Overall, I can't say enough good things about the Manship. It's one of the most excellent restaurants we've got in town, and I'm so glad to have it here in the neighborhood. Check it out! You won't regret it!"], ["Amanda W.", "I ordered a to go dinner. I was surprised and disappointed to see that each to go item, they would charge $.50 per item. So my 3 items added an extra $1.50 just for it being a to go order. I ordered the smoked wings appetizer, the shrimp bisque, and the couscous side item. I ordered the shrimp bisque based on the recommendation from the lady taking my order. I was not impressed. There was basically no shrimp and instead of a creamy sauce it was more of a broth. The smoked wings were pretty good though I had expected more from the white barbecue sauce, it was peppery and fairly spicy (and not in the tasty way) in my opinion.The couscous was something to brag about though. This is also a recommendation from the lady who took my to go order. I wanted the Parmesan truffle fries but she said they were a special and they no longer carried them at this moment. She offered the couscous as a substitute, and she actually got this one right. It had small cut mushrooms with some Parmesan and some truffle oil. Recommended! I did enjoy the look of the restaurant, especially the outside patio area."], ["Ryder T.", "Soon after The Manship opened, I had dinner there and was very impressed. Jackson has had a lot of good restaurants (and still does) but this one really took the cake in all ways. The food was amazing, the service top-notch and the atmosphere felt like I was in a much bigger more impressive city. Prices are reasonable for the quality of food!They have an excellent brunch - probably the most creative and tasty brunch in Jackson right now. The happy hour is also not to be missed. Half off cocktails and pizzas is perfect for an after work drink and snack or a full blown early dinner date! The last time I went to the happy hour, the mixologist (I only use the term because he was actually our waiter at the time, not the bartender, though he had come up with many of the cocktails) was happy to hang around and tell us about how the cocktail combinations had come about. The staff is always knowledgable about where the food comes from and how it is prepared.The only issues I have had with them is weekday lunch - but this is a more difficult time for most restaurants. The food was excellent, of course, but the service was a little lacking. That is to be expected at a busy lunch place like this, however.MAC & CHEESE LIST - This Mac & Cheese is different. It is not your standard comfort food style, so if you are looking for Velveeta (no judgement zone - sometimes we are!) this is not your place. Today it was Pancetta Mac & Cheese (see pic) which was awesome, but it has been a different formulation in the past. Definitely good, but lighter on the cheese than most places. Worth getting for sure though.MUST HAVE DISHES IN JACKSON - The Best Damn G&T. Like the name says, it is the best G&T you'll have, at least until you figure out how to make it yourself. They make it with top notch gin and Jack Rudy tonic. I wouldn't advise the new BDG&T version 2.0, the tonic is gross."], ["Blanca V.", "The food was great! Had the shrimp scampi and angel hair pasta...service was okay just would of liked for our waitress to let us know more about dessert instead of assuming we wouldn't be interested. I heard about the desserts because she was explaining them to the table next to us!"], ["Andrew B.", "LMAO I just looked at the page and the special offer is for a free \"desert\" instead of \"dessert\". That advertising is paying off!Way to go Yelp"], ["Tiffaby H.", "The food is always good! Great lunch specials if you want a gourmet meal on a budget then this is the place! This location has an extensive bar area and hard to find liquors great for happy hour too which is 3-6!"], ["Aminah M.", "We found this place on Yelp and we were not disappointed. The ambiance and decor were great but the knowledgeable waitstaff and Delicious food are what make this place a winner for me. We ordered the Mediterranean shrimp salad and the farmers market pizza and added sausage. We ate at lunch and the portion sizes were great. Everything was super fresh and tasty. The salad was fresh, presented well and the shrimp were just melt in your mouth good. The pizza was a tad greasy, but it didn't take away from the flavor. We got the free desert for checking in, and ordered the cobbler. It was DELICIOUS. The crust was so light and crumbly I could eat 2 of those by myself. In short no complaints. My server Brandon was not only knowledgeable but he was also super friendly and just made our dining experience A1.   I'll be back to check out dinner for sure"], ["Kevin W.", "Duck wings and ribeye deckle will absolutely never disappoint. I chose the cowboy special tonight and am overly stuffed and happy.  Throw in some crab beignets and this place is by FAR the best, freshest and imaginative menu in Jackson. Add the fact that the price point is perfect."], ["Rob J.", "My wife and I love to use yelp to find not so hidden treasures across the country.Today, we found Manship! The Duck wings and greens were excellent. You should share your meal and be wise...and leave room for the cobbler!Nobody does cobbler like Mississippi!"], ["Ryan K.", "The Manship Wood Fired Kitchen was the second restaurant I ever visited in Jackson.  Over the past year, I've been back more times than I can count, and I always take my friends and family when I have visitors in town.  The Manship's service, atmosphere, and plate presentation is really great, offering a wide variety of options for different types of eaters without making the menu overwhelming.Hands down, the Manship serves the best pork belly dish I've had in Jackson... and I've had a lot of pork belly.  The Manship has daily menu rotations and seasonally modifies their dishes with local flare.  Recommended:  The pork belly, smoked Caesar salad (with extra anchovies), the Funghi, Farm Egg, and Bacon pizza, and any of half-fish specials."], ["Micah S.", "Every time I come to the Manship, I try something different. And every time I try something different, I love it. This is definitely one of Jackson's best and most creative restaurants. Worth trying!"], ["Melissa M.", "I've wanted to try this for awhile and happened to be nearby today.  The place is bright, clean, and well appointed.  Love the abstract art from local artists hanging in their gallery.  Our server was quick and friendly.  We'd gotten a gluten-free menu from the host, but our server went the extra mile and took it back to the chef who told him the dish we wanted was not gluten free and also cooked in the same oil as non gluten-free items. Fortunately we aren't that sensitive but we appreciated his thoroughness in verifying the items.  I ordered the salmon salad but asked for the kale to be changed for the local lettuces, omit onion, and add feta.  They did this without a charge (although they did leave onions on - no problem as I could easily remove them.)  My dining partner had the simmons catfish with parmesan fries.  Our order came quickly given the lunch rush.  My salad was very good.  The portion was relatively small, but it ended up being enough.  It included lettuce, finely diced cucumber, kalamata olives, roasted red pepper, and a feta vinaigrette.  My son had 3 nice sized filets and a cup of fries.  He liked the fish but really raved about the fries. He said the parmesan permeated the entire dish, not just the fries on top.  Being yelpers, I pulled the listing up and saw a free dessert with entree offer with check in.  We had the chocolate mousse.  It was excellent and a nice sized serving.  It was a complex dish with several layers and flavor profiles - chocolate, crust, ganache, cream, raspberry drizzle, and mine.  And it was complimentary, so there's that!  I will go back and try something else.  It was above average food and service.  Prices were a little steep for lunch (2 entrees, no drinks was $35 with tip) but it was very good."], ["Jon D.", "Very good, prices are a little high but you get what you pay for - worth the price. I had a wedge, shrimp and grits, and a baked apple. Would go lighter next time as my meal was a little heavy. Delicious nonetheless. Free Dessert with Yelp check in was a big bonus. I'll be back, no doubt."], ["Jessica S.", "Very nice atmosphere. Wait staff was nice. I ordered the salmon but it was really salty. As were a few other things I ordered. Aside from that it was pretty good."], ["Shane S.", "This place is great! It has only been opened for a year and half, but they have received awards such as Best New Chef, Best Restaurant, even the sous chef has gotten accolades. The Manship is a huge space, but also welcoming with a more than competent wait staff. The drink menu is extensive and eclectic. The shrimp and grits were out of this world, the pimento cheese is a perfect creamy texture with a little heat. My crawfish pizza was amazing. The crust was just crisp enough to hold up to the buttery sauce. They have a great happy hour with half price pizzas. The strawberry tart with ice cream was the perfect compliment to finish the meal. The Manship is one of the very few reasons to visit Jackson again."], ["Ann M.", "The manship is one of my favorite sit down dinner spots in Jackson, and it's my all time favorite happy hour! Half off pizza's and drinks- YES! Every pizza I've eaten so far has been divine, and the porch-swing and heat index always hit the spot. As for dinner, simple sides like their any gratin potatoes or and veggie dish have satisfied my appetite. Personally, I go for the brocollini and some divine crab beignets . The duck and the filet are terrific, as well as the salmon and redfish. We used the Manship for our wedding rehearsal dinner and were so pleased! The services were great, and all of our guests were extremely happy with their food. I recommend them for events, for happy hour, and for a fun date night! Definitely in my top five for favorite Jackson restaurants."], ["Lisa G.", "Food was amazing as well as the staff. Everyone was very friendly and helpful, from explaining the artist & artwork on the walls to the best recommendations of what to eat. Jake was my server and did not disappoint with the rabbit ravioli with pancetta and chocolate silk tower for dessert! He even brought me a spoon to not miss out on all the goodness of the most flavorful sauce! Telling everyone at the conference to try this place out."], ["Scott A.", "Best steak in Jackson. The reduction sauce on the steak is amazing. I had the Prime cut. Best Mac and Cheese I've ever tasted. My wife got the Greek chicken, little dry in the middle but lots of great flavor. Also had the red shrimp appetizer. Really good but not very many. Only thing missing from the meal was bread to soak up the sauces. The apple dessert was very tasty as well. Great atmosphere."], ["Amin A.", "Actually a 3.5 starWas visiting Jackson because corporate hq is centered here and had to attend training. Prior to arrival I mapped out all the restaurants that I wanted to try and Manship just so happened to be first on the list.  Day one after training I went to the hotel, changed, and went to manship to check out the Jackson food scene with 2 other colleague . The decor was beautiful and the restaurant very clean underneath a hospital it was apparent that the customer attraction was young professional- the restaurant was very busy-  we were seated immediately. The waitress introduced herself and said that the restaurant had many different foods but many dishes have a bit of Lebanese twist and spice added., since the chef was Lebanese. We ordered the tuna dip, and duck wings as appetizers. The duck wings were very good and greasy but had barely any meat on them. The tuna was actually a very good dip. For an entree I ordered the Rabbit pasta- to my surprise rabbit was a little salty of a meat- but furthermore the pasta dish was incredibly small- this was unexpected for a 18 dollar dish. My colleague got the strip steak which tasted remarkable but was a very little bit. The third colleague ordered a pork shoulder- which I cannot comment on because I do not knowingly eat pork. The desert was the best thing i got Tiramisu which was free with checkin was absolutely delicious maybe the best thing I got  Anyway with 2 appetizers, 1 entree, 2 drinks- 62 bucks. Not bad - it just didnt really satisfy portion wise. Regrets: I would get the pizza.I would return."], ["Landon M.", "First time here this evening while visiting Jackson, pleasant experience. The staff adhered to the reservation notes well. Charcuterie and cheese assortment were great. Salad and entrées were well but a bit on the large side. Red fish was cooked perfectly, seasoned well. The sirloin was cooked spot on med rare, only complaint is it was over sauced when it could have stood on its own. Very nice wine selection, especially northern Italians. Bar service was top notch cocktails were well, plethora of digestifs and probably the best Scotch whiskey list in town.  Slides in to one of my top five when in jackson."], ["Shenika C.", "I visited the Manship one afternoon for lunch. I ordered the shrimp po-boy and although it was slightly salty, I enjoyed it. I wasn't impressed with the parmesan fries. Very nice atmosphere and I definitely will eat here again."], ["Cherry D.", "Had lunch here on a Saturday afternoon with a couple of friends. We ordered the chicken, pork, and beef entrees, as well as a couple of alcoholic beverages. The pork was a little on the sweet side for my liking, so I ended up not eating my dish. The beef had a good Mediterranean flavor and it was really moist. But the chicken was on point! I would definitely go back for the chicken. My mouth is salivating just thinking about the chicken. Can't wait to go back."], ["Kris A.", "We were in town from New Orleans celebrating our anniversary so the pressure was on to find the perfect restaurant.                            The restaurant and bar area were full when we arrived with one party waiting but we were sat right away thanks to the convenient reservation I made on my Yelp app a few hours earlier;)On to the service/food experience...First of all the seasonal menu is amazing and I had a really hard time narrowing down my choices because I wanted one of each! We asked the server tons of questions and he answered all of them patiently and honestly. After thorough discussions with the server, browsing through Yelp photos and some meditation, we ordered: the white bbq wings, marinated crab claws, burrata apps, ribeye deckle, parm reggiano fries, mushroom bacon egg pizza entrees and for dessert the chocolate mousse and tiramisu. If youre having as hard of a time deciding as we did, here's the breakdown:Wings were delicious, nothing out of the ordinary thoughCrab claws are the only thing we wouldnt order again.  They were tasty but we expected them hot which thru us offThe burrata was the best Ive ever had. Ribeye deckle are medalions that melt in your mouth and is AMAZING. The pizza had generous amounts of exotic mushrooms, nice chunks of meaty bacon and a perfectly cooked poached egg that just made the bite velvety deliciousness. I am a french fry connoisseur and I wouldnt change a thing about these. Perfect size with perfect amount of salty cheese in a perfect portion. I even left a few which is hard for me to rationalize still today. Our desserts were complimentary thanks to our yelp check in!  The tiramisu is more of a dulce de leche with a slight taste of Bailey's. It was good, just not your typical espresso soaked. The mousse was excellent with a dollop of raspberry that complimented it well. Overall it was an awesome anniversary dinner and we would recommend Manship to everyone in the area. ($160 after tip: 3 andygator draft beers + 1 heavens milk martini not mentioned)"], ["Darren S.", "Now that I have a toddler, we have to make every date night count. The Manship is our most consistent go-to spot for a great experience. You can enjoy The Manship any way you'd like: cocktails and small plates, pizza and beer, or steak and wine. Whichever route you choose, you'll find fresh, local ingredients and the wood-fired grill accentuating everything. We've had excellent service every time, and the decor is bright and clean, contemporary but still comfortable. The open kitchen adds a nice buzz to the room."], ["Claire S.", "Extremely mediocre and pricy not for the portion but because it was kind of gross. Chicken was terribly dry with no flavor whatsoever, yet sitting in fat. Pizza suffered from the same dry chicken and artichokes were incredibly tough. Waitress never did a quality check, which was probably the worst part. She didn't have a full section and never once asked if everything was okay. Mac and cheese was probably the best part and even then - it was 2/10 at best. Won't be back. Won't recommend it to anyone. Best part was the drinks, which were well made."], ["Leon S.", "Food is good....service is slow....shrimp bisque (has  curry in it).... Steak, a u gratin potatoes, fish, and shrimp ravioli is is good .....the personnel aren't too attentive or just don't care ....I still tipped 15%....total of 150$ for 4"], ["Christopher S.", "When this place opened, there were long lines for lunch and dinner...with good reason!This is an excellent restaurant - upscale, great food, local products in the dishes, and full bar.  The Pimento Cheese appetizer is outstanding - fresh and homemade!This is American - Mediterranean fusion, meaning they have woodfired pizzas, brisket specials, sandwiches, and some typical Med dishes (some Med Chicken and other dishes...to be honest, I can not get past the salads, pizza, and sandwiches...oh and the daily specials are excellent).You probably will need a reservation, and they accept Open Table (love the iPhone App).Good service, good food, local ingredients, full bar - 5 Stars."], ["Phil S.", "Great service.  Food was great.  Asked for something a bit off menu and they handled it like it was completely normal.  Bryan behind the bar was working his tail off but not missing a beat. Would definitely go again when back in Jackson."], ["Christine G.", "I was brought here after a job interview, absolutely fantastic food! It was nice enough to sit outside. The staff was nice and accommodating, always a plus. I got the beef Poboy, absolutely delicious. 2 others got the chicken shwarma and nothing was left. The Spanish fries were amazing. A touch spicy, but that's ok. For the dessert, I got Tiramisu. A little on the creamy side than what I'm used to, but that's ok (others weren't a fan). There was also this lemon tart thing with sherbet which was also delicious. If I ever end up back in Jackson, definitely a place to go!"], ["Brenna M.", "Yelp has not let us down yet! It helped us find this awesome little restaurant, Manship Wood Fired Kitchen. We had Grouper with Polenta & Tomatoes/Veggies, Italian Crab Claws, Parmesan Truffle Fries & their Brisket as well as a Pepperoni Pizza with 2 Fried Eggs. Ridiculous. Food Porn. Oh, and their Bread with Seasoned Olive Oil is fantastic. Our three year old devoured the Italian Crab Claws & Brisket!"], ["Vicky O.", "Our evening at The Manship was not good at all! Our waiter never introduced himself as our waiter (he just appeared and asked for our order) nor told us his name (our receipt says his name was Brandon). In fact, his first few words to us included labeling my friend 'sassy'. We should have known then what would follow...Let's back up...I made a reservation, arrived on time and still had to wait to be seated. Not very long, maybe 10 minutes, but what's the point of a reservation if you have to wait? I wasn't a big deal so I let it go. Anyhow, as I was led to the very back of the restaurant (by the kitchen) I passed by 2 open tables that could have fit our group.  I let that go too. My friend and I waited at least 20 minutes to place a drink/appetizer order along. Thirty minutes later only  one of the two appetizers had been received. The other appetizer never appeared and our waiter was so inattentive that we had to flag down another server...whose only response was that he would ask our waiter about the food.  After an hour of bad service we did not bother ordering entrees and took our business further down State Street to Surin, where the service was EXCELLENT!Also, if you choose to eat at The Manship (which we  will no longer be doing)  DO NOT EAT THE BREAD! Our table was in the back next to the bread station (the worst table possible even though we made reservations and there were other tables open!!!) and ALL of the servers handle it with their bare hands. Gross. Gross. GROSS. The funny thing is even though we were so close, our waiter never bothered to provide us with any bread during our one hour stay. And when we asked for our check, instead of asking what the problem was or if we wanted anything else, he handed us our  checks (the only thing he did promptly) with a vibe of  'good riddance'. That is not okay.I will say that the pork belly was pretty good (Table 100's is better IMO) but the culture  of bad service is unforgivable for any dining experience. We will no longer support this business and I plan to share my experience, good and [mostly] bad, with other Jackson foodies."], ["Bill B.", "To start you must try the Porter. Brewed just down the road in Hattiesburg.  Best I've had in a long time. Nora, Caroline and I shared the pasta with lamb special, the shrimp with grits and two veggies, spinach and asparagus.  All first rate. I started with the Caesar. The dressing was a bit under done but still good. The croutons were great. I usually don't eat them but these are a don't miss. Afterward we had ice cream with strawberry tart. The tart is really tart but the perfect compliment to the vanilla.I'll be back."], ["Elizabeth C.", "Great food! We were totally stuffed but still had to order some of the delicious desserts. Our server, Alex, was a doll."], ["Sassy P.", "Grouper was the best fish I've ever been served!!!"], ["James H.", "Their Gin and Tomic is great! I haven't had anything that I haven't loved. It's quite good. Prepare for a short wait at times though."], ["Abigail H.", "Favorite happy hour in Jackson. Incredible food, great drinks. And the service there is wonderful. Take any recommendations they give you."], ["David M.", "On my first visit, I had the fried catfish plate and Parmesan reggiano fries.  The catfish was extremely hot and fresh.  The coating was unusual - a little heavier than what I'm used to but still very good.  The fries were the best part of the meal - covered in just the right amount of parmesan.The environment is really nice.  It's clean, bright, and casual but still feels like fine dining. As it was lunch, I didn't try the cocktail menu but they had a wide variety of interesting options. I think what I like best is that it's locally sourced as much as possible and everything is really, really good quality.  I'll be back to to try the dinner menu soon."], ["Allen T.", "This place is excellent. If I have someone visit from out of town, this is the place I take them. Menu always changes and I have never had anything I do not like. Great service and great food. If you are in Jackson, you should not leave without checking this place out."], ["Christian And Angela C.", "Excellent food. Don't forget to check in for the free dessert.We had the red fish, lamb pizza, and rabbit ravioli. Also the Jerusalem artichokes, carrots, and braised greens as sides. All was excellent. Fish was light and flaky. Pizza wasn't too greasy but the lamb is strong just as a warning. Rabbit ravioli was a bit small but again not too greasy and the rabbit isn't too strong. Just slightly chewy and very tasty. Artichokes aren't actually artichokes but actually sun chokes like fingerling potatoes. Carrots great. Greens good but a tad salty.Minus one star bc my parents didn't like the server Patrick and the tirimasu was pretty meh. To be fair two people recommended the apple cheesecake so must try that if ever back in Jackson."], ["Vim I.", "So glad to see that more and more local-focused restaurants are coming to Jackson. It's been a while since I've been back to the city, so I was pleasantly surprised to see to the new Belhaven building.We tried to make dinner reservations for my sister's bday at Manship for Saturday night, but they were full, so we went for lunch instead. So glad we did. First off, the ambiance is wonderful--very laid back but well thought out decor. A huge blackboard is displayed right next to the open air kitchen--listing the locally-sourced ingredients at Manship.I had the Fennel Sausage pizza since they have a wood fired oven. It was delicious as it sounds. The crust was crispy and flavorful just as it should be.My sister got the duck leg, egg, and polenta brunch special--that was out of this world good. And the boys went with the Italian Panini sandwich and Roast Beef sandwich--which they were really pleased with. The waitstaff left something to be desired--didn't refill water until we asked, switched up the order, and almost spilled the sandwich on one of us. That's the only reason I knocked off a star.Otherwise Manship is well worth going to."], ["Luke C.", "Regular spot for me and my wife. Always pleased with the food and service. The local sourcing of ingredients is particularly appealing. You're doing it wrong if you don't order the au gratin potatoes."], ["Brandon M.", "Went in tonight for dinner and the meal was terrific. We started with the pork belly which had a fantastic flavor. Our party had the pepperoni pizza, Amberjack, salad, potatoes au gratin and spinach. Each was perfect. We finished the night with blueberry cobbler which was a perfect end to the night. Mitchell was our waiter and all his recommendations were on point. Stephen, the GM, made sure to check in with us several times to make sure the meal was great. All in all this was an outstanding meal!"], ["Shay R.", "Filet was delicious! I got my order To-Go and the steak was perfect. Fried okra was also delicious."], ["Emma D.", "4 adults came for dinner.  We arrived early to beat the crowd.  The bar was fairly crowded.We all ordered something different.  The Frito Misto, a fried food appetizer, had a few nice plump oysters and some regular size shrimp along with many popcorn shrimp or something fried, plus some fried squash, artichoke hearts and some very tough fried asparagus.  It was accompanied by two OK dipping sauces.The pizza was so-so; the filet was a filet.  Other than an overpowering sauce the duck breast was tasteless despite an appropriate amount of fat.  The salmon was bland.  We shared side dishes.  The roasted cauliflower was charred but essentially raw and barely warm throughout.  The spinach had been barely wilted and contained an overabundance of stems and garlic.  We enjoyed excellent coffee and the house merlot was good.  All in all I would not recommend The Manship and do not plan to return.The music was not well chosen and was much too loud to allow for pleasant conversation.The desserts were all quite good - tiramisu, chocolate mousse with raspberry sauce and cobbler with iced-cream.  The cobbler was remarkable for not being too sweet.Our service was excellent."], ["Molly G.", "I love this restaurant! Happy hour is a great deal... Pizzas for $5 and cheap fancy drinks! The best drink is the Porch Swing. It's a sweet adult lemonade with alcohol. Careful, though, the drinks are strong! I also love the Jerusalem artichokes and the broccolini. The tabbouleh is thick and mushy-- you might want to skip this dish. The bread is to die for."], ["Krystal C.", "This establishment was great. Well lit, clean, excellent atmosphere. The bread brought to the table was fresh and served warm. I ordered the chicken wrap. The chicken was well seasoned and juicy. The pita was fresh and toasted just right. The tzasiki sauce was excellent. The truffle fries were fantastic. I wish I could have snuck an extra order home for later. My husband enjoyed his fried oyster po boy and home fries as well. Highly recommended."], ["Susan L.", "As a foodie, I thoroughly research via yelpRestaurants trying to find a great choice. On our way to Florida, stopped in Jackson MS. Manship was everything the reviews said; it is so worth the stop! From the porch swing drink, the pork belly app, and the Egg, bacon pizza, everything was delicious. It is so refreshing when a chef takes passion in the fresh, best ingredients and takes pride in using them in the most creative and delicious way! Spectacular!"], ["Orlean S.", "Visited Manship for the first time early on a Sat evening. Parking is a chore at the Belhaven building. The interior of the restaurant is clean and modern. Even though they weren't yet busy, because I had no reservations we were placed next to the bar. I chose Manship not because of the menu online but because of the outstanding pictures of actual dishes they post on Facebook. There is nothing on their appetizer menu that appealed to me. I heard people mention the tuna dip and the waiter recommended it. It really is tunafish with a smoky taste plus saltine crackers and some fancier bread crisps. It tasted OK but I would not order it again for $13. For a salad we ordered the wedge and Mediterranean. The wedge was standard, but I was not impressed with the Mediterranean. I guess I was expecting a Greek salad but this was very different. It had little dressing and was crunchy due to the chickpeas. I would not order it again.Finally for the main courses we had the duck breast and red snapper special. The duck was tasty yet a little chewy as duck often is. The snapper was outstanding - a light flavored fish over risotto and a few squash slices in a wonderful broth. Both dishes need a side so we shared 3: broccolini, fried okra, and tabbouleh. All 3 were terrific. The broccolini was well seasoned, the tabbouleh was good with a little more tang than is usual, but the standout was the fried okra. This should be on the appetizer menu. They were delicious whole fried okras with a roasted red pepper dipping sauce. They are addictive. Overall the Manship was a nice experience. It's too bad the standard menu isn't more to my liking - lacking in appealing appetizers and a larger selection of seafood entrees. But the main course was outstanding - I definitely would return again. Even though we had 3 different people try to take our drink order, the wait staff was pleasant, friendly and attentive."], ["STEVEN W.", "Great happy hour prices.  I had the Scallops, they were a little salty and would not recommend. However, the server asked to redo them and I ate them as is.  The bread before the meal was great.  They have a huge selection of alcohol.  The pizza was great and looked delicious.  I would try this place again."], ["Tom M.", "Oddly enough EVERYTHING was great .I had a bone in ribeye with a veal reduction sauce with a farm fresh fried egg on top.My goodness was it good!"], ["Patrick C.", "Outstanding food & bartenders! See Brian and Josh. Very knowledgeable & experts in mixology!"], ["Rachel D.", "I came here on a Monday night, definitely a little crowded but we were seated immediately. My friend recommended the \"porch swing\" OMG. Heaven sent. It was amazing and had a great flavor - not too overbearing with lemon. We ordered the pimento cheese and bread as an appetizer as well as the pork belly over creamy polenta. Both were great and not much was left on our plates. The pork had great flavor and the pimento cheese spread was a great addition to the garlic bread. I ordered the gulf shrimp as my main course. Angel hair pasta with olive oil and Italian spices with lots of shrimp. The shrimp were cooked to perfection and the spices on the pasta really topped it off. Our server was outstanding as well. This place definitely stands out as a favorite! Will be back the next time I am in Mississippi!"], ["Jess D.", "four stars because it looked and smelled awesome, but don't let the two dollar mark symbol fool you. it is very expensive. at least for my budget. but restaurants with same symbol have half the price"], ["Beth P.", "I have now eaten here often for both lunch and dinner, my best test for is a local place going to be consistently good - and this place passes with flying colors!  Service and staff always friendly and the food from salad to sides to entree has never disappointed."], ["Jonathan V.", "My family and I went to the Manship last night and we were absolutely blown away by everything they had to offer.  The service and the food were impeccable. I highly recommend  the Ribeye Deckle or the Duroc Pork Shoulder for your entre.  After having a bad experience the first time we went I was hesitant to go back, but I can honestly say that after the amazing time we had last night we will be going back on a regular basis."], ["Jose R.", "This place is a true gem. Stopped by with friends and the appetizers were flawless(do not miss the duck ham and the pork belly both were to die for!) The entree portions were delicious and we ordered the range of steaks, duck and fish, all were perfectly seasoned and cooked. The side portions can be shared and the risotto shiitake and grilled cauliflower were simply delicious.We ordered two desserts to share and they were also outstanding, this place is fabulous."], ["Josh C.", "This place is a breath of fresh air to the Jackson dining scene. Had a great meal here, and was treated so well by the staff. I recommend grabbing a few things, and sharing them. (Mary Katherine was a really fun, and knowledgeable server. She really helped us hone in what we wanted, and if I could poach her for my restaurant, I totally would have!)"], ["Jason W.", "I'm from California I found this place on yelp while visiting family here Jackson.  Driving up it was hard to tell what everyone is talking about, but when you walk in its a beautiful restaurant.  I came here on Friday and like it so much I came back on Saturday.  Tried the BBQ wings, the greens, the duck, and the mac&cheese.  Everything was so good and the waiters and staff were really cool.  Everything here is fresh and local.  If they ever decide to build one of these in L.A."], ["Javan C.", "All I have to say is \"meat and cheese\" the selection here was awesome and simple. I had the five selection of meats and cheese it was great. For desert had the peach caramel dessert. A must try if your I'm the area."], ["Maddie P.", "Excellent! We split the the small house Italian salad and the fried soft shell crab BLT sandwich. Both were wonderful! The fried okra was the whole okra stalk with red pepper relish and my favorite thing we ordered. They have an unofficial kids menu and my picky kids loved the hamburger and cheese pizza. The hamburger looked good, but one taste of the pizza and we kept sneaking bits from the kids! Excellent, friendly and fast service."], ["Jason M.", "Casual fine dining, pleasant atmosphere, excellent service and outstanding food. Had the 8 oz filet and it was out of this world. If you're looking for a classy evening in Jackson that won't completely destroy your wallet, this is it. Will definitely be back again!"], ["Sam L.", "New restaurant in new Baptist Medical center. Staff is friendly and very responsive. The lunch entrees we got were the special of the day of brisket, potatoes, and Brussels Sprouts with bacon. Tasted fresh and a great deal for $11. The steak kabob could use a little more refining. Price of $14 comes with 1 side but no starch (rice pilaf would go great) which can leave you leaving unfulfilled. The meat was cooked very well, but 2 main drawbacks: way too much oil is left in dish intended to be part of the sauce and not enough bell peppers to add some crunch to the dish."], ["Rich R.", "Couldn't believe I found this in Jackson Mississippi - the food was amazing, drinks superb and service to boot. The bacon, mushroom and egg pizza rocks.....what the won't tell you on the menu is the pizza has a nice hint of truffle on it.....excellent.... Ask the bartender for a signature cocktail to start, you won't be disappointed. Apparently the largest selection of spirits in Mississippi - maybe but I can't confirm that badge but I can confirm they are well stocked with whatever you want, even small batch varieties of gin and bourbon."], ["Peter C.", "They know how to cook here. Most everything I have had here has been delicious. Some of my favorites are the duck leg confit, the pork chop, the pork shoulder, and the rabbit ravioli."], ["Eats S.", "My work buddy and I are foodies from LA and have been in Jackson filming a movie for the last month and only discovered this place this past weekend. We were greeted with a smile by our server/bartender Nick. Although he was very busy at the bar, he was always very attentive. The food was amazing and delicious! I was kicking myself wondering why I didn't discover this place EARLIER! We ordered the Pork Belly app, the Caesar, the mushroom risotto, the prosciutto pizza, and the Pannacotta dessert with Red Wine poached pears with a raspberry drizzle with phyllo crisps. Everything was spot on, plenty of flavor, and all the right balance of textures. The pizza comes with four silicone ramekins of condiments - fresh dried fragrant oregano, grated parmigiano, large sea salt flakes (Maldon?), and what every pizza should have sprinkled on it, red chili flakes. Nice touch! The prices are fair, you're getting great quality, delicious food so you should pay accordingly, you get what you pay for.We are here for another week and plan to be there practically every night till we leave! The manager Steven does a great job of trying to get to know all the patrons and makes sure that everyone is having a great experience under his watch. This place is truly a gem! Highly recommended."], ["Kent S.", "I cannot believe how amazing this meal was.  Truly exceptional!  The duck wing appetizer is confit and the crisped and tossed in a perfect soy citrus glaze.  The scalloped potatoes were possibly the best potatoes I have ever had anywhere.  The special tenderloin small plate they had  was amazing too.  cooked sous vide and then grilled, topped with a curried jicama concoction.  We went here on the way to New Orleans.  We went to quite a few highly recommended restaurants while we were there and we thought this was the best meal of our whole trip."], ["Elizabeth B.", "The food at the Manship is wonderful; I've liked everything I've eaten.  They also have a great happy hour with half price cocktails and pizza. The bartenders are really friendly and great at recommending cocktails to try, and their Best Damn G&T is to die for. My only complaint--and the only reason it gets less than 5 stars--is that the hostesses are absolutely abysmal. They're not attentive at all when you walk in. Recently, my friend called to make a reservation, and the hostess told her no reservation was needed that evening because the restaurant wasn't crowded or booked at all. Well, when my friend arrived, despite all but 3 tables being empty, the hostess said they couldn't be seated for 45 minutes b/c all the tables were for reservations. The hostesses really bring down what is otherwise an amazing restaurant and definitely one of the best in Jackson."], ["Christina M.", "Upon entering the restaurant on a Friday early evening we were asked by the hostess if we were there for happy hour. We replied that we were really there for dinner and were seated in the back of the restaurant. The menu stated that happy hour was from 3-6 and included 1/2 price pizza and discounted cocktails. My husband ordered a beer and a pizza and I had the shrimp and grits. Service was ok. Food was good. However when the bill arrived we were charged full price for the beer and pizza. When we mentioned to the waitress that it was still happy hour time and could we get our discount, she replied \"no, that's only for people sitting in the bar or patio\" and would not give us the discount. She said this happens to a lot of her customers and the conversation is always awkward but there wasn't anything she could do about it. Not sure why sitting in one place qualifies for happy hour prices when another location does not, wish this was made clear by the hostess when we were seated."], ["Ryan D.", "I rarely ever write reviews, but the Manship boasts amazing food mixed with great service. I tried the calamari (excellent tomato sauce) had the hanger steak with grits. Everything about this meal was perfect. The chef has opted to avoid superfluous amounts of sauces and veiling ingredients and has chosen to instead perfect the meats with basic seasonings. The entree sizes are perfect and the wide variety of addon side items allow for dozens of combinations. The atmosphere is also excellent and the staff is top notch. This is something Jackson has needed.Update: noticed that I had $20 tacked on to my final bill without any knowledge of why only to realize it was their corking fee. FYI"], ["Betty D.", "Great ambiance, great service, great food. Fully loaded bar with lots to choose from. I've been on the hunt to find the perfect fries in Jackson, and my hunt has come to an end. Duck Leg Confit was also crispy and amazing. Highly recommended!"], ["Tiffany L.", "Great atmosphere inside.  Menu is kind of limited.  I had a tuna panini and it was good. The roasted brussels sprouts were the best part."]], "Olive Garden Italian Restaurant": [["John S.", "This is a pretty good location.... The food is hot, fresh and tastes good...The service is pretty good here... Our order comes quickly and we hardly have to wait....Everyone is very friendly and polite... If you come on a weekend you'll have a longer wait..."], ["Donna H.", "First you have to realize this is American food with Italian flair.  Joy our server provided exceptional service.  The giant rigatoni with three meat sauce was delicious, there was spiciness the menu didn't warn about.  I like spice and it was the best thing I have had at Olive Garden, since they eliminated the sausage and peppers rustics.  The baked tilapia was cooked just right and was hot even with the last bite.  The salad was fresh today, as were the bread sticks.   Best meal here in awhile!  Best service ever!"], ["Amy S.", "It's an Olive Garden, so I don't really need to talk about the food.  You should know what to expect.  With that being said, our food orders have always arrived hot and in a timely fashion.  We've experienced excellent, attentive, friendly service each time we've been here.  The berry sangria is nice and refreshing; we tend to always order a pitcher.  The restaurant is clean and well-maintained.  As with most chain restaurants of this type, there's generally a 20-30 minute wait if it's a Friday or Saturday night, but that's expected and not something I complain about.In my opinion, this is one of the better Olive Garden Restaurants."], ["A K.", "This restaurant has had much improvement.  Had not been there in over a year because of poor service and mediocre food, how things have changed! I must first say that we were met at the door with a waitress with a smile (Asia) who took us right to our table. She was pleasant and made us feel as if it was a pleasure to serve us. We just wanted soup and salad and she brought a great salad and bread then returned with hot soup that we enjoyed very much. This was so much improved we complemented the manager (Andrew) and said because of this improvement we will be  back. Give them a try, things are looking better for this restaurant."], ["A C.", "I was greeted upon entering. Hostess was very friendly and served well. Good food, changed menu."], ["Chaitanya K.", "I avoid going to chains but was forced while working late and Olive Garden was one of the few that I found that had its kitchen open till 10 PM. I wish I had looked longer and found something better. Firstly, I don't what it is but the place smells funny. Ordered the garlic rosemary chicken which felt like eating premade frozen food. I won't be back."], ["Bob M.", "See tip - greeting staff were great!  Food was okay, the waiter was bad - did not keep table serviced properly. Refilled drinks when we were done eating."], ["Jenniffer H.", "I have not been here in a while so today the fiance and i decided we wanted italian. We arrived to find out we had a wait, which is ok by me as long as I can sit at the bar and have a drink. So I'm sitting, and sitting. One bartender, two bartender, a manager ... none even acknowledge us. They walk past us like we are not even there. Finally my fiance walks up to one of them and asks if we can please place a drink order. About that time our thing is going off. Now we are at our table. I have my bottle of wine almost on my second glass ... no salad no bread (been sitting here for about 15 minutes) I hope the food is spectacular if not I WILL NEVER BE BACK AGAIN!!!"], ["Melissa E.", "I have eaten at this location many times around four years ago and I loved it! However it seems times have changed. My boyfriend and I went to eat here, and I was disappointed. We waited 20 minutes before our server even showed up to get our drink order. He brought out the salad and breadsticks right after taking our order, but the breadsticks were cold and hard as a rock! We were eating around 3 in the afternoon and it took 45 minutes to get our food. The food was good when we got it, but as soon as we got it the server dropped off our checked and hounded us while we were trying to eat to pay. Over all not a good experience at all!"], ["Lee H.", "We waited 20 minutes to be seated, but that wasn't too bad for a busy lunchtime. Having looked at the menu while we waited, we ordered our meals as soon as we sat down. It still took a long while for the entrees to come. The food was good, and just what you expect from Olive Garden. It was a pleasant lunch, enjoyed by all, but the slow service keeps this restaurant off my favorites list."], ["N J.", "Take-out: promised 25-30 minute ready time for food, and ended up taking an hour to get ready.  They flat out forgot the order...since I am just visiting Jackson, I will be never going there again anyways."]], "Biaggi's Ristorante Italiano": [["Shari C.", "Loved the soup of the day. Italian Sausage and Potato. (Tastes a lot like Olive Gardens \" Zuppa Toscano\".)"], ["Matt H.", "As a general review after several visits, the food is good, not great. The service has been...OK, but not good.The atmosphere gives the impression that you will be having a really special dining experience. The price would lead you to expect that you will be having a really special dining experience. Even the way they package left-overs in these fancy little boxes gives the impression that you are at a high-end restaurant.Let me be clear, I don't mind paying a great deal of money for a fabulous dining experience. However, for the prices here (which I consider to be the high side of moderate) I expect food and service that is a bit better. I don't expect 5-star food and service, but better than somewhere like Applebee's. On our latest visit, we ordered the Jumbo Lump Crab Cakes appetizer. They seemed to be under cooked and the consistency was off. I had the Lobster Fettuccine and as another reviewer posted, \"the sauce was like milk both in consistency and taste. That rich flavorful Alfredo that normally comes with it was watered down or made improperly.\" I can't find it on the menu, so it may have been a special. It was good, not great. There was very little seasoning to it and very little crab. The portion was large though.My wife's dish was so unmemorable that we cannot recall what she ordered. Obviously nothing particularly great or particularly bad. That really sums up our overall dining experiences here, not particularly great, but not particularly bad either. It is perfectly adequate. I probably only go here once every year to year and half and that is just about long enough to forget that I was a bit disappointed last time.  I think for the prices, it should be a bit better. There are better meals with better service to be had here in town for the same price. One Italian place in particular comes to mind, but I don't want to mention their name in the Biaggi's review."], ["Ryder T.", "It is a chain Italian restaurant. It is fine.Some other reviews have noted that sometimes they rely on too much sauce or cheese and too much salt. I'd definitely agree here. One particular instance was a salmon salad, nothing fancy, just a bit of salmon dropped on top of some mixed greens. The salad, however, had way too much olive oil and lemon juice. So much that it really interfered with the salmon.There are definitely some tasty dishes but nothing is going to blow you away here.The food is generally well prepared, however. The service is lovely and the price is not atrocious for lunch or dinner."], ["barb G.", "The lasagna noodles were so overcooked, they look and taste almost like mush. They can do better."], ["Doug B.", "This is a small chain in with locations in random (mostly affluent-ish) suburbs.   Open view of kitchen.  We had great service here.After trying samples of the soups, chose the Chicken Florentine soup.  Bread was very good.  Enjoyed the subtle flavors in olive oil.   Chicken Marsala was very good.  Chicken Park was huge.  12 desserts to choose from."], ["Brandon T.", "Biaggi's is my favorite restaurant in Madison. Their half pasta option is available all day and are the perfect size and price for lunch and dinner. During lunch, they also offer a pasta and salad lunch combination which is pretty affordable. My favorite dishes are the Squid Ink Pasta dish or the Bolognese dish. The environment is very impressive with a very open floor plan."], ["Jennie B.", "10/05/14 This is our fave place to eat however today we felt like we were eating in a completely different restaurant. This review is atypical of my previous experiences but it was so horrible it is worth voicing!The service: The waiter just didn't give us the attention like we mattered. He wasn't that busy, but even when he did come to our table he didn't ask or offer anything outside of taking our order. The manager was young, not-confident, lacking genuine concern for customer satisfaction and again didn't ask or offer us anything outside of fixing our problem bass on our suggestion. The chef and or cooks had to have been short cutting because everything was horrible!The food: My entree was the Lobster Fettuccine and not only was the lobster still blue but the sauce was like milk both in consistency and taste. That rich flavorful Alfredo that normally comes with it was watered down or made improperly. The manager brought me my bowl, and it was incredibly obvious as the liquids sauce sloshed around that it wasn't right. He should've never placed it in front of me.My brother's ravioli was over cooked and under salted. The filling was mostly gone and the pasta was a hardened yellow color. The manager did offer to replace my entire, so I ordered the Beet, Goat cheese and Arugula salad. My brother had finished eating by the time they got it to me so it was not comfortable with him having to wait for me. There was some in identified ingredients in the salad and the arugula salad was not only old and rotting but the tough core of the Arugula was not chopped ours.My brother and I were in shock.  They messed up 3 dishes. They offered free dessert and we turned it down. Free or not we wanted to get out of there first because I was starving a needed to get food somewhere else and 2nd because we couldn't trust them to remake anything.It's clear based on this incredibly horrific experience that the chef and cooks, manager and server cared nothing about the quality of our food or experience.I only hope they can redeem themselves, they'll only get one chance from me if I work up the guts to take the risk. It was our favorite place and just a few months ago we went once a week and now I'm not planning on returning anytime soon."], ["Allen T.", "Food quality and flavor is not good. Service is average.  Location is good.  I would not recommend this place. Much better options in the surrounding areas."], ["Michael D.", "HORRIBLE. Potential good time gone bad. The food was cold, our ticket was wrong, and the server kept copping an attitude. As I'm writing this, I've waited 45 minutes to leave. Get your team together and get on the same page. I will not be back. - EDIT: The bald waiter was horrible, almost seemed drugged out. On a positive note, Heather was wonderful and very pleasant."], ["Richard L.", "Popped in on a cold rainy day for a friend's birthday shindig, and it was all I expected, great food, great service. I got the 4 cheese ravioli, it was dangerously cheesy, but perhaps my palate isn't as sophisticated but it just tasted like 1 cheese ravioli extraordinaire with heavy cream sauce. A colleague mentioned it was a chain, which I found surprising as it had that boutique feel. It's a great place for families and parties as tables and booths can accommodate quite a large number of people. I'll definitely be coming back."], ["Ashley W.", "This place is amazing !!! From the outside appearance, to the wait time (5mins), to thee food, atmosphere and ambiance. I tried the lobster & crab pasta, that's wrapped in spinach, (I forgot he actual plate name). But it was beyond delicious. I requested for it to be made pasta, which they did not, but it was Sooo worth it! I've never had anything Soo spectacular. I adore this place! I do intend to return."], ["Eric F.", "Good service. Disappointed in adult entrees. Kids pizza and apps were best things we had."], ["Lisa W.", "Gets 5 mostly because it is excellent considering it's a chain . Very few have this consistent quality of food and service which is why I prefer to avoid most chains. Menu always has some original creations, servers area always accommodating to tastes."], ["Latoya S.", "First time here and the food was great! Atmosphere is very nice and romantic like. The inside is beautiful. Felt like I was fine dining. The waiters were awesome and very professional. I had the chicken pietra and I was concern about the honey mustard sauce in it. But once I got it and taste it. The sauce is awesome! I would definitely come back again. The alcoholic beverage I got was Sicilian margherita. It was LOVELY!!"], ["Cynara S.", "What's happened to my Biaggis? I am sincerely hoping this was an off night but it was bad enough to prompt this update.  Update sounds deceiving as if they'd risen.  Oh no,  far from it.  Last Tuesday night...they fell...Fell flat on their face with a splat.  The manager did his best to apologize but alas the damage was done. Wait staff and service was still very good but somebody needs to kick some tail in the kitchen.  A gracious waiter and apologetic. manager can't overcome poorly prepared food.  Faster is not always better.  I hesitated to update this review but I gotta rep of telling the truth.  You can believe me when I say it's great...Cuz I also tell ya when it ain't.  ya know?"], ["Chris M.", "My experience wasn't great. Our server seemed VERY new, and the manager wasn't much better: I wasn't informed that they were out of tuna until everyone else's food was almost ready. When asked if my new order (tilapia) would come out at the same time, we were told \"Obviously not, I haven't put it in yet.\" I waited an additional 15 minutes for my food, and when it came it was under cooked (it is somewhat difficult to under cook Tilapia). I sent it back and they made an additional order for me, to go. I ended up eating a caesar side salad and bread service for dinner. Ultimately I received my meal for free, which is fine, what bugged me was when the manager informed me that \"This should make you happy.\"Biaggi's is a chain, Italian restaurant. And you get exactly what you would expect from that experience. Flavors are very rich, too rich at times (caesar salad, breaded tilapia). Flavors are somewhat confused (see bread service including olive oil & kraft parmesan cheese product for dipping).I won't be back, my poor experience aside, Olive Garden food is better."], ["Stacy K.", "We have enjoyed eating at biaggis  for years and we have never been disappointed with the food, until now. We were aware that the restaurant was under new management, but we decided to give it a try. It was absolutely terrible. My husband and I decided to split the \"special\", pasta with gargonzola sauce and grilled chicken. Kraft Mac and cheese would have tasted better than our meal. Chewy noodles, chicken cubes, and salty bacon, along with a processed cheese sauce made up this \"special\". No garnish, color, or vegetables to be seen on our plate. The only reason we didn't complain was because our manager seemed overwhelmed as he followed his employees into the bathroom (a steady stream of kitchen staff and waitstaff kept going into the bathroom. To say we're disappointed is any understatement. Wow, we will never go back."], ["Tuesday F.", "Biaggi's was always a favorite of mine. However, this last visit was disappointing. The quality and portions have changed dramatically. Including my favorite, terimasu."], ["J.E. B.", "I've only been here twice, but it is my go-to place when passing through the Jackson area. I'm not a fan of chain restaurants, and I probably would not have went here the first time had I not been with a group, but it surpassed my expectations in every way. It damn sure ain't no Olive Garden or Carrabba's. It's also in a pretty nice part of town (there's a Rolex dealer next door, and a Brooks Brothers within walking distance).During my last visit, I sat at the bar with my girlfriend. The bartender, whose name escapes me at the moment, was awesome. He was a young guy, late twenties, and I believe he had recently graduated from nursing school. This guy is a rock star at what he does; very personable and a good conversationalist. If I'm not familiar with the menu and I get the feeling that my server has similar tastes, I'll hit them up for suggestions. Everything he recommended was great. First we tried a peach on prosciutto appetizer. Peaches on cured ham sounds crazy, right? It was da BOMB! My girlfriend and I shared an entree: baked ziti. I'm not a big pasta guy, but I enjoyed it.The app and entree were great, but honestly, the real reason I came here was for dessert. So diabetes runs in my family, but YOLO. I love bread pudding. If a restaurant has it on the menu, I'm ordering it. I had it both times I've dined here. The first time, I had their standard white chocolate bread pudding. It's so good, I don't even know where to begin. It's like jumping off of Mount Everest wearing a wingsuit, while Jimmy Page plays a thirty minute extended version of the Stairway to Heaven guitar solo. IN YOUR MOUTH. Hands down the best I've ever had. The bartender recommended I try the bread pudding bomboloni, which was basically flash fried pieces of bread pudding with rum sauce and vanilla ice cream, sprinkled with cinnamon and brown sugar (if I recall correctly). IT.WAS.AMAZING.. Like Zeus himself came down from Olympus and shot a sugary lightning bolt in my mouth. If i lived near this place, I'd probably dessert here every day. And when I had to have my leg amputated below the knee because of diabetic necrosis, I wouldn't even be mad."], ["Ieisha E.", "I have no complaints. This is a great restaurant. The food always tastes good. The presentation always looks great. I have visited quite a few times and my favorite so far is the lasagna bologanise . (I know I spelled it wrong but close enough). I have yet to try any of the deserts. Overall this place has a great staff,food, and atmosphere."], ["Cindy M.", "A friend and myself met at Biaggi's yesterday for lunch.  This being my first time dining there.  We were seated quickly in a booth.  Our waitress showed right up and took our drink orders and brought bread and butter, which looked wonderful, however neither of us had any since we are watching what we are eating.  Our waitress answered all our questions about the menu and took our order and kindly removed the bread and butter temptation.  I had the Oven-Roasted Talapia and my friend had the Dijon Crusted Salmon both are on the Lighter Side of the Menu section.  They were really good, I would order mine again.  While we ate and visited our waitress checked on us several times and a gentleman, I'm assuming he was the manager.  We really enjoyed the food, the service and after eating sat at our table chatting for at least another hour.  It is what I always describe as a day well spent and I'm glad we chose to meet for lunch at Biaggi's."], ["Shanon S.", "Been twice and loved my meals both times!  Definitely recommend the Capellini de Mare and the Shrimp and Crab Cannelloni. The Mediterranean Salad was enough for an entree!  Will definitely be back."], ["Christopher S.", "Very good restaurant.The staff care, and go out of their way to make things right.  The bartenders are friendly, and suggest their own cocktails.They will make you anything you want, off the menu. Incredibly fresh!!!!Great specials, and very fresh tasting food.  You would forget that this is a chain restaurant, and a great find in Ridgeland!"], ["Michelle F.", "Completely satisfied! Food and service was fabulous. We had stuffed mushrooms for an appetizer. I'm not a big fan of mushrooms but this appetizer was phenomenal. We have eaten here several times and have always had great service and food in a timely manner. Baked Penne Sardi and Lasagna Bolognese are a few of our favorites."], ["Daniel L.", "This was a nice business lunch place. Lunch is hard to do right - it is either overwhelmingly pretentious and you feel like you need a tuxedo to be at the table, or it is something cheap and sloppy. Biaggi manages to find the happy medium and offer it up in a well decorated, relaxing, but still very nice and formal business casual place. The waitress was very nice and kept refilling teas and water, which is always an important part of any meal. I went with the half and half lunch special - half of a Caesar salad, half of the chicken piccante pizza. The salad was laughably small, just funny how small it was. The pizza was overwhelmingly large - I eat a lot and I could not finish it. The pizza was amazeballs though.The chicken piccante pizza is spicy grilled chicken, smoked bacon, leeks, Montchevre goat cheese, on Italian cheese. Yummy, delicious, amazing. Everything blended together well and the goat cheese finish was just impressive. Strong, lots of flavor, I can't help but thinking about it and wanting it again. It was that good.You should really think about the chicken piccante pizza. The salad won't fill you up, but the pizza will."], ["Coral E.", "Love Biaggi's.  Have always had fantastic service, really great food and you can't beat the bread they bring you.  Actually....the cocktails are pretty darn good too!  Yes, it can be a little loud and crowded - but that's because it's good!"], ["Letty E.", "Blah. The most generic, flavorless Italian food. Lasagna tasted frozen. Not one ounce of love in that food."], ["Cameron Y.", "After a long weekend in the Jackson area I needed a nice comforting meal before heading to the airport. I was staying at the Hyatt in this same shopping center so I decided to give this place a try.I was immediately excited when I saw the combo options of soup/salad or salad/pasta, so I tried the wedge salad and the butternut squash ravioli. The wedge was just as I was craving. Pretty standard. The ravioli was not at all what I was expecting. It was in a very light olive oil and butter sauce with large pieces of walnut and small cubes of squash. The cubes of squash tasted like nothing, and the walnuts added texture, but took away from the spices used in the butternut squash filling.This place kind of has an Olive Garden feel to it, and sadly, I prefer Olive Garden..."], ["Kris A.", "I eat here about once a year when I visit Jackson. Every time we order the mussels because they are AMAZING! I have never eaten anything similar. We asked for the recipe and it was so long I said forget it, Ill just have to order two orders for an app and so that's what we do now. I like the lobster pasta and the squid ink linguine doesn't bother me like other reviewers, I think it gives it a unique touch. All of the desserts are good and it has a nice atmosphere too."], ["JAN k.", "We had a GREAT meal and a GREAT time. Ask for Brian as a server. He added so much to our meal. Wedge salad with blue cheese dressing. Delicious. I had tube pasta with red sauce and Sausage. It came with a scoop of goat cheese on top. I scooped off the cheese and  used the spread on my bread and it was devine. Hubby had the garlic shrimp dish with the spaghetti in the middle of the plate and nearly licked the plate. Dessert was apple thing with a butterscotch sauce substitute and a scoop of Ice Cream. BTW share the salads and order a half order of pasta it you are a small eater or like bread dipped in oil. DEFINETLY ask for BRIAN! Will return the next trip to Jackson. Price was appropriate."], ["Joshua S.", "The atmosphere is great for dinner for two or for large groups.  It isn't a very kid friendly restaurant though, but that's not because of the restaurant, simply because of the typical crowd you'll find there.Overall the food is at best average.  The selection isn't very good, and a lot of the meals taste very plain.  When I think of Italian food, \"plain\" isn't what usually comes to mind, but unfortunately that is what I've found at Biaggi's.  If I'm with a group and they want to go there, it isn't so bad that I refuse, but it isn't a restaurant I ever suggest. It isn't terrible, and worth a shot if you want to try it out, but I don't highly recommend it."], ["Scot D.", "Thoroughly enjoyed this stop on our way back home. I felt the staff was very friendly and enjoyed the atmosphere. I loved the bread and Stromboli. The pizza was good, not the best I've had, but I still enjoyed it. Would definitely go back if the opportunity presented itself."], ["Michael H.", "Biaggis. What can I say? The food was pretty good - butternut squash risotto. They can use some work on the drinks; my advice is not to have a drink containing St. Germaine on the menu if you're unable to get it. I, instead, had a sidecar and a capherinia.There were 14 of us and the hostress would not allow us to sit until the entire party had arrived. Strike one.To make a long story short, a little before 7 the manager came out and tried to get us to leave, stating the table had been booked for a 7:15 reservation. Two of our party had shown up late (the reservation was for 5:15 but that should not matter - and they would not accommodate them because of the lateness; i.e get them a chair. They then had a audacity to stick a gratuity on the bill (which I can see because of the party) but if you really stick it to your patrons you should remove a gratuity. Strike two.The manager kept saying that, in no way, was he asking us to leave. In my book, if someone tells me that my table has been reserved - and I'm waiting for my dessert - then you are essentially asking me to leave. Strike three.The waitress was apologetic - until the end. She even began crying. When she came back with the receipts, she threw mine down on the table - and I'd been nice and not said a word to her. However, one guy in our party commented that we'd be going somewhere else next time. The waitress, in passing, said 'Please' in a voice loud enough for us to hear.I won't be going back."], ["Joe M.", "The entrees were decent and the portions were reasonable. The ambiance was nice (we sat in front of the brick oven).   The dessert was ok to say the least. Tiramisu was too soggy and wet. The banana foster was disappointing. The waiter appeared to be new (a rookie).  The hostess was nice."], ["Darius M.", "This review is almost two months late, but I would be remiss if I didn't take the chance to leave a positive review about my visit.This was my second visit to Biaggi's and I must say that it was a better experience than I remember the first time.  The first visit wasn't bad by any means, but it just seemed like this visit was far superior to it.This visit was on a Friday night, so it was extremely packed; about a 30-45 minute wait.  Our waiter, a very enthusiastic gentleman named Brian, was phenomenal.  He made sure that the specials were thoroughly explained and was exceptional when it came to taking care of our needs.  My dinner companion started to get a little perturbed and stated that his attention was a little much; borderline stalker. LOLThe food was great.  We had an appetizer that everyone on the staff called the \"best appetizer on the menu\" named Shrimp and Crab Arancini. While it was good, I think there may have been better selections.  But that just leaves an opportunity for me to go back and try them all.  The entrees were great.  My dinner companion had the Sea Bass and I had a pork and pasta that was a special that night.  The flavors for both were great.Then came the finally of the evening; a good desert.  I ordered the cheesecake and my friend ordered the Torta Cioccolata.  The cheesecake wasn't the best I'd ever had, but it was pretty darn good and the Torta was as much chocolate as any one person could ever want.All in all, this was a very nice experience.  I've read a couple of other reviews that bashed the place, but I can't see why.  Maybe they need to go back and ask for Brian as their waiter.  No way you can have a dull experience with him."], ["Lawrence Z.", "This was the worst culinary experience in Jackson, Mississippi.Everything was so mediocre.  You are definitely paying a premium for the decor and location.Food was terrible.  Service was mediocre.  Ambiance was mediocre.The lamb chops were undercooked and closer to raw--my girlfriend and I don't get food poisoning!"], ["Annica J.", "Everything that we have had here has been very good."], ["Alli B.", "Big portions and tons of variety for everyone.  Can accommodate large groups."], ["Allen G.", "Great for lunch. Quick service and you can't beat the Pasta & Salad meal."], ["Marci W.", "Went to Biaggi's years ago in Champaign, IL so I was excited to try it again. I took the waiter's advice and got the ZITI AL FORNO and loved it. My MIL decided on the filet mignon salad and enjoyed it as well. Jason was an exceptional waiter. Look forward to returning."], ["stephen c.", "Everything I've had is good. Zetti Forno is probably my favorite, but I tend to not stray from what I know when it comes to Italian."], ["Author Sandra L.", "I've eaten at Biaggi's 3 times and I have been very pleased with the service. My first time eating at Biaggi's was for an NP Nite Out and the food as well as the service was top notch. I have taken my family there on 2 other occasions and they love it too! The atmosphere is relaxing and the waiters are always ready to provide whatever the customer needs. Two thumbs up!"], ["Skip R.", "One of the finer places in the Madison-Ridgeland area. Biaggi's is in a super nice part of town and the atmosphere is lovely. The basket of different varieties of bread is very, very good. The simple table side made condiment of olive oil, pepper, and Parmigiano Reggiano cheese is so good.  I can tell you the calamari is always fresh and seasoned nicely. I have had several of the pastas and all were good. However, there is a clear star of the show here. It is the fettuccini with lobster. The pasta is made with squid ink, so it is black. It is tossed with mushrooms, herbs, and huge chunks of lobster meat. It is finished in a delicious cream sauce. Don't forget to get an extra basket of bread. You won't want to leave any of the sauce in the bowl. I get this almost every time I have the pleasure of dining here. I think you will enjoy Biaggi's. Give it a try the next time you find yourself in town."]], "Amerigo": [["Craig T.", "Five stars for the cheese fritters alone.  I can make a complete meal from that particular appetizer.  If I was stranded on a deserted island and could only take one appetizer with me, it would definitely be the cheese fritters from Amerigos. There are plenty of other tasty dishes here - the Arugula with Flame-Grilled Apples salad made me do a complete 360 on the value of arugula; the pasta dishes are wonderful; the pizza is an unsung and under appreciated hero in the Jackson pizza world; the tiramisu is still my favorite in the area; the wine selection is great; the specials are always on point.  And everything is reasonably priced.Amerigos will also always occupy a warm spot in my heart.  It was the setting for my first date with my sweetie.  We dined there the evening we got married.  We actually met George Clooney in the bar of Amerigos that night.  (He was in town filming O Brother, Where Art Thou.) He was sitting at the bar with a baseball cap slung low over his brow trying not to attract attention and at the same time attracting a lot of attention form a gaggle of girls at the other end of the bar.  My bride's grandmother was dining with us and was just about to have a fit to meet Clooney so my wife figured \"why not\"?She took her grandmother to the bar and told Clooney that she had just gotten married and her grandmother was there and wanted to meet him.  He was very gracious and wished my wife and I a warm congratulations, took her grandmother's hand and said how nice it was to meet her.  Her grandmother slowly walked away and made it to the other end of the bar before squealing, \"I'm never going to wash my hand ever again!\"Of course I reduced the whole story later on to this:\"Yeah, my wife met George Clooney on our wedding night but she went home with me!\""], ["John A.", "This place is a favorite.  Every time I come to Jackson!!!Artichoke dip (huge chunks of artichoke). Smoked chicken ravioli.  Tiramisu."], ["Sarah T.", "This place is seriously the best! Early bird specials cannot be missed. This place makes my ALL TIME favorite dish ever! It's the salmon with black bean and corn salsa that will literally take you to paradise. I could seriously eat four of these and I totally would. The house wines are delicious and it's probably one of the coolest date spots nearby. It feels like you could be in Italy. We always go here for our family events or celebrations. It's great for groups and even kids. You won't meet a rude or unhelpful employee here, so nothing will make it a bad experience! Trust me :)"], ["Alicia J.", "I'm not going to act like I'm an authority on Italian food. I live in a culinary city with a weird lack of anything that isn't chain Italian or super high end Italian, so I've really only tangoed with what friends and family have made.But Amerigo really hit the spot after 12 hours of driving with a dog breathing down my neck. I got the house-smoked duck and sausage pasta, which rekindled my love of anything on a bed of angel hair pasta. My handsome date got the lasagna, which was so delightfully cheesy and garlicky and lasagna-y. Amerigo and their surprisingly good house wine was everything we needed and I'd go back in a heartbeat."], ["Carter P.", "We stopped in for a family dinner (11 of us) on an extremely busy Sunday night.  They had a table for us about 45 minutes later and the server was very friendly.  She had worked very hard to make sure all of us were taken care of, which was an impressive feat.The recipes are good and what I remember them having from visiting several years ago.  It would be nice too, though if they brought a few of the edgier dishes popular in New Orleans Italian to Amerigo's.  We had dishes which were mostly parm cream sauce based and I personally had salmon with spinach and green beans.  The food was good, but not a lot of variety across the menu.When they delivered the food, they made sure to bring it out at once.  While this seems in good taste, it did create two issues for us.  For those who ordered simpler to prepare (and flavorful) dishes - their plates came out extremely hot.  Maybe due to sitting under heat lamps waiting for the other  (longer to make) dishes.  Also, the two young boys with us (who had waited 45 mins in a restaurant to eat) were served spaghetti with red sauce at the same time as the adults - about 1.5 hours after arriving.  This was great for selling wine to adults but led to children wining as well from hunger.Great staff, suggest adding more adventurous Italian entrees and bringing each person's order out as its ready (instead of sitting under heat lamps) - with more focus on ensuring kids are fed first."], ["Ian M.", "My wife and I came here for New Years Eve.  I always forget how incredible this place is.  The wait was about 45 minutes which seemed a little long but then it is a very popular place.The wait staff was very attentive and friendly.  The atmosphere was warm and very comfortable.  I had the Filet, butterflied (sp), with blue cheese.  It comes served with fettuccine alfredo.  I requested the asparagus instead of the green beans.  It was as tender a steak as I had ever had.  Which is great but the steak was served without the blue cheese.  I didn't want to make my wife wait to eat so I requested a side of cheese.  Also, the asparagus did not come out with my meal.  The beans did.  It took a while to get the asparagus to the table and when it did arrive it was incredibly salty and there were only 8 skinny stalks.The reason for the 4 stars instead of 3 is because the food that was served was amazing.  The wait staff was very efficient and friendly.  It just seems like there might be an issue in the kitchen."], ["Pete F.", "Hands down one of the best tiramisu in Mississippi. It's well worth the wait during the weekend, but if dessert is all your craving, order it to-go!"], ["Crystal S.", "I've never ever had a bad experience at this place! 5 stars don't come cheap! This quickly became my favorite place when we move to Ridgeland, ms a few months ago.  The place is small but wow the food is amazing.. They are always packed! And it's not just the entrees, the desserts are amazing! The key lime pie, literally melts in your mouth! My 6 yr old even loves this place. Delicious Italian food from scratch and you can tell!"], ["John C.", "Awesome Food.  I had the ribeye.  My wife had the lasagna, and the kids had the pizza.  All of us loved it.  Hard to satisfy my family."], ["Rachel M.", "Grew up near Jackson but went to visit family for the weekend and finally got to try Amerigo's. It has an upscale feel to it and the food is great! The server kept our drinks filled and got our food to us so fast!"], ["Kelson L.", "Amerigo is an upscale Italian restaurant. I went there for dinner 2 friends. The inside is a little darker than I would like. The other thing was that the tables were really close together. Other than that, a nice atmosphere.Our server was cheerful and quickly offered us drinks before rattling off the specials. I almost went with the salmon she mentioned but ended up ordering the ribeye despite it being an Italian restaurant with a plethora of pasta. My choice didn't disappoint as the portions I received were very generous. My only qualm was the beans were pretty salty.  I didn't get dessert personally but my 2 friends both got the tiramisu.  I tried some of it and it was very tasty. I think the portion of that is a bit much for a single person so splitting it between people is probably the best idea if you choose to get it."], ["Latoya S.", "First time being here and I came on a Sunday. It was busy with a 39 min wait. The staff was very friendly. I ordered the chesse critters as an appetizer. If you love cheese, this is the appetizer to get. It is a big cheese ball. You can order the small or large portion. I got the small which include 3 of them. Also the critters are fried! For my entree, I ordered  the chicken piccala. It was GREAT! For dessert I ordered the tamasla... Which is awesome too! I will return!!!"], ["Coral E.", "One of my favorite places to go for dinner (but go early, it's not just popular with me)!A local Italian food chain, the Amerigo's in Ridgeland boasts some of the best service around.  The cheese fritters and artichoke dip are musts for appetizers.  For dinner I just can't seem to get away from the Crawfish Pasta, Goat Cheese Penne with Shrimp or one of their pizzas.  I've never had anything I didn't like, and neither has anyone I've been with.  They also do great tasting menu events throughout the year that are super fun and super delicious!"], ["Gigi C.", "The service has always been good, but I don't go to Amerigo's anymore since I adopted a vegan lifestyle. I really wish they would consider adding some real vegan options to the menu. I'm not talking about a bunch of sides thrown together or a bland penne with tomatoes and onions. A real meal. If they did, I would go back to being a regular."], ["Kenneth C.", "Not Impressed. This place is popular and I can't understand why except that there aren't really many choices for Italian in the Jackson area other than Cerami's and Bravo (very good). The service is usually good but the food is below average for Italian. We have eaten here with friends several times and the pasta has always been very mushy. The Tira Misu is very good though."], ["Stephanie K.", "This place was awesome! The service was prompt, the food was delicious, and the prices were very reasonable. It was a fantastic experience!"], ["Doug B.", "After a meal that didn't live up to the great reputation Amerigos has in the community, our waiter and the manager rectified the situation by providing dessert. Nice ambiance and Now the highlight of the meal was the tiramisu. Very good dessert with the sauces. It deserves the four stars by itself. Will definitely return for another try."], ["Brittany S.", "I went with 5 other ladies while in Jackson for training. They were almost full at 6 on a Monday night and the tables are pretty close together... We all enjoyed our food for the most part. I got a small order of cheese fritters. I really didn't care for them, but every one else at the table seemed to like them. Our waiter was very nice and handsome,  which made the fact that the service was slow slightly less annoying :)."], ["Newly P.", "No sure why there's all the fuss about this place. On the one and only visit I paid to Amerigo, I ordered the pizza and salad combo and came away underwhelmed. I thought my Italian pizza--thin crust with very little topping--was lacklustre. The bread with olive oil dipping was good though. I do agree with other reviewers who say this is a place for old Italian ladies to see and be seen. The steady stream of diners continued while we ate, and people were coming in even as we were leaving an hour later. For me though, it's just another restaurant crossed off my list of \"Things to do in Jackson.\""], ["Simi C.", "Perfect spot in Jackson for a romantic dinner with your sweetheart or a celebration dinner with family! The parking lot is always crowded, even on weeknights, which is rather indicative of their popularity amongst locals. Once inside, the bar area is usually flowing nicely with guests grabbing a drink during their wait or with those finishing up their meal and offering seats to those waiting. I've dined at the bar once with my hunny and the service was impeccable. We had the most attentive bar tender who even offered to give us a smaller portion of the carne pizza (I forget the exact name) since we wanted something to snack on with our drinks; for dinner, he had our pasta dish nicely split into two bowls. Absolutely delightful. When a regular guest complained about the pasta, the same bartender had the meal removed from his bill. I have also dined at a table a few times and while the service has been good there, as well, I'd have to say my experience at the bar has been the best one yet at Amerigo.On to food, if you don't like Italian, you're not totally out of luck. The pizzas are delicious and I'm sure you could find a few other appetizers to suit the non-Italian seeking palate. I, for one, love all things carb, and I have yet to be displeased with a dish. I always swap out the marinara sauce for alfredo (hi calories!!) so they can easily handle such substitutions. My hunny enjoys their steak and their soup of the day is always a nice starter, as well. Word of advice: On Valentine's Day, when the whole world wants to eat Italian, Amerigo's gets pretty crowded but you will eventually get a seat-- it's worth the wait in my opinion!"], ["Lei B.", "I had high hopes with this place but I just thought it was ok. I was lucky enough to have one of my coworkers join me for dinner. We ordered a small order fried eggplant appetizer with craw fish. I was so disappointed when they brought I out. It was two very thin slices of eggplant. After being breaded and fried you can't even taste the eggplant itself. The craw fish was good though but I don't think the sauce combined the two  items very well. My pasta was just ok. I forgot the name of it but it had peas, ham, mushrooms, and grilled salmon with fettuccine noodles in a cream sauce. The bowl was huge and overflowing! My coworker ordered the pork loin chop and it was served on a piece of smoked cedar wood. His dish was really good. Her cut me a piece and it was soo juicy and full of flavor.Their wine selection by the glass was pretty good. I ordered a Guntrum 2007 riesling, which our waitress recommended. I loved it. I had to remember it so I can find it later. Experience overall was nice. Our waitress was so sweet and very attentive. The only thing I regret was no ordering the tiramisu, since that's all the rave, but I was sooo stuffed! Oh well there will be other trips to Mississippi."], ["Hannah R.", "I was sadly underwhelmed by this place. I had heard so much about how it was the greatest italian restaurant in Jackson and worth the price tag. Some items I tried were spot on: the cheese fritters are AWESOME. Much better than fried mozz sticks. The calamari was good, hard to really screw that up in my opinion. The complimentary bread and olive oil was also pretty tasty. For my meal, I decided to order some pasta since I figured that would probably be an Italian restaurant's specialty. Man, I was disappointed. I got the tortellini with grilled chicken. First of all, the tortellini kind of tasted weird. Secondly, the chicken was about 1/4\" thick. No lie. I've never seen chicken breast that thin and unappealing. And it wasn't just my dish, others in the group that ordered pasta with chicken also had flat, dry, flavorless chicken. The place wasn't all bad - the service was very friendly. The atmosphere is pretty nice but as others have said, a little cramped. This definitely seems like an establishment for old housewives to frequent and be \"seen\" at. Definitely a bit of a snobby vibe but not overwhelmingly so. I would go back , the salads looked really good so I'd probably opt for that next time. I would be hesitant to recommend this place to someone looking for \"great\" Italian since I've had much better meals at even chain restaurants, but I really haven't tried many other Italian restaurants in Jackson so maybe Amerigo's mediocrity is considered good around here."], ["Nicole B.", "Sometimes the one star rating is just too much. The food was not prepared properly and the service was poor. If your looking for rich Italian food, this is not the place to go. The atmosphere is wonderful and the Teramasu was really good for not being prepared in house; however, for lunch it left me wanting more than just dessert and coffee."], ["Ieisha E.", "I live close by this restaurant. I always wondered why is it always so packed.?? I still wonder why . I visited this restaurant about a year ago. The service was pretty good. I ordered the crab cake for an appetizer and it taste good. My main dish was lasagna. I didn't really enjoy it at all. The taste was just not what I expected. It lacked quite a few ingredients or maybe just had the wrong ingredients. I guess I'm used to the perfect stouffers brand that I buy in the store but maybe I'll try again one day. There has to be some reason why they are always packed at night"], ["Eric L.", "One of my favorites in the Jackson area.  Delicious Italian food - haven't had anything that I didn't like.  Excellent service.  Full bar.  Dark, cozy atmosphere.  Great date night place.DO NOT LEAVE WITHOUT THE TIRAMISU.  Simply divine."], ["Amber J.", "AN IMPOSTOR!  A different version of TiramisuI was very excited to find chef made Tiramisu! But as with so many others, it was not authentic in any way.  Not really sure how they can call it Tiramisu and at an Italian restaurant....- it comes with two sauces? a chocolate and a white-both fine sauces but Tiramisu has no sauce other than the espresso the lady finger should be soaked in...- Couldn't taste the espresso at all- the marscapone layers were replaced w/a thick sweet cream cheese mixture- no lady fingers but a thick sheet cake- the cocoa dusting was barely reminiscent of a pinch.- $8 very disappointing...crushing actually.My search continues."], ["Trey F.", "Great choice. Better have reservations though."], ["Angel B.", "We had a WONDERFUL dinner tonight. I had the tortelini w/lump crab meat, spinach & spicy cream sauce. It was delish! My hubby had shrimp scampi w/lump crab meat (order extra for $4) w/white wine garlic butter sauce & his outta sight! The tiramisu is the best thing ever!! Our meal was $110 for 4 people. Service was prompt & friendly."], ["Matt M.", "Wonderful food! Ask for waiter , Josh! Also the butter crunch desert is the best desert in this world!!!"], ["Jennifer C.", "Awesome tiramisu!!! Come here for dessert. Best tiramisu ever. Sits on top of a bed of melted dark and white chocolate.Food is pretty good though. By far the best Italian restaurant in Jackson. Foccacia for dipping bread. for some reason, everywhere in jxn loves serving foccacia bread as an appetizer. it's ok. would prefer white baguette/italian toasted loaf. but works. whatever you do, save room for dessert.What to order:calamari - good light frymussels - ask for the bread to be toasted with out the garlic butter which is a little salty. but if you're craving mussels, i actually like bonefish grill better (for jxn)tortellini with crabmeat - very creamy, hearty and goodgoat cheese apple salad - nice to split with someone as a starter, you can make this at home thoughwhat is not that great:goat cheese pastaduck?/sausage? pasta"], ["hobo s.", "If the rest of my colleagues wanted to go back here, I would either go or not.  That pretty much sums it up.  Maybe I just ordered so-so items, but I wasn't impressed.  Crab cake appetizer was fine.  Pretty good even, but nothing crazy.Did I mention how a waitress took our order, then when she realized we weren't her table, instead of telling our waitress our drink order, she just let our waitress find out for herself?  Then our not-waitress tried to squeeze through two tables (ours and the next one) and knocked over my water.  Didn't splash us, but didn't move us either.  We helped move things so she could change the tablecloth (i.e. paper) and then didn't even get me another water.  There's more.  She then proceeded to squeeze through this same location throughout our meal.  I swear I didn't punch her.So, the entree..  Some grilled mixed veg (peppers, eggplant), I don't remember the fish, and some mashed potatoes, all served on the ceder plank that the fish was grilled on.  The potatoes were a bit too smooth, but everything was fine.  My problem was that by the time I got through most of the veg and some of the potatoes the fish was limp and not hot, nor crisp anywhere.  I don't want overcooked fish, and I know it is a delicate balance, but I shouldn't have to eat my fish the second it is set down in front of me to have it hot.  Anyway the food is fine, the atmosphere is a bit cramped and snobby.  While I would come back if necessary, I wouldn't make plans to come back.  I really hope that their pasta is amazing though.."], ["Lindsay B.", "My boyfriend and I were visiting out of state and needed a good Italian restaurant for carbo loading. I found this place on Yelp and made a reservation for 6:30p on Friday night.Unfortunately, my GPS guided us wrong. I called them up and got directions, eventually, from them. Ended up being 10 minutes late to the reservation. They didn't seat us for another 20 minutes after that. On top of that, they sat us facing the entire restaurant, with our backs to the walls. Made me feel very self conscience eating. It was a very packed place, with lots of seating but very small aisles.We ordered 2 different beers, one of them being Southern Pecan. That was great! Never had it before. We both ordered the same pasta dish, mine without chicken, his with. They were both good and a nice amount.Unfortunately, when we went to a bar afterwards we ordered the same Southern Pecan and it came to us as a different colour and taste. Not sure what happened there but we're pretty sure that the waiter brought us not Southern Pecan at the restaurant. We've been wondering what it was for a while now!The staff was very good and accommodating. Even asked if we wanted a second bread basket, which we very much enjoyed. Once we got our food though, we didn't seem much of them again. I have to assume that it was the night before a race so everyone was looking for an Italian restaurant for pasta, and that it was also Friday night.If we ever find ourselves back in Jackson again, we'll definitely go there!"], ["Randy L.", "Friends took us here. Nice atmosphere. Extensive menu. Coming from LA (that's not Louisiana), prices are reasonable.  Complimentary bread and herbed olive oil was very good.  I ordered the special cedar-planked salmon with crab.  It was very good.  Sauteed vegetables were very good. Asiago potatoes are off the hook.  My wife had the chicken Marsala.  It was very good, and a generous portion.  Our friends had the chicken Vesuvio, which was very good, and the veal lasagna.  I didn't try the lasagna, but he said that it was good.  Didn't have room for dessert.  Our server, Jennifer, was outstanding."], ["Lisa P.", "The best tiramisu I have ever had in my life, hands down. Great atmosphere and great food."], ["Margaret S.", "The best tiramisu in the world, served with two sauces: dark chocolate and a light custardy sauce. The. Best. Evar. Their key lime pie is also good, but the tiramisu is the star. You can also buy this by the pan, which lots of folks do at Christmas. They need advance warning for this, though.The food-food is good, too, though pricey. They have really, really good fettucini alfredo and lasagna (you can also buy this by the pan with advance warning, and they will actually make it in *your dish* if you take them one) as well as steaks and great fish. Good wine list and efficient staff. ALWAYS packed!"], ["Sonia C.", "I like this restaurant. The food is good quality and the service is excellent. They have the best bruschetta I've EVER had. I would definitely recommend ordering that. Some of the pasta dishes can be a but oily, but everything I've had has a good flavor. Good place!"], ["Brett S.", "I was visiting and went to this restaurant with relatives. First thing that gets your attention is the superb waiter service. They are true professionals. For dinner we started with the goat cheese salad (Superb) and followed by lasagna and Capellini pomodoro. This second choice was the best I have ever tasted with fresh hand cut tomatoes. While looking around I saw that others had ordered various steaks and over sized drinks. Coffee at the end of the meal came in very large cups that were mug sized. The one negative is that the place was slightly noisy so I would likely give this place 4 1/2 stars. Still a high rating for me."], ["Jordan I.", "I recently took my girlfriend here. There was a decent wait, but not more than expected for a Friday night. Our server was very polite, yet a little awkward at communication. The food was incredible. Previously I was a huge fan of Biaggi's, but this place is so much better. Both meals and the  appetizer were great! I highly recommend this restaurant. Will say it is a little loud though."], ["Buster B.", "Amerigo's is probably the best Italian restaurant in Jackson, and it's a great place to take your parents, to go on a date, or just out with friends. The lighting is kind of dim, so it's not really good for kids. The specials are usually your best bet, although the items on the menu are pretty good, too. The food is a little pricey, but the portions are pretty large. The staff are good and usually have good recommendations. Oh, and they also have some good vegetarian options.The tiramasu is amazing! Don't eat all of your dinner - save room for dessert!They take reservations, so be sure to call ahead because the wait for dinner on the weekends can be long."], ["Bart S.", "One of my favorite restaurants in the area.  Great food and service."], ["Terrianne B.", "We were just passing through Jackson and used YELP to find this place.  The salads were fresh and the house dressing impressive. The salmon was cooked perfectly and the asiago cheese mashed potatoes are to die for.  The canelloni was very good and the Imperial pasta was excellent.  The only complaint was that the bread was just plain at best."], ["Alivia T.", "If you visit this restaurant, be sure to get the cheese fritters! Absolutely fabulous appetizer. Dessert? The #1 dessert in the state, apple crumb cake, it's divine!"], ["Quincy S.", "Best Italian in the area.  The selection is great, the desserts are wonderful and the service is good.  Amerigo has been around for a long time and despite my many visits, I've never left disappointed.  Their lasagna is very good!  One of my favorite places to get it.  I rank it ahead of other Italian eateries like Olive Garden or Spaghetti Warehouse simply because the entire experience is very nice.  You'll enjoy the atmosphere and variety of foods on the menu."], ["Alli B.", "Very good food and service!  Gone a couple of times and everything my group has had was extremely good."], ["Alfred K.", "This restaurant came highly recommended by locals so I was excited to give it a try. The prices vary a bit - the seafood specials were over $25 and steaks over $35, but the pasta dishes were very reasonably priced around $10-$15. The food was okay - I was told to get the Lasagna which I did, and it was just okay for me. I personally like my lasagnas a little moist, but here it's so baked that the edges were chewy. Good if you like that, but it just wasn't what I was in the mood for. The dessert - tiramisu sitting on a pool of white and dark chocolate - was pretty good, but far from amazing. Considering it's what they're supposedly famous for, I was pleased but not exactly impressed. I guess I've just had better."], ["Gary A.", "I don't know what the hype about this place is all about. If you want ready awesome italian food don't waste your time here. Take a short drive to Cerami's across the Rez."]], "Pita Pit": [["LDeone K.", "The Lunch Spot Alert ! Fresh, Fast & HEALTHY Pitas Oh and the Smoothies are a refreshing treat too! Friendly staff, work well together !!"], ["Aaron Ray A.", "If you are looking for an alternative to fried greasy food and want something fresh this is it!   This place sparkles it is so clean and the staff is friendly and helpful.  I hope you enjoy it as much as did."], ["Melissa B.", "I love Pita Pit! I've had it numerous times and it's always delicious. The only negative was when I ordered online because I needed it delivered two hours in the future. When I received it, it was soggy and lukewarm, as if it had been sitting out for the two hours in advance. I'll try it again because I love Pita Pit for their delicious and non-greasy food, but I hope it'll be made fresh next time I need to place a future order!"], ["Molly P.", "I ordered the Chicken Souvlaki and it was delicious! Mine was to go, but the restaurant was so clean and inviting that I thought about just eating there. I love Pita Pit, and this was definitely the best experience I've had at one."]], "Keifer's Restaurant": [["Michelle C.", "Keifers in the old location was great when I was in high school in the Jackson Metropolitan and those memories paved the way to this trip to Keifers in the new location- they did not disappoint. The pita wraps are delicious!Service is fabulous! The porch is the perfect ambiance for this style cuisine!"], ["Richard L.", "A go to spot in the Belhaven area, it does a lot of things kinda well, no real stand outs. I usually get a wrap and the cottage fries. The fries are different quite often, which I brought up to a gentleman in the front whom I assumed gave a damn, but turned out he really couldn't care less. Anyway, I stopped going, and tried Jimmy John's across the street for the first time. Yeah, maybe I'll try Keifer's again."], ["Sarah T.", "I really like this place. It can be crowded at times, but it's a local favorite. The employees are so energetic and attentive and it's such a neat environment. The food is pretty good, but the hummus is amazing. I seriously eat like a whole plate by myself ever time. It's hard to go wrong on this menu. Go eat here and enjoy your Greek experience!"], ["Cody M.", "Keifer's is widely known as a Jackson staple. It's often the first restaurant people visit when in town as well. Since moving locations (only across the street), the atmosphere doesn't quite reach what it used to be, but the overall feel of the place is just as good, and probably cleaner and sharper. I've loved eating here my whole life, and have gotten just about every wrap on the menu, never finding one that I haven't liked. The feta sauce is a definite add on, adding bold flavor to a wrap or to the tasty cottage fries. Though not quite hitting the \"authentic Mediterranean\" mark, it's still very tasty and an awesome local restaurant!"], ["Erica A.", "Good was good. For lunch was a bit more than I usually pay. No kids menu options. Sliced potato was fantastic, service was fast and nice restaurant."], ["Cherry D.", "We got the gyro, hummus, dolmas, and falafel for about $26 total. It must have been an off day or something, because this place has such good reviews, but I was hella disappointed today. I did not like the flavors at all! The humus needed more garlic and lemon, and it was chunky! They should have blended the garbanzo beans a little longer. The falafel just tasted like it was deep fried in old oil. The gyro was dry. Greek food is my favorite and I'm sad that this place was such a disappointment."], ["Jennifer S.", "Usually a great place to eat, but must have been off their mark today. I ordered a Gyro with no onions, and shared a cottage fries with my husband. My Gyro was not warm and the meat was dry. There was a big old lettuce leaf stuffed in it gobbed with their cucumber dressing. I had to spoon out the dressing because it was just way, way to much. We sent the fries back because they had apparently been cooked an hour or so prior, waiting on the lunch crowd.  I don't know if this place is under new management  or not, definitely needed improvement today. Sorry Keifers!"], ["Tiffany Y.", "This is one of my favorite lunch spots when I visit my family in Jackson.  You order at the counter, and they call out to you to get your food.  Doesn't take them long to fix anything either.  I usually get the veggie wrap with mozzarella and their awesome curly fries.  My mother usually gets the chicken gyro, and my sister gets their burger.  The food is good and the atmosphere is pretty laid back with the food served on plastic trays with paper plates and drinks in styrofoam cups.  But it's a cool hole in the wall kinda place in downtown Jackson, I mean it's what Jackson is good for at times... hole in the wall places with good food.  Oh and they close at 2:30 so sometimes it's a challenge to get there before they close, but it's well worth it if you can make it for lunch."], ["Chaitanya K.", "I travel to Jackson almost every other week and lunching at Keifers makes it worth the long haul. My staple is the chicken gyro and curly fries. I have lost count of the number times I have eaten here in the past year but the food has always been consistently tasty. The seasoning on the curly fries is to die for. Only once have I tried the regular beef and lamb gyro but didn't find it as flavorful. Doesn't matter, I will stick to my usual order of the chicken gyro and curly fries."], ["Kim C.", "Quaint restaurant with inside and outside seating. You are greeted at the door and handed menus to seat yourself. Very tastefully decorated. We were waited on quickly and our waiter was nice and polite and met our needs without us needing to chase him down. We chose to eat here because it is walking distance from the hospital that my husband will be in for surgery coming up. When I asked if they had a paper menu and explained the situation the lady at the register told she was sorry but they were out of paper menus. BUT...she grabbed one of the laminated menus and let me take it. So now....they not only have customers that are happy they won't have to eat hospital food but they have customers that will shout from the rooftops what great customer service we received!"], ["Count D.", "After reading the other Yelp reviews, I went into Keifer's with solid expectations. Sadly, I was quite disappointed. But let me be fair - this is by no means some Mediterranean restaurant where I expect everything to be top-notch, tradtional, big flavors, etc. I was expecting a solid gyro to satiate that craving. Unfortunately, that wasn't the case.Ordered the standard gyro with a side of fries with it. The cashier asks \"cottage or curly?\" Me, having never heard of cottage fries, asks \"what's cottage fries?\"\"straight-cut fries\"\"okay I'll take those then\", thinking these are your standard fries. I wish I would have listened to Tiffany Y's review and went with curly fries!When my order was ready (the one thing this place did right was make my food hot & fast), I saw the fries were basically humongous chips. Imagine taking a potato and slicing it long-ways so you have chips the size of a potato! Not what I was expecting, but they were messy to eat. In a good way, I guess. I would have definitely preferred the curly fries - my mistake. It was basically eating an entire baked potato, but fried.On to the main meal, the bread & butter of any gyro place, the gyro itself. This was such a HUGE LET DOWN. The only thing going for it was that it was hot.NO TOMATO??? NOT ONE SLICE???BARELY any onions, the SMALLEST LITTLE PIECES! GIVE ME SOME RED ONION SLICES.What kind of disgrace is that?! You don't even deserve to be called a gyro!I made sure to take a bite of the meat itself to analyze the flavor, and I was honestly disappointed. It was okay at best. The meat was under-seasoned, oily, a little spongy, and somewhat thin. My sandwich was basically meat, pieces of lettuce, and yogurt sauce (which wasn't even that good, mind you). I was bummed out, to say the least.I had to do some kind of investigating. Maybe not getting tomatoes was a fluke, an accident by the chef. But after reading the menu, NOPE. Only comes with lettuce, onions, and sauce. Very sad. This would make your sandwich so much tastier and heartier. Not to mention I saw an entire fridge full of them when I was ordering. Nonetheless, I finished my gyro and left. Regardless of the other reviews, I don't think I will ever come back to Keifer's. I was so disappointed with my lackluster gyro that I am just not willing to try their other menu options (although some of them did sound quite appetizing).RESTAURANT STAFF: If you're reading this, there is NO WAY someone is paying $6 for hummus! You'd have to give me a PLATEFUL, or it would have to be extremely delicious. Which I don't think this place is capable of making amazing hummus anyways. Really glad I skipped on that one."], ["Deidre B.", "The bacon cheeseburger at Keifer's downtown is the best in Jackson! Seriously! My kids and I eat here more than we should : ) They think the curly fries with the special seasoning is the best thing they've ever eaten. I know most people eat Greek food at a Greek restaurant but if you don't get the burger, you're really missing out!"], ["Bruce D.", "Great food, Lots of atmosphere. We went for lunch and the place was packed. The staff was super friendly and helpful."], ["Chris and Tami T.", "Look, we really had a good time in Jackson, Mississippi.  Everyone told us \"BEWARE, JACKSON IS LIKE ALL KINDS OF RED NECKS AND RACISTS\" but you know what?  We LOVED the people we met in Jackson!  So...Dear People Hatin' On Jackson,You need to shut up.  We went to this place called Keifer's...and while we have had better Mediterranean fare in place with a heavier Mediterranean population, this place was pretty good for what it was working with...that being...(I am assuming) a more modest Greek culture in the area.  This was the Tex-Mex version of Greek food - kinda Americanized but still totally yummy.  So, haters, go to Keifer's when you are in Jackson and talk to the hard working Keifer's folks about fun things and stop being such punks about the south.  Love,Chris and Tami(representing Deep South for real, y'all)Thumbs up."], ["Lee H.", "I try to go to Keifer's whenever I am downtown at lunch time. The downtown location is not open for dinner.  The gyros are fantastic, and since I visit infrequently that's what I always get. I tried the roasted red pepper humus this time too. Really good."]]}