{"Mexikali Taqueria Grill": [["Linell B.", "I've gotten the grande burrito twice and wasn't disappointed even a little bit. You have your choice of several meats -- so far my favorite is to get chicken, ground beef, and chorizo.It is a child sized burrito. As in a burrito the size of a child.The staff is all super friendly and it's an all around good experience."], ["Duan C.", "O.k. - this is the lady that was running La Guadalupe on Old Canton - she moved to the old indian restaurant on Countyline Road. Found this out through the grapevine. She is a tad cheaper than the guy that took over La Guadalupe - but the Grande Burrito tastes better at Mexikali. More room to stay and eat - if you want to eat there too. More options on the menu this go round as well. They have the best grande burrito in Jackson. They truly make a football sized burrito!"], ["Cheri C.", "The best Mexican food in the metro Jackson area. The owners and staff are extremely friendly, the dining room is bright and clean. The guacamole is excellent and the chips are hot & fresh! We ordered steak tacos, chicken tacos, fish tacos & a beef and cheese burrito. The ingredients are all tasty and high quality. They have a full bar but we didn't try anything, the sign outside said \"free margarita samples\", we'll try that on the next visit. This restaurant was formerly housed in a small space on Old Canton Rd. The new space is large and a great improvement."], ["Jen B.", "Good place for lunch, margaritas are good. I got 3 tacos barbacoa, pastor and tilapia. The first two were good the tilapia was very fishy I took one bite and that was it. It was only $3 and I bit the bullet on that one. No they didn't take it off even though I told them it was bad. My husband had a steak dish with sautéed veggies that he said was ok and my son had the burrito that was the size of a small baby that he got 3 meats in and liked."], ["T L.", "This place is the real deal. Authentic Mexican meals at an extremely reasonable prices. The atmosphere is very clean and modern. The staff is very friendly and the tacos are delicious. I highly recommend this place!"], ["Jonna B.", "I hadn't been hungry all day. My husband suggested Mexikali, and I thought 'sure, why not?' He'd been for lunch and said it was not only delicious, but also authentic. When I saw their menu, I immediately was hungry. We ordered chips, salsa, and cheese dip (believe me - you want them all). I ordered the grande burrito, which was about 10\" long and 5\" tall. It lived up to its name. I got mine with steak and beef, but you can choose three meats for it at no additional costs. Pico de gallo, avocado, beef, steak, rice, and beans were just some of the ingredients inside the soft flour tortilla. I could only eat 1/3 of it and I was STUFFED. Plus, after the tip it was under $30. It is well worth the trip to Ridgeland."], ["Justin M.", "First off, I am probably one of the pickiest eaters in the world. However, I did try many things that my friends got and I was blown away at how amazing this food was. I almost shed a tear when I tried my friends Empanada. I, myself, shared the fajitas for two with my wife and it came out sizzling like any good fajita, but it was probably the best I have ever had. I would definitely recommend coming here! It seems to be family run and more authentic than most Mexican restaurants in the area!"], ["Dreka G.", "Very very tasty! Some of the best Mexican food I've had since moving to Jackson. I had empanadas for dinner last night and they are bringing me back today for lunch.  Delicious."], ["Kelci A.", "Very authentic. Great service. The quesadilla was so fresh! This is the first time I've walked out of a Mexican and not felt bad."], ["Michael D.", "Im from California, the food out west is amazing. I've been on an endless search for excellent food. I thoroughly enjoyed everything this place had to offer. EXCELLENT!"], ["Anthony S.", "Excellent food. This was the previous owner of Guadelupe on old canton road. The food has gone down hill there. More space here and the same good food. I highly recommend for authentic Mexican food."], ["Kevin S.", "I have a new favorite taqueria in Jackson. The queso dip is the best in town, my burrito was worthy of coming from San Diego, and my wife loved her tacos asada. We'll definitely be back!"], ["Pete F.", "One of our favorite spots. These are the folks who used to run La Guadalupe on Old Canton. Service kinks are still being worked out, but the food is always spot on. Try the Grande Burrito! It's easily enough to feed two."], ["Jim G.", "This place is great. The former owners of Taqueria La Guadalupe have now opened this place next to Beagle Bagel on County Line Road. Authentic Mexican food in generous quantities, with real flavor. The tacos are incredible, and the chicken tamal is very special. I call it the Mexican chicken pot pie. Jalapeños toreados make a spicy start to lunch or dinner. Chili sauces are available from mild to hanenero. Prices are VERY reasonable, and the service is friendly and attentive."], ["Kim T.", "The former management from Taqueria la Guadelupe is bringing Mexi back!!! Oh, how I missed the juice-to-your-elbows Barbacoa Torta.... it just doesn't taste the same unless your hands are stained with that red nectar. I'll tell you... my unborn child is doing the salsa right now. I haven't been so happy in so long until Ms. Vasquez asked if I wanted jalapeno on my torta! Oh how I missed those words... This food is life changing y'all. I'm so very much looking forward to taking the rest of my family and telling the world about Mexikali!!!"]], "Picante's Mexican Grill Restaurant": [["Minna Z.", "If you are looking for affordable Mexican food with awesome Margarita happy hour deals, then this is the perfect place. I tried the chile relleno and it was AMAZING. Very huge portions at a great price. The service has been a hit or miss for us, but the food usually makes up for it"], ["Pamela L.", "The waiter was very nice. But the food was both boiling hot and cold. Was clearly put on the plate cold and run under the broiler. The verde sauce was separated and watery as if it had been frozen. Or at least it was cold and heated on the food - not hot and stirred when it was put on. The food was bland and uninspired. I'll stick with Jacos rice bowls or Cazulas street tacos when I want Mexican. Pass on this place. Which makes me sad."], ["Ryder T.", "You know how Jackson used to only have horrid disgusting tex-mex as an excuse for any mexican/latin american/south american food? This is for people who pine for those days to return.It may be the best low quality tex-med in town, but it is a pretty low bar.On the plus side, it is cheap, and to be fair, sometimes what you want is a bunch of refried beans from a can with cheese straight out of the bag.Maybe your microwave is broken, come here instead!If you want good food, try Jaco's, Cafe Ole or La Guadalupe."], ["Nick W.", "Awesome new Tex-Mex restaurant. The food was awesome and the prices were SUPER low compared to other Tex-Mex places (Jaco's, for instance). We enjoyed the 2 for 1 margs during happy hour. I got the molcajete and what a deal it was! It's only about 13 bucks and easily feeds 2."], ["Ian D.", "Fresh and delicious food finally!! This location has always been a hinderance to businesses that occupy the space. I think parking is the biggest issues. Hopefully this restaurant will thrive! The variety of food on the menu is pretty standard to the Tex-Mex fare here in town but they excel in the freshness of the ingredients and the taste! Service was quick and very attentive and from ordering for 2 to it being at our table was less than 15 minutes. They've still got all the TV's from the last tenant, so this might be a great spot to watch some Futbol. We'll be back again, and often!"]], "Cinco De Mayo": [["Brandon J.", "Easily the most mediocre Mexican food I've ever eaten. Wasn't good at all, but service was good. I won't be back again unless I'm going in for a margarita. If you want good Mexican food, try elsewhere. I left still hungry with a half plate of food still left, which isn't like me."]], "El Charro": [["Khunjit S.", "Solid tex-mex. Very good lunch deal ($4.99 for an entree, 2 sides or 2 entrees and a side). They do have one of the best fried ice creams out there - with cinnamon and coconut mixed into the batter."], ["Clayton T.", "I'll start my review by saying I am from Texas, however I do understand the further you get away from Mexico the more diluted the mexican food gets.I say the food was 4 of 5, my wife says 1 of 5. We started with the queso funditios. Tasted pretty good to both of us. Salsa and chips were good too. Next came the antrees:-Sourcream chicken enchillidas: Tasted good but did not look or taste like what I typically get.-Quesidia: Wife said there was not enough cheese to hold everything together.-Chicken Tortilla soup: Quite strange, really just chicken in a water/broth with large fried tortilla. No flavor.Overall 3 stars. If I were in this town again I'd probably go again. The staff was nice and accomidated a food request I had that was not on the menu."], ["Melissa A.", "Went there tonight. Salsa and chips are okay.  Good service and friendly staff.  Good quesadillas and tacos al carbon."], ["Lawrence L.", "We arrived at El Charro tired after a long day of driving with three children in the car. Our margaritas arrived promptly and they were tasty. The queso fundido was delicious. The cheese enchiladas were quite good and the chicken chimichanga was also very good, and not as huge as in many places. The nacho chips were not as flavorful as other places we've experienced. The tacos al carbon were also very tasty. We would definitely go there again."], ["Joe M.", "Let's get the positives out of the way first:They take Amex (business travelers know my pain).  My server was nice, and didn't blink when I said I wanted fajitas with only vegetables, no sour cream, cheese, tortillas, etc.  I got the fajitas \"paleo\" style with guac.  I went there around 5:30 on a Tuesday. These have got to be the worst fajitas I've *ever* had.  This is not a \"I'm from Texas and any Tex Mex food made outside my beloved state is crap\" sort of biased review.  People from Indiana should be able to recognize the awfulness.  I checked Yelp before I drove up there from downtown Jackson, and saw a lot of glowing reviews.  What I didn't do was look at the pictures people had taken of their fajita plates which would have tipped me off sooner, because the meat is not right at all.They clearly do not use skirt or flank steak for their fajita meat, like you're supposed to.  It chewed more like eye of round.  If you go look at how the eye of round is packaged in the grocery, you'll see \"medallions\" of meat maybe three to four inches in diameter. 1/4 to 1/2\" thick.  You're supposed to cook whatever portion of skirt or flank steak (1/2lb, 2lbs, etc.) in one piece, pull it off the grill, let it rest, and then slice it against the grain.  That gives you a nice medium pink center, with plenty of juices and good tenderness, not chewy at all. El Charro does one of two things with their fajita beef, best I can figure: Option 1: They take thin pieces of something like eye of round and cook the hell out of them, until there is zero chance of juiciness or pinkness, then slice with the grain.  Option 2: They pre-sliced all the meat, again, with the grain, and threw it on the flattop (clearly not grilled).  Again, no pink, no juice.  What either of these cooking methods results in is meat that isn't begging to fall off your fork.  Instead, it turns the meat springy because it's so overcooked.  Imagine picking up a piece of steak with your fork.  Next, imagine flicking it with your finger.  Imagine it rebounding back at you when you flick it, after moving only so slightly.  Much of the meat is chopped too small, so that it's difficult to find it in the plate.  Smaller than the bell peppers and onions, that's for sure. Chewy, chewy, chewy, chewy.  It's bad.  If you went to Taco Bell, bought 6 steak soft tacos, pulled the meat out, chopped it up like you were making a cheesesteak, and then cooked it all for another five minutes (which is five minutes and thirty seconds overcooked), you have a rough approximation of what you're dealing with.  I'd like to apologize to Taco Bell for even associating them with meat this bad.  Shoe leather.  A chopped up basketball.  A run over football.  Got the point?Onto the salsa and guac, which were merely C-/D+ levels of offense against Mexican/Tex Mex.  The salsa is made with tomato sauce.  Not with canned diced tomatoes doctored up to be salsa, and maybe blended a bit long, but straight tomato sauce.  Very little chunkiness to it, almost no heat.  I've gotten better salsa in a breakfast bar at the Courtyard Hotel 45 minutes outside of Chicago.Guac: I like it a bit chunky, this was too smooth, and seemed like a cross between guac and guac sauce.  You make guac-ish sauce by cutting the avocado with something like sour cream, tomatillos, green onions, etc.  That's not actual guac, it's guac sauce.  I think it was actually blended tomatillos with some avocado sprinkled in.  If you want green sauce with your chips, I guess it would be ok, but if you're looking for some good fats to stick to your fajita that actually taste like avocado, this is not it."], ["Kimberly A.", "I travel often to Jackson for work and this is my favorite restaurant for great Mexican food to go. This isn't the place for you if you're looking for an upscale experience. But what it lacks in ambience, it makes up for in reasonably priced food. The staff is friendly and quick with your order. The salsa is perfect. You cannot go wrong with the fajitas or the build your own combo which let's you pick your favorites from a massive list of options. The queso is a true highlight."], ["Kevin S.", "This place is your above average Mexican diner, good food at a good price with friendly service."], ["Scott C.", "My favorite Mexican place. Salsa tastes fresh. Beans are always perfect. Not too dry, not too soupy.  Vegetarian options. Carnitas are the best! Plus bite sized instead of huge chunks. Fast service."], ["Duan C.", "El Charro is a solid tex-mex restaurant, that does offer some authentic style grub, such as cantina/taquera style tacosI had the Molcajete dish, I took a picture of it. Its a lava rock bowl, stuffed with shrimp,chicken, steak, bellpepper, onion, light cheese, with Taquera style salsa! OMG - simply orgasmically delicious! Topped off w/32 fluid oz. Of bud light draft! Wow!The only reason why I gave four stars, was because our last visit they were super slow with the grub. But they do have a nice wait staff and pretty good service 95% of the time.Good prices, good food, good portions."], ["Alex B.", "We were here on a Sunday afternoon traveling thru town on the highway. Read the reviews and thought we HAD to stop. We are happy we did. Very fast courteous service, food was very good and reasonably priced. The business was clean and slightly dated in decor, but when the food is good who cares right? LOL Had chicken enchiladas with queso sauce, sooooo good. Their lunch combos can't be beat."], ["Coral E.", "Personally, this is my favorite mexican restaurant in the Jackson area.  The servers are always exceptionally nice - but yes it can sometimes be slow because they are so busy - but that's not the server's fault.  I have eaten here numerous times in the 7 years that I have worked close to El Charro - and I have never once had a complaint about my food.  Everything is good.  Some favs are the fajitas and the nachos in the back of the menu that have chicken, beef and beans - can't remember the name.  Salsa and chips are great and fresh!"], ["Jamie P.", "Very tasty Mexican food in the Jackson area - highly recommend it if you're looking for authentic Mexican. We had three different dishes - tamales, pork carnitas and tostados and all were delish! The 32oz beer completed a great dinner (see my photo in the pics)."], ["Big C.", "This is my family's go to Tex/Mex spot. I'm a big fan of the Tacos Adobada. My kids like the quesadillas. The margaritas are sometimes a bit watered down, but the food is consistently decent, and inevitably we run into people we know."], ["Christy S.", "Searching through Yelp for a reasonably priced, local restaurant in Jackson, we found this place. It was a stellar find! My boyfriend and I split one of the build-you-own combo platters with a stuffed poblano pepper, potato enchilada, the best mushroom quesadilla I have ever had, a ground beef taco and rice and beans with two margaritas for $14! The atmosphere is great, but the home runs were the amazingly affordable price, super fast service and the best mushroom quesadilla in the history and future of mankind. Stop here if on a road trip! It totally worked perfect for us. We will come back everytime we driving thru Jackson."], ["Joe F.", "How does a place like this get 4.5 stars?  I'm from out of town, and maybe this is one of the best here, but it is absolutely mediocre, at best.  Margarita, sickly sweet and very little booze.  Carnitas looked like brown globs of rat meat, tasted a little better.  At least I had the thought of asking for fresh jalapeno, which I got and which resurrected an otherwise completely forgettable meal.  Meh, is right!"], ["Steve D.", "my co-worker and I sat at the bar last night so we could watch the game while we ate. we waited and waited just to get a drink order in, then had to be told to wait again to put our supper order in. slow, very indifferent, service. though, the food did come out fairly quickly once the order was taken.the tamales had almost no filling in them at all. the 'super burrito' was hardly more than an enchilada. everything tasted ok. but the serving sizes were really poor. I should have been stuffed after eating a 'super burrito', two tamales, over cooked rice, and a beer. not.won't go back."], ["Adriana O.", "Really good Mexican - reasonable prices  - attractive interior - not gaudy or overly  'mexican' Great selections - good service and a musican who could sing ' Granada' and was very good! Mexican beer - very hot plates  child friendly and in general a pleasure. Manager Ramon Munoz said they don't have a web site -but people know they are there, 8 locations in Mississippi -open 7 days a week - 601 362 4447A real find when you are traveling and dont kinow where to dine"], ["mike b.", "Wonderful Mexican Food!  We visited Jackson and were advised that this was the place to eat excellent food and we were so thrilled at the high quality taste and service.  Very reasonable prices made for the family budget.  Atmosphere is a bit dated but the taste makes up for any shortcomings to building appearance.  Building is fine just not new.  Salsa was yummy and the chips were fresh and hot.  Cheese Dip was wonderful.   Main course was full of flavor.  Highly recommend.  Best Mexican Food in Mississippi!"], ["Bill K.", "Went here last night based on Yelp reviews.  It was good food, good service, and cold beer.  I had the molcajete(sp?), and that is one hot lava  rock.  It was still bubbling 20 minutes after it was served.  Spicy dish that my eyes watering but it was sneaky hot.  I would return here and would get this again."], ["Dena S.", "I must say I was pleasantly surprised with El Charro. While not the most authentic Mexican food I've ever had, it was much closer than most \"Amercian Mexican\" places around the country. The ingredients are fresh and well prepared. I enjoyed the chicken in my Flauta. It was chunky but really tender, and my cheese Relleno was excellent (and the most authentic item in my meal). I also really enjoyed their salsa. Service was great. One thing of note is that they have a full bar but not much in the way of wine. But regardless, I'd definitely go back to El Charro again."]], "La Cazuela Mexican Grill": [["Ezra S.", "Best fish tacos I've ever had, and the margaritas are fantastic, I'll definitely be camping back."], ["Rachel P.", "I rarely (almost never!) give less than three stars, but this place is frankly just not that great. If you're looking for a super basic margarita or a beer along with some average Tex Mex then by all means, head to La Caz but if you're looking for a unique or fantastic meal, just pass on this. The patio is sheltered and that's pretty nice. It's a bummer that such a great space is wasted on such low quality food though. The service isn't particularly friendly or helpful, though it's generally pretty quick. The queso is definitely microwaved and don't even bother with the guac. If you're craving Mexican or Latin American food, you're much better off heading to Babalu or Cafe Ole."], ["Ryder T.", "This place gets worse every time I go.The only thing this place is good for is if you just want a bunch of cheese and beans and generally crappy Tex-Mex. Let's be honest, that is sometimes exactly what you want. This is the place for that.The food is terrible. Not that it tastes bad, it is just very low quality Tex-Mex. The service is actually fairly on point though. It is cheap.The margaritas probably do not contain alcohol."], ["Judy D.", "Terrible service. If Sara is your waitress ask for another! Cheated at the bar Double shot of tequila was half of a small bathroom size paper Dixie cup $16. Appetizers came out same time as entrees. Too many great Mexican restaurants in Jackson and the surrounding area to settle for this."], ["Dean D.", "I was hesitant to dine here because of the reviews but we decided to give it a try anyway. First, the food and service was actually pretty good. We ordered the combination chicken, steak and shrimp fajitas which came out on a sizzling platter and included all the typical fixings. We ordered the double and I gotta say...wow. There was enough to feed four adults with still some to take home. My wife and I couldn't even put a dent in this plate! Service was friendly and prompt.So here's the deal; they'd get four stars if the place was cleaner. The dinning area and the restrooms were pretty disgusting. The men's room didn't even have paper towels. This tells me the cooks aren't cleaning their hands after using the \"facilities\". Also, if the restaurant management isn't concerned with the cleanliness of the public areas of their restaurant, I can only imagine what the kitchen looks like."], ["Jerry E.", "Worst meal I ever had. I ordered the shrimp and scallop fajitas, the were cooked to fossil stage and 10x more seasoning than needed. I will never return to this horrible nightmare place again."], ["Maria W.", "Wow this is the worst Mexican Grill (yes! Coming from a girl who was raised in a Hispanic household and originated from TEXAS). They are cold hearted and they do not have any good food. Let me say, it was one evening me, my sister, and mum decided to check this place out and we were highly disappointed. We almost walked out without eating, but my mum said it would be disrespectful to do that. I know, racism is a huge issue in Mississippi so I wasn't too shocked about that but when it came with the whole staff turning against us dining that was a little surprising (because we are paying customers). We had a waitress that only came to bring us our refreshments after that she was gone (disappeared). She didn't even bring us our food, a waiter from the back did. (VERY RUDE!!)Don't order dessert, we made the mistake to order dessert and it came out STALE. This place needs to closed down seriously. Go to Byram and eat at Jarros (good food)"], ["Trisha G.", "Loud place. Food is OK but nothing special and not very authentic. The ladies bathroom was dirty and my husband said the mens room was disgusting-- and he was way lower cleanliness standards than me!It's also a GREAT place to get your car broken into. My brother's truck was broken into in the parking lot in broad daylight. A guy who had been hanging around the lot (and why are people just hanging around the lot in the first place?!) said he didn't see anything, but was just grinning and acting like he couldn't understand us. Over $3000 worth of clothes, jewelry and electronics were stolen... we had stopped there for lunch while coming home from a vacation. We informed management about the break in, and they did NOTHING. No apology, didn't even come out to the lot. They just ignored it. We had to call the police because they sure wouldn't. When the police arrived, they said break-ins have been a problem there. I realize the management didn't cause the break in, but they could at least pretended to give a damn."], ["Arkansas G.", "Definitely my fave Mexican resturant in the Jackson Area.Good food decent prices. Absolutely love the outdoor seating, (heated in the winter months.)Their chip and is to die for alone. :)"], ["Rob B.", "Cold Service and Cold Food.Now that I am writing and reading other reviews, I should have stayed away.  It's not too late for you!  I saw my waitress three times in an hour:  1) to take my order; 2) to bring me a drink refill I had to ask the manager for; 3) to bring me my bill.   Service:  Bad.   Non existent almost.  Maybe because it's Halloween and my waitress made like a ghost and disappeared?  When I did receive my food about 25 min after I ordered (and it wasn't busy) it wasn't hot.  I was asked if I needed anything, and I said Hot Sauce.  I never saw that guy again, and never got my hot sauce.   Enchilada sauce is out of a can, my guess is Old El Paso.   The salsa, by name only, as mentioned before, is chopped up tomatoes.  No cilantro, no peppers, no onions - just bleh.  After my drink ran out I asked the manager lady for a refill, since my waitress was MIA.   The manager lady came out a couple times more, but didn't bring me the drink or tell me it was coming, she just ignored me.   Apparently told my waitress it came eventually..  No one every apologized for anything the whole meal.I did notice the waitress at the next table who I saw several times, had wrong and delayed orders, but at least she was trying.  Apparently this place has problems on several levels.  It's a good candidate for Restaurant Stakeout, and you wouldn't even need the hidden cameras, you can just sit back and  watch most of the workers not care about the food or service."], ["AJ P.", "I actually signed up for Yelp just to tell everyone what a crapp place this is.  Waiter could not answer any questions regarding the menu,  for starters.  Chips were thick, greasy and flavorless. Salsa was also flavorless.  Cheese in stuffed pepper was still cold and semi solid!! Sauce on enchilada literally tasted like chef boyardee with cumin. I was so disgusted by the cold cheese I asked for a taco to replace it.  The meat had no flavor whatsoever.  The only upside was the drinks ( tea or soda) came in a huge glass.  I was very,  VERY disappointed in this place.  Will never return."], ["Joe J.", "I don't really know where to begin. First, it only took me 30 min to get my food which was a fijita chimichanga. The people sitting next to me didn't have any time left to eat their lunch. They had their order changed to to \"to go\" orders but I decided to stick it out. When my food finally cam out it was loaded with cooking oil. I lifted the chimichanga to show the waiter how the oil was pouring out. she did ask me if I wanted to change my order but by then 45 minutes had went past. So I took my bill to the manager to explain my concern. He actually looked at me like he wanted to say \"so what\". He took my money and told me he would take care of me next time. as I stood in shock he gave me a look as though he was wandering why I was still standing there."], ["Jason L.", "3 of the worst tacos I've ever had...good chips and salsa...won't be back."], ["Cindy A.", "I can count on on hand the number of restaurants for which I've walked out without eating.  This is one of them.Five of us were starving after a day of jet skiing on the reservoir.  All five of us love Mexican food.  In fact, if I believed in reincarnation, I'd swear I was Mexican in a previous life.Chips:  Lowest quality corn/tortilla chip I've ever tasted.  Salsa:  I guess the tomato juice in the jar is supposed to be salsa.  No onion, no cilantro, no jalapeno, no garlic.  Ick.Salad dressing:  All I wanted to know was whether it was home made or came in a packet.  What is it with Mexican restaurants in the South serving salad dressing packets with a salad?  I had too ask literally four people -- all the way to the manager before anybody understood English enough for me to finally just ask for a side to taste.  And, I'm all for Mexican people working in Mexican restaurants -- that totally works for me, but really, I think at least one person on staff should be able to translate basic restaurant language for the others.  They brought me a packet. Okay, so I won't be getting salad.\"Queso\":  Are you kidding me???  I kid you not, it was like salty thick milk.  There was nothing about it that tasted like or had the texture of cheese.  It took all my couth to swallow what I put into my mouth.Water:  Are water filters really so damned expensive?????  It was classic Mississippi water that tastes like mud. One sip and that was it.  And, this disgusting taste is not masked by tea, or any kind of carbonated beverage -- it takes over the drink.At this point I was disgusted and afraid to try ANYTHING off the menu.  If they cannot get the BASICS right, there was no telling how the food would turn out.  We all agreed it was time to go.  The ONLY positive to the whole experience was that the manager simply asked why and when we told him, he said \"Okay, no problem.\"  I will never be back, but I hope for their sake that they make some changes so they can keep customers."], ["Paul N.", "It's average Mexican food.Not bad, but not awesome.It's fast and cheap, and the waitstaff is always refilling your drink."], ["Felicia B.", "The server was a little slow, but that isn't always the case. The Baja Fish tacos and the Pulled Pork tacos are excellent. Beans/rice are uninspired standard fair, as are the happy hour margaritas but they'll make you warm and fuzzy."], ["Chris T.", "Wow terrible.  Turn around run.  It's not to late.  The worst food ever.  This is not Mexican food.  Also very pricey.  Do yourselves a favor if you want real Mexican food you should try El Sombrero in Byram, Flowood, or Brandon MS.  You want be disappointed."], ["Kayleigh G.", "On their menu they have a section called \"Vegetarian combinations\" a lot of these combos included items with rice and beans (typically mexican rice is cooked in chicken broth and the beans with lard) so when I asked the waitress if the rice had chicken broth and if the beans had any lard she responded \" I don't know, I don't know how they cook that stuff\" and just stared at us until my girlfriend asked her if she could find out for us. She seemed very irritated by this request and it turned out the rice and beans are not vegetarian even though its listed as being vegetarian. So we ordered the vegetarian fajitas with no rice and no beans. They gave us a huge plate of grilled veggies and only three very small tortillas. How are we suppose to fit all those veggies into just three tortillas? Plus the tortillas weren't made in house and neither was the salsa. If you're going to be a mexican restaurant you should make your own tortillas and your own salsa. The food was okay, the waitress was very unfriendly and rude. They get two stars for giving you really huge cups of soda and it was a hot day."], ["PNotHere E.", "I came here for dinner as I saw they had outside seating with music.  The music was karaoke tonight.  The place looks busy as the parking lot is usually full.  After the other businesses around it close (medical facility), some people park there.  Food wise...I had the Mexican Steak (TBone with vegetables) with rice, refried beans and tortillas.  The price was good....$12-$13 for the entire thing.  The taste did not knock me off my seat but it was a meal.  Good place to have a meal if you're hungry and 1 of the closer restaurants if you are staying at the Marriott Residence Inn Jackson off Fortification.  I did not have a drink however I know they do have a full bar."], ["Baron M.", "There are places in the Metro with better Mexican food, yes, that is without a doubt, but it is hard to beat sitting out on the deck with a pitcher of beer or some margaritas, while you have a good time with friends. I see that some of the other reviewers have had bad luck with waitstaff, but that has not been my experience. I have had the very good fortune to be waited on by people that were always friendly, if at times a bit lacking in speed. The food is good. Somethings are much better than others, but sometimes not so much. Again, if you just want to go somewhere for Mexican food, there are better places, but if you want somewhere to have a good time with a table full of folks, this is it. Oh, the lunch specials aren't bad either, they are fast, and they serve them on the weekends."], ["Darci B.", "I have to give this place 5 stars. It's been awhile since I have had some good Mexican food. The salsa is very good, not too hot, but not too mild.I got 2 cheese enchiladas, taco, rice, and beans. It was good, but my husbands was even better. He got a chicken meal with peppers and onions smothered in a white cheese sauce with rice and beans. His meal was to die for and I will be getting it when we go back, which will be soon.My husband goes here a lot with his co-workers and usually gets the lunch steak fajitas. He always has leftovers and it is seasoned very well, very yummy. Our daughter even liked the food here and she is very picky.For all 3 of us to eat was only $24, but we all had water to drink. Very good, we will be going back again soon."], ["Alan S.", "I may have enjoyed an experience or two at La Cazuela Mexican Grill, but all I can think of now is the $300 dollars I had to beg my bank to give me back after the wait staff stole my debit card after accidentally leaving it in the little card holder thing after I paid.  I know, dumbass move, but still, let me give you an idea of what type of people work at this place.  I received a call the following morning asking me to verify suspicious charges.  I was told that I spent 47 dollars the previous night at sonic (someone was reallly thirsty for a slushie), 3 dollars at McDonalds (3 double cheeseburgers), and 255 dollars at a shell station ( a shit load of gas!).  Bottom line, the food is mediocre, and in my opinion you can get much better at Margaritas on Pear Orchard/County Line.  And they won't steal your card and buy 3,000 slushies."], ["Margaret S.", "I like this place. Their salsa is really good: not too hot, not too mild, not too soupy, not too chunky. Their guac is also really good; not too many raw onions. At Mexican places, I usually get one tamale and rice; and theirs are excellent. My fiance gets the two burrito, one taco, rice & beans dinner, and his is always excellent, too. They have great flan and GREAT margaritas. Parking is a little difficult at lunchtime, but I think the food is worth it."], ["katie a.", "La Cazuela is decent for Mexican food-- if you are just going to have a good time with friends and don't really care about authenticity. Being from California and knowing what true Mexican cuisine is like, I was surprised at this Southern version. The salsa is a strange, Pace-like adaptation, sans any veggies. The margaritas come out of a machine. Also, the food is so salty!!Unless you like the flavor a salt lick, don't try the tortilla soup. The shrimp are pretty good, give the Diablo dish a try. A good place to have beer and appetizers with friends, nothing more."], ["Joshua S.", "Large portions, B-I-G drinks (including alcohol), and a good value.  The waiters aren't usually the greatest and sometimes it takes a while to get food, but overall this a great place to go hang out, grab some food, and enjoy some drinks with a group."], ["Rachel R.", "I came to this restaurant while visiting family in Jackson from New Orleans and I was incredibly disappointed.  While I didn't expect the greatest Mexican food in Jackson, Mississippi, I certainly didn't expect such a low standard for food or service.  The waitress seemed put out when we ordered drinks, including one for a friend who had not yet arrived and then asked her to come back to take our order when our friend arrived.  It took her twenty minutes after our friend arrived to come back to our table, and the restaurant was not even that busy.  At this point, we ordered a pitcher of margaritas, which never arrived, but which we got charged for.  Again, the waitress seemed put out when we asked her to remove the charge for the margaritas from our bill.  As far as the food, it took forever to arrive and it was cold and bland.  The salsa was basically ketchup - totally bland and not spicy at all.  Frankly, we paid way too much for food and service that sucked."], ["Thomas P.", "Great Chimi.  Nice bar.  What more can you ask for?"]], "Taqueria La Guadalupe": [["Shaye L.", "Visiting from Houston where we have many authentic Mexican cusine options. This place is simple excelence. Excellent burritos, enchalad, queso. Flour Empanada, wow. Simple, full of flavor, just the right texture and decent amount of filling. I like my chips a little thinner,but by far the queso is a winner! I wanted to put that s@$t on everything. I ordered four more flour Empanadas to go for me and my wife to have late night \"snaks\" at the hotel...she got to get her own!!"], ["Tiffany N.", "There's new management. This is not how it was before. I got beans and rice in addition to chips and salsa. The beans were the typical refried beans. No bells or whistles but I was hungry and there's no meat in them so it was ok. I saw them cook the rice and it actually smelled like it was burning in the pot at first but didn't taste like that. All in all, it was the standard yellow rice. Minimal seasoning. Both the rice and beans (when ordered separately) were big portions, which I appreciated. Ok. The chips and salsa. The chips were a yellow color, much unlike the previous owner's. At first, the taste kinda threw me off because they weren't what I was used to. However, after eating a couple more I realized they were pretty good. The salsa comes in a small styrofoam coffee cup (meh) with a lid. It was slightly above average, but I've had way better. It had a bit of a tomato paste aftertaste. Not sure how I feel about that.... The total of all my food was a little over four bucks. Not bad I suppose. The location of the previous owner is called Mexicali. It's where the Indian restaurant used to be in the same area as the bagel restaurant on County Line near the Mazda dealership and Sonic. I've been there three times and OMG it's soooooo good!! The empanadas. I die."], ["Chris B.", "As someone else mentioned, new management...for the worse. Portions are smaller, rice tasted like it came out of a box, no more chips and salsa while you wait. The chips that came with my burrito must have come out of a bag and were cold. The salsa DID taste like ketchup  oh yeah, and the prices stayed the same! Guess that's what happens when the owner springs for real plates. Do yourself a favor, go around the corner on old canton road and find the prior manager's new location, in the former Indian restaurant's location. That's the food you want!!"], ["Rodrigo P.", "The place is very dirty!The excuse of having hand made tortillas doesn't aloud to charge 3 dollars for a taco with black avocado and fat in the taco! When you take fat out taco is empty.My mistake go to the bathroom after I finish eating.I was never approach after I sit on the table I stand up and order!They took forever to get my food no salsa and chips like they said in other reviews!They were 3 tables dirty and unattended all the time that I was there!I went at 3.00pm so there is no excuse to be like that.They gave me a 1/8 of a lemon for three tacos!!!!One of the tables was totally apart on one of the benches!When they serve me the tacos once again I had to stand up and go to counter and get hot sauce! And they didn't have green and red so I had to take it from a dirty table!The tortillas where old or maybe raw and didn't support the food so I had to ate my taco with utensils!Also I had to get the salt from another table!4 tacos 12.00 I better go to buffet! I left hungry and grossed out after going to the bathroom!!!!!!You can be poor but never never dirty!If you want this review in Spanish let me know!The salt had pepper in it!The toilet lid wouldn't hold itself for you to pee!"], ["Aysia W.", "On a gloomy Monday afternoon, I needed something to cheer my spirits. So I headed to Mexicali, (the previous owners of Guadalupe). Unfortunately, they were closed so I trudged down the street to Guadalupe. I got the Barbocoa burrito, and it was both enjoyable and annoying. while it was a great burrito (or I was just hungry) the ratio of rice to meat was 1:3. I'm used to Mexikali/old Guadalupe management's meatier, greasy burritos.It was apparent they were trying to stretch the meat. And my usual order, no tomato no avocado,( I hate them both) was fulfilled until I hit into the bottom of burrito and there was hella pica at the bottom. if I was allergic, I would've had a bone to pick with Guadalupe. other than that, highly recommend going down the street to Mexikali. like I said, if they weren't close that day, I would've went there too"], ["Kim T.", "My co-worker and I usually rave about this place but we picked up a to-go there yesterday and management has changed. The man that rang me up told me the previous guy was renting the business & had opened his own place. We got back to the office to eat and the food was still good... but not nearly as good. We both had barbacoa tortas. There was less meat, the addition of beans (we couldn't recall those before), less avocado, NO jalepenos, less fries, NO red hot sauce. The green hot sauce was delicious but the salsa tasted like spaghetti sauce. No cilantro and no \"kick\". Someone told me the previous manager opened a restaurant on County Line Road. Anyone know more about this???"], ["Hayes H.", "Outstanding Mexican hole-in-the-wall! Fresh tacos and dips, reasonably priced. It was authentic Mexican food and it was super fresh. Highly recommended."], ["Gary H.", "Definitely my favorite place for  south of the border cuisine. Everything is soo fresh and tasty, love the salsa and hot sauces they make. Empanadas and quesadilla with brisket are go to's with a Mexican coke of course. Always busy so plan ahead, they get a lot of togo orders as well."], ["Seth J.", "I was relocated to Jackson recently and before living here I resided in Dallas, Houston, and San Antonio.  My only complaint is against myself.  I should have sought this place out 8 months ago.  Cheers!"], ["Jason T.", "Absolutely love this place. Best Mexican food in the area. Treat yourself to it now! My favorite thing there is the Barbacoa. Get them at least once a week."], ["Manju P.", "The most authentic food and unpretentious atmosphere you can find north of the border.  The Chicken and Barbaracoa tacos were excellent.  The tilapia in the fish taco was extremely salty.  The deep fried plantains hit the spot.  Service was quick and friendly."], ["Shawn P.", "Ordered the sample plate which was 10 dollars and included a drink. Staff was friendly and attentive. Food was very good and flavorful. Sample plate was large and could have fed two. I was surprised that they were already integrated with Apple pay as well."], ["T L.", "If you are looking for authentic Mexican fare at a reasonable price,  this is the place.  The Barbacoa and Pastor tacos are my favorite.  For under $10 you get your choice of three tacos, or a few other items on the menu, such as tamales.  The atmosphere could be better,  but the food makes up for it.  This is a regular spot for lunch.  Be aware that it is a very small place with limited seating and will fill up sometimes during peak hours."], ["Ann C.", "Super friendly and Delish.  Asada tacos combo is wonderful.  Sauces for tacos are all tasty and amazing.  Tamales were good the Gordita barbacocca was pretty good."], ["Tricia W.", "My boyfriend and I came here just to get him a quick meal so I could go eat my vegetarian meal somewhere familiar.. We stop in ordered a freaking burrito a and a taco.. I kid you not it took over an hour... THERE WERE HARDLY ANY PEOPLE THERE... We get the food finally And they got the order wrong... I understand they're nice people but never again"], ["Keke W.", "This was the first authentic Mexican restaurants that I remember coming to north Jackson a few years back. Now there are a ton of choices but this remains one of the better choices. Taco's are good, service is also good. Keep up the good work!"], ["Yoori C.", "When I want a fat, yummy burrito with fresh chips and friendly service, this is my joint. To complete your meal, make sure you get a Jarritos soda and all the salsas from the fridge!For real street tacos though (imo), I go across the street to La Morena."], ["Victoria M.", "Where the service and atmosphere is lacking the food by far makes up for it.... the absolute best chimichanga I have had in a while.... Would highly recommend giving this lil joint a try"], ["Melissa E.", "Some of the best authentic Mexican food I have ever had!!! Everything is fresh and tastes amazing!! The guy that runs the front is super nice. Its a little hole in the wall place but it is definitely worth your time!"], ["David M.", "I got chicken, barbecue, and pork soft tacos while my friend ordered the pork tamale. Everything was freshly prepared and delicious, especially the chicken soft taco and the pork tamale. Highly recommended."], ["Amanda S.", "I wish I could give this amazing place 100 stars!! We lived in Ridgeland for 2 years and I'd always pass by this place and was apprehensive to try it since it's a small \"hole in the wall\" as some may say. I eventually stopped in and was blown away at how delicious their food was! We became the \"usuals\" here and our week wasn't complete without having a meal here because prices are so affordable. Their meats have the best flavor because they are marinated and the veggies are always the freshest! I've tried everything on the menu but I recommend their tortas, burritos, and especially the TACOS! I love their chicken, chorizo and brisket. The tacos have a fresh slice of avocado and don't forget to put their verde sauce on top!We loved their chips and salsa so much, I'd grocery shop at Kroger then pick some up at Guadalupe on the way home for only $2. Can't beat that! Now we live in Dallas and I swear we haven't found any place that has tacos as good as this place. We will continue to drive out of our way to stop in Ridgeland for this wonderful restaurant on our way home to see our folks in 'Sippi!"], ["Nolen G.", "4 stars from me for MS Mexican food is a rave review.  I can no longer say good Mexican food is not available in Jackson.  Good, fresh tacos.  I can't wait to go back and try more offerings.  3 Tacos and a drink for under $9.  I chose Chorizo, Pork and Barbacoa (shredded beef)Chorizo was dry and not spicy.  I want my chorizo with yellow grease dripping off of it.  CPork was nice and tender and not overcooked.  B+Barbacoa was outstanding.  Great flavor and tender.  I will have it again. A+I added a picture.  Corn tortillas and shredded lettuce.  Good stuff!"], ["Newly P.", "Hole in the wall shop, but great food. I've had the tacos and quesadillas and they're both super delicious. They come stuffed with meat, cheese and a side of hot sauce, and you can grab a drink either from the cooler or order at the counter. There's limited seating area so it's best to do a takeout. The kitchen is tiny and open, and if you stand around, you can see them putting your order together. The lunchtime and evening rush can get a bit overwhelming for both diners and the kitchen staff. Great prices and great place overall!"], ["Lisa S.", "ABSOLUTE FAVORITE PLACE IN AREA!!!  for a good freshly prepared, the tortillas are homemade and NOTHING Like the corn tortillas outta the grocery store that I have tried to toast/steam/grill some softness into.  Very Authentic, just like the lunch places on the side of the road in areas of Mexico.   No crunchy tacos , just like Mexico and the list goes on.  THe chicken and pastor are a lil' dry and bland for my taste.  The Barbacoa is the BEST!!! with the Fish and Asada my favorites next.  I've not tried the chorizo yet.  The burritos are very good, my teens fave.  I tried the empanada in corn, I will try the flour next.  Never had a gorta, I must get to that one day.  The tamales ( chicken in particular) are THE BEST in town, PERIOD!  I make tamales every year for New Years ( grew up eating them at a friend house who was from Mexico) I've not found out what they do to make them SO VERY tender, moist and flavorful.  did I say this place was the best............. ; }they now have a 2nd location that opened in Madison 2 weeks ago.  I tried it yesterday - ; /    Just as I expected.  The prices are about 5% higher,  the tacos were exactly the same.  BUT THE SALSAS WERE AWFUL. The house salsa is NOT the same served on Canton Rd.- terrible can taste and look.  The green and spicy salsa were trying to be the same as on Canton Road but WATERED DOWN!!! the spicy on Canton is SO VERY hot I use 1 side for 3 tacos.  I used1 side per taco at the new location.  I suppose you have to cater to your neighborhood.  For me - I will continue to drive to Canton Road even though the Madison one is larger, and closer."], ["Duan C.", "Okay peeps, it was Friday night and I wanted Mexican - however I didn't want the Americanized slathered in cheese and paprika kind of Mexican grub, so I decided to take the better half to La Guadalupe. Now I did not give them a raving review, due to my first visit - but La Morena is pretty small and I knew I had a better chance of getting a table @ La Guadalupe. On my last visit I ordered an Asada (Steak) burrito and the guy fixed like a Taco Bell burrito and it ticked me off. But I was feigning for some \"AUTHENTIC\" Mexican and we gave them another go! Better half had the Asada Burrito and I ordered the Barbacoa (marinated shredded meat or you can just say pulled pork) burrito. Two ladies were cooking, they were really sweet and I think the proprietor was their too, yucking it up with some of her friends as well - everyone was really nice and the proportions were way better! I never questioned the taste, but when you have an El Famous Burrito in Chicago, your idea of Mexican food changes. I am glad to see that La Guadalupe stepped their game up a notch, because I know La Morena gives them a run for the money - when it comes to who serve the best authentic Mexican food in Jackson. Great tasting burrito, nice tight wrap, meat was seasoned pretty good, fresh cilantro and pico and the red chilli sauce they used was fantastic. They have really improved and they won me over on this visit.I can seriously recommend them now!"], ["Dave C.", "After driving around Jackson for 20 minutes trying to find another restaurant that our GPS told us existed, my wife and I happened to end up across the street from this little gem. The place itself is charmingly small, with seating for only about 15 people. According to the newspaper article on the wall, Guadalupe was established by a couple from Colombia as a grocery. But when that store outgrew this space, they moved it to a new building across the parking lot and started the taqueria in its place. During our visit, we tried a chicken empanada, chicken gordita, chicken taco and pastor taco. They were all delicious, but the real star was the empanada, which featured chicken, cheese, tomatoes, and avocado wrapped up in a corn flour pocket and deep fried. The tacos and gordita also included a slice of avocado on top, which was a nice touch. Unlike most empanadas that I've seen elsewhere, this one was huge (as you can see in the photo I posted) and was fried to perfection (not too greasy and with a bit of crunchiness to the outer shell).  In addition to all this, the prices were excellent (I think the empanada and gordita were about $4 each). I would highly recommend Guadalupe to anyone looking for well-done authentic Mexican food in Jackson. The service was friendly and the owners have put together a menu that features great portions and an exciting and delicious combination of ingredients, all while maintaining low prices."], ["Kevin L.", "Probably unfair comparison to El Farolito or other SF Mission taquerias, but the food here was honestly disappointing. Only redeeming quality was the horchata was one of the best I've had for some reason. That and the fact the owner was super friendly.I got the burrito with my choice of three meats. All the meat was cut way too thick so that big chunks of it would just tumble out. Filling was just rice and meat, so there was none of the cheese and sour cream to blend things to together. Only choice of beans is refried. And the salsa was more tomato paste than anything else.Also took quite a while for them to get the food out even though the restaurant was pretty empty."], ["Russ M.", "I went for lunch on the recommendation of @eatjxn of twitter fame. WOW, was this a great suggestion! No fancy, slick, typical Tex-Mex stuff here. This is authentic Mexican fare. The owner was great to make suggestions for me. I had a combo (3 tacos + drink for $8) I chose the 3 that he said were the most popular. I can't remember the names but, 1 was pork, 1 chicken and 1 steak...all were YUMMY!Folks that read my reviews know that I am stingy w/stars. 1 star and 5 star ratings are rare...you earn those. I give 5 stars straight up without thinking about it.Cant wait to go back"], ["Matt S.", "This little hole in the wall taqueria serves up some of the best tacos and burritos in the Jackson Metropolitan Area. Why anyone would go to a chain restaurant when they can get hot, delicious and authentic food for much less money is beyond me. If there's any problem here it is that they really don't have enough seating room to accommodate the crowds of people who love this place."], ["Hannah R.", "Good, cheap, authentic Mexican food. Been here a couple times, some items are better than others. The tacos, tortas, burritos and tamales are all winners (the tamales might actually be some of the best I've ever had). I also really liked the fried plantains, makes a great dessert! Wasn't too impressed with the rice or beans but eh, those are just sides anyway. Will be going back!"], ["Emile M.", "Long wait. Very fresh food and very good. Surprised by the quality of the food because from outside the place doesn't look like much. Wish I loved around there so I could eat there more often."], ["Eugene P.", "Been there twice, and both times the food was excellent. It is not fast food so expect to wait at least 10-15 minutes for take out. But well worth it!!!"], ["William H.", "So good! I try to stop by everytime I'm in Jackson. Tacos were amazing! Handmade tortillas. Try the combo with Mexican chorizo and al pastor. Horchata is great too!"], ["DiorAddict S.", "Amazing place! I always get pollo taco combination with everything in it and their mango drink. So yummy! And ingredients are always fresh!"], ["Scott T.", "Amazing tacos. Awesome service. Very cool spot. and the extra hot sauce is really EXTRA hot! :)"], ["Gigi C.", "Taqueria is a very small unassuming little restaurant that may seat 20 +/- people.  I go here about once a week and typically get chicken tacos to go.  I've also had the (to die for) tres leches, grilled jalapenos (smokin' hot goodness!), guacamole and chips.  The food is amazingly fresh with great flavor and well priced.  I only wish they would serve beer and/or margaritas. An ice cold Dos Equis would go so well with this fantastic food!"], ["Daniel G.", "Great quality food!  Their Al Pastor was done like you would eat in El Paso. Very clean restaurant, and turning into a hip spot to pick up a high quality taco. Great corn tortillas!  If you are a taco snob, this is your place. If you've ever lived in Austin and eaten lots of tacos and want to relive that experience...you can't go wrong with this place."], ["minimalist -.", "One of the best taco options in town.  Fresh tasting tacos, sopes and huaraches with homemade red, green (tomatillo) and orange (habanero) salsas.  Reasonably authentic (although the shredded lettuce seems suspicious)  but still incredibly tasty.  No alcohol so if you want a beer at dinner bring your own.  Tiny place with limited seating.Highly recommended."], ["Andrew M.", "Shoebox size restaurants excite me. They say that good things come in small packages and La Gualalupe is a powerhouse tucked into a relay-station.When you enter the restaurant you a greeted by a hybrid of southern charm and Latin hospitality. The family that owns it literally greets you with a friendly hello that instantly makes you feel at home.I like places I can get a meal for under 10 bucks and it tastes good, especially Mexican. I dont think you can even eat at Taco Bell for under 7 bucks these days.Ok, food:Torta- Great bread, juicy meat and great fixins, Rob loved this one and even ate a taco afterwards.Barbacoa- Great flavor, good spice and moistalicious. Great for tacos.Asada- Flavorful and Juicy.Pastor- It was ok, not as good as the Barbacoa or Asada, a bit dry, but did the job!Great meal. 3 Tacos and a drink (Jarritos, mind you!) for 8.50"], ["Kate W.", "BEST authentic mexican in Jackson hands down. The tacos are so fresh. Amazing chips and salsa. Love the small space, but once word gets out, they are going to need more room. This place is awesome."], ["Mike D.", "Great tacos from a real taqueria.  Always try to stop by when I visit Jackson."], ["Julian V.", "Delicious delicious delicious authentic tacos. The corn tortillas are fresh, the meats are pretty delicious, though the chorizo tasted a little off to me. I think it was the sauce I put on top, and not so much the chorizo. The tacos are super filling, the staff are SO SO nice. I'm not latin-american, and they were just super nice, and helped me decide what I wanted. I want to give this place five stars, but they do not have chicharron tacos, which was what I was craving. The asada is on point though, so do yourself a favor and stop by this place. Tacos are $2.25 a piece, or you can get a combo of three tacos + a drink for $7.50.I think they close at 9:00 pm. I wish they were open later!"], ["James B.", "Empanadas with any filling, topped with a slice on avocado.  Add a squeeze of lime and the red sauce!  Yes it needs a beer but I always get take out.  Friendly folks working in a small space."], ["Adam B.", "Went here and had a delicious authentic burrito.   It was very similar to the burritos you'd get from the taco trucks in Texas or California.  My wife had the fajitas and really enjoyed those as well.  I'll definitely be going back."], ["Alli B.", "Hole in the wall place but great.  Order at the counter.  Limited seating.  All food is fresh!"], ["Rob R.", "best tacos in Jackson. little restaurant can get crowded at lunch. fun place to practicar your espanol."], ["M W.", "Found this restaurant in Jackson Free Press.  Does not look like much on the outside but the food is really delicious, and always fresh.  My family loves this place."]], "Jaco's Tacos": [["Christopher S.", "Good Tex Mex in a convenient downtown location!I have eaten at Jacos several times, and have enjoyed the food.  They have everything from nachos to enchiladas and tacos...and lunch bowls with rice and your choice of meat.  The menu is large, and you can change the meats and mixes in your order...no problem!  They aim to please!The food is good, and the service is pretty fast.  Prices are reasonable, and they have a full bar (I have not tried the drinks yet, as I mainly go for lunch).They have a patio as well as inside seating.  And if the parking lot is full, there is more parking in back!This restaurant is in an older part of town and the building is a bit old...but I don't hold that against good Mexican food! :)  Try Jacos for some good cooking!"], ["Amanda C.", "Cool atmosphere! Melissa, fairly new waitress was very nice and attentive. Food was pretty good for Authentic Mexican Food."], ["Ryder T.", "The atmosphere is really awesome. I've been here a few times, most recently on a cool breezy evening. They have a sheltered, yet outdoor dining area that feels like no other place in Jackson. There is a big upstairs balcony when it is busy too.The food is very good, it's a little more creative and more carefully prepared than your standard Tex-Mex around here. The enchiladas are very good and have a selection of fresh sauces to put on them. The beans and rice are very tasty too! They have a perfectly acceptable beer and margarita selection which is all you need. They are pretty flexible in the kitchen and will let you mix and match your enchiladas or tacos.The main drawback is that some of the menu is a little pricey compared to other tex-mex. Compared to restaurants in general, they are reasonably priced. However I usually just expect Tex-Mex to be very cheap. On the other hand, they run specials fairly often, so you can do this cheaply if you try!"], ["Drew Y.", "Not so impressed with this place. I'm from New Orleans and the place was dirty even by New Orleans standards. Maybe they were having an off day. $10 for guacamole at lunch I don't think so"], ["Rachel P.", "The first time I ate at Jaco's Tacos was over a few years ago, and I was initially unimpressed. I can't remember specifically what it was, but nothing in particular stood out to me. Since then, I've been back a few times and I must admit my opinion has shifted radically. This place is actually really good! It's a spacious, casual atmosphere with a sheltered outdoor dining area that's just fantastic on a nice night. Located downtown, it's a great place to hang out for a few hours over tacos and drinks. The food is really, really good. They have a wide variety of Tex-Mex style options, and they prepare everything excellently. There's a great selection of sauces, ranging from mild to spiiiiiiicy. I'm a big fan of the pork tacos. The staff is friendly and super helpful when you're deciding what to order. The beer selection is good and their margaritas are top notch. The crowd here varies from night to night-- some nights it seems to be mostly an older crowd, but sometimes I'm surrounded by high schoolers. It's random, but never unenjoyable. They've got plenty of televisions in case you're wanting to catch a game and the bar has ample seating. It's definitely a good place to go with a group, though I would suggest calling ahead if it's a Friday or Saturday night."], ["Leslie E.", "Love this place!! Food was amazing!! Try the Philly cheese steak taco, may sound odd....but I promise you won't regret it!!! Salsa and chips are really good too!!"], ["Nick W.", "Visited here again since my last review. Still not cutting it, unfortunately. It seems like there are some really hard workers here, then some that just don't care. The food was good, but the service is what's lacking. Also, the men's bathroom was a mess with the trash overflowing. I will bump it up to 3 stars from 2. Hopefully they'll get it together soon."], ["Gene G.", "This place was very good. Had no complaints. Had the fajita dinner. Was delicious. Also tried some champagne Rita's."], ["Chris L.", "No complaints! Best chicken quesadillas I've ever had. 2-4-1 margaritas every Wednesday and awesome groupon deals makes this the best tex-mex spot in Jackson!"], ["Kristen M.", "One of Jackson's best kept secrets.  Looking at Jaco's from the outside won't impress but don't be fooled by the rough exterior--these people make a mean Mexican meal.  Take the dive.  My personal favorites and personal recommendations are the guacamole and the fried chicken tacos.  I've been going to Jacos with my mother for several years now since they opened.  In my experience this far they just continue to improve.  All the ingredients are fresh and all the food has a special Jaco's flair.  Any trip home from college isn't complete without dropping by to get my guac and tacos.  If Jaco's struggles with one thing it's consistency.  Don't get me wrong--the food is always good.  But sometimes it's good whereas other times it's the BEST.  You just have to get lucky and hope you drop by on a good day, but as of late the good days far outnumber the bad.  Same thing with service--sometimes the service is great and everyone's on task but other days (especially if they're packed) they struggle a bit to make rounds quick enough.  All in all though, when it comes down to food and atmosphere you can't do much better.  This ain't your typical Mexican joint.  This is the best taco in town.  (And the enchiladas aren't half bad either.)"], ["Kevin H.", "This was the first time here & pleasantly surprised. I had the lunch size steak rice bowl & could not finish it. Enough left over for a snack later. Better part was it was delicious. The staff was attentive & service prompt. Great experience."], ["Kenya H.", "If I could give 1/2 a star I would. The drinks and food was horrible. I obviously set my expectations way too high. I ordered the grilled shrimp enchiladas and the sauce looked as if the order had been sitting back there for hours. The kid's meal comes with just meat. We ordered the chicken fingers and supposedly it came with a \"salad\". I am so sorry but warm lettuce doesn't constitute a salad by any stretch of the imagination. Don't get me started on the worst margaritas ever. Apparently at this establishment the customer isn't always right. Mary took one bite out of her chicken fingers and said it didn't taste right. Let me go back to how it only came with meat. We ordered rice and beans to go with it. The manager refused to take off her meal. I have so much more to say, but I will save it for the owner."], ["Martha D.", "Went to this place after the Garden Show on Friday for lunch.  The place was gross filthy and one of the employee's pants were brown with DIRT - her pants legs at the bottom were wet and black from filth!! In addition the wait staff had dropped chips on the floor and the ice machine or something had drip pod water all over the chips which made a slimy mess.....later found out this dirty woman was the owner!!!!!!!!!!!  Almost forgot - o e of the employees or could've been the owner screamed to the top of their lungs a couple times - never found what that was about??"], ["Brandi S.", "This review is for service. Jaco's service has been hit or miss to say the least, but today I had one of the best servers I've had in a while in Jackson. Her name was Brenda and she was attentive, friendly, knowledgeable and genuinely seemed to like her job. She managed all of this without being annoying or fake in the least. Kudos Brenda!"], ["Tina J.", "My husband and I went to this restaurant  for the 1st time after work.We experiened the WORST customer  service  ever.  The waiter wore a hat and did not greet us.  Our food was  thrown on the table.  My order was wrong.   We could not enjoy our meal because of the waiter's disposition.  NEVER WILL GO BACK....EVER!!!  One star is too much."], ["James H.", "Had the Chimichanga.  Chips and  Chimichanga tasted like they used old oil.  Cheese in the Chimichanga was liquid nacho cheese from a can. Shredded chicken tasted funny. Portion was small for $12. Guacamole had an odd flavor.   Queso taste was off and watery. Group of five didnt even eat half the guac or queso.   This low food quality was consistent across al five of our dishes.  I dont recommend going."], ["Kam N.", "This place is suck . We went there for lunch around 2:00 pm there is only 5 table . It table almost 20 min to get a drink and hours get my food out . Waste my money ."], ["Tony D.", "Jesus Creeping Shit, this might be the worst AND most overpriced mexican food I've ever had in my life. The cheapest burrito is thirteen (!!!) dollars. Want a shrimp burrito? 19 bucks. Get the fuck outta here! Now, I travel all over the country, and I've never encountered a 20 dollar burrito. But we're all starving, so we suck it up & order anyway. Food that expensive must at least be quality, right?Wrong. My chicken burrito consisted of a few strips of grilled chicken breast, drenched in liquid cheese sauce with a few onions, rolled in a \"tortilla\" that was more like flatbread- thick and terrible. The sides of beans and rice were bland and poorly seasoned. It wasn't even that much food. I cannot understand how this place gets away with charging so much. Jaco's flat out sucks- avoid it."], ["Jeana S.", "Always always always delicious!  Most of the time when I eat here with friends we split a large fajita plate which easily feeds 4 people.  The staff is friendly and attentive, and the drinks are great!  Love this restaurant!"], ["Josh O.", "This place has an interesting set up and limited menu. However, the do a wonderful job with what they have. The three of us had chicken tacos, pork tacos, beef burrito, and veggie burrito. It was all incredible. Very flavorful. One guy got the corn covered with cheese and seasonings, and raved about it. The chips are seasoned, and the salsa was fresh, made in-house with just a little kick. I will definitely be coming here to eat again."], ["Sheryl R.", "I must say when we go to Jacos tacos it's not for a good meal!! To me the food is not Mexican! However the drinks there are wonderful. It's a great place to hang out with friends and laugh!! They have added some new menu items. The fried broccoli actually was a great appetizer!"], ["Jason E.", "First up:  Chips and salsa are great, but your party will be sharing a single large bowl of salsa verses smaller individual bowls, so no double dipping.  Drinks:  Teas and soft drinks are served in mason jars which automatically make you cooler than most restaurants.   They have a full bar with a variety of drink specials but I have not had the chance to sample these items yet.Appetizers:  The cheese dip is like everyone else stated, it appears to be a yellow almost Velveeta texture similar to rotel.  It is not bad, but not like most cheese dips Mexican restaurants offer.  The nachos are big and plentiful.  There is ample cheese dip (see previous sentence) and toppings on the nachos.  A meal all by itself.Food:  I usually stick with the shrimp enchiladas.  They are filling and have a rich creamy texture.  The avocado within them  usually goes unnoticed but I am glad they are in there.  The tacos are large but are made with the flat-bread like tortillas that previous reviewers spoke of.  The burritos and chimis are good, but it food quality can be varied at times.  Miscellaneous:  They have a kid menu of limited items, but chicken tenders are available so most parents should be good.  There is a covered patio like area to dine in that includes heaters during the cold months.  Be prepared to spend some time here, food is not prepared lightning quick (which is great) like other Mexican eateries in the area.  The staff has always gone above and beyond when I have dined here.I would still call Jaco's a bit pricey when getting Mexican food, but I do think it is a better quality than every other Mexican restaurant offers.  I just wish they would fix their parking lot."], ["Phyllis M.", "My favorite restaurant!!!!  Hard to believe I have 26 check ins but haven't written a review before now.  The food today was fabulous.  I'll be the first to admit that the food can be inconsistent.  Having said that, on a bad day, the food is still good.  On a good day, it can't be beat!  They start you out with complimentary chips and salsa that is made fresh each day.  And it is just that--very fresh with chunks of tomatoes, onions and peppers complimented by fresh cilantro.  We always get the guacamole to go with the chips.  In my opinion, their chips are the closest to the old Iron Horse restaurant chips that you can get in the Jackson area.I always get the chicken enchiladas.  Up until recently they were called Shredded Chicken Enchiladas.  Now, though, they have a brand new menu with many new items and the enchiladas that I love were renamed to Ranchero Chicken.  They consist of chicken meat that is cooked with tomatoes, onions and peppers that is finely shredded, wrapped in Jaco's specially made tortillas and smothered with the best sour cream sauce.Although there are many new offerings on the menu that look enticing, not sure that I will ever be able to pull myself away from the enchiladas.  They also have an app for your phone that will get you 10% off when you download it and then after 10 check ins you will receive $10 off of your bill!If you haven't tried Jaco's, you should!  If it has been a while, then it is time to come back and try it again!!!P.S.  I have never been to the Ridgeland location so this review is based off my experience at the downtown Jackson location."], ["Bryan H.", "Worst service ever! Food is subpar and drinks are all syrup. Don't waste your time coming here. I'm not from here and I'll never come back."], ["Draya A.", "HORRIBLE! I found a piece of hair in my food and instead of them even apologizing they still wanted to charge for it. Then the manager even ACCUSED me of putting my own hair in the food...after it was clearly baked in with the food. I will never eat there again and advise you not to as well because I not only felt disrespected but offended because they thought one of their loyal customers would come in and purposely put my own hair in the food. That's so distasteful and the people around me even complained on how the food was nasty! Thumbs down."], ["Jacquelyn H.", "I'm kinda on the fence about Jaco's. I recently had GNO there and we used a Groupon, which was no issue. Chips and salsa were great and I ordered Street Tacos. The corn tortillas were greasy and I couldn't eat them. I picked the various fillings out and ate just those. The pork was a super sweet BBQ which seemed out of place in a taco joint. Steak was a bit overdone but hey it was covered in cheese. Chicken was fine. Rice was a bit on the overcooked side but I really liked the beans.Our server was very attentive and pretty awesome. I would probably go again to give them a second chance and just order something different."], ["Joanne T.", "We had the best meal ever at Jacos Tacos. Philly cheese soft taco and grilled shrimp, spinach and avocado enchiladas with sour cream sauce.  They continue to add on to their menu giving you a great variety of new, awesome flavors."], ["Claire S.", "Literally had the worst dinner here this past weekend. The Mexican pizza was an afterthought and lacked most of the ingredients it was supposed to come with. Just chicken and barely melted cheese. My onions were raw. It was gross. Our server was fine, but overall service was incredibly sloppy. We witnessed at least 6 glasses full of drinks dropped and broken by different servers. I've been to jacos since it opened and since moving away, it was my first meal back in Jackson. RIPJACOS. Wasn't worth the money, tasted terrible, and took forever. I won't be returning."], ["Beth M.", "No stars....we had no server, the tacos were essentially greasy taquitos with no flavor and upon speaking with manager about our disappointment,  no effort was made to rectify our disappointment. The most terrible dining experience in my memory.  We are now on our way to get lunch elsewhere."], ["Ashley V.", "One star is earned because the salsa and chips are decent and the staff is okay. It seems like they miss the mark on the flavors of Mexican cuisine. That weird cinnamon-cayenne sort of works on the chips but I found it offensive on the taco shells. Besides that there seems to be greasy congealed cheese on every bite. I can tell that NOTHING is made in house. I feel like they have a great location and a lot of potential if they just keep it a little simple and a lot fresher. I don't want to badmouth a local business, but unsuspecting out-of-towners deserve to know and I'd want someone to tell me-- there are far better choices in the city for Mexican food."], ["Kevin A.", "Steak tacos were excellent! Not your typical flank steak, everything is fresh and top quality. My wife had the chicken quesadilla and they were also great! My son said the chicken tenders were the best he's ever had."], ["Marcie R.", "Finally, something different! Nice to see a place not called el-something with  the same old menu.  I had pork enchilada which comes with rice and beans (not the typical runny baby food beans you get at most places). Everything Wwas good, but I liked the enchilada and the beans the best... they were delicious. The queso also was great. It doesn't look like much from the road, and the parking lot is a bit bumpy, but I'm glad we went. It is also bigger than it first appears from the outside and has indoor and outdoor seating.The wait staff was friendly and attentive, they kept our drinks filled, and even gave us drinks to go when we left. We'll definitely be going back!"], ["minimalist -.", "You would think that a place with the word \"taco\" in its name could at least get tacos right.   But you'd be wrong.  Pulled pork served slathered in sweet BBQ sauce in doughy, oversized, herbed flatbreads with a melted garlic butter sauce is neither authentic nor an inspired riff on a classic.  If you just want to drink a bunch of beer and soak it all up with a some carbs then this place might work.   If you want great tacos head out to Taqueria Guadelupe, Carniceria Valdez, or La Morena at Old Canton and County Line.  If you want inspired Latin food in a fun atmosphere head to Babalu in Fondren."], ["Amanda E.", "Went to Jaco's for lunch today.  There were high points and low points.  My husband ordered the grilled chicken salad and i was jealous the whole meal.  It tasted amazing.  All the dressings are homemade and the Tequila lime was really tasty.I got the grilled steak mexican pizza.  On the menu it is described as something for \"eating light\" which in some regards is true.  It is a smaller portion but it is very heavy on cheese.. so it was not really light.  Another point to make is that their tortillas are not at all what you would expect.  They are more like an herbed flatbread as the other reviewer pointed out.  I didnt have a problem with that.  However, some people want their mexican to be a certain way and are disappointed if things differ.The salsa and chips were awesome! The queso was good too.  Just be aware that it is not white cheese dip like traditional mexican places serve.  It is orange/cheddar dip.  Which is tasty - just different so it is good to know what you are ordering.Overall - i'd probably give it a 3.5star if possible.  We will probably go back again.. and I will be sure to order the salad!!"], ["Hannah U.", "The waitstaff was terrible. The food was subpar at best. The chips and salsa were the best part. My brother and I both got lunch salads. The \"Comeback\" dressing, in addition to the server's incompetency and the lipstick that didn't belong to either of us on the rims of both our jars,  insured the opposite."], ["Richard D.", "Really good food, but the staff and the drink specials make this place. If your gonna go, sit outside on the patio and go on Saturday. Its all you can drink mimosas and bloody marys with the purchase of any entree. The staff makes it a point to get to know you and is very knowledgeable about the menu, so feel free to ask any questions about what they think you might like. We have made it a Saturday tradition in my house."], ["Marc M.", "Was there a few weeks ago. Giant plate full of food for lunch and it was good. Service was good and price was good. Would go back."], ["Stephanie M.", "Identity Crisis! Is this place a: Bistro, Mexican restaurant, Bar, upscale eatery?This is a amazing converted warehouse with a huge outdoor space and nice indoor area all with outdoor patio furniture. The space has high ceilings, concrete floors complete with old hazard zones painted on them (very charming). It was 96 degrees outside and the inside never got below 85 degrees.New menu started Thursday. We ate there Saturday.We ordered an shrimp enchilada & a chicken burrito & bread pudding & water. Prices are high.As with all Mexican restaurants we got chips & salsa. The chips were thick and kind of heavy. The salsa still had two whole de-skinned tomatoes in there. Nice flavor if you want to chop up your own salsa table side. Free.The shrimp enchilada was smothered in a velveeta based cheese sauce which is not right for such a delicate meat as shrimp.  Sides pinto beans (tasted like out of a can) and some extremely over cooked rice with a thick red grease. $15My chicken burrito was ordered very simple and the rice was the texture of beans but so greasy and slimy it was nearly inedible. The tortilla was spiced with herbs and thick but nice. I did not order cheese on top but they cut both ends of the burrito so I could not pick it up and eat it without a fork?  Rice on side was same overcooked mess but whose grease was so thick that it covered the entire plate. Same canned pinto beans on side. $13I joined YELP today to write a review about the dessert here so nobody suffers the same fate as we did and tries to eat it.The most repulsive part of the meal was the bread pudding described as \"with a twist.\"  But let me tell you this was the most tortured, greasy, mess I have ever seen! They topped it with some bizarre grilled cheese.  The pudding was greasy and un-sweet filled with tons of sliced almonds and golden raisins drizzled with honey....but otherwise just a heavy ball of flavorless grease that looked like vomit but with the aftertaste of canola oil and spoiled cheese. For $7 you would expect something edible but apparently not at Jaco's Tacos."], ["Ian D.", "Really enjoyed this fairly new tex-mex restaurant! The ingredients are very fresh and the quality, and quantity are top notch. The nachos are a perfect appetizer or full meal and the steak was perfectly cooked. The tacos are served with a \"gordita\" style tortilla and the mix and match style available are a great way to stay \"fresh\" on repeat visits. We'll be back often!"], ["Clif W.", "I thought it was really good. Yelp must have some picky eaters. The people who worked there were pretty nice too. If you're looking for some good Mexican food, I'd for sure recommend."], ["Eric L.", "Good tacos, but priced slightly high, i.e. small scoop of guacamole is $1.50.  I got the added bonus of having a spinach leaf (or something) stuck to the inside of my glass inside iced tea.  Friendly wait staff and although I had lunch, it looks to be a happening place in the evening with a full bar and two stages for entertainment."], ["g e.", "Ive been here twice now while visiting Jackson. First time it was quick and very good. Second time it was very slow, but was very busy. Can't complain about the food. Server was very nice. I will say they need better chairs. Very uncomfortable. All in all a good place"]], "Las Margaritas Mexican Restaurant": [["Dave C.", "Good staffFast serviceOk food"], ["Steph B.", "Horrible. The food tasted and may have been all processed products. The guacamole tasted and had the texture like it came out of a tube. We were with a group, which is always a challenge for restaurants but this place doesn't have the starting conditions for a decent meal. Oh, and the waiter messed up all the orders then tried to charge us a double tip"], ["Allison M.", "I went here after a friend recommended it. I heard quite a few people the restaurant was really good but I'm now convinced that the drinks must've attracted them. I ordered a steak fajita and it wasn't anything special. I was disappointed because I could've gotten something better somewhere cheaper. I don't see myself going here again."], ["Ty C.", "Simply love this place!  I've never had a bad experience here. Friendly staff that's very informative when it comes to questions about the menu. Good family friendly atmosphere with TVs. Inside or outside dinning. Lots of great menu choices and the prices won't hurt the budget. Can't comment on the mixed drinks, never had one. But from what I've been told there just as good as the food. Great place to take a date or just hang out with family and friends."], ["Mike P.", "no consistancy here some days its great others is mediocre at best.  On this visit i waited 30 minutes at my table with the kids and didnt even get a drink order put in servers just wizzed by and around to tables around me and my kids so we got up and left the hostess asked why we were leaving and i told her she didnt try to stop us or apologize.  will not be back"], ["Brandon T.", "I like this restaurant solely on the fact that you can get some of the best entrees but not listed on the menu. The carnitas can be ordered in any of the combinations of foods such as chimichangas, tacos, burritos, enchiladas, etc. and they charge it as the same price as shrimp. I can actually say that I crave these carnitas from this restaurant. Also good is the shrimp. I like their entree combination platters. Their margaritas are good and they have a decent happy hour. Call ahead and ask what their specials are!"], ["Amanda B.", "Terrible food and service... From a Texas that has grown up eating real tex-mex with good hospitality the beef tasted boiled and the qua smile looked like it was squeezed out of a tube. Also the salsa was more like marina sauce heated in a microwave than actual salsa. Also they are terrible with big groups. They messed up all of our orders and then tried to get a 38%. Don't go here if you want decent Mexican food."], ["Kenneth H.", "This was a horrible experience the food was mediocre and the female manager does not have customer skills at all. The waiter charged me extra for items he stated were not an extra cost.  After receiving my bill he then acted as if he did not understand English very well so the female manager had to come to the table.  This manager was unfriendly and rude from the beginning.  She just walked to the table did not smile, did not greet us or anything, she just looked at us.  We ended up greeting her and then she was still extremely dry with her response.  She acted as if she did not want to be bothered. As I was explaining to her what the waiter had told me she was not listening. She was looking in the menu pointing to the items as if I was not capable of reading. Instead of taking into account of what the staff member had told me she continued to point to the menu and tell me what it stated.  I have never experienced anything like this before and I told her I will not be back."], ["Pat T.", "great tacos!  love the food, esp papitos!  service can be hit or miss but usually really good"], ["La'Keisha N.", "This is the WORST Mexican restaurant I ve ever been to! The food and the staff was horrible and they have no customer service! We left a to go plate on the table, came back 5 minutes later and they had thrown it away. I ve never been to a restaurant where they won t fix more food or work with you at all. We also had an issue with a DISGUSTING salad that they wouldn t take off my ticket.  I'll never eat here again!"], ["John L.", "Don't waste your time. I've given then too many chances. Bad service, dirty, greasy, bad service, just pitiful."], ["Jonathan C.", "Went with a party of ten during lunch hour. Services was efficient, food came out fast and hot. Awesome portion size - impossible to leave hungry. Ingredients seem fresh, nothing skimped on. For Mexican it's solid."], ["Adam B.", "Good authentic mexican / texmex food.  Most of the staff speaks spanish, so you know it's good.They have a full bar, but it wasn't open when we were there (probably because it was Sunday Sunday Sunday)."], ["AnaMaria B.", "Wow! The Fiesta Dinner @ $8.99 what a deal. Chile Relleno, tostada, beef taco, enchilada AND tamale!!!  The chile verde dinner was screaming!!!"], ["Johnny D.", "this was a good restaurant I found in Clinton MS. didn't think there would be any authentic Mexican food out here but this place is pretty legit. i've already been out a few times. its really easy to get full off the salsa and chips because of how good they are. try the pollo margarita dish! definitely worth checking out again."]], "Taco Bell": [["Andrew K.", "This was my first trip to this TB locale. Service was quick and order was accurate. Food was actually hot. I used the drive thru and ate in my vehicle so I could catch a radio program. Couldn't speak on the interior condition, but they were rather busy at lunch time. I would stop here again. Now TB as a chain has really burnt my bacon!  My two favorite items were the chili cheese burrito (best item ever by a long shot) and the beef encherito. I was hooked on these things since the encherito had black olives on it. 20+ years or so. BRING EM BACK!  Can't give out more than average rating until that happens."], ["Baron M.", "As the first reviewer here mentioned, I'm a bit embarrassed to say that I do enjoy Taco Bell. I don't think it is anywhere near as good as most of the other Tex-Mex places in the area, but he is right about it being cheaper. I generally only go about once every year or sometimes every other year, it just isn't a place that pops up on my radar that often. The Doritos Locos Tacos brought me in this time and, while I thought they were downright tasty (there are days when you just want a taco with some cheesy Doritos and don't care that the meat isn't all meat, etc), the actual location could use a bit of cleaning. The bathroom was on the verge of flooding, but I will say the floor in the actual dining area was pretty clean (the lady behind the counter came out to clean/sweep in between customers), but it just felt neglected somehow. But, that isn't why I went with 2 vs 3 stars, it was the preparation of my tacos. I don't expect them to be full and brimming or even look like the photos, but I ended up getting an extra taco to go because the first two were so lacking in substance. All this said, I'll go back at some point, probably in another year, and it will be to the same location because it is very convenient to work. I wouldn't tell anyone not to eat here, but I certainly wouldn't suggest that anyone come to this location if it was out of their way."]], "Jose's Tamales": [["Joe H.", "I was a little concerned checking out a Mexican restaurant in Mississippi but traveling in the south as a vegetarian is a challenge and veggie fajitas are always a fantastic option. Restaurant was well lit and I was greeted immediately by the hostess. Great wait staff whom was very attentive. I ordered a Dos Equis and veggie fajitas which arrived immediately. The veggies were perfectly seasoned and the yellow rice was as well. Salsa and pico were also delicious. Would definitely come back, this will be my spot in Pearl for the foreseeable future."], ["Molly M.", "This review is for Tuesday 2/17/15-The food was lukewarm when it got to the table (it arrived not ten mins after we placed our order)which was a bit disappointing. The service was great and it would have been perfect if it had been hot."], ["Lori H.", "The food was great. The heat was perfect in the salsa and tamales. Service was fast and friendly. The drinks were good and well priced. Portions were big, come hungry."], ["Brandy F.", "I've never been to Jose's before today, and my family and I were looking for another restaurant and found it was out of business. Decided to try Jose's and was very pleased. Our server, Ben, was excellent, with yes sir and yes ma'am manners, attentive to the diners needs at every turn. I will definitely add this place to my list of Mexican restaurant options. The salsa was delicious, the chips seasoned well, as was everything I tried. I hope they stick around."], ["A C.", "Quiet mom and pop place. Even though it's a Mexican restaurant, they lack the feel of it. Good food. Friendly server."], ["Deon P.", "I'm not sure where the other reviewers went to, or if my family and I just got lost, but we must not be talking about the same place. We noticed no Latinos, which for me as a tourist is a concern because I was looking forward to authentic Mexican food. The tables and chairs need to be steam cleaned, the floors need to be degreased, and the menus need to be washed, preferably in a dishwasher. We could not get ourselves to the point of placing an order and we slipped out the door when no one was looking. Good luck, and may your hand sanitizer protect you."], ["Kevin L.", "Strange that I had to go to Mississippi to get some of the best salsa I have ever had. It, along with the chips, we're the highlight of my meal. The tamale I had was on point. The chimichanga trio was a generous portion and they were all tasty."], ["James B.", "Quite good Mexican food.  The pork dishes are very good.  The green sauce is excellent."], ["David P.", "Best Mexican food in Jackson. The salsa is perfect. I've lived in Dallas and visit family in San Antonio regularly, so I know what good Tex Mex is. It's in a dry county but they're always stocked with a good selection of Mexican beers."]], "Salsa's": [["Anissa F.", "When I'm in the mood for Mexican food this is where I come. The food is consistently good. This is best Mexican Restaurant in this area. Don't waste your time or taste buds with the others."], ["Christina B.", "Graciously located right next to the Holiday Inn that we stayed at, this place is a cozy, little restaurant in a tiny little strip mall. It had a very nice atmosphere with bright colors and a really neat tiled floor that will cause your chair to sit on only three legs. We were wobbling throughout our entire dinner.Excellent chips and salsa! We went through three baskets and each time, they came out hot and fresh. I expected the salsa to be a little spicier but it was good nonetheless.Me and my compadre both had the fajita steak quesadillas and although they were excellently cooked and seasoned, there was too much cheese on mine. (I know, is there even such a thing as TOO MUCH cheese?) They also weren't cut, so it was more like a big messy burrito! I will say that the fajita steak was very tender and juicy and I would have been happy with just a huge plate of that.My husband had the #78 which is the pablano chile relleno and his exact words were \"this is the best I've ever had\". The kids choices are very limited and they offer thing like a burrito, taco, nachos and a quesadilla. The kids nachos were fair but she didn't like them because the \"chicken tasted funny\". I wish they would have had a few more American choices such as chicken nuggets or a hamburger.Our food was out super fast, the chips and salsa were fantastic, our waiter was efficient and friendly, there is a ton of dinner and lunch choices and like my husband said, the chile relleno is the best he has ever had. We will be back and I think I'll try something new!"], ["Ryan W.", "Food was decent.  The service was pretty poor. The keg beer bud light tasted like it was skunk beer."], ["Chloe W.", "We found this place from Yelp. I am a Mexican food LOVER and this food was some of the best Mexican food I've had. It was very fast and tasty. It was a wonderful stop on our long drive."], ["Mitch A.", "Salsa's is sort of a middle of the road Mexican joint. The food is pretty good, just not great. If you're here, don't expect to be blown away, but it's worth stopping in for a bite simply because it's affordable. Every day from 11-3 they have lunch specials for $5.75 and under. You get large portions for a great price, which in my opinion is a win. The food is mediocre, but it's kind of a fun atmosphere, and again, very affordable at lunchtime. There are better Mexican places in Jackson, but if you're in the Clinton area and you're looking for something cheap, Salsa's isn't a bad bet."], ["Brandon T.", "I'm basing my ratings on the area - Clinton, MS. I think the quality of food at this restaurant is decent. They have reasonably inexpensive prices here and items can be ordered a la carte. The staff speaks mostly Spanish making it seem authentic, however they are sometimes quite slow. Not the first choice, but they also have a good happy hour and can make a good margarita."], ["Krystal A.", "I will start by saying the service here was great and the decor really cute. Regarding my food however, everything was just \"ok\". Although I did enjoy the chips and salsa. They have spice mix you can sprinkle on top of the chips that I enjoyed. I was craving Mexican, looked on Yelp and they were right next to my hotel.  I got a combination meal of a beef taco, cheese enchilada, and chili relano. The price was amazing for a dinner combo of only $7. The taco comes in a hard shell, (I was kind of hoping for a soft corn tortilla) with just meat, cheese, and lettuce. I added some salsa and it worked better. The chili relano had a cheese sauce in it which was not what I was expecting, but not bad. The major turn off though was that the chili relano had a ton of seeds in it toward the end. I expect some but this was a bit much. The enchilada wasn't bad but the  sauce was a tad salty. You can't beat the price of their combinations for a large variety at $7 each. However I feel that if I were to come back I would get something off of their specialty menu, which had some promising options, for something with more flavor."], ["Gray H.", "Ever been to El Sombreo in Vicksburg, just like that. The food is no different. I don't mean to say its not good, it is, but its not special."], ["John L.", "Carnitas, Chile rellanos, fajitas, Chile verde, Chile Colorado(hot!)...their creamy refrieds are delicious, chips, excellent salsa, ...top in this areas offerings in this fare, all of Jackson, too. Seriously."], ["Dreka G.", "This was a pretty good meal.  I had the carne asada and my husband had the steak tacos. The steak was a little on the dry side but topping it with a little guac, onions and peppers fixed that right up! The guac was quite tasty.  For a quick, cheap meal, I'd go back."], ["Erin D.", "This place is tasty, reasonably priced (definitely on the cheaper side), huge portions and the service is always good."], ["Austin J.", "The food was better than I thought it would be, very cheap compared to how much food you get. Paid $7.00 for a burrito a little longer than a foot. Great service but a little crowded around dinner time. I'm definitely coming back. :D"], ["Ellen D.", "What a gem on the western outskirts of Jackson!  We stopped at Salsa's for lunch while passing through the Jackson, MS area on I-20, and were very pleased.  The menu is extensive, and with its 6 pages of dish descriptions in 9 point font, would probably have taken us an hour to read in its entirety.  Thankfully there are helpful titles for the various sections, including a lunch special section and a vegetarian section.The food itself:  Chips and salsa were tasty and above average for this part of the country; 1 taco lunch special with rice and beans was delicious and the perfect portion size to allow us to roll on down the road without needing a nap; the vegetarian fajitas were tasty and included many different veggies (the usual squash, peppers, and onions, but also broccoli! and cauliflower!).  In a word, yum.Our only minor complaint was that it was a bit drafty in the restaurant, and we happened to eat there on a cold day.Weekday happy hour (4 p.m. to close) sounded promising: 2-for-1 beers and margaritas.  There was another sign saying kids eat free on Wednesdays.Oh, and the grand sum for our lunch for two (no drinks):  $11.49.  Yippeee!!"]], "El Sombrero": [["Sabrina R.", "The food is excellent here. The chips, salsa and especially the tortillas are made in house and delicious. The fajitas are always yummy and are delivered to the table fast and sizzling. The service is sometimes lacking but the managers are great guys and very friendly. One waiter in particular is excellent. Ask for Edgar. He will take care of you. This is the only Mexican restaurant in the Jackson area that I'll eat at."], ["Michael S.", "The layout makes for a noisy restaurant when it is busy compared to the other Mexican restaurants near by. Food is good with average portions. Average prices and average drinks. Overall a good place to eat nothing bad but nothing great either. A large building, plenty of room for large groups and I have never seen a wait at the door."], ["Don S.", "Great authentic Mexican restaurant. The outside and lobby area not impressive but once in the dining area it is very comfortable with great ambience. The food is outstanding if you like and appreciate authentic restaurants.  I definently recommend this place.  I travel a lot and have eaten in several Mexican restaurants in Texas, New Mexico, Arizona and California along the border and this place can easily compete against any of those restaurants."]], "Papitos Mexican Grill": [["Sarah T.", "Papitos is a pretty good restaurant. I really enjoyed the sangrias and enjoyed the low price even more! The chips and salsa are all right, but the entrees here can be really great. This is a perfect place to meet your friends after a long day of work. Go eat here!"], ["Nathan A.", "This meal was incredibly disappointing. The atmosphere was adequate. Service was very slow. They didn't take our drink order for ten minutes.The food was cold. We ordered queso and the Papito's dip. Both were cold. The food we ordered came quickly but it was cold. Makes me wonder if their microwave is working. The food was bland; had very little seasoning. I had the enchiladas supremas and it was sad. My wife ordered the tacquitos. They were burned and the chicken inside was burned also.We won't go back there.Overall a poor meal experience."], ["John A.", "From Houston... the heart of tex-mex... Really good salsa, very fresh!  Ordered the lunch chicken fajitas.   Pretty good. Hefty portion, good veggies, but the chicken could be thicker slices instead of thin strips.  But good flavor.  The tortillas are right out of the plastic bag.  Their rice and retried beans are ok.  Overall as good as any run of the mil tex mex joint back in Texas. So pretty good for Jackson."], ["Cimmie S.", "Totally disappointed. We have eaten here before and loved it. Our waiter could not answer our questions and quickly told us this was his 4th day. Our food came out cold and at different times. We are not going back."], ["Crystal S.", "Overall good place. Basic TeX Mex. I will say the guacamole was good. Most of the servers are Spanish speaking and either speak softly or little English. They do have 2for1 margaritas in a variety of flavors. The salsa was OK, nothing out of the ordinary. Service was good, speedy. Atmosphere of typical TeX Mex. Nothing bad to say."], ["Talia G.", "My friend girl and I went here for lunch... we enjoyed it... I had the tilapia and rice and she had the beef chimichanga.. everything was good. ."], ["Toni D.", "This is probably one of the worse places I've been in awhile.  Waiters were not bi-lingual; orders were all wrong and just an all around horrible experience!"], ["Victoria S.", "Great food and fun for the family!!!! There food is freshly cooked with a tex mex flavor. Our waiter was very attentive to our table. And we have never had a bad experience!! You have to go. Order the chimichanga they have beef chicken or steak I believe."], ["Brianna S.", "The food was decent. It was far from the best, yet not the worst. I ordered the shrimp tacos and there were about 4 tiny shrimp in each taco! The ambiance is where it makes up. I would recommend coming here if you are more focused on having a good time with friends than eating a delicious meal."], ["Chaitanya K.", "A tex mex place with mediocre to average food. The ambience is nice although it can get a little too noisy. Ordered the guacamole which didn't really taste like it was freshly made. At the same cost, I could have double the guacamole made table side at Babalu. For my entree, I got the chicken fajita. The chicken was a little too dry and wasn't the best. I don't think I will repeat."], ["Sara C.", "I received the worst service I have every received in my life this past Sunday. April 12, 2015 around 3:00pm. Here's what happened: After being seated on the inside, it took our waitress 30 minutes to come to the table. Her attitude was very horrible. If she didn't want to do her job, she should have stayed at home or seek other employment. We asked her could we order our food at the same time as I drinks (to make the wait shorter). She insisted on getting our drink orders first. That was another 30 minute wait. We ordered the 2 for 1 margaritas and waters. (I asked for water 5 times over the course of our time in that establishment and never got it). She brought out our drinks and finally took our food orders (at this point we'd been in this place for an hour and still no food). After another 45 minutes, we see tables that were seated after us receiving their food and we still hadn't received ours. She finally brings out a full tray of plates...only 2 plates came to our table and the rest went to other tables. When one of us asked what seemed to be the problem and why other tables that were just seated receiving their food before ours, she leaves and comes back with a plate and literally slings the plate at her. No exaggeration. What if that plate had been hot? We eventually get the manager to vent our frustration, and he has a horrible attitude as well. After he grabs the 2 plates off the table that we did get, he tells us that we can leave after we pay for half of those 2 for 1 drinks. We wait again another 30 minutes for the receipt to pay that we never got. Finally, we each took out $3 and took it to the hostess and walked out. The reason we did that was so that they couldn't call the police for us leaving without paying. They had no intentions of printing us out a receipt anyway. The only reason that I am giving this establishment 1 Star is because there isn't an option for a negative rating. I will NEVER dine at this establishment ever again."], ["Doug B.", "There must have been a 1/2 chicken in the tortilla soup, it was very filling.  The tomato-ey salsa grew on me.  The large homemade chips forced double-dipping.  My pet peeve - lot's of 'half price magaritas' signs, with no prices on the menu - turns out not to really be a good deal.  I got the fajitas, they didn't come with enough tortillas, but my server did offer more.  Service was average."], ["Christopher S.", "Solid Mexican place. Good food, good margaritas. 2-for-1 margaritas at the bar, seemingly every day all day. Manager, Alberto, will fix any problem. Warning - Thursday nights are Karoke nights - packed up full."], ["Ieisha E.", "I was definitely skeptical about coming to this restaurant. However, once I got my food, I was pretty content. I ordered the enchiladas. They were pretty good! The flavor was cheesy and the chicken inside taste good. The salsa and chips were pretty good as well! There's nothing like fresh salsa and warm chips"], ["Abie F.", "Service was perfect and fast, and the fajitas were wonderful. The drinks are also interesting. Came because it was the only thing open late, and was surprised at the treat!"], ["Augustine A.", "Food was great. The portions were large. The prices were good. The hostess was looking yummy. I didn't have room for desert."], ["Miriam A.", "Excellent service and great food. The kids twisted my arm to get cheesecake to share-wow! It's a cinnamon pastry with cheesecake in the middle served with ice cream. Yum!"], ["Nikki B.", "The food was good, but was not impressed with the service. Our server did not know what tonight's special was, even though it was posted at the front entrance. There was an issue over the bill because my friend ordered the special and our server questioned if the special was for lunch time and not dinner. When the bill came back, it was doubled because they added my meal to her ticket... Eventually it was fixed but again at least the food was decent."], ["Lacey O.", "A Papitos Mexican Grill just opened in the old Maccaroni Grill on Ridgewood Court in Jackson, so my husband and I decided to give it a try....PROS:1. The building looks nice, and they added an outdoor patio. But it's too hot right now to sit there.2. The staff was all very nice.3. The salsa was good.CONS:1. The menu did not have beer, margarita, or any other alcohol prices. I asked my server, and he wasn't sure. I may be cheap, but I'm not going to order an over priced 10 ounze margarita or a $4 draft beer. I want to know how much I'm going to be spending. 2. As with other Garcia family Mexican restaurants, they served mediocre, over-priced food. I ordered a chicken and steak quesadilia with peppers and onions. The meat was cooked fine, but the peppers and onions had very little flavor and were under-cooked. My husband just got a taco salad, but said the shell was not very good. Most everything else was priced $5 to $8 more than the same thing at my favorite Mexican restaurant.In this case, 2 cons outweigh 3 small pros. I don't think I will be going back.If you want good, cheap Mexican food, try Cazadores."], ["Master D.", "I guess I should not have expected to much and the server was great. But, over all, the food just did not deliver. It has a great looking patio and I can imagine that when it is under 100 degrees, it would be a fun place to hang out and party. I hate to give negative reviews when there is some effort, but the food was bland. My suggestion is to fly in a chef from Los Angeles or San Diego and whip up some real Mexican food. The interior is great and the service is great, but you gotta have good food to get me back."], ["Eric H.", "Slow Friday for them, but took over 2 hrs to serve table of eight. Manager never came out to check on us until the end of our rushed meal. He Brought shots of tequila to table with pregnant lady and 7 others all rushing to get back to work. Guess that was our freebie? Smallest taco combos ever. Spoonful of dry meat. Had to remind them beans and rice come with meal. Wow. Madison Papitos is great. Good luck at County Line. 1 star for good weather and nice patio."], ["Danielle T.", "Great service and awesome authentic Mexican food. I have been to Mexico and this duplicates my experience. The 2 for 1 margaritas top it off."], ["Thomas D.", "I've eaten here several times now. Good service and food. I would especially recommend the nachos and 2 for 1 margaritas, very economical."]], "Los Parrilleros": [["Kumar P.", "The ambiance was great and the food even better. Finally a place that knows \"spicy\". Big fan of Churritos but definitely going to make this my usual spot! They also did an awesome birthday set up for our neighboring table!"], ["Richard S.", "Service suck ass  food was greasy  waiter spent his time at the bar talking game to some under age girls who were drinking alcohol!!! Will never go back!!!"], ["A C.", "Good atmosphere. Good good. Staff was attentive. Vegetarian friendly menu. I've seen more vegetarian choices here than other Mexican restaurants, they are not just substituting beans for meat. Only one Mexican beer on the tap though, i was expecting to see more."], ["Abe M.", "Traveling through and ate dinner here.  Food was delicious and service was great.  Highly recommend"], ["Morgan F.", "Not very good. Salsa was sweet, food was greasy, frozen margarita was basically ice only. Don't waste your time or money. The only positive was the food came out really fast."], ["Jose E.", "Not a huge fan of Mexican but non the less I do enjoy the food. This place has a decent set up and a nice atmosphere. I could've done without all the bachata music playing. The chips were stale and the salsa needed some spice. I ordered pollo a la parrilla. It was ok. I'd like to come back and try something else. Prices are very reasonable and very well worth it. Not top notch but still good."], ["Heena P.", "This has to be one of the worst places I have been to. We were traveling through and were very unhappy. The food was nasty(no flavor). The customer service sucked. We ordered two kids meals and they both came out wrong. Then to top it all off, my two girls went up to the hostess and asked for balloons and she said NO. Shortly after that she was handing out balloons to other children and looked at us like we were crazy. Maybe they discriminate????"], ["Ursula W.", "Food was not good. Waitress was not interested in giving good service however when we told the manager he tried to make it right but by that time we lost confidence in their ability to cook something else. By pass this one."], ["Arkansas G.", "Probably the best cheese dip in Rankin County, but no one speaks English as a first language. Forget about calling in. Doubt anyone there is a legal immigrant."], ["Denver M.", "Good Mexican food at reasonable prices. Food was fresh, portions large and service was very fast. It is located in a strip shopping center at the opposite end from McAlister's Deli and the block behind Ruby Tuesday's. You can see it from the Holiday Inn Express. We were staying at the Comfort Inn and it was about a four-minute walk. If you are staying at a hotel, it may be helpful to ask directions at the front desk - our two phone aps gave conflicting directions. There are no sidewalks in the area, so you may want to be careful walking after dark."], ["Sandra N.", "The food here is terrible.  I ordered a chicken quesadilla took one bite and left the rest on the plate.  There was 3 little pieces of chicken in it, lots of grease, a few oddball chunks of peppers with barely any cheese.  They fry everything on a flat top grill with lots of oil so everything tastes the same.  The salsa is very mild and bland. The lighting in the restaurant is extremely bright like surgery is going to take place.  This was our second time here and our last.  This review is for the Brandon location."], ["L. H.", "Everything on the menu is very inexpensive for a Mexican restaurant so you get what you pay for in that regard. But it's very clean, service is very friendly and fast. You also get some chips and salsa to munch on while you wait a few minutes for your food. They always seem to have business at all times of the day, which is a great sign. It also appears to be a great place to meet up with some friends for drinks. My only complaint is that they add more flavor to the food - more Mexican, less American!  Overall decent pick."], ["Wendy L.", "Far cry from Mexican food.  Beans & rice?, BLAH. Fajitas?, strips of beef & chicken smaller than my pinky finger. If u have an ulcer or GERD this place is probably right up your alley. If you want authentic Mexican food & are on the Coast, you'll find Juan Tequila's much more satisfying."], ["Mike K.", "Good food, cheap beer, what else can you ask for? Maybe a little spicier picante sauce for the tortillas. The fajitas were fast and very tasty. The refried beans left a lot to be desired, but the other sides were fresh and very nicely presented. Will definitely be a return customer!"], ["Carlos A.", "Good Mexican food. Good service. Price was very good for what you get."], ["Jacquelyn H.", "We are regulars here for good reason. Everything we have tried has been wonderful. The entire staff is friendly and professional but Sal is a rockstar. Very glad this gem is in our neighborhood."]], "Sombra Mexican Kitchen": [["Darrell B.", "This place is great! The atmosphere is great for dates or large get togethers. The dinner menu is different from lunch but both are phenomenal! Def need to try this place! The chips are worth it!"], ["Beth M.", "I have loved Sombra since it opened several years ago..... and was in area and decided to run in for lunch. What a total disappointment! The restaurant is just a shell of it's former self - from the salsa and chips to food quality to service. Our queso was cold and chunky. Our order was completely wrong and we had to flag down another server to help us. The salsa was bland and our service was slow, disinterested and awful.I will not be back.Do yourself a favor and skip this one. You will be glad you did!"], ["Rebecca C.", "Disclaimer: I am a native of Southern California so my bar for Mexican food is rather high.Came here while traveling for work and sat at the bar. Bar tender was very friendly and attentive.Ordered the tamale platter. Masa was good, but of the 3 sauces the green sauce was the only one with flavor. Would be nice if they had pork as well as chicken, but I know how long it takes to make tamales so I understand the reduced selection.The martini I had was a shame. Ordered it on the rocks, was served it in a martin glass with ice in it. No. Absolutely not. Martini on the rocks means in a rocks glass with ice. Also ordered it dirty with extra olives. Bar tender informed me after he served it that they don't have olive juice, so he muddled the olive instead. What?! A full bar should have olive juice on hand, but you should definitely tell the customer before hand if you don't have it. And why would anyone enjoy a muddled olive? I will say the bar tender asked another staffer oIf they had a new jar of olives and reshook my drink with some juice, but it wasn't tangy enough for my taste. Also never got those extra olives, which would have helped tremendously. So overall good ambience, ok food, terrible martinis."], ["Ryder T.", "I have wrestled with my thoughts on Sombra for a while. I'll settle for a perfectly acceptable 3 stars. The food is mostly tasty but is a mixed bag. The prices are reasonable. The atmosphere is pretty great too.I'll start off with the bad - the guacamole and queso are always disappointing. I don't really get how that happens, but it is always a let down. The rice and beans that come with most dishes are not so tasty.The main menu is pretty good, and there is a decent range of things to try. I love the black bean tamale and the burrito is pretty tasty. I would put this one in the same category as Jaco's Tacos - it is a little creative spin on typical Tex-Mex. Jaco's however, is clearly more fresh and flavorful with everything. Sombra just disappoints in a lot of ways. It is decent value, and there are some dishes that I like, so I will return, but know there are better options."], ["Stephani J.", "The food taste pre fab, the service is nothing exceptional and the portion size are enough for a family of four. I won't be back. There are better eateries with nicer staff."], ["J D.", "I had eaten there before and it was very good.   This time,  staff very laxed...  Lack of management i guess. Chicken tamales were dry and not very good. I remembered a better experience the previous visit for sure. My waiter  (bar tender) was very slow and he made us wait as we watched him watch tv and do other things instead of seeing about our group. A good manager could get things in shape there..   Hostess was missing when we arrived too so we Stood there waiting and waiting..  had to go looking for her.  Unprofessional."], ["Mallory L.", "Kristi M was our server my friend and I celebrated his birthday here and had a blast. We started with guacamole and added pick de gallo. Absolutely delicious with jicama and carrots and healthy alternative to chips but definitely cants stay away from those! He had the redfish and grilled veggies that Kristi recommended! Definitely impressed. I had the frozen township margarita which was the perfect blend of tequila and mix. We had a few birthday tequila shots and took Kristi's suggestions and tried a few different ones! Great meal and such a fun atmosphere. Go back again and again!"], ["Ron D.", "Local favorite.  Nice atmosphere and good drinks. You save a little before 6pm.  Knife and Fork Ribs fall off the bone and are among the best around. Smoke-Free!!!!!"], ["Chris P.", "It was good but seemed like the same thing I could get at El Sombrero for a few dollars cheaper.  I will give them a four star because we had really good food and service but again, same food as others in Jackson metro."], ["Don M.", "Went a few weeks ago and the food was OK, but it. The service was just aweful though and if you have a group of 8 or more, they don;t just hit you with the standard 15% tip, they hit you up for 20% tip.   It wouldn't have been that bad but they don't list that anywhere on the menu or any place in the restaurant.  We asked about it when checking out and the manager had no reason why they don't list it. I've been in food service and understand the tips are where you make you're money. It wasn't very busy and took 15 minutes to get a drink.  I'll NEVER go back"], ["Chris G.", "I didn't have a meal but the margaritas and nacho app was great.  Fun atmosphere. I sat outside and felt like this was the afternoon watering hole"], ["Lanell J.", "Great salsa, crispy, warm chips! Food was fresh and full of flavor! Margaritas were very good, fresh not colored liquid like some serve. Wait time to be seated was long but for a Saturday night at prime time, not too bad I guess. Service was very good and attentive. Nice atmosphere but loud. Not a problem for us but for some might be. Overall it was very nice!"], ["Shawn C.", "Very good tex mex. The frozen house margarita is awesome and healthy. Surf and turf is perfect for low carb dining. Spiced chips are delicious too."], ["Amir H.", "In town for business and had a very enjoyable dinner with 5 others. The food was decent and service was also okay. I would recommend this restaurant as a good date spot."], ["STEVEN W.", "The ribs were awesome.  Sweet sauce and great meat on the ribs. The coleslaw that came with the meal was sweet and hot, a perfect combination. The chips are great as they appear to have a chili dusting on them.  The hot sauce was very fresh tasting and spiced perfectly.  I was at fist put off by the rating, however it is very nice inside and worth trying.  The margarita was also perfect."], ["Patricia S.", "Four of us stopped in on a Friday night. We ordered 2 apps and 4 different main entrees. Everything was excellent! Many items to choose on the menu with a lot of them having different ingredients than what is normally expected. Service was a little slow. The waiter said that they weren't prepared for so many people. They need to remedy that, weekends are always busier if you have a great restaurant. I recommend trying the white Sangria, delicious!"], ["Braxton B.", "Came in on my lunch break. Very clean, Michael was my waiter, friendly and attentive. Had a salad with grilled steak. Flavorful. Chips and salsa were good. Has full bar but was going back to work so no tequilla, this time. Service was good, food good, overall good time. Will come back off the clock to sample drink menu!"], ["David M.", "Great margaritas.  Very disappointed in the tamale - ordered the goat cheese/black bean entree. It was $12-13 and was 90% masa. I dug out the little bit of filling I could find.  The chips were nice and crispy.  My friend s"], ["Ieisha E.", "I'm not sure if I ordered the wrong thing or what. The food is quite bland. The waiter was nice and the building was clean and well kept. Those are the most positive things that I could say. I visited about 2 years ago and haven't desired to come back. I once thought about giving a second try but I had a relative to confirm that the food was bland. I don't remember there being a great menu variety or selection either."], ["Nolen G.", "Sombra Mexican Kitchen.  Has a nice ring to it, and a great look.  Definitely in a class by itself in a very crowded market of Mexican restaurants in the Jackson area.Sombra is different.  They are focusing on a higher scale restaurant as well as a higher quality list of ingredients.  I want to come right out and say, I detest the Tex-Mex restaurants in the Jackson area.  All of them that I have tried.  They all have the same cheap ingredients, the food is over salted and overall just poor quality. Sambra is the latest restaurant from the folks that brought us Amerigo and Char, that in itself makes this place interesting.  These guys know what they are doing for sure.I do not expect any place like this to be Mexican food.  I wanted it to be good Tex-Mex with high quality ingredients and decent portions at a reasonable price and I was not disappointed at all.I love beef fajitas.  They are 100% Tex-Mex and that is a good thing.  I have ordered them at all of the restaurants I have been to in MS and I have yet to find any that were not a step above dog food.  The meat is always overcooked, oversalted, curled up and nasty.  It is like the Mexican restaurants get a ingredient checklist and they choose the \"Cheap/tough/salty\" option.When I got the fajitas at Sambra the meat was tender and high quality steak, not a bag of frozen beef tips.  Tortillas are cooked in-house.  Mine were a bit overcooked, but were 1000x better than the frozen ones found everywhere else.Salsa was chunky and mild.  I like a bit more spice and ordered some Enchilada green sauce and it was very nice and moderately spicy.  Funny thing, my wife went today and said the salsa was hot.  She has a good spice meter so that tells me they may have added some spice on the fly.I look forward to my next trip and plan on exploring the menu for some more traditional tex-mex dishes.  I admit, I did not look the menu over as I wanted to see how they hit the Fajita meter and I am glad to say, they passed with flying colors."], ["M D.", "I got Salmonella poisoning from the huevos rancheros so I won't spend a dime here ever again. When I called the manager he was rude about it. However, the $5 margaritas during happy hour are the best in the area and I recommend them. They're reportedly only 97 calories. Just don't eat the food!"], ["Tricia R.", "I left the restaurant about 30 minutes ago. Here is my honest opinion: mediocre at best. Sure the building is great. The location is even better, however that's about the only nice thing I have to say.  I went with a friend and her daughter upon her suggestion. We were put on a 15 minute wait, so I took this time to look at the menu. I was sorely disappointed to see that they did not offer any vegan options and very few vegetarian choices either. My choices included a salad without cheese or nothing. Upon being seated we received chips and salsa as expected, but I could not eat the salsa because it was very spicy. When I asked the waiter, who seemed to be lacking a few brain cells, if he could knew of any vegan options. He had me tell him what vegan is. Ok. So he went to ask someone and then gave me an option of a bean burrito or a salad with no cheese. I ordered the burrito. It was a bean burrito with no sauce and a side of beans. I ate it, but felt deprived. My friend got one of the salads but was disappointed in the contents of the salad. It looked very plain to me. It seemed like it was missing quality and variety. My friend did say the 10 dollar margarita was good. So then the check came. The charge for the bean burrito was 10.50$. I told the waiter I found the charge excessive. To his credit, he changed the charge to a kid's burrito for 5$. I honestly think Taco Bell has a much tastier burrito. If you go there, just know that it's overpriced, mediocre food and the excessive prices you are paying is to pay the rent, which I am quite sure is sky high."], ["Coral E.", "Best chicken chimichangas!  Cocktails are great and so are the appetizers.  Service can be a little slow, but their friendliness makes up for it."], ["Richard J.", "Service is usually pretty good. I am very impressed with the Chicken Nachos, theSmothered Chicken entree, the Mexico City Enchilada Platter, the guacamole, the queso dip, the chips and the salsa among other things. However the steak menu items haven't been my favorite. Usually the steak is not a great cut of meat."], ["S H.", "Here it goes-Stale chips served with salsa made from canned tomatoes, raw pieces of garlic and hardly any herbs. Enchiladas served with subpar meat and rubbery strange corn tortillas that looked and tasted unappetizing. One star goes to the tasty but a little to sweet margarita... at least it was made from fresh lime juice. For the price paid I think people should expect better."], ["Sheila S.", "Other conference attendees raved about the food here so we rushed over but were unimpressed. To start with the best part: the margaritas were delicious. The service was superb. The atmosphere is lovely and there were many menu options, most appearing quite upscale. The food was boring. The cheese dip tasted vaguely of velveeta and I could barely taste the Hatch chiles bragged about on the menu; the guacamole was just okay but I suppose October isn't really avocado season. There was no heat in anything. I had cheese and onion enchiladas and the feta on top made them too salty; I didn't even finish my plate. The buttercrunch cake was interesting, served on a hot skillet so crispy and tasty, but so sweet the two of us could not finish half of one. $20 for dinner is too much for food I'd just as soon have not bothered eating. But again, the margaritas were delicious."], ["Brett B.", "The food was great but a little overpriced for what you get. The chips were seasoned and delicious. I got the ground beef burrito and it was just a normal burrito, but the cheese sauce made up for it. Best queso dip I've ever tasted."], ["Joseph K.", "Excellent Mexican food in a tastefully decorated setting along wth first class entertainment on Sundays."], ["Baron M.", "Sombra might not have the most authentic Mexican food or even the best Mexican food in the area, but it does have an original menu and different take on things. I can appreciate the effort they are putting into trying new things for our area. Last time we were here, the service was prompt and the waitress was quite nice. I thought everything I had, from the chips and salsa to my main dish, was great. The margaritas they make are very good as well. On the negative side, the drafts (for the same 12 ounces, at least that is what they thought each draft was) were more expensive than bottled beer. I also teetered on giving them only 3 stars based on their tortillas. My wife had the enchiladas and they were almost ruined by the tortillas. They are homemade, but they do not represent the nice, thin, delicate nature of a tortilla. I'm not sure if they use the same type of tortilla on tacos, fajita, etc, but they should change it. I wouldn't order anything with that tortilla. I could, though, see it working on the enchiladas if they were done in a more traditional way where they are slowly baked all day long, letting the sauce and cheese baste and simmer for 12 hours."], ["Rob B.", "Had lunch here with my wife. We were both very impressed by the food and the service! I went with the fish tacos, and they were mind blowing! She went with the pork buritto and she let me have one little bitty bite....LOL  We will be going back again!"], ["Joel B.", "I had an exceptionally great lunch here today. The staff was professional and very friendly. A Mariachi singer walked through the venue singing \"Brown Eyed Girl\" among other things. The Chicken Chimichanga came topped with both sour cream and guacamole and was most excellent. The price was a little high for lunch, but this place earned it. This would make for a great date locale."], ["Jay M.", "Very good service.  We especially like the Sombra margarita.  A nice, fresh approach to Mexican cooking."], ["JAN k.", "One star for nice looking restaurant. One star for good service. Skip the food. Just buy a bag of chips at the front desk and take them home with a jar of store bought dip. We had layered dip. Soup bowl of chicken and beans with a thick layer of microwaved cheese on top. Cheese was tasty. I had meat mush burrito, blob of refried beans and some non descript rice. Hubby had fish tacos which he labeled as fair. All food was forgetable. Dessert was another mess but sweet. Will not be going back the next time I am in Jackson."], ["Tara S.", "Eh. Food was kind of disappointing. Definitely not \"upscale Mexican\". Better described as being a Taqueria. It wasn't terrible, but it wasn't very good, either. I called in a take out order around 7:30 on a Wednesday. Was a little surprised when they said 20-30 minutes, but ok. When I got there 25 min later, I stood at the counter for a few minutes before anyone looked up or offered to help me. Then, all I heard for the next five minutes was 'Just a second'. My ticket got screwed up, but the staff was really apologetic and even discounted my order significantly. So then the food. I ordered the enchiladas; one chicken, one beef, one pork. Came with rice and beans, and I had an order of cheese dip and chips and salsa. Best thing I ate was the chips. The sauce was one the side for the enchiladas, which pretty much just makes it a taco with sauce. The meat fillings were ok; tortillas got cold pretty quickly since they weren't baked in the sauce. The traditional (red) enchilada sauce was really not tasty. The first flavor that hit was very bitter and almost burnt. After that, the other flavors came out and it was pretty good, but that first part just made it not worth it. Rice and beans were super bland. Not worth the calories. Salsa was ok. Seemed fresh made. It was very chunky, which is not my personal preference, but the flavor was good. Cheese dip was identical to what they have at Border Cafe. White and yellow cheeses, with peppers, onions, and cilantro. Very bland and yet salty. The chips were pretty good. They're coated in seasoning, which is a nice change. They're also fresh made from real tortillas, vs. the crappy thin chips that taste like they just came out of a bag. Overall, I would go back here if I was really really craving Mexican and it was the closest place. If you feel like driving an extra ten minutes, I would..."], ["Lisa S.", "AW!!  Sometimes I really hate to hammer restaurants BUT SOME JUST DESERVE IT!I honestly don't like to 'dog' locally owned places.  I LOVE SUPPORTING THE HOME TEAM but this place................they HAVE To go back to the drawing board.  Sombra was SO SUPRISINGLY bad I was just shocked.  Considering the quality of the other restaurants in their ' group' it made no sense for this one to be SO 'GOD AWFUL!'.  If I'd not already heard/read unfavorable reviews I would have just chalked it all up to a bad day/ bad chef and maybe tried again  - THAT WILL NOT BE HAPPENING!  Where to start .... went alone for a quick lunch on a Tuesday.  Only about 5 other tables, the décor was nice but a lil' over done with 'southwest flavor' - unlike the food.  I was not expecting authentic Mexican cuisine but TexMex.  Chips and salsa arrived - the chips had the orange seasoning and much too much of it.  SALT - TEE!  The salsa appeared and tasted like canned stewed tomatoes.  Offering NO tastes of lime, onion, or cilantro.  SO BORING !  The server was nice enough but not genuine in knowledge or recommendations.  If you don't have an opinion just say that - but don't give me the EVERYTHING IS SO GOOD B.S.  I ordered a taco with beef tamale and beans.  The taco by FAR was the best item even with an unheated shell and unseasoned beef.  The beans, as you can see in the pic, were SO DENSE you could only laugh.  I needed a knife, they were kinda like the plastic food.  When you pick it up it lifts in one piece.  HILARIOUS!  Now for the tamale - where to begin.  Firstly, I learned the art of tamale making with a childhood friend every New Years with her entire Mexican family. To this day I make them on New Year's and fill my freezer.  This tamale had a barrier of masa like NO OTHER!! it was SO dense and dry with a thin stream of fairly well seasoned meat.  The sauce did nothing to mask the awkwardness of the texture............... I could not finish the plate as I will not finish this review...................................................."], ["Daniel G.", "Tasted like CHEAP Mexican food.  THEIR PRICES ARE NOT CHEAP.  They served our goat cheese tamale COLD (which is one of there specialties).  Beans were super salty and tasted like lard. Cheese dip was cheap tasting and served chunky and not HOT.  Service was great, food was HORRIBLE."], ["Karla T.", "This was my third and last time to give Sombra a chance. The one common thread with all the food is salt. Everything is over salted. Atmosphere and service is nice but it doesn't make up for the bad food."], ["Gregory G.", "OK...It's been a while since I've written a review and I have to be fair when writing this one. When you put the word \"Kitchen\" in your name you would expect the flavors for the food to jump out at you, but this place didn't have anything jumping out except bad service and tasteless food. Upon arriving to Sambra we were seated immediately but waited 15 to 20 minutes before our table was acknowledged, I actually had to get up and let the hostess know that we were waiting too long. When someone finally came over they took out drink orders and lunch orders. Upon receiving the drinks, there was something floating in the glass of sweet tea, it was of course replaced. The Tamales we ordered as an appetizer were very salty and we could not determine what they actually tasted like. We order the Friday special which consisted of Catfish (3 very small pieces more like slivers) Jalapeno slaw and french fries. The catfish, though small, tasted good but the jalapeno flavored slaw was horrible, we sat there trying to determine what it taste like as well. The other meal ordered was compared to lighter fluid in taste. As I stated i wanted to be fair with this evaluation, and I will say this; the waitress was very kind, but she talked so soft that I had to translated for the guys at the table. But overall she was very nice and did her best to ensure our visit was memorable. I forgot to mention, she was bring out a flaming plate of food and burned her finger and nail badly, but stayed there and performed like a real trooper. Now, would I ever go there to eat again.....No! The food was not great and the waiting to be served was horrible. Also, I suggest that they change their music, if people have to wait like we did for service, they will fall asleep, it needs more energy."], ["Charlotte W.", "Gross. Way overpriced for flavorless Mexican food. Seriously not one good thing on the menu. Trust me and save your money on something else!!"], ["Lisa P.", "Very high quality ingredients, and the food is top notch. Not a traditional Mexican restaurant and I liked that...more upscale and definitely worth checking out. The cheese dip and tortilla chips are divine as well as the chicken enchiladas."], ["Allison S.", "Ate at Sombra with my family of four and had a great experience. The house margaritas are fantastic, and the cheese dip was a nice appetizer. We all really enjoyed the chips and mild, chunky salsa. Overall the food is more Tex-Mex than Mexican, something to be aware of if you're expecting more traditional fare.Two in our party ordered the Conchinita Pibil (pulled pork shoulder in banana leaves) and both would definitely order again; the pork was tender and had good flavor.  I ordered the tacos al carbon (one steak, one chicken) which were good, but were a bit light on the meat, with plenty of fajita vegetables to go around.  The tortilla soup was also good; hot and flavorful. We had excellent service--fast, friendly, knowledgeable--and will definitely return."], ["Sean S.", "Great staff. Excellent top shelf margaritas. Very good Mexican fare. Especially the tamales.  Great atmosphere in bar area with 4 large TV's for watching sports.  Will definitely be back."], ["Buck C.", "Great margaritas, great location and the space is nice. The food unfortunately was a disappointment. Had a large tamale wrapped in a banana leaf stuffed with goodies, but it was bland. The other dishes at our table didn't impress either."], ["Alli B.", "Cold! Bring a jacket, females. Salsa is not my favorite.  Just a bunch of chopped up tomatoes.  Also the chips were nothing to rave about.  The rest of the food was pretty good though."], ["Alan P.", "Went for lunch today, first time visit. Place its clean . I ordered the chili it was meaty but way over salted.  My daughter in law could not eat her chili. As I am from Tacoma WA I do not know if this is a franchised business but I got the feeling that it was. It certainly was not an authentic Mexican Restaurant."], ["Billy T.", "Great Place.  Went with a bunch of guys and we had something different. The food is OK.  Nothing special just C average mexican food and a little pricey. I had the chicken enchaladas with rice and refried beens.  They put a twist on the beans and I did not care for them.  Overall mine was a C. One of the guys got an off the menu burger.  Think is was the chimichanga burger or something like that and it was good and only half eaten. One had Huevos Rancheros which he said was very good along with the white sangrea which he said was excellent.  So it was a mixed bag.  Service was good. Place is very nice but at best I would say average."], ["cheryl g.", "I went to Sombra Saturday evening with two friends.  The restaurant's atmosphere is great--open and airy.  The service was really good.  The margaritas were delicious, but the food was just so-so.  We started with the guacamole, which was really pretty bland.  We added salt, which helped some, but I wouldn't get it again.  One of my friends and I had the fish tacos.  Again, very bland.  They had \"jalapeno cole slaw\" on them, which you would think would at least have a little kick to it, but not so much.  My other friend had a burrito, and he said it was pretty good.  I'll give Sombra another try, because I really want to like it.  I most definitely will avoid the guacamole and the fish tacos, however."]], "La Morena": [["Courtney C.", "Good Mexican food. Caguamas for $9 or $10. I had huaraches, my partner had enchiladas and both meals were good. They have chilaquiles too. Surprising selection of vegetarian options. Se habla espanol. Good place to watch futbol. Hay un Mercado latino al lado."], ["Ryder T.", "The service is good, and the selection of tacos is great (this may be the only place you can get tongue and tripe tacos in Jackson). The other dishes that I have gotten into are so-so. I'm just not as impressed as everyone else seems to be.As with most Mexican/Latin American places, you get salsa and chips for the table. The chips are a step above most, so that is nice. The salsa can be supplemented with some of the hotter or more flavorful house made sauces on the table.The way to go here is definitely just pick out a bunch of tacos. They are served \"authentic\" style which is basically just meat and some onion and cilantro. That is really all you need (though if you want something a bit fancier, try La Guadalupe across the street for a 'fully dressed' taco). Otherwise, the menu is not that inspiring. Also be prepared for a bit of misunderstanding if you aren't ordering straight off of the menu or in fluent Spanish.It is less \"Americanized\" than other places, but that doesn't mean that it is necessarily better or more in line with what you want to eat. The rice and beans that came with the meal (something I always feel is super Tex-Mex) are quite plain.Stop by if you need a tongue or tripe taco, otherwise, you can find better at La Guadalupe."], ["Alyssa M.", "Super yummy, very authentic Mexican food. Great service as well, but you will definitely stick out if you aren't Hispanic! We felt welcomed, but very conspicuous as we ate our delicious food-- the \"usuals\" definitely had their eye on us. Great salsa, and we all loved our food-- we each picked something from different parts of the menu. If we were local, we would definitely be back."], ["Sidney T.", "I was born and raised in Los Angeles, so my idea of good latin food is not Cozumel or other similar \"Americanized\" restaurants you find splattered around Jackson and its surrounding areas. Whenever I visit family in MS, this is a must stop for me.When I say they have the BEST authentic carne asada tacos in Jackson, I really mean it. Personally, I used to go to La Guadalupe, but I stopped when I accidentally discovered this place because the food is cheaper, larger, fresher, and tastier. Tortillas are handmade, and all orders are cooked directly in front of you. Even though the food is pretty cheap, it is not lacking in flavor or quality. You can drink Jarrito sodas or beer or regular sodas.As others have pointed out, it is in the cut and not visible right off of Old Canton Rd., but it's not hard to find; it's directly behind Domino's Pizza in a little strip mall. I never feel unsafe going here. Most of the customers here are natives of Latin America, but these customers are never rude, although they do stare at the oddity of non-latinos coming in to grab a bite in this little mom and pop place, lol!  I am always greeted with a smile, and the owner has always been nice and helpful when I come in to get food.The very small restaurant is attached to a store that sells everything from cowboy boots to phone cards to traditional latin candies and treats. They offer take-out, or you can simply sit at one of the few tables or the bar area. If you're looking for a fancy restaurant, this is not the place for you. However, if you want tasty and very affordable authentic food and great service, this is just the place for you. La Morena is really a true, hidden gem of Jackson."], ["Joe H.", "Very good authentic Mexican food. Very friendly staff. A little hard to find and nothing fancy, but well worth the visit."], ["Melissa E.", "I have been here a few times and honestly it's hit or miss. The past couple of times the staff have been nothing but rude! They act like our presence just inconveniences them instead of being happy to serve customers. As long as you stay away from anything chicken it's pretty good. Their chicken is some of the most bland tasting chicken I have ever tasted! I could get better at a Texmex chain."], ["Yoori C.", "When I crave real Mexican food, this is my spot. Moving from LA to Jackson, the commercialized Mexican joints just weren't doing it for me. Half of the store is a market with all kinds of Mexican accessories and the TVs are always on Spanish channels for the employees and other workers who  in during their lunch breaks or after their shifts. It's not on the menu but I always order a tostada with carne and a pastor taco. The spicy salsas, chopped onions and cilantro make me feel right at home. Thank you for making the transition to a new home so welcoming and delicious!"], ["Billy B.", "Wife is Mexican, so I always try to keep my eyes and ears open for decent food that would remind us of her family (the mother in law does magical things with food, so the bar is set fairly high).  We drove by once before and decided to check this place out yesterday.  I ordered the Chili Rellenos and my wife had Cochinita con Chili Verde.  The refried beans were very tasty (I typically prefer black beans, but the refried pinto beans were very good) as was the rice.  The Chili Relleno was definitely more than I had expected, and the size was not an attempt to make up for quality.  It was stuff with Queso de Oaxaca (the Mexican state that is kind of south and central to the country where many of the indigenous people [Mixtecos] are from), chicken, and potatoes.  The Chili Verde had a little bit of a kick to it and was a great blend of the tangy/citrusy taste of the tomatillos, minty/fresh cilantro, and fruity heat of the Jalapeños.  I'd definitely recommend paying this place a visit if you're in the area.  And be sure to try the agua frescas for your drink."], ["Duan C.", "True authentic Mexican food! Most of your Jackson area Mexican restaurants are Americanized places. Basically upscale Taco Bell's. This place is \"AUTHENTIC\" This is the place, the tiny Mexican population in Jackson goes when they want to eat out. I grew up in Chicago and this place serves the same food the restaurants at home served. Fresh limes, cilantro and onions are accompanied at all the tables, well let's step back, there are only a couple of tables and it is a partial grocery store too - so it is not that big. The people that work there, speak pretty good English - so do not worry about a language barrier. The only knock on the place is the operating hours, it's either they are closed on Monday's or Tuesday's - but Wednesday thru Saturday - I know for a fact they are open. They are open from 10am - 9pm, they serve beer - including 40oz. of Corona! Blew me away when I seen that big bottle but, they serve'em! Really really good place to eat if you want the real deal, not good for groups, but they are perfect for you and a friend to hang out and eat some good Mexican comfort food."], ["Coral E.", "D-licious and Authentic with capital letters!  Everything is good.....however the empanadas happen to be my favorite.  Just go and try!"], ["Doug B.", "I went after reading all the fantastic reviews and the food did not disappoint. I was there after the lunch rush so only a few folks at the bar. My food came out fast and fresh and was simply delicious. I have found my new lunch getaway. I had two tacos - al pastor y pollo and an empanada - pollo but will branch out and try more next time. So glad I read the reviews and stopped in."], ["Jason B.", "Best mexican food I have had in the Brandon area so far.  Had a chicken fajita veggie wet burrito, was excellent.  Salsas are more what I am used to then most of the other ones you find in the area that are kind of bland."], ["Melia D.", "I'm a California transplant to Mississippi, and the tacos are one of the things I miss most about home. I was thrilled when La Morena opened in the Jackson area, because their food is just as fresh, authentic, and delicious as what I would order from the corner taqueria in San Francisco. I've brought several groups of friends to La Morena to try the tacos -- al pastor, chorizo, and shredded chicken are my favorites. There are other tasty dishes on the menu, too, like enchiladas and tortas. I cannot get enough of La Morena's house-made tortilla chips and fresh salsa. It's making my mouth water as I write this. Be forewarned that the three types of sauce in squeeze bottles are all spicy! The staff treats you like family. The food is super inexpensive ($2/taco). La Morena is a casual place to bring a group of friends and have a low-key meal. Check out the Mexican store in the back. It sells everything from goat milk caramel pops to cowboy boots.This place is tucked away in a tiny Mexican shopping center. Heading north on Old Canton, cross County Line and look for Amerigo. Right after you pass it, turn right into the narrow driveway that leads to a small parking lot."], ["Tom R.", "I first met Ariel and his family a couple of years ago when my friend and Bon Vivant, Arthur Jones suggested that I drop by La Morena for a taco and a Mexican Coke. Since then I've gotten to know the family and feel like part of it when I drop by for my weekly fix.La Morena serves real food for real people. The tortillas are made by hand, to order and the ingredients are fresh and prepared with care. On any given day (except Tuesdays) you will find families, working folk and the occasional \"gringo\" sitting side by side at the lunch counter and one of the small tables enjoying dishes made with love and honesty.Any of the tacos are a real treat and served with cilantro, onions and a slice of lime. You can choose from three hot sauces vith varying degrees of burn, but all made from scratch. My favorites are Lengua (beef tongue) and Al Pastor (pork and pineapple), but you can't go wrong with any of the others.If you want to stray from the tacos, try the Albondigas, a meatball and rice dish with a little surprise in the middle, or the Chilaquiles, made from tortillas cooked in salsa with scrambled eggs.The array of fruit juices and Mexican soft drinks is also impressive. My favorites are the Jarritos Tamarindo and the Mexican Coke, made with can sugar.After you get your fill, walk across the parking lot and pick up a few Mexican pastries for later.Bon Appetit - Tom"], ["Jason P.", "Authentic Mexican!  It's a hidden gem (located behind Domino's in a small shopping plaza).  Very friendly owner and staff.  I will stop here every time I'm in the Jackson area."], ["Jason W.", "I just had great tacos last week when i visited ridgeland, ms. I have to eat 4 tacos coz its too good.. The empanadas are great too yumm..!!! Overall great foods and very Mexican style. Would definitely go back for more foods n pineapple juice. Location a bit tricky but if you pay attention where the 1 way small entrance of shopping stores. You could miss it may be like 3 times since it located behind a very old a bit run down vintage looking shopping stores by old canton. Or if you turn into pine knoll dr, then la morena is located right behind papa John building with 1 way access on left/right of building. Good luck finding it but it surely serve delicious foods w ok service if you find it. Salut.."]], "Margaritas": [["Jose C.", "I am not a huge fan of Mexican food but my wife is. I actually did like the place and would go back again. She loved the place and would most likely be a regular here. I did not get a chance to try out the margaritas but she did and gave them two thumbs up. If you are in the area check it out."], ["Jus P.", "Only here for the drinks. For some reason I can't eat the food without getting sick but my coworkers seem to love it."], ["Dwight B.", "This is the greatest Mexican restaurant I have been too. Beside the great service, the food prices and the quantity of food you get per dollar is worth it. The place is LIT! Bring a friend heck bring two, the jumbo margarita  will definitely leave you in the Mexican spirit."], ["Jay R.", "The drinks are wonderful.  Go with Texas and super sized.  Now to the food.  HORRIBLE - I've never had Mexican food this bad but once in my life.  That was Sophies in Tusayan, AZ.   Las Margaritas Mexican food was bland, flavorless, greasy and just overall MEH.  I'm not sure if they were reheating frozen Mexican food dinners from the freezer department or what.  I really hate to say this, but Taco bell is much better than this place.  During my dining experience my girlfriend suggested that I find a Whataburger so that I could get something to eat when we left there.  We both knew we would never finish the horrible food and that we would be hungry.  BUT I digress and to my dismay I was stuck with the HUGE margarita.  So I kept drinking and she helped me finish it.  If we had known the food was so horrible we would have just came there for drinks and watch a game or just relax before going to a club or a movie.  But the food here is worse than Mexican TV dinners.  I'm not sure if some of the Yelpers that eat here have experienced true authentic Mexican food, so that would explain some of the higher reviews.  I would rather eat ramen noodles than eat this food.  Watery meat sitting in warmers and nothing was fresh.  Cafeteria line style preparation and food that comes out fast.  Our waitress was a sweetheart and nice and she thought our experience should have been better.  The waitress loved the food, but I guess when you're used to something it becomes a part of you.P.S.  I have never been in jail, but I'm sure the food there is better."], ["Danielle L.", "In comparison to other \"Mexican\" restaurants in the greater Jackson area, Las Margaritas is great. The environment is your typical set-up for Americanized Mexican restaurants. The staff are what makes this establishment my \"go-to\" choice when I'm in the mood for Mexican food. The are super friendly and more than willing to accommodate their patrons in any way possible. My food is always delivered to my table quickly and piping hot!If you're a drinker, their Monster Margaritas are HUGE and STRONG! Pair that with their flat screen TVs that are always tuned in to sporting events or the news, and you've got a winning combination (especially during NBA playoffs).Now for my favorite part: THE FOOD! I think I've tried at least half of what's on their menu, I've never had anything that wasn't tasty. The portions are always more than enough (so much so, that I always end up taking a to-go box home). They also have chicken fingers and fries for those of you who have children who are picky eaters like mine."], ["Crystal S.", "Nothing bad to say, food was speedily delivered, and margaritas were 2 for 1 all day. It's your typical tex mex Mexican restaurant! Drinks were pretty good. You could choose what type if margarita you wanted, strawberry, mango, peach and lime, not just limited to you choice. Friendly staff and they had several flat screen TV in view almost anywhere you sit."], ["Latoya S.", "The food is awesome! You walk in, nice environment and the staff are very friendly. Prices are very reasonable and you get a lot for your money. I had the papitos steak which is Mexican rice with steak tipped with cheddar cheese and served with 3 tortillas. I was in town for a training for my job but I would definitely come back again. Extremely satisfied and full!"], ["Aquarian E.", "This is the Absolute WORST Mexican food I have ever had. We ordered the chile relleno, margarita dip and a chimichanga with steak, chicken and shrimp. Everything was bland and uneventful to say the least. The plates where hot but the food on them was cold. The reasonable prices and the monster margarita were the only good things at this place. There salsa was not impressive at all. It was similar to Pace Picante Sauce, definitely not what you expect in a authentic Mexican restaurant."], ["Kevin S.", "My food was pretty tasty, standard for Dixie Mex. Unfortunately, the queso dip was lukewarm at best and the service was atrocious. After three mediocre experiences over the years I've leavened my lesson and won't be back."], ["Alicia A.", "I love this place! I haven't been in about a year, but it was worth the wait! I ordered the shrimp, chicken, and steak fajita quesadilla with only bell peppers and  onions !!! Delicious!!!!! It is huge! Covers entire plate, you have enough to take home for left overs."], ["Duan C.", "Let's see, I uploaded pictures of what I ordered, but I will say this is tex-mex and not true authentic mexican, let me clarify.But my girlfriend loves this place and I can't lie, I love the 32oz mugs of Bud Light! This evening I went through two of them, I guess I was pretty thirsty!But I have had the chimichangas, she usually gets the the chicken quesidillia, I have had the shrimp cocktail, and the super combo fajitas are just simply awesome! The only thing I ever ordered and did not like - was the T-Bone steak! It was ever so tough and it took me forever to chew.Its is pure tex-mex, not true authentic mexican - but it will not disappoint if you are hungry."], ["Brian B.", "My family was passing through town and checked out this place.  We saw that it had favorable reviews and decided to try for ourselves.We were greeted by very friendly staff and had great service.  The food and drinks were excellent.  Portions sizes were good.I was expecting a large ticket as we ordered everything under the sun and when the ticket came out, it was 40% under what I had expected.We come through yearly and I do plan to visit here again."], ["Sonia C.", "I absolutely love this place. I lived in Ridgeland for almost ten years, and this was my #1 favorite restaurant. The people are nice, the food is fantastic, the service is good, the prices are reasonable, they have vegetarian options, and it's kid-friendly. I WISH we had a Mexican restaurant this good in Houston. This is not Tex-Mex. I live in Texas, and what we have is MUCH different, and not half as good. I hope you'll love this place as much as I did!The chips are crispy and fresh, and you can tell they make their own the salsa, which is very good. I love the queso dip, so order that for sure.  To drink,  I ordered iced tea or a margarita. The iced tea was always fresh, and the margaritas were excellent. For large parties, order margarita pitchers. To eat, I've ordered everything on the vegetarian menu. My favorite items are the cheese enchiladas (white cheese), the bean burrito, and the bean and cheese chalupa. My husband liked the vegetarian fajitas. The refried beans and rice were always good too. I don't have any criticism of Margaritas. Even when I give five stars, I usually leave a suggestion of how to improve, but I can't think of anything that I'd change. If I still lived there, I'd eat there once a week. I miss that place. Go eat there for me!"], ["Alan S.", "The only way to judge the quality of your typical southern Mexican restaurant is by quality of their Chimichanga.  Margarita's Chimichanga is awesome.  Tons of food, less than seven dollars.  Excellent, speedy service.   Way better than La Cazuela"], ["Shan A.", "Having lived in Houston Texas my entire life where there are well over 1300 different Mexican restaurants, this one takes the number one spot as my favorite. Great service, great drinks, reasonably priced, and incredible food. One of the best chimichangas I've ever had."], ["Miriam A.", "Good service and great tasting food. The queso dip even has a few jalepenos hiding in the bottom. Spicy but not too much!  Chips were warm and Margaritas delicious.  Will be back here again soon."], ["Tommy P.", "Great spot for food and margaritas"], ["Ryan D.", "great food good atmoshpere. loved it would eat there again"], ["Sheila D.", "I'm sorry, this place just doesn't live up to my mexican restaurant standards. It suits me just fine if I'm going out with my girlfriends to get sloshed, but not if I want to enjoy a meal that's worth any value. Every time I come here my quesadillas or my shrimp chimichangas are crappy. I don't think the salsa is that good either."], ["Big C.", "Fairly standard Tex-Mex fare in a comfortable environment with attentive service."], ["Shawn L.", "It's a bit smoky (even in the non-smoking). Best margaritas in town. Best chimichanga and queso dip I've ever had. Good place to take kids."]], "Salsa's Mexican Grille": [["Debra T.", "Always great food and the best wait staff. I dare you to find another 2 for 1 margarita's this good!"], ["Linell B.", "My wife and I stopped by mid-afternoon on a Sunday, so the place was pretty empty. We were one of two tables when we first arrived.Firstly, the prices were a little high for a Mexican food place. You're looking at $10 for the cheapest entree and around $15 for most of the stuff you'll really want. Whatever, I'm all for paying more for a good food and service.But...Even though we were one of two tables service was _very_ lackluster. The food was slow coming out and we weren't asked how the food was or for drink refills until we were ready to leave. But hey, I can deal with relatively high prices and not so hot service for great food!And...The food was pretty meh. Not bad by any means, but also far from amazing. My wife got a small plate of chicken and rice and I got a combo platter. Mine was definitely more bang for the buck than hers, but I've had as good or better at every other Mexican place in town. The saving grace, and what warranted a third star, was the two for one margaritas. Of course, I didn't get that until I was ready to leave, but oh well.All in all it wasn't absolutely terrible, but I won't be back anytime soon."], ["Jonna B.", "At 3:45 on a Sunday, I expected the business to be slow. Not service, but the business. It took 10 minutes to get our drinks (we were one of two tables), another ten minutes to get our order taken, and then once the food was dropped off we were never checked on. The price is high and the portions are tiny and mediocre. I won't be coming back."], ["Dennis T.", "Ordered the mixed fajita grill - shrimp, chicken and beef. I was amazed to received a very large sizzling platter along with a large plate of rice and very delicious retried beans. I thought maybe they'd misunderstood my order and brought food for two! Then I got the bill - $16 for all of that is terrific. The chips and salsa were very good, though I suppose the salsa could have been a little hotter, but it's clearly made there. Service was very good and attentive. Great place for this businessman to eat."], ["W E.", "Great 2 for 1 drink specials had mixed fajitas. great.  Grilled chicken tacos were top notch.  NO SALT!"], ["Tracey W.", "2 for 1 margaritas are from Sun-Thurs. Love going here with friends after work. Usually busiest on Fri and sat night . Easier to seat larger groups on other  nights . Best margaritas around in my opinion, good food and service."]], "El Ranchito": [["Gary B.", "Yes it's fantastic! Stopped in for dinner. The service is excellent, frosty mug with your Beer, which is very low in price. My food was delivered in 5 minutes. Authentic ingredients, great taste, huge menu. Tortilla chips crispy and thin, Salsa Freshly made. I visit Richland every 2 months or so and I'll be back!"], ["Michelle K.", "Food is delicious but the place is a bit run down, and poor lighting. The ground beef was really great on the burrito and salads. The rice was really tasty and the grilled shrimp dish was better then I expected considering the location."], ["Jessica H.", "Great food! Great price! Great service!  Highly recommended!  Chips and salsa is so goooood!"], ["Dana M.", "Tasted like a fast food version of Mexican food.  The chips and rice were good. The kids liked the cheese quesadilla. I did not like the cheese enchilada at all. The cheese was a little cold in the middle and the sauce tasted like canned tomato sauce.My husband had the fiesta chicken burrito and asked for no onions. It came out loaded with onions anyway. This was delivered so fast so they pre-makje all their food. He sent it back to get it with no onions and this tasted more fresh and we could tell it was made just then."], ["Christy M.", "Beef fajita nachos were outstanding! Love the chips and salsa!! Very friendly and authentic, felt like family"], ["Tony R.", "Every time I do this drive I make it a point to stop here. Service is so fast!!! Packed out still super fast and delicious and at a great price ! Other Mexican restaurants should strive for this kind of excellence !!!!"], ["Carolyn B.", "Great Mexican food at reasonable prices served by a good group of guys.  Always a pleasurable experience!"]], "Cazadores": [["Coral E.", "Our Mexican restaurant of choice!  You can usually find us here on Friday nights enjoying great service, margaritas and my favorite chips and salsa!  My favorite entree is Taquitos Mexicanos - two chicken and two beef Taquitos - absolutely delicious!  The fiancé loves their shrimp and Mexican sausage quesadilla....and their blue margarita!"], ["Jonna B.", "Cazadores is consistently good. The waitstaff is always super speedy, and it's a great place to go on an hour long lunch break. Their super burritos are, well, super! Their salsa is honestly some of the best I've had, and I *love* salsa."], ["Pete F.", "Typical tex-mex, but the food is good, service is pretty on-point, and cost is cheap. My only complaint is with the owner. He is often at the hostess kiosk, and has been quite rude from time to time. For example, my wife and I walked in around 8 one evening, and were ignored for a good 10 min, despite being the only ones walking in to the restaurant. We were eventfully seated, but it was obvious he wasn't happy - despite the restaurant closing at 9:30."], ["Sydney M.", "I've been here so many times, it's crazy.  First off, the P5 (rice + chicken + melted queso) is muy delicioso.  One time, my family went for lunch, and we all ordered the P5. I'm sure the server laughed at us, but it's the restaurant's fault for making it so dang tasty!  One teeny tiny complaint out of the many times I've been there is that one day I didn't finish my P5 and took it home. The next day when reheating it, it smelled fishy/shrimpy. I eventually spit it out and threw it away.  I haven't ordered the P5 again, out of fear, but I'm hoping it was a one off.  The bright side is that I have gotten to try a lot of new dishes!Now to the positives: price, margarita happy hours, and salsa.  The price at this place can't be beat. Most meals are around $10 and the margaritas are flowing every night because they have happy hour every single day.  Every day is different. I know Thursday is 2/1 margs. and Friday is half-off until 7pm.  The salsa is also really good.  It's got a kick to it, and tastes really good (not like it was poured from a spaghetti sauce jar).  As for the service, some servers are better than others. I've had really great service, and I've had a server who I'm pretty sure hated our guts. But no matter how they look like they're feeling, they've always been extremely professional.  And I always try to tip well. So check it out! It gets really busy on Friday and Saturday nights as well as Sunday lunch."], ["Chris P.", "Slow service but the food more than made up for it. All Mexican restaurants in the area serve chips and salsa, but there is something different about theirs that makes it especially delicious."], ["Meagan A.", "This is one of my go-to places for lunch with coworkers. When it comes to lunch, this place is a triple threat! Good food, cheap prices, and quick service. It's one of the few places that actually take your order at the table and can deliver your food in a timely manner. This place is consistent, so rightfully, it's always full. Adding to the speedy lunch, I really like how the checks are handled. Each person is issued a separate check and pays individually at the register in the front. No confusion or mixing up of cards."], ["Gene T.", "Not your typical bland Mexican food.  Very tasty."], ["Mindy R.", "My husband and I come here regularly. Hands down best salsa in town, and their chips are great as well. All of their typical Mexican restaurant combinations are great, and their specialities are really where their strong point is. I highly recommend the carne asada. Their rice is great too. This establishment is so far the best Mexican restaurant close to us, and is very affordable."], ["Jeana S.", "I've never had a bad experience here!  We come to eat here just about every Sunday.  The food is always delicious and the service is great!  I highly recommend their guacamole and the super burrito!"], ["Chris B.", "2nd time eating here, nothing impressive the 1st time. However this 2nd time will me make look else where. To start out server's cologne was pungent, so much it lingered for minutes after he left. The margaritas were watered down, the beans were soured and everything else just bland or over salted. Definitely better options in the metro Jxn area"], ["Randy H.", "The manager really cares about customer service in this restaurant. The food is fresh and fast at a very good price. This restaurant is a solid choice 7 days a week."], ["Chadwick C.", "Average food (see el sombrero, jarros, etc for much of the same).Very good service. Friendly staff."], ["Sheila S.", "Delicious. Typical tex-mex and it's served fast, hot, and is not expensive. I've been twice - remembered them from a trip to Jackson a couple of years ago and made a point of returning. I am vegetarian and ordered off the dinner menu at lunch to get what I was hankering for: chile relleno, potato taquito, cheese enchilada, beans and rice and sweet tea. The salsa and queso dip and tomatillo sauces are also delicious. My entire bill was $10 and I will go back the next time I'm in town."], ["J O.", "We have a lot of \"Mexican\" restaurants to eat at in the Jackson metro area. Of them all, Cazadores is my favorite. The menu is vast and the prices are the lowest in the Jackson metro area. For $8 you can get the Cazadores chimichanga with 3 chimi's, beef, chicken, and shrimp. 32 oz Dos Equis ambers are $4. They also have 2 for 1 margarita specials during the weekdays. The food is always fresh and consistent. Think Las Margaritas 5 - 10 years ago before it went down hill."], ["Quincy S.", "This is the best Mexican you can get in the Jackson Metro area.  The quality of this food is only surpassed by the great service!  Friendly waitstaffers like Leonardo or Isabel will take care of you as you dine on their delicious offerings.  My favorites are the carne asada and the carnitas.  Those two dishes are my favorites although they have a pretty nice sized selection on their menu.  My wife prefers their sizzling fajitas which seems to be the most popular.  On top of having great food and service, the prices are reasonable, too.  You get plenty of food and two can dine for under $20 easily.  Come during lunch and you can probably dine under $15."], ["Donnie P.", "Great food and clean place.  Would have been a five star if service was better."]]}