{"Piccadilly Cafeteria": [["Chalmers M.", "The best Piccadilly in the area.  Staff, food, service, and cleanliness of the store are all above par.  It seems some other subpar reviews/ratings are based on location.  My 5 star rating is based on the components mentioned above."], ["Mike V.", "The staff is really nice and the food is better than you're average picadilly. That said, the selections were just a little better than average.. Absolutely no one in the restaurant at 730 on a wed night. (See picture).. Also the shopping strip it's located on is almost all unleased... From the outside the place didn't even look open.. So based on traffic... I don't think this place will be open too much longer... But the staff truly is very nice."], ["Fregilia L.", "I only walked in to pick up an order. It was pretty empty on the inside but the food that was on the serving line all looked yummy. I wasn't familar with one of the dishes and was curious about tasting it. The lady running the line was so kind. She fixed me a small bowl of the rice dish so I could sample it. It was perfect. The staff here are really good people."], ["Natasha J.", "I visited this store 5/22/2014 with my son. I have always enjoyed my experience with Piccadilly as a whole as well as the staff. On this day, I was flat out disappointed with what I saw. As I reach the bread area I saw a baby roach leaving from the staff side crawling toward the customer exchange area. There were two managers standing behind the young lady serving the bread and I got their attention without making a scene. I pointing to the infraction (pest in the serving area) and one of the mangers grab a paper towel and circled around to the customer side looking for the roach. Not one time did the manager apologize or make any type of gesture which I don't know what could have been said anyway. The killing part is that the customer behind me was an elderly lady and the roach almost fell into her food. I guess I'm writing this review because there were several people on the staff line with what appeared to be two mangers and they all had different conversations going among one another. Very bad customer experience at this location. And \"NO\" I couldn't eat my food. Please be advise that it's a good idea to watch what you put in your mouth."]], "St Anne Catholic Church": [["Donna H.", "Nice location, but the church is just a big open room with drums and guitars.  Masses in English and Spanish.  I didn't move to Carthage because I couldn't imagine going to Mass in a place like that.  Confession before mass and by request."]], "The Manship Wood Fired Kitchen": [["Darius W.", "One of my favorite restaurants to visit for lunch. Slowly becoming our office's daily routine. The lunch menu is full of options and you cannot beat the daily specials.Spacing is cramped in front so large parties should utilize the back area of the restaurant. Servers and bartenders  knowledgable, courteous, and quick!"], ["Melissa B.", "I went to the Manship for the first time a few months ago, and was highly disappointed. My friend and I had to wait a very long time for the server to come to our table, and then he forgot to put in our food order. We waited for over an hour before we finally flagged him down to ask about our food, and he just said, \"whoops,\" and laughed. The table behind us got a free appetizer just for knowing him, and all we got was a \"whoops\" for our food not getting put in. No apology, nothing. I called the manager afterward because I didn't want to make a scene, and he was friendly and apologetic and said he had seen the whole thing and it was unacceptable. He took my address and said that he would send me a gift card for my troubles and said for me to tell him when I came in again so they could give me better service. The gift card never came and I have been too angry to go back. The food may be good, but what we ordered was pretty bland and definitely not worth paying over $30 for a meal just to be disrespected. I expect better service in places that claim to be high quality."], ["Craig C.", "Great food, great atmosphere, and great service. A one of a kind gem.I loved the bar and the huge selection of bourbon and scotch. Glad to see a restaurant step up their game on all aspects of dining."], ["Blue A.", "This is a really nice spot in Jackson - and while the vibe is casual, it does look fancier than most places. Our server was extremely nice, made some great recommendations and checked in on us from time to time. This is one of the cases where great customer service really made the overall experience so much better.Blue crab sandwich - this was a whole soft shell crab, inside a sandwich. I love crab - but I've never had a whole soft shell crab. This was interesting! It's a pretty big sandwich, and I managed to do some good damage on it, but couldn't finish. I think this was one of the specials - so it might not always be on the menu.It came with a side of parmasean fries - eh. I should of picked another side. These were very thin cut fries (I prefer thick cut fries). I know for next time to try one of the other sides that looked great.Ended the meal with some blackberry cobler - They have a free dessert as the Check In offer on Yelp! Got this one and it was delicious! Possibly my favorite part of the meal.There's a nice cocktail and beer list as well - I can see this being a great happy hour spot. Might have to drop in for a drink next time I am in town."], ["David R.", "Great libations and wild game!The Manship Wood Fired Kitchen is located on the first floor of the Belhaven Medical Office Building.  The parking garage is accessible from Manship St. or Poplar Bvld.I arrived during happy hour when cocktails are half-price; I took advantage of that. I started with a drink called the \"Best Damn G & T\".  My preference for a G & T is prepared with Bombay Sapphire Gin.  This G & T was sweet and refreshing; it was not overly sweet.  I saw cooper mugs at the bar and knew my next drink would be one of my favorites, the Moscow Mule. The bartender did a good job with the drinks.I like duck and had to try the duck wings.  The duck wings looked and tasted like they were braised in a citrus glaze.  Six meaty and tender drummettes, garnished with scallions and an orange slice. Although there appeared to be other good entree choices on the menu, since I like wild game, I ordered the rabbit ravioli.  Ravioli stuffed with ground rabbit and topped with Pancetta and what looks like snap pea shoots; it was a great choice.There are a few selections for desert, I was deciding between the peach cheesecake or peach cobbler. I went with the peach cobbler.  Prepared with peaches grown in Mississippi, the cobbler is served in a small cast iron skillet, topped with vanilla ice cream and garnished with mint leaves.  The cobbler was on the cool side when it arrived at my position at the bar, but still good and complemented by the vanilla ice cream.The desert was on the house with my Yelp check-in.I would visit again."], ["Cody M.", "One of the best additions to the food culture of Jackson in the past couple years. I had my rehearsal dinner here, and experienced exceptional service, food, and atmosphere throughout the whole thing. Their food is absolutely delicious, and ranges anywhere from a nice tender steak to a perfectly seasoned fish to a hot and sizzling pizza. They have food for every price range, especially if you hit up their happy hour when you can get discounted drinks and pizza. This will be one of Jackson's staples in the upcoming years if it isn't already."], ["Melissa A.", "Great food and service.  Pretty restaurant with fun patio.  Nice to grab a quick pizza at the bar or sit down for a slow dinner."], ["Linnea W.", "Oh my gosh j have died and gone to Heaven. Jackson suddenly feels like a soft Chicago . Great environment . Delicious menu."], ["Dana R.", "My favorite restaurant in the Jackson area! My favorite entree so far has been the Tuna filet. The wine and craft beer selection is long and wonderful! Also, the Crawfish bisque they have on the summer menu is delicious. Oh, and for an appetizer- I highly recommend the crab cakes. Roumalade sauce served with it is fantastic!"], ["Rachel P.", "This place is straight up fantastic. I've been for lunch, brunch, and dinner several times and have never been anywhere close to disappointed. Everything is masterfully done.Let's start with the atmosphere-- the restaurant is relatively small, but still maintains a spacious and open vibe. There's seating at the bar as well as some high top tables for smaller groups when you first walk in. Then, in the proper dining room, there are both booths as well as tables. This is an excellent location to bring a group, especially if you're celebrating. Situated right in Belhaven between Fondren and downtown, this place is central to all the going's-on's here in Jackson, and is a perfect place to start your evening.But let's talk about the food. I eat out relatively often and can be a bit of a food snob, I'll admit. This place regularly blows me away. Everything I've had has been phenomenal. The first time I ate here, I had the steak and it was by far the best steak I've had in town. Better than any of the restaurants \"known\" for their steak! Since then, I've had a variety of dishes from salads to brunch to pizza and everything has left me raving. The menu changes regularly, and features a bevy of local vegetables and produce which I LOVE. I wish more Jackson restaurants would do that. It shows a certain pride in this city, which goes a long way with me. This is a fantastic date locale. It's classy, not stuffy, and quiet enough that you can hear yourself chat but not so quiet that no one chats.Their bar is fully stocked and their drink menu is extensive. They offer a fantastic variety of wines and beers, but I've always been most impressed by their unique and finely crafted cocktails. Service, for me, has always been great. The only time it's ever been a bit slow was when I stopped in for a late lunch but that's to be expected at any restaurant when the wait staff is switching from lunch to dinner mode. Even when it's a bit slow, the wait staff is always incredibly friendly and helpful-- always ready with a recommendation or a menu suggestion. Overall, I can't say enough good things about the Manship. It's one of the most excellent restaurants we've got in town, and I'm so glad to have it here in the neighborhood. Check it out! You won't regret it!"], ["Amanda W.", "I ordered a to go dinner. I was surprised and disappointed to see that each to go item, they would charge $.50 per item. So my 3 items added an extra $1.50 just for it being a to go order. I ordered the smoked wings appetizer, the shrimp bisque, and the couscous side item. I ordered the shrimp bisque based on the recommendation from the lady taking my order. I was not impressed. There was basically no shrimp and instead of a creamy sauce it was more of a broth. The smoked wings were pretty good though I had expected more from the white barbecue sauce, it was peppery and fairly spicy (and not in the tasty way) in my opinion.The couscous was something to brag about though. This is also a recommendation from the lady who took my to go order. I wanted the Parmesan truffle fries but she said they were a special and they no longer carried them at this moment. She offered the couscous as a substitute, and she actually got this one right. It had small cut mushrooms with some Parmesan and some truffle oil. Recommended! I did enjoy the look of the restaurant, especially the outside patio area."], ["Ryder T.", "Soon after The Manship opened, I had dinner there and was very impressed. Jackson has had a lot of good restaurants (and still does) but this one really took the cake in all ways. The food was amazing, the service top-notch and the atmosphere felt like I was in a much bigger more impressive city. Prices are reasonable for the quality of food!They have an excellent brunch - probably the most creative and tasty brunch in Jackson right now. The happy hour is also not to be missed. Half off cocktails and pizzas is perfect for an after work drink and snack or a full blown early dinner date! The last time I went to the happy hour, the mixologist (I only use the term because he was actually our waiter at the time, not the bartender, though he had come up with many of the cocktails) was happy to hang around and tell us about how the cocktail combinations had come about. The staff is always knowledgable about where the food comes from and how it is prepared.The only issues I have had with them is weekday lunch - but this is a more difficult time for most restaurants. The food was excellent, of course, but the service was a little lacking. That is to be expected at a busy lunch place like this, however.MAC & CHEESE LIST - This Mac & Cheese is different. It is not your standard comfort food style, so if you are looking for Velveeta (no judgement zone - sometimes we are!) this is not your place. Today it was Pancetta Mac & Cheese (see pic) which was awesome, but it has been a different formulation in the past. Definitely good, but lighter on the cheese than most places. Worth getting for sure though.MUST HAVE DISHES IN JACKSON - The Best Damn G&T. Like the name says, it is the best G&T you'll have, at least until you figure out how to make it yourself. They make it with top notch gin and Jack Rudy tonic. I wouldn't advise the new BDG&T version 2.0, the tonic is gross."], ["Blanca V.", "The food was great! Had the shrimp scampi and angel hair pasta...service was okay just would of liked for our waitress to let us know more about dessert instead of assuming we wouldn't be interested. I heard about the desserts because she was explaining them to the table next to us!"], ["Andrew B.", "LMAO I just looked at the page and the special offer is for a free \"desert\" instead of \"dessert\". That advertising is paying off!Way to go Yelp"], ["Tiffaby H.", "The food is always good! Great lunch specials if you want a gourmet meal on a budget then this is the place! This location has an extensive bar area and hard to find liquors great for happy hour too which is 3-6!"], ["Aminah M.", "We found this place on Yelp and we were not disappointed. The ambiance and decor were great but the knowledgeable waitstaff and Delicious food are what make this place a winner for me. We ordered the Mediterranean shrimp salad and the farmers market pizza and added sausage. We ate at lunch and the portion sizes were great. Everything was super fresh and tasty. The salad was fresh, presented well and the shrimp were just melt in your mouth good. The pizza was a tad greasy, but it didn't take away from the flavor. We got the free desert for checking in, and ordered the cobbler. It was DELICIOUS. The crust was so light and crumbly I could eat 2 of those by myself. In short no complaints. My server Brandon was not only knowledgeable but he was also super friendly and just made our dining experience A1.   I'll be back to check out dinner for sure"], ["Kevin W.", "Duck wings and ribeye deckle will absolutely never disappoint. I chose the cowboy special tonight and am overly stuffed and happy.  Throw in some crab beignets and this place is by FAR the best, freshest and imaginative menu in Jackson. Add the fact that the price point is perfect."], ["Rob J.", "My wife and I love to use yelp to find not so hidden treasures across the country.Today, we found Manship! The Duck wings and greens were excellent. You should share your meal and be wise...and leave room for the cobbler!Nobody does cobbler like Mississippi!"], ["Ryan K.", "The Manship Wood Fired Kitchen was the second restaurant I ever visited in Jackson.  Over the past year, I've been back more times than I can count, and I always take my friends and family when I have visitors in town.  The Manship's service, atmosphere, and plate presentation is really great, offering a wide variety of options for different types of eaters without making the menu overwhelming.Hands down, the Manship serves the best pork belly dish I've had in Jackson... and I've had a lot of pork belly.  The Manship has daily menu rotations and seasonally modifies their dishes with local flare.  Recommended:  The pork belly, smoked Caesar salad (with extra anchovies), the Funghi, Farm Egg, and Bacon pizza, and any of half-fish specials."], ["Micah S.", "Every time I come to the Manship, I try something different. And every time I try something different, I love it. This is definitely one of Jackson's best and most creative restaurants. Worth trying!"], ["Melissa M.", "I've wanted to try this for awhile and happened to be nearby today.  The place is bright, clean, and well appointed.  Love the abstract art from local artists hanging in their gallery.  Our server was quick and friendly.  We'd gotten a gluten-free menu from the host, but our server went the extra mile and took it back to the chef who told him the dish we wanted was not gluten free and also cooked in the same oil as non gluten-free items. Fortunately we aren't that sensitive but we appreciated his thoroughness in verifying the items.  I ordered the salmon salad but asked for the kale to be changed for the local lettuces, omit onion, and add feta.  They did this without a charge (although they did leave onions on - no problem as I could easily remove them.)  My dining partner had the simmons catfish with parmesan fries.  Our order came quickly given the lunch rush.  My salad was very good.  The portion was relatively small, but it ended up being enough.  It included lettuce, finely diced cucumber, kalamata olives, roasted red pepper, and a feta vinaigrette.  My son had 3 nice sized filets and a cup of fries.  He liked the fish but really raved about the fries. He said the parmesan permeated the entire dish, not just the fries on top.  Being yelpers, I pulled the listing up and saw a free dessert with entree offer with check in.  We had the chocolate mousse.  It was excellent and a nice sized serving.  It was a complex dish with several layers and flavor profiles - chocolate, crust, ganache, cream, raspberry drizzle, and mine.  And it was complimentary, so there's that!  I will go back and try something else.  It was above average food and service.  Prices were a little steep for lunch (2 entrees, no drinks was $35 with tip) but it was very good."], ["Jon D.", "Very good, prices are a little high but you get what you pay for - worth the price. I had a wedge, shrimp and grits, and a baked apple. Would go lighter next time as my meal was a little heavy. Delicious nonetheless. Free Dessert with Yelp check in was a big bonus. I'll be back, no doubt."], ["Jessica S.", "Very nice atmosphere. Wait staff was nice. I ordered the salmon but it was really salty. As were a few other things I ordered. Aside from that it was pretty good."], ["Shane S.", "This place is great! It has only been opened for a year and half, but they have received awards such as Best New Chef, Best Restaurant, even the sous chef has gotten accolades. The Manship is a huge space, but also welcoming with a more than competent wait staff. The drink menu is extensive and eclectic. The shrimp and grits were out of this world, the pimento cheese is a perfect creamy texture with a little heat. My crawfish pizza was amazing. The crust was just crisp enough to hold up to the buttery sauce. They have a great happy hour with half price pizzas. The strawberry tart with ice cream was the perfect compliment to finish the meal. The Manship is one of the very few reasons to visit Jackson again."], ["Ann M.", "The manship is one of my favorite sit down dinner spots in Jackson, and it's my all time favorite happy hour! Half off pizza's and drinks- YES! Every pizza I've eaten so far has been divine, and the porch-swing and heat index always hit the spot. As for dinner, simple sides like their any gratin potatoes or and veggie dish have satisfied my appetite. Personally, I go for the brocollini and some divine crab beignets . The duck and the filet are terrific, as well as the salmon and redfish. We used the Manship for our wedding rehearsal dinner and were so pleased! The services were great, and all of our guests were extremely happy with their food. I recommend them for events, for happy hour, and for a fun date night! Definitely in my top five for favorite Jackson restaurants."], ["Lisa G.", "Food was amazing as well as the staff. Everyone was very friendly and helpful, from explaining the artist & artwork on the walls to the best recommendations of what to eat. Jake was my server and did not disappoint with the rabbit ravioli with pancetta and chocolate silk tower for dessert! He even brought me a spoon to not miss out on all the goodness of the most flavorful sauce! Telling everyone at the conference to try this place out."], ["Scott A.", "Best steak in Jackson. The reduction sauce on the steak is amazing. I had the Prime cut. Best Mac and Cheese I've ever tasted. My wife got the Greek chicken, little dry in the middle but lots of great flavor. Also had the red shrimp appetizer. Really good but not very many. Only thing missing from the meal was bread to soak up the sauces. The apple dessert was very tasty as well. Great atmosphere."], ["Amin A.", "Actually a 3.5 starWas visiting Jackson because corporate hq is centered here and had to attend training. Prior to arrival I mapped out all the restaurants that I wanted to try and Manship just so happened to be first on the list.  Day one after training I went to the hotel, changed, and went to manship to check out the Jackson food scene with 2 other colleague . The decor was beautiful and the restaurant very clean underneath a hospital it was apparent that the customer attraction was young professional- the restaurant was very busy-  we were seated immediately. The waitress introduced herself and said that the restaurant had many different foods but many dishes have a bit of Lebanese twist and spice added., since the chef was Lebanese. We ordered the tuna dip, and duck wings as appetizers. The duck wings were very good and greasy but had barely any meat on them. The tuna was actually a very good dip. For an entree I ordered the Rabbit pasta- to my surprise rabbit was a little salty of a meat- but furthermore the pasta dish was incredibly small- this was unexpected for a 18 dollar dish. My colleague got the strip steak which tasted remarkable but was a very little bit. The third colleague ordered a pork shoulder- which I cannot comment on because I do not knowingly eat pork. The desert was the best thing i got Tiramisu which was free with checkin was absolutely delicious maybe the best thing I got  Anyway with 2 appetizers, 1 entree, 2 drinks- 62 bucks. Not bad - it just didnt really satisfy portion wise. Regrets: I would get the pizza.I would return."], ["Landon M.", "First time here this evening while visiting Jackson, pleasant experience. The staff adhered to the reservation notes well. Charcuterie and cheese assortment were great. Salad and entrées were well but a bit on the large side. Red fish was cooked perfectly, seasoned well. The sirloin was cooked spot on med rare, only complaint is it was over sauced when it could have stood on its own. Very nice wine selection, especially northern Italians. Bar service was top notch cocktails were well, plethora of digestifs and probably the best Scotch whiskey list in town.  Slides in to one of my top five when in jackson."], ["Shenika C.", "I visited the Manship one afternoon for lunch. I ordered the shrimp po-boy and although it was slightly salty, I enjoyed it. I wasn't impressed with the parmesan fries. Very nice atmosphere and I definitely will eat here again."], ["Cherry D.", "Had lunch here on a Saturday afternoon with a couple of friends. We ordered the chicken, pork, and beef entrees, as well as a couple of alcoholic beverages. The pork was a little on the sweet side for my liking, so I ended up not eating my dish. The beef had a good Mediterranean flavor and it was really moist. But the chicken was on point! I would definitely go back for the chicken. My mouth is salivating just thinking about the chicken. Can't wait to go back."], ["Kris A.", "We were in town from New Orleans celebrating our anniversary so the pressure was on to find the perfect restaurant.                            The restaurant and bar area were full when we arrived with one party waiting but we were sat right away thanks to the convenient reservation I made on my Yelp app a few hours earlier;)On to the service/food experience...First of all the seasonal menu is amazing and I had a really hard time narrowing down my choices because I wanted one of each! We asked the server tons of questions and he answered all of them patiently and honestly. After thorough discussions with the server, browsing through Yelp photos and some meditation, we ordered: the white bbq wings, marinated crab claws, burrata apps, ribeye deckle, parm reggiano fries, mushroom bacon egg pizza entrees and for dessert the chocolate mousse and tiramisu. If youre having as hard of a time deciding as we did, here's the breakdown:Wings were delicious, nothing out of the ordinary thoughCrab claws are the only thing we wouldnt order again.  They were tasty but we expected them hot which thru us offThe burrata was the best Ive ever had. Ribeye deckle are medalions that melt in your mouth and is AMAZING. The pizza had generous amounts of exotic mushrooms, nice chunks of meaty bacon and a perfectly cooked poached egg that just made the bite velvety deliciousness. I am a french fry connoisseur and I wouldnt change a thing about these. Perfect size with perfect amount of salty cheese in a perfect portion. I even left a few which is hard for me to rationalize still today. Our desserts were complimentary thanks to our yelp check in!  The tiramisu is more of a dulce de leche with a slight taste of Bailey's. It was good, just not your typical espresso soaked. The mousse was excellent with a dollop of raspberry that complimented it well. Overall it was an awesome anniversary dinner and we would recommend Manship to everyone in the area. ($160 after tip: 3 andygator draft beers + 1 heavens milk martini not mentioned)"], ["Darren S.", "Now that I have a toddler, we have to make every date night count. The Manship is our most consistent go-to spot for a great experience. You can enjoy The Manship any way you'd like: cocktails and small plates, pizza and beer, or steak and wine. Whichever route you choose, you'll find fresh, local ingredients and the wood-fired grill accentuating everything. We've had excellent service every time, and the decor is bright and clean, contemporary but still comfortable. The open kitchen adds a nice buzz to the room."], ["Claire S.", "Extremely mediocre and pricy not for the portion but because it was kind of gross. Chicken was terribly dry with no flavor whatsoever, yet sitting in fat. Pizza suffered from the same dry chicken and artichokes were incredibly tough. Waitress never did a quality check, which was probably the worst part. She didn't have a full section and never once asked if everything was okay. Mac and cheese was probably the best part and even then - it was 2/10 at best. Won't be back. Won't recommend it to anyone. Best part was the drinks, which were well made."], ["Leon S.", "Food is good....service is slow....shrimp bisque (has  curry in it).... Steak, a u gratin potatoes, fish, and shrimp ravioli is is good .....the personnel aren't too attentive or just don't care ....I still tipped 15%....total of 150$ for 4"], ["Christopher S.", "When this place opened, there were long lines for lunch and dinner...with good reason!This is an excellent restaurant - upscale, great food, local products in the dishes, and full bar.  The Pimento Cheese appetizer is outstanding - fresh and homemade!This is American - Mediterranean fusion, meaning they have woodfired pizzas, brisket specials, sandwiches, and some typical Med dishes (some Med Chicken and other dishes...to be honest, I can not get past the salads, pizza, and sandwiches...oh and the daily specials are excellent).You probably will need a reservation, and they accept Open Table (love the iPhone App).Good service, good food, local ingredients, full bar - 5 Stars."], ["Phil S.", "Great service.  Food was great.  Asked for something a bit off menu and they handled it like it was completely normal.  Bryan behind the bar was working his tail off but not missing a beat. Would definitely go again when back in Jackson."], ["Christine G.", "I was brought here after a job interview, absolutely fantastic food! It was nice enough to sit outside. The staff was nice and accommodating, always a plus. I got the beef Poboy, absolutely delicious. 2 others got the chicken shwarma and nothing was left. The Spanish fries were amazing. A touch spicy, but that's ok. For the dessert, I got Tiramisu. A little on the creamy side than what I'm used to, but that's ok (others weren't a fan). There was also this lemon tart thing with sherbet which was also delicious. If I ever end up back in Jackson, definitely a place to go!"], ["Brenna M.", "Yelp has not let us down yet! It helped us find this awesome little restaurant, Manship Wood Fired Kitchen. We had Grouper with Polenta & Tomatoes/Veggies, Italian Crab Claws, Parmesan Truffle Fries & their Brisket as well as a Pepperoni Pizza with 2 Fried Eggs. Ridiculous. Food Porn. Oh, and their Bread with Seasoned Olive Oil is fantastic. Our three year old devoured the Italian Crab Claws & Brisket!"], ["Vicky O.", "Our evening at The Manship was not good at all! Our waiter never introduced himself as our waiter (he just appeared and asked for our order) nor told us his name (our receipt says his name was Brandon). In fact, his first few words to us included labeling my friend 'sassy'. We should have known then what would follow...Let's back up...I made a reservation, arrived on time and still had to wait to be seated. Not very long, maybe 10 minutes, but what's the point of a reservation if you have to wait? I wasn't a big deal so I let it go. Anyhow, as I was led to the very back of the restaurant (by the kitchen) I passed by 2 open tables that could have fit our group.  I let that go too. My friend and I waited at least 20 minutes to place a drink/appetizer order along. Thirty minutes later only  one of the two appetizers had been received. The other appetizer never appeared and our waiter was so inattentive that we had to flag down another server...whose only response was that he would ask our waiter about the food.  After an hour of bad service we did not bother ordering entrees and took our business further down State Street to Surin, where the service was EXCELLENT!Also, if you choose to eat at The Manship (which we  will no longer be doing)  DO NOT EAT THE BREAD! Our table was in the back next to the bread station (the worst table possible even though we made reservations and there were other tables open!!!) and ALL of the servers handle it with their bare hands. Gross. Gross. GROSS. The funny thing is even though we were so close, our waiter never bothered to provide us with any bread during our one hour stay. And when we asked for our check, instead of asking what the problem was or if we wanted anything else, he handed us our  checks (the only thing he did promptly) with a vibe of  'good riddance'. That is not okay.I will say that the pork belly was pretty good (Table 100's is better IMO) but the culture  of bad service is unforgivable for any dining experience. We will no longer support this business and I plan to share my experience, good and [mostly] bad, with other Jackson foodies."], ["Bill B.", "To start you must try the Porter. Brewed just down the road in Hattiesburg.  Best I've had in a long time. Nora, Caroline and I shared the pasta with lamb special, the shrimp with grits and two veggies, spinach and asparagus.  All first rate. I started with the Caesar. The dressing was a bit under done but still good. The croutons were great. I usually don't eat them but these are a don't miss. Afterward we had ice cream with strawberry tart. The tart is really tart but the perfect compliment to the vanilla.I'll be back."], ["Elizabeth C.", "Great food! We were totally stuffed but still had to order some of the delicious desserts. Our server, Alex, was a doll."], ["Sassy P.", "Grouper was the best fish I've ever been served!!!"], ["James H.", "Their Gin and Tomic is great! I haven't had anything that I haven't loved. It's quite good. Prepare for a short wait at times though."], ["Abigail H.", "Favorite happy hour in Jackson. Incredible food, great drinks. And the service there is wonderful. Take any recommendations they give you."], ["David M.", "On my first visit, I had the fried catfish plate and Parmesan reggiano fries.  The catfish was extremely hot and fresh.  The coating was unusual - a little heavier than what I'm used to but still very good.  The fries were the best part of the meal - covered in just the right amount of parmesan.The environment is really nice.  It's clean, bright, and casual but still feels like fine dining. As it was lunch, I didn't try the cocktail menu but they had a wide variety of interesting options. I think what I like best is that it's locally sourced as much as possible and everything is really, really good quality.  I'll be back to to try the dinner menu soon."], ["Allen T.", "This place is excellent. If I have someone visit from out of town, this is the place I take them. Menu always changes and I have never had anything I do not like. Great service and great food. If you are in Jackson, you should not leave without checking this place out."], ["Christian And Angela C.", "Excellent food. Don't forget to check in for the free dessert.We had the red fish, lamb pizza, and rabbit ravioli. Also the Jerusalem artichokes, carrots, and braised greens as sides. All was excellent. Fish was light and flaky. Pizza wasn't too greasy but the lamb is strong just as a warning. Rabbit ravioli was a bit small but again not too greasy and the rabbit isn't too strong. Just slightly chewy and very tasty. Artichokes aren't actually artichokes but actually sun chokes like fingerling potatoes. Carrots great. Greens good but a tad salty.Minus one star bc my parents didn't like the server Patrick and the tirimasu was pretty meh. To be fair two people recommended the apple cheesecake so must try that if ever back in Jackson."], ["Vim I.", "So glad to see that more and more local-focused restaurants are coming to Jackson. It's been a while since I've been back to the city, so I was pleasantly surprised to see to the new Belhaven building.We tried to make dinner reservations for my sister's bday at Manship for Saturday night, but they were full, so we went for lunch instead. So glad we did. First off, the ambiance is wonderful--very laid back but well thought out decor. A huge blackboard is displayed right next to the open air kitchen--listing the locally-sourced ingredients at Manship.I had the Fennel Sausage pizza since they have a wood fired oven. It was delicious as it sounds. The crust was crispy and flavorful just as it should be.My sister got the duck leg, egg, and polenta brunch special--that was out of this world good. And the boys went with the Italian Panini sandwich and Roast Beef sandwich--which they were really pleased with. The waitstaff left something to be desired--didn't refill water until we asked, switched up the order, and almost spilled the sandwich on one of us. That's the only reason I knocked off a star.Otherwise Manship is well worth going to."], ["Luke C.", "Regular spot for me and my wife. Always pleased with the food and service. The local sourcing of ingredients is particularly appealing. You're doing it wrong if you don't order the au gratin potatoes."], ["Brandon M.", "Went in tonight for dinner and the meal was terrific. We started with the pork belly which had a fantastic flavor. Our party had the pepperoni pizza, Amberjack, salad, potatoes au gratin and spinach. Each was perfect. We finished the night with blueberry cobbler which was a perfect end to the night. Mitchell was our waiter and all his recommendations were on point. Stephen, the GM, made sure to check in with us several times to make sure the meal was great. All in all this was an outstanding meal!"], ["Shay R.", "Filet was delicious! I got my order To-Go and the steak was perfect. Fried okra was also delicious."], ["Emma D.", "4 adults came for dinner.  We arrived early to beat the crowd.  The bar was fairly crowded.We all ordered something different.  The Frito Misto, a fried food appetizer, had a few nice plump oysters and some regular size shrimp along with many popcorn shrimp or something fried, plus some fried squash, artichoke hearts and some very tough fried asparagus.  It was accompanied by two OK dipping sauces.The pizza was so-so; the filet was a filet.  Other than an overpowering sauce the duck breast was tasteless despite an appropriate amount of fat.  The salmon was bland.  We shared side dishes.  The roasted cauliflower was charred but essentially raw and barely warm throughout.  The spinach had been barely wilted and contained an overabundance of stems and garlic.  We enjoyed excellent coffee and the house merlot was good.  All in all I would not recommend The Manship and do not plan to return.The music was not well chosen and was much too loud to allow for pleasant conversation.The desserts were all quite good - tiramisu, chocolate mousse with raspberry sauce and cobbler with iced-cream.  The cobbler was remarkable for not being too sweet.Our service was excellent."], ["Molly G.", "I love this restaurant! Happy hour is a great deal... Pizzas for $5 and cheap fancy drinks! The best drink is the Porch Swing. It's a sweet adult lemonade with alcohol. Careful, though, the drinks are strong! I also love the Jerusalem artichokes and the broccolini. The tabbouleh is thick and mushy-- you might want to skip this dish. The bread is to die for."], ["Krystal C.", "This establishment was great. Well lit, clean, excellent atmosphere. The bread brought to the table was fresh and served warm. I ordered the chicken wrap. The chicken was well seasoned and juicy. The pita was fresh and toasted just right. The tzasiki sauce was excellent. The truffle fries were fantastic. I wish I could have snuck an extra order home for later. My husband enjoyed his fried oyster po boy and home fries as well. Highly recommended."], ["Susan L.", "As a foodie, I thoroughly research via yelpRestaurants trying to find a great choice. On our way to Florida, stopped in Jackson MS. Manship was everything the reviews said; it is so worth the stop! From the porch swing drink, the pork belly app, and the Egg, bacon pizza, everything was delicious. It is so refreshing when a chef takes passion in the fresh, best ingredients and takes pride in using them in the most creative and delicious way! Spectacular!"], ["Orlean S.", "Visited Manship for the first time early on a Sat evening. Parking is a chore at the Belhaven building. The interior of the restaurant is clean and modern. Even though they weren't yet busy, because I had no reservations we were placed next to the bar. I chose Manship not because of the menu online but because of the outstanding pictures of actual dishes they post on Facebook. There is nothing on their appetizer menu that appealed to me. I heard people mention the tuna dip and the waiter recommended it. It really is tunafish with a smoky taste plus saltine crackers and some fancier bread crisps. It tasted OK but I would not order it again for $13. For a salad we ordered the wedge and Mediterranean. The wedge was standard, but I was not impressed with the Mediterranean. I guess I was expecting a Greek salad but this was very different. It had little dressing and was crunchy due to the chickpeas. I would not order it again.Finally for the main courses we had the duck breast and red snapper special. The duck was tasty yet a little chewy as duck often is. The snapper was outstanding - a light flavored fish over risotto and a few squash slices in a wonderful broth. Both dishes need a side so we shared 3: broccolini, fried okra, and tabbouleh. All 3 were terrific. The broccolini was well seasoned, the tabbouleh was good with a little more tang than is usual, but the standout was the fried okra. This should be on the appetizer menu. They were delicious whole fried okras with a roasted red pepper dipping sauce. They are addictive. Overall the Manship was a nice experience. It's too bad the standard menu isn't more to my liking - lacking in appealing appetizers and a larger selection of seafood entrees. But the main course was outstanding - I definitely would return again. Even though we had 3 different people try to take our drink order, the wait staff was pleasant, friendly and attentive."], ["STEVEN W.", "Great happy hour prices.  I had the Scallops, they were a little salty and would not recommend. However, the server asked to redo them and I ate them as is.  The bread before the meal was great.  They have a huge selection of alcohol.  The pizza was great and looked delicious.  I would try this place again."], ["Tom M.", "Oddly enough EVERYTHING was great .I had a bone in ribeye with a veal reduction sauce with a farm fresh fried egg on top.My goodness was it good!"], ["Patrick C.", "Outstanding food & bartenders! See Brian and Josh. Very knowledgeable & experts in mixology!"], ["Rachel D.", "I came here on a Monday night, definitely a little crowded but we were seated immediately. My friend recommended the \"porch swing\" OMG. Heaven sent. It was amazing and had a great flavor - not too overbearing with lemon. We ordered the pimento cheese and bread as an appetizer as well as the pork belly over creamy polenta. Both were great and not much was left on our plates. The pork had great flavor and the pimento cheese spread was a great addition to the garlic bread. I ordered the gulf shrimp as my main course. Angel hair pasta with olive oil and Italian spices with lots of shrimp. The shrimp were cooked to perfection and the spices on the pasta really topped it off. Our server was outstanding as well. This place definitely stands out as a favorite! Will be back the next time I am in Mississippi!"], ["Jess D.", "four stars because it looked and smelled awesome, but don't let the two dollar mark symbol fool you. it is very expensive. at least for my budget. but restaurants with same symbol have half the price"], ["Beth P.", "I have now eaten here often for both lunch and dinner, my best test for is a local place going to be consistently good - and this place passes with flying colors!  Service and staff always friendly and the food from salad to sides to entree has never disappointed."], ["Jonathan V.", "My family and I went to the Manship last night and we were absolutely blown away by everything they had to offer.  The service and the food were impeccable. I highly recommend  the Ribeye Deckle or the Duroc Pork Shoulder for your entre.  After having a bad experience the first time we went I was hesitant to go back, but I can honestly say that after the amazing time we had last night we will be going back on a regular basis."], ["Jose R.", "This place is a true gem. Stopped by with friends and the appetizers were flawless(do not miss the duck ham and the pork belly both were to die for!) The entree portions were delicious and we ordered the range of steaks, duck and fish, all were perfectly seasoned and cooked. The side portions can be shared and the risotto shiitake and grilled cauliflower were simply delicious.We ordered two desserts to share and they were also outstanding, this place is fabulous."], ["Josh C.", "This place is a breath of fresh air to the Jackson dining scene. Had a great meal here, and was treated so well by the staff. I recommend grabbing a few things, and sharing them. (Mary Katherine was a really fun, and knowledgeable server. She really helped us hone in what we wanted, and if I could poach her for my restaurant, I totally would have!)"], ["Jason W.", "I'm from California I found this place on yelp while visiting family here Jackson.  Driving up it was hard to tell what everyone is talking about, but when you walk in its a beautiful restaurant.  I came here on Friday and like it so much I came back on Saturday.  Tried the BBQ wings, the greens, the duck, and the mac&cheese.  Everything was so good and the waiters and staff were really cool.  Everything here is fresh and local.  If they ever decide to build one of these in L.A."], ["Javan C.", "All I have to say is \"meat and cheese\" the selection here was awesome and simple. I had the five selection of meats and cheese it was great. For desert had the peach caramel dessert. A must try if your I'm the area."], ["Maddie P.", "Excellent! We split the the small house Italian salad and the fried soft shell crab BLT sandwich. Both were wonderful! The fried okra was the whole okra stalk with red pepper relish and my favorite thing we ordered. They have an unofficial kids menu and my picky kids loved the hamburger and cheese pizza. The hamburger looked good, but one taste of the pizza and we kept sneaking bits from the kids! Excellent, friendly and fast service."], ["Jason M.", "Casual fine dining, pleasant atmosphere, excellent service and outstanding food. Had the 8 oz filet and it was out of this world. If you're looking for a classy evening in Jackson that won't completely destroy your wallet, this is it. Will definitely be back again!"], ["Sam L.", "New restaurant in new Baptist Medical center. Staff is friendly and very responsive. The lunch entrees we got were the special of the day of brisket, potatoes, and Brussels Sprouts with bacon. Tasted fresh and a great deal for $11. The steak kabob could use a little more refining. Price of $14 comes with 1 side but no starch (rice pilaf would go great) which can leave you leaving unfulfilled. The meat was cooked very well, but 2 main drawbacks: way too much oil is left in dish intended to be part of the sauce and not enough bell peppers to add some crunch to the dish."], ["Rich R.", "Couldn't believe I found this in Jackson Mississippi - the food was amazing, drinks superb and service to boot. The bacon, mushroom and egg pizza rocks.....what the won't tell you on the menu is the pizza has a nice hint of truffle on it.....excellent.... Ask the bartender for a signature cocktail to start, you won't be disappointed. Apparently the largest selection of spirits in Mississippi - maybe but I can't confirm that badge but I can confirm they are well stocked with whatever you want, even small batch varieties of gin and bourbon."], ["Peter C.", "They know how to cook here. Most everything I have had here has been delicious. Some of my favorites are the duck leg confit, the pork chop, the pork shoulder, and the rabbit ravioli."], ["Eats S.", "My work buddy and I are foodies from LA and have been in Jackson filming a movie for the last month and only discovered this place this past weekend. We were greeted with a smile by our server/bartender Nick. Although he was very busy at the bar, he was always very attentive. The food was amazing and delicious! I was kicking myself wondering why I didn't discover this place EARLIER! We ordered the Pork Belly app, the Caesar, the mushroom risotto, the prosciutto pizza, and the Pannacotta dessert with Red Wine poached pears with a raspberry drizzle with phyllo crisps. Everything was spot on, plenty of flavor, and all the right balance of textures. The pizza comes with four silicone ramekins of condiments - fresh dried fragrant oregano, grated parmigiano, large sea salt flakes (Maldon?), and what every pizza should have sprinkled on it, red chili flakes. Nice touch! The prices are fair, you're getting great quality, delicious food so you should pay accordingly, you get what you pay for.We are here for another week and plan to be there practically every night till we leave! The manager Steven does a great job of trying to get to know all the patrons and makes sure that everyone is having a great experience under his watch. This place is truly a gem! Highly recommended."], ["Kent S.", "I cannot believe how amazing this meal was.  Truly exceptional!  The duck wing appetizer is confit and the crisped and tossed in a perfect soy citrus glaze.  The scalloped potatoes were possibly the best potatoes I have ever had anywhere.  The special tenderloin small plate they had  was amazing too.  cooked sous vide and then grilled, topped with a curried jicama concoction.  We went here on the way to New Orleans.  We went to quite a few highly recommended restaurants while we were there and we thought this was the best meal of our whole trip."], ["Elizabeth B.", "The food at the Manship is wonderful; I've liked everything I've eaten.  They also have a great happy hour with half price cocktails and pizza. The bartenders are really friendly and great at recommending cocktails to try, and their Best Damn G&T is to die for. My only complaint--and the only reason it gets less than 5 stars--is that the hostesses are absolutely abysmal. They're not attentive at all when you walk in. Recently, my friend called to make a reservation, and the hostess told her no reservation was needed that evening because the restaurant wasn't crowded or booked at all. Well, when my friend arrived, despite all but 3 tables being empty, the hostess said they couldn't be seated for 45 minutes b/c all the tables were for reservations. The hostesses really bring down what is otherwise an amazing restaurant and definitely one of the best in Jackson."], ["Christina M.", "Upon entering the restaurant on a Friday early evening we were asked by the hostess if we were there for happy hour. We replied that we were really there for dinner and were seated in the back of the restaurant. The menu stated that happy hour was from 3-6 and included 1/2 price pizza and discounted cocktails. My husband ordered a beer and a pizza and I had the shrimp and grits. Service was ok. Food was good. However when the bill arrived we were charged full price for the beer and pizza. When we mentioned to the waitress that it was still happy hour time and could we get our discount, she replied \"no, that's only for people sitting in the bar or patio\" and would not give us the discount. She said this happens to a lot of her customers and the conversation is always awkward but there wasn't anything she could do about it. Not sure why sitting in one place qualifies for happy hour prices when another location does not, wish this was made clear by the hostess when we were seated."], ["Ryan D.", "I rarely ever write reviews, but the Manship boasts amazing food mixed with great service. I tried the calamari (excellent tomato sauce) had the hanger steak with grits. Everything about this meal was perfect. The chef has opted to avoid superfluous amounts of sauces and veiling ingredients and has chosen to instead perfect the meats with basic seasonings. The entree sizes are perfect and the wide variety of addon side items allow for dozens of combinations. The atmosphere is also excellent and the staff is top notch. This is something Jackson has needed.Update: noticed that I had $20 tacked on to my final bill without any knowledge of why only to realize it was their corking fee. FYI"], ["Betty D.", "Great ambiance, great service, great food. Fully loaded bar with lots to choose from. I've been on the hunt to find the perfect fries in Jackson, and my hunt has come to an end. Duck Leg Confit was also crispy and amazing. Highly recommended!"], ["Tiffany L.", "Great atmosphere inside.  Menu is kind of limited.  I had a tuna panini and it was good. The roasted brussels sprouts were the best part."]], "Babalu Tacos & Tapas": [["Melanie B.", "I was very impressed with this restaurant. The service was impeccable and attentive. As soon as we entered the establishment, we were greeted with smiles and promptly escorted to our table. Our server, Kayla, was extremely friendly and knowledgeable not just about the menu and specials, but also about the city. I felt like we had our own Jackson tour guide! We started our meal with table side #guacamole. It was fresh and delicious! I loved the chips that came with the guac. They tasted house made. I noticed the menu was mostly gluten free and had many options for vegetarians and vegans! I decided to get the house salad with a filet of salmon. The dressing (lime vinaigrette) was incredibly tasty. I selected the half portion since I ate an appetizer. I highly recommend getting the house made lemonade. Overall, a wonderful dining experience. The prices were reasonable. The food was delicious. And the service was some of the best I have had in a long time. I hope to be able to return for dinner during my stay in Jackson so that I can taste some of those enticing drinks and entrees!!   #glutenfree #vegan #vegetarian #margarita #texmex"], ["Greg A.", "I have to say, I was a little dubious about eating at a hipster-ish taqueria with a Cuban-inspired name in the middle of Mississippi, but once again (to paraphrase Rasheed Wallace) Yelp don't lie. We started off trying some of their Southern fusion dishes, and both were quite excellent.  I wasn't aware that black eyed peas would make a tasty base for hummus, but now I know.  The delta tamales were quite good as well.  Like any good taqueria, Babalu also has a very good selection of margaritas.  I tried the tamarind margarita and it was really good, and I liked the spicy touch on the salted rim as well.  Getting to the heart of the matter, the tacos here are very well done.  The duck tacos here are probably one of the best tacos I've ever tasted.  I also really loved the carnitas tacos and the redfish was okay, but the next time I head back here, it's going to take a lot for me to try something other than the duck taco.  The restaurant itself is bright and airy and the service was very friendly and attentive.  This is a definite \"must try\" if you're visiting Jackson and looking for an alternative to Southern food."], ["Liana N.", "I've now been to the Memphis and Jackson Babalu's and here's my consensus:1) I only order texmex here. I know they have a ton of stuff, but I stuck with what I enjoy, though I've been with some people that order the other things.2) I've been here about 6 times now, so I've tried a different array of things.3) I'm a stick with what I love type of person and will order the same things over again if I like them.Their drinks are amazing. If you want a good hand crafter cocktail, definitely try any on the menu. I havent had a bad one yet. Their made to order to table guag is good, but sometimes shotty and unreliable. Depending on the day, and I'm sure, avacado, it tastes different. Love their chips though.My favorite part of the menu has to be the single tacos. I've traveled all through their options but I love their seafood/south mix with the oysters and others that I continuously order again and again, they taste great every time.I guess my only complaint I've ever had is their lack of consecutive service. Some days, I'll have lunch or dinner and it'll be a fantastic server. Others, we're waiting on our server to even order in, which is a shame, because that's what's limiting them to my 4 stars. Maybe they'll get better servers, who knows, but I definitely will go back because it's one of my favorite food spots here in Memphis."], ["Steve A.", "This very popular spot offers a combination of Mexican inspired dishes and small tapas plates. As noted elsewhere, the table-side guacamole is extremely good, and I really liked the homemade tortilla strips served with it.Ceviche is actually diced tuna with citrus and avocado. Shrimp and grits we classically prepared.Service was very friendly and our server was obviously very proud of the quality of her restaurant."], ["Jeana S.", "Babalu's is a really cool and unique tapas restaurant! It's a great place to try a new flavor and hang out with friends. The interior is beautiful, and the patio is a great place to enjoy a cool summer evening. Here you can eat the very best guacamole in town! It's even made fresh at your table.The service is spectacular! About two years ago, my fiance at the time and I ate here with family to celebrate our engagement. I'm not sure how our waiter found out, but unexpectedly he brought us a giant sparkler that lit up the table and a free dessert as a congrats! It was so nice of him! Whether you want a date night or a night out with friends be sure to try Babalu's!"], ["Rachel P.", "When friends come through town, I always try and make it a point to take them to Babalu. For lunch or dinner, it's such an excellent option and definitely some of the best food in town. As far as atmosphere, it's an incredibly cool place. The restaurant is spacious, with both a large dining area as well as a huge bar as well. They've also got a killer patio, that's sheltered so you can dine out there even when it's raining. The patio area boasts a few comfy sofas in addition to high-top tables. Indoors, a projector plays episodes of \"I Love Lucy\" on a giant wall you see as soon as you walk in. Get it? Because Babalu was the name of Ricky's band on the show?? The food here is really, really fantastic. If you're with a group, always splurge for the guacamole. They make it table-side and it's super delicious. As far as entrees, I typically go for the tacos as you can mix and match. You can't really go wrong with their tacos, I promise. If you're not feeling tacos, definitely go for the BabaBurger. It's, without a doubt, one of the best burgers in town. The chopped salad is another excellent option if you want something lighter, and it comes in two sizes!The cocktails here are excellent. The Baba-rita is delicious. They also always have a seasonal margarita and I have never been let down. The drinks are definitely strong, so watch yourself. They've got a great beer selection too. In warmer months (so, like, most of the time) their sangria is an excellent option. My friends and I love to split some guacamole and a couple pitchers of sangria on the patio. The servers are usually super friendly and knowledgable. The food comes out as it's ready, so you won't necessarily get your food at the same time as everyone else at the table so be prepared for that. Overall, Babalu is one of the best dining experiences in town for sure. Go check it out!"], ["Gene G.", "This place is awesome. Best guac in Jackson. Maybe even Mississippi. Jordan was our guac maker and he was fantastic. Great smile and awesome personality. Would definitely come again."], ["Ryder T.", "Solid. This is an excellent restaurant. It just lacks that... je ne sai quoi, that puts something to a 5 star rating.The food menu really has three things to touch on: appetizers, small plates and tacos. The small plates are great, I have never been too disappointed with one. The tacos are pretty good, but only four stars at best. The appetizers are tasty, some are like basic versions of the small plates.Your strategy should always be to share food. Each dish is basically equivalent size, so you can sometimes economize by getting cheap tacos and an appetizer instead of all small plates. The portions are reasonably generous too, so you can just get one extra for the table if it is just a quick lunch, or maybe 1.5 dishes per person for dinner.MUST HAVE DISHES IN JACKSON -  You MUST get the Queso Blanco dip. It is the best queso in Jackson, by far. It is a good size portion, so bring plenty of hungry cheese lovers to the table. As you can see from my picture, it has a salsa roja on it and some pic de gallo. It is served in a hot cast iron dish and the edges get all bubbly and crispy and delightful. You cannot lose.The table side made guacamole is a staple, and if you like guac - this may be the best in town. It is little pricey though.The Margaritas are awesome. We had some seasonal Blood Orange ones and a Champarita (made with champagne, duh). The Blood Orange was very nice and subtlety flavored, the Champarita was delicious but a tad sweet. If you like champagne as much as I do (a lot) get it.Honestly, this could probably be a 5 star for a lot of people, it just doesn't stay at the top of my mind like a 5 star place should."], ["Blue A.", "I could really eat tacos every single day.I arrived a Babalu alone for lunch - and ready to fuel up after a long morning. I took my seat, and looked over the menu. And I waited. And waited a little more. Then finally the server spotted me and came over - it was already about 10 minutes in and she hadn't even stopped in to say hello, grab a drink order. I'll assume she was on break and just getting back in.....this was really the only hiccup at Babalu - the rest was great!Started with the Lump Crab Pico De GalloLump crab, jicama, ginger, tomato, citrus, onions, jalapenos, cilantro, house chips 8.50---This thing photographed amazingly ahha - it needed SOMETHING, not sure if it was salt, maybe a little more kick? Something was missing from it - but regardless it was tasty and refreshing!I then went with the 3 Taco Sampler.REDFISHCornmeal fried redfish, roasted garlic-basil aioli, piquillo pepper relish, micro cilantro CARNE DE CERDOCompart Family Farms smoked pork belly, chipotle-citrus BBQ sauce, roasted peanut slaw, cotija cheeseCAMARONESGrilled or fried gulf shrimp, cilantro slaw, radish, comeback All three were equally good! This was my very first time every having redfish - it was delicious! The shrimp and pork belly were just as good.The restaurant was super clean - and super busy. You can tell this place is always packed for lunch. I love that the theme of it is I Love Lucy - they have ILL playing on a projector. Also, I really love the outside patio - great spot for a date night/nice lunch when it's fresh out. I'll deff be stopping in here again on a future trip to Jackson!"], ["Jonna B.", "The parking lot of Duling Hall was full. \"Oh, shoot! We'll never get a seat\" crossed my mind. We got our pager, and sat down on the patio furniture outside. Within ten minutes, we were seated. Our waitress, Gwynne, explained how Babalu worked (bringing food out as it was prepared, portions, etc...) and she did a great job of always refilling our drinks, because some of those tacos are spicy! The atmosphere was great and though it was crowded, it wasn't loud. As far as the food goes, the tamales small plate was great. My husband got the Baba Burger and he claims it is the best burger he's had in Jackson. I got three tacos, one with beef, chicken, and steak. The beef taco was absolutely amazing. The other two weren't bad, but they also weren't just fantastic. Overall, it was a great experience and I'll be going back!"], ["Megan K.", "Really fun taco/tapas joint in the historic/hip Fondren District. I started with an awesome drink--Paloma Delta (vodka, grapefruit, cucumber, cilantro, mint, agave--DELICIOUS). Next up was the yellowfin ceviche--totally incredible. Very fresh and limey. Highly recommend. These were definitely the perks of the meal... the tacos weren't bad, but not great. I had the chicken and pork belly. Both were presented on freshly baked blue corn tortillas, but not as much flavor as I expected.That being said, it was a great environment--really fun vibe, black and white I Love Lucy playing on the wall, lots of beer on tap and other awesome drinks to choose from. Ample patio seating, street/lot parking. Also--while service was a little bit slow, my server (didn't catch his name) went above and beyond to make sure I had a great time. He took tax off my bill (work trip), boxed up my leftovers and separated my alcohol to a different bill. Fantastic.Try it out!! You won't be disappointed."], ["Taya M.", "Great atmosphere, great serviceShrimp and gritsCarne la VacaVegetalCreole shrimp and gritsRedfish Between the items listed above we will back next time we are in townNot a fan however of the lamb barbacoaPollo-my hubby liked this one but it wasn't for me"], ["Thoa H.", "I think this is as good as it gets in Jackson, MS, maybe the entire state of Mississippi. As a California native and someone who lived in Mexico for 3 months and 6 months in Chile, I would like to believe that I know my Latin American flavors pretty well. I TRIED: Guacamole: One of the best guacamole I have ever had. The guacamole was creamy with a hint of spicy from the jalapenos and tart from the lime. I thought the sun-dried tomato was a unique twist that added more depth to the guac. The chips were fresh too. Fried Calamari: This was just too salty. The Calamari was crispy yes, but if you don't eat them quickly, it gets very oily. The soy sambal glaze was too thick and salty. This appetizer had more of an Asian flavor and I thought was random on the menu. I had a hard time finishing this because it was overly salted. Pan roasted redfish: Delicious! The potato was perfectly cooked. Definitely my favorite. Tacos (Camarones, Ostra, Atun): The Ostra tacos weren't my favorite. As for the other tacos, I wish there was some salsa on the tacos. It was just too dry. The blue corn tortilla was so fragile. It was good, but when I picked up the taco, the tortilla ripped and most of the filling fell out. I was kind of disappointed because I heard good things about the tacos. I like the shrimp and fish but it really lacked more salsa. If you go to any authentic taco stand, there would be a row of salsa up for grabs. When I went to ask for salsa, I was told I had to order the pico de gallo on the side, which was an additional 5$ when all I wanted was a little for my tacos. I ended up with tons of leftover chips and not enough salsa. Overall:I would come back, but maybe I'll bring my own salsa for the tacos."], ["Kayla C.", "Babalu is located in the Fondren area of Jackson. It has a nice open seating area it's a bar and has covered outside seating available. I Love Lucky is projected onto one of the walls which is fun and adds to the feel of the restaurant. Babalu is great for small or large groups.Every day they have new specials -always so creative. I usually choose their specials. If I want to go another route, I choose three tacos from brisket to vegetarian, I've enjoyed them all. My go-to appetizer is always the guacamole. The server comes and mixes it up at your table which adds a nice perk all touch. It can be very busy on weekend night so make sure you come a little early. I would recommend Babalu to anyone visiting the Fondren area!"], ["Anne-Lauren F.", "I absolutely love their appetizers - best hummus in town! Some of the drinks are a bit over priced, but they make up for it with their $5 wine happy hour! Definitely a great spot to enjoy tacos on the patio when the weather is nice."], ["Faisal S.", "Great food. Served fresh. Great service. Very unique take on tacos and southern food. From a Chicago foodie I highly recommend."], ["Chase W.", "This place was amazing. The food was delicious, the service was quick and very friendly, and the atmosphere was inviting and relaxing. Let me start my breakdown by explaining how this place works. First of all, unless you hate that green goodness, getting the table side guacamole is a MUST! That was probably my favorite part of the whole experience. They just bring a big platter and plop that thing right up next to your table that has all the ingredients for some kick ass guacamole. They ask you if you could do without any of the ingredients, and then they make that green crack right there in front of you. And man is it good! The rest of the menu is made up of tapas, tacos, or other more \"normal\" food items such as burgers, etc. They are definitely known for their tapas so I recommend sticking there, but the tacos are a close second. All the tapas and tacos are very small portioned so you have to order a few items to really get stuffed, so keep that in mind. My wife and I came here for our wedding anniversary and we wanted the full experience. After ordering the guac, I chose the crab cake tapas, shrimp taco, and redfish taco. My wife ordered the muscles tapas and the shrimp taco. We also ordered one of the babarita (fruity margarita) and some specialty pineapple margarita. Everything was delicious. I would recommend the babarita highly, especially since it's their special drink. The food was amazing, and even though each order was a small portion, all the orders combined with the guacamole was more than enough to squash my large appetite and leave me nearly busting at the seams. Overall we had an amazing experience and we will most definitely be coming back soon! Ask for Ryan when you come in, he was hilarious and so nice and helpful. He made our experience special too by giving us one of their table sparklers after our meal in celebration for our anniversary."], ["Emmi S.", "This place use to be always on point. Not sure what has happened lately.  Service has been down and their guac which usually is amazing has been less than lastly. Lacking in flavor and tasting plain.  Last time we were in I got the special and was not told it was going to be spicy.  Have been saddened by the decline in quality.  Maybe it was just a rough patch. Here's hoping."], ["Liz B.", "Confession: I catch myself daydreaming about Babalu's guacamole on a regular basis. It's a little expensive, so be sure to lick the bowl before you're done.Babalu is a great spot for lunch on a sunny day, happy hour with friends, or a date night with someone special. When I have friends visiting from out of town, I always bring them here. I love to curl up on the comfy patio sofas outside and catch up over delicious snacks and drinks.Despite the name \"Babalu Tacos & Tapas,\" I don't think that the tacos are Babalu's greatest strength (though $2 tacos during happy hour are hard to resist!). My friends rave about the Baba Burger, and the Babalu chop salad (with black beans, grilled corn, pumpkin seeds, and cotija cheese) is my personal go-to order. While I'm not always a fan of ordering salads for my main dish, this one is so tasty and filling! Also, don't you dare miss out on the garlic rosti potatoes. Go get 'em!"], ["Anthony S.", "Babalu was a great experience. I flied solo so I went straight to the bar where I was met with a smile and a pretty decent beer selection. I was especially happy to see Mississippi beer options here! For dinner I got the Scottish salmon that sat on top of a fried cheese grits cake - yea, it's as good as it sounds! The salmon was cooked exactly to medium like I ordered and the sauce complimented a light grilled flavor perfectly. I also had to try the grilled red fish taco which is also worth your time. There are a couple of ways that Babalu would receive a 5-star rating from me.1) Fry your taco shells for your tacos. My shell broke apart on the 2nd bite.2) Beer prices for locally crafted brews are inflated. $7?! Coming from CO - that's a little pricey (and the beer didn't deserve that price to be fair)3) TVs for those sitting at the bar! Other than those things my experience was great! I would highly recommend this place to anyone in the Jackson area. Also, get the cheesecake bites for dessert if that's your kinda thing. Your tummy will be at max capacity...but isn't that the American way, especially in the South?! Cheers!"], ["Lee C.", "Babalu is a fantastic and popular restaurant in Jackson, MS--one of my host's favorite places.  The quality of the food is quite high and the tastes are excellent: interesting and well-balanced.  The price is a little steep for lunch.We had several dishes.  The chop salad was excellent with a great salad dressing and variety of items in the salad, including pumpkin seeds.  The tuna and veggie tacos were equally as good but a little small.   The shrimp in grits is worth writing home about, with their good brown sauce and perfect mushrooms.  There were some but not a lot of vegetarian dishes.The server was good, and our table was fine.  There was a variety of people inside, including some children.  The atmosphere is upscale but reasonable.  There is outside seating as well as inside seating.  There was no music interfering with conversation and it was a reasonably quiet but bustling place.I would definitely return to Babalu, if I revisit Jackson."], ["Ryan K.", "Babalu offers a different option for dinner, setting it aside from many other restaurants in Jackson.  With light fare, small plates, and table-made guacamole, Babalu presents a vibrant, fun, and not-too-serious approach to a night out with friends.  Babalu is colorful, and shows its charm through the always-on projection of I Love Lucy episodes on its wall.  Outside, you'll find a nice rail-garden enclosure with fiesta lights and live flowers.Even better is their happy hour, where you'll get 4$ drinks and 2$ tacos.Recommended: Redfish Tacos, Shrimp Tacos, Guacamole (with all the upgrades), Peach Moonshine Margaritas, and the Baba Burger."], ["Elissa W.", "Very happy! Guacamole & pico taste super fresh. Chips are well seasoned and warm. Queso must get thick quick cuz when I got it home 10 mins later it was almost solid but has a robust taste. The tacos are all very fresh tasting. My favorite was the pork belly and crane Asada. The thing that gave this place a 5 star was the guest service. Everyone was very nice and attentive. Glad I found this place on yelp. Next time I travel to Jackson I will stop back."], ["Karla O.", "Get the guacamole, definitely worth the wait. We had a mix up with our order that caused us to wait 20 minutes for our guacamole but I'm certainly glad we waited!"], ["Jennifer M.", "After 15+ visits on work trips Babalu continues to impress! It's the only restaurant I want to dine at in the Jackson area. Last night our waitress Tabitha was so on point (she just made me happy with her amazing personality) The management even got us a table without the wait when I let him know we were traveling through Jackson and had a time crunch. Babalu I heart you so much! Where else can you order anything on the menu and it will blow you away, all for a fair price!"], ["Sarah T.", "I have been here regularly for years and I have never been disappointed. The guac and the margaritas are the best way to start your meal. Order as many tacos as you can and keep the small plates coming. Even the staff here is top notch. One of the best restaurants in Jackson, for sure."], ["Kenny R.", "Expect super fresh food and a knowledgeable staff!  I don't think there's a thing on the menu that will make you feel like ass afterwards.Went to the Babalu in Memphis and didn't realize there was more than one.  Both of them did NOT disappoint!  I'll be back as soon as I see another one in St Louis!"], ["Brandon B.", "My second time going here. Got the guacamole a second time. Just as good as the first time. Very good for cocktails, but can be a bit pricey. Great if you've got a good group of friends."], ["David E.", "We had never been to Babalu before, but going through Jackson we stopped at the \"Original\" - and we were so glad we did. We recently got a Babalu in Memphis, but have not been able to go yet - we will now!My wife and I both had the 3 Tacos Plate - chicken, steak, and pork. The meats were all flavored wonderfully and very tender. Everything is \"scratch-made\" in-house which simply shows their commitment to serving quality food.If you are in Jackson - or just passing through - stop in and taste the quality of their good food."], ["Jenna L.", "Love there fresh table side guacamole and fresh salsa! There pulled pork tapas is super tasty!"], ["Cody M.", "An amazing addition to the Jackson foodie scene. The atmosphere created by the space, the I Love Lucy projected on the wall, and the outdoor seating is very inviting and friendly. The food here is really unique in its presentation and taste. The guacamole is of course 100% the best you'll ever have, and is prepared tableside. This is one of the best date spots in the area, but don't expect it to be super cheap. The portions are intentionally smaller, so get a lot and share. The burger is the bomb, and I've never had a bad taco. You can't go wrong with anything here. Awesome place!"], ["T.D M.", "The service is Terrible!!!After sitting at the table with our 2 year old Grandson for 15 minutes and no waiter we gave up and leftWill not go back"], ["Bill B.", "We came here by accident. We were looking for another place but this looked good from the outside and we decided to give it a try. Lucky for us. Great casual atmosphere.I had the enchiladas special. Tasted great with just a hint of spice. My wife had the torta. Also great. I would recommend either. She also had the sweet potato French fries with come back sauce. Said it was the best she ever had. I'll be back."], ["Gary J.", "Claim to fame: Gaucomole.If your not a guacamole (grauc) fan--this place is not for you.  It seems like everything has grauc.  Their renowned \"Babalou Burger\" is nothing memorable.  One plus is that you can see the cooks preparing the food (always a plus). At possibly 200% markups, don't forget to bring your wallet or purse as well.  Moreover, the beer selection is quite limited.  You have standard beers and hardly no IPAs or Micro-brews. Most patrons come here for the atmosphere it seems.  I've never heard someone say something along the lines of, \"man bablalu is great food.\"  However, people have a great time here.  There is a wonderful outdoor patio adorned with festive lighting.  The staff are very cordial and they seem to have a solid and organized system for serving.Conclusion: you can have a good time here, even if you don't like guacamole."], ["Natasha W.", "Awesome Service, great friends and always delicious food. Creole shrimp and grits for me, so de-lish! This place is always on the mind and is heaven upon each return..."], ["Crystal S.", "Great atmosphere and service was excellent. Cozy and quaint, the type of place that makes you want to come back. Our server madrbtge guacomole at the table in front of us, how fresh is that?! I had the lump crab meat pico de gallo, with the house chips. It was delicious, more of a ceviche. My son had a quesadilla and ate every last bite. Kids eat free on Sunday night!! Awesome place, can't wait to try something different!"], ["Matthieu K.", "Great place overall. I have been to the Babalu in Memphis as well, was pleased to see one in Jackson too. Service was perfect. Food is great, I can only say positive things. I had tacos, the guac (which is a good value for this town ...), and a couple items the waiter let me order off-menu.On a Sat night from 9-1130, I did not find the place to be too loud and there was a game on ... It was packed but not loud. I plan to return."], ["Abbie L.", "Food was good.Drinks was good.Patio are at night was nice.But the main the main reason I give this a four star was the staff was going above and beyond trying to get us a table of 9. Despite the confusion on some orders, they went on and corrected the order it."], ["Brett M.", "I typically hit Babalu whenever I'm in Jackson.  The Fondren area is really stepping up and Babalu is making its mark on this area.  Starting with the bar, I would highly recommend the house margarita (Babarita) or one of the drinks from the cocktail menu.  They have limited seating at the bar, but it is actually a nice spot to eat if you aren't interested in table service and don't mind the crowd.The atmosphere is typically pretty loud and happening.  Expect a wait on a weekend, but I have found it moves quicker than they typically say the wait will be even though there have been times when I thought they let open tables sit empty longer than they should.  The service is typically very good at the table, with knowledgable and service oriented wait staff.  The food is fresh and good.  Not all of the dishes have been excellent, but they have many to please so use your waiter to guide you to the best dish.  I would recommend the Redfish, Salmon, or even a burger.  The appetizers are a necessity so we typically go to the guacamole or the hummus (yes hummus) before dinner.  I am gluten free and they have always been very helpful at guiding me through the menu and accommodating my needs."], ["Darren S.", "There's a lot to like at Babalu: the decor, the crowd, the bar, and the food. It's one of my most dependable spots in Jackson for a meal that is rich and flavorful but doesn't leave you feeling sleepy after eating. The real standout for me is the Baba Burger, packing tons of taste between the sourdough buns. It's perfectly balanced with a sweet pepper, avocado, bacon, comeback-ish sauce and patty. The lamb sliders and patatas braves are also always stellar. The guacamole, made table side, is mandatory."], ["Kevin V.", "Chelsea was great Food was awesomeTried the tacos and empenadasHappy Hour $2 tacosCould not be better !!!!!!"], ["Arthur G.", "Fantastic guacamole! Nice atmosphere. Trendy."], ["Tamara Y. W.", "Lauren was a server and she was excellent. The guacamole and pico were extremely fresh and seasoned perfectly. We ordered the redfish (OMG.....seasoned well on a bed of potatoes that weren't mushy and perfectly cooked), garlic shrimp & grits (pretty good...grits were a little too soft for my liking), brussel sprouts (were in a strong mustard sauce, but not too over-whelming), and black beans and rice (different but beans were under cooked slightly). Seasoning was perfect. Quality of texture varied per item.I would definitely go again and try different items on the menu. By the way, the bar was PACKED (good sign of good drinks)."], ["Christopher S.", "This is a great tapas place...be warned, the food comes out when its ready, so order up and don't wait for the rest of your party...when the food comes, eat up!The Guac is really good - and big enough for 4 people to share.Lots of folks I know claim this is the best Burger in Jackson, it is great, try it and you can decide (they have two sizes).The BarbaRitas are solid, and there is a nice patio you can sit on during nice days.I regularly eat here, and can say this is a very solid restaurant!"], ["Amy M.", "I was honestly not expecting something like this in Jackson. I'm from Oregon, and therefore have high expectations about knowing where my meat comes from...to find it labeled on the menu is amazing. The guacamole is also wonderful. I had fried red fish tacos, and I was impressed and life was good. The vibe of the restaurant was also nice and reminded me of Portland. Food presentation was gorgeous!"], ["Tiffany Y.", "Well, my experience at Babalu was interesting.  After about a five minute wait on a somewhat busy Friday night, we finally sat down to look over the menu.  Now this is my sister's favorite restaurant, so I couldn't wait to try what they had to offer.  But the more I looked over the menu, the less I saw of what they actually did have to offer vegetarians.  So what first has me leaning toward the meh factor is when I became worried after I asked the server if the black beans were vegetarian...  I asked if they were cooked with meat in them or were they cooked in chicken stock.  So at first she answered they were cooked in stock so I said I didn't want them...  Then she proceeded to say but the kitchen can make them vegetarian...  But I was skeptical, the frown on my face expressed my confusion.  Even when she went to the kitchen to inquire for me... it still didn't set my mind at ease.  So I proceeded to order the Vegetal tacos...(rather be safe and stick with the vegetarian dish) it was 3 small tacos comprised of summer squash, crimini mushroom, radishes, poblano vinaigrette, arugula, and goat cheese crema... So not sure it was an off night, but it was by far the worst taco I'd ever had in a long time.  The house made tortilla just didn't blend with the ingredients and the texture was like biting into the dishtowel the silverware was wrapped in on the table.  The ingredients had no seasoning, no pop, no wow, no zing.  Even when I asked for some salsa/ pico de gallo it couldn't help the taco.  I let my sister try it as well and she didn't like it either.  So after 2 bites, I was done and asked the waitress to take them away.  I didn't ask for it to be taken off my bill, but they did anyway so that was cool.  I can say the fries are tasty, but my love of fries cannot make up for a poorly executed tacos.  So service was fine.  But there was just one more thing the waitress did that pushed me into meh territory... We ordered the dessert sampler.  It was simple with 3 desserts a chocolate truffle, bread pudding, and cheesecake.  So the desserts were okay... the cheesecake wasn't smooth enough for me, the bread pudding needed some more flavor (the texture was good), and the chocolate truffle was rather tasty.  So when the waitress came back to the table I asked her what type of cheesecake was it... and she couldn't pronounce it... so after a few de de de's from her I said dulce de leche and she said yes that's it and asked me to pronounce it again....  Could this have been a little stranger....No it was strange enough for me...  I just didn't find it cute or professional that she couldn't pronounce the name of the item.So overall, interesting experience... Not a complete turn off for me, but close enough.  My sister and friend enjoyed their burger and chicken sandwich, so if that's what you're looking for... seems okay in their book, but this was definitely a meh experience for me..."], ["Annie B.", "This is a review from a vegetarian perspective...Babalu is probably my favorite restaurant in Jackson when I'm craving something fresh and vibrant. I'm a big fan of the vegetal tacos. I saw in a previous review from 2013 that they were poorly executed. I think they must have stepped up their game since then because I've had the vegetal tacos probably five times over the past seven months and have found them delightful each time (the homemade blue corn tortillas are super-tasty). There's also a nice happy hour deal on the tacos on weeknights. I also really like the black bean cake-- it's fried in panko bread crumbs and has a yummy salsa and crema. Like others have mentioned, the guac is really yummy and fresh (although I personally wouldn't pay $7 for it and instead usually snag a little from someone else). The soups change and I really enjoyed a gazpacho I got last fall when it was still tomato season. The vegetable chopped salad is tasty, but the grilled caesar is even better (it might have anchovies in the dressing-- not sure). Something about grilled lettuce is really tasty! All in all, I have always been pretty pleased with what I've gotten at Babalu."], ["s r.", "Great atmosphere, concept and drinks.Have been numerous times and food is always bad. This last visit the tacos were inedible. Cold meat, soggy tortillas. Gross. Service may have been the worst ive experienced. Lazy, ignorant, slow, incompetent.Will do my best to avoid this again."], ["Duy N.", "I really enjoyed Babalu, the food is actually quite good - but I didn't find it spectacular.  The Fondren District is the \"hip\" area of Jackson, MS - and if anything, I found Babalu more trendy than anything.   Overall, I find that when restaurants try to encompass too many things, they start to get confused.  Not quite Mexican, not quite Latin American, definitely not Spanish Tapas.  I have a pet peeve against \"Tapas\" restaurants that aren't Spanish.  What is being served is just smaller plates of food for higher prices.  I did really like the patio seating ... and after a few margaritas, I can understand why it's so popular.  There aren't very many places like it in Jackson, MS ... so good for them."], ["Erick B.", "After all the reviews I decided to try this place and it was the bomb.com. I tried the hummus for the appetizer and 4 tacos fish, oysters, carne asada, and lamb. Tacos were delicious and the food was fresh! I also tried the watermelon margarita and it great!! Definitely going back in two days!! Think I found my spot while I'm working here in Jackson!"], ["bret s.", "Fantastic service - more attentive and gave more explanation than most places, which we appreciated. The salad and tacos were great, too."], ["Mary N.", "Also try their ceviche! It is super delicious and refreshing! The staff are always nice and helpful!"], ["Rebecca M.", "OK so I've been working in Jackson,  Ms for 5 days now and have been there 3 times. Its kind of hard to find good stuff to eat that doesn't necessarily include meat in this city.  Of course it's the south so I'm not complaining much. But I'm  glad my Co worker insisted I tried this place. Their tacos served on a blue corn tortilla are so yummy. I've  had the vegetal, camarones, lamb, fish, atun and carnitas. Loved the vegetal and the camarones. Each taco has it's own combination of ingredients that makes a feast in your mouth.  Their chop salad is fanstastic and the large is big enough for 2. We each had 3 tacos then shared a salad and it was plenty. I also tasted the guacamole and it was also good. Wouldve like ot better with blue corn tortillas but it was still yummy. And they prepare it table side. I wish they open a restaurant by us in florida."], ["Helen L.", "My favorite is the Steak on a Stick and the Baba Burger! Great service and amazing atmosphere!"], ["Tosha K.", "The food is really fresh and they take pride in serving good quality of food. I was really impressed. The service was excellent too...not one request went unheard. The servers check in periodically and do an excellent job of helping you with the menu and suggestions.  Ill be back. Wanted to taste the organic and natural margaritas, but I went for lunch during work week! They make their own sweet and sour mix from scratch, lemons, limes, egg whites, simply syrup.....very impressive!"], ["Carolyn C.", "Loved this place! Our waitress was awesome and so was the food and drinks we ordered. We absolutely loved everything we ordered!"], ["Eric O.", "A delightful Tapas place in Mississippi. I was driving through Mississippi on my way to NOLA and I trusted the Yelpers to find me a nice place to eat. Y'all didn't disappoint. Pulling into the town of Jackson I had no idea what was going to greet me.The friendly hand of Babalu came my way with it a plate of tacos and an absolutely delectable portion of the Chicken Satay. The tacos were alright. I've had better, and if I only had them I wouldn't be rating Babalu as highly. But the right hand man, the Chicken Satay, blew my mind. Flavor is just pouring out of this chicken and onto the rice pilaf underneath. I would eat it a million more times and smile during every single one of them. I hope I make my way back down south because I'd love to stop by Babalu again."], ["Toana S.", "Fantastic meal! I would eat here weekly if I lived in Jackson!  We tried the chopped salad,  short ribs and Scottish salmon- all excellent."], ["Molly G.", "Good, but not great. Babalu has crispy chips and fresh guac. The portion sizes are small. The tortillas are corn tortillas, which adds a festive flare. The atmosphere is all orange and old movies play on the walls. Service is good. Great bar service."], ["Randy O.", "I had dinner here tonight with several friends from work while in Jackson on business. It was enjoyable and the food was very good. A few thoughts on the meal:1) The 'Guacamole Made Tableside' was OK, but I have to say that it probably was not worth the price (almost $10) as an appetizer. Similarly, the Queso Blanco appetizer was OK, but the portion was pretty small.2) Tacos were great! I had the combo taco plate for $9 and I selected 3 different types of taco. All were good, particularly the Ostra which was nicely spicy. 3) For dessert, I selected the truffles. EXCELLENT serving of three nicely dense truffles, dusted with powdered sugar and served on top of a small dollop of whipped cream. It was a great way to finish off the meal.4) Several of my friends ordered the Tamarind Margarita and while it was reportedly tasty, at $10, it was probably not worth the price charged. Overall the service was good and friendly. I would be happy to go back for another visit!"], ["Christine T.", "First time I came here, it was on a first date with a guy and I had never heard of the place. We ended up sitting outside in the booths after choosing our own seats. The waiter was really friendly and helped me pick out what to order. I ended up with shrimp and grits while my date had the black bean patties. For apps we had chips with a freshly hand made table side guacamole dip. My order wasn't nearly as good as my date's but still yummy. We shared an alcoholic beverage which was a pretty standard fruity drink. All in all, it was a great place and the prices were okay... a tad expensive. The next time I came, some friends left hungry as the food portions aren't the biggest."], ["Alainna O.", "Avoid the disappointing tacos and order the fantastic burger or steak on a stick."], ["Gabriela S.", "The atmosphere was fun. A bit hard to hear your neighbor. I think they had good quality but the prices of the food were a little high for the amount you get. That's tapas I guess. I definitely loved the I love Lucy show playing in the background. And our waitress was very nice and accommodating.Also, I ordered the chicken tacos. They tasted fine but I got an upset stomach right after. It must have been just my order because no one else in my party had any complaints. I wanna say this is a decent restaurant but a little rough around the edges. This was my first restaurant to try in Jackson. I would hope it gets a lot better."], ["Joshua C.", "Everything was excellente. The queso, the beer, the tacos, etc. The only complaint is that there were too many good options to choose from, but my bad for coming here on an empty stomach."], ["Kristen G.", "Baba-Rita is a non negotiable. If you're a fan of guacamole, try their guac with bacon and jalapeños!  Patio seating is perfect and service is usually on point.  Great date night or after work drinks."], ["Meg M.", "Definitely come to Bubalu for healthy food with flair and beautiful presentation.  The atmosphere is fun, laid back and great for group gatherings.  Although we had to wait for our table, the bar was bustling and we were able to have a beer while waiting.My favorite part of the whole experience was echoed by many reviews: the table-side guac station!  The fresh ingredients were amazing when accompanied with the freshly made chips.  Can I bring my waiter back to HI with me please?! We also had the organic IPA... awesome craft beer choice and they had a great selection.  It was $5.50 for a pretty large size... perfect for taco accompaniment! I got the Vegetal Tacos... 3 delicious small soft tacos piled with freshly sautéed veggies.  I did think they were a little plain though... luckily, the queso dip was still on the table.  Adding that, some guacamole and someone's salsa side made them perfect! ...Everything is better with queso!The service was quick and the waiter was very responsive even though we were a group of ten raucous teachers talking animatedly about educational equality!This place was well worth the walk from the hotel... we just might go back again tonight!"], ["Nolen G.", "Burger was a good addition to the menu.  It is a very good burger.  It is a bit on the expensive side for the large burger but to be fair, it comes with a side for $12.It has two small thin patties versus one larger one.  I prefer the latter but the meat was good.Same bun as Majestic and Mugshots.  I like that and the burger is proportionate to the bun meaning it is big.I like the avacado and the smoked bacon.It is nice to have something that sticks to your bones good on the menu.  I will be back for another."], ["Michelle C.", "We stopped here on our way back home from vacationing in New Orleans.  Funky little place in a hip area in Jackson not too far off of the interstate.  Of course we ordered the guacamole made table side which was awesome.  The chips were addictive and seemed to be made in-house.  My husband and I both ordered the taco plates.  I think the red fish taco was my favorite.  We also ordered a side of blue cheese grits.  The waitress informed us that this establishment is planning on expanding to possibly 30 more locations.  We are hoping they will make their way up into Kentucky and Indiana!"], ["Kayla R.", "Guacamole is amazing! And the steak on a stick with broccolini is excellent. Keep in mind this is a tapas joint. So it's expected you order a few different options and share. Smaller portions. The mixed drinks are also delicious and fresh. Love the eclectic ambience, as well. Definitely one of my top to go places in Jackson."], ["Richard L.", "This was my first night out here in Jackson, and it was great, all around. The service, food (that guac!), and drinks were all top notch. Having the tab paid for by the chief resident helped with the tasting menu! I had the guac (obvi), tamales (explodingly salty and peppery), babalu burger (sweet bun and juicy patty), and the braised rib (so soft and flavorful). The open arrangement of the restaurant helps create a friendly atmosphere. I'll def be coming back here during my tenure in this great town. I just hope to find more restaurants like this!"], ["Julie S.", "I look forward to my business trips to Jackson because I get the chance to visit this place. I'm pretty sure I dream about their black-eyed pea hummus. Yum! You have to check this place out. The ambience, food, and drinks are just fabulous."], ["Scott B.", "Family Tapas second to no other.  Very tasty fish tacos, steak, burgers, shrimp soup.  Took four people.  All enjoyed and want to return.  Michael was the best waiter I have had in a long time."], ["Augustus A.", "Brought the family to celebrate a new teen. Everyone had great fun with delicious food. Chelsea was friendly and attentive.  My favorite taco was the oyster taco. Birthday girl enjoyed the Scottish Salmon with the grit cake. Festive atmosphere with fun flavorful food."], ["laura c.", "Farm to table Mexican food that is super yummy! They make the guacamole at your table to your specifications. Killer margaritas!"], ["Brandon T.", "The tapas option is the best! Although they are not extremely large, the flavor and presentation is good. They make the guacamole you order table side and drinks are great. The outside patio is very classy for the Jackson area. Must go!"], ["Rachel D.", "Love the I love Lucy theme! They constantly play reruns from a projector on a wall. Their shrimp and grits are awesome!!  We ordered the rock of guac and let me tell you.. Best guacamole ever!!! The chips that were served with it hot and were great with the queso dip that we also ordered. Just know that your food will not all come out at once so be prepared. Great service too! Will definitely come back next time I'm in Jackson!"], ["KimAnh P.", "This place has a very nice variety of gourmet food at super reasonable prices. We loved the tacos, which are made with purple corn tortilla, a light sprinkle of feta cheese, light slaw, and meats/fish cooked to perfection. The bacon and lamb barbacoa tacos were superb. You can get full off of one tri order of tacos. Even though it's tapas the portions are very good sized. Next time you're in Jackson and want good modern food eat here!"], ["Richard D.", "Love this place! Been here a few times before but just recently moved to the area, so now it's a regular place of ours. LOVE the menu!  Perfect for sharing!  The humus is to die for! Wonderful bartenders and wait staff! We make it on there at least once a week!"], ["Mitch A.", "Babalu has quickly become one of my favorite spots in Jackson. To start, the atmosphere is wonderful. They're always playing \"I Love Lucy\" in black and white silently on the wall via a projector which is a really nice touch. Not to mention the patio, which is a fun and lively atmosphere, as long as the Jackson heat has subsided a bit. The food is delicious. My suggestion is the Baba Burger, which is one of my favorite burgers in town. The regular size is enormous, so opting for the smaller one is better. Best enjoyed with an order of sweet potato fries. They also offer daily specials on tacos, enchiladas, and vegetables. Give it a shot! Babalu is a fun and tasty place to have a meal."], ["Bryan L.", "Such a kick ass place!  I hate it when I have to come to Jackson, but I love it when I get to go to Babalu. Why can't I quit you, Babalu?!!!I tend to come on taco night. Last time I was in, I ordered 7 tacos, they were all excellent. Hard to find much wrong with any of the tacos. I didn't eat them all, those of you thinking that I must be a world renowned power eater.  I also tried the Black eyed pea hummus. That was GREAT!!!  Like Tony the Tiger GREEEEAT!!!!I've also worked my way around the cocktail menu. I think i've had about all of thier menu now. And it's all great. The babarita is the start, and the Mojito finishes me off. There were 5-6 other drinks in between, but who's counting?Can't wait to come back to Babalu!"]]}