{"Takara": [["Darius M.", "Fastly becoming one of my favorite places to eat.  Hibachi is pretty good; get a lot for the money!!Just tried my first cooked roll and I think I am hooked... Will have to work up to the raw stuff. :-)"], ["layne l.", "What happened?  A year ago we would get great service and delicious food.  Now the food is still good but the service is always a miss. When getting take out my husband will be ignored for at least five minutes.  When we came in to eat in we stood by the door awkwardly waiting to be seated and being ignored.  I asked for napkins because we were eating with our toddler and he brought us one napkin!  Seriously?!"], ["Katherine T.", "Came here because the roomies and I were craving Asian food. Did this place satisfy our cravings? Yes. First of all, their portions are huge. I only ate half of my chicken katsu dish and was really full. It also came with a delicious miso soup and salad which are two things I enjoy at Japanese restaurants. Although the taste of everything was great, I have to say the chicken was on the dry side. They sliced it thin, so it was mostly panko. I hear their hibachi is pretty good so I'll try to come back for that."], ["Jeana S.", "Awesome sushi and great service!"], ["Miriam A.", "Tried this place for the first time today.  Really was happy with the food and the staff.  Lunch menu for habachi is reasonable and the sushi was very tasty.  Loved the ginger dressing on the salad and am suspicious that it is fresh made.  The steak habachi was tender and portions are nice-take out box was neccessary!  Will definitely return for more yumminess!!"], ["Nicole L.", "I LOVE Japanese food and used to be a regular here before one night.  Went in with a group of 7 and waited more than an hour for the main entrees.  We just paid for the drinks and appetizers and left.  I can understand if this was during a busy night but there were plenty of empty tables.  Also, the server was not very friendly.  If he had just communicated with us about what was going on in the kitchen we would have been more understanding.  Unfortunately, we will not be going back."], ["Ezra S.", "I absolutely love this restaurant. The sushi is fresh and delicious, I love the shrimp tempura. The hibachi grill is good also though I wouldn't recommend it if you are pressed for time because it takes a while to prepare. I eat here every chance I get."]], "Wasabi Bistro": [["Andrew O.", "As many reviews have said, don't be fooled by how dead this place is. Staying just down the street at The Hilton, this place was easy choice for some quick dinner after a long day of traveling. We walked were greeted and seated immediately in the near empty restaurant. The menu was extensive covering a large variety of sops, salads, sushi, maki and noodles. As well as many other hibachi, noodle, and other traditional entries. We each ordered a roll (Fusion Po-Boy, and the Yum-yum Roll) then a side of broccoli, fried Rice with chicken, and a bowl of Tempura Udon soup to share. The Po-Boy roll was good, it is served hot, and it tasted much better later when we finished it later on and it was cold. As the flavors blended a little smoother.  The Yum-yum Roll was exceptional and was the first and only thing we ordered that was finished at the table. The portions of soup and rice where very generous. Everything we ordered came out extremely fresh and prompt. I can not find anything bad to say about this place, the food was good, and the service was friendly, the only thing missing was other customers."], ["Rachel P.", "Located downtown near the King Edward Hotel, this restaurant is in an excellent location. I love Downtown, though the roadwork they've been doing lately makes accessing Wasabi a bit more difficult. As far as the menu, this is your standard sushi restaurant. They've got your basics as well as some specialty rolls. They also offer hibachi and cooked dishes, though I've never given those a shot since I'm pretty much obsessed with sushi. The sushi here is pretty good. It's nothing mind-blowing, but it's definitely good. The drink menu is pretty solid. They've got some great cocktails and a small but decent beer selection. The service is usually pretty slow and the waitstaff always seems a bit understaffed. It's not the most pleasant environment, though it is usually pretty empty and quiet if you're looking for that. The patio is a really nice place to sit on a warm, breezy day so if you want to eat sushi in the shade, I highly suggest Wasabi. Other than that, I usually head elsewhere if I'm craving sushi. Like I said though, I love the location of Wasabi so I'll keep going back occasionally."], ["Cherry D.", "Pretty good, solid place. The shrimp siomai was my favorite. Also ordered the downtown roll, seaweed salad, their version of honey walnut shrimp. The shrimp had too much batter for me and it could have used more sauce. It was also a little over cooked and too mushy. Total was about $42.They only had one server that night, and one sushi chef at the bar. They have a hibachi grill seating area but only open for reservations. This place has a lot of potential."], ["Lojo R.", "This place is so bomb!! I was worried when I saw how dead it was. We walked in at 730 on a Sunday and we were the only ones!! So I was hesitant to get any sashimi etc. But so glad I did. It was PERFECT. Excellent service. Mississippi roll and Cajun roll and esp filet mignon roll were amazing. Sooo good. Kids loved gyoza and tekki maki rolls. Dessert was great too. I highly recommend. Best fresh fish ever...and generous with the sashimi."], ["Ramona B.", "I haven't been here in about a year, but I have been craving this place lately.  This review is really for Chef Andrew.  I have been a fan of his since he worked at Little Tokyo in Ridgeland.  He's really good!  I will say that the wait staff wasn't particularly great when we were there.  My friend and I  went at lunch and were seated at a grill with some other professionals.  They were on the clock and it was taking them forever to get drinks/food and Chef Andrew was no where close to getting to us.  It seems to be common that Andrew is the only chef working most of the time.  Anyway, a waitress caught an attitude with the other group when they were inquiring about the wait because their lunch time was almost up.  They ended up just leaving.The food is great.  The use a sweet brown sauce on the meat that tastes different from the usual in this area.  Also, I don't like pink sauce but I will eat theirs because it has a sweet pineapple note.  Nice! I didn't think it was terribly expensive at lunch, but again I haven't been in a while.  I hope they keep the quality up."], ["Rachel S.", "Rarely do I add Yelp reviews in a negative light, so trust me, I'm not a chronic critic curmudgeon, but my recent experience at Wasabi left me, well...pissed enough to take to The Yelp masses. I just walked in and placed a take-out order hoping to be in and out in a few minutes. The staff wasn't very receptive off the bat, but it wasn't until I got all the way back to my hotel room to see that half my order was missing, that we had an issue. I immediately called back asking about my order and was told it was sitting on the counter (no apology issued). I asked if they could deliver me the forgotten items and was met with a rude lecture about how they are understaffed and take-out means coming to pick it up. Leaving my meal to get cold at the hotel, I begrudgingly walked back and again, was met with no real apology or offering for a partial refund. All I'm saying is, if you mess up and are met with an understanding customer who will walk all the way back to right your mistake, at least say sorry like you mean it. #rude"], ["Greg M.", "Decent option for sushi and rolls in downtown Jackson.  They've got the typical offerings, in addition to hibachi, etc.  I opted to sit at the sushi bar on a nearly empty Wednesday night.  Started with the seaweed salad, which was pretty good, but not sure why the put it on a bed of greens.  The rolls I selected weren't the best I've ever eaten (not even close), but not bad.  I'll give them a bonus point for having Sapporo on tap."], ["Joey P.", "Awesome sushi place downtown. Filet Mignon Roll was incredible and very filling. The Rice Paper roll was also really good... light and not too heavy (no rice).Very close to the Jackson Marriott, walking distance in fact. Thanks for the tip on Yelp, sit at the Sushi bar if you want the recommendation of what's freshest for the day/week. Ethan was very helpful."], ["Aisha S.", "This restaurant has the worst service of all man kind. The food is so good it's sad but the food is the best I wouldn't recommend anyone to attend"], ["Duan C.", "Service has improved since opening - new staff is nice and friendly! Tried the filet mignon roll! Dear lord is that thing good - it's $14 and some change, but damn is it so good! Still love the california roll and the spicy crawfish roll! Yes indeed!"], ["David P.", "I travel for a living and have been in every state in the country and many other countries but... I have never been more pleased and surprised by the service and absolutely over the top sushi as I was just served. I had a chirashi Martini and a little mermaid roll and cannot rave enough about this place. empty and quiet and astounding. I will be back every time I am in Jackson Mississippi."], ["Gerrod S.", "Went for lunch on a Friday afternoon. Not many people were in the restaurant. The sushi was GREAT, especially the Cajun Roll. However the service was subpar to say the least. One waitress had an attitude the couple times she came to our table and another was so inattentive to where I had to get up to get my own silverware at the beginning of the meal and get up again to get a take-out box after my meal. In all, the food is great, but the service is not."], ["Molly G.", "Hibachi is very fun and entertaining. The chef throws food and you try to catch it in your mouth. Great for a date! This place is kind of dead at night and on the weekend."], ["Ashley C.", "Many times I've eaten here and each experience has been worth my money. Today, topped them all. Ethan, on the management team, swept me off my feet with his kind service and over the top accommodation! I'm a regular her but I never noticed the hours. From 3-5p they are closed to restock and prepare for the evening crowd! I walked in after 3, mouth watering and in high anticipation of my favorite roll and app! Ethan greeted me at the door and advised me that they were closed. Disappointed but still craving Wasabi, I asked if I could at least place a to-go order. He proceeded to take my order and then, after I acknowledged his kindness and thanked him sincerely, he said, \"Would you like to eat at the bar? Enjoy it fresh!\" I screamed with happiness and proceeded to the bar. He turned the tv on and took my drink order.! *HEAVEN* I'm, at this very moment, receiving intimate, exclusive attention and I LOVE IT!! Eat here!! My food is piping hot and delicious as usual.!! I'm overflowing with joy and my tummy will be satisfied in 20 min. I promise you! I've tried many things on the menu, some awesome, some not but the ambiance and service is worth my money and time any day of the year!"], ["Maria W.", "Came here last night for my brother's early birthday dinner. The Hibachi menu was very expensive than the rest I guess because the chef is putting on a show. Our waitress was this ok blond haired girl who seemed polite and throwing huge flirtation to my brother. This other family of a mum and 10 year old girl came in to sit at our booth with us. Everybody ordered meat except for me. I ordered the Vegetarian plate (and I'm not even Vegan or Vegetarian, I was just craving steamed zucchini). It took about 29 mins before our chef came out. The salad was good, but it giggles me that they add the dressing without asking. The miso soup was unpleasant to my taste; the fish broth was too salty. Our chef wasn't Asian nor Japanese, he was Black and that's not a big deal at all. When he came to our table he only acknowledged the 10 yr old girl first and not even my brother even though he was turning 22 he should've been greeted. He got started making all kinds of noises and flipping the fried rice. Burned the eggs a couple of times. When he was done the fried rice was too salty for my taste. Soy sauce and salt/pepper don't mix too well. Next, he started on the meat after he got done flipping and cooking the meat he handed it out to everyone by first to last. But when it came to my vegetables he didn't place them on my plate first before giving it out to everyone else he skipped me. That was so unprofessional! That made me so angry! The waitress handed out warm towels, so we could wipe our hands. When I got done the towel, it was sitting under my arm next to my plate. When she came to get my towel, I was eating. While I was eating she reached over my plate without saying excuse me and took the towel. That was so so very rude!!! No manners whatsoever! When everyone got done eating their meals, the waitress brought the little girl a cake THEN asked my brother did he want one. Of course, he does! It is his birthday too!!! She said she was going to bring him a cake she left and didn't came back. It was 20 mins before she came back with his cake even though we were the first ones there! Overall terrible service, ok food because of the veggies, but too pricey! I will not be back! Should've just went to the Cock on the Walk! I give three stars because it was my brother's moment not mines. I was just observant the moment."], ["LaBrisha W.", "Do not be fooled by how empty this restaurant may be when you walk in. The best sushi I've ever had, no exaggeration! Everything I have tried so far has been excellent, from the looks to the taste. The service is also great, which makes the meal much more enjoyable. Take-out has also been just as great."], ["Chaitanya K.", "Went here for lunch on a Saturday afternoon with a few colleagues and wasn't overly impressed. Took around 5 mins for us to get seated and had to hunt down someone to get our orders. Asked for the chicken fried rice which felt like having steamed rice and steamed chicken."], ["Shelby M.", "Food was really good and the service was great! Very cool place but a little difficult to get to due to construction."], ["Trista D.", "*sigh*I hate to do this but...I have no plans on returning to Wasabi. This was my second time and it totally demolished the 4-5 star rating it would have gotten from the first time. The only real reason why I gave it 2 stars is because it was Valentine's Day, Chef Drew was the ONLY one working hibachi (what?!?!?! Poor guy), and although it wasn't as great as it was the first time, I know he was tired and it was still good.We had a reservation at 9pm and although construction is crazy downtown, we made it there at 8:55pm. We were told there would be about a 20 minute wait because although the previous party had finished, they were still holding up the tables. No problem....we waited. At about 9:30pm, the hostess comes back and tells us that they have yet to leave. Now, I had just gotten in town off of a 6 hour drive and was STARVING. I asked how much longer it would be and if I could have a glass of water. She brought the water back and said she would go check on the table. She returned close to 10pm!When she came back, she told us that they were leaving shortly but if we wanted to sit on the end of their table we could and they'd clear us off two spots. Before we could answer (we'd resolved to skip hibachi and order from the menu) she was gone! She returned to seat us at 10:30pm. Now, I'm skipping a lot but the waitstaff was awful this entire time. I heard a lot of complaining, cursing, etc. but we won't get into all of that.We were seated and we still waited for quite a while as Chef Drew was starting another table!! I wanted to leave and would have been fine with Taco Bell at this point, but my boyfriend already felt bad enough. The other people at our table told us that they had been waiting 20-30 minutes for sushi and one of the gentlemen reordered it....it came right out meaning it had been sitting somewhere that entire time. Well, at least I'd get soup and sald to appease my stomach......NO! We didnt get that. Instead we got a story about how our waiter needed his smoke break before he went crazy.At 11pm or so, Chef Drew came over to find that no one turned the table on so we waited while it heated up. To wrap this up, he gave a great show and the food was good but not great. All in all, we STILL were given an $85 ticket with nothing taken off for the wait, lack of appetizers, or sketchy service.....and my sweet bf paid it without hesitation. Better him than me but we won't return.Move to Tennessee Chef Drew!"], ["Shanna K.", "When staying down the street at the Hilton Garden Inn, a group of us headed over hear to grab a vegetarian friendly dinner. While they didn't have a ton of vegetarian rolls (actually, they just had one -- a vegetable roll, although they probably could have made cucumber and/or avocado rolls), they did have some entrees that were vegetarian. They all were listed as with vegetables on the menu, but if you asked for tofu (which I did), they'll through in veggies AND tofu. The udon was huge and yummy.Although the service was a little odd at times (they couldn't serve both hot water AND hot tea, so our table had to decide on just one), overall, they were friendly, and the orders came out correctly. Many of us had glasses of Moscato, which was tasty, if a bit over priced. Plus, all of us got salad and soup with out meals - what a deal."], ["Brett H.", "Good sushi - awful service - I travel 40 wks a year and this was worst experience I have had in 13 yrs of traveling. Found hair in hibachi on my mine and dinner guest plates."], ["Adam M.", "Good sushi and cocktails, GREAT staff.  Bartender Jason entertains and serves with exuberance... Hand delivers a nice dirty martini to the table.  Server Noel knew the menu well and suggested the most unique \"filet mignon roll\". Amazing!  Salmon wasn't the best... But other food made up for it"], ["Rose K.", "The sushi was delicious, but the real reason to come is for the Crème Brulee. It was fantastic. The custard was melt in your mouth with a crispy sugary crunchy top. Back to the sushi, our favorite roll was the Farish Street roll. The filet mignon roll had a smoky, fired grilled taste to it. The service was excellent and we were offered a soup or salad complimentary while we waited for sushi. I would definitely recommend this place. One more thing, the restaurant was next to a lovely patch of grass and next time, we will definitely sit outside."], ["Melvin P.", "This place is a godsend. Except to my wallet. No, I take that back, my wallet is fine given how FRESH AND TASTY this fish is.The servers are great too, the perfect balance between attentive and indifferent.  I am a big Nagoya fan, but I think this little gem is my new raw fish spot.  Pro-tip: Sit at the sushi bar, the chefs are hilarious and really honest about which fish is the best at the moment. Also, they may slip you a bite of something experimental."], ["Louis P.", "As I sit at the sushi bar enjoying the swimming fishes, I realize that for a couple traveling to Memphis & decided to stop for some sushi,we made the best decision possible!!!!!!!"], ["BroSauce J.", "ahem. Now for the first *real* review of Wasabi. It's good. I mean, the rolls are creative (hello crawfish!), the atmosphere is a bit insane (hello fish tanks!) but the service can be a bit absent-minded (hello?)  although very friendly.Everyone's food was really good. My plate of sushi came with a glowing Christmas light hidden underneath some kind of translucent daikon root. Yeah, weird. But rolls were delish, especially the crawfish roll, HUGE, and the prices were not out of line, even for sushi. The place is a little hard to find underneath a parking garage exit ramp but it's worth the find. More places like this should continue the revitalization of downtown Jackson. Awwww yeah."], ["Pamela G.", "Restaurant a little difficult to find as the entrance is directly under an off ramp for a parking garage, but so worth it when you do.The decor is elegant, with lovely place settings and Himalayan salt candle holders on the table.  Hot, gently scented hand towels offered after you are seated.The menu descriptions are a little difficult to read in the muted lighting.  Only less than glowing thing I have to say about Wasabi, but I would rather bring a flashlight or a sharp eyed 20 year old to read the descriptions to me than change the ambiance.There were 4 people in our group: 2 raw fish fans, 2 cooked only fans.  I ordered an appetizer of octopus, which was delicious and served with paper thin slices of lemon between each slice of octopus.  Takki Maki roll made with yellow tail next and then entree of the \"Pink Hawaiian\" - spicy tuna stuffed inside of Ahi tuna and topped with Escolar.  All of it beautiful and delicious.The 2 non raw fans ordered hibachi dinners.  One filet mignon and the other NY Strip.  Both said the fried rice was the best they have ever had in Jackson, with the steak cooked perfectly.  They said next time, they will order double fried rice - the size that came with their order was perfect for a meal but was so good they wanted to have some left over to enjoy the next day for lunch.Excellent menu with many choices.  I can't wait to go back and try more of their offerings."], ["Krysia S.", "The restaurant itself is spacious and open; when I came for dinner it wasn't very crowded. I can imagine it being a noisy when they're busy, but in Jackson that's usually not a question at all. The service was attentive and very helpful. We ate light and had two rolls, which were both delicious - the ingredients were definitely all fresh. The rolls we had weren't too expensive, but there are some more luxurious options if you're in the mood (the Filet Mignon roll comes to mind). We had the Bananas Foster spring roll for dessert and it was to die for! Overall, a great experience. I highly recommend it if you're in Jackson and want to get your sushi fix."]], "Ichiban Buffet": [["Carrie R.", "Ichiban is by FAR the BEST OF the BEST! From the moment you walk in the door the service is excellent! Smiles greet you everywhere you turn. The sushi offerings here are amazing and sure to please any palate. They use Fresh ingredients in all dishes and the buffet is Pristine. Never a mess. Our server was amazing as usual and here you can never expect a \"cup to be half full\" If you want an amazing experience at the best Sushi Buffet in town make sure you stop in here and PS the bread budding is delish!"], ["Stephen F.", "The word on the street in Jackson is that this is the best Asian buffet in the state. It might be, it might not be, but I can tell you I left there with my stomach feeling very artsy.An very modern restaurant, great lighting, lots of bright colors and plenty serving displays. If you're a sushi fan you might possibly make out like a bandit as you make your third trip down the line. If you're a traditionalist then you won't be disappointed. Each dish offers their own taste, the coconut shrimp is filled with the distinctive taste of coconut. The chicken skewers have this juicy taste of seasoned chicken.Do yourself a favor and arrive by 11:30 AM, because come noontime, this place will be packed."], ["Jessica L.", "The ambience is great!  The restaurant is clean and the decor is right on track.   Let me start with it's a great variety of food.   Being it was a weekend they had many seafood offerings fried & stuffed shrimp, oysters, and of course crab legs along with the other Chinese buffet options.   The food was well prepared and fresh.  The real shining star for me was the sushi.   I generally don't eat the sushi off the buffet but it was so beautiful I had to try it!  It was simply awesome!  The service left a little to be desired keeping this review from 5 stars."], ["Craig B.", "Always a good choice for lunch or dinner. Plenty of sushi choices and lots of American style Chinese food."], ["Jonna B.", "The first time I went, there was a two hour wait. Ridiculous, huh? There is always a line down the side of the restaurant, no matter what time of day it is. If they're open, there's a line. So I didn't stay the first time I went. I went back a few weeks later, and this time there was no wait. The selection of sushi is great, and they have everything ranging from simple philly rolls to dynamite and crunchy rolls. If you like sushi, you'll like their selection. As far as food goes, there is variety of both Chinese and American food, so it is kid friendly. I know I didn't like Chinese when I was little, so it's a major benefit for the little ones. As far as quality of the food, I would say it's on par with most Chinese buffets. It is the closest buffet to my home, and the only one that I know of that is reasonably priced for the amount of food they have."], ["Bill M.", "Lunch there was a real treat beginning with the first steps through the front doors. Everything was shiny clean and the buffet was obviously well kept. Items were steamy hot and very tasty. Sushi bar was excellent. The staff was friendly and very attentive.   I can't wait to go back. Not your typical Chinese buffet."], ["Bryan V.", "By far the best Asian buffet in Mississippi hands down. You can't compare it to any other buffet. Everything they serve is fresh and so many varieties of sushi to choose from. It's a bit pricey but well worth it."], ["Farokh N.", "One best Chinese restaurants in MS. Consistently good food. Best value for your money."], ["Popa D.", "This is hands down the best Chinese buffet around. I always bring out-of-town guests to this place and they are always impressed. The sushi is great, and all of the buffet items are fresh and hot and super tasty."], ["Kerry D.", "It is never disappointing and the flavors are consistent.  The servers are not always the most attentive."], ["Gerald L.", "Great service and food. The best Chinese around. I would have no problem recommending it to anyone that likes Chinese and a good buffet. I have eaten here several times and the food is always great."], ["Noi G.", "This is by far the best Asian buffet I've gone to. Food tastes great and fresh, there was also a sushi bar which I liked a lot. My favorite was the coconut shrimp, from what I got. There's a lot more but I can't try everything, although I would love to! Sadly, my husband and I are just passing through and visiting family... I would go again if I wasn't"], ["Doug B.", "The important attributes of a buffet - is the food fresh (check), is it the right temperature (so-so), is it clean (check), does the staff clear dirty dishes and refill drinks quickly (check).  Good start.I arrived shortly after they opened for dinner at 5.  Everything was fully stocked.The sushi is very american style, I wouldn't take one of my Japanese colleagues there.  Still, it sets this place above the typical Chinese buffet.  Plenty of variety, but most items are very common.I tried many items and was happy with most.  I enjoyed finishing it off with an almond cookie (with a real almond) and some Blue Bell ice cream."], ["Anthony R.", "Food and service were wonderful. A great variety of food to make everyone happy. A great place to eat I will definitely be back. I recommend Ichiban to anyone looking for a great meal."], ["Mary M.", "My husband and I eat here nearly weekly.  It is a great place to get sushi for cheap.  It's a good quality and the staff is friendly.  I also enjoy the coconut shrimp which really don't taste like coconut but they're amazing!  Go here!"], ["Richard L.", "I've been to Jackson twice, and both times I've eaten here. It's hard to beat the price and the variety. I've eaten at a lot of buffets and this place goes a bit extra with the savory, maybe it's regional thing but it really takes away from the food. Overall it's a relaxing place to eat, pretty much whatever you want."], ["Lee P.", "Best Chinese buffet in Jackson.  Great selection of sushi and crab legs are good at night."], ["Jerica D.", "There are quite a few Chinese buffets in Jackson area, but this one is the best! There is a lot to offer at this location. I am always seated quickly and as soon as you place your drink order you are free to get up and make your plate! For those who have kids that may not want to eat Chinese, they also provide American food---pizza, wings, fries, etc. There is a sushi bar----for those that don't mind cold sushi and there is also an ice cream bar. The buffet is never low on any items, as they make sure to keep the food stocked and fresh, and it is always very clean. At night time its a little pricey for the south, but that is because you can eat unlimited crab legs. I always go by here when I visit home, and I would recommend this to any stopping in through!"], ["Jonathan T.", "This place is deceptively good.Don't get me wrong--there are more than enough mediocre, greasy, unhealthy pan-Asian buffet \"classics\" to make a new-comer hesitate.BUT, the other 30-40% of their selection is actually reasonably healthy AND pretty tasty, as I've come to realize the last few visits.Their sautéed shrimp, pan-seared chicken, stir-fry green beans, and brown rice were all good. I also went for the miso soup and California roll, and I finished my meal quite satisfied. It was all served at good temperatures, and everything (that I ate anyway) tasted pretty fresh, honestly.$13 for a lunch buffet and drink might be a bit more than I'd hoped for, but this is Mississippi after all, so I'm not surprised they need to hike the price to make up their costs.I won't be back right away, but I will drop by again from time to time."], ["Sarah A.", "My friends and I recently ate here and it was really good! There were many options and the price was nice."], ["John K.", "If u can find a better buffet lmk. This place is amazing and very cheap for the price. I went here for lunch and dinner. Very good and love the staff very nice and welcome. Sushi is fresh and soup is awesome. Never a empty spot. Great great food and will come back soon!! Hope this helps!"], ["Nikki H.", "I thought it was really shady how Ichiban charged $18 for the entire day of Father's Day. The restaurant was already crowded so they would have made money without jacking the price up. I, for one, will never eat here again. There are too many places to choose to eat in this area for me to spend my money at an establishment that believes that this is ok."], ["Bob M.", "The food was good. Very crowded, which was a good sign. The problem I had was with the obvious lack of parenting skills from some customers. There were two families that would have their kids camp out around the crab legs, and when a new batch was brought out, these kids (adults remained at their table), would take nearly all of them. This went on the entire time I was there."], ["Angela P.", "My favorite buffet in Jackson. We go at least once a month, and every time my mom comes into town. It is her favorite. The variety of Chinese food, sushi, & American extras is awesome.  There is definitely something for everyone.  My favorite is the coconut shrimp, but their hot and sour soup and black pepper chicken is also really good.  My only criticism is that nothing in their buffet is truly spicy -- it is most definitely an Americanized Chinese restuarant.  Even the General Tso's chicken is more sweet than spicy -- that being said, it isn't bad it just isn't my favorite.    My husband goes straight to the sushi bar.  My nephew loves that they have blue bell scoop ice cream for dessert along with the fruit and dessert bar.  The atmosphere is pleasant.  I love the big umbrella above the buffet bars and the lighting."], ["Chye M.", "Wide variety of fresh sushi on the buffet, they make it infront of you. Good food and a variety of foods for kids that don't like Asian food. A large selection of deserts, my kids loved it! My husband likes sushi, I like sesame chicken, general tso's chicken and won ton soup. All of this was great! They also have a variety of blue bell ice cream. If you're looking for a place where everyone can find something they like when you have kids.. This is the place for you!"], ["Shadoe F.", "Best buffet I've had in a very long time! So many great dishes to even try to describe!Sushi area was clean and freshly prepared. Buffet bars were being constantly worked and cleaned. Waiter was fast and courteous. I ordered the sweet tea and it tasted fresh unlike most places that use old tea. The inside is really pretty they have a huge umbrella that is over the main area. Bathrooms were clean!!!!!!!!! Will be coming back :)"], ["Mike J.", "Great food, awesome service. This is probably the nicest Chinese buffet i have ever been too. Everything is clean, the service is expedited so your water is always filled and your table is emptied of dirty plates. Additional information, come eat on sunday, there will be hot ladies just got off of church in hot dresses ( a beneficial addition  )."], ["Rose K.", "Honest to goodness. Best Chinese buffet I have ever been to so far in my life. And I have been to many buffets throughout the US. I took my dad here a few months ago (and he is critical of almost everything) and he loved it. He especially loved the crab legs which are sliced in half. Check it out."], ["Kim M.", "This place is great. They have a huge selection of good, fresh sushi.  The sushi chefs are right there making more all the time. It's not like some buffets where it can be sitting for a while and get a bit iffy. The rest of the buffet is good too. They have a decent selection of Chinese (Americanized) and some more American dishes. The deserts selection is standard Chinese buffet. It's a little pricey for a buffet, but when you think about the usual price of sushi it's a bargain."], ["Sandy S.", "Was visiting family (we are from Los Angeles), and they took us for their favorite restaurant. Not bad at all. Reasonably priced and the kids were very happy. Some people were just pigs about certain items (crab legs), so we had to wait a bit. Sushi tasted fresh and was made constantly. Great place to go if you like serving yourself."], ["karen p.", "I come from  California where we have a wide variety of food especially sushi/sashimi so when I heard about MS having an all you can eat sushi/sashimi buffet you can't help but think its going to suck. I came here with a couple of friends to check this place out. This place was in a nicer area in Flowood with blocks and blocks of shops. Basically, if you wanted to get shopping done, this is the place to be. So the location was convenient.. although it was a ways from school. The place i remember was cheap (compared to prices in CA) i think for dinner it was only $18.. of course for MS prices this is pretty steep (OMG their $5 KFC buffet, but i digress). They had a variety of chinese and japanese food.. along with the MS staple; crawfish and catfish and oysters fried battered or raw. But I didn't come here for all that, i came here for the sashimi and sushi and I was amazed. The salmon was extra fatty and delicious. Although you have to kind of pester the sushi chefs into cutting up pieces for you. I had to let the chef know 3 times that I was waiting on salmon and he must've cut up maybe 4 slices. I had to keep going back and asking for more which was a big ass pain but other than that, the quality of the fish was superb. There was great marbling in the fish with lots of fish oil drizzling down the sushi. They also had raw oysters which I absolutely love. But yeah yadda yadda the food is good... but The best part of this buffet hands down is the ice cream. BLUE BELL BIRTHDAY CAKE ICE CREAM!!!!!!!! OMG where the hell have you been all my life?! Ever since I ate that I been searching far and wide at every Krogers I could to find it but I was never able to see it again... now that im back in CA, i'll never be able to eat you again.. how i long for you... *sniff sniff*I've been here quite a few times and i absolutely love it. It's a little part of CA that I'm able to experience.. and the ice cream! holy bananas on a stick that is ah-may-jing! Definitely a good place to eat, but even more worth it for the ice cream. i miss you my blue bell birthday cake. sniff snifffff**"], ["Psonya H.", "For the first couple times, it's impressive.  After that, it's kinda just the place you go for variety.  This is really a mixture of Chinese and American food, but on a \"super\" buffet.  I don't care for sushi, and they no longer have crab legs on the buffet on weekdays, only Friday - Sunday at dinner.  If you don't do crab legs or sushi, it's a little pricey.  However, on week days you can order a \"side\" of crab legs for an additional price. Some dishes are fried chicken wings, fried catfish, mushrooms, beef & broccoli, fried rice, lo mein, General tsaos chicken, wontons, egg drop soup, hot and sour soup, dim sum, dumplings, pizza, barbeque ribs, french fries, bacon wrapped shrimp, mac & cheese, loaded potatoes, shrimp.  That list isn't exhaustive, though, at all.The service is always good and friendly, and the servers are very attentive.  An okay selection of desserts, but no pies or cakes in the traditional sense -- although you can dip blue bell ice cream.  And they have some pretty good, bubbly, fountain drinks.All in all, you probably won't be disappointed.  You're bound to find at least one thing to get excited about."], ["Billy D.", "The food was good. It's the best buffet I've had. I took our whole family. My wife and I loved it. Our 2, 6 and 8 year old boys loved it as well. And there are lots of choices for desert. Just the 8 flavors of Blue Bell ice cream makes it worth the money."], ["Jason B.", "Great place for a lunch buffet everything i enjoyed except the hot and sour the day i went.  liked the miso though.  overall great."], ["Rachel F.", "Okay, so first off, sushi is expensive. In pretty much any city, 5-15 bucks PER ROLL is normal. Say you want 2 rolls and some sashimi and miso soup. Easily a 30 dollar meal. Easily. So, when I hear sushi on a buffet, I'm tempted against my better judgment. It is often okay, sometimes bad, and occasionally, I mean occasionally, really good. This is one of those places. I have been here a good 20-30 times. I LOVE it. Every time I visit Jackson, my friends know that we are going here for lunch one day. $11 for all the fresh sushi, sashimi, seaweed salad, miso soup you could possibly eat. There is one roll that has peanut butter that I don't like. But hey, it's a buffet, so I can try them all and see what is my fave and then eat until full without adding the bill in my head, justifying an expensive lunch by taking away drinks at the bar that weekend. Oh yeah, they have good Chinese too, but what can I say I rarely touch it - there is sushi on the other end! Their salmon sashimi is probably my fave, and it has been fresh every time I've gone. They even have an ice cream station. And ice cream happens to be one of my favorite desserts. But I hardly ever get it here. Yup, I am that typical gluttonous buffet goer at this place. I stuff myself to an inch of combustion and then smile the rest of the day. I miss you Ichiban.This place is going to be part of my heaven. I might miss it more than anything else in Jackson. Just kidding, it is 2nd after my friends. Aww."], ["Matthew L.", "What?  A sushi buffet in Flowood, MS?  Perhaps these restaurateurs have overestimated our dear small town Mississippians.  Or they've merely figured out how to charge slightly more for Chinese food by putting sushi on the buffet knowing well that most of the locals will predictably load up on fried rice and yeast rolls!Let the diabetics crowd around the pizza and chicken fingers and head for the sushi buffet--nicely set up off to the side where you'll avoid the stampedes.  The selection is modest but good with lots of rolls to choose from, a few nigiri selections, and a tasty seaweed and crab salad.  Quality is good--especially for the price.  You can get your money's worth at lunch ($11, includes tax) with just one trip to the sushi buffet.  The hot buffet has pretty standard fare--sweet and sour chicken, lo mein, dumplings, egg rolls, chicken-on-a-stick.  Good selection of fruits and salads.  Staff is typically efficient and hard working.  Pleasant surprise on my visit to Jackson!"], ["Rob B.", "It's a good Asian buffet, with a good variety.  I have to chuckle, though, when I think about the wait staff.  Each one I spoke with had very thick Asian accents, but verrrry American names on their name tags--like Judy, Luke, and Fred.Drink service was a little slow, but, they were busy.  Also, if you order anything but water you get to keep the big Ichiban plastic cup your drink comes in.  :-)"], ["Traci H.", "It's an average buffet. Not too pricey. Good for kids. Will probably visit again."], ["R P.", "The food is good, but it is a buffet, therefore it attracts a lot of riff-raff. They have increased prices to the point where they are about to price themselves right out of business. I would suggest eating at Mr. Chen's instead. There is no buffet, the food and service are great, and the prices are very reasonable there."], ["Casey S.", "Mediocre and overpriced."], ["Kevin B.", "Sushi was great as well as the buffet."], ["PNotHere E.", "I came here for dinner 1 evening.  I was driving on Lakeland and spotted the \"all you can eat\" sushi bar sit down.  I decided to stop.  The place is a combination sushi boat bar (there is a conveyor belt that circles around 2-3 sushi chef with plates of Sushi) and a Teppanyaki seated area where the chef comes out to you and cooks your meal in front of you.  Different sushi, sashimi and salads were there for the choosing.  If you did not see something you liked you could request from the sushi chefs a specific roll.  As I have eaten sushi at several places previously I could tell you that these were great and above par.  I've eaten some dumpy sushi before but this place made it right then in front of you -- fresh and good.  I'm not sure about the Teppanyaki area however there were plenty of people seated.  This place was busy no matter what you chose.  I'd come back.  Not sure if they will have the same special when you go however I did survey their normal Sushi Menu and the price is about right for what you would pay for good sushi.  Enjoy."], ["Christopher P.", "I can eat my weight in sushi. No, really. I can and I have. Give me a soft drink or cold Sapporo, and I'm just one burp away from making room for another twelve pieces. That being said, Ichiban Buffet has outstanding sushi that always leaves me with that \"I'm so stuffed...why do I do this to myself?\" feeling. At around $20 per person for the dinner price, Ichiban is also an incredible value. My wife is NOT a raw fish kind of gal, however. The reason for the lack of four or five stars is that $20 per person for basic Chinese-American fare is a little steep (especially for those people who don't actually crave wasabi. Which I do.) The other-than-sushi buffet is incredibly extensive, though, and you're bound to find something you like. The atmosphere is a bit hipster, which is a nice change from other Asian restaurants playing loud Asian music that , surprisingly, nobody knows the words to. The price is somewhat cheaper for lunch, and the buffet options are the same, as far as I can tell. Did I mention the great sushi?"], ["Lisa P.", "Good food, esp the bento box at lunch. Pretty standard prices for sushi in my opinion."], ["Kristin B.", "This is a great Chinese super buffet located in Dogwood Festival on Lakeland Drive.They are pretty pricey, but you can easily get what you paid for due to the large selection available. They have a large sushi selection where the chefs put out fresh sushi of various types all day long.  The bar across from the sushi has dim sum and dumplings, as well as six types of soup. There's a salad/desert bar, as well as two or three bars that contain your typical Chinese buffet foods. Finally, there is always a section of seafood available on the buffet. I try to go during weekday lunch to get the cheapest price. ;)"], ["B P.", "We enjoy eating here, although some foods are \"Americanized\". For those who venture eating the real Asian foods, their sushi, dim sum, and hot and sour soup may fulfill that desire.You are not going to find real dim sum (that's frozen vs hand made) anywhere in this state. Anyway, they offer a good variety of foods from Asian to macaroni and pizza. Fish can be tasty too. Also Ichiban is good for families with little ones. Prices run from around $11 for lunch to $24 for dinner. We think the best times to go are for lunch weekdays and either time on weekends.  Busiest times, but that's when the food is the freshest!  Gave 3 stars for 2 reasons: pricey, if you don't eat up crab legs and sushi for dinner.  Also because we went once at 2:00 (one hour before closing for end of lunch) and they had put up half the sushi!"], ["The Yelp-inator W.", "The Best I know of in MS!  No one comes close...cost a little more...but well worth it IMHO."], ["Brooke P.", "Best china buffet ever!!"], ["Herman S.", "There are two Ichiban's (within 2 blocks of each other). One is the Sushi Bar & Teppanyaki Grill where they cook at your table. The other is the Ichiban Super Buffet. It's by far the largest Chinese Buffet in the area, and a huge selection of Sushi rolls & crab legs for folks that eat buffet sushi & crab legs. But other than that, they have a huge selection of mediocre American and typical chinese food..Sweet & Sour Chicken, Pizza, roast, donuts, chicken on a stick, fried rice, crab legs, etc.. I've been many times hoping to find enough small bites of soup and ice cream to warrant the $18 price. It's just not worth it. It is a whole lot of sub-standard mediocre/filler unless you like to really load up on buffet sushi & crab legs."], ["Richard C.", "Ichiban's sushi is among the best I've had-- even compared to normal sit-down restaurants.  You will not find a better sushi buffet in a large metropolitan area.  I make it a habit of going there once a week and get withdrawal symptoms when I don't go for a while."]], "Surin of Thailand": [["Kayla C.", "There's not many things I love more than Thai food. I was THRILLED to come here on my lunch break earlier this month. The lunch menu had many options. I can't remember exactly what I got but it was a big portion with noodles and chicken it also came with a coconut soup that was to die for. I would come to Surin of Thailand from lunch or dinner. The dinner menu has the lunch menu options available just larger portions and for a little extra $. The bar looked very nicely stocked up. I didn't have a chance to get a drink but they have a lot to choose from. They also have a lot of parking which is always a plus. The wait staff was super friendly although they were a little slow.  Overall I had a great experience at Surin of Thailand and can wait to return"], ["Picha M.", "IF you have never been to Thailand, and no idea what Thai food tastes like....Come here! I loved everything I ordered! Tasted very authentic! They took some time to cook though...If you are in a hurry or very hungry, please don't come. lol They let me wait pretty long to get my Pad Thai and Massaman Chicken when they had only few tables that day ;however, their food tasted super good then they are forgiven! ^_^ (but not forgotten lol) Besides, I experienced something not really lovely in their restroom, it was clean though but the previous customer, or whoever used it before me, did not flush the toilet. This is unforgivable. T_T As a result, long waiting time and unflushed @#$&* toilet would deserve a 3-star but the taste of food was sooooooo good that I am willing to give them a 4-star! :\") Ah~almost forgot to mention, the service was great too! :\") ***If I could rate for the taste of food alone, I would give 5/5 without hesitation! Or, maybe I shouldn't have gone to their toilet! lol***"], ["Greg M.", "I really wanted to like this place, because I love Thai, I love sushi and I love the Fondren neighborhood, due in large part to the plethora of great restaurants in the area.  Sadly, Surin isn't one of them.  The setting, on the ground floor of a retro-looking office building, has the feel of a hotel lobby bar/restaurant.    Nothing fun about it.  The service is fine.  The coconut milk soup (aka Tom Kah soup) is quite good, and complimentary at lunch.  The sushi rolls we tried (server recommended) were mediocre, as was the cashew nut chicken.  I can't think of any good reason to go back to this totally forgettable eatery, especially with several, very good and unique restaurant options within a few blocks of this dud."], ["Paul W.", "Nice lunch specials, which are available everyday! I had the curried duck, which was delicious, however, the lunch portion was very small.  The restaurant is beautiful, and large.  Had wonderful service.  Overall a good experience, except I am not sure it is a very good value."], ["Hannah G.", "I like to give a business two chances before I write it off completely. My first experience was ruined by bland, oily food. However, the weather was great, and my server was very nice. My second experience was ruined partly by the same terrible food, but mostly by the ten minutes we spent not being greeted on a slow night while our server lost their very visible argument with the host over not wanting to take our table. The service was somehow worse than the food. I felt like I was eating in a failing airport restaurant. Sorry so critical, but I love Fondren, and I would love to see a better business in place of this one."], ["Rachel P.", "After weeks of waiting, I finally had a chance to grab lunch here and I was DEFINITELY not disappointed! Located centrally in Downtown Fondren, Surin of Thailand is an easy and safe walk to lots of other popular spots-- like the Apothecary, Fondren Public, Fondren Cellars, etc. It's a great place to go for lunch if you want to explore Fondren a bit, or a great place to start your big night out on the town! If you ever had a chance to eat at Nick's, which is the restaurant that occupied the space Surin is now in (and I miss it all the time. they had the BEST brunch. oh, man. okay... back to my Surin review), the atmosphere is similar. At lunch, it's definitely casual. There were folks in everything from businesswear to shorts and tshirts. At dinner, though, it's probably a bit classier. The restaurant is spacious. There is a sheltered patio that faces Old Canton Road that you can sit on, or there is tons of seating inside the restaurant. In the front, there's a bar with a lot of seating and in the back part of the restaurant is the sushi bar as well as many more tables and booths. There are lots of seating options if you come with a large group, as well. (Though, definitely make a reservation.)Onto the food-- our meal started off with the coconut soup they serve before every entree. I really enjoyed it, but it was definitely very heavy on the coconut. I'm a huge coconut fan, but my friend that I went with wasn't and he wasn't too fond of the soup. It's probably hit or miss for most folks. Luckily for my friend, our entrees came out very quickly after the soup was served. I ordered the thai noodles with chicken and shrimp and it was super flavorful and well-executed. With lots of veggies, spices and peanut, it was everything I was looking for a in a thai dish. The portion was HUGE, but I was really, really hungry so... I took care of it. My friend got the masaman chicken and I had a few bites and it was also excellent. The curry sauce, especially, had an incredible flavor and the chicken was cooked perfectly, with just the right amount of tenderness to it. This place would have gotten five-stars no questions asked, but unfortunately, the service left a lot to be desired. Upon arriving, we waited four-five minutes for a hostess to seat us and once seated, waited another four-five minutes before anyone welcomed us or asked for our drink order. Throughout the meal, our waiter seemed bored and distracted, and rarely made eye contact with us while taking our order and rarely checked in to make sure everything was okay. I try to be really forgiving and understanding with servers (I waited tables for six years, so I *get* it), but he was just quite unfriendly. The restaurant wasn't particularly crowded, especially considering we were there during peak business lunch hours and I was a bit disappointed in this aspect of the dining experience. Despite that small setback, I supremely enjoyed my time at Surin of Thailand and will definitely be returning to try more dishes there!"], ["Emmi S.", "You cannot beat their lunch specials. The soup is amazing. The chicken noodle bowl is my favorite.  Sushi is pretty great too.  Try the super crunch."], ["Nick W.", "Excellent service and excellent food tonight. I was highly impressed and will continue to make this a regular dinner spot. The Shrimp Curry was amazing. The taste is like no other in Jackson."], ["Mack B.", "This place is fantastic the food was amazing the service was great. The wait time was not long at all. I recommend eating here"], ["Sarah T.", "We are here shortly after it opened and were blown away. It's delicious! The decor is really swanky and makes you feel like you're someone important and the quality of the food does the same. I can't say for sure whether it's truly authentic (I'm not a Thai food expert) but it's darn fabulous. The coconut soup is to die for! Definitely give this place a try! Also, the employees are truly lovely :)"], ["Minna Z.", "Always a fantastic experience dining here! The food is delicious, staff is friendly, and atmosphere is sophisticated, yet laid back. I crave spicy food like how regular people crave sweets, and their food hits the spot perfectly. My favorite is their spicy beef noodle and the chicken panang is a close second. The portions are huge, so the price is definitely worth it. Their basil rolls are also delicious! Their lunch deals are also great, but I warn ya that because it is SO great, that they do get pretty busy during lunch hours."], ["Tina L.", "Great food, excellent bar, adult atmosphere, nice happy hour, terrific dessert, pleasant staff. Plentiful parking. What's not to like?"], ["blake p.", "I have traveled all through Thailand!! The special Thai Hot sauce is excellent!!Pork pot stickers delicious and the coconut milk shrimp soup divine!!! Shrimp curry was amazing!!   Please enjoy a taste of Thailand!! It's super clean and excellent service!!    Enjoy!!Bon apetie"], ["T L.", "This is my second visit to Surin. The atmosphere is very upscale and fresh.  The staff has been extremely pleasant on both occasions.  This time I ordered the egg rolls as an appetizer and the spicy beef salad as my lunch entree. The lunch specials are very reasonably priced, but some of the other menu items can get a bit pricey for lunch. Still reasonable pricing for a dinner menu.  The coconut curry soup is absolutely delicious. The egg rolls are also very good. While the spicy beef salad was a good choice for a hot summer day, it seems to be lacking something... It certainly was not spicy. The menu had three peppers, which is their highest spice rating, but I felt that it had very little spice to it.Overall, my experience was pleasant, just as it was on my first visit. I will definitely be back again, & I was told to try the duck. I will not likely order the salad again, although  I'm sure that some people would certainly enjoy the flavor profile. It just was not my favorite."], ["Michael T.", "Been here before and like the place.  But what I got today...  Very small sushi roll; nice server; totally tasteless entree.  Before now, l could not imagined accusing a Thai place of that.  I was introduced to Thai food 25 years ago by a fellow who was Thai.  Since then I've been feed a lot of stuff with Thai for a label little of it authentic. None the less I like most of the pseudo-Thai ( not as well as the real stuff but...)  we couldn't get out of the place fast enough"], ["Kim W.", "The food is really good. I can handle spicy food. So we order pad Thai, thai hot. But it came out plain. The red dick curry was wonderful. Perfect sweetness and duck wasn't chewy. The spicy beef salad very refreshing with a mild kick from the hot oil. Only real complaint. The server seems to be in rush. He really wasn't attentive."], ["Jennifer M.", "I love this restaurant! The lunch specials are great! I can get soup and a good sized entree for a price that a college student can afford. Everything I've gotten there has been super yummy and something that I can't get at other places like coconut soup or curry. It's definitely one of my favorite places to go in Fondren for lunch."], ["Tiffaby H.", "It's SURIN, so you know that means it's great! This location is new to JACKSON but I loved Surin in alabama and now I have this one here! IF you ever want to have great Thai food please eat here."], ["Marielle D.", "Just finished eating here and we were very pleased with our meal. My husband and I split the potstickers with red curry which was amazing. The red curry sauce was so tasty. Then I ordered the pad Thai and my husband had the beef and broccoli. Both dishes had layered flavors and were very delicious. The ingredients were fresh and the presentation was great. They have great service and everything was brought out in a timely fashion. I highly recommend Surin for tasty Thai food. We cannot wait to come back and try more items off the menu!"], ["Richard L.", "Helping a friend move over the weekend, he offered to take me to Surin, and I'm glad he did! Walking in, I didn't expect the upscale decor. We were dressed in shorts and sweat stains. The service was top notch, our waiter Zeus had too much class for a man his age, but it was much appreciated. The food was top notch. Honestly was it the best Thai food ever? No, but it was delicious and the presentation and service really made it more palatable. I'll definitely be visiting often."], ["Aaron Ray A.", "Fondren has another fantastic restaurant.  If you are looking for flavorful food that is priced well, you have found a new place to eat.  I cannot say enough about how good the food is.  They have a full bar and are open on Sundays.  Next time you are trying to decide on where to eat give Surin a chance, you won't be disappointed."], ["Robert B.", "Second time in for lunch and was pleased with the service I had duck and curry 1st time and was good2nd time in I tried the masaman chicken . Not my cup of tea. Too heavy in THICK over welling curry but then you might like it that way I did say something to my waiter about the loud background music ( darn sure was not authentic Thai and he just shrouded it off )Will try a evening meal and report back"], ["Charlie B.", "I had the pork dish. It was perfect in taste. You decide how it looks. I thought the Vietnamese were the better with pork with their noodle dish. I like Surin of Thailand better."], ["Lola F.", "I had the succulent fried catfish.  It was light and flaky and came with a sweet and sour sauce and salad.  Excellent flavor and just the perfect amount of fish.   My husband's roasted chicken was cooked perfectly and had a great chargrilled flavor.  It also came with steamed rice and a salad.  We both had complimentary coconut sweet and sour tofu soup.  All this for $7 each.  Delicious and affordable lunch!  Highly recommend this restaurant."], ["Kristen H.", "Let me start by saying that the food was excellent. The atmosphere was very upscale, and the wait staff was very helpful. I ordered the yummi yummi roll which certainly lived up to its implied name. About three fourths of the way through my meal I noticed that the glass I had been drinking from for the entire meal had lipstick on the rim. I was unable to catch my sever's attention until the end of the meal. Of course, she was appalled and brought me a clean glass. The manager came by and made jokes about my glass not having \"lips\" the next time I came to the restaurant, which I found to be tasteless for the amount of money I spent."], ["Pai A.", "There are not a lot of good asian restaurants here in jackson, but this one won't disappoint. I've tried their shrimp curry, tiger cry, lamb chops and namtok beef (my fave) and they're all good and highly recommended!!! Happy tummy every time! Great service! Also try creme brulee and coconut ice cream for dessert!"], ["Abigail H.", "Probably my favorite lunch special in the fondren area. Really cheap lunch specials that come with a complementary soup. The chicken noodle bowl is my favorite. The atmosphere is a little weird and feels overly formal, but the food is incredible and makes it worth it."], ["Sweet O.", "Second visit. This time was for dinner. Good enough food, same weird vibe. If I did not know better, I would think this restaurant was about to close. It has loads of potential, just needs a lot of polish."], ["Trent L.", "Excellent food! The atmosphere was great, too. We had two different kinds of curry and sushi. Best Thai food in The Jackson area. Also, Cassie served us and she hands down was the best waiter/waitress I have had in a LONG time. If there were 6 stars, I would add another."], ["Hannah P.", "Delicious food, I had the basil chicken, and the service was very very good and attentive. Also I really enjoyed the atmosphere!"], ["Trish W.", "Went for late lunch today. LOVED it!  The restaurant is still as nice and pretty as when it was Nick's, but now with a bit of a funky upscale Asian flair. Service was great and friendly. Food was delicious!  We started off with a Supercrunch Roll (I think that's what it's called) and it was excellent.  Followed that with the Noodle Thai lunch special.  It was perfect but a little siracha sauce made it even better.  Comes with a cup of coconut soup that was interesting in a really good way.  They also have cool and fun martinis. Loved the Mississippi Sipper. Don't judge. It was a Don Draper lunch kind of day."], ["Torey C.", "Went to Surin tonight with som friends, as others have said, service was slow and lacked knowledge of the food. Before the food came we were given an bread course of a cinnamon and cheddar biscuit. Though it wasn't bad, it was quite strange to be eating it in a Thai restaurant. I ordered the spicy beef noodle, and I was quite impressed. It was definitely the best Thai food I've ever had in Jackson. I will definitely be coming back, though the lunch menu seems to be the same food as the dinner menu just cheaper. Hopefully service improves as servers and management become more experienced."], ["mary e.", "The surrounding are stunning, and the jazz music was tasteful but nothing to do with Thailand.  The wait staff very very almost overly nice.  I was there for lunch, and was initially impressed.  Served soup that is very very tasteful.   I ordered the Chicken Panang and enjoyed the sauce but the chicken was chewy, and chicken should never be chewy.  There was not many bell peppers in the dish.  The other disappointment was  the limited choices  of Thai dishes, and the meats that were offered.  With a lot of Thai restaurants I have visited you get the choice of your protein, and this was not offered nor was the heat of the spices.  I did not even look at the sushi, as I was solely seeking Thai.  I think there is a better choice for my kind of Thai food in Jackson, but if you are going for the atmosphere and the bar it would be a nice evening"], ["Dan E.", "Best Thai food in Jackson. Incredibly affordable lunch specials that are delicious. Our favorite is the Masaman Chicken, with avocados cashews and a excellent curry sauce."]], "Fusion Japanese & Thai Cuisine": [["Melissa M.", "We had a late lunch at Fusions for our first visit.  It's off Lakeland in what used to be a Fazoli's on Treetops.  You probably won't see it unless you're looking for it, but it is definitely worth trying if you like Thai food. Their menu (and name) says Japanese and Thai and their menu us divided into those sections.   The menu is very large and includes fried rice, noodle bowls, bubble milk tea, and much more - there are photos of the menu in the Yelp photo gallery.  I had the Pad Kee Mao (drunken noodles) with shrimp for $12.95.   It was a large dinner sized serving and very spicy at a level 2.  It came with a generous portion of excellent shrimp, plus grilled carrots and green beans, broccoli, and cabbage. My son had the green curry with chicken, which was a large bowl with chicken, carrots, bamboo shoots, basil, and more.   It was also delicious.  We ordered the basil roll for an appetizer and it was good, but I probably wouldn't order again unless I was eating super-clean. It included 2 large 4 slice rolls in a spring roll wrapper filled with lettuce, thai basil, cucumber, bean sprouts, and a few shrimp, along with two dipping sauces.  If you want something light and healthy, it's a good option, but as it came out with the hot food we ended up eating only one of the rolls.  Our total bill was $32 with tax, but that was for an appetizer two generous servings of very fresh and tasty food.  Our waitress was friendly and attentive, refilling our water regularly.  The owner came out to check on us, also. We will definitely go back.   BTW if you have family or friends who like sushi, I overhead many ordering the rolls.  Since it's not my favorite, this is going to be a great place I can take my college crew so they can have sushi and I can have Thai!"], ["Andrew K.", "Wow! Stopped in on a Sunday evening. Blown away by the quality and freshness, and the friendly and helpful waiter. Had fresh basil rolls--the Thai basil smelled and tasted great. Had the green papaya salad--VERY hot, but also very good. Pad kee mow had good flavor and lots of fresh veggies.  Prices were reasonable for the quality and quantity. Entrees $10-$14. Basil rolls for sharing $4.50. Salad appetizers $7 or $8. Great spot for a date. Just wish they played Asian music instead of a local radio station. Five stars."], ["Ken P.", "Great Thai food in Jackson, Ms area. We are vegetarian and they have many choice. Very few option for vegetarians in Jackson area and this is the best. Service is great."], ["Sweet O.", "The basil shrimp spring roll had NO detectable basil and pieces of a single shrimp in it and was NOT fresh. The hibachi chicken dinner lacked flavor. Totally forgettable dinner, save for the stomach upset."], ["T L.", "Fusion is a great choice for a change of pace. It is a casual atmosphere and very reasonably priced.  Everything I've had has been delicious! I love spicy foods, but beware that if you order \"hot\" it is very spicy.  Pictured is the spicy basil fried rice... very good."], ["Kristen H.", "Love this place! The hibachi is always good and the sushi is on point! Never disappoints. Also they have some vegan fare!"], ["Brandon T.", "The quality of food here is amazing! I love their widespread menu. They offer curry dishes, pad Thai dishes, and sushi! All of which I've had and is fantastic."], ["Sothy P.", "The best Pad Kee Mow and Thai chicken wings in Flowood.  Order the same dishes just about every or every other weekend.  Dishes had quality food and were consistently delicious.  Friendly staff.  Short wait times.  Clean and beautiful restaurant.  Will definitely make time to stop by for our favorite dishes when we're back in town."], ["Duan C.", "I'm going to keep my review short and sweet. Jackson has a boat load of Americanized Chinese restaurants - but not too many authentic asian restaurants that serve a distinct cuisine. Fusions Thai menu is solid and a breath of fresh air for the transplant northener such as myself. In my humble opinion - I think they make THE BEST fried rice in all of Jackson! The Thai Combination fried rice is simply dee-lishes!They only received four stars because of the Pad Thai - theirs is pretty solid, but it doesn't wow me. I'm waiting on Jackson to get an additional vietnamese restaurant, a korean restaurant and I would love to see a Filipino restaurant. But its nice to see something different and fresh in the Jackson Metro Area"], ["Joael K.", "I was on a trip and found this on Yelp.  Love Thai food and eat it often.  I ordered the whole snapper with hot chili sauce.  Amazing!  The fish was fried and cooked perfectly.  Sauce was sweet, spicy and yummy.  Fish was placed over veggies.  Loved it.  I would come back again, if it wasn't a seven hour drive!"], ["Zachary B.", "We left Mississippi two years ago and this is the place we miss the most. The pad kee Mao is the best in town. Period. Staff is always friendly. Food is always consistent. I miss this place so much. If we ever visit Jackson again we will stop by."], ["Ira L.", "The food was really good but the service was really really slow it took 15 minutes before we got our drink order and probably were waiting another 40 mins for the food so I can't give it more than two or three. I think they were shorthanded they really need to hire more people"], ["Charles L.", "Never got to try this place. Waited over 10 minutes for a hostess to seat me. She was so rude and not interested in my business, I walked out and went to Applebee's across the street"], ["Jennifer W.", "I was in Jackson on business and a co-worker told me that I absolutely had to go here for lunch, now I'm someone who is a big fan of a variety of asian styles of cuisine and so when I hear \"great\" and \"asian fusion\" in the same sentence I have some high expectations. I was pretty impressed with Fusion!We started with calamari (mainly because I love it) and the rings were HUGE. It was so tender and so well cooked and came with the sweet/sour asian sauce that was perfect with it. I got the pad kee mow (hot) with beef and chicken and I was in love. It had some heat to it but I probably could have gone even spicier because I love heat in asian dishes!! The flavors were so rich and complex and the portions were huge, I really couldn't believe how much food we got for what we paid! For dessert we decided to be adventurous and got \"red bean ice cream\". It was so weird, and I wouldn't get it again but it didn't taste weird just... odd. It had a stangely sweet flavor and something about it made us keep taking bites. I wouldn't recommend it, but I definitely recommend the calamari and the pad kee mow! MMM!!!"], ["Mike K.", "Had the Thai Fried rice, Chicken Pad Thai, Spring Rolls, and Tom Ka Gai soup. Everything was well prepared and delicious. Would recommend this to anyone looking for good Thai food."], ["Jil W.", "Really good Thai food. I wish they had beer. Pad kee mow, red curry & calamari were all great. It took a while to be seated, even though there were plenty of tables. Definitely get the Thai tea...it helps when your mouths on fire! :)"], ["Ryno H.", "It's as close to real Thai food. Jackson area lacks the authenticity of what Southeast Asia cuisine . Pad Thai is solid, all curries are good and the best fried rice in ms!! They now serving alcohol which is a must with spicy food. Also the papaya salad is good but can be kicked up a notch with the real deal fermented crab. Overall it's a no brainer. Good shit"], ["Brandon J.", "Great food an prices!!"], ["James H.", "The food is good (I especially like their panang and red fish), and I have enjoyed anything I've gotten. Perfect spice level, enough to make your brow sweat. WIsh they had beer,but you can brown bag. Service is awful. The host is borderline rude and very non-observant. I go in knowing what I want so I can say it when I sit down and not wait 30 minutes for him to finally stop by and ask."], ["Shannon N.", "Back again in MS, but am leaving tomorrow for a little while.  I heard there is a Thai restaurant here and thought I'd give it a try. I have to admit when I first heard about this restaurant, I was totally intrigued by the fusion of Thai and Japanese food. Well, I was a bit disappointed there were no actual dishes that infuses the two together. Decor is dark, but clean. Nothing fancy here at all, just a few Thai ornaments here and there. Service is not the most prompt, but we did come here during mid-afternoon with only one server working with 7 tables to serve.The menu is divided into a Japanese section and a Thai section. Basing on all of the other tables around me, seems like the Thai menu is more of the popular choice. We ordered a Pad Thai and a Red Curry dish. The noodles are sweeter and not as sour as the authentic dish, but I have to admit they are not shy on the sprinkling of peanuts on top (I liked that). The curry was also a little disappointing, it did not have lemongrass to help with the flavours. If you want extra rice, be prepared to be charged for it.Definitely not the true authentic experience, but will settle my stomach of Thai cravings until I get home. More cons: the owners and employees are not Thai so may be the excuse for non-authentic taste, they charge for hot tea, an employee parks near the entrance (leaves a bad taste in my mouth, especially since I've worked in customer service for years)"], ["Baron M.", "I stopped here to grab some takeout one evening when I was looking for something a bit different. I had some friends tell me that this place was great and I would not be disappointed. They were right. It was very good. The fried rice was outstanding. Much lighter and tastier than most places around here. Prices were on par with going to other places that were similar. I'll be going back soon. Maybe tonight. I think so..."], ["S B.", "I can't tell you if this is good Thai food or not because I've never had it.  But I can say that I now like Thai food.  That probably makes this a positive review of the restaurant."], ["Aviva C.", "This is a great place. What I love the most is that it is not loud at all and you can bring your group to this place."], ["mary e.", "I thought they closed!   But there is a deal chicken for them today! I have been by there many times and not a car in the parking lot.  Their food is great, but the staff is not real accommodating,  They definitely  have the best Thai in the area.  Their portions are good, the price are reasonable."], ["Chris M.", "I've only been here for lunch.  You can go to a fastfood or subway for lunch and pay $5 - 7, or you can pay $5.99 for the Hibachi Chicken lunch special that comes with Grilled Hibachi Chicken, fresh fried rice, steamed veggies, miso soup, small salad, and an orange slice for dessert.  Wow!  Great value for lunch!  Havent tried the sushi yet...soon..."], ["Jay G.", "Best Thai food in Jackson area"], ["Kristin B.", "The hibachi is very reasonably priced and the springrolls are very fresh. I can't wait to go back and try more things."], ["K P.", "Very good (6/12/12).  Food was fast, fresh and very tasty. Reasonable prices and a comfortable environment make this a new regular destination."]], "Sakura Bana": [["James H.", "Outside of Japan, and in Jackson, this is my favorite Japanese style restaurant. They're always busy at dinner so, go early or wait. The service is always on point. They have a great, fresh sushi menu. I was delighted the last time I went in to see a bottle of sweet potato shōchū on their bar shelf!"], ["Rachel L.", "Nice presentation, awesome customer service, very reasonably priced. Downfall is they don't give you complimentary soup or salad like other sushi places. Our server asked if we'd like soup and salad so we said yes, little did we know that we'd be charged for it. Overall still a good experience, we'll definitely be back."], ["Cherry D.", "Pretty good little sushi joint. Sat at the sushi bar. For appetizers we got the seaweed salad and the cucumber salad with crab. Didn't really like that they put soy sauce in my cucumber salad. I usually like it tangy with the Japanese vinegar instead. I won't be getting that again. But the four rolls I had were pretty good. The service was also pretty good for a busy Friday night. Seemed like they had a lot of regulars that sat at the bar. Total price for my dinner was about $55. Very affordable given the amount of food that I ordered."], ["Jennie B.", "Amazing fast and polite service! Fresh and unique sushi rolls. Welcoming, clean and fun environment.  The location is small but the food and service combined offer one of the best sushi dining experiences in Jackson, MS! If you love sushi and traditional Japanese food, you MUST try this place!"], ["Big E E.", "I have not been in this restaurant fir years..  Recently, i have decided to visit it again.  Sushi chef and staff still remembers me from way back. That is an awesome feeling i tell you. Staff is very friendly, and very knowledgeable about their menu. DEFINITELY RECOMMENDED THIS PLACE FOR LOCALS AND VISITORS ALIKE!!!!!8"], ["Stephen S.", "Very above average sushi and udon for the Jackson, MS area.  Come for the food - not the decor - wouldn't make it a date spot - wouldn't propose to a GF here - great lunch place - great takeaway - loved the mango roll."], ["Yvette A.", "This sushi was absolute perfection! The taste, temperature, and attention to detail on each plate was fantastic! I had the Cherry Blossom and the Krispy Kreme Roll. Many celebrities have been there and when you taste the food at this nice little dive you'll see why! I will definitely make my way back here every time I'm in Jackson! The place was pretty packed but it was also Ash Wednesday."], ["Aaron Ray A.", "The best sushi in Jackson....hands down!  Great service and a place you can take the whole family."], ["Chandler F.", "I no longer live in Jackson, but after visiting recently I have decided to help out the Yelp scene there. To start, I'll review one of the places I used to love going to.Sakura Bana (formally Little Tokyo) has always been a great spot for sushi. If you are trying to find hibachi/teppanyaki, then you will need to head over to Little Tokyo II on County Line Rd. This place here has their sights set on sushi!Now on to the food. For years, the sushi here has been consistent. They are not stingy with their slices of fish, the sushi rice is seasoned nicely, and the rolls always taste fresh. I am a bit of a purist when it comes to sushi, so I can't speak for any fried, saucy, or super modern rolls. My favorite item here is the salmon box sushi. I have been eating sushi in Atlanta for some time and I have yet to find a sushi roll that is quite as appealing. It has a great balance of salmon, avocado, and lemon. A must try if you are a fan of those ingredients. You also can't go wrong with your standard nigiri.Based on my somewhat fleeting memories, I never had any issues with service. So, all in all, this is a great place to stop by if you are in the mood for nice, clean sushi."], ["Melissa M.", "We have been Little Tokyo/Sakura Bana customers for years.   They have some great sushi and dinners.Tonight we ordered take out and were told to come in 30 minutes.   Got there in 30, waited another 30 even though the restaurant only had about 8 tables.    The food is good, but we are not impressed with the take out service.  It used to be pretty good but there were 5 of us waiting over an hour for our orders tonight.    Just be aware."], ["Ryan B.", "I was very surprised how authentic the Japanese cuisine was at this clean, medium-sized restaurant.  The dishes were very fresh and tasty.Easy to find, this place will impress due to great wait service and a good-sized menu.  I can verify that the tempura vegetables, sushi rolls, udon noodles, and shrimp dishes are way yummy."], ["Stan A.", "Working in Jackson for 3 weeks and was tired of hanging at the hotel. Been on a diet (sort of) so have been eating lots of sandwiches in my room. Was searching YELP for something good to eat. Found some positive reviews on this site and decided to give it a try. Also, wanted to avoid the usual chain restaurants. Found the place rather easily. A small, but busy place. Very nice interior. I was seated quickly. My waitress took my drink order and I set about the task of reading the menu for something tasty.I am used to sushi joints having written descriptions of the ingredients of their rolls, this place had none. Just names of rolls on the menu, no clue as to what was in them. I asked the waitress about menu descriptions, she offered some photos. Not helpful! I settled on a tuna sashimi appetizer. (Not as good as the one I order at Taste of Tokyo in Destrehan, La), but not bad. My \"Rainbow Roll\" arrived, stuffed full of cucumber. I HATE CUCUMBER! I had specifically asked the waitress if there were crunchy veggies in this roll, no mention of it. Not a fan of crunchy veggies. I told the waitress about this when she refilled my drink. Her response, \"oh yeah, forgot about that one\" and walked away. Not the reaction I hoped for. Instead of fighting with her, I picked at the dish and ate the tuna, salmon, and crab. Disappointing meal. Might give this place another chance. Jackson is severely lacking in quality restaurants. Guess I will be making sandwiches for several weeks."], ["Niki L.", "OK so I'm a little obsessed.... My whole experience at Sakura Bana was ruined because of a phone call I had made 4 hours prior to arriving... I called in at about 3pm to check about what their prices were and what menu items they had different from their sister restaurant Little Tokyo (2)... A man answered the phone and I told him why I was calling... I told him I was trying to decide between the two restaurants and he told me that Sakura Bana was better and cheaper. I asked the man if they had Chawan-mushi or dobin-mushi... Actually I asked him a couple of times. \"Are you sure you have chawan-mushi?\" \"Oh yes, we have chawan-mushi\" \"Really, are you sure you have it?\" \"We have Chawan-mushi\".... Fast forward 4 hours... At the restaurant... I have my niece with me who's never in town and has never had chawan-mushi. I was all excited for bringing her to one of the only sushi bars I've been to in the south so far that has it... I order it and- \"Oh no, we don't have chawan-mushi\". \"Sure you do... Chawan-mushi.\" I say like the Japanese waitress doesn't understand what's coming out of my mouth... \"You know, the soup custard, Chawan-mushi?\" \"No, sorry, we don't have chawan-mushi. Little Tokyo does\" I sit there for a moment getting even more upset. I told the lady I drove all the way over there just because someone told me that they had chawan-mushi there. She told me it wasn't them I called, it was Little Tokyo. I pulled out my phone as evidence. \"That's not your phone number?\" I say to to the lady as she squints to try to make out the tiny little digits on the screen. Anyway to make our confrontation short she finally admitted that I called them but the guy didn't understand what I said... Not that he told me that they had it so I would come to their restaurant instead of the other... I didn't throw a fit but I'm sure the woman next to me was thinking \"What the hell is this bitch's problem, freaking out, making a scene because she can't get some mushy thing here...\" We decided to stay because I was really hungry. We ate. I was stewing in my own frustration. I couldn't enjoy anything because I was still mad. The food was better than many sushi bars I've found around here. They had exceptional sashimi and chirashi. The hamachi-kama was possibly the best I've had. The service was also pretty good. The only bad thing I have to say (besides the chawan-mushi incident) is that they didn't really have a broad range of rolls -or- didn't have other appetizers I would have expected such as green mussels (which I am also equally obsessed with). However, this is pretty much a traditional SUSHI bar (and they are actually Japanese here). It is what you would expect. Ugh. Just go and eat there. It's good. They would have gotten another star if I wasn't so bitchy so just do it. You'll probably really like it. I'm going to Little Tokyo II."], ["Kristin B.", "Sakura Bana nee Little Tokyo 1, you will always be in our hearts for letting us bring 20+ people in for our Thanksgiving celebration. I think we've been doing it for about 10 years now!"], ["John S.", "Best sushi in Jackson? Hands down!"], ["Frances L.", "There aren't a lot of choices for \"exotic\" foods in Jackson and Little Tokyo is pretty damn exotic by Jacksonian standards. It has the standard variety of sushi, sashimi and tempura dishes and also Sapporo and Kirin. This is a great starting point for those unfamiliar with Japanese food, and who are looking to broaden their palette beyond their usual selections."], ["JannaMontana B.", "EXCELLENT !! Best Sushi !! In Jackson !!! My family has enjoyed sushi for many years....this is their favorite place in the US ! If you are anything like me...a \"Germ-a-Phob\" patron of any restaurant...sigh...my fault... THIS Restaurant is CLEAN and has excellent staff ! Very knowledgeable and helpful. I am \"new\" to sushi, however, I LOVE this place. The fish is fresh !! Fresh !! Fresh !! My favorite Sushi is the Volcano Roll, the Crunchy Shrimp Roll.... BUT, I am always drawn to the Salmon Steak. I have eaten salmon for my entire life...and \"Roger\" the chef in the back of Sakura Bana ... is undoubtedly knows his stuff. The skin is crispy, like it was perfectly cooked \"bacon\"...it melts in your mouth ! the salmon is fresh and perfectly prepared. The owner makes all of his own condiments...and sauces... they are wonderful and fresh !! The ginger salad dressing is amazing, too ! THE MOST AMAZING appetizer they have...is the Chicken Neigma .... It is bite size chicken breast wrapped around mozzarella cheese and a tiny piece of asparagus ! Pan cooked, then topped with homemade Teriyaki Sauce !!! Our family cannot get enough of these ! So yummy ! They look like \"sushi\" rolls...but are amazing. You will enjoy the service, the food, the freshness of ingredients and the cleanliness ! Cannot wait to go back. [our family ALWAYS goes there for our family birthdays...] Worth the cost for FRESH ingredients and PRIME ingredients ! YUMMY !"]], "Nagoya Japanese Restaurant": [["Kim B.", "I am only giving this place 4 stars bc I thought it was a little untidy when I was there. Other than that, I'd definitely come back! Long story:We were craving sushi and this was the closest to our hotel. I ordered my usual favorites: rainbow roll, Miami roll, vegetable roll, and the shrimp tempura roll. I ordered the Mississippi roll as my specialty item. On the side I had an order of fried rice for my kids.    Everything was great tasting and fresh! The fish to rice ratio was perfect. The raw fish tasted great and was of great quality! The fried rice was seasoned well and not overly salty,or oily.   The kicker was the price! SOOOO affordable. If I lived here id come often and not feel bad about breaking my wallet. The customer service was great also. Really kind hostess and waiter."], ["David R.", "Good sushi in Jackson, MS. My cousin recommended that we come here. To start, I ordered a Bombay Sapphire gin and tonic. The service was good and the member of the staff that served us was cordial. Before the sushi was delivered we brought warm wash cloths and miso soup. For the sushi, my cousin ordered a dynamite roll and a Nagoya roll. I ordered the following: citrus roll, Alaska roll and a yellowtail roll. The citrus roll, Nagoya roll and yellowtail roll were my favorites. I never eat my sushi rolls with wasabi or soy sauce. They were good with just the pickled ginger. To finish, I had green tea ice cream tempura. It was topped with whipped cream and candy sprinkles; it was good.I would come back again."], ["Ryder T.", "I regret going here, especially since Edo is so near.The atmosphere was... dark. A dimly lit sort of dark. That is about all that is notable about the atmosphere.Pretty standard sushi menu. Nothing exciting, nothing complicated about ordering. The actual rolls, however, are very bland. There was basically no taste at all.It was nice that they give you a hot towel and miso soup when you sit down. Otherwise, nothing special at all."], ["Minna Z.", "This is one of my favorite places to get sushi in the Jackson area. Their sushi rolls are packed full of flavor and always tastes fresh. The wait staff is very attentive and polite! If you dine in, you get a complimentary bowl of miso soup, which is very delicious and perfect for a cold night. My favorite rolls are the Caterpillar, Volcano, and Nagoya. I only eat their cooked rolls, so I can't vouch for the raw rolls or their hibachi. Make sure to check Groupon.. They usually have deals here!"], ["Ashley W.", "I've been here a few times. And I decided to try something new, which is the Amazing and Miami roll. Freaking delicious. It slips my mind which roll has the salmon rolled with rice, avocado do and cream cheese but it is delicious.I think I will make this my weekend snack. Num"], ["Marshall D.", "I've had sushi literally all over the world & while this place doesn't have a huge, crazy selection of fish, etc - they do have the basics covered very well. The sauce on the eel roll could be a little sweeter but that may just be a regional thing. Their fish is very fresh, their Sake is nice & cold and the staff is courteous and very attentive. For sushi in the South, this place, in my opinion, is really good. I'm in town for 3 days & I'm coming back!"], ["Sarah L.", "Sea weed salad was the best I've ever had! The rolls were at par. Service was fast and friendly. The wrong drink was brought to me 3 times. It wasn't a big deal...Story goes: I ordered a water with lemon and waiter brought me a sweet tea. I kindly asked for a water with lemon, again, and the waiter apologized and brought me the water. By that time I had decided on a Cabernet so I asked for a glass. He then brought me a pinkish colored wine so I asked if it was a Cabernet and he says \"Chardonnay\". Hmmm. So then he apologizes profusely and I'm feeling real bad for the guy at this point but he insists on bringing me the Cabernet. So again, he returns with a white wine. Uhhhh. I feel so bad for this guy that I say it tastes just fine and it will do. Again he insists and so there I am sitting like I'm the only one invited to this  wine tasting. Honestly though, it didn't bother me. I really just felt bad for the guy and wanted to share because it's funny. Overall, good service. Good food. Average sushi roll prices. I would definitely go again."], ["David B.", "Really great value Sushi that tastes good, and not just in a \"I can't believe I am eating decent sushi in Mississippi\" kind of way. I enjoyed all the nigiri offerings I ordered. Their specialty rolls are tasty but definitely heavy on the sauces. We tried the Nagoya roll, Snow Mountain Roll, Volcano Roll, and Rockin Roll. The Nagoya roll was probably our winner, but they were all enjoyable."], ["Bobby C.", "ABSOLUTELY NOT!!  I travel a lot and this is the worst Japanese restaurant I have ever experienced in my 57 years.  Ordered Teriyaki chicken and california roll, the chicken was cooked in a microwave sliced up and put over a bed of onions and green peppers, yes I said green peppers with some Teriyaki sauce poured over it.  The sushi showed up about half way through the microwaved chicken and when my chop stick hit it....you guessed it, completely fell apart.  I don't know what the people in Jackson Ms. call Japanese food but tis is really, really bad.  I really cant believe the good reviews some people throw out there.  Oh, and I forgot to mention I got all of this lovely dining and a beer for $29.05.  What a deal."], ["Nicole S.", "The sushi was just fine, but the customer service left a lot to be desired.  The waitress never checked on me and was a littler rude.  They offer a Groupon, but will probably treat you as if you have stolen something, if you use it."], ["Cobus B.", "Awww man. I was looking forward so much to this place simply going by the other reviews. What a let down. I am so disappointed. Japanese staff was very fast in getting me a beer, some miso soup and wiping down the sticky table I was at. Had i known there was another section in the back, i probably would have sat there, instead of the front if the restaurant  Other than that, the service was super slow and the waiters seemed indifferent. The Japanese lanterns in front of the sushi bar was a nice touch but overpowered by the sounds of jazz and the FX channel blaring on the small flatscreen behind the bar. Which must have had an awesome show on, since at least three of the five staff members I could see was constantly watching it. The guy behind the bar also ran the can register, and had via back to me ( watching the tv) most of the time I was in there. That tv needs to go, it totally ruined the atmosphere. Food: Appetizer I got the grilled squid. It looked awesome arriving at the table, but was only slightly warm. I was so hungry I ate it like that. Pretty good though.Miami roll good was different, but nice.Fire dragon roll was pretty good. Nice cuts of Eel, solid pieces of roll and it was a good combination.Sadly I felt let down after the meal. The food was ok, but the entire experience was disappointing. Food maybe could have earned three stars, but Two stars because of the service and poor ambiance. Four would have been way too much. Have had better Japanese food in nicer places. Bummer."], ["Alicia A.", "The food my last time coming was GREAT!!! but this time the was alright nothing to get excited about as i do when i eat at Bonsai! the hibachi sode was closed so we ordered from table. the soup was not good!!! It looked like old dish water and smelled like it too! I did taste it and it tasted soup at first but the after taste was horrible! The salad looked old. The food was good! The shrimp meet my expectations the were perfectly grilled and seasoned. The rice was ok, and zucchini lacked seasoning! The service was GREAT! The waiters laughed and jokes with me and my partner and taught us a couple Chinese words!"], ["Molly H.", "Very, very excited about this sushi bar. My husband and I were in the middle of moving from Kansas to North Carolina, so we stopped in on the night we were in Jackson. The food is absolutely outstanding--and even better, it is incredibly affordable. Our check is usually $60-70 at a sushi bar. At Nagoya? Under $40. The waitstaff are kind and friendly and the food is served quickly. The restaurant is small, but I think it lends to its charm. I recommend it!"], ["Lawrence Z.", "Staff was unfriendly when I went to eat at the sushi bar by myself.Food was mediocre.Definitely not the best sushi spot in Jackson."], ["E P.", "Had lunch there today with a co-worker. Sushi was fresh. Had the sushi lunch special and co-worker had the caterpillar roll.  Both were good. Lunch special includes soup, salad (both a squid and a lettuce with ginger dressing), rice, seaweed salad, a roll and 4 pieces of sushi.  For the price in better restaurants you would only get the sushi but the extras you get are only OK so really did not add to much to the plate other than quantity.  Salad lettuce seemed like they had poored on the dressing and it had sat for a while. In a shopping center not stand alone if you are trying to find it."], ["Baron M.", "Best, most consistent sushi in town. There are a number of other sushi restaurants in the area that offer better \"special\" rolls and really show a flair for creative cuisine, but Nagoya is consistently better on all the \"staples\" of sushi (Americanized sushi I suppose). I feel that the location next to Target does a better job than the Madison location, but that is only based on comparing them about four times. I don't think the difference is so great that I'd drive in from Madison or vice versa. I feel the staff is usually pretty good and half the time we have the same waitress who is always very attentive to us (even when we are there with our little ones)."], ["Sheila D.", "There's nothing truly special about this place, other than the fact they aren't going to mess up your sushi. Hibachi on one side, sushi on the other (although you are free to sit wherever you please.) When I went we had a baby with us and the baby was totally freaked out by the hibachi grill. It sucked. I wanted my performance, damnit!Anyway, the sushi there is always good. They have a great menu, the staff is nice, and I eat there every time I shop at Target (next door). And if I remember correctly, they were totally understanding about the crying baby/hibachi grill situation and gave my friend something free. Can't beat that!I recommend getting their meat dumplings as an appetizer and trying the dynamite roll. It's good there."], ["hobo s.", "As Niki noted, the service is very quick.  The tako sunomono tasted fresh and had good flavor.  The dressing was a bit thin, but not bad.  The grilled hamachi kama was a little too blackened, but still, quite good.The sushi was good, not great, but tasted fresh.  I had a mix of nigiri and maki and everything was enjoyable.  Occasionally when I get a roll with crab salad or a scallop nigiri, the chef is too vigorous with the mayonnaise, but not here.  Just enough.  (I would prefer none, but as that is not up to me, the amount was well-chosen.)So, quick service, solid food, good price.  I cannot complain.  Sadly I will only be in Jackson for work one more time, but I will try to stop by again.  If I lived near Jackson it would be on the regular roatation."], ["Byoung Kyu S.", "Sushi in Mississippi?  Yup!  I had to work in Tupelo, MS (I didn't know where that was either 'till I looked on the map) in the morning then drove 4 hours south to Jackson, MS. I had skipped lunch so I was starving upon checking into the hotel. Did some quick research on YELP and decided to give Nagoya a try.The prices were VERY reasonable and the service was quite attentive. The decor could use some improvement but I guess it justifies lower prices.I had wanted to start with Hamachi Kama but the waiter misunderstood and brought me an order of Hamachi instead. I thought about sending it back (especially since I had already ordered hamachi sashimi) but it looked darn good so I decided to devour it.  It was nice and buttery and seemed very fresh.In addition to the hamachi sushi, I sampled:-- Amaebi (The body was very fresh and the heads were fried perfectly.  It was served with ponzu sauce.)-- Salmon/Hamachi sashimi (4 pieces of each) were generously cut and definitely fresh-- Unagi and Ikura were okay. Ikura seemed a bit bland (not salty enough) and unagi was typical.-- The hamachi kama (I eventually did order it) was bit too salty and the could have been grilled better (the skin was too burnt but the meat part didn't taste smokey enough). They must have grilled it too quickly over fire that was too hot.Overall, it was a pleasant surprise to find a decent sushi joint in Jackson, MS. The total damage (including tea, tax, and tip) came to be $47.77; even better when you get to charge it on Corporate AMEX.  Now my tummy is full and happy. What to eat for dessert?  Hrmm......."], ["Chris and Tami T.", "Every time our friends in Jackson talk about getting catfish and every time we end up here instead. I'm not complaining, but then again I am neither cat nor fish. I DO enjoy the company of cat and I like fish in sushi form so I enjoy coming to Nagoya with my friends and pretending to be a cat (to please the BIG cat lovers in the group) while eating fish in sushi form. We always over order and we always power through and we always know we will come back the same way we did the last time."], ["Lisa P.", "Probably my favorite sushi place in the area. I have been here quite a few times and have yet to be disappointed. The sushi is always fresh and I cannot wait to try the hibachi."], ["Marty B.", "I only tried the sushi and I really enjoyed myself.  The prices were decent and it didn't take as long as other sushi places I've experienced.  I would come back to this place and try something new."], ["Kristin B.", "I hate to admit it, but Nagoya feels like it's giving Little Tokyo some serious competition.This location has also expanded to include a hibachi section and full bar over the years. While they have a fair selection of Americanized food to please the casual diner, there's still a lot of food in the more authentic range. The atmosphere is subdued with low lighting and earth tones in the store.I love their Chirashi dish!"], ["Niki L.", "This sushi bar is seriously satisfying. One of the best I've been to in this area. So good for the price. This place reminds me of the sushi I've had in california as opposed to most southern sushi places I have been. The atmosphere was great and the service was actually THE best service at a sushi bar I've ever had. The food came out much faster than we could eat it and the waitress seemed to be there at the perfect time. The fish quality was great... especially the white tuna. The rolls were somewhat unspetacular but were a great deal (4-8 dollars for most rolls). Hamachi-Kama was one of my favorites... but overall I was very happy and will continue to eat there, especially for the price."], ["Jennifer H.", "Mmmm...my favorite!  Always fresh! I always get the sushi box with white and red tuna or the rainbow roll.  The yum yum salad is good too."], ["Herman S.", "Pretty fast and easy to go the Hibachi at lunch. Our cook offered if we wanted to make our fried rice and chicken spicy. After he served the non-spicy folks their share, he took however many tablespoons of the red chili paste we indicated, heated it on the grill, and folded it very well into the rice, turning every grain a delightful red color. When he got to the chicken he did the same...chili paste, a touch of pink sauce, the usual spices & sauces all writhing & bubbling. When they give you a spoonful on the side of your plate you personally can't work it all in like he can. This added a whole new dimension to the standard chicken & shrimp hibachi like you get everywhere. It was fantastic."], ["Becky S.", "I was only in town for the night and saw the reviews for this place..  The sushi was delicious.  I was worried at first as I saw hibachi grills as I hate all the noise and smoke they create but was relieved to see that they were in a completely different room."], ["Landon H.", "Still the best sushi I've ever eaten. Yes... the best sushi I've eaten in this country and others is located in the middle of Mississippi.Nagoya has a broad menu that is relatively cheap. Lunchtime meals are cheap. If you go on a weekend night, be prepared to wait at least 30 minutes. If sushi isn't your thing then order a meal from the grill room in back."]], "Osaka Japanese Restaurant": [["Angela P.", "My favorite sushi and Japanese place in the area. The atmosphere is casual; you can even watch the game from the TV in the sushi side. My favorites are the hot roll, Godzilla roll, ocean beach roll, tempura udon, and hibachi scallops. Quality ingredients, friendly staff, and great service."], ["Jennie B.", "Back in the day this was my favorite sushi place but it has since fallen to mediocre. The last couple of times I've been, the service was slow although the dining room was only at quarter capacity and the food was reminiscent of left overs.I got fried rice with my lunch and it was super greasy and stale. The server said they brought me rice that had been made earlier that morning ( I doubt it) and left in a rice cooker. I went at lunch right at opening, even if they had made the rice just before lunch, it shouldn't have tasted like it spent the night in my fridge and a minute in the microwave. Additionally they make fresh hibachi fried rice all day long, why can't they take the time to do the same for me on the sushi side? It was inexcusable. On top of that our server was a smart a$$. I asked to sub only cucumber salad instead of the cucumber squid combo in my lunch and he said he can't swap sushi and cooked. Really? They are mutually exclusive? I had no idea the limitations of a stove top chef excused him from being able to cut cucumbers and squeeze Japanese mayo on them. There is no practical reason why that couldn't happen. My brother was trying sushi for the first time and I'm embarrassed I didn't have the best this place has to offer. The sushi was under sauced and this last time our Tornado roll (wrapped in potatoes and deep fried) was burnt. The BBQ squid was overdone and too chewy, service was still slow and I had to yell \"hey\" to get the attention of my waitress (again only 4 tables and 2 servers this should not be an issue). I guess what I'm trying to say is, when it comes to the best sushi in town, this is not the place. Crazy Ninja can offer you better service and food. If you want a unique sushi roll like uni or rainbow trout, it's worth the occasional drop by, but don't expect the best service or food outside of that. I'm sorry I have to give this review, really, I discovered my love for sushi here, but it's just as easily taking it away right now, which is why I had to post this review."], ["Joelynn H.", "It was the worst HIBACHI experience, I have had in my life.  Poor portions, and they prepare multiple to go orders while you they do your hibachi. There was no knife tricks or eggs, only food cooking, rushing, hard, bitter vegetables that are given last during the meal. I love hibachi and go often, this is the first experience I have had were the chef cooks veggies last. Its rice, veggies, meat. Disappointment I do not recommend this place for Hibachi!"], ["Brian H.", "My favorite sushi place in the Jackson area. The Okinawa Roll is amazing! Also recommend the Hot Roll and Tornado Roll. It's always clean and the service is good."], ["Chris P.", "Always a great place to eat.  Whether you are in the mood for sushi or hibachi the food is always good and good portions as well.  The staff are great too."], ["Sean S.", "Extremely fresh, friendly and reasonably priced. Very good selection, and accommodating staff. Definitely worth a trip during your stay in Jackson!"], ["Big E E.", "I have been dinning in this Japanese restaurant for years now, I must say i had never had any bad food yet. Not yo mention the wait staff is very friendly and attentive.  Try it!!!!"], ["Shannon N.", "Most creative rolls I have ever seen!For all of you sushi snobs and purists out there, do not come here, unless you want something creative and fun, along with the standard California and eel rolls. There is a really good variety of rolls that have different fillings that can suit almost any palate. Of course, there are also sushi pieces as well for the ones who would prefer something not in roll form. There are also other menu items for everyone else.The Okinawa roll is possibly their most popular item on the menu. It is arranged quite prettily on the plate. Our favourite was the Tornado roll. It was just a standard roll, but wrapped in potato string, then deep fried, then drizzled with a sweet sauce, and sprinkles with sesame seeds. Oh my, it was so good.There were other rolls as well we did not try, such as the Jazzy roll, New Orleans roll, Red Dragon roll, and the Great Lady roll, as well many others.The only thing we did not enjoy was the yakisoba from all that was ordered. The noodles were not soba noodles, but were the same noodles that are in instant ramen packs. The noodles were cooked too long, so it was too soft, and breaks every time we picked it up with our chopsticks. Unfortunately, this is what brought the 5 stars down to 4.The decor is not pretentious, but clean. The restaurant is a bit dark though, nice ambience for a dinner date, maybe? The background music is what you would hear if you are getting an hour long massage in a spa, with CNN on a large flat screen TV in the corner of the room.  The prices were decent, comparable to the larger cities like LA, Vancouver, and Seattle. We had dined in the sushi side of the restaurant. There is also a hibachi half, as well. It seemed busy, and the patrons seemed happy with their food, from what we saw.We will be returning again for try more of the different rolls, and possibly the hibachi side as well. Definitely a thumbs up for this place"], ["Sela T.", "Great place for sushi in the Jackson area. My table ordered several rolls and each were phenomenal. Portions and taste were great. Price is decent for sushi too. So its great for students who are def on a budget. The wait staff is nice. I def do plan on coming back here when I'm back in town."], ["Jack S.", "Nice people!!  Very good sushi!  Get the Okinawa and Godzilla Roll!"], ["Eric G.", "I stay in Flowood every quarter and every time I do I make time to stop at Osaka. I find the sushi rolls very good and the atmosphere simple. I'd say 4 stars is a solid rating for a sushi place in the south that's reasonably priced. They also offer Japanese sprite and cold beer. I had the tempura crab and shrimp. I enjoy the batter because it's more crunchy than most tempura."], ["Meagan R.", "The food was great! My son loves the show they put on while cooking and the cook really made it special for him. Back to the food, it was by far some of the best hibachi I have had! I will be going back."], ["Lei B.", "Yes, you are reading my review correctly, I am rating SUSHI in the SOUTH rated four stars! I was extremely hesitant on coming here but my coworker in El Segundo assured me that this place was legit! Then a coworker here in MS suggested it for dinner, so I couldn't turn it down.This place is similar to a Benihana type place, part teppanyaki and part sushi bar. I came here with a coworker and his friend, they are regulars here and they ordered the Godzilla roll, grilled squid, and scallop gonkan.  I ordered the Big Easy roll, craw fish roll, and nigiri pieces of salmon and yellow tail. Everything was surprisingly fresh! I found out they fly their fish directly from Japan.For a party of three we did some damage for $80. Service was ok, one of our orders got messed up but that was easily fixed. I apologize for any typos I'm writing this review on my phone. I'll definitely be back here if I come back for work."], ["Mary N.", "Great place and atmosphere! Went here for lunch with friends on a Thursday. Wasnt too busy and we did hibachi and sushi. Their sushi is good. Had the Philadelphia roll and rocknroll roll. Their calamari is delicious and sweet potato shrimp! Our waiter was fantastic! Will eat here again and their prices are decent too! For a college student thats great!"], ["Rachel P.", "This place was really quaint. The food was good, and I would definitely go back again. As usual we ordered too much, but we were happy to have leftovers to take to our hotel to eat later. We did both hibachi and sushi. The scallops with the hibachi were the big scallops, not the little tiny bay scallops. They were seasoned well and the chef pulled them off the grill with perfect timing. Also the sushi was excellent. We got the Cherry Blossom Roll, and one other roll that I can't remember the name, as well as a few pieces of sushi. Everything was fresh and delicious."], ["Tanner E.", "Excellent hibachi and unbelievable sushi. Some of the best I've ever had and this is coming from someone who lived in Hawaii. If you do hibachi ask for Richie!"], ["Uriia H.", "I have been here twice in the last week or so and both times the food was pretty good.  The sushi was fresh, and they have a wide selection of rolls.  The first time I went, the hostess was a bit pushy.  She kept coming up to us and recommending the same two special rolls.  Overall, it's a nice lil place to dine.  The service and prices are right on target.  Will become one of my favorite Flowood venues.  Love having my Sapporo poured in a frosted mug!"], ["Tasha S.", "I LOVE OSAKA! I typically eat here on Sunday's after church. They have the best hibachi that I have had in the Jackson area. I love their Salmon hibachi, bbq salmon sushi roll (add crunchy), Steak hibachi, Fried Noodles, Okinawa roll, Crunchy roll, hell.....I like everything at Osaka to be honest. They will continue to get my business. They are much better than Stix, Ichiban Hibachi, and Bonsai which are all similiar popular places in the same area."]], "Hokkaido Grill & Sushi": [["Melissa B.", "I have loved everything I have eaten at Hokkaido. I especially love the lunch specials."], ["Jonna B.", "We walked in at 2:00 on a Sunday, and they close at 3:00. We were seated quickly, and our order was taken within one minute. Our hibachi chef was fun, entertaining, and fast. We had food on our plate within 15 minutes, and I am talking about a LOT of food. Not only was it a ton of food, but it was a ton of delicious food. The vegetables and meat were both fresh and perfectly seasoned. Their \"yum yum\" sauce was some of the best I've ever tasted. If you've never been to a hibachi restaurant, try Hokkaido. If you've been to one and you think yours is the best, try Hokkaido. To me, it's better than Ichiban and Bonsai. Plus, it only costs two people $35 to eat there, and that's with a Spicy Tuna roll added to the ticket."], ["Sebastian B.", "The sushi here is delicious, and the bento boxes are super affordable. So much food for the price! I usually eat twice from one box. The service is great, too!"], ["Jessica L.", "We love this place for some good sushi. I especially like the Dynamite Roll and the Hawaiian Roll. Though I have to say, I haven't had much here I haven't enjoyed. The staff is also very friendly. We're not much on the hibachi part, but that's because we like to eat in peace and quiet.  But the few times we have eaten hibachi it was good and entertaining."], ["Yaya N.", "Good good good.. had the Madison Roll really good... service was.good..cook was funny... great atmosphere..."], ["Ian W.", "Good food and sushi. I telling the sushi chef to make whatever he wants, and I have never been disappointed. I really enjoy their tempura and yakisoba.  The place has a great atmosphere and nice decor, which is much better than what I would expect for a restaurant in it's price range."], ["Rex B.", "I guess its still better than Kyoto or Little Tokyo, who've both gone down hill.  I only get to go orders so I can't attest to the dine-in experience.  I guess it just depends on the chef you get because the food is very inconsistent here.  When they first opened it was good every time we went, now I'm looking at some overcooked chicken with a bad texture when you chew it.  The rice is very bland and unseasoned.  I learned my lesson and won't eat here again.  Someone needs to open an actual Benihana in Mississippi."], ["Kenneth C.", "Best Hibachi in the Jackson area. Super nice people here. The tempura is great. Table side hibachi is very good here. The staff puts this place over the top. No apathy here. Great food. Friendly Service. Been here dozens of times and we keep coming back"], ["Baron M.", "My wife and I had a bit of a lunch date and stopped in here as we constantly pass by, but have never gone. We were both very happy we decided to go here! The food was very, very good. It was plentiful, but not too much. Our chef was nice, he put on an appropriate amount of a show for a group of adults at lunch, so that was a nice touch. The only thing that is really keeping me from 5 stars is the soup. It wasn't bad, but it really didn't have that much flavor. Maybe we just caught it on an off day. The price, for lunch, was on par with most of the other places like this in the area. Please keep in mind that I'm only talking about the hibachi and not the sushi. I have not had a chance to try it yet."], ["Jeana S.", "Some of the best hibachi in Madison!"], ["Doug B.", "This was an unexpected surprise.  The sushi was good.  Everyone enjoyed their lunches."], ["Richard J.", "Service is great! We get takeout here all of the time also! The sushi is very good. We have had most of the specialty rolls and quite a few nigiri as well. Their fish seems very fresh and the texture is great. The rolls that have tuna are our favorites everywhere and Hokkaido doesn't disappoint with them."], ["Charlotte W.", "Best sushi in the state! My faves are the Ki Roll, Sexy Roll, the Salmon Platter, and any of the Bento boxes! Really you cant go wrong! Little Tokyo used to be the only place around to get decent sushi but this place blows it away.  Don't take some reviews on here into account. Especially the S. H. person below me. If you look at their account they give bad reviews to every restaurant in MS. In one they said that every restaurant in Mississippi is an abortion!!"], ["S H.", "Must every sushi place in town have this grill crap next to it? Sushi was way made with to much rice, probably cause regular clientele prefer it that way? Salad and miso were obviously sitting around for days before being served. Skip and make sushi at home."], ["Rob B.", "Had lunch with my wife. Very cozy place. Excellent service. Awesome sushi!"], ["Ginger C.", "Did the Hibachi Grill, it was delicious.  I ordered the shrimp and steak.  The shrimp were delicious, and I liked the steak but probably would have either ordered just shrimp, or gotten filet instead.  Not sure what kind of steak it was but it wasn't as tender as I would like.  Our chef was fun and entertained us, and made some great food. Lemondrop martinis were good also.  Very nice atmosphere."]], "Bonsai II": [["Rabun J.", "Big fan of the Cajun roll. Just the right amount of spicy. Similar to the Louisiana roll served at other sushi restaurants."], ["C N.", "I found a bug in my salad.  The bug was still alive."], ["Anissa F.", "I always get Hibachi and I'm always satisfied. I love it .."], ["Cindy K.", "I always get a table on the sushi side, and it's quiet with great service. Good place to talk business. The hibachi side sounds fun and good, but I prefer to not eat with 10 strangers. When i don't feel like sushi, I order anything tempura."], ["Gray H.", "The food was good, but unfortunately the service was lackluster. This is out of character for this location, so I'll give it another chance, and I recommend you do so as well."], ["Jessica S.", "Have eaten here many times and we always enjoy it. This time we brought a family member who has not been here before and while she enjoyed it, they got a few things wrong with her order. I like the improvements to the menu and the inside is always clean. Good sushi. Good hibachi. Despite a couple service mixups, we will definitely be back. PS- the servers were more than kind, so this is in no way a bad reflection on them."], ["Brandon T.", "I've had my fair share of Japanese and I think this restaurant is decent for the area and clientele it serves. The restaurant is very nice from the entrance on. The environment is probably the cleanest in Clinton and very new age artsy. You have a choice of Hibachi or Regular Seating. Rolls aren't the best I've ever had but they are certainly the best in Clinton. Entrees are good and lunch specials are great. Prices are slightly overpriced for dinner but lunch is a good value. They have an area specifically for to go orders."], ["Odie S.", "Food was not good. Sushi quality poor. Rice fell apart, ratio to fish poor. Sushi combo pieces not good. Fried rice, miso soup and teriyaki chicken had bad taste. Overall go to the old one!"], ["Jonathan L.", "The Hibachi was excellent and the decor, atmosphere, and the design of the building stand out among the nicest in Jackson.  There are many \"pop up\" Japanese style sushi and hibachi restaurants in the tri county area, but this restaurant really stands out on top.  Not sure what the previous post was referring to about the sushi being of poor quality.  I don't think you can get any better unless you live in Japan.."], ["Rob B.", "Had a wonderful lunch with my wife.  The service was on par, and the food was very good.  This place just might outshine Bonsai-1."]], "Bonsai Japanese Steak House": [["Rachel P.", "I've only ever had the sushi here, but I've always enjoyed it. If you're just getting sushi, you don't have to deal with the mad rush and noisy crowd of the hibachi section, which is nice. The sushi servers are always very friendly and helpful. I'm a huge fan of sushi, but definitely not an expert. The servers and chefs here are always willing to make a suggestion or answer a question for you.The food comes out really quickly, which is great. I've been here a bunch of times and it's never been crazy crowded (again, at least in the sushi section). The sushi is really good! My friends and I all really enjoy it. We come here pretty often as a group of five or six, and it's always a pleasant experience. I rarely feel like making the trek out to Lakeland, but for good sushi that's pretty affordable, I'm willing!"], ["Michael L.", "Been here twice both times I ordered from I kitchen and while the employees have always been great! The food always leaves something to be desired. The first time I ordered the food was lacking the curry \"gravy\" from the curry vegetables. The second time I received something I didn't order and was informed they were out of curry. I've heard the 3rd time is the charm and I was informed they would have curry back in stock the next week and I'll post back if I try it again.Atmosphere: 4Employees: 4Food: 2Avg: 3"], ["Brandi W.", "Bonsai is awesome! Great food!! Great drinks!!! Awesome wontons ask for duck sauce to dip them in!"], ["Anissa F.", "My hubby and are regulars here! We love everything from the hibachi to the sushi. We prefer this place over all others. We're here for our anniversary as well as Valentines Day, we love it that much. Their food is the best in town."], ["Amanda M.", "Worst hibachi I've ever had in my life.  I'm from out of town and we stopped by because there were a ton of people waiting outside so I thought that was a good sign.  The decor was outdated and when were taken to our table, my first thought was that I felt like we were in someone's basement.  SOUP/SALAD:The soup was pretty standard, nothing great but nothing bad.  Salad was completely drenched in dressing that tasted like thousand island dressing.  When I say drenched I mean drenched.  CHEF:The chef was okay, wasn't all that interesting and was definitely trying to cook the food as quick as possible and get out of there.  He had no interest in being entertaining at all.EGG THROW: (WHAT'S THIS YOU SAY?  KEEP READING)So most restaurants do a shrimp throw where the chef cuts it up into itty bitty pieces and throws it at the patron to catch it in their mouth.  Here, they did egg.  Really?  WHY would you do it with egg?  Almost no one caught it and it kept getting in people's eyes and hair.  What a horrible idea, I'm not sure who thought of that but that is the worst idea EVER!SUSHI:I ordered a sushi roll, the spicy tuna crunchy roll.  It came with 8 huge slices so I was excited but it might be one of the worst sushi rolls I've ever had.  It big but completely flavorless, I wasn't even sure what I was eating was tuna, there was no spice at all, and the roll was falling apart, they definitely did not squeeze the roll enough to be kept together.HIBACHI FOOD:You get 2 pieces of shrimp with whatever you order, I was so grossed out when I saw the chef did not de-vein any of the shrimp.  So I had black veins throughout mine; did not eat them.  I ordered the filet mignon and it was fairly good.  I have to say that the portion sizes are ridiculously large.  Very very big.  The fried rice was standard, the vegetables were ok but overall the meal wasn't all that great.  And typically there is 1 sauce for seafood, 1 sauce for meat, yea you get one, that thousand island dressing AGAIN.SERVICE:The service was terrible, he never stopped by to ask if we needed anything, I had to constantly stop him for something and he seemed annoyed by it and was very obvious that he was annoyed which made me really irritated.  Good service = good tip.  Bad service = bad tip.  Duh.  But this guy obviously didn't care.VERY IMPORTANT:If you look at the grill, on the outer parts and in the cracks, there is gooey black goop everywhere and stuck on food EVERYWHERE.  I mean EVERYWHERE!  So then I have obvious concerns about health and safety of the food I just ate.  I think this place has massive health code violations."], ["Amy S.", "Our meal here wasn't just bad... it was Really! Really! Bad!  The soup was awful.  The fried rice was awful.  The shrimp was awful.  The chicken was awful.  Everything was so bland and flavorless.  Our chef was B-O-R-I-N-G!  He did nothing to entertain us or the other poor patrons seated with us.Service was awful!  There were two waitresses serving our table and they were both slow and scatter-brained.  Drink refills were very slow to come and I had to ask for chopsticks 3 times before I got them.The decor was old and tired which left a dreary atmosphere.  Over $40 for the two of us and we both left hungry and irritated.  I have been to many, many hibatchi grills and this one was, without a doubt, the worst.  Even if someone else was paying, I wouldn't return."], ["Jamie P.", "We stopped in while visiting family in Jackson and were surprised that the line was out the door for the hibachi, but no one in the sushi bar - it was our lucky night! Great sushi, friendly sushi chefs and waitress and no wait for some very tasty sushi and drinks! Definitely worth a try if you're looking for good sushi in the Jackson area!"], ["Ron P.", "I love BONSAI! This is what I could compare EVERYTHING to- even when I lived in Florida. Nothing could hold up to the BONSAI challenge- however, when I moved back home, BONSAI was not as good as I remembered. Very disappointing. I will try it again, but I feel that it has kinda faded with popularity...."], ["Baron M.", "This is a perfectly fine hibachi place for lunch. The prices are reasonable, the food is pretty good, the staff is nice enough. Otherwise, it doesn't really waver from the status quo."], ["Ian D.", "Best hibachi in Jackson. Now, granted that's not saying much considering this towns track record with Asian cuisine but I really dig the place. Portions are huge and perfect for late night snacking. Never had the sushi here but I've heard it's decent. True, the \"floor shows\" have gone the way of the dodo and I'm not sure there's even a Japanese chef working there but they cook the food right and the flavored are solid. Price wise you are paying the average going rates and out of the 4 other \"hibachi\" places in town, it's the best value. I go here maybe twice a year for special occasions and it has never failed me in all it's years of being open."], ["David D.", "Pretty bad food. REALLY BAD SERVER. Empty glasses, plates piled up, food was flavorless. Would have given 2 stars if server wasn't awful. She messed up my order, forgot drinks, etc."], ["W E.", "The original Japanese steak house in Jackson.  They were the first.  I enjoy Japanese just like the next guy.  Japanese restaurants all do the same tricks. The Food is good. Period.  That is what separates these restaurants from one another.  The food at Bonsai is good. Things that I have ordered that were good.1.Chicken and Steak(pink sauce)2. Shrimp Tempura Roll 3. Crunchy Roll(no Roe)."], ["Ten X C.", "I have been coming to Jackson on business once a year for over 7 years and I love Bonsai. I've only had sushi there- but it ranks with some of the best I've had. Highly recommended"], ["Kristin B.", "They have sushi, but I wouldn't recommend it. It's ok but it's not what you go to a hibachi grill to order.Their hibachi is ok, the chefs do the standard little show while they cook your fried rice and food goods."]], "Edo Japanese Restaurant": [["Jennifer H.", "I live in San Diego, but EVERY time I visit my family in Jackson I make a mandatory trip to Edo for sushi. I have lived in and traveled to multiple cities but this remains the absolute BEST SUSHI PLACE EVER! I think I would cry if this place ever shut down. The snow crab naruto, haru, and dynamite rolls are the best!!!"], ["Ashley M.", "I waited for 20 minutes while the inept hostess took orders. She said she would seat me as I walked in, but continued answering the phone to finish writing, entering, and transmitting 3 orders. They need multiple things, but first is a hostess who has actually had any type of interpersonal jobs in their life, and a sign that doesn't look like it is in front of an abandoned building."], ["Kayla C.", "I was very excited to give Edo a try last week, I've heard many good things about it. They seated six of us easily and were very polite. I had a teriyaki tofu and it was huggee. Lots of food. I would have been pleased with it had it not been completely saturated. I would order again and ask them to not put so much sauce on the tofu.Unfortunately, one of the people at my table did not receive their food at all. The waiter was very apologetic and gave him the order in a togo box by the time we left. Everyone who ordered sushi was completely pleased. I would recommend getting sushi!"], ["Dona H.", "I love sushi and have not had  better sushi  anywhere. Snow Crab Naruto Roll is the lightest, best tasting roll! My favorite!"], ["Chase G.", "Fantastic. Probably my favorite sushi spot in Jackson. The Pink Cadillac Roll is phenomenal. All of their specialty sushis are delicious."], ["Cherry D.", "My favorite sushi place in Jackson. Sad that I didn't try this place any sooner. After ordering, I got free miso soup and cucumber salad. For desert they gave me a watermelon. You can also bring your own wine with no corkage fee. The sushi rolls were amazing. After trying several sushi spots, I think this one will be my go to sushi place."], ["Ryder T.", "I feel that this is a pretty well kept secret in Jackson. This is a small restaurant that is not terribly out of the way but easy to overlook. When it comes to Sushi in Jackson, they are clearly the best.The service here is top notch. At dinner, you are started off with a hot hand towel, a bowl of miso soup, and usually a small tray of a crab salad they make. The sushi menu covers classics that you will find elsewhere to creative rolls that you might not. The rolls are all flavorful and not too dependent on sauces (nor soaked too deeply in them). I have not ventured too far away from just ordering the rolls, they are so good. To finish your meal off, they often bring by a pre-sliced orange. I don't know how, but it is always one of the sweetest oranges I have ever had.For lunch, they do a two or a three roll special that arrives fairly quickly. Definitely worth the stop in to satisfy a craving!One thing to take note of, prices on the sushi menus are not consistent. They have the paper menu that you make your selection on, a full menu, and a sheet explaining some basic rolls - these all have different prices on them. It works out fine, but don't go here if you have an exact amount to spend.Don't be put off by the cigarette and liquor store neighbors - this restaurant is a serene haven for sushi lovers!"], ["Andrea S.", "Very good!  Had the dynamite roll, which has soft shelled crab inside.  Tasty!!  Also enjoyed the Jackson roll, another good pick.  The masago is dyed different colors, and didn't really have flavor. We also got egg sushi, scallop and salmon sushi.  All the raw ingredients were fresh and tasty.  Service was attentive.  Before our meal, we had a complimentary crab and cucumber salad and bowl of miso soup. That was lovely.  Good job Jackson!"], ["James H.", "Best sushi in Jackson.  The inside is comfortable and welcoming.  Don't worry about the outside.  I will be bringing my friends back here."], ["Ann M.", "Edo! My mouth waters at the thought. This a \"don't judge a book by its cover\" kind of place. The best hidden gem in Jackson! If you want wonderful sushi for a great price this is where you need to be! The sushi is fresh and bursting with flavor. I've been pleased that their menu offers a wide variety of raw, delicious sushi and not predominantly fried (though their fried rolls are superb).  Another great bonus: you can brown bag here!"], ["James H.", "Their sushi is very good, as is most all of their food from the kitchen. For appetizers I favor the beef tataki. Sushi is very fresh. Service is always fast. Their lunch bentos are a great value and always good. Good service, too."], ["Max P.", "The food was delicious, but the service was a little off. It could have just been the night that I went, though!"], ["T L.", "By far the best sushi in Jackson! The craftsmanship put into the food shows their skill and love for their work.  The sushi choices are broad, from basic rolls to very fancy works of art.  I've had sushi across the country,  and it's hard to beat Edo. They only serve beer,  but if you bring in your own bottle of Saki, they will warm it for you and serve it in the traditional cups."], ["Anna W.", "I've enjoyed every meal I've had here. Great sushi, and the service is always very kind.  They bring out free soup, a warm washcloth, and sometimes a delicious crab cucumber salad before the meal all free!  After the meal they give you free orange slices.  I really like this place."], ["Kelson L.", "My first trip to Mississippi and I was surprised to learn of this gem.  Japanese food is by far my favorite and it was great to find some sushi down south after eating lots of friend chicken.  We came here with a group of 8 and were greeted and sat quickly.  I ordered what I thought was a best deal on the menu which was 5 piece nigiri, california roll, and 12 pieces of sashimi for about $22.  The food came fast and the cuts of sashimi were surprisingly thick. Ordered some beers with the sushi and it made for an excellent meal.  Definitely check it out if you're in the area."], ["Coral E.", "My co-worker had heard great things about Edo, so we popped in for lunch today.  Place wasn't too crowded and we were warmly greeted as soon as we came in the door.  I had the snow crab roll and the spicey shrimp roll. Both were really great!  My coworker enjoyed the sushi she got as well!  This will definitely be on out list for quick, sushi lunches!"], ["Roger L.", "Best sushi in town.  Fresh fish, great service from the family that owns and operates this gem, and the fact you can brown bag make this my go to sushi spot in Jackson.Tip: If you have a group of 6 or more, try out one of their \"Sushi sets\". Incredible value and so much food."], ["Debby B.", "strip mall place but .... good food , service, and not a bad price.  dinner stop on the way to NOLA from Oxford, Ms"], ["Sntnbigd S.", "Sashimi was fantastic. Loved it and I'll be back."], ["Scott C.", "Great sushi. Especially the basic/traditional nigiri and maki. Tied for the best miso in town. Best take away option for sushi."], ["Jacquelyn H.", "One of my favorites! Edo is hidden in a sketchy looking strip between a liquor store and Subway but it is honestly the best sushi I've ever had. They are always very attentive and know our family when we come in the door. Food is always delicious and consistant.I love all the rolls I've tried, they have even made me ok with a soy wrapper when I've always hated it anywhere else. Miso soup is the most flavorful I've tasted. I get cravings for the crab salad with pickled cucumber and avocado. Pensacola Paradise roll is hands down my favorite. They bring fresh chilled fruit at the end of your meal to cleanse you palate. This shows an amazing attention to detail that is lacking most everywhere else.Oh, and my 11 yr old gets the chicken fried rice. He loves it and my husband and I usually eat his leftovers the next day. Still delicious reheated !!"], ["Melissa M.", "Wow.  I have two sons who love sushi. We've always gone the Sakura Bana/Nagoya route.  Never again.  Edo is so much more expressive and delicious.  We've been a couple of times to dine in and loved it. In fact they won't eat sushi anywhere else.  Tonight we got \"to go\".   Beautifully plated even for take out.  I had the beef skewer appetizer (2 skewers with beef and onions, yum).  We had the Amazon roll, LA roll and two others.  Just like our dining on site, the food was fresh and fabulous.   They were busy tonight and still had food in 30 minutes from our call. (Another local place nearby that we order from promises 25-30 minutes and I end up waiting, along with other frustrated call in order people, for 30 more minutes EVERY TIME.)  Still, if you can, eat there - they have warm towels, a fruit refresher and you can bring your own wine (at least last time we asked you could.)  Precious family runs it - you can often see their little elementary school boy and girl doing homework at an empty table, or checking people out at the register.   A truly local place, which I love, but I love the sushi even more.  We will have to try the hibachi and etc. sometime, but for now we can't get past the sushi."], ["Tawrena H.", "The sushi /sashimi here is reallly good.  I'm surprised more people don't know about this place."], ["Jeff B.", "From out of town and you yelpers did me right with your reviews.  This place is a gem and the prices are even better."], ["Duan C.", "I am an asian soup fanatic, my house is literally within walking distance of this place. So I gave their udon a try? Unlike Alan S., I wasn't too pleased! I guess I am addicted to Pho and I think any other asian fare will have a hard time knocking the vietnamese off the king of the hill when it comes to soups.But I did like the shushi. I had a spicy shrimp roll and it was pretty good. So I know if I have a taste for Sushi, this will be my quick fix on those lazy days.Very clean, but very small. Nice staff."], ["S H.", "Only decent asian place in Jackson maybe in all of Mississippi! The place is not the trendiest looking but at least they serve real food that is not disgusting. Still, wish there were more fish selection and it kind of smells like cleaning product or scented candles which can be off putting. Oh and music here needs help."], ["Josh M.", "Excellent sushi with an excellent staff. I was very impressed.In town for business and was craving sushi. I Yelped this place and it turned out to be fantastic. Great sushi chef behind the bar!"], ["Christina S.", "Would have been a five if they had wine and brown rice option for sushi rolls."], ["Khunjit S.", "THANK YOU, EDO! THANK YOU, YELP! I fould this place on Yelp and fall in love with it. They serve amazing sushi and sashimi -- Fresh and heavenly delicious! Four stars becuase I am not impressed with their teriyaki dishes -- too dry for my taste."], ["Lawrence Z.", "I am a regular at this restaurant.  Jimmy, the master sushi chef and owner, treats me like family.  Jimmy is a very experienced sushi chef and has worked in Japan, Manhattan, and New Orleans before gracing Jackson with his culinary masterpieces.I recommend the white Russian roll, dragon fly roll, tiger roll, sushi pizza, and osumashi soup.Enjoy!"], ["Jason B.", "So anyways, being new to Jackson I used yelp to help me find some sushi. We have an Edo where I'm from and it is relatively inexpensive so I thought I would try it. One of the best sushi dining experiences I've had. I decided to go out on a limb and asked the chef to make me a roll that is not on the menu, his choice. It was the best roll I ever put in my mouth. I took a picture, that is all that is left. I would highly recommend it to anyone that was looking for a good sushi joint."], ["Alan S.", "I really like this place and I hate to give them 3 stars, but they have a lot to work on if they are to really impress a customer much less survive in an economic slump.They are accustomed to having 5 tables in service at a time...MAX.  On valentine's day I sat at the bar and watched them turn people away because their sushi chef and waitress (singular) couldn't handle the traffic, not because there were no open tables.As far as the sushi goes, the prices are average for a Jackson sushi restaurant and the rolls are good.  Nothing really special.  I've been in a few times later in the evening and been the only customer.  I like the Udon Noodle Soup w/ Shrimp Tempura  if I'm not going for a sushi night.  It's tasty.  I would recommend going somewhere else if you like baked mussels though.  It's a good atmosphere and it seems you will never have to worry about a wait.  I'm suprised they've lasted as long as they have.  Check it out if you're in the area and wanting sushi."]], "Crazy Ninja": [["Ashlynn B.", "Fun atmosphere! I love that they play rock music in the dining area. The food is typically very good and they give you plenty! However, avoid super busy times, like holidays. I have found that quality seems to lack and they rush you out to accommodate more people. Hibachi chefs are always fun and do lots of tricks. Overall good experiences."], ["Tiffany Y.", "Came here because my sister wanted to and I was interested in a place that could keep her coming back... the picky eater that she is.  Well I will admit the hostess was very nice because right as we walk in the door... my sister and I start arguing about whether to sit on the hibachi or dining room side.  As we were not with a large party we would've been placed at a seating area with other people and I did not want to sit with other people... Soooooo I won that argument... we sat in the dining room.  We were still arguing when our server came to our table to get our drinks but we apologized and ordered sodas and edamame and spring rolls for appetizers.  While waiting on apps she took the rest of our order.  I settled on vegetable lo mein and asked what vegetables came in it and she wasn't very sure, I even attempted to ask was the lo mein sauce vegetarian (though most usually are) but she didn't understand that question, so I gave up and just decided to eat my food... most days when I go out to eat at new places... as long as there's no meat in my food I'm happy-ish...  My sister ordered the chicken hibachi meal that came with noodles, vegetables, and rice.  While waiting on our food, the edamame and spring rolls arrived and they were good.  As it is hard to mess up edamame, these were served hot, steamed well, and had a good amount of salt on the hulls to be licked off.  The spring rolls were hot, crunchy, and contained rice noodles and the usual assortment of vegetables inside.  When our entrees arrived everything looked yummy and my lo mein was actually okay.  The only complaints I had about my food was the lo mein noodles were very short which was weird, there were mushrooms in my food that I had to pick out because I hate mushrooms... mushrooms were not listed on the menu nor did the server say anything about mushrooms in the dish, but then again she didn't really know what vegetables came in it to begin with.  And the zucchini in the dish tasted odd.... can't explain why, it just did so I picked around them.  But other than that the sauce and assorted veggies such as the baby corn and broccoli were tasty.  Well there's not much else to say.  I'm pretty sure my sister found her food ok and service was decent if a bit unknowledgeable about food items.  But everything came out okay and I wouldn't mind coming back the next time I am in MS visiting my family.  I would definitely order a different entree the next time I came back, but other than that... Crazy Ninja is OK in my book."], ["William B.", "Service was great, was my first time eating there. The variety of sushi options were great and tasted really good. Prices were reasonable and the atmosphere was unique. Will return again!"], ["Kyle C.", "Tried this place because it was late and close to our hotel.  Hoped for good Southern hospitality and tasty food.  With the amount of staff on the floor, the service was horrible and the food was not much better.  But I have to say the staff was friendly, just very slow for everything. We tried 4 different sushi rolls.  They were okay, but really what did we expect eating sushi in Mississippi. All in all it seemed like it could have been a fun place on the grill side.  I would go back and try it again."], ["Ashlee Y.", "I was so thrilled with the performance by the grill masters. I enjoyed my dining experience. I was full as a tick and have no complaints. I love thee edamame and the first time I went there I ordered the bento box. The staff was very accommodating to my onion allergy and on Sunday night I enjoyed hibachi style. If I could eat that everyday I would. I will definitely be back to enjoy more flames and a show."], ["Scott M.", "The Greatest Hibachi and Pink sauce in the South!! Cooked by World class entertaining Chefs!! We are never disappointed and neither will you!"], ["Derek H.", "We like the sushi here!!! I get the Fire and Desire roll that is shrimp tempura roll and is deep fried and covered with Crawfish tails and crazy Ninja sauce. On Sunday's you will  get good deals so check them out. Never tried the Hibachi . The fried rice does have a lot of onions :(."], ["Thomas S.", "Went again and the service was good.  The food however, was too salty and oily.   The consistency in the cooks quality of preparation, flavor and taste of hibachi is hit or miss.  When the stars and planets are aligned and you happen to visit this restaurant on a \"hit\" night, the Ninja's hibachi cooks cannot be beaten! Absolutely delicious!The last few visits have been misses.  Sorry, Ninja! But for me, only consistency will keep us coming back."], ["Barry E.", "I did not even know this place was here. It has been that long since I went that far South of Airport Road. Went in elected not to sit in the hibachi area. It was more relaxed and not as loud. The music is rock & roll which was different than I expected for a sushi bar. The menus were on the inside of old rock album covers.It is a crazy atmosphere and it is different than any other place I have tried. The food was good and the chef was very talented in his/her presentation. I have another place that I will hit regularly now. I am still at a loss to explain the atmosphere..Unique is the best I can come up with but it is a crazy place with tasty food."], ["Tony H.", "The first time I went was awesome then went back a second time it was bad and we were in town tonight and decided to go give it one more shot and didn't even get all our food we ordered and asked about it and she said it was coming and then brought our check still never got our food our waitress was a lady named Roxane and was our waitress all 3 times horrible experience and will not go back..."], ["Ashley W.", "I didn't enjoy my food here this time. The shrimp fried rice was very bland. The sushi was dull as well. If I come back it may just be for hibachi. Aside from that the saucers had left over residue"], ["Stephanie B.", "The last time I ate here, it was great. Then, one day I ordered To-Go for lunch and they charged dinner price for a kid's meal portion of chicken. It may not have been quite as bad if the chicken was cooked well, but it was so hard and dried out. On top of that, I ordered a spicy shrimp roll and could hardly pick one up without it falling apart. When I called to tell them about the chicken, they made no effort to apologize or even admit there was anything wrong with the order. I'll definitely be taking my business elsewhere."], ["Melissa E.", "This place is great!!! Always great service and the food is fantastic! It's not your typical Japanese steak house. Great signature cocktails. Their sushi is some of the best I have ever had and their ramen bowl is super tasty! On top of it al they are very reasonably priced! Definitely will be coming back!"], ["Jenni W.", "Mediocre hibachi and sushi, crappy drinks. The only thing I can say about this place is it does accommodate a crowd if your party is large. We waited forever it seemed and then when we got in waited forever on drinks that had little to no alcohol in them. My friend's was fine but all around agreed mine had little in it. It was even the wrong color. When I inquired I was directed to the house specialty which  was overly strong and not tasty. I've had very well made strong drinks and this ain't it. There isn't enough room to back up from the flame if you are against the wall. That was not fun. And although the food wasn't terrible it certainly wasn't enough to make up for the bad drinks. I may go back if my friends desire it, but this will never be my first pick."], ["Jamie P.", "One of the most creative sushi places I've ever been (check out the photo of the menu I uploaded). The menu takes ordinary sushi ingredients and pairs them in creative ways to deliver amazing experiences and superb flavors. We tried the Crazy Ninja Roll, the Thriller Roll (see my photo), the Good Times Roll and the California Roll and none were disappointing. The chicken teriyaki from the hibachi was also amazing! The atmosphere is great, the music is great and the staff were very accommodating and pleasant and answered all of our questions. The Sake Sunrise drink (sake and OJ) was amazing, as well! 5 star experience!"], ["Jill T.", "have been here 3 times for lunch, when passing through town.  LOVE the lettuce wraps- service is always prompt and friendly; food is delicious!  Can hardly wait to get back here!!  Very comfortable atmosphere- not stereotypically Asian."], ["Reyna S.", "Good food. Fast lunch if you tell them when you get there. Friendly staff."], ["Yvette A.", "Now I can't speak for the Hibachi side but the Sushi Bar side was the equivalent of what one might expect from a Chinese Food    Buffet sushi station. The seafood seemed to be at room temp and not well put together. The rolls were falling apart before I could dip them in soy sauce. The presentation seemed like an afterthought. Every roll was just sliced and slapped on a plate with a side of wasabi and shredded carrots as a garnish. They could learn a lot from Sakura Bana! As far as service... That too left a lot to be desired. I started with a glass of water and never had an offer to place my drink order. My water was never filled back up despite the fact that it was pretty empty when my Sushi arrived. The waitress spilled a glass of tea on the floor and it took a while before anyone came by to clean it up. Minutes later, a hostess and a bus boy came over with 6 of their table napkins, tossed them on the floor and commenced to dry the floor by stepping on the napkins and rubbing vigorously with their dirty shoes to dry the floor. I'm not sure what's more disturbing... The fact that there's no mop in this restaurant or the fact that at some point those six red napkins will one day make their way back to one of these tables!"], ["Tasha S.", "Loud, crazy, good drinks, not as good as Osaka in the hibachi department but still tasty. Sushi looked awesome!"], ["Baron M.", "I'm so torn on a 3 or a 4 star review... I think I'll go with four. The food was good, actually, really good. A bit different flavor profile than other places around here. For instance, the \"pink sauce\" was slightly different (in a good way) as was the salad dressing. The presentation is what really sent this over the top. The chef was a real expert entertainer. He was doing some tricks that really had my kids excited. The only thing that hurt was the price. We were here for lunch and walked out paying almost 50 bucks! Not what I was expecting, but again, the food and the show were probably worth it."], ["William W.", "I will say that this place is CRAZY - crazy good!  they take great pride in the sushi and really try to make you feel at home and want you to come back.  Very knowlegable and top quality sushi."]], "Mikado Japanese Express": [["Amanda C.", "Tonight was my first experience with Mikado. The restaurant was extremely clean and inviting, although I didn't stay and eat I would love to come back and sit down. The amount of food was very satisfactory given the price. I've visited other O.E.C style places that give less food for the same price Mikado is offering. My bag weighed at least five pounds when I left there!As for taste: I got the shrimp lo-mein and Mikado has the tastiest noodles and the shrimp actually tasted like shrimp. I grew up on the gulf coast and though it didn't have that \"Gulf\" flavor I love, it was very tasty and the texture was pleasing. I do have to mention the rice that came with the meal. It wasn't very flavorful, or maybe not AS flavorful as the noodles themselves. I loved that it came with bits of scrambled eggs, that's something I enjoy in my hibachi rice. While it tasted like regular white rice with a beef broth flavor, it wasn't off-putting and was still delicious.Overall, I was highly satisfied with the pleasant atmosphere and prompt and accommodating service. The staff was friendly and went out of their way to get my food to me in a decent amount of time. I will absolutely be coming back and bringing friends when we need some quick food before we hit the movies because the location is in a prime location to all the places I like to visit!"], ["Barry E.", "First, let's get the qualifiers out of the way. 1. I would have given this 4 stars but since the AC is too small for the type of Business and a review in 2013 complained of the AC not working I knocked them to 3 stars. 2. You have to remember this is fast food type of Japanese and not Bonsai, Ichiban or your choice of nicer sit down with waiters places. When we approached the counter, I thought the woman behind the counter was going to be rude but she turns out to be nice. I noticed this place earned an \"A\" from the health department!! YAY!! We ordered and the food was out in maybe 10 minutes tops. The sushi was very good and I would say it was better than OEC and I didn't have to deal with the Angry Asian Woman at the Brandon OEC. The shrimp fried rice was good and the Tiger Roll and Hunting Rolls were GREAT! This was my first visit and I already want to go back. If you go to eat in be sure to sit near a fan otherwise, Be sure to order online and go pick it up to go and remember (Stealing this from Edward R from AZ's review) my rating factors in the low prices and what they specialize in."], ["Edward R.", "My rating factors in the low prices and what they specialize in. If you're looking for Benihana quality, this is not for you. This is more fast food style Tepanyaki made in the kitchen rather than in front of you. I ordered the Hibachi Steak to go. It came with a healthy serving of fried rice and some vegetables. The flavor and sauce were good. The food was slightly greasy, but not overly greasy. The steak was cooked properly, but they could have cut it less leaving larger pieces of meat.I would definitely go here again for a quick bite."], ["Pete R.", "Stopped in here to grab some food to go after a long day driving. Wanted something to take back to my room at the Courtyard and watch some Sunday night football. They have a very large and varied menu. Mostly Chinese so don't let the Mikado Japanese name fool you. The young lady at the counter that took my order had all the personality of a cardboard box. I felt like she thought she was doing me a favor. The orange chicken was delicious, hot and plentiful. I also ordered steamed Gyoza which was good as well. The only thing that puzzled me was the inclusion of 2 small containers of a strange mayonnaise based sauce. I wasn't sure what to do with it. If I had a salad it would have went great on that but I did not. The portion was large for the orange chicken but it only includes 3 small florets of broccoli. I would have liked to see more. All in all it was worth the price paid."], ["Alaina T.", "I like hibachi and sushi roll 。I get takeout sushi and hibachi ever weekend . Loved it！great service！！！"], ["Mike F.", "The has to be the worst Japanese restaurant in the area. It probably is the worst I've ever been to in the U.S..  I'd give it less than a star if possible.  It's not even a Japanese restaurant.  The menu names are Japanese food names, but no food in that restaurant is even close to Japanese food.  The sushi is the prepackaged items you would buy at a local supermarket.  When I saw the prices I should have known, but thought it couldn't be that bad and it was close to my hotel.  Total waste of a meal.  I couldn't even finish half of what they gave me.  I should have stuck to my guns."], ["Samuel C.", "No flavor at all in food, big disappointment. Service was mediocre, they were not busy and let the phone ring for about 5 minutes till it stopped ringing, Someone called again a few minutes later, again unanswered... Strange if you ask me. Wonton soup was undercooked as well"], ["Sherri W.", "Everything tasted the same in my chef's special lo mein. There was shrimp, beef, and chicken, but the taste of over-hot oil permeated it all and the flavor of each meat and vegetable were indistinguishable. You get what you pay for, and it filled me up. I won't try this chain again."], ["Raphael C.", "Sorry this review was for the wrong restaurant my bad.Holy Ghost where do I begin with this place. Yes the hibachi chefs do an alright job with throwing their knives around. And I bet the food would have been alright had they not had absolutely zero standards for hygeine and cleanliness.About 5 minutes into our meal, the hibachi chef decided to take out a dirty wet rag and wash the grill while we were in the middle of eating. This washing of the grill while guests are eating seemed to have been the standard operating procedure at this three ring circus of a place. I I gave the chef a dirty look hinting at the fact that washing the grill with a dirty rag while we were eating was completely unnecessary but he didn't get the hint.Not only does seeing a filthy wet disgusting rag make you lose your appetite, you are also left with the impression that they cleaned the grill with the same disgusting rag before they cooked your food on it. Also where did they get the soapy water? It looked black.Conclusion: gross."], ["Christian And Angela C.", "You get what you pay for. This is cheap, mediocre sushi. Chick who answers the phone not so much on the English but much nicer in person. Open later than most in a town this small (10pm)."], ["Terrance B.", "Great Hibachi to go, in order out frequently from here order is always spot on! Friendly cashier too!"], ["A M.", "Nothing to recommend here, very rude service, i was the only customer in the place and it still took nearly 30 minutes to get the food.  Definitely not worth the time or money."], ["Scott K.", "I love this place. If you enjoy Japanese Hibachi but don't have time to sit and wait for the whole show, then this place is perfect. Great food and Service. They even have a window so you can still watch you food as its being prepared. And its ran by Japanese folks, very nice people."], ["Tina B.", "The food is good but they need an a/c tech in there to fix the air. Too hot to eat in that place."]], "Fuji Japanese Sushi & Grill": [["Susan L.", "Had a late lunch here. Was greeted at the door and sat at a table immediately. Ordered the fried calamari appetizer which was tasty and well fried. Husband ordered tuna roll and spider roll sushi which were excellent. Squid salad was nice also, full of flavors and fresh. I had the teriyaki steak which was cooked perfectly (med) that also came with veggies, steamed rice, miso soup, and salad. Restaurant was spotless, even the bathrooms. Service was friendly and attentive. We had a really good experience eating here."], ["K. R.", "Great Hibachi Steak lunch...fast & pleasant service...great option when you're not in the mood to fight a buffet crowd..."], ["Kim C.", "The food is great and have really great service and there lunch prices are good and I love  the fact that they deliver there food in the evenings"], ["Tara J.", "Not from here- but if I was I would never go here again. We sat down at 7:30 on a Friday night with 5 other tables of people in the restaurant all of which waited for at least 2 hours for their food. At 9:15, we still did not have our three sushi rolls and were told it would be 10-15 more minutes at least because the to go orders take priority over dine in guests. We eventually left. Talked to management that saw nothing wrong with how they were doing business. Would not recommend this restaurant to my worst enemy. DO NOT GO."], ["Susan S.", "A bit difficult to find. The sign is small. The decor is very nice. The sushi was perfect, fresh and reasonably priced. Would recommend this to anyone. Service was excellent."], ["Jacquelyn H.", "Sushi is inventive and delicious. Unfortunately hibachi rice wasn't on the same level as the sushi.Service was friendly but painfully slow. I ordered online and it took just short of 45 minutes. Even with the slow service I will go back for sushi."], ["Karsten H.", "I order from here quite often. Definitely great food. I order online, pick up a few minutes later, and chow down when I get home. There is plenty of food that you won't go hungry. I usually eat half for supper and take the rest for lunch. Their customer service is great as well. If you are looking for some asian food for a good price that is good, this is the place."], ["Jen H.", "This is one of my favorite places to eat in Jackson. It is not super fancy, or much to look at, but the food and the service are superb!  I love the sushi - the hits include the crispy crab roll and the hot fried dynamite roll - as well as the other entrees. I don't know why, but I'm also addicted to their clear soup; it's much heartier than what you get at many other Japanese restaurants. This place is great for dining in, take out, or delivery. If you live nearby and haven't tried it yet - do it!"], ["Scott R.", "Awesome!"], ["Jacqueline J.", "Great food, great service. My family and I were visiting from out-of-town, and had a taste for sushi. Although it's a little hard to find, it has a really nice look both outside and inside. The staff was very friendly and accommodating. I had the \"Spicy Crunchy Crab Roll\" and \"Spicy Crunchy Shrimp Roll\" and both were... YUM-MY! I can't wait to go back."], ["Tawnie D.", "This place has a GREAT lunch menu!!! You can pick certain sushi types of up to  2-3 orders of sushi (each order comes with 6 rolls of sushi) for 10 dollars!  It also includes salad and miso soup! The service there is great! They are very friendly and take care of you very well... the food is is good also! they have Haibachi and bento boxes for their lunch menu also! I've been craving to go back since my last visit there!"]], "Tokyo Express": [["Popa D.", "My favorite to-go hibachi spot. The food is always fresh and hot and the service is good. Fast orders!"], ["Gary T.", "I was pleasantly surprised by this restaurant. The food was great with large portions. The California rolls were very tight and fresh. I don't know what the pink sauce was that was out on the tables, but tried it anyways. Was good, but food was better without it."], ["Lauryn B.", "First time there, rude service, inaccurate menu descriptions, the scallop roll is mainly fake crab; couldn't even tell if there was scallop in it.  I asked the waitress if it was the correct roll and she said yes, there is scallop in it but scallop is very expensive.  Then she smiled and walked away.  If I wanted a spicy crab roll, I would order a spicy crab roll.  I won't be back.  I can get better quality at Nygoya for about the same price."], ["Anna W.", "good sushi. reasonable price. very fast. I get the avocado rolls- so good!"], ["Charley C.", "Nice rice and freshly cooked chicken and simple steamed carrots. a little bit plain, but all very edible. Although they do dinner, I would call it a to go lunch place and everything is served in Styrofoam."], ["Stephanie M.", "There was a buy one get one free coupon and we tried them out. Love it! For the money the hibachi is quite lovely. After lunch time you have to get the DINNER hibachi which comes with salad. My hubbie is major fan of the salad dressing.  The carrots are simple but very edible. It all comes in styrofoam. All very good. Its fast & yes you can call it in before you come. They have high chairs & its quiet."], ["Kate W.", "Super fast service, really affordable. Love the hibachi!"], ["Duan C.", "I concur with everything Herm said! lol!!!!!!!!"], ["Baron M.", "The hibachi here is OK for the money. They give you a lot of food, for a reasonable price. They have fast service. When I go here, which is very nice as I can call on my way and they will have it ready by the time I arrive, I'm not expecting Kyoto. Yet, even then, sometimes I am quite surprised at the quality I end up with when I open the box. I say that I am sometimes surprised as this is one of the more inconsistent places I have gone. There are times when everything is nearly perfect, yet there have been times I have been tempted to take it back. For what it is, sushi and hibachi on the run (granted I haven't actually had the sushi), it could be much worse!"]], "Nagoya Japanese Sushi Bar & Hibachi": [["Julie W.", "We ate here at least once a week from the time it opened.  The service is great.  The food is wonderful.  Just moved to FL and it is the only thing I miss from there!  We have taken friends and business associates there and they always love it."], ["Coral E.", "We had great service and a delicious dinner here last night!  After a warm greeting and just a 10 minute wait (usually unheard of at a hibachi restaurant), we enjoyed delicious food and great service.  My boyfriend had the choose two combo with steak and scallops.  The steak was perfectly cooked and he said the scallops were delicious (I don't like scallops, but these were huge and did look yummy).  I got the \"sharing plate\" which is a full serving of rice and veggies and half of the meat the other person orders.  Plenty of food and half the price for a share plate!"], ["Jeff P.", "For someone who's an avid Sushi enthusiast this was a slap in the face. The service was below average .. Almost felt like a Chinese restaurant and the taste was below avg.. I got the sashimi platter and it was just meh.. The fish didn't taste fresh which was a very BIG red flagThis place seems to be better for hibachi kinda food .. So if ur in the mood for sushi .. Not the right place ."], ["Charlot R.", "This is a favorite stop when I come to Madison/Ridgeland to shop or see a movie.  The sushi is average-above average.  My favorite is the Rainbow roll.  Having gluten sensitivities, I forego the Miso soup and all rolls with crab stick or fried seafood or soy sauce based sauces.  I also bring my Tamari since I can't eat the soy sauce.  The portions have gotten smaller so that prices have not increased."]], "Sushi Village": [["Pete F.", "One of our favorite lunch spots. With their all you can eat buffet for under $15, it's a sushi lovers dream. The quality is pretty good, but by no means the best in Jackson. What they lack in quality can easily be made up in quantity, especially since their buffet has items from both the kitchen and the sushi bar. Our go to items are the miso soup, seaweed salad, and four or five rolls to split. Overall, it's certainly worth a visit. One other tip: if you go during dinner they're prices are higher, but they also include more items from the kitchen and higher quality rolls. Check out the Kamikaze and Green Lady rolls!"], ["Kristin B.", "In the past, I've had a reasonable experience at this restaurant. Their order system is pretty straight forward and service isn't fast, but wasn't slow either. More recently though, I've received service so bad that I will never return.We came as a large group in a slow time of day, around 3 or 4 in the afternoon. Despite the low number of tables filled, the waitress only gave some of us drinks and waited an hour to come back for the last drink orders.THEN, after being there for an hour, we were informed (not rudely, but not clearly or politely) that we must all order off one menu ticket, and that our food would come out on the same plates. I have NEVER had this policy enforced (or explained anywhere in the restaurant) with a similar sized group in the past. We opted to pay for our drinks (those of us that even got a single glass) and leave at this point. The man at the register was confused on why were were leaving and only had drink tickets to pay, so he seemed to have missed on how long we'd waited without getting to order. The waitress laughed as we cashed out though, the final nail in my group's decision to never return.I will also point out that the table beside us, with three less occupants, did not have this enforced, got their orders taken, and ate before our waitress came back. Perhaps it was a poor decision on our part to let this go on as long as it did before we left.Seeing past reviews, it's happened to others before.I'd leave one star, but they get two for good service in the past.The other place we ate at afterwards gets five stars for prompt, polite service and delicious food."], ["Gary J.", "You are better off with Sushi from a gas-station.Your iPhone's GPS will guide you to a nondescript \"Sushi Village,\" sign on the front of a rather modern shopping center.   This may be an ominously accurate name.  Many of your local sushi joints attempt to evoke feelings and a tone of decadence with nouns such as \"palace.\"  They inevitably have the gaudy signs and artificial looking side paneling.  (Author's question: do those banker pricks who finance these expansions go to the place and snicker at the larger-than-life decorations?)  (Author's answer to his own question: Probably not in view of how these literal and figurative fat cats will finance anything as quick as they will snatch up that last crab claw).  \"Sushi Village\" is just that.  It is a mere war-torn and vanquished village--or more historically appropriate--a refugee camp.  This is especially true in view of its competitors' ostentatious names such as,  \"Sushi palace, \" \"Sushi Chef,\" \"Sushi Planes,\" \"Sushi Trains,\" and \"Sushi Automobiles.\"  As Americans, we have the proclivity to pull for the mom and pop underdogs, albeit local diners or Rudy.  However, this purported \"Sushi Village\" turns that American ideal on its head.   The village lost me when they seated 7 and provided one menu.  Yes, 1 menu.  Even worse, they carelessly provided an ink pen (a very cheap one) rather than a pencil.  How did this place not anticipate that parties of 2 or more may be prone to changing their minds?  After 30 minutes of all 7 people agreeing what we would order, the menu looked like the ledger of a back-alley bookie.  Besides that, it forced us to all choose a leader who took command of the 1 menu and record all of our wishy-washy requests.  Part of the wishy-washiness came from the menu's arrogant lack of pictures.  One would think an under-dog refugee camp wouldn't be so arrogant.Speaking of arrogance, the staff moved like a south Louisiana swamp.  Slow, sloppy, boggy. They like to see you beg for spicy mayo, water, etc.  They do not care about you.  We will not mention the sushi here (anti-climactic I know) because it wasn't worth it.  Would you want me to regale you with images pathetic, white-riced abominations organized in no certain order one a single platter?  Apparently in refugee camps, groups of seven or more eat off of the same plate.  \"Sushi Village\" may have acted a little too much like a village on this aspect and less like a \"palace\" that they so long to be. As we all huddled around the sushi platter and grabbed disgusting little slices of fish-death, I felt like I was in a POW camp more than even a refugee camp."], ["Jennie B.", "For an all you can eat sushi place and the price I guess I get what I expect.  The service is ok. I'm not sure my servers understand me, but they took ok care of me. The food came out fast. The portions were small, the fish thinly sliced and not chilled as it should be raw. If you need a sushi fix, this place is ok. If you want great sushi then I recommend finding another spot like crazy ninja or Sakura bana to enjoy."], ["Cindy T.", "We love this little place for a quick lunch. I think it's around $12 for unlimited menu at lunch.  They seat you with a paper menu to fill out what you want and  you can choose as much as you want for one flat price.  Sushi rolls, tempura, salad, soup and appetizers - a pretty good variety.  The food is good, especially for the price and they service is prompt and friendly.  One tip is when you order and place a \"1\" beside something  you actually get one (i.e. ONE cheese wonton, ONE egg roll) so if you want more than one order the # you want."], ["Jonna B.", "First, let me start by saying I love that Sushi Village is open late. At 8:05, the craving for sushi hit and this was one of the few places open. I got the $9.99 menu, compared to the $16.99 (which has more options). Everything I ordered was delicious! The portions of sushi are small, but since it's all you can eat - just order more! I also tried the cheese wonton and it was also really good, so order from the kitchen if you're able! It's pretty good for a cheap date night, and it's a very relaxed and casual atmosphere."], ["Linell B.", "The sushi was very good, especially for the price paid. My party of three ate lunch for only $30. The sushi is made as you order it, so you don't have to worry about it sitting out in a buffet for god knows how long until you happen to pick it up. The selection is good and everything we ordered was great."], ["Rachel P.", "Okay, let me start this by saying-- Sushi Village is not a place you want to go to for a fancy night or if you're trying to impress someone. If what you're trying to do is eat a TON of pretty decent sushi for a crazy low price, then Sushi Village is your place. Located in a somewhat random little shopping center up in Ridgeland (right near the county line), this place is nothing special from the outside. From the inside, it doesn't seem incredibly special either, to be honest. It's clean, usually quiet, and I've never seen it even close to crowded. The servers are friendly enough, though not particularly attentive. The sushi itself is pretty decent. It's for sure not the best sushi in Jackson (that goes to Edo, in my opinion) but considering how low their prices are, it's better than you'd expect. I'd say it's better than the sushi you can get at Kroger or Whole Foods. The rolls are small. The non-sushi options are particularly enjoyable, though. They have a large selection of tempura and the seaweed salad is delicious. I always go for some cheese wontons too, but that's because I have an addiction to cheese wontons. Here's why I keep coming back to Sushi Village though-- at lunch, you can eat ALL YOU WANT for $8 and at dinner it's only $13. You heard me right-- all you can eat for less than $15. See what I mean about crazy low prices? Some words of wisdom, though: Know your limits. The first time my friends and I came here, we got a little too hype on the whole \"All You Can Eat\" idea and misinterpreted it as a challenge to \"Eat It All.\" We left with stomach pains, for sure. As long as you respect yourself (which is a lesson often learned the hard way), you'll have a great time at Sushi Village. Get a ton of sushi for a super low price and get some tempura, seaweed salad, miso soup, etc while you're at it. Everything on the menu, besides the sushi rolls, comes in orders of one so if you want multiple cheese wontons, for example, make sure you denote on the menu that you hand to your server how many you'd like. You can keep ordering, though, if you found you haven't had enough after your first round. The food comes out super quick, but this is probably because there's rarely a ton of people in the joint. Like I said, this place isn't particularly fancy or upscale but if what you're looking for is an insane bargain on some sushi (and who isn't?), hit up the Sushi Village!"], ["Krista D.", "Everything we order is delicious! Freshly made sushi rolls. Chicken yaki udon is the best!! Will continue to return :)"], ["Tricia W.", "It's a good place. The lunch is cheap and is good, but the service is bad. They hate seeing people walk in, always have bad attitudes, and will never walk to you until you beg... I've been here so many times because it is good but I just really despise their service"], ["Wilson J.", "Dinner menu with AYCE sushi and sashimi. This is my roommates favorite place to eat. 16.99 for dinner and 9.99 for lunch without sashimi and some specialty rolls. The sushi is pretty good. Before today always ordered sashimi like crazy but today they told us that there is a limit on sashimi. Anyways great place for sushi, will be back for sure. Please get the green tea and red bean ice cream with fried banana for desert amazing."], ["Duan C.", "Went to Mac's one day and noticed this place opened up. Decided to go for the wife's birthday. Staff was very pleasant and helpful. This is not a buffet - so don't expect to see a line of food warmers. However it is all you can eat Sushi, teriyaki, soup, egg rolls on the lunch menu. On the dinner menu there are some additional items you can get, yaki soba, other noodle soups and dishes.The all you can eat lunch is $8 and the all your can eat dinner is $13. For a germ-a-phobe that hate buffets - this is the idea set up, because your food is fixed to order - if you want more, just let them know. We had the typical rolls, dynamite, Philly, California, spicy tuna - it was o.k. - the seafood wasn't as fresh as you would hope, but still edible. But at $8 what can you complain about? We were plenty full. We had the super sushi platter, some chicken teriyaki, fried rice, egg rolls, miso soup, clear soup, and sweet tea all for $20 for two people - that is a good bargain. In total from the waitress taking our order to receiving the order it was probably a 10 minute wait, give or take. So not bad on turnaround time. I can only give three stars because of the overall quality of the grub, but for cheap eats and on a budget - you really can't beat the bargain and on decent lunch. We enjoyed and will return."], ["Tina B.", "If you want good hibachi, go to a hibachi restaurant. Their hibachi is mediocre. This place is all about the sushi. The diamond roll is amazing! We also love their egg rolls and wontons. They have an all-you-can-eat \"buffet\" price, which saves you money, especially if you plan to eat a good bit of sushi. You must try it out if you're ever in the area."], ["Coral E.", "The boyfriend and I tried Sushi Village last night and had a pretty good experience.  The staff was very friendly, but we didn't get the whole buffet and two menus thing.  However, we weren't the only ones confused - explaining it or asking if people are first time customers would be good.  The white sheets are from ordering from the \"buffet\" and the normal looking menu is what they call \"on the side\" or just like ordering at a normal restaurant - just pay for what you order.  The dinner buffet is now $15.99 FYI, but seems worth it.  We tried the cheese wontons - gotta have good cheese wontons for me to come back and they were. The Miso soup was good, but the mushroom soup just tasted like mushrooms in water. Our sushi was very good for the price and all good came out quickly.  We definitely recommend trying it!"], ["Derek H.", "If sushi village was a cereal it would be CORN FLAKES. Not bad but not good either.  Everything was plain without much flavor. You are able to keep ordering rolls under one price as long as you can eat them."], ["Megan B.", "Awesome sushi! A good price for all you can eat. Very clean place, friendly staff, fast service and always has a table open. Loved it."], ["J O.", "The is on par with Ichiban's buffet in Flowood, but not as good as a traditional sushi restaurant. If you have 3 or more guests, be prepared to spend 1.5 - 2 hours for lunch. I think this is part of their \"all you can eat\" strategy by making you wait excessively long between service. Most people can't take a lunch that long but it's still a good value at 9$ a person. Dinner is not worth 16$ a person. The sashimi is razor thin. You can do much better somewhere like Edo where you get a complete sushi and sashimi dinner for 21$ or less a person. If the service was faster, this would be a 4 star review."], ["Rachel L.", "My family of 4 came there on Saturday evening for the buffet. We ordered sashimi which is stated in the front window as unlimited. Once we sat down and ordered the first round of sashimi and sushi, they brought it out and told us \"You can only order 20 more pieces. Sashimi is limited to 20 piece per person.\" If you see their sashimi, they started cutting them in very small pieces. When we asked them how come they didn't inform us before we sat down, they responded \"if everyone order sashimi we will be out of products for other customers.\" That is your problem, not mine. Don't be misleading on your ad. They started speaking to each other in Chinese and giving us dirty looks. At the end of our meal we ordered ice cream and they didn't even bother bringing it out. Never coming back."], ["Vickie R.", "Sushi village is the best!"], ["Elizabeth P.", "My husband and I love to eat at Sushi Village!!! We love the fact that it is not a traditional buffet that you do not know how long it has been sitting there or who has done what to it!! We love to sit at the sushi bar and watch them make all the food!!! We go at least 3-4 times a month and have never had a bad experience! Great bang for your buck!!! Pity more people haven't found this place yet!!!"], ["Scott C.", "Great sushi place for lunch. The sushi is mostly traditional. You won't find giant, fancy rolls on the all you can eat. I prefer to stick to the basics anyway. Great shumai. Good tempura. The miso is a little weak, I will admit. Way better than a buffet experience. Once again, great for lunch. Don't know that I would recommend for dinner."], ["Brittany S.", "$15.99 for dinner.   Everything we ate was great!  I was really surprised, considering how inexpensive it was.  All you can eat - made to order"], ["Thuy T.", "love this place! It's so cheap considering for what you can get especially sushi and sashimi."], ["Darius M.", "Slowly becoming one of my favorite places... Prices are beyond reasonable and service has been spot on for me every time. Take out is also a great option!"], ["Amy B.", "Ate there last week. I like that you can order all you can eat for only $15 per person. However, there were some items that were well below par. We ordered salads and asked if they came with Miso dressing. The waiter seemed confused by my question and stated that \"pink sauce\" came on the salad. This \"pink sauce\" turned out to be something close to French dressing. Two people at my table ordered from the Hibachi menu and got exactly the same sauce to dip their meat in. The Cream Cheese WonTons were good to me but would have been better as cream Cheese/Crab Won Tons. A fellow diner at my table did not care for them. The Spring Rolls were very good. The Vegetable Tempura was only sweet potatoes, which were good and broccoli, which as not so good. The Nigiri sushi was good, as were the rolls, especially the Shrimp and Avocado Hand Roll. The Sashimi as also good, as was the chicken terriyaki. One fellow diner ordered Scallops off of the Hibachi menu, which consisted of only 5 small scallops. The rest was vegetables. The Hibachi Salmon was good. The Fried Rice and Miso Soup (especially the latter) were awful. For dessert, I ordered the Fried Banana. Besides the banana not being a variety that I had ever had (not a regular banana, not a plantain), it was served on a bed of whipped cream. It would have been better (maybe) if something had been added for flavor but, then again, the banana had a really strange consistency. There are a couple of other sushi/Japanese restaurants in the area that are, in my opinion, much better so I probably will not be visiting Sushi Village again."], ["Mike M.", "I eat here once a week.  let me say that I have eaten sushi all across the world.  There is no question that Sushi Village has some seriously high quality fish.  There is no better value for sushi, dare I say, in the entire state of Mississippi. $8.99 per buffet, except its really not a buffet because its made fresh to order. I've not had a single bad experience here period! anybody who grades this restaurant lower than 4 stars are those select few who simply cannot be satisfied."], ["Angie G.", "\"Order all you want, but eat all you order.\" Went here yesterday and loved it! All you can eat sushi made to order for $13.99. Dinner all you can eat menu and lunch all you can eat are a little different, but most items are the same. You can also order appetizers and desserts as well as non-sushi items. They have a regular menu if you do not want the all you can eat. We ordered mostly sushi and specialty rolls. Everything was very fresh. We also tried the veggie tempura and fried banana. My new favorite sushi place! Also, you can find a 10% off coupon on the back of Kroger receipts. ***Edit: The all you can eat prices have gone up to $15.99 at dinner. Still a great deal though!"], ["Ian D.", "Ridgeland's first all you can eat Sushi bar and it's cheap! Lunch runs $8 for all you can eat sushi and it's prepared fresh and to order. Not the place to go if you are in a rush, but the quality is solid and the variety is pretty standard. They also have tempura and noodles for those less adventurous types. Totally worth the trip, we'll be back!!"], ["Matthew C.", "UPDATE: day three of my sushi eating saga continues. I retract my previous review and present the public with new information. As i once again ordered a vast aray of sushi and fixins, i realized that i bit off more than i could chew and my life was spinning out of control. The kind oriental woman was nice enough to bring me a sweat towel. But even that could not help offset the horrendous situation beginning to ensue itself inside my lower intestinal tract.  I tried as hastily as humanly possible to finish what was no longer the enjoyable experienced i had anticipated. As i rushed to my vehicle and climbed in the car i felt an abrupt movement in my body. I didnt think things could get worse. As I leaned over to pass gas in hopes of leviating my stomach pain i felt It. I had no more control over the bottom half of my body. An xplosion occurred in the rear of my pants. I felt the poop erupt past the corridor that is my belt and past my waistline up into the back of my shirt. This was turning into one of the worst sushi eating experiences of my life. I rode all the way home covered in the kind of foulness that could have only come from the depths of hell. After an hour or two of my 12 year old son hosing me off in the driveway i have made it to the computer to express to you today's horrific experience. Will update tomorrow after i give sushi village another try!!"]], "Red Samurai": [["Kayla C.", "Red Samurai was great. I've been waiting to try it because I have friends who say it's great and go several times a week. It was exactly ass I expected- and OEC type Japanese. Not too Fancy. Styrofoam plates, as expected. However, they had the mother of all sushis- a sushi burrito. I didn't even scan the rest of the menu after that. I knew what my belly was destined for. Mine was tuna. So good. I ate it all. So pleased. Very full. Prices are good."], ["Leslie W.", "I decided to try Red Samurai based on previous Yelp reviews. I had sushi only and ordered the Sushi pizza and salmon lovers roll. So the main thing that jumped out at me was that my avocado pieces were brown. I get that avocados oxidize, but for presentation purposes restaurants can't be dishing out brown avocado. I should also note that I arrived after 8pm, so maybe that's an end of day issue. The sushi pizza is a cool concept and enough food for one. Plus it comes with a California roll. The salmon lovers roll was OK, but I didn't think the mango was balanced well. I am going back. I look forward to trying the hibachi. Oh, and I wish they put chopsticks in my carryout bag!"], ["Katherine B.", "I love this place. There was only 1 guy working on a Friday night, and he was killing it. Answering the phone, bussing tables and taking orders at the counter, and he was still super friendly. The food was also great. 12 bucks all you can eat sushi, and it comes with a soup and salad. I was SO full."], ["Sara C.", "First time eating here. Ordered to go. Very friendly. Best Hibachi \"to go\" I've had yet! Very good! Very clean environment. Even received a free drink for signing up for their club. No complaints this way :-)"], ["Dontae D.", "The food here is awesome. My family loves it. This place is clean, employees are friendly and the service is quick."], ["Max P.", "Sushi burritos. Well priced hibachi. Freaky fast service. It's got everything you need!!"], ["Matt H.", "Good place for a quick hibachi meal.This place falls in between OEC and a Hibachi restaurant that cooks at the table in front of you.The vegetables include broccoli which is a nice touch.The pink sauce is good, but they no longer have the hot pepper paste which is a must have item for me. The closest they have is a bottle of Sriracha.Prices are reasonable."]], "Little Saigon Sandwiches And Sushi": [["Drew H.", "Great Asian food on the spillway. Don't be in a hurry. Greatness takes time and it's only 1 cook in the kitchen. Grab a beer sit back and wait. The best Pho in greater Jackson!"], ["Jim B.", "Try and figure this one out. A sushi restaurant that doesn't have sushi. I've called several times to order sushi which is in the online menu but the lady always says \"we have no sushi\". Go figure. I guess I go to Osaka"], ["Sean H.", "I travel extensively throughout the U.S. And generally eat pho at least once a week. Had the #66 Pho Dac Biet (combination) with no tripe. It was good but the broth was missing the depth of flavor that most pho broths have so that was a bit disappointing. Good value for lunch and hopefully the broth \"issue\" was just a fluke."], ["Jose Reynaldo R.", "This is an amazing place for pho and Vietnamese sandwiches. Genuine, fresh and priced reasonably. A must try!"], ["Angie N.", "It is hard to come by good Pho here in Mississippi.  I am sure their other dishes like the rice or vermicelli noodle are better but the Pho here is a NO GO!  I was warned that their Pho is not good here but I had to try for myself just to know.  I thought well maybe it isn't as bad as what others have said.  It lacked flavor with a hint of sweetness.  I had to dose my soup with Nuoc Mam (fish sauce) to make it flavorful.  For those that do not know much about Pho, as a note, the best tasting pho is one where you add little to no extra sauces or flavoring.  Coming from California I may have had the privilege of really good food.  Even the $2.99 bowl of pho tastes better in Cali.Service wise was fine, our server was nice."], ["Byron G.", "What a great place, No 67 steak pho was awesome! The sandwiches sounded great, gonna do those next visit, wife had veggi pho, said it was great, it is a hole in the wall and we loved"], ["T L.", "This is a hidden gem!  The Pho #67, pork vermicelli #80, & combination #91 are the three top items on the menu. I've tried all,  and they are delicious!  The house made chili garlic sauce is also a must try. The garlic pepper sauce is even sold in to go containers. It has about the same spice as Sriracha, but much more flavor. If you are having noodles,  the powdered pepper is also excellent. The son-in-law that runs the front is extremely friendly. This is an unassuming place that has authentic Vietnamese food,  with some of the recipes dating over 50 years old."], ["Emily S.", "Great Pho, great prices, friendly staff.  I have gotten it to go a lot and they package everything very well so I can put my Pho together to my liking when I get home."], ["Ruby T.", "pretty good！I love Pho Dac Biet noodle soup so much！！I give it 4 stars because i don't like the sweet tea they gave to me lol"], ["Corey J.", "Great atmosphere , food is excellent , and outstanding staff.  Great prices and conversation. Highly recommend !!!!!!"], ["Jerry T.", "I picked up some spring rolls and the pork vermicelli,  and it took me on a ride to Flavortown.The spring rolls have both chicken and shrimp and are satisfyingly girthy. The sauce served with them is traditional and well executed.The pork vermicelli... I just... I just can't even... The pork was cooked perfectly and was seasoned with what seemed to be bits of magic. It balanced very well with the fresh vegetables and broth, to which I pounded with some garlic chili sauce. I was in heaven for about 10 minutes.  I would have eaten it faster,  but at several times I was so overcome with joy that I silently wept while cradling my head in my hands.Not only was the food ridiculously good,  but the staff was super cool and showed their appreciation. Home-girl in the kitchen does it right. She nailed it out the park. Also,  the appetizer and entree was only $13. I was appalled they would charge me so little,  so I tipped them heavily in spite. I've only been here once when passing through,  but the one time experience was great.  It might not be much to look at,  yet the food, service,  and price makes a must."], ["Alison L.", "The sandwiches are still amazing. I got spring rolls this time, and the ingredients were very fresh. I definitely recommend trying the green tea. I'm not really a green tea fan, but it was very light and subtly sweet. Worth checking out if you're in the area."], ["Duan C.", "It's been a while since I went here for lunch, but I am just getting to writing my review. Positives - staff is really nice, helpful and nice clean location. Negatives - I am partial to the portions I receive from Saigon. The food didn't taste bad. I would say their Pho uses a tad bit more fish sauce and other ingredient's - but I just prefer Saigon's Pho better. There are some other things on their menu I would like to try in the future. The only reason why I will return, is due to the A-1 service I received on my first visit. All in all, I am glad that I gave them a try."], ["B P.", "We love Vietnamese food, and we are lucky this one is in the hometown!  This is our go-to when we want Vietnamese, and this is the only restaurant we recommend.  The food has been so good!  Our favorites are the beef pho (different ones--the flank steak, the brisket, etc.), fried rice dishes, spring rolls, pork chop plate, pork vermicelli with and without egg rolls.  The pork is wonderful---it has a slight sweet and chargrilled taste.  The spring rolls are made fresh once you order them, and if you're not allergic to peanuts, get the peanut sauce to dip it in.  The fried rice can come as simple as you want it (with egg) or with meats and/or veggies.  Some of the dishes like the pork chop plate and pork vermicelli bowls are offered with the fish sauce, which is a nice complimentary sauce.  With the pork being slightly sweet and chargrilled, the fish sauce is slightly sweet but not so sweet to overwhelm your dish!Service is always good.  The family works hard, and you can see the older lady running back and forth from the kitchen to the freezers to get out the ingredients to cook with. (which also means fresh!) Cleanliness is big for us, and every time we've gone, it's been clean!!Check it out---take yourself, your friends, your family.  If you love Vietnamese food, you'll return."], ["Grace P.", "I've visited Little Saigon three times and I'm hooked. Every meal is better than the last. The beef pho is incredibly tasty. The broth is delightful, meat fresh, and the SAUCES. The sauces are so flavorful and have the perfect amount of heat. I even save their sauces to use in homemade dishes. In addition to the beef pho, I've ordered the grilled pork and egg roll vermicelli. This dish is my favorite so far. The egg rolls and grilled pork are so tasty that I'm left wanting more. The fish sauce is the perfect accompaniment. Do yourself (and your tastebuds) a favor and stop by this hidden gem. The customer service and food make Little Saigon one of my favorite restaurants. You'll be back for more!"], ["Linda N.", "Came with a group, ordered the pork vermicelli. Was so good. The grilled pork with rice is even better! Worth trying and returning to"], ["Kara D.", "This place was delicious!! I have been craving Pho since moving to Jackson and I was not disappointed when I finally found this spot. Also the staff was super nice, the guy waiting on my was so helpful and sweet"], ["Donald S.", "I really enjoy food that is close to being authentic as possible especially when it's a non-American food I find this place to be just that I eat there quite often and I really enjoy what I am served. This is a family owned establishment and the owners are very good people I find them highly friendly. It was possible to give more stars I would."], ["Brandon J.", "I've been frequenting this place for the past few months now, and I have to say... It's the best Vietnamese restaurant I've been to!! The older lady who cooks all the meals in the kitchen must use nothing but fresh ingredients, because everything I've ever ordered has been phenomenal. You can tell she puts some love into her cooking and not just cooking to get by. I suggest the number 80, grilled pork vermicelli if you haven't eaten much Vietnamese, or the combination pho. Also, recently they starting serving certain Chinese meals. I had the General Tso's chicken today, and it was better than any Chinese restaurant I've ever been to... The chicken was so tender!!"], ["Kevin A.", "This is an authentic Vietnamese, family owned business. They have added a few Chinese/Japanese items to the menu to accommodate those unfamiliar with Vietnamese. I had the Yakisoba with chicken and it was excellent. My wife had vermicelli noodles with chicken and loved it. The owner also let us try an 18 hour broth that was delicious. I usually skip the soup at most Asian places for lack of taste. Friendly, laid back and quaint. (Note: currently not operation their sushi bar)."], ["Gabe M.", "We have been passing by this place everyday since it opened and boy have we been missing out on this gem minutes from our house.   I didn't realize I liked Vietnamese food but this place was fantastic. Our waiter was unbelievably helpful and made it feel as if we were invited into someone's home. We might go back tomorrow we enjoyed it so much. I will gladly give this place my money. #6starsifIcould"], ["John M.", "My new favorite restaurant! The PHO is out of this world good and the service is even better. A great family run restaurant that makes you feel like you are another member  of their family.  Can't wait to go back again!"], ["Angela P.", "It was a different flavor in Jackson.  I really enjoyed myself.  The crab ragoons were delish, followed by a unique take on General Tso's which I would put right up there with the best I've ever had.  We had a lovely 12-18 hour broth soup and tried the chicken with vermicelli that popped up in other reviews.  This was my first introduction to This kind of food, and although the menu was a bit intimidating at first, the food that came to the table highlighted ingredients I (reassuringly) find at home.  The service was impeccable.  The server appeared to be the owner, and he took pride in explaining the vision and the preparation behind the menu.  He was quick to provide answers to every question I had in such a friendly manner.  I felt like a guest in his home, not a stranger off the street.  All in all, it was a great experience.  I look forward to my next visit and have already picked out the sandwich I'm going to try."], ["Chad S.", "So far I've had the chicken vermicelli noodle, pork sandwich, & chicken pho soup. The food talks to the soul somehow here. The owners are real folks. Service is with a smile and hustle but it can be slow since it's real food. Prices are not expensive so go out and try some of this great food."], ["Ryno H.", "Very happy to see another vietnamese place. This one offers the infamous banh mi. I had the pho here and it's good. Seems more homemade. As for banh mi, it lacks that punch, but is not bad, will be back"], ["Dee K.", "It's a small restaurant run by a Vietnamese lady and her son in law. Great place- smells a bit too much but the food is great. Dinner and take home for $25 is just great. Chicken vermicelli with pork Egg Rolls was just amazing. I could have given 5 stars but the night we went Sushi bar was closed."], ["Jason B.", "Everything was good everyone was very nice."], ["Lisa S.", "WOOHOOO!!  A Good addition to Jackson area.  I have been several times myself and also with 2 friends from LA and another from SC.   They both enjoyed as much as I did.  The Bahn Mi is excellent.  The roasted pork is most flavorful with a nice dry rub, not unlike the red chinese roasted pork.   I prefer the grilled pork and have yet to try the sausage.  The chicken was thigh meat and pretty boring. Their fried rice is delightful! A milder taste than Thai and Not greasy at all like chinese.  I drive just to get rice as a take out.  The sandwich is $5 and is very filling, ~. 8\". I usually eat off the rice 2 or 3 times. I have not tried the sushi, it reads quite interesting and appears to be most popular, i am just more of a purist with sushi. They do close btween meals.    Great place to grab for a picnic on reservoir.  Attentive service - great casual or to go place. I hope to see more customers."], ["Shannon N.", "When desperate for a Vietnamese sandwich, this would be a place to go in the Jackson metro area. There is a small variety of Vietnamese sandwiches here which are at an astonishing high price, starts at $4, which is quite high for a sandwich which usually averages $2.75 around the country. The menu, in general, is priced very high for the quality that anyone will receive.There are a few creative sushi rolls (the Brian roll, the Louis roll, etc), but true sushi enthusiasts will find this menu lacking in choices. However, they do have other offerings such as pho, and other varietal Vietnamese options. The quality is enough to offput my pho cravings for a few months, but not enough to make me want to come back on a regular basis for it. My own personal input on the pho is there is a huge lack of spices (cinnamon, cloves, etc), the broth is not clear but quite cloudy, oily on top,  and very small in portion for the price. I don't believe I should need to season my broth with extra fish sauce.The staff is plenty, but not well run. Our waitres was short and a bit impatient with us, fully letting us know she is not familiar with the menu. Will I be returning here? No, thanksFor a restaurant in Mississippi in the month of June, turning on the air conditioning would be nice too"], ["Dave C.", "Bun bi thit yuong (or something like that- can't remember the spelling) is to die for. Vermicelli noodles with bits of roasted pork, lettuce, cilantro and scallion; my new favorite thing!"], ["D F.", "Try #80! it's Grilled Pork and Egg Rolls on Vermicelli, also chicken available. Big  menu, lots of variety. Nice family owned restaurant!"], ["Marty S.", "Go!! I had the vermicelli pork bowl with egg roll on top, and my date had the pork sandwich. Both were awesome, and plenty of food. Order the crab rangoons because they're fresh, crispy and lots of flavor. This is a family-owned restaurant, and apparently they cook pretty much everything from scratch--and you can tell, because of how high quality the food is. Very happy with this discovery, and will def be back!"], ["Sonya W.", "Best sandwiches in Mississippi."]]}