{"Blue Koi": [["Ruth N.", "Sometimes I trust yelp enough to pick my meal based off of reviews. I saw raving reviews for the firebird chicken, so I opted for the firebird duck and asked for noodles. It's $2 extra for noodles, so I thought, \"This better be worth it!\" When the waiter brought out the bowl, my nose was greeted with a slightly sweet but tangy smell, and to my pleasant surprise, it was slathered with satay bbq sauce. The noodles are delicious, but the duck and green onions could afford to be a little more succulent and less overcooked. I ordered the bubble tea, expecting semi-decent boba for Kansas City, but maybe I have to try other places before I judge. Imo, the boba was undercooked, too chewy, with the middle having a different texture than the outside. The chai latte was good though, would have been just as tasty without the boba. All in all, the firebird flavor was very nicely done, execution mehh.."], ["Matt T.", "Popped in here without knowing anything about the place, turned out to be a good choice. The server was very helpful in giving suggestions and even proposed the servings were big enough to share but we wanted to sample a couple of dishes. We started with pan fried dumplings with awesome sauce which were very tasty. Our entrees were the Chinese pot roast in noodle soup, which had very tender meat and a nice ginger flavor which did not overwhelm the dish, and almond chicken and asparagus with noodles. The almond chicken was sort of the star of the entire experience in fact if we ever come back, which I would be all for, it would be hard not to order this dish again."], ["Audrey J.", "Family and I visited KC earlier this year and we stopped by Blue Koi after seeing it on DDD in our hotel room while in KC! We were not disappointed at all. Very tasty food. We obviously had to wait, but it was not too terribly long. I ordered a strawberry bubble tea, and got it cold. I personally, didn't love it. My mom enjoyed it though. So that's good. It's obviously a popular thing here. Maybe I would need to try it again. I don't know. Before we ordered our meals we ordered the Crispy Tofu with Awesome Sauce, and the pan-fried dumplings. For me, our appetizers were the high light of my meal. So tasty. I could drive back to KC for both of those... Mmm....... For my entree I ordered the Chinese style pot roast over the noodles. I'm glad I got it over the noodles because the noodles were so fresh and just so comforting. The pot roast itself was decent. Not as melt in my mouth as I was hoping, but it was for sure good. I think I will try something different next time. My mom got some chicken dish with asparagus, and hers was good, but not outstanding to me. And my step dad got the firebird duck. He loved it apparently. I didn't try it. My favorite part of this experience was the appetizer and the service, for sure. After watching the show we saw that the restaurant is owned by two very vibrant sisters! The sister who made the tofu with awesome sauce on DDD was at the restaurant and came over to talk to us! She was so sweet, and I really loved seeing her just after watching her on tv! It was pretty cool. She is exactly how she was on the show, which I loved.I'm looking forward to coming back again when I'm in KC to try more of the dishes here!"], ["Kristi A.", "After being a regular customer of this establishment and its other location for years, I had the absolute worst experience possible dining at the 39th Street location recently, and won't be returning to Blue Koi in the future. Our friends from South Dakota came down for their first visit to KC and our friend is vegetarian, so we thought what better place to take them than Blue Koi, home of the most delicious veggie dumplings ever, right?! So it was Saturday night and we knew it'd be busy. We had a party of seven and expected to wait. We arrived and were told it'd be around an hour wait. Okay, no problem. We'll grab a beer at the very crowded bar. So each person in our party orders one drink. Upon finishing this drink, my husband and his friend, attempted to order another beer, and were told by the gentleman behind the bar that he could no longer serve them. My husband inquired as to why they were not being served, and the guy informed him that they'd had enough and that my husband's friend looked sleepy. Meanwhile, there was an incredibly intoxicated older gentleman on the other side of us at the bar that was disruptive and intrusive to all patrons at the bar, and he was being served. We were not loud or disruptive, and had each had one beverage at this establishment. My husband is British, as is his friend, and tried to explain to the barman that he could understand why he thought they were intoxicated, because it probably sounded to him like they were slurring and/or mumbling when they speak quickly to each other. The barman did not care for any explanation and informed us he was the owner, which we later found was not true. We decided to go ahead and be seated, because we'd waited over an hour and were all starving. After being seated at our table, our waitress took drink orders from other people in our party, and then took our food order. Twenty minutes later, the food came out and we still had not one single drink on our table. Our server then informs us that our entire table had been cut off, and she was not allowed to serve us. Well, thank you kindly for waiting until our food came out to tell us. At this point, everyone at our table is very upset, and we ate our entire meal in silence. It was absolutely the worst dinner I've had out at any restaurant anywhere, and to top it off they were out of veggie dumplings. Our friend got no dinner and was too angry to order after being treated so poorly at the bar. After later inquiring with the server about why we'd been cut off, we found out that the barman was not the owner and not even the manager, so we requested to speak with the manager. She found a million things to do before coming over to our table. She finally came over and we explained what an awful experience we'd just had in her restaurant, and she clearly didn't know what to say. It took forever before we could even get an apology and for her to acknowledge that she was not aware of the entire situation before cutting off our entire table. She just knew what she'd been told by the jerk behind the bar. We were offered free dessert as compensation for our ruined dinner, to which no one was up for after painfully sitting there in silence through our meal.This experience ruined what was meant to be a fun night out with friends. We were appalled at being treated the way that we were in this establishment and will not be going back. I would be embarrassed for anyone to be treated the way we were and the response by the restaurant management was less than satisfactory. Absolutely horrendous customer service. We should have walked out, but as a table of former service industry employees, we didn't want to short our server, who was not at fault in this situation."], ["Joseph T.", "I went with high expectations and a friend who is Taiwanese. The decor is trendy as were many of the other diners that evening. Service was very good. However, the food itself was a mixed bag. We tried several different dumplings, all were excellent.  The tofu appetizer was boring and the dipping sauce seemed bottled. I had the ants on trees, based on other reviewers and was disappointed. Plenty spicy, which I like, but the \"ants\" were drowning in oil. I've had this dish in many restaurants and, when done well, the meat is slightly crisped and overall should be no more greasy than a good Pad Thai.  The noodles had decent bite but the abundance of oil was off-putting. My friend didn't get a main course and instead kept ordering more dumplings. She was pretty happy with all of those and I liked them as well. Maybe it was just an off night."], ["Daniela G.", "I have legit never had anything I didn't love here!  It's always our go to noodles place and soon we'll be able to walk to it!  My absolute favorite dish is the Firebird, my father-in-law ordered it with noodles the last time we went and it was a total game changer!  Ants on a Tree and their lettuce wraps are awesome as well.  Don't forget an order of dumplings for the table either.  Mmmmm my mouth is watering just thinking about their, might have to make it out there for dinner this week!"], ["Tommee C.", "The food here at the Blue Point is very delicious I was very surprised my sister brought me here. the service is Excellence"], ["Mark E.", "restaurant has a great vibe to it, everyone there seems happy all the time. We go there about once a month because its 30 minutes away but we always enjoy our time. Personal favs are the tofu bites in awesomesauce(never like tofu before I ate here, and don't like it anywhere else) and the vegetarian or pork dumplings are AMAZING!!!!"], ["Keiko F.", "Went here at 3:30 pm so there wasn't many customers. Ordered Ginger Basil Chicken and Chicken Curry. Noodles with Ginger Basil Chicken were undercooked and clumping together. There was absolutely no flavor whatsoever, and this was just chicken and noodles. That's it. No veggies or anything.The Chicken Curry was only slightly better. It was supposed to have some heat to it but there was no spice at all. The curry was liquidy and running all over the place. Button mushrooms were a cheap cop out to try and elevate the dish. We said something to the waiter about the Ginger Basil Chicken and he took it off the check and said he would bring complimentary chicken dumplings out. After being told they would be \"right out\" and waiting an additional 15 mins, we finally paid our bill and left. Definitely not a \"return again\" place."], ["Theresa W.", "Everything was awesome except the cocktails. Amazing homemade noodles. The dumplings were are awesome and I recommend the duck wrap!"], ["Kim O.", "Best Asian food I've ever eaten!!'  Homemade noodles in the basil chicken were the bomb!!!  Pan fried pork dumplings and the awesome sauce are a must have!"], ["Yembur A.", "All my friends know that I'm obsessed with Blue Koi. I took my very picky mother here for her birthday and even she loved it. And kudos to them for really knowing how to cook tofu! The black bean tofu is my fave! \"Ants on a tree\" is also very cool to try - I've never seen it being served anywhere else. The menu is great for vegetarians and meat-lovers alike. It is a bit pricey, but the portions are large so I usually have plenty of leftovers.And yes, the awesome sauce is as awesome as everyone says."], ["Bruce C.", "Ok, firstly, my meal was pretty good. We split an order of Spicy Chili Wontons (Vegetarian, wife forced of course ) and it was tasty. Nice building heat. Paired it with a New Belgium 1554 Black Lager (nice). For dinner I had the Chicken Basil lettuce wrap appetizer and the wife had the Vegan Delight soup. Lettuce wraps were very tasty (nicely sweet) however Wife's soup was more chore than delight. Everything in the soup had to be removed and cut down from 3 to 4 inches in length to enjoy with a spoon. Not adventurous either as the waitress had described. Overall, service was good, quality was good atmosphere was good. I will return."], ["Jordan A.", "Liked the friendly ambiance of the restaurant. I went in for lunch on a Thursday by myself because I has been craving some dumplings and after scrolling through yelp I chose this over Po's right down the street.I started off with the fried tofu with awesome sauce because it was pretty busy and I had a feeling my actual meal would take a while (I was spot on with this). Although it was busy and my order took a little bit of time my server was very attentive. He even helped a couple next to me by recommending some of his preferred gluten-free options. As for the food, the fried tofu was okay. The true star of the starter was the awesome sauce. It was really tasty. I basically drenched the rather bland tofu in the sauce because it was that flavorful. For my main meal I ordered the Shanghai Wonton Soup with meat. It was honestly one of the best Asian meals I think I have ever eaten. There were wonton dumplings stuffed with a pork mixture floating along side freshly made noodles, fresh cilantro, green onions, and bean sprouts. I added a bit of sriracha too. This dish was so warm and delicious. It had a nice heat and excellent flavors which surprised me because the soup had a clear broth. I definitely underestimated it! The dumplings were soft and slightly sweet due to the pork mixture. The noodles were tender and fun to try to eat with chop sticks! Also, this portion size was HUGE. I could barely eat half. Prices were decent especially for the size and quality of the food. I would definitely recommend this friendly and tasty option to anyone in the area! 4 stars - Keep it up Blue Koi!"], ["Joe B.", "Had the Fire chicken, great meal! Hot tea was great. The server was attentive but not sickening.  Will go back."], ["Viviane L.", "I would like to give them 4.5 stars! We had vegan dumplings, veggie wraps, braised pork noodle, and eggplant pocket. The veggie wrap is too sweet, but doesn't taste bad. The rest of the food taste amazing!! I'm from Taiwan and their food taste A LOT like Taiwanese food.  Another amazing thing is that we accidentally order only vegetarian dishes and we didn't realize it until we finished the meal :D we didn't know vegetarian food can be this delicious!!Though I won't recommend their bubble tea,  if you are a bubble tea drinker. Their bubble tea is not authentic."], ["Monica C.", "l lived in KC from 2002 to 2008 and would eat here on an almost weekly basis. I now dream of their tofu with black bean sauce, vegetarian dumplings, and tofu with awesome sauce. My husband even had their food flown in for me when he proposed. Any dish you try will be amazing, but I highly recommend their tofu dishes. Granted, I'm vegetarian, but my husband is a carnivore and he even loves their tofu. Planning to visit some friends in KC soon and this will be #1 on my restaurant list."], ["Michele F.", "The group started with shrimp dumplings, duck wrap and china moon. All were awesome!I ordered the chicken curry over rice noodles, awesome!!!!Friends ordered the following:--shrimp w black bean sauce (spicy and delish)--ginger basil chicken (awesome)--chicken zen mix, great flavor!Bottom line, everything was wonderful and i doubt anything would be anything less than wonderful!"], ["Jay R.", "I just love EVERYTHING about this restaurant. Good food and nice people working there. This is not a regular Chinese restaurant, they are the best one."], ["Alix C.", "The service is so horrible that I am not willing to try to food. Prior to arriving to Blue Koi, I called and asked if they offered Thai Tea, the person on the opposite line assured that they did serve Thai tea. Upon my arrival, the waitress (which happened to be the person I spoke with), asked what she could do for me. I told her that I had just called about ordering Thai tea, she replied with, \"I thought you said Chai tea, and this is a Chinese restaurant, so we don't have Thai tea.\" After the uncultured reply, she proceeded to recommend that I go to Vietnam Cafe if I wanted Thai tea. Now if we are following her pitiful mentality, if Vietnam Cafe is a Vietnamese restaurant--why would they sell Thai tea. The five minute encounter with this woman permanently discouraged me from this establishment."]], "Lucky Dragon Chinese Restaurant": [["Mandy B.", "Chinese food can be so hit or miss & I am quite picky when it comes to my food being good, super hot & just how I want it. Well this place delivers (literally) on that every time! They get the food to my place so fast it's crazy & it's so hot it's like they just walked out of the kitchen! I always get the crab rangoon & egg drop soup--love them both! For entrees it's chicken or combo lo mein, general, orange or princess chicken--whatever I get is always awesome & enough that I can have it for leftovers more than one night! I can't say enough about how nice they are when you call in an order, I almost always get the same gentleman & he's the nicest guy ever, he always makes me smile when I call because he's consistently nice every time & you know they have to be busy with other customers & orders coming in! This place is def one of the things I will miss when I leave KC--super hot good Chinese food with great employees & delivery! Thumbs up!!"], ["Reed N.", "I had their little buffet yesterday for lunch. It was not too bad as these places go. They had a chicken dish with jalapenos I liked. They had a pork dish and potatoes that used obviously canned black pepper that I did not like. Does anyone REALLY use canned/pre-ground pepper anymore??? Anyway, not much else to sing about here. It is barely 3 stars and good for a quick stop."], ["Stephanie R.", "Ordered delivery tonight to my hotel. They told me 45-50 minutes but they got here in only 15 minutes!! That scores big bonus points in my book. The crab rangoons were typical, no seasoning coming through, and a little chewy. I ordered the orange beef and quickly remembered why I usually stick with chicken from chinese takeout restaurants. I would not recommend that particular entree from here again. They did batter the beef and included a few pieces of broccoli - but I found the meat almost a bit gummy and tough. I would order from here again in the future, but would try the chicken instead of their beef."], ["Jeremy W.", "This is still my go to place for Chinese even though I relocated to the Northland.  I have yet to find a better place and they do deliver to us on 64th st.  They are still very quick and reasonably priced and by far the best quality for the area that I have had.  When I moved out of my downtown condo after 3 years in KC up to the Northland I had over 30 menus from them in my junk drawer and we stopped keeping them after a year or so, so I can definitely say I have there food a few times."], ["Britt K.", "Ewwww. So, I guess I have high expectations, although I shouldn't for the price. The building screams basic unassuming \"Chinese resturant\", which it is. It's a little dark inside, probably so you can't entirely identify wether your nawing on chicken or road kill. I don't live to far from this place and decided to give it a shot and being mislead by other yelp reviews I decided to order carryout and give it a shot. Again, ewwwww. Our food was tepid at best and CLEARLY had been scooped into styrofoam containers from the buffet, for sure the attraction to HS students in the area who have open lunch. In fact that HAS to be why the place is still open, it is CERTAINLY not due to tasty menu items.  I got basic things like egg rolls, chicken with broccoli and chicken friend rice, to be safe. I mean, if you mess those up...ehhh. Yeah, the egg rolls tasted like death, the hint of sugar in them was unappealing especially with a hot mustard aftertaste. The \"brown sauce\" on the chicken was horrible. I say on the chicken bc they neglected to douse any on the broccoli, which wasn't entirely cooked. My mom vetoed the fried rice before it even got to the plate. It was SO disappointing. Don't do this to yourself. I went hungry that night and wasted like 20 bucks in the process."], ["Linda P.", "Food was 2.5 Stars and since Yelp doesn't allow half stars, the reason for 2 star rating and half star reduction is the to go packaging experience. This is typical Chinese food options with big portions.  We ordered General Tsao chicken, orange chicken, happy family, and beef and brocolli togo.  I was a little disappointed in the happy family because I felt it was more veggies than all the seafood & meat described.  Considering we bought over $30 they threw in some meat skewers and donut desert things.  (Or maybe because we were new in the neighborhood and they wanted to sell us).  I wish though the packaging was better that way I wouldn't be so disappointed. We ordered to go and had to take it back to a house that had no napkins, waiting for running water, and the $35 plus worth of food bags had no napkins in the bag, silly me should've known better this may be a grab your own napkin restaurant.  The sauce from all the boxes was oozing out making the bag and utensils and back of boxes all sticky.  Kind of annoyed me that I couldn't enjoy my meal and that myself and others had to endure a meal so messy it was not what we signed up for.  I think if the business was going to pack the stuff so poorly, they should at least provide napkins or at least ask us if we needed any if it's not in the bag already with the utensils.  Food taste normal, but I rather go back for lunch buffet than buying what we did since the buffet was only $5.94 after tax."], ["Dave P.", "I have only gotten delivery. It's fast, food is pretty consistent and not bad. The only complaint I have is, each time I ask for hot mustard. Still haven't gotten hot mustard. But I did get twelve packs each of soy sauce and duck sauce. I'm thinking they have no idea what hot mustard is. Have started ordering from China Fun in Liberty instead. They ALWAYS bring the hot mustard. The food is comparable, slightly cheaper and a smaller minimum on orders for delivery."], ["Denise C.", "This is one of the worst delivery chinese places I have ever had. First of all, we got the crab rangoon (which was super greasy and had only cream cheese in it with no crab). The main meals were very average at best and they didn't even bring any fortune cookies. I suggest to go pick up Chinese at a good place. Not worth it."], ["Joshua A.", "We just recently moved to North Kansas City and the Lucky Dragon is just two blocks south of our new place.  I'm always a little wary of trying a new chinese place because of the extreme variance in quality of food.We ended up trying this place late at night, about an hour before they closed.  We weren't expecting a lot being so late, but was pleasantly surprised.  Their buffet isn't available at all hours so we had to order from the menu.  My husband ordered the orange beef and i had the chicken chop suey.  The service was pretty good for being so late and no one had that general attitude that most servers get near closing.  the food arrived in a timely fashion and was amazing!  The flavors were spot on and none too salty like a lot of chinese food.  We ended up with a lot of leftovers, their portions are pretty good for the price.  All in all, we will be eating there again."], ["Justin And Elizabeth L.", "Finding a reliable Chinese food restaurant is always a pain when you move; you can't tell the good from the bad until you've tried it. While we've only ever had take-out and delivery from Lucky Dragon, their food is consistently good and delivery is quick and reliable. They're just over the river in North KC, but they happily deliver to Downtown Kansas City.The staff and delivery personnel are friendly and want your business. The menu is traditional American-Chinese fare, including a delicious orange chicken and classic Mongolian beef. They use nice, big, juicy slices of white meat chicken in their dishes...not the sinewy cubes of mystery meat you see at some Chinese places. Protein entrees come with white rice. The lo mein isn't the most delicious we've ever had, but it is exactly what you expect when you order lo mein.On orders over $35 (we think it's 35, it might be 30 or 40), they give you free orders of \"chicken on a stick\" and Chinese donuts. It's reliable, consistent Chinese comfort food.We sometimes pick up our food when we're running errands in the Northland, so we've seen the interior. It's clean, but old, run down, and not the kind of place where I'd want to sit down and have a meal...and you get the impression they don't expect many dine-in patrons.If you're looking for a nice, sit-down Chinese dining experience, there are many other fine places to go (Bo Ling's, PF Chang's). If you're looking for delicious, quality takeout or delivery in the Northland or Downtown, we'd definitely recommend Lucky Dragon."], ["Holly M.", "Shouldn't a restaurant that wants to stay in business uphold the quality and service it started out with ? I really used to love Lucky Dragon, but after continuous epic failures, I'm done. The food here has been on a steady decline for the last 6 months. And how do I justify that statement ? When a place makes a convalescing person feel worse than they did before eating. Literally. Blarg. I can't even write anymore....I'm getting queasy from the memory........."], ["Joe U.", "I was really happy to stumble into this place for lunch while in from out of town! The lunch buffet was just what I was looking for - and the food quality was much more than what I'd expect when paying only $5.50 a person. This place seems pretty popular among the lunch crowd, so the selection was replaced with fresh items frequently. Definitely worth checking out!"], ["Farheen Q.", "Delivery: Took almost 1.5hrs to deliver to downtown. In their defense, there was a huge storm 2 days ago and the side roads still aren't fully plowed. Ordered Kung Pao chicken with fried rice and one order spring rolls. Got Kung Pao chicken with white rice, 2 orders of spring rolls, and an order of Crab Rangoon. I don't know if they got the order wrong or added the extra stuff for the late delivery, but it was a little odd (and a little good, I was having a craving for Crab Rangoon after I ordered).Food: Kung Pao Chicken was less than mediocre. Essentially little cubes of carrots and frozen peas cooked in a brown sauce with small shreds of chicken and way too many giant cubes of tofu. I'm surprised at the other reviewer mentioning \"sinewy pieces of mystery meat,\" because contrary to his/her experience, that's EXACTLY how I would describe the chicken in this \"dish.\" The crab rangoon was the standard for American Chinese fare. Price: $13 for kung pao chicken with fried rice and one order spring rolls. No delivery charge, minimum delivery $10. They deliver downtown.Cutting this place a little slack, maybe it was a bad/busy night...I will order from them again to give them one more chance -- but not the Kung Pao Chicken."]], "Genghis Khan Mongolian Barbeque": [["Rachel B.", "I ordered take out from here recently. I loved the restaurant cute place to go. Food was decent."], ["S.E. A.", "I have loved this place for many years, love the taste the grill gives the stir fry, but I cannot recommend the beef or shrimp from the buffet. The sausage is delicious."], ["Daniel H.", "This place was pretty busy at 5:30pm and I was surprised so many were eating at that time.  All five of us at the table decided to go for the Dinner BBQ bar ($13) where it was pretty much all you can eat.  There was a dessert bar, an appetizer bar, and of course the dinner bar.  I got a couple of crab rangoons and egg rolls before heading to the dinner bar.  The dinner bar was where you can create your own dishes and they will cook it for you.If I cooked, then I'd be a terrible cook.  I made a couple of dishes for myself and they didn't taste as good as I thought.  Of course, it was my fault because I was the one creating it with a bunch of ingredients that I thought would go well together.  I'm not sure if this place would be good for vegetarians because all of food were cooked where another person's dish was cooked.Our waitress was nice and the other staff were too.  Good stuff if you make it correct!"], ["Rikki J.", "My favorite restaurant in KC. Service is always impeccable and the food is amazing. My family has been going for years. I have to go every time I come to visit"], ["Faith B.", "I ended up here accidentally when my other dining plans were thwarted by a 3-hour wait. I hadn't had any Mongolian barbeque since college and that was fast food.This place has a nice, warm, earthy world decor vibe. I really liked all the over-sized photos on the walls.They have a good wine and beer selection.The service was fairly good. The waiter was friendly, just a little slow. He seemed swamped and might have been the only actual server. Although, we were asked how things were about a half dozen times by various friendly people who might have been owners.BF and I both opted for the barbeque option, although they have an interesting menu here as well with lots of vegetarian options.For some reason, they write on the menu that you can't have chicken wings or crab rangoon with the veggie option. I'm not sure why. I wouldn't want wings, but really? Rangoon aren't that expensive. Luckily BF ordered the meat option and gave me one of his.At any rate, there were two tables of options, one with meat, seafood and noodles, one with vegetables and tofu and then a third filled with sauces and spices and oils.You pile all your choices in a bowl and bring it to the grill to be cooked. There you could also pick up an egg to add to the mix. The chef was fast and friendly.My dish creation was quite good, although initially the choices are almost overwhelming. If you're really hungry, this is the place, because you get unlimited trips.The price also included appetizers and dessert.I liked it and will go back to Genghis Khan."], ["Hannah C.", "Really did not enjoy my visit. Made the mistake of going on a Saturday night without a reservation... Waited for an hour because we were forgotten about by the host... Because the waiting room was so crowded we were stick standing in the doorway. When we went to eat the bars of food were messy and understocked, and the sauce selection was very limited. I didn't really like what I got at all, and nor did my boyfriend. The floor standing in line was covered in food. We originally ordered \"all you can eat\", but after one dish we wanted to leave. I asked the waitress if we could switch it on the check and was only then notified that you HAVE to get the all you can eat on weekends. We got stuck paying over 30 dollars for an hour wait and one gross plate of food. Never going back."], ["Erin W.", "One of my favorite things about this place is the neighborhood and the general feel of the place.  We went in for lunch and their CO2 was out, so no pop for us, which was okay, just really could have used a pick-up.  The food choices were small, but I liked the different seafood offerings they had.  The sauces were okay, but I was hoping for a little more variety and flavor.  Even a good bbq sauce option would've been great.  I liked how they had a soup station and crab rangoon, I've not seen that from other mongolian places."], ["Ben M.", "This place is so Awe-to-the-Some!!! Loved the atmosphere, the food was great, (I did the all you can eat), the cooks were super friendly! The waitstaff was more than eager to accommodate any need that we had. Definitely go during the weekday lunch hour, it was a nice steady flow of guest. I can only imagine how busy they are during the weekend! I can't wait to go again!"], ["Paulina P.", "I was kind of taken aback by the location and how small it looks from the outside. I was like \"a Mongolian bbq in that small of a space??\" even when going in you're kind of disoriented by  the large table of business cards and a curtain falling in front of the entrance to the actual restaurant. Nevertheless, I really liked their seafood; if you get all-you-can-eat you can potentially get A LOT of food, I can see how a one-trip bowl would be enough to get you full, but I wanted to try everything. They don't have much space in terms of seating so I can see how they can get full on weekends, we went on a Tuesday and there was about 6 more groups of people eating there. The seafood tastes nice, and so does the meat. It's a nice touch that they tell you how to mix the sauces, but I mostly just used soy sauce, lots of chilli paste, and sriracha. I really like the location, close to everything else on 39th St. although they are kinda lacking in parking! But that's okay. It doesn't hurt that the neighborhood has a friendly cat that comes up to you to meow hello and lets you pet him. I can't wait to go back."], ["Andrew M.", "I like this place pretty well....I live just a few blocks away so although I have been here a few times in the past several years, I don't go regularly. Part of that is because there are so many good restaurants in the area. However, as much as I hate to say it, their actual Mongolian barbecue part is only okay. The selection of meats, veggies, sauces etc. is somewhat smaller than that of their most obvious corporate competitor, but the main problem I have is that the grilling area is so small that it becomes a total clusterf*** when the restaurant is busy. I ate there yesterday and because the restaurant was full at the time I decided to order off of the menu for a change. Since it was lunch I was able to get a pretty tasty rice noodle dish with beef for a reasonable price ($8.50), and certainly cheaper than the Mongolian barbecue ($12, I think). Overall I like Genghis Khan -- my only reservations about the place are the slightly steep prices and the small barbecue grill capacity."], ["Matt E.", "I'll keep this one short but sweet.  Not a fan.We were in the 'hood trying to go to a different restaurant, but it had closed early. After some debate, we ended up here. The place is clean, but dingy and in need of an overhaul. The bathrooms weren't necessarily \"gross\", but they were, well dingy. It's just the perfect descriptor. We of course go for the Mongolian BBQ. They have a decent number of options, especially for proteins. As with any restaurant of this type, it's sort of your fault if the food isn't good, but I would have liked to have seen a few more recommended sauce recipes. They had 3, and they were all pretty boring. Plus, a good number of both sauces and vegetables were empty. The place wasn't busy and it was prime dinner hour, so I don't think that's acceptable. I now remember why it's been probably two years since I've been here. A couple of notes, however. 1) I have been told the off-menu food is amazing, some of the best in town. I haven't tried it, though, so I can't comment. Just passing along the gossip.2) My server was AWESOME. She was friendly, funny and on top of our needs. She did an excellent job. Service would get a 5 star."], ["Michelle F.", "We have been eating here forever. Love the food, atmosphere, and service. Always. This trip, for maybe the second time ever, I passed on the BBQ and instead ordered an entree, Double Delight,  from the menu. It was a great choice... Delight indeed! The veggies, shrimp and chicken were well cooked and the sauce was tangy, sweet, and spicy. It came with rice, a crab rangoon and an orange wedge. Everyone else at the table had BBQ. We all ordered soup and by the time my dining companions were coming back to the table with their BBQ, my entree was just arriving so no need to worry about timing. Can't wait to do it again!"], ["Gaby Q.", "Great atmosphere and in such a fun neighborhood. Food is always fresh and they have the best crab rangoon and hot & sour soup in KC. The cocktails I have tried are delicious. Probably one of my favorite restaurants in the area."], ["Michelle C.", "I am a huge fan of Mongolian BBQ. I like to go out to eat in groups, and this sort of restaurant is an easy way to please many types of eaters, diets, allergies, etc. The gentleman at the front who sat us was so friendly. He was very warm and inviting, and it happened to be a cold rainy day so that was a very refreshing thing to walk into. Our waitress was friendly, and very helpful. She was just enough helpful and away to not be obnoxious. I opted for the BBQ create your own bill. Loved the fact that I got soup and unlimited appetizers. I could have filled up with spring rolls before I even had a chance to get the grill. There were a couple appetizers that tasted really gross, but I was happy with the spring rolls. Not the best, but not the worse I had ever had either. I enjoyed the selection of veggies and proteins from the bbq section, and ended up with a plate that was very yummy.Here's why I can't give Genghis Khan more than 3 stars. On the menu we were given when we sat down there were 3 different prices for the bbq grill. One for vegetarian and one for meat eaters. I told her that I wanted the vegetarian grill. She said \"oh it doesn't matter its all the same price\" It was not all the same price on the menu. My vegetarian dish on the menu was $11.00. When I get my tab its $15.00. The person I was with had scallops and their bill was $17.00. An extra $2.00 for the seafood. Now if they were all the same price shouldn't their bill been the same? Not to mention the fact that my bill was $4.00 more than the menu stated. I asked, but was brushed off with some lame excuse. I really want to enjoy this place, but not cool to charge someone more than the menu states. If your prices change. Don't hand out a menu with something different on it. It isn't cool."], ["David G.", "While I'd like to review the entire menu, I always get the same thing:  The mongolian BBQ.  Unless you are from the 13th Century, you already know that a mongolian BBQ is a do-it-yourself affair in which you provide a series of ingredients and your meal is quickly sautéed on a searing hot surface (apparently in homage to Mongolian warriors who flipped over their shields to make dinner).Unlike other late-comers, this is NOT a change and has been in the KC area for decades (although they have another location by the airport).  I've been to many other Mongolian BBQs throughout the country and this one stays my favorite for a few simple reasons.First, they have a interesting mix of ingredients to throw into your stir fry such as roasted potatoes, fried tofu and a variety of mushrooms.  The pescatarians will love the variety of seafood and ominovores will enjoy the bounty from the animal kingdom.  As a snack while you wait they've got a sesame bread, crab rangoon, and hot wings.  Great combinations abound.Second, they've got less pre-made sauces and more do it yourself variety.  A series of infused oils and waters allow you to mix up your own sauce with some handy suggestions.  No \"teriyaki\" sauce but they do have soy sauce, sugar water, and wine to make your own. A handy tip is if you want such things as minced garlic or ginger go to the infused waters and scoop from the bottom of the bowl since the juicy bits fall right to the  bottom.  I'm a total ginger lover (redheads are the bomb!)Finally, in spite of the variety of animal products, they are extremely vegan and vegetarian friendly.  Anything with animal products is clearly marked (which in Asian cooking there is often hidden shrimp and oysters).  If you pick a vegetarian bowl for your stir-fry they'll be sure to use separate utensils during the stir fry process.  Very cool.  The secret menu item for vegetarians is the delicious vegan broth with large chunks of tofu and crunchy celery and bean sprouts.The atmosphere is feels very traditional, although to be fair I've never been to China, especially China of the 13th century.  The artistic black and white photographs on the wall really do make me feel like I'm right there and the hardwood floors and lanterns are very un-western and particularly unique.  Again, this isn't a chain and it isn't about being hip here but rather quality food."], ["Abbey A.", "I love the neighborhood feel of this place, but the food has just never done it for me. We live nearby and have been about a half dozen times. Nothing has been bad, but neither has it been memorable. I'd give it 3 1/2 stars if I could, but I can't in good conscience give it 4."], ["Kenna B.", "After seeing the massive crowd at the eatery we were originally headed to, my cousins and I happened into Genghis Khan.  Best. decision. ever.We were greeted by someone who I assume was the owner.  She was very kind, and I immediately knew we were in for a wonderful treat!  Our waitress was super friendly and attentive.  She had worked there for 8 years, and she said it was a great place to work.  It was our first time here, so she took a moment to explain that we could order from the menu, or just grab a bowl and fill it with meat, veggies, noodles, spices.  Once complete, you hand your creation to the men who throw it on the grill and toss it around with big sticks.  A few minutes later, you get a plate full of food to devour.  Of course, we all opted to create our own Mongolian Grill masterpiece.I'm not going to lie, my food wasn't the best.  Totally my fault though (perhaps next time I shouldn't go for the suicide option and put a little of EVERYTHING on my plate...).  It ended up being really spicy (YUM!), but I know it would have been better if I hadn't started just pouring flavors on like a crazy person.A wonderful experience from beginning to finish.  I can't wait to return - and possibly practice some self restraint when it comes to the spice cart!"], ["Jerem B.", "Walking down Bell grabbing sommething to eat before heading to the hospital I noticed this place. the smiley hostess actually came out and asked if I was looking for Genghis Khan. I wasn't but I must have looked confused :) She was so sweet I figured I'd just give it a try. I also am a huge fan of mongolian bbq style places. The ingredients and sauce selection are about the most limited I've ever seen but I've only been to chain places I believe so understandable. Most of the food was pretty great in the end though. My waitress was completely awesome, tall white girl with cool hair style tied up in double buns, neat eye makeup and very helpful. Everyone from the guy at the grill to what I imagine might have been the owner we so damn friendly. I couldn't say enough about the service. Prices are not super low but normal and worth it I'd say. I got some hot tea as well which was decent. The waitress offered to get me another tea but it was certainly not that bad but the offer was really nice. I'll definitely go back."], ["Baylie L.", "It doesn't get much better than choosing your own ingredients, down to the sauces and seasonings, and having it cooked for you. Genghis Khan is easily one of my favorite restaurants in Kansas City. Not only for it's food, but for the atmosphere, location, and service as well. Genghis Khan is located off 39th street in Kansas City's midtown area, right up the street from the Kansas University Medical Center. It is in a 100 year old building with a front and back entrance. Each time I've been there, I've entered through the front and was greeted immediately. It's open from lunch to dinner everyday but Sunday. It offers a dim-lighted atmosphere with soothing music at just the right volume. Genghis Khan is decorated with a variety of lights, photos, and Asian decor. Genghis Khan offers a wide selection of Asian entrees including beef, chicken, seafood, and vegetarian plates as well. It is very vegan and gluten-free friendly just ask your server on what is offered. I go there for the Mongolian BBQ so I can't offer any insight on specific entrees but I have no doubt they are delicious. I always order the All-You-Care-To-Eat Meat BBQ which is $13.50 for dinner and $11.00 for lunch. I don't eat seafood but they also offer an All-You-Care-To-Eat Seafood and Meat BBQ for $15 at dinner and $14.50 at lunch. The prices are well worth it for the meal. The bbq comes with the appetizer bar, dessert bar, and soup. You have the choice of either Hot and Sour soup or Egg Drop soup. The appetizer bar includes crab-rangoons, egg rolls, and chicken wings. On my most recent trip, the dessert bar included watermelon and brownie bites. Now for the best part, the Mongolian BBQ includes a wide variety of fresh vegetables, meats, seafood, noodles, eggs, and sauces/seasonings. Just grab a bowl, add whatever you'd like and take it to the cook to be cooked on the Hibachi grill. If you aren't sure on what sauces to use on your food they have a couple suggestions. You can also create a gluten-free sauce.On my latest visit, I ended up with only one plate before I was full. I started with a couple crab-ragoon dipped in the duck sauce they have available. I then got my entree which included: eggs, green and red bell peppers, green onions, white onions, diced potatoes, chicken, beef, egg noodles, and their suggested mild sauce. I'm not a huge veggie eater hints the lack of vegetables. It takes about 5 minutes to be cooked. Some people just stand around the grill and wait, others will take a seat until their meal is finished. With this type of meal, plate presentation doesn't matter. Since the food is cooked right there and put on a plate for you to grab, the temperature is always right. Genghis Khan also offers a full serviced bar and a two page drink menu. Although I am not of age, my boyfriend is. He ALWAYS gets their drink titled \"Red Dragon.\" It includes Midori, Triple Sec, rum, strawberry puree, cranberry, orange, and pineapple juices. It is presented well in a large cocktail glass with an orange on top, a cherry, and the famous drink umbrella. He absolutely loves the Red Dragon. The service is my ideal service. Our last server was a young woman with a clean appearance, which is always important. She wasn't overbearing at all. She checked on us just the right amount of times, not too much but not too little. She was quick to get anything we needed and cleaned up our table throughout our meal. We were nicely greeted at the door, taken to our seats, and soon after approached by our server ready to get our drinks.Overall, I thoroughly enjoy Genghis Khan and will continue eating here. It has the perfect atmosphere, delicious food, and great service. I easily give this place five stars."], ["Marie F.", "First impression is that it's pretty small... and pretty busy.  So, we ordered our drinks (mango juice is delightful, but be sure to get water as well) and fell in line.  The ingredient line is set up kinda cramped.  You can't reach all the ingredients from one side, so you gotta be bobbing and weaving to one side and the other.  The dessert cart is pushed against the wall and you have to maneuver around it as well.Most of the meat is thin and frozen.  I guess that's a safety feature so you aren't slopping meat juice into other meat vats.  This causes the meat to cook up all jerky like.  There is small sign toward the end of the meat section saying that seafood is an extra 3.99... it's about 2 inches wide and very easy to miss.  I wasn't down with all the items not being included on the buffet line.  Just didn't seem right. (The Krabmeat is not considered seafood so have at it.)The oils and sauces are not plentiful so you have to work on achieving a different flavor from your last dish.  A few of the sauces are mostly water (sugar water, ginger water). My first dish was swimming in sauces and I thought it was going to be a flavor explosion, but it was very bland.  Attempt two, I followed the \"Spicy\" guideline that is listed on the sneeze guard.  It was an improvement, but in no way spicy.  The hot and sour soup was top notch and the rangoons were generously filled  and quite good.  Their noodle selection was rice noodles, egg noodles and non egg noodles.  I do love noodles.  I don't know about that chicken wing thingy though.  It was part meat and part rock.  Chew carefully.  It's fun to experiment with the ingredients and sauces and you get to go back as much as you want.  You will definitely leave feeling full.  There is a huge price increase from lunch to dinner so plan accordingly. PS:  My favorite thing was the soup.PPS:  The grill line is a great place to make friends.  A captive audience, if you will."], ["Kathleen M.", "I had a very attentive server and the Mongolian bbq bit was great. However, the chicken wings, crab rangoon, and hot and sour were very salty . I have been here numerous times and I was shocked that it tasted like this, this time around."], ["Blue M.", "There are few restaurants in Kansas City that I know I can walk away from being 100% satisfied.  This is one of those places.  The Mongolian BBQ is the way to go here if you're really hungry.  So many options.  Vegan friendly options! Meaty chewy options! Everything in between the two!  So good.  I've dined here with one other person and I've dined here with groups of up to 11.  The service is great with groups big or small.  Savannah waits on us a lot and she is wonderfully efficient and kind.  Whoever may be greeting the door is always happy to see you.  And I love it--I mean LOOOOVE it--when someone will come and ask us how our meal was.  That is the #1 sign that they care about their business. Give this place a try.  Build the perfect dish for yourself, or let them do it for you!"], ["Susan N.", "Unlike the Mongolian grill downtown, this place did not make me want to puke. I only give it 3 stars because a 3.5 star rating doesn't exist but that's where I'd really like it to be.While I'm still turned off by people handling raw meats randomly, it seemed far more sanitary than the place downtown. The meats were frozen and very thinly sliced so they'd still cook properly. Major props for doing it more correctly. They also had a larger selection of meats/seafood for those that are carnivores.The veggie selection was pretty awesome and seemed fairly fresh. Ok, I was smitten by the fact that they had two different kinds of mushrooms. And yes, I may have made myself a mushrooms-mostly dish. But seriously, the veggie selection was pretty damn good.Also, I neglected to say that they give you soup beforehand. I opted for the egg drop, which I really liked. They also have appetizers lying out, including veggie rolls, crab rangoon (though I don't think there was any crab at all in there), chicken wings and scallion pancakes. The veggie rolls were delish!All in all, I wouldn't mind coming here again. While the idea of Mongolian stir-fry doesn't really make me hot in the pants, this is my favorite of all the places I've been forced to try. I also think I want to come back in winter for one of the hot-pot options. They looked amazing!"], ["Marissa H.", "My 1st time eating Mongolian BBQ...yum. The fried tofu with \"awesome sauce\" is exactly that - AWESOME! Addictive too.The mushroom & tofu hot pot was another highlight. Strands of noodles mixed with tofu & assorted mushrooms in a clear broth. I wouldn't be surprised if MSG is added (although I'm sure it's not!) but it was so darn yummy I kept eating although I was burning my mouth b/c it was still so hot from cooking! My dining companion opted for the all-you-can-eat buffet which is then cooked for you by a skilled cook on a very large, circular hot plate. Full bar. Theologian - a refreshing gin drink - was my libation of the evening."], ["Nicole B.", "Yum!  That can pretty much sum up Genghis Khan, but I'll go into more detail.  The price is reasonable for the amount of food you get.  I loaded up on as much crab rangoon that I could possibly fit on my plate.  I loved that I could put whatever I wanted in my bowl for the grill.  You can add as much meat and veggies as you want.  You can also add noodles, and you can make it as spicy or mild as you want.  I loved watching the guys cook it.Service is great as well.  Very friendly and attentive, even when they are really busy.  The owner is also very involved since she is also the hostess and bartender.  The drinks are not weak.  Genghis Khan is just has a fun, laid back, and friendly atmosphere."], ["Reed N.", "Having done a few MBBQ places before, I was right at home here. The staff was OK... the oldest one, a lady roaming the floor was the nicest of the bunch.The crab rangoon were very good. Mini spring rolls tasty. The melon was PUUUURRRRfect.The array of ingredients was VERY good. 10 proteins by my count. I like to go vegetarian at these places so I stick to the tofu. The veggies numbered around 20 with nice additions like jalapeno, cilantro, corn, zucchini, and green onion.The spicing area had 10 sauces and three recipes... mild-medium-spicy. I had all of them and they were all good. The spicy sauce was particularly tasty. Nice additions to the norm included chipotle powder, five spice powder, Mediterranean spice,  white pepper, garlic chili paste, hot chili paste, and sesame seeds.Really... much better than most [e.g. HuHot] in terms of variety and flavor."], ["John N.", "Let me start by saying I went to Genghis Khan a few years ago and left mostly unimpressed. I remember thinking my dish turned out to be unexpectedly bland, yet it cost more than I'd expected. I knew I was probably to blame for this more than anything, though. After all, at a Mongolian grill, the diner assembles his/her own bowl of ingredients. It's only the cooking that's left up to the restaurant's staff. So when my friend Andrew asked if we had a Mongolian Barbecue in Kansas City while we were trying to think of dinner ideas Saturday night, a light bulb went off in my head. It was time to return and give this place a fair shake.Located at 39th and Bell, just south of d'Bronx, I found the dining room more inviting and cozy than I remembered it. The exposed brick walls and aged hard wood floors were exceedingly cozy and inviting. The perpetual searing and steaming of meat and veggies on the flat-topped grill dispersed an invisible fog of warmth and inviting aroma that filled our chests and piqued our dormant appetites.The friendly hostess promised us our wait would be short despite a full dining room, and she was right. After allowing me just enough time to walk back outside and capture a couple photos of the front of the building, we were seated in a booth at the back of the restaurant, which probably would have been where I'd have chosen if I was given my pick from the whole place. Great spot. The window on my left looked out over the insanely busy parking lot behind the restaurant, and to my right were the rest of the diners, happy, raucously conversing and laughing. It had that sense of universal contentment throughout.In no time we were back out of our seats and loading woefully small bowls with our raw ingredients. I was slightly disappointed that so many were over-cooled and frozen, but it was better than the (health code violating) alternative of an overly warm buffet line. So just a minor infraction. Into my bowl I hurriedly piled sliced mushrooms, cabbage, jalapeno, cilantro, carrots, bean sprouts, water chestnuts and thin slices of celery. I was positively thrilled with the veggie choices on hand.On top of the veg I piled delightfully yellow egg noodles - a modest portion though my egg noodle-crazy appetite screamed at me to double, nay triple the amount I first took. On top of the noodles I added thinly sliced raw pork and delicious looking bright white squid segments from the protein selections, and if you like squid don't miss out. I loved having it in my dish.Following the recipe for a spicy sauce, I ladled into my bowl a base of liquids including, but not limited, to soy sauce, sesame oil, sugar water, ginger water, garlic and some kind of chili paste. Truthfully, I can't remember what-all was involved, but the ingredients are listed for the convenience of confused diners on the sneeze guard above the bowls. [I remembered that on my last trip, the sauce component was where I thought I had failed... my dish had turned out bland and dry, Confused by the myriad of sauce choices in front of me and not cognizant of the recipe listed literally right under my nose, I limited my selection to a single inadequate ladle of soy sauce. More experienced in Asian cooking now (\"experienced\" used lightly here), this omission of flavored liquids seems preposterous and somewhat embarrassing.]The final ingredient choice to diners after saucing is that of egg or no. I elected to add it - an essential to stir fry of any kind in my mind.Then I stood back and what the two grill masters quickly but expertly sautee my ingredients to perfection. Truly, their method of quick-searing and then spreading out the ingredients to ensure meats are in direct contact with the grill so as to cook through, is carried out with a good amount of skill. I was beyond eager to dig in when they handed my steaming bowl of flat top bbq back to me.A quick stop to the dessert and sides table in the middle of the floor for a crab rangoon and fried spring roll and then we ceased communication in lieu of face down, hog-to-trough style food inhalation. I may not have even used my fork. It's hard to remember.What I do remember is that I'd nailed the sauce and ingredients. The whole dish was fiendishly salty and spicy. The squid was nicely chewy, but not overcooked tot the point of rubberiness. The pork had picked up a lot of flavor from the sauces and packed more color and flavor than I'd expected. The water chestnuts and celery added a woody, nutty crunch I loved, almost like croutons in a lettuce salad. My noodles were incredibly fresh tasting, also chewy but rich and soft, too. Altogether, a fantastic plateful of ingredients bursting and popping off each other with flavor and texture differences that played like a fireworks show in my mouth.We'd hit the nail on the head, here. The right restaurant for the type of appetite and mood we all had at that moment in time.Price is buffet-high, but okay. Great stuff all in all."], ["Tim M.", "It's past due for me to update, since the manager contacted me and assured me all of the sauces/oils are MSG-free except two. Don't remember which two, but even if you happen to use them, you will be getting very little of it amongst the mix. Good place with obviously attentive management. I say, try it. I always leave satisfied."], ["Christina M.", "This place is amazing. My family and I always choose this particular grill because it is BY FAR the best Mongolian Grill. You definitely need to call ahead for this place though, its quite small. I have eaten at BD's Mongolian Grill, the Mongolian Grill on Main St and the location in Overland Park, none of them hold a candle to the location on Bell St. This particular location has a lot going for it. It is near the KU Med campus, is located near several other great restaurants (Blue Koi Noodles & Dumplings, Po's Dumpling Bar, Friends Sushi) and Prospero's Books is just down the street. Its location is also on a narrow, crowded residential street which means that parking can sometimes be an issue. They have a parking lot around the back of the restaurant, but it is shared with another restaurant. Your best bet for a wonderful experience is the lunch buffet. I have only gone to Genghis Khan's for dinner once and I wasn't that impressed. The lunch buffet is definitely the way to go, just try and miss the crowd!The buffet is a sprawling array of ingredients and includes meats (chicken, pork, beef), seafood (oysters, squid, crab, shrimp), vegetables (carrots, broccoli, peppers, onions, spinach, tomatoes, snow peas, zucchini, cabbage, sprouts, water chestnuts etc..), mushrooms, different kinds of noodles, and a variety of toppings (sesame seeds, peanuts, sliced almonds, etc..). ***Before you grab a bowl, however, you should know that the two colors of bowls are for different dietary requirements (vegetarian and non-vegetarian). Make sure to read the sign above the bowls so you know which one you are taking.***As you are filling your bowl, keep in mind that a lot of it will cook down. If you want a lot of greens (spinach, peppers, sprouts, onions etc..) make sure that you load up on those.  After you have your ingredients, you will move on to the sauces. They have laminated cards that guide you through fairly neutral sauce combinations (keep in mind that sesame oil is a natural laxative, so don't douse your creation in it). Depending on how much spice you can handle, there are jars you can top your ingredients with at the very end of the buffet.If you want a fried egg, there is an ice bath of eggs near the grill. Just place your egg on your plate, you don't have to crack it yourself (I have seen people do this).There is also a tip jar on the grillers counter, we normally give a tip to the last person in out group to go through the line, that way they tip for all of us. Once your food has seen the grill and you are back at your table, try the appetizers/sides that they have near the center of the room. They normally have fresh fruit, crab Rangoon, sesame breads (these are my favorite), soup (sweet & sour and egg drop). The desserts are also located here. The Rangoon's go fast, so assign someone to watch for new batches. They have some really great cocktails, I would suggest trying their pear sangria as it is AMAZING.TL;DR TIPS:-Bathroom is small and there is normally a bit of a wait for it-Make sure you read what the ingredients are before you take them-If you are allergic to nuts be careful-Call ahead for large groups-Assign one person to \"Rangoon Lookout\" as they go fast-DON'T USE TOO MUCH SESAME OIL-If you don't know what sauces to use, try a tried and true recipe on the laminated card-Check the bowls to make sure you have/don't have the vegetarian bowl"], ["Christian H.", "This is one of my wife and I's favorite place to go and eat at. The food is always great as well as the service and drinks. I always go for the Buffett grill when going there and have never ordered a dish from the menu. It's worth a trip and try!"], ["John B.", "One of my favorite spots to eat. The food is super fresh and tasty. The fake crab is awesome. The all-you-can-eat crab rangoon is worth it alone. I don't recommend for kids, though. My two and four year old didn't really eat very well but got charged as five year old and over kids. Wasn't too impressed by that.But overall the food is great. If you don't bring the kiddos than you should be pleased with the experience."], ["Lorena M.", "So a friend of mine won a $40 gift certificate to Genghis Khan and was sweet enough to take me. He had never been before so I felt like his \"tour guide\". We decided to create our own dishes and they turned out pretty good. Besides the create your own option you can also order from the menu and they also have an appetizer area with egg/spring rolls, crab rangoon and chicken wings. They also have egg drop soup and hot & sour soup. These items are all pretty standard chinese appetizers, not too special. I would really prefer if the meats that you can choose from were fresh and not frozen, it has a very unappealing look to it but it's good once cooked. Our server was a little awkward but nice and the bartender made our fancy drinks perfectly. It's a fun place to go, I love the decor and the foods ok but I can't say amazing."], ["Kackie C.", "More food than any human should logically consume in a sitting.That said, I'd never been to a place like this before. I love the idea of concocting my own Asian combo and having them cook it for me. Also, it's like buying 48 hours worth of food. You won't eat for a day afterwards, and then you have lunch and dinner for the next day in a take-out box. The server we had seemed to get a little frazzled, but we only needed a server because it was our first time there. Once you get the hang of the buffet, you're pretty good to go. I like the atmosphere, too. The lighting is nice, and I could see it being a great place to take a group of people.I'll go back the next time I'm ravenous."], ["E S.", "Definitely great, but definitely not the amazing experience that people seem to make it out to be. When I go, I prefer to order directly from the menu (portobello mushroom with jalapeño and basil! So good!) rather than mess with the Mongolian BBQ. Their lunch specials are really good, too."], ["Mandy M.", "I love this place. Whenever I'm really hungry, I always go here. The selection of veggies and meats is perfect. I like that the sauces aren't just pre-made like most mongolian bbq places.The best part is that the grill comes with crab rangoon, egg rolls, soups, chicken wings and desserts! It makes the value even better. It's pretty busy whenever I go there, and the buffet for the grill can definitely get pretty crowded. But it's worth the elbowing to get a delicious meal!"], ["Carlos D.", "Just a short drive from work, I try to frequent this place. I'm pretty sure the lady whom greeted us was the owner, as i usually see her walking around talking with customers and a smile. Its usually pretty quiet and almost always something smooth is playing in the background. Right off the bat, I'm impressed by the place. Our food came out in reasonable time and it was scrumptious. The waitress was very attentive and speedy. I definitely recommend this place for a relaxing meal with the family."], ["HisHer R.", "His: Eat here! 5 stars for me. Love to customize my bowl and the free crab rangoon. Come hungry. Hers: 3 stars on my end. If you've been to a Mongolian bbq place before then you've already been here. For a picky eater it's nice to mix your own and I enjoy getting creative with the sauces. It's fine."], ["Julie G.", "Went with some girlfriends, on a friday night. The restaurant was not that busy. Not a long wait, good service. But the parking in the area was horrible!  I went to a place in the area during the week and it was so much easier to park. But, as for this restaraunt, I left very full! I chose this place because I wanted to watch what I ate, (doing the lower carb more protein thing) and I knew I could cook and up a lot of meat and veggies! It was perfect.  Drinks came quickly if you wanted them and plenty of staff to assist you! I would definately go back!"], ["Aimee W.", "So, today we ventured out for lunch and this is where we ended up.  It is a cute restaurant on 39th street just down from KU Hospital.  We parked in the lot behind the building and walked on up.  It has high ceilings and nice brickwork inside.  Nice decor - big windows.  We sat in a booth with a lovely view of duct work and steam billowing out of the roof of the hospital.  Oh yeah :)The waiter came over right away - BONUS - and I ordered water and some steamed right.  Then we headed over to the \"appetizer/starter\" area.  I filled my bowl with fragrant and steaming hot and sour soup, a basil wing or two and crab rangoon.  I got some hot mustard and a sweet and sour dipping sauce and returned to the table.  The soup was delicious - good spice, hot and delicious.  The rangoons were typical but with the hot mustard blended with the sweet they were good.  The wings not too shabby.  Water glass was kept full which was a delight.When we finally went up to the line to fill out bowls to take to the sizzling grill, all hell had broken loose.  It was JAM PACKED.  Wall to wall people.  Ok not quite that bad but it was definitely busy.  Everyone must have been tired of holiday turkeys and stuffing and jonesing for some non-family time.  That's ok - I get it.  I filled my little bowl with an assortment of veggies, meats and sauces and went up to the grill to wait my turn.  The chefs dumped out each order and tossed expertly green broccoli, thin slices of pork and beef, and assorted other bits and pieces.  About 10 minutes later I went back to my seat with a plate of steaming deliciousness.  Sauced chicken and pork, crunchy broccoli, cabbage, spinach, cilantro, jalapenos, etc.  You can have them add an egg - I declined that pleasure.  Also available on the bar is shrimp, beef, \"crab\" and mussels.  This too I declined.  The food was delicious, the saucing options were mild, spicy and hot - with recipes for each.  You added what you want - adjusting per your requirements. After we finished eating our lunch, we promptly got our check, paid and left.  They have some little desserts that you go and get yourself - that is what we did anyway - but at that point I was so full I didn't want much really.Pros:  Attentive staff.  Nice decor, delicious food.Cons:  Takes a bit of time to get your food cooked.  Gets a little crowded and busy around the bar to get your veggies, meat, and sauces.  They ran out of crab rangoon and they never refilled the bean sprouts for the grill.  All in all it was a good experience.  I have been to Mongolian grills before and they are ok.  Their soup was really good and I enjoyed my lunch but I will say that it wasn't anything super special or unique compared to what I have had before.  okaybye."], ["melissa e.", "I really like this place. I go here on my lunch hour, and normally just get a few sides which are cheap and fill me up. I LOVE their taiwanese sesame flat bread.The service is always great, and very, very friendly!"], ["Kelly S.", "Anyone who knows me, knows that I LOVE Genghis Khan. I have been going for years (always getting the buffet) and it's one of my favorite places in the city. The food is awesome, the price is good, great service, and there is a ton of amazing photography on the walls. Two thumbs up."], ["Jerry P.", "BEWARE!! I got food poisoning from eating here. Their food is not kept in sanitary conditions! Don't eat here unless you want to get very sick for several days. You've been warned. I wish I could give them negative stars."], ["Layne E.", "I really like Genghis Khan. It's one of the best Mongolian BBQ joints I've ever been to. It's totally worth it to go for lunch. It's also easy to take kids to. They seem to enjoy making their own food. It's much less greasy than BD's or HuHot. Thank goodness."], ["Phillip G.", "I'd never tried a Mongolian BBQ before but I figured that burly mongols who cook meat with their undoubtedly large shields over an open fire on the steppes of China had to make a good meal right?  Needless to say I was excited to try this place out and it didn't disappoint. The restaurant had a great atmosphere and a good amount of comfortable seating.  Our waitress was prompt and although there were many delicious items on the menu, I was definitely there to try the grill and build my own meal. The concept was similar to a buffet and a salad bar, but instead of just grabbing food and sitting down you actually make a bowl of ingredients for the chef to cook right in front of you!  Additionally, and I think this was my favorite part, you have the opportunity to make your own sauce for your Asian inspired creation.  The hardest part was choosing how I wanted my dish to taste. They had a large variety of meats and vegetables to choose from, and literally hundreds of combinations to make your own sauce.  I went with a couple of vegetarian friends whom eat there quite frequently and are never let down so there is a meal for every diet here. They had a full service bar that I didn't try but it looked like a good selection and will have to go for drinks some other time.  Parking could get a little bit jammed, but in the location I'm not surprised.All you can eat crab rangoon and lemon tarts were icing on the cake.  This place is definitely going to be a spot I frequent."], ["Elizabeth V.", "It is always nice to choose exactly what is in your food- who can complain with that?I will say, that the dinner is a bit over priced for how busy they usually are but if you go at lunch it is a real deal.  Their selection of ingredients you can use are nicely varied and fresh.  There is also a nice assortment of appetizers like crab Rangoon and many desserts.  I also like that the meal is priced according to what you put in it- for example, if you get veggies/noodles only it is cheaper than getting a seafood/meat combo.  It is also all you can eat (like any good Mongolian BBQ place) and the staff is friendly and ready to help."], ["Courtney C.", "I LOVED this place. Found it by accident and ended up loving it and having a great time. The food was delicious and the servers were SO nice! The bartender accidentally made another table too much sangria and sent the rest to our table. I ordered from the menu and my boyfriend made his own- both were yummy!"], ["Randy H.", "Best Mongolian Grill around. What more is there to say?"], ["Vox H.", "Not the best restaurant in KC but I'm a pretty big fan.Good, fresh ingredients and a do-it-yourself ingredient bar."], ["David S.", "Maybe I'm biased. I grew up on the coasts where there is a significantly larger Mongolian population. However, the food here while good was nothing special. I did like that you can mix the ingredients in the sauce yourself, but they completely overcook the proteins and end up destroying the vegetables to the point where all you have is some nice fried rice or noodles and gloppy vegetables. The value is amazing, but I really do not believe the food is as good as others claim. The waitress though is very nice, even though I accidental knocked over a pitcher of water.  I may come back, but I wish they tried a little harder with fresher ingredients and more thought into cooking the final product."], ["Nathan N.", "Great food. Hot food. Nice service. Fresh food."], ["Jesscia E.", "Love Genghis! My sis and I come here for lunch about once a month. It's worth every penny because it's all you can eat and it's all delicious!"], ["Brooke L.", "Good Ingredients and great service for lunch or dinner. Hands down, THE best hot and sour soup ever."], ["Melisa V.", "it had been years since I had last been to Genghis Khan and, unlike many other restaurants that have been around forever, I thrilled to report it hasn't changed at all. in fact, it has, and continues to, set the bar pretty high for Mongolian BBQ.arrived around 7:00 on Friday night and was shocked it wasn't more packed than it was. everything on the menu looks good, but it's hard to get anything other than their specialty. started with hot & sour soup, which was fantastic. then had a few of the appetizers off the buffet. nothing amazing, but not horrible either.I don't how or why their Mongolian BBQ is so much better, but it must be all of the wonderful fresh veggies and the sauces. even though I really wanted to, I was just too full to get any more.plus they even have dessert! I only had enough room in my tummy for one slice of watermelon, but it was pretty good too. our server even commented about how she wished she knew how they were able to cut it so it tasted so wonderful every day.when I come back to KC, I'm definitely bringing my husband here so he can finally discover how good Mongolian BBQ is supposed to be."], ["Karen N.", "Our second wedding anniversary landed on a Tuesday and we wanted to find a place that would be somewhat \"grown up\" and also somewhere that would be able to accommodate the tastes of my three stepchildren (ages 10, 15, 17).  And though I am a huge fan of most of the \"39th Street\" restaurants, I had not been to Genghis Khan in several years. And that is shameful.  There is a large variety of meats, fish, veggies, and noodles.  The sauce recipes are delicous and easy.  And, on recommendation from a  Yelp review, I tried the crab rangoon and they were perhaps the most delicious I have ever had.  They were perfectly fried (which is probably harder than one might think) and had a perfect combo of cream cheese and actual (or at least really good imitation) crab!   The wait staff was particularly helpful and friendly, even giving my dear husband a free glass of wine because they didn't have his first choice.   The kids want to go back and we will be MORE than happy to accommodate!  Delicious!"], ["joe c.", "It's been on my top favorite 5 places to eat since i moved into the KU Med area 5 years ago.Great service, wonderful fresh ingredients and delicious Mongolian Style grill!  Can't lose with this place and the crabrangoon are amazing!good little cocktail menu too."], ["RJ B.", "I love this place!  It's cozy and way better than the chains that try to do the same thing."], ["Vanessa y.", "Love it & want more of it!! All the crab Rangoon you can eat! All the egg drop soup you can eat! All the hot and sour soup you can eat! ohhhh, but don't get too full yet. Head over to the entree course and mix your raw veggies, meat, and noodles into the bowl. Then head over to the cooks lair and watch your creation come to life. Then go back for more. Then if you can, go back again! Delicious."], ["Alberto S.", "This place is a good alternative to the chain mongolian grill chains. They let you create your own sauces which is pretty awesome. The food is cooked expertly. Everyone that is a fan of this type of cuisine should give this place a try."], ["Megan B.", "If you are a fan of sauces, you will enjoy it here. You have the option to make your own sauce, and with a little research it's worth it. Also, fresh seafood for Kansas City!!"], ["Amanda P.", "Num.  Num.  Num.I discovered Genghis Khan when my husband and I absent-mindedly attempted to eat at The Jazz on Fat Tuesday...oops!  Although we absolutely LOVE the Jazz, not getting to eat there turned out to be one of the greatest dining experiences in KC we've ever had.The waitstaff was cool and laid-back, but also very attentive.  Our waitress, knowing it was our first time there, made suggestions and chatted with us about the menu.  She did her best to make sure we enjoyed our experience there, and we did.The food is great.  The atmosphere is fresh.  The populace is eclectic and keeps the place vibrant and interesting.My recommendation;  D.I.Y.  Mongolian BBQ (unless you're the worst cook in the world, it's hard to screw up with such fresh ingredients and recipe suggestions)"]], "P F Chang's China Bistro": [["Lauren S.", "Very disappointed with my fiancé and my experience last night at PF Chang's. I am from southern California and was raving about how good the food was to my fiancé. We decided to have our 4 year anniversary dinner there the day before Valentine's Day. We ordered the Kung Pao Chicken and Crispy Honey Chicken. The crispy honey chicken tasted like rubber and was inedible. A manager came by and was very nice and sent the dish back to the kitchen to be remade. Our waitress must have thought she wasn't getting a good tip after the entree mishap because she hardly stopped by our table to see if we needed anything. They made the chicken again and it was a little better but still nowhere near how good the PF Chang's are on the west coast. They at least took it off of our bill. I think the most disappointing thing about the entire evening was that I told them it was our anniversary ahead of time and they didn't do anything to make our evening special. Just gave us the bill and we left. I don't think I will ever go back to this place."], ["Ken K.", "I have been to PF Chang's in 3 different cities.  It's a chain but they deliver very good Chinese food at every location and the service is also very good.  This particular location will likely get beat up a bit on some reviews because it is located in Country Club Plaza and a lot of snooty, privileged at birth people (and wannabees) only feel like they deserve the very best and anything less is below them, so take those reviews with a grain of salt."], ["Joshua E.", "I can't think of a time I was more impressed. The only place open after 8pm on the plaza this evening, all the staff were very kind, our server never made a mistake on any of our seven person groups requests (Mark), all the food was amazing, and the atmosphere was beautiful. I am looking forward to coming back. Wow!"], ["Ryan H.", "We were on wait for about an hour and 50 mins. This was my fault because I had forgotten to make a reservation. I had been to Pf Chang probably 4-5 times. The food in the past was alright but nothing spectacular. We ordered the hot and sour soup which was good and my wine was pretty good as well. I had asked my waiter how their fall special was and he said he loved it (typical answer to which I did not appreciate) it was the Vietnamese steak and shrimp. The description said it was their take on Pho and it was stir fried. I was expecting some kind of lomein/Singapore noodle style stir fried and when I got it, I was a little confused. It looked like a five year old had cooked it. It def was stir fried. It looked and tasted like they put the sauce on the plate, boiled the noodles and stirred it for a little bit and put old cilantro on top. I was not a fan. Mom had the chang's spicy chicken and she didn't like it either. It was dry and boring. Our friend had the shanghai shrimp and garlic to which he didn't enjoyed also. He said the sauce was too thick. The snow peas were not snapped at each end so you get that membrane at the kind where it can be very disgusting to eat. I've worked and been into a lot of Asian rest and all the green beans and snow peas are properly cleaned and snapped at both ends to make for a better eating experience. All in all the food here sucks. I say you are better off walking two blocks and go to bolings up the street. The food there is way better and priced a little cheaper. I will not be returning."], ["Michael D.", "I usually hate chain restaurants, but PF Changs is where I'm the opposite. I know people say to try Bo LIngs (not my fave), but Changs consistently delivers. But I just can't give it 5 stars. Like it, but come on - there's someone in Scottsdale or wherever they're based making the menu ..."], ["Ray S.", "We used to love it here but menu has changed. And they don't bring the 3 sauces out and mix them anymore either Kung pow shrimp and menu is small not the variety of old menu"], ["Ethan B.", "A go to when visiting Kansas City. The food is always awesome and the location is great for shopping on the plaza."], ["Josiah M.", "So this is probably my favorite Chinese restaurant around, it beats a lot of Chinese restaurants out there. I've only tried about 10 different items on the menu but they all been great do far. My favorite thing about the place is the three sauces that the waiters/waitresses bring out to the table. My advice is combine all three together just add the hot mustard to taste if you don't like to much heat.The vegetable dumplings to me are amazing, so are the spring rolls for the appetizers. The chicken fried rice is now my go to meal, the portion size is huge for the price and I eat a lot and I could only eat half the bowl and took the rest home for lunch the next day. I'm planning on trying other items in the future, but I'm sure everything on there is great."], ["Ruth H.", "Didn't have too good of exeriences in other cities.  But, decided to try it in country plaza.  The food seemed to be better than I remembered, and my familty enjoyed it."], ["Justin E.", "You can eat your vegetables and the low carb whatever. Someday when you're bored and want to challenge your stomach I suggest you get CHANGIFIED. To properly do this, one must order a martini (I typically get the chocolate one) along with the Chang's spicy Chicken dish. Consume all of it. If for some reason you're still hungry, feel free to order more.  Later that night, just like a fat Santa Claus squeezing down the chimney, you'll have a movement. The movement is somewhat painful and magical all at the same time. You'll laugh and cry but you'll never regret getting Changified."], ["Brian H.", "I'd like to think myself a connoisseur of Chinese food, PF Changs is usually good, and sometimes PF Changs is creative enough to make a hit, and sometimes they flop - like with their Korean bbq chicken; it sounded great, but in reality it was just fried chopped chicken with a hint of red pepper paste and some pear-apple kimchi.  at least they took it off my bill, so, needless to say i'll keep trying them out!"], ["Sharlene T.", "Had fried rice takeout. Got the gluten free fried rice with shrimp. Great fresh ingredients and tasty rice. LARGE portion too, could feed four people!"], ["Rebecca W.", "Spicy chicken (gluten free) was great. Service was very helpful. It was a very busy restaurant with an hour long wait. Took home the gf flourless chocolate dome. Very rich. Husband got the great wall of Chocolate. It's more like four cakes in one. Reasonably priced."], ["Mici B.", "Service was good. Overpriced Chinese food but location was convenient after getting out from a movie. Didn't know the area much and was craving for it. Next time, I'll make sure I get my Chinese food fix taken care of before being in the area."], ["Ali C.", "Being 18 years old, when my boyfriend and I go out, we often get treated like children regardless of how nice we are to our servers, but this place was definitely the worst. Our waitress didn't bother wasting any more time on us than she absolutely had to, and the food was only okay. The waitress didn't bother being polite to us until she saw the $10 tip we left her for our $40 ticket. I get it, I'm a server. Most teenagers don't tip and they aren't worth waiting on... But we aren't ALL like that."], ["Jay P.", "Lettuce wraps are a must. Took my girlfriend, who's gluten intolerant, and she absolutely loved her meal. We don't eat out much but she was extremely impressed by the gluten free options. Happy girlfriend = bonus points for this guy. We will be going back!"], ["Max C.", "Chicken noodle soup? Yes, I was also skeptical, but it was fabulously flavorful. The server was very forgetful, but boy was the food good here."], ["Nicole M.", "My fiance and I went here Saturday with 2 other couples to celebrate his birthday. They asked me when I made my reso if we were celebrating anything.We were seated in one of the corner, circular booths which was great for a party our size. Everyone could see each other without being cramped. They were pretty busy and they must have just turned our table because when we went to sit, the booth was all wet with cleaner. Ick! I had to ask for a towel to wipe it down before sitting. We ordered apps for the table: lettuce wraps, steamed pork dumplings, crab wontons and edamame. Weird thing was that all the apps didn't come out together! We ordered them together, but the wontons came out first, followed by the lettuce wraps a bit later, then the dumplings and finally the edamame. Some of the top ones were lukewarm, but the bottom ones were still frozen!! The lettuce wraps were delicious, and enough for everyone at the table to have 1. The dumplings were also excellent. I want more right now! For dinner, fiance got the Chang's Spicy Chicken which was really good (I kept stealing pieces of it!) and I got the shrimp lo mein which was also good. I'd give the service a C because of the weird timing of the apps, and then we just didn't see him a whole through the meal. The manager even came and cleared plates before we saw him. The manager was very friendly.Our server brought our tickets and my fiance was talking to someone else at the table and they were talking about his birthday and the server goes \"Oh yea. Its your birthday. Do you want a dessert?\" So that was nice, but probably wouldn't have happened if he didn't happen to walk up as they were talking about it."], ["Dave K.", "Always wanted to eat here. Did it and will be the last visit here. The water and tea are excellent. The sweet and sour chicken tasted like they soaked it in bleach. Awful!The rice was ok but how do you screw up rice. Tasted the spicy chicken and that was not too bad. Waiter was ok but forgot to bring everything extra we asked for."], ["Jason H.", "A disappointing evening at a restaurant where we have usually had good experiences. I suppose I could blame it on them being busy, but we waited for 30 min before realizing that the hostess had forgotten to enter our names. When we were finally seated, her promises of sending our server \"right over\" were false. Over an hour after my wife and I arrived, we had yet to even receive an appetizer. It may not sound like a while, but seeing several parties, who arrived after us, well into their dinners was frustrating. We opted to leave and continue our dinner at a more welcoming restaurant."], ["Kelly L.", "I was disappointed by my visit to this restaurant.  I had heard so many good comments about it.  It is overpriced and not very good \"Chinese\" food.  I will admit that the lettuce wraps were the highlight of our meal; however, both of the entrees that we ordered (Orange Peel Shrimp and Spicy Chicken) were overly syrupy and cloyingly sweet.  They did not have any vegetables at all in the entrees and did not seem fresh at all.  The mini desserts that were ordered were way too sweet. I had the tres leche lemon dessert while my husband had the carrot cake.  I appreciated the mini portions, but again, they did not seem freshly made.  We will not be returning."], ["Kelsey C.", "I love this place! It is true gourmet Chinese food at its finest. It is located diagonally across from The Cheesecake Factory on the corner.For an appetizer, we had the chicken lettuce wraps, which were amazing. I wish I would have ordered it for it for my meal- it was a great taste combination with the pieces of lettuce and chicken combo. the sauce was sweet, but tangy at the same time- a perfect combination.For dinner, I had the orange peel chicken, which was amazing. They serve white rice with all their entrees-- I appreciated that. I could barely eat all of my meal by myself, but the portions aren't really overwhelming, except for the noodle dishes- there is a lot of food there. The atmosphere is really classy and it is a great place to take a date or a close group of friends."], ["Emily P.", "When I go out to eat I don't usually like to go to places that you can find in any city.  I loved the food, we did the pre fixe menu for two which was a lot of yummy food for 40 dollars, but you have to wonder if it would be just as good from Hen House?  Hmmm.The place was packed! That would be typical for a well known restaurant on the plaza I guess, but on a Sunday night?  Our server was really spacey.  Not sure if he was using some herbs to deal with the occupational stress?I'm glad I got my Chinese food fix but I'll be doing Hen House and Netflix next time! I'm feeling spoiled because I'm going to Cafe Trio today for lunch..hell yah :)"], ["Jenna P.", "I suppose this review speaks more to the atmosphere at this particular franchise, versus the food.Aside from saying that the new mango chicken stuff is really great, theres not really a whole lot to say about the food, its consistent whether you're in Kansas City, Austin, San Diego, or Atlanta.When you walk into anywhere and ask for a table by yourself, you run a risk of getting a weird look, or geting treated like a leper. But not here, thankfully.I ended up on the patio with an endless supply of lemon coconut rum drinks, brought to me by a server who wasn't intrusive, but attentive to no end. Which is awesome, because I decided to go to eat at like 3pm, which is usually the WORST time to go eat, because its the middle of the lull, when everyone is bored.The manager came out to check on me (I've worked in the service industry, I was drinking a lot, he had to make sure I wasn't a mess) but he was very coy about it, making a joke about my bad day, and my ability to relax, which is so much better than saying \"Ma'am, just how drunk ARE you?\"But overall, I got just enought attention to keep me happy, but could still plow though 120 pages of my book, and people watch along JC Nichols Parkway.Good times."], ["Adam G.", "I first discovered PF Chang like many people, from that one South Park episode. I then actually visited a PF Chang in 2009 here in at this KC location. At that time I wasn't too impressed by this place. A year later, coming again for the second time, I was ready for this place. No longer was I going to be surprised by a South Park episode! No not indeed. This time I would be eating my food without worrying about getting kicked in the nuts, ah ah. Well I had the lamb, don't really remember what it was called. I never had too many helpings of lamb in the past, so I ordered this meal on a pure discovery bases. Man was I really impressed!! This was a most delicious meal that I have ever tasted from a Chinese restaurant! More helpings of lamb please.If you are not a typical \"Fat American\" you'll find out that the food quantity is enough to do it's job! What you really are paying for is the environment which is up-scale.Well if you haven't been to a PF Chang, you'll find out that if you come in a group, you will most likely share your meal with the rest of the group. Hope you like to spread around the wealth of food!"], ["Aaron G.", "I am not a fan of PF Changs.  Yes it's in the Plaza and yes it is supposedly \"upscale\", but this joint is overrated.  It cracks me up because the overall theme of this \"Chinese Bistro\" looks more like a Japanese steakhouse.  I ordered the Kung Pao Chicken and asked them to hold off on the peanuts.  Well they brought the plate with peanuts anyway.  Now, I am not allergic to peanuts, but can you imagine if I had been allergic?  Serious issues could've developed here.I seriously do not consider this to be authentic Chinese and although they like to encourage \"family dining\" I really don't care for it.  They want to put all of your dishes in the middle and have whomever you are with share your plate.I just prefer to eat my own food.  Is that weird?  Anyway, I give this place 2 stars."], ["Molly H.", "While the food here was very good--it always is at P.F. Chang's--I was rather disappointed with the service. The girl who was supposed to be our waitress only ended up serving or helping us about half the time we required it. This left other waiters and the manager to pick up her slack. It really felt like she didn't want to be at work, nor did she seem to care that my husband and I were celebrating our anniversary. Not my best P.F. Chang's experience."], ["Lorena M.", "Finally decided to give P.F. Changs a try. I usually try to keep things local but heard good things about them so last Saturday after shopping a friend and I came here for a late lunch. We were seated immediatly and our drink order was taken quickly. After checking out the menu we decided to get the Salt & Pepper Calamari to start. we noticed they actually had a lunch menu on Saturdays which was nice so I ordered the combo fried rice with egg drop soup, the combo fried rice came with shrimp which were fairly small, chicken and beef plus bean sprouts which I love! My friend asked the server what the difference was between the egg plant stir-fry and the buddahs feast and his reply was Buddahs Feast was only vegatables which was funny because she went with the egg plant stir fry and it was literally only egg plant and sauce with a side of rice. It took a little longer for our food to arrive because as they put it, something happened to the fried rice. The meal was good and less expensive than I thought. Not that it makes a difference but they did forget our fortune cookies with our checks. Not sure if I will go back because there are so many locally owned chinese places to eat in the area that I feel surpass P.F. Changs."], ["Kent M.", "My first time visit here today for lunch. I sat in bar and had great service, sampling several items...spring rolls, pork dumplings(grilled), the salt and pepper prawns...all were very good. Nice numbers in the servings and would have fed several hungry ones. Food quality was very good. I will surely return with friends. Thanks folks. Well done."], ["j w.", "PF Chang's is one of those annoying chain restaurants that I'll bash every time I have the opportunity to, right up there with its brethren across the street, the Texas Cheesecake Depository, er, I mean the Factory. The problem is that my dinner was actually really good. Their orange peel chicken was sweet with a real kick and the fried rice was plump, sticky, and not dried out. My friend's lamb was a bit on the fatty side unfortunately, but had a great cumin flavor to it. I actually had my go-to Chinese food at Bo Ling's earlier in the week and it was a distant second. The chicken was of a poor quality and even though I asked for it extra spicy, it barely registered. The batter on the chicken was soggy before I had bite one. The wait at Bo Ling's was crazy long, but understandable with prom night. It definitely made for an entertaining atmosphere in what's already an bustling dining area."], ["Heather Anne B.", "I love PF Chang's! The food is awesome, but the service is what really makes this a special place. I was here a while back to celebrate with a friend, and the staff truly went out of their way to make it a fun evening. When we told our waiter that it was a special occasion, he brought the manager to our table and both gentlemen congratulated us and offered us both a free dessert, and an appetizer on the house next time we stopped by. I almost always order the stir-fried eggplant. It's really spicy and wonderful and delicious. I don't usually eat dessert when I go out to eat, but their great wall of chocolate is fantastic -- chocolate cake with fresh fruit and this really tasty raspberry sauce. Yum! And since it was free for us that night, it tasted even better. I used to eat here constantly when I was living on campus and could walk to the plaza, but now that I'm back in Independence I still make time to stop by here when I can, especially on special occasions, because they take good care of their customers here."], ["Christyn K.", "There probably isn't a PF Changs within a 500 mile radius in California that I hadn't visited before I moved to KC. That said, I expected some pretty stellar service and food in par with previous experiences. Three of us arrived late afternoon the day after Christmas, surprised to see such a crowd though grateful there was still some bar seating left. After sitting at the bar for awhile, we had to flag down the waiter to finally give us a menu, stating that we were told we could order food and drinks at the bar (which would, of course, up his tip, too!). Trying to be friendly, I ordered a bar just to play by the bar rules, though asked him if we could sit at a table we spotted by the window. He gave some sort of muffled answer and walked away... and when he didn't return for an exaggerated amount of time, we finally went back to the hostess' stand and asked HER if we could move since it was still considered bar seating. After that our waiter changed completely with no explanation. Whatever - I wasn't going to let that stop me from enjoying my food -- which was as good as any I have ever ordered at PFC's (Peanut Curry Veggies with Brown Rice). Our veggie potstickers were OK, my drink was stiff yet only $6 thanks to the Happy Hour menu, and the others in my group ate and enjoyed their food. It was clear while we ate that the line to get in the joint was growing, and it became clearer to me then that this is one of the smallest PFChangs I have ever seen. Glad we dodged that bullet. Overall, the crappy staff & small interior dock my rating two stars, though I really, really do love the food, the semi-affordable menu, and energy of the place (don't think I mentioned it - but I lived in China and prefer PF Chang's food - is that so wrong?)."], ["Kev L.", "This palce bores me for way too many resons.1) SUPER OVERRATED.2) Rice sucks.3) Entrees all suck.4) Staff is snooty and unless you are dressed in all Gucci (for some stupid reason) you are treated like trash.5) The wait is insane.The ONLY thing that is worth eating here is the lettuce wraps. And if I want lettuce wraps, i'll go to Pei Wei (A quick and dirty version of P.F. Changs). I don't like wasting my tips on snooty waiters . ."], ["M S.", "Had a very good meal here on a busy Saturday night tonight.  The secret, get in the door early, prior to 5 PM if you can in order to beat the crowd.  We grabbed a table in the bar area just before the crowds arrived and got served pretty fast.  The food is genuine asian cooked by white people, what more can you say about it?  It's tasty but not authentic, so what, it is consistent.  Great service, extensive bar.  Just a little too expensive for my taste though.  Definitely worth a visit!"], ["Arthur C.", "The food quality and presentation here is consistent, and they do offer some tasty dishes. I'm giving it 4 star because I think it's doing well at what it tries to accomplish. I think this is the perfect place in the following scenario:1) You are on a date. Place is modern. Food is decent. Serves wine. American services.2) In-laws visiting. If they want to try some Chinese food while visiting Plaza, here is a better choice than Bo Lings. P F Chang is adding some Western twists to authentic Chinese food, to make it more acceptable for the general public. Bo Lings, on the other hand, is trying to sell self-proclaimed \"authentic\" Chinese food to the general public, while unable to make the food authentic nor tasty.You do not want to come to P. F. Chang if:1) You want \"authentic\" Chinese food.2) You have Chinese friends visiting. What are you doing here? Try Stroud's, or other countless BBQ joints!Just like other popular restaurants at Plaza, this place is packed for Friday and Saturday dinner. Reservation is a must."], ["Craig S.", "Took a while to get the food. Had the spicy chicken and mu shu pork.  Food was as expected and I have not had a bad meal there."], ["Liesl M.", "I'm typically against chain restaurants, however my dear friend has been raving about their happy hour. So we made an appearance last night and I must say everything was great! Eddie the bartender was so attentive and shakes up some fabulous concoctions served up in a pretty glass, the apps were $3 a piece I think and also presentation gorgeous.  Why have bar food when you could have delicious, light and healthy yummies there. I'll go back"], ["Jaime S.", "I am always a fan of this chain. I had take out here last nite and I prayed it was open late. Even though they were trying to shut down, I was greated well and had exellent service while I waited for my food.ok I came here the next night and ....I think I've gained 5lbs.When did they start serving the mini desserts? Awesome idea!!!"], ["John G.", "Party of 6, my dinner was delivered COLD 10 minutes after everyone else's.  I asked if they could warm it up, but instead they made me another dinner...when it arrives my friends are done eating and I have to scarf it down.  Another person in my party had a cold plate and sent it back also.  Food was way to salty, everyone's opinion.  Why not let customers load it up with excess salt or soy at the table if they wish instead of force feeding coronary artery disease!  Waitress was nice but uncoordinated kitchen beyond her control.  Manager was nice and comped 2 dinners, however she needs to open a can with the kitchen!  I'll give them another shot to see."], ["Jessica Z.", "I have severe peanut allergies, and P.F. Chang's handled that better than probably any restaurant I've been to.  The food and service was great, too!"]], "Kin Lin Chinese Restaurant": [["P B.", "Probably the worst service I've ever experienced. The older gentleman, who is also the owner rushes you to order, and then gives only one menu to your group of 6. The other gentleman, who takes your order/ also is the chef, is perhaps the rudest server I've had to deal with. He asked us to order quickly, because the staff wanted to start eating dinner.. And this was 50 minutes before closing time. And asking for more menus, or water was generally welcomed with a scowl. The food itself was unremarkable, with some pretty good options. The food mostly was too spicy. I was told it was spicy, and I like spicy.. but this was crazy spicy.Never going back again! Maybe, for takeout. But my experience is soured by the rude people who work there."], ["Vamsidhar C.", "This is the worst restaurant i ever saw..!!These guys are not requesting for tips.. These are demanding..The guy over there is demanding for more and more and don't even know to respect the customer..They are treating customers as some shit..!!They demean your self respect..Even The customer Service is bad..!!"], ["Igor C.", "This is within walking distance of my work and I'd never been there until yesterday.The lunch specials are a good deal. Large servings with rice and a crab Rangoon included. Food itself was too sweet Americanized Chinese, with too many vegetables to chicken. Spicy was not. Very fast service. I'll probably try it once more and see if other dishes are better. But not soon."], ["Maliboo J.", "My co-workers and I have ordered take out from this place several times in the past few months.   When they get the order correct (which is about once out of every 3-4 times), the food is usually pretty decent.  The problem seems to be in their Front of House staff. They are unfriendly (boarding on rude) & unapologetic.   The last time we ordered 4 separate meals, 3 of those meals were incorrect.  When we pointed this out to the girl in the front (I'm sure was the owner/family), she very simply stated that she didn't take the order and it was not her fault.  She also went on to complain what a bad day she was having. When my Co worker asked her if we would be discounted (because now we are sitting there for 15 minutes more waiting for the food to be corrected), she again stated that  it's not her fault & she didn't take the order. There was never an apology,  not even a little bit of concern, and this coming from the owner. Sometimes it doesn't matter how good the food is, if the service is horrible, it can completely ruin a meal.I'll never go to this place again - they have had 4-5 chances and it's always the same story."], ["Aaron N.", "Best chinese delivery I have ever had!"], ["Laura F.", "Pretty typical Chinese-takeout-type place. Within walking distance of UMKC. I ordered the sweet and sour chicken lunch special, which comes with fried rice and a spring roll. I substituted an egg roll for an extra 60 cents. I've had better Chinese takeout, but it's not bad. I'll be back if I really want some Chinese, and am already at school, but I wouldn't go out of my way to order here."], ["C C.", "Very authentic! Our Asian-American family of 4 didn't even know where to begin to order being our first time from out of town (we don't speak Mandarin) so the owner graciously offered to cook various dishes based on our spiciness preference, food allergies, and her food came out swiftly and delicious, especially the garlic fish and garlic green vegetables (Choi Sum? In Cantonese). Their wait staff was excellent, always checking in and grabbing finished dishes away.  The place was packed with half Chinese people but nobody had to wait long, even on Saturday night.  The #1 Chinese restaurant in KC, Missouri!"], ["Jessica S.", "This was the first time that I've been to Kin Lin's and it was not a bad experience. I went there around lunch time and it was pretty busy. The place was kind of small but the location is nice because you can just walk to the resturant. I ordered take out and the waiting time was around 15 to 20min which was not that bad especially since it was busy and during lunch time. I ordered shrimp with green beans. The dish was really tasty but the portion of shrimps was not a lot. I got like 5 shrimps and all beans. The beans were really soft and the whole dish was well seasoned and just the right amount of sauce. The amount of food was descent and you also get rice with it as well. The price was reasonable according to the food. I think they should have two people working in the front because it gets busy. In all it was not a bad experience. I will definitely go again."], ["Lance K.", "We were in from out of town and found this gem!  My wife is from China and is really picky - we both loved this place!  You can get some really good traditional Chinese food as well as the Americanized versions.We asked for a Chinese/English menu - there are a few extra dishes on there.  We got the pork...with pickled vegetables.  It was so good my wife asked for the recipe so we can make it at home.  The owners are from Hunan so they know good flavors!This place is a winner!"], ["Brittany K.", "We ordered take-out tonight and all four of us agreed the food was very disappointing. We ordered tofu with vegetables (which only included a few slivers of onions and NO vegetables), sesame tofu and general tso chicken--neither plate came with any vegetables at all just the chicken and tofu. Very bland, very boring and a complete waste of money."], ["Courtney R.", "SO good!! My husband and I make special trips to this place when we are passing through or in the area. If he happens to go without me I beg for him to bring me some to-go! Very friendly staff and VERY good food!"], ["Ali S.", "We absolutely have love everything about Kin Lins! The food is spot on (made fresh), the service is attentive, prices are very reasonable, and is kid friendly. The waiters are always more than happy to make suggestions. Our orders usually consists of a seafood vegetable soup, shrimp fried rice, and the crunchy spicy chicken.The restaurant is a little off the main path. But definitely worth the trip!"], ["Nicole B.", "Since moving to KCMO from JoCo, I've been on the hunt for good Chinese food.  I did not find what I was looking for at Kin Lin.  First, I thought it was a bit overpriced.  At other takeout Chinese restaurants, I've gotten an eggroll or crab rangoon with my meal, as well as soup.  There were no extras here.  I ordered the orange chicken, which just wasn't that good.  It came with fried rice.  They didn't do a very good job at frying it because it was a bunch of white rice stuck together and was lightly fried on the outside.  The crab rangoon was ok...I've had better elsewhere.My hunt continues..."], ["Zhengtian L.", "When I first saw there menu, I thought they only offered those typical American Chinese food. But after I talked with the cashier, I found out much authentic Chinese dishes and season vegetables. Here is the tip. Ask for what you like or ever heard and they might prepare you a good dish! Their soups are all great and their fried rice are awesome!"], ["Elaine D.", "Typical American Chinese dishes throughout the menu, but if you look close you will see a few authentic dishes sprinkled in here and there.Relatively cheap, I assume that's because it's so close to campus.I can usually find something new and tasty to have here, since the menu is pretty extensive and I've had only a few rare \"misses\".Warning: the only dessert they have is ice cream, don't get it, it tastes like its been sitting in the freezer for years."], ["Ms F.", "The good: Lunch prices are good. Service was fast. The bad: They were out of tea when I was there. Strange for a Chinese restaurant. Only set the table with a fork, no knife. Difficulty cutting my greasy veggies with just a fork. I had lunch, and was given fried rice though I wanted steamed white rice."], ["Keanon L.", "I love this place. Perhaps it's nostalgia, as I have worked or attended school at UMKC since 2000. The menu, particularly lunch menu, is primarily Americanized, but the authentic dishes really shine. I love the spicy tofu, the ma po tofu, the noodle soups with rice noodles, the pickled vegetables, green beans with tofu, and the baby bok choy with mushrooms. For vegetarians, note that there are two distinct types of tofu here, one being spongy and white like you're used to, but the other far denser, richer, and almost meat like. It's pretty incredible.It's incredibly affordable to eat here. You can get a larger, more \"premium\" entree and a drink for ten bucks or less. They deliver at least as far as 36th St., where I live.There's a server here named David that appears to remember the names and back stories of every single customer he has. It's pretty astounding and gives the place a cool, friendly vibe that didn't exist years ago.Part of the hole in the wall charm is gone since they renovated the inside of this place and absorbed the building next door, but many will also find the newer, cleaner decor more welcoming."], ["Ken B.", "Kin Lin's is one busy place.  It has a feeling unlike most places in town because it is a true mix of families, students, dine-in and carry out folks.  With it being on the edge of Brookside and the Plaza, you get a lot of families with everything from kids to grandparents.  Then you throw in that it sits on the edge of UMKC and Rockhurst University, you get a large group of students, students representing many different countries.  It's a true diverse group of people that walk in the doors at Kin Lin's.  It's always busy.  There are a lot of employees and they are always buzzing around like cracked out worker bee's.  It's not a fancy place, but it's a cozy place.  It has a laid back homey feel.  It's crazy that it can feel so laid back because I just mentioned that it's always bustling and hectic, and it's true, it's just a nice combination of the two energies.  The food isn't fancy elegant gourmet food, nor is it probably very authentic, but it's good neighborhood Chinese food.  Most people would probably be disappointed in the fried rice dishes, but it's one of those things that makes me so happy and so comforted.....it's the fried rice with small square carrots and peas with the chopped onions speckled with cooked-on soy sauce.  I must have grown up on that weird fried rice, but Kin Lin's is the only place in town I could find it so elementary.....and Delicious!  It's that kind of place people.  Simple, good, Americanized Chinese food with a neighborhood vibe full of diverse people.  If you are looking for a stress free night out for dinner, Kin Lin's fills the order.  Big bonus, the offer delivery, a rarity in our city."], ["Jimmy K.", "Fast and furious Chinese food when you're in a hurry!"], ["A H.", "I've been searching for a decent Chinese restaurant since I moved to the area, and came across this gem on my way home last night. It was just me dining, and I had a craving for Sesame Chicken. The decor and setup is very nice, and I was surprised when the server, David, suggested something similar - but healthier: the Spicy Crispy Chicken. It was delicious! And I was delighted when David brought me a to go box with fresh steamed rice in it - a first for me! Overall an impressive experience. I will be back!"], ["Vincent E.", "Hands Down.  The best Chinese food you will ever try.  EVERYTHING is FRESH from scratch.  Awesome.   I haven't had a bad meal yet and the owner is a good man to boot!"], ["Stormi F.", "Meh is a pretty good work to describe this place.  Not very single friendly with an $18 minimum delivery purchase.  I ordered Mongolian Beef, they should have called it Loads of Veggies with Slivers of Underspiced Beef.  The dried out chicken wings were just about inedible, I didn't even open the soup container, I was so irritated I just paid that much for crap food.  Oh well, live and learn and write it up on Yelp!"], ["Taryn H.", "Horrible customer service. Never spending my money here again. We've ordered food from here for more than a year, no problem. Then all of a sudden they tell me that we live too far away. The person was very rude about it. Don't worry, I won't spend my money here ever again."], ["Sara D.", "My friends and I stopped by here pretty late in the evening on the 4th of July. While every other restaurant was closed, Kin Lin was happily open for take-out orders! The owner was precious. We had a lot of fun talking to him while waiting for our carry out.The ordered the smaller portion of fried rice with shrimp and chicken. The box of food i received was enough for 3 meals! I can't imagine how big the large size would be. I cant wait to come back and try them for  take-out meal."], ["Eric C.", "Kin Lin has good food, and horrible service. When my order was messed up they didn't apologize, blamed me for their problem, and offered nothing for my inconvenience. I'd recommend them if they had good service, but as it is I can only say that ordering from them will lead to frustration."], ["Lena L.", "As a Chinese, this is my favorite Chinese restaurant in KC. Spicy and authentic. Addicted to the Hunan Beef.The service depends on your luck."], ["Kimberlia S.", "My brother and I ordered a lot for a good price. Everyone was very nice. The food was great except my egg drop soup, that was a little bland."], ["Michele N.", "I gave this one star because the people who worked here were amazingly nice. I just wish the food would have lived up to their personalities!I won't go on and on about our flavorless, less than appealing meal; I'll just say I won't be back. Still looking for decent Chinese food that doesn't cost an arm and a leg - you won't find it here."], ["Farheen Q.", "First plus: they deliver! at least as far as to the plaza, I'm not sure what the total radius is. Delivery was quick, 20minutes before they said they would arrive.I got the shrimp with spicy tofu, which unfortunately was not spicy. Otherwise the shrimp and tofu was cooked well. Came with steamed rice. Also got the crab rangoon which is really good here, I recommend.Good old fashioned americanized chinese food! Next time I will try the kin lin style spicy chicken, maybe there will be more of a kick to it. Otherwise, ask for hot sauce."], ["Mark M.", "Hit-and-miss. I'm as equally sold by service as I am by the food, and the quality of the former is a coin toss.Our first visit was hosted by a polite and efficient server who made us feel like the only people in the place.The giddy anticipation of our subsequent visit was quickly deflated by a sloppy server harboring indeterminate motives. Despite the degree of certainty with which we placed our order, he volleyed his own suggestion. He was so convinced of his opinion, he even produced sketchy samples from the kitchen for us to try before we finalized our order. What are you pushing for, fella? \"This meat's fixin' to turn...\""], ["Chris E.", "Great College Joint for Oriental/Indian Food!The location is perfect for any students needing a quick bite to eat after class or a late night chow down from the dorms. This restaurant has a great ambiance, the menu consisted of not only the typical Chinese food, but also some curry options, Vietnamese dishes, bubble tea, ice cream... all sorts of things, the portion sizes are quite large for the price and the food was pretty good, I got the spicy chicken (which could use a little more spice) and my buddy got the chicken fried rice which was huge and delicious!Overall a great place to get away without being away while getting your chow on!"], ["Montana R.", "After a long stressful day. Kin Lin made eating fun again. I am just so happy right now.... depression was eating me alive and was at wits end. Now, I see purpose and hope in each new day. God ordained Kin Lin to be my support in this hell hole called life..."], ["Michael A.", "I have eaten at plenty of restaurants and this place by far is a great restaurant to eat at. We were  able to pick where we wanted to sit and also the service was fast. Our server was very nice and helpful, also offer advice on which plate is the best. I picked out the sweet and sour chicken( which is a classic) the plate was full and we were dining during the lunch rush. The plate was 5.45 and that seems like more steal for something that good. I would have taken a picture but it was gone before I took my phone out."], ["Anush J.", "We had been looking for a good, affordable Chinese place and found it after 6 years. The food is fantastic. Everything we tried was amazing. The owners are very friendly. He came over and cooked me a great potato and beef spicy dish that wasn't on the menu. We loved it so much that we came back the next day - with more people and enjoyed every bit of it."], ["Manoj Kumar M.", "Really worst experience ,,, they even  wont give even one extra chilli sauce to go ...."], ["Reed N.", "Although I love Chinese food, rarely do any of these restaurants garner over three stars from me.But this place rocks! Ubiquitous meat, vegetable, seafood and bean curd dishes cover their extensive menu. As far as I could tell all the vegetables were prepared fresh and house instead of being bought already cut. The sauces also tasted scratch made. My selection was being neutered with cumin and chili pepper sauce. I've never heard of such a thing at a Chinese restaurant. So I ordered it and - believe me - I have no regrets. It's one of their spicy dishes so it did have a little bit of a kick. Chinese vegetables that I don't like are water chestnuts and bamboo shoots... but the sauce preparation was so good here these were incredible absorbers of flavors. The bean curd was perfectly. The rice was beautifully firm instead of being a sticky mess.The service here was fast and just excellent all the way around."], ["Nubian S.", "I used to come here all the time when I was a student.  I have long since graduated and moved from the area but I really missed coming here.  The staff and owners are so friendly and the food was cheap AND delicious.  Highly recommend if you are looking for cheap, quality Chinese food."], ["John A.", "Basically this is your best cheap quick delivery Chinese option near UMKC. It's decent food, nothing incredible. But when you want to eat cheap and still sort of enjoy your food then this place will do.Delivery has a minimum fee so load up on crab rangoon or something to hit that delivery requirement. Avoid the generals chicken. It typically fuses together into one giant gooey piece of meat. Beef and broccoli is pretty good though."], ["Blue M.", "This was a challenging review for me to decide to type up here on Yelp.  I've been a patron of Kin Lin since early 2002.  This has been my go-to first lunch date spot since high school.  I've taken friends and family here that have been visiting from out of town.  I've met groups of friends here for dinner on a whim because they have at least one thing every diet can eat.  But something is wrong. It seems that with the expanse of the physical location, the quality has dropped and the prices have gone up. The size of the meals seems to have been cut in half.  It has gone from being an almost sure-thing in terms of satisfaction, to an absolute coin toss as to whether or not the food you order is going to come out like you expect it to (from past experience or description).  The staff here is marvelous.  Ma and Pa Lin are obviously very dedicated to their business. The delivery drivers are fast unless you get that one guy who is creepy and sometimes came to my apartment when I didn't order anything and tried to strike up conversation with me while I sat on my porch.  I don't know if he's still even there. What I do appreciate is explanation and willingness to try and make your experience better.  Though the quality has dropped, they are aware when it is something they can improve for their guests.  They have admitted the last few times that they have new people on the woks.  I don't know why they can't keep a good person all the woks all of the time, because my last few experiences have involved cold noodles and frozen shrimp. This place used to be THE BEST! An absolute treat and joyful experience.  I miss the Kin Lin of yesterday.  If they can find themselves again, find that delicious beauty within, they will win me back.  As it stands now, I have no plans to go back, but it'll probably happen some afternoon when I'm starving and the curry chicken lunch special--crinkle fries and all--will flash across my memory and I'll tell myself, \"surely they are back to normal...\", which is what I've told myself the last few times I've been there for lunch or dinner.  We'll see."], ["Lisa B.", "Best Chinese food in KC!!   I've been coming here since I was a kid, and it's always been consistently fresh and delicious!  The atmosphere is beautiful and the staff is so friendly and nice.  They treat me like family every time!  Also, whenever I get delivery, they're always fast, friendly, and on time.  No better place than our local, neighborhood Chinese joint!"]], "Bo Lings Chinese Restaurant": [["Ana C.", "Exceptional. The lo mein was the best we've ever had. Egg rolls were plump and delicious and the dumplings were superb. Wish we hadn't gobbled everything so quickly to have gotten a photo. The staff was very helpful and understanding of my son with autism. We will be back."], ["Rebecca R.", "I have been going to Bo Lings for about 25 years now and don't get me wrong, I am a huge fan of their restaurants, especially the location at 9055 Metcalf.  When I come back to Kansas City, I always make a point to come here, munch on some egg drop soup and crab rangoon and other main course treats.This past Sunday, I decided to stop at this location on the way up to the airport... BIG mistake.   The experience I had was an embarrassment to the whole group of Bo Lings restaurants.  We showed up for a late lunch, say ~1.30pm.  We were seated and after sitting there for about 15 minutes without anyone acknowledging we existed, we got up and went back to the hostess to ask why we hadn't been seen or given any waters.  She seems oblivious and confused that we were even there...When we finally got a server to come over, we got a nice long speech about how many other things she had to get done (clearly things that were more important than serving us???... if you can't figure out how to serve people, just don't seat them in your restaurant).  We placed our entire order for fear that we would never get out unless we did.  The wait began...While waiting, we noticed the couple next to us get some SUPER burnt dumplings.  (WHY ARE YOU SERVING BURNT PRODUCTS?!!)  They took a few bites but couldn't escape the overwhelming burnt flavor and signaled the waiter for help.  They explained that they wanted them brought back to which the waiter didn't seem to know what to do.  He ran off over to the bar to get what I would guess was the manager.  She looked over the dumplings, the couple had to re-explain the problem (...not sure why it was hard to tell what was wrong), then the manager did the one of the biggest no-no in the dining industry - she argued with the customer about the dumplings, asking them if they could just eat the few of them that weren't completed torched :/ ... After a few more minutes of explaining that they would not eat the dumplings (that frankly shouldn't have made it out of the kitchen), the manager finally took them back to the kitchen.We received our crab rangoon fairly soon after ordering.  They were very well cooked! (yey! ~ five stars for that one...)  Shortly after we got our bowls of egg drop soup.  They were also great.  We asked the server if she could bring us some more crispy wonton chips to complement our soup.  She nodded ... I assumed that meant we would get some... but no.  After waiting and waiting, we finally found someone else to ask and FINALLY got some more wonton chips after our Lo Mein had arrived and most of my party was down to the final few bites of soup.All in all, this experience was as I described, like watching a train wreck slowly happening.  I love the Bo Lings brand and make it a point to go back every time I visit Kansas City but will say that next time I go back, I will drive out of my way to go the the 9055 Metcalf location (or maybe even the Plaza location) and NEVER go back to this location at the Zona Rosa shopping center.Things to improve on:- greeting customers well before 15 minutes after they have been seated- not serving burnt food- not arguing with customers when they don't want to eat your burnt food- training staff and managers how to handle situations where customers have questions or concerns about your food- training your waiters not to complain to customers about all of their problems- training your staff to actually follow through on getting things for customers when they say they will go get them.The pros from this trip:- Hot, well cooked, fresh crab rangoons- Bo Lings is great (just not at this location)"], ["Lisa I.", "This Bo Lings location is poorly managed, with incredibly terrible service, as well as having a lack of quality in their food service. It was once my family's favorite location, and we would spend $$$$ there each year, as well as recommending it to many friends. I no longer feel that way. We were celebrating a recent special occasion, were sat at our table and forgotten for 23 minutes. Waiters and waitresses walked past us the whole time and no one would come over. I had to walk to the front and ask about service. I was told they forgot to tell the waiters about our table. Once they did whatever they needed to do on their computer system, a waitress came over. And, that is when the real disaster began. With no oversight, management put a new trainee at our table. She put out appetizer plates, then after waiting another 16 minutes, she brought water and started taking up the plates. We had ordered soup and needed the plates for the wonton crackers and sauce that was brought after the plates were taken away. We had no napkins and no plates or anything for the wontons. At this point, I got up again and discreetly asked to speak with the manager. It was our waitress who was back there and when she did get the manager, I kindly asked her to stay. I explained the different parts of the situation and said I didn't want the waitress or front desk personnel  to feel badly, nor did I want to embarrass my family, but we needed to get some service to salvage our experience there. The manager said she understood and asked me to give my suggestions for how things could be better and help with the training understanding of her employees. We spoke about things like still needing napkins and silverware. The manager brought out napkins and at that moment our soup and entire meal arrived together. We asked for the food to be taken back so we could enjoy our appetizer soup. The manager asked if we wanted it to be kept warm. We said we wanted it rather to be made fresh. She agreed and said she would speak with the chef personally. So, after she left, we then sat there with our soup........and, no spoons. The waitress finally brought some. Still, no one had anything to put the sauce on for the wontons as the plates had been taken. Then, we waited AFTER our soup was done for another 12 minutes for our meal. It came, and we sat there for 4 more minutes for.......you guessed it! - forks. And, another 3 minutes for serving spoons. I got up again and asked for those. The waitress brought them .....4, then another 2. Then, the serving spoons -- 3, then 2. To top off a spectacular dining experience, there is no way the food was made fresh. The Beef Chow Fun was lukewarm with dry noodles; the Pad Thai was warm; the Sesame Chicken was cold; the rice was crispy --- so crispy around the edges that some large amounts of the rice were literally impossible to bite. Really. Only the Vegetable Fried Rice and Tofu Family Style was acceptable and as they should be. For this (un)lovely two hour experience we got to spend near $100, spoke with the manager four times and were told sorry with stale almond cookies that were surely processed in some faraway factory three years ago  (the oil in them was so rancid even my two dogs wouldn't eat them.) All this transpired with us being calm, kind, and professional. And, I do appreciate the manager being professional and courteous. I waited 15 more minutes after our party left to speak with her and discuss that paying the full bill was wrong to ask of us for such a disappointing experience. She attempted to speak with the owner, and failing to be able to do so, was only able to give us 20% off our bill....oh, and those hideous almond cookies I mentioned. I appreciated her attempt. I REALLY don't like to be negative or leave a poor review. But, this is part of why Yelp exists. I do want to mention the excellent service of the lady who brought out the food, and the two ladies who cleared the table. They were friendly and competent.Oh, what is that you ask?? What did our fortune cookies say? Hahahaha. Yeah. Those. We didn't get any."], ["Erin T.", "I wish I could give negative stars for this. The worst most unclean Chinese restaurant would be better. Eating your shoes would be healthier. I wanted to cry because I ignored the Yelp reviews which was dumb. How is this chain successful ? It should be bankrupt. The food was so over seasoned over salted msg'ed. I wanted to send it back and leave or run out of the place screaming. I skipped lunch and should have been able to think it was good based on hunger alone. Egg drop soup was orange pink instead of yellow. The vegetable dumplings were dried out on the outside. I don't know what kind of lo mein recipe this was, there was limp book Choy, very little water chestnuts shrimp pork and chicken with what seemed like wide over cooked spaghetti noodles. It was over seasoned and gross. Took one bite and was done like the other reviewer. Waste of $."], ["Erica K.", "This place is disgusting. Nobody in our group was even able to finish their meal. One person only had one bite. Grossed out. We will never return."], ["Mykie D.", "Bo Lings has suddenly become a Christmas tradition for me while in Kansas City for the holidays. I either eat there on Christmas Eve or the day after Christmas every year. The experience is usually fulfilling. This year, we waited over an hour to be seated and once we were seated, the service was very slow. The food was good, but the experience was negatively impacted by the slow service and unusually long wait. We were told it would be 20 minutes, but it turned out to be an hour. Fingers crossed that next year is more fulfilling"], ["Judy D.", "We were out near Zona Rosa, looking for a place to eat dinner.  Our usual favorites were totally full due to the game and race.  None of us had been here before but took a leap.  Bad call.  The place had six other people eating when we went in.  Bad sign as the eatery is large.  I don't even feel like wasting my time with this Yelp so, suffice it to say. it was not a good experience.  The hot & sour soup was tepid both in temperature and spice.  The dishes all looked alike.  Brownish little globs of breaded something or other.  We were finishing our drinks and it was a half hour before closing.  The staff unceremoniously began sweeping the floor, filling the condiments and banging dishes.  So very uncool.  They should have just shouted, \"get out!\"  Never again."], ["Tracy I.", "I honestly do not understand the hype over Bo Lings. I've been to the Zona location three times now, and each time really hoping it would be better than the last. So far, nothing. Food seems overpriced and nothing different than what you can get at any other Chinese restaurant during their lunch special pricing, but double the price here. Service was mediocre and nothing memorable. Haven't been back in a very long time."], ["Keith O.", "Hate to write this as Bo Ling's has long been the standard bearer not just for KC Chinese food, but for all of the midwest. But the location at Zona Rosa has gone quickly and sharply down-hill in the last few months. I don't know if there was a management change or what, but the service our last two visits has ranged from non-existent (refills only when requested, no old glassware cleared, no plates!) to actively bad (serving a chicken curry to a life-long vegetarian.) The food has likewise gone down in quality, but not as noticeably or sharply (mostly due to luke-warm delivery, so likely just the service.)Please refresh and retrain your wait staff at Zona Rosa. I love Bo Ling's, but will be giving the ZR location a long break while they try to figure it out."], ["Tim K.", "After walking thru & experiencing the 2015 Art Fair we thought. ...let's go to Bo Lings for Dinner.  We had had two Good dinners there before.   Terrible Service, cold & incorrect orders, short staffed, medium level of occupancy,  sloppy prepared food  ....un- edible.  Very Sad turn of events  ....we will never go back.  40.00 bucks for some grease."], ["Matthew S.", "This was one of my favorite restaurants and the food is fairly good.  They are completely inflexible on menu options though.  You cannot get a smaller entree, fried rice, and an egg roll without separate orders except for lunchtime on a weekday.  Since my fiancé likes that variety, we no longer eat here."], ["Phoenix A.", "I like to shop and eat local when I visit KC.  I have eaten at this location and the Plaza one.  I had their lunch special which comes with an egg drop soup and a crab Rangoon.  I told them that I did not want the crab Rangoon.  And the waitress asked if I wanted a spring roll instead.  That sounded good but she said that would cost extra.  No thanks.  This is not the first time they tried to up charge me on substitutions.  I wish they would be kind enough to substitute items for free.  Otherwise, I would give them 5 stars.  Service has always been good.  The food comes out fresh and quick."], ["Tierra H.", "Today was my 2nd time going to this restaurant, my first experience was great so I thought I would give it another try. The funny thing is after I went the first time I was impressed and told my stepmom about it. She had apparently already been to the Plaza location and told me EVERY TIME she had been, the food was horrible and service was horrendous. I thought no way, the Plaza location must just be bad because the Zona Boling's is great!Well today I found a thick curly black hair in my rice and after showing my server, the management seemed very unconcerned. Working in community service myself I believe, when one part of the staff messes up the manager should go above and beyond to fix the matter. I guess this is not the belief at Boling's. The manager did not come apologize nor offer to subtract the meal from our bill. Even though I hadn't even gotten close to finishing it. They asked me if I wanted more rice... More hairy rice? I think I'll pass. I'm not so angry with the hair, gross? Yes but I give the benefit of the doubt. My issue is with management not caring enough to mAke it better, which sucks because I was really rooting for this place. Unfortunately I will not be returning to Boling's for more pubic fried rice."], ["Gordy M.", "Bo Lings is our family's go-to Chinese restaurant.  We've taken Chinese exchange students on several occasions, and they're more than satisfied, so I'm not going to quibble over authenticity.  We've been eating at Bo Lings for about twenty years.  We've eaten at every Bo Lings in Kansas City except, interestingly enough, the Plaza location.  I'll try to correct that oversight since I read that their dim sum is very good.  The Zona Rosa location is where we go most often, although I eat solo at the 135th & Metcalf location since I live south of KC during the week.  Even our grandkids, ages 5-12, love Bo Lings.Since I'm the type of eater that moves wildly around a restaurant's menu over time, I'm not going to gush over any one dish.  I've eaten most of them at some time.  I'll recommend the eggplant and tomatoes in garlic sauce, tea-smoked duck, tofu family style and the pad thai with shrimp.  I don't eat the \"American Chinese\" fare too often - cashew chicken, sweet and sour, beef and broccoli, etc. - but I'm sure it's very good.  We'll usually order soup, hot and sour or wonton and occasionally the sizzling rice.  The Vietnamese spring rolls are excellent, and if I order pot stickers, I have to fight to get one if the grandkids are along.When we first started going to Bo Lings the 95th & Quivira location had a back page to the menu that offered \"authentic\" Hong Kong dishes.  I'm sure the lack of demand from the collective KC palate caused Bo Lings to drop those dishes, but I sure wish they'd bring them back.Bo Lings' wait staff are veterans.  They're friendly and efficient.  One of the long-time waitresses at Zona Rosa is one of the best in Kansas City, in any type restaurant.All-in-all, for consistently good Chinese food, Bo Lings offers a great combination of quality and price."], ["Anoop C.", "Great food! Taken takeout twice now and both times, it's been awesome...I ordered the Generals Chicken. It was great! Quality shows in the chicken as it's not small little pieces of chicken. Perfect balance of sauce and meat and prices are pretty reasonable as well for where they're located.This was for takeout only but I'm guessing it's great even if you dine in as well."], ["Matthew N.", "What a pleasant experience!  We ordered our food prior to arrival because we didn't have much time on our lunch break.  When we arrived, the waiter was already serving our food!  I had the Gong Bao chicken which was good but maybe a little salty for my taste.  The service was excellent with the waiter very attentive.  I'll be back to try other dishes!"], ["Brenda M.", "This is how Chinese should taste. Unfortunately, when Chinese tastes like it should without the overly processed taste, you end up with a high bill. So I'm torn between the fact that this food was above average and pretty tasty but it was a bit too expensive for my Chinese palate. I could definitely taste the difference between my local Chinese General Tso's chicken and Bo Lings, the chicken just tasted less processed and the flavors were more subtle and less artificial but that is with a hefty price difference. The restaurant is beautifully decorated,  service was phenomenal, the food portions were not big but enough, and the food quality was high. I don't think I would return though as I just can't get over my \"Chinese should be cheap\" bias lol."], ["Jay E.", "Disappointed to find out that they do not serve authentic Chinese food.  We ended up trying the Bo Lings noodles and a spicy chicken dish and both were over sauced and with not much flavor.  We might give them another chance in the future due to the lack of choices in the area."], ["Enrique C.", "This restaurant is part of like 4 restaurants around Kansas City, it is located close to the airport in the new commercial area named Zona Rosa.The menu is less \"americanize chinese\"  than PF Chang; I like this restaurant more because of the quality of the ingredients and the preparation of the dishes.It is a little pricey comparing it to an average chinese restaurant but I think it is worthy because of the reasons I mentioned above.The service is very friendly and fast.I wish they would serve DIm Sum as in the other locations but maybe it is because of the difference in customers in the areas.For take out, they are great... the plastic containers are good quality and the rice comes in those containers without metal so you can put it straight to the microwave.Every time I go to Kansas, I go to eat here at least two times."], ["Jon W.", "I come here often with Fred D. when I am in town and I always love it.  They cook and make the dumplings here fresh and made to order.  They have an extensive tea menu.  They have many booths next to large windows that let in just the right amount of light to augment your tea and dining experience.  I like the tasteful asian accents and wooden interior design of the place.  I feel comfortable here.  The staff is just so extremely polite and efficient as well.  It really adds to the ambience and pleasure of dining here.  I haven't even come close to trying everything on the menu (except all the dumplings which I love), but everything I have tried has been excellent.  Wether you want seafood or meat or feel like going totally vegg, there are lots of tasty options.  I recommend this place for a better Chinese food option in the Zona Rosa area.  Of course, you can get great take out here too.  I am unsure if they do delivery though. Enjoy!"], ["Joseph R.", "We are visiting KC from Atlanta and decided to try this restaurant after reading about it on yelp. What a mistake. A family of 4 will eat for about $100 which is expensive for a Chinese meal. Started with Edamame and it was ok but not salted enough. Then went with pot stickers and they were terrible. We ordered Mandarin Chicken, Sweet and Sour chicken, and Mongolian beef. The Mandarin chicken was good but the other 2 dishes left much to be desired. The sweet and sour chicken was sickly sweet and was too thick. The Mongolian beef was very chewy and had no taste of anything but too much pepper. I would not recommend visiting this restaurant."], ["Vanessa W.", "I love Bo Lings. It is expensive, but you leave without that \"I'm dying\" feeling you get with a lot of Chinese restaurants. Food is high quality and delicious. I love the Empress Chicken and this is the only place I've found around KC to get sizzling rice soup (om nom nom!!!). The restaurant is nice, although parking can be annoying since it's in Zona Rosa, but they do offer take-out."], ["Grant F.", "I've loved BoLings for years.  Poor service and so-so food tonight.  Not nearly as good as City Market or Plaza."], ["Chavah A.", "This place had fast food prices but the food was fresh and hot and fantastic! If you're looking for something better than a buffet but nothing too expensive this is your place."], ["Jay D.", "Above average Chinese food, but the service was outstanding. They had our dinner to us in minutes after ordering and it seemed fresh and made to order. The portions are family styled, which was a bit much for just my wife and myself. I would have preferred the ability to order more in a bento-box way (sorry for mixing cultures, but it is descriptive)."], ["Cou P.", "I thought I will never step into this restaurant years ago, because I thought that was just for American people, but I was wrong and found it was quite authentic for authentic Asian.  :)Since my girl friend invited me had lunch here 4 years ago, I just keep on coming back here when I am too lazy to cook or too lazy to go far for authentic Chinese food at Overland Park / Lenexa area.We just had dinner here about an hour ago and very satisfy of NO WAITING because we were so hungry after came back from hiking trip.We had Sichuan Dan Dan Noodle with Pork,  Long Life Noodle Soup, Tofu Family Style and Sichuan Eggplant and Tomato.  Details please refer to Bo Ling's Menu and my photos.I highly recommend of Sichuan Eggplant and Tomato, very healthy and tasty. I always order this dish whenever I am there.  Both my family and friends all like it and recommend it to their family and friends too.Dan Dan Noodle with Pork is a must because I love noodle.  I had tried Dan Dan Noodle at few other Asian restaurants from Kansas to Minneapolis, but I still come back to this location.  I am hooked with this one and will never try Dan Dan Noodle at any other place anymore.  (Unless I found a better one?)Long Life Noodle Soup has shrimp, pork (or chicken?), Napa cabbages with a stir fried egg on top of the rice noodles.  I don't know American people will like it or not, but I am certain that most of the Asian will love this dish.  We called it \"Tang-Mi-Fen\" in Chinese.Overall, this is a nice place to come to enjoy your meal.  Host(ess) and servers are all friendly.  Chef follow your special requests (like: no MSG, lightly salt and smaller portion...etc.)We will definitely come back here to have lunch or dinner with family & friends.Hope you all enjoy your meal too. Happy eating!!"], ["Brittney H.", "You guys, I live in Chicago so I'm going to come off as pretentious when it comes to food. Oh well, I've earned that right! Nothing compares to some authentic Asian food, this is not that. However, for a Kansas City chain, I was quite pleased. I actually went here twice in one weekend and had good service both times. The mai tai is huge! I appreciated the brown rice option. I love all crab rangoon but these did not have an overly crabby flavor and had just the right amount of cream. Yum!"], ["Tim B.", "I had general tso's chicken.  it was very tasty. service was pretty quick. solid \"upscale\" Chinese. The KC version of a PF changs."], ["Shari H.", "About what you would expect from a middle-of-the-road Chinese food chain.  The food tasted OK, but my lunch that was listed as spicy was super mild.  It wasn't really bad, it just wasn't that good either."], ["Sean S.", "Growing up in Kansas City in the 70s and 80s, there were two Chinese eateries that were tops in the city.  The House of Toy which was on the Plaza and owned by the legendary Harry Toy and Bo Ling's in the Board of Trade building.The House of Toy has long since gone and Bo Ling's is still in the board of Trade building...  And a few other places now.  The quality has not suffered, in fact it has gotten better.Now I am spoiled when it comes to Chinese seafood dishes having lived in San Francisco (in the Sunset AKA the Asian neighborhoods) and Seattle.  Here you often find the prawns (aka Shrimp) have a mealy texture due to being frozen and not properly stored.  The other night, I ordered Shrimp Lo Mein and Shrimp Rolls from Bo Ling's and the shrimp were moist and succulent as they should be.  It took me back to my favorite place, Chan's Palace in Woodinville, WA.The Zona Digs are more upscale than I recall the BOT location, but the staff are nice, accommodating and food is prepared very fast.Bo Ling's brought back a little of my KC youth and my West Coast love of seafood.  Harry Toy's legacy is in good hands with Bo Ling's."], ["Megean W.", "It's nice to enjoy Chinese without fighting others for tepid buffet food. Bo Lings is higher quality, sit-down Chinese restaurant with a relaxing, delightful ambiance. My husband and I are never disappointed when we dine here. I love tea, so I was pleased to see that they had a nice assortment. Some include Peony Organic White tea, Premium Organic Pearl Jasmine, and Chrysanthemum and Gojl Berries. My favorite is the Green Oolong. The food comes in large portions that are easy to share. What is also nice is that when the menu says \"spicy\", it's actually spicy. . My husband ordered the Sichuan Wonder Chicken. It was spicy and yummy.   I ordered the Mandarin Chicken with white rice. It is sweet chicken with shredded carrots and bean sprouts. It was delicious. This location also makes homemade cakes and cupcakes."], ["John H.", "We went their for our anniversary this year and will be back.  It was one of the better oriental foods"], ["Ian P.", "What a splendid place to write my first review for since moving to Kansas City a few weeks ago. I only hope I can do my new Community Manager proud. Although a chain, I believe it is local and is well worth a visit. Much like the nationally recognized P.F. Changs, Bo Ling's Chinese Please offers up a menu that is easy to understand and does not overwhelm you with 100s of options. They keep it straight to the point. My wife started with the chicken wonton soup while I snacked on the over-sized crispy noodles which were \"crunch-tious.\" My wife said I should have gotten the soup to combat my cough that has been lingering a bit too long. Next time I will.For the main course I had the delicious Mandarin Chicken served over bean sprouts, sliced carrots and I think there were some bamboo shoots in there as well, alongside some sticky white rice. I must say they did not overload you with sauce to hide any of the natural flavors but more so to enhance it. My wife had her favorite staple Chinese food known as none other than Sweet and Sour Chicken served over carrots and only a small morsel of pineapple. (She would always like more I think.) Again the sauce did not overdo the taste or make the chicken soggy, but kept it just right. Again, this was served alongside sticky white rice.The service was quick and speedy and I think that may have had to do with the fact we were dining right before the Saturday night rush at Zona Rosa. The server was on top of my Sprite refill and the only thing I would ask for next time from my server was a little more eye contact. I felt the server's eyes were roaming a bit too much and did not make that personal connection with me. Other than that, we will be back to sample even more things on the menu.Thank you for a hearty welcome to the KC area."], ["Cheryl L.", "Being Chinese, I think I've eaten enough Chinese food in my life to assess good Chinese.The Bo Ling's I went to in Zona Rosa, a suburban strip mall was trendily decked. It looks almost identical to PF Chang's in the city with sleek minimalist tones of slate and dark brown marble and wood, and a few obligatory booth seats for larger groups. No complaints there. The food is above average for Americanized Chinese. Both times I had fried eggplant, hot and sour soup, braised pork wanton, braised beef, stir fry veggies. Bo Ling's doesn't pretend to be authentic Chinese you find in Beijing or Shanghai. But for Americanized Chinese, it fares well. The portions though, I felt were quite small.Price is slightly above average. Expect to pay about $13 a dish.  Service is lukewarm. Efficient, but distant. I will go back simply because it's decent and has one close to me, although it can't compare with the truly authentic ABC Cafe in Overland Park, which is a further drive."], ["Corbett H.", "Food was just acceptable. I tried a few things and found my shrimp meal flavorless. I was disappointed with my meal."], ["Stephanie W.", "I love Bo Lings, and here is why. It is convenient, the food is consistently good, and the service staff is friendly and warm. We regularly get the chicken fried rice. One order will feed three people easy. It is a quick nice meal for busy college/professional family. The other reason I love Bo Lings, is it is a local tradition, which you will not find at PF Changs. Love the new local collaboration with Christopher Elbow, and the Glace creations. Honey Green Tea ice cream is something to enjoy on a hot summer's day. The Bo Ling's pan fried noodles are delicious and include nice plump shrimp, slices of beef and chicken, and crunchy vegetables. The decor is nice, and no weird contemporary music like at so many other Chinese restaurants. You can actually have a conversation with your dinner partnters. Bo Lings will always be a family favorite in my house."], ["Mark W.", "So we did take-out. I ordered the chicken and shrimp hunan style while the wife got beef and broccoli and we shared a chicken fried rice. Not bad, but not as good as expected since this looks higher end and I was thinking more like PF Changs.All portions were good for sharing (or leftovers) and the chicken fried rice had thin fillets of chicken-Not just random bits making it a mini meal in of itself.The hunan chicken/shrimp was listed as spicy but plain as Dick and Jane. The Beef and Brocolli looked and tasted good (not great).Two meals, rice, chicken fried rice was $38. Not sure I want mediocre Chinese that bad but good enough to warrant at least 3 stars..."], ["Fred D.", "As part of my effort to try every restaurant in the NW Barry Road corridor, I came for a late lunch to Bo Lings. It's not hard to find on a corner in the Zona Rosa.  For four quarters I was able to park at a meter right outside.  The dining room is very attractive with accents of Asian decor. I was greeted promptly and I was seated right away along the windows so I could look out at the passersby in the Zona Rosa.  I ordered pot stickers and moo shu and because the pot stickers take longer to cook, I chose to be served the moo shu first. Not the best ever moo shu, but pretty good and while I like \"rolling my own\" my server did an efficient job of filling the pancakes and rolling them. Both dishes were served hot and each was flavorful and delicious.  After the really fantastic moo shu I had in Columbia, MO nothing compares but it was still pretty good and I enjoyed my meal at Bo Lings. The moo shu alone would have been enough and I probably should have skipped the pot stickers though they were really good as well.  But it was still affordable as it was reasonably priced for \"upscale\" Chinese food.  I'll likely visit again especially after my bad experience with China Wok."], ["Deana W.", "I standardly go to the Bo Lings on the Plaza for Dim Sum. This is a must do for ANY self respecting foodie. If you have never been tried it...do it this Saturday or Sunday 11:00-2:00.  Having said that, I ordered the  Gong Bao Scallops and Shrimp and the Pork Dumplings at the Zona Rosa location.  I thought the portions were large (I took half my food to go), and the ingredients fresh.  The green beans that were served with the dish were the best I have ever had, and I am not a huge green bean fan.  The scallops were very tender, cooked perfectly, not an easy task.  The dumplings were tender and flavorful.  The food was yummy, when I'm in the mood for Chinese, I will go back and try one of the many other offerings that my son recommended."], ["Shelley Y.", "Put your seatbelts on folks...My husband and I went out on our long awaited date a couple of weeks ago and decided to try Bo Ling's at Zona Rosa.  After thoroughly enjoying 2 fresh warm crab rangoons our entree's arrived.  I ordered chicken pad thai minus the tofu and my husband ordered seafood fried rice.  It was okay.  Just as we were talking about the large portions for the price and how we should come back to try other dishes... AAAAAAAAAAAAAAAAAAAAAAAA!!!!!  A stabbing pain went through my mouth.  I couldn't imagine what could be causing me so much pain.  I reached in my mouth and pulled out an object that had no business in my food.  It was a rusted and bent STAPLE.  It had hidden somewhere amongst the noodles and chicken and wedged itself in my upper gums.  After informing the manager of the situation, he decided to remove only my entree from our bill.  My husband informed him that we were not paying for any of our food.  The manager couldn't understand and actually said \"There's nothing wrong with the rest of the food\".  My husband's quote was \"There's something wrong with everything when you allow a staple into my wife's food\".  So after agreeing on non-payment we left and immediately warned away a young family from a possible emergency room visit for their toddler at the hands of the inept Bo Ling's staff.  We made it half way down the block when the manager comes running after us screaming \"Sir!, Sir!\" He wanted us to know that our meal was free but he was \"going to need that staple back\".  My husband still had it in his hand and told him in no uncertain terms that he was not getting the staple back.  A few passersby offered us wishes of good luck and I prepared myself for a tetanus booster.  So we will never eat at Bo Ling's again and we hope you don't either."]], "China Feast": [["Kelsey C.", "Wasn't sure about this, but ended up being awesome. Got the general tso's and it was really delicious! They do offer steamed rice instead of fried if you want it. It looks a little shady on the outside but service was good but I really enjoyed it!"], ["Jo T.", "If you are ever craving Chinese takeout, look no more. China Feast has THE MOST AMAZING spring rolls! It's a must if you go there, along with the lo mein (~$7). Something to keep in mind about the lo mein is that the portion size serves like 2 people. I was not expecting that, so my friend and I were shocked when we opened the heavenly smelling box--leftovers for days...We also grabbed Crab Rangoon, an essential for a Netflix/takeout night. Pretty tasty and definitely hits the spot as well. Only other side note about this place is that the drive thru is a bit tiny and not really ideal to dine in (there's some seating outside). I can confidently conclude that I would go out of my way to eat at this place."], ["Abby D.", "This drive thru Chinese restaurant is not bad for the money or convenience. It's not the highest quality of food but the prices are very reasonable. Very few Chinese food places offer a drive thru and are as quick as this location. The majority of the times I've been here, which is quite a lot since I work nearby, the food is pretty consistent and staff is always pleasant. However, there have been a few times that I've ordered the Sweet and Sour shrimp and it has been very undercooked. I've since quit ordering that entree but haven't had much trouble with items like general chicken and crab rangoons. If you have a large call-in order, you should pull around to the left of the building for pickup. For regular drive up orders, you should pull up along the right side of the building as you would for standard drive thru service at most places."], ["Yembur A.", "I don't know what people are expecting from a **drive-thru** Chinese restaurant, but if you keep in mind that this is essentially fast food, China Feast is great! They give you so much food for a low price, and it's nothing fancy but it tastes fabulous. When I lived closer to it, China Feast was my go-to comfort food for binge watching TV or studying. Quick, easy, cheap, piping hot and I could go grab it in my PJs without getting out of my car!"], ["Dono P.", "Really good General Tso's chicken. I ask for extra spicy and it truly is spicy to me, without losing all its other flavors. Best to go when they're not going to be busy because you can sit in your car for 10 min. It'll be fresh, but so will everyone else's, in front of you. Unique little spot and I've had other good chicken and pork dishes there."], ["Zephyr Z.", "So if you're expecting high quality, premium chicken and beef,  or if you're just picky about your meat, then this place is not going to impress you. It's not bad or anything,  it's just kind of rubbery, a little stringy, not quite the all white meat, succulent chicken you might get from panda express. That being said, if you're okay with sub-par chicken, everything else is pretty fantastic. The sauce on the generals chicken is the perfect consistency,  sweet and spicy and gooey. And did I mention that you get a ton of it? I mean a huge styrofoam container almost overflowing for about $7, plus depending on what your order, usually you get one Crab Rangoon and two heaps of rice. It's a good deal. Something else to consider: the Drive thru is fast. It's faster than almost all of the other Drive thrus in the area. This is pretty great if you want food quick and don't want to leave your car. The area isn't the greatest and it's a little run down looking but don't let that deter you. It's a hidden gem."], ["Logan R.", "If China Feast is not on your radar, you need to be sending out a stronger ping. It's exactly what it says it is, a feast. The food is delicious and relatively cheap ($6-$12). A single dish could easily be split between two people. If you're dying to get some tasty Chinese that will fill you up, this is it! Oh and it's a drive through/walk-up."], ["Michael P.", "Five pounds of piping hot general tso's chicken. Are you kidding me? This place continues to amaze me. Love their food, service, and location!"], ["Christopher V.", "Their prices have significantly increased from when I used to go there. The address is wrong on Yelp as well. It is actually 200 East Linwood Blvd."], ["Rachel B.", "Place was quick and neat that it's a drive thru. But overall it was ok. Will I eat here again? Probably not."], ["Rikki J.", "My husband and I had a craving for Chinese food while he was in town and had a horrible experience at steam bowl (on independence ave) in the past. I was skeptical, but we went for it because I've passed this place many times in the past and there was always a line. The food was GOOD!! Prices great and service just as great. Our food was fresh and hot. My hubby was happy. Cheap and good! It'll definitely be a place I go to when I crave Chinese... At least while I'm in town!"], ["S M.", "Good Chinese food, huuuge portions, cheap prices. Don't let the blahness of the place deceive you. It's my favorite stop for quick Chinese take out despite the fact that I live across the street from Po's and Blue Koi."], ["Hannah C.", "I got a GIANT box of beef lo mein, a side of rice and a jasmine tea for 8 bucks?! And it's good?! Woah dude!!! Don't let the trashy appearence fool you; this place rocks!"], ["Brigitt A.", "This map and address can not be right. It's East of main, on Linwood, across from taco bell."], ["Kelly G.", "Surprisingly delicious. The outside of this place could scare you away, but the food is on point every time. Only concern was that the guy handling money at the drive thru was also frying food by tossing it in with his bare hands. Love this place!"], ["Dennis C.", "I ordered the beef with broccoli once and it came with a piece of gravel the size of a molar."], ["jennifer c.", "I was skeptical because this is a drive thru Chinese restaurant.  I only get the chicken fried rice and crab  rangoon. The are both excellent and crab rangoon is my favorite in KC . The food is very fresh and have always had good service."], ["Melissa P.", "This place is a little intimidating since it is a drive through. Although it seems it could be shady, I had heard great things and went for it! I got orange chicken with fried rice and crab Rangoon. When I saw them pulling the chicken out of the deep fryer I was concerned they were reheating old chicken by throwing it in hot grease for a couple minutes. To my delight, it was so fresh and hot! They could have put less sauce on the chicken since it was drowning in it but I just tossed some pieces in my rice. The chicken was tender and the rice was fluffy! I did come across a few fatty weird pieces in the chicken but with chinese I've learned that's to be expected. The portion was very generous! I will be back!"], ["Christopher M.", "Everything was very good. Hot and fresh. Price is great for the amount of food you get. Presentation was great. Don't let the exterior look of the place deceive you. I got the food just 4 minutes after ordering it. The only thing I wish is that this place starts doing delivery."], ["Roz A.", "I just enjoyed the best combination rice noodle ever. The vegetables were fresh and the meat (shrimp, beef, chicken) were cooked just right. I also had fresh springs rolls and crab ragoon. I get better service here at a drive through than at a place for sit down dining. This is the place for fresh fried noodles ,etc. Quick service and plenty of great food for your money.."], ["Heffe J.", "Good deal and good fresh chinese food with a drive through wish they were open later.  The twice cooked pork and kung pao beef are my favs."], ["Ha D.", "Oooh, ever since I went to San Francisco last year, I've been jonesing for some Shanghai noodles like a mother.  This place is heaven. It's in a sketchy neighborhood, so good thing that it's a drive-thru.  Everything is made fresh and the prices are cheap.  I had the combo rice noodles with shrimp, beef and chicken.  They stuff the box, and it is so heavy.  I've been eating it for 2 days.  Great place for your Chinese food fix!"], ["Sabu S.", "This by far is the best place to get some awesome cheap grub! Crab Ragoon is good..just can't beat this place! It's ghetto but good!"]], "Bo Ling's Chinese Restaurant": [], "New China Star Restraunt": [], "New Peking Chinese Restaurant": [], "Rainbow China": [], "Bo Ling's City Market": [["Ayman A.", "When I go to an Asian restaurant I value portions, taste, and price. Don't give a shit about anything else.That place had rather big portions (coming from a fatass like me), price was not bad, and food tasted alright. Their noodles selections was pretty decent, and their fried rice was good! Service was good too. Go hungry, and you'll most probably leave satisfied..."], ["Courtney R.", "Unauthentic, loaded with grease, so breaded it was unpalatable are just a few of the problems. My husband literally picked the breading off his chicken to find tiny pieces of chicken hidden within. The honey sauce was simply honey with no balancing flavors. This was the honey walnut chicken. But, it was the same with the General Tso's he had a year ago. My vegetarian Singapore noodles were surprisingly not drenched in grease (as my eggplant and Szechuan green beans were before), but lacked flavor. Our take out tab was $28. After swearing this place off once before, I am sorry we tried it again.Never again. Really."], ["Lisa F.", "Biggest day of the year downtown KC and BoLings decides to short staff. Waited nearly 2 hours for cold food. Awful experience"], ["Andrew M.", "Tried the Spicy Mongolian Beef lunch special for carry out today. You get the standard sides of rice, crab rangoon, and egg drop soup and that's practically it....serious it is! The actual portion of beef was incredibly small, especially for a Chinese restaurant. Also, I know that Chinese food tends to be very salty but this stuff made my tongue burn, it was so sodium-laden! Higher than average prices, lower than average portions and quality. Next time someone asks me if I want Bo Ling's, Chinese Please! I will emphatically say \"NO, thank you!\""], ["Justin L.", "Terrible. I started this review a few times trying to use words like \"poor\" or \"unauthentic\", but I just couldn't find a more accurate word than \"Terrible.\"The food... overly sauced, overly breaded, too tangy, etc... I ordered the string beans, the Hui Style lamb, white rice, and a friend rice (I need the variety to test out food). I'm a big fan of spiced lamb and lamb meat in general, but this dish was especially disappointing. Unexpectedly, the dish was breaded, and some pieces seemed more breading that lamb itself. The dish was also extremely saucy, which means the flavor of the spices and lamb were completely concealed. I could have been eating beef, chicken, or cardboard, and with that much sauce, I wouldn't have noticed the difference. Sadly, the string beans were probably the best. Which isn't saying much. The other dishes were just kind of... bland, nothing a fast food Chinese place couldn't make.The venue... located in the city market, so it's somewhat convenient for anyone who lives downtown. It's a large venue as well, so if you want to bring a large group out and have bad Chinese... they can definitely accommodate!Overall... I'd rather have Panda Express, same style, just faster."], ["Lyla T.", "Had a wonderful experience eating here. I'm celiac, allergic to egg, dairy, and several other foods. That staff was great and found a dish I could eat. That were very careful not to cross contaminate me. Staff was friendly and restaurant was clean. Another option for me in KC!"], ["David W.", "Good solid Chinese restaurant, upscale decor I have the cashew chicken and brown rice egg drop soup crab Rangoon $9.95 Service was prompt and attentive. Taste of the food was good. The table was not clean and could tell that they haven't been cleaned over a long period of time. Not good. If I were in the neighborhood wanting Chinese I would return but I wouldn't go out of my way to go there"], ["James D.", "After living a block away and being able to see Bo Ling's from my window I've made my share of trips. This place rocks, it is probably my favorite place to get Asian food unless I'm looking for a bucket of fried rice for 2 dollars.If I had to give 1 pointer it would be that the portions can easily feed 2 people for most of the dishes. I think they are family style but I eat a lot so if I have a little faith in myself anything can be a dish for 1.Bo Ling's excellent best at making odd dishes accessible to new adventurous eaters. They have a wide range of dishes from a standard fried rice, generals chicken, Pad Thai all the way to beef tendon, pork buns, chicken feed and turnip cakes.I almost always try to get 1 plate of dim sum while I'm there to try something new. Most recently I tried the turnip cake which was actually quite lovely. It's shaped like a piece of cake but it made with soft turnips and fried to a light golden color in a pan. It also has a shrimp flavor to it. Its somewhat of a fishy dish but still very good and not too heavy on the stomach although it is dense and hot.My other favorite is probably the Beef Chow fun when I feel like some noodles. Strips of beef mixed with a thick dark sauce and very thick strips of noodles. This is always a solid go to dish for me along with the Pad Thai.I haven't had a bad dish at Bo Ling's yet. I've even done the thing where I order something that I have no idea what it is. It ended up being thin bean noodles topped with ground beef and a dark sauce. It was not what I was expecting but it still ended up being super tasty. TL;DR if you're looking for somewhere to expand your Asian experience outside of General's chicken, go to Bo Ling's"], ["Amy G.", "I love Bo Lings. Obviously the food is great but it's also a great place to chill out after a long day's work. I particularly like the decor in this specific Bo Ling's. I usually get crab rangoon, meat dumplings, mongolian beef and general tso's chicken for my husband. It's a little pricey but it's enough leftovers for another meal the next day."], ["Edwin V.", "Came in on a recommendation so my hopes were high. The meal was great! The mongolian beef was tender and had a little kick. It is accompanied by white or white rice and upgrading to fried rice is not an option it is a separate dish. Which was concerning until the massive portion comes out! The rice was cooked really well and had plenty of its ingredients. Beer was good, had a Sapporo and it never dissapoints.  The service..... Once seated the greeting took around 10 minutes. My waitress kept addressing me by \"honey\" , not sure if the region or her but could have done without that. The weirdest thing is it took another 5 minutes to get my brew but the meal was there in 2 minutes. How do you cook an amazing meal so quickly but it takes so long to bring me my brew.Will I be back? I yelped at least 5 restaurants in the area that were either closed by the time I got to them at 8pm or permanently closed. Its a very weird, \"I am Legend\" type of city. Its friday night and no one is out. We shall see what tommorrow brings."], ["Nina W.", "Met a friend for lunch here on a Tuesday.  There was construction going on in the River Market area, which made it more difficult to find a parking spot.  I hadn't been to this location in about 3 years and was looking forward to the food.  I was underwhelmed.  I remembered their fried rice to be so much better than it was.  The General Tso's chicken was good though. The service was good.  Our waiter was attentive and seem to be considerate of the fact that we were both probably on our lunch breaks.  He brought both our food and our checks in a timely manner.I will probably be going back for lunch during the week, simply due to the convenience of the location."], ["Crystal C.", "Finally had a chance to visit Bo Lings this last weekend.  My husband & I wanted to top our weekend off w/a romantic dinner.  Luckily it's only a few minutes from our house in the City Market/River Market area which we love to visit. The restaurant itself is a quaint, classy little place & I'd say romantic due to the dim lighting.  Staff is friendly & prompt.It was happy hour so we tried the crab rangoon & shrimp rolls.  Crab rangoon was so good & HOT.. rarely do you get crab rangoon & it's FRESH!  The shrimp rolls weren't my favorite only b/c Im not a fan of seafood.  The mustard they give to go with the shrimp rolls.. BEWARE!  It'd be nice if they told you how hot it is but they don't warn you so eat it at your own discretion.  I ordered the curry chicken for my entree & it was good a little spicy like i like it but the sauce wasn't what I was expecting.  I'm used to ordering this dish at either a Mediteranean or Indian establishment so it's base is a cream of some sort.  Either way I was pleased w/the dish.  My husband ordered the lamb dish & we weren't impressed b/c they deep fry it & to us that takes away the tenderness & flavor of lamb.  Traditional chinese dishes may cook it that way i'm not sure.. but its much better NOT fried!  Next day it was chewy, not to pleasant considering the price you pay for the dish itself.  The deep fried egg plant was yummy although that came w/the lamb dish.  Shall return especially to eat some more of the crab rangoon & try their famous signature chinese dishes like the general tso's chicken."], ["Jennifer S.", "All I can say is.... I want to shove the crabrangoon in my mouth all at the same time.  I have class, I wouldn't do that... in public.  Bo Lings is my go-to Chinese restaurant no matter where I am in the metro area.  Yes, I know, there are complaints about it not being authentic, but regardless it is wonderful!  All the years I have been going there, whether it was eating in or take-out, I have never been dissappointed.  Only  when the crabrangoon is gone. I don't even know if I am spelling that right....Anyway, the City Market location is great.  They have a modern atmosphere and a wonderful bar if you want something casual.  The outdoor seating is lovely for spring and summer dining.   I recommend the Dim Sum on Sundays!  Love it and it is reasonably priced and a bit more \"authentic\" than the general menu.   Telling you which dishes I recommend would take forever.  I love a lot of them, but if you haven't tried it before go with something you know.  You won't be dissapointed.  Lastly, please for the love of food, don't forget the crabrangoon, lettuce wraps, or spring rolls!"], ["Jordan B.", "Definitely a classier twist on the typical Chinese restaurant. It was surprisingly dead when we went in on a Saturday night, so the waitress had no problem being attentive. She lined us up with some yummy sake and vietnamese spring rolls to start out, both which were good. I had chicken pad thai and the Singapore Sling cocktail, which was delicious! Overall, I thought the food was good quality and tasty, but it just didn't blow me away. I also wasn't expecting to spend so much money here, but perhaps I shouldn't have ordered so much alcohol? I'd like to come back to try some rice and dumplings. Based on other reviews, it sounds like I need to check out the lunch specials as a more wallet-friendly option."], ["Jesse T.", "It's ok, I guess...reminds me of a pf Chang's (not a good thing) salty, Americanized, and a bit overpriced...essentially an exercise in mediocrity...are there any good Asian restaurants in this town???"], ["Jemmie W.", "I'm Chinese and was taken to this place by another Chinese person who had been here before several times. Walking in on a Monday for lunch, my first impression was, \"Oh no. We're F'ed. We are the only yellow people in here.\" Ultimately we were pleasantly surprised.The various dimsum dishes were actually very good. A solid test is that they had chicken feet and it was actually very, very good. The other dishes like the spicy fish soup were also very good.I suspect there are a lot more yellow people in here on the weekends but on a weekday it's mostly office workers. The food here is fairly authentic."], ["Daniel H.", "3.5 stars.I've always passed by here when I was in the area but never went inside until recently.  I ate lunch here with 2 of my coworkers and it was pretty busy around lunch.  I ordered the Spicy Curry Chicken ($8.50) from the lunch menu while my coworkers both ordered the General Tso's Chicken ($9.00) and we split some potstickers ($7.00) which were actually called Pan-fried dumplings.  The items on the lunch menu came with egg-drop soup (or for 55 cents more you can get another crab rangoon or hot and sour soup), crab rangoon, and choice of white, brown or fried rice. The egg-drop soup was good and I finished it in no time.  Later, the potstickers came out and they were good as well.  My Spicy Curry Chicken was just okay and not really spicy.  The curry was very soup-y and not as thick as it should have been.  My coworkers' General Tso's Chicken looked pretty good and I think I'll have to order it the next time I decide to eat here.  The service was as fast as it could be on a busy lunch time.  Overall, I thought it was about the right price for the amount of food you get.  Next time, I'll try the General Tso's Chicken because my coworkers seemed to like it even though they both couldn't finish it."], ["Melody C.", "Meh, is right. First they ran out of cherng fun (rice noodle). Ok, we can get something else. The food tasted \"off\" for almost every dish. It was like they tried but it just wasn't doing it. To top it all off you have to pay for tea!! WTF? I'll stick to traditional dimsum restaurants from now on. Our bill was quite pricey for only 3 people (around $50).I'm Chinese and have been eating dim sum all my life in all places. Hong Kong, Chicago, Honolulu, Los Angeles. This is defintely a place that is not worth your time."], ["Ellen S.", "Things I love about Bo Ling's:1. It's local2. The Honey Walnut Chicken is delicious, both fresh or as leftovers. 3. Great patio space4. It's in the city market and open past 5pm (usually open til 9-ish)Things I don't love about Bo Ling's:1. The prices. I've paid as much as $20 for an entree & soup for one.2. Service is occasionally slow, both for lunch and dinner, no matter how many people are in the restaurant.Generally I like going to Bo Ling's, but I feel like I have to save my pennies for a special occasion, or I have to remember to hit up happy hour (which goes til 7pm!). TL;DR - hard to justify the prices for most items. I love the honey walnut chicken!"], ["Jimmi H.", "Chinese Please!  Bo Lings is my go to carry out chinese place.  Basically across the street from my loft, I love the convenience of good chinese food.  The Market area is severely lacking in quality delivery choices, so anything that is within walking distance, and has a good menu, makes me happy.  The bf and I love the Beef Chow Fun (I do not claim that any of the spellings for menu items are correct) and the crab rangoon.  On our last visit we decided to partake in all vegetarian quinine, which turned out to be quite delightful.  He had the seschwan green beans with tofu, and I had veggie Pad Tai.  I just may have another favorite dish!  Of course we also had sake.  I think the reason I like all of their food is because I don't leave feeling like I need to drink a gallon of water.  Their food is served high in flavor and plentiful in serving size.  Be sure to bring a large appetite, a friend, or be ready to carry some home with you.I have never seen it busy at the Market location.  The two times I have dined in we were one of maybe 4 or 5 tables.  When I have picked up carryout orders it has been much of the same in terms of capacity.  The staff is always cordial, helpful, and quick to get orders out.  On our last visit our server was super; she was right on her game and made sure we had a very pleasant experience.  The one thing I do not like about this location is the bathroom situation.  They are shared with the City Market offices and to get to them one is forced to walk through store rooms and out of the restaurant itself.  Worse though, you will probably be greeted by a bum upon entering the porcelain throne room.  Great food, good staff, and did I mention the Pecan Sandies because they are amazing!"], ["Sharon P.", "MSG in everything  They could not provide any soup or appetizer without it. Cashew chicken was fair. Teriyaki salmon was not overdone, but the sauce was heavy and sweet. Only bright spot was the waiter... Excellent service."], ["Hugh J.", "As restaurant owner - my grand father used to say, \"If I can't service my customer well  - than I should put up the closed sign for the day.\"  I agree. If you are lacking servers, bartenders or any staff for that matter to meet the service demands of your customer - why be open?  While the food was ok (very expensive for so-so Pei Wei-esque fare) the customer service was abysmal. I travel and eat out 3-4 nights a week for work all over the US and Internationally."], ["Jacqueline C.", "I have fed my appetite at my fair share of Asian restaurants. Bo Lings was really just okay. We visited the River Market location as we passed through downtown KC. Our waiter was very nice and the food was not terrible it just was not anything too special. We ordered crab Rangoon and calamari to start. The calamari were like gigantic onion rings, and the calamari itself was thick and it was not pleasant to eat. Everything, which included the Rangoon, friend rice, egg drop soup and the General Tso chicken was good. Note: the entree was not spicy as the menu indicated. I'd go back b/c like more of my reviews I'm a good sport and think that everyone deserves a second shot."], ["Eric R.", "This is one of my go-to restaurants in the Rivermarket.  Conveniently located in the heart of the market  I usually just get carry out, which is consistently ready within 15-20 minutes.  There is a pretty standard collection of choices on their recently updated menu.  I'll usually go with some sort of chicken or pork and have enjoyed everything I've tried.The egg drop soup is delicious."], ["Jennie C.", "This is like PF Chang's, but without the cement horses.I was hoping to order to Beijing (Peking) Duck, as I'd like to see what Midwestern Chinese restaurants have to offer, but imagine my surprise saying that the Rivermarket location does not do Beijing Duck. Thanks for the heads up."], ["Farheen Q.", "Cozy but modern and of course Bo Lings chinese is always good. Also, didn't realize their happy hour goes to close! $2 glasses of wine! Always a good choice in the River Market area."], ["Marissa P.", "Good Chinese food, but not super authentic. The ambiance is fun, the food is good, portions are generous and the prices are decent. Great place to go if you are looking for place with a better selection than your average restaurant. Seems to be much quieter for dinner. The crispy beef and fried rice was very good, looking forward to checking out their dim sum menu next."], ["Pat B.", "I have been here numerous times and the meals and service was always good!"], ["Nicole K.", "Hot tip for the vegetarians: they don't have veggie dumplings on the menu, but they'll make them for you! Great with the accompanying plum sauce.Great Chinese and Asian fusion food. The Tofu Family Style is wonderful. Service is usually good, but occasionally absent-minded.My dad loves the soups, and my nephews clamor for this place when they come to visit in the summer.I love to get take-out from here on my way home. In fact, I might just do that tonight..."], ["jennifer j.", "I have loved Bo Lings from way back.  Not every entree is spectacular, but over the years I have figured out what they do really well and I revolve those items.I live in River Market, so I was so excited this location had opened.  I was slightly taken back by the Fred Flintstone interior, but a unique location calls for a unique interior.  Service can be hit or miss.  It is also important to note that every Bo Ling's location has a different menu.  Oddly, the River Market location offers sushi but I have never tried it out.Carry out is super easy, since there is a separate side door.  You do not have to enter the main restaurant.Love having this option in the River Market."], ["Jennifer R.", "Bo Lings may not be gourmet food, but it always does a good job at satisfying my chinese food cravings. And it's always reliable...I've been here numerous times over the two years I've lived in the Market and have never had a bad experience. The menu offers a wide variety of dishes, and I try (TRY) to get something new every time I come here. I have my favorites so this venturing down the menu doesn't always work for me. My newest favorite is their curry vegetable with brown rice. My go-to is the always faithful pad thai (comes with chicken, shrimp, vegetables or tofu). They also have a great HH, which includes cheap wine (very important). If you happen to be feeling a need for Chinese food and find yourself around the Market, give these guys a try!"], ["Molly K.", "Many restaurant chains aren't the best, but Bo Lings for a chain is very good. Inside of the building are statues and paintings.. Some parts of the floor are made out of bricks. To top that off, when you walk to go to the bathroom, you can see though the kitchen! WOW. Also the waiter was nice. The food came fast and we got beef with broccoli, spicy noodles, Crab Rangoons, lettuce with a stuffing and dumplings.  The dumplings sauce was REALLY spicy! The lettuce stuffing was tasty and was a nice change from the really spicy sauce that's with the dumplings. The beef and broccoli was my favorite thing. The beef was cut up small and the broccoli had been steamed just right. I would go there again and I have gone there many times."], ["Katie H.", "Great lunch menu. You get egg drop soup which is  to die for, egg roll or crab rangoon, and your meal for about $10. Service is usually good here and the waiters are fast! I would recommend!"], ["Emily S.", "I love this place. Their food is consistently tasty and the perfect end to a long, cold day at work. My favorite is to call when leaving work, place my to-go order and swing by on my way home. Viola', I have a perfectly prepared, savory meal that lasts for several nights!My current fav is the pad thai noodles with shrimp. Although it says spicy, I would never consider it spicy, just flavorful (and I DO NOT like spicy food, so you can take my word for it). The tofu is always wonderfully crispy on the outside and soft on the inside while the noodles have a citrus kick with soft noodles and crunchy bean sprouts. My husband and I usually get the large ($18.95) which lasts us for several meals with one 6 count order of Crab Rangoon ($6.95).Although the price is a little steep, it's worth it sometimes, ya know?"], ["Sharon K.", "Although we live in the River Market, I was not eager to try this place because I am not a big fan of Chinese.  However, the bf is, and since I didn't want to drive anywhere (as usual), off we went.The food was surprisingly (to me) good.  I had the pad thai (de-spiced) which I enjoyed, and he had a beef and scallop with veggies thing that he really liked.  I requested to see the Happy Hour menu, because although it was Saturday I am always on the lookout for deals.  It was a decent one, with $4.50 small plates, beer from $2.50-$3.50, $2 off glass wine, some $5 cocktails...and a liquor special, although I forget that one.  Of note, the service was INCREDIBLE (thanks, Austin!).  Everyone was friendly and prompt.  It wasn't very busy when we were there, so I'm not sure how things would run if they were but I was still impressed.The atmosphere is a bit generic, but not unpleasant.  They have nice window seating.Overall, a good pick!"], ["Faith B.", "Before I moved to KCMO, I read about Bo Ling's and how it was a beloved city favorite. When my boss wanted to take me to lunch here on my first day of work, I thought, \"Score!\" We walked over at noon and there was, not unsurprisingly, a wait. The wait stretched on and on and on. There were large tables open, but no small ones and I guess the hostess didn't want to waste those on smaller groups.Finally, we were shown to a table, behind a post. I ordered a Tofu Family Style, marked as spicy on the menu. I asked the waitress for a vegetarian egg roll and she brought me one and also  asked if I ate crab rangoon. I told her seafood was fine and yes, I did. I guess I'd already made my bed there, because she didn't bring me one with my lunch. :( The Tofu was NOT spicy in any way. It was vaguely sweet and the sauce was overly thick. It was, however, the temperature of molten lava. The fried rice was okay. Pretty sure I won't be back. I can get average Americanized food so many places..."], ["Matt E.", "This place is quite a bit different than the other Bo Lings in the metro. The decor is decidedly more urban, reflecting its City Market location. Lots of glass, concrete, and stone. There are a few small touches that will remind you that you are in a Chinese restaurant, but it's done tastefully and not a huge cliche. Great outdoor seating for the warmer weather months, and it's perfect for people watching when the farmers market is in session. I've always had great service when i've dined here, regardless of if i'm sitting at the bar alone or with a large group in the dining room. The food has always been top quality. My personal favorite? Beef Chow Fun. It's delicious and fun to say! The only negative they get is the AWFUL bathroom setup. It's technically not even in their business, as they share it with Winlows and Blue Nile. I'm sure this is something they couldn't work around, part of doing business in the City Market. Still, they're gross, and the mens room doesn't even have proper mirrors, but rather some plastic, vaguely reflective panel that looks like it should be in a truck stop. Probably my favorite place to eat in the Market."], ["Gerard M.", "Menu choices were extensive; food was surprisingly good.  They have some dimsum choices but it's not old ladies going around in carts; you have to order it from the dimsum menu.  The place was packed for lunchtime and lots of parking in the area.  It also has outdoor seating."], ["Polly P.", "Pineapple fried rice. Imagine a Hawaiian love fest. It is served in a half pineapple. I cannot explain the simple complexity of fresh flavors. My tummy was happy for days."], ["Jamison U.", "Always an enjoyable meal here, you really cannot go wrong on this menu. Often a destination for lunchtime (business lunches) for me, the environment is busy enough but not to noisy. Booth or tables are available (as is outside seating and the bar).  The environment is classy, maybe upscale. The service is fair, not great but not bad enough to complain about.The food is always good, again not to rave about it but you will like it. Its not authentic Chinese food (thank god) but Americanized. Dishes are ample and priced well for lunch portions about 12-15 a person (with drink). Overall Bo Ling's is a good lunch time stop.(lots of parking around in the market also."]], "China Wok": [], "Princess Garden Restaurant": [], "Hong's Buffet & Mongolian Grill": [["Bar C.", "This is one of the better buffets out there. The food is fresh, hot and very good. The lunch was crowded, which is always a good sign. It guarantees that the food will be hot. The servers were on top of the drinks and it was reasonably priced."], ["Enrique C.", "I went to this restaurant long time ago; I was happily surprised how they've gave a new \"facelift\" to this place. It looks newer, cleaner and better organized.The Mongolian grill is excellent, with fresh meat that it is not frozen plus the sauces are good.The Chinese cooked plates are always warmed and tasty.Very good food for your money."], ["Jarrod V.", "Great Buffet!  My wife and I enjoyed our visit.We have visited several Chinese Buffets.  Many have a lot of the same menu, it's just the quality that varies.  The quality here at Hong's is great.  Plus, if you want a change-up, they have the Mongolian Grill, which I enjoy.  As a picky eater, I like to know what I am eating, so I like places like Chipotle, sandwich shops, and Mongolian Grills so I can pick and choose what is on my plate.  The best thing is the variety this gives you here.  Want buffet?  They have the standards and they are well done.  Want grill?  It's very tasty as well.I like this place.  We will return."], ["Gaz H.", "A small but perfectly good Chinese buffet tacked onto a Mongolian Grill (you assemble the raw ingredients and we cook it for you scenario). Nothing unhygienic or suspect. The two young'uns loved it and it was reasonably priced. Not suitable for a date or anything like that, but for a pre or post flight meal with the kids, great option."], ["Gene G.", "Rarely go to buffets, they are usually not very good, this place had a wide variety, all well cooked and fresh, would eat here again when in town"], ["Sandy Z.", "I'm writing this review based on the my background of growing up around the Chinese buffet industry. My parents have owned and operated many across the midwest. The food here is very standard for a chinese buffet with the bar of fried options, Mongolian grill, fruit bar, desert options, and then the bar of entree dishes. The one dish that stood out to me as a little unique is the baked salmon in sauce. I was a little disappointed with the limited sushi options, but glad it was there. I was full before I had any fresh stir-fry from the mongolian grill. The spring rolls were crispy and delicious. I wish there were at least some authentic chinese food options. Maybe some chicken feet or tripe would be nice for those who crave dim-sum. Our server didn't say much to us, but she did clear dishes promptly. The host was very nice and inviting. We chatted about my pharmacy rotation in kansas city and he talked about his background long ago as a pharm tech. It may be a good value for the area, but I've had much better chinese buffet for $10 worth. Is this place worth a try? Certainly"], ["Ben H.", "Excellent food, great variety, and can't beat the price!  Definitely plan to come back again!!"], ["Jeanne K.", "Hong's, for me, is a delicious place to eat. They have the peanut butter chicken, yummy green beans and hot and sour soup that is perfectly balanced. They do have all the standard buffet items, as well as the Mongolian Grill which was busy the entire time we were there. O'Dano especially liked the potatoes and corn fritters today. They have fresh fruit and chocolate ice cream that I always take to the car in a cone. I'm glad they resolved their issues with the H.D. because I've missed the food.If you are up North and want a good buffet, give this a try. They do have a senior discount, casual dress, and clean restrooms. My kind of place!"], ["Calvin L.", "Hong's will always hold a place in my heart. For the value of the buffet, it's hard to beat in the Northland. Where else am I going to shut myself in for a plate or two of the usual Chinese favorites and not have any noisy waiters bother me about clearing the table for the next guests? It's hard these days to find a place as comfy as this.The usual fare is there, everything is mostly fried, they have the Mongolian grill that always has a line, the dessert area with random sushi as well. The real treats though begin with the chicken on a stick. Seriously, I believe it's just wok fried chicken, but it just sticks to ya & is so tasty. Though I am concerned by the sudden absence of the beloved peanut butter chicken. I can't get over that loss.No, this isn't a 5 star restaurant, but I don't always want to watch films directed by Paul Thomas Anderson either. This is the comic book movie of places to eat up here, not always highbrow quality but you'll sure leave satisfied."], ["Carrie C.", "I'm really disappointed that this place was suspended on health code violations. I'm hoping that after some cleaning up and training with the health department they can come back from this. My friends and I have never had any problems with getting or feeling sick, so I am still hopeful they can do things right."], ["Scott W.", "Looked everywhere for a place to take our 9 year old niece for a buffet. She raised her GPA and that's what she wanted...really?!? The service was great, food stayed regularly replenished, fresh and quite the variety for all to partake to their liking. The prices are fair for adults and scaled accordingly for children of all ages. The restaurant and buffet areas are both well managed and maintained. Once you've gotten up to revisit another round of feasting torture, your old dishes are gone and the beverages refilled. Go and enjoy the pain and know they proudly post \"NO MSG! within."], ["Mykie D.", "Horrible! I think I have food poisoning! Me and my sister got sick on my last visit to KC. Absolutely horrible and the customer service sucked. We ordered a large to go order ($70) and the same guy who took our order went to the back and cooked the food. We waited forever and the food was absolutely DISGUSTING!"], ["Kati C.", "Health code violations or not: This buffet will always hold a special place in my heart. I proudly stand by my five-star rating. I've eaten here probably more than twenty times and never gotten sick. The food is good, y'all. Straight up good. The fact that there's a buffet AND a wok is a rarity. Pay over ten bucks for HuHot? I think not. Not while Hong's is around. The coconut shrimp and green beans warm my heart. There's so much fried food in warm, sugary sauces and it tastes good. It just does. Now, I'm not going to vouch for the nutrition factor (chances are if you're at a Chinese buffet you're not too concerned at the moment). So if you want a solid experience, go here. It's even got a nice conversation-conducive environment. But chances are, you'll be too occupied ingesting delicious food for much chatter."], ["Crystal C.", "I didn't have to much to complain about aside from the fact that they had a hard time keeping up with the demand of people vs food.  I only got to have one crab Rangoon because of it which upset me a tad bit. LOL!  The hibachi grill (I wouldn't call it Mongolian) is this places BEST feature!  Fresh ingredients to choose from & the chef knows what he's doing! You can choose from your sauce to veggies, protein, oil it's cooked in, etc.  This is hard to find at any Chinese restaurant but all the chicken favorites like honey chicken (which was ok-- a little to sweet for my taste buds) were all made w/white chicken which is hard to find at any Chinese restaurant.  The generals tso's chicken was so-so... To me it was your typical chinese buffet / hibachi grill.  Nothing really stood it out from the rest but quality was better than most.  The Americanized items like the \"potato sticks seasoned with pepper\" which just sounded weird ... don't touch! Nasty, dry, and had probably been sitting there quite a while.  Basically you are getting what you pay for! I went because I was craving egg rolls & crab Rangoon and well you heard my sob story about the crab Rangoon.  As for the egg rolls they were normal just as any other.  Yet they had a bit of a fishy taste.  Gross."], ["Dennis L.", "Great food  - very fresh - wait staff friendly and courteous - very clean nice atmosphere"], ["Randy P.", "My favorite Chinese buffet restaurant in Kansas City. Food is always fresh, excellent Mongolian food and some sushi items, as well!"], ["Levi R.", "The best Chinese/Mongolian Grill in KC.  The buffet has all the staples you would expect but people come here for the Mongolian Grill."], ["Ray C.", "Well worth the price.  Adjacent to Panera Bread so a little difficult to see from Barry Road.Pros- price, variety, quality, flavor, cleanliness, habachiCons- No sushi, crab, or other high end items.  And yes, I know sushi is not Chinese but it has become expected in most Chinese buffets for whatever reason. And yes, sushi from a buffet is ridiculous but its a crazy world we live in and even though I'm reluctant if it looks fresh I'm taking the plunge.BLUF:  You really can't go wrong here.  Perfect price point!"], ["Lisa L.", "Best buffet near Leavenworth/Lansing I have found. Fast friendly service.  Great place to go if you are in a hurry!  The dumplings are really good!!  Lots of options and I have never even tried the Mongolian buffet!  Always very clean too."], ["Zach A.", "Possibly the best Chinese buffet in KC. It's a little on the pricey side, but the food more than makes up for that. Very clean restaurant, especially for a Chinese buffet. Lots of options and all fresh and delicious. I haven't tried the Mongolian grill but my dad assures me that it is very good. Price is the only reason for the 4 stars and not 5. Otherwise, very good!"]], "China Hut": [], "Peking Chinese Restaurant": [["Jessica B.", "I've been past this restaurant dozens of times, but was never compelled enough by the exterior to go inside.  I work a few buildings down from here, and since it's freezing today I decided that I wanted to try somewhere close. My cousin and I were hoping for a buffet, but I read all the reviews online for Peking today and thought this sounded like a good place to try.There was one other couple dining in the restaurant at noon on a Thursday. The lunch menu is very affordale - most entrees are $5-$6 and include fried rice and either crab ran goon or egg roll. I almost always order egg drop soup, but I just had chinese food for lunch yesterday (from a different restaurant) and wasn't satisfied with it, so I decided to order the hot and sour soup. Usually hot & sour is too sour for me and I don't care for it - This was easily THE BEST hot and sour soup I've ever had. It was spicy enough to create a nice slow burn, and I could see the red pepper flakes in the broth. Delicious!The crab ran goon was unlike any I've ever had. It was super creamy and cheesier than any I've had before. It almost looked like there could have been some mozzarella in it because when you pulled it apart, the cheese stretched a bit. I know that sounds weird for crab ran goon, but it was so good! They use the thicker won ton wrappers here for their ran goons. The egg rolls used the thin wrappers and they were good, not too much pepper like many places, but I would order the crab ran goon over the egg rolls any day.My szechwan chicken was very good. The vegetables were crispy and the sauce was flavorful. I like that they included zucchini in the veggies. I was full from the soup and the appetizers, so I took most of my entree to go. My cousin wasn't thrilled with her Sweet & Sour Pork. She said everything tasted \"burned.\" I tasted it and I'm pretty certain that the burned flavor was sesame oil. The service was great, and I enjoyed everything I tasted. I will definitely be back and might bump up my rating to a 5, but I'm holding back on that last star for now.We ordered:Crab Ran Goon (6) $4.49Sweet & Sour Pork $5.50Chicken Szechwan w/Vegetables $4.95Egg Drop Soup $0.75Hot & Sour Soup $0.75Diet Coke (can) $0.80Iced Tea $1.25Total for 2 people with leftovers: $20.27The owner served us and she was very friendly and asked if we'd visited before. When I said no, she wanted to know why we hadn't. I told her I would absolutely be back and bring more people with me.She offered (without us having to ask) to split our bill and even split the order of crab ran goon onto separate checks for us.Don't let the exterior fool you - go to Peking at your earliest opportunity!This restaurant has a great website. Hours, photos, menus...kcpeking.com/index.php"], ["Iskandar J.", "Food is tasty, price is right and it looks pretty nice inside.  Customer service needs some work..."], ["Amanda S.", "I really looked forward to trying this place since had high reviews.  I did like the interior.  It's just like any Midwest Chinese restaurant from the 1970's with the dark paneled walls and printed lanterns hanging from the ceilings.  I thought a huge plus was the white pepper on the table.  My excitement pretty much ended with the the decor and pepper.The Crab Rangoon, reviewed so well, was greasy and lacked flavor.  Yes, it's overwhelmingly packed with cream cheese but it didn't have a garlic and/or chive punch. I had the Hot and Sour Soup.  It was decent.  It wasn't enough either way, hot (spicy) or sour.  It was straight down the middle. I had a taste of the Egg Drop Soup and it seemed to lack flavor.  But with enough white pepper it seemed ok.I ordered the Szechuan Beef.  I was very disappointed in my dish.  It wasn't spicy and overall like everything else lacked flavor.  It had lots of pieces of beef or brown fatty pieces of something among the veggies.  It just wasn't that good.I appreciated the service though.  She was excellent.  For me, this time, the service didn't override the problems with the food.  I'll keep looking for that \"one\" Chinese restaurant."], ["Brad V.", "Very small, very beautiful interior. I was warmly greeted by the owner. I simply asked for dinner, and she (the owner) went into the kitchen. When she returned, she gave me a plate of spicy noodles with beef, chicken, and shrimp. The food was pretty good.After the meal, when she saw the tip I left, she flagged me down and gave me a piece of cake that had just come out of the oven! It was a wonderful experience."], ["Corey D.", "Well.. just called in on a saturday night to inquire about delivery.  The response I received... \"I no do delivery... click\"...   Perfectly understandable but incredibly RUDE."], ["Joshua M.", "When I muster the strength to walk for local food, avoiding the temptation of delivery and drive-thru, it's the service that draws me out.  The food here is delish, but lots of places can give you that.Peking gives it to you at a price a starving artist/waiter can appreciate with the conversation and care I look for to remind me why I moved to midtown.  I'm as much a user of chain food as the next 20 something, but every once in a while I need a laugh and hand shake.  Peking has been around as long as I've been alive, and they've mastered the customer care by now.Support local business.  Reward kind service.  Try the dumplings. :)"], ["J H.", "Been here a few times and the food is always fresh and delicious!! I especially love the crab rangoons, and although its not on the menu, they have no problems with making me steamed shrimp with veggies. Also, the owner is always very nice and friendly!!!"], ["Matthew K.", "This place is basically like a Maneki Neko cat beckoning you with the best crack around; the difference is the crack here is crab ran goons and hot and sour soup. This becomes apparent as it teases you at first and then abrasively lights up your curiosity, making you always come back for a fix and maybe even involve talking to yourself nervously with a slight twitch in your walk (jk).  Located right off Broadway across from some theatre, you can't help but stumble into this spiraling world of Asian ecstasy (Note: There are no drugs here, just food and drink). It feels like a small dimly lit room which may confuse you for a hookah den somewhere in the burrows of San Francisco. As I sat for a moment, I personally felt besieged by modern Feng Shui and crimson light fixtures hanging from the ceiling which made this actually feel more like a cozy oriental dwelling with booths. Once you get through that revelation, you'll likely find yourself in an emotionally charged, yet soothing ambience.Peking is basically run by one highly energized, yet radical lady named Heidi who won't put with your shit, in a nice way. So don't mess around or play stupid when she asks you a question. My advice would be to let her lead you into the promise land, which will inevitably start with an energizing soda in a can which you pour into a chalice and subsequently, anything you choose on the menu. You'll need the energy of the mysterious beverage for what's next. I went with crab ran goons stuffed with what seemed to be mozzarella (A+) and hot and sour or egg drop soup (A). Since it's nearly impossible to order the \"wrong thing\" at this place, enjoy a nice helping of whatever it is you decide on with or without broccoli. The general tso's chicken is definitely high up on my list, but don't sleep on the lo mein noodles. Condiments exist here as well, but the hot mustard felt like somoene lit gasoline in my nasal channel for around 5 minutes (recommended if you have a sinus infection). The cook seems to get yelled at a lot in the back room but what warrior isn't great without a crazy leader?In other words this establishment is awesome and the price is cool too. The only bad part about this place is you may have both dreams and nightmares about your experience, but the nightmares are still pretty cool. Note: I wouldn't recommend drinking excessive alcohol prior to this particular experience. AND KIDS DON'T DO DRUGS DO CRAB RANGOON."], ["Ray L.", "I am writing the review in the restaurant. Owner appears to be Taiwanese, and is very nice to the customers. Food is pretty good, and the best part is the atmosphere - dark enough to make you feel comfy but ain't dirty or beat up at all. After driving 40 min searching for Chinese food, I can't think of anything else to say but just give them 4 stars for saving me from starving to death.On the side note, to demonstrate the atmosphere, this place has served a few movies for taking shots. (even though you may not even know the movies..) But yes, it is a pretty nice place."], ["Michelle G.", "We tried Peking Chinese for the first time this past weekend and WOW I think we've found what we've been looking for... great Chinese in KC at a reasonable price! First off, the decor in this place is great. It looks like it's been the same since they opened (22 years ago according to our waitress). It is definitely a hole in the wall, but in the very best way imaginable. The food was awesome. Their crab rangoon beats the hell out of the Sysco crab rangoon all of the other restaurants in KC serve. Hot and sour soup was delicious too. We got a szechuan combo (shrimp, chicken, pork and veggies) and orange chicken for entrees. Loved the szechuan combo and would get it again. The orange chicken was good, but probably would opt for something else in the future. It seems like you can get almost everything on their menu more or less spicy to your taste. Service was very quick and personable. We can't wait to try more off the menu and will be back soon!"], ["Andria N.", "This place make some good American Chinese take-out food.  I have had the chicken and veggies and Kung Pao Shrimp and both were excellent. I am sure everything is good, but I can't mess with perfection and that is why I always get the same thing. The crab Ran Goon and egg rolls are also worth ordering... Most importantly, this place is cheap and the portions are huge!!!!"], ["Melissa R.", "great atmosphere. big portions. fabulous price. plus, the Brillo pad for sale on the wall makes me smile."], ["Traci M.", "I just went to this place.  The lady who helped (barked at me)  me was rude and nasty.  I will never ever come back here.  If I asked a simple question about a sauce  all I heard was \"you have to pay you have to pay \".  Asking about something and wanting it are two things.   Of course after she got my money!  I would have gotten my money back if I could have.  However shimp toast was good but not worth my money just on pincipal!"], ["Forrest C.", "After reading all these great reviews I went there for lunch today expecting the best chinese food in KC... but what I got was a sloppy mess that tasted like it was cooked the day before.  If I want left overs I can look in my refrigerator.  I ordered the General Tso's pork (Lunch menu) and the breaded pork was soggy.  Tasted like it had been microwaved.  The fried rice tasted like it had been setting around for a day or two, it was stale.  The one good thing about the meal was the Spring Roll.  It tasted fresh, unlike the rest of the meal."], ["Filipina P.", "I don't know what restaurant Mr. Adventure went to, but this place was just not up to his hype! My husband and I went here for dinner and the place was empty on a Thursday night, except for one couple eating at a booth and a couple of other people waiting to pick up their orders. It was dark in here and the wood paneling on the walls made it look like it hasn't been updated since the 1970s. There was only one woman working, and she was trying her best to wait on tables and the counter at the same time. My husband ordered the orange chicken, but what we got was chicken nuggets covered in an orange-colored, gelatinous sauce. The triple delight that I ordered was much better -- lots of meat and vegetables stir-fried well. The sauce, however, was bland and lackluster.If you're looking for Chinese food in the popular Westport area, try again."], ["Jenn D.", "New Peking may be the best Chinese restaurant in KC. The service is very good, the prices are reasonable and the food is great.  I'm a fan of their steamed dumplings and they have pretty good pad thai.  My wife and I have eaten here on a weekly basis and have never had a bad experience."]], "Chinese Garden Restaurant": [], "Red Dragon House": [["David A.", "LUNCH SPECIALS ALL WEEK LONG! Yes, even on weekends and holidays. Lots of food for the price. However, I haven't tasted anything really amazing yet. I've had the triple delights on low mein, on rice, and sweet n sour chicken (didn't like this one). Hot and sour soup isn't spicy, but VERY VERY YUMMY. Best I've ever had. They make it different here.The duck sauce isn't so good :( It's pink???!!!???There's one guy there that works weekend and during the week with a ponytail. VERY friendly and amazing waiter. He'll tell you all about the area and chat your ear off. The other staff is nice, but OK. Food is brought out VERY fast despite being busy for lunch. However, NO WAIT to be seated. They are VERY slow to take your credit card and return it."], ["Maria P.", "Ohhhh the crab rangoons at this place I could eat every day. So far, it's my favorite Chinese restaurant in Kansas City. My boyfriend and I like to try schezwan chicken at every chinese restaurant we go. They didn't have it on the menu when we went, but they were happy to make it for us. The chef and his wife I think are the owners, and they are so nice!"], ["Bryan E.", "Not the best but definitely will go again. I had the General Tsos and the portion was so large I ended up making it into two meals. The owner is very friendly if a bit hard to understand, more authentic perhaps?"], ["David L.", "Red Dragon House is the best Chinese restaurant in the Kansas City area. All of the food is outstanding and the Crab Rangoon is addicting. I would recommend this place to everyone."], ["Kyle B.", "Very decent chinese food at a really cheap price. I would recommend not ordering either the cashew or almond chicken, it's just not good at all. The princess chicken is good."], ["Montira C.", "Best Kung Pao Chicken!  I like their lunch portion - just right!  Great service.  Yum!"], ["Joe W.", "Huge portions, friendly staff, decent food."], ["Stephanie P.", "This is a decent place to come for lunch.  The lo mein is average and the hot and sour soup is not very spicy.  The service is fast and the prices are great."], ["Lung T.", "Average Chinese food...good value for the money....very busy during lunch"], ["Michael H.", "Very tasty and very economical lunch specials. Awesome restaurant run by awesome people. If you like hot & spicy, ask for some of their ghost pepper and habanero pepper sauce. (I'm still recovering)"], ["Corey O.", "Stopped in for lunch. The place was packed. It's a little hard to find. Luckily I google streetviewed it before I left. Tasty and cheap. Hit the spot.  I wish they would deliver! The food wasn't amazing, but this place is a value for lunch and I'll definitely be going back."]], "China Star": [["Heather G.", "Lunch special is good, you get a nice amount of food for about 6, and they have fast service.  I eat here a lot because of the lunch special."], ["Tyra W.", "Love this place! I haven't lived in the Northland long but as of right now this is my favorite spot for Chinese take out. The Crab Rangoon is probably some of the best I've ever had...and it's known I'll eat an entire 8-pc order by myself! I always try to order their lunch special since the sizes are a little smaller and better proportioned as well."], ["Charlie B.", "Great location for Parkville residents, and the lady running it was very nice.  The good was great and the bad was really bad, so I settled for 3 stars.  Good: crab Rangoon, chicken chow mein, friendliness.  Bad: no air circulating in the restaurant on a high 80 degree day.  I left sweating getting a Carryout order.  Portion size: very small on the combination dinners.  Not enough for dinner but good for lunch!  Pork fried rice: blahhhhh.  Will stick with white!On the fence overall.  If I'm desperate for Chinese, I may go back. But a trip to Rainbow, Pei Wei, PF or Hong's would be worth it over this place."], ["Andi E.", "Run by a very sweet lady, she treats everyone in a friendly and welcoming manner. Tip: Only the white sauce is vegetarian, ask for it."], ["Libby Y.", "Great broccoli!"], ["Karli W.", "The Szechuan Chicken is by far the best I've ever had. It's a non breaded dish that's full of veggies like broccolli, baby carrots, snow peas, onions & zucchini. Smothered in a rich broth with just a touch of heat. I mean barely any heat. But it's full of flavor & you can tell there's no skimping on the ingredients! And the crab Rangoon is super yummy & sweet. I love this place!"], ["A P.", "Very good Chinese food in a storefront restaurant. Good quality, freshly made. Sweet couple runs the place. I agree with Ken that you don't want to eat there -- rickety, old booths. However, the food is the best Chinese I've found in the Northland."], ["Ken M.", "It's not expensive or fancy, but the food tastes good. More tham a few times we have been comped soup with our meal. Note: this is NOT a place I like to eat in, but we love the take out."]]}