{"Cafe Provence": [], "Westport Cafe & Bar": [["Judy R.", "A  Lovely little cafe in Westport (KC, KS).We had  brunch here . The food was delicious .... Both well prepared and well presented .  I had the gourmet veggie omelet served with pomme frites (crisp French fries). Several off us had the omelet which was seasoned just right. One of the guys had the Norweigan smoked salmon eggs Benedict with Hollandaise.  Our other guy had the Farmers breakfast with bacon and hash browns. All of our meals included a mimosa, Bellini or Bloody Mary."], ["Jon K.", "A great cocktail menu -- one of the best in town, in my opinion -- in a cozy cafe setting. Winter Squash is perfect for these colder months. Pair that with good, solid food you can always count on, and that makes Westport Cafe one of my Westport favorites."], ["gordon g.", "My Norwegian. Benedict was fantastic. Somehow more light and delicate than I feel like I usually get. My wife's shrimp and grits were unbearably salty. And no amount if free cocktails will change that. Worth a second attempt."], ["Sharon M.", "Keep in mind that this place is westport cafe and BAR it will be loud, but that's part of the atmosphere! The food is fantastic and the service is always on point. Great place for a late night happy hour."], ["Joe G.", "Truly a nice upscale feel to this place and the food is very well prepared as well!I traveled here for a special occasion of a retirement dinner, and the place was just the right touch.We savored the dishes, and believe me, they do cook with lots of butter, but there's lots of flavor to go with that. We both had the fish. It was excellent.You will not go wrong here. If you are going out for a nice occasion, I would highly recommend."], ["Jessica S.", "I had the best herb omelette and pomme frites. Crisp, skinny, and perfectly salted. Yum!"], ["Angelo F.", "The Westport Cafe is on our very short list of favorite places. It's casual, which is perfect especially for brunch, but the menu is far from casual. Ricotta pancakes, biscuits and gravy, chicken hash, a choice of benedicts...and a drink is included! It is a definite \"must try\" if you haven't already."], ["Katie O.", "I've been here for happy hour & brunch & both were delicious! I've had all of the types of mussels, which are a great deal for happy hour. Try the blue cheese mussels - amazing!  For brunch, you get a complimentary beverage! However, I was NOT a fan of my Bloody Mary - it was watery & sour. I'd recommend getting a mimosa or Bellini. Overall, great food, great drinks & great staff!"], ["Colin M.", "One of my favorite places to eat. Pomme frites, amazing cocktails, and a very friendly staff. A go to for any date night, brunch, or group to dine."], ["Robert M.", "Only just adequate, which would be fine if I hadn't paid for excellent."], ["Madeline S.", "This is my favorite spot in KC. It is always outstanding and the service is excellent. I have been for brunch twice and wine and dessert once and I plan on being a repeat customer. Firstly, the atmosphere. Westport Cafe and Bar feels like a hipster french bistro and is unlike most places in KC. It almost feels like you've just walked into a trendy cafe in New York City or Paris. The bar is fully stocked and WCB has several signature cocktails (Bloody Mary, mimosa, Bellini) that come with your brunch order.The food has always been top notch. I'm partial to their brioche french toast and nova scotia benedict but I'd assume that everything is good. They make their own English muffins, they top the brioche with honey lavender cream.. it just doesn't get much better. I also have never waited long for food. Lastly, dessert is inventive and indulgent. I enjoyed the profiteroles covered in hot fudge on my last trip and plan to try everything else at some point."], ["Reed N.", "When dinner starts off with whiskey on the rocks you know you're going to have a good night!Add a seared tuna sandwich with some ginger aioli and things really pop! They put all these perfect flavors on what looked to be the infamous Farm to Market brioche roll. You can't buy them in the store... but I could eat dozens of them... at once!"], ["Jeff M.", "We had schedule a dinner with my wife and two neighbor couples.  The salads and escargot were amazing, and the steak tartar was very good.The scallops and risotto were disappointing (3 of the 6 order that- ugh).Most interesting was the way the staff treated us at the end of the meal. While we were eating there were two other tables with patrons. After they left the staff decided to turn the lights of the restaurant off leaving the bar lights is the only lights in the restaurant.  The service to this point has been pretty good. However as soon as the restaurant lights were turned off and the bar lights were turned on we couldn't get any service including our check to leave. Interestingly enough this was only 830 pm.Between the less than inspired ambience, the disappointing scallops and the service gaffe at the end of the meal we left thinking this was not a restaurant we were going to frequent."], ["Jacob K.", "Great casual neighborhood spot - 4.5 starsI came here to grab a drink on a recommendation from a local. I was pleasantly surprise by the casual atmosphere and cheerful staff. The bartender greeted me immediately, found me a place at the bar and was attentive the whole evening. First off, I tried the Aviation ($8) which is a tricky drink since it combines Gin, Maraschino, Creme de Violette and lemon. Many times it comes out tasting like potpourri but he made it perfectly! Next, I tried the Martinez ($8); Old Tom Gin, Dolin Rouge, Maraschino and Bitters. Once again, a solidly crafted drink.Since the place was so inviting, I stayed for their \"Reverse Happy Hour\" (10pm-close) and got to try their Spring Pea Ravioli in Lemon Brown Butter and the Chicken Liver Paté. Both were $5 for the happy hour. The ravioli was delicious, though the sauce was actually a buerre blanc vs. brown butter (still very tasty). The chicken liver was good. It was smooth, mild flavored and came with baguette, pickled onion, grain mustard and pickles. Portion wise it was definitely enough for two to share.Overall, this place is a good value, casual neighborhood dining spot that I would absolutely visit again."], ["Daniela G.", "This was the first restaurant that the boy and I tried when we first moved to KC a little over a year ago and ever since then we've had an ongoing relationship.  We've been to WCB multiple times and I have yet to have a bad meal, a bad drink, bad service or bad anything for that matter.  The food is always delicious and the drinks are fantastic!  The service is spot on!  We once took the boy's family for a birthday dinner and they didn't even blink at the fact that we were a table of 10 on a Saturday night.  French food can get a little heavy and the atmosphere can be a little stuffy, but here you never feel uncomfortable nor do you regret anything you've eaten.  WCB are in it for the long haul - this relationship is one to stand the test of time - this is real love!Favs: The first time we went there was a Milanese on the menu that was so delicious i dreamt about it for days, but I haven't seen it on the menu back, might have to start a petition.  Other than that the poisson meuniere is ahhhmazing, and we always start with either the cheese plate or the baked ricotta w/ goat cheese and truffled honey, both to die for!"], ["Karen L.", "Super loud place. Didn't hate the food but I wouldn't go out of my way to eat here again. Nothing stood out. Happy hour cheese plate was meh. Mussels were good. Steak sandwich and fries...were not good."], ["Patrick B.", "I have only enjoyed the mussels here so I'll mostly be covering a selection of drinks in this review, along with service.WC&B Old Fashioned - Impeccably mixed. Expertly balanced. One of the best I've had anywhere in Kansas City.WC&B Fall and Oates - Theres nothing not to like about this drink and the name only makes it a little better. If only it would sing to me as I drink it.WC&B Brothers Keeper - Whew this one will put some fire to your breath. I'm not sure if the barkeep simply used more of the rye in this one than the Old Fashioned but this one didn't seem to be executed quite as smoothly.WC&B Charlie Sour - Don't be fooled by the cute glassware, this is a great drink. The Earl Grey infused bourbon has a really unique taste but isn't terribly over powering. Great balance and flavor here and probably my favorite of the bunch.WC&B Winter Smash - I actually wish it was even colder outside on the day I enjoyed this one. Buffalo Trace can be a tricky one to mix with from time to time but WC&B works with it well here. A success for sure.As mentioned above, I also enjoyed their mussels as well which were absolutely delicious. They were definitely not overly salty as other reviewers have mentioned so hopefully those are just isolated incidents. I may have stolen a fry or two off a friend's plate and those were quite good as well. The service however... VERY disappointing. Our waitress made herself available every 20 minutes or so which we felt, was not an appropriate frequency at all. It was not overly busy but I suppose perhaps they were understaffed at the time. With how few people were in the establishment, we couldn't figure out where she was disappearing. We just started making personal trips to the bar to get waters refilled. She also missed orders but seemed to be very expeditious when we asked for our tickets. Guess she wasn't a big fan of our group.I'll definitely get back, I just hope I get a different server next time."], ["Kelsee P.", "This place did not disappoint. I came here for brunch with a friend. I ordered the eggs Benedict and the portion size was fairly big. You get a complimentary drink on the side and I got the bellini, it was very good. I'll be back to order a few other things because the lady next to me got these waffles that looked amazing."], ["Joanna M.", "I had such a fantastic Sunday brunch at Westport Cafe & Bar!  I can't believe I've never tried this place before.  In my defense, this place looks totally nondescript from the outside and seems almost out of place amidst all the bars and dance clubs (ahem Union) in Westport.  My partner and I easily made a morning reservation on Open Table about an hour before we wanted to arrive, bypassing most of those on the waitlist.  Complimentary cocktails with my breakfast?? It was almost too good to be true! My bellini was refreshing and sparkly and I adored the eggs Norwegian that I got.  The benedict comes atop a dishful of hollandaise sauce.  The sauce is definitely luxurious and tasty, but I'll likely ask for it on the side next time as there was a bit too much of it for my liking.  We also ordered fresh oysters, which the waitress graciously offered to us on the house as she forgot the first time around.  Not quite as briny or fresh as the ones I'm used to from San Francisco but certainly as good as it gets in landlocked KC!  I'm coming back here for a restaurant week dinner!"], ["Dianne W.", "Oh we just love this place! I have been for breakfast, lunch, dinner, happy hour, and dessert! Well that might say more about me than Westport Cafe & Bar. But seriously the food is great, the drinks are yummy, and the staff is always friendly and prompt."]], "Ça Va": [], "Anton's Taproom Restaurant": [], "Oak 63": [], "Café Des Amis": [], "Charisse": [], "Tannin Wine Bar and Kitchen": [], "Aixois Bistro": [["Arthur J. S.", "It's not every day you get to have dinner with a Nobel Laureate, but on one recent spring evening I was lucky enough to join this Nobel Prize winner at dinner. The dinner was at Aixois. The ambience was pleasant, but the noise level was pretty loud. Our guest of honor remarked multiple times that he could not hear the comments coming from the students at the table. As the night went on the noise levelreduced, and eventually we were the last ones at the restaurant. The house red wine was very delicious: subtle, slightly sweet, and unpretentious. I ordered the poulet roti, which was a tad bit disappointing: although the chicken portion was very generous, the sauce was very salty, and there was a disproportionate amount of mashed potatoes (trending to the smaller side of an appropriately sized portion). When it came to dessert, I ordered the chocolate lava cake. The menu states to wait an additional 12 minutes for the lava cake to arrive, thereby increasing the anticipation of the dish. However my expectations were not met. When I hear \"lava\", I figure there would be molten chocolate oozing from the center of the cake; not so. Instead, the cake was more like a soft fudge cake. The cake tasted delicious, especially with the included berries, but I cannot shake the feeling of disappointment. Especially since I had to wait 12 minutes for the cake to be delivered. The staff, however,was very good: attentive, polite, and prompt. Did I have a good evening? Yes. Could the experience have been more enjoyable? I believe so. Will I give this place another chance? Most likely. I'll just go with a less assuming main dish and finish the night with their gigantic chocolate crepe."], ["Elaine D.", "Aixois is a comfortable, neighborhood restaurant.  I've been impressed time after time with the quality of both the food and the service.They have a patio which is great for a long, relaxed, summer-time lunches.It is a bit pricier that other options in the area, but I know I'll leave very satisfied with my meal.Be sure to make reservations for dinner on the weekend."], ["lauren h.", "I used to love this place  - until they absolutely ruined my birthday dinner.Waited 45 minutes for a table...which was ok - not complaining b/c I didn't have a reservation - except....sat down at a bar table and waited 20 minutes for a waitress. Once we sat down (with another couple/friends of ours) took another 15 minutes to get water and order a bottle of wine. I mentioned at least 3 times that it was a special night - our friends had never been, and it was my birthday  - and that we had plans to go to a jazz club after. SO...went to order dinner (this was about 1.5 hours after arrival) and they are out of the trout and the ceasar salad. It was only 8:30 PM on a friday night - GOOD FRIDAY - you would think they would order extra fish.  OUr dinner took another 45 minutes to come. We were outside and it's now 9:15/9:30 PM I asked if they could turn the heaters on - there were FOUR sitting next to us and they said - oops sorry, no propane. Huh???  We threaten to leave b/c by 9:30/9:45 we still had not eaten our dinner. The 'manager'said he was so sorry and would be taking care of a good part of our meal. So ok, we move inside and order drinks and dessert. We get the bill - it's now about 10:30 - and they paid for our dessert. Our 3 desserts. It was now too late to make it to the jazz club (feature went on around 9:30-10Pm and we were tired and cold)....My big night of plans and fun with friends was totally KILLED by this coffee shop claiming to be a restaurant. I am bummed b/c it's close, the food is semi- good and the breakfast food is good.I do NOT recommend this place. I am still really upset as are our friends and we will be sure to be telling our friends never to go back. Subsequently, I mentioned the bad experience to my neighbor (we live in Mission Hills) and she said they had a horrible experience not too long ago as well and won't be going back. I am still pissed. And I plan to email the manager next."], ["Kiesha E.", "I have been here several times...too many to count. But today, 5/10/14 this was horrible.  While on a walk this morning I decided to  to stop in for breakfast. I placed my order at 9:43 am. I took a seat at a table and until my first inquiry on my order at 10:23 am, no one offered me water, no one said 'hi', no one gave me silverware & a napkin. Mind you while they had tables of customers they were by no means packed.I asked about my order and the guy told me I will get your server. Surprise! I had a server! Never met her the entire 30 minutes I was sitting by myself.  She came by and said oh sorry I will check on your order. I told her if they had not made it, I did not want it.  Amazingly it came to me in 3 minutes. Hmmm I'm pretty sure that wasn't mine.  In fact, it wasn't. I ordered my egg fried hard. This one was runny. Pissed. Then after she dropped off my extremely late order she didn't come back to see how things were...and I never got that water.Most wait staff work really hard to turn a bad situation into a good one. No one here did that. It's unacceptable. Life is to short to waste my hard earned money and precious time on people and places that don't respect nor appreciate it.  If Aixois is telling me that they don't like me, for whatever reason (single, female or black), then I can take a hint."], ["Ben M.", "Awkward AixoisSo, Aixois has some of the strangest service I've ever experienced. It took 20 minutes to put in our order, 10 minutes to get our coffee, 5 minutes to get our cream, 5 more minutes to get a spoon to stir our coffee, another 30 minutes to get our brunch, then 5 more minutes to get utensils to eat our brunch, 20 minutes to eat and finally 20 minutes to get our check! That's a ton of waiting for two simple brunch time meals. As for the food, it's average. I might be spoiled considering I've spent some time in France, but this was average at best. My girlfriend and I had the salmon omelette and the Farm Table with a side of grilled ham. The Salmon Omelette was mediocre in flavor but large in quantity. The Farm Table was overpowered by the obnoxious amount of goats cheese. It could have used half the cheese and triple the mushrooms. Like the service, it was very unbalanced. Sadly, the sides of ham and toast were the highlight of the meal. If they would have just served me ham I would have given one more star to my review. Getting anything from our server was like pulling teeth."], ["Ted W.", "Neighborhood favorite spot anchoring Crestwood Shops. Great spot for a latte, a quick breakfast, lunch or dinner. On nice days eat outside. Don't miss the hangar steak with the pomme frites.  As the name suggests owned and run by a hardworking Frenchman from Aix. He moved here with his wife and is raising a lovely family and running this neighborhood jewel and many days cooking each meal served. We are lucky to have him, stop by and see for yourself."], ["Kelly H.", "I am married to a beautiful woman whose birthday falls on Valentine's Day. This poses a problem when wanting to dine out for her birthday. My experience has been that restaurants are jammed up, understaffed and the food and service suffers as a result, so a Valentines Day approached it was decided that we would give it a go despite historical precedent. I selected Aixios as our destination based on a recommendation of a friend and made reservations for six long in advance. I was called early on 2/14/14 to confirm which I appreciated. Two other couples joined us and we arrived 10 minutes late for our 8pm reservation but had called to let them know. As expected they were packed and an understandable wait ensued. None of us cared. We took in the atmosphere and while the staff was busy they were in control. After a 20 minute wait we were seated. I can't speak to everyone else entree so I'll focus on mine. I started with the Fois Gras and it was rich and luscious and was eaten on toast with soft cooked cherries, which delivered nice acidity to the bite. Next came the entree and I ordered the herb-crusted rack of lamb. It came med-rare and the bones were not burnt which was a nice visual indicator to me that it was prepared with care. Served over a smooth garlic potato purée and here covert and a savory reduction completed the dish. With as much activity as the restaurant was getting I was completely sated. For desert I ordered the creme brûlée   with a Grand Marnier back. The sugar was properly caramelized and the custard was creamy and was delicious. Before we left my wife had spied an ornamental metal chicken that she just had to have and after a short negotiation with the owner, they let it go for a price. Thank you Emmanuel and Megan for making my wife's birthday and Valentine's Day special and for the chicken! Five Stars."], ["Daniel K.", "Mixed bag...  Stood there for a good couple minutes... Obviously didnt know the routine.  3 people at the coffee bar/ordering area didnt say a word to us and glanced over a couple times.  Finally went up to ask how it works...  One pretentious dude relayed that we order there and sit anywhere.  Cool!  We looked around for a menu board...  Then we had to ask for a menu...  WTF...  This guy.  The ham crepe was decent.  Lots of ham, but not a lot of cheese.  The croque monsieur...  which is incorrectly named...  because with an egg changes to croque madame...  Was quite good.  The raspberry chocolate croissant...  was great.  Latte was okay.  The pricing however French they are is about $1-2 a little high for what youre getting.   Between that and 2/3 pretentious staff...  And boss who was also off to the side talking to someone and didnt mention to us standing there for a few minutes how to order...  Its A-OK... Nothing bad.  But Im not Yay! Im a fan.  That being said the shinning light other than the incorrectly named croque madame was the one singular staff member who was pleasant and tried hard to make amends for the attitude of his fellow workers.  He knew their deal and went out of his way to make up for it without confronting or addressing the issue head on.  If all the staff were like him Id be a fan for sure.  Fact is for me... Dining out isnt just about the food.  Its about the experience.  Perception is reality.  Ill be going to the other location on Friday for dinner."], ["Julia H.", "Saturday mornings are coveted for two working professionals.  The very most important part is the cup of coffee.  Aixois you were a disappointment on every level.  There's an upcharge for everything!  $3 to have cheese in your omelet.  I can buy a log of goat cheese at the grocery store for $3.99.  Want to sub fruit for your potatoes?  UPCHARGE!  The coffee tastes like the kind you'd find at some large stale corporate office, made in an old coffee maker from powder delivered by an office supply company (no offense office supply companies!)  I can't seem to get rid of the taste of cardboard in my mouth...disgusting.  Disappointing.  We won't be back.  EVER."], ["Mike H.", "Had a groupon so my wife and I went here for dinner.The patio is nice and is next to a decent sized grassy area with a bike path. This meant that there were a few little kids of other patrons running around. Didn't bother me, but some people dislike that kind of thing.We were informed that the kitchen was running slow. Nice that they told us and the wait wasn't so bad. The server was pretty attentive and came by to refill drinks regularly.Food was average. There was a special potato pancake appetizer which was interesting - the pancakes were very soft and rich, and came with a tasty herbed cream cheese.Entree-wise I had the chicken paillard, which was like a chicken piccata but not crispy and with tomatoes in addition to the lemon and capers. My wife had the hanger steak. The chicken was pretty good but the steak wasn't very flavorful. Each entree came with fries and a salad, but it's all on the same plate so the juices from the meat got all over the fries and salad, particularly with my chicken.The bread was disappointing, tasted like a cheap baguette you'd get from a grocery store. The butter came on a plate but it was cold and not salted. One of my favorite parts of eating French food is the potential for really good bread and butter - not here.It's a cute spot, though, and the menu had a lot of lunch-only things - crepes and sandwiches. Probably a nice place for lunch or drinks but I likely won't be coming here for dinner again."], ["Mary A.", "We ate here on our final day in Kansas City.  What a treat! This little restaurant is sort of hidden in a small shopping strip.  The food is bistro fare.  The menu is short and simple.  My husband opted for the chicken crepes.  I had the special of the day which was a pork chop with vegetables.Most places these days that offer crepes make them huge, doughy, and not very palatable.  These were light and had a creamy chicken filling that was full of chunks of breast meat.  Very delicious!My pork chop was sautéed with a light creamy reduction sauce complete with roasted potatoes and vegetables on the side.  A nice portion, tender on the bone and tasty.  Much like you'd expect from country French cooking.Dessert was shared.  It was Ile flotante, or the English translation Floating Island.  This isn't a dessert that is offered much anymore and the last time I even noticed it was in a Betty Crocker cookbook.  Anyway it's clouds of meringue toasted on a crème anglaise base.  Yummy!  This place takes one back to the real deal---a sidewalk café in any small French village.  C'est bon!"], ["Rachel L.", "I tried this place for Breakfast.  I ordered a waffle, breakfast potatoes, and nibbled on a croissant.  My waffle was bland.  The staff also brought it out with berries on it after I told them twice to make it without berries.   They also forgot to bring the milk we ordered but charged us for it.  When asked if we could get the milk, she said \"oh I'll have to find the  receipt to see if you ordered that.\"  I was like okayyy.  They brought it out without apologizing after they saw I had paid for it.  I did like the small touches this place makes. My diet coke was in an old-fashioned glass bottle.  Cute.  Overall, it was overpriced for bland food."], ["Dru S.", "Below average burger, (it was dry and flavorless. I probably should have just sent it back. (especially  for 16$)).  The 9$ ceasar salad was tiny but the flavor  was good."], ["Amy K.", "I really love the neighborhood bistro feel of Aixois.  I come here often for the coffee bar or to meet people for morning meetings.  I have only eaten dinner here once last summer on the patio but it was excellent.  My parents can be hard to please but they both highly enjoyed the outdoor dinner we had. The restaurant is quite and welcoming during the day for coffee and parking is (usually) fairly easy.  While I don't have a lot of dining experiences for Aixois, I enjoy it for the casual coffee meeting place."], ["V. M.", "French Onion soup like dishwater even with an abundance of salt and pepper.Royal sandwich seemed like it had some Oscar Meyer turkey.Steak and fries had really good taste but, was cold.Won't be back."], ["Tyler L.", "I'm going to make this easy. Do yourself a favor: get escargot and the filet w/ truffle demi-glaze. They offer a conservative and cautious wine selection, but it has something for everyone."], ["Erin W.", "This was by far, the absolute worst restaurant experience I've ever had (if I could give negative stars, this would be the time for them). We walk in tonight and with a whole 5 tables in the entire restaurant, the hostess (who never smiled once) asks us if we have a reservation. We say no, she scoffs at us...looks around and sighs. She takes us to a table and tells us that there will be a wait for a waitress. We ask for clarification and she says they are short staffed (there's three waitresses). Hostesses are supposed to be pleasant and friendly, not rude and act put out by doing their job.  We sat down and watched waitress after waitress walk by without even saying hi, or someone will be with you in a minute, or here's some water...nothing. If we would not be using a Groupon, we would've left. 17 minutes later, our waitress arrives, we order water to start and our food. Literally 2 minutes later, another waitress shows up with what we order.  I ordered the salad, fries, and chicken, however, they put everything on one small plate, so 90% of my fries were soaked in the sauce put on the chicken and the lettuce was drenched in it too.  My husband had the shrimp with pasta and vegetables, which the only \"vegetable\" that was in it were a ton of mushrooms and a few tiny pieces of pepper. To me, that should have been included on the menu. I would've liked to have a glass of wine with our meal, but there was no one around us.  We watched another nearby table (with a different waitress) get served multiple times, the manager filled up several other tables with water...but ours was MIA. We sat with empty water glasses from the moment we got our food since the water glasses were so small, but never once got a refill. Finally, we asked the other waitress to please bring our check (no one ever came to make sure our food was even correct or okay). The was another table that also had to get up and ask the waitress to order (which did make us feel a little better that it wasn't just us).  When the waitress finally came, she rolled her eyes when we had the groupon out. She again came with excuses of how there was ONLY three waitresses and the bus boy left early (three waitresses, a bartender, and a manager was MORE than sufficient to help the amount of people there). The other waitress (who I asked for the check) came with our check while she was giving us the excuse, she took our check and the hostess came back with my card and threw it on the table. I've been to a lot of restaurants and have NEVER in my life felt like I did this evening. I wouldn't go back here if someone paid me too."], ["Isa I.", "This place is ok. Some of the food could be better quality for a French restaurant, like the coffee, the chocolate sauce, .... Just not wow. Staff is usually pleasant, they have a nice terrace."], ["Dan M.", "Went on a Monday evening for our anniversary. It was our first time here.  We were first put in the room in the north part of the restaurant which was a little noisy and bland. Moved to the other side, where the bar is located, which was perfect. Excellent atmosphere, service and food ! Too warm for the patio but we will definitely being going back when we can enjoy sitting outside."], ["Jocelyn M.", "Each visit to Aixois earns itself an A+ for cuisine. I still dream about the best escargot dish I ordered for a NYE dinner years ago. I also enjoy the ambiance. I like how the restaurant kind of wraps around inside and the windows. I especially enjoy the shaded patio and have enjoyed many enjoyable happy hour cocktails and cheese plates from it's tables. Servers have been an array of \"meets needs\" to \"entertaining and friendly\" but certainly never bad. Attending yesterday for the Bastille Day celebration, I would highly review out server - Harper. We were ever so slightly annoying with our free pomme frites orders, seating ourselves without letting the hostess know (we started inside at the bar) and other various no-nos, but she was really friendly and made the best of the situation.I have been a little surprised at the management of the restaurant and organization, or lack thereof, of the overall execution. I was floored at how many menu items, glassware, etc. they ran out of as they were supposed to be hosting a party for one of the biggest French holidays. I overheard the bartender mention this was her first day... while that explains why those beverages took about 4x as long as they should have, it doesn't explain why management wouldn't have prepared more thoroughly for business.  I also remember dining with a large party several years ago and they didn't have our table ready when we arrived, despite our reservation. At very least that deserves an explanation, of which we received none while we piled into the small bar area, waiting to be seated. It has never offended me terribly, but I just cannot give more than three stars to an establishment who has made such missteps on the basics, in multiple visits."]], "Tatsu's French Restaurant": [], "The Capital Grille": [], "Avenues Bistro": [], "iPhoTower": [], "Cooper's Hawk Winery & Restaurants": [], "iPho Tower": [], "Sasha's Baking Co": [], "Le Fou Frog": [], "French Market": [], "Harry's Country Club": [["Elton M.", "As someone that has worked in the river market for years I love this place. Food has always been very good well beyond pre-made bar food. Service is great. Lots of lunches and some amazing happy hours. Beer selection is outstanding. We've had happy hours after work where we ordered just by finding odd named beers.  Great patio.  Funky vibe. Fun place."], ["Daniel H.", "I met up with Joi B. and other yelpers for Joi's farewell.  They were in the patio area that was enclosed which would be opened but it was windy and cold. This place was a little small with limited seats and tables inside as well as the patio area.Everybody there already had drinks and a couple of appetizers.  I ordered a Murphy's Irish Stout since I ate before I came.  Our waitress was super friendly and nice.  My Murphy's Irish Stout tasted like a lighter version of Guinness but still good in my opinion.  I also shared some chips and sour cream dip with another yelper.  The chips and sour cream dip were a good combination together.Somebody ordered a burger and it made me want to order one too.  It looked pretty good and the fries were tiny.  I don't know the name of it but I'll be sure to try it next time."], ["Mari M.", "I'm a bad Yelp-er because I never remember to take pictures of beautiful food. Today I had beautiful food at Harry's. Go figure.This place has something for everyone. Today I had a most beautiful Greek salad. It had cruchy romaine, grape tomatoes, artichoke hearts, black olives and feta cheese all tossed in a light lemony vinagarette. All around the outside were grilled pita triangles. WHY did I not think to take a picture of this salad? I will try to be better about photos because you need to see this work of art. Besides being beautiful it was very, very tasty!Let the record show that I am addicted to the damn french fries at Harry's. On my many visits I have tried (and liked) burgers, chicken sandwiches, tuna melt, patty melt, chicken salad sandwich, enchiladas, great appetizers, cocktails and live entertainment occassionally. The Waldorf salad is Way up on the preferred food list, too. See...almost everything I order comes with the damn good fries. You can eat healthy or not so healthy. It's all good.In addition to the food I have to give this place mucho kudos for their variety and service. I like the atmosphere at this place because it's an 'everyone' kind of place. Today I sat next to a large, very tatt-ed KCMO police officer. I did not cause a rukus.Get to Harry's and try the special Greek salad or one of your favorite foods prepared the Harry's way."], ["Lauren H.", "Great bar and grill or pub food, but I wish they had more of a selection. Also the beers are a lot overpriced compared to other similar restaurants in the area. I would definitely recommend the homemade chips and dip though, I could eat them all the time!"], ["Ashley D.", "This is my favorite lunch/laid back dinner spot. Great patio. Great food. The tres tacos are incredible. Food comes out fast if you're in a hurry (e.g., pre-concert dining), but be sure to ask for the check if you need it quickly. Otherwise, they try not to rush you and you may wait awhile to get it. I often take friends and family who visit from out-of-town to Harry's, and have never gotten any complaints. Killer moscow mules (they make their own ginger ale!), great beer selection, and just tried the homemade limeade today and loved it."], ["Courtney L.", "I was skeptical when Harry's was chosen as my team's happy hour because I've read the other reviews, but we had a great time and the service was just fine! We went on a Thursday during happy hour and arrived early (right at 4), so we had no problems grabbing a table and some attention from a waiter right away. I thought I would start with their homemade shandy.. and I did. It was also the only thing I drank all night because it was fantastic!! Not overly sweet, but it definitely had a kick. After 3 glasses, I had to call it quits or I was never going to be able to drive home! My co-workers were downing the Missouri Mules like they were going dry. I'm not a big whiskey fan, so I passed, but they were a great twist without the copper glass and a big hit with the group. I also ordered the homemade chips and french onion dip. LOVED this. I devoured the generous portion mostly by myself. I'm a french onion dip fiend and this didn't disappoint. I also had a ton of dip leftover after I polished off the chips, so they didn't skimp! I'll definitely come back here, but will be weary of coming on the weekend. Loved the homemade shandy and can't wait to have more of it!"], ["Tyler B.", "Best bar in Kansas City. Huge selection. Solid bar staff who know more than a thing or two about how to pour a drink. Strongly recommend the Moscow Mule or any scotch recommendation from the bar. Atmosphere is welcoming for a single drink or a night out with friends."], ["Rosa O.", "Had a good time here the other night, especially appreciating the live music on the patio. Was a little disappointed at the idea of a cover charge in a place like this, but it was worth it. They were very accommodating to the large numbers of us that migrated here as part of a wedding after party, but put their foot down when they closed, and kicked people out pretty promptly. I was fine with it, but it was definitely not what I was used to. Decent drinks, decent prices, nice atmosphere."], ["Morgan K.", "I like Harry's. I really do. The food is good, sometimes a little guilt-causing and indulgent (gotta love the fried food). Their house drinks are great on a summer evening with a group of friends and the patio is one of my favorites in town.I just wish the staff was a little more friendly. They are not outwardly rude, by any means, but sometimes they're not outwardly nice either. Everytime I'm there, I'm with a group of friends on the patio so my outing is never truly ruined. But everytime, the servers are a little on the under-attentive side.That being said, I'll go back to the good stuff. The house drinks - haven't had a bad one yet and the nachos are excellent."], ["Kevin S.", "The appearance of a dive bar but the staff is friendly, the beer selection extensive, and the food a cut above the casual dining segment."], ["Derek H.", "Update to \"Meh.\"Came on Snake Saturday afternoon.  Sat down around 1:30, after the lunch crowd.  It took Party of 5 people and it took 40 minutes to get our food from the time we ordered it.  The real frustrating part is we all ordered Tacos and Club sandwiches.  How in the world does it take 40 minutes to make tacos and sandwiches?It doesn't.  Our plates had been sitting under a heat lamp for a while, judging by how scalding hot they were.  We were a little parched from the parade festivities and our glasses were pretty dry for the most part.Food was as good as usual.  I'm just afraid we might have gotten a new waiter or caught them at a shift change or while there wasn't any manager on duty.Two Words: FRIED TACOS.I LOVE fried tacos and theirs do not disappoint.  The food quality has always been good and the service not too bad."], ["Julie K.", "No service, waited a bit and still no service. Thumbs down. So what can I say, no service no business."], ["Zach G.", "OK, I have given Harry's another try. At first, I liked the place, but my most recent experience had me questioning if I would ever be willing to go back. However, I found myself in the area, and m'lady and I decided we would give it one more shot. Granted, the place was very quiet (about 6pm on a Tuesday), but the experience was much, much better.For one, our server actually acknowledged our existence. That alone made her worlds better than the nightmare of a guy we had last night. I definitely appreciate my existence being at least noted. She was very efficient, but not a pain in the butt. My drink came out quick and was poured pretty well for $4.25 or so during happy hour. We also ordered some food - a Pork Tenderloin sandwich, which was $6.95 or so off of the happy hour menu, and a Cuban sandwich, which was not on the happy hour menu. The food came out pretty quick. Much better than the 84 hours last night (I only slightly round up to that number...). The great thing? It was clear the food came out right after it was cooked, not after 30 minutes under a heat lamp. Success! What does that mean? Well, for one, the sandwich bread wasn't disgustingly soggy, nor the fries cold.The pork tenderloin, in fact, was almost too hot to eat at first. Beyond that, it was just a normal p.t. sandwich - big, fried, unhealthy, and decent. The Cuban sandwich was much, much better than last time - much more meat, much tastier meat, and actually hot. It was pretty good...not the best Cuban, but pretty good.So, I will now actually be back here. I still think this place is best for drinks, but the food as won my SLIGHT approval again. As long as I don't have to suffer through the guy from last time..."], ["Chris G.", "Holy smokes, am I the last of my Yelper friends to review? EEKS!!I've been there a few times, including the recent wake, errrr, going away party for our Yelp goddess Joi.We arrived early so got to partake in the yummy happy hour prices!  We shared some chips with Daniel, and I think everyone enjoyed their food.  Despite having 20 or so people there, I thought the waitress did a great job of keeping everyone's drinks filled, and tabs separate (couples and singles!!).I thought that the employees were friendly and the parking convenient.  Our tab turned out very reasonable, considering the number of drinks and food we had AFTER happy hour!  Parking was pretty good, although the bar wasn't that crowded."], ["Margaret B.", "For Kansas City Restaurant Week this year, I took my mother to sample the special menu at Harry's Country Club in the River Market. In their own words, Harry's is \"A reverent take on a 1940s honky-tonk roadhouse\", and that is exactly what it is. I love everything about this restaurant; the vibe here is part old-fashioned southern country club, part western honky-tonk. Harry's is a perfect combination of a modern, hip vibe and the charm and swankiness of post-World War II Americana. You know that the owner has a deep appreciation for the country music legends of yesteryear; the decor and interior design is a spectacular but tasteful panoply of memorabilia from American music's heyday. Rather than feeling nostalgia for such talented musicians and a time gone by, there's an eerie sensation that at any moment Hank Williams will walk through the door and take a seat at the bar. That being said, of course Harry's wouldn't be complete without its famed jukebox replete with country western classics and rockabilly favorites. The song selections are not contrived, however, but are a purist's delight.I've wanted to bring my mother here for dinner for some time, so I was excited when I saw that Harry's would be participating in Restaurant Week. To complete our small dinner party, my aunt and uncle also joined us after hearing so much about it from me. The special menu offered for Restaurant Week included three courses for only $15. Each dish was a sampling of the extensive fare available at Harry's Country Club, which offers breakfast, lunch, and dinner.For starters, I chose the Tomato Basil Soup, which was quite good, rich and creamy, and the perfect first course. For our entree, my mother and I selected the Bowtie Pasta with Basil & Cream which came with grilled chicken and was made with asparagus, green peas, and plum tomatoes. The portion was large and very filling, and the chicken was just right: seared and seasoned on the outside, and perfectly cooked. My aunt and uncle had the Yucatan Shrimp for their entree and raved that the sweet and sour shrimp was succulent with a kick of heat. For dessert, I savored the decadent Chocolate Torte. It was melt-in-your-mouth goodness, although I also found myself eying my family's huge slices of Carrot Cake. They assured me it was as good as it looked, and I don't even normally like carrot cake!Overall, we had a very pleasant experience, and I know that we all will be returning. My husband and I enjoy coming here in the evening to hear our favorite bands play on their large and inviting patio. Unlike some night clubs or bars in KC, Harry's is quiet, calm, and relaxed in comparison, while at the same time providing you with entertainment and an escape from the cares of the world. Harry's is also well known for its well-stocked bar and extensive drink menu. They offer top-notch and unusual craft beers from around the world as well as your favorite cocktails. Harry's Country Club112 E. Missouri Ave.Kansas City, MO 641068164213505harryscountryclub.comMon-Sat: 11am-1:30am (Closed Sunday)Reservations Gladly Accepted  To-Go Orders Welcome"], ["Brandi C.", "Last weekend seemed to be a time for trying new things - new restaurants, new shops, and new bars! Harry's was one of the new places that we tried, and it was definitely A-OK, even if we were there for the sad (for us) occasion of Joi's farewell! Harry's certainly has an old-time saloon feeling to it, especially with the large pin-up style painting over the bar - it's totally something you'd expect to have seen in Tombstone, AZ back in the 1800s. Couple that with the creaky wood floors and the comforting yellowish lighting, and you feel like you've stepped back in time. And I'm totally cool with that! We weren't exactly sure where the group was when we got to Harry's, so we ordered a drink at the bar before scouting everything out. The bartenders were quick and friendly, and while the drinks certainly weren't cheap, they weren't horribly expensive either. The outside enclosed patio was nice enough, and I hear the proper outdoors patio area is even better, when the weather cooperates! The table service out there was a bit slow, but  in fairness, she did have a large group of us to contend with. We didn't have any food, as we were on our way to dinner, but the chips and dip seemed to be a big hit, as were the burgers. I'm glad we finally made it to Harry's, as I had been hearing about it for ages, and I could see stopping in for a drink from time to time, though I'd probably be most content sitting at the bar."], ["Emily S.", "Looking for somewhere new one Friday evening we decided to skip the usual places and head to Harry's. It looked like we weren't the only ones! Despite the cold February winds mixed with winter-y drizzle the place was PACKED! Luckily there were only two of us so we were seated right away. The happy hour menu is extensive and has cheap prices for huge portions. I consulted Yelp reviews and chose the steak burger (~$7). It was a good bar burger with a huge plate of fries. The toppings were fresh and the cheese wasn't american (unless you specified american cheese...). The hubby just chose the enchiladas. Not all that exciting, but I didn't have high hopes for that dish.On to the beers. The selection was astounding and it was so hard to choose! I went for a seasonal beer that they still had around (haha! A Christmas beer that was delicious! It was something like the Breckenridge Christmas Ale.) For about $2 it was a steal! The hubby chose a Fat Tire of some kind and was very happy, of course (~$4).Our waitress was very nice and the lively crowd really cheered us up after a long, cold work week. I think we will be back for more casual happy hour dinners!"], ["Joi B.", "True confession time: I have a fondness for Ruffles potato chips and French onion dip. Or, at least I used to. Frito Lay used to make a delish French onion dip, the kind in that little tin can. I think it had been about 20 years since the last time I had it and I had been craving it, so I bought some for a party. NOT THE SAME ONION DIP! Either that or my taste buds have changed significantly since I was a young 'un, but I have pretty strong taste memories (or \"chewmories\" as the K would put it).Harry's, in their infinite wisdom, has somehow recreated the French onion dip I so enjoyed in my youth. Their homemade potato chips are outstanding as well (I can forgive that they aren't rippled like Ruffles:) Despite my best intentions, I scarfed down half of the huge basket and I think the K and I were about to fight over licking the dip bowl clean (I let him have the honor...JK).It's patio season and Harry's has gone under a bit of renovation, starting last fall, I believe, with an additional semi outdoor seating area (convenient on rainy nights), a stage for bands and what appears to be interesting industrial looking vessels with trellises (?), which I assume will  be planters. Last night the five of us sat outside and took advantage of the perfect Kansas City early summer weather (read: it's not over 90 after the sun goes down). Beer was flowing (wine for Yours, Truly, a decent Cabernet), old country tunes piped outside, courtesy of that amazing juke box, and you can't get a better Saturday evening, in my opinion.Now, to get that damn onion dip out of my head..."], ["Claudia S.", "I've been here a couple times. They have a nice patio when it's warm enough. We didn't have the most attentive waitress, but it was a big group. We had flat bread pizza and it was pretty good. They have a wide range of speciality cocktails at a good price, the menu of drinks could use more of a description so you know what you are getting when you order something with a goofy name."], ["Shane W.", "Harry's Country Club is an icon in my own mind. I've had a lot of great happy hours there, and they weren't the raucous occasions that afflict 20-somethings. Perhaps that's why I like Harry's so much. An aside: When referred to as \"Harry's, THIS is where you go, not the other one.There's nothing fundamentally wrong with Harry's though I agree that some good points have been made in the previous reviews about their inconsistent closing times and the service black hole on the patio. All-in-all though Harry's is a great place for strong, cheap drinks. ...and the food isn't terrible either, but remember, it is a bar."]], "Bistro 303": []}