{"Zaina": [], "Tasso's Greek Restaurant & Grocery": [], "Jerusalem Cafe & Bakery": [], "Extra Virgin": [["Tiffany C.", "Delicious and unique food that can be altered to cater to vegetarian/vegan crowds.Following a vegan diet, I ordered:1) Chickpea fries2) Corn3) Grilled mushroom (altered from grilled oyster mushrooms)4) Lebanese hummus5) Persian cucumber pickles6) Potatoes bravas7) White bean salad with grapesMeal + tip totaled to around $53. Service was excellent and they were very patient with our large (14+) group. They have no corkage fee on Mondays but have a limit of two wine bottles per table. For our large group, they allowed four bottles."], ["Chirag P.", "One of a kind! It offers small bites, portions of many items from the menu. So you can enjoy may items in same meal. I ordered 3 items on food menu and a couple beers. The final price was surprisingly not a lot. Service was amazing as the waiter himself made very good recommendations - thats means they know a lot about not just their menu but tastes too.  We couldnt find parking close so they lose 1 star."], ["Caryn D.", "Food and service was excellent! We had the duck tongue tacos, shrimp fried rice, ramen, pork buns, and dessert. We almost passed on the dessert but I'm sooooo glad we didn't. The homemade churros and tres leeches was unreal! We could have ordered 2 of each and been content. Don't skip the dessert!!!!"], ["Dono P.", "Thought the pork belly and churros were great but the Greek salad and especially the hanger steak were let downs. I will go back to try more of their unique dishes but the botched hanger steak definitely threw me off a bit."], ["Jennifer C.", "Went for lunch during restaurant week.  Interestingly it was cheaper for us to order alacarte than it was for the special which consisted of the same thing so was odd.  Had the tuna tacos which I would skip next time...there was one tiny piece of tuna in each taco and the rest was filler and had almost no flavor of seasoning.   The French onion soup was great...really well done.  The poblano Mac and cheese was decent...not anything I would rank as must have in a future visit.  My husband had the burger which he liked...cooked well and good quality meat.  Excellent Italian wine under dark and fruity category.  So as you can see was a bit all over the place.  Have been for dinner previously and had better luck with dishes being consistent in quality."], ["Nicole G.", "We absolutely loved this restaurant. The ambiance and food were fantastic. They serve small plates. We ordered Gorgonzola. Which came with a cracker and jam spread. Amazing!  Next up were Pork Belly Steamed Buns. They were delicious. The bread reminded me of an asian pork bun. Very flavorful. Then we had Poblano Mac & Cheese, Octopus Nachos and Wood Fired Hanger Steak. All were amazing. We ordered too much food though. Will definitely return!"], ["Tim M.", "Dined here last night with a group of us and had a fantastic experience. The wait staff were extremely friendly and the food was awesome. Our group probably ordered about 24 dishes in total and we loved it all. Our highlights were the crab and corn fritters, roasted marrow bones, chorizo and fig stuffed chicken, the ricotta.... The list goes on. We can't wait to come back!"], ["Tricia H.", "In Italian when we eat we Mangia!!! That's exactly what I did here!!! I Mangia and I Mangia and I loved it!!! I'm not sure why I've avoided this place but I had...I was tickled  when our sweet waitress told came to the table apologized for getting makeup and coffee on her shirt on the way to work..then she absolutely intrigued me when she told me the chef/owner studied in the south of France, I couldn't wait to taste his food!!! I was in love at first bite of the tuna cerviche tacos!!!! Thank you restaurant week for opening my eyes!! I cannot wait to go back!"], ["Tee S.", "This was our first meal in KC coming from out of state. I ordered several small plates that I thought would be interesting to try.  This place has eurasian influenced food, not a typical Spanish Tapas place. I ordered the pig ear salad, chicken thighs wrapped with figs, bone marrow, and spanish meat balls.The pig ear salad had nice, crispy ears mixed with arugula and vinegrette. The bone marrow was good. The chicken and fig was sweet and did not taste spectacular. It definitely didn't have that taste like it was freshly cooked. The Spanish meatballs was kind of bland and undercooked. Overall, 2/4 dishes were good."], ["Randy G.", "The feel of the place us great. Fun, energetic, staff is great, nice layout but the food was okay. Hanger steak A+, Greek salad A+, Mac & Cheese D- (Kraft is better), Chicken thighs w/Chirizo D- (buy a rotisserie chicken at local grocery store)."], ["Michael C.", "Chef Michael Smith takes the 'nasty bits' of animals and turn them into delicious tapas. Under the \"For the adventurous\" portion of the menu, we had the beef heart terrine and pig stomach and they were both great! Also had the most amazing sea urchin pasta!"], ["Angelica E.", "Michael Smith is one of my favorite chefs in Kansas City. Ive followed his cuisine since 40 Sardines. I rate this restaurant a two because of poor service. Sadly my experience at Extra Virgin was tainted by the barkeep, a tall blonde guy, and his condescending and extremely immature demeanor. Its really difficult to enjoy good food with bad service. I ordered every menu item with oysters on the menu the mac & cheese and grilled ricotta bread while sipping champagne. Fabulous! The chefs here really enjoy what they do and it shows in the way the flavor of their food comes together."], ["Eric F.", "The food was good but not.great but for the price it was a good find ..drinks were really good"], ["Marek S.", "Great spot to start the night off especially during happy hour. Try the pork belly steam buns and shrimp fried rice! Very attentive staff and great red wines."], ["Divine A.", "We always enjoy our food and the service every time we come. One small request: New stuff on the menu please!!!"], ["Nick G.", "When my wife and my 10-year-old son arrived at Extra-Virgin, we entered a pleasantly decorated, rather swanky, restaurant that clearly catered to a tapas crowd.  Steven, our server, immediately presented us with menus of exotic dishes. Upon inspection of the menu, we saw that the price for the servings matched the prices of tapas restaurants that we have encountered in Orlando, Atlanta, and New York City. We therefore ordered what we thought was a sufficient array of dishes to satisfy our pallets.  Our excitement of what we were ordering was enhanced by the smells, aromatic and spicy, emanating from the kitchen. We informed Steven that we were passing through and this would be a one time event for us. He quickly went over what he thought were the best choices to make off the menu, and we complied, wishing to pair a string of dishes that would match a culinary theme.  He reassured us that \"somehow whatever we chose would all come together in the end.\"How right he was. Our first round of happiness included duck tongue tacos with spicy pickled onions and queso fresco.  The gamey and sour flavors were attenuated by the small chunks of the creamy cheese, and it was a subtle but nevertheless delicious opening foray.  The sea salt brought out for us to spoon on as needed brought these flavors out more fully.  The chickpea fries were stacked in a log cabin presentation which was appealing visually, and the plate contained a smear of a red pepper sauce.  This was a surprise, for this side was a truly novel experience for us, and we enjoyed the fries immeasurably throughout the meal, using them to soak up the juices of subsequent dishes that followed.Our next round of culinary delights included peppers stuffed with morcilla sausage and Pecorino cheese, both of which gave the piquillos a long finish of several layers of favors.  In addition, chorizo and fig filled chicken thighs served as a sweet counterpart to the peppers, and its juice was a perfect partner for the aforementioned chick pea fries.  The pièce de résistance, however, was a dish traditionally representative of the most basic of American staples: macaroni and cheese.  In the world of Extra-Virgin, macaroni and cheese exemplifies the concept of gourmet. The dish was prepared with poblano cheese and served in sizzling iron skillets. The combination of creaminess with the brittle crispiness of its shell and its sides which stuck to the pan were pleasant to chew, sensual for the tongue and pallet, and layered with a long finish of taste which paired ably with the locally brewed beers we drank.  How could so much food fill three people up so satisfyingly?  I think it was that in the bursts of favors, the sensuality of the textures, and the balance of the foods and spices used to prepare the tapas we were forced to slow down in order to savor every bite.  By the time we were ready to finish with a cheese assortment, we had to ask Steven if he had begun to prepare it, and upon finding out that he had not, we were able to gratefully cancel as its presentation would have been overload.Steven was right: it all came together, and in a very big and glorious way. It is a great value for the price, for the portions of the tapas were generous. Extra-Virgin unequivocally gets the RSA: the Roaducation Stamp of Approval ... at the highest level!  Thank you, Michael Smith!"], ["D V.", "My wife and I went here Saturday night for dinner and had a wonderful time.  We are foodies that love bold, interesting flavors and something outside of the norm for Kansas City.  Wait times were reasonable, service was impeccable (friendly and attentive without being obtrusive) and the food was amazing.We had the chick pea fries, duck-tongue tacos, heirloom tomato and ricotta cheese plate, avocado and something tacos, and a take off on shrimp ceviche.  Great twist on the traditional cocktails too.Dinner for two with one round of drinks came to $80 all-in, so it's a little pricey, but I feel it's a good value given the quality and variety of food you receive.We'll definitely be making the drive up from south OP just so we can try more things from the menu!"], ["Zac S.", "This place is fantastic. Berto at the bar creates some great drinks and makes for a fantastic dining experience. Try the pork belly steam bun."], ["Anthony G.", "Having recently moved to KC and looking for some high quality places to eat, I was directed towards Michael Smiths and Extra Virgin. 1. Atmosphere - With an extremely energetic and great bar filled environment it was a really just \"fun\" all over. Staff knows their menu and Bartenders know every drink in the book, how to explain it for a novice, and how to really make your time enjoyable. 2. Food - INCREDIBLE... for a Tapas place, I was extremely impressed. We ordered 5 plates to test. We ordered to hummus, the shrimp fried rice  (MUST GET), Spanish Meatballs, The hanger steak, and for Dessert the Pear Crostada.3. Bar - As I mentioned earlier the bar was very impressive but many key items stand out. The bar space is great, no matter where you sit, you have en elegant view of everything want to see. I ordered \"The Last Word\" which was a first for me but very enjoyable. It's always fun to be in the middle of actions that witnesses all the and food coming your your way or around it4. ONE MAJOR SETBACK WHICH IS THE ONLY REASON THEY ARE RECEIVING 4 STARS RATHER THAN 5. I never brought this to the attention of any manager but I should have. As mentions earlier we ordered the Hanger Steak, which was delicious by the way. It was prepared with a side of kale but the steak is rarely cooked and sliced thin. After enjoying it, I turned around to notice the cook preparing all of these Steaks so it was clearly a high seller. While watching him, there were no gloves worn whatsoever. I'm not a picky person but growing up in the food industry I know you can't do that. If your chefs are visible to the front of the house, you CANNOT be putting your raw hands on every dish you prepare. That's is just a no-no. I witnessed him grabbing multple raw pieces of meat along with the kale itself and other dishes without washing a single finger or ever decided to use gloves. What bothers me the most is the fact that the restaurant is set up that way in which w can see them prepare... if I can see you touch my food, please give the customer a since of security when eating because it was flat out DISGUSTING. Blood from someones steak then to grab the kale without the use of tongs is unacceptable and I hope Michael is informed. Overall besides one incident, I loved it, I will return, and I will recommend to everyone."], ["Alexander R.", "My wife has been wanting to go here for a while now. I wish we had gone before they got bored with what they were doing. The place was slow. But it still took over 8 minutes to be greeted by our server. We were seated as she cleaned the table next to us. When she continued to clean as I stood waiting to be able to pull out my chair, I thought, please don't let this be my server. She isn't planning on being sat anytime soon. But, as her little bee tattoo buzzed by us two or three times, attending to the neighboring tables, I realized that we were indeed, in her section. My old fashioned was very good. But the food was bland and boring. I've had better deviled eggs at church picnics. Don't get me wrong, the food was all cooked well (only the chicken thighs were burnt). It was quite a disappointment. After spending 20+ years in kitchens, I understand how a restaurant can become content with just churning out the same thing and getting comfortable. But, when I am out for my 20th anniversary, I'm hoping to get something amazing. Or at least intriguing. I hope to try them again, once they have regained interest in what they are doing."], ["Sharon M.", "Really a fun place! Excellent food. Went for happy hour and enjoyed the potato chips with bacon and the super yummy mac & cheese. Only negative was that I had to work pretty hard to get the bartenders' attention."], ["Amber T.", "If I could give 0 stars I would.So, I've loved this place since it opened, and have eaten in several times and have been extremely pleased with their adventurous offerings (I even tried the shaved tuna heart pasta when they had it on the menu!). I live and work in JOCO, and rarely get to eat anything decent for lunch for lack of places near my work. My boss told me he was going to run over to the downtown Arthur Bryant's for lunch today, and did I want anything from there, or the area around it. I was like...\"Hell yeah, Extra Virgin!\". So I call and order the chicken thighs, hangar steak, and churros. I had a little over $20 left on a GC my boss had gotten me for my birthday (knowing how much I loved EV), so I handed it to my boss along with my debit card in case it went over by a couple of bucks, and told him it should be about $21. He calls me from EV saying that it's $27, and I was like \"Whoa nelly...read me the receipt\", he did, and everything was correct except for the hangar steak. On the lunch menu online it is $8, but they charged me $13. I stayed on the phone with my boss and told him to tell the pick-up person (apparently the bartender) this. The guy could not give two fucks less, apparently, and basically said \"it is what it is\". I told my boss to tell the guy that unless they'll honor the price (CLEARLY LISTED) online, then they could keep the hangar steak. So...they kept it (and I'm sure threw it away). Absolutely unbelievable.Guess what EV? Myself, and my SO have probably spent nearly $1,000 total at your place, never mind the friends we've introduced to your food. We won't make that mistake anymore...trust me. You've just lost two customers, and a good source of referrals over your $5 mistake."], ["Mari M.", "I've been here a few times over the past couple of years. It's special. The menu consists of items you won't find any other place. And that's a good thing!I've found the service to be good and the food very high quality.  The food seems simple  but you can tell that care is taken to ensure that the food is flavorful.Right now I'm regularly craving their Missouri Tomato Salad. If they take it off the menu anytime soon I may need counseling."], ["Nick G.", "Saw this place on the Food Network show \"The Best Thing I Ever Ate,\" and knew that one day I would venture to this place where they serve one of the most interesting and adventurous plates I've ever heard of... Duck Tongue Tacos... and they were excellent!  I didn't really know what to expect as I bit into my first mini tapas sized taco, so I closed my eyes and dove in, and the experience was one of the best I've had in regards to tacos.  The first thing I tasted was a burst of duck, salty, flavorful, and robust.  Also of note, the texture was much like a duck breast, and less like other tongue tacos I'd tried (lengua-cow tongue).  Next I got the crunch of the shell, and a bit of the queso fresco.  Then lastly there was a burst of zesty flavor, which came from the pickled onions.  I really enjoyed those tacos, and could've easily eaten another order or two!Next up I ordered their tuna Ceviche Tacos.  They were recommended to me by the waiter as being \"very popular.\"  Unfortunately, after my first taste I knew that these didn't come close to the Duck Tongue Tacos, and just weren't really that good in general.  The taco shells were made softer, with less crunch than the previous ones, and I found it to be perfect for the dish. There was a pinch of acidity, which is expected in a ceviche, but then the avocado didn't taste fresh, and there was a lingering unpleasantness to the dish that I couldn't quite place.  The jicama was an interesting addition that I'm still not quite sure about, since it added a nice texture to the dish, but may have contributed to the dish's overall strange taste.  Overall, I would skip this dish next time, and can't recommend it.Last, but for the love of FOOD, NOT LEAST!!! I tried their Wood Fried Hangar Steak.  It was Absolutely Fantastic!  The meat was perfectly cooked and delicious. The \"bacon marmalade\" and the poached egg perfectly complimented the meat, served lastly with a side of cilantro... Absolute perfection!  This stole the show in terms of flavor, and has to be my favorite dish of the evening.So I say, try the Duck Tongue Tacos, and have some steak with it!  Your welcome.  The place is a bit pricey, so maybe don't come if you're in a buffet type of mood.  But if you're looking for something to really satisfy your palate, look no further.P.S. I finished the night off with some Milk Chocolate Banana Bread Pudding w/house made toffee sauce drizzled on top... yumyoutube.com/watch?v=gZH2…foodnetwork.com/local/mo…"], ["Curtis H.", "Yummmmmm! Extra Virgin did not disappoint. I dined here with a work colleague on a Monday night and was able to sit outside on a very pleasant April evening. We shared 5 plates including a meat and cheese selection. Everything was thoughtfully prepared and very tasty. The atmosphere is pleasant, and the service was excellent. I would definitely return, as the menu is extensive and I have a lot more I would like to sample. Chef Michael knows what he is doing. I've also dined at Affare, so I am a definite fan!"], ["Chris R.", "Went here for happy hour with some friends. Had the roasted bone marrow. It was delicious. Nice place, i will go back."], ["L B.", "Pros: open seating at bar, great sangria, ordered and loved: Spanish meatballs, hummus, duck tongue tacos, patatas bravas - all were amazing!!! Fun atmosphere, friendly staff and bartenders, easy location to get to, easy parking in lot across streetCons: hard to get a last minute reservation (could be a pro)"], ["Michelle A.", "Extra Virgin Happy Hour never disappoints!  Came here today to give their roasted marrow bones and chickpea fries a try. Both were very good! I highly recommend this place to those who enjoy a culinary adventure."], ["James D.", "Extra Virgin, that is a good way to describe myself when it comes to some of the dishes they serve. I was initially intrigued by the odd ingredients of some dishes like pig ear, tripe, beef heart, or duck tongue. I ended up sticking to some normal dishes, the chips where pretty good, they use dried plantains as well as potatoes. I think my favorite where the empanadas and mac 'n cheese.The vibe is very bright and almost funky but not overdone. There is a 30 dollar corking fee if you bring your own bottle of wine. Our waiter was very knowledeable but I think he had a slight ego about himself which was kind of weird. None the less the service was good, the plates come to your table as they become ready, not all at once. My tip is to not finish your first plate but pick at it and wait so you have a few plates to mix around. I think part of the fun is mixing the different dishes together and switching back and forth. I would suggest about 2 plates per person 3 if you are both very hungry."], ["Patty B.", "I was super excited to come back here after my first visit. So excited that it was the only restaurant we HAD to go to no matter what on our very short visit to KC. I don't know if my expectations were just too high but I ended up being pretty disappointed.We went around 1PM or 2PM and there were maybe only 3 tables that were occupied and a couple of people at the bar. No one greeted us and when someone finally showed up, he kind of just pointed to a table. The whole time we were there, the waiter just seemed like he just didn't want it be there that day like walking really slow, avoiding eye contact with us, and not checking up on us at all. And during our lunch, I could see him eating his lunch, which is fine because everyone should have a lunch break but I wasn't expecting to see the waiter eating while working at whats supposed to be a really nice restaurant. About halfway through our meal, another waiter showed up to start her shift, and she starts dusting everything. I think that's pretty darn weird that they just didn't do it before the restaurant opened. And it did bother me that we were eating and there was dust floating around from her dusting.As for the food, we got a few of the same things that were our favorites from the first visit. The duck tongue tacos and pablano Mac & cheese were still good. Everything else was forgettable. I can't even remember what we had which was unlike the first visit when I remembered every dish and how tasty it was. And no delicious cookie with my cappuccino. :(I guess I would go back to this place but my expectations will be really low and if it turns out to be like my second visit then that'll be it."], ["Andrea C.", "My absolute favorite restaurant in Kansas City. Don't leave without trying the Grilled Bread & Ricotta and the Spanish Meatballs. I have yet to be less than thrilled with anything that I've ordered.EV also has the longest happy hour ever -- 11:30am - 6:00pm, Monday - Friday. Most plates are half price, and $2 off glasses of wine. Perfect for a long lunch or just living there and reveling in the endless deliciousness."], ["Karla M.", "I think EV has a \"hype man\" that apparently took the day(s) off when I came in - I just don't get the hype about this place.The tapas are \"meh\" at best, while the prices for what you are getting are \"WHOA!\" I've been in a couple of times, once during lunch and once during dinner.  They have a nice lunch special so if you're set on trying this place out I would recommend doing lunch. I don't feel that the tapas are very good at all, in fact, I feel like they lack so much flavor!  In my honest opinion I think La Bodega is better for tapas and I like the environment so much more, but not the one in Leawood (STALE!!)  When we went in for dinner we ordered a variety of tapas the best were the tuna tacos tiny little things and when you break it down they were worth $4.00 a piece. pffffft. Also we sat in a row of tables by the front entrance and on more than one occasion I was looking at a waiter's ass as I was chewing my food. The service was sub par at dinner.  If this is the kind of restaurant behind the Michael Smith name please believe I will most definitely not make it next door to \"Michael Smith\" or back to EV."], ["Ellis M.", "So very excellent. Quite a variety of small plates to choose from including several very good vegetarian options. The grilled oyster mushrooms are incredible as is the caprese salad. Husband loved the bao buns. And also delicious, unique cocktails. Service was good. A fun, casual atmosphere. Strongly recommend."], ["Clarice W.", "If you're looking for THE tapas bar in town, go to Extra Virgin. If you're looking for a restaurant to excite your taste buds, go to Extra Virgin. If you're looking for a place to get a fantastic Old Fashioned, go to Extra Virgin. Bottom line: go to Extra Virgin! I highly recommend trying the \"adventurous\" items on the menu here. If you have never eaten offal before this is the quick and dirty way to get you hooked. The beef heart was more tender than I expected - a testament to the chef - it could have passed as an actual cut of meat rather than heart. The chicken gizzards were more blatantly \"offal\" in nature (may not be the best choice for newbies), but paired with the acidic chimichurri and crunchy pomme frites the dish ended up quite balanced. The pork belly steamed buns were a fun play on traditional Asian pork steamed buns. The pork belly was so luscious with just the right amount of fat remaining and a crispy edge. However, I recommend not letting this dish sit for long. The juices from the ramp garnish, while delicious, seeps all over the place. Over time the fluffy bun becomes soggy and the pork belly loses its crispy edge; you don't want to miss out on these textures so eat it quick. But, my god. What really stole the show was the marrow: rich, gelatinous scoops of it topped with crunchy pickled peppers spread on toasted bread, this dish is not for the faint of heart - or for those watching their heart health. But for everyone else, this is a must-try.I was also impressed at how aesthetically beautiful all the dishes were. It's not easy to make hefty, gray-tinged beef bones look delicate and vibrant, but Extra Virgin achieved that. This restaurant fully demonstrates just what you can do with offal if you're thoughtful about the preparation and presentation. 50% off HH specials until 6pm make this a totally affordable opportunity to treat yourself to this creative and scrumptious culinary experience.It doesn't hurt that I was served the best Old Fashioned (or \"not so old fashioned\" as they like to call it) I've had in KC yet here. The ambience is modern, a touch romantic - it suits the tapas concept well. And to top it all off, our server was jovial, attentive, and helpful. What's not to love about this place??Extra Virgin has definitely topped my list as one of my favorite places in KC to indulge in my foodie desires."], ["Ann W.", "Extra Virgin, I really wanted to like you more. Really, I did. First, the photo on the landing page of your website of the interior looks awesome! But the look and feel of the place just didn't match the photo. Bummer.One thing that I rarely see mentioned in a review is the seating in a restaurant and for good reason: it's rarely an issue. But I have to say that my butt was terribly uncomfortable on your chairs. Really. At a restaurant like EV, people should be encouraged to stay a long time and order more and more small plates. But if your patrons are squirming in their chairs due to butt pain, they're not likely to stay for long and work their way through your menu. The service was friendly and efficient. The food was not nearly as exciting as I wanted it to be. There was only one item that I would order again: the chorizo and fig-filled chicken thighs"], ["Stephen H.", "Seriously - two years since I've reviewed EV?  I've definitely been here numerous times since then and love it.I was in recently and was just grabbing a quick drink at the bar before a dinner reservation we had nearby.  Despite the fact that I was just ordering a drink with a friend we had very attentive service from a very busy bar crew.Thanks Michael and Nancy for building a concept that delivers consistency.  Might be the hardest thing to do in this business."], ["Michele N.", "We met another couple for an evening out at Extra Virgin. Our server was knowledgeable, but very aloof. I'd say that he didn't really want to have a relationship with us (and I'd consider us pretty easy going and fun peeps)! Our specialty drinks were nice. We weren't sure what/how much to order, since it is small plates, so we just started with a few items. As the evening went on we kept ordering more, looking for satiation! I think we ended up with seven or eight dishes (four people), and we were definitely satisfied! Everything was yummy, but at the end if the night a hefty bill didn't match the food quantity.  I think I'd go back during happy hour for sure. Our favorites were the dumplings, chick pea fries, crabs cakes and the chorizo and fig chicken thighs (although a very small order)."], ["Stephanie K.", "Loved this place. Service was great! Our server was very attentive and knowledgeable. It was clean and open. I liked the fact the kitchen was open to the dining area. Great décor and food. Loved the sangria, ceviche with plantain chips ( specialty for the night), and fried Jonah crab claws."], ["Matt E.", "OK Extra Virgin. Can we be friends again? In my last review I all but wrote this place off. It was that bad of an experience. But since then I've probably been back a dozen times and it's been fantastic. Sure, there is the one douchey server that I try and avoid, but everybody else that I've interacted with since has given fantastic service. Quick, efficient, friendly and helpful. I always love the drinks. Dang good stuff. My only request would be to add some more spicy cocktails, as lately i've determined that I LOVE spicy cocktails. The food? Well, it's certainly not my favorite all-around menu in town. Still, there are a couple of things I REALLY like. Their ceviche is awesome, as are the duck tongue tacos. There are other things that are good too, but those are my favorites.The atmosphere is certainly nicer than during my previous review, too. better music and lighting, and the kitchen staff seems to have learned their manners.Sorry for being so harsh before, Extra Virgin. But it looks like a little tough love did you well."], ["eva G.", "This place is really good their food is fresh i love their duck tacos, bone marrow and the lamb kidneys are some of my favorites.  The waiter last time we went was a little snooty and didnt even mention it was happy hour until we paid our bill i noticed my beer was half off and my husband's wasn't.  I think its just good service to mention to your customers hey its happy hour right now we probably would have bought a couple more drinks had we known we were paying half the price.  Its the little things to take your service from good to great."]], "Papu's Café": [], "Jerusalem Cafe": [], "North Kansas City Cafe": [["Rob O.", "While on business in the area, my colleagues and I were looking for a place to have lunch before our business meeting.  Most of the places in the area were either sports bars or pub type places, so this little place was a gem.  Family owned and operated, the owner came to our table to tell us his story of his career with TWA (memorabilia was tastefully scattered along the walls).  Customer service came first as you can tell from the service and the joyful anecdotes.Great family atmosphere and they served much more than just Mediterranean and Greek.  I had probably the best and freshest Reuben sandwich I've ever had.  the Hummus and pita bread was definitely home made.excellent pricing."], ["Danny B.", "In the heart of North Kansas City, yes the town, not Kansas City North the location.  Anyway, you can sit outside if it's nice and do a bit of people watching - which is typically great given the prime location.The decor is decidedly TWA, but again not a problem if you sit outside.  The owner is the Chef and the staff is very friendly.We've been here a couple of times and the appetizer sampler is very good. I've heard from some of my companions (ok one) that they have the best dolma around - not sure I agree, but it is tasty!The gyro meat is very good, the chicken skewers were good too, but the steak was a bit tough.  We also had some homemade pecan sandies for desert - that was great.  Overall, a very good Mediterranean restaurant with nicely done food, good flavor abd I highly recommend!"], ["Michele N.", "This is the second time I have been here for lunch with my mom, who lives in NKC. It is a quiet little cafe that offers good Greek food at reasonable prices. We had previously enjoyed the Greek salad so we ordered it again. We had also previously enjoyed the Greek grilled cheese, which is made on pita bread - genius! On this visit the salad came out and was prepared with leaf lettuce instead of romaine (there is nothing similar in these two lettuces, so don't even try to fool me). The salad also had just 2 olives in it and a scant few onion slices and tomato. When I mentioned it to the server she commented that the chef had purchased leaf lettuce instead of romaine at the market because it was cheaper and that a new person was preparing the salads! The owner came out to our table and sat down and talked to us and apologized for the food. He was very genuine and appreciative of our business and our comments. It really is nice to have a restaurant owner who understands the importance  of his customers. The cafe is simple inside, and also has a nice outdoor seating area to enjoy in the warmer weather. They offer free drinks to seniors too! We will definitely patronize the North Kansas City Cafe again."], ["Samantha B.", "I believe in dining locally when possible. This cafe is unique and the staff is friEndly. If you like Greek or just wanna try something new, this is the place to be!"], ["Tayler V.", "soo so great! Just passing through the town and found it. Homemade comfort Greek foods. Talked with the owner for a little bit, everyone was so friendly and hospitable! Will definitely come back if in town again."], ["Lanna R.", "The owner is so attentive and wants to make sure you have a great experience, I love locally owned restaurants like this!Servings are plentiful and delicious, wonderful gyros & love the Tzakiki sauce!!"], ["Eric D.", "My family and I have eaten lunch here a few times. We always had great personable service. Even a few desserts comped.  A great family experience. At least one of the owners will come check on you.They have an American menu and a great Greek menu. I discovered it when searching for a gyro.  Would recommend it to anybody who in the area."], ["Faith B.", "I was excited to discover, from reading reviews on Yelp, that there was a place serving Greek food nearby. I ran to North Kansas City Cafe over lunch on a work day. I looked up their menu online and called in my order so it would be ready. Unfortunately, it wasn't ready or even started when I got to the Cafe.That would be my single complaint about this place - I waited for a really long time on a vegetarian gyro and fries.But, the people were friendly. A waiter brought me a soda while I was waiting. The waitresses kept giving me updates and checking on me. The cook/owner came out and asked me if I wanted some additions to the sandwich. The veggie gyro was tasty, with juicy mushrooms and fresh, soft pita. I usually love cucumber sauce, but theirs was just average. I will go back to try their other Greek menu items though. It's a good addition to the ethnic food mix in the area."], ["Jeff K.", "You have to try this place!  Moe puts love into his food & he goes out of his way to make customers happy. He makes a great mixed kabob plate with perfectly seasoned and grilled lamb, chicken, beef, and gyro meat.  Served with fresh salad, homemade dressing and topped with mango.  Just found his place - already been a few times & I'll go back again when I'm in the neighborhood.  Been great every time."], ["Anitra W.", "Absolutely loved it first time here!! We had the gyro omg great and the customer service excellent I will definitely be back if your ever in the area it's a must!!"], ["Michelle M.", "The owners are so friendly! Husband and wife, wife serves and husband cooks. Fun old TWA decor, quick and yummy Mediterranean food."], ["Justin H.", "The meat sampler platter is fantastic! Weird hours, but if you get the chance, enjoy some fantastic food hidden away in downtown Northtown."], ["Wenday L.", "The only reason I didn't give this a five star is because I haven't had any authentic gyros in my time so I can't say if this is truly good by that standard. However, the traditional gyro that I got was perfect! I ordered it with fries, which was the perfect complement for my fatty food craving.The staff was also extremely friendly. I noticed that they also have fresh squeezed lemonade, which I would have tried but I was rushing for lunch so I didn't get a chance to get some. I will definitely be back to try that and something else on their menu!"], ["Cory K.", "This is an interesting place where the menu doesn't match the decor but everything is great.  Half Greek Half Dinner food allows something for everyone. The Gyro is wonderful."], ["Ashley J.", "This was some of the BEST food I have had from the greek menu.  I will absolutely be going back, and I will be recommending it to others in the area.  I have been on a mission to find good lunch spots in NKC on days when I don't want to eat at home. The only reason I am not giving it 5 stars is that I looked at the menu online, then went in, and my bill was different from both the menus (online and there).  I didn't say anything because it was only the difference of $1.00 or so, but I just thought it was a little odd.  All in all, great food, good location, friendly staff!"], ["Gary W.", "Excellent food and great service. Highly recommend.  Had the chop steak burger and fries.  Meat was seasoned very well. Didn't need condiments on it. Ate it just as it came to the table. Great atmosphere if you love planes. Lots of TWA memorabilia. Fun to look at."], ["Jodi S.", "We are doing the \"try something new\" thing so we took a suggestion from a kc magazine. I have never had real Greek type food. I am now hooked on gyros! We shared a sampler dip plate, LOVE the muhammara (roasted red pepper)! We also enjoyed the spanakopita! Many American choices are available too if that is your preference. They also serve desserts that looked so good, but I was way to full! The Greek salad was great, many lettuces and I loved the house- made dressing light and tasty. The owner is so sweet and nice, very eager to please, offered suggestions, and made our plates special since he  knew we were sharing! Everything made for us. We will be back!"], ["Rebecca G.", "Ate here for the first time today on a friend's recommendation... wonderful!  I was in Greece last year and have been craving good Greek food ever since, and I've finally found it.  Plus, the owner is a darling man.  Glad to have supported this local business today, and I will be back soon!"], ["Beau E.", "This place is very strange...TWA pictures and memorabilia galore.  I don't get how it relates to Greek and American food, but whatever, if that's what makes the owner salivate excessively, then it's his place...let him do what he wants.The food...actually pretty good.  I had a Greek salad.  It came out a little light on the dressing, the server hooked me up with an extra, and the salad was right on time.  I followed it up with a slice of cheesecake that could cause withdrawals if you got addicted to it (which wouldn't be hard to do).  My instinct was to try the baklava, but the server made a strong case for the cheesecake.  I am glad she talked me into it.  It was the perfect addition to my lunch.The service was good, the owner interacted with the guests, everything came out nice and fast.  if I came back to the neighborhood to catch a flick at the Armour Theater, I would pit stop here and check out the gyro or maybe some of the American food.  As weird as it is...the place works.  It's worth a pit stop to check it out for sure."], ["Cory C.", "Amazing food and the staff is so friendly! They got us in and out quickly for lunch, but made sure to make the lunch personalized and all of them talked to us. Great all around experience, can't wait to come back. Best lamb gyro I've ever had!"], ["Jacob B.", "Holly and Moe are absolutely amazing. Love the atmosphere here. The service was amazing. THEY ARE SOUND FRIENDLY. LOVE IT HERE!!!"], ["Terry S.", "the prices are very reasonable, food was excellent,and the staff very pleasant and efficient! Had a long conversation with the owner, a retired TWA worker! This a new favorite for Greek!"], ["Andi E.", "I've tried nearly every Greek place in the city, and this is my new favorite. The prices are reasonable and the service was excellent. The waitress came by our table numerous times to check and make sure everything was good. The restaurant had a lot of personality. It's not the traditional Middle Eastern decor you might expect, but the TWA memorabilia is really neat.  I ordered a vegetarian plate with a side of hummus, and there was way more food than I could possibly eat. The \"side salad\" was definitely a whole meal salad. I'll definitely be back. My only complaint is that they're not open for dinner - I would make this a date night rotation if it was."], ["Tyler K.", "I regularly visit this small Northtown establishment for lunch. When I arrive I am always quickly greeted and the staff is very kind. I usually get a Gyro, some fries, and a side of hummus (w/pita). The prices are very reasonable and the food-service is quick. When I dine in with other people our drinks are promptly refilled and the server does a good job checking up. As far as the mood goes I really enjoy the TWA theme as it adds some customization to the restaurant that you rarely see. Overall from what I've experienced this is a great restaurant that I'd suggest to everyone, especially people who enjoy simple, cost-efficient Greek food."], ["Rob H.", "Very surprised with the North Kansas City Café.  For the end of July the weather was cool, so we were able to sit out on the patio and enjoy the nice weather.  The manager was our server and was very helpful.  We had the Greek Sampler dip platter which was outstanding.  Then we both got the gyro which was perfect. Very excited that there is a place that serves Greek food north of the river. The manager was telling us that there is a plan to open up a Greek bakery in the very near future.  Really looking forward to that."], ["Cathy C.", "I know this place as the North Kansas City Cafe-that's how the sign reads outside.  You kinda have to know it's there-it's in a tiny office building behind Country Club Bank in Northtown. But it's worth looking for, especially if you're a TWA fan...let me explain.The owner is a Middle-Eastern born (sorry, Moe, you never said where) gentleman who was laid off from TWA. He's amassed a fairly impressive collection of TWA memorabilia for a place its size, so there's plenty to look at while you're eating some pretty fine chow...He does breakfast; I haven't sampled the menu-but yesterday I heard him tell a customer he'd serve it any time. For lunch and dinner, you can get a fairly standard variety of sandwiches, salads, and American entrees...but I always order off the Mediterranean page. It's a pretty standard variety, but I've never had anything I didn't like-portions are generous, and everything is seasoned beautifully. I had a couscous salad, and it was delicious-warm couscous and veggies (Moe came out and asked me which ones I wanted) over greens with feta cheese, lemon juice, and olive oil. My daughter's lamb gyro was HUGE. I've also enjoyed the hummus and baba ganouj (sp?). Not sure what to get? He has a sampler plate. Still hungry? I'm not a huge fan of baklava, but I do like theirs.Service is very warm and helpful. Prices are VERY resonable-I don't think there's anything over $12, and as far as I know, no liquor service. The place is small and bright, and, as I said, laden with TWA memorabilia. A great place for a meal if you're in Northtown."], ["Sharon V.", "We have now eaten here 5 or 6 times and have become fans. They serve both American and Greek food. Can't say I recommend it for anyone in a big hurry but for us, the Greek food is worth the wait. The decor however is NOT Greek!  The owner, Moe, worked many years for TWA and the cafe showcases his large collection of TWA memorabilia.    Moe and his wife are awesome!  We have never been there that at least one of them didn't spend time with us or bring a sample of something to try.  The Greek Soup is monumental, So much flavor packed in SOUP!   We always have a sampler platter and Greek Salad plus whatever else, Greek, strikes our fancy.  Our only disappointment so far is that they close mid afternoon and are not open for dinner.  NKC Cafe proves that looks can be deceiving."], ["Mary Jane W.", "My friend and I ate there today.  This was my fourth time and her first.  We both had the gyros, and as always, they were delicious.  The owner and staff are all very friendly and eager to please.  We'll be back."], ["Marlon W.", "We went here because we had a coupon for half off, and are very glad we took the chance.  My wife and I started out with the Sampler platter.  It had many Greek bites that were extremely tasty.  Next, we ordered the gyro with chips and the bacon cheddar burger w fries.  We told them that we were splitting each entree, and asked for an extra plate, as we so often do.  No fuss.  No muss, as so many places give you.  They were more than happy to do so.  In fact, each entree came out already split, on separate plates.  Always a nice touch.  The gyro was meaty and delicious.  The burger, nicely dressed and tasty.  My only complaint on the burger would be that we asked for medium rare, and it came out over cooked.  In their defense, we didn't say anything, but we are positive had we done so, they would have happily corrected the issue.  Now for the really good stuff.  This is a mom and pop place.  I dig a good mom and pop place, and this not only doesn't disappoint, it goes way above and beyond, which is one reason we couldn't bring ourselves to mention the burger wasn't cooked to our request.  How could you tell your sweet mom/grandma and dad/grandpa, depending upon your age, that the meal they slaved over to make everything perfect was just a bit shy.  I certainly couldn't, and my finicky wife, certainly couldn't either.From the moment we entered, we were treated like family.  The owner, Moe, could not have been more friendly and willing to serve.  He gave us a tour of the place.  They have a nice party room in the back, and it was very nice.  For your next outing, I say give this place a try.  Talk to Moe and his wife.  You'll be glad you did."], ["Ashleigh L.", "Food and service were great! Had the garlic lemon chicken with greek salad and pita, all were fresh and delicious and came out quickly. The baklava at the end was the highlight of the meal, huge portion! Would definitely recommend if you're in the area for lunch."], ["Nancy K.", "I knew, I knew, I knew.  The non-sign, sign they have that just says CAFE outside in Times New Roman, the fact that meatloaf was the \"special,\"  the sort of theme, non theme with TWA and coke(?), the quietness....no music at all, it was all a bit unnerving.  However, if you are going to try it, stick with the Greek side of the menu.  There were things like hummus, spanikopita and a gyro listed.  I opted for the gyro without the Greek salad, which in hind sight would have been the way to go.  I wish they would advertise even slightly on the outside of this place that it was Greek.  I think more people would be willing to try it and then they could get rid of the rest of their \"menu\" and focus on the things they do well.  The other thing I learned about this place that if you get a to-go order, you get a free iced tea.  A to-go order would be best at this place because the sparseness combined with the awkwardness is enough to make you want to leave.  My husband's meatloaf was mostly bread and it had gristle in it.  Yikes.  He was impressed that the green beans seemed fresh and not canned but that was the nicest thing about his meal.  Stick with the Greek!"], ["Nancy F.", "First off let me say I'm not sure if this is a change in owners, or a seasonal opening, but when we went in today they said they had only been open a week, and they had 2 menus: Greek & American Fare. The server said they were working on the menu.    My friend and I were excited to see a Greek place so we ordered a few things and split them between us.   Service was fairly quick considering the rush crowd and our first plate to arrive was the appetizer sampler. It came with lots of pita, hummus, baba ganoush, a cucumber salad, spanikopita and dolmas. I loved the dolmas and ordered another full order of them. They weren't too big and heavy, just the right amount of sour (though I did add some sricha to my plate), and had a hint of mint that I loved. I thought the hummus tasted ok but wasn't creamy...more like runny. I don't like baba ganoush so stayed away..my friend seemed to like it though it also looked gummy. The cucumber salad was meh and the pita was toasted though a bit greasy. The spanikopita was a bit greasy as well, but indulgingly so. The whole plate was sprinkled with feta goodness.   Next came a gyro which we split. I thought it was good...but then I don't like gyro usually, so if this is an Americanized version of a Greek classic, oh well, at least it was yummy. Pita was soft, meat juicy, tomatoes ripe, cucumber sauce creamy and well seasoned. The only thing I absolutely would never order again was the steak fries that came with the gyro. If that is a predicator of the level of American food, I would stay away. They were obviously frozen, tasteled off, tough, underseasoned. Just yuck. Sorry I forgot to take pictures of our meal.    Well, overall I think we would go back for the gyro or dolmas."], ["Pam R.", "Very good experience!  Good food in a fun atmosphere.I had a Gyro with a side salad.  Requested no onions but extra olives and both requests were honored!  Gyro was not greasy and had a nice clean taste!  Will go back, wish they were open for dinner!"], ["Scott D.", "This place is very clean, although cold, and the proprietors are very friendly.  However, IMO the food is not very good.  We ordered hummus first, which was quite thin and a bit lemony.  The pita bread wasn't bad except it had some salty seasoning, almost a film.  I had a gyro, which might make a healthier substitute for eating a burger, but it was the most uninspired gyro I've ever eaten.  My wife had the sampler platter, which featured lots and lots of pita slices (more than half the plate), some of the thin hummus, a stuffed grape leaf, and some smaller items.  I feel badly for saying this, since the couple was so nice, but I'll never go back."], ["William H.", "I've only eaten in this place once.  It's a dive.  No frills.  Even less frills than places that claim to have no frills.  Nothing fancy about it.  Everything is ultra simplistic.  However, if you just want a quick basic breakfast cooked right for dirt cheap I can't think of a better place to get it.  The eggs, potatoes, and bacon were all about as good as I could have done myself and so cheap that I felt like I stole them.  The service was excellent and the staff was very polite and attentive.  If you use some upscale place on the Plaza as your measuring stick then you're gonna be disappointed.  However, compared to other places of it's kind I'd give it a thumbs up.  I WILL be back."], ["Elaine D.", "I went back to the North Kansas City Cafe for lunch today and ordered the Country Fried Steak (aka chicken fried steak).  It was just what I was in the mood for and it was good!  It comes with veggies, mashed potatoes and bread and butter.  All topped with good brown gravy.  Good comfort food.  Portion size was just right.  I'll be back to North Kansas City Cafe for more!"], ["Katy P.", "We enjoyed our lunch at this cute mom-and-pop shop. Delicious vegetarian gyro, Greek salad, & cheeseburger. Good compromise for one of us who wanted traditional American fare & one who wanted to be more adventurous. Both owners are very friendly & attentive, stopping to talk with us & especially to make sure the way they make the veggie dish would be okay. Great experience!"], ["Amy K.", "I have been to NKC Cafe a few times.  I'll have to admit I only order from the Greek choices on the menu.  I was happy to find out from the owner (who is very friendly and funny by the way) today that they are going to expand their Greek offerings.  The Greek salad is always fantastic, and the Gyro is one of the best in town. I tried the Dolmades today and was very impressed.  It seems they make everything from scratch as I have taken others there and that has been the overall experience.  It is quiet and unassuming, but the TWA memorabilia that fills the place is fun to look at.  It's almost a mini museum.  Over the last year the lunch staff has never changed and they do seem to remember people.  Like any good cafe they have daily specials and homemade desserts.  Today we tried the Greek style rice pudding and it was excellent.  I'm not usually a desert person, but the owner offered us a free sample.  (He has a tendency to do that).  If you are interested in trying this place currently there is a coupon, $7.50 for $15.00 on sweetjack.com.  Don't pass it as you are traveling down Armor Blvd as it simply says café on the overhand with a neon \"Open\" sign in the window."]], "Max's Burgers and Gyros": [["Eric B.", "Im new to the KC area i told my wife i wanna good cheese burger she said im going to take u to max's burgers and gyros she lives in KC so i said ok . One bite of the burger and i was hooked like a fish..... definitely worth eating at this place 2 a week"], ["Barbara S.", "KC yelpers have said time and time again that this place has the best gyros. If you know me at all, you know I'm a gyro connoisseur. Naturally, I had to eat here and I had to have a gyro. The gyro was huge. It was a large pita folded in half and filled with lots and lots of lots of meat. And onions. And tomatoes. And tzatziki sauce. You can get the combo with fries and a drink for $10 but I didn't do that. I'm glad I didn't. The gyro was more than enough. All the reviews said this place was small. I didn't exactly get *how* small it was until I walked inside. Think, 3 high-top tables and one bar across the window with 4 stools. So. Tiny. A tiny little diner with excellent gyros. They have a wide diner-style menu as well with this burger and that burger and fries and tots and onion rings and shakes. If I ever want a greasy burger and I'm in the area, I'll pop by again and do that. There's seating outside (long, wooden tables) so I might pick a day without a heat index of 101 and try that too. All in all, a good experience and I'll have to come back!"], ["Ryan H.", "Good burger... Good tots. Small place though and old guy at the front desk isn't all that friendly. I look at it like a fast food joint and not really a \"restaurant\""], ["Noah M.", "This place is certainly a divey place, very limited seating, not best decor. Very old fashioned, but the food easily makes up for it! One of the best gyros in KC here in Waldo, I just got the gyro which was a good thing because it was big and filled me up! It was delicious though! Was hot , meat seasoned and cooked to perfection, sauce was so creamy and had just the right taste. They also serve burgers which looked tasty too! I go here for there gyros myself though! Very yummy !!!! If you like gyros try max's!"], ["Lorie L.", "I had the gyro & it was great ! Hubby had the mushroom & Swiss & he said it was very good ... Wish it was closer ! Kinda a small place but the food is amazing !"], ["Chris C.", "Max's gyros are almost the best I've had in KC.  I grew up eating Greek food, so I tend to find much fast food Greek offerings to be disappointing. Not Max's. Max himself is a character. He's moody. He can be the most gracious friendly guy one day, and a bit pissed off at life the next. Generally, though, he recognizes his regulars and treats us well. On average, service is quick and yummy.The tiny dining area is about the size of your own kitchen, so other diners are really having oh-so-not-private conversations. It can be entertaining...    As long as everyone can hear your conversation, you might as well bring us all into it, right? This happens at max's. Adds a little flavor to the take out wait."], ["Amy K.", "Best gyro I've had since traveling to Turkey. The owner is incredibly sweet and always manages to remember who I am despite going every 2-3 months. The place is small with limited seats...and at lunch brings in a lot of male workers from around the area. The only thing I'd recommend if you're a lady going alone is to plan on bringing a friend! It can get a little strange being the only woman in a sea of men! It's worth the tastiness of the gyro, though. :)"], ["Forrest H.", "Really good gyro. Ordered a medium tater-tot, it was around 2 pounds of tots, huge for a medium (I'm not complaining). My wife is a gyro connoiseur, and she was wellpleased. Recommend."], ["Robert P.", "Good food, good price, simple as that.  Went here for a Gyro bases in yelp reviews.  It's a hole in the wall, but I don't mind that for decent food.  Prices were pretty good too...in short, I'll visit again when in the area but wouldn't make a special trip out of it."], ["Carol H.", "Max's. What can I say? The burgers are wonderful and I've had the \"Animal.\" The \"Animal\" is the 3 patty burger. Huge. Humongous!  I love it! The store is very, very little and the outside is the best to eat there. The owner is very kind and he opens the door when I leave. You see, I use a walker and sometimes some of those doors just don't want to play.I love the fries and the onion rings. The drinks are large. He even has a newspaper for people to read.  What's to not like?Come around and check it out! Have the cheeseburger and pig out! The \"Animal\" is so large, I get two meals out of it!Yummmm!It is small but mighty tasty!"], ["Kathy M.", "This is a small space that will send you to the Big Lots in the shared parking lot for a restroom. Hubby and I shared a gyro and a burger. We enjoyed both. We ordered a side of tater tots and decided that we would skip them the next time - nothing special. Of course, we had to share a chocolate shake and that proved to be a good decision and a nice way to finish our meal. We would not hesitate to stop in again when we are in the area."], ["Justin E.", "Look at the building, look at the photos of the burgers. You know what you're going to get here. The owner (who also runs the place) buys pork tenderloins every morning and might run out by the end of the lunch rush. These tenderloins are the best so get em fresh."], ["Andrew W.", "Everything on the menu is really good. It's a real family friendly atmosphere that has great employees making great food. I'm so addicted to this stuff I eat it just about every day. Trust me its nothing like McDonalds or Burger King ."], ["Billie H.", "I think the go to is gyros here. I tried a burger. For some reason I keep thinking I like mushroom and swiss burgers and a few times a year I get one. I really am not a huge fan. I like burgers. I like mushrooms. I like swiss. I think the gravy mix is what throws me. Minus that, the burger is pretty legit. You won't find the fancy combinations here, just honest old style burgers. The prices are in line with the fast food options in the area so skip those and go to Max's. The wait might be a little more, but it is worth it. The owner is great. He takes bread out to feed the birds. They support KCPT and proudly display their support. There are family pictures on the walls. Just a nice local owned business.There isn't a ton of room to sit, I would guess they do mostly to go. They have a small area outside with about a half a dozen tables. I will be back for a burger and looking forward to trying the gyro! Family picturesCrumbles up bread for birds"], ["Alex A.", "Fresh fast food and service. Great local joint with character. Supports KCPT public programming. Clean, bright atmosphere. No bathrooms, which is fine. The mushroom Swiss Berger was really awesome."], ["John S.", "Since I moved to the Waldo area Max's has became my local burger joint. Classic diner style cheeseburger. I would definitely recommend this place to anyone in the area. A must try!"], ["Nancy C.", "Great family owned place with great food and service. The best thing i love is the gyros def a must have.the shakes ate also great.im looking forward to the Polynesian chicken.its nice to have different food to try"], ["Sylvia T.", "My favorite place in town to have a good old fashioned burger with tots and a shake. I love going here in a nice day and sitting outside, the owner is always so nice and remembers me no matter how long it's been since I have been there! And did I mention I love the strawberry shake!! Go to maxes now!!!!!"], ["Tobi H.", "Big portions, great food and service!  Best gyro I've had in a long, long time !!  I will definitely be back very clean and the owner is great!"], ["Alex W.", "Got a great fast food gyro here. It's five star for quality (on a fast food scale) but they lose a star for being a little too pricey."]], "Greek Cuisine": [["Mike W.", "Rock solid option for a quick, cheap gyro.  There's better places around to get Mediterranean food but Greek Cuisine is tough to beat on consistency & value!"], ["Clayton R.", "This is really a great little gyro shop.  For six bucks, you can't go wrong with their lunch special, gyro and fries.  Although the gyro itself is only moderately seasoned, the sauce it comes with is quite delicious, and you can portion it onto the sandwich yourself.  The fries are below average, so be sure to have some ketchup or salt!I have also been to some of the Mr. Gyro's nearby, but I find that I prefer this place to Mr. Gyro's.  The small time atmosphere as well as the fact that I don't have to wait fifteen minutes for a sandwich is something that I value over the larger chains.And people - if are looking for \"genuine Greek food\" then spend more than $6 at a gyro shop.  You get more than you pay for at Greek Cuisine, but this isn't Athens."], ["Sarah M.", "I don't know how this place got the ratings it did!! This was by far the WORST Greek food I've ever had!! The hummus had way too much Tahini in it, and the Gyro was awful!  If you tasted a Gyro from a place like Jerusalem cafe you would understand how gross the Gyros from Greek Cuisine really are. You couldn't pay me to eat their food again!!"], ["Laurie G.", "Amazing hummus and pita.  The tiropita and spanakopita are so yummy and flaky.  Very good service."], ["Nicole B.", "I was in the area, and figured I would stop in for lunch since I love Greek food!  The place was really small and the service was not very friendly.  My order was up in a matter of seconds so I'm guessing the food is not made to order.I went with the \"Special Plate\" and there was nothing special about it.  It's basically gyro meat thrown on top of a Greek salad.  The meet was dry and overcooked and there was nothing special about the salad either.  The Greek salad at Holy Land Cafe blows it out of the park.  The pita bread that came on the side seemed to be stale.  It wasn't even warmed up.  Next time I'm over this way, I won't be dining here again."], ["L P.", "\"The best Gyro in town!!! You must give this place a try. I rarely leave comments on yelp. But let me tell you... AWESOME!!!\""], ["Amanda S.", "I am updating my review to 4 stars.  I have been back several times for just the gyro.  I am very, very pleased with the gyro.  Perhaps it's the combination of beef and lamb?  I don't know but it's darn yummy.  Again, if  you're craving a good gyro and in the area this is the place."], ["Uomograsso U.", "With not many choices for Greek food out where we live, the DW and I decided to give Greek Cuisine a try.  Not much to look at inside, it is clean and well kept.  I had the Gyro and fries lunch special, DQ had the chicken souvlaki.  We shared an order of humus.  The humus was good, freshly prepared and the accompanying pita was also nice.   My gyro had a mountain of meat on it and the fries were golden brown and delicious.  DW said the chicken souvlaki was also very good as well.  We really enjoyed Greek Cuisine and will be back."], ["C L.", "I couldn't decide between 3 and 4 stars. I decided on 4 because I just can't hate on this mom&pop. I used to eat here at least a few times a month for years, but I changed work locations and that faded. Now I visit every few months. I always order the Special Plate for lunch. For $5.99, you get an enormous salad with a fat heap of gyro meat. You can choose the normal beef/lamb meat or chicken gyro meat. The salad is topped with the usual - kalamata olives, a pepperoncini, cukes, and tomatoes. I usually get it to-go, and it comes with two little sauce cups full of seasoned olive oil, two tzatziki sauces, and pita bread cut in quarters. If I had anything to complain about this HUGE meal, it's that the lettuce is all iceberg and the tomatoes usually taste old. Their hummus is different than other places. It's a bit thicker than I typically like, and it's quite peppery. It's good stuff, but not my favorite. My last visit, I had their spanakopita for the first time in years, and I didn't remember it tasting like that. There was a lot of filling and they were mushier than I'm used to, but I liked them enough that I would order them again. One thing I noticed this time was that their feta has a creamier/moister consistency now. Weird. I liked the old feta better. GC is family-owned and operated. The wife works the register and the husband fixes the food. They're nice folks, and I like supporting them."], ["Kev L.", "The Gyro sandwich really isn't doing anything for me here. the gyro meat was ok, but the pita really let it down.The price at $6 isn't too bad, but with Mr Gyro's popping up all over the place and many other \"Greek\" establishments in near proximity, there's just no need to go here for a so-so sandwich."], ["Mike M.", "I have been a customer at Greek Cuisine for many years now.  Their product is consistently the best gyro you can find in the KC area.  I second the comments about their tzatziki sauce, it really makes the meal. Their salads are excellent as well.  I also like the way they put their gyro together so that it is easy to pick up and eat, unlike the other popular gyro place in town, where I have to figure out how I am going to get  the gyro in my mouth without spilling half of it on the plate or floor. All in all , Greek Cuisine serves up the best gyro in town!"], ["Angela C.", "I lived in KC from '07-09 and this place was a favorite for a quick delicious meal.  We always got it to go because we lived close by, but my husband still raves about how good the gyro's were."], ["Kasey G.", "I want to personally know if all of you were on something when you ate at this place. Wow, if this is authentic Greek food then I guess Taco Bell is authentic Mexican food. Yes, the interior is dated but that is not the reason for the bad review. The hummus was overloaded with black pepper, that is all I could taste. First of all who the heck overloads hummus with black pepper.... really? The falafel was mediocre and the gyro meat was quite dry. The only really positive thing I can say about the experience was the customer service and the time it took to receive my food. People please choose Mr. Gyro's instead or the Habashi House for your Mediterranean needs. I will not be heading back to Greek Cuisine because the food is just as generic as the restaurant's name. :("], ["Jennifer M.", "I'm nowhere near Greek in heritage but ate a lot of Greek food growing up in Omaha, NE.  I know....weird.  I stumbled upon the place someday and decided to try it.  Now, it's the only place in KC I prefer to go for Greek food.You have have have to get the hummus.  It's the best hummus I've ever had.  Creamy, velvety texture and the perfect blend of spice and garlic.  If you like it hotter, they have a pepper sauce that you can either add to it or dip pita in before dipping in the hummus.  And I always recommend ordering extra pita.  The cup of hummus is pretty big and you'll need more pita.The gyros are perfect and taste amazing.  What really makes it, is the tzatziki sauce.  It has great consistency and really makes all the flavors pop.  The salad is good and the fries are yummy, but those are pretty tough to screw up.   Haven't had dessert there before so I will be sure to try that next!Yeah, the place is outdated looking and the ambiance is....well, it's not great.  But the food is really worth overlooking the minor things."], ["Lulu T.", "I had a Chicken Gyro and side of hummus. And yes order the extra pita because there's quite a bit of hummus there. I took mine as carry out. Everything tasted very good. There tzatziki sauce was delicious! And as previous people had noted their hummus is pretty peppery. I liked it but you might just note that heaviver black pepper taste when considering. The dining area was very small, casual but clean. I will definitely be returning for a quick lunch or to grab a to go order. Good food, good price."], ["Jason G.", "I've lunched here on many occassions and this place never disappoints.  Look past the dated interior decor.  You aren't coming here for an upscale dining experience (try Mr. Gyros if that is your cup of tea).  You are coming here for some tasty, no frills Greek at a reasonable price and that's exactly what you are getting damnit.  What I particularly love about this place are the serving sizes.  They aren't stingy with the lamb or chicken portions on their gyros like I find with most other Greek establishments.  Props GC.      Great salads.  Amazing gyros.  Cheap.  'Nuff said."], ["Lindsay S.", "I work right across the street from this place and finally decided to check it out. Why I waited so long considering my deep deep love of falafel I am not sure, but I learned the hard way that A LOT of Greek places don't have falafel and being a vegetarian that is mostly what I am looking for at a Greek place. Any who, all the other reviewers are correct that the interior is screaming for a interior design intervention or at least an update to the 1990's but this is not the type of place you go for the romantic or chic interior. I ordered the falafel pita to go and it was ready in a jiffy. I decided to get some baklava after the Greek lady behind the counter had given me my change and she joked but seemed slightly irritating about having to do the extra math. I got back to the office and opened up my Styrofoam box (sorry Mother Earth) to find the most perfect to go Pita. They had separated all the components in consideration of possibly getting soggy in my travels. There was a section of cut of tomatoes , onions and lettuce and 2 plastic containers of seriously delish tzaziki. My falafel balls were the perfect size and their was hummus already in my pita. It was very very good. Great food for around $6.00. Then to make my lunch even more awesome I got to dig in to my baklava. It was so ridiculously good, like honey and nuts and soft chewy phyllo were having a dance party in my mouth. I am a little embarrassed about the awkward moaning noises that were coming from my cube , but this baklava was seriously mouth watering. Yum yum. Made me want to break a plate and get my falafel on everyday at this place. OPA!"], ["Jody L.", "The food at this place is awesome! It is definitely a take out situation. I have to agree with the other reviews that suggest this place needs an update. Everyone in our group loved what they ordered. The meat used is not the processed strips that you find in most gyros...the real deal. I had the falafel...delish!!!!"], ["Krista N.", "When I am stuck in Overland Park this is the only place that I have been able to find and want to find that has falafel, and it's pretty tasty. The portion size is large and they are very giving with the feta cheese. So far I have only had the spinach spanakopitas, the greek village salad, and the falafel sandwich. All were delightful but my only complaint would be the olives were not pitted in the greek village salad.        The ambience is lacking in this restaurant but the great food makes up for it."], ["Ken L.", "Mediocre food, mediocre decor, mediocre service. Average, ordinary, so-so, etc.They should really fix the inside. The paint is peeling of the tables for christ's sake.I'll probably stick to Mr. Gyros."], ["Marshall H.", "Really below average. Place was kinda dirty and the  food seemed even less interesting than stuff you could find prepackaged in the store. Mr gyros has it over them in spades"], ["Marie S.", "Anytime I'm in the area around lunch time I stop by.  Gyro's are yummy and the sauce is to die for.  Haven't tried anything else."]], "Mr. Gyros Greek Food & Pastry": [["LeAnn A.", "Love this place.  Even if you don't like actual gyros there is something for everyone. My favorite is the good ole fashion gyro. They have a lunch special that includes a sandwich and small salad for 8.95.The chicken is very good as well.  When I come with my niece we always grab and extra side of taziki and pita to share. You don't have to wait to long after putting your order in as well."], ["Jean F.", "I was in the mood for something different and tried Mr. Gyro's based on all of the positive reviews. Unfortunately, they were having a bad day in the kitchen or my expectations were way too high. On the positive side...the dining room was clean, the person who took my order was patient while I decided what to have, and the food portions were generous. Having never been to a Mr. Gyro's, I ordered the combination plate so I could sample several menu items. The only things I would order again, if I ever go back, were the gyro meat and the tzatziki sauce. The horiatiki/greek salad was ok, but it was really nothing more than a few slices of onion, tomato and cucumber with dressing and crumbled feta - maybe there was an olive or two - but I don't recall. The spanakopita was a tired little wedge of filo with about a teaspoon of almost tasteless filling, and the dolma was so soggy I think it had been poached not steamed. The Pastichio looked beautiful, but it too had very little flavor...where was the onion, garlic, oregano and cinnamon? I suppose I will have to look elsewhere for good Greek food in Kansas City."], ["Kay L.", "Good, flavorful food, served up fast & fresh.  Can't go too wrong with that formula.  The menu is pretty limited, but what they do have, they do well.  I like the gyro meat, but thought the spanikopita was a little heavy.  The mousaka is yummy! It's a nice break from the burger-and-fries world, for about the same coin... and I like the fun wall murals :-)Closed Sunday."], ["Nancy F.", "I love this place. I think the 119th st Mr. Gyros is  the best, it  has the freshest food of the 3 locations. Mr. Gyros has better food than Tassos and it's   always clean.  I highly recommend the chicken plate, the steak Gyros and regular Gyros.  The salads are great too. They have the best ice tea in town.  I am not a fan of the hummas,  deserts or lemon chicken soup."], ["Effie N.", "Sunday Sunday Sunday!We went to Smash Burger instead and guess what?  They're open on Sunday's!Best burger in town!Thanks"], ["Race P.", "Had the gyro plate dinner and it was great. And had a good combination of meat, onions, tomatoes, sauce along with flatbread.  The atmosphere was pleasant and I will definitely go back."], ["Kevin T.", "For fast, affordable, fresh and delicious greek food this is the place!  My wife and I both had the chicken pita sandwich that featured fresh made chicken, lettuce, onion, tomato and tzatziki sauce all on a warm pita bread.  Prefect amount of food and we left satisfied and ready to comeback again and try their other offerings."], ["Tanya B.", "I love this place. I come here at least three times a month or so. I usually get the gyro sandwich or the salad- the salad is a huge portion but it is so good i end up eating more than half. Great decor and quiet which is nice. I get tired of eating Chinese food burgers etc. so this is a nice place to go have something different."], ["Shannon S.", "The food was really good here. There was really no wait and plenty of seating. I was in a rush so this made for a quick and healthy lunch. The staff was very friendly and helpful with ordering as well. I will recommend this location."], ["Mark R.", "Wanted authentic an Greek Gyro and found it here. Great fresh pita bread with excellent sauce and delicious meat garnished with perfect ripe tomatoes and sliced white onions. Speedy friendly correct order placement and delivery."], ["Cory S.", "Very Quick and Tasty.  Chicken Pita is a great light lunch option then follow it up with the Baklava.  The Baklava always comes in handy"], ["Adam D.", "My wife and I recently went out for the evening and we're looking for something fresh and not really expensive. We came across Mr. Gyros so we decided to try it out. I've always been a big Greek food fan but she's never tried it before so it was a totally new experience for her. She initially said no to going there because she didn't know if she'd like it.Our food was ready very quickly which was great because we were starving.Everything was delicious. I had the gyro platter and she had the chicken platter. She absolutely loved it. Especially the fact that everything is pretty fresh and there are lots of veggies and not all pasta and rice like most places. The atmosphere is quiet and unobtrusive which is really pleasant because you can actually have a conversation. The only think I would change is that we needed bigger plates for our food! Also, it they had something more like Panera with heavy reusable plastic plates would be more appetizing than the black styrofoam plates. We will be coming back soon!"], ["Lisa B.", "We love Mr Gyro's! I've been twice recently once to introduce my mom to new cuisine, and the second time because my son wanted to try it. The service is fast and the food tastes fresh and delicious! I love their lemon chicken soup and my mother and 12 year old son both went crazy for the gyro melt. I prefer to get the original gyro but gotta get that feta though. They have a wide variety of delicious looking desserts but I haven't tried any because I'm always too full. I can't wait to go back and try the grape leaves and some of the other traditional Greek dishes they serve."], ["Teague P.", "I really like Mr. Gyros, and I also love the name in conjunction with the fancy greek historical decor.  It's not a fancy place, don't get me wrong, but somehow the cheesy name is out of sync with the huge murals of ancient pottery paintings of ancient greeks, and simple huge blue pottery urns.  Also, they are always closed on Sunday, which I suppose is Orthodox? Anyway, on to the food.  It's good, simple and fast.  I've eaten at the Overland Park location many times and this one is exactly the same.  Very tasty fresh pita for the sandwiches, very meaty and ample gyros, I like the souvlaki, and the moussaka is luscious. I particularly come here for the greek salad, I love the dressing, an oregano-y vinagrette, and it's always perfectly fresh, ice cold and crispy. Plenty of finely crumbled feta on it, and lots of nice garnishes - olives cucumber etc.  Sometimes i even get dessert, and i don't usually do that.  But the nice nutty, syrup-drenched pastries in the case where you order are pretty tempting and they're all delicious."], ["Elizabeth N.", "I had the chicken pita on my visit and found the pita to be very soft and overall delectable. The tzatziki sauce is really good because it has cucumber chunks. Everything is very reasonably priced."], ["GMari E.", "Love this place! I usually frequent this one, but I have been to one other one too and it was pretty consistent. Standard Greek food and quick too! I generally get the chicken souvlaki dinner, but lately I've been getting the chicken gyro meat. Both are very tasty! They have a great tasting Tzatziki sauce and both my lover and I love the rice! I'm not a big fan of the salad dressing that comes on the Greek salad, but they do give you a huge chunk of feta, which makes up for the crappy dressing! This is my go-to place for fast Greek food! I highly recommend."], ["Mark G.", "Great gyro lunch special.  Portion was huge.  Price wasn't bad either.  Would definitely return."], ["Marina M.", "I really am surprised to see so many positive reviews for Mr. Gyro. My husband & I ordered carryout & were thoroughly disappointed. The salads had super skimpy portions of meat, even though I asked specifically about whether or not they had a decent amount of meat. The spanikopita was basically just gross. The hummus tasted very much like the prepackaged stuff I can buy at the grocery store. And, even the baklava was pretty ick. If that's not bad enough, we both think we got food poisoning... including my husband actually up throwing up overnight. We'll never be back. Gross fast food Greek at best."], ["Stephanie E.", "Omg Best Greek food hands down!! Their Gyro Or their Gyro Salad is to die for! Plus their hummus is delicious! Must Eat Here!!"], ["Kristen L.", "This is a great little restaurant. My husband usually hit it up at least once a month for dinner. It's fresh, tasty food that's reasonably priced. This restaurant has inspired us to try new things and more Greek food in general.My husband loves the Gyro Plate and I always get the chicken plate. The meat is extremely tender and flavorful on both plates. We also love the hummus and pita bread. My only complaint is that the plate is a little small and I wish they'd cut up the veggies in the salad. But I'm glad the veggies are fresh and the quantities fill the plate.We always leave with full, content tummies. If you really want to top of your visit, get dessert. They are so delicious. We've tried several different ones. We just love the honey, nuts and flaky pastry dough.I will say that service isn't always friendly, sometime I feel like they could use a hug or a smile. But maybe just standing there taking orders all night gets old. They've never been mean or rude, I just think they could smile a bit more.If you've never been, you've got to stop in and give it a try. I bet you'll be back, I know I will."]], "Olive Cafe": [], "Sahara": [], "Habashi House": [], "Marble Top Cafe": [["Beppy H.", "This place is the hidden jewel of the Ward Parkway neighborhood.  I moved here four years ago and have been looking for a place with good falafel ever since.  I was unsuccessful until a few months ago when I was at a doctor's appointment in the area and was hungry and didn't want Culver's.  Their falafel pita is SUPERB.  The tzatziki sauce is spot on, and the hummus is great too.  This is a good place for vegetarians, but I'm guessing the meat is good too.  And the service is wonderful.  All smiles, checking to make sure everything is how you want it, just very friendly people overall.  And when the weather is nice it's great to sit at their outside tables."], ["alison b.", "I have wanted to try Marble Top Cafe for a few months & am sorry that I waited so long.  I made an order to go, the Special that was featured on their Facebook Page & my husband ordered the Gyro with salad & rice.  My Sheesh Kabob, rice, salad & hummus was all phenomenal!  Richard's Gyro was very good!  What I loved though, was the attention to detail.  There was a lovely Dolma & pickle in my salad.  The rice was peppered with sweet raisins & almonds, the favors were amazing!  The very nice man at the counter asked if I wanted to try the Baklava, he said it was the best in Kansas City & with that recommendation, how could I not try it?  He was right!  I am so happy that this restaurant is in my neighborhood and will be going back!"], ["Kat N.", "I do enjoy a meal at Marble Top once in a while.  The ingredients are fresh, the hummus is top-notch and I've never had less-than-friendly service.  Having said that, there are a few things about the establishment that keep it from being a regular go-to in my book.  First off, some of the ingredients used are unusual.  And by \"some of the ingredients\" I am referring specifically to the feta cheese.  It's way creamier that what I'm used to for feta and always throws me for a loop when I order a Greek salad here.  The gyro chicken and beef meats are decent, but not memorable.  And for an order-at-the-counter, food-brought-to-table, clean-but-basic-diner joint such as this, I feel the prices on the menu items are $1-$2 too high to justify more than 3 stars.  Just saying.  The staff does seem to appreciate customers' business which is nice.  And the fries are outstanding--we always order a side of them with whatever."], ["Kirun M.", "So, I made it Marble Top with my coworkers, as promised.  I wasn't blown away by the food.  I got the chicken schwarma and two sides of salad.  The idea was to make a chicken schwarma salad.  The salad was large.  The meat alone looked very unappetizing.  It was okay, at best.  I don't think I'd get the chicken schwarma again, even though I ate it all.  I didn't see any signs of the traditional condiments you expect with Mediterranean food.  No hot sauce, tzatziki or tahini, which made for a very average meal."], ["Jason R.", "What a sleeping gem!  This place is great.  Everything tastes fresh and at what a price point.  Gyro plate is great and don't miss out on the secret seasoning shakers of yum on the table.  Someone in your group needs to get the french fries they are worth the calories."], ["Tiffany m.", "the food was good and the atmosphere was warm and inviting. i'm glad to see an authentic restaurant come to the neighborhood though and i hope it does well. however, for the price, i think i'll stick to my usual place for gyros on 75th st."], ["Fred L.", "Wow!! This place is Awesome, was there for my second visit last night.  The Gyros we had the first time were amazing, taste like the best gyros from the East Coast!!  Another standout is the Baklava, best I have ever had. Tonight I tried the coffee, iced latte was amazing.  I got the Gyro again and it was again top notch. We also decided to try the Special which was Kebabs. These Kebabs were outstanding, best I have ever eaten. The spices they use are incredible.  These Kebabs are something really outstanding, you would get in a 5 star restaurant in New York, they were just unbelievable. The Lemonade was also very good.This place is outstanding, and I encourage everyone to try it. Have told a lot of people about it."], ["Jennifer H.", "I loved the vegetarian platter!  My new favorite hummus, delicious falafel, dolmas,  and eggplant. Even the pickles were wonderfully tangy, crisp, and delightful. The fresh made lemonade hit the spot too!  Service was friendly and fast. The place is spotless and the decor is warm and inviting!  I love this place!"], ["Magan G.", "I am a new and satisfied customer of this little place. I always order the same things. I have a gyro without yogurt sauce. The gyro meat is tender and juicy. It comes on billowy pita bread with tomato and onion. It is perfectly acceptable and the only thing I might change is I've become quite attached to the slice of melted swiss that another place, over in Westport, adds to their gyros. While it is not a typical addition to gyros, I love it and wish this place would offer the option. Next, I order falafel. The first time they were hot and crispy on the outside and savory and perfect on the inside. The last time I went they were cold and since I was the first customer of the day, there really isn't an excuse for them not being served hot. I always order hummus and pita bread so I can continue my feast over the span of several hours. I prefer their hummus over any other at this point and am so happy it is sold in stores. I eat it at least once a week now. I should see if they add hot sauce, because again, I have become accustomed to a dab on top of my hummus. Now to their tabbouleh, which is the best I've had ever. It is tart with lemon juice and always fresh and perfect. I eat it for a couple of days after I go here. The only thing that I have ever ordered at this place and not liked was their pistachio baklava and to be completely fair, the lady who took my order did try to divert me away from the pistachio one and into purchasing the regualr version. I think she knew that I would be disappointed with the pistachio one, but I'm a little hard headed and thought I knew best. I will buckle to her persuasion and try the regular version next time I'm in there. If you love mediterranean food, give this place a go, you won't be disappointed!"], ["Rebecca S.", "No wonder this place was crowded at lunchtime! I'm trying out a vegan diet, so I figured a Mediterranean restaurant would be a good bet.  I was right: I had the \"Vegetarian Plate,\" which came with baba ganoush, hummus, dolmas, felafel and tabbouli, and everything was fantastic.  They were kind enough to walk through the ingredients with me to make sure I could eat everything.  Also, tasty lemonades: I've tried the Pomegranate Limeade and it was like a summery cocktail.  It's great to see such a good place for Middle Eastern fare in South KC."]], "Couscous Gyro Kebab": [["Wallace B.", "This nice little place has had a major overhaul from the experiences of other diners. I have been 5 times in the past month, each time bringing friends or family, and everyone has enjoyed. The prices are reasonable and the food is flavorful. I have yet to have a bad experience with the food or the staff. So before judging too harshly based on the previous reviews please give them a try. My only somewhat negative statement is that the pita is not fresh but prepackaged. The chicken and Kafta beef kabobs are my absolute favorite."], ["Danny B.", "Small strip mall location.  When we went all the chairs were full and that was on  a Sunday afternoon.  Find a table when you go in and order a gyro sandwich.  Hummus is good, homemade, kabobs are good too.  They have a buffet, but I didn't indulge.  Worth your time when your up North - we will be back!"], ["Carol S.", "Very disappointing. First we checked out the buffet & that sure didn't look very appealing. So we ordered the gyro sandwiches & they weren't like any we've ever had before. The meat was dry and slapped in the pita wrap with just a tad of cucumber sauce in it - & nothing extra on the side. Then we ordered a piece of baklava for dessert & that was a real joke. We got a 2 inch piece that they charged $5 for. Wow. Plus the decor of the inside of this place kind of sucks. No ambience. In a low rent shopping center.  I'd say never ever again. Now I understand all the other negative reviews. I sure hope the owner reads this."], ["H P.", "Food was terrible. Service was awful. Had to hunt someone down to get our order taken and then again to pay our bill. Barely ate half my dinner. Would not go back."], ["William E.", "So I am writing this under my husbands login, I state this because he quite enjoys the buffet here, I however deciding to give the place a second chance opted for a gyros sandwich combo.... should have learnt my lesson the last time I got a small amount of meat with my generous portion of salad on a pita.... now this could have been an oversight except my husband saw them weighing the portion out. I hate paying for a meal knowing I am going to have to grab a bite elsewhere. Oh well, lesson learned."], ["Dan D.", "Went at the urging of a friend but wasn't very good.  Owner was courteous and gave me a tour of the buffet but $8.99 when the only meat for lunch was baked chicken thighs and tilapia didn't sound like a good deal.  Instead I had a gyro and salad but the salad was a plate overflowing with fresh iceberg lettuce, 2 tiny chunks of feta and 1 black olive.  The gyro came out and it was good meat on a warmed flatbread with standard tzatziki sauce with a side serving of hot sauce.  While tasty, there wasn't enough meat in the gyro.  Then when I paid in case I was given incorrect change, $2 less than was correct.  Unfortunately I won't be going back.  The place was clean, the owner is nice enough and the decorations are pretty but I need food and my correct change."], ["Travis S.", "Had the buffet, at first glance looked very unappetizing.  Tasting the food confirmed the first impression.  Im not sure how this place has any great reviews maybe made to order food is much better but buffet was not good at all."], ["Brandon P.", "When I saw a 1 star review on Google, I thought to myself, SURELY THIS IS HYPERBOLE! No restaurant experience could truly be 1 star worthy! Perhaps my fellow Gladstonians don't have the refined pallet I do! Turns out I'm wrong, and 1 star is being generous. Let's start with what they got right... Now that that's out of the way, let's focus on the overwhelmingly negative experience. First, the restaurant itself was extremely hot, I've worked in restaurants before, sometimes things happen, but it was significantly hotter inside than it was outside, that's a problem. Second, the prices. At first the prices look fair, $7 for a gyro plate? Shut up and take my money! But come on, $5 for baklava? Baklava that made no effort to hide that it probably came from Sam's? No thanks. Did I mention how hot the restaurant was? Because that didn't go away. Third, my \"server\" decided that talking about living in a frat house, and chit chatting with her coworker was more important than acknowledging or validating my existence. Okay, fair! I'm just some jerk who wants to eat food. Speaking of food that brings me to my fourth point, the portions are tiny! Look at the website, enjoy the juicy tender pieces of meat, by the way enjoy it from afar, because as I was informed upon returning my food (we will get there) \"Oh, that's not actually our food, that's just gyros from the internet.\" Seriously, when I think of gyros I think of lamb/beef/chicken piling out of a delicious pita. What I got were three small strips (not even the length of the pita) of meat that resembled beef jerky (it had clearly been overcooked) on a lukewarm pita. I got my order to go, and in my haste (to feed a family) made the mistake of assuming the things I ordered and paid for were in the bag! NOPE! She forgot my fries (funny story, my server told me she accidentally gave my fries to another customer, but assured me they were in the bag). I called the restaurant and was informed that they hadn't forgotten my fries, I had indeed left them there (which makes sense because clearly I bagged my own food). ALSO! We ordered hummus to go, hummus that they decided to put in a standard to go box which leaked all over everything, YUM! Bag o' hummus!Seriously, I can't explain how terrible the experience was. To summarize, the food is over priced, the service is terrible, the portions are tiny, and the place is way too hot. Don't eat here. Don't take people you dislike here. Don't drive past here if you can help it. THIS PLACE IS TERRIBLE! If you want gyros a more fulfilling and less infuriating way to obtain them, is to study Greek for a few years, move there, and get it that way, at least this way when you pay $7 for a gyro combo, you're doing it with devalued Greek currency!Seriously, go somewhere else to eat."], ["Jon B.", "I don't know what people expect for an $8 to $10 lunch, but this place is great. Super service, super food, and super nice people. The decor is not what most of us are used to, but is OK. If you want posh decor go to the Plaza, if you want normal go to McDonalds, if you want a nice dining experience go here. I forgot to mention they have an olive and hummus, and salad bar."], ["Colby C.", "It is a hole in the wall but it's quiet, the kabab is tender, service is good"], ["Jacob L.", "I think the reviews are a bit dated/ not so relevant anymore. Tonight  was really good. Very attentive staff and great food. The hummus is obviously homemade, the gyro had huge chunks of lamb. On the down side it was warm inside.  Would definitely go for lunch or consider for carry out."], ["R B.", "Do not go to this restaurant. Overpriced buffet ($12.99) and the food in the warming trays was not hot. The Baklava was made with corn syrup instead of honey (I've been making Baklava for years). This is a big no-no!"], ["Jennifer W.", "went here on valentines day for dinner to try something new. horrible horrible service, tiny restaurant, waitress talked all about her new tattoo and how much it hurt, one dish came out 20 min before our other meal arrived. Good thing we were sharing.  People were getting up and leaving before there food even came.  One waitress Asked a customer if she could get anything, the customer said she would like to order.  Then the waitress told her that she couldn't take her order because she was getting ready to get off work!! What the heck!! To top that, she never left.  Bad experience. Will never recommend nor will I ever go back....even if I'm starving."], ["Adrie O.", "I had a beef gyro and it was good, not awesome. And it is overpriced."], ["Jenny R.", "My husband, son and I used a Groupon and got the Sunday evening buffet last night.  The food was great and the service was excellent.  Our drinks were watched and refilled diligently but no one hovered over us.  I didn't love every single dish they had on their buffet but there was a good variety.  I filled up well before I was able to try everything and there were several dishes I plan to have again next time we go.  It'll have to be when it's cold because I want to try their complimentary mint tea.  It is a small \"hole in the wall\" type place (nothing fancy) and the ambiance is casual.  I thought I should post our experience here because of the really negative reviews.  We had a great experience there and wouldn't hesitate to go back."]], "Aladdin Cafe": [["Jeremy B.", "I had the gyro platter, lentil soup and a Turkish coffee, all of which were delicious!  A special note for the Turkish coffee, I believe it's the best I've ever had.Service was prompt and friendly. Everything was clean including the bathroom.Average plate is about $10, appetizer $5.Would definitely recommend."], ["Steffon C.", "Why are there so many great places to eat on 39th street? Well, Aladdin's Cafe is another on the list. We started with hummus (yum!) Greek salads (yummier) and then a traditional gyro and a chicken souvlaki gyro, wow! Our wonderful host then gave us a complimentary cup of ginger cinnamon tea. Perfect on a chilly day. We'll be back soon!"], ["Karen C.", "My friends and I were looking for a Mediterranean place to eat lunch and we found this place.  We were not disappointed.  The place was a bit cold but otherwise we had a good time.  The food was delicious.I started with their cinnamon ginger hot tea.  It was really tasty with fresh ginger in it.  I had the chicken kabob plate.  I started with the Greek salad.  It had a nice herby vinaigrette on it.  The kabob was nicely cooked, juicy.  Rice was flavorful too.  My friends had various other items and they liked their meals too.  Good salad and lentil soup.  The kids had chicken and fries.  They seemed to like their meals too.The place is a small whole in the wall with great food.  Next time I am in Kansas City, I will definitely be back.  And my friends who live local will definitely be back."], ["Brenda M.", "They have the best hummus in KC! It has an explosion of flavor, and it can be very spicy depending on how much of the green garnish you use in each bite. Their pita is also very fresh and delicious. The tzatziki sauce was very watery which I don't like. The gyro meat is good, a little greasy for my taste but very flavorful. The rose lemonade was good. The service was good, not overly friendly but not rude either. Food came out relatively fast for how full they were."], ["Joe C.", "I'm not sure what's wrong with me sometimes. I used to \"not like this type of food\" but that was before I really gave it a fair shake. I love the food here! My favorites include the lentil soup, the genie dip and the gyro platter. I've always had good service here and the quality of the food is consistently good."], ["Barbara S.", "This place has my favorite gyro. For those of you who know me, I consider myself a long time Mediterranean food connoisseur. I generally order the traditional lamb gyro and this place uses chunks or super tasty, super juicy lamb instead of those strips you just know come in frozen at other places. The gyro was also HUGE. And for my $8, I got the gyro plus a side of rice and also my choice of soup or salad. The dressing is a bit citrus-y and not your typical \"Greek\" dressing. It's good though. I come here to sit outside, I admit. Not a huge fan of hanging around inside this place. It's quite small. But they do have carry-out which I've used several times. I admit, I haven't branched out a bunch here because I love their gyro so very, very much. I'll get on that right away!"], ["Robert B.", "We were seated and that was about it... took about 20 minutes for us to even see the hostess again, and then another 10 just to get waters/a drink order.. maybe an off day, but it was pretty bad considering there were only 2 more people dining in the restaurant and they were together, 1 booth from us! We were also charged double on our checks when we were supposed to have it split.. the manager got it figured out but it was not a very good experience! (Food was alright, but the service made it taste worse)"], ["Yembur A.", "Amazing food and amazing lentil soup just like everyone says! There's no arguing that. But the food is so good that the restaurant tends to skimp on service. The employees are rarely very friendly, and I always have to spend forever trying to get their attention if I need something. But i have to say, it hasn't kept me from coming back - the quality of the food really outweighs the poor service!My parents love coming here when they visit KC because of the lentil soup and halal meat, and my friends that don't eat meat love coming here too because of all the vegetarian options."], ["Gary J.", "Not much parking, but overall very good. the lentil soup was fire and the Krass Pastry was great order the Aladdin Gyro Platter and it was delish!"], ["Keelee S.", "Lentil soup is liquid gold deliciousness. Baba ganoush...i could eat my body weight...everything here is amazing. Dont forget to try a lovely turkish coffee"], ["Parker D.", "This place is great. I'm not much of a Westport guy, but I will make the exception for Aladdin Cafe. The Salads are top notch, and the Eggplant dishes are INSANE! +1 For Aladdin."], ["Laura F.", "Came here with my sister, looking for something relatively inexpensive in the Volker area. This place fit the bill and had great reviews!We were seated immediately on a Thursday night around 7:30. Our waitress was nice and attentive. I ordered the shawarmah platter with beef and greek salad and my sister got the salmon kabob with lentil soup. We also got hummus as an appetizer.The hummus was delicious and was spiced nicely - I never had hummus like it before. My greek salad was very fresh and yummy. The lentil soup was good, but not amazing, as you'd think from all the praise it's gotten (as indicated by some articles posted on the wall). My shawarmah platter was good - the one I had in City Market at Habashi House was better, but this one was very yummy, too. My sister commented that her salmon was a little bland, which I agreed. It was however, cooked perfectly. My only criticism would be to make the spices a little stronger and it would add a lot to the flavor.So in summary, not the best Mediterranean I've ever had, but delicious nonetheless. I would definitely recommend eating here and I will be back in the future."], ["Adam S.", "Aladdin Cafe has become old reliable for me. It's an excellent place to grab take out from and the food is healthier than a lot of alternatives. My staple here has been the Gyro Sandwich w/ Hummus because it's got large pieces of tender lamb/beef and is much different than the salty, shaved variety I've seen in the past. It also comes with a soup or salad and some rice that rarely gets eaten because I'm too full.The entrees are a few bucks more than the sandwiches but are delicious, specifically the grilled chicken, couscous and vegetables.Notice how I mentioned take out right from the get go? That's not an accident! The atmosphere here is odd. Inside shows an older interior with a lot of wear and tear, and a cramped space to boot.The patio on the outside gives a nice view of the people and traffic going down 39th Street West, but lately every time I've been there, all I hear is some pretty intense middle-eastern music blasting through an alarm clock quality speaker system right above my head. All the little quirks combine with their excellent food and make Aladdin a gem in KC."], ["Beth W.", "My fiance is from the Middle East and I am an avid fan of Middle Eastern food, so much so, that I used to work at a Mediterranean restaurant just so I could learn how to make the dishes. That being said, Aladdin Cafe is pretty exceptional in our book, especially out of the options in KC. I would suggest trying the rosewater lemonade, hummus and lentil soup, all of which are very traditional menu items in the Middle East. The restaurant is draped in scarves from floor to ceiling, it's a nice touch and a creative way to showcase the culture. I really enjoyed the outdoor patio. Parking is an issue, the parking lot is very small and awkward, plus it is usually full which is a good sign. I believe they have open up a second ToGo location, which should help."], ["Maggie C.", "It took a good ten minutes of standing at the front, respecting their \"please wait to be seated\" sign before anyone acknowledged me. \"Have you been helped yet?\" No. That was the worst of the entire night. Service was splendid the rest of the evening. I was ecstatic to try middle eastern food, I had never had it before, for the exception of gyros from a food truck. We ordered the hummus with extra pita, I had the gyro platter with a salad. I'm usually not a fan of hummus, but my god, this was hands down the best hummus I have ever had in my life. They had super warm pita, and that made it even better. I am not sure if they make their hummus themselves, or if it comes from somewhere else, but it is the perfect consistency, with the perfect amount of spices. The salad was refreshing, and so so delicious. Id be happy to purchase just the green dressing so that I could make my own at home. All of the veggies and lettuce was crisp and very fresh. My gyro platter was also amazing! Meat was grilled perfectly, with just a little bit of black, grill marks, and tasted so fresh. The basmati rice was perfectly soft and the the yogurt on the side--phew, that yummy yogurt on the side! I about dumped the whole thing on my dish, I enjoyed it so much.."], ["Sya N.", "No lentil soup is comparable to Aladdins. Their Gyros are wonderful with grilled vegetables. The green sauce is not so spicy but it does add some kick to your gyros minus the extra dollar charge. Give this place a try and you won't regret it.  I had better gyros before but it takes 18 hours to get one."], ["Katie W.", "Kabobs. Hummus. Lentil soup. Sit outside for great people watching. Bring your own bottle of wine. Nice spot to just relax for a bit. Definitely try the rose water lemonade!"], ["Ziad E.", "The closest to authentic Mediterranean. Good service, great food and excellent quality ingredients, plus a nice place to hangout with friends."], ["Carole M.", "The lentil soup was AMAZING. My lamb gyro was equally delish...but the gnats were more than I cared to deal with."], ["Megan B.", "Stopped in for a bite to eat before visiting my friend at KU Med. Sloooow service. While we ate, numerous gnats and flies floated around our table. We were told about $10.99 special, which we both ordered. An unitemized receipt was set on our table totaling $28.00. I waited at the server's station to discuss the total with the waitress or owner. No one ever came. So just said, \"it's not worth it\" and signed the receipt without a tip (something I've NEVER done). We ended up being LATE to see my friend, which was very disappointing.And I checked my bank account today - Guess what? The waitress WROTE IN a $5.80 tip for herself. Unbelievable. Stay away!"], ["Sarah H.", "Good Mediterranean food. Meal was rather filling and great priced. The lamb was a bit on the dry side and I had to put tiziki in my hummus gyro to make it easier to eat. The meal consisted of a choice of soup or salad (be forewarned salad olives contain pits), and a gyro with saffron rice on the side. The highlight of this place for me was the Rosewater saffron lemonade.  It had an different taste at first (a bit of a spicy kick), but as you got closer to the bottom it became rather sweet. It was an interesting tangy tart with a kick of spice drink."], ["Jess I.", "I ordered lunch from Aladdin Cafe for the first time today. The food was mediocre. The customer service was terrible. Needless to say, I won't be back and I don't recommend."], ["Terry C.", "The BEST hummus in town. I always order it with an extra side of pita, in efforts to extend the life of the spread further. The pita is delicious, served warm, but really it just serves as a vehicle for the delectable hummus.To be fair, it's been a couple years since I've actually sat down and eaten at Aladdin's. I live in Volker, so I usually order the food and carry out. However, the service is always friendly when I order and quick when we go to pick it up. I also have to say that, as far as patios go on 39th street, this has to be one of the best. It doesn't directly face 39th, but rather Wyoming, so you're not dealing with as many cars and pedestrians."], ["Trish M.", "Oh, man.  How had I never been here before??  At the suggestion of a friend on a bike-riding adventure through the city a few days ago, we ended up stopping in the 39th Street \"district\" and randomly choosing Aladdin Cafe for an early dinner/refeul before biking back home to South Hyde Park and Union Hill, respectively.  So like most of the food joints in that area, Aladdin is locally-owned and nestled in a hole-in-the-wall type of restaurant.  You aren't going to find romantic lighting, fancy light fixtures, and marble-tlled floors like you would in a Plaza restaurant, which is what I LOVE about our local joints.  The buidings are old, they carry a history with them that sparks my curiosity, and I so enjoy putting money back into the pockets of locals, whose restaurants and shops are their livlihood, their kids' college funds, and their overall external source of happiness in life.  On to the food...Just as many previous rave reviews have pointed out, the lentil soup is AHH-MAZING.  Just perfectly spiced and not overly filling, leaving plenty of tummy room for the main course.  I opted for the roasted-cauliflower-and-falafel pita sandwich, accompanied by a small portion of basmati rice, covered in some kind chili sauce I presume.  (Our server DID tell us what all of our sauces were, but I was salivating too much to hear what she said.)  Okay, falafel is falafel, some might say.  But I take my falafel VERY seriously.  I always pay attention to the various spices and amounts, the texture(s), the moisture level, etc.  This falafel was just perfect in every way.  Not at all dry, the spice level, again, was just perfect.  Not overly spicy, but not at all bland or lacking in flavor.  The pita was so warm and soft and pliable. And as much as I am obsessed with roasted cauli, I've never thought to pair it with my falafel!  The \"sandwich\" had just the right amount of lettuce and onion \"fillers\", and the creamy sauce wasn't drowning the food and added just the right amount of \"tang\".  (I typically do not like overly tangy yogurt or tahini sauces, but this one was done right!)My friend got a dish that she's had before and loves.  Our server was friendly, came and cleaned up plates when we were finished, offered refills on drinks when they were close to being empty, and just allowed us to sit and enjoy our meals and conversation with having to \"wait\" on us too much.  This is how I truly love a meal.  Fine dining is okay, but I really just love a good relaxed atmosphere with good, affordable food.  Expect to pay at around $10-$15 on average for dinner, unless you get a pita like I did (then it's a few dollars less).  If you get any other appetizers, a meal could be around $20.  But this is easily an affordable lunch spot or dare I even say a great date place!I WILL be back.  I can't guarantee I'll bring myself to eat anything else, although I'm curious about the hummus.  I can't speak for any of the meat dishes, but vegetarians can rejoice at the meatless options (as are easily typical of Greek/Middle-Eastern cuisine)."], ["Misha U.", "Lentil soup, vegetarian combination plate, falafel sandwich, rose lemonade- all housed in a casually cool environment- it's hard to go wrong here."], ["Leah B.", "This was my first time here and it was awesome. Food was great and service was great.  There was four of us and we all got something different and all was great. Loved the lamb."], ["Lisa P.", "LOVE! great food.  One complaint is they don't serve alcohol BUT you can bring it on for a reasonable fee."], ["Divya R.", "Awesome awesome food...I rarely write reviews but this place is worth all the appreciation ... Oh ya!!! Try the lentil soup..."], ["Alex T.", "Aladdin's serves up some darn good Mediterranean food, to be sure. I eat here often when on call, and they never disappoint. The basics like pita, gyros, hummus, and lentil soup are all done right. I haven't had anything at Aladdin that wasn't quite good. Some of the fancier-sounding dishes are certainly worth a try, but for my money, the shawarma platter is tough to beat. Speaking of money, you'll drop a few more pennies here than at other Mediterranean joints around town. You get what you pay for, after all! Check out Aladdin, if you haven't already. It's definitely one of the better Mediterranean joints in KC."], ["Shanley C.", "Aladdin Cafe has created an impressive track record in the Kansas City community. Since opening in 2006 they've received numerous reviews from the Kansas City Star, Pitch magazine and some Best of Kansas City awards. That being said, it should come as no surprise that the food is darn good.Walking in, the first thing that hit me was the aroma of freshly made baklava. Automatically this place had my heart. And the lentil soup just sealed the deal. I'm a lentil soup lover, but this is like nothing I've ever tasted before. Ingredients include red lentils, carrots and corn, seasoned with saffron curry, cumin and lemon. The flavors are so bold and there's a kick of spice at the end of each bite. This soup is a must- have item when you go.Another item you must try is the Falafel and Baba Ghanouj on pita bread. It is incredible. Such great flavors of roasted eggplant, falafel and tahini sauce. The Shish Taouk is also equally amazing.  And the neon yellow chicken is pretty fun to look at. At Aladdin Cafe, it doesn't take a genie to make your wishes come true, you can expect delicious food at a great price. Case in point: my lunch, lentil soup included, was only $6.99."], ["Alice H.", "I have gone to the Lawrence location so this was my first time at the 39th one. Definitely coming back! The hummus and lentil soup were on point. Prices were reasonable... You can get a gyro only which is a good size or opt for the gyro with entree to come with salad or soup. A lot of food and it's great quality and soooo delish. Will have to try the curry options when I come back."], ["D T.", "Food is awesome ... anything you order comes out amazing .super friendly staff and service is great . The place is small and a little ran down they could remodel . Other than that I'd go back again ."], ["Alexis B.", "Salad makes your mouth work in wonderful ways. & pretty Chillax atmosphere.Xoxo#10yearAnniversary"], ["Meredith B.", "The lentil soup is delicious. The food is prepared fast, and I am satisfied and full after every meal. The are many vegetarian options, and Since I live near to 39th, its one of my favorite places to go for a last minute dinner. The only con is that there is limited parking, and I don't like having to go down a block to park. If they expanded the parking, then I would be there on a regular basis...the parking situation is the only thing that I don't like about the place."], ["Faith B.", "Have some tasty rose lemonade at this tiny little joint in the 39th Street area. A sweet treat on a sunny day. You can sit outside in what I'm guessing used to be a parking lot and people watch while eating delicious Middle Eastern food. Tasty hummus is light and creamy. The baba ganoush is rich and smoky. I had the veggie combo tray which was delicious and filling, but primarily composed of dips with two falafel and two grape leaves. My companions' meat dishes looked good and they enjoyed them.Can't wait to try it again."], ["Meghan M.", "Their pitas are not traditional. They are thicker, fluffier, and do not have the split in the center. HOWEVER, they are sooo good. You can buy 10 to go for $4. I prefer them over their southward competition, and their now my new go-to for pitas.  The food is very good here. You can't really go wrong. Each dish comes with sides, like a salad and delicious rice. I refuse to call the salad a \"Greek salad.\" After spending months in Greece, I learned 2 things, 1) a Greek salad has cucumbers, tomatoes, feta, olives, onions, olive oil, and some spices...but absolutely NO LETTUCE, and 2) No \"Greek salad\" is made this way in the U.S. This American misnomer is a pet peeve of mine, but at least Aladdin's version has a deliciously tangy lemon-herb dressing that cools my mild irritation. Their baba ghanoush is wonderful, and I love that they have kifta. Their dill chicken is a delightful variant if you're not in the mood for the standard Middle Eastern fare. Their hummus is a bit too creamy and rich for me...I like mine with more chickpeas, less tahini. Their patio is aesthetically less than appealing, but the 39th street people watching and Aladdin's tendency towards good looking servers can make up for it. All in all, it's good stuff."], ["Alice L.", "If you like Middle Eastern food, go here. This is the most underrated restaurant I've ever eaten at. Everything is fresh and delicious--gyros are great, but the lamb is superb, and half the price of what you might get at a fancier place."], ["Stephanie G.", "Been going here for years. Ingredients are fresh and restaurant is clean. Topped off with friendly service. Best lentil soup you'll ever have!"], ["Chad H.", "Received the WORST service possible I'm assuming because we asked for different seats when being seated or she just generally hated us and wanted to chase away business.  The entire dining experience was awkward and uncomfortable and not the least bit pleasant.  Going out to eat is a treat and I've been more catered to at Taco Bell.  She threw our drinks at us, slopped the soup at us and brought our entrees and never came back - except to throw our bill on the table with not so much as a thank you.  We finally were able to flag down our normal server (who is always wonderful to us) and ask for the soup we wanted to go.  We love their food and are basically addicted to their soup but after this experience we will not be in a hurry to come back, if we ever decide to."], ["Fulton W.", "Great food on the top end of value though great place to eat, they never give you enough pita just ask for more if you need it they have always given it when asked best lentil soup in town"], ["S B.", "Very good food. I especially like the fact that they don't make a big deal about the decor - the food does the talking. We had the gyro sandwich, shawarma, coffee and the kanufa. All very good. Highly recommend for eat in or take out!"], ["Elaine D.", "I'm a true believer in the lentil soup!!!  It's thick and very flavorful (I love black pepper in a lentil soup).Cozy and friendly.  I'll be back."], ["Kelly G.", "My favorite Mediterranean restaurant ever. The shrimp is big, juicy, and flavorful. Greek salad has a zesty homemade dressing. The tea is piping hot and savory. Yummy! Can't come here enough! It's charming, but not too fancy."], ["Rebecca R.", "Best parts:-Lentil soup. Super creamy and warm! Mmm. The salad was also tasty, very zesty! You get to pick one of the two with your entree, I would recommend going with the soup.-Vegetarian options. There are tons. I got a gyro with roasted eggplant, cauliflower, and hummus. It was divine! The roasted eggplant was delicious and super tender.-The gyros! My friends ordered the chicken, which was moist and flavorful! The only thing I disliked was the tzatziki, which was runny and not very exciting Otherwise, everything else was good and we had a nice experience."], ["Kendall P.", "Great gyros and salad. Outdoor seating and very friendly staff. It's also next to a great record store."], ["Haley J.", "The food is amazing, best Mediterranean in town. The customer service is terrible, worst in town - I guess I met in the middle for the rating..."], ["William R.", "I've lived in this neighborhood (just North of 39th Street) for a decade, but for some reason Aladdin was not in our rotation of weekday dinner restaurants. Our loss.Last winter we got a new kitchen, and ate out a lot accordingly. We got kind of bored with the rotation, and tried Aladdin. What a revelation.The food is very tasty, and affordable. I'd say more like 1.5 $ on the Yelp scale, but well under $20pp, with appetizers. There is no alcohol, but you can bring in wine or beer and Mr. Z's across the street has a small selection, and Gomer's (with a great selection) is a mile east on 39th.My wife loves the hummus and falafel appetizers. The lentil soup (while maybe not the best in the world), is very good (and the clear choice when you choose \"soup or salad\" with each entree). The salad is pretty mediocre and basic iceberg, though.My kids love the chicken kebob (healthy sized chunks of tumeric yellow breast meat, with rice (very good with a sriracha like garnish) and pita. They don't even touch the kid's menu since the kebob is so good.One new dish for me was the Cauliflower Zahrain- chunks of cauliflower sauteed to brown outside then simmered (I'd guess) to tenderness with a yogurt sauce. I'd never had it, and I love it.They do great takeout (with a couple of dedicated takeout parking spaces in the small lot), and have double the seating in the summer because they put tables out there.Aladdin is now in our regular rotation. Great stuff."], ["Joshua R.", "This place is nuts. Best Mediterranean food in KC followed very very closely by bread for all."], ["Michelle F.", "it's not a fancy place by any means but the food is certainly terrific. Three of us split the Agrabah Appetizer Sampler. The hummus and baba ghanouj were wonderful. The genie dip is bright with citrus and heavy with garlic... so potent and so yummy. The falafel were tender and spicy. The dolmas were a favorite, tender grape leaves and nicely spiced filling. This is served with pita bread fresh from the grill, even sporting a little bit of a char. We had to order a second basket of pita and there wasn't a drop of anything left on the appetizer plate when we finally let the friendly waitress take it.We all ordered sandwiches. My husband the Shawarmah, my sister the lamb gyro, and the Souvlaki chicken for myself. We nibbled and shared, but just a little. No one wanted to give up too much of what they had! Mine was tangy and messy but so good. Tender chicken with yogurt sauce and feta. The sandwiches also came with greek salads. This is not your ordinary greek salad. The lettuce, romaine, was crisp and fresh and had plenty of toppings to steal the show. The dressing has a lot of citrus zing and it's so good you can't not eat it. Completely different from the \"standard\" greek dressing. And you had better believe I cleaned all of that dressing up with the last sliver of warm pita bread. We also ordered a bowl of lentil soup, so warm and creamy. The menu here is very diverse. They even have Koshary! I can't wait to get back and try some of the other items."], ["Michal R.", "I am a huge Mediterranean food person. I love me some gyro meat. It food here was enjoyable. I would definitely go back again. I've had the gyro platter and the chicken kabobs. It makes me really happy that they use sumac, as it is by far my favorite spice, I just wish they didn't use so much oil!! Vegetables are tasty enough, they do not need a gallon of oil! The service was mediocre at best, but an all around decent food experience. Not miraculous, but more than satisfactory."], ["Joanna M.", "My friends have been telling me about this place for a long time.. in fact, they used to go on and on about a certain lentil soup that would change my life.  Skeptical, I would shake my head and shrug, convinced that no lentil soup was good enough to so rock my culinary senses.  Of course, I was proved dead wrong.  Good golly, the lentil soup at Aladdin just takes it up about 100 notches; it is, all at once, delightfully soothing, complex, lemony, and oh so filling.  I could probably chug a glassful of that stuff now..But that's not all that is amazing at this otherwise nondescript cafe.  I am so in love with their lemony salad vinaigrette and the beef shawarmah that I ordered was simply on point.  The beef is juicy, tender, and deliciously flavorful.  Paired with a soft pita and a yummy tahini sauce, it really can't be beat.  Aladdin, you have a new loyal customer.  I will, without shame or fear of retaliation, yell it from the rooftops so others will know: \"YOU HAVE TO TRY ALADDIN'S LENTIL SOUP! IT WILL CHANGE YOUR LIFE!\""], ["Melinda H.", "I only had the hummus, the lentil soup, & the halum (grilled cheese). They were all very, very good!! The hummus was very smooth & creamy & had a side a jalapeño chutney that was perfect! So good! The pita was warm & good. The lentil soup was good, def better than usual since I normally don't like lentil soup. But the star attraction was the cheese!! Holy smokes you will be missing out if you don't get it! Soooo good!! I also had the mint tea & it was also good & very relaxing sitting outside people watching  while I drank my tea :) I will definitely go bank for the cheese & hummus!! And will think about that jalapeño chutney for a long time!"], ["Blair C.", "The service was good and the food was average, the Agrabah Appetizer Combo was a generous portion, but was lacking in flavor. I did like the Rose lemonade, it was amazing! Perfect for a summer afternoon."], ["Mateo S.", "I enjoy this place, but expectations should be managed. It's not the best and not nearly the worst. For instance I just got their fantastic lentil soup and an order of dolmas. The dolmas were straight-up refrigerated cold as if they'd been made last week and then placed in the container five minutes prior to pick up without even trying to heat them up. So disappointing. The dill chicken is pretty disappointing too. It's dry, bland and only comes with a head of iceberg lettuce on it. Actually, I've never had anything here that I would characterize as \"really good\". I guess their lentil soup is super good, so that's why I'm giving them three stars lol. Otherwise it'd be a two-star affair. (atmosphere and service are God awful.)"], ["Jenny A.", "This food really hit the spot. Everything was delicious and the rice was out of this world."], ["Hayley S.", "If you order a sandwich, you get to choose lentil soup or side salad to start - tough choice! I love their green salad dressing, but this place has hands down the best lentil soup in town. The rosewater lemonade is delicious. They offer free refills, but it's so sweet I can only get through one glass. The sampler platter is a great choice, either for a starter or for your meal - you get falafel (not my favorite), dolmas, hummus, genie dip and baba ghanouj. I LOVE the genie dip - I believe it's just very spicy hummus, but man, is it good."], ["Darcey R.", "Tasty gyros and schwarma. Each comes with a side of Jasmin rice and a choice of soup or salad. I went with the lentil soup and it was surprisingly good. Service was a little slow but nothing to complain about. Prices were good for the amount of food you get. I could see me coming here when I want to sit down an enjoy my food. But if you want a tastier gyro head to Jerusalem Cafe down the street."], ["Lori B.", "What can I say....done. Food is ok service horrible. I used to frequent this place but no more. The servers are not the best and the portions on to go orders are half  of if you stayed but they charge the same . There are restaurants in the neighborhood who are more deserving if my patronage."], ["Kimberly M.", "The seasonings on everything I ordered were on point! The lentil soup was the best I've ever had! Generally I'm not a big fan. The lamb kebab wasn't anything out of the ordinary, but it was solid. The rice and sauce that came with it were fantastic! As was the grilled pita bread. Drool. I'd be a regular if I lived in Kansas City."], ["Karla M.", "I love Aladdin Cafe!!The restaurant is quaint and their patio area is pretty great!  The service varies, which is the reason for the 4 stars and not the 5.  But the food is always on point!!  I am kind of addicted to Chicken Shwarma but I've tried their Chicken Buyari and the gyro as well, all of which are very good.I've always stated that if the food does the talking I could care less about the presentation of it and the restaurant.  As long as nothing looks questionable I'm on for the ride.Definitely try it if you haven't it's a great pit stop on 39th!"]], "Mr Gyros Greek Food & Pastry": [["Lisa L.", "I love Greek food and Mr Gyro's on 135th is my favorite in Johnson County. I usually get the grilled chicken dinner and it is enough for two meals. Their homemade warm pitas are amazing and the salad is huge and delicious. The strips of chicken breast are succulent and grilled to perfection.  The dolmadas plate is also excellent.You order at the counter and get a ticket with a number to go get your food when it's ready. It's casua with a nice clean casual decor and even my pre-teens enjoy going there.  There is ample parking and it's right on 135th Street off Antioch so easy to get to."], ["Jeremy P.", "Good greek food. More like a walk-in fast food restaurant than a sit down restaurant.  Very casual atmosphere.  Don't get the salad.  Not so good.  Great baklava!  Should have ordered 2 of these."], ["Aimee W.", "This is actually the first Mr. Gyro place I went to.  I didn't go to the one on Metcalf until later.  But I stopped by there last night before I headed to a friend's with our feast!Delicious.  It was pretty busy and order taker later speedy and accurate.  They had a hummus special so I got an order of that for my friend.  We both got the gyro sandwiches and I got the side salad.  Delicious.  As always.  Service was fast and pleasant.  Portions were generous and delicious, salad was crisp and delightful.  I assume the hummus was good - he didn't share and I think I caught him licking the container!  Anyway, I actually like this location better.  It is closer to my house, it isn't as busy, and I think the space is larger and so it is less crowded.  Now, I haven't been here during lunch so maybe it gets slam packed there too but I think cause it was my first time with Mr. Gyro - it holds a special place for me.  :)  YUM!  okaybye"], ["Will W.", "Quick.  Tasty.  Cheap.  Friendly service.  I'd go back."], ["Debbie G.", "Let me start by saying there's nothing wrong with this place, it's clean, the staff is quick and efficient, the food is fresh and generous.  So why did I give it just 3 stars?  Because some of the key dishes aren't that flavorful.  The grilled chicken (strips and souvlaki) is cooked nicely, but it's missing lemon and garlic.  The salads are also fine, but the dressing needs a lot more acid.  I wil say that the tzatziki is good as is the pita.  I'm not a fan of the hummous but hummous is a personal thing - everyone makes it differently and there's no right way.  I like mine with a lot of garlic and lemon and very smooth.  My Gyro's is smooth but it's mild with good chickpea and tahini (?) flavor.This isn't a bad review - maybe Mr. Gyro just isn't my thing."], ["Fatima G.", "Expensive food with not expensive flavor!"]], "Never on Sunday": [["Kathy G.", "Great Food!  I had the Entree Combo and it was enough for two.  I've now become a huge fan of pastitio, a layered noodle and meat sauce dish with a wonderful custard top. My next trip will be for the gyro and here's something different: come in on Monday wearing a blue shirt and get a free dessert.  The baklava is great."], ["Heather B.", "I had a great experience! Called in my order. It was ready in 13 minutes. Staff was very friendly. Prices are very minimal. The spanakopita wasn't the best I have had. It was very greasy. I also ordered the chicken gyro with the rice pilaf. Very good, but the rice was more greasy than I prefer. Overall, I really enjoyed it!"], ["Bart H.", "Better food than any other Greek place we have tried all year, including Tassos. Very relaxed, welcoming atmospehere with generous portions. I only wish they had wi-fi. I would love to make this a place to have lunch meetings.....86 out of 100"], ["Amanda O.", "Color me impressed!Went over lunch today with my sister, and we got ours to go - good thing, because they were busy & there was a decent wait.  I got the classic gyro & feta pasta salad.  Gyro = awesome. Salad = a little too vinegary.  It comes with a side of tzatziki (wahoo!) that is pretty tasty, albeit a bit overly dilled.  We'll definitely be making a trip back over to try out the rest of the menu.  I usually love chicken souvlaki, so I feel it's only right for me to delve in & find out for myself how dry it is.  Hopefully they've vamped up the recipe recently!Oh, and I almost forgot - small slice of baklava for dessert was the perfect ending!"], ["Meghan M.", "First off, the hummus was very bland. Next, my chicken gyro was sub-par compared to other Greek places in the area. It had very little flavor, it was extremely greasy as well. The rice has NO flavor either.  Also, I could hear the microwave heating up our food in the back. It was very low quality and not worth the $20 I spent. I will NOT be going back. If you want some of the best Greek food in KC, hit up Olive Cafe off of James A. Reed Road. It has the best hummus around. Never on Sunday? Never again..."], ["sarah s.", "We had their special of a gyro sandwich and side Greek salad along with spanakopita as an appetizer. As I ordered our food at the register, the employee reaches into a small fridge and retrieves a plate of spanakopita, takes 2 off, pops them into the microwave and then onto our plates. They were disappointing: not fresh, very soggy, and tasted bland. The salad was average and the gyro was poor. I've had a better tasting and cheaper gyro across the street at Gomer's Chicken! Much better options for Greek food in the kc vicinity."], ["Jodi D.", "I can't believe I keep passing this place and haven't stopped! I finally decided to stop tonight on the way home. I got the day's special - Gyro & small greek salad and also ordered a pita. AMAZING!! I will definitely go back!"], ["Mike H.", "We went to Never On Sunday last Saturday. My wife and I would both highly recommend this place! We each got the Gyro and Greek Salad lunch special for $6.99. It was a lot of food for the $$ and very satisfying and delicious! The owner also came out and said hello to all of the customers and told us that he really appreciated us stopping in. I like patronizing businesses like this - especially when the food is very reasonably priced and indeed delicious!! We will certainly go here again and I hope you try it out!!"], ["Rohnda P.", "I spotted Never On Sunday (NOS) when I was picking up my to-go order from Thai House which is next door. I made a mental note to check the place out another day. Well it was lunch time and I was thinking maybe a sammich of some sort! I headed in that direction and it was a tough fight between NOS (never been) or Subway (tried and true), but NOS won! And I am glad it did. There's nothing fancy about the inside of the restaurant. Chairs. Tables. Order at the counter. I ordered the original Gyro (they have a chicken version available) to go. Mmm. Mmm. MMMMM. It was good stuff. Spiced beef & lamb goodness w/ veggies on a pita and tzatziki sauce. You get your choice of fries, rice, or feta pasta as a side. I picked the feta pasta which sounded interesting, but wasn't really that good. Oh well, I tried it. It was a nice-sized Gyro as well, so it filled me up. Service was quick and the price was very reasonable -- $6.25 + tax. I haven't tried anything else yet, but I most definitely plan on returning. I am, however, a big gyro fan. Let's hope I can fight the urge to order the gyro again on my next visit. I am eyeing the pastitsio or souvlaki."], ["Clare C.", "My boyfriend and I ate here this past week. The service was super friendly and we got our food very quickly. I have dietary restrictions (I am a vegan) and the staff was incredibly helpful and accommodating. My boyfriend LOVED his meal (a gyro) and my salad was alright (I would have preferred lettuce other than iceburg). All in all a positive dining experience."]], "Pita! Mediterranean Grill & Take Out": [["Lo L.", "Absolutely love this place. The gyro pita is so tasty and seasoned well. The portion sizes are more than enough. I've also tried the gyro Greek salad. I visit this place at least once a week. The staff is also amazing. I've never felt silly about asking questions about certain dishes. The staff is always more than willing to explain."], ["Dan D.", "Very nice \"greek-like\" food. Not really authentic, but indeed tasty.I rarely do \"take-away\", but this place seems to be for that, more than sit down, so I've enjoyed their food at home.Very small menu, but that's actually good. You just pick something you want to eat, and go from there."], ["Steve D.", "The gyro pita with a side (I chose the Greek salad) and a drink (total $10.70) had generous portions, and were very tasty. Half of the pita bread seemed too thick, but the contents were fresh and plentiful, with nicely seasoned meat. The service was Chipotle-style, quick, and somewhat friendly. The interior was reasonably clean, with upbeat contemporary music."], ["Ray B.", "I give this restaurant a 3.5 after my first impression. We stopped in for a late lunch today and tried a gyro pita and gyro Greek salad. The restaurant was empty (due to the odd time of day) but the service was fast and friendly. The veg in the salad and pita was fresh and on point. The reason for the low rating was due to the incredibly dry gyro. I noticed it was taken from a pre-shaved container and it must have been left over from the lunch service several hours earlier. The flavor of the meat was decent it was just bone dry. I wish we had been given some extra dressing or something to make it more palatable. I noticed an entire gyro on a spit in the back ground - maybe they shave fresh meat during lunch? I would try this spot again due to the fresh veg and friendly folks behind the counter."], ["Russ Kelly M.", "The hummus and baba Ghanoush are the best in town,  they might be the only ones that make the gyro meat from scratch.  No fillers, gluten free and yummy all the way."], ["Mark S.", "I'd rather go to Mr. Gyros, Or Tassos. The food tastes like you just got a gyro at a gas station."], ["Merrit C.", "The people here are very nice and the food is great, only thing is they make the french fires fresh and they rush them trying to be nice to you, get your food out quick so i jet as for the extra crispy and they are always fantastic!"], ["Heather V.", "Clean restaurant.  Food made fast and to order.  Service was very friendly. Had the best Mediterranean salad I've ever had and was enough for two servings."], ["Marie F.", "Curry Lentil soup was pretty bland, pretty small and pretty pricey.  The salad was large, but just ok and had lots of topping to choose from -- almost chipotle style.However, it was skimpy on the meat.Vince P. had the gyro and it had more meat on it... actually it looked pretty amazing. A few different sauces to choose from.  Couscous, babganoush, and tabouli.  Not too bad, but I felt it was overpriced and left with an empty spot in my belly.... one where meat should have been.... mmm meat."], ["Kelly L.", "THis place does have really good sandwiches.  The falafal are also amazing.  I did get fast service while i was there and for the most part friendly.  The side i had chose with my meal was rancid.  It was just awful.  When i went to the counter, the nice guy didnt even question me and gave me a new side which was wonderful.  He pulled the one i had choses off the line and took it away.  THen a manager lady came out.  She looked like she had just ate a lemon whole or something.  She was questioning me a bit, i explained.  I went and sat down to finish my meal.  She was kind of rude about it all.  Other than that, it is a wonderful place to go.  I wouldnt order a la carte sides, they are a little pricy, more than they are worth anyway. Definitely a good spot a to drop in and have a sandwich."], ["Laura G.", "I adore this place. The staff is so friendly and fun and the food is amazing! I usually eat there at least once a week."], ["Miranda J.", "This is my new favorite lunch in town. The chicken pita was awesome! Staff was friendly and I was in and out in 5 minutes with my takeout."], ["Mario R.", "I had the gyro pita and it was amazing! It was my first time eating there and I will definitely be going back many times. Great service and value. Will try the salad next time because it also looked delicious."], ["Reed N.", "It is close to four stars, folks... so I'd try it if you haven't. It may be your go-to for Mediterranean food in the Leawood/Martin City area. As for me, I tried the babaganoush and what was billed as \"curry lentil soup\" on my visit. The baba was excelllent. I'd eat it again all day every day. The lentil soup was the big disappointment. No curry... but a tomato/veggie broth-based soup with sparse lentils. Of course, there had likely been a run on soup as the day I went it was about -80 degrees! LOLThe salads with meat looked awesome and that's what I'd get if I came back."], ["Tara C.", "I have now become a regular here. The food is so good! The lamb and beef gyro with red bell pepper hummus is addicting. I also really like that you can select what you want on your gyro with all very fresh ingredients. The staff is very nice and the restaurant is very clean. It's tucked away in a strip center but still stays relatively busy. I highly recommend this place!"], ["Alison L.", "I recently moved from this area, but for the last 2 years I ate here about once every week or two.  The service is good; staff is friendly and they will sometimes bring my tray to the table when my hands are full.  The falafel is not as good as others I've had, but for this area you can't be picky about mediterranean food.  The carrot hummus is my favorite, and you have to make sure to get it while it lasts since it's seasonal."], ["Ariel M.", "Had the gyro with fries the price was a little too expensive for me, $15 for the meal and I was still a bit hungry afterwards. As for the food, it tasted decent, nothing special except for the fries, and they didn't skimp on the meat like a lot of other places. The fries were delicious, had some sort of seasoning on it, couldn't tell what it was but it was amazing. It's a pretty small place, only had 2 people working when I went but they were still very kind.The set up of the place is similar to chipotle in that you tell them what you want at the beginning and then go down the line telling them what other ingredients you want added. The cleanliness of the place was also decent, didn't see any food on the floor or tables and they were good at making sure the tables remained clean.Overall it was a good experience, I would go again."], ["Kelsey V.", "The three types of hummus and babaganoush were great! My dining partners really liked the gyro lamb-beef meat mix. The staff were helpful explaining menu items unfamiliar to us and even offered to let is try things before ordering. Don't be scared, give it a try!"], ["Mandy W.", "I love this place! I ordered the Gyro and Greek salad, and they were both great. I really wish we would get one in the northland!"], ["Nannan Z.", "Gyro was bland and the meat lukewarm. Also they were out of falafels. Food was pricey for how average it tasted. Staff were friendly at least."]]}