{"Tikka House": [], "Swagat Fine Indian Cuisine": [["Heather G.", "Amazing service! We were seated immediately,  and with in a few minuets of ordering our food came to our table. Was not let down. Amazing atmosphere,  the soft music is very calming. The food was very nourishing,  and the medium spice Lamb Jalfrezi I got was just the right amount of spice for me to feel a slight heat. Will definitely be coming back. Oh! And the manager was nice enough to let me use my coupon that I had on my phone and not printed out."], ["Colleen Z.", "Yum! Friend picked me up at the airport between flights and we made off to Swagarts for a quick lunch. The buffet was great with a nice selection of dishes and desserts. I take off a star because I was not asked what I wanted to drink so I ended up drinking water rather my regular lunch drink of diet pop. Two types of rice which was nice. The chicken Marsala was perfectly spiced and the spinach paneer was excellent. I filled my plate with other delicious dishes but I didn't note the names, just tried everything that looked good. The naan wasn't the best I've ever eaten but naan is good no matter what! I would eat at Swagarts again in a short second."], ["Crystal C.", "So.. I was craving some Indian cuisine the other night & we were going to head over to Seva's (the only Indian restuarant we've been to & we love) but seen a $10 for $20 deal on Yelp for Swagat.  I read through the reviews and all were short of perfect!  First of all, I want to mention how beautiful Zona Rosa is, the park & the atmosphere down there is worth the trip alone.  So upon entering the restaurant we were greeted by friendly staff & taken to our table.  I was distracted by the decor and beauty of this restaurant as we were lead to our table.  The architecture & effort that has been put into this place is outstanding and in a way romantic.So we ordered the Swagan dinner for 2 which comes with your house bread (crackers, cumin papad) and 3 sauces which I can't name all of them but I know one was mint chutney all in all delicsious & spicy!  Then came our hot indian lentil soup.. it was decent, not a huge fan of lentils.  Food comes out pretty quickly would be my only complaint.  It would of been nice to finish our appetizers first BUT they did ask if it was to soon & we didn't argue.  Our fresh naan was set on the table & the butter aroma coming from the naan was superb and made me even more anxious to try it.  Along came our chicken tikka masala, curry rogan josh lamb, basmati rice w/veggies and last but not least our tandoori chicken came out in a SIZZLING skillet.  Smelled wonderful, looked beautiful & tasted even better than I could have ever expected.  Spices & seasoning of the masala and curry were spot on and left me wanting more and more.  All my husband kept saying was mmmm, and didn't hear much from him until he said he was about to burst.  LOL! Also we tried the medium spicy, PERFECT! Anything spicier and I couldn't of handled the heat.. my husband maybe, I mean he does love ghost pepper cheese.  So, we wanted to keep eating just because the food was that deliscious and we knew our tummy's were at their capacity when we forgot we also get dessert with our meal for two.  So we box up our leftovers (made a tasty lunch the next day) and wait for our Galub Jamun which is a cheese dumpling basically in a sweet syrup.  SOOOO yummy!  We've had something similiar at Seva's.  Oh & I almost forgot about our vegetable samosas that came w/our lentil soup.  Basically a fried or baked pastry with wonderful fillings of peas, potatoes, beans ,etc & indian spices.  It was to die for especially made a perfect compliment with the lentil soup.  All in all our experience was beyond what we expected, the food was the best I've ever had aside from my gma's home cooking & I will be returning VERY soon!  Also will become our #1 Indian cuisine restaurant anytime we get a graving for real tastes of India.After leaving the restaurant we had heard of Spice Bazaar which is family owned by the owner of Swagat.  It's basically a little convenience store filled with indian spices, rices, beans, frozen naan, cumin papad, anything you can think of!!! We were thrilled to go in here b/c we got some of the very ingredients like Rogan Josh curry to make at home.  Loved the cumin papad so we bought some of that & it was all at a very reasonable price.  The spices were endless & smelt wonderful also at a decent price.  Can't wait to make another trip back here also.  I'd say after dinner @Swagat's your just destined to go to Spize Bazaar afterwards. Not sure how anyone could pass it up!"], ["Susan C.", "The manager kicked us out of our booth seat while we were still finishing up our dinner. His explanation was that there was another party waiting for booth seating. I understand that on a busy Friday evening, if there is a party that finished their food and is just chatting, that that could be rude and at that point, the manager has the right to ask the party to finish things up. However, when I am forced to take home the remainder of my dinner just because I was preventing the restaurant from seating another party sooner, that is unacceptable. However, it seems that only the waiters understood what it means to be polite.Hence, I do not plan to return to this restaurant with such poor customer service, no matter how great the food is."], ["Madelaine G.", "I might have dreams about this buffet. We went on Saturday at lunch and it was good. I wish my stomach was bigger or I lived closer. If I lived closer, my stomach would probably be bigger.A good variety of dishes, and all the favorites. Chicken in the chicken tm could be more tender if anyone's looking to improve. Not too crazy about the chai, but cool that it was on the buffet too.That carrot stuff was good."], ["Scott G.", "Swagat was once my favorite Indian restaurant in the Kansas City area, and to me it still remains the one with the best ambiance.  The decor feels incredibly authentic, and could easily lead to a very intimate and potentially romantic experience, depending on where you're seated.  The food here is also very good.  Between my wife and I, we've tried a number of the dishes on the menu, and we've always been pleased with our selections.  Our favorites include the Chicken Tikka Masala and the Chicken Vindaloo.  They also have great Chai Tea!  However, where Swagat consistently comes up short is in their service.  There have been times when we've been the only customers there and we still lacked prompt and attentive service.  In addition, I have found the majority of the servers to be very impersonal.  Not that they're rude, but they never seem to be overly outgoing and friendly.  With better service, I think Swagat would definitely be a five-star review for me."], ["Teresa H.", "Excellent the spices were perfect. I had the lamb sagg and very good. Also great serviceAnd the BEST stuffed Nan!"], ["S M.", "Decent Indian food! However the service was horrible and rude.  A few friends and I went to the place half hour before closing. After being told they were still open, we went in and placed our orders. From the way the waiter and this other kid were behaving, you'd think they were doing us a huge service by giving us free food. Swagath, you can keep your mediocre offerings. I'm not coming back again. Would rather go to an Indian restaurant like Chilli n Spice where the people running the place aren't a bunch of rude snobs."], ["Candice H.", "Friendly staff and excellent food.  Everything I've tried is delicious and we go almost weekly.  I highly recommend their lunch buffet and chai tea.  Tons of vegetarian options."], ["Nina A.", "This place has been a favorite lunch spot of mine.  Convenient parking and you can go in and out within 30 minutes for lunch. The staff here is welcoming and very polite.  Their lunch buffet is an amazing deal.  Try the lamb curry with saag paneer, naan and end your meal with a cup of chai tea."], ["Shelley Y.", "Only 2 out of 5 people in my home like Indian food. So, my adventurous daughter and I went to Swagat for their lunch buffet. I was a tiny bit sad that my favorite Palak Paneer wasn't there but I made up for it with basmati rice, lentils, and warm Naan. Those were my favorites that day. My daughter doesn't do spicy very well at all, but still found enough to eat that she left stuffed and happy. She loved the Naan, veggie pakoras, tandoori chicken, and dessert. If you've never tried Indian the lunch buffet is a great introduction. I can't wait to go back!"], ["A A.", "One star due to poor  service from the waiters. It was horrible and rude service. We will not return to this restaurant."], ["Sadaf i.", "Horrible service, went last night. They totally screwed up our order, we ordered milai boti n they got us milai kofta, totally opposite. Since the order came after 30 min we agreed to take it anyway and i can make better milai kofta than that. If that was not enough, they took an additional 20 min to bring the naan. Never going back again. Neither service nor food made an impressiom on us."], ["Kim N.", "Check out the lunch buffet! It's awesome. And best of all, unlimited chai tea :) the perfect ending to your lunch. My favorites are the tikka masala and tandoori chicken. The food is fresh and the quality is excellent. I come here all the time for lunch, which I think is the best time to come.  Indian food tends to be a little more expensive, but the buffet lets you try all the popular dishes! The naan is okay, but everything else is awesome! Order a mango lassi too! Delish!"], ["Chandhra S.", "One of the best chicken biryani in kansas city !! But even its a north indian style. Looking for some hyderabadi style !! Good food and ambience.."], ["Sophia M.", "Out of towner looking for great food?   This is the place!   Watch out though some is spicy ... I did the buffet for lunch,  mmmm delicious!"], ["Tim B.", "Went to the Saturday lunch buffet for $ 10.95 and had certainly the best and most diverse Indian buffet I've ever had in my life.  I've made no secret about my distaste of the buffet concept, but everything was so good, so fresh, I just have to give it up for this place.  Every dish had a bit of twist:  the dal makhani had a bit of spice to it instead of being the bland workhorse dish that inevitably comes with every buffet, the acorn squash masala was novel and amazing, ditto for the radish masala-- and the meats weren't dried up which is the most annoying tendency of the buffet concept.  Oh, and the chai tea was the most authentic I've had in the states, and the gulab jamun (finally)in hot syrup!  I could go on and on, really.  God, I will definitely be coming back to the place.I had a bit of everything, which never ends well-- I felt all ghee'd up for the rest of the day, and possibly approached Total Blockage in my GI tract.   Like the best Indian places, I ate like I was having my last meal on the Titanic, and then appropriately I went down with the ship.  And Leonardo wasn't there to save me, either.Part of the reason for their success is that they have enough customers coming in to keep the fresh stuff rotating in quickly, but that's a bit of a self-fulfilling prophecy, isn't it?  Whoa, and there were some pear-shaped mega-eaters in the joint too.  We grow 'em large here in the Midwest.  They were football coach big.  I wonder if they've contemplated doubling the price for anyone coming in who tops the scales at 300.  Anyway, it was worth it all-- and Happy Diwali to all the fine folks at Swagat!"], ["Dee T.", "Excellent food, great service. We were in a very large group eating family style and everything was absolutely delicious! The servers navigated through wandering children and distracted adults gracefully and patiently. Great dining experience, strongly recommend it, will definitely be back."], ["Kandy G.", "I went here the other night for the first time with a friend.  I loved it from the minute I walked in.  I loved the decor, the smell and even the pretty dishes. I loved how the fabric draped over the booths and the rich color scheme.  Our service was excellent.  Friendly and attentive.  The food was out of this world.  You will not be sorry if you try it.  The only thing that could possibly be better is a little more description of what the dishes are as they all have Indian names. Since I, like most, do not know the language, I needed more description.  Other than that it was wonderful and I will definitely go again."], ["Grant W.", "Best Indian food I've found in the Northland and up there with the best in the city. The restaurant itself is surprisingly well decorated and clean. Service was attentive and friendly. I will definitely return."]], "Kulture Kurry": [["Mwineland25 ..", "I'm a novice at indian food so I usually get chicken curry with galic naan bread (except it's not called chicken curry it's called something that I can't pronounce or spell correctly).This place is good.  I get it delivered every once in a while and I haven't been disappointed yet!"], ["Sathyaraj K.", "Food was very good and ambience was good .But the variety will be limited but the quality is very good"], ["Kristy H.", "I've been to Kulture Kurry once, for dinner. I will happily go back.I'm a huge fan of Bhindi Masala, Bhindi Pakora, etc. I love okra. And I love creative things done with okra, from stuffed pods to the stewed okra and tomatoes of my Mississippi childhood. Kulture Kurry's okra dish - Bhindi Kurkuri - is different from any I've ever had.  It's thinly shaved and dry cooked with dried peppers. Its interesting texture (crunchy okra, chewy caramelized onions) and delicious flavor would recommend it even to people who say they don't like okra.The portions are large, served with basmati and papadum + chutney as an appetizer. I had chai (served unusually unsweetened) to drink, which was interesting, but still very good.This place is right around the corner from my work, and on the way home. I forsee many, many takeaway orders of the Bhindi Kurkuri in my future. On ambiance: The service was good, BoH was quick, and everything was delicious. The \"radio\" (spotify or another streaming service) is the only real annoyance. Because it's apparently running on someone's phone and plugged into the FoH speakers, you can hear anytime a text comes in. It's pretty annoying, since I try to not pay attention to my own phone when dining out, and I'd rather not pay attention to anyone else's, either."], ["Jeannine R.", "I ordered delivery tonight from this place.  I was shocked when I opened my bag to see a small bowl of sauce with 2 small chunks of chicken and lots of onions.  I ordered CHICKEN TIKKA MASALA, NOT ONION TIKKA MASALA.  I mean for  $28 wtf is this?  2 naan and 1 order Chicken Tikka Masala for  $28? Delivery fee of  $5. This is ridiculous.  Never again will I order from this place.  I asked for the food to be spicy.  Guess what,  not spicy at all. I have been to many Indian restaurants throughout the US and this by far is the worse.    Save your money,  go to McDonald's where their food is more upscale than this place."], ["Zach L.", "Great place for lunch. Went here with a few friends a week back and were greeted to some wonderful indian food, the kind that hangs onto your clothes after and makes you need to take a shower to prevent anyone from knowing that you gorged on food for lunch.The price is nice, around 12 bucks for the lunch buffett and there was a great selection of dishes to choose from ranging from vegetarian to meat based which the vegetarians in our groups all appreciated. The korma, curry, and paneer were all delicious of different meat and vegetarian varieties. The service was excellent which probably helped because this was mid-week and we were some of the only people in the restaurant. I think a few of the things could possibly have been fresher but we were on the tail end of the lunch buffet so I would recommend going earlier during the lunch hours.Another odd thing for a restaurant is they close in between lunch and dinner which you don't often see, but it's definitely worth making a trip for lunch to try some of their Indian food which is some of the best I've had in the KC area so far."], ["Sarah N.", "It was alright. My husband and I decided to try it out because we kept hearing how good it was but it was mediocre at best. This place was empty when we came in at 6pm. I had the tikka masala and it was alright! It was mostly just sauce with little bits of chicken in it. It should've had way more meat in it, especially since it was $16 for just the tikka and a little bowl of rice. They don't allow substitutions for naan instead of rice which was a big let down because my husband prefers to eat his with naan instead of rice so we had to order extra naan. We are huge fans of Ruchi's and thought this place wouldn't be as expensive but it turned out to be more than what we would spend at Ruchi's. We won't be coming back here again. Ruchi's is definitely the best in the KC area. BEWARE, the prices on their website are lower than what's on the menu at the restaurant. Not sure why they haven't updated their website but that was pretty disappointing as well."], ["Inge J.", "Have been here a couple of times now, with Indian work colleagues, when in KC. I am a big fan of both North Indian and South Indian food, and this place does not disappoint when it comes to the former. My visits have been for dinner. Good naan, great lamb chops, paneer masala, and many other dishes."], ["Jeremy M.", "I got the kebab lunch specials for my office. $11 a piece and it was just a pile of barely-seasoned onions and a few bites of chicken. A total ripoff. No rice. I mean, the three bites of food were alright, but $11? Not really a \"special\" in any sense of the word."], ["Adam S.", "I've been to Kulture Kurry twice now, and its been good both times. It is located in a strip mall near Corporate Woods, so I wasn't quite sure what to expect. Luckily some friends had been there before, and vouched for the food. The interior is clean and a little spartan. The waitstaff has been good both times, but we stumped two different members of the staff with pretty basic questions about the dishes. The first time I went I got the Chicken Vindaloo. When the dish on the menu says \"hot and spicy\" don't ask for \"medium heat\". That is apparently added onto the base heat level of the dish. Other than my nose running at an alarming rate, the dish tasted great. I also got some garlic naan, which was tasty. My wife and I got the hummus tandoori as an appetizer. It was really good! Basically just hummus served with diced tandoori chicken on top.The second time I went, I decided to try the Kansas Krackle. The menu describes it as \"assorted meats\" and \"served over rice\", but it was just chicken in three styles served over some onion. I assumed I had read it wrong on the menu, and didn't take it up with the waiter. The meat was good, and I ate it with naan. A member of our party said I was eating \"Indian fajitas\", which is a good way to describe it. Kitchen missteps aside, it was tasty. For our appetizer this time, we tried the Chicken 1947. I didn't have a problem with the dish, but it did taste a lot more Asian than I expected. Overall, good experiences both times, and I'd recommend checking it out."], ["Aarushi G.", "You are greeted by the smell of delicious Indian food and pretty decor as soon as you enter. We tried the paneer butter masala which was outstanding, rich, creamy, and tasted just like what you would have at a restaurant in New Delhi. The dal makhni was was also delicious, although not quite as authentic as the very dark brown version rich in butter and cream, which is how it is served in India. The spice flavors were on the spot. We also tried the aloo tikki chaat and it was good, but not quite like the street-style chaat that is served in India. The icing on the cake was the Indian orange ice cream, which was basically mango kulfi inside an orange and cut into slices -- it took me back to the kulfi served on streets of Chandni Chowk as it was so decadent and VERY authentic!"], ["Sharad M.", "Excellent food and service. We have eaten there several times (both buffet and a la carte) and have had two parties catered by them. The service in their restaurant is among the best of any Indian restaurant in town with knowledgeable and attentive staff in an inviting and well-lit atmosphere. The food is great, especially the chicken dhaba and all the 'butter' curries. The chilli chicken was nicely spicy. This is an easy recommendation for Indian food in the KC area!"], ["Scott C.", "Awesome. I was walking into Starbucks with my dad and the smell in the parking lot was amazing. I asked him what it was and he told me there was a new Indian restaurant right next door. We went in and checked out the menu and told them we'd be back later that night... And we were!I went with my wife and parents and we ordered three dishes amongst us and three orders of naan. It was a perfect amount of food. The food was delicious! I wanted to swim in the chicken butter sauce. I wanted to inhale the chickpeas. And the corn chaat, I wanted it to never end. Further, the potatoes were de-lish.Also, the beer selection was good I got a lost coast IPA from Eureka ,California. I definitely recommend making this place a regular spot for your dinner!And I'm looking forward to coming here again (probably tomorrow, hah!)."], ["Lauren M.", "I can honestly say I was pleasantly surprised. Great, delicious food and our server was very nice. Get the tandoori lettuce chicken wraps, they weren't super spicy, but the flavor of the chicken was pretty darn good. I'll just list out the rest:-Chicken Dhabi (chicken in a tomato sauce) was mild, but the chicken was tender and the dark meat was super juicy. The sauce wasn't too think or too thin.-My husband had the Railway Goat Curry and he loved it. They leave the bones in so be careful (for flavor?)-Complementary long grain rice (with every dish)-Portion sizes were perfectI loved this place and I love the modern Indian decor. Everything in the restaurant is extremely nice and the theme goes together (One of my pet peeves is when you go to a restaurant and they just stick random crap on the walls). Try this place out! Great new location and I was blown away."], ["A A.", "New place in town! It's my first time here but my family has been there twice before. More like a 3 I guess, but 4 for Kansas since I am from California. This review is based on all three experiences:Staff is nice and friendly but still needs more training, which is understandable.The taste of the food isn't constant. For example the chicken dhaba tasted VERY different both times it was ordered.My review for our to-go order:- Naan: not too fluffy but it was good 4/5- Mutton biryani: we said mild and it was still super spicy. Family said it was better the first time they ordered. According to my experience 4/5- Chicken dhaba: now I don't know what this is really supposed to be so I can't give it a fair review. But whatever it was, it was pretty good 4/5- Chicken makhani: in my opinion it had a weird sweet flavor to it and when you eat it with naan or rice, felt like it had no flavor 3/5- raita: had the onions and tasted JUST OK. it was more watery than a lassi so we didn't get to eat it with our food. 1/5- Good portion of plain rice. I am not going to rate it. Glad it was cooked well.Overall decent for Kansas but food lacks the authentic flavor of Indian food and they are super expensive! Our bill came out to $53.00. If we dined in a tip it would be close to $60 and that's not worth it at all!!"], ["Jayan Karthik P.", "Amazing food. Not a fan of their biryani but all entrees and appetizers were authentic. Do not miss out on Narangi Nasha for dessert (kulfi ice cream inside orange peel)One the best restaurant in this area"], ["Philip P.", "My experience at Kk has always been amazing. By far the best indian food in the Midwest. to better describe the food of Kulture Kurrys , i would compare it to the feeling of a flash flood of flavors rushing into your mouth. Over and over and over. Mmmmm....*drools*"], ["Danny m.", "Had dinner there last week, food was awesome, service was great and staff were very friendly. goat curry was awesome!!!!"], ["Nithin N.", "Not the best biryani you can get!Very few items in buffet. Good ambience though and heads up for Gongura goat!It's a new restaurant, and seems like it already started loosing the flavor! Sad"], ["Emma C.", "I am a fan of Kulture Kurry, though I highly recommend going to their dinner instead of buffet. The food is delicious, I personally feel like their non-veg items are a specialty instead of the veg. The servers are very nice and so are the managers. Out of all the Indian restaurants I always prefer going for dinner there."], ["Alice M.", "Low marks for a dirty overcharge trick at lunch buffet last Friday. I went with a group of staff from a medical office who had limited time. All in uniform. Obviously individual checks. First, the buffet was $3 extra because it was Friday. Fine. When we checked out, we were charged as a group of 6 so that we could be charged $18% tip. For delivering ice waters?!!! I have no problem with automatic tip for large tables for a served dinner, but this was a self-serve lunch buffet! Ridiculous. $16.49 each. It turned out not to be a bargain. Food was average."], ["Aqsa S.", "It was my first time here and totally  worth it!The menu is selective,but the food is authentic!I can say that ,It is one of the few restaurants in Overland Park who know the meaning of Indian desserts,Making Indian desserts is not an easy task,and Kulture Kurry has made it possible to eat home made desserts.The mutka kulfi is one of their best.The servers are friendly and the place has a friendly ambience."], ["Srinivas Prasad G.", "The food was okayish, I ordered paneer peking and vegetable noodles (small portion), the tadka(not sure if it was tadka or chilli flakes) that they put in paneer was burnt and the noodles had very strong soy sauce flavor, I literally mean soy sauce overload!Ambience wise, the interiors were well decorated, the waiters were nice and friendly but they seemed confused with the orders, I wouldn't blame them, for there were many people coming in, wanting to try this new restaurant. There was a lot of wait time, we walked in at around 8.30PM and left around 10.15PM, they did offer us a discount for the wait time, not that they didn't care but it was something that they could have done betterAll in all, I don't think that it lived up to my expectations."], ["Dave P.", "I would give the place 31/2 stars. the restaurant is pleasing with its decor and the aroma of the food as you enter is inviting. Greeter at the door and waiter was well dressed and pleasant.  Those of you that go to Indian restaurant know what I am talking about. We ordered Chicken 1947 app, Biryani, Lamb and Chicken Tikka. All were flavorful and nice spice level.  The Chicken Tikka was terrible. Definitely the worst I have had in a long time. TOO MUCH FOOD DYE AND NOT GOOD. Not all dishes can be cooked well at any restaurant, however Chicken Tikka Masala is my son's favorite and for most Americans."], ["Gary B.", "Great lunch buffet that is now served 7 days a week. Their naan bread is served warm and fresh at the table. The tikka masala dishes are great."], ["Michelle S.", "The BEST Indian food around. My husband and I tried Kulture Kurry for the first time this week and both agreed that this is the best! I had the Kulture Korma (vegetable korma) and I've never tasted anything so wonderful. The atmosphere is very pleasant and the wait staff very attentive. We will DEFINITELY be back to experience their amazing explosion of flavors. A little more upscale than most Indian restaurants."], ["Tom H.", "Food was better than flavor of India, chilli and spice, and swagat.  Probably the better of all the indian restaurants I have been too in KC area.   The problem was the service.  It was useless .  I would use profanity to describe the service but am choosing to be polite.  On a weekend they had two girls literally waiting the entire restaurant.  The food took long.  Starters took 45mins.  Drinks took almost 10mins after we ordered.  I would have rated them 5 star if the service was there.  I am not sure if I would go back here.  I do not like the idea of spending 3 hours in an indian restaurant.  There was also some mix up in our order but I was not to concerned."], ["Susan M.", "Great Indian food! I had the Lamb Saag - it was fabulous! Recommend chicken lettuce wrap appetizer- with minty sauce- terrific! Attentive service, colorful and crisp decor. Highly recommended!"], ["Gabe B.", "Great place for lunch in corporate woods. Truly amazing food and service. Really clean and neat. Try the Samosa the sauces are really good."], ["Teresa K.", "We've eaten here twice so far and I believe this is the best Indian restaurant in the city.  Strong statement, I know.  Both times the service was excellent, fairly quick, and very friendly. It's more upscale in decor and pricing than other Indian restaurants I've frequented.  My favorites are the Butter Chicken (it's called something else on the menu but ask your waiter) and the Chicken Saag. Both were excellent, nicely seasoned and spiced and came in nice portion sizes that made it easy to share - and you'll want to share! The lettuce wraps were just ok - I can't recommend them. I thought the portion size was small for the $10 it cost. Likewise, the samosas were solid but not the best I've had. The garlic naan was excellent, though.  The decor is simple but elegant and in my favorite color - red.  You should go here."], ["Mac K.", "Finally we can say, Overland Park KS we found awesome North Indian food. We tried 2 curries, Kulture korma and saag paneer. We enjoyed both curries."], ["Julian S.", "So far best Indian food in KC metro.....railway goat curry, chicken vindaloo, and the Saag Paneer (creamy spinach) were awesome tonight. We have had before the saffron scallops and the lamb saag which were also excellent. They also have a wide variety of naan bread from they Tandoori oven."], ["Karan W.", "To start off, I've been to a lot of Indian places thus far, none (apart from the exception of Junoon, Manhattan, NY) have even come close to the essence of what Indian food is. Don't believe me? Visit this place. I mean if the papad is hot and crisp when it comes out, and I get my apps within ten minutes of placing the order, you have my full attention.Apps were good (Chicken 65, Shrimp Garlic Masala) entrees were even better (Chicken Makhani, Goat Sukka) and the portions are anything but MINUSCULE. Also the Naans and parathas deserve a mention, just for their good quality. FYI I am a pretty heavy eater and so were the other two adults with me, but after we were finished with the entrees, we had zero space for a desert, which sounded really tempting, but I didn't want to tempt fate :PAll in all, if you're ever on college boulevard, or at another Indian restaurant in the locality that you're bored of going to/ pissed off with the wait, make the trip down college blvd to the \"New kid on the block\"Kulture Kurry, stay cool, stay sharp, and make sure all your patrons walk out with full stomachs, just the way I did. Definitely will visit again 10/10."], ["N J.", "Food was okay. I ordered veg hari bhari biryani, it was not green at all as opposed to its name, not enough vegetables in it. Then i ordered chana masala, taste was okay but was too oily. Service was good though, they gave me 15% discount for  not having good experience. They do not have much vegan options. Pricy for quality of food, though i would not pay half the price for that food. I would rather suggest trying near by restaurant Koma sutra, they are pricy too but food is much better quality and tasty. Sorry kulture kurry, you need to step up your game!"], ["Niranjan C.", "This is the best restaurant in Overland Park in terms of quality of the food, cleanliness, ambience and most importantly the service. So this restaurant deserves an 5 out of 5. I am a food enthusiasts, I love good food and after moving from California to Kansas City, I didn't feel like eating in any Indian restaurants as they were lacking taste, cleanliness and importantly service. But I should say that Kulture Kurry has nailed it. I ordered chilli shrimp as an appetizer, chicken dhaba as an entrée, the food was very tasty. The desert \"rajwadee rasmalie\" was just awesome. The service provided was really really good. People living in Overland Park needed a good new restaurant. I'm sure that Kulture Kurry will live to its standards and make people happy by their good food. I'm sure I'll be back soon  for dinner or lunch. Way to go Kulture Kurry, keep up the good work. :)"], ["Nick S.", "Disastrous visit during lunch recently. Ordered biryani and chicken tikka masala. Both tasted like 1 week old - simply horrible."], ["John A.", "WOW!!  I travel quite frequently and get the opportunity to eat a lot of different types of Indian food and my experience here was phenomenal!!   Very personable staff.....the GM even stopped by to ask about my experience.   The hummus is to die for and the dhal was stupendous.  Cannot wait to make it back here."], ["Prudhvi Krishna M.", "The food is really delicious. Ordered a tomato soup and was pleasantly surprised to drink an authentic indian tomato soup. The paneer Peking was really tasty as well as the curries we ordered (sham savera and paneer butter masala). Would visit this restaurant definitely if I am in Kansas City again"], ["Shweta P.", "I have been to almost all the Indian restaurant in this area, but I liked this most the food is fresh and full of flavours. The place is spacious and not like other Indian restaurant!! I hope they maintain this !"], ["Hemin M.", "Probably the best Indian restaurant in the area! I love their Malai Kofta! A little expensive than other Indian restaurant but the food is worth the price."], ["Jisha P.", "I had to visit this place once I saw the menu! The food is delicious! The staff is not very well trained since it is a fairly new place and we had to ask them to bring naan with our food or we wouldn't get it. A little expensive and portion sizes are not very large. But overall a good experience. I would go again!"], ["Bodhisatwa B.", "LOVELY blend of KURRY n KULTURE... Loved it... Chicken Biriyani, Paneer Pecking etc. Everything we ordered had its own unique edge and being a BONG I felt desserts were awesome too... Chocolate kheer was unique for me. I am definitely going again :)"], ["Jean V.", "Another Indian restaurant in JoCo?!  Had to go and take my husband along as I made him a \"convert\" 12 years ago.  First impression was not positive:  We walked in, there were several empty tables (more than half the tables were unoccupied and clean); and were asked to wait ten (10) minutes to be seated.  WHAT???  We resolved that issue quickly and were immediately seated.  Note to restaurant:  Just because your servers are under-trained doesn't mean you can hold diners hostage when you aren't overly busy!  Let's face it...you have lots of very-nearby competition.Food was excellent and I think my husband has a new favorite place to dine.  Friendly server, adequate portions and the right spice for us.  We'll definitely return."], ["Sudeep M.", "I had tried the Nizami Ghosth Biryani.To my experience it's one of the best biryanis that I had in the United States.The staff was extremely courteous.I would rate it as the best Indian restaurant around Kansas City area."], ["Jeffrey V.", "I had the vindaloo. Sat at the bar so also had a glass of wine. For Overland Park, it was a solid effort on the Chicken Vindaloo. They seemed to have recently opened, so it seemed like everyone was doing on-the-job training. Hopefully, that aspect improves."], ["Nikhil R.", "Best Indian restaurant in Overland Park / Kansas CityThey have very different menu than other restaurants. Taste is purely Indian. Chicken Tandoori does not have red color and tastes better than all tandoori chickens I had before. Chicken Dhaba is a typical Indian delicacy which reminds you of street food and chicken was perfectly cooked. Had such good quality chicken after long time.Garlic Shrimp - Tastes amazing. Just like Indian street chinese.Orange Kulfi - Had this dish after long time. They managed to do this one perfectly.Service and ambiance are excellent. Owner personally takes interest in your orders and suggests you menu. He suggested us Orange Kulfi instead of Matka Kulfi and it did not let us down.EDIT 9/18/2015Changing review with recent experience. They have become unnecessarily expensive without changing food quality. In fact food is not so good these days. Buffet was really bad last time. Half of the time restaurant is empty. They have totally gone downhill."], ["Richard M.", "Excellent Indian restaurant, especially compared to the other Indian restaurants in the KC area.In particular, it is one of the few (if not only) Indian restaurants that has good food AND good staff. We've been to their weekend lunch buffet twice and both times we enjoyed, both the food and the service.At our last visit, the chicken 1947 and the railway goat curry, were especially good. The owner/manager was constantly helping out and interacting with guests. The waiters and management were very courteous and friendly, and were making sure that the buffet area was clean and well stocked for the guests.Would definitely recommend it to others and will be my destination of choice for Indian food moving forward."], ["Rebecca M.", "Foodie find! I can't believe how AMAZING the food is at this little jewel of an Indian restaurant. I was in town for business, and after a long day, I had a serious Indian food craving. Glad I followed it! First off, they had a really good Mosel Riesling, which is a fantastic pairing for this cuisine. Next, the onion kulcha arrived, soft, chewy and spectacular! Just when I thought it couldn't get better, they brought out my rich, spicy dish of chicken tika masala served with fluffy, perfectly cooked basamati rice, I thought I'd died and gone to the Taj Mahal! I ate my fill, but I just had to try the Narangi Nasha for dessert, and I'm glad I did--cool, creamy, and refreshing, and a perfect palate cleanser after the rich sauce. And the service was utterly delightful, warm and enthusiastic, and the decor tasteful and inviting. I will definitely be coming back again on my next jaunt to Overland Park."], ["Denette V.", "This place was amazing! The food wa exceptional. At some Indian restaurants the strong flavors are subtlety different and can be ghee laden. Not at this place. Each dish we had was uniquely spiced and was a powehouse of flavor. We went there for lunch. Their menu for lunch was limited but paired in such a way that we were able to sample several dishes. The price was reasonable, waitstaff pleasant and the dinning area was very nicely decorated. We plan to go there for dinner!"], ["Krista B.", "I have tried several Indian restaurants in the Kansas City metro area and this is on the top of my list. The ingredients were fresh and full of flavor. The sauces were wonderful and unique. Service is friendly and attentive, they are very helpful if you need a suggestion. Don't skip dessert here it is amazing."], ["Dusty R.", "I've been to most Indian restaurants in KC and the food here is as good as any of them and better than most.  I plan on being a regular from now on!"], ["Veera G.", "I read reviews about chicken daaba, very excitingly waited more than half an hour for the dish. All the excitement gone after tasting it. Its not tastier and i will rate that curry 2/5.  Tried Hadee gayab biryani (similar to chicken 65 biryani)  it is ok 2.5/5.  Atmosphere is good. Little bit expensive,Service is slow."], ["Shailesh P.", "i ben here 3 - 4 times so far. i have enjoyed the food very vell and service was at it's best. but i have to say my wife and others in our party don't want to go back here because they are  vegeterian and this place don't have much choice in appetizers and dinner. so if you looking towards vegie food stay away. railway goat and garlic shrimp and onion chilli kulcha were at it's best. don't forget to eat narangi. hope fully menu will improve for vegeterian."], ["Aritra B.", "Been here only once yet. But very impressed!! The most striking thing: this is the first place in town that is attempting to serve Indian food with style! 'Service' and presentation, two of the most badly missing things in all Indian restaurants have been taken up seriously by these folks! For something as savory, sumptuous and exquisite in flavors as Indian Cuisine has perpetually suffered from the poor dining experience of the customer. I have always been so sad about this! These guys are definitely attempting to make a difference in this regard! The decor, maintenance, service and certainly the food was great! The menu is designed very nicely and professionally, with even great attempts of creating gourmet. Taste was very good! Being consistent is a big part for a good restaurant, I will update on that after subsequent visits. But if you want to have a good dining experience going to an Indian restaurant, the first one of the kind might have been created in KC! I really wish they can live up to it!"]], "Kabab & Curry": [], "Royal Kabab King": [], "Flavor Of India": [], "Moti Mahal": [], "Spice N Rice": [], "Seva Cuisine of India": [], "Taj Palace": [], "India Palace": [], "Curry in a Hurry": [], "Korma Sutra": [], "Chai Shai": [], "Indian Mix Grill": [["Tamara M.", "I'm from blue springs and who would have ever thought a Indian restaurant with a buffet would open ! How awesome ... I'm used to being in Vegas for the mint Indian bistro which has the best lunch buffet and food !! Well this place is up to par great food and buffet I will be back"], ["Brian S.", "Relatively new, family-owned Indian restaurant in the Blue Springs area.  They have an extensive menu and plenty of seating inside, but the decor is pretty basic. The food, however, was delicious. I had the cheese naan bread, mango lasi and buryini mix. The buryini had plenty of meat inside and I requested a \"5\" level spice and it was perfectly balanced between flavor and heat. Also, in the evenings at dinner, they offer free desert at the end of your meal ;)All together my bill was $25.00 for one person. Pretty steep for dinner but fairly average priced for truly homemade Indian food with good ingredients.FYI - they also offer an Indian buffet during lunch times (but not during dinner). Also, be careful since you can easily drive past this restaurant from the main road (its pretty hidden)."], ["Matthew C.", "Extremely good service! Gave us free samples at dinner to time to find something our picky 5yo girl would eat. The food was AMAZING. All of it. I've eaten a lot of Indian food in a lot of cities and this is my single favorite. I cannot recommend it more. The chicken soup is amazing and good for kids. Their appetizers are also excellent"], ["Alexa B.", "Surprisingly very, very good. Be wary, as with most Indian places Medium is quite spicy! The Veggie Samosas were my favorite.. Mint naan was also superb."], ["April S.", "My friend and I ate here the other night for the first time. I've had authentic and awesome Indian food in Louisville and Indianapolis and this place is right up there with them! Our food was delivered hot and on time. Our waters were always full. The garlic naan bread was delicious. We had the chicken curry and chicken Marsala. The medium was very hot but the mango chutney cooled it off perfectly. I liked that they offer mild heat as well. Great place! We'll coming back here a lot. I can't believe this gem is in Blue Springs!"], ["Ray B.", "We enjoyed this restaurant. Ordered the butter chicken and korma chicken. Both sauces were nicely flavored and very creamy. The chicken was slightly dry. We also ordered an appetizer - aloo tikki - that was delicious. It was completely empty at 6:30pm on a Tuesday evening. It seemed like a family affair and everyone was extremely nice. I appreciated the extra spices they brought so I could adjust the heat on my dish. Looks like they offer a lunch buffet - we will be back."], ["Ashley C.", "I am something of an Indian food addict. Strangely enough, I also don't eat spicy food well. When my husband and I became aware of this restaurant so close to our home, I instantly chose it for my birthday dinner. There was not an ounce of disappointment!!We started with the veggie pakora. Every other indian restaurant I've eaten at serves this dish as mostly potatoes with maybe a pea or onion piece thrown in. Not the case here! It was an immaculate blend of veggies fried to perfection!For our meals, I ordered mild fish Korma and my husband medium chicken tikka masala. I feel like fish and goat are the big tells on indian restaurant quality. Their fish was amazing. Large pieces, perfectly cooked and flaky, and not dry. I tried my husband's for the sake of my review and was absolutely blown away! Korma sauce has always been my favorite. This time the tikka masala made my mouth water in ways I didn't know possible! I just might have to get it for myself next time!!Dinner came with a complimentary dessert. And no, I don't mean the bite size samples you get most places. This was an actual dessert! I chose  Kheer (cold rice pudding) and my husband had mango ice. Yet again, perfection! Cold, creamy, delicious!Oh, and I waited until the end to put this part in because it applies to every single thing we ate. This is the most flavorful food you will EVER eat!And if you think you won't be able to handle the food because you \"don't do spicy\", go anyway. Go for lunch. You will find something you cannot get enough of!!I can't wait for the next day my husband and I have off together. We will going back for the lunch buffet. Looking forward to some goat!!!"], ["Layla M.", "I found this restaurant on Yelp and we had to go right over that night.   we rolled in at like 6pm.. i get that this is early but.... it was completely empty. My first inclination was to leave but there were so many good reviews that we decided to stay.   My husband ordered chicken from the grill that was a little dry but otherwise quite niceI guess my biggest issue was my lamb vindaloo. i ordered it spicy vs mild or medium and I thought they made it mild.  the sauce was delicious but the meat was not plentiful at all. I had to stir a spoon thru the sauce to *find* the lamb.  we ordered the 'meat platter\"  as an app.   the samosa was delicious everything else was a little bit....overcooked."], ["Lakshmi W.", "Poor Customer service! I live 40 miles away from this restaurant but all the wonderful reviews about the place motivated me to drive to this place to try their food. My friends and I were there to try their Friday Lunch Buffet - Except for Chicken Tikka Masala and Naan, everything else was just Ok. I definitely had much better Indian food in KC than here. Eventhough the food wasn't excellent, I would be OK if the host/server were courteous. But the lady attending our table (who I think may be is the owner of the restaurant) was super rude. Everytime we asked her to bring naan, she would look at us right in the eye - not say a word - walk away - and after 5 minutes or so bring some Naan from the kitchen - but not respond when we thanked her. After 2 refills, we decided we would not request any more naan. Because there was no more naan left on the table, I had some curry left overs in my plate and the lady came back asking what was wrong with the curry and why I did not finish my plate... Sorry Indian Mix Grill, I am definitely not coming back or would recommend this to my friends who appreciate good customer service!!"], ["Briana E.", "Who would have thought that you would find amazing Indian food hidden in such an unassuming strip mall in Blue Springs. Regardless, this food is awesome. The butter chicken is to die for and the basmati rice is cooked perfectly every time. The Saag Paneer is also very good. The garlic naan is cooked perfectly and everything is just amazing. The inside is very plain, but I come for the food and not the decor."], ["Michael P.", "Let me start off by saying this is a great restaurant.  I came 15 minutes before opening and the staff was very welcoming. I had a bit of trouble choosing what I'd like but the staff helped out. Ended up with the butter chicken and garlic naan. The butter chicken taste like it had been stewing for hours.. very tender and flavorful.I found the service smooth and helpful. Any question being answered with detail.  Food portions were perfect, im a big eater so when i take food home thats pretty impressive. If your new or a veteran to Indian cuisine I'd highly recommend trying this place. You'd be doing yourself a favor."], ["Jordan W.", "2nd time here and this place is great.  Helpful and  friendly staff and excellent food.  Definitely check it out!"], ["Kira J.", "What a gem. This place has unexpectedly great indian food and huge portions. Our last take out we ate for three meals. This time we are eating in the restaurant this time. The couple who own it are super sweet and stayed late to feed us dinner. They even brought us free pekora. Delicious.  Their malai kofta is truly exceptional.  Garlic naan perfection. Free rice pudding for dessert. The whole experience made us feel like family."], ["Jamie G.", "Don't be food by the exterior. This place is absolutely delicious. I will admit my experience with authentic Indian food is limited but this place is definitely worth a try. They will answer any questions you have but it doesn't hurt to do your research. I had the lamb vindaloo spicy style and it was good! Not for the faint of heart though if you don't have a high tolerance for spicy food. They do have medium and mild options. My boyfriend who is very hesitant to try new things had the butter chicken and loved it. I chatted briefly with the matron of this family run restaurant and she very obviously takes great pride in the food made here and it shows. Looking for Indian cuisine but you don't want to travel all the way downtown? Look no further than this place!"], ["Risa C.", "The butter chicken, chicken tandoori, and lamb curry were perfect! I started with eating the lunch buffet, came back for dinner, and recently ordered take-out. Honestly, if a restaurant can snag a happy faithful customer from a buffet.... they got it made!  In my opinion this restaurant is a diamond in the rough! Dont let the unusual ''employee-style'' entryway change your mind this Indian place is a must-try."], ["Jeff S.", "When driving across the country or if you live in kc this is the Indian restaurant your looking for.   A extremely friendly staff and perfectly prepared food.   The Naan is delicious along with the saag paneer,  vegetable korma,  and malai kofta.   Its right next to the interstate for extra perfection!"], ["Nicholas S.", "Amazing food excellent staff and desert is included with meal. The lamb is tender and very tasty. The atmosphere is relaxing and very family friendly."], ["Claire M.", "I am a fan.  I wish they didn't use milk in their rice as it is not compatible with my vegan diet or else I would go there more often.  They give complimentary items.  The service is great.  All the sauces were good and their samosa are on point. One of the customers dining with me did say they thought the amount of lamb in their dish was pretty skimpy. t hey give a lot of sauce and will offer rice if you run out.  yum!!!"], ["Hannah R.", "I LOVE this place.... plus it's the only place to get Indian without going into Kansas City! Seriously their food is great and I love them. Saag Paneer is my favorite and then the Chicken Korma and Butter Chicken are Amazing!!!You should go! It's delicious!"], ["B Y.", "We went in for carry out after some confusion about the previous business closing and the new one opening. They told us the chef is the same but I have to say the food was so much better. The naan superb, chicken buhna so, so good, as was the Saag Paneer. The place was empty which is disappointing. The food rivals Taj Mahal and Korma Sutra, whereas before it was \"just ok\". Please go and keep Indian food alive in Blue Springs! We were greeted with hugs, literally, and chai, and a delightful welcome."]], "Touch of Asia": [["Jayan Karthik P.", "I come here for evening snack and sometimes for dinner.. Good tasting food and average pricing.."], ["Vinod K.", "Did I order a Seekh Kabab to-go at 8:30 PM on a Sunday night? Yes. Does this mean they should give me two days old kababs with a bowlful of rice? No. The kababs were the driest piece of meat I ever put into my mouth. Plus they seemed like they had been friend. Seekh Kabab is supposed to be grilled, not fried. There was no chutney or yogurt to go with it.If you cannot serve good food, just say no. I will change my order. Don't make a fool of a customer that has ordered to-go and won't be there to yell at you when they finally discover what they have been served.And how am I supposed to eat that rice with kababs anyway?!"], ["Nick W.", "Nothing was inherently bad, but I just wasn't wowed by any of the weekday lunch buffet entrees.I liked the chicken tikka masala. I was less impressed by the veggie korma and samosas. The samosas seemed too salty. Also, the Chai sat out on a hot plate, and it formed that unappealing skin on top.Seeing as the reviews are generally positive, perhaps I came during an off day. I'd try it again, and if I do, I'll update my review."], ["Karen P.", "Touch of Asia is my favorite Indian place in KC- and trust me, I've tried most, if not all, of the Indian cuisine KC has to offer. I was pleased on my most recent visit to see that the decor has been updated and the place was looking cleaner, fresher, and more inviting. These improvements will make me update my rating to 5 stars. The food has always been 5 stars (I'd give it 10 stars if I could!) and it's great to see that other aspects of this restaurant are working towards 5 stars also. I noticed a few other reviewers mentioned the tired decor- which makes me think that the owners read & pay attention to their reviews. Very nice to see!"], ["Dawn C.", "5th star awarded!  They have street food!   One of my favorite Bollywood movies (Rab Ne Bana Di Jodi) has a scene where the two main characters go out for street food and indulge in something they call \"gol guppa\".  I've looked for it high and low wanting to try it myself.  I finally discovered it has another name \"pani puri\" and that Touch of Asia carries it.  It was amazing!  Little crispy puffs, served with a lentil type filling, chutney and some sort of dipping sauce.  So awesome!   Ask to see the \"other\" menu if you don't see it listed with all the other Indian dishes they offer."], ["Bill B.", "In my prior review of Touch of Asia, I complained about the dismal condition of the men's room.  I am happy to be able to say that the men's room has been renovated and is fine now.  The food also is excellent.  We were there for lunch, when everyone else was using the buffet.  We ordered from the menu.  The service was fair at best, with only one server in the room. Perhaps at dinner the service might be better.  If you got there for lunch and decide to use the menu, don't expect fast service."], ["Priya P.", "Worst Indian restaurant I ever been. I ordered food to take out, they didn't give me spoon or fork even napkin, nothing at all, then how can I eat in hotel?  The food was really bad taste,  rice was not cooked and hard to chow, I promise I will never go there again, no way!!!"], ["Tim B.", "Totally sold on the Saturday menu here, which delivered the thali plate I've been desperately seeking since I arrived in KC two years ago.  In earlier posts, I've made it clear that I'm no big fan of the Indian Buffet Concept, but have muddled through one after another since I've arrived, thinking that my beloved thali was simply not here.  Never have I been so happy to have been proven wrong!!  The vegetarian thali was excellent, with great naan and papadum; we also got an righteous masala dosa and Bhel Puri, which is real-deal Mumbai street vendor food.  Frankly, we were so excited that we ordered too much, and could have just settled for the thali and masala dosa and been more than stuffed.  But I couldn't help it, with a little tear in my eye.  *sniff sniff* I'm just so excited to have found this authentic Indian food presentation- I will return early and often!"], ["Wenday L.", "This place may look too empty during the dinner rush but the food here is one of the best in KC. We've had Swagat and Korma Sutra before and this place is just as good in our opinion. The classic korma and tikka masala were delicious but my personal favorite was the lamb achari."], ["Chad C.", "I forget what I ordered, but it was from the vegatarian section of the menu and it was great.  I asked for very spicy and they definitely delivered.   The portions are large enough to take half of it with you if you dont want to walk out over-stuffed, which is always a plus.   Everything was obviously made from scratch and tasted amazing.  I will be back tomorrow."], ["Weldon P.", "This is the closest Indian restaurant to South Kansas City, but I would still make the trip since I like their food so much.  I normally get spicy lamb baryani and naan, and they know how to make it just spicy enough to break a sweat without overpowering the other flavors.  Their week-day buffet is not as big as Ruchi's, but it's a good variety.  Be aware that weekends they serve by menu or 2 set platters, no buffet (see photos for one of the platters).  Good price and I easily get 4 meals from one dish.  Unfortunately, I discovered they use a boxed mix for the baryani which specifically tells you to \"remove the plum pit\" before serving.  I've nearly broken a tooth 3 times and told the Manager about it 3x.  Still good food at a good price."], ["Kunal S.", "I have been here 3 times and every time I have left the place feeling disappointed. First 2 times,  I ordered biryani and it tasted like fried rice mixed with chicken gravy. This time around ordered paratha and chilli chicken. Paratha was fine but the chicken had a strong taste of mixed pickle. I am not coming here again."], ["Jamie L.", "I've been here three times, and I think because I live just up the street I keep hoping I'll like it more than I do. The truth is the food is fine; it's nicely presented and consistently prepared, but it just doesn't wow me. Their naan is more charred and crisp than at other places and it makes a nice change. But the service is pretty spotty. The servers are very friendly, but in three visits we've had multiple order mistakes each time. One person got lamb instead of chicken, one spicy dish instead of the medium that was ordered, never received tea after asking for it several times, etc. I just think there are more interesting Indian restaurants flavor-wise and more reliable service elsewhere, so I probably won't be back. But I wouldn't discourage anyone from trying it either."], ["Miriam N.", "What a great,authentic Indian place.  The food was fresh,beautiful presentation and great taste. It makes me never to go to a buffet again.  I wanted to know what others were having delivered to their table, it looked so interesting."], ["Cory K.", "Probably the best lunch buffet around and there are several options in the area.  The staff is friendly and the prices are great.  Indian fools is less about the looks and more about the flavors.  They have this spicy red chicken dish that is fantastic. Be prepared to over indulge, but it's worth it."], ["Sid S.", "Another over rated indian restaurant. The ambience is boring . Food tasted good but horribly spicy."], ["Leslie S.", "LOVED! Great service and the lamb rogan josh and chicken vindaloo was AMAZING! I also loved that they had \"Bollywood\" music videos playing for something fun to watch and talk about!"], ["Christina M.", "Maybe we've been spoiled by having Indian food in the UK, but we thought Touch of Asia was pretty bad. The food was WAY over salted, a gross error for any restaurant. But both our chicken dishes contained only bad tasting dark meat. We know some Indian recipes call for dark meat, but not what we ordered. The curries were also more dry than they should have been, and the spice blends just tasted off. I am not Indian or Pakistani and I can make a much better curry than we had at this place, using Jamie Oliver recipes.  The rice, papadums  and naan were good, but those aren't the big indicators of a good Indian. We were extremely disappointed. Won't go there again, for sure."], ["Vaibhav P.", "They have the worst indian food. We ordered chicken tikka and found a long steel wire in curry. They replaced the curry but was a big turn off. Never going to this place again"], ["Anna V.", "Review for lunch buffet:Samosas, beef and fish curries, gulab jamun, oh my!!! It's a small buffet, but the food is good and service also very attentive"], ["Elizabeth T.", "I received the worst service when I visited with my 3yr old son. The service is slow and inattentive, there was only 1waitress who was also handling the cash register. After a almost 25minute wait for drinks with a toddler I got up and left. I called the owner after and he was not apolologetic at all. I am frequent customer for take out chapati for over 5yrs now. I will take my business elsewhere."], ["Lance W.", "I've only been here on special occasions where the owner prepared a special menu for my party, I really like Touch of Asia.  The flavors here are very similar to the cuisine I've had on my business travels to India.  I really like the crispy naan at Touch of Asia, a pet peeve of mine is thick, doughy naan.The minced lamb samosas with mint chutney are a great way to start any Indian meal.  The chili chicken, biryani and tandoori chicken are some of my favorite dishes.The service here is very attentive, I've always had great experiences here.If only they served jalebi for dessert!  I might kick it up a star!"], ["Stephen H.", "Lunchtime buffet is easy and simple and delicious.  They really nailed the kheer. Took a friend here who works nearby but never gets asked out to eat Indian.  We had a great experience."], ["Youshi P.", "The bhel puri and pani puri from the chat menu are outstanding.  The ambience was great with good service."], ["Lucas H.", "Very good indian food. A little off the beaten path and I wouldn't have found it outside of yelp. Services was great and very friendly. I would definitely eat here again."], ["Marie B.", "Always enjoy stopping here while in the Overland Park area. Had the lunch buffet for the first time today. Small but nice selection of traditional dishes."], ["Stephanie P.", "How can a lunch buffet that was 'supposedly' freshly prepared, taste like it's a day old?  I was just unimpressed with everything from start to finish.  There was no greeting at the door; we were shown our table and given water and had to ask for soda/tea after a while.  The buffet was small and dingy.  The items I chose (in which I will not attempt to spell) were extremely disappointing.  I had chicken tikka, a cauliflower and potato dish, a curried vegetable dish ( which was so slimy I couldn't eat it), and some burned to a crisp naan.All in all, I thought everything was below average especially since they charge $9 for a lunch buffet.  The one thing I really enjoyed was masking the burnt naan with the spicy mint yogurt sauce."], ["Ben C.", "This is simply the BEST Indian food in all of Kansas City! The decor is so-so, the service is average, but the food is amazing. For months I went here at least once a week and even now try to make it at least monthly. If you like Indian food, then you should try a Touch of Asia, you won't be disappointed. My wife always get the aloo palak and I'm addicted to lamb korma or chicken achari..."], ["Austin K.", "This place has a small lunch buffet that generally is very solid. The food is fresh and fragrant towards the beginning of the day but gets worse as the day goes on. I like to go there first thing so that I get the freshest stuff. My only beef with Touch of Asia is that the price keeps going up! Lunch buffet is now 10 bucks which is not terrible, but it seems to go up .50 cents all the time.I also highly recommend the Thalis that they serve on the weekend.Check it out! (It's a good place to go if you don't want to be bothered at lunch)"], ["Elaine D.", "When I find myself running an errand in OP on the weekend, I'll sometimes stop in at Touch of Asia for lunch.  Pleasant restaurant, very good service and I've never been let down by a meal at this place.  I usually order the vindaloo, if you like spicy, hot foods, I highly recommend it!"], ["Jamie C.", "Was impressed with their food. Ambiance is a little lacking so I wasn't sure what to expect but it was actually pretty good. Lunch buffet was a good way to try several dishes."], ["Chaz G.", "Indian food on thanksgiving goes hands in hand with Chinese food on Xmas eve. And lemme tell you. This place was pretty solid. The idli we got as a starter was pretty good. And all the dishes that followed were just as good. Paneer. Bartha. Biryani. Oh yeah. I hate how most places white wash the food by cutting down on the spiciness, but that wasn't a problem here. Happy thanksgiving"], ["Marie F.", "My Indian friend Tony took me here once... I miss Tony.  Let's not get bogged down with sadness though... let's talk about the good stuff.I don't know correct food terminology and I'm not going to fake it....  Call me unrefined, I don't care.  I will use descriptors to name the food.  No offense intended to anyone.So they have brown sauce with taters and brown sauce with meat (goat). Both are pretty tasty.  They have the red chicken which most people are familiar with... a tater square with stuff in it (the stuff is good but just dip it in a gravy or a sauce and it's even better).  All the curry gravy is good.  Well everything is good.  I'm a rice pudding fan and I think it's important to have it when you eat something that is sorta spicy.  These guys have something I haven't found anywhere else though: Squishy pancake balls. They soak these pancake balls in a vat of hot syrup and when you bite into it -- it gushes syrup!  Now, I've only ever been to one other Indian food place... so it's not a good population survey but I can safely say that the other place DID NOT have these.  I know, I looked.  It's a buffet (for lunch anyway) and it seems small but they keep the food well stocked and there is actually a good variety of food to choose from.  The price has gone up, but what hasn't?  The server was quite nice and kept our water filled and our plates cleared.  You pay at the register in the back and he was kind to use as well. You can walk in - claim a table - eat until you are sick -watch Indian music videos - pay and be on your way within 30 min or less.  So, don't be afraid to go on your lunch break."], ["Jeffrey A.", "Touch of Asia was one of the first Indian restaurants I visited when I moved to the KC area back in 2007, and it has consistently been my favorite of what I would call the \"big 3\" Indian restaurants my friends and co-workers typically visit (the other two being Ruchi's and Korma Sutra).FOODI can't say I've ever had a bad dish here, but there are two that really stand out from the rest: their tikka masala and the weekend thalis specials.First off, their chicken tikka masala is my favorite version of this dish, and not just in KC. The sauce has a really nice flavor that isn't overwhelmed by either the tomato or cream, the chicken has that great dry tandoori quality to it (that I love), and the spice levels - even if you order it hot - isn't overwhelming, but instead tends to build in intensity as you eat more.On the weekends, they do thali specials - one vegetarian and one non-vegetarian - that lets you sample a couple entrees, a selection of sides, rice pudding, some sauces, and a samosa and naan bread, all for a decent price and - if time is an issue - relatively quick turn around. I prefer the vegetarian option as I'm rarely in the mood for lamb, although the non-veg version always has their excellent tikka masala as the chicken dish.Their basic naan bread is probably my favorite in KC, although Korma Sutra and Ruchi have good bread as well. I believe I've tried most of the appetizers, and they've all been good, although I think Korma Sutra's appetizers are a bit better overall.As for other dishes, again, they've always been good. My friends prefer their butter chicken over other restaurants, and in my opinion their rice is really good, close but possibly a little better than even Korma Sutra's. And when I'm not ordering the tikka masala, I'm usually ordering the tandoori chicken or the chicken tikka (e.g. the tikka masala minus the sauce). Both are great options that I usually get if I'm not up for the heaviness of the masala.During the week they have a buffet. I've only been there once, and remember it being good if a bit small. However, I'll defer to others with more experience to judge the weekday buffet options.BEVERAGESI basically stick to water whenever I do Indian - I don't want my drink to distract from the wonderful flavors, and fresh water always taste better when you're indulging in a little spice.Judging by the bottles behind the cash register, they seem to have a decent selection of alcohol, but again, I've never tried any and can't really say how it compares to other restaurants.I have had their mango lassi, which is good.SERVICEThe service is definitely top notch - the servers tend to be quiet and keep your beverages refilled but otherwise \"stay out of the way\". As such, their service is different than Korma Sutra's, where the owner is very engaging and even entertaining.Which is better is personal preference. Personally, I like both. There are times where me and my party really enjoy the engaging environment of Korma Sutra, but other times where it's nice to have the much more relaxed and quiet environment of Touch of Asia.If anything, the slight edge (for me) goes to Touch of Asia in this regard, because it really does feel like your neighborhood Indian restaurant, where the owner recognizes you, you get familiar with most of the servers, and you can just relax without having to worry about a seven-course entertainment for the evening. :)OVERALLAs I've said, I love Touch of Asia as it is basically a consistently good place for Indian food in a low-key setting. I've done plenty of take-out from them, but it's a fantastic place to get together with friends and spend an hour or two over good food and conversation.It may not have the buffet options of some places, or the engaging style of service of others, but it really is a fantastic restaurant in its own right, a nice neighborhood joint that's great for a weekday night meal with friends or family."], ["Graham G.", "I've been a fan of Indian fan since my youth, introduced to it by my Dad who loves Indian food. I didn't experience truly great (westernized) Indian restaurants until I lived in England, where Indian food is king.My work colleages and I regularly visit other Indian restaurants in the area for lunch. Namely Korma Sutra and Marsala's, I'd been trying to convince them for sometime to try a Touch of Asia, today we finally did.Prior to today I had eaten at this restaurant once, about 3-4 years ago, after enjoying a great lunch buffet, I'm puzzled why it didn't become a regular after that first visit.When I saw Samosa on the buffet I was sold, it's one of my all-time favorites, although on a buffet they're often not that good. These on the other hand were very good, better than some I've had cooked to order.In addition to the Vegetable Somosa, they had a good range of dishes available with something everyone should enjoy, even those who are not familiar with Indian food.Each dish we tried was flavorful and the meats were very tender, something you don't typically find on a buffet. Both of us were very impressed and have vowed to return on a regular basis.The service wasn't quite as attentive, even though it was quiet, as that of Korma Sutra, who's service is unsurpassed and can't be beaten on the little extras they provide. The Naan was a little disappointing too and took a while to arrive at the table. These minor flaws were more than made up for by the excellent food!"], ["Madelaine G.", "Food was good, service friendly and attentive. I had Chicken Tikka Masala (medium) and the spice level was perfect. They can do really spicy food as well. Some of the other dishes I tried weren't the best... Naan was good. If we lived closer, I'd definitely try the buffet."], ["Elyse N.", "I had my first Indian experience elsewhere, but I this was my family's Indian place back home.  I make sure to visit TOA whenever I'm back in KC.  No place I've found in California makes pakora the way they do.  I could eat their pakora daily as long as I had plenty of their delicious mint chutney!  Have only had their buffet once years ago, we normally get the same few items to share every time we dine in.  Their garlic naan is not the best I've had - I prefer large pieces of garlic with a soft roast texture and theirs is minced and cooked to a crunchy texture.  My brother calls their chicken tikka masala \"chicken with heaven sauce.\"  I love their daal mahkani.  It sounds heavy when you read the description of being \"simmered in butter\" for hours, but those scrumptious lentils don't taste like the fattening dish they likely are.Their papadam has a nice peppery spice to it and they are always crispy.  I wish the samosas were a tiny bit spicier.  I generally like Indian places that let you pick your spicy level, but I've never walked out of Touch of Asia unsatisfied.  Get the gulab jamon for dessert.  Warm balls of honey soaked goodness!"], ["David G.", "Been here several times and love it.  I've been getting to-go from them for quite some time.  Wasn't too impressed with their buffet the one time I got there during the day - the choices were pretty limited.  However, I've never been let down when I've ordered the regular entrees.  If you're eating with friends, definitely get a couple things and share them around.  I've loved the chicken korma and vegetable korma, the tikka masala and pretty much everything from their tandoori grill.  The malai kebabs were awesome. Definitely recommend giving this place a try."], ["Kelsyn R.", "Touch of Asia is a good standby when my regular Indian place is too busy or I have eaten there too many times in a month.  The buffet is good, not great, but consitently good.  Surprisingly, ordering food off the menu is not really much better, which I find unusual compared to most places.Buffet is small, and the selection is fairly standard every time, which is good if you like predictability, but bad for encouraging you to come back frequently.  Not great, but solidy good, and with all things taken into account, I would rate Touch of Asia in my top 5 for Indian in KC.  This is as much of an indication of the rest of the field as how good they are."], ["Judy R.", "Best Indian in KC! The lamb korma is phenomenal and so is the chicken tikamasala. It is a small restaurant and they work very hard to make you happy. You will love it!"]], "Taj Mahal": [["S a.", "What else can I say????  BUTTER CHICKEN.  So creamy and flavorful!  They are generous with the chicken.  Veggie samosas.  Garlic Naan!  I like this place so much better then Korma.   It is quieter.  Usually busy at dinner.  And the service is MUCH better.  It isn't anything fancy and quite frankly I don't want it to be.  The staff is friendly and remembers your face.    See you guys soon!!!!"], ["Stephanie C.", "Food - Entrees, rice and nan were just ok - tasted authentic...well, just the way McDonalds tastes authentically American. The condiments and dessert rice pudding was above average. The food was still much more authentic, tastier and cheaper vs. Chai Shai (I don't get the appeal of that place). Wine is cheap $4.5 for a pour of Hob Knob Pinot Noir (I don't get this about Indian restaurants - wine is always so cheap!)Ambiance - Dingy yet comfortable -  the dinginess didn't bother me much. I'm not looking for flashy, modern decor from my Indian restaurants. Although I did wonder if in a prior life the space had been a local watering hole:)Service - The servers honestly looked put out by the fact they had to serve us. They did keep refilling our water glasses but that was about it. Told the waiter we wanted to order and he took his good old time to come back, had to get up to pay our bill, and just an overall miserable/depressed attitude of the servers. Only 3 tables they had to serve - so being busy as an excuse doesn't work. All in all. It's ok. I'm not planning on coming back and going to make the haul to Indian Palace down south where the food is delicious and they are happy to have our business."], ["Chris M.", "Tasty sauces, but the meats could use some trimming.Let's get right down to it: Indian food rocks, and even an average Indian experience is satisfying. Five of us were seated at a table that was probably not big enough for all the dishes that would soon be presented, but like clowns in a clown car we made it work. I ordered the Lamb Vindaloo (delicious and spicy, but the lamb had some fat and/or ligaments that I wish would have been removed prior to cooking). I also sampled the Chicken Tikka Masala, which is probably the most popular dish among non-Indians. It was tasty, and the medium spice level was probably a little hotter than some might prefer. Again, the chicken breast could've been trimmed better, as there was a little of what I would assume to be rib meat pieces. The rice that came with both dishes was very good, but they only have one type--basmati. They have plenty of naan options, and the garlic naan we had was delicious. Service was better than average. They offer a buffet at lunch, but I recommend going in for dinner so you can have something prepared to order."], ["Jen P.", "Love this place for a lunch buffet when I'm in the area.  Buffet has plenty of options and it's what you would expect from a typical Indian cuisine buffet in the KC metro."], ["Jess J.", "Very flavorful, great portion sizes.  If ambience is a huge deal to you, it might not score crazily high, but as long as you don't go in expecting anything fancy (and in a Waldo strip mall, why would you?) the smallish, dark-ish, and slightly dated interior shouldn't be too offensive.  A bit of the seating is booth, which really doesn't work all that well given the fact that Indian food is served in numerous containers, so if you have, say, 4 people, it gets crowded.  But the food is pretty tasty.  I generally go for vegetarian and chicken entrees when ordering Indian, and have not been disappointed (their chicken korma is particularly flavorful, I think, and generously portioned). I also think their vegetable samosas are better seasoned than many I've had, and the usual trio of chutneys and sauces for papadum are great.  My husband likes goat, and gets the biryani, but to me, you end up with a plate of bones and not a lot of meat for your efforts.  I've seen this at various Indian restaurants, though, in terms of goat, so I don't think it's a Taj Mahal thing, by any means. I've never had the lunch buffet, so I can't speak to that, but all menu items I've tried have been great.  The naan is wonderful, all varieties.  Service is good, too, very nice people. For a casual dinner, it's well worth it. My husband works in the area, and would definitely have him pick up takeout to bring home for dinner, too. Great stuff."], ["Whitney J.", "A really nice place. Great food! And the buffet is an excellent deal!!! Been here several times and I am never disappointed. The service is always excellent and the food is always amazing. Glad to have a wonderful dining place close to home. Take a chance to try them out!"], ["Tracy L.", "OK, so we love Indian food and we have eaten at just about every Indian restaurant in K.C.  We always find ourselves comparing their food to Taj Mahal!!!  Taj Mahal may not be new, fancy, flashy, trendy but it is consistently the best Indian food in the area.  Everything is fresh especially the paneer and they have the best papadum hands down.  We have never been disappointed with a meal at Taj Mahal.  The staff is friendly and helpful whether you are picking up a to go order (which by the way they are very generous with portions, rice etc.) or dining in. I also love that when you order your food spicy, it is SPICY!!"], ["Brianne L.", "I'm new to the Indian food fan club. Mostly because when I eat it, I have to be at home.... close to the toilet.I'm not ashamed. Anyway, I've only had their Chicken Korma and Naan to go, but in my experience, it's a lovely place. It's smaller and the staff is great. I've had encounters with their staff when ordering and picking food up. They are kind and helpful. The food is great, in my short life of eating Indian food. This is my go to place for my Friday night Me-Dates. You heard that right; Me-Date."], ["Susan C.", "Cozy little joint tucked in a shopping center in Waldo. Go for the garlic naan...it's absolutely huge and you'll have plenty of leftovers with your meal to last you a couple more days. They also bring out various dipping sauces - always a treat."], ["Eric B.", "Although Taj Majal is located in a fairly ugly building and parking lot, we love the restaurant.  The service and food are excellent. We usually get Chicken Tikka Masala, plain naan, and an appetizer of either vegetable pakoras or coconut soup."], ["Dwain C.", "If you're a fan of Indian food, for the price you cannot go wrong with Taj Mahal. We eat Indian food several times a month and have a few choices close to the same distance away. Consistently we find ourselves going to Taj Mahal. The staff is friendly and the food is good! I usually have the lamb korma. I've noticed over the years that sometimes the sauce can overpower the flavor of the meat. I have yet to have this happen at Taj. Overall, well balanced flavors and spice with good naan! The thing that separates the 4star or 5star for me is that restaurant interiors do matter some when eating out. Their space is a little old and dated."], ["Amy K.", "This is for take out only. The restaurant opens at 4:30 pm for dinner. By the time I got there to pick up my order at 5 the door was still locked and an employee had to let me in. :He didn't smile. I paid for my meal. Left a 30% tip in cash. Which he took, turned his back to the jar to drop the money in. Never turned around. So I said \"have a good day\".  He mumbled back turned. Standing to the left was a creepy man, I'm unsure if he was waitstaff or one of the cooks. Just. Staring. So I left. Feeling a little uncomfortable and ready to eat my meal. The food was good though! Chicken tikka masala and garlic naan. The basmati rice was overflowing and delicious. They even gave me a small cup of rice pudding for free. Perhaps to balance out their awkward social etiquette!"], ["Dylan K.", "Delicious, Fair and friendly. 12 years I have been going here. I have traveled to over 40 countries. This is always the place, I dream of coming back to. Down right envious, when ever a friend tells me they are going. tried every place in 40 miles. that even hints at a tandori. I assure you, none of the others can make people from India cry, for its flawless flavoring.Tikka masala, bhuna, Roman Josht, saag paneer, eggplant pakoras and chai."], ["Gabriela D.", "I seriously don't know why this place is not #1 for KC on Yelp. It should be! The employees were friendly and the food was awesome. Easily one of the best Indian places I've ever been to. The lunch buffet was excellent and everything tasted very homemade and delicious."], ["Chandhra S.", "Bad indian food i ever had ... Even they took the plate before i finished !! The food looks like a stale !!"], ["Paige J.", "I love this place. The people are so friendly every time I go. I worked in India, so this food is like what I had. I love the goat and lamb dishes. Recommend the Goat or lamb Vindaloo or Goat Biryani. Samosas are great too. Haven't tried the buffet yet."], ["Joanne M.", "This place is great for your quick Indian food fix! Food was ready for pickup in less than 15 mins. Not fine dining Indian food by any means but they have a  decent chicken tikka and lamb jalfrezi. Meat samosas were a little over fried and the tamarind sauce wasn't thick or sweet enough. Overall I'd def eat here again when I'm too hungry to wait for food to cook!"], ["Melisa V.", "Craving Indian food a few nights before Thanksgiving, we decided to try Taj Mahal for carry out. For three of us (plus my toddler son who we thought would just enjoy a mango lassi) we ordered plenty of food: Mango Chicken, Baingan Bhartha (eggplant), and Chana Masala (chickpeas), plus Papadum and Naan. They were all pretty good with the Mango Chicken probably being my favorite. I thought the eggplant dish was a bit greasy. My son even asked for (and enjoyed!!) the chickpeas with his mango lassi!Overall, I thought the food was good but not good enough to rush back. There was NO ONE in there at 6:30 on a Tuesday evening, though there were several other carry out bags on the counter. Plus, I didn't find the people at the counter where I paid very friendly.Maybe we'll be back to try the weekend buffet, as long as we aren't the only people there!!"], ["Brian E.", "Decided to check this place out for lunch simce the lunch buffet setup would allow me to sample the largest variety. Overall the presentation was average at most. The selection was about 16 items, most of which was just generic Indian cuisine. Was hoping for a broader selection and honestly a better quality of items and presentation for the $15 I spent. It's about the only Indian cuisine in the Waldo area and it's fast, so if you want a quick lunch you can definitely get it there. Also since it's a buffet there's little chance you'd leave hungry. In the end though I'd probably only go there out of convenience rather than choice."], ["Cathy C.", "Hmmm, Seva in Liberty has a close rival now in Taj Majal, in a much cooler neighborhood. Taj has a wide variety of  choices on the lunch buffet, all hot and fresh and well stocked. There were at least two chicken and beef dishes, and many more vegetable combinations. My favorite had cabbage and potatoes with seasoning that was new to me. Nothing was terribly spicy, but the ones that have some heat had just enough. They bring warm nan to your table, and the buffet has a crispier version flavored with garlic and herbs. The mango lassis are delicious, but not complimentary like at some places. I saw several foreign-looking beers on display, but didn't partake this time.The service is very polite and unobtrusive, the decor is on the dark side, plush and cozy. We drove down here because of the 2-for-1 on my KCUR card, but even without that it would've been worth the trip. When a craving for Indian food strikes when I'm south of the river, this is where I'll come!"]], "Paradise Biryani Pointe": [["David C.", "I can't speak to the previous negative experiences of several customers, but I have been here several times and the quality has seemingly gotten better each time I've eaten here. The spice level is the best I've experienced in the Kansas City metro. Fresh, whole spices in every dish. Not over-salted like many other Indian restaurants in town. Aromatic and delicious. Additionally, the wait staff is unbelievably friendly each time my girlfriend and I have been in. Extremely polite, checking on us routinely without being overbearing. I can now say that we've become regulars."], ["Sathyaraj K.", "Food was good and mutton briyani was awesome. But buffet varieties was limited . Will visit the place frequently for briyani"], ["Audrey S.", "There have been several Indian restaurants (or maybe different incarnations of this one?) in this location over the past few years -- I hope this one stays! We went for dinner on a Saturday night and were very impressed. The mixed vegetable pakora was different than other Indian restaurants' version of the same dish (this was loose, almost like onion rings, instead of formed into little balls), but very good. The vegetable korma was the best I have had, we'll definitely be back for that! He was not thrilled that his chicken curry dish was on-the-bone, which slowed him down shoveling it into his face - but he also loved my vegetable korma. The portions are huge. I ate part of my vegetable korma, then took the rest home. The next day I made rice and a salad and the leftovers served both of us for lunch -- and he eats a lot. We're looking forward to trying the lunch buffet!"], ["Jackie H.", "Since moving to KC we have had the opportunity to try so many wonderful foods. This has been the best experience yet! Food was wonderful! Perfect for those that enjoy a bit of spice. If not there are also enough of the milder dishes to satisfy! Atmosphere was fantastic as well!! Beautiful surroundings with a calm elegant decor. All the staff were so kind and helpful!! We felt right at home.Must try!!"], ["Sonal K.", "4.5 star for food, and 3 for service and customer satisfaction. the food was good. we ordered paneer butter masala, malai kofta, and veg biriyani. The food tasted good, but their Naan was ok. Food seemed to have a lot of color in it. Quantity is ok for the price, taste is good, but the service was on the bad side. Seemed like everyone was new and were tired and exhaused and just wanted the day to get over. Not blaming them, its a tiring job."], ["Daryl T.", "Had lunch buffet at 2pm when refilling is closed at 2:30pm. The food was exceptionally fresh. Very rare among Indian restaurants at Overland Park where they do refill the food very fresh after 2pm. I want to commend Alekhya , server Nandini and chef Joseph for making multiple table visits to me and other people in the restaurant. They make food very satisfactory . Highly recommended if you are looking for Indian food."], ["Kiran R.", "The curries are worst here now.before a couple of weeks this restaurant was exceptional in delivering great taste food. Now i cant find difference between the colours and tastes of each curries..overall biryani was good like before. U guys should think of curries as soon as possible."], ["Gabriela D.", "Literally sitting right in this b. So good. So so good. I'll be here this weekend for the buffet. Dosa... oh man."], ["Beth A.", "I come into Paradise Biriyani quite often for their to go lunch buffet, and I have never had a bad experience. In all honesty I did notice the change in quality over time as other viewers have mentioned. However, I continue to come back not just because the food still tastes great, but because their staff has always been incredibly friendly, helpful, and attentive to me. Their customer service is truly exemplary, and I have always felt welcomed and valued as a customer. I always look forward to my delicious lunch when come in for a visit, and I would  recommend them to anyone."], ["Venkat T.", "I went with 4 of my friends to have a good buffet. Food was not up to the mark and the appetizers served was not fresh. So I called the waiter to inform about the quality but he was irresponsible and not even interested to listen to our words. Servers are reluctant to take care of the items in the buffet to refill appropriately. I was astonished that the server charged different rates for eating different varieties in Buffet which is supposed to be the same for everyone. I had a horrible experience with the servers who are not friendly to customers. Poor management need some change."], ["Nithin N.", "Used to like it!Already started loosing frequent customers like me. Poor Management. Heard, authentic chefs got terminated and the biryani (which I used to love) is now being prepared by management, how mean!I have home-delivered full tray biryani recently paying $80 and I was told that the quantity would be more than enough for 10 people, we were 6 and just not enough! So sick of the management. We would like to have our old biryani flavor back please!!Coming to buffet, it's not at all worth with the number of items we have! Compared to many competitive restaurants nearby."], ["Chelsea S.", "The food is amazing and flavorful. The ambience is clean and pleasant. It's obvious everything is made fresh and in this world of short cuts, I appreciate that. The customer service is great. Come and enjoy, you won't be sorry! Try the chicken 65 and the mango lassi."], ["Salil G.", "Horrible food. Worst I ever had in overland park. Uncooked food and spices and I asked to see the chef and they didn't even responded to that even after asking thrice. It's like they didn't even had any full time chef available in the kitchen."], ["Jayan Karthik P.", "This is my second review and I gave 5 stars for my first review. Honestly over time the quality is going down! I got a togo of Paneer butter masala (medium spicy) and a vegetable briyani (spicy). The paneer butter masala tasted like it had 50% water (I could see water separated on the top). I have had this before and enjoyed this, but this time it was terrible. Half the briyani box had chunks of just white rice and there was very little masala. I hope they don't spoil the franchise name."], ["Brent K.", "spicier than most, it was a fairly quiet afternoon buffet, I can't say that it was anything special, though the Naan was brought out fresh, as well as a bowl of Biriyani, which was a nice touch.  slightly more expensive than other buffets.  the waiters & waitresses were constantly filling water and clearing plates which was nice as well.  that may have been because it was so empty.  personally liked Masalas which occupied this space before a little better.i got the goat Biriyani and it was chock full of bones.  it made eating it nearly impossible. boo on that."], ["Dhananjay C.", "I loved the Biryani here. Being from Hyderabad, I can tell you the flavor is authentic, though spicy for the American palette. The servers are very polite and attentive. I would have gladly given the place five stars had it not been for two things: 1. It takes a while for the Biryani to arrive. But that might just be the nature of cooking the dish right. 2. Something I wanted on the menu wasn't available at that time. I loved how they value and care for the customer. Good food and decent ambience make me want to go back and take some friends along."], ["Beatrice B.", "Would give zero stars if it was possible. Both times I ordered delivery they were over two hours LATE. Food arrived lukewarm at best. Every time I called for an update they asked me to call back 5-10 minutes later and on the very next call pretended to not have just spoken to me about my late order. Poor management, what a shame"], ["Anna K.", "This is really the place to go for good Indian food and great serviceI really love the way the waiter absolutely takes care of you and everyone there is on their feet filling up the buffet as neededGood variety of food as wellWe will go there again"], ["Kunal S.", "Update: Taking off 1 star because the quality of biryani is not consistent. Last couple of times, I felt the lamb was chewy and the biryani was very spicy. This place has undoubtedly the best goat biryani in KC! My another favorite is the Goat pepper fry. I hope they keep up with the consistency and I will come here again and again."], ["David B.", "I've been to this restaurant twice now - once for the famous Paradise Biriyani and then for the lunch buffet. I have to say, so far I'm really impressed with the quality of the food.Biriyani - Its has much more masala and flavor than biriyanis offered by other Indian restaurants, has very good chicken:rice ratio, is offered in 3 different spice levels and has enough quantity to make you feel full. 4/5. But its not of that \"mouth-watering\" quality like Oklahoma Joe's barbeque that you should travel 20 or 30 miles just to get the biriyani.Lunch Buffet - They have your standard choice of menu items, is a little spicier than other Indian restaurants and they refill faster than some of the other places I've been to. So far, the food feels fresh and juicy :) A+++ . Although @12$ (weekday) and 15$(weekend) rates, this might feel like the costliest buffet in all of Overland Park, it worth going to once in a while.But I'm keeping my fingers crossed. All the Indian restaurants seem to open great and then fall away in quality gradually. Take K.Kurry restaurant for example. So I'll update this review after some months to see where it stands..For now 4.5/5 (unfortunately Yelp accepts only integers)EDIT: I can't believe this, but they managed to TOP their already high standards so much that I'm upgrading my rating to full 5/5. They've reached a point where the system (buffet, carry out ) has been perfected and is seamless. The biriyani is now always at the same extraordinary taste level and is consistent everytime. My friends go every week to their place (traveling 15-20 miles) for their Chicken biriyani and/or Goat pepper fry. They have changed their buffet system to cater more to the needs of the customers. Now you can order any biriyani you want from your table (during the buffet), and they'll bring it to you. You can keep ordering any number of times, but trust me, you can't go more than one serving of Chicken Biriyani & one serving of Goat Biriyani.Speaking of biriyani, I just absolutely love their flavor. Chilli and Spice has been losing a steady stream of customers even though their standard is still the same. Can't say I blame them. To stay on top, you gotta beat the best :)Tip : If you want Indian spicy level, order the medium or the maximum level because to me the lowest level always feel bland."]]}