{"Brio Tuscan Grille": [], "Cafe Al Dente": [], "Ragazza Deli & Wine": [], "PizzaBella": [], "Pezzettino Italian Deli & Market": [], "Mario's In Westport": [], "Coal Vines": [], "The North End": [], "Jasper's Restaurant": [], "Cupini's": [["Ryan B.", "Pasta, foundation of numerous cuisines and college kids alike, is what sets this little Italian diner apart. You won't find Spaghetti-O's or Sysco bagged penne here. Oh no, Cupini's staff takes the time and effort to hand craft each variety of pasta they serve from scratch. Whether you're getting tortellini (and you ARE getting tortellini), lasagna, rav, or simple linguine, the freshest expertly pressed noodles will be making an your plate.I decided on the Chicken/Prosciutto Tortellini and a slice of margherita, but was fortunate enough to snag a sampling of the lasagna as well. The pizza, mid-crusted with a slight crunch and a nice bit of chew, was spot on. Thin, non-viscous, semi-sweet and herby tomato sauce, plenty of melty mozz, and nicely interspersed leaves of fresh basil sum up the well balanced slice of pie; in all honesty, if the rest of the options here weren't so good they could stand on the pizza alone.The quarter wedge of lasagna, with its alternating layers of tender pasta, ricotta, marinara and ground beef sauce, and mozzarella, was one of the best interpretations of the dish I've had. But, as great as the lasagna was, I stand behind my decision to order the tortellini 100%. The woven, twisting shape highlights the pasta in a way the lasagna sheet doesn't impart. A yielding, pillowy soft surface and resistant bite at the instant you cut through makes the freshness of the noodle evident. The perfect proportion of salty, almost bacon-like ham and tender chicken filling compliments its companion without overwhelming, and the cream of the tomato based sauce balances acidity and adds a nice silky finish to the dish.If you've never had freshly prepared pasta, Cupini's will open up your eyes to a new, Maruchan ramen, Chef Boyardee devoid world or magnificence that will forever put to shame your mom's spaghetti night. But is that such a bad thing?"], ["Natalie H.", "Pretty good casual place overall.  Quick and casual.What I would come back for over and over again is the tomato basil white pizza.  YUM!  The reason for my 4 star review!I also ordered the linguine with bolognese sauce and meatballs.  It was just OK. I wouldn't order it again."], ["Hoda S.", "I was craving Cannolis so we stopped by Cupini's for lunch. Sadly they told us they'd run out but the guy at the register made my day by making me a fresh batch right on the spot and helped me navigate the menu. He suggested the seafood ravioli and IT WAS OUT OF THIS WORLD. Super kind employees and the food is delicious. Certainly will be back for more."], ["Daniela G.", "Cupini's is one of our favorites, so much so that I get jealous if the boy gets it without me!  We've only ever had take out, but it has always been outstanding.  The very first time I wandered in I was looking for an actual deli, this was only a few month after I had arrived in KC and wanted to make a charcuterie plate for dinner.  Even though this place isn't a traditional east coast Italian deli, they were able to sell me meat by the pound and it was all fantastic.  They're homemade cold salads also lent the perfect acid for dinner.  There is so much to try, its hard to know where to start.  I'm a pasta FIEND, so that was a natural starting point for me.  All pasta is fresh (huge points) and the sauces are delicious! I'm a tomato sauce kinda girl, so I'm not sure about their alfredo/other creamy sauces, but I'm sure they're fantastic.  Without fail, we always get a few cannoli as well -- ahhhmazing!  While the shell isn't homemade (I've seen them take them out of boxes) the filling is delicious.  We've also bought their frozen items - all great!  Next time I've venture over to the other side of the menu and try a sandwich or pizza slice.  As far as I'm concerned, you can't go wrong with this place."], ["Don L.", "Nothing beats Fresh...Correction: Nothing beats Fresh and Delicious!This is KC, home of Burnt Ends, and Triple D has led me astray a few times, especially when it comes to Italian Food...but NOT to fear. Cupini's is crazy \"F&D\" - fresh and delicious.  \"Huh?\" was my typical response to people that say you can taste the difference between homemade pasta and boxed.  Not anymore. I ordered the popular Lasagna and it was dang generous and delicious cube of goodness.  It has multiple layers of pasta with meat in between.  I personally like lasagna with a little more sauce and this SAUCE was F&D. I also had the housemade Carrot Cake and it was 3rd best carrot cake I ever had!  It tastes homemade, but it has a complexity to it that's very professional.  Not too sweet, just enough carrot chunks.  The frosting has a great consistency that complements the rest of the cake very well. I would definitely come back and try everything on the menu. This is #47 on my quest to eat at all the Diners, Drive-ins and Dives in America!"], ["Daniel H.", "My coworkers and I came here for lunch and almost all of us had never heard of this place before.  This was one of those places where you pay for your food then sit down with a number on your table which would allow the food to be delivered to you.  Their menu had quite a lot of selection from pizzas to sandwiches to pasta.  I ordered the Chicken/Prosciutto Tortellini ($8.79) and a soda.  The description of the Chicken/Prosciutto Tortellini caught my attention and it sounded good.  I didn't know two of my coworkers ordered the same thing so I guess we were all thought the description sounded good.There were plenty of tables to sit at from one building to another and even in the alley.  The alley was narrow so if your group had more than 2 then, there would definitely be some re-arrangements of the tables which would end up blocking 90% of the alley.  The weather was nice so that was why we sat outside.  Our food slowly came out.  My coworker let me have his Chicken/Prosciutto Tortellini since he was already eating his salad and had food already.  The Chicken/Prosciutto Tortellini was good and the chicken flavor was a little faint to me.  The portion would be enough if you don't want to be very full.  I felt like the portion should be a little bigger but that's just me.I'll have to try and come back here again to try other things on their menu."], ["Marie F.", "Fresh pasta and it doesn't cost a fortune?!  I'll take it.  I had the chicken and prosciutto tortellini and my friend got the manicoti.  We shared a side salad -house, garlic bread, and a passion fruit mousse cake.  You can bring your own bottle of wine and they will open it for you.  They use iPads to take your order... isn't that futuristic?  It's a very casual dining experience.  Order at the counter and wait for your food to be brought to you.  The staff was very kind and pleasant.  Parking might be a little tough on a busy night."], ["Rachel H.", "Got take-out in a Saturday afternoon. Very fast and friendly service! I got the lasagna. AMAZING! I will be back for sure to try everything out!"], ["Sara D.", "My friend sent me a text saying: \"I would love to get together and catch up! I'm craving Italian food. You're the Yelp genius, pick somewhere new for us to eat!\"My friends know me so well. I did some Yelp research and this favorite site of mine told me that Cupini's would be a great choice for Italian. Sure enough, Cupini's fit the bill perfectly. I got there a lot earlier than my friends and they let me sit in there dining room and wait. I loved the ambiance the most. You feel like your dining in this cute Italian diner in the middle of Italy. The food came out super fast and that provided a high chair for my friend's baby. You get a free order to cheesy-garlic bread with a check-in offer!!They were out of silverware and a few other essentials on the drink station, but as soon as I let them know, they fixed it right away. Overall, not a bad, little place to eat Italian. The prices were very reasonable and I had a great time eating here."], ["Rebecca P.", "Me and my husband visit the KC area frequently for medical treatment often.  we visit this place almost everytime we are down and sometimes twice.   The pizza here is by far the best ive had in kansas in the 4yrs ive been here from manhattan to kc.  My husband is kind of a pizza snob,  being from jersey area he loves new york style pizza,  and he loves this place and usually always gets the pizza.  The crust is perfect, not too thick or thin, perfect amt of crunchy :-).   Everything is homeade including thier pasta.   There mediums are kind of small.  me and my husband generally share a large;  on mondays they have a special and sell pizza by the slices.Pizza is not the only good thing.  The salads are AWESOME.  the ceasar is great.  Just reacently tried there spinach salad and ate every bite (and they are perfectly portioned to where u can have a salad plus your meal,  the salads arent too huge)     I have also had one of there chicken totilini dishes with some creamy tomatoe sauce (forgot the name).  If you like italian or are looking for a good homade pizza go here.  dress is casual,  it is a family italian style restaurant.Oh!! and i for got to mention the desserts.  I always get is the flourless white chocholate mousse cake (sooooo yummy!!!!!)"], ["Sandy S.", "Delicious deli with quick service!  My family and I enjoyed a quick lunch with some yummy pastas and garlic cheese bread.  My husband had chicken and prosciutto stuffed tortellini, my daughter had chicken fettuccine Alfredo, and I had linguini with marinara and meatballs.  We will be back!"], ["Sebastian J.", "Two years ago I was going through a tough time in life. I went by and asked the owner if I could clean his parking lot for a sandwich. He agreed and I cleaned the lot and had an amazing sub. Now, I am living in Denver and have a great job and doing stand up comedy. I've always wanted to thank that man for blessing me in my time of need and being so kind. Thank you."], ["C P.", "Fantastic! Everything made fresh. Love their marinara, tiramisu, and of course the pasta. You can also buy their freshly made pasta to cook yourself at home. Would probably eat there every day if it was closer."], ["Kasi W.", "I don't understand why anyone would go to a chain Italian restaurant (i.e. Olive Garden) when this gem exists so close to home. Cupini's owner is actually Italian imagine that. They make their own pasta and sauces fresh in house which is way more than any chain restaurant can say. My favorite dish so far is the vegetable lasagna. They also have $5 lasagna night on Tuesdays which makes it even better. I can't wait to keep returning to try all their dishes though. Also, they're carry out option is super quick and easy as well!"], ["Carol B.", "Excellent food - the lasagne is divine. The service was fast and friendly and the food is very reasonably priced. Is it fancy? Nope. And it doesn't need to be. I lived in Chicago for 12 years and New York City for 18 years and Cupini's holds up to some of the best family Italian restaurants anywhere."], ["Matthieu K.", "Solid and quite authentic American-Italian. Ambience is ... about what you get @ most East Coast and Great Lakes American-Italian joints.  This is the food of my youth, served up well. All the crappy reviews complaining about the chairs or the AC?  Who are you people, go have a frozen meal out of a bag @ 0l1v3 G@rd3n.  Seriously ... This food it pitch perfect. Highly recommended if you are in the area."], ["Alexa M.", "Not enough food for the price. I had to order two entrees just to have enough for one meal and that was almost $30. I won't be going back."], ["Geneva A.", "Absolutely Amazing! Featured on the food network a couple of times. Unique dishes. Will not disappoint!"], ["Jason Y.", "I absolutely deplore the Olive Gardens, Johnny Carino's, Fazoli's, and Carrabba's of the so-called Italian restaurants. Therefore, it will take a whole lot of negative things to happen at Cupini's for me not to give them positive reviews. Sure, there are some minor nit-picky issues to be said about Cupini's. Then again, outside of New York, Philadelphia, or New Jersey, how many 5 star true Italian neighborhood type eateries really exist?Cupini's attempts to mimic that east coast type Bodega in one sense. But as you walk through the dark little corridor off to the side of the main food prep/ordering area you come upon a small dinning area that resembles someones living room in the Westport neighborhood that Cupini's is located. Dark and cozy interior with a lot of character. The food is the real star of Cupinis as one would expect. The pasta is absolutely fresh and delicious! When I say \"fresh\", I'm talking it's hand rolled from the dough all the way to the blanching/boiling of the pasta. Veggies are cut fresh. Sauce is homemade. Don't misunderstand what I'm saying, I have seen some canned/Sysco type ingredients in Cupini's. But for the most part everything is as fresh as you will find in Kansas City. Don't sleep on their sandwiches either. They are so much better than anything you will find at the chain sandwich shops. The one question I'm still trying to get answers to is whether the bread is made in house or brought in? The meatball sandwiches rival those in some of the larger metropolitan cities on the east coast. Their cold sandwiches are really good but nothing ground breaking.Back to the pasta.........I'm telling you right now this stuff just has a unique flavor and texture that is unbelievable. This includes their lasagna, cannelloni's, tortellini, manicotti (oh gawd!), and their seafood ravioli. The sauces are rich and not too salty. Not too spicy. Not too sweet. Right on point and consistent. Never tried the pizza. Will definitely be trying the calzone in the near future. I'm not a vegetarian but forgot to mention the veggie menu at Cupini's is very good as well. Some days you just don't feel like being a carnivore and Cupini's can take care of that.The real surprise for many people walking into Cupinis is the shear volume of baked goods available. Supposedly, all the baked goods are made in house. Hard for me to tell, but I do know what I've had are delicious.    OK, here are some minor issues. Prices aren't the cheapest in town for the amount of food you get. This is a situation of quality over quantity. Which is cool, as long as the food stays consistency good and fresh. Parking can be spotty on weekends. Heck, weekday parking along Westport road can be tricky sometimes. Me personally, I love the neighborhood. Others have issues with Westport. It's not a bad area and families are indeed welcome in the neighborhood. You don't have to be a 20-30 yr old party animal to enjoy Westport.Forgot to mention the servers at Cupini's are quite good at what they do. Solid 4 stars for the service at Cupini's. If you've never been to Cupini's, do yourself a favor and get away from the suburban Italian chain restaurants and give them a look. I'd be shocked if you're disappointed. Enjoy."], ["Cindy R.", "This little place throws you for a loop when you go in there.... not gonna lie.... The dine-in experience feels more like a food court rather than ambiance of a normal Italian restaurant.  With that being said, they just got their liquor license recently and sell wine and other beverages for cheap-o.  The meatballs are delicious and the lasagna was great too.  We've had the pizza and it's got the large hunks of Italian sausage and abundance of cheese, I'm a fan. Earlier this week, I called in a pickup order and they had everything I needed and more.  The recommendations of the staff have never steered me wrong (although the place is so good that I don't think anything would be a wrong choice).  The salad has fresh greens, dressing was yummy, cheesecake was decadent and they gave me plenty of sauce for the main dishes.I'd recommend it.  Plus, it was great to bring home and enjoy in my own comfort :)  Check it out!"]], "Cascone's Italian Restaurant": [], "Osteria Il Centro": [], "D'bronx": [], "Bella Napoli": [], "Lidia's": [["Chris S.", "We have been going to Lidia's since we moved to Kansas City in 2008 and have never been disappointed. Whether ordering ala carte from the menu or enjoying their fabulous Sunday brunch, the food is always consistent and delicious although a bit pricey.Antipasti (appetizers) range from $7.50 to $14.00 and include traditional favorites like \"frico\" (cheese crisp - $12.50), \"cozze\" (mussels - $12.00), \"arancini\" (deep fried risotto balls - $12.00), and \"pappa al pomodoro\" ( a Tuscan tomato and bread soup - $7.50). The frico, for example, is delicious with crispy cheese (usually a higher-fat hard cheeses like Montasio or Asiago) baked in the oven with various decadent ingredients, having originated in the Friuli region of Italy.\"Insalate\" (salads) are normally ordered along with the main course (secondo) when dining in Italy and are not \"meal size\" as you will find in the United States. At Lidia's they range from $8.00 to $12.50, but I cannot comment on them as I have never ordered one because, other than the Caprese salad - one of my favorites, you should not come to a restaurant like Lidia's unless you plan on focusing on pasta and meat/seafood dishes, which are quite filling.Ranging from $17.00 (canneloni) to $22.00 (pasta trio), the prices for their \"primi\" (first courses - pastas) are Lidia's \"Best Value\", especially their \"pasta trio\" which my wife and I have had on numerous occasions. This \"all you can eat\" medley of three pastas changes daily and includes three different pastas (fettucine, penne, ravioli, etc.), each with its own sauce (butter and sage, amatriciana, and other favorites). Servers come around with a large plate of each, giving you as much or as little as you desire so you can sample all three before deciding on which one (or three) you want more of. You can add a caesar salad and choice of dessert for an additional $13, but I would not waste my money and recommend enjoying as much pasta as you can eat instead. The meat and seafood (secondi) dishes are not cheap at $21 for the lemon chicken to $49.50 for the bone-in rib eye steak, but if you like a traditional Italian meal with antipasto, primo and secondo, you will not be disappointed ... but you will be bursting at the seams! Secondi at Lidia's, unlike restaurants in Italy, are accompanied by \"contorni\" (vegetables and potatoes), making a full meal if you prefer meat and potatoes over pasta. My favorite used to be their \"involtini di manzo\", rolled beef scallops with pickle, vegetables and mustard (a Northern Italian recipe), accompanied by mashed potatoes, but it has not been on the menu lately.Their wine list is extensive with nothing under $32 for a bottle (the \"Value List\" has a nice selection of reds and whites) and ranging up to as high as $495 for a bottle of Lange (2005) Gaja if that is your style. We have ordered from the value list every time we have been there and found the wines quite good and somewhat as the name implies, a \"decent\" value. They also have a full bar with drinks ranging from $9 to $34.We have not been there for Sunday brunch in several years, but it used to be an excellent value at $25 (now $29.50). Served buffet style, you can help yourself to a nice selection of antipasti and dolci (desserts), ordering a selection from a wide variety on main courses, including the \"Pasta Tasting Menu\", frico, porchetta hash, osso buco, and lasagna Bolognese among others.We have never been there for lunch, but looking at the menu it appears to be a decent value with meal selections reduced by $5 or so compared to the dinner menu and with sandwiches in the $12 to $13 range. Expect to pay a $100 to $125 for dinner for two, including antipasti and either a primo (pasta) or secondo, a bottle of wine from the value list, and a shared dessert (tip and tax included). We cannot afford to spend that kind of money every time we go out to eat, but for special occasions Lidia's Italy - Kansas City is a decent value with exceptional food, excellent service, and moderate prices.CombatCritic Gives Lidia's Italy - Kansas City 7 out of 10 Bombs ... More Bombs Are Better!"], ["Craig A.", "I expected such good things. Didn't get it.  Really average. Waitress was pretty fast with delivering food. But overall the food was not up to par. Definitely 4/10. Don't come here.Ambiance was nice. Tiramisu was pretty good. Wine is always a plus. Very cozy and the waitress was friendly and helpful. Food needs some work."], ["Cheryl B.", "I've never before had a dining experience so amazing that I am still thinking about it the next day!  I loved everything about this experience (yes it was more of an experience than just \"dinner\").  Our server was the absolute BEST a server I've EVER had!!!  If there was a contest for best attitude, knowledge of the menu and stand out service our server Wojo would win hands down!!!! The four of us decided to let Wojo plan our meal; I've never done this before, but felt confident that we would enjoy whatever she brought out!  We even let her choose our wine, which was a red wine made by Lidia's son!  It was so very good!  She brought us 3 different appetizers and an antipasto plate, the fried calamari and shrimp and accompanying red sauce was out of this world!!!  She then brought out fettuccine with veggies and shrimp, as well as penne with eggplant (my husband who is a pure meat and potatoes kind of guy keeps raving about the eggplant!), and ravioli stuffed with sweet corn with a butter sauce sprinkled with pancetta.  (Is your mouth watering yet?)She then chooses for us to have lemon chicken, prime rib and potatoes and lamb chops.  We mentioned that the lamb might be out of some of our comfort zones, but again trusted her and it was the best part of the meal!  Everything was served family style, so while it sounds like TONS of food, split four ways it wasn't so bad.  Since it was my friends birthday, Wojo came out with a birthday song playing on her phone, set it on the table and presented each of us with an amazing unique dessert.  I would recommend Lidia's for your next special event and please request Wojo!!!"], ["Erin D.", "I saw this restaurant advertised at the airport on the electronic signage at baggage claim. I am a huge fan of Lidia's because I watch it on PBS (yes, I still watch that station), and she pours her heart into her cooking. I was extremely surprised to see she has a location in KC; I am definitely not complaining! We went on a Saturday night and made a reservation about 30 minutes prior to deciding to go. We arrived exactly at 9:15PM, just like we had reserved! This restaurant is no more than a 15 minute walk from Crown Center where we were staying, including a brief look around inside Union Station. You can reach this restaurant through the walkways, going through Union Station, and coming out the Freight House Bridge. We were not dressed fancily. I was wearing an Adidas tshirt and skort; my friend was in shorts and a tshirt as well. We were traveling for the USA vs Panama soccer match (Gold Cup tournament earlier this month), so we hadn't packed any nice clothes. We were neither denied entry nor frowned upon; we were welcomed by staff with open arms (although, perhaps that was due to my excitement).The complimentary breads were fantastic. I loved the mini scoops of basil pesto and sun-dried tomato paste. Both placed in olive oil, the free appetizer was scrumptious and a sign of the night to come.I ordered the braised duck with gnocchi. Words cannot describe how fantastic this was! Both were in a stew, melting in my mouth. The texture was perfect. The flavor was divine! I could taste the tomatoes and imagined them simmering for hours to make this delightful dish. I could just picture Lidia herself in the kitchen, cooking and tasting to perfection. Oh, how wonderful this entree was!My friend ordered the pasta trio tasting, and this was mediocre to me. Although I liked the fusilli (had a kick to it), I was not impressed by the ravioli (like undercooked Chinese dumplings) or fettucini. Both lacked robust flavors, and I was glad I ordered the duck.I didn't think the entrees were that expensive for being Lidia's kitchen. My braised duck was $18 (does not come with a salad). I would return here again in a heartbeat!"], ["Bobby N.", "Sometimes you've gottaTREAT YO' SELF!...And that's what I did.  I was invited to dinner by my brother-in-law to celebrate my little sister's 35th birthday.  We had reservations for 7pm and came early to have a few cocktails at the bar.  I joined my party already in progress and sat patiently waiting for my turn to imbibe.  I'd selected an Orange Manhattan - Makers, dry curaçao I believe.  I waited.  And I waited.  Then I waited a little more thinking to myself, \"self - this is what those other yelpers made fuss about.  You totes knew it was going to be like this, so get it together and wait some more\".  And that's what I did.  And when my drink did come it was well worth every moment spent in drink purgatory.Our party was seated promptly at 7 and taken to a corner table.  My sister joked that she always ends up in the corner when they are there (about 2-3 times a year).  The server assistant staff where on their game and we were immediately greeted with water and bread.  They took excellent care of us the rest of the night.  They'd refill waters and bring bread like ninjas.  It seemed to just magically stay full.  Our server Jeff was a pro.  This was Saturday at 7 so no person in their right mind would go into any restaurant and expect not to wait for service.  Keeping that in mind, Jeff was right on time.  True customer service adapts to the customer's style and that's what he did.  He joked with us and really did enhance our visit with his banter.  And while me may just be a pro at it, he seemed sincere which I appreciate.  He seemed to care that we enjoyed our experience.  Now, on to the food!It was my turn to order, and I'm stuck.  Do I have the osso bucco, or the duck breast.  I don't usually order steak out since I tend to be underwhelmed but I did spy the ribeye.  Jeff says, \"alright sir, what about you?  Big ass steak?\" \"Damn,\" I said.  \"...Yeah.\"  \"Medium Rare?\"\"Hell yes\"\"Salad?\"\"Nah\"We waited and had another drink while enjoying the fritto misto.  About the time we started getting restless our food began to arrive.  My sister and her husband were served the pasta trio table side.  Our friends had the cabbage rolls and the cannelloni.  The pastas where tender and delicious.  Just enough sauce to enjoy flavor and the delicate pasta too.  No one heard about the cannelloni, but I did see a happy plate.  It was my understanding that the cabbage rolls were a bit vinegary, but again - I saw a happy plate.  My steak... Oh man!  Jeff must have known.  He must have known the right person was manning the grill and he must have known that a savory, tender and sumptuous steak like this is just what I needed.  This steak was exactly what a steak should be; perfectly seasoned, and uniformly cooked to the perfect medium rare.  It was heaven in every bite.  If this steak were a lover, I'd never leave or lay eyes on anyone else for fear of losing this steak's meaty affections.  Overall this was the perfect evening.  Maybe it was the Manhattans.  Maybe it was the steak.  Maybe it was the service.  Regardless, I can't wait to go back."], ["Stan S.", "During a business trip to K.C. we made reservations for Sunday brunch here. They have a set price brunch that although not cheap considering the venue we thought a good value. The brunch was just the right mix of foods and had enough options to make anyone happy. The service was excellent and at the end of the meal we found ourselves saying we needs to come back for the dinner next time we're in K.C."], ["Linda P.", "I want to say 3.5 stars for the food since my hubby and I got the antipasti appetizer of calamari which had shrimp in it and not a lot of seafood.  Then his meal was the Wednesday special braised beef short rib over mashed potatoes and a sauce.  Mine was the pasta trio which included fettuccine in an olive oil with sautéed shrimp on top, a fusilli noodle with a pork ragu, and a cheese ravioli.  Of the 3 I really enjoyed the ravioli the best then a tie between the pork ragu and shrimp because the pork ragu was your traditional red sauce didn't taste too meaty nor overpowering in flavor, just simple and something good for a kid.  The fettuccine was fresh made noodles with oil and a few shrimp, simple also and something you can make at home.  The one exception is that when you make it at home the noodles probably are boxed and here you can kind of taste that it was not from a box.  My hubby's beef was nice and tender and mashed potatoes went well, but I think something in the sauce gave it a little tart flavor which might have been mini green olives which changed the overall taste for both of us.  Pomegranate liqueur,  vodka, and ginger beer cocktail was decent but I enjoyed the limoncello drink more. Overall it was a nice dinner out with friends, quiet enough to have a conversation.  There was a largw party close by so that is an option.  You can also choose to sit inside or out in the patio.The pasta trio runs about $22 for an endless table side serving of pasta (if I wasn't with other people I might have refilled since I did enjoy the raviolli, but I couldn't so I can't say much about the refills).  The dessert menu looked delicious and I believe they were in the $12 range.Calamari was $12 and the special was about $22Food comes with fresh bread and 2 spreads today one was a bean spread and the other a pesto something"], ["Shawn B.", "First off the service was just OK.  We had to ask about certain things even though we told them we had never been here before.  We had no idea you could order from the main menu during brunch until we heard another server tell someone after we had ordered.  They did write \"Happy Birthday\" on my son's dessert plate and placed a candle in it.The butter (Apricot Jam Butter, Strawberry Jam Butter, and Crunchy Sugar Butter)  they give you with the brunch bread basket is ridiculously over sugared on all 3 choices.  It was seriously like eating a spoonful of sugar with your bread, complete with the crunching of sugar crystals.  They should offer a more traditional, non-sugared, option.  The Antipasti Table was pretty good, not sure it was worth the extra $13 over the Restaurant Week lunch price.We had the pasta trio option.  I wish they listed the different types on their menu so I could name them.  All I can say is the one with broccoli and fettuccine had way too much broccoli taste to it.  It was overpowering...and I like broccoli.  One was some type of cheese and pear ravioli which is quite good, albeit somewhat sweet.  Just a few of these go a long way.  The third was a tomato based sauce with a rigatoni pasta, this was the best one overall.  All of the pastas were fresh pasta that had a nice chew to it.Some things seemed bland, some things were not well balanced, but we were stuffed when we left the place.  I would go again...someday."], ["Deana W.", "This update is for the Happy Hour menu.Monday- Friday 4 -6 pm Bar and Patio$3 beers$4 mixed drinks$5 Grapefruit Cosmopolitan $5 Lemone, Lemone, Lemone$5 wine$5 small plates such as Arancine lobster risotto balls in a tomato basil butter, or Bruschetta with ricotta, broccoli rabe, and butternut squash.Enticing food and libations served in an elegant setting, at a fraction of the cost."], ["Marc D.", "We stopped in for a Saturday brunch here.$100 meal for two people.   I did not get the quality for the money spent.  Service was iffy.  started out explaning and welcoming great and then dropped off.   Drinks left unfilled. water empty.  I flagged a bus boy down for a refill of my wifes drink and (no offense against him) did not understand english enough to understand we were asking for a refill of her drink.He did bring back a glass of tea for her, but she was drinking a diet soda.  The meal began with a selection of breads and flavored butters.  these were beyond wonderful and a great surprise.the buffet factor was nice and okThe pasta was cooked a perfect al dente but the sauces were bland and left not much taste.My octopus was a bit overcooked and chewy.For the price of a brunch I should be wowed!!   I was not impressed.    The idea and ambience is there.. The food and service was NOT!"], ["WAJ W.", "Our anticipation of a great meal was unfortunately not met by the actual meal.   Busy Saturday but we were early in their evening at 6pm.  Even so, service was just a half a beat slower than it ought to have been.  The waiter was friendly to the point of being familiar...but we aren't familiar.  It seemed as though our place as customers might have been a bit taken for granted?  He politely steamrollered over my wife's stated choice--their signature pasta trio--convincing her to eat something else she would much prefer.   She didn't. The Bastianich family wines we tried were great.   The salads were ok, the gnocchi maybe the best I've tasted anywhere.   But within a half hour of finishing our meal,  I was almost sick.  Don't know what it was, but it was something. Even so,  we do want to try again and look forward to another try next time we visit Kansas City."], ["Ozzie L.", "To be honest this place is way overpriced for what you get. The food at best is mediocre, not much flavor pretty bland in my opinion. I I had the 3 pasta special, there was a pappardelle noodle, a bow tie and a ravioli. The ravioli was probably the most flavorful out of all of them and even then it wasn't the best. I will give them the pasta was fresh and cooked properly. What is the biggest downfall of this place was the service. When they brought out the pasta which was served from the pan, that I thought was a really nice feature. Two of the three servers splattered sauce on my napkin that had been tucked into my shirt, Thank God! No apologies, no nothing just slapped the pasta on my plate and took off. Our bill was $150 and to be honest if I'm spending that kind of money with no alcohol I expect amazing food and even better service. Let's just tell the truth, the only reason we came here was because Jack stacks had an hour and a half wait. My recommendation, wait the hour and a half at Jack stacks."], ["Chris L.", "I can't get enough of this place! Their pasta is always on point! The pasta trio option beats anything from any other menu. Constantly changing, always delicious, and keeps me coming back for more! Great service, great pasta, and spectacular atmosphere!"], ["Neeca B.", "So good you'll find the recipes to make at home, but it won't taste the same. It will be good and it will impress though. This is the kinda place you ask someone to be apart of your life forever. Where you make your big announcements, celebrate milestones. Don't do it  climbing a mountain or bungee jumping, do it with food and drink worthy of the moment. Yes, come any day, any day you want to make extraordinary. It's beautifully rustic, events here are so well taken care of. Ingredients fresh, menu always offers the best of what's in season. I think back to every time I've been and not once did I think it was mediocre because it was great.Do make reservations and do plan on once going for one of their annual events.  The bill probably will be $$$ so lunch or an event with a fixed rate is a good way to still experience Lidia's with out taking a second mortgage."], ["Kirk D.", "Service and food are amazing..............."], ["Diane O.", "Went to Lidia's first time last night with family members. It was a very memorable Dining experience - the atmosphere was complete with a big roaring fire, the food was tasty and filling, but most of all the service. Our waitress was Liz. She was very pleasant, attentive to our needs and very knowledgeable about the menu right down to the details. All I can say is she was excellent! We left there with full tummies and a big happy smile! A great way to kick off the Holiday season this year. I highly recommend this place!"], ["Sam A.", "How great is it that Kansas City has a place like Lidias?They recently enclosed their porch in a sun room which makes deciding where to eat difficult...do you sit in the unique sun room or do you sit in the main dining room and enjoy the art, chandeliers, design, and fireplace?Their food is second to none.  We ate a lot of pasta last night and nobody left hungry or unhappy.   I had the unlimited pasta.  I usually order that.  Tonight the pasta refillers who walk around were a bit slow on refilling the pasta but I still got as much as I wanted to eat and had leftovers to take home.Our server was named Rachel.  She was a fantastic server.  I was talking with my date last night about a previous server we had at a different restaurant and comparing the two.  Rachel was super knowledgeable...so was the other waiter.  Rachel was very efficient and attentive...so was the other server.  Rachel smiled and genuinely seemed to be happy at her job....the other server was very much the opposite.  That difference really made the night and made the dinner even more wonderful.  Rachel found great times to talk to us and was still efficient.  She didn't interrupt our conversation yet got our orders and answered our questions.  The other waiter cut in to our conversation mid sentence in order to get his job done. Can't wait to go back."], ["Lisa K.", "After an 8 hour drive from Denver with two kids we were ready to eat. We planned on eating at the BBQ restaurant next door, but the wait was 1.5 hours. We decided to check out Lidia's. The wait was a reasonable 20 minutes for a Wednesday night. We were greeted and decided to hang at the bar. After 15 minutes and still no drinks served, we started to wonder if this was the place for us so we talked to a group of locals at the bar and they assured us Lidia's was amazing and it was best to stay. The host sat us in the patio room saying the kids would like to see the train pass by. The room was loud and bright. There were lots of large groups seated. The host was very polite and kind and we thanked him for getting us seated quickly considering we didn't have a reservation. We were given bread and two dips on a plate of olive oil. 10 minutes later, we were excited to see our waitress. We were ready to order a bottle of wine and the mussels to get started. But she robotically rattled off the specials with disattachment and wouldn't even make eye contact with us.  I tried to ask a question, and she walked away. I stared at my husband in disbelief. I said, \"Was she really that rude to us?\" She continued to ignore us for another 10 minutes. The table of two next to us was equally uncomfortable. So we got up and left. We were grateful the host gave us a recommendation on where to have decent BBQ without the fuss. We would've stayed but the waitress was just too rude. She couldn't have made us feel any more unwelcome. Maybe she was having a bad night, or maybe its because we had children, but even 12 hours later I'm saddened by my experience at Lidia's because of her."], ["Mindy L.", "Note: my review is based on a PRIVATE event held in their herb garden/Loft space (not general seating in the dining room). My brother and his (now) wife held their rehearsal dinner at Lidia's. What a phenomenal experience.The food was indescribably delicious. We had three entrees to choose from (the pasta trio, Porcini rubbed tenderloin of beef or a fish entree). My husband decided on the tenderloin, which turned out to be impeccably seasoned, juicy and cooked to a perfect medium-rare. I went with the pasta trio which was served table-side, right from the skillet, all-you-can eat style. There was a pumpkin and goat cheese ravioli, a bolognese , and a linguini...I just can't even describe how tasty the homemade pasta was. Utterly decadent. The staff was loud, proud and motivated. The waitress running the show up in the Loft made instant friends with our raucous crowd. It was a beautiful event and a night to remember. Lidia's played a big part in making it such a success!"], ["Melissa F.", "I've been here twice now and have had the duck gnocchi and the pasta trio.  The pasta trio changes daily and Is always a unique combination.  The pasta is really soft and homemade.  I really enjoy how the sauces are either really light to let the pasta shine or are flavored really nicely with meat and seasonings.  There's a vast wine selection including a value section ($32) and flights.  The dessert menu looks amazing but I have yet to try it.  It's definitely a fun date night experience."]], "Dominic's Casual Italian": [["Tyler K.", "When I was younger I used to work at a mom and pop Italian restaurant and I always have enjoyed that feel. Regularly I'd ask my girlfriend to find a cheap Italian place we could enjoy some good food at. When we discover Dominic's we went and enjoyed it. The pasta was great (just had a spaghetti and meatball) and I enjoyed it thoroughly. The food came out fast, the place was clean, and the staff was responsive and polite. On another occasion I came right before close and they assured me that I wasn't a burden and that they're there to make us good food. I think that was really awesome as a previous restaurant employee. Definitely a good place to eat at if you want some decent Italian at a decent price."], ["Shelley Y.", "Popped into the Drive-Thru while out with my daughter today and got my first taste of Dominic's in over 10 years! Guess what? It's still yummy after all these years. My daughter got the alfredo sauce on shells. She loved it, but...when I tasted it I wasn't supremely impressed. It was thinner than any other alfredo sauce I've ever seen and it tasted slightly of chicken stock. Chicken stock...that was weird...anyway...I got the OBG sauce on angel hair and it was just like the good ol' days. What was truly wonderful was the PRICE. Getting a yummy lunch for 2 for around 10 bucks isn't just for McDonalds, people! We each got a half order of pasta, I got a side salad, and we got ice cold bottles of water. It was just enough food for us to get full and last until dinner time. When my Hubby and I last ate at Dominic's we had no kids. Now, we have 3 and I cannot wait to take them there!"], ["H P.", "Visited here over the weekend with my fiance. I had pasta with meat sauce and thought the sauce was amazing! My fiance had cheese lasagna with meat sauce, and he enjoyed it as well. We both had spinach salads on the side and one breadstick each.  We liked the ambience there and the music they were playing. The restaurant was very clean as well. We would definitely go back."], ["Dave L.", "Good,  quick,  pretty standard, Italian,  service on real plates and the server was the only one with a tray."], ["Jason B.", "Felt kinda like an upscale fazolis, but I was pleasantly surprised. Nice portion for the money. I think I would come back."], ["Joseph K.", "Went there from out-of-town San Antonio. Outstanding place to eat. The staff was friendly, very elegant loved it. Will visit again."], ["C M.", "Happy hour wine, Yes!  But I had to ask my food runner for it. Lasagna and Italian sausage was tasty. Needed to be hot instead of just warm.  No WiFi, bummer. EPSN on the TVs, OK BUT it's not a sports bar. Atmosphere music is too loud, it would be hard to have a conversation. Maybe I hit at the wrong time; but, a screaming brat kinda ruined the experience for me. The mom was oblivious to the effect of this child as she calmly continued to place bit of bread in front of him. People be aware that there are other diners.... I've been there, my daughter and I spent a lot of quality time together in restaurant PARKING LOTS while the rest of my party dined."], ["Stephanie W.", "My family loves this place. Amazing drive through food cooked to order with quality ingredients. And it isn't pricey. You can watch the guys cook, which is always a bonus to me. The whole menu is tasty, and there is a decent selection of alcohol. Any place that has soccer on while I eat is alright to me. Is kid and family friendly, yet great for people on the go. Dominic's is a KC treasure."], ["Donnie R.", "I tried this place with family members based on the reviews and location.  This was one of those occasions when yelp let me down.  Admittedly, I saw that the reviews were not great, but after eating here it was clear that the average rating should be much lower.  The first red flag was the drive thru, I should have turned around and found some place else at this alone, but I hoped for the best.  I started off with the toasted ravioli with marinara dipping sauce.  The ravioli were over cooked and very bland.  The filling was a mixture of cheese, none of which had any flavor.  The sauce that accompanied them was similarly bland and did not have the fresh bright flavor that one looks for with good marinara.  I then ordered the chicken parm sandwich.  Since I was not impressed with the appetizer I figured chicken parm was something that even mediocre restaurants can do right, but clearly this was not the case.  The sandwich came on a dried out sesame seed bun, which was odd and not good.  The chicken cutlet was very dry and tasted like it was frozen.  On the sandwich was a slice of partially melted processed mozzarella cheese, which was plastic like and terrible.  Somewhere on the sandwich was a dab and I mean a dab of the mediocre marinara sauce that was soaked in the dried out bread.  Our party did not even bother with desert as we were completely unimpressed with this restaurant.  The place is not worth the time and money, even with the coupons they give out liberally."], ["Lindsey W.", "For \"fast food,\" Italian - Dominic's is really good. Eggplant Parmesan sandwich was fantastic (I feel odd writing fantastic with regard to fast food).Only bummer was a side of chips (I feel like breadsticks would have been better and more appropriate)"], ["Diccon D.", "Love this place! Food is great! Service is fast! Calamari comes in strips. So I wasn't prepared for that and I can't say I was a fan. But everything else has been phenomenal."], ["Christine M.", "Mangia! Mangia! Mangia! Eat!, Eat!, Eat!  Bring your appetite when you come to Dominic''s!  For a \"fast food\" place or even if this was a little quaint deli, Dominic's is amazing!  Go big and get the full sandwich, not the small one, then you'll have something to nibble on for later.  I had the Italian Classic and I had it for lunch the next day too!  Go ahead and order some of their olive salad too and tell Domnic's to save their regular Lays for someone else.  My friend who orders from here regularly has about 15 bags of Lay's chips in her pantry...you won't be hungry for those after you eat your Dominic's!"], ["Angie H.", "This is a great place.  Their food is good, fast, and affordable.  Usually around $7.00-ish per plate, and breadsticks are free.  You can drive through, or sit down in their dining room.  It's a great atmosphere: although you can get a beer or daiquiri, it's calmer than a bar and grill, but some friends said that the 2 TVs and background music were nice \"white noise\" to keep their children amused during the meal with friends.  The decor is modern and warm--makes for a pleasant after-work sit-down, but not so fancy that you feel like you need to dress up.  We're happy that Dominic's moved into the neighborhood!Also, they have giant booths that can easily fit groups of 6, little nooks for 2, or countertops.PS--We especially enjoy chatting with Molly when she is in.  I like the lasagna and ravioli, my husband gets chicken parm every time."], ["Brandon G.", "This is one of my favorite places. Chicken lemonata is awesome.  It's quick and fresh. Love it!"], ["Rand E.", "Glad to see they opened a new location.  The food is still just as good as ever.  Nice spicy-but-not-too-hot sauce.  Portions seem smaller.  I get the large bowl of pasta and  I'm still a bit  hungry when I leave.  Their small and large bowls appear to be the same size but the large has a larger lip which makes it look bigger.  Doesn't seem to hold any more food, though.  Meatballs are wonderful.  The meatball sandwich was really good, too. I don't care for the decor as much as their old place.  It was more Italian style.  The new place is more trendy."], ["Charlie B.", "Love Dominic's!  Can't beat it for the price.. and they have a drive thru?!  Why even bother with other fast food?"], ["Chris F.", "Wish they had one in LA.. Great food! Sauce is Amazing and homemade Lasagna and steak sandwich are killer!!"], ["Chanda H.", "My family loves this place!  I love the chicken spendini bowl with lemonata sauce!  It is AMAZING.  My first experience there was through the drive through. I didn't realize they were getting ready to close.  I had to wait a little at the window so they could prepare my order and make sure it was fresh.  I was so impressed with how kind they were and did not make me feel like 'the last customer of the night' or that I was slowing them down from closing up.  The food was amazing, hot and fresh!  Our next several trips were sitting inside to eat.  Staff was friendly as ever and the quaint atmosphere was clean!  We love this place and recommend it to everybody!"], ["B C.", "I thought drive though Italian wasn't possible but this food is amazing. Chicken parm and Italian streak sandwiches are fantastic."], ["IReallyLikeKC I.", "They have excellent chicken spedini. I like it with the Diablo sauce - but watch out - it's hot!"]], "BRAVO! Cucina Italiana": [["Sam K.", "Good spot to hit up some affordable, reliable Italian food! Feels like you're walking into the courtyard of a countryside villa in Rome. Almost no booth seating, the bar and televisions were tucked away in a corner so the rest of the room stayed fairly quiet. Our server seemed a bit new to the job, over communicative and not too aware of giving privacy to me and my date; but in my opinion, it's always better to err on the side of over achieving. He kept our waters filled and the food and dessert came out fairly prompt.The food itself was nothing special--just tasty--and it was nice to be spending under 12 bucks a plate. We split three of the highly-reviewed dishes, all of which: Spinach, chicken and bacon pizza (I'd order it again!), Chicken Pesto Spaghettini and the Warm berry cake. I've heard the second location is better, but when it comes to one of these Italian chains.. (I don't think it matters!) Check it out!"], ["Gloria Li C.", "Tried my first lobster bisque, it's a little salty but definitely hits the spot if you are hungry for some soup! Their Burgers are good, french fries are delish, especially the home fries, they are not just any home fries but Bravo's specialty for sure."], ["Larissa T.", "Had a long wait and seated by the kitchen. I felt like I was on the set of Hells kitchen. Great food and worth the wait."], ["Tracy I.", "Have been here many, many times over the years. Hadn't been in a long time however, and we were bouncing from activity to activity and no time to cook a proper meal tonight, so we stopped in at Bravo! on our way home.First, the restaurant was sparse for a Monday night at 6:50 pm. No problem as I assumed we'd get our meals quick. (I was wrong about that.) Our young waitress was friendly and professional enough. However, the wait time for our meal was incredibly slooooooooow. I counted 4 other tables in the entire place with waiting diners. Two other tables were already done and were in the dessert phase. Why on earth did it take nearly 50 minutes to receive our dinner?? Totally irritating. We had two kids meals and two adult meals. And nothing complicated here either. We are talking basic pasta.The meals (once they finally arrived) were very tasty. I wondered if mine sat in the warming area too long though as my sauce had \"hardened\" a bit. I was so starving at that point that I didn't even care. It was almost 8 pm and I was past my hunger point. We had one meal that was split between two teens. It was the perfect portion for them. My meal was exactly the same size and was served in a smallish type bowl. I asked the server if this was actually a 1/2 portion and she said that it was indeed a full portion. (I think I finished it in 10 bites!) Then she said that she felt the portion is too small for that menu item. I would definitely agree. I've had that item before and Bravo! has definitely cut down on their serving sizes! It was almost like an appetizer. Definitely not worth $17 for that!! I will go back again but I will (1) not go when I'm too hungry (2) bring a coupon for a huge deal and (3) order a kids meal as it's the same portion size as an adults for a fraction of the cost!"], ["Jarrod V.", "Took my wife to Bravo the Friday before Valentine's Day for a nice dinner.  We had a very nice time!I booked a table more than a week in advance.  My wife and I showed up much earlier than the booked time, but the hostess checked us off the list and seated us immediately.  There were others waiting and they took care of us right away.  Very nice!We ordered the ravioli appetizer and ordered our entrees.  The server then brought some bread and oil for dipping.  The oil had a red color to it, which made me think spicy, but it was quite nice.  The bread had rosemary baked into it.  My only negative on the day was that the bread was a bit hard.  The ravioli was very nice.  It was served with a marinara sauce and a creamy horseradish sauce.  My wife loved the horseradish sauce!We then got our entrees.  I ordered a steak (Thanks Bryce T!) and it was wonderful!  Yummm!  My wife got the Braised Beef Gnocchi, which was on their specials menu.  The server said that it used to be on their standard menu, but for some reason, it was now a rotating special.  My wife loved it!Wonderful meal from top to bottom.  Bread was a bit hard and it was a bit loud.  That aside, we enjoyed ourselves.  Thank you Bravo! for a wonderful dinner!"], ["S B.", "Pleasantly surprised! The bf and I went for dinner, shared the brussel sprout salad and the sausage/pepperoni/banana pepper pizza. Atmosphere was nice, however would have preferred better music than Sheryl Crow and a few other weepy sounding artists. Salad was okay... It tasted alright, but looked as if it had been prechopped and sitting for some time before being mixed with the brussel sprouts, nuts, and berries. Besides the salad and music, the pizza, drinks, bread, oil dip, and service were all fantastic! Will be sure to try it out again."], ["Jon A.", "Great patio on a nice night.  They are busy, so have ressies or expect to wait. Pizzas are great - prices are very fair and the service is great. Sit outside on a nice night - it's worth it."], ["Patrick Y.", "Excellent service and quality of food is great. One get a decent amount of food for the price you pay therefore you should come in hungry. Although it's a chain establishment...Bravo does a good job"], ["Vanessa G.", "This is a chain but it is great food and great atmosphere. The free bread is ok. Entrees are good for the price - I got the lobster ravioli and loved it.But what got me was the dessert. The creme brule and the chocolate mousse... wow.Loved it. Service as great I have no bad thinga to say but it isnt a unique fond its safe."], ["Brenda D.", "This is great Italian food. I love the location. We love their happy hour menu with smaller bites and even smaller prices! The flatbreads are awesome. My fav is the mushroom. The shrimp...omg....not a good diet choice but if you are going to indulge, this is the way to do it!  I think I snuck a few more than hubby.  All around YUM"], ["Jill H.", "A big, beautiful room overlooking a lovely courtyard...with lackluster food and un-movitated servers or management...all for a pretty penny.We went for my daughter's 13 year old birthday; 6 teens all dressed and excited plus a dressed up parent.   And were summarily ignored.   Add to the slow service not enough place sets, no bread refills and dirty water glasses.   Save your $$ and spend your special occasion... or no occasion somewhere else."], ["John S.", "Not very crowded on Thursday night at 6:30 for dinner. New server Joseph is giving us his best. Special Tomato soup is superb, hot bread with over-flavored oil was good. Nice decor, outdoor seating in great Zona-Rose neighborhood. Bolognese was very good, meat balls very good. Only tried meaty dishes tonight, though several vegetarian choices. Typical Italian fare in a bit upscale setting reminiscent of Brio chain. This is a good restaurant, decent pricing, large pasta portions you can share unless you are a gig like me, excellent service and I'll be back."], ["L R.", "Ate dinner here last night and our food was fantastic! The hostes and servers were very friendly. It did appear to be understaffed as we waited quite awhile before our server checked on us, drink refills, etc... Nice atmosphere!"], ["Bryce T.", "Who orders steak at an Italian restaurant? I did and the 5 ounce medium rare steak with a Gorgonzola crust was incredible.We came in from out of town and had great service. It was really busy so we ate at the bar.   In fact it was so good that a friend and I ate dinner while we were waiting for another friend to arrive at the airport. When we were done eating we picked up our other friend and brought him back to the same restaurant. It was that good. While he ate we ordered dessert that was incredible as well."], ["S S.", "The food was exceptionally good. I had the grilled salmon he had the filet mignon. The service was above par. We requested seating outside to watch the bands play in the square and were seated right away. They were close to a five star BUT they don't have a good selection of beer  (ZERO beer on tap), the server was not knowledgeable about the wines (he did make up for his lack of booze knowledge with his dessert knowledge/ he has braces so it was understandable)  and last flaw was the wine I did order (the house cabernet) was AWFUL!! I love cabs but this one was bad.. just bad... I traded yummy wine for a Sam Adams. Because they're food was SO good and the atmosphere was beautiful  I giive it a solid 4 stars. However it is a little pricier. Expect to pay for the setting"], ["Cindy R.", "The Happy Hour here isn't too darn bad.  I know you're not supposed to compare places but it's very similar to Brio (if you haven't been here and you've been there).The sangria is good, mojitos are cold and Happy Hour food is yum!I recommend the crispy shrimp and caprese salad.  Everything else I saw looked quite good also though!The bar staff seems to get a little overwhelmed during Happy Hour... they only had 2 bartenders... might be a smart thing to tag someone else on during that time.  Besides that, it was a good Happy Hour!"], ["AJ F.", "We love their Sicilian Pizza! The sausage is always flavorful and cut into good sized pieces. The crust is cooked perfectly and is thin but not too crispy. We enjoyed the chopped salad to go along with the complimentary breadsticks. The atmosphere is great, even though this restaurant is in the middle of a busy outdoor mall you won't be disappointed by the ambiance. The wait staff is attentive & friendly. We love Bravo's and eat here each time we come to Zona Rosa."], ["Sarah K.", "Great option for Italian food in the area.  The servers are polite and attentive.  The food is a little expensive but the flavor and quality are on par with the price.  Each meal is served with a herbed bread and oil dipping sauce.  Their lobster bisque is very rich and tasty.  I really like their lasagna, but have had other dishes and found them to be very good as well.  The sauces are rich and flavorful and the pasta has a freshly prepared taste.  I came on one occasion with family from out of town and the hostesses were nice enough to provide them with some information about the Zona Rosa area.  The atmosphere is family friendly but not loud.  It is a good location for a date, family dinner, or a meeting.  There is both indoor and outdoor seating available.  Overall, an enjoyable and quality experience."], ["Sean L.", "Foods fucking great here I love carbohydrates. They don't automatically bring you water anymore; I blame California. Also, I've been in Kansas City way too much this past month."], ["Faith B.", "Decent Italian chain with food that will get you through your shopping marathons.We stopped here in the midst of holiday shopping and were able to immediately get a seat at the bar.Drinks were served quickly - which was quite important mid-shopping trip.We ordered a flat bread with mushroom and caramelized onion that was tasty and filling. We ordered the large, but were brought the small. The bartender immediately corrected the bill and offered to get us the large, but the small was fine for splitting.The artichoke dip was also creamy, cheesy and tasty. It was served with cracker-style bread and I may have enjoyed thicker toast with it, but that's a minor flaw.The bill, however, was the equivalent of full dinners many places.Still, this is a good option at Zona."]], "Trezo Mare Restaurant and Lounge": [], "Rozzelle Court Restaurant": [], "Garozzo's Ristorante": [["Amy G.", "I love Garozzo's! I try to go here about once a month. It is such a wonderful atmosphere and even though there are tight quarters you don't feel packed in somehow. The waiters and bartenders are always friendly, fast and knowledgeable about the wines, etc. It's a little pricey but you get SO MUCH delicious food to take home with you."], ["Rachel J.", "This is a staple in our family! What used to be a restaurant only for special events has now transitioned into a semi-regular eatery for us. For the most part, dinner service is always prompt, polite and delish. Tonight our server was very energetic, courteous and very pleasant. The restaurant ambiance brings you back in time and provides a fun snapshot of Kansas City. Most certainly a place to visit in KC if you are craving Italian!"], ["Ramon L.", "We made reservations here for a large party and the staff and chef were phenomenal! The food is very good, the location amazing and ambiance perfect for this Italian family-style ristorante. Yes, it is a tourist destination, but that fact does not detract from what is fundamentally a very good restaurant. Come solo, with a date or a large group....you will not be disappointed!"], ["Amanda V.", "Absolutely delicious! My family and I ordered 3 different spiedinis and the veal mushroom ravioli. Everything was great but the veal ravioli was insanely amazing. I can't wait to come back!"], ["Rose P.", "Surprisingly this was a good place for lunch. The prices are reasonable. The ingredients were fresh especially the seafood. The service was ok, nothing too spectacular. Great food."], ["Peter T.", "The fresh baked bread was greay, the garlic dip was good, except the oil flavor stays in your mouth for up to two days.... Spaghetti was ok, of you like a tomato soup sweet flavor, I am more of a Tuscany tart dried tomato sauce. ..It reminded me of Chef Boyardee can stuff.I had a steak, it's was good, then again how can one screw up a steak, so that's a given...yet I must admit the sauce on the steak was to die for...Service was good, location in K C is fun in Little Italy.If one tried other things perhaps I'd enjoy it more,I could be wrong because it was a very fun bunch of customers there and many  were regulars."], ["Ben S.", "Standard Italian American restaurant that gives you the feeling of a quiet, dark familial setting with food that goes above the standard. It's not fancy, its not pretentious and it doesn't play to the crazy, overly-bombastic Italian stereotype restaurants that most people associate with this kind of food. Always fun to go here, especially for the price."], ["A J.", "Meh. I'd probably give Garozzo's 3 stars if it weren't so overpriced. All of the food is good, but you can find better. It's very old school Italian and everything is swimming in sauce. The sauce is delicious and often the best part of each dish, but I've ordered the gnocchi here and found it to be cut very inconsistently and therefore cooked very inconsistently. The cheese used in many of the dishes isn't of the quality that I'd expect for such an expensive dish, especially the Parmesan."], ["Lea L.", "I always try to eat here before going to the ballet. Why? Because the amazing ambiance and deliciousness they call food makes for an unforgettable night. Dishes to try...EVERYTHING! But my fave is the Fruitti de Mare...I would swim in beshamel sauce if someone let me!"], ["Wenday L.", "It's a long story but I came here mainly wanting to try their tartufo affogato. It just happens to be my birthday and the family came to town to celebrate it with me, so I thought this would be as good a time as ever to try this place out. First of all, I didn't know that there is a birthday special here! Apparently, you get a free spiedini di pollo if you come here on your birthday! Just be sure to bring some kind of photo ID with your birthdate on it.Don't be fooled by the exterior, as I was, because although it's tucked away in some seemingly forgotten part of town, the décor is very cozy and the service was excellent! It's a little dim inside, but the candle light on the table makes for an intimate and cozy setting.We had stuffed artichoke for the appetizer, but I'm personally not a huge fan. It is certainly good, with the perfect garlic butter base to the cheesy stuffing. I'd recommend spreading the stuffing on their bread. We had the Italian wedding soup, and that was fantastic as well. The meatballs were the most perfect meatballs I have ever had. The soup was flavorful and simply yummy, although it left me quite dehydrated after a couple spoons, but that's just me and my primarily bland diet.For entrees, we ordered Gabriella, Georgio, and the seafood dish with angel hair pasta in diablo spicy sauce (sorry I forgot what the name was). The seafood dish wasn't anything spectacular in my opinion. The scallops were small and too chewy, but I didn't expect much as far as seafood goes here. The Gabriella was much more sour than the Georgio, not what I was expecting. However, the Gabriella did have a little kick to it. I absolutely LOVED the Georgio dish, because it had the perfect seasoning for me. I especially love the fact that they used whole sautéed basil leaves, because they added a special flavor to the dish. Now the spiedini di pollo is just to-die-for. The seasoning was perfect, and I don't even know how they managed to make chicken breast that tender and moist. Be forewarned, their dishes are humongous. One serving can probably keep you full for 2 or 3 meals. The nice thing is that the reheated leftover Georgio is just as good as when it was freshly served.Last but not least, the dessert: tartufo affogato al caffe. This is like a dessert Russian doll because tartufo is a legitimate dessert on its own, but in this case is used as a component in an affogato dessert. You should look up these desserts if you're interested, but the version served here is a ball of half vanilla and half chocolate ice-cream with a surprise cherry in the center. The ice-cream ball is coated by a thin chocolate shell. When it's served, the server will pour a shot of warm espresso on top of the chocolate-covered ice-cream ball. This was my first time trying an affogato, but it was an extremely satisfying experience for me. There are several other places around town that also serve affogato, but in the simpler ways, and I'll definitely be checking them all out!"], ["Sara-Elizabeth D.", "It was a little pretentious and pricey. Service was quick, but definitely not friendly. I think that's what turned me off most. As soon as we didn't order a glass of pricey wine our waiter got smug. I ordered the manicotti which was okay. My sister ordered the gnocchi and it was better. I don't think I will return mainly because I was dying to get out of there."], ["Food F.", "Fantastic restaurant.  Great service.  Fantastic calamari to start the meal, interesting garlic dip. I had the chicken spideini Georgio and spouse had shrimp spiedini Maggie. Both outstanding.  The shrimp was some of the best I've had. Kids meals are large, good selection and the wines are great and reasonably priced either by the glass, Demi or full bottle. Cheers to Sherri from MN for the great service."], ["Sarah T.", "First time coming to this restaurant was for my mother's wedding dinner.  We reserved the room upstairs, the decor was lovely and it was very cozy.  Our waiter was very professional and attentive, he was joined farther into the meal by a couple other helpers, but he was clearly running the show.  We had a four course meal; seafood ravioli (amazing), insalata (great, not much of a salad person but still good), Frankie's chicken (my choice for entree, very delicious and a huge portion, only tiff with this was that the sauce was pretty oily and started to separate after while), then sfogliatelle for dessert which was amazing.Overall, the service was fantastic and food was great.  Not to mention they do not have a dumbwaiter, so everything had to be brought up the stairs in the back, in the middle of July.  You would have never known though.  I will definitely return for a more casual dinner."], ["Tom D.", "My colleagues were a bit more impressed then I was. Of course it's tough to cook for the public and have it compare to my own Italian home cooking! This was not my first trip to this restaurant and like the first - I was certainly impressed by the menu and the pricing. Parking is pretty good, but you might be on the street or in the lot across the street - at least it's free!The place is normally packed at lunch time and this trip was no different, but they were able to get the 5 of us seated without wait and the cleanliness was good. There was something for everyone on the menu and I selected a Chicken pasta dish - forgive me for not remembering the name, but the reason this is a three star was because my chicken was a bit dry. I also thought there should have been more spinach and the angel hair pasta should have been tossed better to prevent it from sticking together without sauce - I really don't like that! I wasn't asked if I wanted more shaker cheese, the server seemed a bit put out and not very friendly - almost like we were in his way!Overall - I would certainly go back - try something else and maybe see if I could raise the rating, but for now - it's a solid 3 stars!"], ["Dezeree H.", "Since moving to the Midwest from the east 6 years ago, I have yet to find good Italian food. A coworker told me about this place and our visit was probably the best meal we've had in six years.  This place is like the authentic Italian food that you find in immigrant communities back east. Order anything and it will be excellent!"], ["Casey M.", "Came here this past weekend with my boyfriend. We loved it! There was a long line and a lot of people were complaining. But it was Saturday night, what do they expect? We had a reservation and had no problems getting seated. Their wine selection is good and not extremely expensive. We started off with their bread and Sicilian Garlic Dip. It was VERY garlicky--my boyfriend and I made a pact to just both stink that night. I had their special, Porcini Ravioli with Butter Sage Sauce. I NEED to make that sauce at home, it's to die for. Overall we had a great experience, but the ambiance left something to be desired. Due to the long wait, many people were rather sauced at the bar. They were loud and obnoxious and we had the misfortune of being seated right next to them. So romantic. Quick tip: ask to be seated in the main dining room."], ["Kevin S.", "When I have a taste for Italian in KC, Garozzo's downtown is a favorite. And for many in KC because it is usually very crowded - reservations are highly recommended. We have always had well mixed cocktails to start the evening followed by a wedge salad - the best I've had in KC - perfecto. They have a fairly extensive and reasonably priced wine selection. The dishes are tasty, although not innovative. The atmosphere is straight forward, decorated with family photos."], ["Faith B.", "I really want to like Garozzo's. BF loves it.We tried the Lee's Summit location and I was sadly disappointed in the service; the food was just okay,Everyone told me I had to try the original.I recently tried the Columbus Park original location for a lunch meeting. The service was very good and quite attentive and the waitress happily explained the menu.The bread pre-meal was warm and comforting.I liked the house Chianti.The salad was tasty and fresh.I loved the Cafe Garozzo we had at the end of the meal. Yummy! But my entree, the Eggplant Parmesan, was really just average. It makes me sad that I've had better at chains.I wonder if I'm missing out on the Garozzo's appeal because I don't order their meat dishes.Sigh."], ["Matthew L.", "Excellent food. Reasonable Prices. Fantastic atmosphere. Downtown italian joint theme.  Highly recommended."], ["Patrick V.", "Garozzo's knows Italian.  From my experience it's up there with some places on The Hill in STL.  I was looking for non-chain Italian place in KC to take my daughter to before we went to a show at Starlight for her birthday.  Yelped real quick and found Garozzo's and it was a date.  We arrived around 6:30pm on a Monday without a reservation and actually got seated right away by a table by the bar.  The service was superb and everyone was very professional.  When I thought I wanted the Three Way Pasta, our waitress mentioned it was a 6lb dish thankfully and pointed me towards the Capelli D'Angelo.  She knew I wasn't THAT hungry and she was right :)  My daughter got The Hill Special.  We also ordered some Garlic Cheese bread.  I mentioned we were in a bit of a rush to get to the show on time, and I am so impressed that the staff made sure the food came out promptly and took note that we were on a time constraint.  Our dishes came out in 15min or so and WOW were they good.  The D'Angelo was an amazing buttery angle hair pasta with fresh tomatoes which I added chicken too.  Just perfect if you aren't in the mood for a paste sauce.  Incredibly good.  My daughter really liked her dish as well.  Very generous portions, I only finished half of mine and ate the rest for two lunches days after :)  The daughter was the same.  We could of shared one dish and been full.  Overall, just an all around happy last minute find that turned out to be a great way to start out the evening.  It's on my list as a top Italian place in KC that I'll be taking my wife too soon!  Great job Garozzo's!"]]}