{"Zaina": [], "Tasso's Greek Restaurant & Grocery": [], "The Basha Cuisine": [], "Al Habashi Middle Eastern Grocery": [], "Extra Virgin": [["Tiffany C.", "Delicious and unique food that can be altered to cater to vegetarian/vegan crowds.Following a vegan diet, I ordered:1) Chickpea fries2) Corn3) Grilled mushroom (altered from grilled oyster mushrooms)4) Lebanese hummus5) Persian cucumber pickles6) Potatoes bravas7) White bean salad with grapesMeal + tip totaled to around $53. Service was excellent and they were very patient with our large (14+) group. They have no corkage fee on Mondays but have a limit of two wine bottles per table. For our large group, they allowed four bottles."], ["Chirag P.", "One of a kind! It offers small bites, portions of many items from the menu. So you can enjoy may items in same meal. I ordered 3 items on food menu and a couple beers. The final price was surprisingly not a lot. Service was amazing as the waiter himself made very good recommendations - thats means they know a lot about not just their menu but tastes too.  We couldnt find parking close so they lose 1 star."], ["Caryn D.", "Food and service was excellent! We had the duck tongue tacos, shrimp fried rice, ramen, pork buns, and dessert. We almost passed on the dessert but I'm sooooo glad we didn't. The homemade churros and tres leeches was unreal! We could have ordered 2 of each and been content. Don't skip the dessert!!!!"], ["Dono P.", "Thought the pork belly and churros were great but the Greek salad and especially the hanger steak were let downs. I will go back to try more of their unique dishes but the botched hanger steak definitely threw me off a bit."], ["Jennifer C.", "Went for lunch during restaurant week.  Interestingly it was cheaper for us to order alacarte than it was for the special which consisted of the same thing so was odd.  Had the tuna tacos which I would skip next time...there was one tiny piece of tuna in each taco and the rest was filler and had almost no flavor of seasoning.   The French onion soup was great...really well done.  The poblano Mac and cheese was decent...not anything I would rank as must have in a future visit.  My husband had the burger which he liked...cooked well and good quality meat.  Excellent Italian wine under dark and fruity category.  So as you can see was a bit all over the place.  Have been for dinner previously and had better luck with dishes being consistent in quality."], ["Nicole G.", "We absolutely loved this restaurant. The ambiance and food were fantastic. They serve small plates. We ordered Gorgonzola. Which came with a cracker and jam spread. Amazing!  Next up were Pork Belly Steamed Buns. They were delicious. The bread reminded me of an asian pork bun. Very flavorful. Then we had Poblano Mac & Cheese, Octopus Nachos and Wood Fired Hanger Steak. All were amazing. We ordered too much food though. Will definitely return!"], ["Tim M.", "Dined here last night with a group of us and had a fantastic experience. The wait staff were extremely friendly and the food was awesome. Our group probably ordered about 24 dishes in total and we loved it all. Our highlights were the crab and corn fritters, roasted marrow bones, chorizo and fig stuffed chicken, the ricotta.... The list goes on. We can't wait to come back!"], ["Tricia H.", "In Italian when we eat we Mangia!!! That's exactly what I did here!!! I Mangia and I Mangia and I loved it!!! I'm not sure why I've avoided this place but I had...I was tickled  when our sweet waitress told came to the table apologized for getting makeup and coffee on her shirt on the way to work..then she absolutely intrigued me when she told me the chef/owner studied in the south of France, I couldn't wait to taste his food!!! I was in love at first bite of the tuna cerviche tacos!!!! Thank you restaurant week for opening my eyes!! I cannot wait to go back!"], ["Tee S.", "This was our first meal in KC coming from out of state. I ordered several small plates that I thought would be interesting to try.  This place has eurasian influenced food, not a typical Spanish Tapas place. I ordered the pig ear salad, chicken thighs wrapped with figs, bone marrow, and spanish meat balls.The pig ear salad had nice, crispy ears mixed with arugula and vinegrette. The bone marrow was good. The chicken and fig was sweet and did not taste spectacular. It definitely didn't have that taste like it was freshly cooked. The Spanish meatballs was kind of bland and undercooked. Overall, 2/4 dishes were good."], ["Randy G.", "The feel of the place us great. Fun, energetic, staff is great, nice layout but the food was okay. Hanger steak A+, Greek salad A+, Mac & Cheese D- (Kraft is better), Chicken thighs w/Chirizo D- (buy a rotisserie chicken at local grocery store)."], ["Michael C.", "Chef Michael Smith takes the 'nasty bits' of animals and turn them into delicious tapas. Under the \"For the adventurous\" portion of the menu, we had the beef heart terrine and pig stomach and they were both great! Also had the most amazing sea urchin pasta!"], ["Angelica E.", "Michael Smith is one of my favorite chefs in Kansas City. Ive followed his cuisine since 40 Sardines. I rate this restaurant a two because of poor service. Sadly my experience at Extra Virgin was tainted by the barkeep, a tall blonde guy, and his condescending and extremely immature demeanor. Its really difficult to enjoy good food with bad service. I ordered every menu item with oysters on the menu the mac & cheese and grilled ricotta bread while sipping champagne. Fabulous! The chefs here really enjoy what they do and it shows in the way the flavor of their food comes together."], ["Eric F.", "The food was good but not.great but for the price it was a good find ..drinks were really good"], ["Marek S.", "Great spot to start the night off especially during happy hour. Try the pork belly steam buns and shrimp fried rice! Very attentive staff and great red wines."], ["Divine A.", "We always enjoy our food and the service every time we come. One small request: New stuff on the menu please!!!"], ["Nick G.", "When my wife and my 10-year-old son arrived at Extra-Virgin, we entered a pleasantly decorated, rather swanky, restaurant that clearly catered to a tapas crowd.  Steven, our server, immediately presented us with menus of exotic dishes. Upon inspection of the menu, we saw that the price for the servings matched the prices of tapas restaurants that we have encountered in Orlando, Atlanta, and New York City. We therefore ordered what we thought was a sufficient array of dishes to satisfy our pallets.  Our excitement of what we were ordering was enhanced by the smells, aromatic and spicy, emanating from the kitchen. We informed Steven that we were passing through and this would be a one time event for us. He quickly went over what he thought were the best choices to make off the menu, and we complied, wishing to pair a string of dishes that would match a culinary theme.  He reassured us that \"somehow whatever we chose would all come together in the end.\"How right he was. Our first round of happiness included duck tongue tacos with spicy pickled onions and queso fresco.  The gamey and sour flavors were attenuated by the small chunks of the creamy cheese, and it was a subtle but nevertheless delicious opening foray.  The sea salt brought out for us to spoon on as needed brought these flavors out more fully.  The chickpea fries were stacked in a log cabin presentation which was appealing visually, and the plate contained a smear of a red pepper sauce.  This was a surprise, for this side was a truly novel experience for us, and we enjoyed the fries immeasurably throughout the meal, using them to soak up the juices of subsequent dishes that followed.Our next round of culinary delights included peppers stuffed with morcilla sausage and Pecorino cheese, both of which gave the piquillos a long finish of several layers of favors.  In addition, chorizo and fig filled chicken thighs served as a sweet counterpart to the peppers, and its juice was a perfect partner for the aforementioned chick pea fries.  The pièce de résistance, however, was a dish traditionally representative of the most basic of American staples: macaroni and cheese.  In the world of Extra-Virgin, macaroni and cheese exemplifies the concept of gourmet. The dish was prepared with poblano cheese and served in sizzling iron skillets. The combination of creaminess with the brittle crispiness of its shell and its sides which stuck to the pan were pleasant to chew, sensual for the tongue and pallet, and layered with a long finish of taste which paired ably with the locally brewed beers we drank.  How could so much food fill three people up so satisfyingly?  I think it was that in the bursts of favors, the sensuality of the textures, and the balance of the foods and spices used to prepare the tapas we were forced to slow down in order to savor every bite.  By the time we were ready to finish with a cheese assortment, we had to ask Steven if he had begun to prepare it, and upon finding out that he had not, we were able to gratefully cancel as its presentation would have been overload.Steven was right: it all came together, and in a very big and glorious way. It is a great value for the price, for the portions of the tapas were generous. Extra-Virgin unequivocally gets the RSA: the Roaducation Stamp of Approval ... at the highest level!  Thank you, Michael Smith!"], ["D V.", "My wife and I went here Saturday night for dinner and had a wonderful time.  We are foodies that love bold, interesting flavors and something outside of the norm for Kansas City.  Wait times were reasonable, service was impeccable (friendly and attentive without being obtrusive) and the food was amazing.We had the chick pea fries, duck-tongue tacos, heirloom tomato and ricotta cheese plate, avocado and something tacos, and a take off on shrimp ceviche.  Great twist on the traditional cocktails too.Dinner for two with one round of drinks came to $80 all-in, so it's a little pricey, but I feel it's a good value given the quality and variety of food you receive.We'll definitely be making the drive up from south OP just so we can try more things from the menu!"], ["Zac S.", "This place is fantastic. Berto at the bar creates some great drinks and makes for a fantastic dining experience. Try the pork belly steam bun."], ["Anthony G.", "Having recently moved to KC and looking for some high quality places to eat, I was directed towards Michael Smiths and Extra Virgin. 1. Atmosphere - With an extremely energetic and great bar filled environment it was a really just \"fun\" all over. Staff knows their menu and Bartenders know every drink in the book, how to explain it for a novice, and how to really make your time enjoyable. 2. Food - INCREDIBLE... for a Tapas place, I was extremely impressed. We ordered 5 plates to test. We ordered to hummus, the shrimp fried rice  (MUST GET), Spanish Meatballs, The hanger steak, and for Dessert the Pear Crostada.3. Bar - As I mentioned earlier the bar was very impressive but many key items stand out. The bar space is great, no matter where you sit, you have en elegant view of everything want to see. I ordered \"The Last Word\" which was a first for me but very enjoyable. It's always fun to be in the middle of actions that witnesses all the and food coming your your way or around it4. ONE MAJOR SETBACK WHICH IS THE ONLY REASON THEY ARE RECEIVING 4 STARS RATHER THAN 5. I never brought this to the attention of any manager but I should have. As mentions earlier we ordered the Hanger Steak, which was delicious by the way. It was prepared with a side of kale but the steak is rarely cooked and sliced thin. After enjoying it, I turned around to notice the cook preparing all of these Steaks so it was clearly a high seller. While watching him, there were no gloves worn whatsoever. I'm not a picky person but growing up in the food industry I know you can't do that. If your chefs are visible to the front of the house, you CANNOT be putting your raw hands on every dish you prepare. That's is just a no-no. I witnessed him grabbing multple raw pieces of meat along with the kale itself and other dishes without washing a single finger or ever decided to use gloves. What bothers me the most is the fact that the restaurant is set up that way in which w can see them prepare... if I can see you touch my food, please give the customer a since of security when eating because it was flat out DISGUSTING. Blood from someones steak then to grab the kale without the use of tongs is unacceptable and I hope Michael is informed. Overall besides one incident, I loved it, I will return, and I will recommend to everyone."], ["Alexander R.", "My wife has been wanting to go here for a while now. I wish we had gone before they got bored with what they were doing. The place was slow. But it still took over 8 minutes to be greeted by our server. We were seated as she cleaned the table next to us. When she continued to clean as I stood waiting to be able to pull out my chair, I thought, please don't let this be my server. She isn't planning on being sat anytime soon. But, as her little bee tattoo buzzed by us two or three times, attending to the neighboring tables, I realized that we were indeed, in her section. My old fashioned was very good. But the food was bland and boring. I've had better deviled eggs at church picnics. Don't get me wrong, the food was all cooked well (only the chicken thighs were burnt). It was quite a disappointment. After spending 20+ years in kitchens, I understand how a restaurant can become content with just churning out the same thing and getting comfortable. But, when I am out for my 20th anniversary, I'm hoping to get something amazing. Or at least intriguing. I hope to try them again, once they have regained interest in what they are doing."]], "Papu's Café": [], "Jerusalem Cafe": [], "North Kansas City Cafe": [], "Olive Cafe": [], "KC Grill & Kabob": [["Sarah Y.", "Really wonderful baba ghanoush and homemade bread!  The service was great as well.  Will definately be back."], ["Melissa B.", "This is one of my favorite places to eat in KC.  It might not look like a strip mall restaurant on the outside but when you walk in it is filled with pictures, and you are immediately greeted, it is a nice friendly place. The food is beyond good, the baba ganouj is the best I've ever had, the buffet has this green hot sauce that I want to put on everything, the falafel is crispy on the outside and nice and soft on the inside, and the beef and chicken kabobs are great! The owner is very nice and the many times I've been there the service has been great."], ["Tammi C.", "Food was great!!  The chicken kabob was spot on!  Service impeccable.  Never once had to ask for a refill on drinks.  Homemade pita and hummus was out of this world.  Cannot believe this gem is in Lenexa and I was ever skeptical to go in due to the outside look.  We will be back!!!"], ["Kim Y.", "I have been here many times and it is excellent every time.  The owner is so nice and welcoming and the food is fabulous!"], ["Marie F.", "Went for the lunch buffet and brought a coupon from the website.  They gladly accepted the coupon and explained the items on the buffet for us.  The owner was there and his was very personable.  He came over and chatted for a moment and gave us some food pairing suggestions.  It's a small buffet, but don't let that discourage you.  Some items were: falafel, chicken and beef kabob, four different kinds of rice, greens (my favorite, eat it with the crunchy rice), baba ganoush, hummus, eggplant soup, lentil soup (delicious), grilled tomatoes/onions, cucumber tomato salad, house made pita bread, rice pudding.  They are even offering ice cream now.  It's rose water, pistachio and cream.  It's not part of the buffet, but add 99cents to give it a try."], ["Shethewriter A.", "Food is delicious and affordable. Ambiance has a cultured flavor to rival those in downtown Chicago or Westport. The buffet isn't huge, but the quality of the food is so incredible that you won't suffer for lack of options. It's buffet food at made-to-order taste, if not better. The bread and ice cream are also made in-house, and the ice cream is unique and very tasty. They also have a healthy selection of sodas in vintage glass bottles, which made me happy. Amazing food at a low price. This place is a local gem."], ["Rob M.", "We don't have a lot of options for Persian cuisine in Kansas City.  This small and friendly restaurant in Lenexa is one.  I had dinner there tonight and enjoyed everything I ate.  I tried the buffet, since I had never been here before, and it had a pretty good variety of Persian foods.  The trays on the buffet were small and refilled regularly, so the food was fresh.  I had a very tasty lamb and potato stew that was slightly tart, with the lamb just falling apart (as it should have been after long cooking).  There were several kinds of rice and pilaf to choose from.  I also had the ground lamb and chicken kabobs and a different whole chicken kabob that was a bit like tandoori chicken, with the pieces of chicken colored an appealing red.  To accompany the food I had some refreshing cucumber/yogurt salad, similar to Indian raita.  For dessert there was some Persian rice pudding.  The food must be reasonably authentic.  There were several happy tables of Iranian students and families having dinner while I was there.  In addition to the buffet, which is $11.99, there is an a-la-carte menu which I'd like to try next time.  The prices are all moderate, with the most expensive item being $17.99.The Google map showing the location is inaccurate.  KC Grill & Kabob is located at 8611 Hauser St., just north of 87th St. and a block or two east of Pflumm.  The restaurant is located right next door to the Eddoko restaurant (another place I plan to try)."], ["C D.", "Best hummus and pita bread ever!!!!"], ["Mandi F.", "This is the place for amazing Persian food! Just moved to KC and lucky for us this fantastic place is across the street! We grabbed takeout on a Friday night. The chicken and beef kabobs were moist, flavorful and grilled to perfection! They were served with delicious basmati rice, grilled tomato, and a side of raita (yogurt) and naan. The owner Hamir was gracious and kind and it's clear he takes a lot of pride in his restaurant and his food and that he loves what he does. We're so glad that they're in our new neighborhood! We'll definitely be back!"], ["Matt S.", "Definitely a family owned place and you could tell right when you walk in.  Everything I tried looked good and I went back for seconds of course.  I'm already thinking about going back again after my lunch yesterday.  Great service and great homemade Mid-East food.  Solid!"], ["Chad H.", "ABSOLUTELY AMAZING!!!!  The owner is very engaged in his business and greets guests and the food is stellar!  I travel the country to a different city every week for business so I get to explore different foods all over and this place has some of the best Persian food I have encountered.  A definite must have!  Do not miss the opportunity to enjoy this great dining experience next time you are in the Lenexa, Mission, Merriam, Overland Park, or Greater Kansas City area in general!"], ["Katie G.", "I love this restaurant.  The owner always makes a point to stop and chat, and he's extremely friendly.  The green cilantro sauce is like crack.  I put it on everything.  They're always friendly to my kids, when I bring them, and the service is quick.  The decor is charming, packed with Persian photos.  The Falafel is so good, Tandoori Chicken is delicious, and the bread is fantastic.  Love this place!"], ["Eric A.", "For Persians....I am from LA.  I am Persian.  We have the best Persian food in the United States arguably in LA.  I mean they do call it Tehrangeles.  So possibly my review is a bit off because I am biased.  But then again, everyone's mom's cooking is really good - so that should be the standard right?There is no way someone's mom was in charge of these recipes.  I was hoping I would find an awesome Persian restaurant hidden in KC among the 2 that are here - but it was DEFINITELY not KC Grill & Kabob.  Nothing tasted authentic.  Any yelpers - message me if you go to LA - actually, you don't need to - ANY persian restaurant is better in terms of authentic flavor than KC Grill.  Looking at the reviews, they all seem to be from non-Persians who don't know any better - so I guess if you fit that category, you may like it.But the staff was SUPER nice.  I feel bad giving 1 star, but the phrase \"Eek! Methinks not,\" is much closer to how I feel than \"Meh, I've experienced better.\"  Staff and service, 5 stars, but food 1 star.  And I won't go back to a restaurant just for the staff.  What am I doing eating Persian food in KC anyway?  BBQ here I come.  Oh, and I will also be trying out Caspian just to compare."], ["Jo W.", "I'm a foodie and was so excited to try this restaurant as I obviously love kabobs, gyros, etc. who doesn't? I took my pregnant sister and her friend after we had pedicures nearby at a Salon. I had an a Groupon to use and thought it would be a great time to try the food since we were literally a few businesses away. We walked over and my sister's friend was holding her shoes but had on sandals so her nails could finish drying. As soon as we walked in during the lunch buffet a man approached and begin questioning us about how we heard about the place. he saw the shoes in my sister's friend's hand and said, \"what's wrong couldn't figure out your shoes\" -we told him we had just finished pedicures at the salon next door to which he humphed and walked away. Needless to say we began to feel uncomfortable. We inquired about the buffet and my little sister because she's pregnant decided not to order as her stomach was up set but the rest of us ordered the buffet. I think the man we encountered early was upset by this because they sat us parallel to the door, then he opened the door so the cold air from outside would blow directly on my pregnant sister. She says she heard him say under his breathe, \"I better not hear a complaint\". Other patrons including another pregnant woman seemed to be surprised the door would be opened when it was windy, cold, and raining (lightly) outside. The same man we encountered earlier who I by now assumed was the owner walked around and was polite to other customers but not to us which i didn't understand as we were first timers and very polite. The food was okay but the buffet was messy and not labeled well. Do not waste your money here go where they respect and value customers. Other local businesses will appreciate your money and willingness to give their business a chance. I'm sad that I convinced others to try this business and they were so rude. I won't ever go again."], ["Danielle W.", "My family and I have a love for Middle Eastern food and growing up in Michigan (where they have the 2nd biggest population of Arabic people outside of the Middle East) we ate at many Arabic owned establishments on a regular basis. My son and I went last night to check out a Persian owned restaurant, when I asked if they took credit cards as a payment, the owner shouted out throughout the entire restaurant: \"We do not take American Express because they are run by Jews in NYC and I don't like Jews.\" Of course I let him know that I am Jewish...He apologized to me but the damage is done and I will never return to that restaurant. I was disappointed that my son had to be subjected to such stupidity The food wasn't good either. The baba ganoush was GRAY and the chicken was tasteless. I would have rather eaten at IHOP for the same money and not had to be ridiculed by such an anti semitic JERK! He complained to me that Jewish people don't come to eat at his restaurant, well I can definitely see why! If he doesn't like Jewish people the chances are that list is much longer and spans further than just Jews!I was so offended by this experience that I mentioned on Facebook. This was my next door neighbors response:\"My wife and I walked in, were offended by pushiness of owner and walked right back out. Never have eaten there and never will. That's probably why he coupons so much...its only way he can get people in. Have u tried Caspian bistro at 90th and Metcalf? Its good.\"Looks like there is a reason why at 6PM we were the only ones in the restaurant!"], ["Ian Y.", "No, it's not the American kabobs you make at home nor those sold at grocery stores.This is an Iranian restaurant. You can't tell from the name, so it could be a surprise as soon as you open the door.To be honest, it doesn't impress you at all when you walk in. You immediately notice the decor is extremely dated, from the tables, chairs, a wood-buffet station with wooden panel from decades ago, and carpet that yells \"change me! I'm filthy!\". On the other hand, there're tons of pictures on the wall, but somehow I actually feel they bring some characteristics to the restaurant.During my visit, there're only two gentlemen (owners, I assume) that run the whole operation. There may be someone else in the kitchen, but the place is awfully quiet. There was a moment that I heard a \"ding\" sound from the kitchen, a tone that reminds me microwave oven...The attractions come from the dinner entrees, which are grilled meat and vegetable. I wouldn't be surprised that the items were actually re-heated because of the \"ding\" sound I mentioned above. However I was pleasantly surprised by the beef and chicken kabob. The chicken breasts pieces are very juicy, most, tender and flavorful. The same attributes apply to the (ground) beef patty as well. There's not much presentation to the dish, with rice, \"house salad\" and grilled tomato filling up the rest of the plate. I really wanted to try the fillet mignon or the hen, but the're not available (or not offered anymore). If I were to visit again, I would definitely give the lamb dishes a try. To sum it up, chicken and beef kabob is a safe choice and the meat seems to be marinated cooked very well, but the decor deserves some update and please bring back the missing menu items! I can't rate its authenticity but somehow I feel there's something much better out there."], ["david n.", "very good food.  warm bread brought to your table.  some of the best flat bread i ever had.  just a nice little place to enjoy something different."], ["Curt H.", "The restaurant is small and very middle eastern feeling from the decorations on the walls.  The staff was friendly.  The owner was also there and walked around to talk to every table a few times during our meal.  The presence and hands on owner was very comforting in this world we live in today.  The food is a mixture of Persian and middle eastern.  The Cilantro/Pepper sauce/dip was very very good...don't shy away from the green stuff, pile it on your plate and use it with the meat and rice.  I am sorry but I am not a big buffet fan...and the waiter and owner really pushed us to have it, we all enjoyed it...and it did have a very good variety."], ["Alexandria M.", "KC Grill and Kabob is a hidden gem. The little restaurant is filled with homemade delicious Persian specialities. The owner is more than accommodating, enthusiastic, and gives you the full experience of having a taste of Persia. They have a rose water, pistachio, cardamom ice cream that was so unique and tasty. We walked away full, happy, and with a new cultural experience. We will be back soon!"], ["Melisa V.", "great friendly, family atmosphere, though the food left little to be desired. we came in on a Friday night and it was pretty busy. so busy that they didn't have any highchairs. thankfully a family who were already finished with their meal kindly brought their highchair to our booth.they had the buffet set up so we decided that would be our best option to try everything.  grabbed a few of the chicken and steak kebabs for my son and he was not a fan. he did really like the banana pudding and pita bread.like most buffets, everything was a bit hit or miss. the falafel was pretty good and so was the vegetable curry. the pita, hummus and jalapeno dip were also good.  my son was really entertained by everything going on, especially the keyboard player. the staff was also very friendly and accommodating.  I just wish the food was better."]], "Jerusalem Cafe & Bakery": [], "Sahara": [], "Habashi House": [["Seth G.", "I get their pita kebabs for lunch at least once a week. Worth the walk from downtown."], ["Noah M.", "I love gyros and Greek food in general, this place doesn't disappoint, neat atmosphere and vibe in market area. I got gyro with rice, first off their rice is to die for, the spices and vegetables in the rice are a perfect combo and make for a delicious side. And the gyro is to die for. The meat was perfectly seasoned and tender, I've always been skeptical of the sauce ordering from past places, but wow the sauce on it was top notch. Ate it in 2 bites basically! Next time you're in the river market, go to Habashi House!"], ["Karen H.", "I had read the really good reviews for this place and decided to check it out.  We got there about 30 minutes before they closed.  (We didn't realize that until we left).  The food and the service were great.  The hummus is the best I've ever eaten.  The atmosphere was very, very casual.  But the food and the staff were so good, I will definitely be back."], ["Ryan M.", "For what it is, I give Habashi House a full 5 stars. To be in the middle of the continental US and be getting this quality of authentic, great tasting middle eastern food is absolutely remarkable. Throw in the free tea plus the extremely affordable menu, and this is a solid win. 2 people can eat lunch for under $15 no problem, and they have vegetarian options for the health conscious. True, you sit on cheap seats and hard benches, but that's not why I came here! The food is fantastic (and cheap!), the staff is welcoming and very friendly, and the decor and ambiance is really cool, down to what's on the TV. I'll be back!"], ["Billie H.", "My original intent to stopping at the River Market area was something for lunch, the bonus was shopping. While wondering around, Habashi House jumped out at me. I love Mideastern food and have not had any for a long time so this was perfect!The hummus is amazingly delicious. I got it as a side with my meal and my only complaint would be I wanted more. I can't remember what it was called, but I had a pita that had the kabob meat inside it. It was pressed in like a panini sort of way. The meat was so full of flavor! I loved how it was pressed between the pita into many little sandwiches. My only wish was for some tatziki to make the meal perfect. The lady taking orders was just infectious with happiness! By the time she was done taking my order I wanted to take her home to meet my parents. She just makes you love the day. The price can't be beat. My meal was just a little change over $6 and I left with y hunger fully satisfied. I can't wait to go back and try the other options. As a lover of food with good combinations of spice and flavor, Mideastern, southern European, and African are always tops for me and this place is one of the best of those!"], ["Crystal C.", "Please don't miss out on there Baklava!!! Best in the city an it will not disappoint you.  On the weekends they usually have a table outside the restaurant where you can buy a generous piece of baklava for $1.  They also have their hummus for sale at the stand an it's to die for, best ever!!"], ["Gloria T.", "I had the shawarma combo it was a great sampler of everything.  I traded out any items with wheat for dolmas. They changed the hours to 6pm which was great. All the people were super friendly and helpful."], ["Laura F.", "Some of the best Mediterranean I've ever had. I got the shawerma combo...which is basically a sampler of almost everything - lamb meat, rice, hummus, pita, baba ghanouj, tabouli, salad, and falafel. Sounds like a massive amount of food, but it was a small enough sample of each. I ate most of it - minus some rice and hummus. It was $10 and worth every penny. The meat and rice were very flavorful. Might have been the best hummus I've ever had. The falafal were good. The green stuff was good - think it was the tabouli. Would definitely return - AWESOME food!"], ["Daniela G.", "I've been on the hunt for some good Mediterranean food since I moved to KC, on that hunt I have dinned at 3 or 4 places that would do in a pinch, but Habashi House, after yesterday's lunch, is my go to from now on!  No matter where I am, where I go I always, hands down, go for the veggie platter...or whatever it's called at any given place, and if available a lentil soup...here it's the House Combo: hummus, baba ganoush, dolmas, falafel, tabule and pita bread.  I feel like this gives me an edge on the reviews too because it's all an even playing field.  Let's start with the curve ball, the soup - while thinner than other lentil soups I've had this is by far the most flavor packed!  I was raised on extremely flavorful ethic food, so my pallet is looking for something more than just lentil scented water - Habashi House's lentil soup was incredible and zesty, just how I like it.  On to the main event, the house combo - I will say that I have had their hummus and pita before, so I knew how good it was before came in - I just can't help grabbing some when out doing my weekly produce shopping. Aside from their deliciously creamy hummus, their dolmas were probably some of the best I've ever had (sorry grandma)!  The falafel was moist and flavorful as well!   LIke I said before - this is my new go to for fab and delicious Mediterranean food and, let's be real... it should be yours too!"], ["Perry P.", "Bottom Line Up Front: Cheap Prices. City Market location. Authentic middle eastern food. Located in the City Market, it's easy to tell which restaurant is worth trying based on their traffic during lunch. The fiance and I go to the City Market 2-3 times a month and I've always noticed how crowded this place got. So, we decided to grab lunch here over the weekend. The restaurant is a hole in a wall joint. No frills, random middle eastern decor and mismatch furniture. You wait in line, order your food, sit down, and wait until someone yells out your ticket number (seems like a good system I guess, works for them as far as I can see). Initially I wanted to try their felafel sandwich (use to love them when I was in Iraq, even though we shouldn't have been eating them due to sanitary concerns, oh wells, still alive). But, I ended up getting the shwarma wrap with rice. I use to eat shwarma's 2-3 times a month back when I was in high school/college in Houston, which were amazing. So, my expectations were pretty high before I took the first bite. Unfortunately, it didn't wow me. It was good, just all the flavors didn't really come together for me. I ended up drenching it in tzatziki sauce. The rice was very good though. Together the dish was not bad. I wouldn't get it again though.I will come back some day and give the felafel a try. If you're wanting quick, authentic, and cheap middle eastern food, you can't really go wrong with this place. It just won't really wow you."], ["Thomas M.", "We enjoyed a beef kabob with some good flavor and tasty rice. HH had  good atmosphere and I really enjoyed it. The restaurant was fairly clean, but the restroom was a little less so."], ["Logan Locke B.", "Another home run for Habashi House. I appreciate their consistency in delicious food, fair price and kind service.  Shwarma  Combo is so delicious and plenty enough  to share or create 2 meals out of!!!"], ["Steve X.", "Loved it.  Must try.  Had vegetarian platter.  Wife ordered chicken skewers.  Great lunch stop when visiting city market"], ["Ryan L.", "Omg the baklava! Crispy sweet but not too much love the gyros too. Love the small family ran restaurant feel."], ["Matt E.", "How do I love Habashi House? Let me count the ways:1) The woman that runs the cash register is the friendliest woman alive. I'd give her a hug if that wouldn't be super creepster of me. 2) The gyros, while a bit smaller than at other places, is so delicious. They have the best pita of all time, and the warm meat mixed with the pillowy bread and tangy tatziki sauce is a sensation to behold.3) In my limited dolma-eating experiences, these are the best dolmas I've had. Same goes for the falafel. 4) Bulk hummus. DELICIOUS bulk hummus.5) Coke Zero!6) On a nice day being able to sit outside of the main restaurant and have the fresh breeze and the bustle of the market waft over meWell that's 6 ways that I love them, but I only have 5 stars to give. Habashi House, take them all."], ["Patrick M.", "This is one of my favorite restaurants in Kansas City. The falafel is so good. In the winter they have the best lentil soup. The people that own it are so nice and friendly."], ["Cathy C.", "Favorite Middle Eastern restaurant, without a doubt. Nothing fancy about it, but it fits perfectly into its surroundings. And yes, the woman at the counter couldn't be sweeter. The first time I ate here was right after 9/11, and they had put up a sign saying how much they love America and how proud they are to be here. I wanted to hug her right there.I think I've pretty well eaten my way through the menu, and never had anything I didn't love. Felafel is my favorite, with its delicate crispy crust and tender, beautifully seasoned insides. The smoky baba ghanouj is my second favorite. A sandwich is just a pita pocket dripping with the stuff-messy joy! And while the rice at some Mediterranean places is underwhelming, theirs is delicious-almonds, mint and mystery seasoning with enough olive oil that it isn't dry. It's nice to sit outside in nice weather to avoid the crush of waiting patrons inside, and I don't know of any other Mediterranean restaurant with a store next door if you're inspired to try your hand at home!"], ["Nadia A.", "It was awful and shit dirty with spread insects around the tables. I wouldn't  recommend it for anyone. Also, they served us an old falafel which hidden with new one to cheat us. We weren't satisfying with either their service and nor their care at all."], ["Carrie L.", "I have to say I used to eat here a lot and the food is good.  The last time I went I found a black hair in my hummus not cool!  I haven't eaten here since I know this happens but when it happens to you it's different and I just can't eat there again.  Maybe in the future I will try it again but it's taken a while to even think about going back it's too bad, we loved it."], ["Faith B.", "There's not much new to say about this oft-reviewed gem in River Market.The service is great - super friendly woman at the register and the man who brings out the orders is nice as well.The veggie options include a falafel sandwich, a falafel platter, a veggie combo platter, a hummus sandwich, a veggie gyro and a baba ghanouj sandwich. They also have vegetarian dolmas. I've tried the combo, the grape leaves, the hummus and the falafel options. All are tasty.Take out service is fast.Their rice side is good, but oh so hard not to get hummus.And to top it off, no entree is more than $9.99 and that's meat.Love it. Glad it's near. wish they delivered to my hosue!"]], "Marble Top Cafe": [], "Aladdin Cafe": [], "Gyro Express": [["Scott G.", "I love this truck. Its located on hospital hill from 11 to 2pm and on Grand downtown about 12th street 10pm to 3am Friday and Saturday. There is no place to get Gyros downtown or midtown that is worth bothering. Mr Gyro in OP is great but who wants to drive 30 minutes. This place does not skimp, and they are perfect every time. I get them no hot sauce, no lettuce and no cheese. Perfect. The greek salad is also fantastic. Very friendly guys working."], ["Matt E.", "Have you seen all these food trucks showing up around KC? woooo-eee those things are getting fancy! What with all their locally sourced, vegan, gluten free, free range wonderfulness? That's all well and good for you high-falootin foodies out there, but some people like their food truck experiences with a little less pretension. Something tried and true. Something like Gyro Express.I remember stumbling towards Gyro Express for over a decade now, as a barely-legal drinker coming into Kansas City to party in Westport. 3:00 AM would roll around, and I'd stumble from whatever terrible bar that i thought at the time was awesome, heading into the general direction of this food truck. To this day I love their gyros. They taste like nostalgia. And tzatziki sauce. Yes, it is true. Gyro express makes a killer gyro. All lamby and tzatziki-ey. Pillowly pita. mmmmm.  What they also make is a killer falafel sandwich. Delightful fried balls of chickpeas wrapped in pita, served with the aforementioned heavenly sauce, lettuce and tomato? Vegetarian street night gloriousness. Today, this truck can generally be found in Westport in the evening, though I have seen it show up at 13th and Main off of the Power and Light District. I'm not going to say it's the best food ever. Often times I will pass it up for something a bit more highbrow. But when you're in a certain frame of mind, it more than hits the spot."], ["KK V.", "Fantastic Gyro- loaded with goodies!They have great Gyro's for a great price.  As of 2/11/13, you can get a combination Gyro (lamb and beef) for $3.75, the portion is large and you get get it spiced up with their chile sauce.  They are regularly parked out at Hospital Hill between the School of Pharmacy Building and Children's Mercy from about 11:00-2:30 (I could be wrong this is an approximate).  The service is quick.  Through cold, wind, snow, rain, and shine, I'll be there.  I've been to Chicago, New York, and L.A., this family serves up gyros that are just as good, and you can't beat the price.  Weekends you can find them at PNL, he price goes up to $5.00 but still well worth it after the Bars are closing.  Think of the price as shift differential and they have to put up with drunks! Additional Menu Items include the following: Felafel, Baklava, hamburgers, hummus, vegetarian gyros, soda, water, ..etc."], ["Lizzie B.", "This gyro truck is pretty much one of the staples for the various UMKC Health Sciences Students and staff, as well as the staffs of the hospitals located on Hospital Hill.... generally a small line outside it.  The truck generally parks on the right side of Holmes between the pharmacy school and the medical school.The beef and lamb gyros are wonderful (mine and my husband's favorite gyros in the city).  Love the hot sauce that comes on them and the tzatziki sauce is very flavorful. The falafel sandwich is great for when you want a change of pace.They don't just carry middle eastern lunch items... there's burgers, tuna sandwiches, club sandwiches, and Philly steak sandwiches.Their prices are low (hence the heavy flow of students who love them)... all the sandwich and meal items run under $3.50 with sodas running about $0.75 = less than the machines in the schools.  I typically get a gyro and baklava for a total of $4.50... and tip the extra $0.50 from my fiver.Oh, today while I was in line... I learned that you can call your order in ahead of time... you don't have to wait in line! = great if you are short on time!"]], "Max's Burgers and Gyros": [["Jeff H.", "food was good and done right. only negative that i have is that a gyro combo should not cost 12.00. make sure of the cost before ordering, something smells fishy."], ["Bri R.", "Great food, good prices and an awesome little place. Service is great just be aware they have a small staff so you may have to wait a minute or two- but it is really worth it. I recommend it; the awesome thing is you will be supporting a local business too!"], ["Sarah S.", "Best Burgers EVER! That's all I need to say :)"], ["Kev L.", "Man this place is old-school to the bone.Nothing but heart-clogging, artery infesting, greasy, beefy BURGERS.And Gyro's too for the slightly more health conscious :)My co-workers swear by this shop. Not much to say here other than the burgers are ground fresh beef and made to order. Has to be tops on your list for some of the best burgers in the KC area. There is also another location out on 63rd as well, but I have yet to go there."], ["Fike D.", "Omg this was so good. I went here on a cold day and had never been here before. I went with a bunch of my friends for some lunch. I got the mushroom and onion burger. It was probably one of the best that I've had in KC. My friends got shakes, tots and a gyro too. I had a little of each hahah. The interior was small, but I like places like that. We came in and dominated the room. I would go here if you are in the mood for a no frills, solid burger and fries. Unpretentious and delicious."], ["Danny L.", "This is the best cheeseburger Ive had in Kansas City.  I've been to all the other places... and they are good dont get me wrong.   Max's however is without a question just place incredible.   Everything is fresh and tasty and I know that burgers are usually greasebombs... these are not TOO greasy, which can be unappetizing to say the least.  Some reviewer said that they have Gyros for the more health concious, but Im not sure HOW exactly that it is.  Its greasy lamb with yogurt sauce lol.   Get the tots and leave the fries alone cuz they are to die for here.   Onion RIngs are pretty outstanding as well."], ["Dave H.", "This May be the worst burger in town. Really salty, falls apart, typical sysco frozen meat puck on a stale bun. $20.00 for 2 sandwiches 2 cokes no sides. we won't be back. I only gave it 2 stars because it is a cool little spot, but the food does suck."]], "Solav Mediterranean Cuisine": [], "Shahrazad Cafe & Market": [], "Pita! Mediterranean Grill & Take Out": []}