{"Los Tules": [], "Ixtapa Fine Mexican Cuisine": [["Emily G.", "Easily our favorite place to get authentic Mexican food in KC. Great for date night or a family meal. If you like sweet flavors, ask about the bacon-wrapped chicken with raspberry sauce. I think it's new, so not on the menu, but it's unbelievable!"], ["Stacy S.", "I have dined here a few times over the years and have always enjoyed it.  I ate the Camarones Ixtapa, and it was delicious.  My four companions thoroughly enjoyed it as well.  Prices are quite reasonable.  The service was efficient and friendly."], ["Casey W.", "The bars isn't much but if your there for that then you are there for the wrong reason. The tacos are great tortilla soup is awesome. Salsa is a big deal for me being from Texas and this place has pretty good salsa before and with tacos. I say if u haven't been here its worth a try. Don't touch the plates and let your food cool down also, it can be pretty hot of the press..."], ["Jacquie T.", "Yes, Tacos Chidos are the best. If the owner happens to be in and visits your table, be prepared to be entertained. He is into his food and will tell you all about it. He does have have something to talk about. He has true Mexican food and it is wonderfully good."], ["Diana M.", "The service here is hands down the best you will find! The food was prepared wonderfully. We throughly enjoyed their chips and salsa as well. If you like authentic Mexican this is the place to go."], ["J N.", "I've given this place 2 chances. Way over rated. Priced too high for quality & amount served. Wouldn't go here again if it was free!"], ["Casey S.", "Service was poor at best (this seemed to apply only to us). I thought food was ok (not worth a return trip). Wife was extremely disappointed on pretty much every level. Her food was not good, they didn't have common appetizers such as chips and queso, and she didn't like the salsa (I thought it was ok again nothing special). Overall we won't be heading back anytime soon."], ["Sarah K.", "The restaurant itself is small but tastefully decorated.  I was greeted and sat very quickly. The menu has a wide variety of options.  Unfortunately, I found everything I tasted to be subpar. The salsa was extremely mild and had very little flavor.  My main dish (beef enchiladas) was almost flavorless. I didn't taste any seasoning in the meat and the enchilada sauce was very watery and lacked flavor.  The rice was bland and didn't have any vegetables in it.  I also found it odd that the cheese was so mild tasting.  I wanted to ask for a side of spicy salsa or pico, but my waiter never came back until I appeared to be finished with my meal."], ["Shellie W.", "Hole in the wall!!!!! BUT the BEST hole in the wall in Kcmo!!! Ixtapa is a more traditional Mexican food place. If you want Tex Mex this is not the place for YOU, however, you will be missing out on some AWESOMENESS! So, I have been there a half dozen times and the food never disappoints. The service is good but it depends on who you have. I wish I remembered the one waiters name because he was awesome.Now, the bad part.....the Margaritas...sigh...taste like a cheap mix where the alcohol is already add...need I say more. My recommendation is to go there and enjoy the food skip the drinks but enjoy the food"], ["Ginger K.", "Decent food. Slow service, with no personality. Only three other tables were seated, and another server seemed to have all of those tables. We felt as if we were inconveniencing the guy to be there. He wouldn't have had to make so many trips if he asked what we needed and remembered to bring more than one thing at a time. He mumbled that if we asked for more salsa, we'd be charged for them. So, keep in mind, 2 bowls of salsa is all that is allowed per a table of five adults. Their prices are outrageous enough, certainly not worth it. I had two .99 charges on my tab, which I assumed was the salsa. But, my mom also had a $1.99 charge that we never figured out. Years ago, we went here and it was much cheaper and a much better experience. The owner chatted with us and explained some featured items on the menu. Today, I was so embarrassed to take my family here, after raving about it. We will not be back."], ["Jeroen W.", "I was eating there once but won't repeat it. Mixed plato taco/burito/something else, nothing was pleasant to eat and the beans a poor puddle of what mexican beans should be."], ["Matt O.", "It was our first time there and the owner personally introduced us to his menu. He made some recommendations that we acted on and boy was it tasty food! My only issue was the portion size was a bit small for the price they charge. I'll definitely go back, but will likely try something different.Don't order the frozen margaritas; they are expensive, small, and have minimal alcohol."], ["Brieanne H.", "This place is a total diamond in the rough.  I say it's rough because, well, it's located in a random, kind of trashy looking strip mall across from Zona Rosa.  The inside is clean and not offensively ugly, which is basically all I ask for when it comes to restaurant ambiance.  But man, they deliver on amazing food.We live pretty close to this place, so we find ourselves going pretty often--I've been there at least five times, and the food is consistently awesome.  I love it, my husband loves it, the friends and family members we've taken there love it, and our toddler even loves it.  That said--this is not your typical gooey cheese coated Tex-Mex you get at most places.  The food here is fresh and focuses on really cool combinations of flavors, spices, and more exotic ingredients.Favorites include the carne asada, and the pollo mariposa.  I could drink the mariposa sauce straight.  Oh, and their margaritas are strong and delicious and not overly sweet--highly recommend.Tip: they almost always have some sort of Groupon going, which is a great way to save some money, even though they're pretty cheap as is."], ["Lindsay L.", "I love this place. It is a great family run atmosphere. The is often a line if you go at peak dinner time. (The line means it's good!) The food is AH-MAZ-ing. They love to make recommendations and once in a while bring out something extra for you. This is not your typical Tex-Mex place. The food seems authentic and the spices and flavors are delicous. The Pork Oxaca is one of my favorites. We always bring out of town guests. The service is quick and friendly and they start to recognize you after you've been in a few times. Delicous. Amazing. We moved here from Colorado and I think it beats any Mexican restaurant we tried while we lived there. So that's saying something."], ["Keith R.", "By far, the best Mexican Food experience I've ever had. The word that comes to mind is authenticity. Ixtapa services completely authentic Mexican cuisine, how do I know? They make everything from scratch right down to their ice cream?And food isn't the only thing authentic about Ixtapa. The waiter used Spanish phrases, but didn't make me feel left out at all. His explanations of the cuisines and understanding of the process to make them made me feel confident in the menu choice I was selecting. I recommend Ixtapa for breakfast, lunch, dinner, and whatever else reason you can find to get a seat in there."], ["Christy K.", "Okay, let me start by saying I wasn't expecting it to be much. Well, I'm happy to say I wasn't disappointed! We started with the queso fondito (I apologize for my spelling errors) super yummy! Gooey cheese, grilled onions, mushrooms. Perfect corn tortillas, the right amount of soft and just a little crunch. My husband ordered the steak mariposa And I the chicken a la creme. What can I say? Other then YUM! Will defiantly be telling my friends and be returning!"], ["Ryan G.", "Wow, what a great experience!  Dont let the modest location fool you, this is top notch, authentic, culinarily forward food.  The owner is all personality and personally touches every table to romance the food.  Excellent experience."], ["Sean R.", "Best Mexican I've ever had.  Great experience with the owner explaining the menu and recommending dishes based on our preferences.  A+!"], ["Johanna W.", "Omg stumbled on this restaurant while working in Kansas City.... I am in love with it... Victor helped us out and was amazing.... the food was authentic and so delicious... not smothered in tasteless sauces.... all of it was a pleasurable experience and definitely will be visiting again before heading home"], ["Kelly I.", "Best Mexican food I've found in Kansas City.  Being a native SoCal resident I found it to be authentic and affordable. Alejandro, the owner, was great at making recommendations for food. The Queso Fundido appetizer is a must-have if you like green salsa and mushrooms and I had the soft tacos lunch which was also fantastic!"]], "Drunken Worm": [["Brian D.", "First time here and and hopeful that I will get back here before I leave the KC area. Service was excellent. Bar Tender/waitress was very helpful in explaining the menu, specials and drink selections. Taco Tuesday special 4 beef tacos for $2.99. These tacos were good but if you looking for authentic Street Tacos these are not the ones. But wait, Taco Tuesday is every weekday from 11-3. How beautiful is that.The Tilapia tacos were excellent but to much heat for my wife. I could eat these all day long."], ["Benjamin R.", "We were on the hunt for a new Taco Tuesday spot and couldn't argue with Drunken Worm's special - 4 beef or bean tacos for $3.  Here's the great thing about this place - that's their daily special from 11am to 3pm - Monday through Friday.  That's real KC right there - four hours of Taco Tuesday 5 days a week!We made it in in the middle of the second inning of the Royals game to find a nice, dark, fresh from the luchador doorman to the bottles of liquer infusing on the shelves, but still divey enough place to be home to the neighborhood locals stretched out across the bar and suburban tourists alike.  We got a couple of strong margaritas and an order of chips and salsa to start with, and not too much later our bean tacos came out - nothing too spicy, just black beans, lettuce, some cheese, and the mildish house sauce in the bottle - at about 80 cents apiece, it's a solid deal.  We got down to business with the squeeze bottle and the Fire Roasted Tomato salsa that had come out with the chips.  Four apiece went down and we decided to upgrade to the regular menu rather than another round of the special for no other reason than straight up gluttony.  We each ordered two orders of the regular menu Veggie tacos, along a side of beans and rice and spanish rice.  The last set came out fast, with the tacos in soft flour tortilla., with roasty portabellos and a little more heft than the special   The sides are nice to haveThe last bit of our margaritas washed down the equivalent of two meals apiece, several great defense plays were made by the Royals, and the guy in Cleveland set off the fireworks at the right time  - all in all, another great Taco Tuesday and I'm already looking forward to the carryout option on weekdays!"], ["Ashley W.", "Terrible service and will not be back! We have been several times before and always thought the place was great! This time, we could not get a drink refill! We stacked 5 cups up along the end of the table, the staff actually walked by 3 times and didn't even budge to acknowledge that we needed refills! When the bill came, first it was wrong-then we were told we already paid (which we did not)-one person in our group was given 3 receipt copies, the first one was for $11.00 and then the other two were $20.00! None were correct and his card was charged for all."], ["Neeca B.", "Good night for tacos under the stars. Sat down to a wabbly table and ordered a margarita. Followed by a tilapia bowl, fully appreciate this option that any taco can be turned into a bowl. First bite was delicious and after that couldn't taste anything due to the insanely spicy sauce. It was a smokey sweet chipotle sauce, next time ask for it on the side. It was on the small side but beautifully prepared with large chunks of tilapia and avocado on a bed of rice and black beans. Sprinkled with fresh queso. My fella was thoroughly impressed by the shrimp tacos, tasting better than they looked. My margarita was big and beautiful with just the right amount of sass. Service was decent, batender was the only one on duty. We arrived to a virtually empty house and minutes after arrival it was getting down to business. Its got a divey nacho libre bar feel to it, Im in to it.It's west 39th street and badly in need of a parking garage. Almost every spot is accounted for with the threat of being towed if not the proper occupant. We got lucky and found a street spot."], ["Jennifer M.", "I was a little skeptical when I thought Mexican food but walked into a very white hipster-looking bar with an eclectic decor. I was surprised though at the food, which is more bar tex-mex food than it is actual Mexican food. Their queso is good and velveeta-y, but comes in a tiny bowl that will only last you half the chips. Their tacos are loaded with meat & goodies, soft tortillas, and their quesadillas are probably my favorite. Grilled just enough so you get a bit of crunch and loaded with the perfect ratio of meat, cheese, and veggies. They have a large selection of nachos to choose from, as if the chips and queso we ordered weren't enough. Nachos are decently loaded with the fixin's although I could use a bit more load. Overall though, great service and good place for some Tex-Mex and beer."], ["Sya N.", "Yummy-licious! Taco Tuesday - 4 beef or black bean tacos for $3! Adding their taco sauce made it hit homerun. The manager, Matt was very nice, he went over the specials with us. This is now my new lunch spot (fast service and under $5). They had a basket of different hot sauces but you wouldn't need it because it mask the flavors of the tacos. I will be back soon for their happy hour and try their infused tequila with their $1 off nachos!!!"], ["Wally W.", "Having chips and margaritas, both of which are great.  Can't wait to come back for food.  Great crowd and atmosphere."], ["Chris G.", "Excellent selection of tequila and great tacos. Service was great and there were plenty of TV's to watch college football on Saturday."], ["Tyler Z.", "Drunken Worm claims to be a New Mexican restaurant.  It is not.I've lived in New Mexico for 2 years. Summary: Drunken Worm, at its best, simply serves warmed up Sysco food with zero additional effort.New Mexican food is different than Mexican food in that it is served with Red or Green Chiles.  Drunken Worm chooses to serve NEITHER on top of their food or as a side. In fact, they don't even have red or green chiles in the restaurant. The flavor added to their food can only be described as boring.  There was next to nothing added to the raw ingredient. I wonder if they even salted the meat they used...?Secondly, we ordered their chips and guacamole as an appetizer.  The guacamole was obviously frozen, had blackish spots, and had a huge avocado in the bottom of it that wasn't 'blended.'  Grade: D-.  The food we ordered (6 types of tacos) were all underwhelming.  They had zero flavor profile, lacked essential Mexican spices, and the sauces were pathetic. We couldn't finish our food.The chicken taco basically had Alfredo sauce poured on top of it.  It was terrible.I do not recommend this restaurant at all."], ["Ryan R.", "I went into the Drunken Worm without any knowledge of the establishment at all and was pleasantly surprised.The name of the establishment is cleverly crafted for a taco bar. This isn't just any taco bar however, the tacos are also cleverly crafted. I personally got the Taco Choice option on the menu for $7.99 which is any three soft tacos with rice and beans which is incredibly filling! I ordered the shrimp, tilapia, and pulled pork. Each taco has a unique savory flavor. My tacos had a lot of cabbage on them, so much so it was hard to see all the ingredients, but delicious none the less. I was not a huge fan of the tilapia taco specifically but it was not bad by any means, just not my particular favorite. The rice had a great flavor but the beans just didn't do it for me. You are definitely paying for the delicious tacos not the sides. We also got the .99 cent chips and salsa as an appetizer and the salsa was really flavorful and the chips were fresh and warm! Well worth the buck for that.While the bar may feel small, the staff is definitely friendly. We were taken care of very well the entire time we were there and while they weren't full, they had a lot of customers for a weekday evening. We felt like they definitely were attentive and helpful at every turn. Their tap selection isn't what I would pick but they do have a lot of Mexican beers on tap which is pretty different and unique. They did have a lot of great craft beer in bottles though including a lot from Odell.The only thing I didn't care for was the crowd did pick up while we were finishing up, and in a small area like that with everyone packed in, it got pretty loud but hey it's a bar what do you expect! Be merry!I'd love to go back and try their weekend brunch sometime soon, I'll definitely update when I do!"], ["Crystal M.", "Anything that is cheap and edible is a winner in my book. So I kept driving by this place and kept seeing the sign that read 4 tacos for $2.99, I was on the hook just like the Drunken Worm! The tacos were not the best I've ever had, but definitely not the worst either. I had the 4 hard shell beef tacos, they were decent. My waiter asked if I wanted hot sauce, I said yes please and he proceeds to bring me a tool box full of different types of Tabasco like sauces, I then proceeded to ask for real Mexican hot salsa which he brought promptly. I will be back soon to try the black bean tacos which I hear are marinated in cilantro, onions, pico, and spices. Yum!"], ["Barbara S.", "This establishment is small but fun. I came with a friend and we sat at one of the high-top tables. First thing I noticed was a menu. A menu! I hadn't known you could eat here. And not only that, they serve brunch on Saturdays and Sundays with bottomless $10 mimosas. How has nobody told me about this place!? It doesn't look like much from the outside and it's squeezed in-between two other bars. I normally frequent the Hi-Dive Lounge next door but today we were up for something different and I'm so glad. So. Drunken Worm is a hole in the wall bar wall with lots of Mexican decor and TV for sports. It's a sports/tequila bar if there is such a thing. The decor is definitely more south of the border than sports bar, so I appreciated that. They have nightly specials too. I was there on a Sunday (Easter at that) and they had specialty shots for $3.  The bartender was super friendly and the place was crowded but not packed. It was their menu, though, that blew me away and I will certainly be back to try all the food!"], ["Tyra W.", "I'll be frank: I hate tequila. I'm one of those people but one time...I tried a pumpkin spice margarita here. Holy grail of all things basic in a margarita form!As you may imagine, it was mighty thirst quenching and the strawberry ones aren't bad either. The bartender Laura was very friendly and kept the drinks coming. She recommended the worm dip and (by no surprise) we loved it! The place itself is a bit smaller but more than cozy. Highly debating adding this spot into my usual rotation!"], ["Bobbi K.", "Friendly people, wonderful service great tacos! They also have breakfast until 2:00 pm on weekends! Fun atmosphere is warm and welcoming."], ["Justin E.", "I've eaten here several times. The food is made to order so be patient.  Really this is a long over due response to Tyler =0 friends, 1 star review. I love it when people says \"I lived in _____\" as if this makes you an expert. Sorry throwing green chilies on something doesn't make anything New Mexican.  I was eating at a BBQ joint in Los Angeles who said they served St. Louis style BBQ. I don't even know what St. Louis style BBQ means much less New Mexican. I've had lots of food with green chilies that never proclaim to be from the Land of Enchantment.  You use \"flavor profile\" which I've only heard wine snobs use such a meaningless term. You're eating tacos not on a napa valley tour. Are you starting to catch on that you live in this complete hack of a nation where people think X because they're from Y. Your geographic location means nothing just like your review of the Drunken Worm."], ["Angie H.", "this place was great, quiet during the lunch hour, cheap tacos 4 for $3, sweet heat shots $3, mexican martini was amazing!! doesn't hurt that the bartender was hot!! looks like he was running the place alone too. i may go back tonight for happy hour so i can try his infused tequila!"], ["Meredith R.", "I offically love this place!  I went back last weekend to get some food and a margarita while in the Westport area.  I tried the chicken nachos and my husband had the beef soft tacos.  I also got a house margarita.  The chicken nachos were amazing!  I love that they had some cream cheese in there!  The chicken was very tasty as well.  My husband loved his beef tacos so much that he ordered two more (and it's rare for him to like food that much to just get more of the same).  I had some of his rice, which was also really good.  I loved that the service was so fast/friendly and that they were able to make our stuff to order (since my husband had some things left off of his tacos and this wasn't a problem at all for them).  The margarita was huge and not too sweet.  Cheers Drunken Worm!"], ["Jo G.", "HOW have we not heard about this GREAT little place?  Dive-y, just the way we like it.    Our big party (8) was seated in the front and well taken care of by Jake, and we loved the fresh chips, the guac, the chicken nachos and their \"house\" black bean dip.  My shrimp taco was outstanding, steak taco good but not as stand-out as the shrimp.  Cheesy corn ok.  Pinto Beans, WOW.  Upgrade your margarita, for certain.  Not sure why they don't have hard shell tacos available for dinner--which limited my gluten-free husby's meal choices.  We will SO be back--this place goes in our regular \"Taco Tour\" rotation."], ["Emily L.", "My boyfriend and live walking distance from this place. We go there once every week or two because it's not only close, it's also become one of our favorite places. My favorite menu item so far is the chicken drunken worm tacos. Those plus their rice and beans are all incredible. My friend let me try a bite of her tamale the other day and it was also delicious. Modelo is my usual go to, cheap and delicious.But the bartenders are also very knowledgable about their selections and are always accommodating to help you figure out what kind of cocktail you would like.Annie is usually my bartender and she is always super nice and bubbly. I could go on and on about their delicious food and tequilas, but I'll leave it at 5 stars and say I highly recommend!"], ["Kathy M.", "Hubby and I felt this place had a cool neighborhood bar vibe. The staff was friendly and helpful. We had lunch and so I can't really tell you what the place is like at night, but I'm guessing it would be fun. I had 2 shrimp tacos and felt they were very filling. They had a nice flavor with lots of cabbage for crunch and little onion rings on top. The black beans were nicely seasoned. Hubby ordered the tamales and thought they were very tasty. Our only negative comment would be that there was quite a delay between when his tamales were brought to the table and when my tacos showed up. They weren't busy, so I'm not sure what caused the delay, but it's awkward when one person has to sit and watch the other person eat. We spent $18 for two lunches and a beer."]], "Ponak's Mexican Kitchen": [], "Port Fonda": [["Kaitlyn T.", "Port Fonda stays in my regular rotation! It has such a great atmosphere and food to match (or surpass) it. While the menu may seem slim at first glance, it does not leave you wanting in the slightest! The chimichanga of the day is always on point and all of the enchiladas are incredible. Don't forget to try the guacamole as an appetizer because I love that stuff and I'm not an avocado person at all. If you are around Westport earlier in the day on a Saturday or Sunday, you HAVE to stop in for brunch! They have an incredible Bloody Mary/Maria bar and the huevos benedictos are one of the best brunch items I've ever had. I would suggest calling ahead to make a reservation if you are going during peak brunch/dinner hours because it's not a huge place and can fill up quickly but they are always happy to accommodate reservations when possible."], ["Cheryl B.", "I really like Port Fonda... I like the vibe, I like the location , I love the drinks!  On my visit yesterday we decided to sit at the bar, which is not unusual for us. You can usually chat with the bartender and learn drink recipes and sample drinks you otherwise wouldn't be able to.  Which was the case yesterday, the bartender let us try their house made Pina Colada..OMG was it fantastic!!!  I will be ordering it next time for sure!!  With my meal I had a drink called  \"Boat Drink\" which was made with Rum, Tequila and tropical flavors such as coconut and pineapple.  It was amazing!!  However, there is a 2 drink limit per person on this drink...so beware!We went on a Saturday which is the brunch menu I believe 11-3.  My husband and I both had the Chimichanga...ahhh-mazing!!  It was filled with shredded chicken, rice & corn.  The creamy sauce poured over the top made this chimi delicious!  It was more than I could eat and kept me full all day!  We also had the salsa sampler, which included a little bit of guacamole and some very nice, unique sauces. While sitting at the bar we were able to discuss drink and meal choices with the very nice bartender; which was nice. Don't go to Port Fonda with a headache or if you are planning on having a nice quiet meal.  Port Fonda is full or energy and laughter.  They have several flat screens going with sports playing and people cheering near each tv.  Do go to Port Fonda if you're looking for good Mexican food, a break from the norm (Port Fonda is not your typical Mexican food), some people watching and some amazing drinks.Try the queso fundido..Port Fonda's queson fundido is one of my faves in all of KC!!!"], ["Tyler H.", "This place has fun and attractive decor, attentive service, and great location. The quality of the food is above average. I've been to Port Fonda twice and the first time had one of the tacos plates which was really good, except the texture of the tortillas was a little weird. I prefer flour and I think they were corn. This dish came with beans and rice so I left full and satisfied. This time I got the enchiladas pollo. It was served in a little skillet about 6\" in diameter so they weren't that big. This, coupled with the lack of beans and rice left me hungry when I left. No chips and salsa included either. I was going to order the chips and guac to make up for what my main dish lacked in volume, but passed after I saw they were $8. I'm starting to think that while the food is quite tasty here, the little things they exclude just make me feel cheated. I don't think I'll be back unless it's to try brunch, maybe it'll be a better experience."], ["Alison M.", "I really want to like this place more than I do. The vibe is so fun - the interior design and decor (by Utilitarian Workshop) is out of this world. Who doesn't love the light up Port Fonda sign inside or the sitting bar outside where you can people watch while having a drink?However, that being said, I always leave feeling I've been somewhat cheated. The service is never on it's top game because the wait staff seems stretched too thin for how packed the place is. It's not terrible, but not great either. The drinks are good, usually strong. The last time I was here I had the watermelon mint margarita, which was the perfect drink for a hot summer day. Food can be hit or miss. I've ordered the fried oyster tacos for a few different dinners now and have had different quality come out each time (a bummer since I'd expect something like tacos to easy to keep consistent). Overall, the check comes, I look at how much I paid, and feel like for the price I could have had a number better meals in town.Will I come here when I'm craving a marg to sit outside after a long day of yard work? You betcha. Am I going to come try brunch since I've never been before? Maybe, if someone twists my arm. But I'm sure not going to come here for dinner if it's not during happy hour."], ["Josel B.", "Dedayuno (Brunch) was muy fabuloso! First time eating here and I'm glad I came in for their Saturday Brunch!I've heard a lot of good things about this place and boy were my friends right! Right off the bat we ordered chips and guac + chicharones...and both appetizers blew me away! Guac was fantastic with a surprise twist on chips...they were thick like pita chips, DELICIOUSLY CRUNCHY! Guac had plenty of onions and greens in in it so it was loaded with healthy toppings. But to be honest....THEIR CHICHARONES WAS AMAZING! #HolyGrailofPortFondaThey were housemade chicharones (pork rinds) and can be served with various sauces. Server was excellent and recommended two spicy sauces that were creamy and complimented the chicarones in a bang in your mouth kinda way. I would definitely come back for the chicharones alone!My Desayuno meal (Brunch):The Port Fonda Breakfast: Consisted of two huevos (eggs, I got them as sunny side up, YUM!), two sausages, mini potatoes, and beans. I also got a side of sliced avocadoes that paired with their sliced tomato/onion salsa on top of the eggs made the dish into perfection!Great prices for brunch time. Both chips and chicharones were $5 each and the Port Fonda that had very large portions was only $10.50!I would definitely recommend going in for their Brunch on Saturdays and Sundays from 10am-3pm! Great Prices and awesome brunch specials!Feliz Eating! (Happy Eating!)"], ["Ray B.", "If you're coming to this restaurant for good service and a pampering than you've got something coming to you. Don't fuss with the margaritas just order an awesome chimichanga (or 2 - not kidding), chips and guac and a large water. This place is run by hipster aholes who will basically ignore you. That's okay - bring your own company and nosh out on the killer food.  Get drunk elsewhere as the Rita's are just okay. We will be back."], ["Deana W.", "Prices/ Value- 2 StarsService- 3 StarsFood- 3 StarsMenu options - 3 StarsDecor- 4 StarsWhat would I eat again?     \"Donas de Requeson\" - light as air ricotta doughnut balls fried to perfection and rolled in cinnamon sugar.  The interior of the doughnut  had a tender, moist crumb.What do I wish I would have tried? A Pear Serano or the Rozelle Margarita. Everything tastes better when I'm a little warm and fuzzy!Chef Patrick Ryan of Port Fonda was just nominated for \"Best chef : Mid West\" by the James Beard foundation ...Kudos for that!  Way to represent Kansas City!Unfortunately, my lunch did not live up to my high expectations. Maybe it was the fact that I hadn't eaten breakfast, and now by 12:30 I was starving! Perhaps it was as simple as ordering the wrong menu items.Either way, We went in hungry, and we came out hungry!  This is the place to go if you have ever said \" I've got a whole lot of extra money burning a hole in my pocket but, I don't really want to eat a whole lot\"! I spent $42 for lunch. The break down:  The Carnitas- 2 small soft shell tacos.  Shredded pork, shoulder, grilled pineapple pieces, onions, and cilantro served with a small side of rice and black beans- $12.   The Chimichanga del dia- chicken, rice, corn and black beans. In truth, most of the filling was rice with a few pieces of moist and tender chicken, accented by smattering of corn and black beans. The chimichanga  was fried crispy, but I found that the bottom of the tortilla was difficult to cut through, even with a knife. This is a small chimichanga by anyone's standards, perhaps 4 inches long and round. The star of this dish was the lovely cream sauce-$14.   A rice/milk-based drink -Horchata -$4.Donas de Requeson- 4 light as a feather, fried to perfection, ricotta doughnut balls, rolled in cinnamon sugar served with a thin, boozy, Tres Leches sauce-$8.Happy hour is Monday- Friday 3-6And Monday -Saturday 10 PM until close.$4 Mexican draws$5 House MargaritasEveryone should judge for themselves, why this chef was one of the few chosen to  be on the short list to represent the entire Mid West. Come in for happy hour and get warm and fuzzy while the weather is icy cold outside.  Remember to buy mad quantities of ricotta doughnut  balls and dip with wild abandon!"], ["Austin R.", "This place was okay. Chips were waaaaay too salty. My carnitas tacos were gross but I did appreciate the fact that they offered to replace my meal. I enjoyed the chicken tacos. Drinks are overpriced. It's Lawrence Kansas not power and light is $10 for a glass of sangria is a bit high. Waitstaff seemed annoyed by us because we wanted to sit and chat. We got the feeling that we were the only reason she was still there. As of now, I won't be returning."], ["Joey F.", "Chimichanga is a dish tdf (to die for)!  Good Mexican chill spot with tasty margaritas.  Thought it was a little overpriced, but the portions are bigger then they look.  They have a lot of non-typical dishes on their menu, but then have enchilados and tacos.  Best part is that they are opening up a restaurant in Lawrence!"], ["Sara D.", "Quite possibly the most pretentious, over-rated place I've ever stepped foot into.From the very start we were told: NO you can't sit on the patioNO you can't sit by a windowNO you can't sit at the corner table, eitherThen: they were out of a few things on the menu. When I asked the waitress if they had any ciders on the drink menu, she made me feel like a teeny, tiny mouse stating that \"No, we only serve the BEST kinds of beers here at Port Fonda.\" She then asked my friend to translate what I was trying to order. She up-sold us on some chorizo appetizer that was'nt good. The chorizo was brunt to the bottom of the skillet and we had to scrap the pan with our forks the entire time.Their saving grace was the entree. I got something with meatballs and the meatballs were spicy and delicious. My dining companion enjoyed his entree as well and LOVED the fried egg on top. We dropped $44 on lunch.No bueno."], ["Jack B.", "In the heart of thriving Westport, this hip Mexican restaurant/bar blends original Mexican food with original cocktails that is perfect for both the food critic and the unassuming customer looking for good Mexican food,Attentive service right away, house-made syrups used in their margaritas, and 6 different house-made salsas. I had the chimichanga (as other reviews state, truly the best I've ever had), and tried the tamales which were great. Had the fried donut dessert, amazing! Tequila-infused leche sauce, fresh fried dough, fruit.   We will definitely be back."], ["Chris P.", "Odelay kootoos for the brazen flavs chef compadre!! Just in town for the night, a local coworker said this neighborhood has several great places, but after I revealed   I have en engorged Mexi-heart (corrazon) el worko amigo said I had to hit up the not-so-French traitors at Port Fonda. These gringo sombreros busted out platefuls of tastiliciousness enhanced by the assorted sauces I kept trying. One can approach the Port with caution and be fine on the heat index, or you can conversely get something with a boot to the arse a la their habanero \"orange fear\" (which quite humanely isn't as hot as I've had). Supa-friendly service, loud hipster soundtrack, and a meal finalé with FRESH MADE DONUTS in some sort of (whiskey?) fruit heaven seals this as a respite worth returning to. Gracia!"], ["Brittney H.", "Why does this place only have 3.5 stars?? I'm from Kansas City so always try to stick up for my hometown when I can. But I live in Chicago and I must say, our food is in another level. This place has such a Chicago vibe from the atmosphere to the food. I even remember saying, \"Good job KC for stepping it up\". The interior is unique.  This is not the typical Mexican food you are used to, which is probably why I love it and possibly why it has mediocre ratings? It's higher priced than most places in the area but you're getting high quality food, so for me, it's totally worth it.  My mom and I sat at the bar for a little while and sampled some margaritas. I had the pear serano which was spicy and sweet, my favorite of the evening.  I also sampled the jalapeno apricot and prickly pear margarita,  also both delicious. We started with the pork rinds with guacamole. They were crackling while they came out on the plate. I remember my grandma buying these when I was a kid and thinking how gross they were. Times have changed! I couldn't get enough of these. They were deep fried but light and fluffly. The had some sort of ranch spice that kicked up their flavor. My mom and I split the squash blossoms and panza (favorite of the evening). They came with warm tortillas which were surprisingly filling. The panza had pork that literally melted when you cut it with a fork, smothered in a mole sauce with chorizo. It also came with a sweet,  cinnamon covered plantain - sweet and spicy together is the best combination and I feel the menu really used some unique ingredients to make great dishes. We asked the bartender why there was Blackhawks gear and were told the restaurant was inspired from the owner living in Chicago. Yeah...I knew there was a reason I liked this place. Thank god that Kansas City is making a name for itself in the restaurant scene! This place is slightly weird, definitely creative and deserves all of the praise it receives.  Next time I'm back in Kansas City... Port Fonda is my first stop."], ["Lori T.", "I so wanted to like Port Fonda. They have a cool vibe, the decor is great, but the food at brunch was overpriced and borderline disgusting. We had three items: Eggs Benedict served over biscuits, a cheeseburger that came on a sugary pink bun, and a spicy, meaty soup. Of the three, the eggs were the best but nothing a reasonably talented home cook could not make. The soup was very odd. You needed a fork and knife to cut up the stringy, water-logged, slightly burnt \"grilled\" vegetables. Also 2 large pieces of corn on the cob floated in the soup. There was no way to eat them, so they just bobbed around like life preservers bringing nothing to the party in terms of flavor. Finally, let's talk about the cheeseburger. I am a fan of stinky cheese, but this was not stinky cheese. This was objectionable cheese with an overpowering odor. The meat was good, but combine the awful cheese with the donut bun (The inspiration for some Jim Gaffigan Donut Hamhambuger references) and you end up with a fail. We did not try any drinks -- the Bloody Marys looked good -- so maybe the bar is worthwhile. But avoid brunch."], ["Maddie K.", "Great atmosphere. We had a nice waitress that was very knowledgeable about the menu. We never felt rushed while we were eating, but the hostess told us that they had reservations in and hour and 15min and would need the table she was about to seat is at and then said that was probably plenty of time to eat... I got the duck enchiladas-- super good, great presentation, appropriate portioning. Overall, good experience"], ["Tim S.", "Amazing dining experience starting with the guacamole and margaritas  all the way down to the enchiladas and chimichangas! We'll be back."], ["Brent K.", "I have only been here a couple times and let me tell you why, it's small, they take reservations and it's always PACKED to the RAFTERS! that being said, i am quite a fan of their rather ecletic variety of apps and soups, thick, homemade chips, creative drinks and absolutely beautiful people to bring it to you.my only complaint, is, I don't make reservations, for anything, i decide where i want to go and I want to go there, so this place is just too busy for my by the cuff lifestyle.  they should kick world burrito out and move in there.  they could easily do 3 times the business in a bigger place.  oh well.so in summation, i love their food and service and drinks and hate their reservations."], ["Amanda S.", "came here for brunch on Sunday. I had visited years before and LOVED it so I thought I'd bring my friends! One of my friends ordered the eggs Benedict with a hollandaise sauce cooked with bacon fat, and that was AMAZING! I ordered a horchata and the Sopa Port Fonda. My waitress repeatedly informed me it was the spiciest thing on the menu! It was so good: rich broth, masa dumplings and yummy pork belly to boot. Can't wait to come back here on my next trip to KCMO!"], ["Ashley R.", "The salsa sampler was awesome, and the margarita flight! We came for brunch and got the breakfast tacos, I definitely recommend them. This place has a great atmosphere and creative food!"], ["Todd E.", "What a great place. My family tried Port Fonda for the first time recently. The vibe in this place was great. Loud music along with trendy decor. My 5 year old was Bobbing her head to the music the whole time. My wife got some pork tacos, and I got a Mexican style meatball dish. Both of them did not disappoint. Next time we go back we will keep the kiddos at home. They were welcomed but this is the type of place you just want to have a drink or two, and just hang out for awhile. Will be back!"], ["Lindsey P.", "Great brunch! I had the Port Fonda breakfast and it was delicious. Definitely recommend this place."], ["Tina E.", "After eating at  Port Fonda, I still have not found an Authentic Mexican restaurant in KC. Port Fonda is more American fusion Mexican. This place is on the expensive side, Carne Asada was $15; the whole dish was the same size as the container that warm tortillas are served in. Everything tasted sour to me also. The salsa was okay, the rice and beans were bland. Felt like  I was paying for the atmosphere than the food. I was really hoping to like this place, but I probably wouldn't come back. I'd suggest Port Fonda for those who like small eats, happy hour, loud hipster-yuppie places. Otherwise check the menu on posted on the window before entering because that was our first mistake."], ["Team BK B.", "When we moved to KC, we were really excited to try Port Fonda. It looked like our kind of joint--new vibe, Mexican food. We couldn't have possibly been more disappointed after our visit. Not only was it loud, but whoever was in charge of the music continually changed the station mid-song. It was distracting and annoying.The portion sizes are a joke. We started with chips & salsa. Two tiny bowls of over-pureed salsa with a handful of chips, for $5. As soon as this came, we knew we were set up for a disappointing meal.He ordered the San Antonio Special, which was a tamale big enough for a Chihuahua treat. Just like the  chips, over priced.I ordered the carnitas tacos. 15 minutes after he was given (and finished with) his entree--no one said anything about where my tacos were--we flagged down our waitress & asked where they were. She said \"oh they must be working on them still.\" Working on putting together two tiny tacos with pre-prepared ingredients? Doubtful. While I waited, she brought me a ridiculously small portion of bland rice and beans. Thanks?Finally, 2 tiny, under-seasoned tacos that would barely even fill a small child arrived...for $12. I could've (should've?) gone to the store and purchased an entire pork shoulder and all of the ingredients to make carnitas myself for less than the $12 I spent on these.Despite paying over $40 (thank God we ordered waters, because with the way things went, I can only imagine a coke would've cost $5 without refills) for lunch, we were still hungry when we left.If you want to pay way too much for what you get just so that you can feel like a super cool hipster while you instagram it, put on your ironic T-shirt and head to Port Fonda.Had the service been even halfway decent, we might've just never returned. But our entire dining experience was so terrible, that not only will we never return, we have and will continue to tell all of our friends who are currently in the area or moving to the area to avoid this place like the plague & head down the street to Beer Kitchen for a delicious, reasonably priced burger instead."], ["Lauren H.", "The vibe is awesome and the music's just as good. The pomegranate margarita was one of the better ones I've had and the food was good.  This place is a smidge pricey."], ["Kendall H.", "Outstanding food. A little pricy but worth it. Some of the very best in KC. parking is terrible but this place rocks."], ["Elise M.", "I tend to agree with  some of the other reviewers who felt this was overpriced truck food. ProsAtmosphere and vibe- def hipster cultureMargaritas - original was good and was made with agave and not that crapppy sweet and sour mix. Waitress was very friendly and nice- overall good serviceApps great! Specifically pork rinds and guacamole ConsOverpriced for portions/quality. I had the # 2, and while I was full, I didn't feel the quality of the dish, when considering the portion size, was worth the money. I don't mind paying more for something if it's orgasmic or a large portion for leftovers(dishes definitely lacking in both)!Music is very loud as other reviewers have stated."], ["Matt E.", "NO CHIMICHANGAS? J/K, if you know anything about this place, you would know not to expect a typical Tex-Mex, lard-o-wrap supremo. They call themselves a Mexican joint, but really...I don't know about that. Well, no. They're certainly of the Mexican persuasion, and the food that I had was delicious, as was that of all of my dinner guests. But I would be hard pressed to refer to any of our meals as traditional Mexican. I enjoyed a ridiculously good meatball sandwich, and my dining partner chowed down on a sandwich of fried pork tenderloin. Both were just stupid good. Another friend enjoyed his mushroom sandwich, which I didn't try because....blegh mushrooms are gross!!!!! He sure liked it, however.Seriously, everything here was rad. My only, ONLY complaint was that all of our meals came with a side of fried pork skin, and while I tried to be game, ultimately it just wasn't good. We all had maybe two or three pieces, and donated 4/5 of our side to the compost heap. They just weren't appetizing. Other quick notes:1) gorgeous interior2) rockin' hostess. She's the best!3) I dig the art, specifically that on the way to the bathroom4) Crazy good drinks, but train your staff to not try and talk you out of ordering certain cocktails. I found that seriously odd.So yeah. Great place. Great food. I'm a fan."], ["John S.", "Westport early Friday spring night has lots of choices with out door seating and Port Fonda is packed outside anyway and filled quickly inside too. New Mexican beer for me was Victoria (see pic), it's excellent. Chips and salsa aren't complimentary but $5 and only 2 small ramekins of  puréed  salsas, one verde, one brown, both  homemade and tasty but nothing special for the additional cost and not really like anything I've had Mexican before. Tabletop hot sauces are also verde and brown/red, both interesting, red is more like a Carolina BBQ sauce or chipotle and the green a little like a mustard based BBG, both high in vinegar, neither bad but neither special. Tried the house special pulled pork chimichanga served in a \"creme sauce\" which ain't Tex-Mex but was very tasty and recommended regardless (without the creme sauce). To help overcome my lack of spice, waitress brought a homemade habanero creamy carrot sauce (not salsa) and it went beautifully with chimichanga too and it did have plenty of heat! Service was excellent, but this ain't Tex-Mex but interesting and worth a trip back to try something different. This is a happening spot for the young crowd with a great a variety of libations and food has interesting choices (see pics of menu)."], ["Ryan G.", "Good food and good service.  Lots of pork and interesting dishes.  I had the local pig tacos and it was great.  Guac was good also.  Portions are not huge and prices are a little high, but still worth a visit."], ["Jillian C.", "Chicken enchiladas with poblano cream and radish salad. It was awesome. And their chips, oh man, those are delicious. They had a red salsa that was creamier than a normal salsa you would get at someone else's Mexican place but the creaminess was the best part. It was yummy. The food was all standout, and the margaritas followed suit. It's a tad more pricey than other Mexican places, so take that into account."], ["L B.", "Pros: great menu, creative dishes, nice ambiance, friendly staff, clean bathroomsCons: portion of guacamole is way too small, pricier for what you get, not a fan of the sangria"], ["Jenni F.", "My favorite brunch and dinner spot for Mexican.  Get the Sopa Port Fonda for brunch with pulled pork, pork belly, and a fried egg on top with a build your own bloody maria bar.  For dinner my favorites are the chicharrones with salsas/guac and the Albondigas or meatballs, lots of spice and flavor!  They also have a huge tequila selection for those of you who like good tequila.The only downside is the music is super loud.  My friend and I went here once around 4 pm on a slow day, probably 1-2 other tables in the restaurant and we couldn't hear each other talk.  We would have stayed longer to have another drink, but the music was soooo loud that we left.  I'll return again and again for the food (hint: early on the weekends is the best time to go for brunch because the workers are all hungover so the music isn't as loud and it's easy to walk in and get a table), but may pick somewhere different if I want to talk to my dinner companions."], ["Amanda S.", "I have been going here regularly for a year now.  My all time favorite dish is the chimichanga.  This thing is packed full of hearty meaty goodness.  It's smothered in a creamy queso sauce.  I could honestly lick this stuff off the plate when finished.  The reason I'm giving it a 3 star rating, is that they have noticibly made the chimichanga smaller.  So much so that I walk out at lunch paying $22 for a chimi and water and need a snack in one hour."], ["Roshelle H.", "I love Port Fonda.  The food doesn't quite fit into a category, which gives it a little mystery and magic.  It definitely hints at Mexican, but it's not authentic, it's not Tex-Mex... Mexican fusion? Is that a thing?Yeah, I'm thinking too hard.  So, first, the food.  Salsas are good.  One of them doesn't really taste like salsa, and it's my favorite, probably because I eat the whole dish trying to analyze the taste and crack the secret recipe.  The tacos are delicious and straightforward.  Don't be afraid to try the \"strange\" meats like beef tongue.  You will miss out.Teeeeeequila.  If you want to drink tequila, my friend, this is the place.  I skip the fantastic tequila array and go straight to the mezcal.  It's like a sweeter tequila -- not every place has it, so give it a try when you have the chance.On Saturdays and Sundays, they have brunch and the \"Bloody Maria\" bar.  Brunch is a limited menu, but with a couple breakfast-y options.  I tried the chilaquile, my hubs had the Mexican biscuits and gravy.  Delicious.The Bloody Maria bar.... man, that's intimidating.  They give you the tequila or mezcal and a glass of ice and set you loose.  There is every kind of hot sauce, house salsas and sauces, spices, vegetables... bacon?  Have one or two of these, and you'll end up at home for an afternoon nap.I love the atmosphere and decor.  Colorful, easy lighting -- cool art illuminated on the windows.  It's a fairly small place and gets crowded fast at dinnertime on the weekend.  It's a good place to meet up later in the evening when you want a drink and something to snack on, though you have to take your chances with Westport parking.  However, weekend brunch is eerily desolate with the hungover masses still asleep in their beds."], ["Brant C.", "I give this wonderful gem, 3 1/2 stars. Fun atmosphere, great menu (which changes frequently), festive drinks and good service. All I can say is: get the Chimichanga! Groups are good, but be ready to talk loudly... Music averages 85 dB's. (What did he just say?) Fun, fresh, hip and great for brunch."], ["Amy W.", "Super unpopular to not be 100% in love with Port Fonda. The 3 times we've been the waitstaff's stress has been palpable. On our last visit the waitress wouldn't do a slightly modified item because, she said, the chef was very stressed out. OK. Jeez."], ["Adam S.", "This place is everything that you've read below. It can be loud, trendy, hipsterish, and do things it's own way. That being said, it's freaking perfect. It is an open space featuring the absolute coolest, hand-crafted wooden decor. It has an identity and relies on it. How often do you pick a Mexican place and realize it's pretty good/pretty average at the same time? That's how I feel about the majority of Mexican restaurants, but this is different.The food itself is unique and comes in smaller, yet filling portions than one might be used to at home. I have been more than a few times and haven't struck out on anything to this point. I even went during a Paleo-diet month of March and was able to enjoy pork rinds and guac along with my meal. I'm sure this place can rub some people the wrong way, but I think it is a potential KC staple that should be around for a long time. I know I'll be coming regularly."], ["Patrick B.", "I've now visited the Port probably ten times or so now and really wanted to get a good clear view of what this joint was about before I dedicated a full review. The location and the head chef were definitely hyped before opening and as far as I can tell, the hype has rightfully continued. Port Fonda has established itself as a go-to Westport destination for drinks and eats. Whether day or night, there always seems to be a crowd of happy people. The staff are friendly and knowledgeable and more than happy to make recommendations should you be brave enough to dive into the more interesting tequilas and mezcals the bar offers. Specifics are more fun anyway so lets dive in.The first thing I tried here was the Sopa Port Fonda and what a first it was. This dish is RICH and undeniably flavorful. It's also a pretty damn heavy meal for a \"soup.\" Loaded with pork belly, pork butt, chochoyotes and polished off with a fried egg, it has about everything you could ask for. Good luck finishing it all! This is perfect cold weather food.Fonda's enchiladas are perfectly cooked and carry with them a little spice. The poblano cream provides a perfect balance between spice and flavor and the entire thing just melts in your mouth. Lastly, the tacos. All three options are perfectly proportioned to fill you up and the flavors in each are balanced by pineapple or salsa depending on which direction you decide to go. Each come with a side of rice and beans which probably aren't that necessary unless you're ordering these after having a few of their drinks - at which point, the extra filling carbs might be right up your alley. Fonda's house margaritas are par for the course and rival El Patron in terms of potency. For those with braver palettes, the pineapple serrano margarita is an awesome combo of sweet and spicy.To really enjoy the unique aspect of Port Fonda, put on your brave pants and saddle up at the bar. Ask the bartender to introduce you to some finer tequilas or induct you into the world of mezcal. There are some truly unique and interesting flavors out there to enjoy and so much better than the average swill most people shoot when they order a tequila out. Can't say enough about this spot, so ensure it's on your list. You'll no doubt have an excellent experience."], ["Tim M.", "Okay I went again. Everything was really good. But I just don't understand why such a relatively new restaurant keeps changing the menu. The amazing tempura vegetables are gone. We were able to find somewhat decent substitutes, but apparently these didn't sell well. Ordered a little bit of everything, and all of it was good. But damn, I miss those vegetables. Some have said it is too loud (the music) and I don't doubt it. But I do crave the food, and I try to go early before the volume gets out of control. Based on the food alone, though, it's definitely five stars. A little hipster, perhaps, but they spend money too. Right? Enjoy yourself, savor the food, relax and take it all in."], ["Karla M.", "It pains me to have to give Port Fonda 2 stars.  I.LOVED.THEM.  But alas that was 7 months ago and my most recent visit left me with a sour taste in my mouth, not literally.My hubs had made a reservation for Saturday night knowing that I was smitten with Port Fonda.  We were quickly sat and all our interactions with the staff were great.  I knew immediately that I wanted a Michelada (fave drink next to a g&t).  Delish as always.  We then perused the menu - which has changed since it opened. I'm not sure if it changes seasonally or if they're going for something different but nothing really seemed appealing to me.  All the tacos were tacos that I can get in KCK at a bitchin' little hole in the wall with FRESH HOMEMADE tortillas.  The cazuelitas were also very unappealing but it's not like I could say \"Babe, this menu sucks. Let's bounce.\"We ordered some guac, chips are still FIRE, guac still needs some acidity. Then we did the lengua (tongue) tacos, carnitas, and shrimp cazuelita.  The tacos were typical, nothing to really set them apart from what I've had in the past at other Mexican places. They were a little bigger (bigger tortilla) but the tortilla seemed to be a \"La Mission\" corn tortilla heated on a hot plate.  They were reasonably priced though about $6.00 for 2 tacos.  When the cazuelita came out it had THREE shrimp in the whole thing...it also had some spinach and tomatoes but THREE shrimp and some bs tortillas for $13. COME ON! Quien te crees? (who do you think you are?)Where are the albondigas divorciadas? torta ahogada??The food killed it for me, still think it's a great space with lovely people. However, the food makes the restaurant - the ambiance and people just garnish it.Port Fonda, I'm over you."]], "El Patron Cocina & Bar": [["Rachel E.", "Here's the quick rundown:Rooftop: 6 (extra star just because it was a stunning, sunny day in KC)Chips and salsa: 3 - I thought their salsa was underwhelming and wanted a spicier optionShrimp tacos: 4 - shrimp was delicious and had great flavorBoyfriend's mole burrito - he gave it a 3.5 and I concurred after having a biteService: 3.5 - just a little slow, especially as we winded down and wanted our checkPrice: 5 - very reasonable and you get large portion sizesOverall, this place was worth the visit, especially for the awesome view and outdoor dining experience. I enjoyed my meal and overall thought it was a solid option for authentic Mexican cuisine."], ["Vanessa G.", "Fundido amazing.Rest of food - OKHouse Margarita - OKAtmosphere - GreatService - GoodI loved this place, the food wasn't 100% authentic, and it wasn't spicy. But the place was great, the house margarita does not use 100% agave tequila, so it is a little hard to drink. But this is  a great happy hour spot."], ["R M.", "Why bother searching for any other place for awesome Mexican food??? Don't. Just go to Patron. Enjoy a El Jimador margarita while you wait for your table. Once at your table, order ANYTHING from the menu. Tamales are great. Patron Fajitas are awesome. Get the Soupy Beans instead if the usual refried. In the winter time, must have the Pozole. Great food. Great people. You cannot go wrong."], ["Emily A.", "The food and beverages were only topped by the AMAZING service!! Thanks Yelpers for recommending this FABULOUS Mexican restaurant in KC! This place is a must, and the upstairs patio is great! Try the skinny margarita for sure!!"], ["Katie R.", "I'd actually give about 3.5 stars. Food was pretty good, priced accordingly and service was just fine, but I wasn't overly impressed by any of it. I'm sure there is a place in KC that will wow us, but this wasn't it."], ["DJuan L.", "One of the best Mexican restaurants in KC. They have regular seating, bar seating and a rooftop patio. They have some of the best cheese dip that I've had from any restaurant and they offer too different types of salsa (mild and spicy). They offer a good selection on their menu, including a vegetarian section! The service here is always good and the food is great. If you want a great Mexican restaurant experince, stop by."], ["Mari M.", "It's been a while since I've been here. I am glad I returned. We were there for lunch during the week and had great service. Everyone enjoyed the meals selected.I had the soft tacos with shredded beef. The beef had great flavor. I chose the flour tortillas which were lightly 'toasted' (maybe grilled?) which made them have some structure. It was different but I liked the presentation and the thought to how soggy an un-'toasted' flour tortilla might be with the shredded beef.Good, un-greasy Mexican food choice for lunch."], ["Sarah H.", "I had their al pastor tacos and they were extremely disappointing. They weren't flavorful and were super greasy. I've had better tacos for cheaper in hole-in-the-wall joints. The only redeeming quality of this place are their delicious magarita with various flavors and made decently strong; which is solely the reason they are getting an extra star. I will re-review once I try different food."], ["Tina H.", "One of four meals was palatable.  Chicken mole is too sweet.  Pork burrito was plain.  Fish taco, well they should be embarrassed.  Only edible item was the steak chimi.  I do not recommend.  The bar was full so maybe they make good drinks."], ["Russell T.", "I am truly disappointed.  El Patron was my fave spot in KC for quality Mexican food.  We arrived this evening at 5pm, making sure we beat the typical Friday night rush.  We were seated upstairs at a table next to the front windows.  Chips and salsa arrived, but no server.  Minutes go by and still no server.  The couple next to us were visited by their server a few times.  They had drinks and ordered their food.  Fifteen minutes went by, still no server.  The couple next to us received their food.  After almost half an hour went by without a server we called it quits.  I informed the hostess downstairs of what happened and walked out the door.  Sadly I won't be walking in again.  I will also stop referring friends and the out-of-town visitors I encounter on a daily basis at work.  Though, thank you for the chips and salsa.  That's why you receive two stars instead of one.  I'm glad I was able to enjoy them one last time."], ["Greg H.", "Old-school Mexican restaurant on Southwest Boulevard. I told my wife that the reviews for this place on Yelp were very good but she said her chicken tacos were just ok. My tacos al pastor on the other hand were great. We both had black beans instead of refried beans and enjoyed them. Service was okay........not too slow, but not really speedy either. Would love to try other menu items some time. If they're as good as the tacos al pastor then this place is a keeper !"], ["Brent M.", "Definitely the place to eat on the Blvd if you want great Mexican food.  The upstairs patio is a great place to enjoy a beautiful night with friends.  Get the house margarita, it's worth the extra $2..."], ["Valerie S.", "Can't get enough of their guacamole and queso. Plus, their huevos mexicanos are like nothing I can find anywhere else. And they have a patio upstairs. That's it, I'm leaving. See you at El Patron. Grab me a margarita and I'll see you there."], ["Lizzie H.", "The service is immediate. We were seated, given water, chips, and salsa within 2 minutes of our arrival. Kimberly was so attentive - we were never thirsty or out of chips and salsa. This review is not only about service though, the food was also outstanding! The portions were large and everything salted, seasoned, and cheesed up just the way you'd want it to be. The outdoor deck doesn't offer the best view, but has a great atmosphere and  floral decor. They have great drink specials on Mondays too!"], ["Daniel K.", "Came here after about an hour on Yelp and deciding what and how far we wanted to drive to get something to eat!  haha  The service was good.  Nothing spectacular, but professional.  We got the Mole and Fajitas.  The fajitas are theyre dish as to what the waiter stated.  It was good.  The veggies were cooked well and steak was tender.  Could have increased the steak to veggie ratio...  But thats all fajitas! The mole was kind of a weird one for me.  The sauce was a little bland.  Lacked some spices and tasted a little starchy...  Which is totally weird right?!!  Maybe it was my tastebuds.  Its a fancier type style Mexican restaurant which I dont usually frequent.  The margarita which some people say had lots of tequila in it...  Mine wasnt as strong as I was hoping.  They did use quality tequila and didnt use margarita mix which is good considering this is a \"fancier\" mexican establishment.  Enjoyed it here.  I will say I am at 3.5 stars...  But happy hour and $3 margarita bumped it up to 4 stars."], ["Katie W.", "This was my first time here and my first impression is it needs a good cleaning.   I ordered fish tacos.  The fish tasted old and the taco was over fried and soggy.   The other people at my table ordered burritos and the chicken was stewed in some sauce that was unappealing.  All in all it was a disappointing meal and I wouldn't return."], ["Lauren F.", "Excellent service and delicious food!!! Their menu is big, lots to choose from. Drinks are also delicious, and strong."], ["Spencer S.", "For people looking for prices before dining (they're not on the online menu): It's not bad. Quite a few combo plates with rice and beans for $10. The house margaritas are great. As other Yelpers said, no need to pay extra for the fancy ones; the house ones are great as is. They're only $4 during happy hour and they're STRONG!We've gone twice. Once we were served by Erin on the rooftop patio, and once by Pedro downstairs. Both were great. Even the busboys provide great service at this place.Almost everything is made in house with big portions and quality ingredients. I loved my Chile Relleno. Also, the Al Pastor is great and extra juicy. Nothing not to like so far for us at this place."], ["Alex T.", "I'm typically more of a street food kind of guy when it comes to Mexican fare, but if you're looking for something a bit less gritty and a bit more on the Tex-Mexy side, this is your place. El Patron serves up some of the best you'll find in the city. The tamales are quite tasty, but I've recently strayed away from them in favor of the chicken mole burrito. It's tough to beat a mountain of meat, beans, and cheese drenched in chocolatey, peppery mole. Yum! The grilled steak dishes are also not to be missed. Of note, the house salsas are really good and taste very fresh. As others have noted, the drinks here are freakin' awesome. They're a tad on the pricy side ($7 for a margarita or mojito), but you get what you pay for. Coming during happy hour lowers the price to a much more reasonable (and dangerous) $4 and opens up half-price apps for you, as well. Tough to argue with that!Again, I don't get the Tex-Mex craving very often, but El Patron is at the top of my go-to list when I do."], ["Phil Z.", "We decided to try this joint after driving by many times. We had a bad feeling as soon as we walked in. The carpet on the stairs was filthy and the walls were covered in stains and scratches. The downstairs dining room was full and we were ushered upstairs to our table. The host was very nice and so was the waiter. But, the place is dirty! My wife noticed a huge white stain  on the inside of her water glass after drinking half of it. It appeared to be dried sour cream. Gag! The table was sticky and covered in dried food. The area near the bathroom was also very dirty and the floor felt greasy under my feet. The food was OK, but everything was bland. The board of health needs to pay a visit to this place, quickly!"], ["Michael P.", "After numerous trips here, I've finally settled in enough to write a review. El Patron is one of many options for Mexican cuisine on the Blvd and clearly one of the better ones. Nothing against the other eateries, but EP seems to put a little more care and flair into their dishes. Yesterday's bistec ranchero was as solid as their other speciality fare. Honestly, you can't really go wrong here as they provide all the regular options and then some for your dining pleasure. I wish, however, they would have more options like chili verde or Colorado, or a carne asada platter. For those watching their gluten intake and carbs (you probably shouldn't be eating Mexican after all) EP only has one or two options. A knock I have on EP is their limited seating. Long waits are normal on weekend nights and there isn't a good place to stand while waiting. I hate waiting for a table while standing a foot from another diner's dinner. God forbid I have to sneeze....or worse. Seating and standing room aside, EP is legit. Don't think twice about giving this awesome joint a shot for lunch or dinner."], ["Rhonda S.", "Humongous tacos...which means, the size of half a dinner plate! I was thinking, what would be my 100th review on Yelp? Let's make it huge! I loved El Patrons so much last Tuesday for our event, I returned this Tuesday. I swear the tacos for only $1,50 were bigger than the one's they served at the event...Size really does matter. Time does too. We got there at 5:00, with no problems parking.They bring you the sauce and chips to the table with an exhaustive menu. I'm used to higher end Mexican food, so the prices were no different than where I normally eat.. Their mild sauce is one of my favorites in the city. Their hot sauce doesn't have much hotness, just enough to taste some heat.I ordered 2 fried tacos and Mexican rice. They brought out a plate with these huge over sized monster tacos on fried flour shells. I could only eat one, and half the rice. I had to get a to go box. The ground beef is perfectly seasoned, cheese hefty, and lettuce, with a couple of tomato chunks. I didn't see anything sweet on their menu. It was fine, as I was quite full.As I was walking out, I saw a patron indulging on nachos...I'll be back El Patrons."], ["John C.", "Just had our first meal at el patron and it was fantastic!  We love authentic Mexican cuisine and were very pleased with the arrachera, enchilada mole and tacos al pastor.  And the margarita was also outstanding.  Service was quick, polite and willing to answer questions and give recommendations about the menu.  The highlight was meeting the owner - quite an amazing lady who was ready to make a dish we asked about that wasn't on the menu.  The menu is full of her family recipes from Mexico and they are excellent.  Next time we'll try to make it before 6pm to catch happy hour with great deals on their margs.  There are a lot of great Mexican restaurants in KC but this one is now at the top of our list."], ["Madeline S.", "I'd heard from various sources that this was the BEST Mexican food in Kansas City. It's hard to say what that really means because the Mexican food I've had here has been mediocre at best. My friends and I all ordered frozen mango margaritas, which quickly separated so that the frozen part was at the top and the bottom was all liquid-y. They were, however, HUGE and tasted pretty good. I ordered a taco trio - a fish taco, carne asade and carnitas. The carne asade was by far the best. The other two were meh. The tortillas were not very good, I ended up just eating the insides out of them. The meal also came with rice and beans. It was a ton of food. Lastly, I was disappointed with the chips - not flavorful and cold. I get it - KC is not known for Mexican food but I'm starting to think Chipotle might be better than all these spots."], ["Adina W.", "Great service, the margs were delish! Can't wait to come back and try more stuff on the menu. My only regret is that I never needed to know I could eat that much."], ["Jennifer T.", "Great fresh food, Great look and feel to the venue, Great service!We found out about this place after talking to someone in KC, KS at our hotel bar. Upon her suggestion, we stopped by on the way home (In KC, MO). The directions were easy to follow and we found it without a problem. Even though Yelp's hours stated they were closed and not open til 3, they were indeed open. They stated they have asked to have the hours changed on yelp, but so far it hasn't changed.Kim was our server and she very promptly took our drink order. (water - we had a long drive ahead of us) We looked over the menus and  a lot looked really good, so we asked Kim what her favorites are. She gave us a few suggestions and we went with them.Appz: Guacamole. It was fresh, and very very tasty! I loved the fact there were some good chunks of avocado still in it!Lunch 1: Bean and Avocado burrito and fresh pico and lettuce on the side.  It was very yummy! I love a great bean burrito, but add in avocado and I am in heaven!Lunch 2:  Al Pastor Tacos. These were GREAT! Three tacos filled with marinated pork in a sauce (I believe it had a hint of pineapple and some spices with in but I can't remember the details) as well as fresh onion and chopped cilantro. Great, classic pork taco with some serious flavor!I would say if you are in the area, this one is a must-try.  I would have loved to stay and sampled a few of their very large tequila selection.  This looks like a very vibrant and fun place to hang out with friends in the evenings as well!"], ["Brooklyn B.", "This is my FAVORITE Mexican restaurant hands down!!! I love their regular margs and their strawberry margs are the best! The white cheese dip is to die for!!! The cheese quesadillas are even amazing! I wish they would open a location out south in Overland Park because I would go every weekend!!"], ["Ken B.", "I have tried El Patron over five different times after hearing from friends how much they love the food and their time here, and everytime I leave confused and disappointed.  Am I ordering the wrong thing?  Am I eating at the wrong time?  Am I eating at the wrong El Patron?  I don't know, I don't get it.I have tried different things on each visit and nothing is great, yet nothing is bad.  It's a bunch of *meh*!  The service has sucked on almost all of my visits.   It has never been friendly, attentive or warm.   I often wonder if it's because we don't order drinks, leaving them to think we won't be racking up a huge bill!  That's a guess, cause I can't figure it out.  I do love food and don't mind racking up the bill with good food, doesn't that count?  Refills and cleaning the table do not seem to be a thing they do at El Patron.I'm glad that so many people like this place, just do not count me to be among them."], ["L B.", "Pros: too long of a wait, able to find seating at bar, friendly bar tenders, queso fundido was amazing, taco salad was delicious, husband says fajitas were fantastic, prices were reasonable, husbands frozen margarita was deliciousCons: parking a bit tough, margarita on the rocks was sub par"], ["Dave H.", "Having out of town (and out of country) family in town, good Mexican is always a standard request.  While I have my usual haunts where I live in Johnson County, the boulevard is always a great place to go for the pick of many good establishments.  After hearing lots of good comments about El Patron, six of us ventured down for dinner on a Saturday night,  While they do allow reservations during the week, Friday and Saturday's you can only call ahead, which i did.  We had a bit of wait once we got there, but were seated around the time originally estimated.  They were extremely busy due to the influx of people in town for the pro rodeo.  We started off the meal with house margaritas that were decent, but nothing special.  Ordered an app of Queso Fundido, outstanding!!.  For the meal, several of us ordered combinations, so we had a variety of food.  All was very good.  Now, here's what made them really good.  The kitchen fouled up a few of our orders.  The server was on it quick and had the manager at our table fast.  The manager came back no short of three times to make sure things were taken care of.   Not only did he comp two meals, he also bought us a very stout pitcher of premium margaritas on the house.  Then to top things off, one of his assistant mangers provided a gift cards to each couple.  Not only was the food outstanding, they went above and beyond to make things right.  FYI - Apparently much of the kitchen issue came from the huge, and unexpected rodeo crowd.  However, the manager never tried to use it as an excuse.  If I haven't said it already, our server was great.  He busted his butt to take care of a table that in most cases were not going to tip.  Surprise for him, his diligence earned him a 25% tip for his great effort.  Take the time and go.  I don't think you will regret it."], ["Aurelia G.", "I came in around 1:15 for my lunch. The host was to busy on the phone to really acknowledge me, so i just sat myself at the bar. The girl behind the bar asked ifbI wanted a drink and after asking her if i could see a menu first she handed me the menu and then ignored me. Finally another server came up and took my order. I got the lunch chicken fajitas. The food was amazing... Way better than the place across the street and was a good price. I will be trying this place again... Maybe for happy hour because there drinks look really good but i will ask to sit on the top patio. It seems they give more attenchen up there... As i hhad to stand up with my purse and push my bar stool in before anyone would come give me my ticket so i could pay."], ["Shelly D.", "We ate here over the 4th of July weekend. We decided to eat here because we figured any Mexican restaurant that can stay in business across from Ponaks has to be good.  It was our first time there and we loved the food. I had the pork tacos- which were delicious.  The one knock I would give it is the loudness of the upstairs.  We sat next to a large group of individuals who were loud and prone to dropping the \"F\" bomb on occasion.  Staff didn't seem to care.  We will eat there again!"], ["Becky R.", "My husband and I went with another couple last Friday night, for the first time, and enjoyed the food, the service and the atmosphere very much.  We have been wanting to try El Patron for some time.  When we arrived, there was a wait of 30-45 minutes.  We were happily seated within 10 minutes.  Two of us enjoyed the chicken flautas.  The others dined on different combination meals.  The salsa and the queso are outstanding!  Our waiter was attentive and gave suggestions when asked.  We look forward to our next visit!!"], ["Joe G.", "This place has the best tacos hands down.Asada.... Wonderfully done"], ["Matt E.", "My favorite place on the Boulevard, and one of my favorite patios in the city. It's so great to sit on the roof of the building, enjoying some drinks and some tacos. Their margaritas are strong and delicious, easily trumping those you'll find at most other Boulevard spots. Sure, they have upgraded fancy margaritas, but when you make house margaritas as good as this, there's no reason to spend the extra money. They're even cheaper during happy hour. Now let's talk about food: Get the fish tacos. With massive slices of avocado and mango salsa, they are guaranteed to make you happy. They say they are \"Award Winning\", and while I have no idea what award that might be, I'm willing to believe it. Also highly recommended: the Parrillada El Patron, essentially a tabletop grill that allows you to make some sort of taco/fajita hybrid. It's a lot of fun to get one of these for 4 people, and at less than $50, the price is definitely right. You can get it sans shrimp for about $10 less, but why would you go and do something silly like that? This should be everybody's destination for great Mexican food on the Boulevard."], ["Debbie D.", "Gracious host, skilled waiter and the owner actually walks around and checks on you. Food was much better than any on the Blvd but go on a slow night as you cannot hear anyone talk at your table as the place has the worst acoustics. Small and loud!"], ["Matt L.", "Great authentic Mexican food.  The carne asada is on point.  Atmosphere is fantastic and staff is efficient.  Highly recommend the cheese dip guacamole and chimichanga"], ["Brandon S.", "We came here with a Living Social coupon I spent $15 for $30.  The place was on my bucket list before moving away from Kansas City and I am extremely glad I came. They started us with waters and chips an salsa, brought the hot out with the mild without having to ask, a plus in my book since I always have to ask for it.  The hot wasn't going to make you cry but it was tasty. We then split the Queso Fundido for an appetizer, it was amazing!  Being full already, we decided to split the Burrito de la casa. The marinated steak in the burrito was tasty, as was the rice that accompanied the large burrito.  Along with our meals we split a pitcher of well margaritas.  They were the perfect mixture, it never fails you get too much mix or too much alcohol when you get margaritas at most Mexican joints around town. I subtracted one star due to the service, thought they were fairly attentive there were times we were just sitting there waiting and had to catch the server as she ran by.  It was busy but you must at least check with your tables.  They also brought out queso cheese dip for us on accident instead of our Queso Fundido. It took about 5 minutes to catch her to explain the issue.  They did finally get us the correct queso, luckily I had a margarita to enjoy :)"], ["Art M.", "Love this place! Margarita was fantastic. Fish tacos were as good as advertised. And the burrito was outstanding as well. You  have to be good to compete on the Boulevard. It is always fun to find a good New Mexican joint and we will certainly be coming here again. I am anxious to try this place for lunch, and for happy hour."], ["Jennifer N.", "I am literally writing this review as I sit here in the restaurant, taking a break in between my fish tacos. I am in a state of ecstasy from the orgasm in my mouth from these amazing fish tacos with their mango salsa. This is my first time here and I definitely will be back. Aside from the fish tacos, the empanadas were excellent, margaritas were strong, and the steak chimichanga left you speechless. Prices were reasonable, $11.00 or less for most plates."]], "Margarita's": [["Erica P.", "Margarita dip is very good!!"], ["Rhonda S.", "For some reason all the restaurants in the  Southwest Blvd area intrigue me. I needed something fast last night, and I'm still on a strict protein protocol. I like Margarita's. I had to wait in the entrance to be seated for what seemed longer than a minute. It kind of made me want to go and sit at the bar. They seated me in the back room, at the back booth. I got my menu as soon as I sat down. Last night, they had troubles with the blinds, and the sun shown right in my eyes. No problem, I just switched booth sides, then I found myself staring at a blank boring wall. Their salsa s not too hot that you can't taste it. The chips are free, as is the salsa. Their specials are really worth it. A burrito, on Thursday, is only 4.19. It is very inexpensive, and certainly beats Taco Bell by a long shot. This is the original Margaritas, with the water mark where it flooded. The parking is a bit narrow (I'm a baby when it comes to parallel parking, I cannot do it,  and I'm scared to death of  trying it.) Though the service was rushed a bit last night, I was too. I was pleased, and want to try some of the other restaurants on Southwest blvd, besides Margaritas and Ponaks."], ["Tim L.", "I love this place!We always start at the bar and often go no further. The locals are so warm and friendly and the bartenders are fantastic. There beer is frosty cold and they have a great selection. We just went two nights for Boulevard's Chocolate Ale on tap.We prefer their basic frozen Margs but most folks seem to get me on the rocks. They offer premium choices as we'll.They offer free chips and salsa with a meal and I mean fresh. It's its not spicy enough, ask if they have any of their hot version made up.This is not high high brow Tex Mex or \"authentic\" cuisine- it's the same recipes they have been doing for decades and it's very fresh and tasty.They have daily specials that make an already affordable menu a real bargain.Not in the mood for Mexican? My biggest surprise- their grilled chicken sandwich with fries. I truly believe it might be the best plate of its kind in KC."], ["Jenna L.", "Favorite Mex in KC! Love the place. Thin runny salsa, amazing enchiladas, and great margaritas!"], ["Ben M.", "As far as the food, it is about what you expect from a Mexican place in town. You got your tortilla, you got your meat, and you got your lettuce/tomato.  The daily specials are quite a steal, as you can eat lunch for $3.19 on the taco days. Even with tax and tip, you are looking at a Subway lunch that tastes much better.The service is what really makes this place special, in particular one specific waiter. If you get a chance to sit in Daniel's section on a taco special day (Monday for chicken, Tuesday for beef), it is a treat. This guy doesn't offer frills, doesn't offer small talk...he just cuts through the bullshit and gets you fed and back on the road. He wouldn't do so well at a romantic steakhouse, but at a Taco Tuesday, he hits the mark. Daniel gets us in and out in 20-25 minutes. Quite remarkable when he is taking care of 15 tables during the lunch rush. Before you can open your menu, he greets you with \"what are we drinkin?\" and \"what are we eatin?\" as he knows it is Taco Tuesday and he is about to serve up 4 waters and 8 tacos. The man is on a mission. He is on the ready with a refill of salsa when you have only consumed 10% of your salsa. On one particular occasion, he actually \"refilled\" my coworker's salsa before he had even taken a bite. That is service.Watching Daniel in action is like watching Monet painting a landscape or Peyton Manning in a regular season game. You just know that you are watching something special and you can just sit back and enjoy. If there was a hall of fame for waiters at cheap taco restaurants...we have our charter member."], ["Joi B.", "Friendly service goes a long way in my opinion. Hell, it would normally turn this one-star food rating into a three overall, but I just can't bring myself to do it.  So, in the spirit of starting with the positive, I will say that our waitress was nice and the bus staff were prompt with bringing what we needed.That's where the good ends, I'm afraid, for any place that can serve a chile relleño as awful as the one I had the other night does not deserve to be classified as a Mexican restaurant. I know, you may not believe me. I've been cranky all week, what with having limited eating abilities. For those not keeping up (or reading this review out of sequence): I had a lot of dental work, including a wisdom tooth extraction several days ago. Eating isn't much fun these days. But! It does mean I can eat foods that are a bit more sinful because it involves such an uncomfortable effort, that I end up eating 1/4 of the serving. In other words, bring on the guacamole (the only thing that tasted good).And goddamn if I don't deserve a margarita served up in a pint glass.Or not, if they come from Margaritas. How can it be this bad? Even if made with well tequila (which it wasn't). How can a margarita made with Sauza Hornitos be this bad? But it was. I just don't get how a bartender in a Mexican restaurant can't do this one specialty drink right (especially considering it's its namesake?!) I presume that you need to think twice anytime you see slushie machines behind the bar and a drink menu that features sickeningly sweet fruity margaritas. I'm sorry. A travesty. You might as well go to 7-11 and get a strawberry Slurpee and dump some tequila into it.But let's get back to that excuse of a chile relleño. Utterly unacceptable.I ordered two items off the a la carte menu because I wasn't sure if I was getting a straight answer when I told the waitress I was a vegetarian, so I wasn't about to bother with rice and beans that could possibly be made with chicken stock and/or pork fat. I mean, when I told her I was a veg, I was met with no response whatsoever. I felt as though I had stepped into a time warp and was at an El Torito circa 1990. To be safest here, you can order a cheese enchilada, a chille relleño or a taco without meat so that basically you're getting some of the ingredients of a taco, while paying the same price as if you ordered it with the chicken, meat or fish. And let it be known, the potato soft taco I ordered contains the saddest ingredients to ever inhabit a flour tortilla. The chile relleño at Margartias is described as coming with a mole or verde sauce. It arrived looking shriveled and sorry on the plate, no sauce, no cheese on top. If I hadn't spent the day trying to force down sips of unappetizing food, I don't see myself ever allowing such a thing in my mouth. It looked like a a giant cocoon. When I notified the waitress that there was no sauce on my relleño, she indicated that I could use the mild salsa on the table (really?!) or order some spicy verde salsa, I chose the latter. To be fair, the verde was a bit spicy and flavorful. Still, it could not help that relleño, which was edible only because I was starving. I don't think things could get any worse, save for the service being bad, which it wasn't as I already stated. I took the taco home because it was that unappetizing. This reminds me I need to toss it in the trash before garbage pick up tomorrow.Sad. Just sad."], ["Beau E.", "This will be short, sweet, and to the point, because I didn't stay long.The positive.  My first mission was to pit stop in the bathroom.  A clean machine to say the least.  Nice!The rest.  I came in to enjoy a couple of drinks and relax.  The bartender didn't know the drink specials, didn't tell me her name, and never checked on me at the end of my first beer.First and last trip here."], ["Bryan M.", "I'd love to give it a 4, because I had a great time there.  But, that was more a function of the people I was with.One thing to keep in mind is that this is a \"$\" restaurant - only one dollar sign.  Nothing fancy.That said, the service was just fine.  Our waiter was attentive.  The menu wasn't crazy long.  The chips were a bit like puffed rice, in flavor, if that makes sense - light on flavor and heartiness.  However, the salsa was pretty good.I had the chili relleno (sp).  Excellent!  The sides of rice and refried beans were just fine.Good value.  Comfortable.  Maybe a bit off the beaten trail, but that's not always a bad thing."], ["Rachel L.", "Margaritas has been a family staple of mine since I could walk!  It's our go to for birthdays, get-togethers, and all of the above.  My heart hurts a little bit to see it loose business throughout the past ten years due to its neighboring and more trendy Mexican restaurants.  This place will always feel like home to me though! Tacos are my number #1 and then try the enchiladas."], ["Greg S.", "It's true, the service here is deplorable for any decent restaurant to have. Not in the speed, but in the quality of banter supplied by the waitstaff and food server. But my waiter can punch me in the face and call me a woman as long as I get the chicken tacos in a reasonable amount of time. BEST TACOS IN TOWN, HANDS DOWN.The deep-fried hard shell is so greasy and decadent, and the shredded chicken is so tender and moist, just thinking about it while typing this review is making me consider driving 30 minutes into the city just to get a plate. Even still, there is the fresh fresh fresh chips and salsa, refilled as fast as you can eat them throughout the entire meal, and specials every day of the week that I hope to partake in very soon.I can't write much more without feeling like I'm gushing, but Margarita's stock shot up the second I took a bite of their chicken taco, and I defy anyone to counter my claim with a negative review."], ["Jason E.", "Mediocre Mexican food in a town with some fantastic Mexican restaurants. I quit eating at this place because the wait staff were so unprofessional and are quite bad at their jobs. They are easily the worst waiters in KC. I don't understand is why the owners seemingly nurture such shitty waiters. I mean our waiter today, Daniel, took 20 minutes to finally take our food order. He couldn't be bothered to lean over and pick something up off our table so he just pointed at things he wanted us to hand him. Such a freak! I would of said something over lunch today but didn't want to make a scene at a going away lunch for a coworker. I will never eat at that shit hole again!"], ["Tristan L.", "Definitely my go to for Mexican in the downtown area. Their salsa is my hands down favorite I even buy it to take home. The margarita dip is white and really good. One of my very favorites is the puffy tacos!! Definitely try the different flavors of margaritas, the prickly pear sounds strange but it's amazing!"], ["Jo B.", "I have been to margaritas a total of 3 times now, each time has been a little different than the last with a few things that should really change. The service the first time around was fantastic. Great server, friendly and we were never low on chips or drinks. The only bad experience was the snotty hostess at the front, I would assume she is related to ownership of some sort. She would have to be, no one that incompetent, rude and arrogant could possibly keep there job for that long. Completely stereotypical snotty teenage girl on her phone and gives you a look as if she's doing you a favor by looking at you. Every time I've been it has been the same thing with her. Incredible; to the ownership this is literally the first thing people see when they come in, and if it hadn't been for my girlfriend convincing me not to go somewhere else, we probably would have never tried this place to begin with.     The food is not bad at all, no where near authentic Mexican food but still pretty good. Somewhat expensive, we usually get two dinner entrees and a queso and chips appetizer, the total is always $33.00 and change. If it weren't for the troll under the bridge at the entrance of the restaurant this would be a 4 star review."], ["Kayla S.", "$4.98 Burritos on Thursdays. Can't beat it!Chicken Burrito: Everyone at our table order the chicken burrito that Thursday. It was HUGE. If my boyfriend had had more than one peanut butter jelly sandwich that day.. we probably could have split one. The burrito consisted of one HUGE corn tortilla filled with refried beans, chicken, onions and cheese, topped with a red chili sauce. This burrito was quite tasty, especially for the price. Chips and Salsa: Very good. (Hard to find good chips and salsa at Tex Mex in the Midwest)Staff: Our waitress was SO nice. She was quick and friendly. During our weekend in KC, it was GREAT having locals choose where our group ate. I'd make Margarita's a regular too if I lived in KC. Their daily specials are too good to pass up!"], ["Rasheda H.", "Why have I not reviewed this place sooner?! Margaritas is a Kansas city STAPLE. It's not the best Mexican food north of the border, but it is cheap and you WILL get full. I went recently for taco Tuesday. WOW!! UBER packed!!! But what would you expect for buy one get one free tacos? My only complaint is that you can't get chicken, as I am not a big fan of beef.They were very good tacos none the less. Very crunchy and very cheesy.  The frozen margaritas are amazing and STRONG. I will definitely be back to have one of those."], ["Sharm M.", "My favorite thing about Margaritas is the Panty Dropper Margarita.The Margarita starts with blueberries. The blueberries are macerated and then infused with El Mayor Tequila.  Blueberries and tequila. That mixture then sits for a week and half.  What is left is this deliciously flavored Tequila. Once the Tequila is infused to perfection it is time to create the Margarita. It begins by muddling fresh or frozen (thawed) blueberries and a slice of lime in a glass,  then add in the blueberry infused tequila, some Grand Marnier, add a splash of sweet and sour and presto you have \"The Panty Dropper Margarita\".  Once you taste it, you will know how it got its name.They also have some great happy hour specials."], ["Erin W.", "I've been going to Margaritas for as long as I can remember, so when I went here for lunch yesterday I was SO disappointed.  There were not many people in the restaurant, so I was thinking we'd get in and out pretty quickly.  We sat at a table that could see in the kitchen (never again).  Food was okay, the margarita dip (the thing that keeps me coming back) tasted off...tried and tried to figure out what it was, but no idea.  Just not the usual quality I'm used to.  Watching in the kitchen...the chips were being put in the baskets with bare hands...after picking up dirty dishes and glasses from tables.  The chips that feel on the counter were being pushed back in their chip drawer.  I even saw straws being touched where people put their mouths then back in the glass.  Luckily, I didn't see all of this til after I ate cause I don't think I would've been able to do it.  However, I believe most of these are strict violations and even saw them use paper to scoop chips the first time then set it down and use their hands.  The thing that bothered me the most though was the bill.  There is a section at the bottom that is marked service charge.  We all were wondering what this was, since it was about 14-15% of the bill.  There was a line that said gratiuity and it was marked 0.00.  We asked our waitress and she said the tip.  It seems this is VERY misleading and most people would probably tip on top of this.  Seems shady Margaritas...very shady.  One of your faithful patrons is now looking for a new spot unfortunately."], ["Lorena M.", "Taco Tuesday/! Yep, another taco Tuesday, another place. We decided on Margarita's this time and their special on Tuesday is buy 1 get 1 taco's. I ordered 2 and also ate my bf's because he ordered the enchilada plate (beef). They taco's are fried and come with parm. cheese, I love taco's this way. They were greasy, yes, but I knew what I was getting myself into. His enchiladas were literally swimming in cheese and sauce, the way he likes it but personally I'd like less. Margaritas has been around for a long time and it is what it is."], ["Adam Y.", "I don't know that I'd call the food at Margarita's great, but it's definitely good, and it definitely hits the spot about once every other week.The portions are always large. Everything I've ever ordered has been as cheesy as can be, and I love it for that. I also look at the plate and think \"What would Gordon Ramsey say about this?\" Then I think \"Who cares?\" as I dive in head first.I definitely recommend the Margarita dip. They have a grocery store line of it that should be avoided though. It's MUCH better in the restaurant. I also really like their salsa. It's just a touch spicy, and the tomatoes are not overdone to the point it feels like you're trying to keep a watery sauce on your chip. It has some real consistency and flavor. I'm usually good with the Gringo for a good ole Midwestern guy Mexican meal. Their Lucky #13 is a favorite when I want to go a little lighter. (emphasis on little).The service can be hit or miss, depending on your server, but the food always comes out of the kitchen surprisingly fast."], ["Clark K.", "The service from our waiter went from d- to c . He was great on speed but his attitude wasnt the best and it wasnt a pleasant vibe till 9/10ths the way thru. Im a stickler on customer service... But the food was beyond great....for the price on sunday....you can pick any daily special...its a deal! ...i got 4 tacos and 2 enchiladas !"]], "Luna Azteca Mexican Grill": [["Charlie B.", "Pleasantly surprised!  Good food, excellent service, Pacifico on tap -- will be back!"], ["Karen G.", "Just found this place over Memorial Day weekend. Excellent food. I normally don't like refried beans but the beans here are lighter and seemed milder than most. The salsa and queso were really good with a bit of a bite but not overwhelming hot whhere you think you might breathe fire. I had shrimp enchiladas and the hubs had a taco salad. The enchiladas were good but I'm going to order the taco salad next time since the waitress aaid they would make it with shrimp even though it's not listed on the menu. Molly was a great waitress - very friendly and patient with all our questions. Go and support a local spot!"], ["Kelly S.", "My visit last Thursday was not my first time in the restaurant, but the first time I visited alone . Being alone, was fully aware of what was going on around me. I was quite surprised to find the amount of  attention to detail and the professionalism shown by the waitstaff. Which was 90% higher then the same I witnessed at a recent trip to my Cardiologists office. The food delivery was fast, and the quality if my meal superior.  I would recommend for anyone . The menu offers traditional fare Mexican food as well as lighter options  that still offer taste and quality."], ["Tim B.", "This place is a pleasant surprise and has excellent Mexican food! I had the enchiladas. they were delicious. The house margarita is good as well."], ["Michael G.", "Had the Taco salad with pork, awesome. Wifee had shrimp enchiladas.  Very good. Loved the queso. Oh and give the sopapillas a chance. They are served warm with ice cream and a drizzle of honey. The  GrandeTaco Salad was a huge mix of romaine lettuce, pork guacamole sour cream, and mixed cheeses.  They make their own salsas and guacomole. Gonna come back soon."], ["Carina S.", "This is the best restaurant in the northland.  Great margaritas, fresh veggies, and great tamales."], ["Chuck J.", "Went for Taco Tuesday and they were very good with authentic corn tortiilas deep fried shells. Tried the Azteca cheese dip as an appetizer and was not impressed. Too watery. Also had a Mango margarita that was not watered down...so strong I couldn't taste the mango. Will try to go back and order regular menu items and give them another shot. Service was good and quick. Would give them a \"B-\" if I were grading."], ["L H.", "Phenomenal experience, the food and the service! We will be back... I had the Baja Bowl it had great flavor."], ["Mark H.", "A New location for this place really brings home authentic Mexican. Well more than others. Have eaten at their Ambassador Rd location a lot. This is closer and a hit. We visited after 3 days open. They as usual knocked it outta the park welcome to Burlington. We've been waiting for you."], ["Louise T.", "Great service, fast and good food. It's a well oiled machine. Glad we don't have to drive so far anymore."], ["Lisa H.", "I'm a fan of Mexican and we have another one now...not far from the other one.  That being said, its an ethnic food, that to me, is as good as its chips, salsa and margaritas.  After all, Mexican is mostly seasoned meats with either flour or corn tortillas, beans and rice right?  That's not all that hard to do is it?  The wait staff was nice...poor server, spilled 6 glasses of water coming over to the table, but luckily other than splashes avoided directly watering down any patrons.  Their beans were a bit different in looks and taste and I think they seemed fresh, unlike so many restaurants they might as well come out of a refried bean can.  My chicken flautas and ground beef taco were good as was the Spanish rice.  The taco was deep fried I think, not just a filled shell.  Unfortunately, I could not have a drink but others enjoyed their margaritas.  Liked the chips and salsa quite a bit, as it was a bit on the spicy side. They allowed our party to linger after dining and paying, and even continued to offer to refill our water. I'd go back to either location."], ["Christian H.", "Great mexican food and the new location is very nice. I always get the softshell tacos with a corn shell and it always turns out great. I would recommend this place to anyone who wants a nice sit down place for mexican food."]], "Taqueria Mexico": [], "Burritos To Go": [], "Chapala Restaurante Mexicano": [], "Burrito Bros": [["Caitlyn S.", "This place was sooooo yummy! What a nice change from other build your own burrito places - I love the Portobello choice for vegetarians! My husband loved the chorizo option as well. Chipotle needs to get on board the chorizo train.During a weekend visit to KC, we heard about City Market and how it is \"food truck central\" but we didn't hear about the places that have a permanent place, like Burrito Bros. After some searching on the web and yelp, we found Burrito Bros because my husband was craving some burrito action and I didn't want to go somewhere we could go in Wichita.I am so glad we drove up there, and I wish we would have had more time to explore the market.Burrito Bros had some good deals, including their two tacos + drink + chips for $6 or $7. We both chose burritos, though, which also included chips. (Score.)I would go back frequently if I lived nearby!"], ["Neil B.", "I had a chicken burrito with guacamole, pico, guacamole, rice, and medium salsa.  It was very good; ingredients were fresh and the burrito came with chips.  I would definitely recommend for lunch.  I would like to come back to try their tacos as well."], ["Cindy R.", "I've only been here a few times and each time I've gotten tacos to-go since I didn't have time to eat at the River Market.  Maybe I'm making the mistake of getting the tacos and not the burrito but I didn't feel as though they had yummy salsa or good toppings to go on things...  I felt as though I had a meat stuffed taco (I got a chicken and steak) and a little bit of guac in them with a vinegar style salsa... It wasn't my favorite and the meat seemed dry/tough.  The food wasn't as fresh as I would have hoped but maybe that is because I went at an off time... I do really love burritos and the Chipotle style so I'm going to just rate them as \"okay\" until I try a burrito and not compare it to my favorite things there so I don't judge it too much!"], ["Amanda S.", "It is certainly comparable to Chipotle, but Burrito Bros. offers more variety. I sampled the chorizo burrito on my first trip and it was delicious. They cooked it right in front if me, even though it was the middle of lunch hour. Very fresh.I also really enjoyed the melted cheese on my burrito and the side of chips. Great lunchtime meal."], ["Nicole K.", "The burrito tastes like heaven, which would be enough by itself.But this place also has friendly, personable service that often includes a few laughs to brighten your day (if the guy tells you he put the wrong salsa on your burrito, he's pulling your leg).The burrito is just as big as the one you get from Chipotle, but you get it with fresher-tasting ingredients from a local business. I like to get mine with extra pico de gallo and top it with their nice tomatillo salsa, but you've got options. The BF loves their carnitas and their guacamole, and we both love the fact they give you fresh chips with every order.Plus, the location in the market is muy convenient!"], ["Garrett S.", "Best burrito's in the city! This place beats the pants off of every other chipotle wannabe in KC. They steam the cheese with the burrito which makes it nice and melty. The carnitas here are super juicy and always delicious and the tomatillo sauce (mild green sauce) is a perfect complement to the other flavors. I enjoy chipotle and it's inevitable that BB's will be compared to them, but the food here is above and beyond anything I've had there. totally worth it!"], ["Wayne F.", "Great place, good price, good food. Fresh and tasty ingredients. Carnitas meat was a bit on the greasy side, but quite good."], ["Michelle F.", "They were a little unorganized getting thorough the line, which was nearly out the door BTW, but everyone was friendly and we got it figured out.I had a chicken bowl with rice, black beans, cheese and assorted toppings. The chicken was highly seasoned and juicy, great stuff, and all high quality. No grissely or inedible pieces. The guac tasted fresh and had good flavor. Love that you get a bit of chips on the side. The service is fast, the price is right. Go forth and get yer burrito on!"], ["Daniel H.", "I ate lunch here with my fellow associates.  I ordered a steak burrito ($6.25) and a fountain soda ($1.75).  It was similar to Chipotle where you tell them what you want on your food.  Oh and almost everything costs extra like cheese, guacamole and some others that I forgot.  I think every order comes with chips.  There weren't too many seats inside because the place was pretty small.The steak burrito tasted good and even better with the hot sauce on every table.  The steak wasn't like what I'm used to in California where it had a grilled taste to it; however, this was still good.  I forgot to take a picture of the hot sauce but try it out if you like your food spicy/hot.  It was pretty busy while we were eating and the line almost went out the door.  I saw somebody order a quesadilla and that looked pretty good.  I think I'll have to come back to try those."], ["Yoie L.", "What sets Burrito Bros apart from Chipotle or Qdoba is their customer service. We frequently do catering with them and the owner and his father are always super friendly. They even help me carry all the stuff to my car seeing I'm a small little person and can't carry everything. The father is really lovely and he enjoys talking about his son and how he helps him out whenever he can. How sweet. The only thing I don't like is everything cost extra. I would definitely do catering here as they always give you chips and salsa whenever we do catering. But it's a tad more expensive if you're here just to grab lunch. Nevertheless, I really enjoy how friendly these people are and it's good to support local business."], ["Matt E.", "awww man.I hadn't been to Burrito Bros in quite some time. Since my last visit, many of my friends (both Yelp and the real world) have been all \"Hey Matt, Burrito Bros is amazing, why only 3 stars? What gives?\" I decided today that it was high time to give them another chance, see if my perspective had changed.Well, it hadn't.The level of customer service is still sky high. The price is right. The menu LOOKS appealing and tastes great. It's just still such a damn mess!Today I got tacos instead of their namesake burrito. They come individually wrapped in aluminum foil, and when i broke into that first one, my worst fears were confirmed... I was holding a slimy, messy taco. I think it has to do with how they melt the cheese directly onto the tortilla w/ some sort of steamer. I don't get the point of this. Instead of a regular press heating up the tortilla, they go this route and lock in a ton of extra moisture. Add to that incredibly runny pico, and the whole thing was just a huge frickin mess to eat. Tasty, yeah. But from a tactile (and just general manners) perspective, I think Burrito Bros is kinda icky. *** I just want it to be said that I feel guilty writing this review, as the people who work here are genuinely kind and professional. I wish them continued success, I just wish they had a product that had a bit more structural integrity.  ***"], ["Cait W.", "Better flavor than chipotle, and you're supporting a local business! Love that every entree comes with free chips! Burrito Bros used to just be a lunch time stop, but they recently extended their hours to 8 pm. Worth it!"], ["E S.", "Please go to this great little place in the City Market!So embarrassed that we've lived in River Market for over four years and just had Burrito Bros. for the first time tonight.I had a chicken burrito with extra hot sauce and it was delicous. Very flavorful and giant! My boyfriend had a pork burrito bowl, which he also enjoyed. Generous portions of chips accompanied both meals.Sadly, the man running the place was hanging out alone--there were no customers. We plan to go here a lot and will spread the word. Independent restaurants like Burrito Bros. are really important, so we hope more folks will skip the chain restaurants and visit Burrito Bros. instead. We hope this wonderful place can continue to hang on until all of the slated apartment construction projects are done. It's a gem!"], ["Karen N.", "No frills, EXCELLENT burritos. Mild sauce is spicy, so watch out for the HOT!  I'll be back."], ["Gabriela D.", "This place is not all that organized. It's not really a good burrito and when I asked them if their black beans were vegan, the answer was, \"I think so.\""], ["Ray L.", "My burrito was pretty good, but nothing to write home about (since \"home\" is Southern California). Most of the things I read about this place were comparisons to Chipotle, which is fair, but I get the impression there isn't much else around here. Maybe it was better than Chipotle, but not exponentially. It's Chipotle-style, where you build your burrito down the line. Quality was pretty comparable. The chicken did have nice flavor though, with some char and good seasoning - they have that over Chipotle.Good for a casual burrito. Don't think any out of town visitors would be impressed."], ["Ellen S.", "Yes, this is a burrito place.Yes, they serve the best burrito I've ever had.Yes, we asked them to cater our wedding.I could rave and rave and RAVE about these beautiful burritos. Very seriously in my list of top five favorite foods EVER. My perfect combo: Cheese on the tortilla, extra rice, black beans, shrimp, un poco de pico (just a little), guacamole, and the medium fire-roasted sauce. I will occasionally order this with portabello instead just to keep the staff on their toes.BB was super easy as a caterer, too. We only needed to give them a few day's notice for them to have 120 burritos delivered to our venue. They were, as always, ridiculously nice about everything. And, even after being frozen for two weeks and poorly re-warmed in my office's 1980s-era microwave, the burritos were so, so good. TL;DR: Eat here. Get the shrimp or the portobello burritos. YUM."], ["Austin S.", "Long story short: Chipotle-esque type of establishment, but without that corporate chain restaurant feel.Long story long:Now, let me just preface this by saying that I LOVE Chipotle, but if I happen to come across a burrito of its equal, I will have no problem cheating on Chipotle.  With that said...My girlfriend and I decided to spend lunch and an afternoon together, and I she hadn't explored Kansas City proper a whole lot.  I told her about City Market and that seemed to convince her.  I looked up the restaurants they had here and this seemed to fit the bill.As are most of the stores at City Market, this place is on the smaller side, with the dining room being able to seat maybe 15-18 people, with one or two more tables outside.  The set up is very similar to Chipotle in the sense that you walk up to the counter, tell them what you want, and they walk you down an assembly line of various meats, salsas, and your typical items that you would put in a burrito.I decided to get a carne asada burrito with black beans, rice, roasted corn salsa, pico de gallo, monterey jack cheese, guacamole (doesn't cost extra!!! or did it?).  My girlfriend got the grilled chicken with whatever it was she got in it.  We just got water for our beverages and the cost came out to about the same if not a few cents cheaper than at Chipotle.We went to go sit at the table outside and dug in.  Wow... it was really good.  Everything was fresh and the meat was really good.  I tried my girlfriend's grilled chicken and that was very good as well.  I just really liked the fact that the service style is similar to Chipotle, yet you don't get that corporate chain restaurant/Americanized feel.  Again, I LOVE Chipotle, but this place was definitely just as good if not better in its own little way.  The people working there are really nice and as I was getting my burrito, I heard some Christian music playing from the kitchen, a worship leader that used to be at the International House of Prayer here in Kansas City, so it was comforting to know that I was supporting a fellow Christian.I would definitely come back here, it's just a shame its a little bit out of the way from where I live."], ["Faith B.", "Fresh Tex Mex style burritos, made while you wait. I really liked the portobello burrito and I thought there chips were quite good - light, crispy and salty. But why no salsa with the free chips? Friendly staff and fast service booted them up a star for me"], ["David A.", "Chipotle, with a friendlier touch and much tastier. Portions are large. The burrito was huge. Also, the order was made rather quickly. Good for a quick lunch. The staff was quite friendly had long chats with us and other customers.Drawback: No salsa to go with your chips, just hot sauce. I didn't really enjoy that.All in all, I'd rather spend my $$$ here than Chipotle."]], "Pancho's Mexican Food": [["Alexa M.", "I got the chicken taco meal. It was good but service was slow. They did not seem to have enough people working. I liked the queso but the salsa that you get your self did not look like it was chilled properly. I did not try it"], ["Faith B.", "Cheap burritos. Drive through. Open late at night.What's not to enjoy?Actually, I've been here a couple times now.Prices are very affordable. Service is very fast late at night.Weirdly, service is lackadaisical and kind of slow during the day on weekends.Plenty of veggie options and lots for meat eaters to love.I expect to be a regular."], ["Teague P.", "Panchos gets four stars, and that's because it solidly delivers for what it is.  I actually hit the joco locations more, on 87th just off 35 and Olathe on Santa Fe also just off 35.  Not sure if ownership is exactly the same or not, but the menus are very similar.  The good:  the flour tortillas are excellent, the stretchy and fresh kind.  I am a big fan of being able to get a potato egg and cheese burrito for lunch or dinner or at midnight.   The carnitas are usually very good.  Big fan also of the crunchy little rolled fried taquitos with guacamole and lots of shredded lettuce.  Lately i have a jones for the american-style chicken tacos on a crunchy fried corn tortilla shell, also with lots and lots of shredded iceburg.  The food is very basic, not at all fancy.  Good salsas, I think the green avocado is especially yummy, fairly hot.  The bad, well, it can be greasy.  The lettuce can  be pretty watery, but hey, at least they washed it.  The meats are not the most tender, it's cheap cuts and priced accordingly.  I don't really think the microwaved enchiladas are worth the calories.   But after a long work day, driving home at 11, or after being scolded in court at Jackson Co. in KCMO by some judge at 9 in the morning, I'm sure glad I can get a lovely big fresh tortilla wrapped burrito texano, chicken and potatoes and sour cream, no substitutions, for 5 bucks, with all the radishes and pickled jalapeno carrots I care to pile on it."], ["Jason Y.", "It has been a while since visiting this particular Poncho's. Wow, somewhat surprised at the updating and cleaning. Unless you're bi-lingual, I still see a few issues with getting the order correct. Oh well. I don't care because Pancho's still serves up a mean ass burrito. As with the other locations, I'm not a huge fan of the quality of meats served at Pancho's. Too much fat and grizzle. It sounds like this location still attracts the late night drinkers and smokers (hint hint) that get the munchies. Therefore, I'm sure the grade of meat matters very little. As Matt E said, Pancho's is the classic \"gut-buster\". Couldn't have said it better. The safest bet on the menu are the breakfast burritos. Kinda hard to destroy eggs, potatoes, chorizo, or ham. The bacon will sometimes have way too much fat. Request the bacon well well done. Weather or not that happens is an entire different subject. Get some grilled onions and peppers on the burrito. Throw on a little cheese and some spanish rice.......Yikes, you have a winner with that burrito.  I 100% hate their guacamole. More like purred avocados with a milk shake consistency. Some people love the stuff, just not me. The salsa bar is actually really good. Plenty of choices. The prices are spot on for the amount of food you get. Pancho's has grown into a midtown staple and should thrive for years to come."], ["Lauren L.", "Authentic Mexican cuisine! I can't say enough good things about this place. Both the Lenexa and KC locations were AMAZING."], ["Kathryn P.", "Something is magical about their tortillas. They give you a bunch of food for your money. It's not quite as good as a typical sit down mexican place but miles better than Taco Bell. If you like breakfast burritos this is the place to go."], ["Tanner C.", "Got the California burrito and it was a waste of 6 dollars, the potatoes were raw and cold and had the strangest taste of dish soap. I said multiple times to my friend that the potatoes had a strange taste to them like dish soap. Also, the steak was chewy. I would have rather eaten candle wax then have to go through this again. I ended up throwing it out the window after three bites. I tried in those three bites to tell myself that \"it is going to get better\" but it never did. Having just moved here to Kansas City, I will never return to panchos  and take my money to other fine Mexican food establishments, such as ricos tacos . I guess lesson learned, never order a California burrito in Missouri."], ["Hayley S.", "Legit Mexican drive through open 24 hours -what's not to like, folks!? Pancho's is great, cheap, fast, delicious, and open no matter what time you head home from the bars. Here's a trick I picked up from a friend - your only two options are fish tacos (these might seriously be the best in town) and the California burrito. Order those and then tell your friends not to look at you as you chow down."], ["James D.", "I finally tried this place. It was alright, the food was solid and about what I expected, I can see this would make an epic late night drunk snack. I might go back but I know there are other options that I would enjoy equally if not better. The place isn't as clean as I would have liked. Paper plates and silverware, plastic cups. But it is cheap and authentic. A better choice than taco bell."], ["Meghan M.", "Finally had my first meal here, as opposed to the bite taxes I would take when I was the DD to Pancho's. This visit also marked my first time here during the daylight. I prefer going during the dim hours, as a means of hiding the less than stellar atmosphere, but what can I say, I'm adventurous. ;) Yes, this is a 24 hours a day, greasy Mexican place. For 7 years, I avoided this place like the plague (or like someone assuming this place would give you a plague) until my Latino/a friends said, \"no man, it's good.\" They were right. It is surprisingly good. Yes, you're going to get some gristle, and yes, some of their items might hit you like a brick, but when eating it in moderation I feel full, satisfied, and all warm and fuzzy inside. On my inaugural trip, I had the carne asada smothered burrito. For $5 you get a huge burrito, rice, and beans. Definitely enough for two meals. Asada was good, but did have gristle. The smother sauce was abundant and delicious. They have tortas (sandwiches), burritos, plates, tacos, tostadas, enchiladas, etc. Their menu is large and there are lots of delicious and cheap things to choose from. Pancho's is perfect for a night cap or a fast food Mexican craving. It may not be perfect for speediness, your figure, or your intestines. Summary: Don't be scarrrrrrred. Try Pancho's. It's legit. It's cheap. And it's pretty damn good."], ["Leonard L.", "Filthy store, high prices, terrible food, awful service.Ive tried this place a few times. The first few times i couldnt get anyone to talk to me so i just left. This most recent time i actually got some erm \"food\" from them. They shorted my order by 1/2, which was actually something of a favor once i saw what they'd put in the box.Do NOT attempt to eat at this establishment.What a shame too, KC could really use a decent taco joint."], ["Stacie E.", "Great big portions bigger then chipotle The pricing is what you would expect at a sit down Mexican place.The atmosphere is more like a fast food place.Think older taco buano style ordering.Friendly enough. If your late at night they pretend not to speak English.Lots of parking.It's not anything super but it's not bad in the least. It's one of those places I can take it or leave it. If it was cheep I would probly eat there all the time."], ["Rydog S.", "If you are a fan of Jose Peppers or any other place that uses cream cheese in their sauces and tries to call it Mexican food...this place isn't for you stop leaving negative reviews - you don't get it. If you are a fan of authentic baja style Mexican food come on in. It is basically a taco shop that you would find on every corner in San Diego. The rolled tacos are fantastic as are the Panchos burrito and carne asada burritos The salsa bar is also good with the highlights being the pickled carrots and the spicy avocado salsa. Wash it all down with a horchata. It can be greasy because...no alarms and no surprises....it's Mexican food."], ["Sarah F.", "I was craving either a delicious burger or crappy mexican food. Pancho's had a drive in: the winner was clear. At 8pm on a Monday the drive through was quick. I ordered a carne asada chimichanga. It is everything I wanted it to be, and more. Goopy mediocre costco-like guacamole, delicious meat, cheese, and sour cream with a deep fried tortilla. Heaven.If you want greasy, make your stomach regret it later, mexican food, this place is perfect. Oh god, it is perfect."], ["Matt E.", "A gut bomb. Don't get me wrong, a delicious gut bomb. But still, a gut bomb.I've never had Pancho's during the daylight hours. Heck, I've never had it sober. But after a night of drinking, nothing tastes finer than a Pancho's burrito. My go-to order is the Texano burrito, filled with chicken, sour cream, diced potato and cheese. It's ridiculous. They're very oozy and saucy, but they still manage to stay together and not cause a giant mess. I typically get a horchata on the side. It's not the best, but at 3 AM it hits the spot.Be warned, the drive through can be SLOWWWWWW. Don't go for a quick bite before you get home, especially if you have to use the bathroom. Use the bathroom at the bar, THEN go to Pancho's. Oh, and always use a designated driver."], ["Eddie V.", "Do yo' two-for-two-dollars-fried-burrito-eatin-ass a favor and get REALLY drunk AND stoned before coming here, make sure you got plenty of soft toilet paper at home, a good amount of imodium, some tums and the next day off work!"], ["DJuan L.", "The food here was ok. It wasn't anything special, but it is a good place for the late night muchies. I had a fish taco that wasn't that fresh, but hey, what else can you expect at 1a.m.? I also had a burrito that was ok. There was a decent size line at the drive-thru, so if you're in a hurry you may not want to stop. I'd probably come back again and try something else on the menu. The prices are very reasonable here as well."], ["Steven J.", "Cons: The meat is dry, tough and under-seasoned. They don't even have a red pork chili to speak of. The place could be cleaner. The shredded beef burrito is unseasoned and watery, yuk! The place is drab, dated and a little dirty. Pros:This is a working man's restaurant Portions are very large. Good value for the money. Huge parking lot! 24 hour drive-thru, hell yeah! The staff is pretty nice. I've never had a bad reaction to anything I've eaten here. The breakfast burritos are good. All in all a great midtown dive to fill your engine for cheap."], ["Kelly G.", "Not bad for a place open 24/7! The enchiladas were super cheesy..wouldn't recommend the guacamole though. I was hesitant at first because of the looks of the place, but the flavors are right! They also give you tons of extra hot sauces in several flavors. Chile relino  was also great."], ["Jonathan B.", "Incredible selection.  This place brings Mexico to main street. If you want nachos they have it. But if you want stuff you never heard of then you must go here. Tasty tasty tasty."], ["mike d.", "Takes me back to East LA and downtown Fresno. I love this place. The food is very satisfying and really quite good. Gringos hate it so that tells you how delicious it is!The service is best (mediocre) if the women are working. If its all men you'll find yourself standing at the counter for five minutes before they help you. Last time I left and got Kin Lin instead. I was really wanting Pancho's though. That's how bad it was. I'll be back though because it's awesome!"], ["S B.", "Great divey hole in the wall place! Love the drive through and them burritos. Don't let the facade fool you. Go right in or better still drive through :)"], ["Meg L.", "Some people should not go here. If you are uptight about your food and eating fancy food, keep on walkin.Yes, this place is an OLD Arby's or something, and its sure not a pretty joint, but DAYUM do they have tasty 3-4 dollar burritos...I seriously don't think you could order a bad one. The chicken one is allll chicken..I have always loved the California and Texano.... Aint fancy.  Is tasty as hell."], ["Ken B.", "It's a 24 hour operation in the heart of midtown.  Don't expect a clean interior or high end cuisine here.  It's greasy and inexpensive.  My partner lived in Los Angeles for years and he was thrilled when we discovered Pancho's.  It reminded him of the street food and some of the regional Mexican food in LA.  He loves the food.  I'm sure he would rate it 5 stars.  Me, I have a harder time finding things that I just love here and I would rate it at 3 stars.  Because of my love for my partner, I am going to combine our ratings and give it 4 stars!  (if that isn't the sweetest gesture on a yelp review, then I'm at a loss of words....lol)Some of the highlights for me are the fish taco's, the guacamole and the best salsa bar which includes pickled jalapeno peppers with large carrots in the spicy marinade.  The carrots alone are worth the price of an entree.  The lighting will wake up any intoxicated person or it can bring a jaundice tone to the best complexion.  It's harsh lighting with some loud music usually playing on a loop.  The people watching makes all of these things tolerable.  If the inside is too much to take, they have a drive thru that can help you avoid any thoughts of the \"colorful\" interior found at Pancho's."], ["Jake C.", "Great spot to grab a late night burrito. Pancho's is open 24 hours a day and dishes out some tasty and HUGE burritos. It's been a bit since I've gone (living in LS now, none close to me) but everything I've had there has been fresh and hot. Granted, my knowledge is limited to their burrito offerings.There's not much more to say about this place, honestly. No frills, cheap, delicious mexican food at any hour of the day. You'll end up paying less than $7 for a burrito and drink."], ["Chris H.", "Probably ordered the wrong thing here based on all the good reviews but my chile relleno was bland and covered in the kind of guacomole that comes in a tub from Costco.  The chewy flour tortilla that came on the side was good though and saved this from being a one-star review."], ["Thomas A.", "I'm a sucker for Panchos.  I eat here all the time.  I have the mixed breakfast burrito on Thursday mornings and the Steak and Egg burrito on Fridays.  On many Saturday afternoons I have to have the smothered burrito which is one of the most fabulous dishes ever dreamed up by a Mexican.  The smothered burrito is a huge burrito stuffed with seasoned pork and then covered with a spicy salsa verde and a sprinkling of cheese, served with rice and beans.  I love to pour cream salsa de aguacate over it (spicy avocado sauce).  It is velvety and creamy and spicy (some say hot) and it throws that ding-dang burrito right over the cliff.  Jeezyweezy!  It's like riding a roller coaster of flavor it's soooooo dang good!  The breakfast burritos are full of meat, potatoes, egg and cheese and usually keep me satisfied well into the afternoon.  So listen, if you're all uptight and snooty about Mexican food, just keep jambalamba walkin' on by.  What this joint lacks in ambience is more than made up in the quantity and tastiness of its vittles.  It's also great for an after-bar chomp-down but if you've got a delicate gringo stomach, better pass on this here joint toute de suite (oops French...sorry).  As someone else pointed out, gut bomb is kind of an appropriate moniker but...in a good way."], ["Jack L.", "I'll put it this way: Utah has Beto's, Vegas has Roberto's and KC has Pancho's.  It's every bit as good as the best taco shops out west and I'm VERY pleased I decided to give it a try!  **I will note that this place and places like it are not really meant to be taken as \"Fine Mexican Cuisine.\"  It's a taco shop.  Nothing more, but SO much more all at once."], ["Tim M.", "The negative reviews are dumbfounding...great food cheap, relatively clean, salsa bar. Don't use the drive thru unless you have to...but I advise that anywhere. The carne asada burrito is unreal...actually they all are. Hangover food, for sure...docking one star because with such a huge menu, there should be more veggie options."], ["Sara V.", "The carrots make me swoon!   The salsa bar featuring traditional pickled carrots and jalapeños, various blended salsas, radishes, limes. cucumbers and salsa cups is fantastic!  The staff is consistent and bilingual. The restrooms are clean as is the dining room.  Drive thru is slow late nights but the key is to go when the cops do the line is shockingly short ."], ["Danielle S.", "Kansas City loves its late-night Mexican, and that's music to this Texan's ears, whose post-drinking food of choice definitely involves enchiladas.  When I was told we should go to Pancho's, I immediately started humming the theme from a series of commercials local to Texas and other surrounding states (\"raise the flag, raise the flag, you're ready for a little more Pancho's Mexican buffet\").  When my friends informed me that no, this was unrelated, I was more than a bit relieved.  \"Mexican\" and \"buffet\" are two words that should never go together.I went twice during my trip.  The first experience was a Thursday night.  The drive-through line was relatively short, but they're making up their food fresh with a little love so expect to wait.  It's definitely not the best food I've ever had, but for 2am it's not half-damn bad.  It tastes like something out of Grandma's kitchen.  I got the #6 with rice, beans and cheese enchiladas as it's comfort food for me.  Nothing takes care of a case of the drunchies like a combo platter.Saturday night was a different experience altogether.  The line was long and ROWDY.  One car kept losing occupants that ended up on our car at one point, and the coup de grace came with a piss in the trash bin.  Keep all hands and feet inside the vehicle at all times and you'll be fine.  I hope.Great for that greasy medicine that keeps the hangover at bay--but fortunately tastes much better than medicine.  Well-played, KC.  Well-played indeed."], ["Adam Y.", "I'll admit, I can't give a fair review of Pancho's, because I haven't experienced much of their menu. I keep going back and back (and back some more) because of that darned Texano burrito. It's so good I get cravings for it at least once a month. It's chicken, potatoes, cheese and sour cream in a soft burrito wrap, and I love it.The rest of the restaurant, though, is best experienced through beer goggles after a tour through Westport. I tend to be a day-time diner, though, and things like the beat-down interior and odd smells upon entry really stand out. To avoid those, I usually go through the drive-through, but their microphone manners are atrocious and have been for years.If you go through the drive through, you may wait a few minutes before hearing \"scratch-crackle you.\" Confused, you'll order and hope they got it right, because they won't repeat the order back to you. They won't tell you the total. All you'll here is \"Scraffle-scratch-click.\"It's bizarre and confusing.But the Texano is worth it."], ["Shawn B.", "Funny - all the negative reviews are from drunks..errr I mean \"INTOXICATED\"  patrons (said with my nose up)  who get sick from eating greasy Mexican Food? Imagine that!!!  Or they're snooties expecting the Belagio or something.  It's an old, non-updated, crappy 'Happy Star' converted to taqueria.    THIS place has the best tasting Mexican food around if you know what good Mexican food is.  I'm not talking Americanized, spring-break in Cancoon, tourist food;  I'm talking walking-the-streets-of-Rosa-Rita, true family owned taco stand, cooked-by-pancho-villa's-wife-herself, good.    It's NOT the kind of place you take your family for Dine-In.  Go in, order it to go, take it home in styro, and eat it at home.  Place is like walking into a Mexican (In Mexico) Diner.  It is what it is. BEST CHILE VERDE on the planet.  Get the Chile Verde Burrito MEAL.  You wont be sorry.   I live in FL now, and what I wouldn't give for ANYTHING that even came close to comparing to Panchos. Vive El Pancho's!"], ["L.L S.", "You know in the movie \"UP!\" how the dogs react to the word \"squirrel?  Yeah, that's how my husband reacts to me when I say the word \"Panchos.\"  I don't have say it like it's a question (Panchos?) or even with excitement (Panchos!).  I can merely look at him and whisper panchos and he will be putting his shoes on and grabbing his car keys.Why do we love it so much?  It's hard to say.  A piece of me thinks its about convenience.  Drive thru?  check.  Late night hours? check. Super Nachos covered in pretty much every thing you could want or imagine?  check.I guess the main reason is that there is an undeniable \"homemade\" quality to their food.  You can tell they use actual ingredients and the food is made the actual people.  Doubt me?  order a chicken taco and you get chunks of chicken.  I'm not talking bits of shredded chicken or nuggets of processed chicken like you get at Taco Bell.  I'm taking chunks of chicken that look like they were freshly pulled from a chicken carcass just for your taco.  This is an instance where the word \"carcass\" is a delicious word and not one that involves the west bottoms and the Edge of something or other.  It's awesome.My husband likes the super nachos, california burrito and the chicken tacos.  I like the rolled tacos, chicken tacos, enchiladas and tortas.Bear in mind, this is fast food.  When you get enchiladas, they are not going to be melty and bubbly like they are in a regular restaurant.  A little piece of me wonders about the food handling and sanitation issues that come with lukewarm enchilada sauce, but I figure I'm just building a tougher gastrointestinal fortitude.They used to carry a super tasty tres leches cake, but I think they stopped.  That makes me sad, but it's not like I will stop going there or anything.Like all tacos, Pachos is really best in the early A.M., but be prepared for a decently long wait in the drive thru.  I feel so bad for the employees that they have to endure the drunken transactions of the post-bar crowd.  Panchos, I am sorry for what I did and I'm sorry you had to clean that up.I'm grossing myself out."], ["Mary M.", "Great, great cheap Mexican food!  Carnitas are to die for, burritos weigh like a baby.  This is nothing new from other reviews.  But...I ate inside and was surprised at how bright, clean and friendly it is!   Sounds horrible, but true!  And, inside, there's a great condiment bar you can't get if you drive through.  Check it out, folks!  It's worth it!"], ["Ryan A.", "Amazing carnitas, tasty asada, and super crazy huge greasy flour tortillas. This is pretty close to what I think of when I think of getting Mexican food in southern California. I've never been to southern California, mind, but I've seen it on TV, so I'm basically an expert. Right?I was a regular at this joint years ago. Can't count the number of times I waited 30+ minutes in the drive-thru at 3am. It was practically a midtown rite of passage. Unfortunately, I have since moved outside Pancho's sphere of influence. It had been far too many years since I enjoyed their greasy fare, so I went for lunch the other day to make sure they were still bringing their A-game. I was not disappointed.The creamy green sauce is still the best."], ["Nathan K.", "Drunk, and damn hungry.  3 A.M. chimichanga!Sleep belly full sleep..."], ["Michael N.", "Being that I'm a visitor, stuff like this is hard to rate.  The reviews that compare this to \"Alberto's\" in the San Diego area are spot on.  Everything about it tastes like Alberto's down to the hot sauce which tastes like water \"infused\" sambal oelek.  Anyway, the stuff is just ok.  I never realized it before eating it in Kansas City, but the carnitas burrito has a texture very similar to pulled pork.  I theorize that this is why it gets rave reviews here!  The nachos were also just ok, covered with a salty carne asada and the other toppings you'd expect.If this were Los Angeles, I'd give it two stars but it's not and the fact that it's open 24-hours makes it really stand out in this area.  Furthermore, I don't think I've found anything similar in KC so a four-star rating might even be justified.If it's past midnight and you're hungry, I say try it but don't expect too much as I can really see the reactions go either way."], ["Tabitha M.", "If you are what you eat, eating at Pancho's would make you fast, cheap, and greasy... But in no way is that a bad thing.Midnight burrito NEED?? Lucky you, Pancho's is open 24 hours!! I have enjoyed everything I have had, although the leftovers are greasy enough that you might have to put them in a styrofoam cup to avoid grease leakage. My boyfriend particularly likes the carne asada torta. The bean and cheese burrito is massive and delicious. Spicy guacamole is a must. And their horchata is very good too!!I'd give it a 5 star, but I have to knock one off for cleanliness. Or lack thereof. But what do you expect for cheap, fast deliciousness?"], ["Arkell E.", "I finally found Mexican food.... whoohoo... I've been in Kansa City for like a month and craving for food like home in San Diego California. Eating at Pancho's made it feel like back HOME. Thank you Pancho's for opening a mexican shop here in Kansas City."]], "Cancun Fiesta Fresh": [["Vinz B.", "Welllll, these guys WERE my \"Chipotles low cost alternative\". That is up until today!! I witnessed a sanitary issue in the prep of my food. Goes like this. The food prep lady handles a broom (dirty), answers the phone (dirty) ... THEN without wash her hands, immediately starts in making my burritos ... with NO GLOVES on? Whaaaa?? In the FOOD service industry, isnt  that's BASIC guideline ...  food preparers are to wear frekkin GLOVES????  And my thought has always been ... \"if THAT goes on in the FRONT of the house, what's happening in the BACK? Cant trust it.The owner walks in, so I mentioned it to him. I wanted to let him know why he just lost a regular customer.  Instead of just \"not coming back\".  My intent is not to bash this restaurant. I liked their food (especially for the price).But I just will NOT be consuming food from restaurants with low sanitary standards.Sure, Chipotles is more expensive. But it's CLEAN. I'll pay it. \"Sorry I broke up with u Chipotles. She was sexy and cheap, but YOU keep the house clean. PLease take me backkk."], ["C C.", "Freaking awesome tacos! I'm from Texas and struggle to find good street tacos. These are the best the plate includes 4 tacos and a drink. Mix it up try the different types of fillings my fav are the adovado. All I can say is fast, friendly and delicious!"], ["Sunny R.", "Pros:- PRICE. You get what you pay for; if you came here expecting 4 star delicacies with fresh farm grown ingredients from their backyard community farm you should immediately re-evaluate your expectations. If you've come to Cancun for quick, cheap, and delicious late-night food for under $7 you are at the right place.- TASTE. The food serves a purpose. A quick meal, with a lot of meat, and a fairly appetizing taste. There is nothing original about the way the food is prepared or served, it is just a good 'ol late night burrito shop with no-frills or unnecessary niceties. -SAUCE. Again. Nothing OUT OF THIS WORLD, but it is unlimited and 'pour as you like', which in my book is always a win. The sauce comes in 4 'hotness' levels and the range covers all the necessary pallets. - CLEAN. Although this place is a hole in the wall, low-cost, late night eatery there is no reason it can't be clean. The bathroom was not filled with unpleasant smells, stagnant pools of liquid, or streaks of a questionable nature. It was a tidy bathroom and when an establishment gets (what should be a very basic formality in operating a public establishment) correct, it automatically garners some of my respect.Cons:- EXPECTATIONS. Although this place is currently sitting at a 4/5 rating on yelp, you should not go in expecting culinary greatness. It is good for what it is, and that is (like I've said numerous times before) a late night, 5 beers in, quick place to grab a hearty meal. Overall:- Cancun Fiesta Fresh is no avant-garde Hispanic dining experience. Like reviews of past have stated, it is a one-stop, fill your stomach to the brim, burrito shop. If you'd just like some cheap food that isn't Chipotle, McDonalds, or FreeBirds and is open a little later, Cancun is a great option."], ["Renee R.", "I've had several issues with customer service at this place. They are rude and difficult. Couple that with the mediocre food that is, in my opinion, overpriced and you get.....one star."], ["Tim P.", "First time there.  Not that busy.  Friendly people, food came fast.  Now the bad stuff.  I had shrimp tacos.  The shrimp was breaded.  Was expecting grilled shrimp.  The shrimp was very small.  Everything needed seasoning.  Very bland food.  Everything needed salt.  The beans, rice, guacamole that came with the chips and guacamole.  Only tea there is brisk.  No regular iced tea.  Wife had the chimichanga.  Sort of crispy on the outside.  Inside very mushy.  Probably due to them using retried beans instead of black beans.  Doesn't make sense to stuff half of it with chicken and the other half with refried beans when there's refried beans already on the plate.  I do like however that my tacos came with a slice of lime.  I asked for some lemon too, for the guac but they don't carry it I guess.  Oh, the guac has avocado, tomato, and jalapeños.  Wife got sick from the jalapeños since she wasn't expecting it.  Again no seasoning in the guac.  Won't come back."], ["Alexis D.", "My husband and I came here for lunch. The customer service was great off the bat. We ordered gold margaritas, street tacos, and the mini burrito plate. The food was excellent!! Fresh and much better than most Mexican restaurants that taste like the food was microwaved on the plate. Prices were definitely reasonable as well. I have to say I was hesitant to go in when we pulled up but we are both so glad we did! We will be returning in the near future!"], ["Steven J.", "I ordered delivery for myself and three coworkers. As underwhelmed as I was by the food my biggest issue was that they wouldn't allow separate checks. I guess they would rather the delivery boy make four trips to the same place than allow us to pay separately. I decided I'd let that slide once and see if the food was worth putting up with their stupid rules. That was a mistake. There's nothing special about the food here. It's just about mediocre or less than. While the meat in my asada tacos was very dry and overcooked it was fairly tasteless as well. The corn tortillas were of decent quality but too light and small. I feel like they should be using at least two per taco as I was unable to get halfway through one before the whole thing collapsed. My horchata drink was the only good part of the meal.  The marginal sanitary conditions others have mentioned and the lack of anything fresh means I won't be ordering from this place again and I won't recommend them either."], ["Jennifer S.", "Two words:  STREET TACOS! AMAZING! This is definitely a Go-To place for a quick cheap Mexican fix.  They have wonderful tacos/quesdillas/chimi's and they just added a new white cheese dip that has jalepenos (which is runny, but still delicious to drench anything in).  That's the fattty in me talking...Also, if  you are in or around the area where they are located, they have the fastest delivery! I mean, super quick every single time I have ordered.... mind you I have been eating there for years!   Cancun, I want to thank you for the delish tacos and cheese dip! Oh and the muffin top to go with it!   Well worth it!"], ["Alex T.", "I've developed a healthy respect for this little place over the past few months. Their street tacos are good but not amazing. You'll have to travel elsewhere for truly great Mexican. (Bonito Michoacan comes to mind). However, their tamales are pretty delish, and you can't beat $18 for a dozen of those little bundles of goodness. Tex mex isn't really my favorite style of food, but their more American offerings are actually pretty decent. Their burritos pack a decent flavor punch, and the hard-shell tacos are a steal for $1 on Taco Tuesdays. Last but not least, their sauces are pretty good by me. I'd gladly augment my food with any of them, but I think my favorite is the hot sauce.Really, I'd probably only give the place ~3.5 stars for food. They earn bonus points for delivering and for being the best Mexican place in Midtown (that I've tried, at least. I hear good things about La Piedra del Sol and will definitely check that out). You've got to get over to Northeast or to KCK to get better food, and both of those are a decent hike for me."], ["Monique D.", "Best street tacos ever. Great quality. Great price. So fast and very friendly. We lived in KC & this was our jam. We are here for a long w/e and Cancun was a must stop. Muchos gracias."], ["R B.", "Love this little joint. Super nice staff, great street tacos, and although I don't think it's on the menu they have a tasty queso blanco dip.Frankly, I don't see much reason to venture beyond the street tacos here; they are probably the most authentic thing on the menu and are consistently good. I don't recommend the chicken which tends to be dry and lacks flavor, but the asada and carnitas are delicious. Make sure to load them up with the salsa verde and a squeeze of lime juice (and a little sour cream never hurt nobody)."], ["Robert J.", "I found this little off the wall Mexican place on Yelp when looking for somewhere to enjoy Taco Tuesday.  When we pulled it I questioned my decision since it looks like an old auto repair building but once we went inside and saw the fresh food being prepared I was at ease.  The $1 tacos are real chicken breast cut up and served with fresh veggies, multiple options for salsa and even the guacamole was made fresh.  The prices are inexpensive but the food was top shelf.  This is not a first date type location, the appearance itself seems old or a little rundown from the outside but what they don't spend on decor they more than make up for with food quality.  It is somewhere I look forward to eating at again...soon, maybe tonight!"], ["David M.", "Addicted. Have been there three times this week after moving to the area.Staff is not always the friendliest, but it's the food that matters.I go for the Quesadillas and a drink, but once I tire myself out on those, I'm looking forward to running down the rest of the menu."], ["Tamara S.", "Recently moved here from NYC so had no clue where to get some decent Mexican delivery. Until now! Came way faster than the 30 mins they said it would take and is pretty tasty. I had a chicken burrito and a side of chips and guacamole. Really like the fresh cilantro in the burrito. Guacamole is very smooth but a little blah could use more jalapeño. Regardless will definitely order again."], ["Carol A.", "Cancun Fiesta Fresh has been on Hub's and my short list of places to try and Tuesday was the day!  I love good Mexican food and Cancun delivers in flavor and value.  Hubby stopped looking at the menu as soon as he realized that it was Taco Tuesday but I wanted to give this place more of a try so I ended up with a very tasty Chicken Chimichanga and we shared a chips and guacamole.  It's a lot of food for under $15.  Very Fresh tasting and filling.  We luckily arrived just before the lunch rush but within less than ten minutes it was BUSY and stayed that way for the whole time it took us to eat.I tried all three sauces and found that a mixture of the green 'medium' and the 'extra hot' was just right for me.  The Chimi was a great size and not at all greasy.  Just full out flavorful.  Service was fast and friendly and we will definitely go back again.  Only problem is choosing what to have next time.  While we were eating I was scoping out other customers selections and saw a lot of really yummy looking plates just in the short time we were there."], ["Matt E.", "I just wanted to let everybody know that while the street tacos are still my true love, I have recently learned that the rest of their menu is dang good too. Their fried beef tacos? good!Their burritos? good!Also, I really appreciate the strength of their customer service. These people are all over it when it comes to getting your food out and your table cleaned up. Super nice people! BUT THEY STILL DON'T DELIVER TO THE RIVER MARKET!!!!! grrr"], ["Jimmi H.", "I am big fan of this little eatery.  I can't say that I have had anything outside of their street tacos, but how can I, they are amazing.  They have a good variety and every taco I have had here has been well worth the visit.  I often think of the mass consumption that would occur if they delivered to the River Market (hint hint Fiesta guys).Cancun Fiesta Fresh is a bit of a hole in the wall.  I can't say I like the neon tree out front, but I guess when you are tucked away in the back of Westport anything to draw attention may be helpful.  Don't let their size fool you though, this place is big on service and huge on tasty taco's.  As soon as you walk in the front door here you are welcomed and if your ready, immediately serviced.  I like that when I order, fresh ingredients are pulled out and my food is made on the spot, usually done before I'm through paying, but always ready before I have collected my salsas and drink.  My favorite here are the cow tongue and cheek (seriously, no pun intended)."], ["Conor L.", "One of the best spots in town. Fantastic staff, food, and sauce. The adovada is the best thing on the menu meat wise by far. Taco Tuesday are standard tacos but very good. The sauce is great. The very hot is great, but amateurs beware."], ["Josh M.", "Full disclosure: this was my first visit. It's tough to pull me away from the Boulevard when I am craving tacos..Went here on Monday for my bday lunch with my friends Adam H. and Jocelyn L.. It was packed but from order to delivery at our table, it didn't take very long at all, maybe four minutes. There is a salsa bar and you serve yourself from the fountain. Silverware and napkins are your responsibility also, but it's a dive so who gives a shit.Taco's are pricey, I believe I paid $1.75. I know it's only fifty cents but street taco's should never cost more than a buck twenty-five. And taco's weren't that big at all.The taste was, as the three stars indicate, A-OK. Nothing to rave about. It has other offerings as well. My dining buddies each had a burrito that was on special for Monday. And both of them were disapointed in the cheese sauce. Not the sauce itself but the amount they put on top.Looking back at the review, it seems I was a bit negative. Let me just say the following: if I lived or worked in the immediate area, I would be a regular here. It's \"good\" in a town of abundant \"great\" taco joints.Oh, and what's better, they deliver!!"], ["Jerry M.", "Highly recommend the fish tacos. Staff is super friendly along with expedient service."]], "Ricos Tacos Lupe": [["Egan B.", "Went here on a whim after seeing a $1 taco Tuesday sign out front. Ordered 5 tacos (chicken, pastor, steak, chorizo, carnitas) with the works. I was immediately served up some hot tortilla chips and salsa. Also ordered guacamole which was the same price as my beautiful taco plate combined. The tacos were great. Authentic street tacos with a nice selection of salsas to go with them. The guacamole was fresh and delicious. A squeeze of lime, dollop of guac, squirt of salsa and my tastebuds were dancing around all over my mouth. Rinse and repeat x 5. On another note I saw a man with a pint of tequila and several tecates on the table.. BYOB maybe?"], ["Adam S.", "Taco addiction is real, friends. That simple combo of corn tortillas, carne asada or pastor meat, chopped cilantro and diced onions can completely take over your mind. Luckily for anyone in and around the Crossroads, Ricos Tacos Lupe delivers your fix at just $1.50 per hit.. I mean per taco. These authentic little tacos are worth every penny, bursting with flavor and with three table sauces to doctor them up if you'd like. I tried the pastor and asada which are always my personal favs. These didn't disappoint, although I did have to add on to my original order of three because I was both starving and they were hitting the spot. We also tried out the guac which was awesome as well.As others mention, the place is a hole in the wall, not that there's anything wrong with that. It's not about having cloth napkins and service, it's about getting that taco fix. Prices are right, tacos are delicious, and I'm glad there's a spot that is close enough to get to regularly when those taco cravings strike again."], ["Mwineland25 ..", "Le-freakin-git street tacos?  CHECKBomb donkey kong burritos?  CHECKSalsa's that make your tongue dance?  CHECKThe people that gave this place negative reviews not good people?  PROBABLY"], ["Dena N.", "So, I had a taste for tacos and on a Tuesday in midtown the options are endless. I wanted to try a new place and after reading some reviews decided to give Ricos a try. Understanding it was Taco Tuesday, I decided to go later to not be in the prime lunch hour. I arrived at the restaurant just after 1:30 pm and waited for nearly 10 minutes before even being acknowledged by anyone even though several waitresses and the hostess walked by me several times. Since I was now nearly 30 minutes into my lunch hour after battling parking and waiting, I decided to order steak nachos and a carnitas taco to go. The taco was tiny. The carnitas was overcooked, hard and crunchy. I love nachos so I was hoping for better luck but was quickly disappointed. The cheese sauce was very strange and tasted like a ranch dressing that has cream added to it. There was also a strange yellow cheese substance that was a cross between real cheese and cheese whiz. The steak was actually good but overall the visit was disappointing. I ended up throwing most of the food out and will stick with one of the other options on the Blvd. for my next Taco Tuesday."], ["Kevin T.", "Along Southwest Boulevard you can find some of the best Mexican/South American food in the metro.  The best street tacos on the block are at Ricos Tacos Lupe!At regular price they are $1.50 each for your choice of meat, double corn tortilla and topped with onions and cilantro.  Four tacos is a solid meal and it gets better because on Tuesdays they are a dollar each!  I have tried the beans and rice, in my opinion just buy more tacos if you are feeling super hungry.  I recommend the seasoned beef and seasoned pork , both were delicious.  Their house made salsas were terrific, I was particularly fond of the green one.  Quality of these tacos paired with great pricing makes me think I will be putting Ricos in heavy rotation on my places to eat for lunch from now on."], ["Neeca B.", "Seriously the best tacos, just like for real Mexico's street tacos. The price totally makes you not even care your in a hole of a wall kind of place. I just wish they were open later. They have other options but honestly just go for that tacos. Avoid Tuesdays which you will be waiting way to long for the cheapest of yummy tacos on Tuesday  get even cheaper."], ["Suzan H.", "Solid but not amazing, authentic Mexican tacos. I had two chicken and a veggie (black beans, was expecting pinto but fine). White corn tortillas were fine. The chicken flavor was good but the tiny dice made the texture a bit strange. The salsas are GREAT, though overly salted, even for me and I love salt. I bought a pint of each (red and green) to take home. The salsa fresca was, again, OK but not great. The tortillas were a little stale.My nephew got a chicken quesadilla and horchata. Both were fine. Would have liked more cinnamon in the horchata but that's personal taste.The restaurant itself was clean: didn't use the bathroom so can't comment on that.The service was solid, not overly friendly but not rude. Just moved here from California so I expect more friendly/warm service but haven't encountered that in general in KC, so I guess I can't complain. I'm looking forward to trying more taquerias on SW Blvd. and probably will go back to Lupe's, though not right away."], ["Maxwell T.", "Went for taco Tuesday where taco's are 99c. Had 5 asada tacos and left full and happy. The taco's are real street tacos and the whole place is BYOB so it's kind of an interesting vibe in the place."], ["Carrie U.", "You want to go where to eat?! Fear not my fellow gringos. Even in the darkest hour this place is full of your fellow hipsters toting a six pack of KC's finest local beers (this place is BYOB). It's not quite what you'll get on the streets of Juarez but Taco Tuesday's is on point and the asada tacos are decent. Sauce (chile) is a bit too creamy for my liking but it's their thing and it works. Look crowded? No worries. At the busiest it's maybe a 10 minute wait and your food shows up before you've finished people watching. *They do not have lengua. **Hours are odd and not guaranteed, see pic."], ["Ryan P.", "Don't believe the other 2/3 star posts below....Rico's is where it's at, my friend.  Great, no-frills street tacos, absolutely freshest and best salsa around (ask for the pineapple habanero, as they only serve it upon request), and now TAMALES.  Not just any ol' tamales, but tamales made by Lupe's grandmother.  In a word, fantastic.Oh, and Rico and Lupe are just about the nicest, most inviting folks you would ever want to meet.Go get some.  Like, now."], ["John M.", "The real deal here!!  Good authentic tacos.  Nothing fancy, but very well prepared."], ["K S.", "Family owned and operated.  The green salsa is out of this world!  Love the burrito supreme."], ["Dan D.", "A great local spot for street tacos! I've been going here since 2009 and always recommend it to friends.Tacos on Tuesday's are always a great deal, but it does get busy over the lunch hour. If you're in a pinch for time, consider calling in for a take-out order.I highly recommend the Asada, Chorizo or Carnitas tacos. Burritos & burrito spreads are also very good. Ask for spicy salsa, and they'll offer a variant from the normal red & green sauces/salsas. Occasionally they'll bring out some extremely hot stuff on request. Watch out! You're tongue will be burning for at least 30 min afterwards. Big fan of Ricos!"], ["Saney K.", "I have seen this area so many times in the past seven months and finally decided to try the food at Ricos. Really good food. I ordered 2 steak tacos and 1 chorizo taco. The meat in the tacos were not a whole lot like I was expecting, however it tasted really good. The 3 sauces they have in the bottles were not spicy enough so I asked for something spicy, and they got me a bowl of habanero sauce. It was freaking good. Spicy but a little sweet, kinda weird but tasted great. I left the place full and sweaty. I will eat here, no doubt about it."], ["Jake B.", "If you find yourself not celebrating taco Tuesday here ... Reevaluate your life.Their street tacos are delicious and extremely cheap. I've tried each one and would get each again.Plus it's BYOB and there is almost always a Spanish soap opera playing in the background.So bring and drink your own booze, eat cheap tasty Mexican food, and enjoy friends company while having dramatic Spanish television as ambient noise.GG."], ["Maggie S.", "It's my all time favorite. Street tacos are legit, I don't even look at the menu."], ["Jesse B.", "I'm annoyed. Me and my friends have been here almost an hour and still no tacos. The only way we got a second basket of chips was by stopping the \"server\" and asking for one. Three girls walked in, we're given chips, waited three minutes, and then were served tacos, and that was twenty minutes ago. A father and his son walked in, ate dinner, and left during this time as well. When we were asked what we wanted to drink a hour ago we said water. There is a pitcher of water on our table and still no water glasses....an hour later. Horrible service period. I hope they don't make server wages."], ["Cole H.", "This place is cheap but wasn't a very good taco. Had beef and chicken.  Both were over cooked. Pretty traditional toppings. Lots of onions. Will be the only time I try it."], ["Christina C.", "Can't. Stop. Eating. Street. Tacos.  I have been here 3 times in the past two weeks.  Just can't get enough of those little street tacos.  Sometimes they are a little heavy on the onions, but they are freakin fantastic.  I've had the chicken and pork, but the pork carnitas are the way to go.  Amazing.  Surprised when I went at 630 on a Taco Tuesday and walked right in.  And I don't know what that orangish sauce is, but it's hot and tasty and I want to drink it."], ["Jessica N.", "Loved the carnitas taco, but the chicken and asada were great too. (Went on a Tuesday for $1 each).   I  LOVED the green sauce! Lupe was so nice and helpful when ordering!  Fantastic experience!  I can't believe I waited so long to try... I had walked in before but had been intimidated by the amount of people by the door.  But as others have noted, you don't really have to wait for long.  I can't WAIT to go back!  It's really a secret gem hidden on the Blvd."], ["Rachel W.", "Amazing street tacos, we got carnitas and picadillos with onions and cilantro.  The corn tortillas are perfect,  and the tacos are served with lime wedges and a variety of sauces.  The service is quick and friendly.  the location looks a little sketchy, but the clientele included couples and business men.  We will be back often.  If you want a fancy dining experience this isn't for you, if you want inexpensive authentic food this is the spot."], ["Matt E.", "Matt Fact: Due (at least in part) to my unwavering love for tacos, the hubbs and I have elected to move to the Westside, so that we can more easily wander the Boulevard, indulging on these glorious foodstuffs. My first taco-scenario? Needing to buy a just ridiculous number of tacos to feed the masses that graciously helped us move. Who did I call? Rico's Taco Lupe!I call in and ask what kinds of street tacos they make, and to the best of my memory they serve: chicken, steak, bbq pork and shredded pork. I wasn't wanting to think, so I simply said \"give me 35 tacos! I don't care what kind, just give me a mix.\" They were at first a bit confused with the freedom I had bestowed upon them, but soon enough we had the order worked out, and they said it'd be 20 minutes. That's right people, only 20 minutes for a grande to-go order!I make my way in, and am a few minutes early. I make small talk with their employee Jessica, who is nice as pie. It comes up that I had just moved to the neighborhood and she gave me a few tips and tricks, which is always appreciated. I said that I'd probably be there often eating lunch, as I'd be working from home. She even said that if I got lonely she'd sit down and eat with me. I thought she was joking, but the other employees confirmed that she in fact would. Looks like Jessica and I have a taco date!They used to be cash only, but no more, compadre! They took my Visa like whoa. I carried the tacos back home, and me and my crew dug in. They were all hot, fresh and delicious. Sometimes street tacos have a tendency to be a bit oily, but not these! The only reason this place gets 4 stars instead of 5 is because their limited fillings make me sad. I'm big into lengua and cabeza and am always willing to try things a touch more exotic. I wish their offerings reflected that. But otherwise, this place is great! Delicious food, excellent service. Rico's is full of win."], ["James D.", "I've had the great opportunity to eat Ricos Tacos Lupe 2 times. both were amazing! Their street tacos or the traditional small tortilla tacos filled with meat onions cilantro or whatever you order. I did get a side of rice and beans which to my dismay was slightly under portioned compare to what I was expecting. BUT each side was only a dollar so maybe it was on par for the price point.All the tacos taste amazing so I don't see it necessary to describe each one, just get anything and it'll be great!As I was sitting down I was facing the small kitchen with is basically a few prefab walls pul together to make a small room as you walk in the door. You can see over the wall, a large silver cooking hood and a vent that runs outside. There are saloon type doors that allow entry to this little kitchen and below the doors I saw a flat tire. Upon further inspection I am led to believe that they used to have a food cart and simply rolled the cart into the store to cook! Now, I love the idea of this. I think they should make it more visible though! There isn't anything about RTL that really makes them stand out from the other taco shops but I bet this would be a good way to go that!Since there is a LOT of taco options around, I would see myself exploring more options before returning, if it wasn't for one thing. RTL has a wall of fame if you can eat 10 or more tacos! My friend and I don't think it would be THAT big of a challenge so we may be returning to get our photo on the wall!"], ["John H.", "Street tacos are the way to go..... try the green sauce.....yum. ^^ That was my instore assessment. I will add a bit more. Ricos is an awesome divey taco shop. They actually serve the tacos off of a food cart that is parked in the 'restaurant'"], ["Wade B.", "This place has the best street tacos.  $1.50 each or $1 on Taco Tuesday's.  Match it with a Mexican cane sugar coca cola and I'm in heaven.  Try the chicken or marinated pork for sure.  The only negatives are limited parking and crappy salsa.  Still worth it!"], ["Anne M.", "My boyfriend and I are regulars now so this review is a bit biased. I love this place. Some of the best tacos I've ever had. I get the carnitas. My boyfriend gets the asada. We are never disappointed. It's a simple place, but the food is cheap and delicious. That's worth a visit I think."], ["Alex T.", "I've been searching for good street tacos in KC proper for quite some time. Cancun Fiest Fresh is good enough to sate the craving, but I was really hoping for something more along the quality of Bonito Michoacan, only not 20 minutes form me in KCK. Ricos doesn't quite hit that mark, but they're the best I've experienced close to midtown so far. The tacos are stuffed full of whatever meat you choose but are a little light on the onions and cilantro. Make sure you ask for extra of those. I had the asada and carnitas tacos, and my dad had straight chicken. Everything was quite tasty, and I'm glad they fry their carnitas, unlike several other places in town. All the great, strong flavors you expect from good Mexican street food are there. No complaints from me on that level. The sauces that accompany the tacos are good but nothing outstanding.  If you come here, I'd advise against any of the more Tex-Mex options. The house chips and salsa are, frankly, pretty gross. The chips tasted borderline stale, and the salsa is basically just pureed tomatoes. I also had an order of guac which was okay but certainly not helped by the chips.To be fair, I only ate tacos, but I don't hold out much hope for the Americanized entrees. Stick with the street food, which certainly appears to be this place's strength.I'll be back, but make no mistake: Bonito Michoacan is still the king of authentic Mexican food in town, as far as I'm concerned. However, if you want good tacos at an excellent value, Ricos Tacos Lupe is an excellent place to start if you don't want to trek to KCK."], ["Tanner C.", "Way better than panchos ! First taco spot I went to when I moved to Kansas City, and I love it. I'm going to be on the wall next to all my friends for eating ten tacos."], ["Donna T.", "This review is just for the Lenten menu. Today I had the fish tacos and they were fantastic. Grilled white fish (I didn't ask what kind) with lettuce, tomato and onion and a spicy mayo. Totally hit the spot for the first warm day in a while. Service was fast & friendly, like always"], ["tc i.", "love love loveit's a dive, but worth the drive!love me some ricos tacos and my two year old son does TOO!salsa is great.mexican coke. really friendly-what more can you ask for???"], ["Ellen S.", "Tuesday is for tacosThat's all it'll ever beAnd if you don't like tacosI'll hit you in the knee.Try the orange sauce on the tableIt makes a dish delishAl pastor o polloBut they don't offer fish.Taco Tuesdays fits your budget(Yes, even one as tight as mine)You get a taco for a dollarAnd it's even served with lime!Yaaaaay Ricos!"], ["Andrew K.", "Good value, tasty asada, chicken quesadilla was great. Salsas were tasty. But the al pastor was shockingly flavorless. Utterly bland and dry. I'm hoping it was an off night, because I really want to like this place.Maybe it was because it was a Tuesday and they had issues keeping up with volume. Otherwise, fun times. Certainly worth a second look."], ["Conor L.", "Taco Tuesday is fantastic. Carne Asada is good but Carnitas is best. Tacos are stuffed so fat and have double tortillas so you can make two tacos out of one if you like. Stick with the squeeze bottle sauce, if you don't like one you'll like the other. But they're both great. If you don't want real Mexican food, this is not your place. You can get your chips and salsa/nachos down the block....."], ["Joe W.", "I took my family hear for lunch. Green sauce is wonderful and the hot is not crazy hot with great flavor. Asada and Carnitas were really good. These plus a Mexican Coca Cola make a great lunch. We will return for sure!!!"], ["Deana W.", "Bang for your buck! Well...I guess I should say...Bang for your buck fifty!   Authentic tacos piled high, with your choice of meats.  They've got a choice for everyone. Steak, al pastor, cheek, tongue, and stomach.  If you're not in the mood for a taco....crazy as that may seem, then for $2.00 get a fat burrito.  Chips and salsa are no big deal, but the sauces they put on the table with your meal are lip licking lovely.  Say that three times fast! Honestly...you can eat yourself and a date into a coma for $10. Tuesday's tacos are $1.00, Thursdays burritos are $2.00. Authentic, inexpensive, fresh, and fast.  Who could ask for more?  Well...maybe me, but I'm totally stuffed right now."], ["Joe M.", "For the price, this might be my favorite place in KC. $1.50 street tacos (if you can eat 10, you get a shirt and your picture on the wall) and amazing salsas. I bet you can eat 4-6; no big deal. It's not a big place, so if you're going on Tuesday ($1.00 street tacos), you best not go right at lunch or dinner time. Friendly staff and a variety of meat selections, this place is awesome. I will say I haven't had a burrito there yet, but I will update from 5 stars if it's not as amazing as the tacos. But c'mon, get the tacos!"], ["Amy E.", "I am very sad to be forced to downgrade my previous rating, but the restaurant has given me no choice.  The quality has dropped off precipitously in the last month or so.  The burritos have always been fantastic- fresh, tasty, with attention to yummy detail.  But the last three times I have gone, the burritos have been the exact opposite.  (This is especially strange because it is the same guy who is preparing them.)The problems:  the food appears to be prepped days in advance, and then left to sit and deteriorate.  The lettuce shreds within the burritos are edged with brown where they were sliced, and the lime wedges, too, are edged in brown at the cut marks, and also display splotches of brown where the fruit is generally spoiling.  The tortillas are significantly stale, as are the chips served at the table.  Very sad.  And too bad.I reiterate that the burritos have been in this same sorry state the last three times I have visited, so I am not basing the change in rating on one bad and uncharacteristic experience.  I hope that the place ramps its quality back up to previous levels.  If it does, I would be happy to start patronizing the place again."], ["Brian E.", "Went here at the suggestion of a co-worker to have their $1 street tacos on Tuesday. Upon walking in the placed looked to be a dump. My sense of smell was overwhelmed with the scent of cooking meat and caustic cleaners. It wasn't pleasing at all.The salsa tasted like tomato sauce, simply no flavor at all. There were 3 other kinds of salsas in plastic tubs at the front that you had to serve yourself with, but honestly they weren't much better.The street tacos were a good value, however I tried the Pastor, Asada, and Chorizo and none of them had any real flavor at all. I mainly only tasted the onions.I would not recommend this place to anyone and would avoid at all costs.However, if you like getting your picture put up in a restaurant, they will take your picture and hang it on the wall if you eat 10 street tacos in one sitting."], ["Karla M.", "The food is good.  Better than I expected when I initially walked in.  I'm a total snob for tacos too and these were good enough that I call them good. The service was AWFUL. Simply awful.  I know that some Mexican Restaurants don't have the best service but there was no excuse to purposefully avoid eye-contact with a patron at your restaurant.  If you're willing to take a chance, feel free. Me? I'll be eating my tacos in KCK at El Camino Real!"], ["Dan D.", "This place has fallen off a lot over the last few months, it has become hit or miss. The biggest issue being the lack of service and the long wait times for food. I can understand the wait for food as long as it's good. On a recent visit we were brought chips, then water, then menus, then drinks, then a 10 minute wait to take our order. We ate the chips and when we were asked if we wanted a refill we figured that the meal was on the way shortly, not exactly, 25 minutes later our tacos came out 3 at a time. I felt bad for the girl working she was by herself on taco Tuesday.The food was ok but not what I have gotten in the past, I will give this place another chance but honestly there are better places in the area that want the business and are trying to make their guests feel welcome."]], "Chuy's": [["Brandon M.", "Love this place! Always have!!!GREAT chips and a wonderful variety of salsas to dine on while you are waiting for you for you to come. The staff is always smiling and helpful!!!Fantastic menu with a great variety of gluten free items. REALLY WISH THE STUFFED AVOCADO WOULD MAKE IT TO THE REGULAR MENU...hint hint management and chefs!!! If you sit in the bar, make sure Mariah is your waitress! She is simply fantastic!!!! So observant, never lets your drink run dry and absolutely pays attention to detail!! Thanks Chewys!!"], ["Jesse M.", "I'm not one for chains but we love Chuy's. The service is hit or miss but my most recent experience was great! It's always busy so we usually opt to sit in the bar. Very well priced for the plaza and love their happy hour! I would recommend the corona-Rita and tacos carbon. I get both steak and chicken fajitas in my tacos and they are freaking great. Make sure to ask for their creamy jalapeño sauce for the chips and to add to your food. It tastes like dreams come true."], ["Matt F.", "Very fun place to go to eat. Lots to look at on the walls and the service is great. The food is very affordable and everything I have had so far has been good.FYI- Lots of kids there!"], ["Thomas A.", "It's Plaza Tex Mex and it's pretty good.  Fun atmosphere.  Service was friendly.  Food was in nice quantities steaming hot and fairly timely considering how busy it was.  It's a nice place to go have a great lunch after trapsing around the Plaza or just to enjoy good food in a fun atmosphere with the tourists.  Seriously.  I enjoy this restaurant and I like the food."], ["Paul R.", "It was our first time visiting this establishment and we had a great time. We sat in the bar area and received very accommodating and friendly service. The chips and happy hour margiritas were excellent !"], ["Ashley S.", "Very kind staff here. The food was not phenomenal and I've definitely had better Mexican in Omaha. I'd say the food was just OK but nothing spectacular! I think the salsa could be better as well. (The salsa and chips they bring you when you first get there) :) I loved the experience and I think it's a super cool atmosphere and a neat building!! I will say that my margarita was fantastic!"], ["Trev W.", "Average Tex MexLocated on the edge of the Plaza, Chuys is upstairs, yet you can enter around the back.Not really much to report here. The decor feels really dated, the cutlery was served in sanitized packets and the servers are slammed to the point where they were serving the wrong dishes to the wrong tables.The food tasted like plastic! The soft tacos I order were average at best. The chips that were severed with the meal broke apart even just to pick up.The one star is because the server was very niceOverall:Forget it"], ["TJ L.", "Good food! Fun atmosphere! Raspberry margaritas are tasty! They make their tortillas in-house and you can watch them being made as you walk to your table. The standard tacos are excellent! Great service too."], ["Adam L.", "Chuy's is a great food option in the Plaza area.  The food can be a bit spicy, but very good.  Ask for the creamy jalapeño dip with your salsa, it is a blend of ranch, jalapeños, and cilantro very tasty.  Got the tacos al carbon probably some of the best steak I've ever had in a taco.  We also had the Chicka Chicka Boom Boom enchiladas very good.  Only downfall might have been not enough help in the bar area, one waiter was trying to serve about 6 tables at once."], ["Patrick H.", "- Atmosphere is fun and colorful. Lots of art on the walls. All in all it feels very comfortable. - views of the plaza fountain with some outside seating. - Staff was friendly, knowledgable and very attentive.- Amazing food!!! But do watch out as some plates are spicy. So ask your waiter. - The deserts are large. Enough for 2-3 easy. - Note the silverware is wrapped and sealed up. Kind of nice knowing that the silverware is clean and not touched until I open the sack. - Parking can be found to the north garage or several others nearby.All in all a great place to visit with friends and enjoy good food!"], ["Sya N.", "Tex-Mex Margarita Martini, garnished with olive stuffed jalapeños. So amazing. Chips and finely chopped salsa just made it a great evening. They came to refill more chips when we were almost ready to go but hey, it's complimentary so I'll be nice. They used to have the wonderful Nacho Bar but not sure why they took it down when it made the business more busy. It's a perfect bar for a huge gathering. I've been here a few occasions and they don't say anything when we combine the tables. Bartenders are sweet. I asked for more olives and I got it."], ["Jarrod V.", "My wife and I came here on the recommendation of a friend, and boy are we glad we stopped in!At first blush, Chuy's is a very silly place with goofy shirts and crazy stuff on the walls.  But there is a lot more than that here.  Good food and good service wait if you can get past the shenanigans.On our visit, we were wowed by our server Olga.  She was very helpful and attentive.  Our drinks were never empty for long and neither was our basket of chips.  She was very helpful with the menu and made suggestions when we couldn't decide.  Can't say enough great things about her!Per our usual, we started off with the queso dip.  It was very good with a kick to it.  Some spice, but not too much.  My wife loved the salsa too.  Very fresh and tasty.  My wife got her usual test meal, a chicken chimichanga.  I got a bean burrito smothered in chili con carne.  Everything was delicious.  My wife did like the rice, but she couldn't stop eating the beans.  Other places, she will forgo the beans for more rice.  Here, she left rice on her plate to eat more beans.  The chicken in her chimi was very tasty.  She got a sauce that was very much like a jalapeno ranch.  She liked it and put both that and some of our leftover queso on the chimi.  My burrito was huge!  I couldn't finish it!  The chili con carne was listed at 2 peppers, which concerned me a bit, but when I tried it, it was really good.Top notch experience!  My wife said this place would be her new favorite if we lived closer.  We will most certainly come back!"], ["Chris B.", "Had the chili rellenos. Seasonal Hatch chili with pork filled, wrapped in bacon. Also the tried and true meat filled with deluxe tomatillo sauce.   My go to fave.   Service person was new so slow as she needed help to enter the order."], ["Stacey S.", "I'm a fan of Chuys! I've been to a few and I was so happy to see it coming to Kansas City. I love their twist on traditional dishes! Everyone has to get the jalapeño ranch or maybe it's called spicy ranch? I can't remember but it goes awesome with the yummy chips. The decorations inside are awesome!! So much to look at and pretty funny stuff! The wait staff is always upbeat and happy and attentive! I'll definitely be back!"], ["Savannah R.", "They have veggie options, which is always nice! The food was just ok, which is sad considering Chuy's in Austin, TX is amazing. The service was great, the food was hot, the restaurant was clean. Over all A-OK."], ["Anna S.", "Really, really good! I went with my parents and was afraid it might be too new age for them, but the waitress did a really great job explaining how things work. We had an appetizer called Panchos, and it was so good. I highly recommend it. For my entree I had their giant burrito, again pretty great. But lets be honest their drinks are where it's at! I had a Piña Colada Margarita...oh my goodness, so good!"], ["Shanley C.", "It was my first visit to the Plaza location since opening in October 2013. To be honest, I had some hesitations about going because I'm not a big fan of Tex-Mex (or chains).But Chuy's won me over.The decor is over-the-top bright and a little loud, but hey, I'm there to eat not decorate. I loved the made-from-scratch speciality sauces that come with the (free) never-ending chips and salsa. Ask for the Creamy Jalapeño - a sauce so secretly delicious it's not even on the menu. Also try the Deluxe Tomatillo sauce made with sour cream, fresh herbs, cilantro and spices. Chuy's Frozen Peach Margarita ($6.95) is one of my favorite cocktails on the menu. Made with Exotico Silver tequila, triple sec, real peaches and fresh-squeezed lime juice, it's surprisingly refreshing for a margarita. Not too sweet and just a touch tart.From tacos to taquitos (and even margaritas) the Austin-based restaurant chain certainly proves that everything is bigger in Texas. Like the Green Chile Chicken Taquitos, a Chuy's Thursday special ($8.49) made with hand-rolled flour tortillas, shredded chicken and green chiles, rolled up and lightly fried - then topped with Creamy Jalapeño sauce and served with green chile rice and refried beans. It's a HUGE plate of food (especially for the price), but I didn't mind taking some home for later. The portions are certainly a bonus, but the taste really brings it home. Chuy's marinates their meat for 24 hours in a signature blend of Shiner Bock beer, serrano peppers, lime juice and spices. It's some of the most tender, deliciously marinated meat I've had at a Tex-Mex restaurant.Overall, I'm impressed."], ["Daniel K.", "You know for all the crap reviews of this place... It is what it is... Its on the Plaza... Its a chain... Its texmex... blah blah blah.  Its not bad!  Happy Hour is where its at.  The Nachos were awesome! large size nachos (about 10 of them) that you could just pick one up and it was yours... with everything you want on them. The salsa and guac were meh. But to be expected.  Just ask for lime and whatever else you need in there.Tasted the steak burrito... Not too shabby... Steak was seasoned well.  The tortillas were made in house.  Mine was a tad under done but still tasty. Tasted the Chicken enchiladas...  very good. I loved the green chili cheese sauce on them.  If you want authentic mexican this aint your place. But if you want a good HH and a nice place for drinks and food with friends on the plaza...  Id try this place out."], ["Alexis H.", "Our first time at this location. We have Chuys in Austin and Houston. The food is about the same, as is the atmosphere, service and pricing. It's very good basic Tex-Mex.  Parking is easy, as it's directly next to one of the Plaza's many free parking garages. Try it!!"], ["Foster W.", "I was at the Chuy's in Kissimmee FL last week it was 75 degrees. I come to Kansas City on another business trip this week and it's 12 and four inches of snow on the ground. Story if my life. First time at the Kansas City location. The service has been awesome. I have had great service at Chuy's before but I'll say this location has been the best. If you are trying to figure out what to eat you need to try the Elvis Green Chile Fried Chicken. It is an excellent choice.Nesmiah was my server. You should ask for this gentleman to be your server. Very attentive and polite. Makes you want go come back."], ["Margaret M.", "Since Chuy's originated in Austin Texas - home to my alma mater - I get super exited when I get the opportunity to eat an old Tex Mex favorite in a new place. Their jalapeño ranch is to die for and you should ask for it alongside your chips. The atmosphere is super funky and unique. It's a hodgepodge of random decor.Both times I've been here for dinner on work trips, it's been relatively empty. That being said, I've always received great service. From this location I've ordered both Baja shrimp tacos and the deluxe chicken enchiladas. I also ordered a dinner salad - who does that right? Well if you do, don't get the cilantro vinaigrette like me. Get some yummy ranch and indulge instead."], ["Jen B.", "Great location. We sat on the balcony and overlooked the blue fountain. Great food and our server Steven was the bomb. We will be back. :)"], ["Lindsey F.", "So glad we have a part of Texas here in KC! We love Chuy's! Had a wonderful experience yesterday -our server was extremely knowledgeable about the menu. So many great dishes with a slight twist on traditional Mexican and Tex-Mex. The sauce that they give you alongside the fresh salsa is amazing. Great drink menu, fun atmosphere & highly recommended."], ["Tia D.", "Creamy Jalapeño sauce..it was absolutely the best.  The food is standard tex-mex. Nice atmosphere & great service. I will be back very soon."], ["Eliza C.", "Whoa. Went here for the first time tonight. Dinner was pretty disappointing.The food here is really bland and boring. The rice on our plate was inedible -- It was overcooked, and tasteless. Hardly any vegetarian entrees on the menu, and practically no seafood options, either. The salsa was good, though. Very spicy. Festive atmosphere, but really bad Mexican food."], ["Patrick W.", "In my mind, the Chuy's in Austin is probably the best Tex Mex that I've ever had.  And, believe me, I've had a lot of Tex Mex!  So while strolling through the Plaza over the weekend, I was a little surprised to find a Chuy's right here in the Midwest.  I was sure that it was some sort of knockoff trying to capitalize on the name of the Austin-based chain.  After some deliberation, we decided to forgo dinner at one of my favorite KC spots, Houston's, in order to give this one a try.  I was not disappointed.  This place is every bit as good as the Chuy's in Austin.  The steak fajitas were fresh and tasty as my wife's taco salad.  After our meals (not to mention two baskets of fresh chips), we entered into a food coma of happiness.  Fortunately, we had the walk back to the hotel to work off some of that meal.  Next time I'm in KC and in the mood for some Tex Mex, you better believe that I'm heading to Chuy's."], ["Amy M.", "Very good food!! Second time we have come here! Great location on KC Plaza, also big balcony with covered seating."], ["Emily W.", "The happy hour here is amazing - even on a Friday night. Every day 5-7pm the drinks and appetizers are absolutely delicious & cheap. My husband and I eat here often! Wonderful margaritas, creamy jalapeño dip, & entrees (homemade tortillas & fish tacos!). Highly recommended!!!!"], ["Kati C.", "Went back and had the veggie enchiladas this time. They were great and, as always, the creamy jalepeño was on point. Service was wonderful, meal was ever-pleasant."], ["Shay B.", "Chuy's is one of my exceptions to the chain restaurant rule. Is it the kitschiness? The tackiness? The tasty Tex-Mex? Oh yes, it's definitely all three. I was happy to stumble upon a Chuy's close to the hotel where I was conferencing in Kansas City. This Chuy's is snuggled right in the middle of Country Club Plaza, so it's easily accessible to anyone in the vicinity. The service was good for a quick lunch, and the food satisfying as well. Thumbs up!"], ["Linda G.", "The atmosphere was wonderful as were the wait staff. It was a Friday night and I waited only 20 min; not too bad.I had the stacked enchilada plate. While the green sauce, rice and beans were great, the large chunks of chicken were a bit dry."], ["Laura H.", "Very good Mexican food with lots of chile options and very friendly service. The salsa tastes really fresh and chips come out warm. I got southwestern enchiladas with an egg on top as part of a combo (very good deal with a relleno). My egg yolk was overcooked so I asked for a new egg, which they quickly brought and even comped my meal, which was unnecessarily nice of them. My husband got a green chile enchilada with chicken, which was just okay. Will definitely be back for good food at a good price!"], ["Tyler Z.", "This place is a standard, american chain who serves up ok food.  The atmosphere was 'creative' but so similar to those other chain restaurants (Red Robbin) where they just put a whole bunch of crap on the walls to make it feel local.  What this is really hiding is the bad service, terrible chips, and so-so food.  The food lacked character which anyone who's gone to New Mexico, Texas, or Mexico could immediately tell you.  I'd rather eat the food from a street truck on the streets of Albuquerque than this tasteless grub.  The drinks were just sweet and tasted like Kool-aid mixed with tequila.  The sauces were lackluster. The inside was quite loud.  I will not be back. I recommend finding another place for mexican/texan/new mexican food.  It really has very little character or reason for you to go there."], ["Ben B.", "I judge Mexican restaurants by 3 criteria:1.  Chips and salsa:  Not only is Chuy's house salsa made fresh daily, it's delicious and is a nice compliment to their warm chips, which aren't too thick/thin.  They also offer +/- 5 other salsas you can choose from, which are complimentary just like the house salsa. 2.  Margaritas:  this one is simple.  Chuy's margs taste good with the perfect amount of tequila.  An extra shot is $1.50 during happy hour. 3.  Food:  the food is fantastic.  Their homemade tortillas are a great consistency and really stand out on dishes like Tacos al Cabon.  The menu is diverse, tastes fresh, and has tons of flavor throughout. A+"], ["Annie M.", "I am from Austin and SO happy that there is finally a Tex Mex (NOT the same as Mexican food) choice in KC that does not include Velveeta.  While this is a chain, it is a small chain and I am very proud of them for adding this location.  It is just as bit as good as the original back in Texas.My favorite is the Southwest Platter or sharing the Elvis Platter.  Their enchiladas are the bomb.  No other restaurant in KC can touch their homemade tortillas or salsa.  And thank you, thank for finally supplying KC with swirl margaritas!  For you gringos that means a mix of frozen lime and frozen flavor of choice-Mango, Raspberry, Strawberry etc.KC Chuy's has filled a void in my heart and I love them forever!"], ["Josel B.", "So...if you're a Mexican restaurant you better have Huevos Rancheros or else you won't be pleasing this little yelper. Chuy's may not have Huevos Rancheros on their menu, but they went out of their way and made it for me anyway! This, my friends, is the reason Chuy's has become one of my favorite Mexican joints to eat at.As an undiagnosed ADHD guy, I love how they decorated the place. It's like 54th Street Grill and Buca de Bepo, where they just stick a bunch of random things on the wall but make it work! The place was clean and service was great! That waitress really did go above and beyond and got the cook to give me what I wanted! For about $6 plus tax, my dish was a steal! I got a heaping amount of Mexican rice, refried beans, and two sunny side up eggs, just the way I like it. PLUS YOU CAN ADD MEAT! For me I added roasted chicken! (lol the only healthy part of it) For other dishes on the menu that had this amount of food, their prices were roughly $10-12 each, so I was definitely happy getting such a good deal! Pair it with their sauces, they were bomb! Forgot to ask what they were, but trust me add their sauces on top of your meal and you will be a happy customer!Thanks Chuy's! I will definitely be coming back here!Happy Eating!"], ["Carolyn H.", "So excited this place is expanding! We were visiting KC from Virginia and were happy to learn they're coming to our area.Decor is eclectic and bright. Hubcaps, old cameras, and lights were part of the atmosphere.Service was friendly and prompt. Ask for Tanner Scott, the manager: he knows everything about the company and is super helpful. He's been with the company 21 years!!Food was really good. Chile rellenos are the best I've ever had! The creamy jalapeño and the cilantro sauces (that you ask the server for with the chips and salsa) are delicious! Homemade tortillas (again, you have to ask) are soft and yummy.My Perfect Margarita was just ok; not well mixed or salted. But I guess frozen margaritas are more their forte. We're excited to come again closer to home!"], ["Lauren M.", "Sometimes I have low expectations for new plaza restaurants and also when Tex Mex is involved. I was pleasantly surprised at what Chuy's had to offer. Several Tex Mex inspired dishes, and I had the chicken flautas. Delicious and the flautas were smaller than normal and you got 5 of them. I liked that and the refried beans has a great flavor to them. They had really awesome Texas martinis and it's nice that they give you the shaker with liquor/ice so you can pour at your leisure. The service was really good and our server catered to us frequently and got our food out fast. Great place for families or large parties."], ["Matt E.", "Yeah, I just don't know that I can get behind Chuy's. I've visited a few times now, and while I will admit that the food is pretty tasty, the atmosphere is just too much. WAY too much. Every single inch of the space is covered in kitschy bric-a-brac and they're so obsessed with shoving fun down your throat that it left a bad taste in my mouth. Hubcaps cover the ceiling. Glass statues line the bar. The entryway is covered in old cameras. Hundreds of wooden fish hang from the ceiling. the walls are covered in pictures of chihuahuas. The staff all wear \"funny\" t-shirts with somewhat stale pop-culture references.I'm all for being organized, but with how overly-themed every corner of the restaurant is, you can tell that it's hyper corporate, and that's just not my cup of tea. This place was designed by committee, for sure.That being said, the food is pretty dang good. The chicken chimichanga was a-ok, but I really preferred my combo fajitas. They were an incredibly ample portion, and the chicken and steak were both perfectly cooked and seasoned. The tortillas are phenomenal, made fresh at a little station you pass as you walk in. A hefty portion of fixins come on the side (rice, beans, guac, sour cream, cheese, lettuce) that guarantee you'll be enjoying pretty awesome fajitas, indeed. The enchiladas were good, and the large appetizer portion of guacamole was fantastic! They make good food at Chuy's, and affordable to boot. The affordable thing is a double-edged sword, however. This place is a ball-pit away from being Chucky Cheese. OK, maybe not really, but the number of families and screaming kids has to be addressed. In concept, I'm all for family-friendly and affordable restaurants, but for me personally this is pretty intense. The bar was a madhouse of children, and the kids directly behind me in the dining room kept touching me. Annoying.Another positive is the service. Brandi was our waitress on our last visit and she's great. ZERO complaints. She really knows the menu, anticipates our needs (more chips, refills and so forth) and has a really magnetic personality. I bet she makes a killing. Her co-workers were all great as well, this place excels at teamwork. The staff is always buzzing around the floor, making sure people are well taken care of. So, if the things I identified as negatives aren't negatives to you personally, I say get to Chuy's ASAP. For me, the place is just alright. If people wanted to go, I'd be glad to accompany with little-to-no hesitation. But I don't think I'll be seeking it out, especially considering how many fantastic (and significantly more laid back) Mexican restaurants there are in KC."], ["Whitney J.", "Let me tell you something about Chuy's though.... The food is FIRE!! LOL! No but for real, I love it. You must get the prickly pear margarita, no lie, so good!!! I had the Baja shrimp tacos with beans and rice on the side and ohhh man, I was so stuffed and so satisfied. Everything was delicious, only down side, wish they had endless chips like Los Tules, but besides that it was a wonderful dinner and will most definitely be back again!"], ["Nathan W.", "Love this place! The first time I ate at Chuy's was in Fishers, IN. The KC one is just as good. The salsa is amazing. The stacked enchiladas are my favorite. This place has a fun atmosphere. I would recommend it to anyone."], ["Todd H.", "Really very good. Better than your typically TexMexCombo plates are huge. Speciality drinks are huge. But very tasty. We came mid afternoon so it wasn't very busy. Got right in and service was attentive. Been to other ones, but this was certainly one of the better ones I've been to.Would definitely come back."], ["Carolyn G.", "My new favorite Mexican place. The staff are super friendly, fast service, and the food is amazing!!"], ["Sara B.", "This is a very good Mexican/ tex-Mex place to eat. The chile rllenos are very delicious. The meals are a tad pricey for one individual, look to pay between 8 and 9 bucks per meal, however, it is reasonable at the same time if you are looking to share with a small child, which is what me and my husband do with our two kids and we always wind up all being full as ticks at the end. I love that they offer a variety of sauce options free of charge to go with your table chips. You can get one sauce or a variety. My husband's only grievance is that when he orders something and asks for no sour cream (he hates the stuff), he really has to stress the no sour cream part or he might still wind up with sour cream on his food. I love that it is right across from the park at The Plaza with the big beautiful fountain that you can see from the retaurants huge windows. I also love the atmosphere at Chuy's the interior is very well decorated with all kinds of southwest/artsy stuff. They staff is also very friendly and helpful."], ["Susan S.", "I've made plenty of trips to Austin over the years, so it was curious that I had never eaten at Chuy's. I'm glad we now have the opportunity in KC, though. It's kitchy and fun and a good time.Our waitress was great - she navigated us through the menu, was prompt in her service, and, when she overheard me making a comment about the blackberry frozen margarita, brought us samples. The place had not been open very long when I went, and she was noticeably knowledgeable about everything.While the servings are large enough that you probably don't need additional food, the nacho bar was still worth a visit.I had the Chicka Chicka Boom Boom, which, ridiculous name aside, was very tasty. Everyone in my party liked their food and was anxious to return."], ["Lauren P.", "Oh Chuy's, how I've missed you. I'm originally from Austin, Texas so this joint is all too familiar and beloved in my household. Therefore I can't even begin to tell you how glorious it was to hear they would be opening one here this past year. After trying the Kansas City Star's \"Best Mexican in Kansas City\" picks a couple of years ago, I was sorely lacking some good Mexican food (sorry Ponak's, it just didn't work out!) Now I have to say...this particular location leaves a little to be desired. I've gone a few times now for happy hour and while the drinks and food were great, the service leaves a bit to be desired. Our waitress had trouble getting our order correct, and then stood there mean-mugging us after we finished our meals and continued to drink for another hour or so. Unfortunately for her, the only thing dying from her death stare was the little bit of tip she still had left after our food debacle.That being said I personally think the food here is miles above other joints in the city, and the margaritas are TO DIE FOR. This is the perfect place to go for happy hour (free chips, queso, salsa, jalapeno ranch *waggles eyebrows*) and as long as you get there fairly early you shouldn't have to wait very long. Overall I will continue to give this place my undying loyalty considering it is the same great Tex Mex I've lived off of my entire life...however I'm hoping future visits will result in better service."], ["Ern C.", "first time to a Chuy's since 1993 in Austin.  Still as yummy as I recall.  Great service, yummy food."], ["Joshua B.", "I took 3 new people (first timers) to Chuy's tonight, at 9:15 pm.  As usual, the experience was awesome.  We had a different server, but she was just as amazing as the other two were.  Very attentive and seemed anxious to get whatever we wanted, without hesitation.  One person in our party had weight-loss surgery, and they had the perfect small-portioned meal to suit her needs and desires."], ["Mel P.", "Chuys has decent Mexican food. Not great, but not terrible either. I prefer tex mex (like my beloved Carlos O Kellys) and finding a great tex mex restaurant in KC is apparently impossible. That being said, a restaurant with average food can really save business by having amazing service- and that's been my experience at Chuys. Last night I ate there and had a server named Steven. He was prompt and polite, we never ran out of chips & salsa or water, and our food came out in just minutes. When we first arrived we were also told it would be a 15-20 minute wait, but only waited like 5 minutes. Crazy good customer service, especially for a Saturday night."], ["Logan N.", "My mom loves this place so i took her there for lunch.  I didn't have really high expectations because I don't like most of the Mexican restaurant's she does.  I ordered cheese dip and a chicken fajita burrito.  Both were amazing.  I would have given 5 stars but i hate going to the plaza and trying to park.  The food is excellent though."], ["Missy B.", "Rating 4/5 because we went on a beautiful day when we could sit outside. The food was 3.5/5. Mom told me to let everyone know you get a great portion for the prices, so I can't leave that out. She rates the ground sirloin tacos (comes with 3) above average. I enjoyed the baja grilled shrimp tacos (2), but they lacked cream sauce. We both added the chile con queso to our entrees which made them tastier. Also, the soft tortillas were quite puffy, but I actually liked the thickness. No low card there! Refills are not free. My two diet cokes cost $5.18. The staff was friendly and our waiter was attentive, but it was not busy. Also, I was not asked if I wanted a refill; it was just given... at a hefty price! The chips are very thin and crispy and so good with the spicy pico de gallo salsa! We didn't ask if they had a more \"salsa consistency\" salsa, which we typically prefer, yet we loved the chunky stuff this time."], ["Crystal W.", "Chuy's is like a quintessential 1950′s diner on Mexican acid. Seriously - eating at this place is a real trip.Hundreds of  old-fashioned cameras are glued to the walls of the entryway. Inside, every area of the expansive dining area has a theme. There's a palm tree room. There's a hot rod room, ceiling covered in hubcaps. The bar's theme is chihuahuas. Pictures of them - and framed photographs of staff dogs - hang all over the walls. It's the next best thing to being able to bring your dog inside, I guess. Really, there is so much to take in visually at Chuy's that I didn't have high expectations for the food. But everything was honestly delicious.We tasted a whole platter of different homemade salsas. Surprisingly, even the pico de gallo that comes standard with every bowl of homemade chips had serious heat. The \"Perfect Margarita\" and Texas Martini were both made strong enough that one was plenty.The chile relleno was among the best I've ever eaten. The breading was crispy, the pepper was spicy and the cheese wasn't greasy. And the veggie enchilada was filled with actual vegetables, like squash and red pepper.If you go to Chuy's, there's no way you will have room for dessert. But if you make space, the Tres Leches cake is a sweet way to go out."], ["Jay W.", "The best part of the meal was the chips and salsa, and the salsa wasn't all that great. I asked for hot and was given some mild and smoky onion/tomato mixture that had an odd flavor. The food was also oddly seasoned and had no spice to it at all.I had hoped the service might redeem the place, but it too was far from acceptable. My server's greeting when she first approached the table was \"Are you ready to order,\" not \"hello\" or similar as is customary. She checked in with me shortly after my food was delivered, but then I was left on my own. During the meal she walked by my table three times before I finally stopped her to ask for a refill, even after I had moved my empty glass to the edge of the table to make sure she could see it. Post-refill I didn't see her again until she walked by and noticed my credit card out which prompted her to bring my check.Overall, I was not satisfied and will likely not return."], ["Atish P.", "Went here a few weeks back with some of my family and it was a great time. We were seated promptly when we arrived and got great service. The food was very well made and came out in a timely manner. We got a variety of things so we could try it all. Most of the dishes were great. They were even kind enough to change the YV station to a local sporting event. I would def. recommend this place to others."], ["Mari M.", "I've been here a couple of times and have had different experiences. Mostly, good service. I think one of my visits was when the location was just opened and the staff was new. The food has been consistent and good. When you walk into the dining area there is a person making fresh flour tortillas. Today I had chicken soft tacos with grilled chicken and the tortillas were very good. I loved the grilled chicken in the taco. The fixin's were not thrilling. For some reason they put lettuce on the chicken and then the pico, cheese and guac are on the place. After I removed the lettuce and added the fixin's. Good tacos. The rice and beans are not necessary.One thing I found is that I prefer the creamy jalapeño sauce over their chip salsa that they bring to the table. Surprise!! I like the tasty fattening dip. Oh, well. It goes good with their fresh corn chips which are refilled at your table when you run low.Price is good and I really liked the fresh grilled chicken in my tacos."], ["Jillian C.", "Happy hour specific: Free nacho bar and strong tasty drinks. Can't beat it. My friend and I each had margaritas with a dash of strawberry in them. Now, typically we don't like frozen margaritas (we prefer on the rocks) but these ones were our exceptions. Yum. We each had two and lots of chips with salsa, taco meat, queso, and the options of beans. Well worth your time and a long happy hour too! :)"], ["Josh B.", "Chuy's on the Plaza has a neat aesthetic. But it is loud, service is only so-so, and food is good, not great. Lets face it, you can get Mexican and Tex-Mex anywhere. So just having a bunch of crazy pictures on the wall doesn't do enough to make it stand out.The food is good. They make the chips and salsa in house which is always a plus. But while good, it really does not stand out in any significant way. The prices are fair, but they seem to be campy for the sake of being campy."], ["Whitney V.", "We Austinites know that Chuy's is a go-to for excellent Tex-Mex. If it's got a good reputation in Austin, than you can bet that it's a quality restaurant! Something is lost in translation at the new Kansas City location. Nevertheless, as far as Mexican goes, Chuy's is as good as it gets in this town. It's my go-to when I am missing my hometown Mexican fare.My husband and I went to Chuy's for happy hour on a Friday night, craving margaritas and endless chips and salsa. We were impressed by the friendliness of our hostess and other servers. The patio view of the fountain made for a relaxing ambiance. Service was prompt and professional. Our waitress, Frann, could not have been more attentive. She was a fabulous server and made the experience all the better, and her recommendation of the Mexican Martini was spot on. We were pleasantly surprised to discover that free queso, ground beef and refried beans were included in happy hour. We ate enough to call it dinner. What to order? Start with a house margarita on the rocks, with salt. My favorite items on the menu are the Chile Rellenos and the Chica Chica Boom Boom chicken enchiladas. In fact, I'd recommend requesting a side of boom boom sauce no matter what you are ordering. It's hot cheese sauce, spicier than queso. My husband always gets the Chuychanga, he always will, and he is never disappointed.The bottom line is that if you want the best Tex Mex in Kansas City, do like the Texans do and go to Chuy's! The chips are fantastic, and I'm convinced that they have the best margaritas in town."], ["Amanda S.", "I admit it.  I think TexMex food is my favorite type of food.  KC's new Chuy's location didn't fail me.It's crazy to think think this bright, fun and Mexi-designed place was Figlios.  If you had been to Figlios you won't recognize it at all.  It is totally redesigned.  Lots of funky Chihuahua pictures!The person who was seating us (just two of us) tried to seat us at a 6 top...really?  We pointed out the empty-ish bar and ended up sitting there.  The bartender, Molly, was engaging and never left us waiting for refills.  She also had plenty of recommendations as well. The menu is full of choices. There should be something for everyone.  We were served pico and the creamy jalapeno sauce to dip our complementary chips in.  The chips are awesomely crispy.  The pico was too watery and really didn't have any flavor.  I liked the creamy jalapeno dip.  It was something different to have but definitely not spicy.For lunch, I had the steak burrito which was topped with their \"hotter\" Hatch Green Chili sauce.  In my opinion, it wasn't hot but had plenty of flavor.  The steak was cooked well and had a lot of flavor too.  The charro beans, served on the side, were unexpectedly tasty.  I am normally not a fan of refried or even black beans but these were good!  I bet they have bacon in them.  BTW - for me, the burrito was large enough to take home about 1/2 for later.Except for the person who wasn't sure where to seat us, my lunch at Chuy's was great.  The portions were priced well.  Yeah, the beer is a bit overpriced but hey it's not a dive bar.  I'm glad I wasn't disappointed because I really looked forward to trying Chuy's.  I definitely wasn't let down."], ["Ken B.", "Chuy's slapped me in the face!  Not literally, just figuratively.  When driving past the beautiful street and landscpape of the Plaza, looking at the Spanish skyline of towers, domes and tile roof lines through the dancing waters of the Nichols Fountain it happened.....slap....a tacky, brightly lit and oversized sign for Chuy's hit me in the face.  Well, i guess that Tex-Mex restaurant that I've been hearing about has arrived!  The signage, very much their brand, doesn't fit within the environment they placed it.  Highwoods and Chuy's didn't seem to balance the two brands very well, in my opinion.  But I'm sure my eyes will unfortunately adjust and accept this oversized eye sore eventually.Of course I still wanted to try the place out and here are my thoughts....decor-  busy, colorful, found object stuffed kind of space (very Chili's 1990's and Benningans before that but within a TexMex style).service-  good, nice, overstaffed with a lot of people walking about without much direction.food- really good TexMex food, fresh, flavorful, beans and rice much better than they looked but really disappointing guacamole.It seems like a great place for families or groups of people celebrating something to go to when the Cheesecake Factory is too busy and has overflow!  Or if you are looking for good Tex Mex food.  Something for everyone."]], "Taqueria Mexico II": [["Jack P.", "Some of the best Mexican I've found in Kansas City. You know when most of the patrons are Mexican, the place must be doing it right. I've had shredded beef tacos, huevos rancheros, and my favorite so far, the enchiladas poblanas. That mole sauce is to die for!Also, they have real salsa, not the watered-down ketchup with hot sauce that a lot of \"Mexican\" places in KC seem to favor. Not a bad place to watch the soccer (sorry, \"futball\") game, if you're so inclined. All around good place."], ["Barbara S.", "Taco Tuesday strikes again. For the record, only their hard shell beef and chicken tacos are $1. And those are good. They use that super tasty white cheese that lots of authentic places use and I love it so much. Their other tacos on the menu aren't that much more ($1.65) and they are seriously, hands down, the among the best al pastor tacos I've had outside street tacos in Mexico itself. Their tacos might just be the best of all the authentic street tacos I've had... and that's a pretty big statement to make. Not flashy. No mango chutney in these babies. Just solid, tasty meat with onions and cilantro on a small corn tortilla. Heaven. I must come back here and try everything on the menu. I'm serious. I'm a fan."], ["Charles S.", "The chips and salsa were good. I asked for the waitresses recommendation and she suggested this bowl of meat dish. So it was a stone bowl with steak,chicken, shrimp,chorizo, cactus,pepper and tortillas. It came with a bean soup as well. Everything in the bowl tasted fine and the chorizo was particularly tasty. I just thought it was okay since it was basically eating tacos of just meat and I think I'd rather have a something a little more flavorful. Service was a bit slow."], ["Jennifer O.", "We went here based on the recommendation of an acquaintance in the neighborhood and we were not disappointed. The menu was extensive, offering quite a bit beyond the normal offerings in a Mexican restaurant. In our group, we tried the shrimp cocktail (an enormous goblet of shrimp in a cold tomato juice/soup topped with avocados), choripollo (chicken breast pounded thin, topped with loose chorizo, queso and pico de gallo), and enchiladas tres amigos (three different sauces - all delicious). We thoroughly enjoyed our food, and found the sides of beans were excellent. I had the charro beans with my choripollo. They are SO flavorful. My son's enchiladas came with refried beans which were also excellent.  We will definitely be back!"], ["Deanna M.", "We love eating here!  The food is delicious!  The beans are to die for, such a rich flavor....yum!  The flour tortillas are light and fluffy...yum!  The Mole sauce...AWESOME!  We have not had anything here that was not delicious.  This is our go to restaurant for our guests.  Thanks for great food !!!!"], ["Susan S.", "My stop at Taqueria Mexico was part of a yearly venture I take with friends, where we choose an area of Kansas City and go to as many places as we can, ordering one or two tacos at every place. Therefore, Taqueria Mexico was a little embarrassing for us, as it was a real, sit-down Mexican restaurant... where eight of us were going to order one taco each.The chips and salsa were very good. I felt like our server wasn't really into the situation (and honestly, I totally understood given the circumstances). However, when we paid our bill and explained to him what we were doing, he was extremely accommodating and friendly.I had the pierna taco (pork shank), which was absolutely delicious. Everyone else in my party was very happy with their tacos as well. The only complaints were for the nopales, although I think that was more our tastes than any problems with the tacos.Some of the places on Taco Tour I was to revisit later, and others I don't care. This is definitely someplace I want to go back and have a full meal."], ["Jeremy D.", "Great lunch spot! Been coming here for years, never leave disappointed! Cheese dip is the bomb and service is very prompt!"], ["Crystal C.", "I don't know but I love this place.. always have & always will!  The food is always fresh & spot on.  The queso cheese is the BEST around & they give you a lot of it.  The salsa is fresh, zesty and amazing (go for the spicy).  Waiters/waitresses are very very pleasant.  I always go with fajita's b/c you can never go wrong with a good sizzling skillet of onions, green peppers & meat.  Smells good & tastes even better. The gigantic burrito's with queso drenched atop your burrito is always a wonderful selection as well.  Hubby had the chimichanga's and mmmmmmmmmmmm!  Anytime I want good mexican food & I don't want to travel far.. this is where I go! Love it."], ["Jarrod V.", "This is our Mexican restaurant of choice in town. Service is excellent and the food is great. I get cheese enchiladas with their mole sauce. Very delicious. My fiancée has tried several dishes, but most of all, she really likes their rice and cheese sauce. This place is worth the visit."], ["Matt H.", "Kansas City: a town which, by all rights, ought to be as famous for Mexican food as for BBQ.  We certainly are at no lack for Mexican eateries, to the point that it pretty much makes up for the total lack of Chinese.  Up here in northeast, we have a boatload of good Mexican options, and I keep coming back to this one in particular.  I refer to this as the \"Happy Cactus\" joint, as their sign and menus feature a happy smiling cactus mascot.  I've got two go-to favorites here.  The first is a dish featuring steak, chicken, and shrimp with peppers and onions smothered in cheese and served with rice, refritos, and flour tortillas.  The second is a skirt steak (OK - so the skirt steak usually isn't the best quality beef in the world, but the dish overall is so good that it's not going to bug you too much) wrapped around melted cheese and jalapenos.  Can you see where I'm going here?  I'm a fat man with a love of food, and this place isn't really by the diet-conscious or for the diet-conscious.  It's good though.  Real good.  There're plenty more on the menu though, and I've tried probably half of it without a single bad experience.  You'll get free unlimited salsa and chips and they'll bring these out as soon as you're seated.  The hot salsa here - which you have to ask for them to bring out, normally they just give you the mild - is absolutely fantastic.  I'm big on good spice - not just spice/heat for spice/heat's sake.  This hot salsa has a really great, unique flavor.  Their chips are thin and are served warm, which I like a lot - I've never gotten a nasty, stale batch of chips here the way I have elsewhere.  If you're down with spice/heat, you must try the hot salsa.  The staff are also really good here.  The decor/atmosphere is hardly romantic, so this may not be a first choice for a first date, but my wife and I are always happy to eat out at the happy cactus."], ["Amber W.", "I love their authentic Mexican food and they have really good service.   They have so many menu options, there is something for everyone."], ["Erin L.", "We have been to this location twice in 2 weeks due to it being close to the new casa. Plus, the hubs is always down for some Mexican. They offer plenty of gringo options if you aren't into truly authentic dishes. However, there are also authentic dishes that the hubs wouldn't touch. hahaThe menu is laid out nicely with plenty of description for the dishes. It also impressed me to see so many different options available.Like most restaurants, free chips and salsa- chips are okay, I really liked the salsa (ask for hot if you want some extra heat-mix it with the regular) The staff were very helpful and attentive during both visits and offered explanations for the hubby when he asked what something meant. The portions are LARGE- I ordered combo fajitas the first time (I know, how daring) and could only eat half and that was definitely pushing my limits. The hubby ordered one of the burritos (can't remember which one) to go. It was massive and he loved it. I had one bite...one. I don't like too much chaos when it comes to my food. Nor do I like cheese on everything. But, this is just my personal preference. Plus, i'm not privy to burritos anyways. I like to \"see\" what's in each bite....The hubby loves his food \"wet\" so this was heaven to him. I also ordered the 7 seas soup, which was a large portion, I did have to add some hot sauce and extra lime and salt. However, after a quarter of the way down then picking out the fish (I didn't care for their texture-once again personal preference), I was stuffed but managed to plow through half of the bowl. i know we will be back and I will order something more authentic, perhaps lengua....It is a good joint and prices are decent, with large portions. DId I mention that the dishes were piping hot when brought to our table??"], ["Anna M.", "The plates are huge and very good! The chips and salsa are really good also. I got the enchiladas verde, it was spicy and amazing. Service was so so but she was pretty busy so it's understandable. Over all a great place!"], ["Joshua J.", "Gotta try the enchiladas poblanos.  They have the best mole sauce I have tasted.  I have even been to other T.M. locations and the mole sauce just wasn't the same.  The staff @ this location is very nice.  Also worth trying is the L12 fish tacos. They are not on the menu, but can be ordered at any time."], ["Brenda S.", "I am always up for Mexican food, and this restaurant is one of the better in KC.  Their menu is very diverse with spicy fish, shrimp, and soup dinners to the normal Mexican fair.   The portions are large, and the prices are very good.   If you are feeling adventurous you can try one of the more authentic dishes.  If you just want your queso and fajitas, they have you covered. The drinks are average.  I usually go for the frozen strawberry margarita, my partner gets a shot of tequila or beer.  So far so good.  They also have a nice selection of imported specialty drinks (sangria, cerveza, etc.) I have yet to try.    The service is always very good. From the yummy muscle bound host to the adorably perky waitresses this place is always pleasant.  They give free salsa and chips as soon as you sit down, and you never wait long for dinner.   The atmosphere can be a little loud sometimes.  The jukebox has a good selection of Latin artists but beware the volume is a bit high.  The TVs usually have soccer, but if you are lucky you can catch up on your favorite Latin melodrama while you eat. The clientele is mixed, but you see lots of variety.  There is lots of room for a large group or party, and plenty of booths or tables for families and hot dates."], ["Ryan A.", "This small local chain is, in my opinion, probably the best gringo Mex in KC, and this is the location I visit the most since it's in my neighborhood. The menu is the same at all the locations, however, so this review could apply to any of them.Taqueria Mexico doesn't make the cardinal KC mistake of drowning everything in greasy melted yellow cheese and/or cheese sauce. I'm not sure how or where that trend started, but it's not really a good thing (unless I want a plate of melted cheese, which does happen on occasion). If you know where to look on the menu, you can actually get real tacos! The al pastor is obviously marinated and cooked on a flat top instead of roasted on a rotating spit, but it's still fairly tasty and comes standard with the expected cilantro and onion. The menu also features other tasty Mexican treats: tortas with your choice of meat (mmm, lengua!), alambres, and so on. Of course they do have the obligatory ground beef, cheese, lettuce, and fried corn tortilla tacos that have come to represent Mexican food in America, but I don't hold that against them. And, if you're in the mood for it, they're pretty darn good to boot. Probably my most commonly ordered dish, though, is two cheese and onion enchiladas ala carte. Just enough food to fill me up, and freaking *cheap*!"], ["Sara B.", "One of my favorite places to eat in Kansas City.  They have a jukebox and the kids always have a great time picking out songs to listen to while we eat.  This place is great for kids and has \"gringo\" food for kid's meals (chicken nuggets, grilled cheese, etc.) if your kids don't like Mexican food.  My favorite dishes here are the chile relleno, fajitas, and enchiladas.  They also have great fish dishes (mojarra).  The margaritas are tasty, and they are usually on special so it's not much more than a coke.  I don't really like their tacos..if you are looking for authentic Mexican tacos, there are better places on \"the Avenue\" for that (Torito, Taco Express) but if you're looking for Americanized mexican this is one of the best places in KC."]], "La Flor de Chiapas": [["Billie H.", "Mango salsa! Not a chunky mango salsa, but an amazing blended mango salsa. The sweet mango lures you in and then a little punch of heat sneaks up. They need to can and sell this stuff! (They do sell containers, I may be back to purchase some and can it myself!)The chicken tacos are some of the best. Juicy and tender chicken. They have a full chicken you can buy on the menu and after tasting it, I will probably buy a chicken when I come back for salsa! Service was great. The young man helping us was super sweet and friendly. This is a must try along Independence Avenue!"], ["Cathy C.", "With so many Mexican restaurants in the neighborhood, a place needs something to stand out from the crowd. La Flor de Chiapas has mango salsa, and it's GOOD! Sweet and heat with fresh hot chips makes it hard to save room for tacos.But I did. It was time for Al Pastor, and it was very good. Onions gave it some bite and lots of cilantro cooled the heat of the salsa I couldn't resist adding. Our server was very nice and didn't seem a bit put out that three people walked into his restaurant and ordered one taco apiece. I've seen in other reviews that their mole is excellent, so I'm sure I'll come back and make it right."], ["Steve D.", "This family-run restaurant has a unique, delicious, mango salsa. The mango salsa and chips are complimentary. The salsa is sweet at first, with heat later. My pollo taco ($2.00) had plenty of moist, tasty meat, and fresh toppings. The service was very good."], ["Susan S.", "As the last stop on the taco tour (taco #7 or #7+ for everyone involved), you'd think we'd just suffer through and not really enjoy what we were eating. Fortunately, La Flor de Chiapas didn't treat us wrong. The chips and salsa were great - both the spicy salsa and the milder version. I had a chicken taco for the first time that day, and it was extremely tasty.Everyone who helped us was very friendly and happy we had stopped by. Very much a great end to the taco tour."], ["Tom C.", "The mole is awesome!"], ["Lisa R.", "My friend and I were headed to Winnwood Skate for Old School night, and we wanted to eat at a unique restaurant relatively close to that area. Since I'll go anywhere, I said, \"Let's just drive down Independence Avenue and stop at the first place that looks interesting!\" That first place was La Flor de Chiapas. There is not much to see from the outside, besides the door on the corner and the sign that says, \"Pollos Asados\". It was a Thursday night. There weren't many people in the place besides us (maybe 6 others), but some people came in while we were there and took take-out orders. They gave us free chips and salsas before our meals came. I ordered a Horchata to drink, and Pollo con Mole, with rice and beans. The plate was so big that I could have sat my butt on it and used it for a small sled, and it only cost $7 and change. I loved the mole and the chicken drumsticks were so tender. My friend ordered 4 flautas and also loved her food. They have traditional Mexican candies at the register and we were reminded by the sign on the wall that they sell tamales for $1. The woman that seated us, served us and rung us up (all one in the same person) was very attentive and was very excited to have us come back. I lived in Mexico for two years and love my traditional Mexican food and this place had so many staples that I love. I can't wait to go back and try new meals."]], "Los Alamos Market y Cocina": [["Dan D.", "An awesome mix of market + restaurant! Great lunch specials, and is my go-to for soda/snacks when I'm in the West Side neighborhood.Make sure to check out their chiminea offerings during the spring/summer months, too. Very reasonable priced, authentic style fire-pits that are hand-made from Guatemala!"], ["Lisa R.", "Don't be shy. Walk up to the food counter. Say hello. Order. Get yourself a drink. And a table. Make yourself at home. And then go up to pay your bill. I've eaten here a handful of times, both dine in and carry out, and always love their food. If you have a hankerin' for a trip to Mexico, but don't have the time or money, go here to eat. It's an easy and quick substitution. They also have other market items, like candy bars, piñatas, and odds and ends. In October they had these super-cool yard-art figures made out of metal parts. They were items to purchase for Halloween and Christmas. Similar to the figures that stand outside their door. Sadly, they are all gone and they won't be ordering again until next year."], ["DJuan L.", "This place is a hidden jewel. I've never heard of this place until I saw it on Yelp. I actually had never even been on that part of town where it's located, but I'm glad I finally stopped by. This place is 100% authentic Mexican food. So if you are looking for nachos and quesadillas, you are in the wrong spot.I decided to check out the Friday night buffet. When we walked in, a guy greeted us and I told him that we were here for the buffet. He asked if it was my first time here and proceeded to give me the instructions on the buffet. The food was in aluminum pans sitting above burners w/ spoons in them so that you can serve yourself. Everything that I had was great! They don't have tortillas at the food stations, but if you ask for some, they will deliver them HOT to your table.This is good old-fashioned home cooked food prepared right before your eyes. The buffet is only $7.99, but if you're bringing someone w/ you it's only $11.99 for 2. That's probably the best deal I've every heard of. I will def be making another Friday night appearance."], ["Will B.", "This place is pretty darned authentic."], ["Stephen H.", "I never, ever picked the right time to go to Los Alamos.  I always got there after they closed.  One recent visit, on a weekday afternoon, found me between me and a counter of goodness (and a set of Osama Bin Laden pinatas - note: too late, guys).  \"Where is the menu?\" I asked in halting Spanish.  She knew a gringo when she saw one and answered in English, \"We don't really do menus here.\"  I looked down and saw a series of meats and asked for two tacos - one of carne asada and one of barbacoa (I asked about the lengua, cabeza, and menudo and they told me to come back on the weekends).Tips:1.  Know your Mexican food.  You don't have to know your Spanish, because they will help you, but don't be an amateur - I'm sure that they are usually busy.2.  Expect it to be more of a snack place than the full Mexican meal.3.  Go on the weekends if you want more choices (this is the same at most Indian restaurants too)."], ["Shelley Y.", "Very unassuming but totally worth the stop if you're nearby. The owners are super friendly. It's like having your Abuela or Tia make you lunch...if you had one. Grab a Mexican Pepsi on your way out and you're golden."], ["Becky B.", "This place is excellent.  They have lots of lunch options and the grocery sells homemade tortilla chips, salsa, tamales and more.  I am addicted to the food and the owner is really nice."], ["Brande D.", "I really enjoyed the Mexican food. Casual atmosphere, order at the counter. The grocery section is practically non existent. Why to they even bother?"], ["Zach G.", "I really just came by to get some bread at Fervere across the street. I then noticed it was lunch time and decided to check my handy Yelp app to see what was around here. Los Alamos came right up. From the outside, it didn't look like much. From the inside, it doesn't look like much - a bit run down, but clean. However, the taste...my god the taste!The front is a basic market, but the back is where the magic happens. Step right up to order your food and it'll be served up right then and there. I got the special, El Jefe, which was two tamales with rice and beans. The beans were refried - not my liking. However, the tamales...wow. You had your choice of spicy pork or mild pork to go on top, and they pile it on, along with the juices that soak in to the tamale. The spicy is really quite spicy, but in a good way - it adds a nice kick without overpowering anything. It's all done in balance. The combination of the pork, the spice, and the tamale was simply the BEST Mexican I have ever had in Kansas City. There, I said it...best. I can't wait to go back and see what else they have, but the hours and distance from my house make trips back here tricky on any consistent basis. However, they have tons of tasty looking things that I want to try (a lady was slicing a huge piece of tripe that looked incredibly fresh), so I'll make it back sooner than later! The combo of Fervere bread + Los Alamos + Blue Bird + Westside Local might make this one of the best corners in Kansas City."], ["Brandon B.", "Real Mexican food! What an amazing place! We walked in on a Sunday afternoon during the World Cup - the Mexico - Netherlands game, in fact. The owner(?) greeted us, saw that we hadn't been there before, and explained that we needed to go to the side with the food and order. He came over, explained what everything was, and helped us select. We had carnitas and chile rellenos with pork in spicy red sauce. AMAZINGLY delicious - although everything was protein based, the food was surprisingly light. Even the deep fried cheese stuffed pepper... We had corn tortillas that tasted like corn (our toddler devoured two of them in no time), and two types of salsa - a tomatillo based one and a different, spicy one. Wow. These entrees, plus rice and beans, plus refills on the tortillas and salsa, were only $9. We felt like we were in someone's home, not a restaurant. Sure, the decor could be improved, there isn't much on the shelves in the convenience store part, but the food was fantastic and the service friendly.  We will be back."], ["Reed N.", "You must like protein. You must like corn in ground form. You must like home cooking. If you like these things you may be able to get by, here. LOLThey make everything in-house. The Rellenos, Tamales, and all the meats are stewed up right here.On this visit I had El Jefe... the chief. It was.Two tamales covered with your meat choice and two sides.I chose Beef Ribs.Wow. The beef was delicious and almost incendiary. My head was sweating! There were some tendon pieces in my portion, and I LOVE beef tendon. Don't knock it until you try it.The sides I picked were standard beans and rice. Both had more flavor than the average Amerimex place. I really like this stop on top of Summit."], ["Collin P.", "Really delightful. I had the three taco plate and it was some of the best Mexican food I've tasted. The staff are really friendly and informative. Will definitely be going back!"], ["Dave P.", "I've been here twice for lunch, and it's absolutely amazing. Truly feels like you're in abuela's kitchen. Very friendly, knowledgeable staff - there's no menu, but everyone is happy to help, explain what each dish is, and make sure you're satisfied. At under 10 bucks, can't be beat!"], ["James D.", "What a fiesta! I was a little leary of the outside appearance of the building but sucked it up and went inside anyways. A big cloud of smoke and haze greets you as you enter. And you might want to leave your clothes in your car or you will smell like an el taco (spanish for taco) the rest of the day.You order right at the kitchen, you can watch them cook and see everything that happens behind the scenes. All of the staff was super friendly and easy to understand which is always a plus. This place is SUPER authentic, this is were you go to get the real home cooked Mexican food. I got a fajita skillet and it was mighty tasty, served on a cattle branding hot skillet. The meat was delish and it wasn't lathered in oil like a lot of places to. After the meal I didn't feel like my arteries were clogged so +1.There is a buffet on Fridays that I am going to hit up, even though I was craving tacos when I went in I got the special, so I have to go back to try the tacos.If only I had time in my lunch break to take a siesta after eating..."], ["Lindsay B.", "I finally tried this place today. Don't let the less than desirable interior fool you. The food is FABULOUS, authentic and great value. The employees treat you like family. Def a must for KC locals."], ["Scott T.", "Must... return... soon.So many great choices... only so much room on the plate and the stomach, but for starters how about the huge helpings of spicy pork, chicharrones, the killer tacos and a great side of rice and beans. None of that too much melted cheese crap you get at the faux Mexican joints. And how about impossibly too many fresh corn or flour tortillas to soak up what remains on the plate (little, on mine). Terrific authentic Mexican flavors served up in a real joint with a bit of good attitude and humor from the server. Oh, and you have to like a girl carving up a carcass nearby, apparently in preparation for a future meal. Like, like, like. Must return soon with a very empty stomach. Lots of great Mexican choices in this general area of town but this is one to not be missed."], ["Melissa S.", "Get the tamales.  Seriously.  You will never regret it.  They will make special order ones, too.  Oh my!  They are all great! And super friendly.  We love this place."], ["Shawn M.", "The food here is awesome!! While traveling in Kansas City I was craving huevos rancheros and yelped this place.  The reviews were fantastic so I had to try it.  The green chile was fabulous. The refried beans were some of the best I've ever tasted and the tamales were so good I brought some back with me to Seattle!! When I find myself in Kansas City again I am definitely coming back here..."], ["Ellen S.", "I adore Los Alamos for three reasons:1. Food: so, so, so, so yummy. But, don't go if you're a vegetarian. I've tried to get something different every time, and have yet to be disappointed. And, if you really aren't sure what you want, just ask for a plate with a little bit of everything. Your mouth will be so happy!2. The location: The Westside/17th & Summit area is a fun hidden gem if you want authentic KC without the crowds of the Plaza or First Fridays. When you're done here, visit Little Freshie for a snow cone, Chez Elle for a dessert crepe, or Westside Local for a drink. A very enthusiastic 3: THE STAFF. They're welcoming and helpful when you order, and always eager to help even though for the most part your experience is self-serve. If Agustin, the owner, is around and sees your drink is low, there's a good chance he'll offer to fill it for you. Plus, as an added bonus, I've taken my Spanish Language Meetup group here for an immersion experience, and the staff were awesome and patient while us gringos muttered our orders in broken Spanish. Plus they didn't revert to English once we explained the idea.It's been fun watching this establishment grow over the past few years, too. When we first went it was mostly grocery store with a few tables tucked in where they fit. They've since cut the grocery side down by about half and have a proper dining area now.TL;DR - Great food, staff; fun location & ambiance. (Unless you're a vegetarian.)"], ["Darren M.", "The best, most authentic Mexican food in the city.I really don't know how else to describe it. My wife is from Mexico, and I've spent several months living there myself. I've never found anything in the city that compares.We were there this last Saturday, and both had the chilaquiles. We both agreed they were the best we've ever eaten, period."]], "Zócalo Mexican Cuisine & Tequileria": []}