{"The Capital Grille": [], "La Bodega": [], "Michael Smith Restaurant": [["Robert G.", "My friend decided to take me to a belated birthday lunch, and the restaurant of choice was Michael Smith. I arrived early and waited near the front door on a bench, there were a lot of extra chairs stored in this area which seemed out of character for an upscale restaurant such as this. When my friend arrived we went to the front desk and were greeted promptly and with a warm greeting, we informed him of our reservation and he took us to our table.We had a nice table by the window, but we were right next to a folded up curtain which protruded into our table space. Our server came to the table quickly and was very friendly and upbeat. We were ready to order. We both ordered the cream of broccolini soup. I felt the soup was way under seasoned. There are not salt and pepper shakers on the table, so I felt it was out of place to ask for salt and pepper, but the soup could have really used at least some fresh cracked pepper. It was still good, but seasoning would have definitely helped.After the soup, we shared an order of the pork belly tacos. We both felt that this dish was the best thing either of us had, fresh and flavorful with a cabbage slaw, and the perfect amount of seasoning.I ordered the Hangar Steak with mashed potatoes, roasted cherry tomatoes, and tempura asparagus. My friend ordered the Chicken Picata. I really enjoyed my steak, but in my experience growing up working on a ranch, we always felt that the Hangar steak was a throwaway cut. I have seen it several times in fancy restaurants, and I wonder if they choose it because if you can make a Hangar Steak taste good, you must be a good Chef. It seemed to be cut with the grain instead of against the grain, which made it a bit tough, which a Hangar Steak tends to be anyway, but the flavor was excellent, and it was seasoned perfectly.Since I despise capers, I didn't try my friend's Chicken Picata, but he said it was very good as well, just not as good as the tacos.While waiting for the restroom, I passed by a room that appeared to be a wine-tasting room, but there were several boxes open with cuts and tears along the boxes as if they were opened and then just left there. I don't think this type of thing should be open to the public as it looks like something that was left by the dumpster. This coupled with the storage of chairs in the front makes me think the management should do a check of the restaurant to make sure guests can't see untidy things such as these. It wasn't bad enough to bring my rating down to a 3 mind you, but it definitely stuck in the back of my mind when I consider that this is supposed to be fine dining.The food was excellent, and the atmosphere was up-scale for the most part, I would definitely recommend you try it for lunch, as the prices were very reasonable, especially since I wasn't paying. I'm not sure how much more dinner would be. I had several people recommend that I try the rabbit as it's considered the House Specialty, but since I grew up in Kansas and frequented Western Kansas, I had enough people feed me Rabbit and Squirrel that I don't think I will ever order it in a restaurant. I'm giving it a thumbs up for lunch first to see what you think, and then maybe dinner if you like what it has to offer."], ["Gail N.", "Since it was Restaurant Week, it was my husband who suggested that we find a restaurant that we haven't been to yet. When Michael Smith came up, we quickly decided that was a place to give a try.  Since we moved here two years ago we have tried numerous restaurants, but tend to stay with some of our neighborhood favorites in Brookside.  Restaurant Week is an opportunity to give something new a try.  It was unfortunate that our server didn't seem to \"feel the love\" for RW.  We were asked if we wanted to order when he took our wine order, seeming to want to rush us through the experience.  We each started with the kale salad for the first course which was good, but not great.  We ordered the steak and the pork and they were beautifully plated.  The pork was very tender, and my husband enjoyed it. I thought the flavors were not as good as expected, when I tried a bite.  My steak was also perfectly cooked, and very good.We tried different desserts and they were both delicious.  The Dark Chocolate tart was a little crunchier than I expected, but it was decadent.  When we have an amazing dining experience it usually requires a blend of delicious food and amazing hospitality.  It was the hospitality quotient that was missing last night.  I would say the food was at least a 4 and the service was OK-not what you expect.  The decor was beautiful.  It might have been a down night, or as I said before, maybe Restaurant Weekers aren't treated the same way as regular patrons, but I see it as a missed opportunity to convert some of these folks to becoming regulars."], ["Julia F.", "One of my favorite restaurants in Kansas City.  Conveniently located near downtown, I always come here when I have tickets to the opera or theatre so I can have a nice meal before a show.  They have excellent service and a very nice staff.  The food is fantastic.  Some of my favorites include the rabbit appetizer, the yellow tail ceviche, the duck entree or the scallops.  If you like pork (which unfortunately I do not eat), they have an eight hour pork roast that is so good my mother orders it every time we come here.  The deserts are quite yummy and worth a browse through the menu.  It is nice when the chef seems to have both talent and inspiration in creating and executing a menu!  If I had to find one critical element to mar this otherwise glowing review, I suppose it is that the restaurant is a bit cold (temperature-wise), particularly in the summer.  (Yeah, that's how good this place is; I'm reduced to reviewing the thermostat to find something about which to complain)  Bring a little cotton sweater if you're going strapless and problem solved."], ["Rob M.", "Tonight was the first concert on our subscription at the new Kauffman Center and we felt like treating ourselves to a good dinner before the performance.  I'd scored a Groupon sometime this summer.  Making reservations online was a snap -- there were no problems getting the date and time we wanted.This evening we arrived about half-an-hour late, as we got stuck in a traffic jam on Hwy 69 in JoCo, which has been under construction for what seems like forever!  Fortunately, they hadn't given our table away and we were seated immediately!  There must have been a lot of other people going to the Kauffman who were dining there -- the place was full and most patrons were VERY dressed up!  We went ahead and ordered, explaining to our server that we were going to the symphony and had run late because of traffic.  He said he'd let the kitchen know so we could get to the performance on time.  My partner ordered the roast Campo Lindo chicken dish and I ordered the goose breast.  We both ordered the green salad with ripe figs.  I asked for a glass of the Marques de Cáceres and my partner ordered a rosé.The salads arrived promptly and were a tasty combination of arugula, candied walnuts and ripe figs.  I didn't try my partner's chicken dish.  It looked a bit small to me, but she said it was delicious and seemed very satisfied with it.  My goose was excellent -- numerous slices, nicely pink in the middle, served atop a bed of spinach with a melange of julienned vegetables on top of it and more of the figs, this time roasted a bit.  (I guess figs must be in season!)Service was careful and attentive, and we both were pleased with our meals.  There were some tempting desserts on the menu, but we decided to pass on them because we didn't want to be late for the concert.  For the two of us the total came to about $85.  The Groupon was for $60, so it actually went a long way -- farther than I expected!  Of course, we skipped dessert and coffee.  But all in all we enjoyed the food, the atmosphere, and the service, and felt that the prices were reasonable for a restaurant of this quality.  We'll be back, especially because it's close to the Kauffman so it's perfect for a pre-performance dinner!"], ["Brandi C.", "My husband and I have wanted to go to Michael Smith since a friend of ours raved about it, and finally made it in last weekend. Even though it was freezing outside there were still plenty of people having dinner, so we were glad that we had made a reservation ahead of time.We were seated right away, and given menus that weighed about 5 lbs. each. Not that they were super extensive, just heavy! We were also provided with a wine list which is really decent - there are a few wines offered by the glass, but the selection of bottles is much larger, so we opted to share a bottle of very nice white wine, which (happily) was served at the perfect temperature. I started off with the watercress salad, and while it was good, it was nothing special. Just ok, really. What I should've done is ordered the rabbit gnocchi, which is what my husband had. It was excellent - very flavorful, and just the right sized portion. I will be ordering that the next time around for sure.For dinner, I had the scallops and my husband had the chicken breast. This time around, I think my option was the winner. The scallops were cooked perfectly, and the pine nuts and golden raisins that accompanied it made for an interesting but very nice flavor and texture combination. At first, I felt that the portion was a bit small, but upon finishing, I was nicely full without being stuffed, so it was actually perfect. My husband did enjoy his chicken, but the bite that I had didn't really wow me.We couldn't leave without checking out the dessert options, and there was no way I was going to pass up the (amazing) chocolate, cinnamon, and blood orange concoction listed. We originally planned to share, but then my husband saw that panna cotta was also an option, so we each got our own dessert. I loved mine, he loved his, and we were both happy. I enjoyed a glass of Vin Santo with my dessert, and my husband had a coffee.All in all, we enjoyed a really good meal, and the price was more than reasonable for the quality. The restaurant actually got a little bit loud as the evening wore on and a couple of larger groups arrived, so it was a bit hard to talk at times, but other than that, we had a very nice time. I would say that Michael Smith is a perfect \"date night\" location."], ["Jeff K.", "It was my first time down town for first Friday and we ended the night off at Michael Smith.  From the look of this place it seem like we would be having a wonderful upscale dinner. But unfortunately the server was so bad it took away from the delicious meal that we were served. It took 15 mins before the hostess even  saw us standing at the desk, other 10 mins before we had the waitress greet us and take drink orders.  The restaurant wasn't even that filled, about half I would say.  To start off, we had the foie gras torchon (My first time having it)  and it was great.  For the meal we got the lamb rack and chicken dish. The lamb was cook perfectly but the chicken came out chewy and dry. After are meal we waited about 20mins before the plates were clear and another 10 before she asked if we wanted desserts. For being has pricey has the meal were, I expected more from the service and two well cooked meals."], ["Amy W.", "So we tried this place again at the behest of friends who pleaded with us to give it a go. It still doesn't work. I'm not sure what's not quite right for us, considering that people fawn over this restaurant. We're not militant vegetarians but the mention of wanting recommendations without meat sent the server into a tizzy. There must be bushels of vegetables and spices in the kitchen but alas we couldn't have them. Wish I had my $200 back."], ["Pat D.", "Michael Smith's is simply wonderful.  Was it meeting Chef Michael Smith as he worked the dining room?  Was it the perfectly cooked halibut dish or, the wonderful morel mushroom and liver appetizer?  Was it the fantastic presentation of the food so you know a real chef prepared it?    Or, was it the photo of Michael and Julia Child on the wall near the door?  The relaxed yet semi-formal ambiance?  It was all of the above.  Thank you Michael Smith for a perfect date night with my wife."], ["Jessica E.", "I had only heard good things about Michael Smith's restaurant so my expectations were undoubtedly high. I had only looked into the small, cozy and intimate setting, mostly in passing to get to Extra Virgin, but was pleasantly surprised at its humble, yet sophisticated nature. My sister and I paid a visit during KC Restaurant Week so we took part in the RW menu. For starters, I had the braised pork tortellini with tomato argue. The outer-shell seemed a tad overcooked and the flavors were lacking, but generally speaking, it was a decent dish. For my main course, I had the pan fried hanger steak. The steak was cooked perfectly, no complaints there. To finish off, the apple bread pudding was ranked right up there for me next to some of my most favorite desserts in KC. The ambiance is definitely classy and the waiter we had (Stefan) was awesome! My sister and I look like \"young kids out on the town\" but weren't treated as so. Stefan was patient with us and helped us select a delicious white wine to complement our dessert. The best part of the evening was when Michael Smith himself came up to our table to ask us how we enjoyed our meals. He is down to earth, humble and kind; a direct reflection of the service and overall experience we had at his restaurant."], ["Kim-Anh P.", "I was visiting KC for work, and this restaurant caught my eye. We came at an odd time in the afternoon so we were seated immediately. I was trying to look at the menu online but I didn't see the menu nor the items I remember ordering (I went mid-March 2011). So bear with me, I'm going to try remembering what we had. There was a section on the menu labeled \"For the adventurous\". I was all over that. I tried the grilled bone marrow, the duck tongue tacos; tried my co-workers rice and chorizo and a handful of other dishes. It was tapas style, so if you get that same menu I did, it's fun to get a few different dishes and share. About 2-3 dishes are most than enough for one person.I think the chef was a little heavy-handed on the salt that day. If I was back in KC, I think I'd stop by again try other plates on the menu."], ["Ted H.", "Came for lunch with a group of co-workers.  The decor is very nice, and the service was prompt and friendly.  My group ordered the braised rabbit, trout, pork cheeks, steak, and hamburger.  Everyone raved about how good their food was.  Many in the group tried the rabbit, and thought it was excellent.  I will definitely dine here again."], ["Sheri R.", "I love everything EXCEPT......I am nitpicking here but it is my pet peeve, the level of dust hanging above my head. I just hate it when EVERYTHING is A 10 EXCEPT the fuzzy appearance on the light fixtures and dirty air vents.  Details like that in cleaning is something I am acutely aware of. With the exceptional food and exceptional service the only thing that would ruin it would be the dust in the food.d  As a side note, I could not sit at the bar at Extra Virgin for the same reason. That beautiful work of art is fuzzy with dust."], ["Matt S.", "We recently moved to Kansas City and have had a good time trying all of the dining options.  We were excited to try Michael Smith based on things we heard and his James Beard awards.  We headed there Tuesday night, October 11th, with the intent of ordering a couple of bottles of wine, exploring the menu, and treating ourselves to dessert.  it didn't happen that way.Hostesses were not welcoming and too rushed to even say, \"enjoy your meal.\"  The service was lousy.  Our server was Tyler who showed up at our table requesting our drink order.  We placed an order for a bottle of wine and he brought a different bottle saying \"we were out of what you ordered but this is the same grapes and the same price.\"  He then asked us to order.  I had some questions and asked for his recommendation which was greeted with a less than interested and non-informative answer.  When I asked about the Whitefish dish his response was \"mild.\"  That's it.  So we placed our orders based on our own guesses and were happy for the most part.  The food was decent.  We finished our dinner and sat for 15 minutes at a table with an empty wine bottle, two empty wine glasses, two empty water glasses, an empty bread basket, and two dirty plates.  At this point we decided to forgo the other bottle of wine and dessert.  Our table was cleared and we asked for the check.  When he took my credit card away, a hostess wandered over, removed the empty bottle of wine and asked us if we would like more wine.  A little to little and way too late.  The atmosphere was congested and bland.  There was no music for the first half of the 45 minutes we were there.  We were at a corner table by the kitchen which fit the attitude of being ignored by the staff.  The couple that was seated next to us at the same time we were seated still didn't have their entree when we left...but they had two empty wine glasses.  Poor things had to endure the experience longer than we did.There was one shiny spot in the evening.  When we left we were going to go across to Extra Virgin for dessert and wine.  We decided we didn't want to give any more money to Michael Smith so we walked around the corner and came upon The Reiger Hotel and Grille.  What a find!  The Hostess, wait staff, and chef were the friendliest and most accommodating in town.  We enjoyed spending money here and the desserts and wine were yummy.  We are going back on Saturday night and I just scheduled a dinner in a couple of weeks when out-of-town friends come to town.  I would say avoid Michael Smith Restaurant and spend your money where it is worth it.  There are so many great places we are stumbling upon in Kansas City."], ["LN S.", "I love this place--it is always perfect!  The heirloom tomato salad with compressed watermelon was perfectly dressed and delicious.It is always a challenge to decide which fish to get--they are always perfectly cooked and composed.The waitress, Angie, who is always helpful and delightful, helped us choose an amazing dessert--warm peach cobbler with brown sugar ice cream.  What a great way to end the meal.I love to go here for date night or with friends who are craving something delicious.  Chef Michael and his staff  never disappoints."], ["Jill H.", "This place has it all wrong for an expensive, high-end restaurant.    Our waiter was cold and for $25 to $35 a plate, the food was ehhh- by far not spectacular and not worth the money.   I ordered the most expensive item on the menu and was horribly disappointed.  The meat was so tough, I needed a saw to cut it.  This is coming from a foodie that travels often and lived in Las Vegas for 10 years taking clients and eating at very high end restaurants on a regular basis - the type where there are two waiters at your table and they treat each paying customer like a King and Queen.  I agree with the many negative reviews here on Yelp and with the many who bought the Groupon to give it a whirl and were disappointed.  Too bad, such a good opportunity to get repeat clientele and they obviously blew it time and time again.If you are a stuffy, wealthy KC resident that enjoys throwing your money away-by all means, eat here repeatedly.   If you are hard-working and want to enjoy a good meal, pleasant atmosphere, and impress the wife or a date-avoid this place like the plague!    I can give you ten other local restaurants in KC that are five stars and half the price!I don't see this place in business, a year from now?"], ["David B.", "The pork"], ["Cathy C.", "Eight-hour pork roast was worth the wait! I had lunch here a long time ago and had a good meal, but was disappointed that it wasn't on the menu. So when I saw it on Michael's Restaurant Week menu,  I was THERE! Moist, fall-apart tender but somehow he gets this wonderful crispy crust on it! It sits on a pool of risotto, topped with a spicy jicama (I think) slaw. I loved it! My daughter had scallops-3 big tender ones. We rounded out the 3-course meal with velvety cauliflower-fennel soup and shared our desserts-lemon merengue pie with cranberry sorbet and gingerbread spongecake with chocolate ganache. I could have eaten a gallon of the sorbet, and the combination of ginger and chocolate made me think it was Christmas again-delightful! The wine list is a Wine Spectator award winner, and I would have loved to have his bottle of 1990 Ch. Latour, but settled on a glass of Rhone instead. It was just fine with the pork roast.Service was competent, friendly but unobtrusive. The sleek interior is a bit tight, but conversation was easy, even as the place filled up on Yo Yo Ma night at the Symphony (that's another review-OMG!). The kitchen kept up with the growing crowd well, without making us feel hurried. On the night of a very special musical experience, we had a very special dinner as well."], ["Sharon D.", "Four of us dined on a Saturday night and were expecting to have a memorable experience. Unfortunately this was not the case. The server was mediocre at best and at one point downright rude. We were studing the menu when she approached our table and asked if we were \"ready for her now.\" The chef was making the rounds of the room and introduced himself. When he realized we had not yet ordered he promised to come back later to see how things were. And of course this never happened. Food was just O.K. And very small portions, not to mention for dinner at 7:30 they were out of the whitefish which two of us had wanted. We ordered two bottles of wine, one for $80 and another for $75. \"Diver\" scallops were definitely not, being so tiny and one even smelled less than fresh. Lets just say we won't return. In fairness to the server, she did bring a higher priced port than two of us ordered to compensate for the entrees being unavailable. Even so, when we visit Kansas City next Fall we'll try another restaurant."], ["AJ G.", "Kansas City Restaurant Week - Michael SmithAfter our, shall we say, very unusual experience at Justus Drugstore, we approached our third  reservation for Kansas City restaurant week, at Michael Smith, with a little trepidation.  Not to worry. We were greeted warmly and seated promptly, although the fashionable room was full:  already a sign of good management. The room is small, but with comfortable dining furniture, adequate space between tables, and very nice flatware. The room is decorated with tasteful abstract art, and, in the center of the rear wall, a framed 8 X 10 photo of the chef, Michael Smith, with Julia Child. His relationship to her is not specified, but certainly is effective in implying a good pedigree. The full room had a happy buzz, but not so loud that conversation is difficult.This restaurant handled the prix-fixe menu in what seems to me the ideal way: you are presented with the regular menu, in case your preference runs in a different direction, as well as a nicely printed menu for restaurant week, with three choices for each course. Our party of three selected two of the three available first courses: a mixed greens salad, and butternut squash ravioli. The salad was served with a home-made flatbread, fresh, nicely presented, fairly unremarkable. The ravioli were served piping hot in a covered dish, with a wonderful broth and large flakes of parmesan. We devoured them.For the main dish, we all opted for the pan-roasted campo lindo chicken, which came as a breast accompanied by a large homemade potato pierogie, and a tasty brown sauce. It was garnished with sautéed almonds and chestnuts: can't remember when I was last served a chestnut! Creative, interesting, and very enjoyable.We sampled the three desserts offered.  Lemon meringue \"pie\" received a modern treatment, as it came as a small rectangle of lemon custard on a crust, topped with little meringue chips. These were like tiny meringue cookies, shaped like large chocolate chips. Entertaining to the eye and the palate.  It was served with a scoop of cranberry sorbet, which was less intensely flavored than I had expected. The second was a little chocolate pecan tart, which was focused more on chocolate than pecan; very nice. It was served with a very creamy and intense tablespoon of chocolate espresso ice cream, and, for some reason, a thimble-sized cylinder of moist chocolate cake. Last was a spicy gingerbread sponge cake, which was paired with a bite of clove toffee; great complementary and creative flavors.Service was pleasant and efficient. In spite of a busy night, the staff appeared relaxed and welcoming. Water glasses were promptly refilled, as was the bread basket. All in all, a first class dining experience, at a great price, supporting a great cause. Kudos to Michael Smith for this effort."], ["Chris O.", "I have dined here several times for dinner and I think it is the best restaurant in Kansas City.  It is unusual that you find restaurants that could thrive in other major metropolitan areas, and this is one of them.My favorite is the tasting menus.  Each course is cooked and seasoned well, nicely plated, and the flavors are great.  The rabbit is super, the pork is outstanding, and the seafood is high quality.  I have only experienced good service at Michael Smith's.  My favorite server is Andie.  She is really knowledgeable about food, enjoys her job, and takes pride in great service."], ["Jansen F.", "Interesting to see the other reviews that all mention purchasing a Groupon to try Michael Smith and then being ambivalent about the meal. I thought the purpose of offering Groupons was to get new patrons into your establishment, wow them, and then get them to return and happily hand you fist fulls of money because you deserved it with your spectacular food and service?! I found the service cold but efficient. As far as the food: We ordered the soft Spanish tacos as an appetizer. They were not nearly as tasty as they sounded. Pretty forgettable really. Then they brought us beautiful looking rolls that were cold and tough. They weren't attempting to heat them but I think they would have tasted better warm. I had the beet salad and my companion a mixed green salad. Both were ok but each had an excessive amount of oil which seemed odd. I had a stuffed ravioli that was doughy and tough- icky. My husband had the braised rabbit which was the highlight of the meal- tender and served with amazing gnocchi. If not for the rabbit, I would have given this meal 2 stars. But the rabbit isn't enough to get me excited to go back, not when there are so many more memorable dining experiences available in KC."], ["Teresa R.", "Out to celebrate my birthday and got seated at the worst  table in the restaurant by the kitchen door looking out the window at the road construction in the street.  My steak was  chewy and tough and my husbands chicken was bland. The portions were small and the service was \"flat\" ...  Not to mention the average age in the place was 65+. Won't be going back and definitely wouldn't recommend to any of our friends."], ["Carin B.", "I read thru people's reviews and I agree with what many people are saying...the menu isn't exciting enough for a chef like Michael Smith. The food was good, but the portions are ridiculously small. My husband is a big guy and he went here because I wanted to go...ha! But I know he left hungry and so did my \"eat like a bird\" daughter. We won't be back, but I do enjoy eating at the finer restaurants in KC...once in awhile. Ps, we felt the same way about the bluestem...cool restaurant, good food, very small portions, fun to go once..."], ["Lilian O.", "My fiancee and I (both vegetarian) came here with two omnivorous friends during KC Restaurant Week 2011.  Last year for restaurant week, the same group and I ate at The American and was extremely happy with the exceptional service, ambiance, and food.  We were hoping for the same verdict for Michael Smith since he used to serve as executive chef for The American.  Unfortunately this was not the case.  I am not sure how much role he played in executing the dishes since he was walking back and forth between his namesake restaurant and Extra Virgin next door, talking to patrons, and checking in with his staff.They were able to make accommodations for my fiancee and I but in a fashion that was uninventive and uninspired.  Our meat eating friends both ordered the braised rabbit gnocchi for the first course, my fiancee got the gnocchi minus the rabbit, and I ordered the market greens salad.  The gnocchi dish for everyone was extremely bland and completely lacked seasoning and salt.  My friends were actually a little envious of the butternut squash in the vegetarian version as it offered more flavor than their meat version.  The salad was just a plain salad with nothing special on it, and I'm sad to admit that I make much better salads at home.  A drizzle of truffle oil and squeeze of Meyer lemon would have really helped it.The main entree fared better for the omnivores as they said their ribeye and chicken were very good.  The vegetarian entree fell short and the only redeeming item was the oyster mushrooms.  My fiancee and I were secretly hoping that we could just order food from Extra Virgin next door and have them bring it to us as the veggie options there are much better.  While we like butternut squash, why include it again in the main entree when it was already in the appetizer??I was hoping the dessert would redeem the experience but unfortunately made it worse.  The pear galette was too sweet, the bread pudding too rich, and the chocolate cake tasted exactly like a Little Debbie's Swiss Cake Roll (something I absolutely despise after receiving 17 boxes of it at a white elephant gift exchange party years ago).  It was as if someone took a cake roll, put it on a plate, and added a scoop of coconut ice cream next to it.The best part of the experience was the bottle of Cote du Rhone we ordered to compliment our meal.  For a James Beard award winner, we were all expecting a lot more."], ["Brenda D.", "This restaurant never disappoints and it's truely 5 star in all aspects.  You'll often see Michael scurring about but he will take the time to talk to you if you just stop him and say hello.  It's been a few weeks and I can't remember exactly what I had but it was a Caribbean dish with a white fish (not on the typical menu).  Since it was Morel season, I had to order one.  It was an exquisit taste of sauted mushrooms and garlic.  I was used to the dredged in cracker crumbs and fried.  I must say, Michael did it right.  I've had a lot of menu items here and they are all fantastic!  He does switch things up depending upon what's in season and this makes this restaurant always refreshing to go to.  You never know what he might be serving up!"], ["Lyndsey M.", "Our first visit to Michael Smith Restaurant won't be our last. My husband and I opted for the five-course tasting menu and were presented with two completely different five-course meals, and each course was beautiful, complex and creative. Everything served comes straight off the menu, so if you can't decide what single entrée to try, get the tasting menu and try lots!My favorites were the roasted beet salad with pumpkin dressing, pepitas and goat cheese and the grilled rack of lamb with chorizo and semolina dumpling, crispy brussels sprouts and huckleberry gastrique. His favorites were the braised rabbit with house made potato gnocchi, shiitake mushrooms, leeks and shaved parmesan, and the ran roasted eye of the ribeye with celeriac pierogi, black trumpet mushroom and cippolini onion. The desserts were a bit underwhelming, but still delicious (I can make that lemon pudding cake at home with my eyes closed). Service was good and the atmosphere was perfect for a laid-back, yet romantic evening."], ["Mad C.", "Had the six course tasting menu with the wine pairings last night. Outstanding."], ["Kevin M.", "The food was very excellent although served in smaller portions. The 8 hour pork roast was amazing and my date said she thoroughly enjoyed the chicken.  The price is a little bit on the higher side at $25-$35 per entree but had a Groupon which helped. Some of the 2 person tables are pretty close together which can make it a little awkward to get in and out and hold personal conversations but overall the atmosphere was very good for a date or for business. Very good place to take someone from DC, LA, Chicago, NYC, etc. to show them that KC has fine dining that compare to the larger cities."], ["JenelleandJustin L.", "Brisk is how I'd describe Michael Smith. I made a reservation on Opentable's app with special instructions to be seated away from the main entrance in a more secluded table if possible. We walked in a little early for our reservation and they seated us smack in the middle of two other tables (what seemed like 6\" apart). The food was tasty and well plated. The drinks were ok at best. The waitress was rude and openly more kind to the others around us who were spending more money. In the end I'd rather go to a less pretentious restaurant where the wait staff is kind and the drink quality is better."], ["Stacy L.", "We had a groupon and I wanted to introduce my husband to the restaurant.  My first, and only other, visit was during lunch.  Tonight was a long needed date night & was looking forward to impressing him with the restaurant.  We enjoyed ourselves, but there were a few things I would have changed.We started with choosing 2 sides as starters: Potato Gnocchi for me & Scallion Risotto for him.  Both were amazing.  We argued on which one was better.  I am really glad we ordered these, as it was a LONG time before our food arrived.  The place did not appear to be very packed, but it was a ridiculous amount of time before we got our entrees.  I chose the chicken breast & he had the steak with corn souffle & succotash.  Mine was pretty darn good.  His, just okay.  For a $30 steak, and Michael Smith, I expected phenomenal.  If it did not look like steak, we would have guessed it was pork.  Hard to believe, but we have had better steak at a Logan's Steakhouse.I am not sure if we will go back.  I do plan on checking out Extra Virgin next door.  According to our waitress, that is the \"fun\" side."], ["Pat A.", "My first review for this establishment, but I have been there at least a half dozen or so  times.  We have always been happy with the staff. In the end however we return for the food, which is outstanding and innovative.  In life you get what you pay for. It is relatively pricey, but the quality is there.  I usually like to go with the frequently offered groupons, which i would recommend to ease the cost ($60 for $30)."], ["Karen R.", "Went there for dinner 3/15, for the second time in a few years, with a Groupon. Although what we had was good, it was smaller portions than it should be for the price. And while I'm someone who enjoys small plates specifically, and finer foods in general, I'd never go there again without a Groupon. I enjoyed my appetizer (which I ordered as dinner), some sort of ravioli with oxtail(?). Very good, but sorry, can't remember the name and they don't keep their online menu updated at all. My friend had the (I think it's called) 8-hour pork, which was very good and the green onion risotto underneath was delicious. The s'mores dessert was cute and creative, and yummy, but it's pretty obvious to anyone who has actually eaten one that you need two crackers, not just one, to go with the other ingredients on the plate.The cucumber salad was good, as were the Brussels sprouts, but someone is way over-salting both of them. Chef: Don't be so pretentious that you won't keep salt/pepper on the table, thinking that only *you* know how much salt should be on or in the food you offer. Hold back and let people judge for themselves whether they'd like less or more. I'm someone who appreciates the flavors of food without being overpowered by salt. My dining partner likes to add salt to everything. Be creative and confident in what you've created, but not controlling and egotistical. It's not YOUR palate we're paying to please.Also, your ventilation system needs help. Although it was a warm (not hot) evening outside, your AC shouldn't be blasting onto each table inside. We started to move, but noticed that the candle flames on every other table were dancing like crazy also, as all the vents are open too far and directed poorly. We were freezing, and the hot food _immediately_ got cold. You need to a) close the louvers a bit to cut down on the flow, or b) have some sort of re-direction things put on them to maybe direct the flow across the ceiling instead of down onto the tables. Ruins the ambience and your food temperature.Service was adequate, although he could use some lessons in warm interaction with the clientele."], ["Bethanie W.", "After reading the reviews I was nervous about my reservation at Michael Smith. I had a Groupon so it wasn't going to be a total loss if all went downhill, though. I went on a Tuesday with my wife and the food was great and our server, Andie, was awesome. She was friendly, upbeat, and helpful with the menu and and wine. I had the Whitefish and it was delicious. Cooked perfectly and the potatoes and onion that accompanied it were just as wonderful. My wife has the scallops and they were cold, which was odd because we were one of five tables in the restaurant at the time.  We finished the meal with the hazelnut cake and it definitely help end the night with a bang - so good! The portions were very small, but that was expected as the up-scale restaurants seem to have smaller portions and my waistline appreciates this. :)My only tip would be to call in your reservations as the OpenTable always says they only have availability at 5 or 9, which obviously was not the case from what I saw. So I am unsure if they just don't utilize the OpenTable or if this method gets people in on the slow times."], ["Terra M.", "Whenever I'm feeling uninspired or ... underfed ... Popping in to Michael Smith is the sure way to cure those symptoms. The food is always perfect, not one morsel on the menu isn't worthy of the James Beard award, even when you order it to go. The atmosphere leaves little to be desired with its minimalist look and large simple windows. That why it's always where we bring the posh Danish speaking folks from corporate, knowing full well they wouldn't expect this quality and beauty in the, *they shudder*, midwest. As for the cost, it is exactly where you want it to be. Perfectly in line with all of the elements that go in to making a first rate restaurant in an urban area.In the minds of so many Europeans I've known as well as the odd east-coaster, the image of Kansas City being a fly over city shattering from their perception is a sight that NEVER gets old. I love you Kansas City, the Michael Smith's of this place and their patrons: You make us proud."], ["Kelsy M.", "My Fiancee and I went to Michael Smith with our Groupon.  I was pretty bummed out at the lack of warmth and hospitality of the place.  Our waiter had very little knowledge of the wine, and he never asked me how my food was.  And if he had asked, I would have told him my Mahi Mahi was dry.  I was expecting a perfectly cooked fish for 30 bucks a plate.  It is also pretty hard to overcook this type of fish. The food there is very good, you won't be disappointed.  I suppose after a bill of $150 bucks, you leave wondering if anyone REALLY gave a hoot that you just visited their restaurant."], ["Angela P.", "4.5 stars.  The decor and atmosphere was lovely.  I went for lunch and the prices were reasonable - two  entrees and dessert for about $30.  The food was portioned perfectly, even the warm bread and butter was delicious.  I had the chicken, risotto, and morel sauce - which the morel sauce made the dish.  The panna cotta dessert was nice, but I probably won't order it again.  Down sides - 1) its a pain to find parking.  2) service was very slow, even though there were only 4 tables filled in the entire place at lunch (server was slow, not the food arrival).  3) The AIR CONDITIONING!  We were sat by a host under the only vent in the entire place and the wind was so strong our menus BLEW OFF THE TABLE!  Even with my suit on, I was freezing!  Then our waitress came over saw where we were sitting and without any provocation told us the host should not have sat us there because that's the \"no-no table.\"  Wow, must have had complaints before!  So we were moved to another table however it was directly adjacent to the first table and in direct line of the vent so the wind was even stronger.  Even the large chandelier over our heads SWAYED in the wind.  Again, menus blew off the table.So, to sum up, don't sit under a vent unless you're very warm natured.  Despite these things, I will be back as the food was amazing."], ["Annie A.", "I had very high expectations of this place.. Which might have been my first problem.  Don't get me wrong... the food was phenomenal!! There were 3 of us and we all shared the 1. Roasted Beet Salad - AWESOME!  2. Bacon Wrapped Quail - Interesting, but very good.  3.  Braised Rabbit - of course had to try it and it did not disappoint! 4.  Pan Roasted Duck - AWESOME!!! 5. Veal Cheeks - Very good and very tender.. highly recommend and I could say I've never tried that one before! 6. We had a dessert as well with ice cream and mangos - I don't remember what it was called, but it was very good!The service was eh... which was disappointing to me, especially being in the industry and we were taking my mom out for mother's day and it was all of our's first time to go.  There was a very polite blonde that seated us and visited our table a couple times including to offer us a lovely bottle of champagne to go with our dessert... she was the saving grace of the whole experience.  Mr. Michael Smith did come out to our table to say hello and introduce himself which was AWESOME!!! A really nice touch!  As stated in other reviews.. I know servers can have their off nights, but I really didn't expect it at this restaurant.  For the price of the experience, I might not be back although I have not been to Extra Virgin yet, so I am excited to try it and I will Yelp as soon as I go there!"], ["jennifer j.", "My fish was great but my girlfriend's steaks were overcooked.  Waitress repeated the cooks fowl language as she recounted the story of returning the steaks to the kitchen.  Waitress was not interested in catching the roach which did the hoochy coochy dance over the wine bottles our entire meal.  Finally she got a napkin and snatch it after my restaurant manager friend recommended she do so.Wrote a letter to Michael (owner/chef) about the experience.  Instead of being sympathetic, he went on to tell me about the lifespan of the roach and what it means when you see them out in the open.  He recounted his extermination process and how roaches like to live in cardboard boxes...more then I needed to know.May Michael and his roaches have tons of success....ewww."], ["Mishel F.", "A solid 3-star restaurant and a nice additionl to the Kansas City dining scene.  We came here recently for a work dinner as we could not get into Bluestem - the service was warm and friendly and the atmosphere conducive to having a conversation.  The food was hit or miss, I loved the house-made agnolotti however the scallop ceviche was fishy smelling and had an odd taste.  Everything else was fine, but nothing stood out as exceptional.  I did appreciate the diverse cocktail list and the use of interesting ingredients, bitters and house infused liquors."], ["Dennis N.", "I found this place thanks to GroupOn.  The service is excellent.  Tyler did a good job.  My drink is never empty, which is a huge pet peeve for me.  I liked the Rabbit as an appetizer.  My entree was excellent when I ordered the beef tenderloins.  I definitely will be back here in the near future.  Thanks for the great experience!"]], "Seasons 52": [], "Piropos": [["Michael A.", "Of all my 10+ years in KC people have asked me over and over, \"have you tried Piropos? It's great!\" Unfortunately I always replied no but always told myself that I would go. Today was finally that day.  And disappointed I was not. The ambience is great. Different than traditional steak houses in that it was very open and nicely lit with natural light. Accenting the dining area were boldly colored paintings which took you further into Argentina. The waiter was very friendly and truly concerned about our well being throughout the meal which was very nice and made us feel at home. The food...Brie with apricot spread.  The apricot was so fresh and complemented be Brie nicely. Started with a glass of Argentinian Malbec (Filus) which was one of the best I have tasted and went well with the steak...peppercorn encrusted filet medium rare...awesome. Succulent and full of flavor after a sip of the Filus. The eight ounce was a perfect size for this evening.Churros with ice cream and chocolate dipping sauce...decadent sauce! Not too rich but just perfect. Warm and complementing the ice cream. We would definitely come back to Piropos and I recommend the same you my friend. Cheers fellow palatteers."], ["Ralph S.", "We went to Piropos for my birthday last month. Piropos has been or go-to place for celebrating milestones in or family for a number of years. We were always impressed by the service and food quality. This time was a glaring exception.The service was mediocre at best. Our waitress was slow in responding to our needs. It took a long time to get our cocktails, and the server said the bartender was \"tied-up\". The restaurant was not full by any means, being an early Thursday evening. When our entrees arrived, one of the steaks was way undercooked and it took time to get someone's attention to send it back for additional cooking.I went to the men's bathroom to find, after using the facility, that there were no paper towels in the dispenser. I returned to our table to dry my hands on my napkin. I notified the gentleman who appeared to be the manager, and he seemed unconcerned.We may have to rethink whether to return to Piropos for our next celebration."], ["Eric D.", "One of my kc favorites. Semi formal dinners, and a good view of the skilyline.The food and service here is second to none.During my last dining experience I ordered beef medallions in a brandy creme sauce. I think they came with asparagus and mashed potatoes.  It was very good.They also have an amazing bar, and a great wine selection."], ["Rachel S.", "I've been to Piropos on several occasions. The first few experiences were decent, what I would expect from a nicer restaurant. My last experience there was sadly disappointing. I was there with my brand new fiance to celebrate our engagement (about 1.5hrs after he proposed!), our waitress was inattentive, distracted,...all those other qualities you don't want on a night like that! We were there on a Tuesday, so it wasn't overly busy. On top of the so so service, our meals were both terrible. I pulled out several bones from my salmon, to the point where I just stopped eating it, and only ate the mashed potato and asparagus sides. My fiance's steak was overcooked, and not at all what he had requested. He also left about half his entree on the plate, and stuck to enjoying the sides. We left without dessert and feeling very let down after prior experiences."], ["Darrell L.", "Piropos is one of my favorite restaurant in Kansas City, I'm surprised that I have not written a review for this wonderful place. The food is awesome and the service is always great. Definitely a place for special occasions.The most recent visit I have was last Sunday, when we decided to check out their Kansas City Restaurant Week menu. We were greeted promptly upon arrival, and we were being seated right away. The KCRW menu shows great varieties of selection, and we were all able to find what we like on the menu. I usually ordered the lamb dish they have on the dinner menu, but decided to try the KCRW menu instead. For the first course, I had the soup (crab bisque), which was a little bit too salty for my taste. Our soups unfortunately came out cold, not even the room temperature, but our server was very helpful, apologized, brought them back and heated them up for us. As for main entree, I had the seafood platter, which consists of grilled shrimp, tilapia and scallop. The seafood were well cooked and properly seasoned. We all did enjoy our meal a lot. The last course was dessert, and we had the chocolate churros and banana cake, they were delicious and were the perfect ending of the meal.I would highly recommend this place for those who appreciate great food, great service and great ambiance. Request for a table by the window facing Kansas City Downtown for the gorgeous view too!"], ["Wendy W.", "Piropos is my favorite restaurant in KC!  If you are looking for the best steak in Kansas City, it is Christina's peppercorn fillet.  When we moved to Kansas City in 1998, we set out to find the perfect steak in this cow town....we have found it.  This is a beautiful restaurant with a marvelous view, excellent service, and even live music!  The food is always on point and the staff is top notch.   A must....and often."], ["John M.", "Empanadas, crab bisque, peppercorn crusted filet, twin lobster tails over potato hash ... I think my point is quite clear this place is amazing. The price is something you can easily overlook as long as you are going for a nice meal and a cozy setting with the one you adore.It was an enjoyable evening and let's not forget the very noms worthy three layer chocolate mousse cake that topped it all off."], ["Deana A.", "Went back to Piropos for our anniversary, and had a much better experience than previously.  The food was again excellent and our waiter was very attentive and gracious.Thank you Gary (the owner) for encouraging us to give you another try.  I appreciate how prompt you were to reach out after my previous experience.  This is an owner who cares about his customers and wants them to be happy."], ["Cathy C.", "I had passed on Piropos for years due to the alleged priciness of the menu, but finally went for a friend's birthday. Yes, the steaks are pricey, but I was happy to discover that if you don't want to spend $40 on dinner, you don't have to.I found seafood ravioli for $18 and was very happy I opted to spend another 9 to add grilled shrimp and an empanada off the starter menu. The ravioli were stuffed full and basked in a luscious tomato cream sauce, and the shrimp were seasoned and cooked perfectly. Beef and raisins together in a meat pie may sound strange, but trust me, these Argentinians know what they're doing. Ditto for the mysterious but wonderful chimichurri they brought out with warm baguette slices to start us off. I could've made a meal of that alone!The restaurant itself is absolutely gorgeous. The week before Thanksgiving, they were already decorated for Christmas with pine garland and white lights adding to the warmth of fireplaces, candlelight, upholstered chairs and white tablecloths. We were seated next to a window on a clear night that afforded what has to be one of the most stunning views in Kansas City. The staff are gracious and completely professional, and treat your visit as a special occasion, no matter why you're there."], ["David D.", "Thanks yelpers, would have never gone here if it were not for your suggestions. Was in town for a long weekend, wanted to get off the plaza and took the short drive to this place. If you have not been here and have the chance, go!"], ["Cindy R.", "Came here for my first time last night for the BF's birthday.  If you can get a table that has the great view of KC, it's ideal.  The restaurant has fantastic ambiance and the food is delicious. There is a $25 corkage fee if you bring your own bottle of wine but if you choose to \"wine\" in, they have a good list to pick from.  The staff is very much willing to please and give you the best dining experience possible. As an appetizer we had the crab cakes, which were very crabby and had a yummy sauce paired with them and tried the caprese and three cheese empanada- all were yummy! For dinner, I ordered the daily catch mixed grill that came with Mahi-Mahi, scallops, shrimp and (upgraded to) lobster risotto. Highly recommend the lobster risotto.  The BF got lobster with a side of lobster risotto (yes, he likes lobster) and asparagus.  Both meals were decadent and we were quite pleased.  We got a dessert on the house since it was his birthday and we chose the triple layer chocolate mousse cake.  Very good. My only reason for giving it a 4 rather than a 5 is because our server kept disappearing for extended periods of time so it was quite odd.  We ended up serving ourselves wine and making do with what we had.  Other than that, I would definitely come back here. Everything was fantastic."], ["Bri S.", "This is hands down my favorite restaurant in KC. It's a great environment with a beautiful view of downtown. All the servers and bartenders have been very knowledgeable and friendly. My favorite dish is the pan seared stuffed chicken breast and I suggest the wrapped scallops for an appetizer. This is a great place for a nice date or showing friends and family around KC."], ["Caroline C.", "I came here for restaurant week and the staff was very accommodating as one of our party members was running late. I had the soup, prime rib, and banana cake. I thought the soup was on the heavy side, the prime rib was done well - flavorful, juicy, and not too salty, and the he banana cake was good - not overly sweet. The place has a great view of the Kansas City skyline but nothing food wise made an impression."], ["Marc T.", "This place is not in my neck of the woods , but when I get invited here I always look forward to the dining experience. Friends were great- seating and drinks were fantastic. Food choices were wide- I ordered the pan seared blackened halibut - a bit firm and chewy but tasty. The waiter, although nice, appeared to either be distracted or had an aversion to interacting with the diners post taking 1 drink order, then disappearing for another 5 minutes before coming back...strange. So, if it wasn't for the waiter, 4 stars would be the rating..."], ["Jamal M.", "Caught the server attempting to place a DROPPED lemon wedge on my beer glass. Dis-ASTER of a night. Oh...I'm writing this review at our table at 8:40pm. We haven't even got our entrees yet even though we've been sat since 7:30."], ["Brent F.", "Restaurant Week 2015:  We had an okay experience dining at Piropos this year.  We ordered the prime rib (waited 2 years for it to return) and was disappointed with the quality.  It wasn't as tender as the previous year, had very little taste, and was room temperature cold.  The person filling up the water reached all the way over the table and spilt water/ice every time.  I would have suggested asking if I would like some water first; most people in their right mind would move the glass closer.On the positive, our server was very polite, friendly, and quick.  Couldn't have asked for a better server this visit.  Two things always consistent are the delicious Emapandas and friendly staff."], ["Justin E.", "I totally don't get the hate for this place. The food is always impeccable. I typically order empanadas, lobster and steak. If you stick to all small plates you can't go wrong. The service is typically above average, although I will say the female servers try way harder than the males.  I also found out that on Valentines day they have a fixed menu which was a little disappointing. Manager said he'd make it up to us but I never took him up on it. Being an upscale place I've never felt snubbed by the staff or management. Other customers on the other hand can be a little judgmental if you're wearing a Chiefs jersey, so why not make the wife happy and put on a button shirt and some jeans without holes for once. Live it up with an amazing view of downtown KC."], ["Terry K.", "I want to preface this saying this review and rating are not a reflection of the food but of the service we received. We had a reservation for 830 which we showed up for early, but they had no tables ready and we waited in the bar for 20 minutes. Finally got seated around 845 and proceeded to wait about 20 minutes from our waitress introducing herself to coming back to give us water and take our order finally. We order empanadas, an appetizer, entrees and wine at around 905, and we proceeded to wait another 15 minutes to get the wine and our first sign of food...the bread basket. Now it's 920, and we are still sitting around until about 950 when no food has come out and the waitress tells us the calamari is sold out (the appetizer we ordered). I'm not sure what exactly took so long to figure it out, but we frustratingly declined ordering a new appetizer at this point. We finally get the empanadas soon after this news, which to their credit were delicious. Then we proceed to wait another 30 minutes until we finally complain about the lack of concern for our table and the prolonged wait times to get our food. The manager finally came with what I can describe as disdain and annoyance toward US for complaining. We had it with the service and the attitude after being starved for 2 hours now, so we just got up and left. The last impression from the manager when he told us we could leave wasn't of remorse for our terrible experience, but of good riddance of customers he didn't want. I can honestly say I have never had service as bad as this at any restaurant, or from any other service based business in my life. Good luck Piropos, seems like you have a solid KC following. But being from a large city with restaurants like you being a dime a dozen, you won't be seeing me again."], ["Sara C.", "We just happened to be in town during restaurant week and so glad we were. This city and no shortage of amazing places to eat. The crab bisque was amazing. Nice atmosphere and wonderful service. Highly recommend!"], ["Mark G.", "Soppressata sandwich was kind of boring.   Way too much sauce drowned out of the taste and spiciness of the meat.  French fries were lukewarm.  Agree with other reviewers.  This place is overrated."]], "JJ's": [], "Blvd Tavern": [], "Novel Restaurant": [], "Collection": [], "Room 39": [["Steve L.", "Delicious. Had the Croque Madame and it was perfect. High quality ham, Gruyere cheese and bread with perfectly cooked over medium eggs on top. Potatoes are what they are but were just fine with a bit of hot sauce. Busy Saturday morning but snagged a seat at the bar and was in and out in a little over 30 minutes. I'll be back."], ["Peter B.", "Had the Fruit, Yogurt and granola for breakfast this morning. It was good, however, it is difficult to judge a place on its yogurt/granola bowl so as far as the food goes I'll give it 3/5 stars. The atmosphere was pleasant (another 3/5). The service was neither poor nor remarkable (maybe a bit on the slow side but there was only 1 server on the floor), he was very polite.I am sure we will eat there again sometime in the future; at that time, I will leave a proper, more helpful, review. #For now, I'll recommend*My first review"], ["Piyush K.", "Quaint place not far from the hospital. One block up from Jimmy Jigger's. Great service. Interestingly tasty food. I got the oven eggs."], ["Billie H.", "This was a last minute decision and a very happy last minute decision.It was tough to stick with the restaurant week menu after veiwing thw regular menu. Everything sounds delicious, and breakfast after 2pm as an option sounded really good, but I went with the goat cheese croquets and the trout.I am not sure if they make the bread or bring it in, but it is definitely fresh.The goat cheese croquets are not part of the regular menu. This is a very, very, sad thing as they were quite amazing! The goat cheese was oozing as you cut into the croquet. The taste perfect, just enough of that pungent taste that goat cheese needs, but not over powering. Very creamy with a bit of crunch from the outside. The croquets rested on top of a beet sauce that added the perfect sweetness to the goat cheese. I normally am not a fan of beets, but this combination is a huge win.The trout was good, lightly seasoned and perfect crispy skin. The lentils with it were bland, but mixing them with the herbed yogurt made them delicious. The chard was sauteed nicely. The meal really seemed to be designed to combine a little of each item into one perfect bite. Service was a little slow. Stood waiting for someone to seat me. A long wait before my orser was taken. Left sitting for a bit when done waiting for a box and to go container. But it was super friendly and the perfect amount of attentive.The place is small, with about a dozen tables. It is really cute and they did a good job of using the exisiting building in the style. The smells that drift through the restaurant enhance the overall experience. I caught myself just taking in the smells. I could just sit there all day enjoying a book and rhe smells.I haven't been down to 39th street in a while because I think overall the quality of the restaurants has declined. Room 39 has changed that and will be on my list for brunch in the near future!"], ["Nathan G.", "This place was an excellent find.  The girlfriend was looking for an alternative to cheap noodles and we stumbled upon this place.  I had the duck, which cooked perfectly whilst she had the ravioli.  They also offered complimentary pickled olives and fresh bread.  I highly recommend this place for quality food."], ["Vishal S.", "Definitely try the fresh OJ. It was fantastic and the service was excellent except for the girl working behind the counter.......she is a freak!"], ["Neeca B.", "Sometimes when I love something I tend to over do it and had a stint of a long standing 9am Saturday morning reservation here. Breakfast is my favorite and I felt like I had to kiss a lot of breakfast frog.s before I found Room 39. I don't want you to think KC doesn't have a good breakfast scene because it does and its only getting better. Room 39 though I adore.                I've been for lunch and dinner too, it's just their breakfast really is that good. It is always packed on Saturday, Sunday they are closed,  which use to bother me but I'm good now. I really appreciate that they take reservations. I've tried alot, my favorites are the quiche or steak and eggs Benedict, but I did rotate through most of the menu.  Most people I take with me almost always got the brioche french toast and it is really good I just prefer savory at breakfast. Their has only been one item I ordered I didn't care for and it was a drink. Dirty Chai, chai tea with a shot of espresso, usually I really like them. However I found they make their own chai, spices and all. Its good, just not dirty. Their coffee is excellent. Dinner is delish however, my take is, I didn't like it as a date option. Too small and too loud. I don't mind starting my morning like this but not to wind down. Parking can also be rough sometimes I get that rock star spot and other times I'm creeping the street. Overall Room 39 is consistently amazing."], ["Julie H.", "The only thing that kept this place from 5 stars was the soup of the day, a turnip soup, while it was good the turnip wasn't apparent.  The menu was a challenge was the menu had so many choices but we landed on the pork chop and a KC strip, that while \"typical\" was presented with a bit of a twist. It was all flavorable and we will be back."], ["Daniel K.", "I dont know why I havent been here in 3 years.  Probably because its so hidden in VOlker?!  Nah... Im just too lazy to drive 3 miles.  Came for breakfast this time and it was fantastic.  The corned beef hash was grrrreat.  It was gone shortly after it came out.  The madam croquette was also very good.  Did I order 2 breakfasts?"], ["Caroline C.", "Definitely one of the best brunches I've had in Kansas City. I shared a steak and eggs benedict and artichoke sandwich. Room 39 knows how to cook their eggs. The bread was fresh and toasted just right, there was a good amount of artichoke spread, the steak was cooked to a nice medium. I had come for dinner a couple of months before and was disappointed with the food.  It was pricey and did not have that wow factor. BUT I am so glad I gave this place a second chance for brunch! Great service (brunch and dinner). Also, if all the tables are taken, ask for a seat at the bar. The bartender's awesome. =]"], ["Andrew M.", "Despite living just 3 blocks from Room 39 yesterday was the first time I made it here for breakfast -- why didn't I do this years ago?? Had a very dinner here a couple of years ago but it was too expensive to make it a habit. Not surprisingly, breakfast is a bit more affordable. Came in about 10:15 on a Monday and the restaurant was almost full. I would probably come right at opening next time just to be safe! My wife ordered the French toast but I ended up eating half of it and it was excellent. I had the Croque Madame with gruyere cheese (my favorite) and it was even more amazing. I was really hungry so I ordered an extra side of potatoes but given the generous portions that came with the sandwich that probably wasn't necessary.For $10 my meal wasn't overpriced in the least -- no more expensive than any of the other breakfast restaurants in town of its kind and just as good or better! Would be nice if they were open on Sunday but it would probably be next to impossible to get a table anyhow. OH well...this will be my go to place for mornings where I'm off work. I'm already looking forward to next time...."], ["Justin L.", "The food was great, the service was great, but park carefully (nothing to do with the restaurant... just the drivers in the area).The food... it's a farm to table restaurant with a great selection. I would recommend coming here with a decent sized group and getting a variety of dishes (and sharing). I'm not big on salads, but my friend's salad was great! They also have a decent selection of wine to pair with your dinner.The venue... can get crowded. Luckily I visited while it was warm out and we took a table outside. It's not the largest venue around, so plan ahead and be prepared with a back-up plan if you didn't make reservations or if its busy.The parking... the neighborhood has limited parking, and there's one lot in the back. Everyone's experience will differ, but the first day I moved to KC, someone does a hit and run on my parked car there. Great way to start my KC experience. However, I'd just warn individuals to watch their parking and park in the far recesses of the lot to avoid all other cars (if you love yours as much as I do).Overall... definitely worth visiting!"], ["Adam S.", "It's time to update my puny review about Room 39 because quite frankly, Room 39 is one of the best restaurants in Kansas City. If you could have free food for life from one restaurant in Kansas City, what would yours be? Mine would be Room 39 by a landslide. First of all, their brunch is one of the best in town. It's a somewhat smaller space, so it may be filled up if you show up at a peak time on a Saturday (of course) but it's worth it if you're in. They have great roasted coffee (Broadway Roasting Company for the win), and their ability to take the simplest things and make them taste incredible is top of the line. A side of potatoes is simply roasted with sea salt, but somehow manages to taste like the one of the best sides of potatoes you'll ever taste. It's a cop-out to say that \"everything on the menu is good\" but in this case, I'll cop-out because it's legitimate. Their staff is incredible, always very friendly and perfectly attentive. There's no negativity with anyone here.I frequent brunch here, and have had dinner only once but it was tremendous. This is a place that has always been farm-to-table without overly marketing it. Their genuine, local produce bursts with flavor and the portions are perfect in size. My recommendation could not be any stronger, check this place out whether it's a nice dinner date or grabbing lunch. It's a 10/10."], ["Steven F.", "I had never heard of \"Brioche\" anything before I moved here to Kansas City. Naturally, I felt a bit hesitant, ordering Brioche French Toast; however, the adventurer inside me begged to give it a shot--plus, it was listed with bacon and potatoes. So I placed my order for carry out. Walking in, the ambience was very relaxing and welcoming. The To Go guy called my name as soon as I walked in! I don't know how he knew I ordered To Go, but I loved it! He was really nice and made sure that I had everything I needed. (By the way, I am a recycle nut and love to see the little \"fold the top\" containers! Always a plus!)It seems that homefried potatoes--I think that's what they call them--are a staple here. These were the best I've had so far! They were lightly seasoned and tasty all the way through, like they were prepared in butter or something. The bacon was delicious! Soft, salty (not too much but just right!), and succulent! I poured syrup over the bread--not too bad. The texture was a little dry so I drenched the bread pieces in syrup. AMAZING!!! I've had plenty of food with syrup and this was definitely one of the best! My only complaints were the parking and the Orange juice. I only saw street parking and 39th is a busy street! Now, the Orange juice--I am a die hard fan of fresh squeezed orange juice and this was made from concentrate, which I despise. All things considered, I think fresh squeezed would be a great fit at this restaurant. Overall though, I give it a B+, like an 89.3. Give me some fresh squeezed OJ and y'all have an A!!!"], ["Thomas A.", "Aunt Cha Cha and I had a fabulous breakfast here one morning back in October.  I had a cafe mocha to start out that was a nice touch.  I had the corned beef hash with realy corned beef and two eggs over easy with potates.  Excellent!  I love the atmosphere here too and in the morning, it is easy to park on one of the sidestreets although Aunt Cha Cha was fortunate enough to snag a space on the street.  I love this place and will have to try it for lunch and dinner!"], ["Yembur A.", "Room 39 is so cozy and homey! Really great atmosphere and neighborhood feel. It's a 39th street classic! I've only ever come for breakfast, but I love the diversity of choices on the menu, including meatless options. The service is a little on the slow side, however, so beware if you're in a rush."], ["Mark P.", "Was in KC for 3 days and had breakfast here twice.  Would have come back for lunch and dinner as well, but they might had thought it strange (instead I had lunch at their other branch). It's a cute room in a quiet him looking neighborhood.  The menu is full of attractive healthy options. The Fresh squeezed OJ in is a great touch, and most I importantly the food taste great. I especially enjoyed the scrambled eggs with smoked Salmon."], ["Ignacio G.", "Super totes yumz yumz brek brek. I got the crouqe madam (sp?). And the service was prettayyy good. Cum here yew wont regret it !"], ["Monica E.", "Wonderful cozy atmosphere with very unique and tasty food and drinks. Great customer service too! My faves are any gnocchi and their vichyssoise!!"], ["Daniel H.", "Room 39 came to mind when we were trying to figure out what to eat for dinner.  It was in the Volker area near KU Med which meant the street parking was terrible in my opinion.  Luckily, we found parking half a block away.  This place was a very small restaurant with a bar.  We had reservations but still waited a few minutes for our table to be prepared so we sat at the bar.I liked how the menu was online even though the menu probably changes daily since there was a date at the top.  At least I was able to figure out what I wanted.  The three of us all decided on the Four Course Tasting Menu ($39 per person) as well as the Charcuterie Plate ($21) and the fresh crispy calamari with pecorino romano, roasted ancho pepper aioli and lemon ($10).  The Four Course Tasting Menu was pretty much what it sounded like.  We had a choice of soup or salad, 1 appetizer or pasta, 1 entree, and 1 dessert.  I decided on the New England clam chowder with scallions, the Bolognese with housemade fettuccini, fresh herbs and grana padano, the Filet, and the Chocolate pudding cake with almond chocolate toffee.Bread and olives were provided before our food came out.  The Charcuterie Plate was good for what I tried except t I didn't like the chicken liver or duck liver.  That was just me though and I'm sure others liked it.  The calamari was good and wasn't oily/greasy like I've seen at other restaurants.  I think they were waiting for us to finish everything before our first course came out.  The New England clam chowder was tasty and was served in a shallow bowl.  I probably finished it in like less than 10 spoonfuls or something like that.  The second course came and the Bolognese was good.  I liked it and would recommend it if you can't decide which pasta to order.  I was being careful though so it wouldn't splash on my clothes from picking up the fettuccini with my fork.  The third course was the Filet and I enjoyed everything (filet and mashed potatoes) except the brussels sprouts.  They were all pretty burnt and I don't know if it was supposed to be THAT  burnt or not.  Finally, the fourth course came which was the Chocolate pudding.  They asked me if it was okay to use ice cream instead of whipped cream (probably ran out) and I told them it was fine.  I felt that was better than whipped cream but probably because I wasn't watching my weight.  The chocolate pudding with ice cream was good.  I also tried coconut panna cotta and that was good especially with the orange sorbet.  The bread pudding was just okay and nothing special really.Room 39 was great and I would recommend trying this place out if you haven't."]], "Tannin Wine Bar and Kitchen": [], "The Westside Local": [["Nyla K.", "We thought we would try something different with this months dinner club and do a bunch.  Little did we know brunch is only served on Sunday's!  We were pretty disappointed but we couldn't just up and leave so we just stayed and had lunch.It was everyone's first time here and some of us were a bit thrown off by the prices of each dish but as soon as we got our food it all made sense.  I had the summit burger with the soup of the day (spicy pork soup) and although the burger was average the soup was very good.  Had nice flavor that had a somewhat Asian twist to it.My boyfriend had the grilled cheese sandwich with ham and it was huge!  And it sure didn't lack taste.  It was served on Texas toast and was the best grilled cheese I've ever had.  It came with a side of fries and soup.  I was a bit jealous of it and wished I would have ordered it.The thing with dinner club is being able to sample the other dishes from everyone else.  My next fave was the Mac n cheese with chicken.  Again the portion was huge and so good.  I think next time I'll ask for a side of it.  I tasted the bangers and mash as well and although the gravy was a bit bland the sausage really reminded me of a Laotian sausage that my mom used to make.  However, I would stay clear of that, not because it reminded me of my moms cooking but because of the bland gravy ;).Also the place is really cute tucked away in a residential area.  I don't remember what the area is called but really cute place.  Very hipster!"], ["Laura R.", "The food was good, but not great. I got the Windhaven burger with the Parmesan parsley fries. The garlic spread on the burger added a nice flavor, but the burger itself was a bit bland. The fries were crispy and flavorful, but they weren't served very warm. My friends got the grilled cheese and mac and cheese, which were really tasty. Our server was polite, but not very attentive. I went almost my entire meal waiting for a refill, and my friend had to ask twice for a beer. I would try this restaurant again and get the grilled cheese."], ["Carrie C.", "Cool neighborhood, cool building, cool menu, cool place and the food certainly lived up to every positive review I've heard and read. I'd been here for a baby shower a few days prior with a few tastes of their starters, but had to return so that I could chow down and not be judged.I absolutely love the style of this place, open and exposed with a touch of modern thrown in, the vibe is comfortable and relaxed - plus the soundtrack of the day was some nice jazz music to sway to. The service is also on point with all of the staff being fast and accommodating. Although, I have to warn all those who like window tables, the sun pours into this place, so keep that in mind for your late afternoon visits! Yelper Mom has been here before, but this was my first actual visit, so the menu was new territory for me. We decided to split an order of the cool spinach and artichoke dip and literally ate all of it. The fresh chips that come with it were a great compliment to it and better than most, but I probably could have eaten it by itself with a spoon and been equally happy. We both went with sandwiches, Yelper Mom going for the Summit Burger (which she said was cooked perfectly) while I went with the Chicken Sandwich (I can't remember if it had a more specific name). The brioche bun was light and buttery and the barbeque sauce was a little sweet with a bite to it, both of which perfect compliments for the juicy chicken breast with melted cheddar cheese and bacon. Basically, my point is that this thing was perfect in my opinion and I'll definitely order it again!"], ["Marisa B.", "Delicious, fresh farm to table food. Some of it from the adorable garden that you can view if you choose to sit outside. This is a go to spot for me because I feel safe eating here with my dietary restrictions. There are items clearly marked on the menu, as to what can be modified. But the fact that I have always been able to communicate with my server, and the kitchen in regards to any additional questions or restrictions I might have keeps me coming back. For those who may be needing to eat gluten free, dairy free, vegan, or vegetarian, I personally feel that the Westside Local can accommodate you. They have a solid, seasonal menu with a decent variety of options and price points. The bar menu is just as solid. You could have a lovely date here in the dining room, or a casual meet up with friends outside, or in the bar nook area. If you are not that hungry, try out the rotating localities, which start at $2.50. You can order one to add to your dish, or mix and match, building your own appetizer plate. I have been known to order one of everything in my realm of allowed foods, and build that plate as my meal itself.We have yet to be disappointed when dining here. Another thing that I like with the menu they have offered thus far, is the options for size portions on the salads. And they are always generous, even with the smaller portion. Overall, it is a solid choice for dining in Kansas City. And with it being in one of my favorite neighborhoods, it's a destination spot as well."], ["Cathy C.", "Well, damn, here's another lunch spot to return to over and over again. I hadn't been here for at least a couple of years, having been kinda underwhelmed by the quinoa dish that everybody was Yelping about. But Yelper Daughter insisted, having enjoyed a baby shower here last week, and this time everything was spot on.We started with spinach artichoke dip, which is way different and way better, I think, than the gloppy cheesy version you get everywhere else. I don't know what they use for a base, but it's light and creamy instead, and the tortilla chips with them are better than most. I loved the Summit burger cooked medium, just a tiny bit pink in the middle. I ordered it on greens and got a bun instead, but I wasn't sorry. A bite of YD's Chicken Sammy was delicious too, as were her fries, thin and crispy outside, fluffy in the middle. The service was friendly and prompt, and the music was fantastic that day-tasty smooth jazz with just enough pep in its step to keep it interesting. The decor falls into my favorite category, warm but urban, airy, lots of exposed brick and local artists' work on the walls, and a charming patio that will have to wait for a nicer day."], ["Tyra W.", "Four stars: WL prides itself on being farm-to-table concept that serves menu items with the freshest ingredients that best support local farms and businesses. We came in for blunch on a Sunday and ordered the almond french toast, biscuits gravy with substitute sausage gravy, as well as several mimosas. Prices are what you'd expect from a trendy F-t-T restaurant. Let me just say the b&g took my breath away. MASSIVE EPIC PORTION. A part of my soul died when I gave up midway thru and boxed it. (Next time I'm going half order!) Their buttermilk biscuits and breakfast potatoes are what dreams are made of. Everything just really comes together here, the food, and the service. On a side note, I wish I had tried the house banana bread since I noticed a lot of people had ordered some. An additional star: Rockstar pup service. I love dining at establishments that are dog friendly. Sometimes I feel a little overwhelming for places with TWO furry ones weighing in at about 50 lbs each. Nope, not here because my husky twins were well taken care of! It was a little awkward sitting on the bench style seating whereas with table/chairs, I can just worry-free loop the leash thru a chair leg and presto I'm done. I had to get a bit creative with cinching the leash around my thigh and keep them from licking the other patrons calves. (I am so sorry if that was you! & I swear I'm not the lady in Kay's review.) Staff, even apart from our server, were keen at refilling their water and giving them attention throughout our meal. On my list, this is incredibly important to me; I am so appreciative for their kindness in regards to my babes. A woman had even called me a couple minutes ahead of my reservation to ask how close I was and even met us out front to open the patio gate since I noted I had dogs present."], ["Kieu N.", "When there's unlimited dining choices, it doesn't hurt to take a few minutes to browse your options. Today, my 'googling' took me to Westside Local. Do you know that they idealize the farm-to-table dining experience? Fresh ingredients from local farms? Count me in.Listed as an eclectic restaurant, I can see why after looking at the menu. I'm not ambitious or creative enough to make any of these dishes at home. What is emmentaler? Escabeche coulis? Cassoulet? More googling...Anyway, so I ordered the sweet potato quinoa burger with hummus instead of cheese. Jalapeno is one of the ingredients but trust me, there was not even a hint of spice. Overall, it was a good burger. Filled me up. But it was one of those 'you only try once' dish, not good enough to eat again and again. However, those fries dipped in garlic aoili was an entirely different story! Golden crispy and perfectly seasoned. I also got a bite of my sister's kale chicken wrap. While it was good, I think the kale overwhelmed everything else in the wrap.Our server gave us great service. I was undecided about which white wine to order so she let me taste test. I love it when they let me do that! Until next time!"], ["Daphne L.", "The ambience was chic and great for a date. I ordered the Shatto Plattsburg cheese, artichoke and spinach dip, and prosciutto as an appetizer and the Barramundi fish as an entrée. - My favorite was the prosciutto which was savory, meaty, has no gristle, and thick. - My second favorite is the dip which is creamy and smooth. - The Shatto Plattsburg cheese was dry in my opinion and tasted like cheese flavored cardboard. - The Barramundi is a white fish and it was very tender and succulent. I'm not a big fan of the sweet chili bbq sauce on top because it seems to overpower the fish's flavor and just tasted like plain tomato sauce. I could not taste the ginger in the ginger-coconut risotto. On the other hand, my coworker have said very good things about the osso bucco. The other coworker commented that the Mac and cheese was too liquidity and the taste wasn't a traditional classic Mac and cheese."], ["Jon S.", "We've eaten at Westside Local twice now. The atmosphere and service are great but we've just never had good food. Everything has sounded great on the menu but ended up being incredibly bland each time."], ["Kay L.", "Gotta knock off a star... the food is still very good (although overpriced) but the patio has gone downhill.  Last time we were there, it just looked dingy & dirty, with some raggedy curtains draped in a swag over the gate, and spiderwebs in the corners.  Plus, I know everyone loves a dog-friendly patio, but the woman at the table next to us decided to spend an extensive amount of time petting her Husky on a hot, hot day.  The resulting combo of epic shedding & huge fans meant a perfect storm of dog hair blowing around our heads & into our food.  It was quite disgusting.If we go back, we'll request indoor seating."], ["Adam S.", "This is a place that embraces Kansas City and Kansas City embraces it. It's higher end, farm-to-table, urban and delicious 90% of the time. It's even climbed my list of places to recommend to people visiting out of town.I've never seen this place slow, including lunch and dinners. It's a great, charming older building that is easy to feel at home at year round. You also get the added benefit of a beer garden on the side for the warmer days.As for the food, there are many good meals that I've tried (grilled cheese with tomato fennel soup, the burger and fries, mac n cheese, and some salads) but there have been a few meals that are a bit underwhelming. Not bad by any stretch, just more of a \"this is $16 and tastes like it should be $9\" type of feeling.It's a great early First Fridays dinner spot, but it's best to make a reservation because it's always packed."], ["Kathy M.", "We have been fans of this establishment; however, on our last visit hubby ordered a BLT and thought the bread,tomato and lettuce were excellent, but they lost MAJOR points on the bacon. It was one piece of bacon for a good size sandwich. A $14 BLT should definitely have several pieces of bacon on it!I had the salmon which was really good and the cubano at the table was also enjoyed. My daughter had the 1/2 chicken and wished she had ordered the mac and cheese instead. She thought the chicken had a spicy kick, but there wasn't much else going for the dish. We may return; however, we will be more careful about what we order."], ["Chelsea N.", "Love the brunch breakfast burrito! Great atmosphere. Great food. Good Staff. Has kid seating. Good for groups. My favorite is that they take reservations online!"], ["Matthew L.", "Great brunch selections. Deceptively filling portions that leave you wanting more but ok with not. The banana bread was a top choice. Great beer list. Would certainly come back for dinner. You should too."], ["Eric S.", "Great spot with an incredible menu. It's not every day you find a place that makes it hard to choose. I finally decided on the Summit Burger  1/2 pound ground hormone-free rib-eye, arugula, emmentaler, dijon vinaigrette, on farm-to-market brioche bun and the parmesan & parsley fries (which you'll eat them all, trust me.) It was so good, the beer menu was lengthy and the ambiance was upscale and hip. Look forward to trying the same burger with the jalapeño options next time."], ["Emily M.", "This is one of my all-time favorite restaurants in KC MO. I love that they support all natural and local companies. When we were pulling up, Shatto Milk company was making their morning delivery. I mean, how can you get it any fresher? Went with the daily special of BLT on Sasha's bakery bread with avocado spread and a light jalapeño cream sauce. It was delicious! Also, upgraded side to kale salad - which is a must have! And you can't go wrong with a side of mac & cheese. Thanks for a great lunch, Westside!"], ["Kent Jacob S.", "I cannot believe I have never reviewed The Westside Local. Shame on me because if anyone ever asks for my opinion on breakfast/brunch places, The Westside Local always pops up in my head first. The food is delicious and the service is top notch!What comes to mind when I think of Westside Local are the parmesan fries and grilled cheese. I swear by it, their fries are probably my favorite anywhere. It beats Oklahoma Joes, In-N-Out, and any other place I've said where fries were amazing. For the life of me, I don't understand why but eating their fries with house-made ketchup and garlic aioli sauces will always stick with me. Therefore, this place must be that good. So, if I haven't raved about it enough, their fries are a must order I tell you! The grilled cheese was just as delicious. The bread is toasty yet moist and that white cheddar cheese is very tasty. The tomato fennel soup is really a good pairing for their grilled cheese, so kudos to the chef here.The people are friendly and they really know the food well. I love putting waiters on the spot and asking them for their favorite dish. I can still remember our waiter telling me about the fennel soup and grilled cheese. The place does get busy but am very pleased that they take reservations. The Westside Local is a great place to go. It's no wonder that Finding KC rates this place as one of the top breakfast joints in all of Kansas City."], ["Tim C.", "We were in town for a conference and decided to venture outside the convention area for a less touristy place to eat. We walked a mile to get to this little spot, and it didn't disappoint. It has a very hipster vibe to it, which normally isn't my thing, but it wasn't to bad. The cocktails were fresh, and well made. The food was fantastic. We sat on the patio, which was a little hot. Maybe some fans that worked a little better may have helped. Our server was very good.  I definitely recommend WL for a nice place to grabs cocktail and/or grab a bite to eat with some good conversation."], ["Brenda M.", "Had an overall great 1st meal here. Had lunch on a Sunday afternoon, we walked in with no wait and were seating promptly. I ordered the Summit Burger and my friend ordered the Blunch Burger. The food was a good portion, as well as the fries. It came out with a house made ketchup that was fantastic. The burger consisted of a half a pound patty, cheese, greens, and mustard. Now that might not sound like much but the flavors of the burger went so well together and the meat was so flavorful and not greasy that it didn't need anything else. I usually like all the dressings on my burger but with this one I didn't need anything else. My friend also loved her meal. The only reason I took off a star was because the fries that came with my meal were lukewarm and starting to be inedible when I ate them, also our server took a long time to refill our waters to where I was rationing out my water with each bite of food once I saw that it was dwindling down and I still had half a burger left. Other than that I'll be sure to be returning to try more things on their menu."], ["Frank L.", "I had the privilege to check out Westside local for lunch while visiting Kansas City.  I came in for lunch on a Friday around 11:20 and 15 minutes later, the place was packed.I decided to sit in the bar area on a high top so was helped by the bartender.  He was awesome, and helped decide on my meal.  I went with the Veggie Quinoa sweet potato burger with a side of kale hummus.  Everythin on the menu looked great.The burger came out pretty quickly and was huge.  There was a bi to much bread, so I just ate the yummy insides sans bun.  It was my first time trying kale hummus and I was pleaseantly surprised.  The craft beer selection was also pretty impressive, albeit a bit pricey for some.  All in all a great place."]], "Cooper's Hawk Winery & Restaurants": [], "Extra Virgin": [["Tiffany C.", "Delicious and unique food that can be altered to cater to vegetarian/vegan crowds.Following a vegan diet, I ordered:1) Chickpea fries2) Corn3) Grilled mushroom (altered from grilled oyster mushrooms)4) Lebanese hummus5) Persian cucumber pickles6) Potatoes bravas7) White bean salad with grapesMeal + tip totaled to around $53. Service was excellent and they were very patient with our large (14+) group. They have no corkage fee on Mondays but have a limit of two wine bottles per table. For our large group, they allowed four bottles."], ["Chirag P.", "One of a kind! It offers small bites, portions of many items from the menu. So you can enjoy may items in same meal. I ordered 3 items on food menu and a couple beers. The final price was surprisingly not a lot. Service was amazing as the waiter himself made very good recommendations - thats means they know a lot about not just their menu but tastes too.  We couldnt find parking close so they lose 1 star."], ["Caryn D.", "Food and service was excellent! We had the duck tongue tacos, shrimp fried rice, ramen, pork buns, and dessert. We almost passed on the dessert but I'm sooooo glad we didn't. The homemade churros and tres leeches was unreal! We could have ordered 2 of each and been content. Don't skip the dessert!!!!"], ["Dono P.", "Thought the pork belly and churros were great but the Greek salad and especially the hanger steak were let downs. I will go back to try more of their unique dishes but the botched hanger steak definitely threw me off a bit."], ["Jennifer C.", "Went for lunch during restaurant week.  Interestingly it was cheaper for us to order alacarte than it was for the special which consisted of the same thing so was odd.  Had the tuna tacos which I would skip next time...there was one tiny piece of tuna in each taco and the rest was filler and had almost no flavor of seasoning.   The French onion soup was great...really well done.  The poblano Mac and cheese was decent...not anything I would rank as must have in a future visit.  My husband had the burger which he liked...cooked well and good quality meat.  Excellent Italian wine under dark and fruity category.  So as you can see was a bit all over the place.  Have been for dinner previously and had better luck with dishes being consistent in quality."], ["Nicole G.", "We absolutely loved this restaurant. The ambiance and food were fantastic. They serve small plates. We ordered Gorgonzola. Which came with a cracker and jam spread. Amazing!  Next up were Pork Belly Steamed Buns. They were delicious. The bread reminded me of an asian pork bun. Very flavorful. Then we had Poblano Mac & Cheese, Octopus Nachos and Wood Fired Hanger Steak. All were amazing. We ordered too much food though. Will definitely return!"], ["Tim M.", "Dined here last night with a group of us and had a fantastic experience. The wait staff were extremely friendly and the food was awesome. Our group probably ordered about 24 dishes in total and we loved it all. Our highlights were the crab and corn fritters, roasted marrow bones, chorizo and fig stuffed chicken, the ricotta.... The list goes on. We can't wait to come back!"], ["Tricia H.", "In Italian when we eat we Mangia!!! That's exactly what I did here!!! I Mangia and I Mangia and I loved it!!! I'm not sure why I've avoided this place but I had...I was tickled  when our sweet waitress told came to the table apologized for getting makeup and coffee on her shirt on the way to work..then she absolutely intrigued me when she told me the chef/owner studied in the south of France, I couldn't wait to taste his food!!! I was in love at first bite of the tuna cerviche tacos!!!! Thank you restaurant week for opening my eyes!! I cannot wait to go back!"], ["Tee S.", "This was our first meal in KC coming from out of state. I ordered several small plates that I thought would be interesting to try.  This place has eurasian influenced food, not a typical Spanish Tapas place. I ordered the pig ear salad, chicken thighs wrapped with figs, bone marrow, and spanish meat balls.The pig ear salad had nice, crispy ears mixed with arugula and vinegrette. The bone marrow was good. The chicken and fig was sweet and did not taste spectacular. It definitely didn't have that taste like it was freshly cooked. The Spanish meatballs was kind of bland and undercooked. Overall, 2/4 dishes were good."], ["Randy G.", "The feel of the place us great. Fun, energetic, staff is great, nice layout but the food was okay. Hanger steak A+, Greek salad A+, Mac & Cheese D- (Kraft is better), Chicken thighs w/Chirizo D- (buy a rotisserie chicken at local grocery store)."], ["Michael C.", "Chef Michael Smith takes the 'nasty bits' of animals and turn them into delicious tapas. Under the \"For the adventurous\" portion of the menu, we had the beef heart terrine and pig stomach and they were both great! Also had the most amazing sea urchin pasta!"], ["Angelica E.", "Michael Smith is one of my favorite chefs in Kansas City. Ive followed his cuisine since 40 Sardines. I rate this restaurant a two because of poor service. Sadly my experience at Extra Virgin was tainted by the barkeep, a tall blonde guy, and his condescending and extremely immature demeanor. Its really difficult to enjoy good food with bad service. I ordered every menu item with oysters on the menu the mac & cheese and grilled ricotta bread while sipping champagne. Fabulous! The chefs here really enjoy what they do and it shows in the way the flavor of their food comes together."], ["Eric F.", "The food was good but not.great but for the price it was a good find ..drinks were really good"], ["Marek S.", "Great spot to start the night off especially during happy hour. Try the pork belly steam buns and shrimp fried rice! Very attentive staff and great red wines."], ["Divine A.", "We always enjoy our food and the service every time we come. One small request: New stuff on the menu please!!!"], ["Nick G.", "When my wife and my 10-year-old son arrived at Extra-Virgin, we entered a pleasantly decorated, rather swanky, restaurant that clearly catered to a tapas crowd.  Steven, our server, immediately presented us with menus of exotic dishes. Upon inspection of the menu, we saw that the price for the servings matched the prices of tapas restaurants that we have encountered in Orlando, Atlanta, and New York City. We therefore ordered what we thought was a sufficient array of dishes to satisfy our pallets.  Our excitement of what we were ordering was enhanced by the smells, aromatic and spicy, emanating from the kitchen. We informed Steven that we were passing through and this would be a one time event for us. He quickly went over what he thought were the best choices to make off the menu, and we complied, wishing to pair a string of dishes that would match a culinary theme.  He reassured us that \"somehow whatever we chose would all come together in the end.\"How right he was. Our first round of happiness included duck tongue tacos with spicy pickled onions and queso fresco.  The gamey and sour flavors were attenuated by the small chunks of the creamy cheese, and it was a subtle but nevertheless delicious opening foray.  The sea salt brought out for us to spoon on as needed brought these flavors out more fully.  The chickpea fries were stacked in a log cabin presentation which was appealing visually, and the plate contained a smear of a red pepper sauce.  This was a surprise, for this side was a truly novel experience for us, and we enjoyed the fries immeasurably throughout the meal, using them to soak up the juices of subsequent dishes that followed.Our next round of culinary delights included peppers stuffed with morcilla sausage and Pecorino cheese, both of which gave the piquillos a long finish of several layers of favors.  In addition, chorizo and fig filled chicken thighs served as a sweet counterpart to the peppers, and its juice was a perfect partner for the aforementioned chick pea fries.  The pièce de résistance, however, was a dish traditionally representative of the most basic of American staples: macaroni and cheese.  In the world of Extra-Virgin, macaroni and cheese exemplifies the concept of gourmet. The dish was prepared with poblano cheese and served in sizzling iron skillets. The combination of creaminess with the brittle crispiness of its shell and its sides which stuck to the pan were pleasant to chew, sensual for the tongue and pallet, and layered with a long finish of taste which paired ably with the locally brewed beers we drank.  How could so much food fill three people up so satisfyingly?  I think it was that in the bursts of favors, the sensuality of the textures, and the balance of the foods and spices used to prepare the tapas we were forced to slow down in order to savor every bite.  By the time we were ready to finish with a cheese assortment, we had to ask Steven if he had begun to prepare it, and upon finding out that he had not, we were able to gratefully cancel as its presentation would have been overload.Steven was right: it all came together, and in a very big and glorious way. It is a great value for the price, for the portions of the tapas were generous. Extra-Virgin unequivocally gets the RSA: the Roaducation Stamp of Approval ... at the highest level!  Thank you, Michael Smith!"], ["D V.", "My wife and I went here Saturday night for dinner and had a wonderful time.  We are foodies that love bold, interesting flavors and something outside of the norm for Kansas City.  Wait times were reasonable, service was impeccable (friendly and attentive without being obtrusive) and the food was amazing.We had the chick pea fries, duck-tongue tacos, heirloom tomato and ricotta cheese plate, avocado and something tacos, and a take off on shrimp ceviche.  Great twist on the traditional cocktails too.Dinner for two with one round of drinks came to $80 all-in, so it's a little pricey, but I feel it's a good value given the quality and variety of food you receive.We'll definitely be making the drive up from south OP just so we can try more things from the menu!"], ["Zac S.", "This place is fantastic. Berto at the bar creates some great drinks and makes for a fantastic dining experience. Try the pork belly steam bun."], ["Anthony G.", "Having recently moved to KC and looking for some high quality places to eat, I was directed towards Michael Smiths and Extra Virgin. 1. Atmosphere - With an extremely energetic and great bar filled environment it was a really just \"fun\" all over. Staff knows their menu and Bartenders know every drink in the book, how to explain it for a novice, and how to really make your time enjoyable. 2. Food - INCREDIBLE... for a Tapas place, I was extremely impressed. We ordered 5 plates to test. We ordered to hummus, the shrimp fried rice  (MUST GET), Spanish Meatballs, The hanger steak, and for Dessert the Pear Crostada.3. Bar - As I mentioned earlier the bar was very impressive but many key items stand out. The bar space is great, no matter where you sit, you have en elegant view of everything want to see. I ordered \"The Last Word\" which was a first for me but very enjoyable. It's always fun to be in the middle of actions that witnesses all the and food coming your your way or around it4. ONE MAJOR SETBACK WHICH IS THE ONLY REASON THEY ARE RECEIVING 4 STARS RATHER THAN 5. I never brought this to the attention of any manager but I should have. As mentions earlier we ordered the Hanger Steak, which was delicious by the way. It was prepared with a side of kale but the steak is rarely cooked and sliced thin. After enjoying it, I turned around to notice the cook preparing all of these Steaks so it was clearly a high seller. While watching him, there were no gloves worn whatsoever. I'm not a picky person but growing up in the food industry I know you can't do that. If your chefs are visible to the front of the house, you CANNOT be putting your raw hands on every dish you prepare. That's is just a no-no. I witnessed him grabbing multple raw pieces of meat along with the kale itself and other dishes without washing a single finger or ever decided to use gloves. What bothers me the most is the fact that the restaurant is set up that way in which w can see them prepare... if I can see you touch my food, please give the customer a since of security when eating because it was flat out DISGUSTING. Blood from someones steak then to grab the kale without the use of tongs is unacceptable and I hope Michael is informed. Overall besides one incident, I loved it, I will return, and I will recommend to everyone."], ["Alexander R.", "My wife has been wanting to go here for a while now. I wish we had gone before they got bored with what they were doing. The place was slow. But it still took over 8 minutes to be greeted by our server. We were seated as she cleaned the table next to us. When she continued to clean as I stood waiting to be able to pull out my chair, I thought, please don't let this be my server. She isn't planning on being sat anytime soon. But, as her little bee tattoo buzzed by us two or three times, attending to the neighboring tables, I realized that we were indeed, in her section. My old fashioned was very good. But the food was bland and boring. I've had better deviled eggs at church picnics. Don't get me wrong, the food was all cooked well (only the chicken thighs were burnt). It was quite a disappointment. After spending 20+ years in kitchens, I understand how a restaurant can become content with just churning out the same thing and getting comfortable. But, when I am out for my 20th anniversary, I'm hoping to get something amazing. Or at least intriguing. I hope to try them again, once they have regained interest in what they are doing."]], "Potpie": [["Amanda A.", "Amazing - it's like a little French bistro, nestled into Westport. I add the French definition for a couple of reasons: lots of small tables close together, rustic decor, and absolutely amazing food. It's not fast food, but it's good food. We've been there several times and I've never had a bad dish, but I'll put in really strong recommendations for the mussels and the roasted chicken. I know, chicken usually equals boring, but not here. The roasted chicken is one of my favorite plates in town!!"], ["Angela S.", "My sister and I went in just before 5pm, which was perfect!  No line, not busy. Being from out of town, I learned about Potpie from Diners, Drive-ins, and Dives.  We were not disappointed. We ordered all the favorites: mussels, goat cheese salad, chicken pot pie, beef and mushroom pot pie, and chocolate chip bread pudding. Everything was delicious!The muscles were plentiful, and the sauce was great for dipping. Salads were tasty and had generous amounts of goat cheese spread on bread accompanying the plate.  For the price, the actual salad could've been better. Pot pies were both delicious, and in my opinion, not too salty - and I don't salt anything, so I'm pretty sensitive when my food has too much salt.  We finished up with what is probably the best bread pudding I have eaten.Good, friendly, table service.  Food service was a bit slow, especially since they weren't busy, but they did have to bake our meals, so I'm not complaining too loudly.I wasn't in a position to try to cocktails or wine list, but I would have if I could have. Great for a date night, OK for older kids, but not for those who are young enough to get antsy waiting for their meal.I will go back if I'm in town again."], ["Riad S.", "You have to get a reservation if you want to eat here on the weekends and you will still most likely have to wait a little once you get there since the place is really small.The mussels were great. The sauce that comes with it brings out most of the flavor. I had the beef pot pie this time which I thought I was better than the chicken. Lastly I had the chocolate bread pudding which was one of the better bread puddings I've had. I would highly recommend this restaurant."], ["Josh A.", "Had a really great experience eating here. I got to sit at the bar and watch the bartender Vic make his famous Old Fashion. He was very knowledgable on all the different whisky drinks available. I also liked seeing into the open kitchen and seeing them prepare the meals. I had the chicken pot pie of course along with the goat cheese salad with beet dressing. I really liked it."], ["Allen R.", "We went not thinking we needed a reservation and got really lucky to get a table because the place was packed.  There was nowhere to stand and wait and all the table are jammed really close together.  I never like going to places where you are so close to other tables and people that you have to listen to their conversations as well as yours.  Having said all that, we were seated and ordered what else but, pot pie.  The place is called that so it's hard to go there and not order their mainstay.  I ordered the beef & mushroom and another reviewer ordered the chicken pot pie.  Our server was great and there were no problem here.  It does take a while to get your pot pie so if you are starving and need something quick, this might not be it.  It was a good 30 minutes before our pot pies are served and they were served SMOKING hot.  They were so hot there was no way you could eat them for another 10 minutes while we waited for them to cool down.  I just thought my beef & mushroom pot pie was okay.  The beef was somewhat chewy and the flavor just needed to hit higher levels.  I was able to try the chicken pot pie and I thought it was better.  There were some things I would change about them though too.  The first being the pot pies do not have a bottom crust.  They only have a top crust.  I love having pot pie with the bottom crust as well as the top.  I would also not use a puff pastry for the top crust.  I would use more of a flour pie type based crust because, I just feel it meshes best with pot pie.  The other thing I would do is just add more different kinds of pot pies.  The place is named pot pie and they offer 2 different kinds, so not much variety.  It's a place I will definitely be back when I am in the mood for some good comfort food."], ["Quintin C.", "Okay so we had a kidless afternoon and spent it down at Westport!   Found PotPie here on yelp actually!  I have to say we absolutely loved this place!!!  Quaint, character, and EXCELLENT good!   So good and such a down town gem.  Wife had the chicken pot pie and it was awesome.  I had roasted chicken which was also very very good.  We started off with sausage and split pea soup and I must say it was off the chain good!!!  Finished with chocolate chip bread pudding.  Are you kidding me??This will be a place we bring out of town guests for sure to showcase local KC!  Loved it!"], ["Daniel K.", "Pot Pie is a nice little restaurant in Westport. I've been here twice and preferred the dinner scallops to the Beef & Mushroom pot pie. The pot pie was too salty and was not anything memorable. The Chicken Pasta was good however. Bear in mind that you will be waiting quite a bit for the food - hence their sign on the menu...this is not fast food. A must try is their bread pudding."], ["Dave N.", "My wife and I went here tonight to try a local spot that has a good reputation and reviews online. Obviously, we didn't find it to be so for us...Everything started out okay, but quickly went downhill once being seated close to the server station and open kitchen. My complaints don't have anything to do with the service or food (which we left before getting), but the food safety practices and behaviors, or lack thereof, of the entire staff including the owner whom waited on us. We watched as nearly all of the front of house staff ate off of small plates while standing over the bread that was being cut and served to all the tables. They would shove food in their mouths and then would proceed to immediately grab bread to serve to patrons. From the bartender to the cooks in the kitchen, not a single person washed their hands, ever, even after going outside and coming back in after presumably smoking. It was obvious with the servers in front because the only sink available to do so was covered with a silverware bin. If that wasn't enough, my wife then noticed the head chef/cook that was making salads and plating dishes was dipping tabacco and spitting in a coke can he had right below the make table....never washing hands and spitting in his can right above all the plates coming out of the kitchen...repulsive. It shows a total disregard, on the owners standpoint, of leadership and care of their customers to allow these behaviors to take place in their business."], ["Katie M.", "I have been here 4 times and each time the food has been exceptional. The mussels, scallops and chocolate chip bread pudding are a must. The atmosphere is relaxed and the staff allows you to take your time eating without rushing you through your meal. I recommend Potpie to everyone.  It's quickly becoming my families favorite."], ["Brandon A.", "I love this place. Can't believe I haven't reviewed yet. Probably because I have such a good time when there, that I forget all about Yelp, checking-in and... (gulp) even the Internet itself.The menu is a chalkboard hanging on an entrance facing wall and has been different on every visit (except for the pot pie(s), house salad, etc). I've grown to trust that everything on it will be excellent, even when it sounds like... an experiment. Each recipe has a lot of thought behind it and is cooked with care. Generally too much care, BTW, for a quick meal - and they are proud of the fact.Pot Pie serves seafood fit for visitors from any coastal city. It isn't really a secret, but could be their selling point if they didn't do everything else so well. The bar, for example, could stand on its own - TOP NOTCH.No, I don't work there, or know anyone who does."], ["Danny B.", "Pot Pie deserves 3.5 stars and really should be 4, but I cannot go the extra half (or round up) due to the salt in my pot pit.So, the dining area is very nice and has many things to look at and we were lucky enough to score the table by the large front window which facilitated some nice people watching.  The staff was nice and attentive.  I had iced tea and it tasted fresh - a major plus.For appetizers one of our party ordered the goat cheese salad with beet dressing, but didn't make any particular comments about it.  That may be a comment in itself!  We also had the mussels.  They were very generous for the price and delicious with a garlic butter sauce.  Along with the mussels came a loaf of cut up Italian bread for sopping up the garlic butter which was a real highlight!My friends ordered the chicken and I went with the beef and mushroom pot pies.  When they were served, I had looked for the salt and pepper thinking it may need some, but noticed there is none on the tables - the crust of the pie was seasoned so I went with it.  I didn't notice a description of the sauce, but I believe it was Cabernet based and very flavorful accompaniment to the beef and mushroom chunks.  The flavor was a good quality pot pie, but just too darn salty.  I look forward to going back for mussels and drinks!"], ["April S.", "My husband and I came to Pot Pie with a couple of our friends last Saturday night and absolutely loved it! We came at 6 and it was very crowded. It's a very small building but it was still quiet enough you could hear each other and the closeness of others really wasn't an issue. It's dimly lit with a candle on wooden tables. Super cute. It takes about 40 minutes to get your pot pies because as they say...it's good food not fast food. The pot pies were amazing! Perfect flaky crust with tasty chicken and veggies. Be careful because it's extremely hot. Make reservations. We will definitely be back to try the other menu items."], ["Vicky T.", "tip: make reservations! walked in Saturday night for dinner and the place was overflowing with people. very snug restaurant for a cozy meal of the best beef potpie I ever had. $12 for either mushroom and beef (cooked with red wine) or chicken and veggies (cooked with white wine). on most occasions I prefer chicken entrees over beef, but I must tell you that the beef potpie was delicious!! chicken was alright but inferior to the beef and mushroom. the aroma of the beef and red wine is absolutely intoxicating. if my vote alone does not convince you, well, my friends and I went around the table and cast a vote each for the beef and mushroom potpie: 5-0. best any of us ever tasted. so there you go! a dilemma between the two? no longer now I hope!"], ["Ch H.", "I went to Pot Pie for their namesake dish, and the mussels.  I really enjoyed the mussels.  Pot Pie is a concept calling for my love, but it's going to take a few more trips to let my heart decide.  The ticket time for the pot pie was exceedingly long for lunch, delaying our departure from town by an extra 35 minutes or so, and I had two issues with said pie: 1. Sodium level was off the charts into the bland zone. 2. No peas in the pot pie. I've asked around, and I'm not being unreasonable with my pea expectation.  I think they need to work on things a bit."], ["Justin L.", "Great restaurant, accommodating to groups (make a reservation), and a fun staff.The food... their menu changes frequently, but I decided to indulge myself and got both the beef pot pie and a pan roasted chicken. Surprising, but I think the pan roasted chicken was actually better. It was extremely tender and came with some sides. The beef pot pie was good, but I think a more tender meat would have made me like it more (but I didn't want to chicken dishes). I felt that after about half or so of the beef pot pie, the flavor was just a bit overwhelming (could also be two entrees, but I think the flavor point is right).The venue... I arrived without a reservation (boo on me). However, the staff was very up front about my chances for getting a table and noted that some prior reservation was already well past, and that they were going to give them some more time and a call.  If they didn't show it was mine for the taking. With a bit of waiting and patience, they were able to squeeze a table of four in and we had no problems at all.The staff... I'm not sure who the bar tender is, but he seems like quite a fun character. The waitress was also extremely helpful, both with drink orders and sharing her thoughts on the menu. I had no problems with service and thought it was a great evening.Overall... Definitely a go to for KC in general, and if you leave near Westport, no excuse to not go."], ["Lewis Marklin M.", "OK, and less you were on a Hollywood supermodel diet and you come here for the first time the rest of the menu is moot there is only one thing you should be looking at and that is a pot pie, period! Everything is good but this is what they specialize in so eat one and caution to the wind they are freaking Hot so don't do it I didn't burn the hell out of The roof of your mouth like a Putz!"], ["Daniel K.", "Went to Potpie and didn't even get a potpie!  Drinks were reasonable and service was smooth.  You need reservations if you want to eat here.  Unless you're lucky enough to snag a seat at the bar.The mussels were some of the best in KC.  Lamb shank was soft and tender. Chicken was sooo moist and tasty.Edit... Went back for the potpie...  I loved everything but their potpies!  LOL.  Still one of Westports finest!"], ["Hillary S.", "Just dined here this evening for the first time.  Although we didn't make a reservation, my husband and I were fortunate to snag the last open table - a high table in the window of the bar area.  I really loved the ambience set by Pot Pie with the dark brickwork and decor, supplemented by candles and dimmed lights.  Their ceiling is very cool, as well.My husband and I ordered a Tulip cocktail, which was quite good, if a little too sweet.  And then for food we got a chicken pot pie ($12) and the scallops ($22).  The reviews (and the restaurant itself) aren't kidding when they say the food takes a while to come out...I'd say we waited a solid 45 minutes if not longer.  Fortunately we weren't totally starving.  Onto the food.  The pot pies are quite large!  I would say about 8 inches across and two inches high.  The crust is only found on the top of the pie, which I think is kinda nice (less carbs hehe).  That being said, the crust is flaky and delicious. The filling is pretty traditional and didn't blow me away with flavour or anything - standard creamy broth with carrots, peas, corn, and chicken.  The scallops were good, but you only get three of them, plus a small portion of (tasty) fennel risotto and a few asparagus spears for $22...definitely overpriced in my mind.  It was good, but I don't know who could eat that and feel full.The crown jewel of the night, though, was the chocolate chip bread pudding, which is served in a hot ramekin with a little pitcher of creme anglaise.  Absolutely decadent and delicious.  The bread pudding is made with challah and croissants from Le Monde bakery in North Kansas City.  I would go back just for this gem.All in all, an ok meal.  Not terrible by any means, but not phenomenal either.  I would like to try this place again sometime, though.  The service was good, I liked the atmosphere (nice place for a date), and the food was above par.  Parking can be a pain, though, so I recommend trying to find a spot on a side street and walking over."], ["Joseph P.", "I am usually the kind of guy that is extremely gung-ho about watching my carb intake in order to stay in shape for bboying. However, this place just wants me to instantly throw out my personal principle outside the window and just satiate the black hole that is my stomach.The atmosphere for this restaurant may appear rather uptight, and may appear to have some kind of dress code. But rest assured that it is totally casual, just for some reason people likes to dress up coming to this place.How they manage to stuff so much into this tiny pie is beyond me. But everything is just so perfect. The ingredients that were used seems to be in decent quality, the seasoning was not too overpowering the natural sweetness of the materials, the pot crust was crispy on the outside until you break it and soak it into the pie juice. Everything is literally just party in my mouth.Some of my friends got some non-potpie entree, and was extremely pleased with them as well. Not only were there ample amount of food on the plate, but everything was well prepared in a timely fashion. We also ordered a few drinks to accompany our meals. I have to say, the drinks are not bad at all. Though some may be a bit strong for our lady friends, but if you are looking at whiskey/bourbon based drinks, then man they are definitely on point! Will definitely come back."], ["Daniel H.", "Potpie was located next in between Gamestop and Bluestem.  Parking was street parking so carpool would be recommended.  The restaurant was pretty busy around 7:30pm on a Saturday.  We made reservations for 7:30pm and still waited a few minutes for our table to get set up.  The restaurant was pretty small and there was a bar too.  There was a chalkboard on the wall where the menu was written on.  It was large enough for you to see it from the tables at the window.I ordered the Spinach + Brie Tart ($7), the Beef and Mushroom Potpie ($12), and the Chocolate Chip Bread Pudding for dessert.  I did see the Pan-Roasted Chicken ($15) but decided for the potpie.  Our waitress said that the Pan-Roasted Chicken was their most popular item on the menu and would be better than either of the potpies.  She was pretty nice as well.The Spinach + Brie Tart was good and I'd recommend it to anybody who loves spinach because there were a lot of it.  The Beef and Mushroom Potpie came out soon after and it was large.  It was pretty hot (temperature-wise) so I took pictures to cool it down.  The beef inside was delicious and it reminded me of something I would find in beef stew.  I tried a piece of the Pan-Roasted Chicken and that was definitely very very good.  I would also recommend that if you don't want potpie.  You can't go wrong with either choice.Finally, the Chocolate Chip Bread Pudding came out last.  I forgot what the sauce was called but when I added it to the Chocolate Chip Bread Pudding, it tasted awesome to me.  Sure, it might be a little sweet for some but it was pretty good.  I tried part of the other dessert which was Donut Holes.  It was dry and definitely needed the mousse that came with it. Potpie was great and it would be my go-to place for some potpie. Come check this place out!"]], "Grand Street Cafe": [], "Republica": [], "El Salvadoreño": [], "The Rieger Hotel Grill & Exchange": []}