{"Friends Sushi & Bento Place": [], "Masabi": [], "Moonlight Sushi Bar & Grill": [["Cathy C.", "Who'd thought I'd be saying \"Yay, I'm a fan\" of any sushi place? Still can't do the raw fish thing, but I'm learning. The California roll is good, the Spanish roll is even better, and today's special New Moon roll (smoked salmon, crab, cream cheese, jalapeño slice) took me from tolerating somebody else's choice of cuisine to actual enjoyment. I always thought sushi was expensive for what you get, but after a 2-roll & soup lunch special and splitting the New Moon with Yelper Daughter, I was stuffed (can't tell you how much it was, because YD has at last reached the age where she's picking up some lunch tabs)!The restaurant is clean and bright, our server was nice, and if it took a little while for the food to arrive, it was beautifully presented and worth waiting for. And the background music-remember Super Q104, anybody? Fabulous!"], ["Amy A.", "I came very hungry on a Tuesday night at 6:45. It was the only sushi place I found in the area and since the reviews were mixed, I thought I'd try my luck. I ordered miso soup, a California roll and 4 pieces of salmon. Nothing crazy since I haven't eaten here before. I posted a photo. The wasabi was brownish and hard, not fresh at all. The California roll was ok, but the salmon had a weird shine like it was not fresh. It tasted good, but still a little worried. The miso soup tasted not right as well like something was not fresh. The service was marginal. I was going to try the green tea ice cream and the waitress just brought me the bill. I decided not to bother. I would not recommend. Also, no alternative to soy sauce for those of us with wheat allergies."], ["Laura B.", "Worst experience ever. Do not go here! Literally had dirt in my food. The vegetables weren't washed. When I showed the server she said she would handle it. Her handling it was taking $5 off my meal. So I ate dirt, and she took off $5. The chef would not come out to speak to me, and no manager on site. Disgusted."], ["Mike M.", "Average sushi and service."], ["David W.", "Good sushi in Liberty, clean up to date restaurant, very good menu, The service is ok but servers just about everywhere are not as good as they used to be. THIS SUSHI RESTAURANT has a very fresh feel and in 4 visits all my meals were fresh and tastedvery good. I will be back many more times"], ["Courtney L.", "I really really enjoyed the sushi here, but that may have also been because I had to shovel it into my mouth.The service here is so very slow. It took forever to get menus, to get water, to order, and forever and a half for the food to come out. The waitress was incredibly inattentive for us being one of 3 tables occupied and from our seats we could see the sushi chefs. It looked like they were literally in slow motion. This wouldn't be a problem as much during dinner, but we were here for lunch. We had work we needed to get back to and it took an hour and 30 minutes, not to mention travel time.But despite all that, I'm still giving 3 stars. I loved the sushi here and I loved the prices. During lunch hours they have a special with 2 FULL-sized rolls and soup for $9.99. I ordered the Mango Tuna (regularly $9.50) and the Computer Roll (reg. $9.50). And yes, they were full-sized! I really enjoyed both rolls and was really really happy with the price. You can't beat that!! Sushi is even more expensive at Price Chopper! A co-worker also ordered the Sashimi Salad... which was spicy and basically just chopped raw fish piled together with dressing. SO good. Spicy, but really good. That was $12.95 (not on lunch special). I will definitely return here for lunch, but only on a day that my boss isn't in the office."], ["Tyra W.", "Please note this review only reflects their service and restaurant hygiene because I did not stick around for the food. It was a \"seat yourself\" Saturday. After gazing around the place we noticed (I kid you not) EVERY table was dirty in the restaurant except for one where a family was eating. Food, crumpled napkins, and silverware was strung about across tabletops. Upon becoming increasingly hesitant, we forced ourselves to sit at the bar (which was half dirty as well). We received no service after being acknowledged and 15 mins later of sitting, a guy finally came over with menus and it took another 10 mins for water. The cook looked like he wanted to jump thru the windows. He literally just stood staring mindlessly out the window completely motionless. As far as cleanliness, I really don't understand how you can be THAT lazy to not clean a single table or two here and there when you have no business and clearly you are FAR from busy! Needless to say, this place was screaming why it was empty during prime dining hours on the weekend."], ["Greg S.", "Love this place! Their sushi is pretty good quality, and it's competitively priced. Service has been good every time I have been there (sometimes a bit slow but not bad). I really wish they would do a half price sushi happy hour. I would come in everyday if they had that! Also, the restaurant has always been clean when I've gone in.Start a 1/2 price sushi happy hour and I'd be there much more frequently!"], ["Maria T.", "Methinks not is right!!! Moonlight earned the not so honorable 1 star review, and my first 1 star! So congrats Moonlight, I finally gave a restaurant 1 star, unfortunately you guys were it. Please note the 1 star is purely on the sushi/food (I apologize in advance for those who are Moonlight fans but this review could get ugly and feelings may get hurt, reader discretion is advise!!). Decided to order takeout as it was closer to my house than my usual sushi joint Wasabi, and it was easier to call in as they had the menu online. I like to consider myself as a sushi snob, I've worked at a sushi restaurant for 2 years so I know a thing or 2 about it. When I thought I'd seen it all as far as sushi goes, never did I thought I was going to get F grade sushi. Moonlight exceeded that expectation for me. I've dined at many sushi locations in the KC area as well as throughout the country and this place was horrible.Ordered the Monkey Roll (salmon, avocado, cream cheese deep fried), salmon sashimi (2pcs), spicy salmon and a spicy crab salad. Can I just say heart attack with the Monkey Roll? Cream cheese overload! There were more cream cheese in that one roll than the salmon itself. The spicy salmon roll....not spicy nor did it taste fresh at all. I gagged each time I ate a piece. Salmon sashimi....I could have bought grade C sushi at the grocery store and it'd still be fresher than that. The color was off, texture was more slimy and mushy than it should have been. I normally finish my sushi but this time could only finish half. Had to build the stomach strength to get through as much as I could since I did not want to waste $30 worth of sushi. Spicy crab salad was a joke. I use to work at a sushi restaurant that serves it...I know my spicy crab salad, this was not it. It was dry, lacked in flavor, way too much tempura, the seaweed had a funky taste to it and the imitation crab meat was beyond dry. Disappointment at it's best. This tainted my sushi crave unfortunately. They fooled me with the pretty presentation, shame on them.I will say the service was decent, they were nice and friendly also even got low sodium soy sauce. Too bad it wasn't enough to at least bump up to a 2 star in my book. I will not cheat on Wasabi again with this sushi wannabe restaurant! That extra 5min drive is more worth it than this place!"], ["April M.", "Always great service and while I'm not a huge sushi eater, they have a great selection to appeal to all tastes."], ["G G.", "Good fresh food prepared with customer oriented people. Great for the northland. Unlike a lees summit restaurant version of sushi, this is very good and can recommend."], ["Faith B.", "Yummy sushi, but you will rack up a big bill. BIG. FAST.Tasty crab salad and the calamari got raves.BF got a teriyaki dish and said it was just average. He took most of it home and then didn't bother eating the leftovers.The service was friendly and warm.I far prefer Fuji in Liberty though. The prices are less frightening and the sushi is just as good, if not better."], ["Elizabeth D.", "This place is great local SUSHI at it's best. LOVE the Moonlight Roll and will be back for sure."], ["Tania M.", "Just an \"OK\" sushi place.  We had issues finding seating because nothing was clean and at first we were sat at a tabled that wobbled like crazy, but moved ourselves very quickly.  I ordered a Blue Hawaiian alcoholic drink (something like that) and the drink was heavily, heavily watered down, so if you get drinks here, expect to get two or three.  I just wanted to try it, so I didn't get more than one.  The Moonlight Roll was very good, but the Spicy Tuna Roll was not spicy and barely tuna.  We ordered a couple more rolls that had shrimp in them, and the outer shell of the shrimp was still on, which made it difficult to eat.  Personally, I don't like eating the crispy part of shrimp, so we had to attempt to get the shell off ourselves, and the rolls almost fell apart in the process.  Miso soup was okay but nothing spectacular either, and the rolls were very loosely rolled and kept falling apart.  We were only here because there was no room to eat at Seva (Indian restaurant next door) but probably won't stop in again as we have a much nicer sushi place (Mr. Le's Sushi) that is not far away from us."], ["Harry P.", "Sushi in the Midwest.... I've gotta admit, it ain't half bad. The Misses and I have been here a few times now and while we can't get the variety of rolls we would in other cities we've lived, you can't beat the price. The food is fresh, the restaurant is clean, and while the service can be a bit slow, the food more than makes up for it."], ["Shawn V.", "I've always found this to be a very consistent Sushi restaurant in the Northland. It is not my favorite in Kansas City, but it certainly beats a 45 minute drive. The owners are very nice and always seem to do nice things for regulars.The wait staff I have always found to be very courteous and attentive.As with most Sushi restaurants, Tuesdays and Fridays are when the receive their fish shipments. Stay close to these days for your freshest fare!"], ["Sarah M.", "Let me start by saying that this place has been a long-time favorite of mine. The rolls are delicious. I have never been too impressed with the decor or the music, but that's not why I come here. The last few times I've been here, it seems dirtier and dirtier. I am here now, and as I look around, I am mildly disgusted. There is a layer of dust on the potted silk plants sitting right above my table. The windows need a cleaning badly. Our table was sticky and we had to ask the server to clean it. There are crumbs all over the floor and surrounding \"clean\" tables. This place has delicious food. But...I'm sad to say that this may be my last visit. When you are spending big bucks for the food, you expect cleanliness at the very least. It's a shame. I'm pretending it's only the dining room that is filthy, and not the kitchen."], ["Tricia H.", "I live near Moonlight so it's one of our go to sushi places. The prices are a little high but it's very fresh fish and very good. There are so many good rolls to choose from but you definitely should try the specials on the board :-) Make sure you try the crab salad it is sooooo yummy!! I tend to stay away from the tempura rolls a little too saucy, if you do like saucy ask for a side of the Margarita sauce my daughter loves it....get out of your normal habit and try some of the fresh fish you won't be disappointed, I didn't realize how awesome fresh scallops are!! Oh and save some room for the green tea ice cream it is so refreshing Love it!!!"], ["Susan N.", "I was in the area and ended up here based on past reviews saying the sushi was very fresh. I opted for the lunch special of two rolls (dynamite and spicy tuna) and a miso soup. Plus I ordered nigri salmon - my bar for fresh sushi.First off, service was awesome. I initially didn't think it would be but the waiters that worked there were really nice and on top of their game. The miso soup came out and it was fine. A few minutes later my sushi order came out.I don't know. Fresh? Maybe other reviewers meant KC suburban fresh? Or maybe it's just gone downhill since they've opened. Either way, I didn't feel like the sushi I ate was any fresher than most other places I've been to in the metro area, which is to say, not terribly fresh at all.The tuna didn't taste like anything in particular but I did like that it was actually mildly spicy. Sometimes it's just not. The only flavor I got was a spicy mayo with random fish flavor. The dynamite really disappointed. It tasted so similar to the spicy roll, despite having several types of fish in it. If I were blindfolded, I would have never known what fish I was eating.By no means was this place's fish funky or even nasty smelling; it's just not super fresh. Average by KC standards. If this place was on the coast, it may have warranted two stars at most. The service was great but not enough to warrant me going back."], ["Noel P.", "The monkey roll not only looked amazing when it came out but there was so much I had enough to take home.Their original dressing is my favorite and I love how it tastes I could eat lots of it. Also their dumplings were the bomb and it was enough to fill me up before my sushi ever came out. I will more than likely come here again!!"]], "Bob Wasabi Kitchen": [["Katie G.", "The staff are warm and inviting. Wonderful example of quality customer service you don't see anywhere anymore!! The sushi seemed fresh and was very good. My husband and I happened upon this place as we were in town for a getaway weekend and my husband enjoys sushi, this was a wonderful local gem, worth the short trip from the Plaza district (5 mins or so), you won't be disappointed! Once they get their liquor license they'll be even more attractive. Great local spot!"]], "Saki Asian restaurant": [], "Domo Japanese Bar & Grill": [["Stephen D.", "Very good food and service. We had one of the specialty sushi rolls and the sampler. The specialty rolls are a great value for the price. Decent drink list as well. The restaurant was very clean and welcoming. The only thing I would change is perhaps make the surroundings look slightly more upscale and intimate to match the terrific food. Overall, I would highly recommend."], ["Andrew K.", "Chai Shai was closed for a holiday this past summer, so I checked to see what was open in the area that wouldn't be observing Eid-al-Fitr. Which is pretty much everywhere, but my coworker opted for Japanese.I took a Yelper's suggestion to try the gyoza, and have to say, not impressed. I like gyoza and similar dumplings quite a lot. The richness and depth of the umami taste when done well is amazing. Or it can be soggy and bland.Didn't try their sushi. The miso soup was fine. Overall, pricier than it should be.This could be a great little lunch spot, but after this visit I don't see a reason to come back.[This review is from July (just delayed in posting the draft) - hopefully in the past few months they've been able to improve.]"], ["Kyla B.", "Rice tastes worse than uncle ben's. But it's only $2.00Service was fair.Miso soup was great! Only $2Lunch specials were all more than $10. Extra sauce cost money. Many vegetarian options!"], ["Cindy M.", "My daughter and I ate dinner here on November 7th with my Kansas City family.  I am so glad my KC fam took us here.  The Sushi was all good and our waitress, Aiko, was so sweet, kind, helpful (she even played photographer by taking a group photo of us all) and fantastic!  I really enjoyed my evening!  Thank you!"], ["Jen D.", "On an unseasonable warm, delightful October afternoon, a friend and I ended up on the patio of Domo for lunch. I enjoyed some sort of cocktail with an umbrella and immediately felt like I was on vacation. I ordered the two ball one strike which is two avocado halves filled with spicy tuna and covered in a spicy mayo sauce. While I would have preferred a less mayo forward sauce, this was awesome. I will go back there just for that. Sooo good!  I also ordered a spicy tuna roll (a theme is developing, yes?) and it was also great. Near the end of our lunch, our dining space was invaded by honeybees. I don't mind sharing, but it was kind of crazy there for a minute, with bees swarming all around us. No big deal, and I will definitely be back."], ["Wes M.", "My wife and I eat sushi almost weekly and we usually like trying new places every time but the sushi here is the best we've ever had! We took some friends who also eat a lot of sushi and they agreed. This immediately became our new favorite pace in town. The atmosphere is good and the plating is nice but the most important part, the good is absolutely amazing!"], ["Todd H.", "Very good and always consistent! This little sushi place is one of my favorites. The ambiance is nice and the service is always good. The sushi is always fresh and delisious! I love their Miso soup which is only $2.00. If you want some tasty sushi in a cute local area go to Domo."], ["John W.", "Awesome sushi!  The grilled calamari is excellent!  I highly recommend the Spicy Tuna roll."], ["Chris M.", "After a recent Friday night visit I can honestly say I'm in no hurry to return to Domo. Disclaimer: I did not have sushi, which is obviously a major component of a Japanese restaurant, so I cannot speak to its quality or value.Our group of 4 arrived during a busy Friday night, but were immediately seated at a table in the middle of the restaurant, which is cozy with themed decor. The ambiance is appropriate, but not luxurious. Things were going well until the extremely long wait for our food. Even accounting for the fact that it was a full house it took what seemed to be an eternity for our food to come out of the tiny kitchen. Furthermore, the plates that were ready first were set in the service area, not under a heat source. This means that if your dish happens to be the first to be plated it will likely sit and get cold until the remainder of the tables dishes are prepared. Once we did receive our food is was average at best. The Shrimp Tempura Bowl had literally 2 pieces of shrimp. C'mon man. And the Udon noodles were a little chewy. The Domo Bowl was tasty, my only complaint is that the beef was stringy. Long story short, it took forever to receive mediocre food. Nothing else about Domo makes me feel compelled to give it another shot."], ["Jerice A.", "Love the seafood here. Sushi chefs are Japanese which is always a plus. Service is a little slow but super friendly! Love their crab salad and their shrimp tempura roll."], ["Cass B.", "Should have never given it a second try. First visit the restaurant had one other table on a Sunday evening and it took over 30 minutes to be served some of the worst sushi I've ever eaten in my life. It was a mushy mess. Not even refills on drinks. Second visit decided I wouldn't try the sushi. Wasn't my choice to come back. Ordered Garlic Shrimp. Based on the description I was hoping for a tastebud delight. Instead I received a bunch of breaded shrimp covered in honey and sesame seeds. Not a trace of  garlic. The owner refused to do anything to compensate or trade out the disgustingly sweet, unhealthy dish. He insisted his business is not in the business of doing \"samples!\" What in the hell? The gummy shrimp was an entirely misleading menu item. He refused to change the dish or take it off the bill. I will never lower my standards again. Not coming back to this substandard establishment. I wish I could give it negative stars."], ["Samantha A.", "4-stars for food. 2-stars for atmosphere. The restaurant has a weird smell & the decor/seating/cleanliness could use improvement. But, the sushi is the best that I've had so far in KC."], ["Scott T.", "A mostly pleasant dining spot with interesting but somewhat inconsistent food and service which seems to be bit of a consensus among reviewers.We arrived as a party of three with a 6:30 reservation. I let my daughter and wife out and sought out parking as the area was packed on a Friday night and the weather  cold. When I arrived 3-5 minutes later they were seated, each with a water glass in front of them, but mine missing. First clue of the evening. Whoever seated us didn't communicate the party size to the server. In fact, throughout the night I failed to see anyone I could identify as in charge of wait staff. However, at the moment it wasn't (and isn't) a big deal.Took a few minutes for the server to get by to ask for our drink orders but they were promptly delivered. We ordered appetizers, shrimp gyoza and ginger chicken. Miso soup was brought to the table as part of our dinner order and my wife and I agreed, one of the best bowls in recent memory. Truly outstanding. The ginger chicken followed with a dipping sauce. Where's the ginger taste? Lacked seasoning and looked like a plate of chicken nuggets with one small piece of parsley as garnish. Whole meat, not ground (parts) and breaded. Near the end I found a lone chunk of ginger that made it into the batter by itself. Sadly, the best part of the dish. I really don't understand the point of this selection and it clearly didn't hit the mark. Disappointing after such a spectacular bowl of miso.A sushi/sashimi boat with an extra side order of spicy octopus nigiri (always a favorite) was ordered as the entree for all to split. It arrived fairly prompt maybe 15 minutes later but we inquired what had happened to the shrimp gyoza? \"It's on its way,\" we were told. It arrived after completion of the meal. Presentation was beautiful, the rice and fish were all delicious, no complaints. Spicy octopus is typically mixed with remnants of tempura batter and then mixed with a spicy sauce (typically sriracha based). The texture, the octopus and the heat make a great combination. This was simply bits of the animal with a bit of sauce, but little kick. Another disappointment. We were wondering about the gyoza and they did finally arrive. We were ready to be let down. Gyoza in most restaurants are simply out of the bag and heated up. Still like them but why not fresh? Well, these were fresh and they were spectacular. But why deliver at the end of the meal with no apology or acknowledgement. Strange.Domo has a management problem to my eye. Our family has eaten a hell of a lot of sushi as a trio and there was a visible lack of cohesion in the front and back of the house on this Friday night. Our server was very pleasant but was clearly covering too many tables by herself and was visibly stressed.This could be a great space but needs updating. It's crowded, noisy and the tables are arranged to maximize seating, not serve the customer's comfort. Although we had a enjoyable meal we were perplexed by the experience. It's not a bad place to dine but there are 2-3 sushi venues in Lawrence far better vs. driving 45 minutes for this."], ["Brandon M.", "Disappointed. Frequent here often but the fish quality is seeming to slip. The sushi was warm today and smelled fishy. The rice was tasteless and rolls were not worth ordering...despite knowing our dissatisfaction, nothing was done about it. $50 down the drain. Won't be back for a while...hopefully they turn things around."], ["Shantel M.", "Oh man, I REALLY REALLY wanted to like this place-- and it isn't of me to rate a restaurant 1 star. Since my husband has moved to Kansas City, we have been on a hunt for a sushi restaurant, but alas, I am feeling like it is a great white buffalo-- a mythical creature that doesn't exist in KC. And, believe me, I am not some West Coast snob that doesn't believe sushi exists outside of the coasts-- I have indeed had GREAT sushi in the Midwest-- unfortunately it is not at DOMO. Here is out experience:1. My husband's meal arrived 30 minutes prior to my sushi rolls. 2. Fish was bland/ tasteless. Canned fish taste better than this. 3. Service is horrible and takes FOREVER. 4. Cuts of fish in the cherashi are uneven. I got two slices of really bad salmon, three pieces of tuna, and one piece of some type of tuna...seriously... this is worst than sushi apprentices. 5. Place wasn't even crowded, and yet the waitress and service was super rude. IDK... maybe it was an off day, but I know I will never go here again. For $50, I would rather spend it towards an airplane ticket to Chicago to get some decent sushi."], ["Gabriel R.", "Food is perfect. Staff is friendly and genuine and fast. Place is setup pretty and with a flow. Price is what it should be. Area has parking. Other establishments within meandering range. Drinks are made well. Happy tummyyyyyyy! Found a new favorite. Get this place some more stars."], ["Jake C.", "This place.This.Place.Domo hits all of my happy spots. Full disclosure, this review is probably biased since Domo reminds me so much of my favorite Japanese place back in FL. Everything from the duo behind the counter to the menu was a throwback. Anyway, onward!You can expect the standard sushi fare, with reasonable prices. The miso soup I had was great, rice was fresh and hot. Service was friendly and attentive, even though they seemed pretty slammed.The big thing that caught me here was the menu for cooked foods. With stuff like Oyako-don (Chicken with sweet egg and onion over rice) on there, this is comfort food all the way. Overall, my meal didn't break the bank and I left fat and happy. I'll definitely be back."], ["Neal G.", "Great sushi, fantastic seaweed salad. It's a bit more expensive than other equally great sushi around, but the atmosphere is well improved over those places."], ["Courtney M.", "Love this place. We go a little early if on a weekend. They get busy and always seem short staffed. But the sushi is good, drinks are good and the atmosphere is good."], ["Tricia C.", "This is our neighborhood sushi place, and we patronize it often.We came in before 6 p.m. last night, and were we glad we did!  They got busy within half an hour after we sat down.It was obvious they were training a new staff member, and I noticed a couple of other new faces.We ordered one of our favorites, the Chirashi (sashimi boat, chef's pick).  We decided to pair it with miso soup instead of the salad option.  Our soup came quickly, as well as my octopus and seaweed salad.  A great starter: refreshing and not overdressed.The sashimi boat was delightful, as always.  I noticed that they lined half it with sushi rice, and the rest with rice noodles.  Service was attentive, and it was good to know that you can call ahead to reserve seating, especially if you have a larger party ( more than 4, since accommodating it would require putting tables together)."], ["David A.", "Sexy? No. Amazing? No. Nice presentation? YES!OK, so you're treated well here. I sat at the Sushi bar. Chatted with the sushi chef, who didn't speak english tremendously well. I think he was from a country down south. I asked him what things were and he told me what was in them with a smile on his face and made small talk.His sous chefs were Japanese women dressed up in traditional garb. It was a cute restaurant. The plum wine was amazing.However, what I came for was the sushi. What it looked like and tasted like were different. The sushi was a bit lacking in taste and texture. Highly disappointing, especially after reading these reviews.Perhaps it's in comparison as I haven't found good sushi yet in the 3 places I've sampled it in KCMO. Isn't all fish frozen and flown in these days anyway? Being away from the ocean shouldn't deter good sushi."], ["John D.", "They always have great food, decent prices and friendly staff!Great for a quickie lunch!"], ["Angela W.", "My friend and I went here for dinner. Apparently if you arrive early they have happy hour. We shared 3 rolls and miso soup for $24!!! We had a hot roll that was awesome, a California roll which was good and a yam roll which was awesome!!! Anyway, since my boyfriend probably won't want to go hang out in Waldo I will probably go back with my girlfriends."], ["Nadia P.", "I didn't think we had great sushi in KC till I came here the first time five or six years ago...it's been a staple for me ever since. At times the sushi bar can be a little slow, but good food takes time. And it's *always* worth the wait. Furthermore, I can say that their plates from the kitchen are always delicious and provide a great alternative if you have anyone in your party who wrinkles their midwestern nose at the idea of sushi--even my dad (aka the least adventurous eater EVER) is a sucker for their succulent teriyaki chicken.  Finally, the icing on the cake--they have low staff turnover so the same friendly faces have greeted me (and guessed my order upon arrival) for years, making this feel like the neighborhood gem that it is! We love Domo!"], ["Jessi H.", "OMG, we love DOMO!!!we eat here at least twice a week. in fact, they know us. because we are there so often.we've tried almost every sushi place in kansas city. this is as good as it gets.get the big O roll.get the Philadelphia roll (made with real salmon, not smoked.)get the kama roll.the wine list is really nice, too.yum, yum.there is one waiter that is questionable, but he tries.so give him patience."], ["Dustin m.", "Food was pretty good, definitely over-priced in my opinion.  For the happy hour it was $4.00 for four pieces of tempura fried vegetables.  Environment is beautiful with real plants and the view outside is great.  Locally owned and operated. My friends got a seafood soup dish that was $13.  It was pretty good.  We were sitting by a window at the front of the restaurant and the TV was blasting with CNN and commercials so I asked if they could turn down the TV and she said (and I paraphrase), Yes but if someone wanted to watch TV they'd have to turn it up.  I guess TV watching supersedes non-TV watching when you are out to dinner on a Thursday night at their establishment.  Not the most friendly of waitresses either, in my opinion.  This would not be my first choice for sushi (Sushi Gin on 95th and Nall for the price is my favorite).  But, if you are in the Brookside location and want something other than bar food this could be an option for you. Overall, not blown away by anything (beautiful restaurant though)."], ["Heather K.", "Good food. I tried a beef noodle soup, spring rolls, the spider roll and another roll with softshell crab. My date doesn't like anything with tuna or salmon, and I don't like eel (eel sauce can be good) so that severely limits my sushi choices. Yep, good food, but an ultimately forgettable experience. The waiter was fine; precise and a bit inanimate. Everything neat, tidy, and fabricated."], ["Ken B.", "I really like Domo.  The food is always so good.  The most amazing item to order is the \"tempura yam roll\"!  A M A Z Ing!  I'm also I sucker for miso soup and they of course have that too.  I love the atmosphere and the decor.  It's really nicely done and very peaceful.  The only downside to Domo is the service.  The service itself is good, but just not very quick.  Make sure you have sometime to sit and relax because you will be frustrated if you need to get out of there quickly.  Go and try some great food in a great space when you have time to relax and catch up with a loved one."], ["Seve B.", "Great foodGreat pricesVery nice people"], ["Stephanie G.", "Best sushi place in KC. Period. I have tried many and none even come close to Domo. I am a vegetarian, however, I do occasionally live a little and sushi is at the top of my list when I do. This place tests my willpower! The ambiance inside is intimate, trendy and classy all at the same time. The outdoor patio is fantastic as well. The service is top notch and if you are a regular they will remember your order. I recently found this during the Brookside Art Fair and I cannot wait to go back!"], ["Ange T.", "Love this place. I have been several times. Great lunch menu with unique rice, noodle, and soup items. Each dish I've tried has traditional Asian flare with a twist of something unique. Staff is great and service is always good.I have actually been craving a rice bowl for some time now. Need to get back. Dinner menu is not the same and I was a bit let down not to see any items repeated from lunch to dinner. Sushi is fine but not my favorite there. Go and try some of their dishes. Worth the try!"], ["Elaine D.", "I like this place and they have Wasabi Tobiko on the menu, which you can't find everywhere.  I always have the sushi and on the last outing also tried the dumpling appetizers."], ["Jay W.", "I loved the atmosphere and service at this place. The food was a bit pricy, but worth it for the occasional treat. Sushi was as fresh as possible in the midwest, and they've got a great variety to choose from."], ["Alison M.", "Lunch time, dinner time, take-out time, Domo will make you haaaaapppyyyyy.If you've read my reviews before, you know that I spent a few years living in Japan and I am rather finicky about my sushi. While Domo does cater to American tastes, they also have some great authentic dishes and sushi. The fish is of a high quality and the flavor palette is right on. They serve up some excellent tempura, and while I was slightly disappointed to see them serve their tendon (tempura and noodle bowl) American style (tempura on the side, not in the soup), it was easy enough for me to remedy the situation myself. On other occasions I've tried the Las Vegas roll, Domo roll, spicy tuna roll, sake nigiri and enjoyed their perfectly prepared unagi. I've yet to encounter anything I don't like, and I'm super excited to see that they have okonomiyaki on the menu, which is incredibly difficult to find in the US. The one negative is that they don't have matcha salt- the true litmus test of a sushi restaurant.The atmosphere is sweet and very Brookside, and the staff is helpful and friendly. Definitely a KC favorite."], ["Alee H.", "I placed a take-out order and literally just got home with it, opened it up and am disgusted. When I called to place my order of an order of teriyaki chicken and one Las Vegas roll, the lady said it would be a 30 minute wait because the sushi roll would take 30 minutes to make.. okay, that's fine. Anyways, I arrive home after picking up my food, starving, open up my food and immediately lost my appetite. First of all, the sushi looked like it took 5 minutes to make, not 30 minutes and had a horrible smell to it. I ate one piece and then decided I shouldn't eat anymore so I wouldn't be hugging my toilet all night. Moving on to the teriyaki chicken.. I open it up and it's cold, and there are huge chunks of dark meat chicken that is cut up with huge slices of peppers on them..okay, I give it a try.. The \"chicken\" has the weirdest texture, has zero flavor and is slimy, I can't do it. I'm super bummed that not only did I spend $30 on what I thought was going to be a delicious meal, but also on the quality of the food. Domo, I'm not into it. Considering my apartment has zero food in it.. looks like it's popcorn for dinner! Thanks Domo."], ["Jeff P.", "4 1/2 stars.  Wow!  Very impressed.  Great edamame.  Great veggie tempura.  Tasty miso.  Fresh nigiri.  Very tasty yoshi bowl.  Tasty green tea.  Excellent service.  Calming, traditional place."], ["Matt D.", "After just moving down to KC from Minneapolis, I wondered if I could find good sushi in town in another land locked state. Domo is very, very good. The fish has been very fresh on both visits, the less traditional cooked rolls can also satisfy the individual who says they love sushi but never eat anything raw. Service is excellent and prices are amazingly reasonable."], ["Tory T.", "Really loved my experience here. Excellent miso soup, seaweed salad and rolls. Try the Domo roll and tempura yam roll . Will recommend and go back! Sat in a quiet corner booth. Great atmosphere and service."], ["Anna B.", "THE BEST SUSHI IN KC...and I've searched far and wide.  The fish is fresh.  The rolls are inventive.  The wasabi is the real.  The staff is friendly.  The environment is relaxed.  The prices are resonable.  Do I have you convinced?"], ["Kirun M.", "We were craving sushi and decided to try Domo because it's so conveniently located.  Despite it being a full house we were seated right away and got good service throughout the meal.  I wasn't blown away by anything I ate here but I was satisfied with the selection of rolls and quality of the sushi.  I was happy that they had Asahi which is my favorite Japanese beer."]], "Kokoro Maki House": [], "Sakae Sushi": [], "Sushi Haru": [["Courtney L.", "Obsessed.My co-worker has been talking about Sushi Haru for years and I FINALLY got the chance to try it for lunch. Sushi Haru has a selection that rivals anyplace I have ever been before. I promise you they still have your lame-o California Roll or maybe, the Spider Roll, if you think yourself all that, but Sushi Haru has dozens upon dozens of awesome, custom rolls that I haven't seen elsewhere. It makes the trip south (practically to Arkansas) worth it!I ended up ordering the udon, Beiber roll, and Mount Fuji. I know, I know.. the Beiber Roll, but with pineapple, mango, tuna and a white cream sauce it was just as fruity as the real Justin. And it was so good. I've never had a roll with the white sauce before and I have no idea what it is, but I'd absolutely get it again. Mount Fuji was also just too epic to pass up. It is a mound of rice covered in sauce and spices and then topped with spicy crab meat which is topped with tuna. Thank heavens I was using chopsticks because they forced me to eat this monster at a reasonable pace.. instead of inhaling it like I wanted to. The udon was great as well (though admittedly nothing too special). I can't wait to return here with my husband.. the menu is large and it took me about 15 minutes of decided between 30 different things before making my choices. The prices are a little higher than other strip-mall places I've been to lately ($9+ a roll), but the quality is all there. Great selection, creative and talented sushi chefs, and a clean, comfortable environment. They also do custom work based on what you are craving, just ask! Sushi perfection!"], ["Dan D.", "Tried Sushi Haru again one year later. TERRIBLE experience. Actually, we even left without eating.Again, this place is still expensive, so we tried to find an affordable lunch, only to find out how inflexible and intractable they were.Lunch with \"nigiri sushi\" - ok, which items? \"Chef's choice!\" Ok, I get that, but it also comes with particular sashimi - will this be the same items or different? \"Chef's choice!\" Ok, I DO get that, but just tell me what chef's choice IS, so I can decide if I want this meal. \"Oh, that's an UPCHARGE to say what you want.\" I'm not saying what I want, I just want to know what I will be served.Moving on - let's try 3 maki sushi rolls instead. Hmmm... hand rolls are the exact same price as the regular rolls? Can we get 1 or 2 of the rolls as hand rolls. \"NO! Maki rolls only - if you want hand rolls, you pay full price vs. lunch price!\"Ok. moving on. Waitress points at items - get this, or \"get that\". Strangely, the items she points out have the same issues as just discussed.I look across to the manager who is now staring at me. I get it - I'm supposed to accept what they want to serve, vs having a meal that I desire. I'm not obtuse - I get that some restaurants want control - but I've eaten sushi/sashimi for over 35 years - the POINT of a GOOD sushi restaurant is to create food and art that pleases ones senses - not what they want you to take.They don't try to please anyone here. Take it or leave it!We left - and had a GREAT meal at Ra Sushi, and yes, they were more than pleased to change their menu items to fit our desires."], ["Beth W.", "My fiance and I tried the U-Don Soup as a starter, we were both very impressed with the strength of the different flavors. For our rolls, we chose the White Dragon, Cherry Blossom and Samurai. All of which were excellent and plated very beautifully. The restaurant is quiet, warmly decorated and subtle. Our server was attentive, nice and did not bug us while we ate. We sat at the sushi bar, so it was nice to mingle with the chefs a bit. At the end, our sushi chef surprised us with a fried apple dessert. It was surprisingly packed with flavor yet light on the stomach, which was good because we were stuffed! So far Sushi Haru and Sushi House are my top 2 picks for overall quality :)"], ["Ann W.", "Sushi AND Korean food together under one roof? Yes, please!I have been visiting Sushi Haru for a number of years and I love this place. They have a bunch of fancy sushi rolls that are really good, but they also have great Korean food, too! Beef bulgogi? YUM! It's really fun to come here for dinner and share both sushi and Korean food. At lunchtime, they have some very large bento boxes to choose from that have options that include sushi, tempura, Korean food and some not-very-authentic Chinese food. The bento boxes are nicely priced and beautifully presented. Service is always fast and friendly. If I had one complaint about Sushi Haru, it would be that their hot tea sucks. Don't even bother with it."], ["Caroline L.", "Ok, so this review is very very very late - in fact I think this was the end of last year that I came here with my coworker.   I think part of the reason that I hesitated is because I'm not a huge fan of this place.  Alright...enough of my excuses...lets get to the actual review...My coworker and I developed a pretty strong craving for sushi at work back in December so we jumped on yelp and found Sushi Haru.  We decided \"what the hell, let's give it the shot\" and headed here for lunch.  The restaurant was completely empty save one other table of customers.  While we were seated quickly, everything else moved at a snails pace.  I have a feeling that we shouldn't have stayed given the how empty the place was...but we wanted sushi.   It took endless waiting for us to get our waters, our food and our check.  I don't understand when you have an empty restaurant and can't get your check to the table within 5 minutes...*sigh*So that was service...lets get to the food.  I can't even remember what I ordered...which actually is quite unusual as I usually remember what I ordered no matter the time until my review.  I do remember...soggy so I think I had a roll with some type of salad on top.  Honestly, food was ok, sushi was fresh but not excellent. Overall, an ok place but not somewhere I'm planning on returning to - especially given the distance from my house."], ["Erin W.", "Went to Sushi Haru again tonight and our experience was much better. Our waiter was awesome, I ordered straight off the menu  (Philly Roll and Cherry Blossom). The Cherry Blossom is like something I have never seen before. My significant other had three other rolls and all were amazing. We got there before 6:30, so two of our rolls were on the happy hour menu. It was so much better than the last time. Now I will come back much more often!"], ["Donna Y.", "Last week I met a colleague for lunch. The food was amazing and the wait staff was PERFECT. I ordered a spicy tuna roll and salad. The food was incredibly fresh and we'll prepared. My colleague ordered a California roll and also seemed very pleased. I am a sushi snob..this was excellent."], ["Anna H.", "I was here i think 3 times and the food is wonderful. Great service too. It is a bit expensive , i mean it is  a sushi:) You wont be disappointed though."], ["Derek N.", "Not a fancy place, but it does have outstanding sushi. We sat at the sushi bar and had a variety of roles, sashimi and nigiri. Really enjoyed the tuna nigiri! That had five different types of tuna available and they were delicious. We will be going back!"], ["Deana W.", "* Warning to all Vegetarians and Vegans : the comment asterisked  below may be offensive. Don't read it, skip around.I love sushi, but sometimes I like the \"not so good for me\" better than the \"good for me sushi!\"  I guess I'm just that kinda girl.  I just love Tempura shrimp, crab, cream cheese, avocado and anything spicy!  Give me that, and I am crazy happy. Add a large variety of rolls to the equation, and I will bring everyone I know!  The sushi is delicious and the staff attentive. The menu is full of succulent options for even those with the most discerning palates.   Classics and innovation, all at very reasonable prices. FYI - There's lots of good for you Sushi\" here too... if you're in to that sort of thing.    My dining companions and I sampled the Shrimp Gyoza, a very tender and delicate dumpling, steamed and then pan fried to juicy perfection.  We also devoured the cucumber and crab salad;  a lovely crunchy mixture of shredded faux crab and cucumbers in a Ponzu sauce. To round out our dining experience, we opted to share the Samurai roll, pyramid roll, and last but not least, the Love roll. The \"Pyramid \" roll: shrimp tempura, cream cheese, avocado, and crab meat, all deep fried, topped with crunch, Hamachi, and hot eel sauce. Yeah baby!The  \"Samurai\" roll: deep fried shrimp, scallop, salmon, crab meat, masago and green onion, topped with inari and sushi shrimp.  They roll all these goodies in foil and then they set that puppy on fire. *(Don't get too excited.  Merely a euphemism. No animals were harmed in the making of this roll...except the aforementioned shrimp, scallop, etc.  And yes they were butchered solely for my hunger, and I guess I'm OK with that, too!)  Apologies to all the vegans out there for my bluntness.The Love roll: (My sole attempt at being a good girl.  Don't get used to it) a California roll layered with shrimp and avocado.I thoroughly enjoyed my dining experience and plan on coming back again the next time I feel like being bad....soon!"], ["Jacob P.", "Pretty good sushi. Beware, happy hour prices are for dine in only!  Ordered a spicy tuna roll to-go and it was $9 instead of the $6 advertised on their website...  :("], ["Alison L.", "I was a frequent visitor of this place for the last couple years and never got tired of it.  I don't eat fish so can't comment on the fish sushi but the veggie ones were good (for the KC area).  Recommend frisky roll +/- hot sauce.  I also like tempura don lunch bowl.  Service can be slow during busy hours but as long as you don't have a strict time constraint in my opinion it's worth it."], ["Jordan W.", "This place rocks. It's small so the atmosphere isn't intimidating. The waiters are always super nice, so thats great. The service can be a little slow but there is usually only one or two waiters/waitress' there. However, the sushi is so good that I would wait twice as long just for it. I've never been disappointed by something I ordered here. This will ALWAYS be my first choice for sushi. (over RA Sushi and Drunken Fish. Those are the only two other sushi places I've enjoyed, but are high dollar with the white collar atmosphere that isn't right for everyone)"], ["Steven P.", "Good sushi. Very nice happy hour deals. We came here on a recommendation from some friends. I'm glad we did! We've been back three times so far, and we've brought friends. The food is good. Service is attentive without smothering you. The ambience is cool; in addition to the tables, and the sushi bar, they have two private rooms- with the low tables and paper screens, you will feel like you're in a Samurai movie!They've got a ton of rolls. Some very traditional, and others? Complete Western fabrications! And they are TERRIFIC!Try the Pretty Woman- it's a delicious one. And if you like spice? The Heart Attack is legit. One note: some joints SAY their food is spicy. With a dot of sriracha, sure, maybe it would spice up a four year old. These dudes? They mean it. If it says spicy on the menu: it has some bite. Finally, the tempura is great. And the Bulgogi. What? That's Korean? I don't care - it's delicious."], ["Tyler D.", "I found my new go to sushi bar. Since moving to KC from Florida- this is the most fresh and delicious sushi I have had. Friendly service too!"], ["Effie O.", "I enjoy this place so much!! Food is always perfect and great quality! Service is quick.For dessert the owner made a tempura apple with caramel,seaweed flakes and sesame seeds not on the menu but should be!!"], ["Jordan B.", "Pretty dang good sushi and the menu is huuuuuuuuge which means bonus points in my book. I love the pretty pictures on the menu too - helps my forgetful mind remember what I have ordered before, though the names here stand out in my memory as well. We came in for a late lunch around 2 pm and were the only people in the restaurant. The tables/decor weren't my favorite, my friend and I actually commented that all the chairs looked like outdoor patio furniture. But who really cares when the sushi is good. We ordered The Bieber Roll, The Shaggy Dog, and the Dancing Bull. The Shaggy Dog was by far my favorite, but I'm a sucker for fried rolls. The Bieber roll was refreshing -topped with mango, but I probably wouldn't order the Dancing Bull again. I didn't like the mixture of the fried shrimp on the inside and the spicy tuna/white tuna on top. The flavors were okay, but the hot and cold thing didn't mix well for me. There are two pages of lunch specials, one page of nagiri/sashimi, lots of veggie rolls, specialty rolls, and my personal favorite, the fusion rolls. With so many options, it will be hard not to come back for more."], ["Xin Q.", "Ordered \"sushi & sashimi bento\". Sushi is ok, sashimi is small and thin. Don't order the hot tea. It costs your $1.75 before tax and is the worst hot tea I ever had in Japanese restaurants."], ["Tara C.", "I just got take out from here and thought it was great! I got the edamame, house salad with ginger dressing and the Brett roll. Edamame was good, a decent size portion but not as salty as I'm use too. Don't get me wrong, I don't like a ton of salt but a little bit helps bring the flavor out. House salad was delicious.The Brett roll was awesome! Really fresh and so flavorful. It was pretty busy when I came in to pick my food up but they had everything ready in 10 minutes which was awesome. Will definitely be back!"], ["Brylie B.", "I agree service is really bad. Plan to stay a long time without food."]], "Kona Grill": [], "KC Sushi": [["Amy M.", "Awesome service everytime. My husband and I have gone here for sushi and had a wonderful experience.  Last night we took our two nephews (ages 5 & 7) to their hibachi. This was the nephews first time for hibachi and they loved it.  The service was excellent and the chef did a great job on the hibachi grill."], ["Adam B.", "The family and I stopped by right when they opened up early Monday afternoon and had the whole place to ourselves for the entirety of our meal to which I didn't have to pay extra. The strip mall may turn some people away but the interior of the place is updated and clean. Our visit started off strange as the waitress only gave us one menu and kept walking off while we were trying to order. At one point we had to ask her to repeat or order because we weren't sure if she got everything. The rolls and tempura udon were okay but were way too expensive for what they were. The flavor was decent but the rolls were tiny. We won't be back during our visit."], ["James Y.", "Do not do the teppanyaki grill. Big waste of money.This weekend my son wanted to do teppanyaki for his birthday. We book ahead to make sure they were ready for a large group. Our group took up two tables and they only had one chef on hand. The chef did the \"show\" but was very quiet , didn't have much of a personality and didn't do any thing interesting like the volcano. It was very boring.... While our table was served our other table only had the chef's backside to look at. He left and after about 15  to 20 minutes later came out and cooked for our other table. I would assumed they would have had the other cart ready so when he finished our table he would have started on the other without them waiting. The teppanyaki was so so, noticeably smaller portions than Tokyo Japanese steakhouse but cost the same amount. Very very disappointing. The reason we decided to to the teppanyaki here was because they were open earlier in the day and my nephew had baseball later in the evening."], ["Laura Y.", "I want to start with the positive. The young lady was lovely who took my take out order and rang me up when I picked it up. The onion soup was also delicious. the salad was nice and the ginger dressing was very nice.But the star of the show had a very off night, I guess. I ordered an Alaska roll and I must have misunderstood when I ordered because I was expecting raw salmon and cream cheese but what I got was smoked salmon and cucumbers and avocado, a portion of which was sticking out the end of my roll and had those black stringy specs that old avi's get. That put me off a little. The other problem with this roll is it was incredibly loose and quite small. The BRT specialty roll featured imitation crab and cucumber inside with assorted fish on the top and nice sauce. My main complaint with this role was its size for the price. I spent 25 dollars on this meal and was hungry and disappointed at the end. I wanted to like it because it's so convenient to work but I feel like Yelp led me astray. I'll stick with some of my other favorites for sushi occasions."], ["Mike W.", "Kc sushi closed last year for a renovation and opened up with the Japanese steakhouse/sushi bar look.  I must admit, our family is not a big teppanyaki fan, but we still love the sushi, so we keep coming back. If you do a drive by, the hesitation might get the best of you, but don't let the strip mall location fool you, they've got some real sushi mojo.  Like most sushi places, they do the standard California roll, tuna roll, and all the standard rolls pretty well, it's their custom rolls that let them shine. We did the shrimp tempura roll, good, California roll, good, spicy tuna roll, good, I-29 roll, excellent, spicy dynamite roll, excellent, Chiefs roll, shrimp tempura roll topped with red and white tuna...way yummy...add a 22oz Sapporo, and you got a happy camper here...It was a Friday night, and happy hour was not hopping, but it was early.  Hope KC finds this sushi place, it's one of the better places in the northland.  They have a full menu, great lunch specials, and we've had a sampling of several dishes.  Overall the place has always delivered good food, hope they can keep it going."], ["Tyra W.", "SOLD! The first time I tried to eat here, they were closed temporarily. Not sure why but driving by one night I saw they had reopened. Sushi was the only thing on my mind! Okay, so I pretty much love this place. For a strip mall I didn't expect the greatest of interiors but this is more modern and new. We sat at the sushi bar where we were promptly greeted and introduced to the menu. Holy variety! I don't know how we slimmed our choices down to a handful. My favorite was the hot night roll; I could put away half a dozen of those spicy starships of goodness. My obsession has always been crab Rangoon and theirs...is some of the best I've had. Hot and crispy pockets of creamy deliciousness calling my name. So far in my sushi exploration of the northland, this is my favorite so far!"], ["Sya N.", "Excellent sushi!  I-29 and Daikon are definately my favorite rolls. Great happy hour lunch prices! Super-friendly staff made it a pleasant afternoon. A must - go after a long day when you need a drink because their server will not let you go thirsty! Beautiful interior, don't let the outside give you any second thoughts. It's these hidden gems that makes you want to come back for more."], ["C B.", "Had a great sushi experience oct 31!  Service,  food, and drinks were on point!  Go to this place!  Best sushi in the northland for the right price! :)"], ["Sean N.", "Went with the family on January 13th to celebrate two birthdays with a sashimi & sushi feast. The girls this food as much as we do. It was a Monday or Tuesday night and we pretty much had the place to ourselves. That shouldn't happen often, though because this little place was a very pleasant surprise. The outside: strip mall 100%. However, the inside is fun. More attention to atmosphere than 95% of spots in this category.The service was really good. Again, we were almost the only souls in the place, but everyone was very sweet.Everything was fresh and delicious...  the the sashimi was cut extra thick. Impressive. Check this place out and compare to other local sushi spots. I think you'll agree this one is among the best of anything comparable in the Northland. We'll certainly be back."], ["Tom S.", "By far my favorite sushi place in Kansas City,  they have great deals and everything is extremely fresh. The chefs are super friendly and add nice garnishes to all the sushi.I recently had their hibachi for the first time and to be honest it was pretty dissapointing. Same price as all their competitors, but slightly less food and entertainment. It was still delicious,  just not my #1 hibachi restaurant. Keep in mind the sushi is so good I still gave it a 5/5 !P.S. The salad dressings are awesome as well."], ["Dawn M.", "Best sushi in KC. I've tried everywhere to see if they can beat KC Sushi. NOTHING is even close."], ["Daniel H.", "I came here with two friends before KC Sushi closed around 9:30pm on a Saturday.  It was empty and the group of people were just leaving.  We thought they were going to hate us for coming in just before closing time and I know some restaurants close their kitchen about 30 minutes before closing.  However, that wasn't the case here which was good.I ordered the Chicken Teriyaki dinner special ($10.95) as well as a Spicy Tuna Roll ($7.95).  My friends ordered the Caterpillar roll ($8.95), K & D roll ($9.95), Edamame ($3.50), Shrimp Tempura ($6.95), Hamachi Kama ($10.95), and Japanese Seaweed Salad ($4.95).  It took a few minutes before the miso soup and house salad came out which was part of my dinner special.  The miso soup tasted like any other place I've been to and wasn't salty to me.  The house salad was nothing special.The Chicken Teriyaki was not bad but the vegetables it came with were a bit salty.  The Spicy Tuna roll was good and tasted like how I remembered from other sushi places.  The Caterpillar roll was okay and the K & D roll was good.  The sushi tasted fresh to me which was good.  I tried some of the Shrimp Tempura and it was nothing special to me.This place was A-OK to me and nothing really stood out."], ["Kyle M.", "The only reason I am leaving a bad review is because of the service here. The sushi was really good, but the service was so bad I doubt I will return. First of all, the Hibachi cook looked like he's been doing this way to long and seemed annoyed that he had to cook for us. Also he almost set my 7 year old son on fire with his careless use of the cooking oil, which was a real treat on his birthday.  Second, the server never stopped by our table to check on us or refill drinks even though we were her only table. After waiting about 20 minutes for her to return from talking with her friend,  I finally approached her for our bill, which she seemed very annoyed by. I had good experiences here years ago but my most recent trip was so poor I wouldn't recommend it for anyone."], ["Lisa L.", "The happy hour menu  is a great bargain and one of the best menus I have come across for variety.  I usually stick to it, but I have tried other rolls and been very happy with my choices.  My favorites are the Pink Panther Roll, the I-29 roll and the BRT Roll.  I like the size of the rolls because they are easy to eat.  I always get Nigiri here and so far this is my favorite place or Nigiri.  It is fresh, and I like the size of it as well as the ratio of rice/meat.  They can over sauce their rolls so if you do not like that maybe just say something when you order.  You can always add more and they will accommodate.  Friendly staff, good service, fairly clean."], ["JenelleandJustin L.", "We've lived less than .2 miles from KC sushi for 3 years now. Let's just say we feel pretty dumb for not going before now. We are in love. We ordered miso soup, unagi (eel), ikura (salmon roe), daikon maki, and the dynamite roll. Justin liked the dynamite roll and the unagi the best. My favorite was the daikon maki and the miso soup. They have so many options on their menu, their interior is nicely decorated and modern, and their staff is lovely. We will definitely become regulars."], ["Russell D.", "I don't have a lot of experience with sushi.. but I've been to more than a few places and this place was great. Their miso soup was the best I've ever had.. their mussels were excellent except they had just a bit too much of their mayonnaise sauce on a few of them. The sashimi platter was fantastic.. huge and delicious chunks of salmon, albacore, tuna, and white fish.  And the hot night and Joplin rolls were amazing.Our server was perfect as well. I let him know I would be needing quite a bit of water since I finished a vigorous workout earlier in the day, and he was more than on top of it while not hovering annoying.We will be going back."], ["John H.", "Try the spicy crab salad. I measure every other sushi place on earth based off of this spicy crab salad.....amazing. tried the dumplings, yum. And I love the Daikon (radish) and the I-29 rolls. They just added the open grills and vent his for a Japanese fiber and a show. Haven't tried but imagine it will be amazing. This place does everything well."], ["Kim S.", "By far, our favorite sushi! The pink panther roll is incredible, along with the daikon radish roll~ unreal!!! I've actually never had anything bad in this place. We just did the hibachi grill for the first time over the weekend~they added with their recent remodel, and it was amazing. If you like Tokyo Japanese steakhouse, you'll love kc sushi. Oh and hands down~BEST spicy crab salad in the city. They won't disappoint."], ["Tracy I.", "Have driven past KC Sushi for years but finally went there to meet up with a friend for lunch. First, service was perfect. A very lovely woman greeted us and then took our order, our ice waters were regularly filled up, and everything was spot on. Second, atmosphere was nice and the restaurant was spotless! My friend said the interior used to be not as attractive, but apparently there was an update and it was tasteful and nice. And super clean! So clean in fact, that after an edamame slipped from my grasp (a single edamame bean that is) I felt so guilty that it landed on their pristine floors, that I immediately blushed and picked it up from the floor with my napkin! ;) And last but not least, our sushi rolls were delicious! I believe we had the shrimp tempura, spider roll and can't remember the last...spicy something... but all three were really delicious! Now, I've been craving sushi again since Friday. I will have to try takeout next!"], ["Cody C.", "I am shocked to see such high ratings. I tried this place, after hearing good things about it, yesterday. The server immediately seemed put off by any questions that myself or the girl with me had to ask about the menu and never got around to bring her the tea she had ordered. I didn't like the crab rangoon, and only ate half of one out of the entire order (6-8 pieces, I believe). The sushi was pretty good though, I must admit. So when the rude waiter came with the check, he asked if I wanted a bag. I declined, with him following up with a question inquiring what I didn't like about it. I mentioned that the crab rangoon was a little too sweet for our tastes, but it wasn't a big deal. He then defensively stated that crab rangoon is the same everywhere, which it isn't. As he went to run my card he blurted out, loudly, \"Well you don't have to come back! It's your choice!\" I said \"No problem, we won't be.\" He then brought the receipt back, with a $0 filled in on the tip portion. The girl I was with and myself are both former servers, I can't believe how bold this guy was! I would think anyone acting like that would know they would probably be fired. When I notified the lady at the bar, she didn't seem concerned whatsoever! Keep in mind, I didn't ask to be refunded for the food, didn't openly complain about the food (until asked) and did not have any \"demands\" after such treatment. STAY AWAY FROM THIS PLACE (unless, perhaps you make a to-go order).Very disappointed. Back to Wasahi for me."]], "Mr. Le's Sushi": [["Brent K.", "the funny thing about the reviews for this place, are most of the people talk about the sushi, it seems nobody cares that they also serve chinese and vietnamese cuisines as well.  i was just looking to try something new, and finding this place was an adventure, which if you know me, is what i'm all about.  my iphone did not lead me astray, and i arrived at my destination unscathed, though in the pre-imap days, i probably would have never found it.  located on Parvin road next to a couple of biker bars, Mr. Le was not present, and neither was any sort of hostess or waitress for that mater.  the gentleman in charge of the dinning area did eventually tell me to sit where i wanted, and then after what seemed like an eternity brought me menu, and then after a while someone came to get my drink order.  no explanation about the menu, or what i was supposed to do i with, 1/2 an hour into the experience, i took my order up to the sushi bar, where someone grabbed it from me and told me they would be right with me.  the food itself came out quickly after that, as did my drink order, but pretty much after that, i was left to fend for myself.  eventually someone noticed that i was done and asked me if i needed anything else.  no thanks.the menu is a mixture of sushi, rolls, sashimi, some appetizers, chinese food, and some vietnamese staples.  i was temped to try the vietnamese, because i'm always on the lookout for it, though I doubt I will ever venture this far away from Midtown again for this kind of service.the sushi it self was not bad, it was presented nicely and tasted fresh enough for a Sunday.  the place started to fill up after i arrived and I noticed that all of the people coming in were ordering chinese food and not sushi or vietnamese.  i thought that was odd, but given the location, it's about the only place to eat any kind of food for miles in any direction.  i personally would never go to a sushi place for chinese food, but who am i to tell anyone what to do.  it might have been awesome.  Alas, I will never know.the decor of the place is your typical strip-mall restaurant with vinyl booths and poor lighting.  the walls have pictures of sushi on them, which was fine i suppose.  Given all the \"best ever\" yelp reviews, I realized that north of the river, everything is the \"best ever\" because those people really don't get out much.  Unless they started serving sushi at the casinos that is.  then watch out \"best ever\" Mr. Le's, watch OUT!"], ["Sara H.", "Love the 913 roll.   Shrimp and cucumbers.  Mr Les the best around.   Great price for lunch is the Bento box which includes salad/soup, sushi, chicken teriyaki (or other entree on their menu) and rice.  A great place for sushi."], ["Jayson R.", "Every time I go there with a few friends the sushi is always great my favorite is the last samurai and the mr. Le's role"], ["Kelly S.", "Great place! I've been twice now and both experiences have been great. The food is good and it's a very convenient location for me- right near my house. It's kind of a hole in the wall but don't let that stop you!"], ["Agustin R.", "This was by far the best sushi experience I had in the northland.  Sushi was excellent as well as the steak, shrimp and chicken dinner.  If you are in the area you should stop what you are doing and check it out"], ["Phoebe K.", "Service: The service was spot on! Our server was very attentive and everyone was very friendly. Food:  Great rolls.  Tried the Parvin and am a huge fan.  Had my coworker try seaweed salad for the first time and she loved it.   Yay for expanded horizons!Ambiance:  Plain, but we didn't mind.  There's a big TV behind the sushi bar that's playing news."], ["Mike M.", "We went there, it was fine but I was expecting more based on the reviews. I am sure it is the best sushi north of the river, but I would say that Jun's is probably better.  For its location and price it is well worth a visit, but I would not go out of my way to go there if there is a good sushi restaurant near you."], ["Ashley R.", "To say the least, it was AMAZING. It may not look like much, but awesome service, everything was so fresh and yummy!!! Five star for sure... normally we go to wasahi on north oak but this was soooo much better and cheaper too!!!Must try the ichi roll, the jackson roll, and the ty roll"], ["Angela S.", "I love coming for their bento box lunch special. Teriyaki entree (chicken,steak, shrimp or salmon) sushi roll of your choice (off a short list of options) and the obligatory rice, salad and soup all for 10.95. They are super nice and the service is efficient."], ["Itashka W.", "Found this place on yelp. It was great. Fresh and yummy. Server was nice and quick. Kept my glass filled."], ["Kent Jacob S.", "I have heard great things about Mr. Le's Sushi from multiple individuals both friends and coworkers. I haven't been able to venture into the restaurant until last night, 2/19. The location is not necessarily a place where one would expect great sushi, but I know never to judge restaurants by their location or look. It's definitely not a hole-in-the-wall but rather a diamond in the rough (okay, it's not too rough). It's quite a ways up north but still close enough from downtown to visit. The interior is simple with dining tables, booths, and a sushi stand where the Mr. Le creates sushi art. To me, it's feels more like a Vietnamese/Chinese restaurant than a Japanese restaurant. Even the placemat is the paper Chinese zodiac.The décor essentially sums up the menu as it is not purely sushi, nor is it purely Japanese cuisine. You will find a variety of dishes from Vietnam, China, and, of course, Japan. The sushi menu is located on a laminated placard where you will use a dry erase pen to mark your selections. The other menu includes the appetizers and entrées. For my first dish at Mr. Le's I tasted the Parvin Roll; it is a fried crispy fish (snapper according to my companion) and cucumber rolled in sushi rice & seaweed that is topped with crab meat doused with spicy mayo. It was quite the delicious roll. I love the cold and chewiness of the crab meat and rice on the outside followed by a warm & crispy bite of the fish. Sadly, this was the only sushi dish we ordered for the night. The other dish was the fried pork chop & egg, a common Vietnamese dish. Needless to say, this dish could not compare to the Parvin roll. The pork chop lacked seasoning and flavor for me and was quite fatty/chewy. I did, however, love the meat loaf and the egg was cooked with the edges burnt, just the way I like it. The rice dish also came with a delicious soup.Service was just fine on a quiet Wednesday night. There was only one server and Mr. Le was the only sushi maker but they managed just fine. I love that they give you a loyalty stamp card which gives you a free sushi roll or appetizers. The Parvin Roll at Mr. Le's has, so far, beat all the other sushi rolls I've tasted in the Kansas City area so I will surely be visiting Mr. Le and his restaurant sometime soon. Trust me, it's worth the drive!"], ["Elizabeth F.", "My fiance and I have been to this restaurant 3 times now.  We stumbled upon it and it is truly a hidden gem!  We LOVE their sushi, fried, rice, AND delightfully frozen mugs for beer.  Seriously, coldest beers around.The atmosphere is cozy and relaxed, definitely not a fancy establishment.  It is perfect for a low-key lunch or dinner.  We actually chose Mr. Le's to celebrate my new job - yes, we are becoming regulars.The service is always pleasant and prompt.  It appears to be a nice family that owns and operates the restaurant.I just read on another review that there is a loyalty rewards card - we haven't seen that yet but I will be asking for it on our next visit!  Which will probably be this evening, yes, now I am craving Mr. Le's sushi and a psing tao beer."], ["Courtney L.", "I'm normally a big fan of Mr. Le's and have been coming here about once a month for a year. The fish was super fresh, the service was friendly for a small strip mall place and the sushi menu is extensive and creative. They also have a $10 bento box lunch special which includes miso or onion soup, salad, teriyaki meat of your choice, rice and a sushi roll (there is a list of specific rolls you can pick from for the box). It is a lot of food for a great price.However, the last few times I have been here, the service has really slipped. There is one guy who works there as basically a one man show when it comes to taking orders, delivering food and running the register. There is an older woman who helps out as well, but she only rarely makes an appearance. Today for example we arrived and it took almost 10 minutes to take our order because he was helping the line at the register. The food came fairly quickly, but my water was empty for a long while before it was refilled and 4 booths sat empty almost the entire time with the dirty dishes on them. When some people came in, there was no one where to sit and they had to quickly bus one of the tables... Then when it was time for the check we had to wait a bit again.The guy working there (I'm a jerk and should get his name) is really good. He is just super overwhelmed and they definitely need a 2nd employee. I'm not giving up on Mr Le's anytime soon, but if you are in a time crunch for lunch, be aware you might need a smidge more than an hour.Also, don't be offput by the shady strip mall it is in. While I've been hollered at (\"HEY GIRL! DO YOU NEED A TAN?!\") by the lovely Tan & Video store next door, Mr. Le's inside doesn't match the outside. And you know, I really could use a tan..."], ["Tom G.", "Been there many times over the last 5 or 6 years. Most recently tonight. The sushi is as good as anyplace in KC and  consistently so. Good mix of Vietnamese as well. Spring rolls are excellent as well as the soups. Mr Le and all the servers are attentive and do a great job. The food & service would be worthy of a five star unfortunately the atmosphere is not warm & cozy but plain & more like a cafeteria. Some is due to the location in the older strip mall. The prices are good and appropriate for the atmosphere. So if you are looking for good food and not a plush environment well worth the visit."], ["Terri B.", "Family run business that makes you feel special & appreciated. My favorite is the Ashley Roll. Great bento box at lunch time."], ["Faith B.", "Okay, this is a little joint in a strip mall. It's not fancy. It looks a little suspect even.BUT... good sushi, fresh and flavorful. There are lots of options.They do nigiri, hand rolls, and a bunch of combinations in their other rolls.Their appetizers include two types of mussels.They offer two different soups and three salads. Oh yes, they also do teriyaki Japanese dinners and I feel sure I saw some Vietnamese dishes on the menu.All in all, this is a pleasant surprise. Good sushi, fast service, not too expensive.Try it."], ["Daniel H.", "I came back to try their pho (yes they had pho!) and I was tempted to order some sushi; however, I wasn't sure if my stomach would agree with that and pho.  I ordered the Pho Bo Tai ($6.50) and it only came in one size.  My coworker ordered a bento box I think.  Everything came out fast because we were the only ones there. lol  The Pho Bo Tai was good and the broth was tasty.  I didn't have to add anything to it because it was already good.I'll be adding this to my pho list even though I associate this place with sushi. lol"], ["Mary Monica J.", "The year my sister turned ten, she was set on going mini-golfing for her birthday. She didn't care that the Midwestern god of weather had decreed a butt-meltingly hot day, she was going to get her putt-putt on. So we hauled our sweaty selves into the car and headed off to a slightly suspect strip mall off Parvin Road and a slightly suspect combination indoor putt-putt oasis/rabbit refuge/arcade/tanning salon and video rental shop with a back room that could be rented out for card games, wedding receptions and other sordid affairs. It was terrifying, and awesome.It must be a crime to operate anything in that Parvin Road strip mall that only serves one function. Mr Le's Sushi is a strip mall setup that serves sushi, pho and assorted Chinese entrees (if the taped-up construction paper menu on one of the walls is to be believed). It is refreshingly shabby, definitely not terrifying, and awesome. Granted, Mr. Le's specializes in fried, cream cheese laden mega-rolls, and those aren't my jam, but the rolls that I've had are solid. Salads are crisp and tasty, soup is about par for a neighborhood sushi joint. But the real appeal of Mr. Le's is somewhere between the ripped vinyl seats, delicious food, friendly service and the TV showing Wheel of Fortune or Glee. It's just a nice place to hang out with friends to nosh and natter and fill up your punch card for free sushi. And where the proprietor of the putt-putt place was always around the corner, right behind you, asking if you wanted to see his bunny called Coco, Mr. Le is always behind the counter, ready to help you if you need it and talk with you if you want."], ["Bobbi T.", "We ordered take out from here because we were in the area and it was getting late.  We have heard the food is very similar to another sushi restaurant we like so thought we would give it a try.  Food was pretty good and the price wasn't too bad.  We will probably stick to the other restaurant because this location scares me a little..."], ["Jack Ngoc G.", "Coming from a Vietnamese Family I always hope top find Vietnames Restaurants tat don't \"Americanize\" their recipes.  Mr. Le's did not disappoint.  Their Pho was exactly as a Vienamese family would expect as they sat down to breakfast lunch or dinner.  Still not as as good as my Mom's but pretty darn good for a restaurant. LOL"], ["Mandi C.", "I used to go here all the time but the last time I went there was at least 10 pieces of hair within my sushi roll. I've been so repulsed that I can't bring myself to go back there."], ["Kaitlin C.", "This is a family owned business with excellent food and service. They take time to remember you and enjoy greeting you upon return. I definitely recommend going to Mr. Le's."], ["Lisa H.", "Mr. Le must know the way to a woman's heart, cuz I just wanted to give him a hug after taking a bite of the volcano roll!   It has real bits of crab on top of it, a lot of sushi places use imitation instead.  Everything there was pretty good,  Although, being a huge sashimi fan, it doesn't appear they have the best quality sashimi.  This is just based on getting the rainbow roll, I didn't have their sashimi so I can't say for sure that is the case.  I think Mr. Le just knows how to work his magic on combining the flavors, because his specialty rolls are just the bomb-diggity."], ["Ammy W.", "My husband and I went for the first time tonight. We just live down the street and couldn't believe that we just now found out about this place. My cousin had told me it was really good but was hesitant about the outside appearance. It's nothing fancy but very clean. The wait staff were super friendly and made good recommendations for sushi rolls. My husband is a very picky eater and loved the steak fried rice. I had sushi and each roll was excellent. Next time I would like to try a bento box and the pho I hear so much about.  We will be repeat customers. Definitely recommend if you are in the area and craving sushi!"], ["Amber F.", "Wonderful Sushi and great service!"], ["Lisa B.", "I love this place! I've been to many sushi places in town, but this place is by far my favorite! It's tucked away in a strip mall and if you aren't looking for it you might not even notice it. Don't let the outside fool you, this place is great! They have lots of sushi rolls to choose from but they also serve Chinese and Japanese dishes as well. They also have several types of pho to choose from as well. Spicy tuna roll is the best I've had!"], ["Tricia H.", "I am pretty snobby when it comes to sushi and I wasn't very impressed with this place the sushi was just okay the fish was definately not fresh, atomosphere was like a sandwhich shop..not very impressed. I think it was a little pricy $38 for lunch for two people was a little high.  Maybe I will give it another try....or maybe not?"], ["Dennis A.", "Good service, fantastic sushi. I travel all over the country and this is THE best sushi I have found. Try the crab salad and christy roll. You won't be sorry. So get off yur butt and go !"], ["Vanessa D.", "We love this place!!!!!  Mr. Le is knows his Sushi!!!    The interior needs some attention but the food makes up for it!"], ["Debbie C.", "Nice big bowl of pho for a really good price! Yum!!"], ["Eric F.", "The best kept secret in KC's Northland.  I am addicted to the #3.  Mr. Le is awesome."], ["T E.", "I am a creature of habit and have been going to this location (I say this because it's passed hands several times) for about 10 years.  My favorite is BUN with shrimp.  I enjoy their spring rolls and peanut sauce as well.  Their Crab Rangoon is very flavorful and always a good accent to anything else I order.  Don't let the strip mall keep you away..."], ["Lyndsey M.", "Mr. Le's is located at Parvin and Brighton in Kansas City, North, in what I consider one of the shadiest strip malls around. There are some seriously icky people around this place, but they don't go into Mr. Le's, so don't be afraid. Inside, Mr. Le's is bright and cheery.The food at Mr. Le's is what keeps us coming back, though. Despite the dubious location, Mr. Le serves up some of the best sushi we've had. The fish is fresh and the rolls are creative and delicious. Presentation is not brushed over, as rolls are artfully presented and attention is placed on detail. The spicy tuna roll, for example, has a tiny amount of tempura crunch mixed with the tuna and spicy sauce. This adds an unexpected and exciting twist to the typical spicy tuna roll.My favorite Vietnamese dish is Pho, and Mr Le's serves up some of the best Pho Ga around. It's a fancied-up chicken noodle soup, with a complex, aromatic broth, tender slices of chicken, a slew of comforting rice noodles, and a plate of cilantro, basil, sprouts and lime wedges that you add to your taste. So delicious and comforting.Mr. Le's also serves some fantastic spring rolls - soft rice paper filled with shredded lettuce, mint, rice noodles, and thinly-sliced pork, with peanut sauce for dipping. At three to an order, I recommend you and a friend start by splitting an order of spring rolls, then fill up on Pho, sushi, or both."], ["Greg N.", "Yes, the strip mall may be a little run down, okay a lot...but the sushi was great.  We ordered the miso soup-fantastic, a few different kinds of rolls, and some tuna...excellent, we will definitely go back.  If you live in the Northland its definitely worth it!"]], "Wasahi Japanese Steak House & Sushi Bar": [], "Sama Zama": [], "Kato Japanese Cuisine Sushi & Teriyaki": [], "Sushi Mido": [], "KOBE Japanese Steak House and Seafood": [], "Drunken Fish": [], "Nara": [["Cathy C.", "Used to be, I would grudgingly go along when everybody else wanted sushi and find that my favorite part of the meal was the pickled ginger.Nara proved to be the crack in the foundation of my resolve not to eat sushi. No, I still won't do the raw fish, but I actually, really, enjoyed my California roll. And at $3 apiece on Wednesdays, I could eat a lot of them! Or any number of the other Happy Hour offerings, like spring rolls, skewers, and Local Pig peanut sausage. Pair that with a $5 martini, and nobody has to drag me in the door of a sushi place anymore!"], ["Jewell D.", "The staff is slacking. Both our waitress and the food runner who delivered our apps and food, were inattentive. The food runner was perfectly okay with putting our entrees on top of dirty app plates... And believe me he was trying to get out of doing more work because he attempted to leave when I had to shout and call him back to remove the clutter.... As a young woman who also works in the restaurant industry I'm disappointed in the team work this staff had to offer. On to the waitress... Please don't walk past my table 4 times while I have an empty glass and neglect my refills. We only got refills once while there....Lesson learned, go for the earlier happy hour, the later happy hour is for those preffering to leave unhappy. However, the food was amazing. At least the BOH staff knows how to run a shindig."], ["Sherry W.", "Good evening everyone!First of all, the sign outside says, Live Music at 5pm and its 5:20p...uh oh, wait a minute, here he comes.The food was very good, as always! I can't wait to go back to Nara's. I enjoy their Ladies Night Out on Wednesday."], ["Susan T.", "I love this place and had sworn I had done a review before, but I'll give you my update anyway. This place consistently has great sushi at a great price. I used to do Ladies Night here fairly regularly. Drinks can be pricey I've never had a bad one. I once asked for something with cucumber vodka, \"surprise me\" and had an awesome concoction that was delightful. Last week I ate here for lunch. I usually do dinners here but the lunch plate was fabulous!  I had a Build Your Own Bento $9, to include a Spicy Tuna Roll, Tempura Chicken, house salad, jasmine rice and fresh fruit. On past trips the fried ice cream has been spectacular.Decor is a modern, lively, atmosphere. Often has new artwork displayed on the walls. I'll definitely do more lunches here!"], ["Najla K.", "Went there three times, it was good every time! Good options for different tastes, even anti-raw people! The serves were great and friendly. If you can go during HH, you will have great deals."], ["Jeffrey M.", "Great sushi.  Best roll we had was the Crossroads, but honestly they were all good and tastes very fresh."], ["Alice H.", "My favorite new sushi place! I had the most amazing Server named Lyndsey she was very helpful when I was deciding what to order. I decided on the Sexy Mama roll and a roll with fried alligator (forgot the name) they were both delicious but I preferred the alligator roll, also on Friday nights they have a sushi model lay out with free sushi for guests this time I tried the jalapeno popper I believe super spicy! My friend ordered a red Geisha and I got a Bloody Nara they were both incredible I loved the kick to my drink. I will definitely be coming back"], ["Barbara S.", "This is a favorite of my friends for First Fridays. The food here is absolutely delicious and their reverse happy hour is one of my favorite in the city. We're talking $3 rolls and $5 martinis here, folks. Also,  it's not typically crowded at this time which I don't understand at all, really. And the best part is their \"Body Sushi\" event every First Friday where they have a nude model laying on a table and she is covered by strategically placed palm fronds and Free Sushi (!!!) There is a server who takes the sushi off the model and hands it to you, so don't get too excited, boys. I love their drinks here and I've had most all their sushi rolls and have never had a bad experience. During reverse happy hour, we all get different plates and share. It's super easy since it's all basically the same price. They have a really great side patio that we sit at if it's nice outside. The waitstaff has always been attentive and friendly. The atmosphere is laid back but classy. It's definitely a must!"], ["Erin W.", "If you are downtown, this is the best sushi option. I got the philly roll and the jalapeno popper roll (not the healthiest options, but super good). The service has been great (a little slow for a lunch hour, but still good). Love the atmosphere and the sushi is always fresh. My go to sushi spot downtown"], ["Rachel E.", "My boyfriend and I took my mom to Nara during her visit at the beginning of March. We ended up having to wait a little while for a table for three, but once seated, we had decently fast service. We ended up ordering edamame and 4 to share: the Spicy Scallop, Spider, Sexy Mama, and Nara Rolls. All of the rolls were tasty, with my favorite being the Nara roll. They did go a little heavy on the sauces for some, but overall I thought the rolls were very tasty, with quality ingredients. I have heard that Nara has two other specials: naked sushi (which may be a little too much for me) and sushi classes. I have always wanted to take a course, so I may be back in the near future to learn the tricks of the trade."], ["Karen T.", "A group of four had dinner there last night.   The decor was nice, the room was full of energy and that is why I gave them 2 stars.  The sushi rolls were small, and not memorable.  The service was ok, but our waitress was definitely inexperienced- she forgot things.  I think for a $160 dinner before tip we will try other places."], ["Saige A.", "Great place for date night! The ambiance is romantic and fun. I have eaten here more times than I can remember and it never disappoints. Tonight had a live acoustic singer which I found to be a nice touch. The only negative comment I had would be our service this evening. Once our order was taken we did not see him until time for the check. Our food was ran by someone else and then he never came back to check on us. Highly recommend for fresh sushi and you can never go wrong with the Pad Thai!"], ["Daniel S.", "I love this place. Ambiance is great, service is great, and if you find yourself at happy hour you hit a sushi jackpot!! We came in and ordered soooo many items on the menu. A Vegas roll for $5?? Yes! It's here! I recommend this for anyone. Even someone who isn't into sushi. The menu carries many options."], ["Jen D.", "I hadn't been to Nara for a long time when a friend suggested we visit for dinner. We met on a lovely Wednesday evening, and to our surprise and luck, it was Ladies Night. I'm not sure if the specials on Ladies night change, but the menu had 4 or 5 rolls for around 3$ and several cocktails for about 5$. Again, to my good fortune, the spicy tuna rolls (my favorite) were on special. 3 rolls for 9$? What a bargain. The spicy tuna wasn't incredibly spicy, but at 3 dollars a pop, I really can't complain. In looking over their regular happy hour and reverse happy hour, I imagine I will visit again very soon."], ["Megan L.", "Reservations at 8, no help until 8:30. No servers came and helped us while we sat there for 10 minutes. When no waiters brought us waters for 10 minutes then we got up and left. The place was half open so they had the openness for new customers. When we left and told the hostesses that no one helped us then then the owner tried to keep us in the building and us to stay and order food. NOT GOING BACK!"], ["Bryan S.", "Decent sushi last night.  Much of the fish was warmer than normal sushi and the rolls fell apart easily.  Plus the salmon sashimi didn't smell or taste right.  We've had some good meals here but sometimes it's hit and miss."], ["Jenise H.", "This place is amazing!! On Wednesdays there is Lady's night! $3-5 sushi menu! Awesome drinks not too strong and not weak! Awesome patio on cool nights! The ambiance inside is beautiful makes you feel very fancy, good decor! The staffers are very nice and on point! Never had my order messed up! Never had to wait no longer than 20min to be seated! The location is downtown so it's easy to meet up with coworkers and have a good night!!!"], ["Toni D.", "Love Nara sushi! One of the best in the city. And my go to spot every time I'm in town.Ask for any of the chefs special rolls, or the Sexy Mama, I love that roll! My boyfriend and father always get the hot dish entrees, and they have never been disappointed. Great restaurant, yummy sake, and worth every penny! Not at all expensive."], ["Michael H.", "Nara's is truly one of my favorite dining experiances in KC. Known for their sushi, they also offer an asian fusion menu w/ soooo many options!Of course, the sushi is as good as it gets in the midwest, from the nigiri & sashimi to the rolls. I love their Mega Roll filled with tuna, salmon, yellowtail and avocado then tempura fried with yuzu mayo over dynamite sauce. I also enjoy what I would consider the non-traditional, \"Americanized\", rolls like the Mr Dandy which has tempura fried alligator. Or the Forbidden Apple roll that combines apple & mango wi/ tempura shrimp & a peanut sauce. The Mr Lobster roll w/ lobster salad, avocado, cucmber & dynamite sauce is another fave! My ONLY knock on their sushi menu is that they do not have Toro, but I guess I can suffer without it, lol.But, Nara's is much more then just sushi! There are 16 small plates including the grilled scallops in lemon cream sauce & the steamed Vietnamese Bun. They also offer tempura shrimp, chicken, veggies & tofu. Plus grilled Robata skewers like the spicy Thai-Peanut sausage that is made by The Local Pig butcher shop in KC. Also, the Korean kalbi style beef short ribs, which are absolutely craveable w/ the perfect amount of heat. Round the menu out w/ nine entrees (PLUS a special every night) like the Beef Negimaki, thinly sliced sirloin wrapped around green onions served in a large metal bowl w/ their house-made teriyaki, perfectly stir fried vegetables & steamed rice. A mouthwatering must have!They have plenty for those that \"do not eat raw fish\", haha! In fact, you could dine at Nara's 3-4 times a week, doing \"asian tapas\" one night, sushi the next and then come in for an entree & salad while sneaking in a lunch or two. Combine all of that w/ a large saki list & a fully stocked bar & OMG, Nara's is like 4 asian restaurants & a bar all rolled up in one. But even w/ such a large menu, they truly do everything well. And the service is of fine dining quality! Nara's staff is engaging, attentive, knowledgeable and consistant. Check out there specials or their AMAZING Industry night for you restaurant peeps out there!"], ["Jerice A.", "Late night happy hour is decently priced. But the rolls I get don't see to be tight enough and always fall apart. Seafood seems decently fresh (for being in the Midwest) and the head sushi chef is definitely a pro. Seaweed salad miso soup and yellowtail sushi are my go to here. They have some great music playing and some cool events here."], ["Vanessa O.", "There is literally nothing about this place I don't love. I love the building, the great waitstaff and the yummy sushi. The ambiance is also nice.  I find their bathrooms kind of interesting too. If I could afford it, we would probably be here every week. I highly recommend this place."], ["Rick M.", "So at the sushi bar and order Omakase, which means \"I'll leave it to you\" or more literally \"to entrust\" and to leave the selection to the chef. Diners who order omakase allow the chef to be creative and they will prepare items not typically found on the standard menu. This is not limited to sushi, and may include items prepared with other methods.You can set a budget and let the chef know what you don't like. The chef will present a series of plates, beginning with the lightest fare and proceeding to richer dishes. I like to just let the chef go at it and then tell him when to stop.Generally you get the best the chef has to offer, and often at a price below what you would pay for à la carte."], ["Jiminy C.", "Pretty good place to eat, went on a little lunch date during happy hour (3-6pm). Half price rolls. CANT beat the price.Fresh good tasting sushi. Employees are ALWAYS Friendly, and quick customer service. I also  like environmental atmosphere it's not a 5 star restaurant by any means, but it stands out to be unique. I would recommend!"], ["Hannie D.", "Unless you are going to the event space or for happy hour, avoid Nara.My husband and I are sushi lovers. We eat regularly at Domo, Ra, and Jun's.  Nara doesn't measure up to any of those, and the prices are outrageous.  For 2 bowls of Miso soup (the only flavorful thing), three sushi rolls and sake, we spend over $100. The sushi and sashimi were disappointing. It all pretty much tasted the same (bland), except my husband's \"sexy mama,\" which had some sort of smoked salmon or something in it with a disturbing texture. The Sexy Mama at Domo is far better.  The place is cold and dark and attempts to be chic. If you want a chic bar atmosphere, head to Ra in Leawood - the drink offerings are better and the interior is cleaner and warmer."], ["Endre P.", "Very nice very interesting place. \"Hip\" :-) Staff is very quick both taking and bringing your order and also clearing the table. All staff clearing tables and helping with serving. Food is excellent, great selection, very fresh and well seasoned. Not sure who else is with this like Im but finding a well maintained modern, clean bathroom in a restaurant is a huge plus for me. There can be the best food but if i find an outdated or dirty bathroom, i associate it with the kitchen and feel that the kitchen is in the same shape.  At Nara, call me crazy, but the bathroom was hip and inviting. (If a bathroom can be inviting?) The plum martini was very nice and recommend if you  like more of the sweeter type martinis. It is with plum wine and saki. The reason i didnt give 5 star is the noise level. The place is just plane very loud.   Plus they have a live singer in the bar area that just adds to the already high decibels. The singer we had that day was excellent as i stood next to him but a few tables away it was just another noise. We had a terrible time hearing each other at the dining table. Will i return? Yes. The food and staff ate both excellent. I just put ear plugs in. :-)"], ["Keanon L.", "Sashimi was great. Generous cuts and more than described on menu. Tasted fresh.Smoked tofu roll was also pretty incredible, though serving every cut of the roll with its own 6\" stick is an odd choice.Sunomono salad was just OK. Served in a martini glass (people still do this?\" with the fish on top, cucumber underneath, and all the dressing/marinade at the bottom. Odd choice for such an expensive starter.Girlfriend's tofu fried ramen contained no tofu. Too disappointed to send it back.Great sashimi quality, but for overall Japanese meal, I'd prefer Jun's on State Line."], ["Lauren M.", "I went for lunch with a friend today and unfortunately, the experience has not gotten better. I got the Bento Box, which comes with rice, salad, 4 pieces of sushi and a meat (chicken, beef, shrimp) and it wasn't good. The salad was doused with mint dressing, the beef tabata had hardly any meat (tabata is meat on a stick) and the sushi was mini sushi. I know these are supposed to be smaller, lunch portions but if they are going to charge $9 for a bento box, it should be worth $9. Our server didn't bring our crab rangoons out before the meal like he said he was going to, but then again he was the only server responsible for several full tables. Not a good experience again. Won't come back, period."], ["Stephen H.", "Haven't updated my review for two years.  Main difference?  The music is now obnoxiously loud.Still great prices and sushi during the reverse happy hour, but not worth it to put up with the unfriendly (too cool) crowd and super loud music.  Some of us actually want to talk to the people we are with.  And not have to yell."], ["Kristi S.", "Let me put it this way: if you want a HH that is basically an excuse to drink, Nara is the spot for you. However, if you're like me, and you want actual sushi at a sushi restaurant's HH, Nara is not the spot for you. While the HH drink menu is expansive, there are only four roll options (and they aren't that impressive). Here's my advice, Kona Grill and Ra Sushi have much better HH menus and don't end until 7 p.m. (Nara's ends at 6). Check them out instead."], ["Michelle B.", "I'm definitely a fan of Nara, it has a great atmosphere and the food is delicious!  They have a fantastic selection of sushi and other options for those who may not like sushi.  My date and I got spicy tuna rolls, philadelphia rolls and the vegas rolls all of which were absolutely delicious and that's saying a lot coming from me because I'm extremely picky about the sushi I eat.  We had a great drinks to go along with our dinner and a fantastic desert after dinner.The service was good and our waitress was attentive without constantly being at our table.  I would definitely go back as well as recommend it to my friends.  It's definitely a great spot for a date as well as going out with a group of friends."], ["Elyse D.", "One of my favorite restaurants in Kansas City! The food is good and the service is always great. They have really great specials throughout the week too!"], ["Anna L.", "Good service, perfectly made sushi. There are indoor and outdoor seating options, and their happy hour includes a considerable array of small plates at or around half price. Each experience I have had here has been positive. Give yourself a gift and sit at the sushi bar watching the guys make the sushi. It will blow your mind how efficiently and artistically they work. Recommend this place for sure."], ["Charley B.", "Nara is still good, but it sure isn't like it used to be.I brought a friend here a couple of weeks ago and we were seated in the dining room. We quickly learned that we needed to tell the hostess that we were there for the Friday Night Happy Hour and be seated at the bar instead of just coming in and asking the waitress about it. We didn't and our waitress just about had a meltdown. She abruptly left and after about five minutes a hostess came over and resat us in the back area. Then about fifteen minutes later our same waitress reappeared, still upset and disheveled, but a little calmed down. I hope we didn't ruin her night.Moving on, the sushi was good. I enjoyed the Local Pig dish and the spicy tuna. My friend noted that the crab rangu was some of the best she's had.I also now know that if I come back again, I need to ask about the late night happy hour."], ["Meghan M.", "During my many years in KC, I've avoided Nara due to its hip, cool kid, dress up and show off vibe. That's just not quite my style. It always seemed like it was trying too hard to be cool. Anyways, I was finally wooed in by their ample promotional menus, and now, I've frequented it twice in one week. #sushiaddictionFirst, they have a pretty good happy hour menu that's offered 3-6 Monday through Saturday. They also have reverse HHs. Their HH menu offers specials on sushi, drinks, appetizers, and cooked items. They also have a great ladies night promo on Wednesday nights which offers more than the typical HH menu (including $5 Vegas rolls...mmm). The most important and delicious item to get is their Nara Cane Martini. It is addictive deliciousness. Five stars for the martini, and four for the rest of the menu.  The space is cool. The fellow patrons varied greatly. The first night there it seemed to be douchey date night. It was a bit much, but at least the overheard conversations were entertaining. The next time we came there (Friday HH), it was a much older and varied crowd. We saw everything from families to young couples to work groups to older folks. It was a different sight than the other night.The biggest hang up of this place is their service. The host and manager are more attentive than the waitresses, and they try to fill in service gaps when possible. Our first night we had the rudest waitress. She rolled her eyes at us when we asked a question and refused to make eye contact with us when talking about the specials. It was odd. She did defrost a bit as the night went on, but she was one of the iciest waitresses I've ever had (besides the service at Wiener's Circle where you go to be verbally abused). Our next visit, we had a kinder, less bouffant-ed waitress. She was good, but we had some execution problems, such as waiting at least 30 minutes for crab rangoon and overcharging us on beer. In short, it's a decent place. I will likely keep it in mind for happy hours, but I don't know if I would consider it beyond that. Their service definitely needs some refining."], ["Bailey R.", "The sushi chef was fantastic! I sat at the bar and he told me great places to visit, entertained my questions about the rolls he was making and just chatted with me while working furiously. The rest of the staff was also super friendly. The make your own bento bowl was an incredible deal for the amount and quality of the food. The atmosphere was really neat as well. Overall an amazing experience!"], ["Matt E.", "It seems to me that Nara has never lived up to its potential. It has a gorgeous interior, with a nice bar and lounge area, and it's in a great part of town. There's a great patio that has one of the best views of downtown in the city. But unfortunately, it seems to have completely fallen off KC's nightlife radar. And even more unfortunate is that as a restaurant it's not exactly blowing me away, either.Let's first talk about that restaurant aspect. While I really enjoy their non-sushi offerings, I think their sushi menu is just pretty bland and poorly executed. For a sushi restaurant, that's not a good thing. I can't really think of any rolls that I would highly recommend. BUT, I really enjoy most of the stuff off their robata menu, their crab rangoon are some of the best in town, and the pad thai is excellent (and SPICY!) Still, it's a shame when a sushi bar's sushi is the least impressive aspect of the menu.Let it be known that I think the service at Nara has always been spot on. I have heard complaints from others, but I have never witnessed that myself. I think their dude bartender that (at least used to) work on Tuesday evenings is fantastic, and my servers in the dining room have always been helpful and friendly. I dig the staff here. As I said before, I think the bar area is great. It's comfortable, looks fantastic, and has so much potential. They just need to realize it. I'd start by revamping the cocktail menu, which I don't think has changed in years and can't keep up with the rising sophistication level of KC cocktail culture. Plus, they just need to figure out a way to get some more bodies in the room. They used to have DJs, and people would dance and it'd be great. Now, weekends are a ghost town. They also used to show hilarious old Japanese movies on the screens. I think that's gone by the wayside as well. I like Nara, so I hate that it sounds like I'm bagging on them a ton. But they need to step up."], ["Alex W.", "My wife had her 20 year high school reunion here,  upstairs. Even though we paid $65 per person, the liquor came from the kind of stock that's poured from plastic bottles. Awful beer.  \"Crab cakes\" with no crab that I could see. Nothing about this place was up to par. Super disappointing."], ["Tina H.", "My all time fav sushi restaurant! Love the staff and environment, I've probably tried every sushi roll they had offered, none the less I was never disappointed!"], ["Jeff P.", "I don't know how I haven't reviewed Nara yet - I've been going there for years.First - best vodka martini in town. Get the Russian Standard. Seriously, go get it so that hopefully I can eventually find Russian Standard at a liquor store somewhere. Chop chop, let's go!I honestly thought I would hate Nara when I first went there based on past experiences with similar places that desperately want to be trendy. I was pleasantly surprised, though!The secret about Nara based on what I'm reading is to go on weekdays. I have frankly been to Nara dozens of times, but never on a Friday or Saturday and I think it's made all the difference. There's that annoying trend where asian fusion places have some crappy House DJ blaring cheesy \"soulful house\" and the interior looks upscale and everything, but then the food is just awful and the servers are elitist pricks. I can see how that sort of works in, say, New York, but in the Midwest it's always sort of weird. Thankfully, Nara has the interior but generally not the attitude or the awful DJ, or at least as far as I have seen on weekdays. Ok, there is something not on the menu which is what you should be ordering. Omikase. Basically, it's chef's choice. If you're not cheap about it ($80 for 2 people is a reasonable minimum) it is consistently amazing and you will always get different things you've likely never had before by ordering it. If you sit at the sushi bar and order this, often the chef gives you all kinds of weird and wonderful appetizers as he's preparing your main course(s). I have never been disappointed.The only slightly bad thing is that I came in once on like a Wednesday night or something and they were having this one-man band doing cover songs poorly kinda deal. Fortunately, the outdoor patio was open so I was able to get away from it - had it been closed I would have left. I guess lots of other people felt the same way since the patio was full that evening while the main dining room was nearly empty."], ["Phillip L.", "I'm really surprised the reviews aren't better for Nara. We got there during happy hour and had some of their hummus and crab rangoon. The rangoon was probably the best I've had. Next up was dinner and we ordered the crispy cheesy Cali roll, forbidden apple roll, mr dandy roll, jalapeño popper roll, and the dreams of summer roll. All 5 delivered. They have a fantastic variety of rolls to choose from and you won't be let down by the quality. For dessert we tried the mochi, and I'm not sure what it is, but it was delicious! I'll be coming back often."]], "Q Hot Pot Japanese Fondue & Asian Tapas Bar": [["Egan B.", "I think this is the only hot pot in KCMO and I love it! The broths are flavorful and delicious. All the different meat cuts are tasty, especially the lamb. The veggies are fresh and the udon noodles are a nice touch to add to your hot pot. I also really like the sauce they give you with a bit of onion and fresh garlic. It's a really nice little presentation that you mix together yourself. Consider paying $25 for all you can eat but beware there is an up charge for each flavored broth you get of 3-4 dollars. So if you choose two flavors it can bump your bill up to $33. I recommend the spicy broth and then just getting regular on the other side."], ["Robin S.", "We love the Japanese fondue experience! It is so filling and delicious and delightfully different.Also, their Philadelphia roll was one of the best I have had!We will be regulars here!"], ["Tracy I.", "So, this spot has been around for a bit now and thought it was time to try it out.Service was friendly and professional. Our server explained how everything \"worked\" and showed us the menu choices. On a lunch date with a friend, we ordered the hot pot with thinly sliced chicken. For $29 (for two people) you get a huge platter of veggies (cabbage, carrots, broccoli) and a huge platter of your choice of meat (sirloin, pork, chicken, seafood) plus your choice of rice, thin noodles or udon noodles. You can choose your broth flavor too (vegetarian, chicken, hot and spicy, etc)I thought my experience here was really good! Servings were large and filling and tasty too!"], ["Deb P.", "Really enjoyed our dinner here. I first became acquainted with shabu cooking at Shabu Shabu in Redondo Beach, California while visiting my daughter.  It is extremely popular there. I was very excited to see Q's Hot Pot opened in Zona Rosa even though it was a bit of a drive. Hopefully it will catch on here. Definitely a fun thing to do with a group. Surprised when they served my white wine it was at room temp but they of course had it chilled at my request.  Will definitely go back and share the experience with friends."], ["Allen R.", "Went there to try something different and it was good.  I've never had hot pot Asian before but our waitress was great and went over the entire process.  We ordered the beef ribeye.  It comes with some veggies and broth.  The broth is where it's at for me.  I thought the broth really makes the dish and gives it that needed pop of flavor.  I enjoyed the whole meal and it's something different from anything else around here.  I would like to come back and try the sushi as well."], ["Sara N.", "No more sushi here :( the server said they stopped serving sushi two weeks ago. So sad, one of the reason I come here. UDON noodles are good. The chicken teriyaki is decent, but rice was a bit dry. The korean wings are super breaded with a little drizzle of sauce. Too much bread, not enough sauce. Servers nice. Really nice and relax atmosphere.Bring back the sushi!! 3 stars for no sushi and not so great wings."], ["Rose Hoa D.", "Amazing service and awesome hot pot for a cold night. We got seafood with an extra side of beef and chose two different flavor of broths. Huge portions and we were extra full when we left. Thanks for bringing hotpot to KC!"], ["Ami L.", "Basic hotpot place.  You get to choose from 5 to 6 different types if broth.  Keep in mind that the broth is very light - that's how its supposed to be.  Its supposed to be healthy and the flavor comes from the dipping sauce.  To make our dipping sauce, they gave us \"homemade\" soy sauce, garlic, green onion, and Chinese BBQ sauce. We got the rib eye for $26 which comes with a plate of veggies and rice/noodles(vermicelli, udon).  Im used to hot pot meat cut a lot thinner.  It ends up being around $14 a person.  Not bad but yes, it's a bit pricy for a little over 1 pound of mediocre meat.  I also got a taro milk tea.  It's good but I got half sugar and it was still WAY too sweet."], ["Daniel H.", "I wanted to try this place since they opened about six weeks ago.  My dad came to visit so we came here for dinner on a Friday night at 8pm.  It was not too busy, but this place was a small restaurant so it might look busy.  The hot plates at each table were electric ones.  Since this place was small, our table was next to a couple already eating. Each table with a hot plate had four chairs so you might be next to others.  We were provided menus and had it explained to us.  Our waiter was knowledgeable about the menu and was friendly.  We ordered the Meat combo which came with two choices of beef, chicken, pork or lamb (we chose beef and lamb) ($29.95), the Seafood Platter which came with shrimp, salmon, fish balls, scallops, squid, and shrimp balls ($29.95), the Dragon Roll ($11.95) and the Spicy Tuna Roll ($8.95).  Each one came with a vegetable plate and a choice of udon noodles, vermicelli noodles, or rice.  We got the udon noodles and rice.  The two broths we chose were the Chicken broth (complementary) and the Chinese Spicy broth (Mongolian style) ($4.50).  We were debating whether to order more but we would decide later. The food took a while to come out while they were setting up our hot pot.  The amount of meat we received seemed like it was less than what I had seen at other shabu shabu places I've been to in the past (not to mention two slices of meat fell off while our waiter brought it to us).  The chicken broth didn't add any flavor to the meat so I had to dip it with the sauce we were given to mix together (I forgot the names but I took a picture of them).  The Chinese Spicy broth was a little spicy but might be very spicy to others.  It added more flavor to the meat and I liked that one better.  The Spicy Tuna Roll was okay, but I definitely had better in the past.  There was a lot of tuna in each roll though so that was good.  The Dragon Roll was okay as well and again, I've had a better roll in the past.  We decided to add more beef (I was still hungry) which ended up being $12 extra and would vary in price depending on what you originally ordered.  It didn't say anywhere on the menu that it was an additional fee so it would have been nice to know how much each meat would additionally cost.  It took a little while before we got the extra beef. Overall, this place was okay but the price was a little pricier for the amount of meat you get.  It would be worth checking out if you've never had hot pot/shabu shabu before."], ["Mike W.", "You have to give anyone a lot of leeway upon opening a new restaurant.  Q Hot pot opened several weeks ago, and based on the inviting decor, they know how to make you feel comfortable.  It has nice clean upbeat lines, simple table setup, bright colors, bar seating, and a couple TV's all work nicely together.  The smallish size of the place sometimes require dinners to eat at common tables, New York style.The simple menu, highlights the hot pots, which offer mixed vegetables, several choices of meats, a choice of 6 broths, cooked fresh daily, and a choice of noodles.  I ordered the chicken, which is designed for two people, udon noodles and I decided to cook in both a chicken, and a Japanese miso broths.  Both broths had simple flavors when tasted alone.  Luckily, we had an ample amount of time for lunch, as it takes time for the broth to boil, and the veggies and meat to cook. The large hot pot is heated on your table and divided into two sections for the broths.While the broth was heating, our spring roll arrived. It is served with a tasty peanut sauce.  The spring roll had a good initial flavor, but upon the second bite, the noodles overtook the flavor.  Adding an internal sauce would bring these up to, \"a must have\".  We also had the daikon roll, very good, tuna, wrapped in a radish, with a tart Ponzu-like sauce.The broths are boiling, so it's cook time.  We were instructed to cook the veggies first, as the meat only takes a couple minutes, it is sliced very thin.  The food also comes with some added ingredients, the waiter gave a simple explanation, but the owner, a very nice Vietnamese lady gave us the real run down.  They provide a house made soy sauce, very good, a concentrated Chinese BBQ, garlic, cilantro, and a spicy relish.  She explained that once the cooked items were removed from the broth, they suggest you make a dipping sauce from the above mentioned ingredients to finalize the flavor to your liking.  I created my sauce and the combination was perfect for myself, but a tad \"hot\", for my wife.  She made a milder version.  They broth cooking allowed you to create meat veggie combinations to your liking, My wife and I thoroughly enjoyed the meal.All the food was very tasty, but I found myself wondering what I would do if I was eating alone, or in a hurry, as the hot pot menu portions are designed to share.  After we finished and were paying the bill, the owner approached and asked how everything went.  She saw me taking pictures and I saw her watching me on a couple occasions.  We discussed the time issues for lunch, and she is in the process of tweaking the lunch menu, and through our brief discussion, it sounds like she's on top of things and has some good options in the works, like some ready to eat options.  She's still looking for those star servers to help present the experience with the same passion she has.  Our server was ok, but left a lot of the finer details of the meal out.The Q hot pot, is a diamond in the making. I'm confident she sees the challenges of a new restaurant, and most places with good, healthy, and fun food, with an involved owner, find ways to remain a destination eating experience.  I will give her a few more weeks to tweak things and I'll definitely be coming back."], ["Ronnie L.", "Wow.  That was delicious.  I've always wanted to try hot pot and thought we'd have to go to a large city like New York or Chicago to finally try it out.  The experience was fantastic. I was very happy that the waiter helped us out and offered advice. I'd suggest trying a flavored broth on both sides. The chicken was great but a little bland for my taste. We did the lamb and beef. Next time I'd like to try the seafood I think. I recommend the Vietnamese fried spring rolls as well. Spicy and delicious. I liked the lychee Belini as well."], ["Tyra W.", "Oh hot pot, how you leave me waddling out of the door in wonderful discomfort. We popped in for dinner last night and left happy with our visit. Walking in, we were greeted, seated, and given menus promptly. The menus are very easy to read with a simple layout of drinks, sushi, tapas plates, and of course--HOT POTS! You are crazy if you don't get a hot pot. To start, I opted for the Beijing Bellini which is a drink consisting of champagne, lychee liquor, and a lychee fruit dropped in the bottom of the glass--very thirst quenching! For tapas we went with crab rangoon and seaweed salad. The salad was just OK but the crab rangoon was a superstar on its own. They're on the bigger side and freshly made with no shortage of cream cheese delicousness on the inside. Served with a sweet chili sauce, it was the perfect partner. *cue mouth-watering*  We skipped the sushi rolls since the hot pot was our mission. We decided on the seafood platter (shrimp, salmon, fish and shrimp balls, scallops, squid--also mussels and clam which weren't listed) with the vegetarian and Korean Kim chi broths. It came with a variety of vegetables like lettuce, carrots, corn on the cob, mushrooms, bok choy, and a choice between udon and vermicelli noodles. (We went vermicelli.) You will put your veggies in when it starts to boil, then let it come to a boil again, and cook your proteins. The seafood is a little more work because the proteins take different times to cook (for example: fish balls are on the longer side at about 5 minutes). You'll also make a dipping sauce. I don't remember all the ingredients used but I do know there's green onions, garlic, and some sort of spicy paste you can add. (I must go back and get the details on a future visit.)Our server was a younger guy who was really great at guiding us thru the menus and giving us a hot pot course. Really great service here. We left STUFFED beyond capacity."], ["Michael G.", "Ok...so this is a place full of next time ideas. I had the chicken teriyaki which was very good. Veggies were crisp and crunchie and the sauce that accompanied it was very very good. Wifey had the miso soup with scallops  and she loved it. We opened with Vietnamese egg rolls. They were these tiny egg rolls stuffed with pork and veggies fried just right and served with a chili dippin' sauce...the chili dippin' sauce is very important here. DON'T let them take the plate away because I took one of wifeys scallops and dipped itn into the chili sauce and it was awesome. ALSO get the fried rice. A huge plate with tender fried rice with lots of vegetables in it and of course the egg scrambled into it. NEXT TIME IDEA...gotta try the \"Udon\" section of the menu or the hot pot part. The Udon way is noodles are stirred into the food. Hot pot looked interesting but once again it qualifies as a next time thing."], ["Sarah H.", "This place was awesome from the food to the service. If you never been here before they'll explain everything to you. The only gripe I had about this place was their sushi menu,  it kind of seemed like an after thought given the selection of rolls."], ["Ponape S.", "This place is a joke. They charged me for two beers that I did not even order. Food was simply bad over all. Spend about $125. I make better sushi rolls and soups than what we got from this place."], ["Kilani G.", "I'll give credit to the few good things about this restaurant. Our waitress was attentive and explained everything there needs to be known about hot pot. The spicy tuna roll was made to order and was the best part of the meal. The dipping sauces were interesting and tasty. Moving on to the main reason we came to a hot pot establishment.We got the combo meat platter with beef and pork with the two vegetarian and chicken broths. It came with a veggie platter which is where the disappointment comes from. It was a random selection of veggies not often put in hot pot that almost appeared to be scraps put together. For example there was thin pieces of cabbage but not the green portion of it, and random carrot pieces. The broth was absolutely flavorless and the staff were all eating dinner as well while being truly unprofessional. For the dessert that was included in the meal price we received a dollop of red bean soup which was truly unsatisfactory. Go somewhere else for a fulfilling hot pot experience and go to this place if you want sushi."], ["Azile Y.", "Oh god the food is so good. Started with the Asian hot wings. Then we did a split broth of kimchi and pho. Both outstanding. I was full so quickly, but just kept going. I can't wait to come back and try their bahn mi and sushi!!"], ["Jennifer D. L.", "The employees are nice! The ambiance was nice as well! They played EDM which was nice! The corona was ice cold and the limes were cold and crisp! They had minimal knowledge of where the tuna came from. He said it was local from Seattle! Ummm we are in Kansas City! That's not local. Also I asked for unfiltered sake and they seemed confused! I am a foodie and the tuna was tender and soft. Not the best nor the worst. They gave me 20 percent off both meal and beer!"], ["Ashishh D.", "My gf and I went here when it first opened and again last week. We ordered all you can eat hot pot (Chinese and Thai) both times. Not sure if they changed anything but I felt the broth was better the second time. The service was excellent both times. It's like the hot pot you can get in Dallas but with a trendy hip ambiance. Yay for KC!!"], ["Hsinyeh H.", "Had hot pot for lunch, all you can eat style. Good portion for everything requested. Love it and will definitely come back again!"]]}