{"Wai-Wai Thai Place Express": [], "Lemongrass Thai Cuisine": [["Andrew S.", "I have to agree with the recent review written  by Beau E. In the beginning there were in fact two younger gentlemen that appeared to be designing the food and decor; & the whole experience was great! The last two times I have dined there, it appears that these two young men no longer work there; and, the food has suffered quite a bit! As Beau E. said there is a good amount of 'kitschy' type signs hanging outside. I might give Lemongrass one more shot but it is not looking good:("], ["Sarah J.", "Since my original review of lemongrass I've heard there's an issue with consistency. I can't actually tell you about that because after inviting friends to lunch here today there was such a variety of awful smells that we actually had to leave because my stomach was hurting from it. We all had different opinions on whether it was the bathrooms, blanched veggies or two day old fish, but it was safe to say, at least in the area where we were sat, it was a deal breaker. I hesitated to bring this to light here, as maybe there was just a bathroom issue and it was a one off, but I was pretty disgusted and I hope they can fix the issue. I'll try again -- without any friends who I've promised a great experience."], ["Maura C.", "I haven't ever been in here because every time I have driven by it looks empty. Come to figure out you can't see the dining room from the front! It was very good! So glad we tried it. They have GaPow on the menu which was my favorite dish while visiting Bangkok last year. It was delicious and very much like the dish I had in Thailand! Spring rolls were wonderful as well. Our waitress was super sweet and we talked about my recent trip and she was just lovely. Only complaint was the funky smell - everything looked clean but they need a Plummer or someone in there to figure that out! I'll be back for phad Thai soon!"], ["M L.", "Everything was delicious and the service was wonderful. We had the Phuket rolls, crab rangoons, and pad thai -- we left with happy tummies! Thank you, Lemongrass!"], ["Christina M.", "We ordered delivery via GrubHub and it was delicious! The Udon noodle soup and green papaya salad were wonderful. We would definitely try their food again. The tempura was a little greasy, but this is probably because it was delivered instead of eaten in-house. Mango sticky rice was yummmmmmy!"], ["Melisa V.", "Headed here after the Yelp event last week after realizing we wouldn't be able to find a place downtown without an hour wait.The manager helped us and talked us into ordering lemongrass martinis, which were amazing. He disappeared for a while before returning to take our order. It was definitely an eclectic menu and we enjoyed everything we ordered, especially the spring rolls. The dish I ordered, the pad khee mow, was my favorite and as good as I've had elsewhere. The seafood combo and curry we ordered were also very good.I look forward to returning to try more on the menu."], ["Trista C.", "Great food, cool ambience, nice staff. The dining room is well decorated. We dined on a weekday, so it was not crowded. There were flat screen tvs showing images of Thailand. Our Favorite dishes pad kee maw sweet and spicy yellow curry has carrots, potatoes, spice and is great! The Tom yum great combo of lemongrass and coconut milk. The portions are generous and the vegetables were fresh and plentiful as well. We will definitely eat here again!"], ["Mary Q.", "I love Downtown OP! This place delivered to the salon I was having my hair done at. :) Food was warm, delish, and fresh. Pad Thai was plentiful, crab rangoon was crispy and flavorful. It was nice to have tasty food that didn't taste like grease. Hoping to try the fried rice next time"], ["Nicole J.", "Best Thai I've ever had!!! Sooo fresh and incredibly friendly staff, and super informative about the menu and Thai cuisine!"], ["Audé N.", "The food used to be better and the service is not very good. Very disappointing.We had gotten carry out from here before and it had always been great until today. The mild dish was unbearably hot and I had to send it back. When I asked for some rice to go with the \"fixed\" dish I was charged extra. The people in the tables near us were also complaining about the hotness of the mild dishes and were having a hard time eating them."], ["Heather W.", "Oh my YUM! I am so excited to get awesome Thai food closer to home than Westport. Their curry and pad Thai win. Helpful and smart waitress overcame our doubt at the slightly confused hostess. We will be back!"], ["Irma S.", "The Galanga soup is excellent. I went with two more friends and we ordered the pot, very nice presentation with the flame to keep it warm. We ordered it mild because I am not a big fan of spicy food, it was perfect. My friends added some spicy sauces they brought as sides. The service was very good."], ["Tina H.", "My bf and I stumble upon this place while we were driving, this place is beautiful and the staff is really friendly but the food wasn't great it was just OK."], ["Tobin P.", "Back door is broken, so I had to walk around the block to the front door. No big deal, things break The inside has a very nice ambiance. Nicely decorated and good chill music. One thing that didn't make sense was that they had large flat screen TV s playing some type of Thai cooking channel. The food was good. I had the red curry chicken. There was a taste of black licorice that i wasn't used to but i still enjoyed it."], ["H H.", "I've eaten here a handful of times now, dine-in and carry out and every time it's amazing. I haven't had anything bad here. The Phuket rolls are amazing, as is their crispy pork belly Gapow at dinner time. Go here! Or get takeout. They have great lunch specials and some of the best crab rangoon I've ever had (you get a crab rangoon and a hot and sour soup free with lunch!). Seriously, this place is a gem. The staff is so wonderful and friendly, they remember your face if you come in multiple times."], ["Tim S.", "I had the Spice Beef and Scallops for lunch and if was great. Large medium well cooked flanks of steak with juicy scallops. The scallops were on the small side, but I'm not too chapped since it was less than $10.Too many Thai restaurants are cooking American-Thai food with too much sugar and salt.  This was not the case here where the sauce was flavorful, but light.Give them a try."], ["Jason C.", "I have eaten Thai food all over the place, including my own kitchen. I've eaten at the best places in Thai Town in Los Angeles where every billboard is in Thai. I've eaten at the best Thai places in Kansas City. I have to say that this place is hands-down the best in Kansas City. My only complaint is that the menu doesn't have more items. But, I would rather have excellent quality than excellent quantity any day of the week.The waiters had a little extra time to talk to me tonight because it was slow due to the weather, but they explained a few things about why it's better. For example, real tamarind instead of vinegar in the phad Thai. I usually don't even care too much for phad Thai... but it was worth trying here. Also, importantly, they don't use the same coconut milk that most Thai restaurants do... They use coconuts and turn it into the coconut milk there themselves, and fresh. It makes all the difference in the world. I mean, ALL the difference in the world.Plus, there is never an objectionable cut of meat here. You can tell that they paid attention to every detail, including not using cuts of meat that might have a little extra fat here and there. Particularly the gristly kind that we all run into from time to time at restaurants. You can tell that these guys really care, really want the business, and really want to succeed... And it's all right there in the plate. Right where I like it. If it's important to you, the atmosphere is also nice. I'm not much of an atmosphere guy... I like to focus on the food and the value for the money there. But, the atmosphere is plenty good.In the process of chatting me up about all the particulars, the waiter decided to bring me a free Thai iced tea. And, it's going to sound stupid, but even it was better than any other Thai iced tea in town. Seriously. I could tell that it was brewed nice and strong, and that the creamy milk on top was plenty fresh. I can't wait to go back again. I suggest you get down there asap. I don't think you will believe just how good it is. It is truly a cut above.  Beyond beyond."], ["Cornelia H.", "Delicious food! Excellent service! Will definitely go back!"], ["Pam T.", "Delish! I can't wait to go back during happy hour. We did take out for our first visit :)"], ["Nancy B.", "We were thrilled to try this restaurant and were very impressed with the decor and the initial service.  We got our appetizer right away, and I received my meal (pad thai) within 10 minutes afterward.  However, my husband didn't get his until 15 to 20 minutes after that.  Having waited for his plate to arrive, mine was already cold.  Those around us were having a similar experience with the spacing of entrees.My husband's food was undercooked and despite asking for an extra plate multiple times, we never received one.  All in all, it started out well, but ended terribly.There's a lot of potential in this place, but it was a terrible dining experience."]], "Thailand Restaurant": [["Joshua C.", "This was the First time I had ever been hear. Have heard nothing but Great things about it. Boy were they Right. This Place is FANTASTIC!! The Crab Rangoon is to die for. The Rice Dishes are out of this world also. First Time there and i will be back for sure!!!!"], ["Donna Y.", "This is a small restaurant and they keep it classy. Cloth napkins and tablecloths. The food is amazing. Check it out! Light and fresh...beautiful presentations. The Thai tea and Thai coffee are delightful. My second favorite Thai restaurant. :)"], ["Lindsey E.", "Oh how I love pad thai!! Although not the best I have had it is fast, friendly service, and good thai."], ["Jessica L.", "Great Thai restaurant! I've been here a few times. The service and food is always good. I love their curry dishes."], ["Mina A.", "Very small portion for that price.  The ingredient wasn't anything expensive, but the price they charge is way over priced.  The Thai ice tea was good and reasonable priced other than that, I don't find much to say about this place."], ["Joe S.", "Love this place, great food, the curry is the best I've had in Kansas City and the spring rolls are amazing."], ["Jessica S.", "We had a great experience here. The service was great, the food was excellent, and the ambiance was pleasant. We'd give this place 4.5 stars. Appetizers: We ordered the Spring Roll Deluxe appetizer and both the soft spring rolls and the Thai egg rolls were a hit. Great flavors and super simple.  My husband ordered the Galangal soup and the broth was delicious.  We also enjoyed the chicken satay. For our main entrees: I ordered the Spicy Thai cashew. Garlicy. Spicy but not too much. All these flavors melded together into the perfect blend of spicy sweet with a touch of heat. Yellow curry, beef - curry sauce creamy, sweet, and savory. The beef was a tad overcooked.  Phase Sea Eaw, shrimp - delicious, good shrimp, and the noodles were perfectly cooked. (My 8yo)Overall, this was a great place and if we lived in this area we would most definitely come back."], ["Reed N.", "Pretty and tasty Thai cuisine.The soup I had was rich and delicious. Galangal soup.. love galanga root flavor, red chili paste, coconut, fish sauce, and a touch of sugar. So good.Service was excellent."], ["Steven C.", "We were here two years ago and I would have said it was O K for eastern Jackson County Thai food, which is damnation by faint praise. Tonight was a different story. I had green curry chicken and it was great. On the brink of too sweet, but balanced out with the perfect degree of heat. My wife had the eggplant curry with beef. Also excellent.  I tried some. Spring rolls were heavy on the lettuce, but this seems to be what you get everywhere these days. It's called cheaping out. Portions are not as big as in some places, but most restaurants give you too much.  These dishes are reasonable for the price, which is about $10 for a curry dish if you don't get shrimp or seafood.  So now this place is good enough for western Jackson County or possibly even Johnson County."], ["Justin E.", "One of my favorite Thai food places. Yes my favorite thai is located in Blue Springs MO...Nothing on the menu is bad. I can order with my eyes closed and know I'm getting something amazing. The servers and owner remember us and give us that familiar hello good to see you when we walk in. My only grip is since they moved (used to be Bau Thai) they've stream lined their menu and took off some of our choice entrees. That's ok, I'm just happy they didn't go out of business!"], ["Cassie L.", "While the food is good, portions can be very small for the price.  Service is also inconsistent.  Went the other evening and there were two wait staff.  Took 1.5 hours to get our food.  Kept having to ask for drink refills.  No apologies or anything..."], ["Katherine A.", "YUM! Great food! Fresh, not greasy, kind of sweeter sauces. Broccoli Beef was great! Very fast service, and friendly staff. I would definitely recommend this place, as it was just off the highway in a newer strip mall. Just behind the Taco Bueno."], ["Kaylin T.", "The portion size is horrible. My husband, kids and I stopped by after work at 8:40pm. They close at 9pm, so we felt bad and didn't want to make them stay late waiting on us to eat. Instead we ordered to go. We should have checked the to go box for the amount of food. We bought two entrees and soup to go. We discovered when we got home, the amount of food they have given us only covered my husband or myself eating. Each entree box was 1/3 full and the soup had more liquid and about 10 pieces of food. For $36 of food to feed one person definitely does not make it worth the stop. I had to go ahead and make more food at home to feed the kids and myself. No point in stopping at this restaurant to eat to avoid cooking, if I had to cook anyway and so late into the evening. Next time, I'll drive a little further towards Kansas City for Tasty Thai or Thai Place...."], ["Marie B.", "I am not an expert on Thai food, however I won't be looking any further on trying new Thai places. I had the Vegetable Red Curry which had eggplant, green beans, broccoli, napa (I think) cabbage, and other yummy vegetables that I can't remember right now :) I ordered a Thai Iced Tea which was a little sweet for my liking, but I still drank the entire thing. I will be getting two meals out of my curry dish which came with a side of Jasmine rice. My dish was about $11 which at first I thought was a bit much but THEN when I inquired about my dish and if I could get the cabbage at any local grocery store (with the intention on trying to make this masterpiece in my own kitchen), she told me they buy their stuff from the City Market!! So the price is well worth it. I love supporting local restaurants, especially when they are also supporting local."], ["Melinda H.", "I really wanted to like this place, but sadly did not. We started off with fried spring rolls & they were greasy & not a lot of flavor. For my meal I had their galangal soup which I asked if it was like Tom Khai Gai & she said yes....it was not. I ordered the large bowl & it was the smallest \"large\" bowl I've ever ordered. It was also very sweet & really the only flavor was coconut milk. My daughter had the Pad Thai & it was bland. My son had the Thai Noodle Soup & it was salty & bland also. My husband had Panaang Curry & it was very small & not a lot of vegetables. I also think the portion sizes are very small for the price considering what you get at other Thai places in the area. We love Thai, but this just really missed the long-boat. ;)"], ["Jack W.", "Ate here for the first time tonight. It's a billion times better than the old Thai place that used to be across the street. Very nice inside which I didn't expect for Blue Springs. We had 3 types of rolls including the spring rolls (ok) and the cream cheese roll (to die for!). I've never been a big Tai fan as I'm not a big veggie or curry person but this place was impressive. We had the Red Curry and Pad Thai both of which the plates got licked clean. I was even contemplating bringing some home for tomorrow it was that good. I highly recommend this place. A little pricey for what I want to spend when I eat out but for how good it was and the location - I'll for sure be back!!!"], ["Jordan B.", "Hands down the best thai food I have ever had.I have been going here with my family for over a decade. They know our order right when we walk in the door--All you need: The Three Kings, Panang Curry Chicken, Pad Thai Chicken & Shrimp, Fried Rice.It's amazing and never busy. MUST TRY."], ["Kati M.", "This is one of our favorite restaurants in town. My boyfriend and I always start with the crab rangoon! I love them because they aren't super thick like some places. They're just crunchy enough with the perfect amount of filling and a delicious dipping sauce. We split the Pad Thai which is a generous portion. He gets a side of fried rice which he loves and I get the Galangal soup. It's SO amazing! I give the food 5 stars but the service is not always up to par. There is one waitress that always seems to have a bad attitude and we've had her a couple of times. We even went on a slow night and had to wait 10 minutes before she even took our drink order. But honestly the food is so good that we keep coming back!"], ["Kathy K.", "On a Thursday @6pm, it was pretty slow. Only 2couples seated.  A bit slow at table service, but Accommodating. Nice soft jazz style music in background. Cloth napkins, vinyl tablecloths.   Ordered the Galangal soup, a coconut based soup with mushrooms and your choice of meat. I chose shrimp and was happy with the presentation and warm mellow flavors. Not too much coconut flavor, but just enough to complement the other ingredients.  The cup size satisfied for appetizer. I moved on to vegetable yellow curry. It came served in a bowl with a generous variety of vegetables, not loaded with potatoes like other Thai restaurants.  You can tell that care was taken to prepare the meal. The curry was flavorful and just the right heat. It was served with a healthy portion of Jasmine rice. Overall, nice presentation and provided me with a very pleasant experience. I will return"], ["Renee W.", "Love the food here. The restaurant is very quiet, and the owners (it is family owned and operated) have remembered us since our second visit. We did receive cold food here one time recently, so that's why I left 4 stars instead of 5."]], "Tasty Thai": [], "Spices Asian Restaurant": [], "Thai Spice": [["Mike A.", "This is our second time eating here. The first time we sat down for a late lunch. Our server assured us that the Chicken Pho was better than any Vietnamese variety. I had my doubts but we tried it anyway.It was as good as promised! The Pad Thai was quite good as well. I got it one notch below \"Thai hot\" which was perfect for me.This time we got carryout for lunch. I have to mention the care they took in packaging. The Pho broth & chicken was in a tightly sealed plastic container and then wrapped in plastic wrap. They included a clam shell with sprouts, rice noodles, fresh basil, & sliced onions.My dish, the Tamarind Chicken, was in the usual clam shell that they lined with aluminum foil. A very nice touch to me.The Pho was it's usual state of perfection. This was my first taste of Tamarind Chicken. I think it may be my favorite dish, even better than the Pad Thai. Unless you're familiar with tamarind, I don't know how to describe it. The tamarind flavor is present in every bite but not over powering. It was served with steamed rice & steamed veggies. An absolutely wonderful dish. I can't forget to mention the staff. They were attentive & informative without being over bearing. When I went for carryout, I was served a glass of ice water & a bowl of hot & sour soup while I waited."], ["Anshul C.", "Tonight was my first time at Thai Spice and it is now officially my favorite Thai food in Kansas City. The menu is expansive and EVERYTHING sounds amazing. My group of four ordered the crab rangoon, red curry, black soy sauce noodles, yellow curry, and Thai spice fried rice. Everything was delicious. The crab rangoon had very thin wrappers and made for a lighter appetizer. Each entree was huge and allowed us to have enough to have some lunch for tomorrow. Basically GO HERE!"], ["Rebekah S.", "This place is awesome, great food, a little bit expensive but worth it.Crap rangoon taste great chilli chicken the best!"], ["Lacey L.", "I give it 4 stars because we went in to order and they were rushing around because they closed at 3. We had said 2 orders of spring rolls they brought us out 2 orders each so we sent one back in. We then ordered entrees and the chef had read one of our orders wrong so it took longer for one of the entrees to come out.Overall the restaurant was very clean, the food was good and the employees were nice."], ["Shawn B.", "The girls in the front of house were very friendly and helpful.  But this place is very expensive for what you get, which would be OK if the food was worth it.  It is not. The fried calamari was rubbery and had very thick breading.The combo Pad Thai was the worst I've ever tried.  Overall it was bland. The chicken and beef (what little was in it) was dry and overcooked.  The 2 pieces of shrimp that were in it were so hard and rubbery you could play miniature handball with them.  The crab fried rice smelled bad, like bad fish.  No, it's not imitation crab, but it's not very fresh crab either.The sesame chicken was the best dish.  Very flavorful sauce.  But again, the chicken was dry and overcooked.I was definitely looking forward to having a Thai place in Independence.  But at these prices and mediocre food I'll stick with my regular Chinese joint on 24 Hwy."], ["Michael H.", "So, I've been here a few times and HIGHLY recommend it! The ingredients are fresh, the food is excellent and very authentic. The service is fast, but not always perfect. Though if they make a mistake, it is corrected very quickly! And the food is always served steaming hot! The restaurant and bathrooms are very clean and the walls are simply decorated with food porn to make your mouth water like a cartoon character from the moment you walk in. Also the prices are right on for those of us on a budget. With HUGE dinner portions and lunch entrees that come with soup and the appetizer of the day, you will NOT leave hungry. I've been to both locations a few times and they've been consistant on every visit. I've also tried about half the menu, which is impressive considering how many options there are. Hard to pick a fave! But if I had to choose one it would be the very craveable Drunken Noodles with chicken. Slightly sweet, house made chili paste sauce, but balanced so you can taste the basil, ginger, garlic, etc.. They also offer a few different fried rice dishes, like crab fried rice (YES CRAB, Weeeeeeeee) and Pineapple fried rice (normal fried rice ingredients plus pineapple, chicken, shrimp, cashews, raisins). The Garlic Pork and Ginger Delight w/ chicken and lots of veggies are also faves! And don't get me talking about the curry's or I'll never stfu!Like the walls, the menu has lots of tantalizzing pictures to help you choose the right dish. And of course you can choose 4 levels of heat to suit your palate. Thai HOT for me, but I suggest a Thai tea to help keep the burning in check! The soups and appetizers are all done very well. Pretty much everything I've eaten there just makes you want more from first to last bite! Even the freaking steamed white rice served with some dishes is excellent, perfectly cooked and floral! And many menu options allow you to choose chicken, pork, beef, shrimp, all veggies or tofu. That makes it hipster friendly, right?Anyways, I am usually planning my next meal there while paying the bill, haha! Yep, it's that good, people! SO let's review, fresh, fast & very friendly service, hot food, great price and BIG portions! Why are you still reading this review, JUST GO THERE! NOW!!!!!!!!!!! You will probably see me there with a creepy smile on my face and drool dripping down my chin...."], ["Charley B.", "The last place I would have thought to look for some super tasty Thai food would be a strip mall in Independence so I'm glad that my friend turned me onto this place.The restaurant features a lunch and a dinner menu and of them I've only had the lunch. I do like the specials, which are reasonably priced between $8-$11 and feature a main dish that includes a crab rangoon. If you like a little heat then this is your place. I ordered medium heat and I could feel the warmth on the top of my mouth.  The dishes aren't overly large, but filling so you won't go home hungry.I know it's a bit out of the way, but it'll be worth it."], ["Nick K.", "Have only gotten one order to go, as it's convenient to work.  Sesame chicken was delicious and plentiful.  Had enough for a snack later that day."], ["Davis A.", "I absolutely love this place. My favorite is drunken noodles. The fried egg rolls are awesome."], ["Jin K.", "Have been here twice & won't be the last. It is our favorite place in Lee's Summit, I can't believe we have not tried this place sooner! Thom yum soup is amazing, probably one of the best we've ever had. Usually it is too salty but not here, just soothing as can be. Pad kee mow w/ beef is savory, I've had it twice! Need to try some other dishes but that's my favorite Thai dish. Service is great, very attentive w/ a smile. Living in LS, it's nice not to travel to KC to get a great meal!"], ["Matt H.", "I love me some Thai food.  So I stopped in here because it's convenient on my grocery day and had some lunch.  To start with, it's worth noting that the meals here run $11 - $14, rather than the more typical Chinese takeout joint price range of $8 - $11.  This would be fine for a place with upscale food, like the Thai joint in Westport.  Unfortunately, that isn't the case here.  I had an order of what was advertised on the menu as 3 eggrolls for $6.  I was hoping for 3 nice big eggrolls, but instead what was served was 4 tiny (think pinky finger sized) spring rolls.  There was nothing wrong with them per se, but they were filled with only cabbage and carrots, and did not have meat in them.  These were served with a nice sweet dipping sauce that was quite good.  For my entree, I had the Thai noodles with shrimp from the \"Chef's specialties\" on the back of the menu.  I asked for it hot, and with shrimp the entree was $14.  It seems like the only source of heat on order for this dish was to simply use a lot of chili oil.  While the flavor was good and the spice level was good, this meant the dish was very oily.  Thankfully, Costco has well-maintained restrooms.  The Thai Spice chef owes the Costco staff member who has to clean their restrooms an apology.  The amount of oil in my entree literally turned my colon into a luge.  The shrimp were fairly sparse for being $2 extra and at $14 total, I wasn't particularly thrilled by what were obviously frozen shrimp that hadn't been thawed slowly.  All in all, I probably won't be back unless they either up the quality or lower the price.  The service was good, food came out in entirely reasonable time, and the girls were right on top of my beverage.  The restaurant was clean and in good shape.  Had they used less oil on the entree and had it cost $9 - $11 instead of $14, I wouldn't easily given this place 4 stars.  The quality/price ratio just doesn't stack up, and the amount of oil in the dish was an unforgivable culinary sin."], ["Rachelle H.", "I loooove Thai food and have had Thai food from several different cities and states.Thai Spice is one of the best!!! So good (hidden in a strip mall)Definitely recommended!"], ["Bruce C.", "All I can say for now is Yumm. Fresh, delicious, fast and friendly. Try them you won't be disappointed. I will return."], ["Lindsey E.", "Absolute favorite! Frequent customer and have always had great food and service! The pad Thai is amazing, crab fried rice is also a hit. Spring rolls are always a must. Great lunch menu as well."], ["Jenn W.", "Delicious!!!  We haven't had decent Thai in a long time and this place was a pleasant surprise!!  The portions are large too which was nice.  I love spicy and a lot of places are afraid to lay on the heat!  Not this place!!  It was make you sweat, nose running spicy!!  We will definitely be back!!"], ["Sam R.", "Very enjoyable lunch experience,.. Good food & good service,. I didn't give 5 starts simply because I just don't hand out 5 starts unless I find service and food very exceptional"], ["Karla C.", "Great food,  excellent service, very clean and inviting!  The music played during our meal was so relaxing and I really enjoyed it, as so many places it's overwhelming. Its pricier than fast food, but its fresh and very good, so its worth more!  I will definitely be back!Went back yesterday and was not disappointed.  Excellent wonton soup!  I really could eat here frequently.  The fact that there is no MSG makes it even better since I have an allergy to it.  We tried a couple of the desserts as well, and again, very enjoyable.  The staff is very pleasant and know how to give good service.  This remains a 5 star for me."], ["Matt G.", "Haven't had a bad thing yet. Highly recommend the Tiger Beef Salad with the Hot N Sour soup."], ["Leslie S.", "Great food! Could play some Thai music instead of bad pop songs!"], ["Ryan G.", "Great food, awesome staff, good prices. I go here at least once a week usually, and even my fiancée, not an adventurous eater at all, enjoys this place. The pad Thai is perfect, so is the Thunder Chicken and pineapple fried rice."]], "Mint Asian Cafe & Sushi": [], "Lulu's Thai Noodle Shop": [["Richard S.", "3.5 would be my overall score if that were an option. My impressions:Ambience:  Funky feel that matches the neighborhood. I liked it, but it's not the traditional Asian look. 4 stars. Service: no problems here. Service was attentive without being too intrusive. 5 stars. Food: Just Average. I've eaten at numerous Thai places in several states. I chose Yellow curry with Chicken Satay as appetizer. And splurged on Iced Thai coffee. My food was good (I ate it all), but nothing that said \"Wow\". 3 stars."], ["James L.", "Edit: I did not have a good review of this place initially, but the owner seems to genuinely care for his/her customers and our reviews, so I'll give you guys a better rating and maybe try it again next time. Thanks.This place was way below my expectations. We ordered bubble tea, but they all tasted weirdly bland and the strawberry tasted nothing like strawberry whatsoever, but like a bland water mixed with food colouring gone wrong. The foods were ultra salty and the meat was utterly low quality and all tough in a bad way. We will never be back to this dumpster again."], ["Erin W.", "Based of suggestions of other yelper's suggestions, I tried the Tom Yum soup (minus mushrooms) and it was FABULOUS. I could've had an entire bowl of it alone. I also got the lunch version of drunken noodles medium. It wasn't very hot, at all...which surprised me since the soup was more spicy than the noodles. After adding some sirracha, it was good. We had drinks (can't remember the names) but they were excellent. My friend was wanting desert, so we also got banana chocolate rangoons. They were good, but I was so full that I couldn't enjoy them as much as I could've. Our server was super friendly and we had a great lunch."], ["krysztof n.", "First of all, food's great.  Never had a bad plate there.  Secondly, I just dig the vibe of this joint.  It's in the Crossroads, so automatically a great location.  But I think the biggest thing about it is that you could be sitting in this place and honestly be sitting in any other major city in the country. What I mean by that is that it's got the vibe and decor of an establishment that's not saying \"We have to tone it down because we're in the Midwest.\"I appreciate that the ambiance of the place is angular, and has plenty of textures that harken to the history and locale of the food that they serve, in a po-mo con-glom of Asianality.  It's \"street side food stall\" meets \"cooly elegant\".Which, is such a welcome change from many ethnic restaurants that are just so damn bland.   I'd so much rather go to a place like LuLu's that's trying to...well, trying to have more fun!Whether you're in the Crossroads for artwalk, taking a client to lunch, or introducing the kids to some new plates to expand their palette, LuLu's is just an unquestioned go-to spot."], ["Layla M.", "My husband and I went here for lunch today.  We had hesitated a few times die to the admonishment on the website about lunch reservations. Today, we just decided to go at 11:30 (a little earlier).That proved to be a good idea: we watched it grow busier and busier.  All of the staff was cheerful and friendly.He had the satay and I had a lunch special, drunken noodles.  My order was so plentiful that I almost immediately handed half to the waiter to wrap up for me.It was delicious! I ordered it \"hot\" instead of \"blazing\" (my first inclination), but I was scared that it'd be too hot. I was a tiny bit disappointed, but now I know! We were very pleased with every facet of the experience."], ["Jamie V.", "I had heard great things about Lulu's and was excited to get dinner there for the first time a few nights ago.First of all, I loved the ambiance.  Lulu's is located in the crossroads district, and had a urban, funky vibe to it.  I particularly enjoyed the background music...think The Killers, AWOLNATION...that type of stuff.  I enjoyed it thoroughly.On to the food--we started the night with beers (Saigon for him, a local Boulevard Tank 7 for me) crab rangoons, and calamari.  Crab rangoons were delicious, though I feel it is hard to mess those up.  I liked the calamari, especially the sriracha aioli that came with to dip them in.For the main course, I got the Ba'nh Mi sandwich with the pork.  I thought the sandwich was a tad bland but once I drizzled some sriracha aioli on it, it's tasted pretty good.I was sorely disappointed in dessert--we ordered the banana chocolate rangoons and something was just off about them.  I'm thinking hot cream cheese is better left to more savory options (ie crab rangoons) and best left out of the sweeter things.Overall I liked Lulu's and will return to try one of their noodle dishes some time."], ["L B.", "Pros: easy to get a seat, good tasting wings, friendly staff, rainbow noodles were delicious, fun and funky decorCons: massaman curry had no flavor, took awhile to have plates cleared - appetizer plate was still on table when entrees came, service was a bit slow"], ["Chris L.", "I loved my meal and my server was amazing!"], ["Kevin H.", "I really like this place. Awesome dumplings and really good lunch specials.Parking can be goofy, but it is well worth it."], ["Stephanie T.", "The Pad Thai was very bland and despite my request to make it as spicy as possible, it leaned more toward the sour end of the taste spectrum. The service was alright, but slow. The setting and ambience was nice. Would not return again unless desperate to fulfill my pad thai craving and all other options were already exhausted."], ["Angelica E.", "Horrible food, service, and cleanliness is questionable! I would rarely comment on a restaurant this bad as i find its not even worth a review  but it is a shame they get rated a 3.5 average even for Kansas City. I would hate for other out of towners to be deceived. This is thai food and noodles at their worst. Overcooked, overly sweet and salted and certainly camouflaged in spice. Truly a waste of time to park and pay for parking at that. The service staff engaged in clearly to much personal conversation to be trusted with handling food well and i am certain the health department needs to spend more time here"], ["Michelle B.", "Easily one of my top 3 favorite places to eat in KC. Things I love:-Hardly ever have to wait more than 5-10 min for a table-Try the drunken noodles. They're fantastic.-The lettuce wrap appetizer is also delicious"], ["Matt R.", "Bright friendly urban atmosphere and great food. Their crab Rangoon and the plum sauce as well may be the best I have had. Great place to get my spicy noodle fix."], ["Jordan P.", "I've been going to Lulu's for years but I think I'm finally over it. I originally ate here because of the gluten-free options that they seemed pretty serious about. I have celiac and react pretty badly so I'm always happy for a new place to eat, but over the years the quality has gone down, the service has been spotty, and the food is hit or miss depending on who's working. It's just not that great. Additionally, if you're a celiac, it's very likely you'll get glutened here from cross-contamination or something. I never used to, but have the last three-four times. I've also had subpar service and the spice level is never consistent. I'm sad because Lulu's used to be a staple for me, but I don't think they care anymore. Go to Sweet Siam in Kansas instead."], ["Katie S.", "Amazing food. Great service. Wish I lived closer so I could go more often!  Vegetarians- be sure to ask for the non-meat menu!  Takes all of the guessing out of deciding!"], ["Sarah S.", "I really liked Lulu's quite a bit the first time I visited. Regrettably, I will never go back after the experience I had today at lunchtime. The food was mediocre and the service was just dreadful despite the restaurant being less than half full. The waiter was inattentive and totally unapologetic about it. He only came to our table three times - to take our order, to bring our drinks to us (FINALLY!) mid-meal and to bring the check. I ordered an entree to-go for my husband and when I got home I realized that he didn't even get the order right. $12 down the drain. I found pieces of shrimp tail in my leftovers too. Ugh. The employees seemed much more interested in socializing with the kitchen staff than paying attention to customers and it showed in every aspect of my experience at Lulu's today. I deeply regret having left such a generous tip; it was not earned."], ["Davis N.", "Went in on a first Friday.. Place was packed waited maybe 30mins?well my first time ordered the calamari app and papaya salad. Calamari was totally cooked in dirty oil and the papaya salad was just gross.had know idea what i was eating. overrated and the lighting is dark for a reason"], ["Michael I.", "This place is the best, and my personal favorite place in Kansas City to eat noodles Thai style. Fun, friendly atmosphere, with a fully stocked bar, seasonal boulevard smokestacks on tap, neat little fountain to gaze at if you have to wait (usually only 5-10 if there is even a wait on Sundays) and also located in the artistic crossroads district. BEWARE: You can order your food at different levels of spiciness and if you ask for hot or insane hot--they aren't kidding around back there in the kitchen. I happen to love spicy food so one day I was feeling rather bold, ordered it at the hottest level, and it left me feeling like a sweaty mess! It was rather intense but not bad by any means. So, medium is my favorite, as it is just right and leaves a little room for my beloved table side 'Rooster' hot chili sauce, but remember, do not, and I mean DO NOT disrespect the Rooster, or the Rooster will disrespect you: initially and again several hours later.Favorite dishes:1. Lulu's Pad Thai2. Combo fried rice3. Rainbow pad ThaiOh yea, and you can have fried garlic crumbs to put on as you please as we'll if requested."], ["Tim M.", "First impressions this place seemed pretty cool then you walk across the sticky floor and it all starts to fall apart. The appetisers were pretty good but as for the entrees..... bland is an understatement. I had chicken pad thai which had no flavour at all. The chicken was either boiled or microwaved, gross. Thankfully there were some condiments on the table to help however we had to pay 75c just to get some extra peanuts. Pretty ridiculous for a $12 entree."], ["Brandon B.", "I feel bad for not leaving a review 2-3 years ago when we first tried Lulu's. At that time it was our favorite place and we ate there every couple of weeks. We always encouraged our friends to try Lulu's. About 5 months ago our experience was not good and they have been worse and worse each time since. The service has been poor. We would often go for a late lunch when there were only 4 or 5 customers in the place and  we waited 15 minutes to have our order taken. When we were done we waited another 15 minutes to get our check. The chicken has been dry in the drunken noodles. The beef started looking more like beef jerkey and has not been good. Today the green onions smelled and tasted like they were rotten. We have been going less and less over the past 5 months in hopes that it would eventually turn around. Today was our last time visiting Lulu's."]], "Sweet Siam Thai Bistro": [], "Thai House": [], "Thai Place": [], "Hot Basil Thai Cuisine": [], "Pad-Thai Restaurant": [["Bobbi T.", "After seeing all the great reviews, I knew I had to try this place.  I was waiting on a Groupon or something before I tried this place but it was taking too long so I was starving and in the area so we decided to give it a try.  I feel like maybe my expectations were too high from all the yelp reviews...or maybe it was an off night for them?  We decided to order the crab rangoon, pad thai and pad kee mao. The best dish was probably the pad kee mao, but I'm a bit of a noodle snob and wasn't feeling the type of noodles they used for it.  The flavor for the pad thai was good, but maybe it needed an extra scoop of sauce mixed in?  Normally I like food a smidge blander than the normal person, but it was pretty bland!  I thought the crab rangoon were decent.  Everything was just ok. nothing that makes me want to go back for. The service was great.  Very friendly!"], ["Cheryl B.", "The BEST Thai food in Kansas City... Hands Down!!!   We have been to SEVERAL Thai restaurants in KC; which were good, very good in fact but they have nothing on this place!!  The service was SPOT ON!  They treated me and  my son like we were their only customers all week!! Very attentive and fast!!  We started with the crab rangoon--- AWESOME!!! The two of us devoured all 8 pieces!!!  I had the drunken noodles with chicken & shrimp for my meal at a medium heat; it was the best! I will say however, that their medium is my idea of medium/hot!  My son had the chicken fried rice with no heat and he really enjoyed it.  We brought home some shrimp fried rice for my husband and he said it's the best he's ever had and reminds him of the way they make fried rice in Springfield, MO.  The decor is nice and elegant, great background music.  As it gets dark out they turn down their lights and light a candle on each table to add to the ambiance.  Will we be back?? Yes!! Will I be craving this again until I return?  YES!!"], ["Kelly R.", "Favorite Thai restaurant in KC metro. Everything we've tried has been delicious. Hands down best Pad Thai around. If you ask for spice, you really get it, which we love! The crab rangoon appetizers are wonderfully light and paper thin. Yummy! We are carry out regulars and have always had great service."], ["Nina R.", "There's new ownership now. I'll rescind my previous comments. The food is great and the service is ten times better!"], ["Cornel F.", "By far the best Thai restaurant in the mid west. Every food we ordered (papaya salad, green curry and tom yang gook) came freshly prepared. We will be back!!"], ["George W.", "Our order was late coming, but staff was more than eager to make up for it. They brought free dessert-unprompted- as I never complained...Food was excellent! You will love the seafood pad Thai and the Tamarind chicken. I will definitely go back."], ["jennifer j.", "No plans on a Saturday, so plenty of time to haul butt out to BFE and eat Thai.  All the great reviews drew me out to this location, especially the pictures of the food.  I also was sucked in by the pictures of the modern and clean decor AND outside seating!  How many Thai restaurants have outdoor seating?  I can only think of 2.When we walked in around 8 pm, there was only one table left.  They quickly got it cleaned up for us and we were seated in 2 minutes.  Service is swift and attentive, but not overly so.  It took me years to realize that there is no stopping the Thai kitchen express train.  Instead of hoping that any Thai restaurant in America will pace our food, I have learned to pace my ordering.  This place is no exception.  My soup came out and 2 minutes later, my entree.  I did not pace my ordering this time....I just forgot.  The food.  The food is super fresh, beautiful on the plate and bursting with mouthwatering flavor.  I tasted my husbands entree and while it looked very similar, they flavors were worlds apart.  However, we both had \"medium\" spicy and my husbands entree was definitely less spicy than mine.  I had the Tamarind Chicken With Green Beans.  It had all the components I look for in Thai food, sweet/salty/spicy.  We started with Crab Rangoon and I had a bowl of the Tom Kha Gai.  Both perfect.The space is clean and modern with contemporary music playing in the background.  I will definitely head out there again when the temps cool down and we can enjoy dinner on their large patio."], ["Q M.", "Excellent lunch choice. The lunch entrees come with soup and a crab ragoon.  The veggies were fresh and the shrimp was tender. Only think I didn't care for were the tails left on the shrimp."], ["Brandon L.", "Best pad tai shrimp dish I ever tasted, however lesson from me DO NOT get the very spicy! Lol love spicy but met my match but the taste was still awesome! Nice clean and delicious, plus full bar!"], ["Azile Y.", "The best Thai in KC! I love everything from the noodles to the curries to the stir frys. The owner is the nicest guy EVER."], ["Wennie T.", "Not sure what's happened? (Change of ownership/chefs/recipes) but the last couple of times when I ordered my food here, it tasted different, not as good as it used to be.  And when I called in to place an order to be picked up, the cashier quoted me 15 minutes, however I ended up waiting for 45. Sorry but I will not be back"], ["Courtney T.", "Best Thai I have had!  The owners are the sweetest and truly care about their customers."], ["Deana W.", "Elegant surroundings, attentive service, food stylist worthy presentation  and Thai cuisine to make your toes curl! And, speaking of curling your toes curl...when Yelpers tell you that the Green Papaya Salad is hot...believe them! I love spicy, lip tingling burn, but this is Thai hot!  Beware! DE-licious! But not for the faint of heart.Ahhhh! Yes, now on to the appetizer course. Crab Rangoon, delightfully thin and crispy exterior and a creamy interior. I wanted to eat them all, but 1/2 of them belong to the guard dog opposite me, AKA my dining companion.  So, I'll move on to...The entrée we chose to share was the Pad Thai, and I would say...unequivocally,  the best that I have been lucky enough to be served. We chose to mix it with the fire breathing aforementioned Green Papaya Salad...heavenly!  Perfectly cooked succulent shrimp was added per our request to attain Thai pleasing perfection.The last, final, and so frequently maligned, dessert course...be still my libidinous heart! Fried bananas with green tea ice cream.  Crispy won ton wrappers surround sweet, roasted bananas. Velvety smooth Ice cream sprinkled with coconut...and free!  We saw a Front Flip sign upon entering, and scanned the square... Winner!  Free dessert !  Lucky us!  Cuz I would absolutely pay full price for it the next time that I return, and return I will, cuz, when am I not  in the mood to be served truly amazing Thai food. Derrr!"], ["Maggie C.", "The restaurant is situated in a strip mall, in a nice section of Overland Park/Leawood. Staff were very attentive and very polite. I ordered the tamarind chicken, mild, and required a spice rack. The spice rack had the typical spices and peppers available to add heat to a dish. My entree was very tasty, the only negative was that it came soaked with way too much sauce. Portions are large here, so I was able to take half of it home. Dinner entrees were a bit pricey, I believe my chicken dinner was 14.99$. Oh well, I guess we are in a newly developed section of Overland Park.."], ["Kendra L.", "So good! My husband and I love us some pad Thai. Their crab ragoons were a lot like my blessed money bags from tup Tim Thai. The service was great. We were warned that \"hot\" pad Thai was very hot, and so Husband ordered medium and that was pretty dang spicy. I would for sure go back."], ["Pete C.", "Had lunch today, 6/6/14, at my favorite Thai restaurant, Pad Thai, and ordered my favorite soup...beef pho...wow, they serve it in a giant bowl that it takes too long to spoon out the broth, so I did the next best thing...took matters into my own hands and slurp it up to the last drop in a very primitive fashion without manners and inhibitions. From the look in my eyes, I think I was hungry. The owners were undoubtedly impressed.  The food, no matter what I order, is always great tasting and made with fresh ingredients.  I keep coming back."], ["Tiffinie F.", "Very pleased.  The place is a small intimate restaurant with a patio.  We were greeted by a very friendly staff.  The entire place was bright and clean.   Tables had fresh roses.  We ordered crab rangoon and basil wings.   Hot and perfectly made.   For our main course we had panang shrimp, gapow pork and fried rice.  All had generous serving of meat.  The rice actually was more packed with meat than rice.   Order on the hotter side if you like spice.  They were a little under what I'm used to getting with medium and hot.   The thai ice tea was a nice drink to bring it all together.   Next time I come i'll have to try a adult beverage as they have a full bar.   No complaints and excited to find a new Thai restaurant in overland park!"], ["Elisa L.", "I've never had a bad experience here, the food is always delicious! My kids even love eating here and they are far from adventurous eaters."], ["Tim Y.", "Wow. Literally the best Pad Thai I have ever had and it's my favorite food. This is the first time I have ever liked food enough to write a review. Stop reading and eat here!"], ["Elda W.", "Pat the chef and Tony the \"bestest\" floor manager/server still have my heart and my palate.  I have converted dedicated Midwestern, bland meat and potatoes and barbecue lovers to friends willing and happy to accompany me to Pad Thai Try it with mild spice is you aren't sure, then add to a level that will surprise you.Your own personal balance is key; this restaurant will help you figure out what makes you happy"]], "Bangkok Pavillion": [["Zach G.", "Thanks to Groupon for getting me back to Bangkok Pavillion after a couple years. $15 for $30 - excellent! We were the only people in here around 5:15pm on a Wednesday, but a few more tables filled up afterwards. Nonetheless, it was quiet and service was great as a result. Not to say it wouldn't be with more people...I'll just break this down item by item:Beef Satay app - Absolutely delicious. Four skewers of nicely cooked (char-grilled) beef, with two different sauces - a peanut sauce, and a cucumber sauce of some kind. Both were awesome. It came on a bed of cabbage/carrots with a couple small pieces of bread. Gang Dang curry with beef - Ordered with four stars of spiciness (out of five), and it definitely had a kick to it. It was filled with a good amount of beef that didn't seem to be the best of quality but was good enough. Lots of peppers, peas, bamboo shoots and coconut milk. Very rich and flavorful.General Tso's Chicken (Thai Style) - Quite good, but not great. Lightly (very lightly) breaded and stir fried, it was sweet and cake with broccoli. A basic dish that is probably not for the adventurous, but tasty nonetheless. Bubble Tea - Pretty awful. I had lychee, and my fiance had mango. The taste of the fruit was fine, but the bubbles were awful. No flavor, rock hard. At $3.50 a pop, it was a waste of money. Rice - good, sticky, and plentiful.All in all, our bill was $42 with tax, or $12 after the Groupon, which I feel was fair (aside from the Bubble Tea). The restaurant itself is clean but basic. Parking is easy. All in all, a fine but not spectacular Thai place."], ["Sara D.", "Bangkok Pavillion is my absolute favorite Thai restaurant in Kansas City!!This place is wonderful in every way. My dining companion and I passed on the buffet, and offered striaght from the menu. I decided to order the strangest thing I could find which resulted in Level 2 Red Thai Duck Curry! (which came with rice) This curry had pineapple and tomotoes with the duck and was incredibly delicious! My friend shared her spring rolls. Every bite was like biting into a lovely vegetable garden. Thai food comes in levels of hotness. I got Level 2 and it was almost too spicy to handle! I can't imagine what Level 5 feels like!!Our waitress was delightful. We were stuffed by the end of our meal, but she came over with the check and offered us free dessert from the buffet!! How can you resist an offer like that!?!Despite being full, we decided to try dessert and thank goodness we did!!! We had some kind of glorious warm, brown sugar tapioca pudding which was absolutely amazing! I have no idea what the other dessert was, but it tasted like Fruity Pebbles!!I adore Bangkok Pavillion!"], ["Jack B.", "hard to believe how delicious this place is, especially for the price. my absolute favorite Asian restaraunt"], ["Elaine D.", "I've been seriously remiss in not writing this review.  I used to go to Bangkok Pavillion for lunch pretty frequently when I worked in OP years ago.  Since then I confess, I'd let it fall by the wayside.  I recently rediscovered Bangkok Pavillion and couldn't be happier about it.  This review is for the weekend buffet since that is the only time I get out to OP anymore.All of the buffet items are very good, some of my favorites are the seafood salad, the lettuce wraps, the Fried Curry Rice with Seasoned Pork Rind is delicious and the Rice Noodle with Herbal Chicken Curry is fragant and amazing.  However the shining star in my opinion and the reason that I'll keep going back is the Curried Flounder.  The fish in this dish is always cooked perfectly, firm, moist, flaky, awesome and the curry sauce is the curry I've been looking for my whole life, spicy yet creamy, thick, just flat out fantastic.  Now I'm craving it and it's only Tuesday.Service and prices are nice."], ["C R.", "BEWARE!  Recently ate here and found a cockroach in my soup.   When I told the server, he was not at all surprised just took the bowl.  We had been frequent diners at this restaurant until now.  I WILL NEVER RETURN!"], ["Tom B.", "I had the rare treat of being able to try the weekend buffet yesterday.  I thought the weekday buffet and was very happy with it.  However the weekend buffet takes it to a whole nother level!"], ["Kate F.", "We were disappointed in this restaurant. Not only was the atmosphere, decor and service less than par, the food was nothing special. We got the pad kee mow and the pad see ew. Both dishes were bland and the pad see ew was very shy on the Chinese broccoli which is traditionally in this dish. Our server disappeared a few times and when she finally came back to our table she had quite an attitude. We will not be going back this this restaurant."], ["Grace B.", "So much Thai food in one place! The food itself was pretty delish and would eat anything that is served on the buffet. My only problem with it is that Thai food is something I don't want to eat large quantities of... I judge any Thai place on their curry and this place had a delish curry!The place is big and was able to hold my entire family. Lots of food. Yummy Thai Iced Tea. Give it a try for yourself."], ["Larry B.", "Medium atmosphere.  Medium service. Medium food. A Quiet and comfortable dining room that is modestly decorated was adequate for a pleasant experience. The wait staff had trouble taking our drink order so three trips for five adults was required. The food was tasty but not all of it was served hot. It was a Monday night so that may be the reason for the mediocre experience. The dining room was nearly empty but we noticed a steady stream of takeout business. Perhaps that is the preferred choice of the locals. We will not be planning a return trip anytime soon. If you are close by and want Ti food I think you will be pleased."], ["Karen G.", "We met some friends for the Special Sunday Buffet. It was very enjoyable. The buffet included a nice assortment of meats, vegetable, rice, noodles, soups and fruit. We especially enjoyed the liberal use of southeast asian herbs, which is a rarity in KC."], ["Gretchen B.", "Bangkok Pavillion was yet another stop on my quest for boba consumption!We stopped in for dinner one evening after a trip to Half Price Books and were greeted by an adorable older server. I am noticing a trend - and it is that I would like to have an adorable Asian grandmother. For now I will settle for dining with them at restaurants.My dinner of choice was the standard pad thai - I prefer mine with chicken and tofu, they were more than willing to make this substitution. My so also wanted a few adjustments to his pineapple rice and again, she was more than willing to accommodate. Next time I would like to try one of the more authentic dishes, I wasn't feeling too adventurous on this day. Throughout the meal the service was friendly and attentive from several servers - everyone around us seemed to be satisfied as well.We also ordered, of course, our boba drinks. We chose honeydew and thai tea, both of which were tasty. I also liked that they had the standard black boba as well as some rainbow boba mixed it. The drinks were a great consistency and flavor.We enjoyed our food and thought the portion sizes were more than enough for lunch the next day. I wouldn't say it is the best Thai food I have ever had, but it is certainly a nice standard to go to when we are in the area. I prefer several of the Thai places closer to my house though. I did also notice there was a strong smell of cleaning agent in here that initially turned me off, but I didn't notice it as much by the end."], ["Susan C.", "I remember why I hate buffets. My friend had a hair in his pad thai as well as wrapped INSIDE HIS NAPKIN. Yuck."], ["Eric S.", "This is in my opinion, the best Thai restaurant in the city bar none. The only other place I love as much as this is Thai Siam in Lawrence, KS. Bangkok Pavilion is not in your typical trendy restaurant locale, so skepticism is a little normal. The restaurant is family owned and everyone is extremely nice. I've had the pad thai and the pad see ew, but my favorites are the red and green curries with both chicken and beef, subbing out the rice for rice noodles. They use a great selection of vegetables in these curries as well. Also, if you get the chance, stop by for the lunch buffet, it's amazing."], ["Uomograsso U.", "Stopped here on a day off to try their lunch buffet.  It was close to 1pm yet the restaurant was still fairly busy.  They did a good job of keeping the items on the buffet fresh.  Not a huge selection, but it was tasty and hot.  The service was excellent as well.  I will definitely come back and try Bangkok Pavilion again."], ["Huang T.", "Great foods great owner great customer service. I can't count how many times we've been to this restaurant. Foods and services are always wonderful that make you want to come back again and again. Love you guys!"], ["Linda P.", "The food is good but the baby back ribs are what I come for (even though this is a Thai restaurant).  I've had the pad thai which was good, but the rad na surprised me.  I recall Rad na to be gravy sauce chow fun type of a dish but I was surprised when I got a soup bowl filled to the top with sauce, although it was still edible minus surprise.Most people enjoy the Robin Hood ribs which come with side of fried rice.  Very tasty and you can choose the spiciness level you want, but be forewarned a 4 or 5 will make you cry.  I usually get a 2 or 3 but that's just for me."], ["Beth B.", "Came here for the weekday lunch buffet ($7.95). The buffet looks small, but I thnk that is because it is in a U-shape in the back corner. There is lots of food there. They have dessert (which I never get at Asian buffets), salad and soup. The salad was good with a ginger dressing. I tried the white rice with mixed veggies, veggie pad thai, Egg Rolls (a bit overdone), Pot Stickers, Grilled Beef(yum!) and Chicken Ga Pow (the BEST). I usually get Pad Thai when I go to Thai restaurants. I think Ga Pow is my new favorite. There is also a condiment station for those of us that need to spice up our food. Can't be too spicy on a buffet.It's a fair price for the food. I was dying for a diet coke, so that additional $2.50 or so made it ridiculous, but that's what you get when you order a soda in a restaurant.I'll be back."], ["Teresa P.", "ugh... i guess I ate the wrong things here, since it seems most people come for the lunch buffet. Note to self...give Bangkok Pavillion another try with the buffet.The pad thai noodles were congealed and undercooked, and vegetables from both the pad thai and curry were undercooked and crunchy. Spring rolls were very average. Overall a meal that was disappointing, considering how excited I was to try this place out due to the ratings. They got the flavors right, but I think they need to review their cooking methods.On a whim, I decided the try the thai tea bubble tea. BAD BAD idea. It had a light tea flavor, but was clearly made from powdered drink mix. The boba was horrendous and had obviously been sitting out all day (or night... or week...). I was hoping for some stronger tea flavor and 'Q' boba.I MIGHT give this place another try, but not anytime soon."], ["Ben M.", "Nope! Bad Idea!The cold spring rolls were average but the peanut sauce was terrible. It lacked flavor and had the consistency of baby food with nuts in it. It was not ideal for dipping my spring rolls in. The curry was a 2 out of 5. The curry itself had a decent flavor but the vegetables were way undercooked. The Pad Thai Jay's noodles were congealed, stuck together and way over cooked. The vegetables in the Pad Thai Jay were just the opposite of the noodles and way undercooked. Again the flavor seemed to be there but it was like eating mush (noodles) with rocks (vegetables). The Thai Tea Bubble Tea was another bad idea. The boba was older than me and the drink lacked actual tea flavor. I think it was from a pre made mix because they said that they could not adjust the sweetness. All of the good reviews here seem to be about the buffet. So, I might have gotten the wrong things. I MAY? go back and try the buffet in the future."], ["Marie F.", "2.5 starsThai buffet - sounds like heaven on a hot plate.  We were not imprressed, however.  The food was bland.  I guess they do this because people like different levels of heat. They did have a station of spices.  The rangoon were like little diaper packets.  They weren't bad, but nothing special.  The dumplings were like baked... crispy, but not fried.  The end result was a very dry dumpling and me trying to conjure up a sauce off the spice station.  The orange chicken tasted like orange dish detergent chicken.  Don't question my basis.  The Thom Yum and spring rolls were my favorite items.  The coconut jello was interesting.  Not a flavor explosion by any means.  Had the meal been spicy, then it would have been a nice cool treat.  I might come back some day and order off the menu just to be fair, but the buffet does not give me hope."]], "The Thai Orchid": [], "Longboards": [["Sya N.", "I love this place, especially the 619 wraps. The staff are friendly. They have the tamarind candy and hot sauces that's popular throughout Asia, super cool at no extra cost unless you get a ton of it! I love the diversity in that. Sometimes there's a bit of a wait but call-ins are better than standing in line. The 619 contains beef, eggs, shrimp, rice, Chipotle ranch and other amazing flavors that makes this place one of the popular goto restaurants. The cabo beef is my other favorite if I want half the calories. Don't go out of your way to Liberty if you're going to skip this Hawaiian-styled food. Sit at one of the surf board table and enjoy a good wrap."], ["Jeremy R.", "Dear baby Jesus thank you for the Yelp reviews that led me to longboards. I have eaten here twice now while traveling through KC and have loved it both times. The \"specials\" are indeed special (see pics) The staff have been quite friendly and seem truly happy to be working on your magically delicious wrap. Try it out already."], ["Christy W.", "amazing and unique so glad i found it! the atmosphere could use some homey additions! loved the tofu sliders and the staff was super nice"], ["Brad R.", "This place beats any of those cookie-cutter national chain restaurants hands down! The atmosphere reminds me of the little independent burrito shops along the Florida east coast. Favorite non-spicy: grilled teriyaki wrap."], ["Amanda M.", "I don't write reviews very often, but this place definitely deserves a 5-star rating. It is a little crowded at times, but that's not a bad thing. Apparently a lot of people really love the food! Most of the time the service is pretty speedy and you can tell the staff is doing their best. I would recommend trying a few wraps here."], ["Sean M.", "if you don't know what to get, get the cabo chicken! friendly staff and awesome food!"], ["Perry P.", "Hands down, my favorite place to grab lunch in Kansas City. The Cabo Chicken wrap has all the ingredients that leads to an orgasmic creation. My fiance loves the Thai Chicken wrap and we've tried a few other wraps on the menu; everything we've had was great. They have a fairly extensive menu so it can be overwhelming but regardless of what you choose, it'll make you want to come back so you'll eventually try them all. There are two restaurants in Kansas City and they are consistent. Don't miss out, try this place! You will NOT regret it - well, you may become addicted to this place like me; which is good and bad. For first timers... try the Cabo Beef or Cabo Chicken before venturing out to some of the more \"exotic\" choices. Most of the negative reviews are from those who tried something other than those two. Enjoy! America!"], ["Faith B.", "I've had carry-out from this location, brought in for me by a co-worker. She reports the service was friendly, but pretty slow.The wrap she brought me, the sushi wrap, was huge and interesting. I'm quite glad I tried it, but wouldn't necessarily go that way again.There are a 1/2 dozen other options I'd like to sample. Faux crab isn't always that satisfactory.I'm impressed by the breadth of their menu and their veggie friendly options. Tried their hummus as well and it was surprisingly spicy, but yummy.Thank goodness people are now regularly thinking outside the burger and fries box for \"fast casual\" dining options."], ["CaraSue H.", "We LOVE Longboards!  Too bad they don't have delivery service ;)  Hint Hint!The Thai chicken wrap is my favorite!  So good!Service is always good here and the food is always consistent and delicious!"], ["Adrienne M.", "Very laid back atmosphere.   The staff were patient while I figured out what to try, and helpful to my husband.   The decor is casual but cute.  Bar seating or at lower tables.  Servicable bathroom, cleaner than my own.  LARGE portions."], ["Jennifer L.", "Best fresh wraps anywhere!!! Most amazing sauces and wow Kong pow is my absolute favorite! I absolutely love this place!"], ["Rachel T.", "Love this place!! I usually get the Cabo Wabo, but there is something for everyone. This is place is a great alternative to the typical sub shop. You can come here and grab a variety of different types of wraps.  I honestly think you cannot go wrong with anything here. One of the things I like is the \"chill\" personality that all of their workers have. It seems to create a relaxed environment."], ["Connie L.", "Meh...not really impressed with Long Boards.  It is extremely expensive when I literally get no meat in my burrito....don't understand what the hype is all about."], ["Dionne R.", "Being new to the area, I checked out Yelp for potential places to try. Longboards was one of the first I saw I knew I wanted to go to. It hasn't disappointed. The blend of ingredients and the added depth of flavor with the grilling of the wraps provides you with something to crave... and go back for again and again. Since everything is freshly made when you order, you can have substitutions (I enjoy mozzarella instead of pepper jack in the Pork Luau). The menu is large so recommend checking it out before you go."], ["Alexis R.", "I love the addition of brown rice to the menu. You can get a spinach wrap filled with tasty chicken, vegetables, spicy tambal sauce and brown rice.  Grill it to perfection and you've got the best lunch ever!  The prices are reasonable (~$6-7) for a very filling wrap with fresh, quality ingredients. I also feel really good about supporting a local business! It's great every time I come it, and I wanted to update my review to show my love of this place.  It's really fills a niche in Liberty, providing quality, tasty, healthy food."], ["Jessica L.", "Extensive menu so I picked the first thing that looked delicious and later saw something else that sounded really tasty so I'll just have to go back! The Thai chicken wrap was generously stuffed and in turn left me very full. I had a spring roll also and it was fine but nothing special and won't be a repeat order of mine. My friend enjoyed his Super A Bomb and the \"bigger wrap for bigger appetites\" statement on the menu is quite accurate. He took half to go which is very rare for him. The menu has a good variety and the ingredients are fresh and plentiful."], ["Shane W.", "Ok, it's time to write this review. I was a big fan of the Gladstone location and stopped by whenever I could. I even made special trips there just for Longboards; from my office in the Crossroads, or home near Liberty. It was always worth the trip. So, when I learned another was opening closer to my home, it was a really big deal. A lot of restaurants have opened in Liberty in the last several years, many of them have ceded way to some other restaurant and many others are just your typical franchised copy of something you've seen dozens of times before and run by people who just want you in and out as quickly as possible.But that's not what Longboards is at all. A) It's locally owned and B) They have a way of doing business. It's not stenciled on the door or printed in advertising but it's there and they take it very seriously. I don't know what you call it, Oha, Huna, Aloha Spirit, it probably doesn't really need a name because they're not there to tell you about it. It means, love, friendship, joy, kindness, respect and probably a few others that this world could use some more of.Opening day, I hear my friends raving about it, stories are going around about lines out the door - I had to work but I couldn't wait to have dinner there. Their wraps are amazing really.I ordered my normal vegan version of the Wow Kung Pow: rice, snow peas, peanuts, and smoked tofu with an amazing spicy sauce that I've been trying to reproduce at home for a year. All wrapped in a wheat tortilla and grilled like a panini. The Wow Kung Pow on the menu has chicken instead of tofu and has cheese.So after painstakingly avoiding animal-based food for six years, I'd eaten about a third of it when I realized it had chicken in it. I know it's hard to understand if you're a meat-eater but to say I was devastated really isn't an exaggeration. I love Longboards' philosophy of kindness and respect but in the moment that I stood up to take that wrap to the counter, I forgot it. I totally and unequivocally turned into a kind of jackass they have carefully crafted a kind of place to avoid. I laid my tray on the counter and told them I had been a vegetarian for six years and they just (effing) fed me chicken. I know, I'm not proud. I'm really embarrassed even and that's why I never wrote a review. I don't personally know the owners, many of my friends do so I know it's a family restaurant; owned by cousins, I believe. One of the owners followed me to my seat and calmly asked me not to use that language. He apologized and offered me a refund but was really clear about how they operate - they just don't want that energy around. I was lucky he didn't throw me out, he could have, and maybe should have. I don't know if they understand how I felt about eating chicken for the first time in six years, it was awful, it really was. I know most people wouldn't get it but in thinking about it now, I was as awful to them as eating that chicken was to me. The looks on their faces when I treated them that way wasn't anger, they were hurt. I know they felt terrible. For that, I am deeply sorry. They made an easy mistake that just happened to have pretty big consequences to one person. So, that was months ago. Today, I have what is probably a pretty comfortable lead as the Duke. Most weeks I take my son (omnivore) and daughter (vegetarian) and we all have our regulars. The great people who work there know us and I really don't think they remember the guy there every week is the guy that lost his shit on opening day. This review may remind them but I don't think they'll hold it against me - they just aren't those kind of people.You know what made me write this? I was there last week, ordered my usual, as did my kids and on the way out the door, one of them said, \"good night, it was good to see you\". I believe them, they meant it."], ["Connie G.", "We tried for the first time!  I had seen it many times on the urbanspoon app, but never tried it. The carne asada steak bowl was great! Being gluten sensitive, I am always on the lookout for rice noodles. These were wonderful, not too filling and very tasty. My husband had the spicy crab wrap and it was excellent too!  I am looking forward to coming back here again when we are in the area."], ["Brandon C.", "The food here is a bit off the beaten path, but that's actually a good thing.  If you're tired of the \"usual\" stuff, this place is for you!  The variety is good, and everything we've tried there has been delicious.  It can get busy at times, which means a few minutes of wait time to get the food, but I view it as more of a fast casual dining restaurant than a fast food restaurant, so that's not a big deal.  The kids menu is fairly limited, but otherwise it's a great place that we enjoy."], ["Logan Locke B.", "I built this place up way too much in my head before going here, I was incredibly disappointed. The food was mediocre."]], "Sawasdee Thai Cuisine": [["Ami L.", "One the better thai places in the KC area and it's not overly expensive.  If you order \"Thai Spicy,\" they mean SPICY.  If you enjoy spicy, I suggest getting the \"spicy\" and if you like it, move up from there in the future.  I still haven't figured out if their spiciness level is always consistent but I'll edit if I find that it's not.  Their noodle dishes are consistently delicious and its not overly sweet like many other Thai places in the area.  Their soups are pretty good and a $6 soup can give us 4 small bowls - a perfect size to start off a meal.  Keep in mind their Tom Yum can be very spicy while the same spiciness level with their Tom Kha can be mildly spicy because of the coconut. Their \"Sam Rod Crispy Duck\" is pretty good.  It's deep-fried duck (which can be a bit dry) over a sweet sauce with a kick.Their mango sticky rice is delicious but it is seasonal."], ["Sydney S.", "Let me start off by saying this: the only reason I did not give five stars is because of their phone system. We tried to get takeout early last Friday night. The phone rang, rang, and eventual went to voicemail. Weird, right? We called again. Same thing. We ended up going some where else. Ordered take out last Sunday. It was awesome. I ordered the Panang curry and veggie spring rolls. I ordered the curry, because it is always a good indicator of how good the restaurant is. I was not disappointed. I would agree with previous comments that they have some of the best and freshest curry in the area. I look forward to ordering other things on their menu."], ["Aaron R.", "My wife and I came here for dinner we have been here before at the Pride priorty restaurants but this was a new experience and the first one for us at this restaurant. The food was extremely good and I would definitely recommend this restaurant for anyone to try for the first time or go back on multiple times."], ["Cory S.", "Hit it up for lunch, Massaman Curry rivals the best I've had in the country and the Pad Thai was on point also.  Unlike HBT it's open on Mondays and the lack of it being crazy busy was a positive also.  Kicking myself for forgetting to order the Thai Iced Coffee as it would have definitely hit the spot.  Will definitely go again as it's neck and neck with my other go to Thai spots."], ["Alicia A.", "There aren't many Thai restaurants on the Kansas side, so I was happy when I found out there was one restaurant not too far from me. I was not disappointed. The cuisine was the right amount of spicy and they offer quite a few different entrees off their menu. The lunch portions and prices are much more appropriate, but it is nice to go for dinner as well. It's just too bad they don't deliver. For those that haven't tried Thai Tea, please do. It is absolutely delicious!"], ["Jeremy B.", "Beautiful decor, delicious food, friendly and prompt service.  I enjoyed their Satay Chicken appetizer and Panang curry with steamed rice.  If you're looking for Thai food, I would look no further."], ["Melisa V.", "I told my husband that we probably ordered the wrong things and he didn't agree. Either way, not a good sign at any restaurant.Craving Tom Yum Soup (which was actually the only good thing we ordered), we headed over here with a groupon in hand. Along with the soup, we ordered the Thai Chicken Noodle salad and the Ginger Stir Fry with Shrimp (our server's suggestion). The noodles in the salad were overcooked and kind of gummy and the rest of the ingredients were a bit bland. The Ginger Stir Fry just didn't have a lot of flavor to it either. We also ordered a side of Veggie Fried Rice for our kids (who wouldn't touch it) and that was probably the best entree we ordered!I'd be willing to try it again, maybe for lunch, but I don't think my husband would rush back with me."], ["Michael P.", "Another great option for Thai food around the OPKS area. Sawasdee serves up the Thai favorites you'd expect and some unusual specialties too. I found this place thanks to a Groupon and found myself returning even without the discounted to-go voucher. In each of my Thai food reviews I try to make a \"curry to curry\" comparison. Sawasdee doesn't disappoint. Our multiple trips here, I have sampled their panang, yellow, green, and red curries. None of these are too much different than other Thai restaurants, but they bring a great flavor and \"zing\" that not all other joints offer. At 11 bucks for chicken or beef, the price point is similar for similar amounts of food. One drawback here - we ordered curry to-go on three occasions here and were served three different amounts in the same plastic container. I would guess we had two - three fewer ounces the second time vs the first, and one ounce less on the third visit. I like the price point and the amount of food you receive provided it's a similar amount each time. You wouldn't want a 16 beer with only 13 ounces inside, right? We will definitely be back to Sawasdee in the future. It stacks up well against similar Thai places around the area. It's definitely in my top three Thai places around along with Sweet Siam and Pad Thai."], ["Grant H.", "I usually get takeout from here, but stopped in for lunch. The lunch prices are cheap and the food is delicious. Hot and sour soup was on point. Phad Thai chicken is as good as anywhere in the city, and KC has some excellent choices when it comes to Thai food."], ["Ashery G.", "Very disappointing. Especially after seeing the high ratings. Mostly Hispanic cooks. Bland and oily pad see ew. Chewy and stringy beef. Crunchy and undercooked rice. Ordered mango sticky rice and got mango and crunchy rice. Satays were decent. I would go to Hot Basil Thai over this any day."], ["Kelsey A.", "I love this place! I've come by several times with my boyfriend, and have had delicious food every time. We recommend the crispy duck or any of the curries, especially the panang! Careful though, even the mild version has a bit of a kick to it. :)The atmosphere is always nice and clean, with a relaxed vibe. The staff is quiet, but very kind and always has good recommendations. The prices are reasonable and the portions are pretty large.Highly recommend!"], ["Chelsea B.", "I read a bunch of other reviews before coming to try this place, and several said that their food is super spicy. With that in mind, I cautiously ordered my usual hot only to be moderately disappointed. Unless my order was made wrong, I would have to say just the opposite. My food was hardly spicy at all. Other than the spice level, the flavor was decent. Definitely not the best I've ever had. I would probably eat here again but it wouldn't be my first pick."], ["Surendra chakrader N.", "I had the Yellow curry Medium spicy, I think the best yellow curry i ever had. I became a fan of this recipe. Thanks you Sawasdee for the wonderful service."], ["Alena L.", "The environment was beautiful. The server was nice. Food was ok nothing spectacular, we had ordered Pad Thai, curry, and soup which I cannot seem to remember. Everything was nice. I just didn't like how they added the gratuity onto the bill for a group of 4, 2 of them being kids ages 7,8."], ["Rob M.", "I live nearby and stopped in at Sawasdee soon after it opened.  The space has housed a succession of Thai restaurants that have opened and closed over the past decade.This incarnation is spacious and attractively decorated.  The \"booth\" seating actually consists of back-to-back benches with triangle-shaped cushions separating them and serving as the back rests.  It looks very smart but the cushions are loose so they slide around and provide no back support at all.  You may want to sit at one of the tables with standard chairs if that sounds more comfortable to you.I was in at an off hour and the place was virtually empty.  I was hungry and wanted something filling, as well as an opportunity to try the food at this new place, so I ordered the pad thai, asking for it medium hot.  That's what I got -- a nice sized portion, well-seasoned and not excessively sweet, which is just the way I like it!  Service was OK and friendly but not really notable.  Of course, the place was quite new when I ate there and by now it should have settled down and found its groove.I'll be back -- it's nearby and reasonably priced and if my pad thai was any indication the rest of the menu is likely to be delicious and well-prepared, too."], ["Stephanie R.", "I was excited to see another Thai restaurant open in this location in my neighborhood, and even more excited when I tried the food! I have dined in and carried out. All excellently prepared. The spice level is higher here than many other places, but that does not offend me. I do stick to ordering medium heat (and bringing tissues with me). The spring rolls and Sawasdee rolls are refreshing. The coconut milk based curries are creamy and delicious. Last night I tried the Sam Rod for the first time and was delighted by the sweet and sour taste, and they did not skimp on the meat either, always a plus in my book. The only dessert I have tried is the mango sticky rice, mostly because it is so good I can't get myself to deviate from getting it!I also love the Thai Iced Tea, but I ask for the cream to come on the side so I can customize it to my own sweetness preferences. I love that they will accommodate me this way. A very friendly place tucked away in a great location ;). Worth the trip!"], ["Zach G.", "Quite delicious Thai food! My wife and I have a soft spot for Thai, having spent out honeymoon in Thailand eating some very authentic stuff in various parts of the country, and feel like we are decent judges of what's really good Thai food...and this is probably the best in JoCo. The former tenant of this location (whose name I forget) was the best, and we were truly sad to see it go. This replacement is almost as good. We went on a quiet weekday evening and it was pretty much dead. Service throughout wasn't great. Our waters were refilled, but nothing was done with a smile. Our server seemed miserable being there. Always a bummer, but the food is more important. We started with a papaya salad, hot - and it was HOT. It's always hot, of course, but this had me in tears and my wife practically unable to eat it. If you like hot food, like I do, it's a winner. It was even better two days later after sitting in my fridge, fermenting in its own spiciness. We also got a yellow curry rice with chicken, which was very delicious. Finally, we both love massaman curry, so we got an order of that (with beef, of course) - very, very good. Excellent flavor, quite close to what we've had in the muslim areas of Thailand. All of this, with water, was around $30 with tax but not tip.So, would we go back? Absolutely! Food was great. Might consider takeout due to the so-so service, but the space itself is quite nice, open, clean."], ["Cheryl B.", "I know this restaurant has changed hands more times than I can remember; however I'm not a big fan of this change.  We were immediately greeted and seated with water; our order was not taken for close to 15 minutes.  We had contemplated leaving in order to not miss our movie. The new owners changed the interior decor and made the booths out a hard wood material with only 1 small little chair pad for cushioning.  It reminds me of a very modern look you would see in The Scandinavian countries.  As for the food we had the mixed appetizers; no complaints there.  It came with 4 very tasty dipping sauces nestled in a cute little tray.  We also tried the Laab which I've also seen spelled \"Larb\", it was okay at best.  It was very bland; I had to ask for soy sauce and use the remainder of the appetizer sauces to dress it up a bit!  Ps.  For some reason Thai restaurants do not like it when you ask for soy sauce.... Anyway, for dinner I had the Shrimp Pad Thai.  They neglected to ask me how spicy I liked it; so I had to ask for the hot spice tray to jazz it up a bit, but still it just wasn't anything special.  Just very bland.  My husband had the Beef Gaprow, again he wasn't asked how spicy he liked it, and his was very mild and bland.  This dish is typically loaded with basil, this one had 1 large piece.  Now for the best part of our experience; our bill arrived!! It was only $46 for all of this food; that was the saving grace of the experience.  We have been to the restaurant 15-20 times over the years; but likely won't be back under the new management.  It wasn't horrible by any means!!! Just noticing special!"], ["Raj T.", "this is one of the best Thai places in the area.It even had a green coconut to drinkWe were also happy with the service"], ["Justin M.", "This is a fantastic place to get Thai food in Overland Park.  I have visited their location several times and have always been impressed with the care the staff takes of each customer.  Very attentive and relaxed.  The place is very well designed and has some quite nifty booths that I had not seen before.  I am a huge fan of several dishes at Sawasdee, from their appetizer combo (which you have to try) to the Pork Gaprow and Pad Kee Maw.  We have tried several other dishes as well and each time we have been pleasantly surprised by both the flavor of the dish as well as the presentation."]], "Red Snapper": [["Julia C.", "My spare plate had something on it. Instead of getting me a new plate, she wiped it off with tissue and gave it back to me. Then we found a hair in the meal, asked to speak to manager, I pointed the hair she said \"what about it?\" Really? I guess it's common.to have hair in this restaurant? Then she offered to bring me new food and I said no and asked if I could just go. She said ok but didn't say sorry or anything. We really loved this place but..it went down pretty bad it looks like. And owner's attitude sucked the most. I will have to find a new decent restaurant now."], ["Peter T.", "Stopped in around 3:00pm on a Saturday,  We were greeted by friendly staff, the menu was easy to understand, lots of unusual chioces, exciting. We order a mixture of meals, really enjoyed the food..Was unable to take pictures, or remember the names of meals...yet I loved the food, I be back in about a week...then this comment will be updated."], ["Wasula K.", "Ordinary Asian food."], ["Holly H.", "Don't leave without getting the Salmon Rangoon. Amazing. Salmon and cream cheese? MmMMmm. I ordered the Orange chicken and it was fantastic. Lightly battered moist chicken covered with a delicious sauce. Service was friendly and efficient. We will be going back for sure!"], ["Amy B.", "Salmon Rangoon and teriyaki salmon were awesome!"], ["Reed N.", "I had the Clasic Mandarin with Tofu from the extensive menu and was pleased with the dish. It was not very spicy, but I enjoy adding my own amount of chilis to get the heat I want. The smoked salmon rangoon are as advertised. Obviously homemade and absolutely sinful and delicious. The service was not fast, but it was very friendly and helpful."], ["Norman P.", "Came in with a large group of my students and my son.  The table they tried to sit us at only fit 90% of our group.  My son and I ending up sitting at a nearby table so the group wouldn't be squished in.  The wait staff helped the main group, but ignored the side table where we were seated.  After the main group had gotten their drinks and orders had been taken and drinks refilled at least once, I had to walk back up to the front to get someone to bring my son and I water and a menu.  At least three different restaurant employees walked past us while helping the main table and never acknowledged that we were sitting there, let alone the we had no water or menus.  Finally got our food after the main group was over half done with their meal.  Ended up only ordering an appetizer so we would not make the whole group run late.  Food was fairly mediocre, so likely not somewhere I would ever come back to."], ["Kimi D.", "Get the panfried noodles. They are delicious! Best Rangoon have ever had! Also this was the best noodles I've had east of the Rockies.Would definitely recommend it to anyone wanting authentic pan Asian food. Will definitely come back."], ["Makini K.", "MY first time I just thought it was okay, but then I found out what to order. Get the house sauce on whatever you want because it's good. I don't really eat meat, but when others with me get the Mongolian Beef they are always happy. Like, really happy."], ["Jordan B.", "Stopped in for lunch after driving by several times. Honestly, for boasting 4 stars, I wasn't that impressed. The place WAS busy, but mostly with an older crowd. I don't know if they were understaffed or what, but as we walked in the hostess said she would be right with us and then we awkwardly stood there for about 5 minutes waiting for her to come back and seat us. Really not a big deal, but not the welcome I expected for my first experience!The website says this restaurant has been here since 2003, but it looks like they bought the building and left all the old booths/tables and possibly some of the decor. It looks a little shabby and run-down, and the huge globe fish tanks right in front of your face right when you walk in the door didn't even have water let alone fish in them.The lunch specials are pretty typical and are basically stir fry, ranging from chow mein, phad thai, and general tso's and most if not all have the option of fish, chicken, beef, or tofu. There are several \"spicy\" selections, of which I tried the Classic Mandarin. The steamed rice was good, veggies were fresh, but the chicken had no real flavor nor did the sauce, and I definitely would not describe it as spicy. I am used to a little more of a kick, but all in all it got eaten and was worth the $7.95 price tag and came with a tasty twist on the crab rangoon - smoked salmon rangoon! I would come in again to try something else, but would never drive clear across town for it."], ["Brandon A.", "This place is just fine. Friendly service, perfectly acceptable atmosphere, good solid meal.Must say, however, that the menu is a bit odd:There are standard Asian / Asian-American dishes (ex. rather typical Chinese - Stir Fry *.protein, Japanese - Udon Noodle Soup, Thai - Pad Thai, etc.). There are some \"fusions\" or not-very-traditional menu items which I thought were a little confusing and / or  lacking in confidence and have not tried (ex. Salmon Rangoon. Really? Why?). Then, there's Jellyfish. I'm not particularly squeamish when it comes to trying new things, but no thanks on the Jellyfish!I ate the Red Curry. It was okay."], ["Victoria S.", "This is an amazing restaurant! I had kimchi for the first time and loved it! The food was absolutely amazing everything cooked to perfection. From the appetizer to dessert I wouldn't change a thing. We will definitely be frequent customers!"], ["Yuri S.", "Decor is modern and fairly nice, looked like a designer was involved. Friendly and attentive help. However, the greeters are dressed too casual, almost unprofessional, but that can easily be fixed. The Calamari is really good... plump and tender in a tempura-like batter. My wife had the Tilapia which she said was very good, but the sauce is the typical premixed brown Chinese sauce that all other restaurant uses, she didn't like that. My son ordered the deep fried whole Snapper which was also tasty , but if you're not experience with eating fish from the bone, stick to the Tilapia. I had Mongolian Beef, which was good but nothing special. It was ok, but a little pricey... I may return, but not any time soon."], ["Gina M.", "We LOVE Red Snapper! We typically start with the chicken satay, which is served with very tasty doing sauces! The teriyaki salmon is delicious, as is the basil seafood combo, but my favorite dish had probably been the Thai coconut red curry (I added shrimp). My fiance always orders the san Shan jam bong, which is very good, and obviously his favorite. The wait staff is always friendly, and the ambiance is good. One of our favorite places to eat!"], ["Alice H.", "Have come here for years since they opened and my dad has eaten at the owner's previous restaurant. Food was on point when they first opened when the owner cooks but these days that can be a rarity. I do love the choices and variety and overall the quality is still pretty good. Salmon rangoon is something you should always order. It's the best! My preference for the dishes varies each visit so I don't have a favorite. I personally don't love it as leftovers the next day because the sauces congeal and it kinda weirds me out but a lot of Chinese food have that after effect I guess? It doesn't stop me from getting it as take out to eat the same day or stopping in to eat in the restaurant."], ["Erica P.", "The Red Snapper is absolutely divine. My husband and I went and started the meal with one order of the Smoked Salmon Rangoon. Yeah I'm ashamed to say we ended up ordering 2 more orders of the Rangoon. It is one of the best I've had. I loved the salmon twist from the regular crab. I had a shrimp entree which I can't remember the correct name and my husband had General Tso Chicken. We had SOOOOO much food. No way we could finish all of our food, took doggie bags home. Our waiter was super friendly and patient with our indecisiveness.  Meal was a little pricey, but for the amount of food you get it is priced perfectly. We will add this place as a fav to visit for sure!"], ["Bill B.", "Americanized Chinese food at its best.  And hey, yes, I am American, and sometimes I'm in the mood for Americanized Chinese food.  On those days, Red Snapper will be high on my list.  If you have been to any of the best (and most expensive) Chinese restaurants in Beijing or Hong Kong (as I have), don't expect the same here --- not even close.  But of course you can expect a much lower bill here too.Also at Red Snapper, if you are a vegetarian, you won't have to explain that chicken stock and pork are not vegetarian, as you'll have to do in Hong Kong or China (unless you claim to be a Buddhist monk)."], ["Marisa B.", "I love this place.  It seems to be a great standby for any occasion.  We have done Mother Day, Christmas day, birthdays, family in town, week night random carry out, casual date night, etc.  It just seems to work for whatever the occasion.  The staff is attentive & accommodating, & the food is consistently good.The portion sizes are more than enough.  I always take home leftovers, & am thrilled to be able to do that.The thing that makes me the most happy as someone with dietary restrictions, is that I can trust Red Snapper to make whatever dish I am in the mood for suit my gluten free requirements. If you want your dish more spicy, this can be arranged.  If you are not sure about \"Pan Asian\" & want to play it safe, you most likely can find something more generic (a traditional Chinese rice type dish perhaps).I always hear that both the crab rangoon and the calamari are AMAZING here. I would not know this from experience (due to shell allergy).  But everyone I have ever eaten with who has ordered either of those items has raved about them.The signature dish the \"red snapper\" also seems to get a lot of praise.  I tend to go with rice noodle dishes.  The Pad Thai for example (which is quite tasty).  They even have a small bar, with happy hour specials, a variety of teas, & some desserts if you are craving something sweet.We have never had a problem getting in.  The space is super clean, (bathrooms are pretty cool), & our service has always been exceptional."], ["Marie F.", "My friend was feeling a little under the weather and I felt that soup and hot tea would be conducive to his healing.  I had picked up a menu when I was at the Quizno's near them last week,  so I knew these guys had what we needed.We ordered the Udon and the San Shan Jam Bong soup.  Having heard such good things about the Smoked Salmon Rangoon we ordered them as an appetizer.  The rangoons were served with a sweet mango sauce and a spicier (perhaps wasabi based) sauce.  They didn't taste any different than a crab rangoon.  I happen to like crab rangoon, but I was hoping for that smoked salmon flavor.  Just wasn't there, but it's hard to compete with so much cream cheese.The soup bowls are huge!  The cost is 12.50 for each bowl, but you will not be leaving hungry.  The bowls are big enough to share and I would recommend sharing if you plan on eating anything else.  The Udon had peas, asparagus, baby corn, celery, seaweed, zucchini and 2 different kinds of mushrooms.  The seafood amount was satisfactory.  Very tasty broth.  The San Shan Jam Bong had an unexpected red broth.  The dish is marked spicy and it certainly was that.  Not too hot to eat though.  The vegetables were napa cabbage, red onions, scallions, carrots, and zucchini.  Satisfied with the amount of seafood in this one as well.  The hot tea was a delight because they bring you the hot water and let you choose your tea from a wooden case.  Very swank.  There were a couple of repeat flavors so there weren't quite as many as we first thought, but we ultimately settled on a tropical green tea.  All the flavors were organic FYI.  The tea bags are the pyramid shaped ones. We got three refills of  hot water and that one tea bag lasted through them all.  The China Mist Iced Tea is bottled, but is also organic and does not have HFCS.  It's a black tea sweetened with cane sugar.  The flavor was Tangerine Tea with Pomegranate Juice.  The server was pleasant and not over bearing.  He was helpful when we were being nosy about what others had ordered and we just had to know what dish they were eating.  The after dinner mints are Lifesavers -- pretty fancy.Too full for dessert, but the tempura fried banana will be mine."], ["Daniel W.", "One of my favorite spots in the whole city. The food is just better than any chain restaurant. The staff are really awesome and will help recommend anything. Also the Rangoon are made with smoked salmon and are off the charts good."]]}