{"John the Greek": [["Matthew Z.", "I've been going here very occasionally for several years and have never had a bad experience.  Consistently good Gyros and soup, extremely reasonable pricing.Service is fast and friendly, and the atmosphere is pretty casual."], ["Kathryn K.", "I've been eating here for years. Best Greek food in SA. I buy bottles of their salad dressing (which are sold in-store and at some HEB locations) Excellent spanakopitas and eggplant appetizer. Tzatziki appetizer is also great. Although some of their entrees and gyros are wonderful, I am a sucker for their Greek salads and always get a big one for my meal.Also recently tried some red wine (they have several Greek wines) and loved it. The restaurant let me sample a couple of wines so I could pick one and both of the ones I tried were great, so I'll add a glass of wine to my next dinner here.I understand that the food is prepared by a group led by John's parents, who sometimes pop out of the kitchen to say hello. I love so much about this place - food, family-friendly atmosphere, great wine. Definitely will be back."], ["John S.", "Tried several of the gyros that my friend recommended when I visited. I was very happy with the quick, friendly service and quality food. Took several fresh dessert items home with me to eat later."], ["Steven V.", "One of my favorite restaurants. Great food, great atmosphere. The waitstaff is always very friendly. I've been coming back consistently for over 6 years. Oh, and definitely get the avgolemono soup!"], ["Stefany V.", "Very nice restaurant. Have come with my mother several times using coupons in local magazines- service has always been spot on, pricing is fair, and portions are good. They also never had a problem adding on a take out order to our dine-in order shortly before we left, for my father.Gyros are a good option here, if a bit generic. Interior décor is nice, service makes the extra effort, but I vaguely recall a situation  where they don't really do substitutions.I recommend this place nonetheless- not many Greek options in the area, but also doesn't get too busy and service/food quality has been consistent across several visits."], ["Troy K.", "Good food, great service. Very friendly, Manager even came out to check on us and make sure everything was ok. I will def be back. Had the Gyro Plate with fries and a greek salad. Very tasty"], ["Daniela M.", "So far the best Greek food that i have tried... Gyros are so good , salad was fresh, nice quiet atmosphere, good and friendly service :-)"], ["Hoa L.", "Easily my favorite restaurant for Greek food and specifically gyros. There is a wonderful lunch special they includes a soup combination. The soup is delicious! Everything was cooked very authentically and I recommend the baklava because it was light and flaky and sweet as opposed to the usual syrup drenched nasties you taste at the grocery store or other restaurants. Server is very attentive as well."], ["Scott K.", "The best Greek Salad dressing in town....a very casual place with a great menu of lovingly prepared food. I've been eating here for 25+ YEARS. Same family owners....same hearty, reliable,  delicious food."], ["Jasmin D.", "I came to John the Greek based on Yelp reviews and was definitely satisfied. I love Greek food, and while I am no expert,  the food and atmosphere was pretty authentic in my opinion. They have a variety of dishes, and I love that, for the most part, you can modify any dish to get just the right combination of food that you want to try. They have amazing kabobs and a serious slice of baklava (seriously it's huge). I am pretty positive they make all the pastries there at the restaurant as well. Also, the owners are typically there serving and making sure everyone is happy. I was tired after work when I ate here once. I think probably for a few minutes while eating I had a look of blankness on my face, and the owner quickly came out to make sure that everything was okay and that I was happy with my food, haha. Very sweet people.  We sat on the patio which has a ton of greenery and is just really pretty. The actual restaurant is decked out with Greek paintings and a very beautiful mural on one of the center walls. I saw some flyers for a belly dancing night, so I bet that would be a lot fun. Otherwise, if you are in the mood for great Greek, this is the spot."], ["Nathan W.", "A must try Greek place! I don't see how some people complained about this place! My food came out within just a few minutes of ordering. The staff was extremely friendly and helpful. I tried the 12A Traditional gyro, fries, Greek salad AND a drink for 8.25! Wow! That price would be hard to beat anywhere in SA. The food was great and the owner stopped by everyone's table just to say hi. Support local businesses such as this everyone. You won't be disappointed here."], ["Lisa K.", "Yum!  We tried this place for the first time last evening and loved it.  The food was great, the place is extremely clean, the prices are very reasonable AND the live music, which was perfect, kept us mesmerized.  Love this place..... It is our new favorite.  Thank you!"], ["Kristy S.", "This place was quite a surprise! The staff was super friendly and they even customized my order because I wanted to try two different dishes. Very fast service, great variety on the food, and definitely worth the trip if you're looking for some great greek food. I had a mixed plate with gyro, pita, and pastitsio and it came with a small greek salad that was very fresh. I would definitely go back next time I'm in SA! The atmosphere is very casual and comfortable, which I enjoyed. But it could also be fun for a date if your partner wasn't looking for something super fancy. Great beer selection as well!"], ["Linda M.", "My favorite Greek restaurant in the area ... friendly, casual service, fantastic gyros!  Wish I could get there more often, it's fresh, clean, and delicious."], ["Jesse F.", "Great food at a great price. First visit was good. Second visit was even better. Service exceeded expectations."], ["Ylenia M.", "Terrible service, the food was not as good as I expected and it was over priced, took about 20 minutes to be seated and almost 30 to get my meal (1 gyro and an appetizer). The waitress forgot our order and had to come back and ask again what we wanted.Wont be going again"], ["Larry P.", "Awesome service, authentic food, great prices....we eat here often and try everything!"], ["Jim P.", "The best Greeek in San Antonio.  I was always made to feel welcome.  Great Saganaki!"], ["Lauren J.", "I am normally a visitor of another local greek restaurant in town, but I decided to give this place a try because of the proximity to my house.  The portions were quite small compared to what I've gotten elsewhere.  The gyro meat was good, but the Chicken Souvlaki was basically just fajita meat on a stick.  Our meal came with fries but they didn't have any seasoning on them and really didn't help fill us up after the small protein portion."], ["Duncan M.", "Yum......John and his mother and father do a great job here and I would urge all who read this to go support this great family owned business!!!"], ["John H.", "The pita bread is so good, it's like it was stolen from Mount Olympus so us mortals could know what pita bread is supposed to taste like So warm, soft, moist and light.... yum!This is also the most \"authentic\" greek place in town, with dishes that the others don't even dare to try. Saganaki! Spanakopita! Mousaka! Hello old friends, I've been searching San Antonio for so long! The gyros were really good as well. These are the traditional kind of gyros, not the gussied up steak burritos they try to pass off as a gyro at other places. Really filling, great quality meat and lots of home made tzatsiki.Large outdoor space (maybe when it's a bit warmer), lots of options for lunch, really great greek salad dressing... all the little things that are lacking from other pretenders."], ["Pat M.", "Really bad experience, Menu is overpriced for the food quality and the environment, took more than 20 minutes to seat and another 20 to received my meal. Also I was told \"we have no rice\", really! wth no rice in a Greek place? anyways, would not ever go again. Pat"], ["Seon B.", "I've been here twice and had the traditional gyro off of the lunch special menu with fries. The fries were hot and crispy. The Gyro was what I expected good, but it wasn't exceptional. For a $7 meal including a drink. You can't go wrong. The restaurant is perfect for groups and has outdoor seating."], ["Jessica A.", "When I first happened upon John the Greek was after a boozed fueled night at the nearby Sherlock's. Fell in love with the gyro and have not found a gyro in my opinion near this perfection. No, it was not the alcohol soaking that made it so perfect. Been coming back whenever I am in the area or make myself in the area for their wonderful lunch specials. John the Greek's homemade cucumber tzatsiki is the most amazing thing ever to happen to a gyro. Seriously a traditional gyro with perfect pita bread then with the tzatsiki equals amazing!!! They also make homemade Greek salad dressing that is just as amazing. Compliments the fresh veggies perfectly. The hummus and pita bread is wonderful and delectable. Prices on the lunch menu are way reasonable for what you recieve.The service is always warm, fast, and amazingly courteous.Notice all the amazing. Yeah, totally deserved because the food and service is just plain amazing :0)Side note don't forget about dessert. They have scrumptious goodies for sale near the cash register!"], ["Michael B.", "I love this place. The owner is always onsite and the food is fantastic. Great mom and pop restaurant!"], ["David H.", "John the Greek is a wonderful restaurant. The food is great and the staff is very friendly and helpful. I really like their lunch/dinner combos, as they have put together combinations of almost anything you could want at a very reasonable price. The atmosphere is very casual, and tables for two up to tables for 10 are all equally well served. The decorations include a lot of travel posters and a nicely painted sky line, but it's not kitschy. And there is a patio we are looking forward to sitting on when it gets warmer.It's a nice place for either a full meal or authentic Greek dessert with coffee after a night out. Belly dancing on Friday and Saturday nights."], ["Marie S.", "After driving past this place for three years now, we finally stopped in to give it a try - and we were glad we did! We had their gyros, and they were delicious! Their pita was soft, warm and fabulous, the tzatziki was wonderful and the meat was tender and delicious. The pricing was pretty great too!We don't usually get dessert, but the management was so nice and attentive that we sampled their baklava. It might have been a smidge stale, but it was delicious nonetheless.We'll definitely be back! Thanks for a great experience."], ["Daniel S.", "Nice atmosphere....the Gyro was average flavor, not enough sauce. The desserts looked great but I was too full to try."], ["Donna H.", "Been eating here for years. The best thing is the salad dressing. The dolmades always have overcooked rice, although the flavor is good. I had a lamb dish with artichoke hearts which was good but there were about 6 pieces of lamb (the size of a quarter) and a LOT of artichoke hearts. Green beans are always overcooked. It is like Greek fast food. We have eaten at some great Greek restaurants, but not in San Antonio..."], ["Kim O.", "Excellent Greek Chow! Delicious pita's, soup, and service! Will be back!"], ["Dina C.", "I'd heard wonderful things about this place and I can attest, it lives up to it's reputation. I went on a Friday night and they had a live belly dancer, which was pretty cool and created a fun atmosphere. My only compliant is that the music was a bit too loud and I found myself raising my voice to talk to my boyfriend despite us sitting in a small two seater table. Other than that, I think the service was great as was the food. I had the traditional gyro platter, which came with fries and soup. We also had the Saganaki as an appetizer with warm fresh pita bread, which was scrumptious. Prices are pretty reasonable which is also a plus. It's a win all around and I will be going back again!"], ["Ben G.", "Best Mediterranean food in town hands down. Old world great service with a smile. Been coming here for years."], ["Thomas N.", "I spent a couple of weeks in Greece, and, unlike hot dog stands in NY, there are not Gyros stands on every corner.  With that being said, I have years of eating the Gyro's Turkish cousin, the Doner Kabap all over Europe.  This brings us to John the Greek.  Best pita bread I have had in longer than I can remember.  The lamb Gyros were very good, but the icing on the cake was their tzatziki.  The cucumbers were sliced long and thin, the garlic was good and strong and the yogurt was the perfect consistency.  Spread the word.  This place is great for lunch!  I can't wait to try their dinner entrees!    Before I rush off to get another gyro, the staff there deserves an honorable mention.  They were both very courtious and professional."], ["Lou M.", "Delicious spanakopita and a crisp Greek salad for lunch!  It was delicious!  The basket of warm pita was also great.  I don't know why it's so hard to find spanakopita but now I can stop looking.  It was my first time at this location and I'm sorry it took me so long.  It's a pleasant place, comfortable tables with enough space between you and the other diners.  There is a small patio that would be perfect for a glass of wine.  The restaurant is clean and the service was superb. The servers were pleasant, knowledgeable and prompt and even accommodated our unhurried approach to lunch.  Those desserts displayed near the register looked delicious and maybe even homemade.  I'll be back soon!"], ["Gregg J.", "Gyros the size of tacos??? You guys need to go to NY, queens or anywhere north. I have not had worse Greek food. Even Trader Joe's tsaziki blows your's away."], ["Libby G.", "I love the traditional gyros. This place is always clean and the service has always been great. I keep coming back because the food is always good. Other places are hit or miss but John the Greek is consistently delicious."], ["Amy D.", "This was a horrible experience;( I love Greek food and decided to try based on reviews. Ordered the chicken meal w the garlic sauce..it was literally disgusting. It looked really gross a clear jelly and I couldn't even look at so sent it back and ordered the chicken gyro. Very disappointed the pita too thick and barely any chicken and just subpar. Fries that came with the meal were skimpy..literally 10 fries. I did order their specialty egg soup and that was ok good but nothing to write home about. Service was okay, food not so much!!!"], ["Angela F.", "The staff/owners of this restaurant are very friendly and attentive. Very charming on the inside with painting on the wall and pics of Greece. I usually get the 8A (I think that's the right number)...it's a gyro (lamb & beef combo), fries, and a greek salad [delish!]. Very good and filling and not too bad a price at about $8ish. Saturday nights they have a belly dancer so that's interesting to watch....we had to ask they turn the music down cause we could hear our own table and our server had to do the mad lean in to hear our order. It's funny to watch the men in the restaurant sneak looks at the belly dancer and quickly dart their eyes away! HehThe hummus is very tasty. They also gave us complimentary baklava, which was delicious! All of their desserts are Greek, of course, and homemade. Solid and consistent."], ["Chris T.", "The hummus appetizer was interesting, the pita soft and warm. The gyros were good except the tzitzaki sauce was disappointing and watery. The lentil soup was sort of standard.The prices are very good. The salad was good and they sell the bottled dressing. We did not partake of the dessert pastries but they looked delicious."], ["Jeffrey H.", "Why did I try and venture out into un-chartered grounds.  Having had a bad service experience at another Greek restaurant we headed to John's to save the day.From the moment we walked in the service was excellent.  A quick check of the lunch specials and my order was in.  A #11 greek salad, gyro & drink for $6.75.  The salad arrived shortly and was tasty as usual.  Just as the salad disappeared out of the bowl the gyro arrived.  Hot tasty and filling.  Good food, good service at a fair price.  Pick up a bottle of the salad dressing to take home."], ["Colin B.", "Our server was friendly, courteous and prompt.  The food was sensational and inexpensive, and even the markup on the wine was probably more in the 100% range (rather than the customary 250% premium in most restaurants)  Not to mention, nothing on the wine list is mainstream fare.They close somewhat early (8PM) on weeknights but being blissfully ignorant of this fact, my girlfriend and I chatted away while the staff patiently cleaned up other parts of the place & didn't give any indication that it was time for us to leave.  We were there well over an hour past closing.Can't wait to go back and work my way through the rest of that menu!"], ["sally s.", "This was another accidental find in an unfamiliar city, except this one was all on our own.  We are always looking for something new to try when we are out of town and we saw a sign for an Irish Pub.  No, this is not an Irish Pub, but as we turned the corner to go to the other restaurant we saw this restaurant on our right & immediately turned in.  Understandable since we only have one Greek restaurant in our hometown. Anyway we were sucked in by the inviting patio and the menu items displayed on the windows.  We were again lucky with our choice since the food was delicious and the waitress was fantastic.  The prices were amazing - under $7 for a gyro, soup or salad or fries & and drink.  Can't even get that at Mickey D's.The lentil soup was scrumptious, fries fresh & the salad crispy.  The gyro & souvlaki were extremely filling & flavorful.  We were also treated to a fiery display of ignited cheese which the next table thoroughly enjoyed (so much so they had two).  Unfortunately it was lunch time & we missed the belly dancers - darn.All in all it was an extremely enjoyable experience & we will be back, esp. for the desserts that we just did not have room for.P.S. Don't forget to grab a bottle of dressing on the way out!"], ["Javi C.", "Atmosphere is nice and staff is great, the food seems pretty ordinary though, as for comparing it to Greek good, I would say its pretty close to the real thing"], ["Colt V.", "All around solid greek food. I've had their soups, gyros, baklava, hummus, and the 'saganaki', essentially a cheese flambe.Nice outdoor seating area.Prompt wait staff.Manager seems to be pretty good at making rounds and checking up on patrons.Restrooms satisfactorily clean."], ["Kay L.", "Great food and fast, courteous service!"], ["Shadetree K.", "My husband and I really like to cook and eat at home but this is one of the places we will splurge on when we eat out. It is very affordable and the food is fresh and delicious and the wait staff is super efficient and friendly. Save room for their awesome homemade deserts. Don't forget the pita bread and hummus!"], ["Bob C.", "The four of us enjoyed the food, the service, the ambiance, and the dancer.  She was an enjoyable and unexpected delight.  We began with the Combo Appetizer with Hummus for $20.00.  There was plenty for the four of us, and something that was the favorite of at least one.  The Spanakopitia was enjoyed by all four.  I enjoyed my land shank.  The lamb chops that one got was well done and looked dry, but that person seemed to enjoy them.I had two glasses of a Greek red wine.  All the others had only water or soft drinks.  With three of their delicious desserts, our bill was $102.00.  This was certainly meant there should be two $$ not one $."], ["John H.", "Good Gyro and greek salad.  Spanikopita was ok."], ["Regina P.", "Delicious food & friendly staff! My husband and I stumbled upon this restaurant on our way to Guadalupe Mountains and were so glad we did. Mmm mmm good. Must try!"], ["Anang M.", "Good food and friendly service in a clean restaurant. Works for me !"], ["Sarah M.", "There are only two greek places I eat at and this is one of them. I always go and get the gyro and fries and am quite satisfied. The prices are great for the amount of food you get. The food service is also really fast.The restaurant itself is a good size and great for groups. The gyro sauce is probably my favorite here. It's really tasty and creamy. It's the perfect additive to the gyro."], ["C S.", "Second time and it only keeps getting better now that we are exploring the menu.   Started with the soups, lentil and a white bean yummy.  Had lamb shank (falling off the bone, melt in your mouth) and oven roasted chicken breast with potatoes out of the world, very tender and juicy in the most delightful light sauce.  Try the cookies, brought them home and all gone this morning, very nutty not to sweet.  This is a very cozy, comfortable, and very affordable dining with a great belly dancer put a smile on my honeys face.  This can become a regular.  Easy parking, nice outdoor area.  Just a gem."], ["Kosti K.", "First off, I'm Greek.  I've been eating Greek food since I was a child.  So, I'm a bit of a Greek food snob.  I've eaten at nearly every Greek restaurant in San Antonio, and John the Greek is as close as it comes to \"the best\", which is why I give it 4 stars.  It's clear that the owners try very hard to do their best, but this is not world class Greek cuisine.In spite of this the food is quite good if you're looking to scratch your itch for Greek food, or if you're just interested in experimenting.  The menu covers the spectrum of Greek food, and the price is reasonable.  I would strongly recommend the \"saganaki\" - basically this is flaming cheese.  It's excellent if you like theatrics and cheese."], ["Manuel V.", "I expected much better since being praised on talk radio. Of course, they pay the station to say nice things. When will I learn. Food was o.k. but man, could you spare a little more on the plate. I ordered a gyro sandwich that was comparable to mall Greek food. Actually, mall Greek food at North Star was better. Also, service is not very good. You feel like you are bothering the servers when asking for something. I won't be back."], ["Susan B.", "I love John and have been a customer of his for 25 years. His Greek salad is the very best. I purchase his salad dressing at HEB and take it to other restaurants with me."], ["Ray R.", "This place is really tasty. I had the #12 for lunch since I like gyros and it also came with a delicious soup. The Avgolemono soup is something that you must try. I could eat a whole bowl of that by itself. It has chicken, rice, carrots, and a lemon twist to it. I had also tried their Greek beer which I had never had. Marathon beer is a nice lager that they offer. Definitely a place to eat with a friendly environment."], ["Jose T.", "this place was pretty good have only been here once so far, but my food was good. Definitely want to go back and try the rest out, everything sounded good. they have a live belly dancer and some good greek music playing which is pretty neat. very friendly staff and environment"], ["Stephanie P.", "Best Greek food in town by far!! Homemade by yia yia! Anything you order will not disappoint!"], ["Jennifer W.", "If pita bread is delicious, then this stuff is delicious.  Warm, soft, yet crunchy on the outside.Lately I've become more and more interested in greek food.  I guess as my palette expands, I desire more interesting flavor combinations.  As far as Greek restaurants go, this one is pretty good.  Not the best (the best would be in Greek town in Chicago), but for San Antonio, Texas, this stuff is pretty good.My meal was enjoyable and the service was pretty good."], ["Becky B.", "Uninspiring Greek food. Think: greek fast food. Waiter seemed vaguely annoyed by us. Couldn't answer questions, delivered appetizer after dinner, blamed the cook. Best thing was the salad dressing, available at HEB."]], "Jerusalem Grill": [], "Zorbas Greek Mediterranean Cuisine": [], "Athens Greek Xpress & Catering": [], "Demo's Greek Food": [["Dolph M.", "I can't say Demo's is the best Greek food I've had, or even the best in the area (still working on trying them all anyway), but it is reasonably priced and they get bonus points for no-fuss counter-service. It's an easy choice when I'm in the mood for a Gyro."], ["Charles O.", "Love the food. I have never eaten inside just taken to go. When I get home everything is so damn good I wish I had eaten it there so that I could get more of whatever I just consumed."]], "Casa Del Kabob": [["Valerie S.", "The food here is authentic and Casa del Kabob has the best gyros in all of San Antonio.  If you're craving a gyro and tasty potato wedges, this place is worth a trip no matter what side of town you're in. Casa del Kabob is also reasonably priced, so you won't feel robbed the way I do whenever I try gyros from other places. The owner and his staff are all friendy and helpful. Since this place isn't a chain restaurant or in the trendy part of town, you'll rarely have to wait long for your food."], ["Nancy E.", "We walked into the restaurant when it was a kind of chilly and dreary day and once inside I felt warm and comfy. I didn't know whether to order the beef/lamb gyro or the pork gyro so the owner recommended the pork gyro. I ordered the green rice with Lima beans as the side order. We prob waited less than 5 min to get our food. The gyro was overstuffed with meat. I could have prob made two gyros with all the meat that was stuffed in my gyro. The meat was a little spicy but very good. Yummy! Needless to say I ate the whole gyro. Their tea was great too. It had a fragrant flavor. I really don't know how to describe the flavor but it tasted great. I kind of thought the hummus was kind of salty but my husband loved it (and he's picky with his hummus).As for appearance, the restaurant was really clean. I liked the ambiance. Overall, this is a great place to eat. I'd definitely eat here again! Yummo!!"], ["Sarah J.", "After a return visit to this very unique restaurant, I am definitely ready to award them with more stars! I feel confident that I've found the perfect order plate, though there is still one thing I have not gotten to try that I am holding onto for next time: the steak kabobs. So far, I would call the combo plate the best meal deal, and the perfect order is with gyro lamb beef and the (spicy) pork, black eyed pea rice, and the side salad. I also enjoyed the philly cheese steak wrap for something different, and since the steak in it was delicious, I'm assuming the kabobs would be too! I'm already planning my next visit (which might be tonight)! So glad I moved closer to this place!My Yelp rating system:5 stars= Driving across town just for this!4 stars= I would recommend visiting.3 stars= Average, acceptable, positive.2 stars= You might be able to drag me in. 1 star= I will definitely not be returning."], ["Hoa L.", "The food is amazing, flavorful, and delicious! This restaurant serves Mediterranean food and Persian food. For this review, I will be covering what I consider Mediterranean food, since I didn't try the foods specifically listed as Persian and have no distinct Persian experience to reference. I tried the chicken kebabs, gyro meat, lamb shank, and lamb kebabs. The meat was moist and flavorful. The spices uses were evident in the taste, unlike other places that don't have a similar full bodied flavor. The lamb shank was \"fall off the bone\" soft, juicy, and perfect in temperature. The food took about 10 min and you just pick it up when they ring a bell. You order food at the front, like a cafeteria. The meal comes with pita bread and yogurt/garlic/cucumber dip. The bread tastes fresh and soft, while the dip has a creamy fresh flavor, a hint of garlic and cucumber. Not as strong as the Greek tzatziki.  A small side salad and choice of three rices are available. I chose the green lentil one, which was a punch of delicious flavor. The black eyed peas one was also very delicious, though more hearty. The only sadness I experienced was the baklava, which did not taste homemade. I would not recommend ordering it. An assortment of pickled garlic and drinks were available. I tried the regular yogurt drink and its taste was similar to a liquid, salted cottage cheese. I highly recommend this place for anyone who loves competitively priced, authentic, Mediterranean food."], ["Patty M.", "Great food! Always gives my kids French fries to snack on when we go. Very nice owner!"], ["Christina P.", "The food here is delicious! We usually have Greek on the northwest side of town but today we came across this place and thought we'd give it a try. My kids had lamb gyros which they devoured, my husband and I had the eggplant and tomato casserole, it was delicious! As for my husband and I we had the grilled vegetable plate with a choice of meat and double salad because we didn't want rice. We will definitely go back again."], ["Phillip M.", "This place doesn't look like a typical restaurant I would visit from the outside but the food and friendly owners make up for anything that the building lacks.  Everything we had was delicious and right on.  I'll be heading back to try the rest of the menu ASAP."], ["Carlos T.", "Very, very good food. Clean. Great prices. Had the Kobbideh again, fresh,  sizzling and so tasty. My friend had the gyro with lentil rice and she was not disappointed.  A hidden gym on the south side."], ["Andrew ß.", "Thank you yelp!!! You've led me to another great whole in the wall with authentic taste from another country.. Trying the lamb kabob plate, & vegi kabob plate Both come with rice, peta, salad.. The mushrooms & house made yogurt sauce are to die for!!! Inside the decor is just as authentic as the food they serve.The owner is on site and still cranking out the food with a team of younger guys.... Great lunch. Well deserved 5 stars."], ["V R.", "Definitely not my type of food:(... We triedfour plates only that tasted great was the the combination plate chicken everything else was just ordinary ... Place smells horrible .. It must be the lamb meat"], ["Catherine C.", "This place is really a diamond in the rough!!! The food is great and the atmosphere is always inviting.  The chicken gyro is great as well as the beef and lamb gyro.  All of their rice is great but the best is the green Lima bean rice yummy!!!"], ["Chris A.", "What a crazy location for Middle East food. One might not expect to find very good ME food on this side of town but you'd be wrong.This stand-alone hole-in-the-wall restaurant really does a fine job. The food mainly consists of items wrapped but they also serve up proper plates of various grilled meats, as well as what appeared to be a very nice ME-style stew.They offer 4 different varieties of jasmine rice for your eating pleasure. I had the lima bean rice and it was excellent. The combo plate I had ($9.99) was spectacular. It had a few chunks of grilled chicken and then this incredibly flavorful sliced beef (I think) that was exquisitely marinated and cooked with onions. Fabulous!If you're hardcore halal, this kitchen does serve pork so be aware.Decent prices, great food, friendly staff, and a nice selection equals a repeat customer in this Yelper..."], ["Marina Y.", "This is the best place we've eaten at in San Antonio so far and were going back today! Been here 2 weeks now and having to eat out everyday has become a challenge as many places we find with good ratings on yelp turn out to be terrible. Not this place!Green rice with pinto beans is so yummy I can't wait to have it again :-)"], ["Mike B.", "Casa del Kabob offers a broader dining experience than many of its competitors. They have most of the standard Mediterranean specialties as well as a nice selection of Persian delicacies. I had lunch there with two members of the office lunch crew, and we were all impressed. One of my colleagues had the gyros plate, which featured thick, nicely charred pieces of gyros meat. The other had a pork tenderloin pita sandwich with big wedge fries. I had one of the daily specials, a beef and eggplant stew called gheimeh bademjan. I'm a sucker for eggplant, so I figured I'd like it. But it was absolutely outstanding! Our plates also included a creamy salad, lots of pita and a bowl of yogurt dip with tons of garlic and dill.The guys behind the counter were friendly and happy to explain the various menu items. And the prices were excellent. I think the pita sandwich was $5.99, and even the special I had was just $7.99--and it was a *lot* of food.This place is definitely going into the rotation. Check it out!"], ["Eugene L.", "I was upset when Arby's shut down their business here and found out it was going to be replaced by Casa del Kabob.  When I saw the sign put up I had thought Arby's was going to be replaced by another Mexican restaurant.  Years later I finally decided to come here and I'm glad I did.  I ordered the lamb kabab with black eyed pea rice, Greek salad and pita bread.  The lamb was cooked perfectly and the pita was good as well as the rice. Even better was the price.  You could eat like a king here and not need a Saudi prince's budget to dine here."], ["Denisa E.", "Staff has always been super friendly and service is usually very quick. The green rice is to die for. My favorite is the koobideh with green rice. The flavors of the food are delicious. I don't feel like anything is too overpowering, it's all well balanced. The area may look a little rough, but never had a problem and the food is well worth the trip."], ["Yvette H.", "First time expiring this type of food and this location. The establishment is very clean, the decor and music were very fitting, staff was super nice and friendly. We ordered veggie options. The food was promptly brought to our table. And it was amazing, very fresh, grilled to perfection. The eggplant casserole was recommended to us by staff, and it was awesome. The pita bread was so fresh. Before leaving we got to talking to one of the staff members and got a history and lanuage lesson on this wonder culture. I will for sure be coming back. Great asset to have on the southside."], ["Angela L.", "I would have given this place 5 stars but unfortunately my sirloin steak was burnt.  I had made the mistake of ordering it, however; as I thought it was the same thing as \"barg\" which is my favorite Persian dish to order in Houston (I think barg is more of a filet mignon cut meat).  The hummus, although not what I'm used to, was delicious...and I don't even like black olives.  The bread was fresh and cooked perfectly.  My husband ordered the gyro and the meat had great flavor and was cooked well.  The Persian yogurt sauce was divine!!!!  Basmati rice was light and fluffy with grilled tomatoes as the perfect accompaniment to my dish.  The side salad was a nice extra that I'm not used to from other restaurants and I really enjoyed the dressing.Don't be fooled by the restaurants exterior, it is definitely worth multiple visits!!!"], ["Fernando D.", "The food is great.The owner is quite friendly. I would come here again in the future. Glad to find these gems on business trips!"], ["Jeramy B.", "Am always on the lookout for good, local non-chain restaurants when I travel and this place did not disappoint!  Had the gyro wrap with giant, delicious homemade steak fries.  Very friendly staff and inexpensive!"], ["Scott L.", "Upon my wife's request we went to Casa del Kabob and I was so pleasantly surprised. The food was great and the owner was kind and quick witted as he patiently took our orders from my reluctant kids. We all enjoyed our selections; lamb wraps, chicken wraps, steak plate, lamb plate. I would definitely come back."], ["Gabe E.", "I used to pass by all the time and think nothing of this place. I tried it after my sister recommended it. It's one of the best places to eat on this side of town. I usually get the combo plate with chicken, steak, and green rice. The gyros are also excellent here. I would recommend this to anyone looking for moderately priced great food. Service is also top notch. The owner usually works the register and is super friendly."], ["Trim B.", "This place is a hidden gem!  Louis was very gracious. The food is delicious and the portions generous.  The tzaziki sauce is made from scratch and the BEST EVER!!  Even their yogurt is made from scratch for this sauce. Definitely worth the drive to enjoy a delicious meal in this humble establishment.  In warmer weather the outdoor covered tables will be delightful!"], ["Joshua M.", "Very good, quality Mediterranean cuisine. I was talking to a coworker about how \"authentic\" it was when I realized I wouldn't know authentic from anything else. Bottom line is: efficient and detailed staff and management=top quality and flavorful food. I didn't want to eat a lot, so I ordered the gyro. When it arrived, there was double the amount of meat than I expected! I ended up gorging myself on it in the end. Sauce was pleasantly garlicky, shaved lamb was toasted perfectly. All of my coworkers at lunch enjoyed what they received as well. No complaints between 10 people=10 out of 10 agree! Price is usually a big deal for me, but the low fare bought me plenty."], ["Jp B.", "Really great food, came here twice this week just to try it out, food is excellent, owner is friendly n funny.Tried ghormeh sabzi the first day, seasoned nicely n definitely a must and today had the lamb kabob with lima bean rice, they add a little bit of butter to the lima bean rice n it complimented it well."], ["JP R.", "Not impressed.I was visiting out of town viewing some of the Mission churches in San Antonio and needed a place to eat in the afternoon. I yelped the closest greek-mediterranean restaurant and this was what I found. Initially, I was intrigued by the reviews and decided to try it. Upon arrival, I noticed that it was more of a snack-bar style restaurant. I am not a big fan of these because they typically have a lot of food laying around (I've worked in restaurants before, so I know). Our hunger supplanted the decision to switch - which ultimately turned out to be a mistake.First: The owner is somewhat abrupt and blunt. Kind of like the soup-nazi. Second: The food is sub-par. I'm sorry, but you can get a much better quality gyro for the same amount of money. I think my opinion is biased because I live in Vancouver where the choices for these restaurants are bountiful. What makes this restaurant popular is the portion size to the amount of money you pay. The water also tastes funny (beware).Pros: Good wedge fries. If you want quanity, not quality - then this is the best mediterranean restaurant for you."], ["Al H.", "Oh my!  This was fantastic.  Lamb shank was tender and savory. Together with a nice sauce and rice, this made one terrific long lunch. Looking forward to my next visit. Service was also great."], ["Sarah C.", "Ordered the beef gyro and the combination plate. I agree with the other reviews. ... flavors are amazing didn't need any sauce"], ["Joe R.", "Great gyro.  And big too.  A great value if you get the papas it comes with.  I'm eager to try again and get something else."], ["Ray T.", "I had the combination platter and my wife had the #1.  Both were outstanding.  The service was very friendly and the restaurant is very nice on the inside, not what I expected.   I will definitely be back again."], ["Eddie A.", "If you are looking for something different o n the Southside, this food is for you."], ["Nathan W.", "Wow! This place rocks. Having the ground beef and chicken breast plate with green rice! Ahhhmazing. The guy at the front is super nice as well. And they're playing Johnny Cash! What more could you want South Texas?! Haha"], ["Curt C.", "A real diamond in the rough! Awesome food, excellent service! We came in not really knowing what to expect, but was incredibly impressed by the staff and the Persian and Mediterranean food. The owner seems to be from Iran, and serves up some traditional Persian recipes of stew and rice. They have four or five different styles of rice, which range from green lima bean rice to basmati, jasmine, or other flavors. I got the combo plate, which had lamb and beef gyro slices with a yogurt cucumber sauce that was delicious! (They make their own yogurt) It was tangy and paired quite well with the gyro. It came with pita bread side, and a salad made mainly of onions and tomatoes. In all, the food was fantastic! I was quite impressed by the varied menu, they've got over 30 dishes. The dining room is painted up to look like you're lounging in the Italian or Turkish coast. Interesting pictures of random Middle Easterners set the tone for a vary cultured meal. The staff was very nice, and let us sample the pickled garlic, which was quite good. I had never had pickled garlic before this, but was quite glad I tried it. It wasn't as overpowering as fresh garlic, it had a more subtle taste. They had multiple sauces to take out to the table, so keep an eye for that if you dine in. They have a large outdoor patio that would be awesome in the summer. I will certainly be back. This place is incredible!"], ["John R.", "If your in the mood for kabob style place this should be your stop.  Not pretty on the outside but these guys know what they're doing.  Ask them for the gigantor plate, I made it up it has beef, lamb, and pork.  Also get the lima bean rice.  You can't go wrong with anything here it is authentic and tastes great."], ["Holly P.", "I was visiting San Antonio and was looking for a place to eat via Yelp and I'm glad I came here to eat. The food was fabulous. It's probably some of the best Mediterranean food I have ever had! The prices are fair. The decor could've been a little but more up to date but it's okay the food will take up all the points for anything else. I have yet to find and try a spot in Houston for such delicious food."], ["Steven D.", "Totally awesome! Best gyro platter ever!Sandwich was stuffed with meat and the wedge fries were very big and extremely tasty!Extremely friendly staff also offered up a free cup of coffee.As Arnold said, I'll be back."], ["Victor S.", "I almost tried them all but this place is awesome!!This place is simple but the food is made with great pride... That you can see and taste."], ["Stephen C.", "Good simple Mediterranean food at a fair price. I had the green stew and it was very good. The fragrance of the turmeric was intoxicating.Update: Everything here is fantastic. I generally go with the plates over the sandwiches because i really like the salad dressing and the rice. My favorite rice is the green rice (lima beans). The lamb shank here is fantastic. But the so is the gyro meat, the pork, the chicken, the lamb, the beef. It is all good. I am really glad to see business has steadily picked up since my first visit last august. Great food at affordable prices. A winner winner tasty dinner."], ["Simon G.", "Pick any number on the menu- you won't be disappointed."], ["Jason G.", "This place is great... I've been to a bunch of Greek and Mediterranean restaurants in San Antonio. This is the only one that I would never hesitate to visit again and again. The green rice is worth the visit not to mention their Gyro meat. Awesome spot!"]], "Wrigleyville Grill": [["Ruben D.", "I'm from Chicago and moved to Texas tried all the Chicago restaurants around in Texas and this is the best place to go to. Excellent service you feel very welcomed!"], ["Matthew N.", "I'm not from the Chi.......but i know good grub. The Greek salad was light and delicious with a small bar of feta on top. Followed it with a traditional Chicago style spicy dog. It was so good and i wasn't stuffed so i went for a polish dog.Here's the real winner......the husband and wife duo were for real die hard Cubbies/Bears fans (thick and thin). You can tell, because only a die hard Cubby would say, \"this next year, we're going to have a good team..\"  The ambience adds the 5th star. Go late, when it's quiet and chat up the owner and his wife. You wont just have dinner, you'll have an experience."], ["Jeffery V.", "By far the best place for a hot dog! My wife suggested a different kind of place to eat and we found this place on yelp. Walking in this place we were greated warmly by the owner. His thick chicago accent brought me back to days of visiting chicago. The owner could tell it was our first time and kindly walked us through the menu and answered our questions.  He explained the ingredients and how they cooked some of the things. After we ordered we gathered some condiments and dispensed our drink from the soda machine. In a surprisingly quick time frame we received our order. The famous Italian beef dog, chicago style hot dog, and maxwell street polish sausage arrived fresh off the grill.  We were satisfied!  If you want something delicious and out of the norm, you must come. Btw, the owner kept checking on us to make sure we were ok."], ["Yuliana H.", "Top-Famous Italian beef dippedBottom-Maxwell Dog with cheese friesThe maxwell dog hit the spot. I highly recommend this place if you are in the mood for an authentic Chicago style hot dog."], ["Amy M.", "Overall, not bad. The Greek salad was really fresh, with a nice hunk of feta on top, and lots of cucumber.  They were out of souvlaki, so I get the gyro with the spicy sauce. It was a good idea in theory, but the vinegary sauce drowned out the flavor of the meat. The pita was nice and fresh though, not cardboard like a lot of places. The hot dogs were great, per the rest of the family. The baklava was really, really good. Fresh with a hint of cinnamon."], ["Farah T.", "The food here is delicious!!!  I am in love with their Chicago dogs.  My daughter has absolutely devoured every last bite of her chile cheese dog and is begging for more!  The buns are the melt-in-your-mouth kind and every ingredient tastes so fresh.  I have been trying to find a good hot dog place ever since moving to San Antonio and I am so happy to have finally found one!"], ["Elijah M.", "Gyro sandwiches hotdogs and other street food galore   wrigleyville makes a statement with its traditional pitas and pork seasoned to perfection. They carry other street food such as tacos that have amazing texture in the tortilla and meat that's both tender and succulent. The staff is something reminiscent of being around family and provide great service. The only downside may be that the cleaner used on the tables smells like pepto."], ["Ruby Y.", "It's ok not my fav. I got the chili cheese dog and really the chili didn't have much flavor. I prefer sonic over this place."], ["Jorge A.", "I come here for the Italian Beef! It's the best beef away from Chicago. Sometimes I will get just beef and then other times beef and sausage. They're both great options. I love the beef here so much that it is my \"usual\", but I have also tried the Chicago style hotdog, the Maxwell Street style Polish, and pizza puff. I'm sure everything else is good, the items I mentioned are my favorites. This type of food is the authentic down to earth people's food from the Windy City. The place is great, the owners are awesome and all of the food is tasty."], ["Ellie B.", "Not a fan of the Cubs but now a huge fan of Wrigleyville Grill! Found this place on Yelp while shopping at a nearby mall and so glad I fought the urge to eat the usual mall food fare. The Chili Cheese Dog was scrumptious and the fries were served fresh and hot! Did I mention the service was awesome?"], ["Kristen j.", "Just ok. I'm from Chicago so I was excited.  The hot dog had all the right parts but it was just missing something. My husband had the Italian beef and said it was also lacking.  R&B has better hot dogs. The atmosphere was nice and felt like home."], ["Tina E.", "I normally only eat about 1 hotdog a year (I think I crave them, then I eat one and its greasy and salty). On this trip, which was advised by yelp, I ate two, yes TWO Chili Cheese Dogs. They had an amazing flavor, not greasy, not salty, super yummy. The french fries are hand-cut- did I mention I love hand-cut home made fries?  The tea is sweetened with brown sugar. At first I thought it had an odd flavor, but after a few sips, it kind of grew on me. The owner cooked while his wife worked the front. Super nice people. You can tell they are very proud of their food and their customers and take it very seriously. I will definitely return."], ["J G.", "Nice atmosphere.  Small and intimate-- owner was talking to all the customers when we were there.  We had hot dogs and fries.  Everything was made perfectly.  They do not serve alcohol but the owner said you are free to bring it in... nice spot for a casual lunch."], ["Samuel G.", "From the moment we stepped in, we were greeted warmly. Very casual, order at the counter but they bring out your food (nice surprise touch!), Chicago dog (authentic & delicious)gyro (regular & \"krazy\") authentic & delicious, chili dog spot on. Other diners chit-chatting of their time in Chi-Town and couldn't get enough of the Italian beef sandwiches. Please, please, please (Insert James Brown song reference here) do yourself and your fellow diners a favor and make room for pizza pockets, can of Old Style Beer AND the must have, homemade baklava...yes, I said homemade melt in your mouth baklava! We will come back for many more-thanks Wrigleyville for bringing some of your hometown goodness!"], ["Harvey S.", "Thought it was overpriced for a relatively small hot dog. Although much of my comparison is Costco $1.60 large hotdog with a drink. Still, for lunch a hot dog even with all the trimmings was a bit pricey."], ["Ginger K.", "This was an all around great experience. The food was fab. Best gyro in Texas and the dipped  Italian Beef was crazy good too... Tea sweetened with brown sugar... Yummmmm... The owners were nice and welcoming. They are the real deal.We will be visiting anytime we are in the neighborhood!"], ["James P.", "If you've got an appetite try the Italian Beef/Sausage combo. The owners are from Chicago. We also had a pizza puff which was pretty good. Good food and service, we'll be back."], ["Maria Y.", "Awesome awesome awesome!!! Loved my polish hot dog and the cheese fries! (Homemade cheese sauce!)"], ["Robert S.", "Finally made it by this place. Been meaning to for a long time. What took me so long? I've been missing out!  Great hot dogs and the Italian beef sandwich was sensational.. this will be on my regular go to list"], ["Ikeithia D.", "Everything about this place was fantastic. The staff was very friendly and helpful. The food was fresh and flavorful. The prices were the same as a fast food joint, so your pockets won't regret it. I highly recommend this place if you want a good meal."]], "Demos Greek Food": [], "Garbanzo Mediterranean Grill": [["Joey P.", "Regrettably, I have to bump Garbanzo down a couple of notches since my initial review.:(Here are the reasons for the deduction:-Chicken shwarma was dry, had mystery pieces, and was quite bland in taste-The beef kabobs that I tried were underwhelming and skimpy -My tomato feta bisque was good, but a little lumpy and barely lukewarm-Falafel was dry and borderline burned-Their pita tasted like it had been sitting out for a week or more -Food quality appears to have gone down significantly-They always seem to be training new employees, which leads to inconsistencies in the levels of customer service providedOn the plus side, the location is convenient, they've got some new gyro offerings, everyone is always polite and helpful, and they continuously have deals on Yelp and Groupon. Although still \"A-OK\" I probably would rather try some place else before coming back without a Groupon."], ["Jeremy S.", "The prices are excellent, the portions are wonderful, and the food is absolutely delicious. The staff here are always friendly, and they even let you sample anything you want for free."], ["Chris A.", "Sorry folks, didn't care for it. With Pasha just 5 minutes away, why would you bother. For almost the same price you get much better food, free fresh bread, and a non fast food atmosphere. The food was decent enough tasting but was ordinary. The one thing I really liked, actually 2 things, were the eggplant slices and the chocolate chip cookie...The hummus was decent, too."], ["Melissa R.", "My bf and I came here on a whim. Super healthy and fresh. The best part though was the staff and managent. Very friendly and accommodating. The owner/manager walked around offering free cookies to those who were eating. I appreciate those little generous acts as a patron. Will definitely come back. It's a particularly good place for a quick bite to eat and get away from work."], ["Andrya S.", "I'm in heaven... it's Chipotle, but Mediterranean!!! I had a Laffa wrap packed full of flavor, and a side of dolmas, which were the first I have had outside of Europe that weren't slimy. They were giving out free samples of the falafel.. crunchy and perfect! (And very reasonably priced for a side of 5 at $2.50ish) The staff was friendly, and they had a free side and drink deal with the first check-in on Yelp! Yay! The selection of fresh Mediterranean toppings was quite thorough, and they had several sauces to choose from (although I do think some of the sauce was a bit lacking in flavor... usually with Mediterraneans, when something says 'garlic'.. it means you're going to be smelling like it for two days.... but not here, which may be good for some people.) Anyway, if this place had wifi, I would give it 5 stars..."], ["Ariel C.", "I LOVE Garbanzos - it's pretty much Chiptole for Mediterranean food. For a vegetarian, it's great - I can get a plate with falafel, hummus, pickles, rice, and more, plus pita bread, for like seven bucks. I never feel like my meal is a concession prize to herbivores.  The food always tastes fresh, and I can load up on healthy things if I'm feeling more virtuous, or pile on cheese and creamy delicious sauces if I'm not.The service is always suspiciously great - I have never had a garbanzo employee help me who wasn't friendly and nice. Definitely my favorite fast casual chain."], ["Farhan S.", "Great and healthy food selection. Decided to go with plate option and was able to get a lot of sides for only 8 dollars. Great service and very friendly staff. If you are in mood for good Mediterranean food, can't go wrong with many choices at Garbanzo."], ["Justin B.", "Great place to grab a quick bite to eat. Their selections are somewhat limited but everything in there is tasty and affordable. It is a lot better than other low quality fast food options. Their humus is great when paired with their red chili sauce."], ["Christina C.", "I don't hate it.I come here once every couple of months, at least once a season. I think I hype it up in my head more and more each time, so I write this while I still have half of my plate in front of me. The concept is fantastic: Mediterranean pick as you go (people aren't kidding when they say Mediterranean Chipotle). They hand you a falafel sample as you walk up to the counter, I rarely turn that puppy down, tons of flavor, right amounts of crisp with a dense warm inside. The hummus is very tahini- heavy, not my favorite. The meats are drier than you'd expect, but with all the sauce offerings, there isn't too much room for complaints. The plate option gets you the most bang for your buck. Prices aren't too steep, I tend to spend more here than at real Chipotle, they have these awesome house-made lemonade mixtures that are probably what tip the scale. It's a refreshing change from the usual lunchtime rotation but not something I'd add into the weekly route.I'll go back, I'll wonder why I keep going back, I'll go back again after that."], ["Diana K.", "Love the pita!"], ["Jennifer T.", "Everything about our visit to Garbanzo, from start to finish, was A-OK.  We waited in a short line when we arrived as this restaurant uses a Subway-like approach to building your entree.  The employees taking orders and putting together entrees were very knowledgeable (pretty sure it was the owner, her husband and their kids behind the counter) and made sure we knew about all of the different combinations since it was our first time there.  They even gave us a full-size sample of falafel so we could try it before ordering.  The food was fresh and while not top-of-the-line Mediterranean, it was satisfying to the taste buds.  It even made my husband a believer in vegetarian meals (they are not vegetarian only, but have many vegetarian options).  The check-out at the end of the ordering process was a little slow however that's because the cashier was in-training.  I'm glad he told me that, it made me have more patience and I'm sure once he has a little practice, he'll be just as knowledgeable and fast as the other employees.  Overall a good experience - would go back if in need of a quick meal and I was wanting Mediterranean."], ["Anastasia H.", "falafel is the BEST!! and they offer a gluten free pita that is soooo soft and light in flavor. their teas are a really great compliment to the total meal package. chips are the BEST side- they make them in store."], ["Amanda B.", "Always such a friendly staff! The food is good for a quick and healthy Mediterranean bite. Love the plates with a little bit of everything and a side of cilantro sauce."], ["Alan T.", "First time here. I didn't know what to order, but the staff helped me out. I had an overall great experience. Can't complain."], ["Sarah B.", "Think Mediterranean Chipotle. Fresh ingredients to choose from and everything is made to order. I find the food to be fine but not something to crave. I typically go here when I am in a hurry or if I have a coupon. Staff are extremely friendly and helpful, restaurant is clean."], ["Desiree P.", "Food was decent but I wouldn't come back again. Hummus was way too bitter, the rice was yellow...and tasted like uncle Bens rice. No lie. I had the gyro meat...I found it odd that it was already and then being cooked..so it was dry because of that rather being continuously moist on a spit...which they don't use. Better off driving 5 minutes down Ih10 to Pashas which is amazing Mediterranean food! I should've known  better."], ["Yolanda H.", "excellent value.  Staff explained everything on the menu.  Fast service and quality of food good.  Clean and convenient in the shopping center and next to theaters.  Only drawback was the high  noise level.  Full when we went and seating a bit crowded."], ["Luke F.", "Just great. Forget Zoe's kitchen and come here. More generous portions, equally healthy and cheaper. Seems like a win-win to me"], ["Stefany V.", "Just had dinner here with a Groupon and was pleasantly surprised! Especially for a chain, the food here is fresh and good. Though the name is \"mediterranean\" grill, it seems a bit more Israeli.As we walked in, we were offered samples of the falafel- it's not the best but it was okay. Boyfriend, who has much higher standards, said it was awful, but I think he was overstating things. In any case, I ordered more as a side and though he didn't eat them, I did.Bf ordered the laffa with chicken schwarma- it basically looks like a giant burrito, and is warmed in a giant tortilla press, not unlike Chipotle. In fact, the entire set up reminds me of a slightly ethnic Chipotle, but I digress.Laffa was filled with hummus, tabbouli, lettuce, tomato and cucumber salad, the chicken, cabbage, and a few other tasty goodies, then he was offered sauces- and went with the tatziki. Said his food was delish, and consumed it all, complete with a soda and an apple (one of their sides).I went a bit more all-out and got the chicken kabobs (originally wanted half and half, which I was told was okay, but then the guy manning the grill said it would be 20 minutes and he didn't seem thrilled about it, so I let it go) with sides of hummus and the cucumber-tomato salad, then subbed tabbouli for the rice and added the aforementioned falafel. This all came with a pita bread, which neither of us ate but it smelled good. The chicken was a little dry but the grilled veggies were amazing and had a great char on them. Other sides were fresh and flavorful, as mentioned before.The only downside to our visit was that customer service was a little lacking- as I referenced above, the guy working the grill seemed put off that I wanted to order an item that wasn't ready yet. Nevermind the fact that we walked in at 6:30, which should be right in the middle of a dinner rush at any dining establishment. The other two employees were young girls, and while they didn't actually do anything wrong, they were a little immature and I was frankly surprised not to see anyone older- if anything, the surly male appeared to potentially be the closest thing to a manager, which does not at all reflect well. In short, customer service was lacking but food was fresh and tasty.We'll be back- want to try the salad, maybe one of the soups, and perhaps a laffa of my own one of these days."], ["Joe A.", "Delicious food. Awesome, helpful, upbeat employees. If you've never been to Garbanzo, check them out. Think \"fast-food Mediterranean\" but without all of the fast-food guilt. I like to have my laffa packed with steak shawarma, rice, hummus, lettuce, tahini, sometimes baba ghanoush, and definitely feta 'cause feta is betta! You can never go wrong with a free falafel sample right when you walk in. I swear I think they pull them fresh out of the fryer right as you arrive, they're always so hot and crispy. Sure, you can go to any other restaurant that serves up the same delicious goodies, but the point of Garbanzo is to be FAST and efficient, and I always make it here and back to work well before my hour for lunch has ended. The location is ultra convenient, in a nice shopping center (Huebner Oaks) and the place is practically brand new since the upkeep is amazing and the restaurant is always super clean. Highly recommended. Tip: don't forget to try their tomato feta bisque, it's so good!"], ["Ahsan C.", "Pros: decent Mediterranean/Middle-Eastern fast foodCons: nothing new or excitingVegetarians: plenty of choices including hummus, baba ganoush, falafel, three types of soup, mushroom and veggie kabob, whole wheat pitaGarbanzo offers Mediterranean/Middle-Eastern food at a nearly fast food budget. The food is reasonably healthy and there are a decent amount of choices. They typically have four types of soups: two, served daily, are the lentil or lemon chicken with orzo while they rotate out garbanzo bean stew or roasted eggplant. For a main dish, you choose either a plate, wrap, or pita (white or whole wheat). Then you choose whatever protein (chicken shawarma, chicken/falafel, steak, steak/falafel, falafel, portabello mushroom, hummus) and add-ins (hummus, baba ganoush, various sauces, and various salads) you want. You can make it a meal with a drink and garbanzo chips, 5 falafels, 4 dolmas, or an apple. For drinks, they do have delicious choices including hibiscus mango tea, pomegranate lemonade, or mint lemonade (which is my preference).The service is patient, helpful, and quick. The food is fast, tasty, and exceptionally healthy. The only drawback is that they serve the usual Mediterranean fare. I would love to see something new and exciting. In spite of this, I am satisfied with Garbanzo and I will return to try different items."], ["R L.", "Best falafel in San Antonio!  (Very consistent)Great pita bread. Good humus, tehina, and babaganush. Shawarma can be better. Gone back a few times'! :-)"], ["Chad T.", "I had the Mediterranean Cobb Salad.  It was really good.  Arianna at the front was all over it.  She even offered a sample of their falafals before ordering.  She made the salad to perfection.  I'll definitely return.  The customer service was over the top."], ["Scott K.", "Great falafel....and amazing wraps! When you grow tired of Chipotle,  try to imagine a burrito with Shawarma,  humus and great Mediterranean sauces. You will not be sorry!"], ["Aaron M.", "Lovely spot to grab lunch. The customers also get a huge portion for the amount that they pay. Also, they honored a yelp certificate on spot. Picked up five delightful little morsels as well as a drink for free!!!"], ["Andrew P.", "This is a long-ass review. If you don't want to read the whole thing, here is what you need to know:1. Basically a Mediterranean version of Chipotle. This is not a bad thing.2. Food is very tasty. DO get the dolmas. DO put hummus on your pita or wrap. DON'T get the kalamata olives.3. Reason it didn't get more than 3 stars is because a lot of the menu items were not ready to be served, including their prominently featured soup. I attribute this to the fact that I came here on New Year's day at 9pm. I will be back, because I expect the negative things to improve if I visit on a normal day.4. One steak pita + one steak pita combo which came with dolmas and a fountain drink = $19. Probably a bit steep, but not horrible.Full review below:Came here at 9pm on New Year's Day. Probably not the best timing, but I wanted to try something new.Immediately upon walking through the door, I got the impression that this was simply a Mediterranean version of Chipotle. Turns out that was a pretty accurate guess.First, you choose how you want your Mediterranean food to be prepared. You get the choice of a Pita (like a hollowed out tortilla), a wrap or a plate There is also a skewer plate, but it felt like  a secondary menu item and I didn't even factor it into my decision. The guy behind the counter suggested that my girlfriend and I get the plate since we were first-timers, but we both got the Pita because WDGAF. The menu tells you the calorie count of each item, which I thought was nifty.The bread for the wrap and the pita can be either white or wheat. They were out of white, so we had to go with wheat. I would have ordered the wheat anyway, but it really irked me that they could be out of white pita bread at all.Next you choose your protein. If memory serves you have the choice of chicken, steak, either one of those with falafel, just falafel, portobello mushroom or hummus. Being the adventurous diners that we are, we both picked steak. At this point, the employee peered into the ingredient trays and realized they were out of steak. One of the employees scurried into the back room to grab two delicious-looking slices of steak and toss them on the grill. We were told it would be about 5 additional minutes for the steak to cook. This was fine, and I chalked it up to the fact that it was New Year's day.After this, you select your ingredients just like you would at Chipotle. Lettuce, vegetable mix, hummus (definitely get the hummus), and so on and so forth. There are some ingredients that cost extra. I opted for the kalamata olives and the feta cheese. I do recommend getting the cheese, but I will avoid the olives next time. They were very salty and each bite with an olive was completely and totally overwhelmed by salty olive flavor. On their menu was a huge ad for some tomato/feta soup. It sounded pretty tasty and it was a chilly night, so we decided to give it a shot. Unfortunately, they were out of the soup, too. The employee said \"I can give you some but it will be cold.\" which was kind of a poor effort in my opinion. I opted not to get it, and was feeling increasingly annoyed by the lack of preparation despite the fact that it was a holiday.I got the combo, which comes with a fountain drink (Pepsi products...WHY does any restaurant do this?) and a side of your choice. I picked the dolmas (stuffed grape leaves).We sat down and waited for a while since our steak was still cooking. We took this moment to discuss how doofus-y the staff was, but that we ought to cut them some slack since it is New Year's day. They brought us our food, but failed to bring the dolmas, which I pointed out and they promptly corrected. The pitas were excellent, but I would have been more content if the ingredients were more evenly distributed throughout the pita. All of the steak and tzatziki sauce was stacked right at the opening of the pita. After that came the rice, then the vegetable mix, olives and lettuce. The hummus was spread throughout, which helped make up for the distribution problem because it was delicious. The dolmas were top-notch. I could have eaten ten.Overall, our experience here was positive. Far from perfect, but definitely not bad. Had we visited on a busy day, my guess is that our food would have been ready about as quickly as I could order it. Flavor-wise, the pita's were very satisfying, except for the preposterously salty olives, and like I said, the dolmas were very, very good. The $19 price point was a bit high, but not enough to turn me off. We will be coming back with higher expectations."], ["Timothy H.", "First went to one in Colorado Springs, CO and didn't realize it was a chain until hearing about one in San Antonio. SO glad we have one now! I love this place...super reasonable (less than $20 for 2 kids and 2 adults). It is \"Chipotle\" style, where you pick either a plate (best deal), a pita, or a salad and then choose your meat, rice, dips, veggies, and beans, etc.A ton of food (rice with grilled chicken, hummus, pita bread, veggies and dips, and a salad) for about $6.  Skip the soup, not impressed. Great flavors in the hummus, rice, chicken, and it is all healthy....you don't feel gross afterwards like with fatty greasy food. Really high quality food, friendly staff, awesome concept....you cannot go wrong!"], ["Jorge G.", "This place was good. The food isn't screaming with flavor, but it does have the sounds of great flavor. Thankfully there many options of sauces and extras make everything just right. I like to call the place the Chipotle of Mediterranean food. Portions were pretty good. Yelpers should take advantage of the free side and drink offer on yelp. So check in and give it a try. Great option for my vegetation friends."], ["April M.", "Perfect for a hangover! :) so affordable! Love their falafel! Staff tends to be a hit or miss. It's a Mediterranean chipotle! :)"], ["Dawn V.", "Hey, late on a monday night with 6 adults and 5 kids we needed something fast and preferably light but didn't want 'fast food'. Wow, what a surprise. Never heard of this place (we are from out of town) but wish we had one. So nice to get decent Med food that is fast fresh and flavorful. The help are all sweet and knowledgeable, helped us feed even the pickiest kid. The Falafel is crispy, moist and yummy. I'm not usually a fan but I love theirs and hubby had never had it, he swiped half of mine! Between us we tried most of the menu and were very pleased with the flavors as well as the value.    2 of the locals with us are going to be coming in for a light, fresh lunch at a decent price. We'll be back and glad to recommend this place."], ["Wesley H.", "I really really enjoyed this place. Subway style greek is pretty good mention before, although I consider way better quality. Simple, tasty, cheap, no tipping for service that isn't necessary for a quick meal, and accommodating to my requests. I worked in service too long to deal with establishments that do not have the slightest clue of customer retention. Great job guys! See ya next timeOH yea.. They have great tea options!! Big +"], ["Scott C.", "Think Mediterranean Chipotle...for a reasonable price, you get a healthy lunch with good service and plenty of yummy options.  I'm a fan of food, especially when it's quick, healthy, and tasty.  I noticed Garbanzo while I was eating at a nearby restaurant and wanted to give it a try.  There are a few options (pita, kabob, wrap, salad) and Chipotle style toppings.  I especially liked the flavored teas (lemongrass green tea was very refreshing).  For about the same price as a burger and fries, you can give yourself a much healthier and just as tasty option."], ["Mary B.", "First time here to this establishment and new to this chain. Apparently more coming to Phoenix and Tucson, AZ. I had Greek salad with all the fixings and dressing. For my protein I added falafel which seemed to be on the dry side. Had pomegranate lemonade and it was good. My friend had chicken in wheat pita bread and diet Pepsi. TV is hanging from ceiling but not on. Restroom clean. Music playing so as to squash some of the loud talking. An okay experience. If I was to eat at this chain again, I would try the skewers with meat and peppers."], ["James C.", "Friendly workers and lots of choices make for a good quick bite to eat.  Pet friendly if you sit outdoors!"], ["Tater B.", "Garbanzos, meal was not appetizing; it should be illegal to sell food that might look pretty with no taste or poor taste.  When we were trying to eat the different items on the Beef Kabob Plate & Mediterranean Cobb Salad we found nothing to our liking.  The Beef served was bleeding and bland.  The cucumber salad had no taste.  The Mediterranean Lamb slices were so thin and lacked flavor. The Pita bread too overdone, the tzatziki was runny.  When you favorite restaurant goes up in price because of inflation you appreciate the flavors; after you have had Garbanzos food."], ["Anthony H.", "I rate off food quality and service.   Another place that didn't disappoint.  Very friendly staff and my food was amazing.   Asked the staff what they recommended and went by that.  Never think you know it all lol.  They definitely provided us with an experience worth writing about.   Everything is fresh.  You can taste the authentic flavor in every bite.   Never thought the laffa (Mediterranean burrito) would feel healthy as it tasted.  You just have to go yourself and I promise that you'll never want to leave."], ["David G.", "Greeted with a sample of falafel and super friendly staff.  My pita was made exactly how I wanted it.  My wife gets the falafel plate.  Pretty good location.  Food was delicious and possibly healthy."], ["Joe A.", "meh. My experience here was uneventful and generally bland.Pasha, very close by, is a better choice with more options, tastier and fresher foods."], ["Marisa P.", "For fast Mediterranean food this place has it covered.  Just get in line and pick one of three options:  plate, pita, or laffa.  It seems better to go with the plate because then you can stack it with a little bit of everything.  The hummus is tasty with a lemony zing, and the plate is also served with pita bread for dipping.  What's cool is that for kids they will do a PB&J or grilled cheese pita, or steak/chicken rice bowl served with chips or an apple.  Much healthier than a typical fast food meal with all calories posted on the menu.  They do offer a few extra items: feta cheese, boiled eggs, eggplant and a few other items.  This is where you can really increase your ticket.  Just stick with the included items to keep the meal in the fast food pricing range."], ["Sabrina S.", "I've been so curious about this place ever since it opened and finally tired it for lunch today. I'll start off by telling you that my lunch was $12. I got the steak kabob plate which includes 2 steak kabobs, rice, hummus, salad, and pita. The flavors were alright and the pita was cold, hard, and dry. I also tried falafel when I walked in and it was mediocre. At least now I know. There are so many better Mediterranean restaurants right in the same area. I mean, Pasha has a lunch menu that's cheaper than Garbanzo...and 10000x better."], ["Becky S.", "I love this place! Semi-fast food the Mediterranean way! The portions are huge and the food is fresh. I'm partial to the steak flarma plate because it's a sampling over everything. They also infused fresh squeezed lemonade and a variety of teas. Anyone that is gluten free should check it out since they now offer gluten free pita. And one other thing.... If you look carefully there is usually a Groupon floating around out there to give you more bang for your buck."], ["David M.", "After eating at three other highly rated Mediterranean restaurants, and pretty much agreeing on their 4 star reviews, we were shocked to see this 5 star establishment was set up more like a Freebirds than a sit down place. Upon entering we had already lowered our expectations a little, to be honest. This was not due to the place being dirty or anything, we just had expected a full service sit down joint, since we had not bothered to read the reviews completely before showing up.  ;-POkay, this place way exceeded our expectations! Just like in Joey's review, the employees were very helpful and friendly.  They made suggestions and advised us on how to get the most bang for our buck. My wife and I both got a plate dinner and made it a combo, which allowed us to also get a drink and an additional side item. The plates came with the protein of our choice, rice, hummus, vegetable salad, pita bread, numerous add ons, and for our side items we both chose Dolmas. Every part of the meal had amazing flavor and freshness!!! I kept looking at my wife and commenting on how good everything was, and how surprised I was!  Both of our meals came out to $20.55 w/tax, drinks included!  This just became one of our top new \"go to\" places!  They are open till 10pm nightly, so we can even go late if we need to!"], ["Trevor B.", "Terrible. Worst gyro meat I have ever had. Soup was cold, salad was droopy. Can't see how they will stay in business long term."], ["Aliza K.", "Really good food, from what I can remember. They will let you try absolutely anything on the menu if you just ask! Will definitely come back to try the rest of the menu since I was a little bit confused the first time there."], ["Lady C.", "This place is like a Mediterranean Chipotle or Habanero's. I had the chicken kabobs with rice, tabouli, and hummus, complete with a dressing of tzaziki and red chile sauce. I also had a side of grape leaves and a mint lemonade. The chicken was tender and juicy, the rice was a little hard but well seasoned, and everything else was just as good. I paid around twelve dollars for my meal which was well worth it. The portions are huge and I left more than satisfied. Great service as well. I will definitely make this place a regular meal choice since I live so close."], ["Anthony M.", "Great franchise with solid arabic food.  My only gripe is that ordering is somewhat complicated.  It's like Chipotle for Arabic food and just takes me some getting used to.  But the flavoring is spot on.  I will go here a lot."], ["Renate N.", "Not impressed here.  Pricey and confusing menu.  Food so-so.  Better Greek options in town."], ["Bo P.", "Great food...if you are going to spend $10 bucks and need quick fix - this is the place to visit...even the music is cool."], ["Haley R.", "I just discovered this place a week ago and have already been twice. Delicious and healthy; two things that don't usually go together. They have a Chipotle-esque set up. You pick a plate, wrap or pita (get the pita) and add rice, meat and toppings. There's soup options too and they are big into handing out samples of things like falafel and homemade potato chips.  Speaking of, the staff is super nice.You should go."], ["Niral P.", "I go to quite a bit of Mediterranean places to eat. However, none are quite like this. The setup is made so you can have a bowl or wrap of a bunch of different things. The things themselves are unique, and when combined even more unique. The combinations turn out to be pretty tasty and taste fresh."], ["Jill A.", "A few friends and I were in search of a good gluten-free option for dinner recently and this was very close to where we were at the time so we took a chance on it. Located in a fairly busy shopping center, it was not a place that I would typically gravitate to, but after the meal we had there I am so glad we did! Everything I ate was delicious. From the rosemary flavored steak kabobs to the creamy hummus and tasty falafel. My friend had a salad they loved and the tomato/veggie salad served on the side of meals was fresh and flavorful. We all tried different drinks; my friend had the lemonade while I had a strawberry lemonade (yum) and our other friend let me try her hibiscus tea which was AMAZING. I just really loved this place and was so happy to find such a conveniently located gluten-free option having, laid back restaurant with decent and fast customer service. We will definitely go back."], ["Walter G.", "There's nothing spectacular.  A fast food joint that I will soon forget.  There are better options for the price around town."], ["Elizabeth P.", "Ordered beef pita with everything in it, falafels as a side, and that Jamaica/mango tea. Falafels were waaay hard on the outside but the pita was delicious!!!! My friend's steak was tender and delicious. We both liked the tea as well. Taking away a star for the hard falafels."], ["Patricia L.", "These guys take care of all my catering needs, could not ask for better food or service."], ["Ana o.", "Good fast food."], ["Nohemi A.", "Food is great, a lot of choices so you always have something new to try. This is one of my regular go to spots for a good meal. The environment is relaxed and usually kept pretty clean. Management and employees are very friendly and do an amazing job of explaining all the choices and letting you sample. However, there has been a couple of times that they ran out of rice and the next batch wouldn't be ready for at least 35min. Same with pittas and falafels but those don't take all that long to make but it's still annoying. All the times that they have been short have been during non peak ours where there is no more than 3 people in the restaurant. It's a little ridiculous that they would be short on these items when those are the things that are highest in demand, they should pay better attention to when those things are running low since that's what everyone is there for! Overall great establishment and besides these small annoyances I keep coming back because their food is worth it."], ["Sage M.", "mcdonald version of medditerranean. ok to not so amazing food but service are so wonderful"], ["Melissa S.", "I got my lunch to go, so I can't comment on atmosphere other than to say that it was fast, friendly and trendy. They gave us free samples when we walked in which was nice. Unfortunately the food we walked away with was disappointing. I got a salad with double meat (because they wouldn't do half chicken, half steak??) with a greek vinaigrette dressing. The dressing was incredibly salty - almost inedible. The steak was chewy and the chicken was flavorless. I had a meal with a drink and my husband got just a meal - supposedly one of the meals was free because I \"checked in\" via yelp at the register, but we still paid $24. Ouch. Not very GF friendly...They used the same serving utensils to stuff someone else's pita and stuck them right back in the containers."], ["Andrew F.", "Food was bland and over priced. $10 for a falafel sandwich and a drink. No sides. Would have been nice if servers explained what options were when ordering."], ["Theresa H.", "Dare I say it but they gave me too much food! Garbanzo is apparently a Colorado based chain. San Antonio is the first place they plunked down a store in Texas. The menu can be a little overwhelming at first but it's essentially a lot like a Mediterranean version of Chipotle. Choose your fresh bread. Choose your main and sides. Choose your extras and boom, delicious, fresh meal for not a lot of money. I wasn't a fan if the dolmas but I'm usually not anywhere so I'm not sure why I ordered them. Hope springs eternal, I guess ;)"]], "Zoës Kitchen": [["Talal M.", "Yesterday, I ate dinner at this restaurant. Here is my observation:01) The food was delicious.02) The price is right.03) the service was excellent.04) The restaurant looked very clean.I would definitely go back at least once a week."], ["Sam B.", "I still haven't been very impressed by anything I've eaten here, and I've tried it quite a few times.Everything sounds nice and fresh if you're reading it off of the menu, and it IS fresh from everything I've seen, but it just doesn't taste all that good. Bland and generally uninspired dishes they I've forgotten not long after I've eaten them is par for the course. The humus is okay. The teas and other beverages are pretty nice, but if the taste of the main dishes isn't there, why bother?Maybe it's just my general dislike of salads and salad-related dishes, but I just don't see myself coming here again often."], ["Stefany V.", "This is one of the chains I would love to take home with me to Vegas. Fresh, healthy, Mediterranean-style food, with great service and reasonable prices. I almost always opt for the salads, and add on a protein skewer- the orzo salad with shrimp is the best!Menu lends itself more to lunch than dinner, and they have several grab-and-go items in a refrigerator case out front. The hummus is pretty good, and the pita tastes fresh but tends to lack that just-baked taste to it. Service is friendly, and I love the open-plan space with bright colors and a great view. Small area for outdoor dining. Salt and pepper grinders on each table for additional seasoning, not that I've ever needed it."], ["Carla B.", "I was pleasantly surprised at how tasty the food was!! The Salmon kabobs were perfect, the Hummus trio is a blast of flavor, and the steak kabobs perfectly spiced. I was not expecting such a good meal at such a reasonable price!"], ["Rocio G.", "Good food; lot's of vegetarian options. This location was especially clean and the employees were exceptionally friendly. The portions aren't always consistent, but the food is fresh."], ["Patricia C.", "Impressed with this restaurant so much I was disappointed to know I couldn't purchase a franchise.  I also fell in love with how the crew that night was a TEAM.  Man I wish I could reproduce their TEAM WORK in everyone 1 of my stores.  The area was well lighted, clean, and an excitement was in the atmosphere, it was the place to be.  It was my 1st Zoes' ever and it made the best impression.  Hugo Perfect customer service! Giovanni Superior Team Leader, Manci made everything beautiful presented on plate & everything for our party of 25 taste WOW! With the whole restaurant buzzing it felt like these guys could handle working anywhere with easy. Food came out in a few minutes time and it look beautifully orchestrated!   They set the standard HIGH for every Zoes after them! 11/07/15 Hope to see ya, again!  I know that cook is going places!"], ["Trevor S.", "Great fresh food good service. Greek salad over potato salad with line made perfect. Dressing on table very good as well.  Staff was a really tall thin guy and a fat guy both working very hard and efficiently."], ["Krystal P.", "I can not get enough of this place! Their food is pretty much guilt free and the portions are not too much. I will admit they are slightly pricey for what type of restaurant it is but the food is fresh and clean eats. I usually get either the Greek salad with hummus or the salmon kabobs with hummus. The salmon kabobs come with grilled zucchini and a Greek salad also! My mouth is watering just thinking of it. The staff is super nice too, a man asked if I wanted a cup for water and I said no that was ok and he gave me one anyways and said well here's one if you change your mind. I thought that was so nice of him because I did change my mind!I would definitely recommend coming here, I usually do when I'm burnt out on cooking healthy and need a small break but don't want the calories associated with it."], ["Rachel T.", "This seems to be a very new location, so the interior was very clean and nice. I've seen this place multiple times around Texas & finally decided to check it out.The menu provides a nice range of Mediterranean options with a healthy twist. I ordered one of their salads, which was awesome and a very generous portion. I had to take some of it to go, it was so big. No disappoints at all! Very good for a quick healthy meal."], ["Erica B.", "Cop out for Greek/Med food. Carmelized onions in chicken pita were bitter, chicken on all plates were dry from being over cooked or re-cooked, hummus was cold, potatoes were mush and overpowered with lemon, the rice was overcooked but gritty, fruit was over ripe and mushy, and salad was watery. The only item that was ok was the steak kabob. Would not recommend! Especially if you have been abroad."], ["Roberto P.", "Good & Healthy Food. Organic ingredients, local sources, friendly staff. A little overpriced, but that is always the norm with organic food. It just not my cup of tea, for Mediterranean dishes, I rather go to Pasha, but if health food is your thing, you should definitely give it a try!"], ["Carolyn J.", "I ate here today for the first time and it was YUMMY!!!  I like a good fast-food Mediterranean food-stop.  What I liked most was the tomato bisque soup - not a sweet bisque (thank goodness someone knows how to make a bisque without overload of sugar) with cheese and yummy scrumptious arugula type of seasoning.  Crispy pita to dip, too.  JUM! JUM!"], ["Clint P.", "Food was very fresh and healthy.  Never heard of this place but tried it and loved it.  Ordered chicken kabobs and my coworker ordered a chicken dish with a side of beans.   My kabobs came with rice and a salad for $8 bucks. My coworker liked his beans so much he went to order more but they just gave him more for free.  I think they where catering to our male clientele because it looks like a place my wife would love but most men would pass up.   If you want healthy Mediterranean this is the place."], ["Polo C.", "Places like these are what San Antonio needs to stop being called the fattest city in america. I stopped eating fried foods and red meat a while ago and the menu here is so accommodating. Everything is freshly made and grilled Mediterranean food. They have salads, pita wraps, sandwiches, pastas, hummus, salmon, steak, chicken, and several appetizers. Try the chicken kabobs, they are fantastic. Another of my favorites is the greek salad. The plates are big so keep that in mind, the chicken kabob plate comes with two skewers and two sides for $8.99 . Like i have said before, whats your excuse to keep eating unhealthy food. The decor is modern and the music is hip so you wont get bored. The staff has to be my favorite part of the place, they are so happy and friendly yet also efficient. 5 stars for zoës!"], ["Wendy C.", "Zoe's is a favorite spot!  Their meat skewers are tender and served piping hot.  The seasoning in their sautéed veggies is amazing!  Steak sandwich is delish too but the hummus trio is the best.  Brownies are more like a cake which isn't my style but the chocolate chip cookies.....yum!"], ["Meg H.", "Fresh, fresh, fresh!!  I get the orzo salad with salmon and it's amazing. Portions are a great size but not over the top. Staff is always helpful and the restaurant nice and clean. It's definitely my 'go to'."], ["Amanda M.", "A few friends had recommended Zoes Kitchen, so when my husband and I wanted something quick and light, we decided to give this place a shot. They have sandwiches, salads, entrees, sides, desserts. We went with the steak and chicken kabob entrees. Holy smokes! DELICIOUS! They were extremely flavorful. The chicken kabob came with rice and a Greek salad. The steak kabob came with veggies and potatoes. I'll be the first to admit that I don't like most vegetables. These were.. incredible! Perfectly seasoned. They also gave us an order of hummus on the house because it was our first time visiting. Such a nice surprise! For the two of us to eat, it was about $22. We didn't leave hungry, and I know we'll be back."], ["Beau G.", "I'm so glad they opened one of these near the Drury Plaza hotel. The food is fresh,healthy, and delicious. The atmosphere is nice, clean, and relaxing. The staff is friendly and has gone out of their way to make sure I'm having a great experience every time I come in. I travel to SA for business and always eat here.Look for Elliot. He's the friendly guy who made my dining experience an 11 out of 10."], ["Chelsea T.", "Fresh is the word that comes to mind! All of the food we ordered was fresh and flavorful. We got the steak roll ups and gruben. Potato salad was yummy too! Great flavors, fast service and good prices! I also appreciate that the food is healthy, which is a challenge when eating out in San Antonio. I will be going back!"], ["James G.", "My wife and kids love this place. when we can get together we all vote here"], ["Lori S.", "The staff was so incredibly helpful and friendly and offered suggestions to the menu. We settled on the beef and chicken kabobs. Both were tender and perfectly seasoned without being overpowering. We were given a complimentary order of hummus, since it was our first visit. The chocolate chunk cookie...  Oh. my. goodness. Yummy!!! (and monsterous... be prepared to take some of that home for later) Portions are generous and the atmosphere is great!  We've been back twice already..."], ["Alma T.", "Food was great tasting and healthy.  Love the hummus.  Great alternative for something healthy with lots of flavor.  You dont leave feeling bloated.  Food was well presented and the portions were filling."], ["Amanda C.", "This is one of my all time favorites! They never let me down- the service is always quick and friendly, and food is always aaaaaamazing!!!!"], ["Jesse B.", "WOW this place is incredible. WOW. (Wide-eyed smiley.) I had heard from friends that this was a seriously delicious place and I was curious to see if the hype was true, but not so curious as to go out of my way to investigate. So one day after getting some shopping done at Trader Joe's across the way, and making the mistake of shopping while ravenously hungry, I decided I needed food and FAST. Hello, Zoes.First of all, when I walk into a new restaurant/eatery, I must apologize for doing the \"stare at the menu for ages\" thing, but when I have no idea what's on a menu, it's going to take some time. When the guy behind the counter asked what I wanted right off the bat, my response of \"I've never been here, so I don't know\" was met with excitement and so much helpfulness that I almost wept in appreciation. (Almost, I'm not that weepy.) He patiently waited while I looked at that menu for what seemed like ages and he did not dispute my choice of the Steak Strip sandwich with mushrooms, feta, and sauteed onions, served with a side of roasted vegetables.I went to sit down and wait on my food, which was delivered so quickly I must not have been paying attention (thanks, iPhone), and he courteously brought me napkins with a fork wrapped up. I shoved half of that delicious sandwich in my mouth in no time at all and the roasted vegetables were delish! I am fully impressed. Not only that, he was prompt in grabbing my a to-go box for the rest, and was super sweet in trying to stop me from bussing my own table (oops, I guess they do that for you?). In other words, just in case you haven't figured it out, this was an amazing visit. I know they pulled out all the stops for me because I was a first-time visitor and there wasn't anyone else there really, but I was drop-dead amazed at how much they turned their volume up to 12. On a scale of 1 to 5 in amazing, I wish I could give them a 7, Zoe's was that AMAZING. Not only is the food fantastic, the service is even better. DEFINITELY come here, again and again and again!!!!!!!!!!!!!!"], ["Mindy Y.", "The food was delicious but the service was horrible. The lady that ordered to go for her and her daughter in front of us waited about 30 minutes for her kabobs then ended up getting a refund and left, no remorse or apology.   When I asked to check on the ordered hey went straight to taking more orders from the line. We ordered kabobs as well and they sat on a counter for about 10 minutes before anyone gave them to us after waiting 25 minutes. Not efficient at all,Don't think I will go back to this location."], ["Anissa S.", "It was the first time visiting, the staff was aware and went the extra mile of helping me decide what to get. All the recommendations were perfect, food was great! I'll definitely will be visiting again."], ["Ginger M.", "Always good always fresh. Went with the steak kabob basil hummus and quinoa. Live their new rewards app!"], ["Erik D.", "Fantastic staff, food, ambiance, everything.   Ask for trials and they love to let you try stuff."], ["Matt K.", "Very good, fresh food, plenty of healthy options. Nice patio seating. I've been back numerous times now. Definitely a favorite, something to change things up."], ["Mark M.", "This place is awesome!  Best salads in town healthy and delicious. Go for the tossed Greek salad."], ["Lisa R.", "Zoe's Kitchen never disappoints. EVER. Every time I have been here, the food is fresh and delicious! My \"go-to\" item off the menu is the pick two with half of the chicken salad sandwich and a side greek salad. And their iced green tea is just AMAZING. Their prices are incredible and their staff is extremely friendly and will go above and beyond to make you feel welcome! Definitely one of my favorite places to eat!"], ["Chloe S.", "Delicious food!!! I recommend the chicken salad sandwich with a side of pasta salad. The hummus and pita chips appetizer is a great starter as well. Prices aren't bad and portion sizes are great. I love this place!"], ["R G.", "Very fresh and clean. Went here after I worked out at Orange theory and I didn't feel guilty!! Healthy food with all ingredients you can pronounce."], ["Alexandra H.", "This place offers light, refreshing, and filling meal options. It's a fantastic alternative to typical menus at most restaurants!"], ["Gerard V.", "Nothing like Ranch dressing on my Greek salad.  That's what I had at home and had to use when Zoe's didn't put any dressing in my $40 family dinner to go order.  What a huge disappointment. Go through everything before you walk out of the restaurant."], ["Anne R.", "Food is delicious!!!   Everything is fresh and the baked goods are awesome!!!! The staff is friendly and the owner is sweet:)"], ["D C.", "This is my first time here. I was given a gift card for Christmas. First impression was it looks clean. The second was the person who helped me order my food. He was such a sweetheart. He had amazing customer service skills. He took his time to explain the way the food is prepared. My receipt says Giovanni. He checked on my through my meal. The people here also clean a lot there is not one dirty table.My food came out and it is delicious. I got the chicken kabobs. It's a lot of food for a great price. I will have two meals out of this. I will be back for sure."], ["Brent C.", "Came here for lunch not sure what to expect. The lunch line was long with only one person behind the register. From my place near the back of the line at the door I couldn't read all the menu because the font was too small. As I got closer and could read the fine print, I saw that the choices were pretty sparse and pricy for lunch. I wanted to get the 6.99 Pick Two, but of course the fine print prohibited picking any sandwiches except from the two Classic choices...which were not appealing. So I settled having to pick the Grilled Chicken Mediterranean Pita with a rice pilaf as a side because the best side option (a side salad) raised the price even higher by a $1.60. So, after not getting what I wanted to eat, being made to feel like I was getting nickeled and dimed, and no place to sit except for outside and paying over $8 for a simple (and average tasting) pita sandwich, I doubt I'll come back."], ["Samantha F.", "Excellent service use this location for work catering always on top of what needs to be accomplished never a disappointing lunch thank you David!"], ["Natalie H.", "Fast, friendly and healthy food! Everything is so good! Download the app for free goodies."]], "Papouli's Greek Grill": [["Brian R.", "I ordered The Mediterranean salad with an extra skew of chicken and a drink. My bill was over $17. Food quality was great but the price seems to be a little high.$$$ However, some items on the menu maybe more reasonably priced and I will certainly hit this place again."], ["Lindsey H.", "My husband and I have both had years in the restaurant industry. I tend to dislike posting negative reviews, but I think this one can be constructive to whomever in management reads it.When we walked in, we were seen but not greeted. When we walked to the register, there were two cashiers at the front. One was counting money and the other was.....uh I don't know what she was doing. We were not acknowledged until they guy who was counting money nudged the other cashier. She did not greet us, she just morosely asked us what we wanted. She seemed incredibly bored and as if we were troubling her by giving her our order. Once again, we have been in this type of role with waiting and customer service, and we were both very disappointed.All but one of the staff seemed very bored, lackadaisical, and unhappy to be there. Our food took a long time, and we weren't impressed.The falafel tasted like it had been frozen. It was also in little cookie-cutter shapes. Definitely frozen. Definitely the worst falafel I've ever had. It wasn't BAD, but it was not good. It was like the White Castle of falafel. The fries were soggy, though we did enjoy the fact that they seemed to be fresh cut. The fruit was fresh and juicy. My husband and I both ordered the falafel, so that's all we can comment on and it was a disappointment.On a positive note, one employee was smiling and we noticed him asking other tables how they were doing towards the end of our visit. He thanked us as we left. If all of the employees had been like him, our experience (besides the food) would have been better. We didn't catch his name, but he was tall and had long black hair tied in a ponytail. He had a friendly smile and was the only welcoming face in the restaurant."], ["Chelsea M.", "I was pleasantly surprised by Papouli's. It's a chain, and I don't often have good feelings about chains, but I opted to stop here anyway. I'm glad I did.I ordered the falafel pita which is huge, and very delicious! The pita is scrumptious, and the falafel is nice and crispy on the outside yet still moist on the inside (yuck, I hate the word moist but my vocabulary is seriously lacking at the moment!). What I loved about Papouli's pita is that they put tzatziki and hummus in there ... I often have to request it or don't have the option at all. Both were very rich and creamy. The plates come with a side option, and I was super excited to see tabouli offered as a free side. The best part? It was divine! Fresh parsley, a good amount of lemon juice and a perfect ratio of tomato, bulgar, and parsley. One of my favorites to date.The service here is friendly, and during a busy lunch hour at this location I've only waited about 10 minutes for the food to be ready. I will be back!"], ["Natalya G.", "Good food but doesn't have a home made flavor to it like most of Greek restaurants do. Solid 3 stars. Nice decor, pleasant back ground music. No Greek wine :("], ["Desirae F.", "Food came out fast. Restaurant is clean. I ordered the traditional plate with gyro meat.  It was a big plate and delicous. The salad was not the best, but overall the meal was good."], ["Marcelino C.", "Delicious food and extremely fresh! The staff was helpful and friendly, as it was my first time here. Excellent and speedy service. Recommended."], ["Zachary J.", "I had the falafel pita sandwich and my girlfriend had the Mediterranean salad. Both plates were good."], ["Jimmy D.", "IDK if this is a chain, franchise, or just a local shop but its decent. I got the Zeus which is supposedly 1/2 of meat. And it really hit the spot. Like literally that thing was huge! It satisfied, maybe I was hungry or maybe I didn't expect much from a shop. Also I was dining in about 10 minutes before closing time and the people we're pretty chillax. so thats a plus. Definetly made the right choice over trying Freebirds haha."], ["Lance C.", "My wife and I order the Papouli's Feast, and it was delicious!  Everything was seasoned very well and the lettuce was very fresh and crisp.  Though the portions were very generous and we had plenty of food, I overlooked the fact that the feast does not come with hummus.  A mistake I will avoid next time, and there will most definitely be a next time."], ["Emily C.", "We ordered the classic gyro and a lamb burger. Another customer took our burger so they had to remake it. While we were waiting they sent out pita, hummus, and basil feta spread. I think the basil feta spread was my favorite part about eating here. The gyro and burger were both great. The bread on the burger was fantastic. Our expectations were very much exceeded. Love the attentive staff. I am impressed that they would try to make up for a mistake that wasn't even their fault."], ["Nick M.", "Really friendly staff and the food is pretty good. It has grown on me. My son likes it a lot too."], ["Manuel M.", "Food was good.  I thought the salad and gyro was a good change from the usual food choices of there. Place was kind of dull in ambiance but a great take out option."], ["J M.", "My family wanted to try something different so we took a chance. We were soooooo glad. We ate the Baklava before our meal was ready. It was great. The atmosphere was very welcoming and the staff was patient with us as we tried to decide what we wanted. We will return."], ["Michelle I.", "Love this place. My husband and I eat here at least a few times a month. He typically gets the lamb gyro with fries and I get some type of \"build your own plate\" meal with steak kebabs, orzo, wheat pitas, and Greek salad. Restaurant is always clean and the service is always good."], ["Hilde T.", "We stopped by last week and was very pleasantly surprised. Had the gyro, hamburger, tabbouleh and fries. Everything was very tasty. Staff was friendly and attentive and the restaurant was clean. We will be back so I can try the falafel and hummus too."], ["Heather S.", "Came to this establishment just to get a to-go menu. When I arrived, the girl at the register was very slowly tying up to-go order with her back turned to me. Someone informed her that I was waiting and she responded, \"I know\". I continue to wait another minute and someone else informs her that I'm waiting and she responds, \"yea, I know\". As I stand there wondering when I am going to receive any acknowledgement from her, I start to get irritated. Am I really standing here for 4 minutes just for a to-go menu?  Then it hit me, I don't care if the food here tastes like it came from the HEAVENS...based on first impressions, I won't be returning."], ["Jessica G.", "While the food was delicious, the menu is not very clear on pricing for the lamb dishes. The build your own plate is supposed to be $9.99 and to have it as 2 lamb kebabs should add 6.40 to the price. Some how they actually charge 18.99 for this plate. When I asked the cashier about this she was very rude and stated that 18.99 was the cost after tax (17.70 would be mathematically accurate) but I also noted that the subtotal was taxed again. The only explanation was a huffy statement along the lines of \"that's just how it's done\"...good food but due to poor customer service,  I won't be going back."], ["Sarah F.", "You order at the counter, get your own drinks, and find a seat. I got the traditional plate with gyro. My bf got the gyro sand which. They call your name and you pick your food up at the window. You have to get your own napkins and forks too. The place is very nice. It's decorated to look like a little Greek building. The food was excellent. Lots of cheese on my salad, the orzo is delicious, and the pita was fresh. This place would be better is they actually sat you and took your order. No $$ place should make you get your own silverware and stuff. I will be coming back though!"], ["Chris A.", "This is what you get when you franchise...The food is what you expect. It is good, not great, and consistent. Nothing here blows my skirt up but if you're jonesing for a gyro, well, any port in a storm."], ["J C.", "Food was really good! Ordered take out. Not too busy and didn't have to wait too long."], ["Juan H.", "Great place for fast Greek food.  Had the traditional pita sandwich with gyro meat and pasta salad.  The meal is definitely worth the money--great sandwich with plenty of meat.  Jalapeño Fire hummus had a good kick to it.  Two meals and an appetizer for under $25.  Great customer service. Place was kept very clean.  I'll be back next time I crave some quick Greek food."], ["Brandon R.", "As far as Greek places go in San Antonio, Papouli's is hard to beat. It's a localized chain and obviously everyone's go-to Greek place. Best gyro I've ever had? Not really... the best is back in Utah, but this is good enough. The restaurant is clean and has a nice atmosphere. I'm still on my quest for the best gyro in San Antonio, my next attempt will be Jerusalem Grill... they aren't quite on the same playing field as Papouli's (business-wise), but they're a good mediterranean restaurant.Papouli's has some really good hummus, there's a variety of flavors (I like the jalapeno). The dessert is kind of disappointing, I haven't yet tried the baklava so I can't comment there but the custard thing with a very long Greek sounding name was a complete waste of money. My main criticism is it wasn't sweet and hardly had any flavor at all. It would probably have been better with honey drizzled over it. Another big criticism, they are a Pepsi restaurant."], ["Dee R.", "For a fast Greek place it's pretty awesome. Everything is cooked to order. And fresh very tasty and really fast . They have their system down. Even in lunchtime they were very quick to get everyone's order out.. I had the all chicken traditional plate and ordered two dolmas delish!!"], ["Rey M.", "Love this place! Gyro and lamb is delicious... Can't go wrong with any of their GreekTown sides."], ["Jamie B.", "Just moved to Texas and my palette was craving greek. I yelped a few places and pap ' s had very good reviews I'm glad I took their advice . It just so happens that we've been there twice in a week ( don't know how that happened). The place is clean staff is friendly and the food is great. Might coincidentally be back a third day!!!!!!!"], ["Allison O.", "The service is always great and the food is always fresh and hot when we get our food! I have yet to be disappointed by this location!"], ["Rita M.", "I come here often, I LOVE their Greek salads.  The gyros would be better if their tzatzki sauce was better, it needs more garlic, lemon, and dill.   Otherwise I'd come here at least once a week.  I'm a little obsessed with gyros, been eating them since I was 15, so much so that I learned how to make them at home.  I still highly recommend it!"], ["Augie S.", "I went here on my lunch break yesterday. Although it was lunch time in one of the busiest parts of town, I got my food quick in about 10 minutes.  Not bad! I ordered the lamb burger with fries. The burger was great, cooked perfectly at medium rare and had that really good lamb flavor. Service was very pleasant; all the reviews here about the staff being incredibly nice are on point. The only thing I didn't like we're the fries. They were undercooked and didn't have any crisp to them. Even with that in mind still a great experience and I'm sure I'll be back for more!"], ["Jon O.", "Greco Roman-Chicken or Shrimp is awesome! Tender and flavorful. I get the cucumber sauce on the side because it's cold and it's a great mix with the hot chicken or shrimp when you dip. The service at this location has always been 5 star! My 2 yr old didn't eat his kids chicken skewer because it was a little tough and un-seasoned, but the manager didn't hesitate for a second when we asked if we could trade it out for beef instead. The bus guy was the nicest too, even tho he probably didn't have to, he kept making sure we were taken care of. I recommend this place for anyone looking for Fresh, great tasting, healthier than most options. Pasta salad is a good snack while you wait too!"], ["Gilbert S.", "I'm never disappointed of this restaurant. A great venue for Greek food in the San Antonio NW area.  Highly recommend to try the traditional platter and the traditional pita sandwich.  Both the gyro and the steak tastes really good!  Also the rice and the Greek salad is delicious.  Definitely will come back.  Professional and friendly staff."], ["Jesse L.", "I was pleasantly surprised with this place. I thought it was a few dollars too high, but the price was reasonable overall. I left happy and full so I can't really complain there. It was a clean place and family friendly. For \"fast food greek food\" it was pretty good. I'd go back in the future."], ["NunYa B.", "The Taco Bell version Greek food. Dont waste your calories here. Yes friendly staff but food quality was mediocre."], ["De R.", "Not bad considering its a chain, but still lacking a bit in flavor.  I'll definitely continue on my search for truly scrumptious gyros and falafel."], ["Leena G.", "We had the Papoulio's feast for 2-3 people with 4 different meats chicken, lamb, steak and lamb skewers tossed Greek salad, dolmas, spanikopita, tyropita  and pita bread with tzattzki sauce all that for $28.99 Yum yum so good and fresh.  More than enough for 3 of us. Got here at 8:30 pm and everything is made to order. This is a keeper in my book!"], ["Cesar C.", "Fantastic food, good portions and very attentive and helpful staff. Can't wait to go back."], ["Edith M.", "great!"], ["Howard H.", "We often eat here.  We like the food, especially the gyro and fries and the Greek salad and skewer plate.  They offer considerable flexibility in ordering sides so one is not stuck with just the ordinary."], ["Jas S.", "When I think of Greek and grill I think healthy. Well my salad and dressing wasn't tossed and it was drenched with feta cheese. My gyro and grilled shrimp oily. The cashier didn't tell me of an up charge from rice to a salad..really? For some reason I paid $17 for one meal. Skip this place unless you have too."], ["Faith R.", "This location has tasty food that is always consistent.  Service always great. If you're unsure what you would order, try the Traditional Plate, with steak and gyro (you get 2 meats).  The pitas are good, nothing great.  Their citrus dressing is a nice change from the traditional house dressing. Last, the place is always clean!"], ["James G.", "I visit San Antonio frequently on business and I am always looking for new places to eat.  I especially look for the non-chain type of places that cannot be found in every suburb mall.  Although there are several locations, I was really impressed with the quality and the flavor of the food.   I had the roasted red-pepper and a Checken Greco Roman Pita Sandwich and would order both of them again.  I look forward to going back and trying more things off there menu!The staff was friendly and curteous.  I am definitely going back."]], "Mina & Dimi's Greek House": [["Kathy F.", "OPA!!! I will be going again and again and again.I have been to Greece, I would compare their food to the food I have eaten in Greece. It is very authentic. We had the Fat Gyros. We took two to go for my kids, who loved them. It does get very busy at lunch time, which I can understand, everyone wants to eat here. So be prepared to wait or go when the rush is over. I do wish they would play more Greek music. Staff is very friendly. You order and pay, then find your own seat. They bring the food to your table. They also have a punch card system. 6th meal is free."], ["Elise S.", "Fast and friendly service. Over two visits the food was consistently good. The calamari was hot and fresh. The Greek salad was seasoned well and crisp. The gyro was soft and savory. Finally, the Hercules platter was more than enough for two that want to try the gamut of the restaurant's offerings. If they would update the decor and have a bigger wine selection, this place would be a home run!"], ["Matthew M.", "Best gyro in SA, and a contender for my favorite gyro spot ever. You absolutely have to order the feta fries, served with tzatziki and feta crumbles. Definitely health food ;)Because the gyro and I are in a monogamous relationship, I've yet to try anything else on the menu, but guessing you can't go wrong here.One note on desserts - the red velvet cake was a little dryer than I'm used to, but decent enough to not impact the star rating."], ["Elvis M.", "This is a place that when you walk in is not the greatest, but their gyros are amazing and you know what makes it amazing? The tzatziki sauce and plenty of gyro meat in your sandwich. The location is not the greatest, but it is okay during the day."], ["Jade M.", "My mom and I came here for lunch today and it was delicious! We shared the Hercules platter ($29.99 for two) which comes with beef, chicken and gyro on a sizzling plate with grilled onions and tomatoes. You also get two Greek salads, oven potato, pita bread, tzatziki and honey mustard. My mom also tried the lamb chops and she said they were very good and well worth the $18.99. The food came out quickly and everything had great flavor. We also tried the baklava cheesecake. Honestly it was just okay, I wouldn't order it again. The baklava topping was kind of stale and chewy tasting. We ended up just eating the cheesecake on the bottom and the inside of the baklava. The restaurant is a little small and it's kind of dark in there (during lunch they didn't have any lights on inside, just the natural light from the windows) but the food was definitely the star of our lunch experience. We'll definitely be back."], ["James D.", "What a good place! It's a little off the beaten path, but it's worth a visit for some tasty Greek food. We started with the flaming cheese saganaki. It was presented table side and then set ablaze on a sizzling platter. Served with warm pita bread, the gooey cheese was delicious. For entrees, I had a trio of shishkabobs- chicken, pork, and beef. This was served with Greek salad, tatziki, and I subbed hummus for potatoes. All three meats were nicely seasoned and still very moist. My fiancé had the pastitsio, which she really enjoyed as well. The service was friendly and attentive, despite arriving 20 minutes before closing. We didn't feel unwelcome or rushed in any way."], ["Lacey C.", "What a treat this restaurant was! On a trip to SA, we found it out of the way. Not really knowing what to expect but drawn in by the menu, we made the 20 minute drive from the hotel. So glad we did! It was fantastic. A cute little place in the back of a strip mall, decorated with all kinds of great stuff. The waiter was really great, the food was delicious. We were happy happy! I got the Pastitsio. My fiancé got the combination kabob. We both got salad and pita. And for an app we got the flaming cheese. So glad we came here!!"], ["JerseyGirl B.", "Just stopped in for lunch with a few of my coworkers and we were all extremely surprised at how delicious the food was. Of course we started with dessert, I had the red velvet cheesecake and oh my goodness it was to die for. It's a small hole in the wall but so worth it. We got the beef souvlaki, the chicken gyro and the mixed gyro platter. Everything is amazing!"], ["Bruce W.", "Best gyros in town. Every time I go I get the gyro and fries.  You can also get the fast gyro.  If I get the fast gyro I never finish the fries because there is so much meat.  The price is fair.  They do have a wide selection of entrées but for me,  I love the gyros"], ["Bea M.", "Definitely cured my craving!!! Loved this place. Fast service and they are super nice. My drink was never empty. I went during lunch and it was a super long line but not a long wait. Affordable and the food is delicious. Just about everything here is yummy. Go check it out and see for yourself."], ["David H.", "Very good gyro and fries, salad was a little lacking. Always enjoy small hole-in-the-wall atmosphere"], ["Christina J.", "This place is so good.I got the fried zucchini appetizer and chicken combo and it was so amazing.The service was marvelous and you must try the baklava cheesecake. It is to die for!!They have a huge dessert selection and I wish I got more dessert.If I lived in Texas I'd be a regular..Until next time"], ["Talal A.", "Ask for the special lamp chunk (not on the menu)I really enjoyed my time at this place, and definitely will get back again."], ["Joseph K.", "Good food, and they are usually quite quick in getting it to you. The problem comes with the space. There just doesn't seem to be enough for the amount of people and tables. A little crowded and sometimes hard to find a table.  I've been here several times, and some times the table situation is worse than others. I have had the fat gyro and the gryo salad, both of which tasted great."], ["Ginger A.", "Way way way way way over-priced. I was in shock when we heard the total for two platters. While the food itself was actually ok, the dark,small, and crowded dining area, along with the high prices, just made the experience unenjoyable. And the baklava was disgusting. I am glad I tried it, but I really can't go back. It's just a really poor (and stressful) dining experience."], ["Valerie P.", "Best Greek food I've had since moving to San Antonio. This is place is right off the base which is very continent to those who work on the Air Force base. I was surprised on how fast the service was, I was ordering food for some girls at the office and received my food in 5 minutes. The waiters were very nice and the prices are decent. Recommend this place to everyone!"], ["John S.", "I've been to Mina and Dimi's multiple times in the last few years and heave tried an assortment of their dishes. Every time they have been delectable  treats that make our visit well worth the trip."], ["Zeze A.", "Overrated! I paid more than $30 for a plate of lamp that I really didn't like anything in there.. Plus I asked for an extra pita and they told me I needed to pay $2 plus tax!!! It's more like you're spending your money at fogo de chao over McDonald's crap!!!"], ["Helga M.", "This is my FAVORITE Greek restaurant in town! My bf and I found it thanks to Groupon. Other reviews are correct in saying that the location in a run down shopping strip can be a turn off. Don't let that deter you because you won't regret it! The owner or at least a family member are always present to be sure everything is as it should be. The first time we went Dimi was the one who took care of us. He recommended the rolled grape leaves (Dolmades) for an appetizer and the Hercules platter for two. We were amazed with the flavor and freshness of both plates. The grapes were tasty and stuffed to perfection. The Hercules platter it's like a sampler for two. It includes gyro meat and two types of shishkabobs (beef and chicken) along with potatoes, two salads and pita bread. It was delicious and just enough for two! Don't forget to leave room for dessert. They are always great here and they sell out fast. We shared a Dimi's original better than sex cake. How ca you go wrong with a name like that! ;)The friendly service and family atmosphere is what keeps me coming back for more! There's also belly dancing on the weekends and it gets pretty crowded but to me that's a sign of an outstanding restaurant with unbelievable food. I will keep coming back as long as they are open!"], ["Alvaro S.", "Just delightful!!!!! Had lamb chops cooked to the perfect point!!! The waiter was awesome and desert was great!!! Overall a awesome experience in Greek Cuisine!!"]], "Kosta's Greek Food": [], "Pasha Mediterranean Grill": [["Robert B.", "I went with my friend and his family. The food was excellent. The na'an was tasty. My veggie combo plate and soup was delicious. I couldn't call it excellent, but it was good.Service was excellent, perhaps one of the best waiters I've run across in many years. I had Rose tea. Tastes just like it smells, fresh roses. Really interesting. I was uncertain at first if I liked it, so different. By the time I left, I had my glass refilled many times.Five of us had appetizers, meals, tea, and it was under $60. Impressed with the price. Our meals were delicious, we all enjoyed everything. Recommended."], ["Christopher D.", "This place was awesome! The ambiance...the waitstaff...and the food was all awesome. Two enthusiastic thumbs up"], ["M S.", "This was my first experience with Mediterranean food, i had the beef schwarma, fries and the sauteed banana for dessert. I loved every bite and will be returning."], ["Mike B.", "Ate here for the first time while in S/A last week. Can't believe I never noticed the place before cuz I used to stay at the Drury next door on occasion and have driven by many, many other times on my way to Baker Street...I'm not one to write four star reviews on a first visit, unless... Well they pretty much have to blow me away. They sure as hell tried!!! (FYI... I'm also not one who really likes eating by myself unless there is a full bar I can sit at either), but I was with a small group this time and ate here anywayz, (i.e., no bar, boo hoo).Without getting into too much detail, I tried the Mediterranean Seafood Plate \"Combo\" that came with fish AND shrimp, (I love seafood), rice and this sauteed spinach $hit that was kick a$$ good. (I love my greens too).Will definitely try again on my next visit, but this time, I'll be sure to have a full on buzz before I go in. Maybe I'll feel even more generous afterwards and bump it up a notch..."], ["Celeste B.", "Best hummus in town...hands down. You're also given fresh naan immediately after being seated! Everything on the menu is delicious, gives other local Greek restaurants a run for their money. My personal favorite is the chicken Shwarma wrap...with fresh pickles and amazingly flavored chicken, it's definitely a winner!"], ["Faisal A.", "Undeserving of its current reputation. There have been a ton of Mediterranean restaurants popping up in San Antonio and this place has fell behind. I think this place used to be better and it also used to be one of the only options in the area for Mediterranean food, but neither are the case anymore. The one thing they have going is their bread, which is probably one the best I've had... But I'm not gonna eat some were just for the bread. All the other food is overpriced (compared to other places you can find now, aka darna down the street) and the meat is dry. Their garlic sauce is no good either. Probably more accurate to rate as a 3, but subtracting a star to try and bring attention to both the restaurant and other customers that there are better options available. They need to step up their game."], ["Nicole L.", "Wow!! This place is awesome!!! It has been on my list to eat at since I keep hearing some really great reviews about it from people that I know. I finally made it over there tonight when I was craving some Greek food. I ordered the gyro platter that comes with gyro meat, hummus, salad and bread. I also ordered an appetizer of the baba ghanouj. I ordered a few extra pita bread and I was shocked that they were going to charge me a 1.99 per pita. Little did I know that when I got home I opened the bag of bread and they have gigantic pita bread so good thing I told him to just give me the bread that comes with my meal!!! I was very surprised and very happy with the amount of food that my order came with! I couldn't even finish my whole entire meal! The food is also very delicious and I cannot wait to go back and order something different!!"], ["Sherry Y.", "The absolute perfect combination of professional, efficient service and delicious, rich food with just the right amount of nutrition to prevent you from feeling too guilty. I was a bit skeptical to find authentic, affordable Mediterranean food in San Antonio, but Pasha put my wariness at ease immediately upon entering the spacious, elegant restaurant. With several seating arrangements in an alcove inner area to two-person window seats and generous family seating, Pasha has something for everyone desiring a festive, easygoing ambience. Our server gave us just the right amount of wait time before taking our order, and served us in less than 10 minutes flat. It was the most carefree dining experience I have had in a long time. She made us feel cared for, but not sheltered like some looming waiters often do.Food-wise, we were enticed by the free bread laid out in all its toasted glory with a generous dose of olive oil and herbs on the side. My date and I finished the generous loaf in less than a few minutes, reveling in its light yet crunchy texture. Steam rippled into the air as we scrambled to tear off pieces without looking like ravenous animals. (I say we semi-succeeded). It was just the right amount of cushioning in our stomachs before our delectable main courses. I had the chicken shawarma lunch wrap with a Greek salad on the side. The orange-tinged dressing on the salad gave just the right amount of acidity to the side greens, rendering them gone on my plate in a matter of milliseconds. The chicken in my wrap was juicy and smoky, just the right amount of heat added by a chili sauce lovingly wrapped by the warm embrace of the bread. Absolute perfection. My date had the equally tasty gyro wrap with tzatziki. I must say, it was a conflicting moment with so many amazing options on the menu.With great deals and moderate pricing, there is no way you can pass on such a warm establishment with friendly staff and killer food. I recommend this for anyone in San Antonio longing for a Mediterranean bite to eat."], ["Matt M.", "Pasha first and foremost has wonderful wait staff and incredible bread. The bread dipped in the oil and herbs dipping sauces or chili and oil sauce is enough to make a meal. You might as well order your kabob to go because once you taste this bread you are not likely to stop short of maximum stomach capacity. The kabobs are delicious, the vegetables fresh. The teas are especially good, with the rosewater tea being the best we tasted. We'll be back again soon."], ["Lady R.", "For all the folks who have been in SA for a while, this is the old Taco Cabana and old SombreroRosa restaurant. It looks kind of eh from the outside but inside is a nice restaurant. You get seated by a host and waiter comes to your table. We weren't expecting that. This place has to go too where you just pay when you enter. We got the trio and the number 1. I think one of their most popular plates is the number 1. We got a huge pita that was piping hot. Tip: mix your mound of spices In with the olive oil. Those spices are amazing! Great for snacking and great with the meal. I really liked their hummus and Greek salad. The chicken was very dry and the beef was just ok. I did like their lamb sausage. I love seeing a Mediterranean place close by so keep up the good work Pasha!"], ["Alisha M.", "\"Is there anything else I can get you; because you're done eating and people are waiting...\"If you enjoy being insulted during your dining experience then head on over to Pasha off of Wurzbach road! You can suck on ice when your beverage runs out and be shooed out the door once you're done with your meal. Truth be told, the food is good. I've been a regular customer for the past five years but after today's service I will NEVER return. The service has been on steady decline for the past year and a half and today my friend and I were literally asked to leave because we were done eating. If you want to try this place, go for it but order it to go and save yourself the metaphorical kick in the ass. You'll probably do a better job refilling your drink, anyway."], ["Jenny V.", "Delicious. Tzaziki sauce was to die for! Staff was friendly and offered several recommendations and samples. Very timely despite it being the lunch rush. Great atmosphere."], ["Eliseo R.", "Visiting from Laredo. Food was good. My food unlike my gf's, was a little cold. Besides good experience. Ok price."], ["Majed A.", "This restaurant gave me one of the worst customer service experience ever ! I made a to go order and I went home with my order not knowing that my order is missing the rice and bread and that they gave the wrong salad. Came back thinking that they will meet me with a sincere apology. Instead, the server denied giving me the wrong salad even though I was holding the wrong one in my hand when I entered. I have to ask her to apologize at least for the trouble. She did with a clear heisted way. I wish I brought the food with me then I would have returned it and took my money back. I am feeling bad to even give them 1 star!  The food was ok and does not worth the trouble. I don't recommend it."], ["Brian F.", "Stopped by here on 06DEC14 and had a great time.  The waitress we had I don't think could've been nicer, more attentive or knowledgable of the menu.  She was solid at her job.  My family of 5 ordered all different things, some at the suggestion of the waitress.  We had hot bread and oils brought to the table to start with and the size of the bread was enormous.  Everyone enjoyed their meals and the hummus was probably the best I've had.  We stopped by Pasha between hospital visits and fortunately were able to relax a bit and take our minds off of my uncle in ICU.  I'm definitely going to revisit Pasha again."], ["LariZa S.", "I am about 6 and 1/2 months pregnant and Mediterranean food is all I've been craving.  My friend took me here for lunch once and now I have to have Pashas at least 2x/a month!  I order the Gyro lunch plate... it's a perfect size and the Rose Tea is a nice compliment."], ["Tina R.", "Don't be fooled by the cover. This place is really good. A well maintained interior that's nicely appointed, with friendly & efficient service we thoroughly enjoyed the experience. The braised lamb shack is served in an stewed okra, tomato, onion mixture loaded with Mediterranean spice-wonderful! The shawarma trio was just that, each meat perfectly prepared. The hummus was perfection. Greek salad also very tasty. And the naan...oh, the naan! Served with spice & olive oil, it's truly the best complement to the meal. Step outside your comfort zone & give this place a go!"], ["Ivy T.", "Loved their huge fresh naan they brought out.  They continued to bring out fresh naan especially when you out.  I ordered the shawarma combo platter which included salad, hummus, gyro/chicken shawarma/beef shawarma, and three different sauces.  I preferred the gyro meat overall.  I wanted to try their cardamom ice cream but they ran out.  Next time!  Excellent service and to top it all off, the waitress gave us fresh naan when we took our left overs home (which was delicious the next day)."], ["Marissa T.", "I love this place. The food is always good and the servers are always nice. Meals are served quickly if you are in a hurry but you don't feel rushed if you are trying to enjoy a nice dinner. I love the huge naan with oil that is served before the meals. It is always very fresh and delicious. It does get a little crowded/noisy here in the evening and on weekends but it isn't too bad."], ["S S.", "Wow this place is great we prefer the chicken and beef swama ? But the service is the key to 5 stars ! The food humus , naan bread um um"]]}