{"Laddu Khan Kabab And Biryani": [], "Bawarchi Biryani Point": [["Praneeth K.", "Its still the only indian place that i frequently visit in san antonio. 1 because there is no other authentic place, and 2 all other indian places around are way far from being OK.Seeing is believing at times july 4th was a judgment day i guess, there were sooo many people. A lot standing out as there was no place inside anymore. Luck me i ordered a take out.  Yet had to wait 15 min, which was fine looking at other people"], ["Rahul N.", "This is not a place for sure to have indian food. Bawarchi is chain of restaurants and i always go to Bawarchi in Houston which is really good place. But this Bawarchi ... needs a COOK to COOK real indian stuff. I had ordered Chicken 65 and it was just chicken nuggets ... i could have got those in McDonalds as well. One thing was good that when we complained the staff took my complaint positively and tried to make other one which could satisfy me. Appreciate the staff's effort. But what they need is real good cook .Also, This place needs cleanliness ... there where flies bugs flying around ... that was big step down for me to again visit the same place."], ["Jeremy G.", "I love Indian food! In my opinion, the typical Indian buffets get old after awhile. I was very glad to find an a la carte place like this. I've been here several times and have had the Chicken Biryani, dosas, shrimp curry, and chole bhature. Everything is spicy and flavorful. Chole bhature is one of my all time favorites. I typically frown upon dishes that are vegetarian, but I make exceptions for this dish. Fried bread dipped in spicy garbanzo bean curry...mmmmm. The next time I come back I want to try the Goat Biryani!"], ["K B.", "This is my favorite place for Indian food in San Antonio. I know it's a chain, but it's level of spices and flavor far surpass any other Indian joint around (and I have tried A LOT of Indian restaurants). I was amazed at how good biryani rice could taste and after trying theirs the buffets in town do not compare. The food is excellent. The service is rather poor. Literally have to seat yourself, about 1/2 of the time I have to grab my own menu and go up to the cash register to order. I also have to frequently flag the waiter down for more water. But the flavor of the food totally makes up for the sucky service.Give it a try. You won't regret it! And will probably be hooked..."], ["Christine T.", "This was my first time eating at bawarchi and the food was very flavorful. I ordered the palak paneer and tried some of my friend's shrimp masala (btw spicy is verryy spicy.. I might go with mild if I ever ordered it). I thought the paneer was great, not spicy at all, and the spinach sauce was tasty. The garlic naan was perfect, portions were decent and overall very affordable plates. I thought it was a little strange that water jugs were left out at each table, not sure how long it has been sitting out. The place is a little hard to find, in a corner of a shopping center, but there is plenty of seating inside the restaurant. I would be back again, would like to try their Gobi manchurian and biryani."], ["H B.", "bummed they fell into the same routine as so many other desi-restaurants in town.. Quality and cleanliness have gone way way down.  Cant justify my original ratings anymore."], ["Melissa M.", "The flavors here more authentic than other Indian places in San Antonio. I enjoyed the pungent flavors and the bold use of indian spices here. The food is actually spicy here unlike some places in San Antonio. However some things still need to be fixed here. My fiancé and I order the the chicken mahkani (butter chicken) and chicken dum biriyani and the chicken in both dishes weren't the best. The chicken in the curry was a little rubbery and the the chicken in the biriyani had an unproportional amount of spice infused into it compared to the rice. The chicken in the biriyani could have also been cooked better as it was a bit dry. The bone was a bit of a pain, so I may try either one of the biriyani dishes without meat or one with boneless chicken. The biriyani rice itself is very good and is nothing like I've ever tasted. It's very flavorful and the yogurt sauce and chutney that comes with it is great compliment to put on top of the rice if you want to cool it down a bit. The naan here is also pretty solid. The prices are pretty standard for what I've paid for Indian food. The ambiance here is a negative. The place seems kind of dirty and the lights are dim. The service isn't that great either. Overall, I'll probably be back for take out to pick up some biriyani rice. The portion is pretty huge and I can make at least 3 meals out of it."], ["Marissa G.", "This place is pretty hidden but worth finding. Located in the medical center area, it's the best Indian Resturtant by far! The food here is just amazing! The service is a little slow but I really didn't mind.  Great place to take friends."], ["Shaz M.", "I was really excited to try this place after reading so many reviews on the biryani.  Although it turned out to be a bit disappointing experience.  The biryani was less on flavor and more on heat. Now I have no problem with heat, actually prefer it. But it was over bearing and oily. The samosas were decent. Also ordered the dosa that was burnt. Raita was too watery. The desert was good though."], ["Praveen S.", "Very bad experience. What ever we ordered were not at all tasty and good. They are cheating customers.Will not recommend to any one."], ["Nik D.", "Stay away if you want to avoid oily food. Otherwise an average food experience. Again, menu is clearly Hyderabad cuisine oriented. Not much for others"], ["Nilima S.", "Pros:The food was good to taste!Biryani is surely not the best but not the worst too.Chicken 65 was delicious.Cons:After our food was served no one came up to ask if we needed anything else, I'd to go more than 3 times to place more food order.Fountain drink had no soda in it.Bathroom is really filthy, felt like it isn't cleaned since more than a month, no soap, and sink filled with paper napkins!"], ["Camille H.", "This place is a hit or miss for me. When I first ate here I was blown away by the flavors. It reminded me of the month I spent in India. This place can easily have the best tasting Indian food in town. I give it three stars because of their consistency. There have been times when I ordered their briyani and it was flavorless or a masala dosa and they bring out the massive crepe with only a spoonful of filling (wtf is up with that?). I also don't understand why they serve samosa and certain foods after 4pm only. Even then there has been about 4-5 times I've tried to order an appetizer (like a samosa) and am told they don't have any. At one point I told the waiter that they should remove pungulu from the menu since they never seen to have it. They have improved a lot on their customer service since I first stated eating here. Before you had to get your own menus and order at the counter. Now they bring the menus when you sit down and come to you to take your order, but still you need to go to the counter to get your check and pay. I will say this, they have the most amazing coconut chutney ever!!!! I recommend if you're a beginner to Indian food to try the masala dosa. If you're feeling feisty go for the keema aloo mutter. Their ground goat is just so good!"], ["Akshay S.", "Typical Indian restaurant with overrated charges.Rather visit nearby McDonald."], ["Joseph S.", "I was here twice with friends and coworkers. This place is probably the closest authentic Indian restaurant that is non-buffet I have been to. Their Biryani are just delicious, both the Chicken and Kheema, they are full of flavor. The Kheema can be spicy, just pour some of the yogurt over it, trust me, it is delightful."], ["Vincy K.", "big wait time. ok food."], ["Shivani S.", "I ordered Gobi manchurian,Hakka noodles and rawa dosa.. And believe everything tasted like proper India food.. It takes about 15-20 minutes to get the order but its worth waiting. All the dishes ordered were awesome. Very nice service :) I am happy because they had many vegetarian items in the menu."], ["Anusha P.", "Prompt service.I would say this is the best vegetable biryani anyone can get in Milpitas.certainly deserves a good rating."], ["Udai R.", "Not a good hygienic palace. We ordered to go biryani and found a hair and staple pin. Very disappointing Indian restaurant."], ["Anusha S.", "Real awesome food. But be sure to stick to medium spicy. Medium is high here. We enjoyed prompt service with all warmth. Cleanliness and decor may be on the downside. The taste surpasses it all! I really wish I could give a 5 if not for the cleanliness."], ["Danny S.", "All of our food was delicious.  We had the goat biriyani, chicken 65, and dal tadka with the goat dosa.  The sauces were awesome.  This is our 4th time here, and will be back for the authentic Indian dishes."], ["Kris S.", "Bawarchi is a welcome addition to the variety of Indian food available in San Antonio. Being from Chennai, I love their food. I have never eaten a better Egg Dosa anywhere in Chennai. They even ask you if you want your dosas soft and crunchy, which I really appreciate (since I like my dosa soft). My parents visiting us from Chennai also were in love with this restaurant, though my mom didn't care too much for the curd rice she ate here. My dad loves their Mysore Masala Dosa and their egg dosa. Their vegetable biryani (I'm a vegetarian) was also great and plentiful. I love their sambhar that is an accompaniment to their dosas and idlis. I do join some of the other yelpers on their gripe that some items are not available most of the time and are not clearly indicated in their menu. But the food is great and we will no doubt be going back here many more times."], ["Munish M.", "i know this place since they opened and i referred this place to as many as people i know in this area,food was great since they opened i use to go to this place often and i had to move from there,got a chance to go back and had ordered some food for my family it was totally upside down quality and taste of food what they use to maintain for a 6 or 7 months time period,my kids were hungry so had no option to cancel the order,they failed to keep the quality what they had in the beginning,it use to be the best in san but now now,food is mostly colored sauce with no flavor and aroma,it has lost its reputation,yuk...................i don't recommend this restaurant anymore."], ["Samuel P.", "Dum biriyani is bomb. Food is authentic and good in general. Service is late, when you order 2 or more dishes they don't bring them all at once, there is a 5 min gap in between dishes."], ["Ubaid U.", "Went here on a Saturday night and saw that there was a lot of activity - always a good sign. Noticed too that most, if not all, of the clientele were South Asian. I generally figure that that's a testimony to a restaurant's authenticity. In any event, the ambience was definitely casual. No problems parking, so solid there. Walk in, go to the counter and order your food, pretty simple. There are two menu viewing options - they have the paper carryout menus just as you walk in, or you can view the big menu above the counter. Order, pay, take a number, have a seat. Seat options are limited to several tables and only a few booths. There are three large TVs parked in the corners of the restaurant that play some variation of Bollywood or other Indian cinema (probably would have preferred a cricket game, but regardless ...) Lighting is kind of random, darker in some spots and brighter in others. The décor is what you'd expect in a casual, cheap Indian/Pakistani place - couple of frames hanging above the booths, and orange and green wall paint (perhaps as a shout-out to the Indian flag, who knows). The one somewhat significant complaint is the bathroom - not terribly clean (at least the male restroom) and the soap dispenser ... whew. My advice - don't press too hard on the soap pump, or you'll get a gallon of pink liquid soap dropped into your hands. Menu options are quite extensive - they have appetizers, South Indian options, vegetarian and non-vegetarian entrees, Chinese options, and of course a diverse biryani menu. They also have a pretty good bread menu and some dessert options. Definitely something for everyone here. The service is good - our food came super fast. Honestly, it was the fastest I've ever gotten my food at any Indian or Pakistani restaurant. Otherwise, they leave you alone and don't check up on you. In fact, after ordering our food and taking our number to our table, we had to get up and grab our own water jugs and bring them to our table. They did bring cups and plates/silverware. Not complaining for the lack of service - the one visit for the plates and food reduces the need to leave any tip. Which brings us to price - everything was decently priced. The biryani we ordered was $9.99, the chana masala (chick peas) were $5.99, and they came with one naan. Price matched our expectations. The food itself was pretty good. The chana masala was not amazing, to be sure. It's a relatively simple dish, and I expect it to be executed almost flawlessly. The chick peas themselves were a little undercooked and over-seasoned with garam masala. They were still pretty good, and the naan that came with it was delicious - warm, fresh and soft. The biryani was quite good. It was a decent enough portion for two average people. The one complaint I have was the lack of chicken. We ordered the Hyderabadi dum chicken biryani, but there were like two pieces of chicken and one egg. I wanted more chicken, because the chicken itself was quite good. It was really tender and fell off the bone with the touch of your fork. The rice was cooked appropriately, and the restaurant appears to use good-quality basmati (long grain) rice. My concern is the spiciness factor - my wife and I eat really spicy food. Had we not read some of the reviews prior to coming to the restaurant, we probably would have ordered \"hot,\" which I believe would have been too much even for my wife to handle. Luckily, we ordered medium, and although it was quite spicy and tasty, it leaves one wondering what happens to the poor souls that wander in thinking they can handle the \"hot\" spicy level. I suppose that could be a point for authenticity. Overall, I'd say the food was quite good for the price, and I definitely see myself becoming a regular here, especially on weeknights. Unfortunately, their hours are kind of early on Mondays through Thursdays, so get there before 9:00 PM, or you'll be out of luck. I recommend trying this place because of its price and expansive menu options. It's probably the only place in town you'll get a decent variety of well-cooked biryani choices."]], "Tarka Indian Kitchen": [["Desiguy D.", "I recently moved from northeast to san antonio, tx. Being Indian I have been to many indian restaurants in north east with good indian traditional taste.Tarka gave me similar satisfaction.Indian food with good taste and quality. Friendly customer service. Worth spending the money."], ["Rachit P.", "Excellent ambience , good location. Food is ok. If you are a true indian then ask for hot food. Service was great. Naan was very soft and delicious. They did take 10% off yelp check in discount. The staff is phenomenal."], ["Kay B.", "I'm going to admit one thing first off - this was my first Indian restaurant I've tried, so I'm probably not the best judge on the \"authentic\" scale, but I can say that I totally enjoyed my meal.I honestly can't remember the last time I sent a text to my husband saying that I'd just found a new amazing restaurant, but that happened while I was at Tarka today.The food was great.  I asked for it \"mild,\" since this was my first attempt at Indian cuisine.  I think I could have easily moved up to at least \"medium\" in the heat range, but better to be safe than sorry.When I arrived at 12:40, there was only one table that was both open and clean.  (Sadly, this restaurant joins the ever-growing list of restaurants in San Antonio that we've found has a bit of an issue with the whole \"clearing up the dirty tables\" thing.)  If you can overlook the handful of tables that needed to be cleared, though, the restaurant itself seemed to be in good condition.A note to new diners - try the orange stuff that looks like Kool-aide near the drink dispensers.  I'd just gotten soda, thinking the orange beverage was orange juice or something, but when I looked around the dining room, I noticed a number of guests all with the orange drink.It's mango lemonade, and it's incredible.  Definitely have to have it for a drink.I really enjoyed it.  I had more than enough left over for another meal too.  Bonus!"], ["Sam O.", "How does one say YUM in Hindi?Tarka opened yesterday so we rushed in to try it for lunch today. It was busy, but service was quick, food was hot and fresh, not to mention delicious! There's no tableside ordering- order at the counter and the food is brought to your table.One tried the shredded lamb naanini (like a panini in naan bread) with masala fries, one order of chicken tikka masala \"medium\" with garlic naan. Both were deeelish! I do prefer spicy heat to my Indian food, but I tried a medium so I could get a feel for their middle-of-the-road heat. I would go with hot next time. The naan was warm and fresh with plenty of garlic, perfect for dipping in the tikka masala. Prices were very reasonable.San Antonio has more than a few Indian restaurants, most of which are mediocre. Tarka stands far above those, and I hope it's here to stay!"], ["Todd C.", "I've been here 4 times now, and I'm in love with the chicken tikka masala so much that's the only entree I've ordered. It's loaded in flavor. I seriously crave this dish.  Just know that mild/medium/hot is pretty much the same with the exception of added fresh sliced jalapeños. The garlic naan is great, and the samosas are average...good but a bit bland.  They also carry Dallas made oak cliff fountain sodas which are great.  Yes it's a bit Pei Wei in terms of ordering and service, but that's a huge plus to me. No tipping needed and food is fresh and hot."], ["Crystal G.", "I went for the first time today based on glowing recommendations from my coworkers. I was not disappointed! Ordered the chicken tikka spicy and it delivered! It was both temperature hot (I like my door hot and will often send it back to be reheated if not) and spicy hot. The garlic nan was also very tasty and perfect for dipping! I only ate half as it was plenty of food. I am curious to see how the leftovers will stand up. But I was definitely satisfied with my meal and looking forward to my next visit!"], ["Rock S.", "Place had beautiful ambiance. When we entered we thought this would be our place. But food wasn't taste as Indian food should be. No Indian masala. More like western fusion.Edit: I realized their service was good and friendly. Definitely they deserve more stars based on my experience with other restaurants recently."], ["Crystal M.", "Very clean restaurant. Excellent menu choices. Food is pretty good. Beer and wine served. Mango lemonade is amazing."], ["Solo D.", "Great addition to the North Central area.  Wonderfully tasty and fast Indian food.  Staff is very courteous; a reflection of the ownership and management."], ["May M.", "Yummy and quick service!! I'll be back on a regular basis. One of the best Tikka Masala in town."], ["Stephany P.", "I really didn't know what to expect so I was pleasantly surprised. I had Lamb Saag medium spicy. My husband had Lamb Vindaloo. We also had garlic naan bread with our lunch. It was delicious! Very affordable menu too!"], ["Linda G.", "I had the lamb naaninis, it was superb! The lamb was very tender and flavorful. My husband had the chicken vindaloo. That was also great. Vegetable samosas are excellent! My child had the chicken tenders, she is very picky and liked the seasoning on them. You can't go wrong here. I almost forgot, the mango lemonade is incredible!!!"], ["John P.", "The food is outstanding.  Prices are great. The format is more fast food than elegant sit down restaurant.  The value is fantastic"], ["Megan F.", "Overall very pleased with the atmosphere, food quality and quantity, and service! The setup is similar to Pei Wei. The menu is simple but offers a good array for both vegetarians and meat lovers. Mango lemonade is a must try! Didn't wait long for food to come out despite a medium crowd. Definitely give it a try and you won't be disappointed!"], ["R J.", "One of the best indian food so far. You guys ROCK"], ["David S.", "Very flavorful and tasty dishes. Moved from Austin and missed not having a Tarka to eat at and now one is near us in San Antonio. Very reasonable prices for Indian food."], ["Kell M.", "I absolutely love this place. I find myself craving it for lunch constantly. The chicken tikka masala is my favorite. Great food!"], ["Talia M.", "Tarka is like a Noodles & Co. or Pei Wei for Indian food. If you've been craving Indian and don't have a full-service restaurant then DEFINITELY visit! Is it the best Indian food I've ever had? No. But the prices are reasonable, the food is okay, and it's definitely someplace I'd eat again."], ["Mary S.", "I' a pretty big fan of  Indian food, but find the buffet troughs a little tired and short on freshness sometimes.    Tried this place on a whim on a trip to Trader Joe's.  Loved it. I wasn't sure at first given the almost fast food concept but the food that arrived was delicious.  The Chicken kabobs are cooked fresh so the chicken is juicy and not at all dried out.  the veggies are also fresh and feel crisp and flavorful.  The little cup of dipping sauce is my favorite - put it on and dip everything into it!  The white rice is moist but not soggy  - something many restaurants have a hard time achieving.  Haven't tried all the menu items but Hubs likes it, college age kids like it so it's looking good that we'll be back often.  Makes the trek down 1604 to get to TJ's worth it!"], ["Drew L.", "In a town that doesn't offer a ton of decent Indian food restaurants Tarka stands out. The flavors are bold in contrast to the many places that tame their spices for the general public. Though they claim to offer a Gluten Free menu, when we inquired about it the young lady helping us said that everything was gluten free... which clearly was not the case with the Naan we ordered. (How is it that so many working in the food industry don't understand what 'gluten-free' actually means?!?) That said our meal was excellent and we will definitely be back. Oh, and in the off-chance that you order the garlic Naan: be sure to bring a pack of gum for the ride home cuz they don't mess around when it comes to garlic!!"]], "India Oven": [["Doug O.", "This place is a real gem in San Antonio. Dinner on a Sunday night and it was pretty full, but service was outstanding and the food was top notch. The atmosphere is a nice sit-down place. I had the chicken vindaloo (extra spicy) and garlic naan. The spice level was spot on for an extra spicy vindaloo and the flavors were amazing. If I'm ever back in San Antonio, I'll definitly come here again."], ["Arianna M.", "Go for the buffet!!! $10 and you definitely get your money's worth! Lots of different dishes to choose from, and they have GARLIC NAAN. So good. The fried vegetable and the vegetable samosas are great.  The gulab jamun are soooo delicious I probably eat like 10 every time I go. The service is great and my water is always filled up which is NECESSARY cause the food is so spicy. Will always come back here!!"], ["Yvette S.", "All around excellent! Everything was wonderful and super attentive.Very cozy as well.A oldie but goodie & I have no idea why it's been this long since I been back.This place is a gem! If only we could twist their arm into coming to Alamo Heights or midtown somewhere.We need India Oven or a place like India Oven inbound down Broadway somewhere or by Olmos or By SAC."], ["Ashley K.", "OUR FAVORITE INDIAN RESTAURANT IN THE CITY!!!  We love Indian food.  We're always cooking it at home or trying out new places.  This is by far our favorite one we've found.  The food is always on point, and the service is really great.  I usually stick to the prawn masala, because it's amazing.  Never overcooked, spice always perfect.  My boyfriend loves the vindaloo and the masalas.  It's all really great, never disappointed by this one."], ["J B.", "Really, I keep going back. I love the samosas, the saag paneer, all the veggie dishes are delicious. Tandoori. The tomato coconut soup is to die for. I also love the naan. Especially the Aloo Paratha (stuffed with potatoes). I make great Indian food myself...have spent a good amount of time in India. Even studied cooking there when I was younger. This place is great. I love the owners/servers too. Headed there right now to get a bunch of things to add to the menu at home tonight....preparing my own homemade HOT curry :-)"], ["Rachelle S.", "This place is amazing. I came here for dinner expecting some great Indian food and I wasn't disappointed. The garlic nan is perfect.  Not too garlicky with a hint of cilantro. I had the Dal Meat and the lamb was tender and flavorful. The restaurant itself is clean and well kept. All in all a good meal."], ["Brad B.", "This is my favorite Indian food place anywhere.  Truth be told I don't know that much about Indian food, I always get the buffet however I have been to several places round SA.  I also know lots of people who also like this place - so give it a try.Having established all that, I like this place because even though it is a buffet everything seems really fresh. My favorite is the sag paneer spinach with farmers cheese.  Also they have great coconut curry tomato soup - it isn't spicy at all fyi.  Some of the other stuff has a tiny bit of spice but nothing compared to the Thai curry I am used to.  Also I like the tandoori chicken because I am a lil boring but know what I like. This is a great place, great value.  Biggest issue I have here is eating to much."], ["Emily B.", "Great lunch buffet! Everything was hot and they had so many great options (saag paneer, veg korma, chicken & beef curry, veg samosa). Saag paneer was definitely my favorite. The service was excellent. My husband's water glass was never empty (he drinks a lot too), which shows how attentive they are to all of their diners. To top all of this off, the price was great, under $30 for the two of us with tax & tip. This will be a regular Saturday lunch spot for us."], ["Ditas F.", "Came here for dinner for the first time and everything  was excellent! We order lamb korma,chicken biryani and garlic nan and it was delicious..we had pulab jumun for dessert,definitely a repeat"], ["Michael B.", "Honestly, based off food alone, this place deserves 5 stars, however the service was so bad I had to deduct a little. Compared with other Indian places I've been, the pieces are very reasonable and the quantities are quite large.  We started with the hors d'oeuvre sampler which consists of a samosa, pakora, chicken tikka and a kebab, all of which were quite good. We then had the royal sampler which was a smorgasbord of mixed grilled meats plus rogan Josh, onion naan and rice. My girlfriend had a different Lamb dish wish was also excellent and the garlic naan was divine. Surprisingly delicious Indian food in the heart of the river city. With a little work on the service department, a solid five stars."], ["Hannah W.", "Hmm.... I feel like I'm missing something here. After seeing lots of good reviews I decided to check this place out. Perhaps my mistake was coming in for the lunch buffet... The naans were fine but a little chewy. The best dish off the buffet was the saag paneer. The Veggie pakora was far greasier than I enjoy. And the chicken curry and tandoori chicken were both so dry and tough. There were not a ton of options overall and the food temp was off. I didn't go back for seconds. The dinner menu has many more options and perhaps that's what I should try."], ["Abraham C.", "In love with the morning buffet and late night menu! amazing place to go out if you are a vegetarian and or don't eat red meat. great for groups and parties! food is always fresh and well put together over all this place is amazing for Indian food in San Antonio!"], ["Carlos L.", "Excellent tasting food. Great service. Been there many times. Last time I had my baby and did not want to disrupt customers, I ordered to go and went to my car. They took the food to me with a smile. Love their food, my wife's fav indian place."], ["Shaz M.", "This is a nice cozy place snuck in vorner. The food is good. Prices are reasonable and portions are good too. Service can get a bit slow every now and then. Recommend the lunch buffet to get an idea of taste. Since this is a punjabi restaurant,  the spices can be a bit on the high side for someone not used to them."], ["Rudy M.", "Absolutely one of my faves. Chicken tandoori is incredible. House made naan is just amazing. If you love exotic out of the box foods then you will love it here!"], ["Sarah J.", "Indian buffets are always a perfect option for a quick lunch. This one is located pretty close to the airport. There's a pretty good selection of food with plenty of vegetarian options as well. I've had better samosas, and the eggplant dish wasn't that great either, but everything else was delicious. I especially liked that they would come around to the tables offering fresh naan. Our waiter was very attentive, he refilled our glasses many times and quickly took away empty plates.The decor of the restaurant is a little perplexing. They have a variety of different plaques on the walls for different awards they have won, but if you read them, they aren't the greatest awards. Two of them are for being the 3rd best in an 'Asian Food' category. hmm.."], ["America T.", "Horrible service every time. It's almost as it is a hassle to attend to customers. Always from the same waiter. He seems so unhappy in his life and in his job. The food has also become very bland, no where near spicy. It used to be a good place to dine but they're customer service has gone down hill and so has the food. I suggest Indian Taj Palace on huebner and stone oak they are down right friendly and family owned. They always greet you with a smile."], ["Meera S.", "Great paneer makhani and bhindi masala!Great portion sizes!"], ["Brooke S.", "Been eating here for over 10 years and it is always consistently delicious! The dinner for two is a great deal and can easily feed 4 people. By far the best Indian food in San Antonio. Although the atmosphere and service are not anywhere as good as the food, it really doesn't matter. Try not to judge a book by its cover and you'll definitely end up loving this place!"], ["Diana A.", "I have absolutely nothing negative to say about India Oven.  Everything I had, from the papads to the kheer was delicious.  The service was awesome, the ambiance was nice, what more can you ask for?  But anyway, here are the details.I ordered the Lamb Korma, Naan, Mango Chutney and Kheer.  The food comes with rice and a few peas.Every bite was delicious and had me enjoying my meal more and more.  There was good flavor and although I ordered my stuff mild, there was a nice heat that wasn't overwhelming.  I was glad for this as often mild = bland and that was not the case.  I had one piece of papad left and when I mentioned to the waiter that I was going to take it with me, he asked if I wanted more.  I said no, it was ok, but he went and wrapped up a few more for me to take home anyway.  He was pretty sneaky about it too, just going and getting it, setting it down and going away before I had a chance to protest.I felt well taken care of, never having to ask for a single thing as the waiters checked on us frequently enough and our water glasses were always full.  If I lived in San Antonio, this would most definitely be a regular eating spot for me."]], "India Taj Palace": [["Nicholas Y.", "Wow... wow! I am impressed. Everything on the buffet was great. And, I... ate... everything!  All items were prepared expertly. The atmosphere is nice. The staff is attentive and pleasant. Even the restroom is clean and well cared for."], ["Kanan P.", "We had ordered naan, karahi paneer and veg. biryani. They got another curry. After getting the actual curry, it was very watery. Veg biryani was like some curry mixed with rice. It didn't had any flavor of biryani. The cauliflower was spoiled and the manager refused to refund the money initially. Only Naan was good. Inshort, horrible food. Never visit."], ["Daryll B.", "So, I'm looking to try some Indian cuisine for the first time, and I noticed most places on Yelp's map shows most of these restaurants concentrated in the Wurzbach/Fredericksburg Rd corridor. Why is that? Is there a high concentration of Indian folk in this area? I notice some of the best pho restaurants are in the Northwest area also.Coming from Live Oak, I just won't drive 40 miles to try something new, and that's why I was happy to see this place in Stone Oak, a quick jaunt for me on the 1604. As I entered this large dining room, smells of curry came wafting at me, especially since it was not too cold in there. It was 12:30, and there were only 3 other couples in there, a bit odd in this huge restaurant. In comparison, any large Chinese buffet at 12:30 would have at least 50 people eating.    The buffet was pretty expansive with many curries (chicken, goat, vegetable), dal soup, chick pea curry, tandoori chicken, a paper thin cracker bread for dipping those curries, and mixed vegetables. I understand what others had said about the lukewarm curries, and I feel it is hard to keep the consistency of curry pipping hot in a steam tray. The dal soup was very hot because its consistency is thinnerI found most of this food to be bland and was not spicy at all, none of it. The dal soup was outstanding, as was the chicken and goat curries and the chicken tikka Marsala. The basmati rice and yellow rice were fresh and perfectly prepared. It made a perfect nest for those curries.  I feel they dumb down the buffet for us gringos because they think we are afraid of spice. I don't know how representative this place is for Indian food. I hear of places like Briani Pot, where you may have no gringos in there. There were 4 couples in here in Stone Oak, all gringosAs far as the 5 stars, I do not know Indian food-- all I know is this food is tasty, every curry has tons of meat, if you get here right at opening the samosas and egg rolls are excellent, and I like the cold salad bar with the kimchi or Indian kimchi, love the naan, the milk balls, and the free drink with Yelp check in. Yes the dishes could use more spice and only one of the curry sauces is very flavorful. I can't remember which one and I like the chicken tikka Marsala, and the people are super nice, so far me it's a 5.Eats:- tandoori chicken: smoky, flavorful, but dry- goat curry: excellent (goat tastes like the dark meat on turkey)- chicken curry, dal soup (outstanding), naan bread: excellent- mint chutney and tamarind dipping sauce: put this mint on anything- sweetened fried milk balls for desert- samosas were soggy, not crispy. Get there right at opening.Crumbs:- free canned soft drink with Yelp checkin- one dollar off coupon on their webpage- most of the curries were bland and not spicy but tasty- there are a couple of small salads, but this needs to be expanded"], ["Van T.", "Love the buffet options during dinner. Never regret the opportunity to enjoy the fresh choices."], ["Karen L.", "I ordered some food to go by using my delivery ring app. ... This place is outstanding . The food was amazing and they wrapped everything individually in cellophane wrap to avoid spilling. All my extra condiments were there... Amazing delivery food was fresh! I loved it"], ["Kevin I.", "Been coming here for years..buffet is awesome..price good..service great..best in town by far.."], ["Yvette S.", "Always friendly and humble service,they have a huge place so it would be ideal for a nice event or party.Buffet is on point.Booth and free standing table sitting.Always a nice experience when I make it out this way.I only wish I lived a little closer.Consider moving to Alamo Heights guys we have like 0 Indian food places & we desperately need you guys."], ["Brooke S.", "Very disappointed with this place. I gave it two stars because the naan and kheer were both really good, but that's about it. The buffet food all tasted cold and was poor quality. When they brought fresh hot food out, instead of replacing the old food they just mixed the new food in with the old. I was grossed out to see them mixing a fresh hot vegetable curry in with an old dried out cold curry of the same variety. Didn't seem very sanitary."], ["R W.", "The aloo gobi, chicken tikka masala, veggie samosas, and mint chutney are all delicious!"], ["Carolyn J.", "Great service, awesome food and I would have given 5 stars if the food was actually hot and not lukewarm.  I think I showed up as they were changing foods.  Nonetheless, it was absolutely delicious and the owner's will treat you like you own the place."], ["Georgina M.", "This is a solid Indian buffet restaurant. There are lots of options, both vegetarian and non. Everything is pretty good, though not as flavorful as one might expect. That's not to say that it was bland, just not as heavily spiced as I am accustomed. The warm naan they brought to the table was my absolute favorite part of the meal. It was buttered and rubbed with garlic. It was a great touch and elevates something simple into something transcendent. I came at an non-meal time and though there were only 3 or 4 other tables occupied, the buffet was being consistently replenished with fresh food. Service is attentive. My iced tea glass never got below half full. My total for buffet and a drink was a little over $15. This is a little higher than the norm, but I think it was probably because I was eating closer to dinner than to lunch."], ["Meg H.", "What can I say...... On point every time we stop in. By far the friendliest staff around. They treat you like an old friend. I'm typically not a fan of a Buffett but this is my exception. I've never eaten there when the food didn't look and taste fresh. Nothing worse than old food sitting on a hot plate. If you're on the fence give it a shot. Always a great experience!!!!"], ["Tommy T.", "The buffet dishes are hit or miss. I would highly recommend the goat curry with the basmati rice because the taste is out of this world. Just make sure the rice is not hard from cooking. Most of the other dishes lacked that dynamic spicy umami taste that many associate with Indian food. So this restaurant is more of an introduction to Indian food for Americans/Texans that are not accustomed to the spicy food.Bottom line, would i recommend it? Yes"], ["Angel A.", "Bring your stretchy pants, you'll need them! They offer a buffet that has all the main dishes you want. My fiancé has been vegetarian for awhile now, so eating here was a great choice for the both of us."], ["Hannah B.", "My family has been going to India Taj Palace since before the stone oak location existed and was at 281 and Brook Hollow... So I guess I'm a little biased. Anytime I get an opportunity to take a friend out for lunch, I will take them here. The buffet is expansive, and I have to say the biggest in San Antonio to my knowledge. It is also constantly being refreshed with new dishes hot from the kitchen! India Taj Palace is consistently delicious, and the service is always quick and attentive."], ["Shaz M.", "Another run of the mill Indian buffet. The only thing that brings me here is the location.  Try the samosas and chicken curry. Ask for fresh chicken Tikka as it is stale some times. The food is very heavy so don't over do it or there will be sufferings later."], ["R L.", "Best Indian restaurant in San Antonio!  Great food, everything is warm and fresh, a delicious chai, naan, different Indian foods and desserts choices. Highly recommend!!!"], ["Wren B.", "We came around 3:30-4pm on a Saturday & were one of three tables. The buffet was out & hot with a considerable assortment of traditional dishes. The only thing that kept this from a fourth star was everything was mild in the spice intensity. Growing up in San Antonio I like a dish here & there with a good kick and sadly nothing left my nose running. (You know, when you're sucking air into your mouth saying \"wooo wooo ahhh\", like that.) The flavor was very good either way. Also the service was exceptional, although that could have been due to the small crowd. Definitely would go back, maybe to order off the full menu instead. Price was about $25 for two buffets & waters. Oh! They do bring garlic naan to the table in a basket, try not to fill up just on that, I did. :)"], ["Grace H.", "I am honestly surprised with the amount of good reviews for this place and I am truly sorry to give such a negative review but.... My last experience eating here was absolutely atrocious. First off, the buffet food was all cold and tasted like it had been sitting out all day. Secondly, every time they did bring out fresh food they would just mix it in with the old food that had been sitting out. Who does that?? The garlic naan (which is pretty hard to mess up) tasted like plastic to me... Really disappointing. Will not be returning here again. Ever. I would highly recommend India Oven instead if you are looking for some delicious, fresh, high quality Indian food!"], ["America T.", "This is the best place ever! Family friendly, very sweet staff, always a smile on their face. The food is scrumptious. Theres no better place in town. I highly recommend it."], ["Camille D.", "You know a place is good if your kids complain about trying Indian food, and end up loving it!  India Taj Palace offers an extensive buffet.  I tried nearly everything and liked it all.  My favorite was the curry dumplings.I knocked it down to four stars for atmosphere.  It is very obviously a strip-mall setting, with a cavernous feel.  I would go here for the good food, but not if I felt like going out for a special evening.  If I lived a little closer, I would likely order delivery all the time!"], ["Shannon G.", "I wanted to give them 5 stars as the food was wonderful. Best Indian food I've had in San Antonio.  However, the service was so bad. They have a buffet which we summarily dismissed and got the full menus.  I had the lunch buffet at their old location and remember it having good variety with quality.I started with the tomato coconut soup.  Eh... Not bad. I think the tomato base came from a jar or can.  I probably wouldn't order that again.The entrees are definitely the reason you want to go here. The saag paneer was wonderful. One of if not the best I've ever had.  It had several layered flavors of spice and herbs that provided a complex taste profile in addition to the creamy spinach you expect.  We also ordered up the aloo gobi which was also nicely done with a savory sauce and the cauliflower wasn't cooked to the point of being too soft as is often the case. The shrimp curry was another win.  Finally, the chicken curry was also wonderful with the chicken being cooked just right to provide good texture and a moist, juicy bite.We also had some garlic Nan that was good but not noteworthy.Now the service.  Our waitress was one of the proprietors and she doesn't have the disposition for the job. It looked like she was scowling most of the time when she bothered to show up at our table. Considering we were the only table it should've been more often.  She actually gave us the vibe she was unhappy to be there and providing us with service.  I had to flag her down for the check. She was at the front counter with another employee for more than 5 minutes doing something that apparently wasn't our check. I finally had to walk up there.  Since she never came by the table we didn't get to ask for a to-go container so we had to wait another 5 minutes while they took care of that."], ["Dianira A.", "I love this place. It's got a great selection of food. I usually place the rice in the middle of the plate and a little of at least 6 dishes all around. For the second round, I just get 2-3 of what was my favorite that day. So tasty! I enjoy the buffet because I don't have to wait for my food. The staff is always so nice and for about $10, you can eat a great meal."], ["Hope B.", "This restaurant was good, but not as good as the reviews pumped it up to be. The chicken tikka masala was really good, and by far my favorite. The other selections I tried were alright, but I have to say overall I prefer India Palace. My biggest disappointment were the little milk ball desserts- they tasted like they were infused with ginger- which is not in and of itself a bad thing, but not what I have had in the past and not what I was expected. But overall, a decent Indian buffet with friendly service."], ["Caleb D.", "This is a great place for lunch. I've been here dozens of times and it has always been great. The buffet has always been 100% fresh. Delicious - Clean - Fast - Friendly - Great Vegetarian Options"], ["Alicia P.", "My fiance and I love this place. Don't know if it is the only Indian place around Stone Oak, but it is probably the best.We are never disappointed with the food, the quality (great!) has always been the same when we order our take out (we have never been in to buffet and dine, so can't speak of the service). We always order Chicken Tikka Masala, Naan, and Mango Lassi. The only difference I have noticed is the spiciness of the Masala varies just a touch. I have never been to Indian or been invited to an Indian family dinner, so I cannot compare with native food - but I like it.Good food and price is not outrageous. And if you have leftovers, keep them because the food reheats well in the microwave."], ["Rock S.", "Great Indian Buffet place. Place was clean and ambiance was also good. There was a good space between the tables and service was good enough. Overall it is a nice place for dining.Food was delicious. Specially there are lot of varieties in salad and main course. I am vegetarian so tasted only vegetarian dishes. So can't say about meat dishes.Food wasn't that hot ( Might be we came at wrong time between Lunch and Dinner Time 4 :30 PM).  We were the first one thr  for Dinner buffet but in next 30 mins whole restaurants was almost full. I didn't like their Deserts specially Gulab Jamun wasn't that sweat and also had weird taste of cardamon ( I would say overkill). But overall I liked and would love to visit again."], ["James M.", "Love this place! Great selection on the buffet and they cater to vegitarians! I would definitely recommend this place!"], ["Joyce C.", "I really don't know how this place got such good reviews. I've been here twice and gotten the buffet both times...no flavor, no spice, watered down curries. I can only imagine that the people rating it high have never had indian food before and don't know what it is supposed to taste like. Plus they charge $2 for a can of soda! not impressed, and definitely gave it it's last chance."], ["Virginia I.", "Great way to get your Indian food fix! They have a great selection in their clean buffet! The food is always fresh and the service is awesome! This is my go-to for Indian cravings!!"], ["Patrick E.", "This hits my criteria for going out and spending money at a restaurant: I can't make this at home and it's delicious! I usually try a little of everything from the buffet and it's always fabulous!"], ["jeff k.", "Indian food in TX in general has been the worst I have ever had.I found this place and just fantastic.I will definitly be hitting this place every visit to town!LOCALS, please go, it would be a shame to loose."], ["Angelique T.", "This was a pleasant surprise. Thanks to the positive reviews on Yelp, we tried the buffet. The food was fresh and had amazing flavor! My husband and I were pleased since we prefer spicy over bland. The service was great and so was the price.We will return and would recommend to anyone looking for good Indian food."], ["Viola E.", "Nice, quiet atmosphere with great food. I always go with the buffet option so I can try a bit of everything. They offer a large selection of both vegetarian and meat options which is perfect for my vegetarian days. The only negative thing I can say about this place is that the staff are not very personable. They provide you with what you need and get back to what they're doing."], ["Annie P.", "Loved the mango lassi.  The buffet was pretty good.  My daughter loved trying everything.  Didn't love the customer service but they left us alone so no problems there.  Since my kids ate and I liked the tikka masala, we will probably return especially for the mango lassi."], ["Nuri G.", "I wanted to love you, India Taj Palace.The first time I ordered from you, I had the Bindi Masala (Fried Okra).  It was so salty that I couldn't eat it.  I tried again, twice.  The buffet was always bland and incredibly unremarkable.  Although the restaurant is tastefully adorned, and the service has always been great, the food is just... so... meh.I'm not sure what I was thinking drive to Stone Oak for ethinc food."], ["Michael C.", "Note: we only ate here once. This was the best restaurant we ate at in the San Antonio area, which was surprising to us, since Indian buffets in strip malls are often simply good. Our experience in San Antonio this week suggests that folks in San Antonio are a little more generous with their stars. After a full weekend of disappointingly mediocre food in downtown San Antonio, it was nice to go somewhere that was surprisingly good. I am pleased to report that this was a great Indian buffet that had everything I expected and more. The food was high quality too."], ["Joseph S.", "I came here for lunch with my coworker, for some reason, I really dig the mango flavored onions, it is like an side dish, pretty much it is a raw onion with raw jalapeno pepper in mango sauce. It was the greatest thing ever! (though highly recommend gum afterwards). The other food are great, goat curry is still my favorite. Naan is just ok IMO, but no complains here."], ["Sonja B.", "Had the joy of returning to my favorite Indian restaurant recently - still a win! Table service was fantastic. Hubby had buffet - food was good and hot. I ordered off the menu - food was superb. I still haven't found a place that can make mushroom masala like these guys! MMMmmmmm!!! Asked for peas to be added to our rice for the kiddo - no problem! All in all - Highly recommend."], ["Christina M.", "The reviews were convincing, however it just didn't live up to the expectations. We showed up at 8 pm on a Saturday and apparently there was a private party in the front. We were escorted toward the buffet, and the host was very friendly. I had expected to be offered a menu, but they just told us to help ourselves to the buffet. My husband asked if they had Vindaloo, and they offered to bring out a serving of Lamb Vindaloo to the table - included in the price of the buffet. Many of the dishes I don't know the name so forgive me for not reviewing them properly. Anything with chicken was very dry - the tandoori and also the masala. Naan on the buffet was dried out but they brought us a fresh basket to the table that was much better. Lentils were good, rice was good. Saag paneer wasn't great. The salad part of the buffet didn't have much to offer and the desserts weren't appetizing at all. One dish with cashews, veggies and coconut was very good - and I'd go at lunch just for that. (Looking on their menu to see what it was.....) Found it! Navratan Korma. I did like this dish the best on the buffet. The rest of my group was not impressed and disappointed. I found parts of it good, but not worth the price. On their website you can find $2 off dinner buffet or $1 off lunch. Even with those coupons, 2 buffets and a drink were about $25."]], "Bombay Hall": [], "Kohinoor": [["Kamran S.", "Best Pakistani food in San Antonio - period.Yes - food takes a while to come, but it's the best Pakistani food in town."], ["David A.", "Awesome place, awesome food, and good service. Been here twice already. Drove 1.5 hours just to eat here! Owner is a nice and friendly guy. It's already in my \"Top 3 Desi Restaurants\" list. I definitely recommend all to try this place out."], ["Katie B.", "I've tried a lot of Indian food...in austin, Houston, etc and this is is still by far the best indian food you will ever find. It makes all other places taste mediocre. My favorite is the tawa chicken and butter chicken. And the Naan is spot on! I love this place so much, definitely worth a try. The only downside is the wait for your food, but it's a good thing too because you know everything is made fresh."], ["St C.", "Good place to eat.  Need to go back to try other lunch specials and try:Pakistani faves.Nihari - beef gravy and added on the house paratha (flat bread).Spicy chicken tawa - heavy on the ginger, chili and garlic.Chicken biryani and kebab rolls"], ["Sam A.", "Kohinoor has disappointed me once again. I gave this restaurant another chance and ordered Nihari and butter chicken. Both were very bland and I had to force myself to finish them. The Nihari was actually cold when they served it! It's just one disappointing experience after another and their high prices don't help either! I will definitely not be returning anymore."], ["G M.", "The food is AWESOME. Some people complain because of the wait time, but the food is definitely worth the wait. If you want fast food go to McDonald's. Love the new location. The family who owns the business work hard to make your order when ordered. This is no fast food restaurant. I never had eaten Pakistani food prior to this and now go at least once every other week. Definitely worth trying. I recommend the TAWA Chicken."], ["Curt C.", "Congratulations to Kohinoor for their newest location in the Medical Center area. This is the perfect location for a Kohinoor, much better than their other location that was in an unremarkable strip shopping center off Starcrest and 410. This one is much larger, much nicer, and a really nice looking building! The service was still lacking, just like the other one. We sat, and sat and sat, waiting for service. Nobody came. So I went up to the counter, where there's a sign that says \"order here.\" The girl behind the register acted confused as to why I was there, but she took my order. I think I was supposed to get a waiter, but never did. The ordering for the register seems to be for to-go items. But when you wait, and wait, you have to take matters into your own hands sometimes. Based on the Yelp reviews, I had the chicken and the beef kabobs. They were a bit on the greasy side, but overall most delicious. It would have been nice if they had served the entrees with rice, as it was all protein. The naan was light and fluffy and quite delicious. The menu is extensive, and moderately to high priced. They have quite a variety of Pakistani food, all of which is spicy and delicious. They just need to take care of their lack of service. It took quite some time to flag down a waiter to get us more water, and to finally get the tab. The wait staff was completely ignoring us the entire time. The decor here was completely lacking. They need something Pakistani hanging from the walls, or some posters or something. Just bare walls. It needs some ambiance, and some nice Pakistani music would have been nice too. Just silence."], ["Mark F.", "Well I have some contradictions about Kohinoor. I think it could best be described as \"No service, with a smile\"! A friend and I went there for lunch and there were very few people. The place inside was very clean, sunny and brightly lit.  We sat down and the attendant at the register came to us handed us one menu and said when we decided what we wanted we could order up front. My friend and I each ordered the chicken boti rolls. I noticed on the menu that it said that all meats used were halal. I had asked one of the employees what that meant and he was very friendly and told me all about it. We waited a while for our meals to arrive and nobody delivered us water. There were three women sitting near by and they did not get any water either. One of the women got fed up and walked over to entrance of the kitchen  and started tapping on a table near by to get there attention. Nobody came out. She then went into the kitchen to get their attention! After that they came out and gave all tables karafs of water and glasses. They then brought out our rolls.  I was about ready to write off the restaurant for it's quirky service, but the rolls were really good! I was really impressed your could taste alll the different spices in the wrap. I thought the meals  were a bit pricey, no lunch specials. With our wraps they brought out a small bowl of lettuce with a few veggies for my friend and I to share. The wraps were filling we could have ordered one plate and split it, but decided not too. We paid up front a different woman was at the register and she was very friendly as well."], ["Javid K.", "Best Pakistani food in town hands down!  Their tawa kabab is full of flavor.  Biryani chicken falls off the bone.  Go here and become addicted!"], ["Sreejith R.", "Good food, but no service. It was family run at the old place, it took 45 mins for order arrive at table. They have more staff at this new place, still unorganized and slower.Not recommended for lunch or large groups."], ["Peter E.", "Phenomenal quality food. Terrific friendly family service. Be ready for a very casual and extremely delicious meal.The best part is the wait, which is usually long, but it's always worth it and completely enhances the experience.Nothing but love for Kohinoor. Come. Bring friends. The Tawa kabob is off the chain (as is the Tawa kabob roll).The paratha is amazing. The Tawa fish is great."], ["Farhan S.", "Great Pakistani food especially tawa chicken and tawa fish. Bihari kabob with massive paratha was beyond amazing. Owner can customize dishes for any flavor so come prepared and with empty stomach."], ["Jacque L.", "Loved the food here! The ambience was pretty authentic feeling as well (at least what I think it should feel like lol). Service was great, you order at the counter and they give you a number then you sit at a table. The girl at the counter was helpful with suggestions and the daily specials were interesting. I would definitely eat here again. Next time I'm going to try the mango lassi."], ["Vonia P.", "Lahi specials are good to try. Spicy, but what else can you expect from Indian and/or Pakistani? Always look @ the board for their specials; typically your best options. Lamb, butter chicken. Naan was fresh. Have had better Pakistani food though."], ["F K.", "When you first walk in you seat yourself and when your ready to order just go up to the counter.  They'll bring your food out to the table. We ordered the Bihari Kabab, Tawa Chicken, Butter Chicken, Paalak Paneer, and a Paratha.  Their Paratha's are HUGE btw.  All of the dishes were very good.  Service was so-so but the food made up for it."], ["Sidra M.", "The tawa fish is excellent and the parathas are delicious and pair perfect with everything. The service is a little slow and take out orders usually take about 30 minutes."], ["Eliseo M.", "Koohinor nailed it! Excellent food. Had the Tawa chicken and it was very spicy. Loved it. Also ordered the paratha. It's a fried version of naan. You order at the counter, then take a seat. It takes awhile to get your food, so be patient."], ["Kimberly M.", "I've only gone once, but the butter chicken was wonderful!The naan portions are huge and delicious."], ["Christian G.", "Great family run restaurant with original flavor. Not your typical generic Indian restaurant."], ["Sadia K.", "Its a great option for Pakistani food. I must say though, having had it before, I felt the food now is not as good. But it still is a great place to try spicy pakistani food. Its well maintained and they serve a variety of things besides just the traditional things like tava chicken and kababs. They also have a fish option; very rare in indian/pakistani restaurants but i actually recommend it! Its just very good, spicy and sour; great sauce to dip your naan in."]], "Ali Baba Restaurant": [["Michelle R.", "Absolutely amazing. Authentic and delicious! I don't order take out when I travel but I just couldn't go out and this place is unreal. Don't believe the negative reviews, they must have had a bad day."], ["Chris A.", "This place is geared more toward the local Pakistani population, I'm guessing. The items on the menu tend to be more authentic than what many of us have come to know and love at other Indian buffet restaurants.All the dishes have at least some heat so be forewarned. many of the items still have bones in them so again, be forewarned. The taste for the most part was pretty decent unless you really don't like spice. A couple of items in particular that stood out are the paratha bread and tandoori chicken. Both come on the buffet and both were amazing. The lunch buffet is $9.99 while the weekend brunch will set you back $12.99 (no drink). One caveat: Do not show up close to opening time because they buffet is NOT ready. On our visit, the staff was still putting out items when we had finished, nearly 40 minutes after opening."], ["Erin V.", "Oredered delivery at 7:30pm. Had to call at 9:55pm to find out the driver was just then leaving. We had a whole family waiting on this and we will never order here again. We only live a few minutes away. We paid a lot of money for this bad service.The food, when it finally got here, was not what we ordered and seemed like it had been sitting around for a long time."], ["Ari S.", ":::this is a delivery only review:::We ordered delivery and the location was 6 miles away. We ordered a goat and chicken dish and it took almost two hours to get delivered (Their estimate was 45-60 mins). The food itself was uninspiring. It was more bone than meat and each entree was a total of one cup of food at best. They didn't even bother to fill their Tupperware bowls. It was no kidding all bone, sauce to fill the gaps, and a couple pieces of meat and the rest was oil. The best kicker was that two entrees (remember the serving size), two pieces of naan paid separately because rice is not included, an order of samosas so greasy the bin it came in had a quarter inch of oil at the bottom, and their spring rolls of which we couldn't even figure out what it was (reminded us of a crepe gone wrong and folded into a burrito to hold in whatever the insides were), all cost 42 bucks and change. The meal might have been worth twenty at best, so suffice to say we feel we got ripped off. Flavor was fine, but that was between fishing the small bones out of my mouth and trying to navigate my fork into what I thought was meat but was disappointed when my fork thudded into a hard chunk of bone. And I mean a knuckle sized piece...I can't say what it's like to eat in, but if you are thinking of the delivery option, don't, at least not until these issues get addressed..however based on other reviews, it does seem the bone to meat ratio complaint is a common denominator regardless of eating in or taking out. Bottom line: Do not get delivery. Price is not worth it and who knows what the food is like because we didn't get enough to taste it."], ["James S.", "Ali Baba stands out from the crowd of Medical Center Indian/Pakistani establishments by not trying too hard to impress. Simply put, Ali Baba's minimalistic, both in food variety and waitstaff service. Naturally this renders the restaurant several aspects shy of a 4-star rating by my standards; however, food quality -- considering the seemingly standard $9.99 lunch buffet price [note that there is NO DINNER BUFFET here!] -- isn't too shabby. Ultimately, India Palace on Fredericksburg Rd offers slightly better dishes (i.e. preparation & presentation)... and Bombay Hall on Wurzbach Rd, still my go-to hands down, offers the best AND the most at THE best price, whether lunch or dinner.Random highlights -- (1) Ali Baba's TANDOORI CHICKEN is notably flavorful among an otherwise pizzazz-less and somewhat unrefined buffet spread; (2) management's happy and personable, checking often on your plate count to gauge your overall satisfaction; (3) Arabic TV is at your disposal... extra points in my book; and (4) the restaurant's Indian music is loud yet relaxing, and once the lights dim at 2 PM, it's easy to fall asleep on an imaginary pillow of buttery naan.Rating specifics (i.e. 1-5, low-high)...- Overall recommendation = 3.25- Food taste and quality = 3 (lacks refinement...)- Portion size = 4.5- Price = 2.5 (Bombay Hall's a FAR better value!)- Atmosphere = 3.25- General service = 3- Waitstaff = 2.75- Location = 4.25"], ["Zohair C.", "Great place for casual lunch :) great chef :) run by a small great family will be here every time we come to San antonio by the way it's 3 hours away from us :) cheers to this family for bringing out fantastic pakistani cuisine :) I tried goat curry , suji halwa , chicken Tikka , and much more"], ["Mrs Nola F.", "Like that this place does delivery (there is a $10 fee attached) and very tasty faire I must say! Chicken tikka masala is savory and salad was yummy with variety of fresh ingredients. Chicken biriyani is generous with chicken. Pleased!"], ["Jack B.", "Drove to San Antonio from Dallas, 5hr drive, arrived at 10pm.  With no room service and only greasy pizza available for delivery, i got on yelp and saw this place delivered and i had 30 min to order.I took whatever they had left, chkn biryani and whatever veggies they had.  The food arrived at the hotel hot and well packed.The food BLEW MY MIND!  I was expecting shitty delivery food, but this was SOOO good.  Veggies turned out to be sautéed okra....i HATE okra, but i loved this dish.  Nice texture, complex exotic flavors.  HIGHLY RECOMMENDED!"], ["Curt C.", "We came here for dinner, so we were ordering off the menu. The buffet wasn't available. But they have an extensive list of chicken and goat. Whole goats are available, but you have to call ahead. They served up each about ten different ways. I got the chicken tikka, which wasn't quite what I was expecting. They don't serve rice up with their dishes, so you just get meat, and maybe a very tiny amount of veggies. The rice runs about $4 extra, which isn't cool. The food was tasty and delicious. We got to meet the cook. He apologized for how long it took to bring out the food, and even hooked us up with some samples of the other things that were not on the menu yet. The food was spicy, and very tasty! The service was good, and friendly. You could tell that this is an authentic restaurant. It seems to be a favorite place for takeout."], ["Jill A.", "I was hankering for some Indian food and had yet to venture out for any since we moved to SA years ago. This place had decent reviews and a deal going so we decided to do pickup and try the dishes listed by my fellow Yelpers as their favorites. Unfortunately, I was pretty disappointed. I'm just not sure if we had a bad batch of food that day or if everyone else just hasn't experienced really good Indian food before. This stuff was all spice and no flavor. Some of the meat was very rubbery (I'm looking at you, Chicken Curry) and the Beef Haleem was burnt tasting with very bitter notes; also it was not so appetizing to look at, and I know that's nitpicking, but it really did resemble something most foul, though. The Goat Biryani had entirely too many bones. I mean, I would remove the big bones, find some meat, bite it, and spit out three or four little bone shards. It was way too much work for not enough flavor. The side salad they served us was limp and wilted beyond anything I have experienced in the salad department. It looked like it had been sitting out all day in the hot sun. Overall, all of of the entrees were extremely over-salted (and I like me some salt!) and we ended up throwing away most of everything.The absolute biggest letdown, though, had to be the naan. I was craving some seriously yummy naan, and we ordered up for the garlic naan. It was dry and hard as a rock, burnt blackened to the point of being inedible. We were more than disappointed in this place, but burnt naan? Who sends food like this home with people on their first visit? This could have been a staple place for us to eat, but at this point I would literally rather eat staples."], ["Michael S.", "Ordered delivery ( remorsefully I ordered it an hour before closing and it arrived 10 minutes past closing so, for that I apologize) but for the money it was not worth it. The flavors were just okay but the meal was well packaged. It was small and lacked the extras needed, just a couple pieces of meat swimming in sauce. It was just not worth the money at all. Pretty disappointed. 2 1/2 stars."], ["Jennifer R.", "I ordered for pick up. It took a little while longer than you'd think. The food is very spicy, which I expected. It's not really for my taste though! I'm glad I tried it but won't likely return."], ["Asif F.", "TLDR: Medicore Pakistani food and bad service. Eat at your own risk.Ordered from Ali Baba for pickup...twice. On both occasions, the quality of the food was medicore. Specifically, the samosas were weird and not at all what I expect from Pakistani cuisine. Normally, the samosas are made with phyllo dough that is crispy...but these were really soft (for a meat samosa). Also, the chicken keema had a weird smell and I would not recommend getting this dish.The fact that rice is not included with an entree (almost $5) and that the service/attitude of the employees is not hospitable brings the review down to 1 star."], ["Aja V.", "The woman on the phone was very pleasant as she told me they were out of everything I was craving by 1pm on a weekday. She talked me into goat korma from their buffet. I got more sauce, and bones than meat, which it turns out I need for anemia. So other than ripping me off they screwed with my health that day. I told the lady with the gorgeous voice that I can't eat anything too spicy, then after consulting with her I ordered the veg samosa, too. I've had samosas homemade by Pakistanis before, so I wasn't concerned with this order. The samosas were unbearably hot in my mouth. I had to pick out the copious chili seeds. One was so full of seeds that it went to waste. Throwing away otherwise good, savory pastries that someone else told me was safe to order makes me very unhappy. I could've bought something else instead, and the business would've still gotten my money. The only upside to this experience was that the seasonings in the korma was great, and made my apartment smell delicious. (Someone should make a candle with that scent.) Will not be returning."], ["Lauren B.", "Warning: DO NOT order from here! My boyfriend and I decided to get a GrubHub order for delivery and it was so disappointing. First, they got my order wrong. I ordered one chicken korma and one chicken curry, ended up with two chicken curries. The curry was all spice and absolutely no flavor at all. The meat was dry and had way too many bones. I'd bet that 60-70% of my \"meat\" was actually bone! The dinner entrees also don't come with rice which is ridiculous! It'll end up costing you almost $15 for a dinner entree including rice. Way too expensive for the poor quality of food. There are way better Indian restaurants in town. I will never be ordering from the place again!"], ["Daniel K.", "Yum, yum, yum!!! Big city tastes in relatively small San Antonio. First central Texas restaurant with legit spices. Fun and adventurous for vegetarian couple. Owners also very warm and friendly."], ["Farooq A.", "Worst restaurant ever Worst service Bad customer service Told us 15 mins for food more den 1 hrOwner or workers had attitude I told them if dey can hurry up dey sed they can't !!"], ["Heidi K.", "Update: never ordering from here again, sadly. Very inconsistant. I am sorry that my previous review was misleading. Ordered the beef haleem today and spit it out. Disgusting. It was one of the best things I've tried a couple months ago and today it tasted inedible. The other items I ordered were not very good either. Are they lazy? Different cook?"], ["Amanda G.", "Came at 9 pm to eat dinner and use our groupon. The garlic naan was a little undercooked. The chicken curry and korma were subtle in flavor. The korma was better, i like that its bone in chicken because its more tender juicy. The mango lassi was delicious. Service was super slow but we got our food in a normal amount of time. Just have to catch a waiter when they come out. Our waitress was super nice though."], ["Joseph S.", "Came here for lunch with some coworkers. Clean place, plenty parking. Lunch buffet is 8.99 + tax. Good selection and food is pretty good. The naan is fresh out of the oven. The desert is awesome though. I don't know what they were called, but it is delicious."], ["Scott B.", "This review is for the lunch buffet.The dishes on the buffet included, but were not limited to, Goat Korma, Chicken Curry, Beef Nahari, Channa, Goat Biryani, Samosa, Naan, and various sauces.My favorite would have to have been the Beef.  It melted in your mouth like butter and the Nahari Sauce was full of spicy flavor.  The goat was another contender for first place. It too was tender, but not as tender as the beef. However, the sauce (Biryani) was the best.Everything else was delicious and the food had plenty of flavor and just the right amount of heat.Service was prompt and friendly.Atmosphere....well, there really wasn't much that gave the place that \"Indian/Pakistani flair, but the food is so good and reasonably priced, that the decor is easy to overlook."], ["Mark G.", "First visit... for take out. Friendly service. Everything was packaged up meticulously to avoid the take out bag / box leaks that often come with this type of food. So that was great.The flavors were very good -- goat Curry, chicken, beef kabobs.My only complaint... and mind you, these are my American tastes and standards... I wish the meat had been boneless. There were a lot of bones to work around... and harder to find in the goat curry. I felt like every bite had to be very careful.I'm sure this is probably super authentic. But keep in mind the bones for those of you with American-ized expectations. I would go back. The price was reasonable. It was nice that rice was \"ala carte\" so I could avoid that expense and just make brown rice at home, as is my preference."], ["Jason B.", "Flavorful, spicy, goat biryani. Not the most meat. Meanwhile Biryani Pot about 2 miles north has the best biryani in the state."], ["Leah S.", "We enjoyed our visit tonight. The food was delicious and a great value.The server kindly explained one of the dishes to us, and it was as yummy as he had mentioned. My husband had the Chicken Kahari, and I had the Chicken Biryani. It was a great amount of food for not too much money."], ["Dr J T.", "Poor service. Half our order never came out and the server never apologized. They really didn't seem to care. The look of the place was run down and the buffet looked like it belonged at a motel 6. The food was ok but there are a lot of better places out there. We had a groupon and even that price didn't help things. We won't be back."], ["Shaz M.", "I don't know if the reviews are inaccurate or maybe we came here on a bad night. Came here with my family of 6. Our order was taken incorrect.  Had to correct it twice. So we asked what's fresh and went ahead and took recommendations. If I can describe our experience in one word is burned! Garlic naan, bihari kebab and parathas, all burned and dry! How you can burn nihari is beyond us. The only good thing was reshaping kebab. Kerahi chicken labeled fresh was actually reheated and dried up. Won't be wasting time and money at this place again!"], ["Caroline V.", "Everything, yes everything, is AMAZING! I am so happy to finally have indian/Pakistani food that delivers. It takes a bit longer than other delivery food, but well worth the wait. Always arrives well packed and hot! These folks make my heart smile!"], ["Pedro G.", "If you need a little spice in your life, this is the place to go!  Great food at an affordable price, you can't beat it! The staff is really friendly too, extremely welcoming!"], ["Dana G.", "Very good spicy Indian food... I will be back. Some of the best I have had.  Enjoyed this authentic food with warm hospitality."], ["A G.", "This is the second time I walked into the restaurant and waited for someone to take my order and it taking several minutes. There were a couple of people in the restaurant - not alot by any means - and they were already eating. The servers were tending to the clients. And I had no problem with that. The owner of the place told me to take a menu and sit down. So I did and I was ready to order so I went back to the counter. The owner is tending to the other folks in the restaurant along with the server. He passed me SEVERAL times and didn't come back to the desk to take my order. He saw me standing there and did nothing. Several of the servers passed me by and no one took my order. The last time I came here on a weekday at 8:30 pm, the restaurant was literally EMPTY. I saw people working in the back and they even came outside and ignored me and went back to the kitchen. I literally stood there for more than 15 minutes calling and ringing the bell for someone to come and take my order. This restaurant and the owner are full of sh*t and are probably racist too."], ["Jitinraj N.", "First of all, this review is for the service and the ambiance. Me and my friend went here on a Monday night at 9.15 pm and the place was totally empty. There was no waiter in sight and we showed ourselves to a table. Let's go by the experience part by part.1. Drinks: When the waiter finally arrived, one of us ordered the diet coke and he was given a can. No glass, no ice and not even a question to ask if we needed one.2. Entrée: Looking at the ambiance and the general excitement of the waiter, we decided to skip the appetizer. We asked for the chicken biryani and were promptly informed that it was not available and he can have the goat biryani instead. The food arrived and it was so bland that I couldn't get through half of it. On being asked for extra raita(the yogurt-condiment blend), he pointed to the bit that was left in our bowl. I am not sure if he did not understand the question (I asked repeatedly and was very clear) or he denied us seconds. Anyways, the overall experience was totally contradictory to the previous reviews of the place. My friend s did point out that it was a Monday night and kinda close to their closing time but I refuse to accept that this absolves them. I guess a $15 bill per person does suggest that you get what you pay for, but as an Indian who has been to many Indian restaurants in the US, I would say that there are much better options!"], ["Faisal A.", "Could be good, but currently held back by a few factors. Ordered take out and got the goat biryani, Boneless chicken tikka, nihari, and naan. All of the food was EXTREMELY salty. Chicken tikka was almost inedible. Aside from the salt level though, the taste of the food was good. The other gripe I had was portion size. There were very few pieces of meat in both nihari and chicken tikka, considering the price. If they fix the salt problem and be a little more generous with their portions, this place could be 4 - 5 stars for sure."], ["Larry T.", "Good place and open until 10pmPrice is greatFood selection is small but everything is good."], ["Mo A.", "Good food we had paya and chicken reshmi kabab. Rwshmi kabab were perfect. Paya was nihari type gravi but was ok. What i really like is raita, awsome. Price are ok. 2 persons with mango lassi $32 + tax. Clean place."], ["Richard M.", "I had the lunch buffet.  Great food and friendly service.  My party arrived before it opened but the owner/chef came out and personally served us samosas to hold us over while we waited.  I work at the VA hospital across the street so I will definitely be back!"], ["Howard H.", "Very disappointing experience. When we arrived they were having a Pakistani Political Fundraiser. They should have closed the restaurant for that but they didn't. We tried to order off the menu however they were reluctant. They pushed the Buffett which was cold and unappetizing. We will not return."], ["Beverly B.", "One of the friendliest staffs around! I was pleased to learn that they have menu options of over 200 items and that the lunch buffet items change daily. The chicken dishes I had were tasty and the naan was right out of the oven. This is a great priced buffet with many options and my two visits here have been enjoyable!"], ["Camille H.", "Ate here when it first opened up. I was very excited because my dad had been talking about this place and I some how (being a major foodie) had overlooked it. I went with my husband during the lunch buffet. The decor, in my option was drab. The space is rather large and they have so many tables and such a tiny little buffet area. The staff was very friendly and a women said my husband (who is indian) could show me what to eat since I probably didn't know. I informed her I had spent a month in India and she looked shocked. I loved loved LOVED the Haleem. So much so that when my dad was in the hospital (Methodist Transplant) and I was spending the night I called to order the Haleem. The waiter told me there is no Haleem and that I could come and eat from the buffet. I asked him if there was Haleem on the buffet to which he replied, \"No but you can eat something else.\" I was rather shocked. I ended up getting food from India Palace instead."], ["Maruf K.", "Not the best pakistani food. I came here with high expectations after reading all the glowing reviews. But now that I re-read some of the reviews its mostly by people who like \"curry\"!... and not by the discerning critics of south asian food. If you don't know the difference between pakistani food, and indian food, and are looking for chiken tikka or biryani, you will probably like this place. But if you are looking for the best bihari kabab in town, or chicken karahi done right, look elsewhere. We had chicken karahi, nihari, goat biryani, and shami kabab.The goat biryani was the best, better than any other place I've had in San Antonio. The nihari and shami kabab were good too. The naans were a big disappointment. They were in-house (made in their kitchen and not from a mass producing bakery), but dry and crispy. Definitely not freshly made and moist out of the tandoor. Without good naan it was hard to enjoy any of the karahi or nihari. The chicken karahi had way too much whole spices (cloves, bay leaves...) in it. Almost as if someone accidentally dropped half a bottle into it. The beauty of south asian food is in the subtle combination of spices. Overdoing it doesn't help. This is a family run restaurant and the owners are dedicated to their business. I hope my review is helpful and I wish them the best."], ["Miriam M.", "Seriously delicious food and wonderful family style experience. Authentic cooking, amazing flavors!! We can't wait to go back!"]], "Taste of India": [["Marie F.", "Fairly good. I've never really had indian food that wasn't a buffet. They were helpful despite awful description of my favorites, but I got exactly what I wanted. Come try them out!"], ["Ashlee R.", "Still good though im disappointed they got rid of the lunch pricing for their combo special (the plate with the round containers of your choice of food, naan, and rice dessert!).They still offer it for dinner but the price went from amazing ($7) to reasonable (12)better than their sister competition thats always posting their deals on groupon. only time they get beat out is when Mela has their buffet. the same 12 for a singe plate now gets you an all you can eat buffet which only slightly beats out the option malabar offers for 3 dishes, bread and dessert."], ["Ahmed O.", "I ordered a lamb biryani dish, it tasted delicious, tender meat, a lot of flavors, feeds one person, but I couldn't finish it, only downside is the price ($11) other than that GREAT experience, and will go again."], ["Carlos L.", "Excellent food, very traditional servings on metal trays. Strong recommend."], ["Alethea A.", "VERY VERY TASTY!!!Let me first say that I am not an expert on Indian foods, but I know what I like... and I like Taste of India.I was here for lunch and got the lunch plate... basically two meats, a veggie dish, rice, naan and some tapioca dessert. I chose the Zucchini Masala, Chicken Tikki Masala and Curry Chicken. All were delicious, but I ABSOLUTELY fell in love with the Zucchini Masala. I am concerned that this will be one of those dishes that I think about all day when I can't get over here.The waitress was very friendly and attentive. She was the only one working the restaurant front and treated everyone nice and didn't seem harried or rushed.I will definitely be adding Taste of India to my lunch rotation!"], ["Jamie T.", "I order from here about twice a month.  Their paneer tikka masala is so flavorful I could eat it for ever!!! I also love the mixed veggie curry.  Their Samoas are delicious."], ["R J.", "With 4 star rating on yelp me and my family thought of dinning after a long day drive on saturday evening without a reservation.  I was pretty sure that we gonna have to wait because we were 7 in total but, to my surprise restaurant was all empty, not a single guest dinning in on saturday night. That explains a lot.The waitress was cold and unfriendly, didn't even a smile. We ordered a thali on which we could not choose vegetable we like rather it was whatever they had pre cooked that that day. Butter chicken had no taste at all because ti must have been made almost two days before, How do I know this? because I was a chef for four years on Indian restaurant. anyways, there was a whole lot of things we ordered but all the things was like microwaved which I am sure cause food was too quick.If you really wanna eat Indian this in not the place for sure. Cold service, cold food, horrible experiance"], ["Lisa C.", "The thali lunch special they offer at lunch is always tasty and fresh, as well as a tremendous value (currently $6.99). The ordering can be a little confusing as daily vegetable and meat selections are marked in blue on the menu and you get to choose up to 3 items (no more than two meats though) as well as a sweet or savory side (rice pudding or raita). All is nicely presented in little tins on a round metal tray alongside generous portions of rice and naan.Throughout the time I have been frequenting this spot (for a few years now after the ownership change from Taste of Malibar), the food has been consistently delicious and fresh. Service is efficient and quick at lunch, even when crowded. Lunch standouts for me are the chicken vindaloo (on the spicy side), chicken curry, saag paneer (love this version), dal (all the varieties) and the naan. The creamy chicken tikka masala is also a favorite of some of my friends. I do wish they used dark meat chicken instead of chicken breasts as occasionally the meat can be a little on the dry side. They also grind their own spices (as most Indian restaurants do) and make their own chai spice mixture. The chai can be made with or without sugar.The dinner menu (also available at lunch), has quite a bit more variety. There are also some pre-set dinner thalis that include a variety of items for those wanting to try several dishes. I have come here for dinner with small groups several times and everyone has always been pleased with the food and service.Vegetarians as well as carnivores will be pleased with the variety of offerings here.I do tend to like spicy food, and many of the dishes here do lean on the milder side. I don't usually request more heat level, but believe they can make some adjustments The food is northwestern Indian/Punjabi, so there are no dosas here. This is a small, locally owned restaurant that offers freshly made dishes from real ingredients (with little to no Sysco here). Even if you have not tried Indian food before, the owner can walk you through the selections and make recommendations. Give it a try. You will not regret it..."], ["A C.", "We went here several times to dine in since the food was good. Biryani was nice and appetizers were ok since it's more tended to the mild side. Anyway, our last visit was a disappointment. We only decided to order appetizers since we got full.  The waitress asked us if we wanted anything else and we said no we just wanted to order the appetizer. From that comment, she said in an unfriendly face, 'Appetizers are for to go food.  You can't order just appetizer. here you have to order main entree\". We were shocked by that comment and didn't see any signs around the restaurant that said 'No dine in appetizers\" Lastly, we paid for our appetizers and teas and left...we will not go here again...poor customer service!"], ["Bruce F.", "I go there often with the wife for dinner or with co-workers for lunch.  I like my veggies so I tend to purchase a veg dish or \"thali\" which is a assortment of various small dishes on a tray, including a dessert rice dish.  The wife also goes meatless and we will split a Kingfisher beer in the 25oz size(fifth).  Hell yes yummy.  I will admit I don't understand the menu items (I'm a white boy) and can't always remember which is what, but it is always tasty.  Flavors seem more intense during dinner hours over the cheap lunch hours and prices.Not impressive on atmosphere, but you can't  eat atmosphere. I don't eat at Chili's either."], ["Patrick O.", "Have eaten lunch (thali dishes) and dinners here. I enjoy the lunch with a little taste of everything, my friend does not. We both enjoy the dinners. You can adjust the spice level somewhat to taste when you order. I enjoy mild to medium, he enjoys off the charts hot.Pleasant atmosphere, will go back."], ["Keren H.", "The food is totally delicious, their nan is to die for, and their King Dinner is totally worth it. The food came out fast and the waitress is on top of the drink refills. The reason why I didn't give it the 5 starts is because the waitress/cashier had the TV super loud, which was right above our heads. Other than that, their food is really, really good."], ["Sriram R.", "Great place especially for doing their veg or non-veg Thali for lunch since its only 7/8$"], ["Karen T.", "Strange ordering system: your options are  on the menu in blue highlighter. Despite the other options, you have to choose from what is highlighted. Don't despair! It actually comes on a large tray with sizeable slices of naan, the three options you stated in your order, and some basmati rice. You will be full, I promise. The waitress was very soft-spoken, so listen carefully. Cheap meal, no stomach pain. Good enough."], ["David D.", "My girlfriend and I came here for lunch today. We had the lunch special which allows you to pick 2 meats and 1 vegetable for like $7. The food came out in 2-3 minutes and was hot. The bread was tasty and all 3 dishes were very tasteful."], ["Bill P.", "Fantastic lunch experience, a great way to try multiple dishes and hit naan bread.  Our kids love it so much they hummmm when they eat...no where wake does this happen with them."], ["Jessica S.", "Service was good. Most of the food was a bit on the bland side, compared to \"good\" Indian I've had. This applied across the board: the mango lassi (more yogurty than mango-y), vegetable pakora (dry and without many veggies), naan, and most dishes on both the vegetarian and non-vegetarian Thali plates. Standouts were probably the saag paneer, which had a pleasant fresh spinach taste, and the chicken tikka masala, which, while not abundant in spice was nonetheless quite good due to copious amounts of ghee.Portions were a bit small, although they made up for that by providing a lot of filling naan.We'd go back if we were hungry and close by, but it's not worth making a trip for."], ["David B.", "Great good. Understands vegan."], ["Aanand S.", "Some of the stuff they have is very good and others are merely okay. The portions are quite small and I'd expect a lot more for the price I'm paying. There are restaurants out there which out perform this place in that regard. Their name will be changing soon to Taste of India. Taste of Malbar is a name with a South Indian connotation, which this place is not so don't be asking for idli, sambar, dosa..etc. Mango lassi is heaven over here. Baingin bhartha is superb. I haven't tried enough to really comment on too many dishes but the food quality is decent. Service could be better but the Punjabi Auntie (co-owner) who was the waitress was extremely nice once you get her to open up. I'll have to go there again to get a feel for other dimensions of the restaurant."], ["Curt C.", "Taste of Malabar is tasty! This out-of-the-way Indian restaurant took me by surprise! They have a wide range of entrees, and allow you to choose a variety of them off the menu. I was a bit disappointed that they offer beef on the menu, which I believe detracts from the authenticity. The restaurant was clean, and decorated appropriately. I had two chicken dishes, and a potato and eggplant side. The food wasn't as spicy as I would have liked. The food was certainly decent, but not the best I'd ever had. I loved the fact that they let you choose a variety of dishes for a set price. It came with Jasmine rice and naan, and a dessert. I thought that this place was a great value for lunch, and will certainly be coming back!"]], "Spice Fine Indian Cuisine": [], "Rickshaw Stop": [], "India Palace": [["Olivia C.", "I LOVE India Palace.  Buffet Masala tea. Chicken masala. Lamb curry. Mango custard.  Wow. Try everything."], ["Ron M.", "My coworkers and I found ourselves having a late lunch at India Palace to bid farewell to a coworker who is heading up to Portland, Oregon.  As always I have my go-to foods at the buffet.  Like many I love the Saag Paneer!  There's something about that spinach with cheese that can't be duplicated by anything else.  The Chicken Tikka Masala is a classic and I think enjoyed by many.  It certainly seemed to be on the plates of everyone at the table.  The chicken is soft enough to bite through the chunks, but still firm enough to give a good mouth feel.  I don't remember what the cabbage is called, but it has become my next favorite vegetable after the Saag Paneer.  It has a nice firm texture that automatically think \"fresh\".  Top all this off with Nan and you've got yourself a perfect end of the work week lunch.  I don't go often because I would have even more weight on me than I already do.  But when I do get to India Palace I'm always glad I did!"], ["Karen G.", "Ok so first time here... Buffet style... The variety is great, and desert buffet. Chicken Curry is excellent, meat was tender.... Cauliflower curry was delicious as was the saag paneer... Mmmm garlic naan. The waitress was attentive and kept our water glasses full and plates cleared fast after we polished them off, however they did charge $3.50 for a can of soda? Wowsers! That was kinda outrageous. Lol. Overall, it was a pleasant experience and very tasty it is kind of pricy but for good Indian food well worth it. I am giving it 4 stars bc the soda was 3.50 a can cmon man, really?"], ["James S.", "Rating specifics (i.e. 1-5, low-high)...- Overall recommendation = 3.75- Food taste and quality = 4 (quite bland)- Portion size = 5- Price = 4 (Bombay Hall's a better value!!!)- Atmosphere = 3.5 (nice, just dark)- General service = 3 (SOMETIMES lacking)- Waitstaff = 3- Location = 4 (convenient, easy access)At India Palace, the food offerings are plenty! Tandoori Chicken (sweet roasted chicken), Malai Kofta (vegetarian meatballs in cream sauce), Chicken Tikka Masala (chicken chunks in spicy cream sauce), Chicken Karahi (chicken chunks in red chili tomato sauce), Baingan Bharta (scraped roasted eggplants cooked with tomatoes, onions, garlic, coriander & turmeric), Palak Paneer (puréed spinach with paneer cheese chunks in cream sauce), Samosas (spiced potato-stuffed pastries), Vegetable Biryani (spiced red rice with vegetables), Aloo Gobi (spiced cauliflower/potato blend), Naan, Cilantro Mint Chutney, Mango Custard, Rice Pudding... all up for grabs! Additionally, their drink selection is quite varied.My sole issue with India Palace's food AS A WHOLE is that each and every dish sits just slightly towards the bland side of the \"taste scale\" -- similar sentiments regarding overall spiciness and the like. Note my use of the word SLIGHTLY. This tiny observation will not ever deter me from giving India Palace my business; however, Bombay Hall right down the road may better fit the bill for SOME.The restaurant's atmosphere is appropriately chatty and lively, yet not obnoxiously loud like a Chinese mega buffet. Very nice décor... and super clean as well! Service is acceptable at best -- attentiveness just depends on your server. Overall, however, most of the staff are very helpful."], ["Sylvia W.", "One of my favorite places to eat. Mouth watering Indian food. The best Chai tea. Great ambience.  Great service. Staff assist you in a proactive manner. Food just needs to be a bit warmer at the buffet service area."], ["Neil J.", "A good solid choice. Went there for the dinner buffet, and it was not bad. Service was okay, polite but I felt if it was not always genuine. I ordered a specialty bread, and by the time it was served, my meal was almost over. The bread was freshly prepared tho and delicious. Food was authentic but not overly flavorful or even spicy. Mango Lassi was very nice addition to the meal."], ["Cindy R.", "I've been many times before for the buffet as it is convenient and the food is always hot and fresh. I ordered the vegetarian dinner and it was just as good."], ["Roll T.", "I will probably update this review at some point, but for now I can say this lunch buffet is Indian person approved!  I'm a huge fan of their samosas because the wrapper is light and holds oil very well.  Most samosas are too thick or not cooked long enough.  You won't have a problem with that here.  India Palace has a nice assortment of vegetarian buffet items, but the one that made me smile the most was the inclusion of egg curry.  Thank you India Palace!  Egg curry is one of my favorites, and I never understood why it's at least hard to find in most Indian restaurants throughout the mid-Atlantic, Deep South, and most of Texas.  The meat selections included at least one very creamy curry that goes well with naan bread.  Again, I've only been here once, but the initial results are certainly pleasing.  While I haven't lived in San Antonio long enough to anoint India Palace as the standard-bearer for Indian food in the city, I'd be hard pressed to believe there are more than a handful of restaurants that provide a better buffet experience."], ["Judy C.", "Hello India! This is about as authentic as you can get in San Antonio. I have many Indian friends, but most importantly, I know Indian mother's cooking and this is pretty darn close.I had their lunch buffet, and for $9.99, you really get your money's worth. Lots of vegetarian options and options for meat eaters. The food is well seasoned, but I had to deduct a star for their service. You practically serve yourself and have to beg for any type of attention. I also ordered off the menu, and although it took a while for them to make it, I was happy with the taste!"], ["M S.", "Their buffet is pretty good, especially for vegetarian options. They could update their decor though"], ["Jillian W.", "Am officially an Indian food lover. First time here for the lunch buffet. Deep, layered flavors, fantastic naan, variety of choices, great price! You can try a little bit of everything, which for someone unfamiliar with Indian cuisine, is needed. I loved the spinach, vegetable curry, and chicken tiki masala. There was also a lentil soup I could of gone to town on if I hadn't already stuffed my face with a truck full of naan, but when it's so good it's hard to use moderation, you know? I will strategize more wisely next time. I just won't eat for a few days before I go. Good plan."], ["Ashley K.", "India Palace is a decent place for Indian food.  They have a nice little buffet that a lot of people seem to like.  I wasn't very impressed with the masala at all, didn't have very much flavor, or at least wasn't up to par with what i'm used to."], ["Tim W.", "The food here was solid. The place is pretty big with a lot of seating, however, there's only one little buffet area. The entree table had dishes such as naan, tiki masal, tandoori chicken, veggie samosas, etc. The dessert table had kheer, mango pudding which I really enjoyed and some Indian pastry. Overall the lunch special is pretty darn good. You'll definitely leave here full."], ["Matthew L.", "I love Indian food, but i literally know nothing about it. Thats why I prefer buffets. I can just see what looks good. If there is one thing I think I've figured out for sure its that the vegetarian dishes are the way to go, they just taste better. I really liked the Samosas they were a little spicy and I must have had 4 of them! There was a lot of other great stuff I tried, that I can't pronounce or describe properly, but everything I had was AMAZING!! I thought about how good my lunch was all day, that evening dinner was a disappointment, because it wasn't anywhere near as good as my lunch.The service is great. They made sure our drinks were filled at all times and that dirty plates were cleaned away as soon as possible."], ["Friday A.", "Three stars coz my alliance is still with Mt. Everest when it comes to Indian Food. But here in San Antonio, this place be it!"], ["Mandy S.", "India Palace has an excellent lunch buffet ($10)! They have a great variety. There's a good mix of vegetarian and poultry curries. There's also a salad and dessert bar.  Be prepared to leave uncomfortably full... Or slump into an afternoon food coma! The food is so delicious it's hard to stop eating after one plate."], ["Gina J.", "I have only eaten from the buffet. There is a large variety, and the food is really good. The chai tea is good too. For dessert I like the rice pudding and mango custard layered on top of each other. I come here about once a month."], ["Punit S.", "Very good food!Stopped by for the dinner buffet ($12.95) great variety overall. Plenty of options for vegetarians. Ample parking outside.Accept cash/credit.Friendly people, clean restaurant, good for family and friends."], ["Hiten P.", "Their lunch and dinner buffets are reasonably priced, and have a great variety of the most popular dishes."], ["Friday A.", "Three stars coz my alliance is still with Mt. Everest when it comes to Indian Food. But here in San Antonio, this place be it!"]], "Biryani Pot": [["Matthew K.", "Probably the best indian food I've had in San Antonio. I believe they have a few in other cities. Their food can be a little spicy so if you're tired of getting mild indian food from a place with a buffet, this is the perfect spot. I've been here twice and pretty much have concluded that everything they make is probably really good lol. True to their name, the biryani is excellent. Also, the Gobi Manchurian (crispy battered and fried cauliflower covered in a spicy sauce), while atypical of anything I've seen in an Indian restaurant, was a winner in my book. The Hyderabadi Murg Masala had an excellent rich flavor. The staff is friendly and helpful. Family dining."], ["Aubrey B.", "Seriously? I can't believe all the bad reviews. Maybe they have some neighborhood haters. I thought this place was great!Chicken 65 for appetizer. Awesome but its a very filling appetizer so be careful not to eat all of it right away.  I ate a portion and went back to it after i got the main dishes. so flavorful!Ordered a lamb curry(Im sorry I forgot the name!) and the lamb Biryani. I guess we were in a lamb mood but both were absolutely delicious!Yes, the service is quite awkward but I am familiar with the culture and I am used to it."], ["Kamla P.", "Went to this restaurant with few friends last week. The place was busy. I was hungry but knew food must be good as so many people are eating and waiting for there turns. After 5 minutes we got table.  Order the following items :Chicken 65 : chicken was dry.  Qty was good. Pepper corn : could not even eat. Paneer manchurion : taste was there but too much of batter. Paneer was tasting like chicken. Expensive as being starter for $9.99.Main course :Chef special Malai Kofta : South Indian version of Malai kofta. Veg biryani : ok. The masala was good but rice grains had no flavor. Seems like masala and rice were cooked separately Chicken korma : ok.Garlic basil naan : too chewy and thick. Did not enjoy the food. Expensive. Qty was good but lacked the real taste. Service : slowDon't plan to go again !"], ["Meera S.", "Biryani Pot was a delightful surprise. The restaurant was full of Indian people- which is a good sign, when it comes to Indian food. I picked up the food to-go since there was virtually no room to sit. I order the Paneer Makhani curry and it was delicious. Unfortunately, they charge separately for rice (but I wouldn't mind paying in the future). I asked for the \"mild\" option and they did a good job of respecting that. Can't wait to go back! :)"], ["Nik D.", "Perhaps one of the better places for Indian food in San Antonio although again biased around Hyderabad cuisine. San Antonio needs a break from South Indian cuisines"], ["Chris H.", "8/20/2014 - One of our Indian colleagues recommended Biryani Pot to a group of us and we all dined here for lunch. Simply put, amazing! The best Indian food I Have had here in SA and easily ties if not exceeds other amazing Indian food I have had elsewhere in the U.S.The Chicken 65 was amazing! We ordered medium and it was spicy enough to cause some sweat but did not hurt the mouth at all. I will be back very soon with my family."], ["Surabhi S.", "Go there if u like only spicy food and don't bother about service.  Food is decent, but no matter how much they claim to make mild, its always more spicy than regular spice. This happened both times we went there. Customer service needs improving. Servers r busy talking to their friends rather than attend to diners. We had to ask twice for straws and to go boxes."], ["Charlotte A.", "Excellent. by far the best Indian food I've had in San Antonio. Right amount of spices and great presentation. My new favorite place."], ["Adarsh K.", "The Best Indian restaurant in SA.Authentic taste. Large portion and decently priced. Me and my wife have tried the House special chicken soup, Chicken Biryani and Chicken 65. All of them were awesome, spicy (little more than I wanted), very fresh (when compared to chicken in other Indian restaurants). Cant believe there were people waiting to be seated at 9:20 PM on a Wednesday!!!I would rate this placce better than Bawarchi Biryani Pointe (Bawarchi was my fav before trying this).I believe there is no buffet. Ala-carte only."], ["Annie L.", "My first experience with this place was decent. Although the guy who took my order was rude. I ordered the Chicken Dum Biryani to go. The portion size was great and the food was good. However, I was extremely disappointed when I ordered from them again recently. I ordered Malai Kafta and Chicken Korma over the phone. The guy taking my order was abrupt and not very helpful. I asked if the Malai Kafta came with rice. He said no and asked if I'd like to order some. I declined. I assumed that at least the chicken korma would come with rice. My total was $22, which is fine. A bit pricey but worth it if the food is good.I had someone pick up the order for me. To my surprise, he came back with two small 16 oz. plastic containers of \"entrees\". NOTHING ELSE. Just two small to-go tubs. For $22! I've never felt this ripped off from ordering food. Oh, the food wasn't great either. Needless to say, I am not going back."], ["Sam M.", "This place has awesome binary and curries. As close to authentic as you can get without going to Hyderabad, India."], ["Pramod N.", "One of THE best places for Indian food  awesome awesome awesome. You dont have to read the menu throughly every dish is a delicacy... Love it"], ["Fncy G.", "We heard great reviews from Yelpers about this place. We decided to drive 30 minutes from the opposite side of town to check out this restaurant for dinner. Using the reviews here as a reference, we ordered the masala peppered corn , goat biryani, chicken korma, shrimp vindaloo, garlic basil naan, chai tea and mango lassi (yes, we were hungry!). Our favorites are the goat biryani and chicken korma. The masala peppered corn was not bad but a bit too oily for us (this is an appetizer of deep fried sweet corn with spices, curry leaves and cilantro).  My husband loves naan and he is on a quest to find the best naan, LOL! He thinks the naan here is too dry, thin and crispy.  As for the spice level,  I'm Asian so the spice level is ok but I'll be ok if it was spicier. Everything is a la carte so no rice or roti/naan comes with the curry dishes. In my opinion, I think the dishes should be served with at least a regular serving of steamed plain basmati rice. Also, if you don't like cilantro then make sure you let them know early because there is cilantro in everything. Lastly, the price it average...over price in some and reasonable in others. I think the appetizer of fried corn didn't warrant a $7.99 price tag and I think the dishes should be served with rice."], ["Vijay S.", "Spent a weekend in San Antonio and had an opportunity to provide feedback for the Biryani Pot location recently started here. All I can say is no comments! Because its hard to improve on the authentic Hyderabadi dum biryani served here. Biryani Pot has maintained the same great taste and quality that i've experienced at other locations like Houston, Austin, NJ etc."], ["Kiran V.", "Bad experience. One of the waiters does lot of over action and he is deciding my menu. When he said it is chef special , it is worst. Kofta is like hard tennis ball in malai kofta and he said it is chef special. Very expensive. Bad serving.Dont want to visit again."], ["John-David C.", "Wow. I was impressed. Amazing food and great service. Best Indian food I've had (don't tell my Pakistani sis in law)"], ["R P.", "The food is good . But the attitude of the waiter is horrible . He literally yelled at me asking if they have chicken tikka masala.  I was too hungry else I would have walked away."], ["Elizabeth W.", "Fantastic food! I have really enjoyed this meal. Everything was fresh and hot. This will be a regular stop for food here in San Antonio. Muneesh is amazing (our host), when you come in he will take care of you. They have a great variety of breads and one of my favorite dishes made with goat! We are talking about coming back for dinner."], ["Natasha S.", "For dinner we ventured out (official Valentines Date) for our first experience of Indian food in San Antonio since moving here 3 years ago.  Um, Yes! Simply delicious and full of flavor.  I even ventured out and tried a new dish for me- the Hyderabadi Murg Masala. WOW. and the Garlic Naan... light crisp on the outside and moist tender dough inside- perfection! The two together are highly recommended. The price was reasonable for dinner and the staff were very friendly.  My husband ordered his usual Goat Biryani and was very happy with it-- except he lives for volcano level of spice and it fell short for him.  The Masala was just hot enough for me that it challenged my taste buds without taking away the flavor.  We have already started talking about take out for movie nights and going back again soon!"], ["Ravikiran K.", "Very authentic and Great taste!!! Excellent service."]], "India Chaat House": [["Lauren S.", "Yes, this place. If I were Gordon Ramsay I'd say damn! in the best way possible. I guess I'll start with the disclaimer that I really love hole in the wall places. If you're looking for ambience, I suggest you look elsewhere. But once my boyfriend and I figured out that South Indian cuisine is much more our bag than the ubiquitous masala-and-naan fare (at least in the Austin area), we ventured south to Chaat House. And oh man, we hit the jackpot. When you're still giddily talking about your dinner a half hour into your drive home, you know you found something worth Yelping about.He's vegetarian, I'm vegan. We went with the sev puri, the vada pav, the chole bhatura and the masala dosa. We were first brought out the sev puri; we ordered this having had pani puri elsewhere, and this is basically the loaded version. Get this. It is incredible. We were scooping up the leftover sev with our fingers.We were then served the vada pav, which is more my boyfriend's thing--a fairly small but heavy potato sandwich, basically. This ish was goooood though. The potato filling was green, interestingly enough--not sure what it was cooked with--and the fried outer layer was perfectly crispy and delicious. We were pretty full at this point when they brought out the chole bhatura and the dosa---hooooooooly shit. Two gigantic puffs of fried bread bigger than our heads and the most majestic dosa.... I can't even. The dosa was filled with perfectly golden brown, garlicky potato, peas, and spices and served with sambar, coconut chutney and tomato chutney. The chickpea curry that was served with the bhatura was rich and spicy. It was so much food, and all for a total of about $21.50. Damn.Yes, the parking situation is terrible; we got there close to closing time on a Monday night and had to park in a fairly sketchy looking spot down the road. I half expected to find my car side swiped or towed when we left..... but I was so happy about the food that I probably wouldn't have been THAT mad. Seriously. Go here."], ["Stephen C.", "Very nice divey little Indain restaurant with very good food. The parking is very limited as it seems the occupants of this strip center have all claimed their spaces for their customers and will not share. This establishment has 4 difficult to access spaces on the side of the building. The samosa chaat is absolutely fantastic.  I definitely reccomend this very very highly.  The butter chicken is also very good. It comes with an option of naaan or rice. They have a big display case filled with lots of Indian desserts. Very divey but the food is very good. I say worth a visit."], ["Nick G.", "Walking in, one can't help but wonder if the food will be too authentic and how it'll be handled. My friend and I were the only people not of Indian origin eating here... That must say something! First impression: \"this place is legit with its glass cooler serving traditional Indian snacks and pastries.... Looking at them is like trying to understand the Indian language---no clue.\"The barrooms and cleanliness are of concern but I was already told this place was a \"hole-in-the-wall\". The bathroom here is comparable to what one would find at a random grocery mart on the east side of San Antonio-smelly with questionable dis-colored smears on the wall. I'm excited for my food though :)Now for the food: Exceptional. I am not by any means a Indian food connoisseur however, this food was good. I had the chicken chettinad which was served with white rice: a perfect portion size for a hungry dude. The spices were on point (with a perfect level of spiciness)  and the consistency was satisfactory; it was not a bowl of soup and chicken. My friend had the vegetarian paneer tikka masala, which was flavorful as well but could have used something more. Both dishes came with a large side portion of white rice. It was NICELY authentic :) This places looses a star for the plastic utensils and bathroom presentation.I will return but would make it a point to bring a bottle of hand sanitizer and go to the restroom before coming. Cheers"], ["Krista L.", "Excellent food! The naan was fresh and sooo good! I loved the butter chicken while my wife loved the goat korma (I HATE bones in my food so I only took a bite of korma and let her have the rest). We could have had one order of butter chicken with an extra side of naan and we would have been perfectly satisfied. Stephen C is correct about the parking ... It SUCKS! But definitely coming back. I asked and they said I can order goat without bones next time. They all were very friendly and helpful. Great experience. Late lunch for 2 for under $20!"], ["Rock S.", "Very disappointed. Sitting their for 30 mins and we are the only one here who ordered and still our food is not served. Complete waste of time. I had same experience in last visit. They won't care about customer time.  Food here is very mediocre not worth to waste time."], ["Sajani P.", "This place is SO SLOW. It took almost 30 minutes for chaat -- not even cooked food. There is only one person taking orders and making the food and she moved as slow as a snail. The wait was not worth it - the food is nothing special and the sweets taste days old. Also it's dirty and awkwardly arranged. I am from Houston and there is no way this place would still be running in Houston. Wouldn't ever go back unless absolutely desperate."], ["SC T.", "Hands down best authentic Indian cuisine I have eaten at a restaurant (and  not made by my Indian parents). Excellent Quality, good amount of spice and flavor and not oily. Great for work parties too. I just  introduced my office to this place and they are all fans now  too."], ["James S.", "Despite the freshness of each menu item, portion sizes are generally scant for the relatively high prices they're asking for. (In short, look for other Indian restaurants in the same area... there are about 3 that I can think of, namely 'Bombay Hall' which also has an excellent lunch buffet...) A few other notes... (1) there are only four dedicated parking spaces for the establishment, of which only the very first one is easy to pull in and out of; (2) when I've visited, their air conditioning is always down, making dine-in experiences uncomfortable towards the end; (3) unlike competing restaurants, complimentary naan is not offered; and (4) the staff, although extremely friendly at first, are inattentive and constantly occupied by other tasks... do NOT expect table-side service here. (To clarify, the problem is not so much the waitstaff intentionally ignoring customers, but simply needing to take care of behind-the-counter tasks, etc.) Overall recommendation = 2.5; Food taste and quality = 3.5; Portion size = 2.5; Price = 2; Restaurant atmosphere = 2; General service = 2; Waitstaff amiability = 4; Location and/or first impression = 1.5."], ["Meera S.", "Great Indian food for a great price!I highly recommend their Bhindi masala and Paneer Tikka Masala.You get a choice of either naan or rice with each curry you order.The service is good. The only downside of this restaurant is the parking outside. The businesses nearby have claimed all the good parking spots. You have to park on the side of the india Chaat house building, at an awkward angle. Don't park in the wrong spot- they will have you towed. It's ridiculous.I always order food about 15 minutes before I reach and they always have it ready to go! Great prices. The last time I went- 4 curries, 2 naans, 2 rices, 1 samosa= under $32!Great price! 5 people ate all that food comfortably!"], ["Jessica S.", "They've fallen a long way since our first visit in 2012. The first time around, the menu had maybe 6-8 highly focused items, and each was perfectly made and full of flavor. In 2014, the menu is crowded and even features Indian-Mexican fusion dishes. The Chicken 65, formerly a standout at India Chaat House, is now stripped of flavor. It has a bit of heat, but not much else going on. Likewise with the previously excellent Samosa Chaat. It's much more one-note now, and completely forgettable. The butter chicken and palak paneer were both disappointing, also lacking in punch and flavor.Adding to the unfortunately bland food is the parking situation described by others. Nearly every space in the lot is reserved for the convenience store next door.All of this to say, we won't be going back, sadly."], ["Cathy S.", "This place is definantly a mom n' pop kind of store. They have a decent sized menu with the typical Indian food you would find at a restaurant. I ordered the chicken tikka masala with a side of white rice. I did have to wait quite a while, but I think it's because they make everything from scratch. I'm not an Indian food specialist, but I thought the food was good. They gave me a decent amount of chicken and rice which is always appreciated. The store had a bunch of Indian snacks for sale behind a glass case. I didn't know what any of it was, but it all looked really delicious."], ["Shaz M.", "This place has gone down in quality and service since it opened. The last 2 times I went, it took over 30 mins to get food. That is ridiculous when the place had one other order in front of me. No one checks up to see if you are ok or gives a time frame. Just excuses. Prices are not that great for what you get as well. Won't be stopping here again anytime soon."], ["Food Finder Q.", "This place es cheap , has great location, taste really good and they have plenty of plates to choose from, definitely comming back to taste something new!  And of course take some sweets too! And I almost forgot....Try the garlic naan, it's really awesome.   The only con... they don't remove dirty plates from tables and they are not very clean with the tables either."], ["Joy C.", "The Good: authentic and delicious food at a reasonable price. I ordered the Samosa Chaat which I can't explain all too well, but it's definitely enough for 1-2 meals depending on your hunger level and has a spicy kick to it. The owner is also a friendly guy who's willing to explain any of the menu items.The Bad: tiny parking lot with 5-6 spaces. The restaurant itself only has 4-5 tables, which isn't ideal for large groups. The cleanliness is also questionable.The Ugly:  Beware of the convenience store owner next door!! Due to the lack of parking, I was told by someone I assumed was a restaurant employee to temporarily park in the \"No Parking\" zone. A few minutes later, the neighboring store owner drove up and started yelling at me, saying all sorts of awful things like \"Are you blind?!\" and the like. To make things worse, the restaurant employee who had given me approval to park there didn't even try to come to my defense-he simply stared and stayed out of the situation. Needless to say, I won't be back unless there's an open parking spot."], ["Shamrez A.", "Great fried rice and sweets. Need to try their falooda! The place is a little old, but clean and organized. If you want something informal and quick, I recommend this place"], ["Bedabrata B.", "They have really good chat and sweets are also of fairly good quality given the fact that it is very hard to get desi sweets here. Service is a bit slow and ambience will make you feel as if you are eating at a place back in India. Overall I like going to this place  because of the indian zing they have in their food. They don't serve blend food."], ["Shaz B.", "It's rather easy to miss this place when you're driving through Fredericksburg Rd.; it's a quaint little restaurant located right across from the USAA headquarters, next to a small Indian grocery store and a convenience store. And if you really think you're gonna miss it, just keep an eye out for bright LED lights they've recently installed on the exterior.Anyway, it's a smaller restaurant, but the menu has a lot to offer, and they also sell freshly made Indian tea snacks and a wide variety of sweets. The menu has the normal Indian chaat (pani puri, sev puri, etc.), as well as dosas and uthapams, and non-vegetarian dishes ranging from chicken tikka masala to Chinese noodles to biryani. I've tried a lot of the dishes, and I must say, they're quite good!It's mainly authentic Indian food, and some dishes are even a little American fusion, such as the paneer tacos they sell, and the vada pav is made as more of a veggie burger patty than the normal Indian street way. I usually order the Mysore Dosa, which a spicy dosa with potatoes and onions on the inside, and that comes with a generous serving of sambar and chutneys. The uthapam is a thicker pancake-like dish with various vegetables, which also comes with sambar and chutneys, and I just say, it's one of the best uthapams I've ever had.The restaurant definitely seems a little more packed on the inside on the weekends, but even on the weekdays, there's plenty of traffic. I've always experienced quick and friendly service, and if I've ever had any questions, they've been promptly answered.Super reasonable prices, with the only downfall being its parking situation. Other than that, solid food and good people! If you're ever craving Indian food, this is definitely a great place to try out!P.S. Love how well they pack takeout!"], ["Kristina M.", "Finally! Pani Puri in San Antonio!  If you have never had these little crisp pillows that you fill with herb-flavored \"water', you are missing out on a quintessential Indian party food.The focus of this casual restaurant is chaat and other nasta.  The online menu is no longer current; a few items such as the Pav Bhaji are no longer available.  There is a good selection of Biryani (rice dishes) and a few curry dishes with Americanized descriptions like Chicken 65.  We came for dinner on a Friday night and there were two other tables occupied.  It seems like they are more of a lunch place.  Indian movie posters decorate the walls and while we were there, the television was tuned to an Indian channel showing Dil Se.  Parking is very difficult- there are just a few spaces shared between the restaurant and the convenience store next door, so take out is a good option.We started with Masala Dosa- a thin crisp crepe amply filled with a spiced potato mixture.  The accompanying sambar and coconut chutney were delicious; the sambar actually tasted a bit more like rasam- super spicy!  We also had a slightly soggy Bhel Puri, which seemed like it had been made earlier in the day.  The Uthappam was quite large and well prepared.In general, the items we ordered were prepared with too much raw red onion.  Next time, I would ask them to reduce the usual amount.  Also, I would be sure to order some mirchi (peppers) to add a little more heat.  It would be great if they would expand their menu to include some healthier vegetable snacks to go with all of the fried items.If you do not have much experience with chaat, be sure to do a little research before coming.  The person handling the orders at the counter could not understand our questions; she smiled and handed us the menu to figure them out.    Definitely worth trying this one out as a food adventure."], ["Sriram R.", "Spicy but good, only place in SA that has chat for a decent price. Place looks bad and parking is a pain but the food is good. Would go again but will do take out. Order everything mild since food seems very hot."], ["Krithikaa K.", "This little restaurant is a must visit for all chaat crazy people who visit SA. The food is yummy and the service is very good. We entered the restaurant 15 Minutes before closing time , yet the waiters were patient with us.I will definitely visit this place the next time i am in San Antonio"], ["Curt C.", "Best Indian Chaat this side of the Ganges! This place has fantastic food! I got the curry chicken, which was promised to be spicy. It was hooot! Loved it! The lunch specials here are quite the deal! It was $6 for a entree, a side, and dessert! Loved it! The side I got was a spicy lentil soup, which was fantastic! For dessert, a yogurt dish to calm the screaming taste buds. The interior of the place is sparsely decorated, but authentic nonetheless. They showed news coming in from Delhi on the TV. Posters of famous cricket players, and Bollywood stars. Swanky! The service was quite friendly. The cashier said that they were filling in for the owner, who was out, and still managed to answer all my numerous questions about the types of food, what spices when into it, etc. The parking here leaves some to be desired. I had to park on the street, as it seems that there are more places where parking is forbidden than places where you can park. I will certainly return. It was fast, delicious, and spicy, just how I like it!"], ["Stefany V.", "I guess I'm the only one here who didn't pay attention to the obvious, but so far no one has mentioned how freaking hot the food here is! I drive past this place a couple of times a week, and decided to pick up some takeout for dinner while watching the game, instead of pizza. Lot has very few spaces and there really isn't anywhere else to park nearby as the streets are busy and narrow. Interior is fairly plain, but there's a tv broadcasting Indian music videos for entertainment, which I liked. There were only a couple of guys there when I went, and from what I've seen they don't seem to get much business anyway. Ordered at the counter with a polite guy then sat to wait for its arrival. Was quoted about 10min, but seemed to come faster than that, and bag included forks and napkins, which I seem obvious but I've had many places forget that stuff before. Downside to this place was how I noticed that even the one customer dining in for his meal was served all of his food in separate styrofoam containers, which is both wasteful and harmful to the environment. In any case, I ordered the samosas chaat, based on reviews I'd read here, and the chicken tikka masala, which I've happily had elsewhere without having issues with the spice level. The appetizer was a little perplexing, topped as it was in heaps of chickpeas (which I enjoy) and a combination of tomatoes, red onion, and cilantro (which was reminiscent of pico de gallo, and totally threw me off), as well as a light sprinkling of what looked like cheese? It wasn't bad, per se, but the crunch of the samosa got soggy quickly and there seemed to be tiny bits of super hot spice (maybe pieces of jalapeño, in keeping with the pico comparison?) but I could not seem to find what was causing the problem. The chicken tikka, oddly, was served to me cold, which I have never seen before. Cold, cold, like out of a refrigerator because we made it the other day and don't get any orders for it, cold, not like it had sat out... Which may be preferable, but not all who order take out have access to a microwave. Anyway, I ordered the dish with rice and appreciated that it was packed separately so that I could mix the proportions I like and it didn't get soggy. Unfortunately, just a bite or two in, I could tell this dish was simply not going to work for me. It was so far beyond a comfortable spice level, or anything comparable to what I've experienced with this dish elsewhere, that it was difficult to eat and intended up drinking half a glass of milk to dull the throbbing pain in my mouth. Needless to say, the leftovers are in the refrigerator for any of my boyfriend's roommates brave or hungry enough to try it.I am genuinely perplexed by how spicy my food was, even given expectations set by the name of the business, and the lack of commentary about it in other reviews. Maybe someone new was cooking, or the guy who packed up the takeout order added a few shakes of something to my box, but this was borderline in edible despite having good underlying favors.I may try this place again another time, but given the other Indian places in a 2 mile radius, this place need to advertise, come up with a parking solution, and tone down the spice if they want to stick around, IMO."], ["Selena Z.", "This place is not what it used to be. It's under new ownership and the food is NOT the same. It was bland and just all around an unpleasant experience. The only good part was that it was cheap. This place does not compare to Simi's! Go there for amazing indian food and outstanding customer service."], ["Harish R.", "Had Paneer Dosa.It was $6.Was billed even before they started preparing.Worst etiquette for a new restaurant.The Dosa was oily and I wonder instead of drilling oil in the gulf they could hv drilled from my Dosa."], ["Susan F.", "Lack of parking spaces. The front door was propped open with a chair. It was warm inside with a fan on and the place  had an odd smell. No one said hello or acknowledged my presence. It was my first visit. I went ahead and placed my order since I have heard how great the food is. The tables are small and the place has NO atmosphere. The food was good and the portions were generous. Very authentic as in the other reviews. I just don't think the place is up on health codes. I would give the food 4 or 5 stars but the whole experince was a big let down. I will not go back or suggest this place. Not the place to go if you want to sit and have a nice enjoyable meal. They only have bottles of water so you can't even get a glass of water with refills for your meal and the food is spicy."], ["Rebecca G.", "We had a suspicion that this was going to be authentic and it was.  The goat curry was excellent.  The chef told us it would be spicy as well as savory, and he was right.  He also recommended the samosa.  This has to be the best samosa I have had in San Antonio.  Given the flavorful and authentic food and the immense portions, I believe the price point is excellent for this food."], ["Kamla P.", "Please don't sell Masala Dosa. Please taste your Sambhar !!!! I don't have words to explain the taste. Unbelievable !! Please please taste your food before even thinking about opening the restaurant."], ["Salil O.", "GREAT PLACE!!! You HAVE to buy the samosa chat! Lunch box meal is spicy, but this is an Indian restaurant. It's a new place- only 3 months old so you should not judge a book by its cover. It is a marvel. Masala dosa was not that of a usual restaurant but it is more of a traditional homestyle recipe, as is all of the food here. Filter coffee is great as well."], ["Amarro N.", "This is a little hidden gem of San Antonio.  I eat here at least twice a week and as a starving graduate student the prices are beyond reasonable, it is dirt cheap.  An example I order the vegetarian lunch box which is 5.24  I get an ample amount of rice or roti, dal, vegetable curry, yogurt and a cookie.  Trust me you will be filled.  The Samosa Chaat is to die for and it is $3.00.   The most I ever spent was 12 dollars on myself including tip and I immediately had the case of the \"itis\".  The prices are insane and the owner is extremely nice and will explain everything on the menu to you.  At some Indian restaurants they will have an explanation guide, but at India Chaat House they don't because most of the clientele are Indian and already know the menu, but don't let that deter you, the owner will be able to explain any and all things on the menu.  It is counter service so you make your order and they will bring it out to you.  I enjoy it because they use fresh ingredients and always make tweaks every once in a while depending on who is cooking that day.  Every time you go it can be a new experience, but it is always good!  I love how when I go they have a flyer looking for a South Indian cook, so this is not a place where some random cooks in the back are just following a recipe, it is people that have been cooking this style of food for decades.  Be patient, sometimes the food takes a while to come out depending on what you order, but it is usually prompt from my experience.  I highly recommend it, be aware it is no thrills, the decor is extremely simple and it is not a place to impress a high maintenance date, so unless you are dating Kim Kardashian you should be fine.  If you are a college student, broke, or always wanted to try Indian food without breaking the bank ,India Chaat House is a wonderful place to experience quality South Indian food."], ["Seema B.", "this place is not fancy to say the least, but the food is authentic and delicious. Definitely best Indian food I've had in San Antonio. Dosas are fresh and light and the food is spicy and flavored just right. Food is homestyle and delivered in a styrofoam plate. will definitely come again!"], ["Robert M.", "We tried this place out months ago, just got around to writing something.Great Indian food, quick service, and nice and hot!For Stefany, cilantro is just coriander leaves so it is not surprising to find in Indian cuisine."], ["Quimbero G.", "SOLD! This place rocks! A little slow, and if you're not Indian an you go, you will be the only one.  But... people are friendly anyway. Check it out, it really is GOOOD."]], "Simi's Indian Cuisine": [["Jessica P.", "The best Indian restaurant in SA! My family is addicted to this place.  It is authentic, fresh, and everyone is friendly.  My husband loves meat and I'm vegetarian, and we both have many delicious choices.Lunch buffet is so amazing!!!"], ["Chris O.", "Simi's Indian Cuisine offers an excellent Indian lunch buffet, complete with over a dozen vegetarian entrees. I visited on a weekday for lunch, and didn't have to wait long for a table for one, even though the restaurant was at capacity.I actually tried almost every vegetarian entree, but won't take the time to review each one. My favorites were definitely the black and yellow lentils and the boiled egg curry. The lentils had this excellent savory flavor, and the boiled egg curry was possibly the best way I've had eggs in the last month. The chana masala was lacking in many ways - too plain, a bit watery, etc. - but I ate a healthy portion anyway. The saag paneer didn't actually have any chunks of paneer in it, but was very creamy. I would actively avoid the broccoli and green bean entrees - they didn't taste good. In the middle of the spectrum - from broccoli to lentils - were the veggie dumplings and the veggie samosas.One of my biggest gripes was that even at 12:45 PM, the middle of the lunch hour, the food was a bit cold, as if there wasn't enough water in the buffet station or something.There was a really diverse crowd there for lunch - all different races, kinds of clothes, etc. There was even a group of 8 white women sitting next to me speaking a European language (I don't know my European languages, so I'm just making an assumption based on skin color, which I do feel bad about).The service was uncoordinated, but nice. For example, because there was no designated host, I was asked by three different employees if I was by myself. Odd, awkward, but not a negative because everyone seemed so eager to seat me as soon as possible. I'd return if I were in the area looking for a solid Indian lunch spot."], ["Mark M.", "Came here for the lunch buffet. The restaurant was clean and fairly spacious. Staff was also very friendly and I was seated right away. They really pay attention to you and fill your water often. Tried just about everything, and for a buffet it was better than expected. The only downside is I felt some plates were less flavorful compared to other restaurants I've been to. However I usually don't mind lighter flavors either. I'm a huge fan of spicy foods, and while all the selections were very mild there was also pretty good vindaloo sauce to add on as needed. Naan was also offered as a buffet item, but once again it didn't have the garlic flavor I usually see on naan. The samosas and dessert were on point though!Overall solid meal, Id definitely come back. 3.5/5"], ["Miriam S.", "Simi's is an old favorite.  My husband and I visited last week for the first time in a couple of years probably.  The saag paneer was way better than I remembered - probably the yummiest I have had in town.  The garlic naan and vegetable pakora were also excellent. The chicken tikka masala on the other hand was just ok - it was honestly way too sugary and so I didn't enjoy it as much, although usually this is our favorite dish (in general, not here specifically).  We came for dinner on a Sunday night and as usual we were disappointed by the fact that you have to pay for rice."], ["Enrique R.", "Really great quality lunch buffet. Very vegan friendly...lots of really well prepared vegetable options. Everything is very fresh."], ["Krista N.", "One of many options for Indian food in the medical center area, Simi's did not disappoint. No wait, good service, and the food came out pretty quickly. Two of us shared the empire dinner, which was a great way to try all of the most popular dishes and includes vegetable samosa appetizers, rice, and naan. It is a LOT of food (more like dinner for 3 or 4) so we enjoyed leftovers the next day too. Everything was delicious, but the winner for me was definitely the lamb curry!"], ["Michelle M.", "This is my favorite Indian food restaurant in San Antonio. I love the variety of the buffet. The naan is delicious, and the Chai is perfect!"], ["Tia P.", "Buffet style lunch with a variety of curry and dishes to choose from. About $60 for 4 people with 3 mango drinks. Not a bad deal....staff attentive and friendly. If they ask u if u want refill on mango drink it comes with a charge no free refills FYI."], ["Dorie B.", "This is one of the best Indian places in the area. The food is very flavorful and portions are good sized. We always have left overs. The flavored nan is out of this world and the iced tea is like no other tea I have had. It seems to be their own creation. The service is always great. They also stay open a little later than some of the other places in the area which is nice."], ["Shauna H.", "I am a huge fan of Indian food, and this is the best Indian food I have found in SA. I love the Chicken Tiki Masala and Raita. Also, the staff is very friendly and provides a welcoming experience, even when I am stopping to pick up to-go food."], ["Joshua C.", "I went for the lunch buffet, as usual. Not only was there an excellent selection of food, but it was all of very high quality as well. The service was equally good. I had my baby with me, so I was try to load a plate one-handed. The waiter saw me and came over to help out, taking my plate back to the table for me so I wouldn't drop anything. To drink I once again got the iced tea, in which they put a little bit of cinnamon, I believe. Tasted great, and the waiter came by quite often to top off my cup. The prices are a bit high, but given the quality of the food and service, it's well worth it. Best place in town to get indian food!"], ["Hilary C.", "My favorite Indian restaurant in town!  Their buffet is varied and plentiful, with just about every option you would crave.  That said, I love ordering the sampler options off their menu.  Their naan is fresh and delicious, but my favorite is their saag paneer.  I often order large party sized portions and entertain at my house, they are a great option for catering!  Staff is always friendly and warm.  I'm not sure if they recognize me as a repeat customer since I have gone long stretched between visits, but they always treat me like a recognized friend.  Love Simi's!"], ["Eric N.", "Nice atmosphere, great food. Vegetarian section on the menu with vegan options. The combos are a great choice to get a little bit of a variety, or hit up the lunch buffet."], ["Jitinraj N.", "I almost didn't come here but another restaurant opening late on new year's made me try this one, and what a find! The lunch buffet is a treat. They have one of the most authentic samosas away from India that I have ever eaten! Usually in an Indian lunch buffet, I have noticed that there would be some dishes that won't be at par with the rest, but this one was a pleasant surprise. Be it the naan ( Indian bread ), curries or the kheer (deserts), everything was fingerlicking good! Might even consider driving down to San Antonio from Houston for this. ;)Hats off!!"], ["Melissa M.", "I went here for dinner with a few friends recently. I'm not Indian, but I've had some really good Indian food on the west coast and unfortunately I have to compare Simi to that. The Indian food was definitely on the better end of San Antonio Indian food and I would definitely come back here if I'm craving Indian. However there are several things that could be improved on. We ordered the Chicken Tikka Masala, the beef curry, and chicken biyrani. A couple of my friends ordered Mango Lassi's and we also ordered some naan and samosas. Here's the lowdown on the food: Mango Lassi's: pretty tasty, tasted like real mango, good textureBeef curry: meat was really tender, sauce was a little sweet/decent average. Spice/heat was nonexistent, which I'm not used when it comes to good indian food.Chicken Tikka Masala- average. The flavor of the sauce was pretty good, but there was no heat. Chicken was average. Not the most tender, but still decent/edible. Samosas: mostly potatoes. Fried well. Not as flavorful and spicy as I'm used to but still pretty good. Chicken Biyrani rice: wish there was more rice compared to the chicken. The dish itself was pretty good though. This dish wasn't spicy, but I didn't expect it to be. The chicken was tender and I enjoyed the raisins in the dish.As for ambiance, it's cozy and I like the decor. I think it's appropriate for date night. Prices: The dinner prices are a bit high for the entrees in my opinion. You have to order everything separately and the curry dishes DO NOT come with rice, which I'm not used to. The dishes also do not come with naan which is also a bit disappointing. Overall, I would recommend Simi if you are looking for relatively good Indian food in the San Antonio area, but don't except it to be on par with Indian restaurant in the bigger foodie cities. The lunch buffet is probably a better option if you want more for your money and I would definitely like to go back and try that."], ["Matthew L.", "I've been to Simi's a couple of times now, I've experienced both lunch and dinner and this is my take. I feel I should inform you that my knowledge of Indian Food is almost nothing. I know that I like Naan. and I know how to spell Naan, thats pretty much the extent of it. The only other thing I can tell you about it is that I always love it. Every Indian dining experience is a treat, and I always say I should do this more often, yet I rarely do.Simi's for lunch is a Buffet and thats what I would recommend. You get to try a lot of different stuff and all the Naan you can eat. I tried several different dishes, and I enjoyed them all. I came back recently for Dinner and I got a Rice and Vegetable Dish, it too was amazingly tasty.Here's what I noticed the most, when I had the lunch buffet I got all I could eat and a Chai Tea for around $13. For dinner, I got a couple scoops of rice with vegetables mixed in, one order of Naan, and Chai Tea for about the same price. Even though the rice was great I felt like a fool while paying my bill. I understand that great food will cost you some cash, but I just was like $9 for rice...... Again, had I known more about Indian Food, I may have choose a dish that had more bang for my buck, but in my current stage of enlightenment, I felt like I got hosed. I don't like that feeling. Having said that, I would gladly join you here for lunch."], ["Michael R.", "Went there today with my son for the lunch buffet. It wasn't bad but it wasn't the greatest either. I did like that they had biryani in the line up and the meatballs were also good,  as was the naan, but the rest of it was just underwhelming. The chicken tikka masala had this odd sweetness to it. Also I thought that they were a bit proud of it. $20 for both my son and I. I had tea and he water. If my son weren't a toddler who ate a little bit, I would've thought that was a fair price. .I might be willing to check out their dinner menu, but there is a wonderful Indian place just around the way from me that is amazing so I'd probably just go there instead."], ["Richard B.", "Love the place,  the lady who owns it is lovely, the food is amazing. Would totally recommend. If you are like me, English. it's a must!!"], ["Laura H.", "I had the buffet today at lunch and was very impressed. They offered a wide variety of dishes, including many vegetable dishes. Everything I tried was very tasty and fresh. I'm so glad I tried it today and will definitely be coming back with my family!"], ["Eugene L.", "I've been eating here at Simi's for almost a decade.  The service has always been good.  Chicken tikka masala, curry chicken, tandoori chicken, curry lamb, peas pullao, naan and the spiced ice tea  have been my top picks.  If you like mild, medium or super spicy they will give it to you.  I find the food here to be much fresher than India Palace up the street."], ["Shannon G.", "They have some great food here plus a small variety of beer and wines.If you go here and only order one thing get the chicken vindaloo. Soooo savory and spicy. The succulent chicken is cubed breast meet that was seasoned and browned before they add it to the dish. Chicken vindaloo is one of my favorite Indian dishes and this one might be the best I've had.The vegetable simosas could use some help. Not much filling or flavor inside though the fried crunchy pillows were done perfectly.The aloo gobi was good but not great. The flavor was good but the cauliflower was so overcooked it was just a mushy mess. If I didn't know the ingredients of the dish I wouldn't be able to figure out that those mushy masses were once cauliflower.I'll definitely be back for more."], ["Ori L.", "The reviews for Indian restaurants in San Antonio seem very uneven, in that there is no clear \"favorite.\" I decided I'd just start with the closest and try them all! Moving from Atlanta, my bar is set very high, as they have a large Indian population, and several delicious restaurants. My first stop was Simi's. I ordered the vegetarian thali combo and the butter chicken. The menu did concern me when I saw the beef options. I had never seen beef on an Indian menu, but I figured it was just because we are in Texas. I only ever eat vegetarian or chicken, which is what first drew me to Indian food in the first place.I have to say, the portions are huge! Though I was surprised that only the combination meals include rice and naan. The first thing I tried was the mixed vegetable curry. It was also, by far, the best part of the meal. The flavors were rich but not overwhelming, and the vegetable combination was delicious. It truly made me regret not having just ordered that, instead of the thali. I didn't like the Saag Paneer or the Daal as much as the mixed vegetable. The veggie samosa was okay, but not as crispy as I prefer.I then moved on to try the Butter Chicken, which I had ordered as medium spicy. The chicken was oddly sweet, but also very spicy. But though that would normally make for an interesting concept, it felt more like the flavors were competing. The chicken was cooked well but I wouldn't order it again. The service over the phone and when I picked up my order, was good. Very quick and polite. Overall, it wasn't my favorite Indian food, so I'll have to try some more in the area before I decide if I'll be back!"], ["Shaz M.", "Been here a few times over the years and it is never a wow experience.  Now I am not saying that it is horrible either. We have done the lunch buffet and it has the typical selection. Naan is good. Sometimes they have biryani but it is usually a bit old and reheated.  Had the chicken Tikka but that was dry too. Now the dinner dine in experience was better. The food was fresh and tasted better. The chicken biryani was flavorful but very mild. So was the karahi and everything else we ordered.  Seems like they don't take chances with spicing it up and we didn't think to ask ahead of time. I might drop by here again if I am in the area but doubt a trip out of way."], ["Jin M.", "It was about 3 years ago when I first entered San Antonio and decided to try Indian food. For the first time in my life. Yes, Simi's was my first. Ah, first love, why don't we talk about that. I had no idea what to expect- no idea what to order. My friend (who was also in the same boat) and I decided to order.. umm, you know, just 4 full dishes. YOLO, right? Don't ask me to recall what exactly we ordered- it was 3 years ago. All I remember is it was freaking ahhhhhhh-mazing! Dude, we pretty much killed most of the dishes (not my proudest moments). I also remember saying over and over again, \"omg I'm so full but, holy crap, I freaking LOVE Indian food\". Sadly, entering San Antonio was work-related and my visit abruptly ended after 2 months. Fast forward to now--- Once again, I am back in SA and I absolutely had to make a visit to my first love. You know when you encounter something incredible and after some time goes by you try to encounter that same experience again, but it just isn't quite the same? It's like when you mastered that perfect hairstyle yesterday, and today you try to create that same do', but your hair just doesn't want to cooperate. Well, that's kind of what I expected (what can I say, that cup's half full). I figured, my fond memory of Simi's could be skewed due to many other Indian restaurants I've had since then, so it can't be as good! To dodge any disappointments, I lowered my standards and walked into the restaurant. My friend and I ordered two dishes (I'm too old for YOLO now): Simi Fish and Chana Masala. Um, disappointment out the window and OH MY FLAVOR. First of all, you should just drop what you're doing and go eat Simi Fish. This fish will change your life. That's all I'm gonna say about that. The Chana Masala, if you're not familiar with Indian cuisine, is chickpeas simmered in delicious sauce. It went really well with the Garlic Naan, basil rice and the Fish. Yup, highly recommended. With the friendly staff, comfortable seating, and awesome Indian traditional décor, the restaurant is warmly inviting. On top of that, add the life-changing fish, the 'good for you' chickpeas, home-y garlic naan & basil rice, and you got yourself a nice dinner plan for tonight! You're welcome."], ["Leah W.", "We have been going to Simis for several years and visit every couple months when we travel to San Antonio. Their food is authentic and even their mid day buffet is fresh and delicious. Try the tandoori chicken, kema Nan and for great tasting variety one of the dinners for two.  Best Indian food in SA."], ["R T.", "Medium spicy was fine for me on the dishes!  Go hotter if you dare.  The location, is a basic little strip mall, but inside they work hard on the decor, prompt and attentive service.  Do check out this place when in san Antonio!"], ["Rebecca B.", "If yelp ratings were based on nothing but friendliness and keeping my water glass full, their place would be five stars.I had the lunch buffet. It wasn't terrible, by any stretch, but I also would not go out of my way to come here.The food was nice and hot, but the flavors profiles seemed off. The channa masala was aggressively garlicky, the chicken tikka masala was oddly sweet with chicken that tasted like it was precooked and frozen, and the samosas were doughy. None of it was inedible; it just didn't taste like standard indian food flavors.Two star food, five star service."], ["Kim S.", "Service was unbeatable, my water was always full at all times. They even filled it before I noticed it was low! The food was really great. I had chicken tikka masala and my husband had simi's dinner which had a little bit of everything and it all was spot on. I ordered the mango yogurt drink and loved it! I even took one to go it was so great!"], ["Sadia K.", "Its not authentic... Had simis dinner and a lamb dish.. Everything was rich and doused in cream. I m not crazy about spicy food but here the food lacked spices. Being a south asian, i didnt particular enjoy how heavy the dishes were. If you are into non spiced rich indian food, this is for you. The food isnt bad just really heavy and not completely authentic."], ["Rachel K.", "I've been eating here for at least 4 years, found it on accident while going over to that indie movie theater that is close by. I have to say, it IS as good as it gets in SA as far as Indian food goes. I hardly ever make it to the buffet but when I do, it's such a treat. I don't eat meat at restaurants so it's often hard to find a tasty selection but Simi's has it, even on the buffet. Their tea is their own special brew and it tastes amazing. We love it here. My one complaint is that they need new booths and chairs, some of the booths are downright painful to sit on."], ["Amanda G.", "This place was pretty good. Tender red curry chicken, good samosas. I can't remember if I liked the naan. I would go here for lunch again. They do have a different selection than other places but i would have to go again to make sure!"], ["hugo s.", "This is the best Indian restaurant I have eaten anywhere in the world including London and other places where Indian food is ubiquitous.  If you are on the Paleo diet like me the tandori chicken and lamb meat balls are the way to go.  The saag paneer is cosmic, you will never be the same after you pair that with the home made naan.  Lunch buffet is from 11am-3pm and for under $15 you will be transported to India!  Do yourself a favor and visit this place asap."], ["Diane M.", "The best Indian food in San Antonio...always busy!  I'm from NYC and KNOW Indian food!"], ["Violet P.", "If you're looking for a great place to introduce someone to Indian food - or just looking for a tasty lunch - this is the place to go. Back when I first visited this place ages ago (1999 or 2000, I think?), I was under the impression that I didn't really like Indian food. Simi's cured me of that misconception. :)Some of my favorite dishes here are the daal makhni (lentils), the bengan bharta (eggplant), and the curry chicken.  Really, though... it's hard to go wrong here. Don't skip the tea - both their hot chai and their iced tea are outstanding.  The heat for most of the lunch buffet items is on the tame side... Everything is flavorful, but very little is spicy.  Having said that, they do generally have a vindaloo sauce on the buffet these days.  While vindaloo isn't generally my thing, as a fan of all things spicy, I can appreciate it... in small quantities. (Fair warning - this stuff burns with the heat of a thousand suns, and should be used judiciously.) I'll admit that there are other Indian restaurants in town that I favor for specific items... but none that I've encountered so far deliver as consistently enjoyable an experience across the board."], ["Alfred H.", "We have been eating at Simi's for years and have never had a problem. The food is always excellent and the service is impeccable. Everyone treats us as though we were their best friend. The Sunday buffet is always marvelous and everything we've ordered from the evening menu has been unbeatable. I like Indian food, and Simi's has always provided the best."], ["Jeffrey G.", "I dine here regularly as it is close to home. The Chicken Shahi Korma is very good, as are the many other dishes. Complaints? No goat curry, and waitstaff stand at a partition watching you eat."], ["Gurneet K.", "I had heard about this place when I used to live in San Antonio many years ago. Decided to try it out when I took my parents to San Antonio last night. Great food!  The paneer kulcha was great! The butter chicken was amazing! It was out of this world. My parents (who had come from India) also loved it. The malai kofta was good as well. The service was very nice, with the waiter being extra respectful to my elderly parents. Thank you Singh Saab."], ["Pamela C.", "I love this place. The chai is to die for and the vegetarian plate superb.   Very clean and eye pleasing inside too."], ["Sara B.", "Best indian food I've had! I don't like food that's crazy spicy and the staff helped me pick some mild options. They have a better vegetarian selection than most restaurants I've been to. I tried most of the items under the vegetable section and none disappointed. I wish I still lived in the area so I could keep going back!"], ["Sarah P.", "Never have I had Indian food that was so consistently well prepared and fresh.  The buffet is always well stocked, the naan is always warm and soft, the samosas are large and packed with flavour.  And there's service to match.  There is always someone walking the dining floor with a pitcher to refill your glass, they're friendly, and very respectful."], ["Rakesh V.", "Waiter took almost 15 mins to come to the table and ask what we would like.Place is in a shopping mall(open mall)Ambience is ok may be 3 starService 2 starFood 2.5Will we come back here - may be not***Dont even order pakoras especially samosa -all purpose flour with potatoThey didnt bother to come back n ask if we need water or anything else"], ["Amber L.", "Incredible food and awesome owners. Both of them are always spot on. Kind, friendly and customers come first no matter what. Always. I've dined here since my niece was in my sisters stomach. She is almost 15 now, I've had Indian food all over the world lol except India. England, Ireland, Vegas and Dallas among others. Hands down the best!!! Most Indian food places are different everywhere based on the owners and the cooks. It's hard to really have to compare one Indian food place to another. But this place is consistent so far for 15 years to me. We used to dine there 1-3 times a week before I moved further away. Now it's 1 time a month or whenever I'm in San Antonio. The owners? Always there to help. My favorite man around? Julio!!! Of course Ambi is super friendly and an awesome owner. So NancyThis places is yummmmmmmy. They turned the buffet at lunch into the best in town. 5 stars all day long!!!! Vegetarian and meat food choices, your glass will never be empty. 5 stars for yummy Simis. Don't think twice to go there. Just go!!!!!!:)"], ["Georgina M.", "Simi's, I love you. You always seems to cheer me up when I'm starting to get hangry. You have a way about you that I just can't explain. Your buffet, though small, is always hot and fresh. Your samosas are always light and crisp and the perfect beginning to the feast that awaits. The chicken Tikka Masala is always tender and delicious. It's a very mild flavor, but it complements everything else on the plate so well. When I'm feeling virtuous or need to keep vegetarian because it's Lent and it's Friday, you know exactly what to do. You provide me with plenty of veggie curries, yummy channa masala, saag paneer and perfectly cooked and spiced lentils. Your naan is always, hot and fresh. It's soft with the slightest crispy char for textural contrast. Your greatness isn't limited to your lunch buffet. Your servers are always friendly and professional and never let me see the bottom of my glass. Your iced tea has a delicate spice of cinnamon and cardamon. You are always prompt and accommodating to my annoying take out orders. Even the way you package your take out orders is perfect. Overall, Simi's, you're my favorite Indian restaurant in town. Though, I may try others, I always come back to you."], ["Maureen K.", "The lamb curry and the vindaloo sauce satisfy the taste buds for those of us who long to go beyond \"mild.\""], ["Esther N.", "Having lived in Los Angeles, it's hard not to be judgmental. Especially when you used to eat in Artesia for Indian food.  I was pleasantly surprised with Simi's Indian Cuisine. You know, a lot of Indian places are pretty dirty, but they kept the buffet items fresh, hot and overall the general appearance of the place was clean.I love their unsweetened ice tea. They put something in there, like cardamom or something, it was delicious. I love tea, and they have one of the best.As far as the food, since it's buffet, I can't say too much about it, but the chicken tikka masala was a bit too sweet for me, but the vindaloo sauce was out of this world spicy... But the veggie meatballs (is it like kofta?) was awesome.  For dessert, the rice pudding with spices was awesome, as was the mango pudding. To end the meal, they had the traditional end of meal mint, a spoonful of anise seeds!   Thank you Simi's for giving a great meal for only $22 for two, all you can eat with a soft drink each! Saturday lunch buffet is rare to find..."], ["Scott C.", "Casual and friendly atmosphere. Consistently good. Order one of the \"dinners for two\""], ["Jesse M.", "This place is awesome! especially during their buffet special. Food is always good everytime i try something new. Wait staff is super friendly, and always nice. on occasion, ive craved their food only to show up and them be closed for their lunch hour. besides that, best indian in san antonio so far"], ["Katye B.", "SO good! My husband had gone to the lunch buffet and really enjoyed it so we went here for dinner and did not regret it! The food is spiced perfectly and some of the best Indian food I have had! The food comes out VERY hot so be careful. The naan is amazing and we ordered another round of it with some curry mixed vegetables to go. I cannot wait to come back to the buffet!"], ["Grant F.", "A lunch buffet is a good way to check out an Indian restaurant, and they have a good variety on theirs. Mostly chicken (I hoped for goat, but I'm weird), a lamb meatball (quite good) and always chickpeas and other vegetarian options. Good service, especially for a buffet (where you are often ignored elsewhere). My second time and I'll come back."], ["S B.", "HORRIBLE HORRIBLE HORRIBLE I would give this place a negative rating if possible..if you are an indian and you are visiting this restaurant then this wood be the worst place you ever ate..the reason this place has so many good reviews is because only non Indians visit this  place and they don't know the taste of the dishes ..every dish is like a desert and I don't even know how that restaurant is called an indian restaurant..There are so many other delicious indian restaurants in town ..but please don't go by the reviews this has online ..you will repent later ..take my words .i bet ..this doesn't even deserve a 0/10..I couldn't stop myself by writing this review as I cannot tolerate restaurants cheating on food by calling them indian restaurants when they don't even know if a dish is a sweet dish or a entree..lolSo do not go to this place ..please"], ["Georgie G.", "Best Indian food buffet, every day of the year until 3pm. Always consistent; Always delicious."], ["Mandi T.", "I don't eat Indian food often. ... but this was the most flavorful meal ever! ! I had the shrimp bhuna .... I can't even describe the flavor other than. ...Devine."], ["Sonja J.", "My husband is hatin' because i came here without him. We had dinner for four, but i will only rate my dish (everyone was thilled with dinner). I had they vegetarian thali and they were gracious enough to substitute roti for the naan. The saag and dahl makhni were nicely spiced and creamy. I'm sure they would have made it spicier if i had asked. The raita was outstanding with a bite of onion and chili, and the mixed pickle (mostly lime) made my tastebuds tingle!Again, i enjoyed the cold spiced tea and gracious service. The restaurant is neat and clean, and the music type and volume complements the meal rather than competing with conversation."], ["Sneha P.", "Server was very awkward and somewhat rude about basic questions to folks in my party. I'm all about joking around but it only works if you make people comfortable first. Food and ambiance were good. I'd give it another shot"], ["Andrew F.", "This used to be one of my favorite spots but the last few trips have been inconsistent. Food was bland, luke warm at best, but service was fairly attentive. For the dollar ($15 for lunch with tea and small tip) there are better choices in town."], ["Jamie K.", "The dishes were absolutely delicious! The prompt service and delightful staff were very warming and welcoming!"], ["UD M.", "The food is worth 4 star. The service is not good and I can tell how newcomers are treated versus Indian guests. I was neglected, seen my server only twice in over an hour, I was given the wrong food, I told the server I was vegan, in which he still ordered something with cheese in it, but it didn't say there was dairy in the description on the menu description, and took 52 minutes to get food. I will say the food is delicious. I would come back though."], ["Jonathan G.", "Maybe it's because I'm in a bad mood while I ate here. I had the buffet with my dad and his wife's family and it was nothing special. The food was all bland and exotic tasting but none of caught my fancy. Honesty the only thing good here was just the Cantalope. The decor too is awful and tacky. I felt as if it could on an episode of Tim and Eric"], ["Tim B.", "Excellent!  Everything was perfect!Service was personable and very promptThe curry was perfectly got  but not too muchHighly recommend this Restaurant"], ["ClassyWomanTX D.", "3-STARSSimi's is a GREAT place for * LUNCH *.Lunch is when the food is very fresh.They have a great buffet, and the service is great!Dinner's on the other hand would be a lot better if they didn't REHEAT the food from lunch!  Everything is priced a-la carte at dinner so it's extremely pricey given the same meal you paid for at lunch.The wine selection is simple, but good, and the Chai masala is delicious!Great for a small meeting or quick meal.Not a good place to come and read the paper or chit-chat forever at lunch time!  The rest of us want to sit down and eat :)"]], "Cafe Bahar": [["Anu B.", "I should say San Antonio finally has a great Indian eatery. I don't really care about ambiance if the food is great. Again, great vegetarian food.Things we tried 1. Dal - My dad went crazy over it. This lenthil dish tasted better than anything else on the menu2. Veg Platter - Generally, bhajias are oily but not at this place. Make sure you have plenty of people to share as the quantities are also huge3. Vegetable Biryani - For vegetarians, this is as good as it gets (atleast in my opinion)4. Eggplant masala - Tasted homemade and had a spice balance which is difficult to achieve with this dish5. Naans - The bread was also fresh and warmService was great and the servers were very friendly. Provided good advice on food as well."], ["Sunay P.", "This was a worthy successor to the previous denizen, which was one of my favorite Indian buffet's in town. Cafe Bahar has made changes over the many months it has been open, but it is still high on the buy category for me!The food is dominantly south indian influenced with an occasional north indian dish thrown in like the chaat and ragda patties (a spicy potato cake eaten with spicy pigeon peas, a smattering of coriander and crunchies and chutney) which are popular street snacks in the north and western part of India.  The pani poori and sev poori are the equivalent of indian nachos, essentially crispy flat bite sized things with tasty stuff on top :-).  The goat curry here has been consistently good and if they have Chettinad chicken, I almost dare you to stop eating it! It is perfectly spiced with a nice hit of chillies, curry leaves and coriander which makes for fabulous eating.  The vegetarian selection is also quite good and standouts to me are the green bean and cabbage dishes which are simply made but bursting with flavor and fresh coconut that adds a certain amusing freshness to the dishes.The pakoras (fritters) are always excellent and lately the chicken pakoras have been making my palate sing! Throw in the pretty good masala chai, and this is on the fan list!!"], ["Jackson C.", "Fantastic! Authentic! My friends from Indore India brought me here. Love it! Great little lunch buffet. :)*This is a busy hole in the wall... Not the place to expect first class service, so don't act entitled or you'll be disappointed."], ["P Luly W.", "SPICY!... just the way I like it!  The food is very tasty and spicy.  So if you like spicy foods, you will like it here.  Don't know much about Indian or Pakistani food?  Then I highly recommend that you try the lunch buffet.  That way you get to taste a bit of everything.  It's not a huge buffet.  But what they do offer is all very good... especially the goat curry.  Unlimited dosa and naan are also included with the buffet.  Just let your server know how many of each you want at a time.  They are made to order and come out piping hot. I especially enjoy building my own pani poori/puri (not sure of the spelling).  All the fixings can be found in the \"chaat corner\".  The puri = little fried balls.  They are hallow.  Make a hole and fill with whatever you like.  Then dunk the whole thing in the flavored \"water\" (pani) & consume!  Or, as I like to do it, scoop some of the pani into your puri and pop the whole thing into your mouth...yum!The hours were incorrectly posted the first time I tried to come here.  It looks like that's been fixed now.  BUT...be aware that staff tend to be on whatever schedule they feel like being on.  On 2 different occasions, they opened on time.  However, there was no food because the cooks didn't show up on time.  Hopefully, that isn't a recurring issue...especially for lunch.  Some of us only have 30 mins to an hour for lunch, y'know?Despite the wonky hours though, I am still a fan of the food and will be back soon!"], ["Dustin D.", "The food is still good, but I noticed a couple of things the last few times I went. 1. Nobody seems pleased to see me when I show up. They seem far more attentive to the Indian customers. I don't need my rear kissed when I go somewhere to eat. I'm not special,  but don't look at me like my presence is bothering you either. 2. Something is off with their tea. It's happened to me twice and it happened to a friend of mine. The tea smelled slightly of rotten eggs. This is likely from the containers they use to distribute the tea not being properly cleaned. Clean your equipment guys."], ["Punit S.", "Excellent food!Great buffet selection. Ample parking.Super nice staff.This is must try! Highly highly recommend!5% discount if you pay by cash.Also, they honor the yelp coupon for dinner discount!"], ["Carolyn J.", "Love, love, absolutely love eating at this Indian restaurant.  Friday's are chaat days and so yummy.  Unfortunately for me, I do not eat meat on Fridays.  The food is fresh, spiced perfectly and more dishes are like cuisine versus 'run of the mill' types of dishes.  Great staff and service with complimentary lemon aid and if you ask they'll bring you 'naan'.  YUM YUM!"], ["Ronney R.", "Best Indian food in town. If you like spicy, this place is for you! Best bet is their Lunch Buffet if your new to Indian food. Their dinner menu is quite good as well. Always filled with Indian folk and their families which tells you a lot. Last time here, there was a huge Indian family celebrating a birthday. It truly felt like we had stepped into a vortex, and were transported to New Delhi! Great experience!"], ["Asif P.", "We catered food from cafe Bahar for our daughters graduation , and our overall experience was really good. The food was delivered fresh and the crew who helped in serving the food was very friendly and professional. It is very reasonable to cater from this restaurant. I would highly recommend them for family events and gatherings. My rating is 10/10"], ["Hairsalon K.", "Great food.  Good variety.  Chicken manchrian and coconut rice were awesome!  Great selection for vegetarians too. Staff is alright...not as attentive as Bombay hall tho. Definitely  gonna return here."], ["Kate H.", "Such great food. They offer almost as many vegetarian options as they do meat. The staff is always very friendly."], ["Sunny M.", "A very huge and tasty buffet, quite busy in the noon but the taste always pull me over there, and their menu have lot of options for dinner, their best appatezier is Apollo fish, and also ordered garlic naan with keema curry and they are so well cooked and their naan is so soft to even touch. Planning to try their other items on the menu and to mention the service, it is decent and nice."], ["Annie M.", "Awesome buffet. We went with the family and had a great meal. The service was wonderful, very helpful and friendly staff. Our server recommended some different ways to combine the dishes and to use the butter chicken with the tomato chutney. It tasted great. The food had lots of flavor (as you can expect from Indian spices) and completely dazzled my palette. I recommend the paneer butter masala and butter chicken. I wish I could've tried more but I got full very quickly. The banana custard was awesome as well. You can't really go wrong. Highly recommend it :)"], ["Richard W.", "Chicken 65. This stuff is amazing! They have rotating varieties of rice beyond just straight Basmati. Forgive my limited American descriptive abilities, but I love the one that has peanuts, herbs and spices mixed in with Basmati. Naan is very good here as well and the sweet rice pudding dessert dish is a unique preparation that cools the burn in your mouth from all the spice."], ["Miguel R.", "This was my first visit to Cafe Bahar. Excellent Indian food. I would have preferred a buffet style which they have for lunch. That allows me to sample more of the food and make a better assessment of their cuisine. My wife and I went safe for our first meal and ordered spinach pakora, chicken tikka masala and garlic naan. SUPERB!  We asked for medium heat on the tikka masala and it was just perfect.  The pakora was served with a mint yogurt sauce and a sweet tamarind sauce..both very good.  The only reason I gave it four stars is that I want to try more dishes before I commit that fifth star. We'll be back soon and will update the review. By the way, one order of everything was enough to feed my wife and me and take some home for tomorrow's lunch."], ["Vaibhav G.", "Worst customer service ever experienced. The staff is rude and ignorant of the needs.Food is just fine. Not many options to chose from."], ["Elena S.", "The lady who threads my eyebrows recommended I try their new restaurant. I went and I liked it. The place is clean and the restroom was clean. I ordered the buttered paneer and the okra fry with chai and chili chicken. All the food was delicious and the ingredients tasted fresh. I could tell the wait staff is still a little new, but they were very courteous and refilled our beverages and kept our table clear of plates. The presentation of the food was nice and the portion size was plenty.I will go back to try the lunch buffet. Their food reminds me of Teji's in Austin.  I've tried, Bombay Hall, Barwarchi Byriani, Taj Palace, Tarka, Mela (has switched owners), Mustafa Cafe (now Laddu Khan) and Ali Baba.  Each place has its own variations, but my personal preference is Bahar Cafe based on their for food quality, taste, menu selection, service, and cleanliness."], ["Rahul R.", "I really enjoyed the lunch buffet.. so far in san antonio this is the best food to enjoy with your family and friends. I really like the goat curry."], ["Marie F.", "Just bad experience. None of my favorites in the buffet and everything was more than spicy; or spicier than what I'm used to as far as Indian food goes. There were only 2 waiters that seemed to be overwhelmed and they kept forgetting drinks and who wanted more naan. I should've gone somewhere else..."], ["Nik D.", "A welcome change - food seems to be well cooked - Average ambience - goat chops are best in town. Lunch Buffet is Average."]], "Pavani Express": [["Erika S.", "I was a bite hesitant when I walked in because the place looks pretty  grungy.  But there aren't that many veg restaurants in this town so I try not to be too picky.  They are vegan friendly as well.But the food was amazing!  So great spice wise and extremely affordable!  The plates were huge so come with a monstrous appetite!  The menu is big but non descriptive so you had better know your Indian food going in."], ["Anoop G.", "I went here because of the many positive reviews on Yelp but ended up very disappointed.As far as ambiance goes, this place is a hole-in-the-wall in a strip mall.  But that would not keep me from giving the place 5 stars.What was really a disappointment was the food.  I ordered idlies and a rava dosa.  The idlies tasted OK (but I've had better).  The rava dosa was really bad and I ended up throwing away a good part of it.  I'm not sure what exactly it was, but it had a flavor that I just couldn't place, kind of like something chemical (non-natural).  I'm not sure if it was because of the piping hot food being served in styrofoam plates or something else.The service was OK, but because of my experience with the food, I don't think I'll go back."], ["Gene H.", "ABOUT:This isn't the fanciest joint in the city. But I'll choose Pavani Express for lunch over any of the Indian buffet lunches in the city.Why? The buffets serve a lot of foods, and all of the foods are OK. Just OK. You can't do excellent food at that price and quantity. But a place like Pavani Express can do just a few foods, and do them very well. And they do.PROS: They served me the best malai kofta I've ever had. Rich, buttery, savory, absolutely delicious. A very hefty serving for the price, too. And the rice is fluffy and plentiful.I also had the vegetable cutlets, which were delicious. The mint and tamarind sauces were also delicious. And fresh. They hadn't spent a day in a serving trough at a buffet.Oh, and guess what? The Indian tea was also delicious. They made it fresh, on the spot.I am not a vegetarian, but my vegetarian friends love this place. I certainly did feel like I was missing anything. It's a win-win.CONS:The tables are all too small, and they wobble."], ["Ishtiaq M.", "The best place for South Indian food.i went with my family we tried so many dishes and we liked them all."], ["Elle J.", "I don't mind giving a hole-in-the-wall a try because most times it means the restaurant is all about the delicious food. The area doesn't look particularly safe, and the one time I sat down here to eat, the tables weren't clean. BUT it's great for Indian take out. You call in to order, and the food will be ready in 10 minutes (express indeed). The tikka masala and butter masala are rich in flavor, and I always love me the paneer that comes with it. Another plus for the gobi manchurian for some meaty cauliflower. It's like eating a vegetable without eating a vegetable. If I order two dishes, I get three meals out of it. No frills, just good authentic food."], ["J.b. B.", "This place is an insult to Indian Cuisine."], ["Christi R.", "Food is delicious, especially the saag paneer. A little overpriced, don't like the beverage selection, and sometimes takes longer to get your food than you'd like."], ["Kris S.", "Being from Chennai in South India and a vegetarian, I was so happy when Pavani Express opened a few years back. My wife, my parents and I have been here so many times now and we have also catered our son's first birthday with them and their food is always wonderful. My favorite is their Bisibeli bath, which is rice mixed in a lenthil soup (Sambar). My dad's favorite is their Spicy Andhra Dosa, which is really spicy. My wife loves their Gobi Manchurian, though she wishes they have less onion and pepper in it. My mom loves their Puri Masala. My dad, also from Chennai, raves that Pavani is better than any restaurant he eats at Chennai. High compliment indeed! My only gripe about this place is that they do not have functional high chairs and their ambiance is poor. If they can improve that a bit, the dining experience will be just perfect! If you want to taste real South Indian food, look no further than this wonderful hole in the wall!"], ["Deepti S.", "This place is perfect dosa's. The next time I tried vegi saag and roti but didn't like it at all. So I will say the place if great but only for dosa's."], ["Vai P.", "This place is like none other.  It's a great little cafe, whether you're just looking to grab a snack with a few friends or a quick dinner with your significant other.  The food is just phenomenal.  One of my favorite Indian food is Dosas and this place has definitely learned to master the art of making a Dosa (Not too crispy, lots of filling, and a nice spicy kick to it!!). Excellent food, Great prices, and Superb service!  This place has it ALL!!!! Pavani Express, you have gained a very loyal patron =)"], ["Remain N.", "Dont expect a great atmosphere or great service when entering. What you can expect is great tasting Indian food, a great selection, and all vegetarian. By far one of my favorite places to eat in San Antonio."], ["Joe W.", "The customer service is fine most of the time, and everything I've gotten has been delicious. Probably my favorite Indian place in town. Portion sizes are big enough to have leftovers."], ["askbal a.", "I was very surprised that there were no good South Indian take-outs in San Antonio. And then I found this place. They make authentic and excellent tasting masala dosas, idlis and vadas -- staple fare in the South of India."]], "Maharaja Sweets Indian Restaurant": [["Jane R.", "Reasonably priced, delicious Indian food.  EXCEPTIONAL service.  I ordered the goat curry special, which includes rice, lentils, veggies, naan, and dessert -- all for $9.99.  The lentils were a bit too salty for my taste, but everything else was really yummy!  The portion was big, too.  I pretty much overate and still had some left for lunch the day after.  Didn't go for the buffet but there's a guy who was filling up like 3 boxes of dishes from the buffet bar.  He said he's a frequent customer.  I'll definitely try the buffet the next time I have cravings for Indian food!"], ["Tanya T.", "I'll admit, the food was good (not awesome, but good). Only issue I had was I barely ate because it's hard to enjoy a meal when you've got baby cockroaches crawling around in between the glass top and the table. Would I eat here again? Not unless I received a copy of the health department permit declaring them cockroach free!"], ["Lin C.", "So, after eating 1/4 of the food I got from Maharaja lunch buffet in a to-go box, and I felt like I was having a grease heart attack (as did my roommate). While the food is full of flavor and authentic, it is too greasy that I could only eat 1/4 of what was in my box. Out of the three Indian restaurants I've eaten at in SA, Maharaja is my least favorite. Yes, the lunch buffet is only $6.99 and the owners/workers are very friendly...but I have to admit that my experience here was not all that great. First, I am eating a samosa, and a piece of hair [that is definitely NOT mine] made its way into my mouth. If this were at the restaurant I would absolutely make sure the manager knew, but unfortunately I was eating this at home. Secondly, the saag paneer is pretty good, but I've had better. It was a bit too spicy and salty too. The basmati rice was undercooked. After eating what my stomach could handle, I put the box in the back of my fridge, hoping that it would disappear. I asked a few of my friends who love Indian-cuisine if they wanted to try some because maybe it was just me...but I suppose the food didn't look too appealing to them. Oh well. I am sitting here as I write this, trying to finish my leftover that will have to be thrown in the trash after I eat the last meatball--which is the best things from the buffet. On a positive note, the manager gave us fresh naan straight out of the oven. But alas, the naan was just okay. It was doughy and crunchy at the edges, yet a little too greasy for my taste. I will dine at India Oven to satisfy my Indian food cravings from now on."]]}