{"Mr. Lee's Chinese Restaurant": [["Greyson M.", "When you first pull up to the establishment and walk into you, you will first think \"wow this place is an old dump!\" but do not be fooled.The guy would help us at the front counter was very kind and helped us figure out what we wanted.The food was fresh and hot. It was steaming when we got it and we gobbled it down. I would certainly return to this place for a nice Chinese lunch. I would recommend to others to give it a try despite the looks.Like the old saying goes, \"don't judge a book by its cover\""], ["Aj R.", "They do not answer there phone during business hours, they say they deliver but it is very difficult to achieve that."], ["Rachael W.", "Decent! They put fresh vegetables in the food, and it's served hot and fresh.  I was worried as I walked in the place (especially because it was completely empty at dinner time), but the food is actually pretty good."], ["Sarah L.", "I've loved this place for a couple years, but something has changed. All of a sudden, the food tastes completely different with almost no flavor. My Kung Pao tastes like the chicken was grilled or they used liquid smoke on it and then diced it up and added it to a weak bland sauce, instead of cooking it in the sauce so it absorbs the flavor. It's so sad, because this place used to be so good and now it is inedible. I am probably going to be throwing my meal away. Guess I will need to find a new place to fill for my weekly Chinese craving."], ["Sam K.", "I love this place! All dishes are like no other - there are plenty of other Chinese places whose food all tastes the same. But not this place. It's different, in a good way! (Try the curry beef for a nice surprise!) The staff is very nice, and the portions are plentiful. It's my new favorite local Chinese place."], ["Lucy F.", "One of my favorite places to go. I have loved everything I've tried. Food is made fresh and gets to you nice and hot. The best thing is you can add spice or have them make things not spicy. I love getting combo lo mein and making it spicy."], ["Ed H.", "Mediocre at best. I had a late lunch there and it was incredibly salty. Crab Rangoon are horribly folded triangles. Generals Chicken was crazy salty.Lunch portion was considerable, but food was not good.Staff was on the phone when I checked out."], ["Adam F.", "Good food, great portions, wife only wanted a little more filling in the Crab Rangoon even though I was good with it."], ["Jessica S.", "I have a food allergy to sesame seeds and sesame oil and Mr. Lee's is the only restaurant that took the time to clean everything so that I wouldn't have any cross contamination issues. Their food is incredibly fresh, especially their vegetables. Their portions are generous, their service is fast and friendly, and the restaurant is clean and tidy. The owner is a great guy and truly cares about the food and service here. Our family will definitely be coming back!"], ["Kenny A.", "The Best Chinese restraunt to eat at!!! Food very Delicious!! I'd never go to another Chinese restraunt!"], ["Vinh T.", "Great food. Worth the wait. Yes u may need to wait for your food,but everything is made fresh. The new owner Danny is a delight to talk to. He remember my name and favorites order. Good lunch special. Delivery is hit or miss.. recommend to anyone look for a good neighborhood Chinese restaurant"], ["Rick F.", "9/28/2014If you haven't been by lately, you need to rediscover this awesome little restaurant. It has changed ownership and the new owners are all about the freshness and flavor that make the food. They have a great variety of sauces and the best Udon in town. If you haven't been here before, you definitely need to try it. The food has changed drastically, if you haven't tried it recently, give it another try."], ["Jason K.", "Spot ON!  The service and food are what you look for in any restaurant and these guys get it.  They made suggestions for \"off-menu\" items to make our first visit perfect.  The Crab Rangoon are the best I've ever had.  This is a MUST TRY if you are in Lincoln, NE and looking for some Chinese in the heartland."], ["David D.", "I was going to go to this the other day but somebody told me that the owners do not own it the same owner of a year ago if its even open what a bummer so we didn't even try to go to that side of town when we were in town oh well some good things don't ever last not saying that if there is new owner is it is just as good or better but we do not know"], ["Kayser P.", "Been here a couple of times, i guess now its under new management and the new owners are really nice. Came here on my lunch for a cheap n fast meal. Ordered the orange chicken meal, with fried rice and a fried won ton man was it good! Def coming back soon money back guarantee!"], ["Rebecca L.", "When I feel like Chinese food, Mr. Lee's chicken fried rice with their spicy chili hits the spot!  And of course I have to order crab rangoons... They are seasoned so well you don't even need sweet and sour sauce! *drool. And every so often I'll get their fried pot stickers =)."], ["Audrey F.", "I stopped and Mr. Lee's for the first time about a month ago. I thought the food was very tasty and good. I have been back a few time since. I live on the North side of town and will drive out of my way to eat at Mr. Lee's."], ["Keith S.", "Must have changed their recipes. The hunan chicken isn't as good and the new way they make their crab rangoon is a joke. Sweet and sour sauce is more like jelly and my soup was cold the last time I ordered takeout. The last two visits left me unsatisfied...time to find a new Chinese place."], ["Auburn B.", "First time eating @ mr lees Chicken was good quality, my husband got the sweet and sour chicken and loved it.  I ordered the general tsos chicken it tasted fine but there was no spicyness to it.  It was good could have used more flavor and spice to it though."], ["Aaron D.", "Was looking for a new Chinese spot and I found it. Me.Lee's combines great service with great food. They're under new management so they've been recently updating their menu! You gotta try their wings because they're killer! Definitely found my new spot for a good bite!"], ["Brad S.", "I have made the rounds of Chinese food in Lincoln. North, south, east, west and central. For me, Mr. Lee's tops them all. Consistently good and they always get the order right. I've tried cashew chicken, vegetable chicken, Kung pao chicken, sesame chicken, twice cooked pork and Gen. Tso's chicken. All were excellent. The chicken egg rolls are good too and not greasy. The owner Danny and his help are all very customer friendly. I don't think you'll be disappointed."], ["Sites R.", "Great little spot. Had the Mongolian beef. Yum. The fried wontons are great.  The lady that took my order was very friendly.  Clean establishment. Excited to go back."], ["Adrian B.", "I live a few blocks from this new restaurant and love Chinese food so was excited to try the place.  I had read the review in the Journal Star so knew it's just a generic eatery so nothing too specialized owned by a white guy called Fred.  So my expectations were not set too high.  It's the old Dairy Queen but is clean and well kept inside.  I was served by young college students who were friendly and efficient.  Now to the important stuff, the food.  The Hot & Sour soup was savory but lacked any real spice.  The double wrapped crab Rangoon's just bloated me down as it was encased in about a pound of fried Won Ton's.  The center was just a mass of pure cream cheese, no onions or other flavors.  I have admit I did not like them and did not finish them.  For mains I had the Pineapple Chicken which was breaded, fried and served with nice pieces of pineapple and a light sweet sauce.  It was decent, nothing extraordinary but the quality of the meat was good and was comparable to typical American style Chinese food like the stuff from the mall.  My wife had the Hunan Chicken which was grilled in a brown sauce and served with fresh peas, carrots, broccoli, and button mushrooms.  There were dried very dark looking peppers which added no spice or taste what so ever since they were not fresh.  In fact that dish had not taste at all, but again the meat and vegetables were nice and fresh in quality and well cooked.I think this restaurant has will do well with the college students as it's price friendly and there's no other Chinese restaurants in the area.  I wish the place all the best.  For me personally I won't probably go back as I need some and flavor in my food."], ["John R.", "The only reason it didn't get the extra star is because I've only been here once.   If this place keeps getting better (not sure how it can, but for the sake of argument) I'll revise my review.So, first visit on 6/23/2013.   The place is in a former Dairy Queen.  We were unsure what to expect but were greeted by the owner's wife, who was nice enough to walk us through the offerings  Because I am an egg drop soup fan, I ordered a bowl of egg drop soup and we ordered a couple of 'spring rolls' (more on those in a minute).   We decided on General Tso's chicken and chicken and green peppers for our entrees.  All that, fried rice and a couple of drinks was about $28 bucks excluding tip.  Not bad.  Comparable to other Chinese places in Lincoln.On to the food.First of all the egg drop soup was perfect.  And I mean that literally.   It's really easy to screw up and most place don't get it right.  Thick broth with real egg noodles, peas and some onions.  Tons of flavor and the noodles were perfect.   A little shot of soy sauce and we were off to the races.Now, about those spring rolls.  These are only spring rolls if you're a giant.  They are huge.  Like burrito huge.  And they are fresh and perfect.   They tasted like summer time.  Come to find out that what we got was the spring rolls they make as a menu item, but Mr. Lee's will customize them (chicken, shrimp, beef) any way the customer wants.   Did I mention they're huge?  Well, next time I go in  I'm going to order a couple of spring rolls and a drink and call it a day.  Yeah, that big.So about a nano second later (it was 4:30 on a Sunday so service may not be that fast every time) they brought out our food.  Freshly chopped and cooked-there's nothing sitting in pots waiting to be served here.   A giant bowl of friend rice, and two generous plates of our entrees.  My wife's General Tso chicken had just the right amount of pop to it without being overwhelming-which is another thing that's easy to screw up.  My green pepper chicken had fresh, obviously just chopped green peppers and onions along with some perfectly cooked chicken in a really tasty sauce.   It was all very good and again, freshly prepared.  That in and of itself is a differentiator.They also deliver.  Anywhere in Lincoln.   They also have specials.   I had a favorite Chinese place in Lincoln.  I have a new one now."], ["Tam D.", "Go here if you're hungry for some tasty Chinese food.  Exellent fried rice and fried wonton.  Was not disappointed.  Great service.  Will come back again for more."], ["Shelly W.", "First off, the server/cashier was very polite and friendly. But the food was seriously lacking. I would describe the tofu as squishy and tasteless. The rice and noodles had a brown gravy flavor, no spices or Chinese flavor. Also, the menu is very cheesy with two and three exclamation points after everything. Not my favorite Chinese restaurant in town---if you were wondering!"]], "Sakura China": [["Jill S.", "Out of the 3 different Chinese buffets currently available in Lincoln, I would say this one is best. It had the most variety of Chinese entrees, not an overwhelming amount of mystery meats! They have the largest salad and desert selection. They have the freshest sushi selection and had about 10 different rolls laying out, some fried and a great variance of fillings! Not just California rolls here!! Service was adequate. Everything was very fresh and actually hot, not steam table hot, but was actually cooked in the last 20 minutes hot and I find that very respectable. Great experience, they win this round for me so I will be back the next time the craving to stuff my face and remain immobile all night strikes me!"], ["Lincoln C.", "This is a cheap Chinese buffet and that is about it. Lots of selection but a lot of foods I saw NO one eating.  Why do these places provide all the nasty fish selections that has been sitting there all week.  Seriously all week. Why not just more of the popular dishes that 99% of us eat. The Mongolian grill is a joke. I will leave it at that. Only about 1/3 of the selections are marked of what they actually are. The crab rangoon are tiny and hard as a rock. The place was clean when we went and it was cheap for a buffet. Two positives = two stars.It's like getting drunk on a week night. Sounds fun but I'm the end you pay for it.  When you leave here your stomach will hate you."], ["Adrian B.", "If your on a very tight budget this is the place for you and I don't mean this is a rude or condescending way.  When I was a college student I would have been happy to eat here for the price.  But as an adult I found the experience poor.Upon driving up the warning signs were apparent.  The parking lot needs resurfacing as it's riddled with potholes and broken up pieces of tar mac.  Walking up to the doors you can see the entire buildings wood is peeling off and has been painted over as a cheap way to 'fix the place'.  I'm always leery of establishments with poorly kept facilities as it often dictates the rest of the business.  Fortunately the remodeling work on the inside is better.  I ussed to eat here many years ago and they restaurant is well arranged and kept inside now.  The servers were polite and on the ball.  Now onto the food.  The Hot and Sour Soup was average but all of the appetizers were just battered up oily fried excuses for food.  The Crab Rangoon's were micro sized with no soft center, it was like chewing through Balsa wood.  So I skipped onto the main courses hoping for something more impressive.  The actual amount of food on offer is extensive with more fish dishes than I've seen on a buffet in the Midwest.  I'm from a fishing town so was not brave enough to experience the fish here.  I'm sure it's not too bad but I didn't want to take the risk.  All of the normal American Chinese dishes were on offer, I tried the Tsao Chicken which was a flavorless globule of pre-frozen chicken with no seasoning.  The Beef and Broccoli was covered in greasy oil which over whelmed the dish, very poor.  The Sesame Chicken was standard mall food but edible.  The Mongolian grill had a great selection of meats and vegetables but there was no recipe suggestions to help build a proper dish.  All of the seasonings tasted bland and everything tasted like Soy even if I had not chosen such a sauce, and yes I know Chinese food is based off such sauce.  The Sushi was odorous so I steered clear.  The chef on duty would not even give eye contact or speak so that was another poor aspect.The desserts were limited and the pastries were dry.  My son had the ice cream which was flavorless (see a pattern here?) and detectably had no cream just ice and food coloring.  Afterwards I could tell there was a heavy usage of MSG.  I personally would rather eat at the China Buffet Mongolian Grill down the road which uses on MSG and has no smell or fish when entering the building.  It might be a few dollars more but the ambiance and quality of food is in my opinion not even comparable."], ["Rick F.", "Good value for your money. Sushi is prepared fresh by the same chef that runs the Mongolian grill. Along with a good buffet, this is a great place if not everyone is up for sushi. Only complaint I have is the airflow. Some areas are warmer than others."], ["CM B.", "This is a five star buffet because it hits everything you want:  quality, cleanliness and cost.  The place was very busy and the smells were incredible.  The food had lots of flavor.  The appearance was great.  They have a lot of things to try on the buffet and the food is also hot. Price was very reasonable!  Lunch for $9!"], ["Pra R.", "I like the Mongolian bar (Raw food selections) because they have all meats including seafood (Squid, scallop, fish, shrimp) better than food at the buffet.  They also have Sushi available."], ["Sarah P.", "Favorite Chinese Buffet. Love their beef entrees and sushi. I've only ever had one issue in the entire 5 years I've been eating here and the owner took care of me."], ["Audrey F.", "I would say this is the best Chinese Buffet in Lincoln. Very clean, and the wait staff is good about clearing off your plates. The food is delicious and the prices are reasonable. I even enjoy the 5 flavors of icecream they have.  If you are in the mood for A Chinese buffet..this is the best."]], "Golden Wok": [["Ryan M.", "I would consider this somewhere between 4 and 5 stars depending on what you order from their extensive menu.  And keep in mind, this is a casual Chinese restaurant with \"Americanized\" food - it's not fine dining, nor is it meant to be.Service is almost always very fast unless they're swamped, which is pretty rare in my experience.  The speaker at the drive thru can be difficult to understand, but they get your meals out quick once you get up to the window.I've never run into a bad dish here, but there are definitely some I find better than others.  I particularly enjoy the Kung Pao Chicken, Lemon Chicken, Mongolian Beef, Green Pepper Chicken, and Cashew Chicken.  My standard dish, though, is their Tso's Chicken but done without the breading.  This takes an average Tso's Chicken, where the sauce is badly muddled by the taste of the breading, to a great dish in which the sauce really shines.I do like their Hot & Sour soup and Crag Rangoon, and prefer them here to most places.  The Hot & Sour is not done in a way that makes it overly dark, which I assume comes from lots of soy, and that's a big bonus for me.  And though I'm not a huge fan of either no matter where I go, the Egg Rolls and Egg Drop soup are decent here.Lunch portions make a decent sized meal and come with soup and a couple Crab Rangoons.  For the price, it's a great deal.  Dinner portions are larger and usually make a couple meals for me, which keeps them as a good deal, too.When you consider speed of service, price, and the overall quality (and consistency) of the food, you can't go wrong with Golden Wok if you're in the mood for Chinese."], ["Keith C.", "Good restaurant in an iffy area. Food was outstanding.  Can't wait to try their other menu options"], ["J D.", "Been here a few times. Overall it's okay and the food is relatively good in a Chinese Fast Food kind of way. Fried rice is pretty greasy and has only small pieces of Carrot in it, no other veggies. Shrimp in Lobster sauce is pretty tasty and could be split between two people if you got a little extra rice.Speed was super fast. The exterior of the building and the neighborhood could probably make someone think twice about coming over but the food is solid. I can't help but get kind of a creepy feeling though, like the food isn't clean, so it does take away from the overall experience for sure.Took a star away for the really strange ordering process. Very old school (think 70's) speaker outside and it is too loud for one and half the time they can't understand you. You're lucky if they can understand your order even if you go up to the window based on how some of the people in the window barely speak English."], ["Agustin T.", "I don't mind spending money on a good meal but the food definitely ain't worth the price. Left feeling ripped off."], ["Don M.", "Recently was looking for someplace new for Chinese.  So I searched Yelp and found this little hole in the wall which is somewhat near my home.   I brought the family in and found the menu to be extensive so that everyone was able to find something they liked.   I was especially pleased that they were one of the very few restaurants in town to have shrimp toast as an appetizer.   One of my favorites.We ordered a double order of crab rangoon, and a single order of shrip toast for myself.   I ordered the Triple Delight, a mixture of Shrimp, Beef, and Chicken in a brown sauce with broccoli.  It was very good.  Not the best I have ever had, but it was certainly worth the money.  The portion was large, and all of the ingredients were fresh.  It was similar for my family.  Large portions and good food.  The hot and sour soup was excellent.  I even found a tiny shrimp in it, which was a first for me.  Don't know if that was an accident, or if it was supposed to be there.The biggest disappointment was the crab rangoon.  This is a BIG downer for me, and the reason I am only giving 4 stars.  They should have called it Sour Cream Rangoon as the crab was non-existant and I did not enjoy it.  It was very similar to what you would find at Hy-Vee chinese.  So I am stuck in a quandry.  Do I go back for the large portions and the shrimp toast which is as good as any place I have every had.  Or do I avoid because the family favorite of Crab Rangoon was poor.  Further investigation may be necessary.  I see they have free delivery, so I may have to give that a try.The decor in the restaurant itself was very stereotypical of a Chinese restaurant and that was exactly what I wanted.   Right down to the Chinese New Year placemats and complimentary hot tea.  I see no reason to avoid this place unless you, like me, prefer crab in your rangoon."], ["Dania G.", "When we called the restaurant for a delivery since we haven't eaten there for a while since the last time we were there inside one of our soups was like a used napkin (it was disgusting and they kept saying it was one of our napkins but we haven't even touched the food since it just got there). But we decided to give it another try but the guy was VERY rude. He gave us attitude and was just plain rude so we canceled our order. We do not plan on going back. The food was always cold and some didn't even have flavor anyways. I do not recommend this restaurant AT ALL!"], ["Angie W.", "This is my go-to Chinese restaurant in Lincoln. The owner remembers me and what I order every single time... and I don't go there that regularly, maybe once every few months. The service is super fast, and I really like that they have a children's option; I find this to be very rare at Chinese restaurants. The Mongolian Beef is my favorite dish, but sometimes the meat is tougher than others. When it's tender, it is amazing. When it's not, it's still good."], ["Rumil B.", "Pretty dang good! It's in the top 3 for my favorite Chinese in Lincoln along with Shen Cafe and Mr. Hui's. It's close to my work so I may come here more often. The decor inside is typical sit-down Chinese restaurant. The food is reasonably priced with generous portions. The service is friendly and the restaurant wasn't too loud or anything. The only thing that kept it from getting 5 stars was the lack of a wow factor.Sorry this is kind of a boring review, but overall this place is a really solid choice to get Chinese food in Lincoln."], ["Aaron O.", "Excellent food and excellent value for the money. The Crab Rangoon is great, and I can't stray away from the peanut butter chicken."], ["Amanda L.", "This is by far the best Chinese in Lincoln and the surrounding area. Best I have ever had actually. I love the people that work here and run this business as they are always so kind. Very affordable, healthy, and just all together yummy! I always recommend this to family and friends. I will admit, the building could use some updating, especially on the outside. But it is so good! Support local! Way better than Panda Express! And not far from Downtown!"], ["cody c.", "Wow!  I'm astonished by the quality of the food here.  I'm from California, so there are lots of great quality Chinese food in the area.  I never thought I would find one in Linoln, NE.  The food is not salty and the staff is friendly.  No recyling of left over food here.  Dishes comes in a timely manner and I actually likes the Chinese accents of the waitress.  Adds cuteness to a Chinese restaurant."], ["Weston J.", "Cheap and fast.So fast I didn't know what to do with the rest of my lunch break.Check out their motto on the front of the menu, it's lengthy and uses made up words. Props to them."], ["Norman K.", "Golden Wok is a favorite. Family owned & operated, I am always happy to spend my money knowing I am supporting a local business.PROSLunch & dinner specials are fantastic. Food portions & quality are excellent for affordable prices. Dining area is clean & pleasant. Drive thru. Delivery. Open until 10:00 pm.CONSWait staff's accent, I have noticed amongst other customers, can sometimes make special requests a little bit more time consuming.CONCLUSIONHighly recommended. As you become a regular, you will begin to recognize other regulars, as well."], ["Amanda B.", "I'm always satisfied when I eat here. They offer large portions, good lunch specials, & complete dinner combos. I like to get soup & appetizers with my meal & they give you the option to add them to your entree for a fair price.Good family run service.One of the few reliable Chinese restaurants in town!"], ["Mallory C.", "Absolutely love this place! Best hot and sour soup in town!"], ["Jennifer G.", "I absolutely love the food here! I am not very adventurous and usually get the sweet and sour chicken or the cashew chicken, which both come with crab rangoon. Both meals are consistently hot, fresh, and tasty.  The ordering process is fast and the staff is friendly.  You get quite a bit for your money and if you don't want to go to them, their deilvery area must be fairly large, because I've had it delivered before and I don't live that close. I highly recommend this restaurant!"], ["trevor c.", "Always been my favorite Chinese restaurant. Their lunch specials that they run are very cheap with big portions. My favorite is the Hot Braised Pork and Princess Beef, both extra spicy."], ["Gail F.", "This is my favorite place for cheap eats and the added convenience of a drive thru window.  Their lunch menu is cheap and filling. Tso's Chicken is good and I like a lot of their tofu dishes. For dinner I like to order their Shrimp with Golden Tile, a great shrimp and fried tofu combo. Alas, you can't order this item at the drive thru but you can always call in your order for pickup or delivery.  Their pan fried dumplings are a wonderful appetizer and their hot and sour soup is good too."]], "Golden China Restaurant": [["kristen m.", "I'm a picky eater for sure and this place is pretty awesome as far as Chinese takeout goes. Not salty, or greasy but instead full of flavor. Best part is chicken isn't mystery meat and the veggie options have LOTS of veggies. My only issue is no brown rice and the egg rolls leave something to be desired."], ["Joe J.", "Been coming back for years,by far the best general tso's chicken I've ever had. Everything on the menu is great and you most likely won't be disappointed with the food,We couldn't have asked for better service. Complimentary cake,and to-go boxes without even having to ask, a great place not just to grab a bite to eat, but to have an experience"], ["Lisa S.", "For a take out, this is great, very unique flavors that I haven't had anywhere else.love the crab rangoons  and beef with broccoli. large portion for a good price."], ["Melissa S.", "Love this place! The food is standard Chinese, but its the only restaurant I've found with delivery and a decent website to order from. Their staff is so friendly and helpful! One time my car quit on me as I was picking up dinner and they came out to see if I was OK, offered to help with my vehicle and even offered to take me home! The restaurant is clean and well kept. I wouldn't call it 5 star dining but the staff makes this place wonderful!"], ["Ai C.", "Great food!!! We ordered the family of 4 special! A lot of food for under $10 a person! Delivered in less than 30 mins. WAY better than Mings Palace on N Cotner! We will definitely be ordering again! The Chicken chow mein was delish and my husband thoroughly enjoyed the Orange Chicken! Kiddos love the sweet and sour chicken! :) Feed our family of 8 very well and we even have left overs!"], ["Patsy M.", "Small portions but good taste. Husband had lots of celery in his dish. Fried rice looked more like white rice that had food coloring to make it yellow. Bathroom light kept going off n on and no paper towels. Offered plastic forks. Won't be back sad to say.  Good location."], ["Andy R.", "Good food, good portions, good price. Take out is super fast, staff is very friendly."], ["Scott B.", "Passing thru Lincoln, we found this nice little Chinese restaurant, of all places, in the middle of the vast state of Nebraska. The food was all pretty darn good albeit some items were a tiny bit too salty for me, but compared to what I am used to in Chicago, would be your regular run of the mill restaurant. Still worth a stop if your hungry."], ["Bradley R.", "Pretty typical \"Chinese\" fare.   I've been there twice; I'll probably go again because it's close."], ["Eric K.", "Crab Rangoon..... Best in Lincoln."], ["Karl G.", "For its price, perhaps the best Chinese restaurantin Lincoln, comparable to Great Wall on 70thStreet. Every Wednesday, they offer a \"second dishat half price\" deal (as does Great Wall). You caneat in or order out, the bulk of theirbusiness. If you eat in, the ambiance issimple. You get actual plates (but also soup andwater served in styrofoam), and the portions aremore then ample. Some Chinese restaurants pile onmeat to the exclusion of vegetables, but notGolden China. The food is well-prepared and spicy,with interesting sauces. Instead of dull whitesteamed rice, they serve fluffy yellow friedrice. Each $7 dinner entree comes with choice ofsoup or egg roll--more than enough for the eveningmeal. We sat underneath the TV but could easilycarry on our conversation without raising ourvoices.If you like Chinese food, it's well worth a visit."], ["kate w.", "Golden China specializes in Cantonese, Szechuan & Hunan style dishes.  Not sure which region our dishes were from but they were good.   Golden China uses fresh vegetables and flavorful sauces. We tried broccoli chicken, beef low mein and sesame tofu.  No sacrifice to go veggie here.  The sesame tofu was made with cubes of tofu crisply fried & covered with a slightly sweet/tangy brown sauce.  I'm pretty calm now but it was exciting to try something out of the ordinary and so good.  If you are looking for healthy items there are several low fat platters on the menu that are steamed instead of sauteed in oil.  The order of 6 steamed dumplings ($4.95) didn't look like anything you'd find at my grandma's house but they were delicious. The little pillows are filled with seasoned meat and come with a special soy based sauce.  Golden China is a small restaurant with 6 or 7 booths and about as many tables.  The TV was loud but luckily someone turned it off as more customers came in.  The furnishings are all new and a little nicer than the standard formica tables. The plates and utensils were a mix of real plates, styrofoam, plastic forks and chopsticks.  We ordered off the menu while seated but we had to retrieve our own utensils and glasses of water.  We suspected because the owner's young daughter is still learning to be a server. They don't bring you a bill, pay at the counter as you leave.  Dinners are $6 to $8 with shrimp dishes around $9. Pretty fair considering the quality and portions.   Lunch special are $5 and include fried rice, egg roll, or soup.You might need help finding Golden China.  It's set off from North 84th St. on the west side.  In a strip of shops about a block North of Hy-Vee.  Lucky for you it's right next to Eileen's Cookies."], ["delwin y.", "I came here for a late lunch/early dinner and was pleasantly surprised.It is a little out of the place, but it's enjoyable mainly because they do everything to order while allowing for takeout.Service is difficult to comment on as I was the only eater at the time so they were quite prompt and quick in getting my meal together.That said however although they do things to order it still is Americanized Chinese food which may or may not influence other peoples decisions.I had ended up having the Chicken w/ Cashew Nuts and it was quite nicely done.  The pieces were cut nicely and the vegetables were fresh.Based on this single dish I would return if I had a craving for Americanized Chinese food though it's hard to stand out doing Americanized Chinese Food.  That said it felt like they did pretty well and didn't go too heavy on the grease or being too salty which is a common problem with Americanized Chinese in general.Decor is not very amazing, but I wasn't expecting too much.In short I would return in a fix, but it wouldn't necessarily be a high pick for food choices unless the category was limited to Americanized Chinese."]], "Highlands Great Wall": [["Cartman B.", "Today I had the amazing general tsao chicken. It was amazing in its sauce. Even though vegetables aren't my favorite food usually. It was Spectacular. This is the place to go."], ["Genevieve W.", "Love the great wall they have some of the best Chinese food I have ever eaten!!! Portions leave you never leaving hungry and if you do it'd your own fault. Crabrangoon is the bomb. But you have to get their wonton soup!!! Then again I have never had anything bad there and when I lived I. Lincoln I ate here a TON!!! A must go to!!!Prices are also really reasonable especially with the amount of food you get!!!"], ["Doug S.", "This is an update of my last review for the simple reason that they pissed me off.  They have a promotion that says show us your \"Yelp\" review and get a free order of crab rangoon.  I showed the girl at the cash register and she said that it wasn't a new review and said, \"No soup for you!\" err crab rangoon.  WTF?  It was a review and a five star one I might add.  But not anymore, as much as I enjoy their food, I will not be back, it's the principle damn it.  \"One star for you!\""], ["Bev T.", "If you are looking for an inexpensive meal in a hurry, this is the place to go. The portion sizes are large. You can dine in, take out, call ahead and pick-up. Food is always hot and always fast, not to mention tasty. My husband loves their combination plates, especially the garlic chicken. My recommendation, however, is to try the soups. My go to favorite is the wonton soup, but the house special soup is also wonderfully light and delicious. I have also heard other customers rave about the hot & sour soup, although I have not yet tried that one myself."], ["Steven T.", "For hands down the best Chinese take out in Lincoln the Highlands Great Wall is the place to be.I have traveled to the orient and have tasted the food and this is the closest I have found. It is always fresh, full of flavor, and plenty of it. There is no buffet but has a clean dine in area and the smells are absolutely free! The wonton soup is the best I have found in Lincoln. The wontons are huge and the broth is refreshing.I highly recommend this restraunt for the whole family because there is something on the menu for everyone."], ["Caden Z.", "Highlands Great Wall has really tasty Chinese food, and the portions are pretty generous. The cost isn't bad, but a little higher than what I'm used to (~$35 for two, delivery).My girlfriend had a real struggle trying to order over the phone, something of a language barrier. They had to get someone else on their end to complete our order.Overall, not bad. Worth checking out."], ["Elmo J.", "One of the best in town.  Food is always fresh, place is clean and the staff are friendly.  The owner has an award winning history for naming Chinese dishes and this place is a must try.  I like the General Tso chickens."], ["Jenn N.", "The best Chinese (American style) in town!    Clean and fast.  Great service and great food."], ["Don M.", "For the life of me, I have never understood why everyone raves about this place.   Their rice is YELLOW!?  What is up with that?  Most of their dishes are bland and they remind me very much of chinese that you would get from a mall.   I will say that the egg rolls are good, the portions are large, and the price is relatively inexpensive.   I can see why someone who lives in the Highlands would eat here for convenience sake, but why anyone would drive across town to eat here is beyond me.  If you like authentic Chinese food, this isn't the place for you.  If you like the kind of chinese you find at the mall, then by all means, strap on the feed bag and enjoy."], ["Michael C.", "Best \"Americanized\" Chinese I've found in Lincoln. Tastes great. Large portions. Tastes fresh. Egg Drop Soup is the best!"], ["M M.", "Favorite quick Chinese place I've found yet.Ever since discovering this place...this is the go to for when we're craving Chinese.We usually call it in for pick up.HUGE servings for a great price.Definitely recommend."], ["A L.", "This place is slimy and currently is bribing customers for a yelp review (show us your yelp review, get a free order of crab Rangoons). On Husker game days, they park their truck on the corner of Highway 34-nowhere near their property-just to get free advertising. So seriously unethical. And not very customer-oriented either. NO FREE FORTUNE COOKIES!!  One time, I went there for a promo that starts at 5 p.m. It was 4:55 and they wouldn't give me it (at least, until I started to leave, but by that time it was too late). You can't substitute steamed rice for fried rice on their lunch deals.That said, they don't have horrible food. Sure, their crab rangoons have basically no crab in them and are pretty much fried cream cheese, and more than once I've been disappointed by the chewiness from overcooked general's tso's chicken. But for $6 for their lunch deals, you could do worse. If you can overlook sometimes bad customer service and slimy business practices."], ["Fazle H.", "Everyday american chinese food, its fine if your not in the mood to cook our just have a craving to eat greasy food"], ["Foe M.", "One of the best chinese restauravs in Lincoln. The food was tasty, good portion size, and friendly staff."], ["Zach B.", "This is my go-to Chinese take-out place. I can't speak for all of their dishes but they are usually very good and tasty. I enjoy general's chicken the most. My least favorite is the cashew chicken. I find it's way too sweet and there is way too much celery. You will get a lot of food for a good price. I'm almost positive that you get more food if you dine in at the restaurant. Enough leftovers for 2 more meals. The restaurant itself is small. Most people get carry out. Be prepared for a little wait. They get very busy on the weekends. It is worth your time and money though."], ["Larry W.", "Great food for a good price with plenty for leftovers. The hot & sour soup is outstanding as well as the crab rangoon. Fast delivery but there is a $20 minimum."], ["Christa C.", "I love this place.  I've tried about 10 different things here and they are always amazing.  The price is REALLY good for the amount of food you get.  The only bad thing is that they get extremely busy around dinner time so you have to be prepared to wait for you food.  Not their fault they're popular and I'm willing to wait for the yummy food, plus you can call in your order if you don't want to wait."], ["Julie D.", "Super quick Chinese food.  I had sweet and sour chicken.  Fast service, you can easily come here on your lunch hour.  Plus, you will have enough food left over for at least a couple more meals!"]], "Ming's House": [["Elisabeth E.", "I've gotten take out from this place a couple times this last month. The restaurant itself is right off Cotner and is pretty small. The family is very friendly and I've spoken to the daughter a couple times and she's been able to explain to me what I can have that's gluten free. I usually get the cashew chicken and a shrimp and broccoli with white sauce made with cornstarch. This sauce isn't as great as the soy sauce based ones but in most Chinese restaurants the soy sauce contains gluten. The vegetables and meat always taste fresh and are prepared well. At dinner you can also get a 2 liter soda for free when you dine in or get take out. My BF usually gets the generals chicken and crab rangoons and says everything's good.Price is very reasonable and I've always been happy with the quality of the food and the service. Once I ordered delivery from metro dining and the driver forgot to emphasize gf, so it arrived with the soy based sauce. When I called them they gladly remade my dishes at no cost! Very amiable of them. I definitely recommend giving it a try."], ["Renee S.", "Our go-to Chinese in town. Best sauces in town to accompany their many delicious dishes"], ["Jacob G.", "The best voted Chinese in Lincoln, and for a good reason. Lunch is great; they have a $5 special that is huge portions and includes a drink. The usual pick up time is 10 minutes and is always super hot and fresh!"], ["Spencer W.", "Ordered take out.  Food was pretty good. Portions were very large.  The General Tso is not too spicy,  but the fried rice couldn't be more bland.  I would come back or order delivery but would avoid the fried rice."], ["Jose B.", "This place is amazing, they're general sao's is so legit it ain't even funny. The crab Rangoons are something from another world. The staff is so awesome and friendly. If I was to pick one food to eat daily for the rest of my life I would pick MINGS house's General sao's crab Rangoon on the side. #ALLDAYERRRRRRDAY"], ["Patsy M.", "This has happened twice now. When they let the kids help when they are busy is bad!!  The young girl does not ring the orders up right and when you tell them the workers don't understand what you are saying then walk away shaking their heads yes but don't fix the problem. The young boy hates cleaning off the tables and lets you know so.  Have had cold food and not a variety of veggies. Wish I could find some where else to go in same area to go. Hope they read this and improve."], ["Timothy P.", "We fell in love with Ming's when we lived down the street from them.  Since then we have moved across town and continue to go there on a regular basis."], ["Wyn R.", "Easily the best crab rangoon to be had at a restaurant. Great food, great value! Might have to go tomorrow!"], ["Adrian B.", "Tucked in between the mediocrity of Americanized Midwest Chinese food is this little gem of a restaurant.  Family owned with no frills and good quality hearty sized dishes.  A phenomenal selection with hand made Crab Rangoon's the size of large crab claws and 'hot & spicy' dishes which are actually spicy!  This restaurant has won my heart for takeout Chinese here in Lincoln.  I drive 20 minutes across town once a week for my ritualistic feasting.  Once in a while they go a little crazy with the onions but for the most part and for the price it's fantastic.  The Hot & Sour Soup is dark and savory crammed with teaming meat and fortifying tofu.  I tend to stick to the dinner meals and not the cheaper lunch specials.  I would recommend the Schezwan Chicken, Hot & Spicy BBQ Pork and the Mongolian Pork.  The Spring Rolls are the only ones I've ever enjoyed and are also hand made.  The portions are massive for takeout and guarantee at least another meal if not two.I would at the least give the restaurant a try if your looking for some fast food and don't want the mall style cuisine that dominates Lincoln's Asian fare."], ["Jordan L.", "Awesome spot! It's probably one of my favorite Chinese places in Lincoln"], ["Ai C.", "Wasn't the best in town but definitely not the worst! Free 2 liter w/ order over $25 which was a surprising addition to our meal. For some reason the left overs tasted better than when we ate the food fresh. Definitely a trial and error place for food you like."], ["Morgan H.", "Good Chinese food. Not the best ever but definitely good food. I have dined here several times and the quantity of food can easily feed you for two meals. A pepper by the Kung Pao actually came out spicy and that never happens anywhere! Good flavor in the sauces and a good balance of veggies and meat. The crab Rangoon are great too!"], ["David M.", "was not that impressive.... average at best. there are far better Asian places in Lincoln, sorry to say this isn't one of them. Fortune Palace is worth the drive no mater how far away it is."], ["Rose R.", "Awesome food and really affordable! Plus the take out doesn't fall apart and leak all over like a lot of Chinese take out does!"], ["John M.", "Perhaps Lincoln's best Chinese food tucked away in a small strip mall in the Bethany neighborhood. Too good to be true? Think again. Ming's House is the place to go for fast, great tasting Chinese food at the right price. Most entrees run in the neighborhood of $7, about average. However, you receive both quality and quantity for your money here, not always the easiest thing to find. It's all made fresh and served piping hot. The General Tso's chicken is a personal favorite.If the food doesn't already make this a five-star venue, convenience does. While Ming's doesn't really have much of an inside dining area (half a dozen tables), the ability to phone in orders makes it great for people on the go. Expect a wait time of 10 to 15 minutes during non-peak hours and slightly longer during lunch and dinner rushes. Totally worth the wait.The Lincoln market is quite saturated with Chinese restaurants, which can make it difficult to pick and choose. Ming's is a premier small business in this community ran by a family that clearly knows what they are doing. If you're in the mood for Chinese food, look no further."], ["Adam L.", "This is a great little Chinese restaurant!  Very quick service with huge portions.   The lunch menu includes a can of soda and had enough food for easily two people.   The crab rangoon was probably the best I've had.   The seating is pretty limited but there was a constant line of take out orders leaving."], ["Katy P.", "Great Chinese! They make crab rangoon how I make it at home, packed with crab and tons of flavor. The egg rolls are great too, the cabbage tastes fresh and crunchy. I've liked everything I've tried. The only thing I was disappointed in was the fried rice, but I just won't order it, leaves room for everything else!"], ["Tyler D.", "They told me 15 minutes. I've been standing here for 40.  And I have things to do. Take that into consideration when ordering. Im not sure the food is worth waiting that long."], ["Jeff C.", "Chefs specials are a frikin joke. Chow Mein Fun. what a crap value. several pieces of shrimp, and a plate sky high of noodles. If I wanted nothing but noodles I would have went and bought some ramen. Used to really like this place, but as of now I will go elsewhere."], ["Bo O.", "Hands down Lincoln's best non-buffet Chinese restaurant. Located in small Picadilly Square, Ming's House hides in the plaza only those truly desiring amazing Chinese can handle. Be warned: if you have an addictive personality, I'd stay away from here. Their crab rangoons will make you slap your mama. And if you don't have a mom, it'll make you get married, have Ming's House cater, then you can slap your mother-in-law instead. Hard working family who's always thankful for your patronage is just icing on the cake."], ["Michael A.", "it was good, had the Chow Mei Fun"], ["Ryan H.", "Good menu, prices are good, but it's an average chinese place. I wasn't impressed at all with the house special chicken, it was too much like orange chicken and I barely ate it.  Their house special fried rice was good though.  Their portions were very large. I think there are other good things on their menu. Part of what I ordered was good and part wasn't. So if I was in the area longer I would've gone back to try other things."], ["Brian H.", "Everyone rants and raves over Ming's.   I have to completely disagree, the meal today was terrible.  Pepper steak with onions and peppers had no flavor, 5% steak.   My wife's chicken fried rice was not her favorite either. We will continue our search for good Chinese in Lincoln."], ["Eric N.", "If you like Chinese food and are on a budget this place is for you.  Their food is always outstanding and for $20 my wife, kid and I are stuffed with leftovers to boot!  The woman who works there (must never take a day off because she is always there when I go in) is always super nice and helpful.The only way this place could be any better is if they delivered because I am lazy, I admit it, but it is worth the drive from my house for the quality.  I have never been told any more than 15 minutes for my order to be ready to be picked up.  When I first started going there it seemed like nobody had discovered this hidden gem but now they are booming.  Good luck to the owners as they definately deserve it.  If you haven't tried this place it is definately worth taking a look at if you are craving some chinese."], ["John C.", "Outstanding entrées. House fried rice is awesome. Chicken wings the best. Crab Rangoon excellent. The Sea Food Delight is better than anything served at P.F. Changs. Wonderful gracious hosts."], ["Tim V.", "Ming's House is one of the best Chinese restaurants in my side of Lincoln, Nebraska, which is in the Northeast area of Lincoln.  Their Crab Ragoons are big and thick, their steamed rice is good, and their Chicken entries are delicious.Ever need a place to order in some take-outs when it comes to Chinese food, Ming's House is a great place order and/or to dine in."], ["Malia M.", "Honestly terrible. Worst I've ever had."], ["Dave R.", "I've always been searching for the best Chinese place in Lincoln, but I've finally found it less than a mile away. It's really hard to beat the value and price that Ming's House offers. I can reliably split my meal into a two portions, one for now and one for later.They have a long list of specials that only cost $4.59 plus a free appetizer and can of pop for lunch. The same dinner special is only $6.25. And the rest of their 'regular' entries are not much more with even larger portions.The service is great and always helpful. Ordering takeout has always been fast, never more than 10 minutes until it's ready. This place has been getting busier and gaining lots of loyal customers, myself included. It's not hard to see why!"], ["Audrey F.", "I went to Mings on a Monday night because my favorite place at the Highland's is closed on Monday night. What a mistake. The crab ragoons were gross tasting, and so was the sesame Shrimp. The sauce that went with the sesame shrimp stunk before I even had the sack opened. I will never go back. You also get twice as much food at the great wall at the highlands."], ["Joel L.", "Don't go to Ming's house expecting white table cloths, wine lists, and fancy dining.Do go, however, if you are in need of some very tasty Chinese food. The place is small, and only has a few tables. You order at the counter from a menu that is huge. All the usual American Chinese suspects are present, as are a few other more random choices. You can see into the kitchen from the counter, and as opposed to most other fast chinese places in town, this is a positive. They are clean, and the lady who runs the register is always happy and polite.For a little over $5, you get rice, your entree, a soda, and an appetizer. Dinner isn't that much more expensive. The food is very fast, and very good. You get a lot of food for lunch, and you get a ton of food for dinner.Pros: Fast. Friendly. Cheap. Tasty. CleanCons: Small. Can get crowded.  A little out of the way for me.Tip: Late lunch or early dinner means you'll be stuffed for the rest of the day."], ["Pamela H.", "I have lived in Lincoln my whole life and have tried everything from Golden Wok, to china buffet to HyVee's Chinese, but Mings tops them all. Delicious, fast(but not to fast), huge portions, there is nothing about this place I didn't enjoy. And just as a treat to you if you spend 20 bucks you get a free 2liter! This is my go to place now for chinese food, always!"], ["Ben L.", "I couldn't ask for more from a Chinese take-out restaurant.  It's tucked away in a little strip mall, but there are always people eating there.  There aren't many tables, but we always get it to go and enjoy it at home.The portions are huge and a fantastic value.  Go with the combination dinner and you have enough food for 2 or more meals for just over six bucks.  Spend over $20 and you get a free 2 liter bottle of pop.  Lunch is a great deal too at around $4.50.I've tried quite a few different items from their large menu and have found plenty of things I like and a few favorites that I fall back on regularly.  The appetizers are all good, the soups are a steal for the price and the staff is very friendly and polite.  It has become our go-to Chinese takeout place and we'll be happily eating there for years to come."], ["Kyla B.", "Amazing food at a great price! Definately recommend it. Not a lot of seating but great customer service."]], "Shen Cafe": [["Kristen M.", "Overall I had a great experience here. I have a special place in my heart for a local Chinese restaurant from my hometown and since I moved to Lincoln it has been difficult to find good places that compare in lincoln. This was previously Windchimes and I also remember that being a good place. The atmosphere here was great, some nice remodeling was done. I got the spiced chicken curry, and chose to have it blazing. Next time I will choose on fire because it was not hot enough, but I have a high tolerance for spice. If you can handle a lot of spice, I recommend going straight for the on fire option. Prices were reasonable and good portions for the amount you get. It is also nice that you can add sides for $2 including a soup, egg roll or crag Rangoon. The hot and sour soup was also very good. Service was good, we had a larger group and the waiter kept coming back to make sure everyone in our party had what they needed. I would come back to this place to try other things on the menu. 4.5 stars only because i cannot rate it higher than Hunans in Hastings."], ["Charles L.", "UPDATE - Now a month later. Have orderd take out 3 times since last review. The first 2 had no issues. Last night ordered same thing we always order... sweet & sout tofu blazing, almond tofu blazing and an extra side of white rice. Popped over to pick it up around 8PM. Again, the girl handling the front counter could not be more unfriendly and as always seemd bothered that I even came in. The restaurant was completely empty so the kitchen was by no means slammed.Got the food home and opened it and the sweet and sour tofu was some other tofu with some brown sauce. My wife tried her almond tofu and it was not blazing spice. I ran the food back to get it fixed.Got there and it seemed like the owners were having dinner in the front. I say this as I found out later that they were such. The unfriendly girl went and got the manager (I think owner as well and son of the people having the meal up front). I showed him my receipt clearly stated our order and showed him the food. He was VERY apologetic about the issue. I relayed that my orders are routinely not correct and that we do love the food but that the consistency is really a downer and influences our frequency. He spoke to the people eating and identified that his father made the order and he sometimes does not check tickets clearly and that they would fix the issue. He refunded my bill in full and made new orders for us. He gave us the old food to take too. I feel he did 100% the right thing and was attentive to the issue. Got home and found he had put in 2 Ragoons. A nice gesture. However as my wife and I are vegetarians and they had crab in them we could not eat but still a nice token.I have not raised my score on Shen's. I still see some room for improvement. The food is great. Consistency is not. The front of house could not be more detached from their customers. The unfriendly girl sat behind the counter on her phone and sipping through a straw during the whole discussion I had with the owner about my order and while I waited for the corrected food.Shen's... we appreciated your help with the issues but it would be even better if such was corrected and prevented going forward."], ["Rachel P.", "After reading other reviews I was a little nervous about going here. Numerous people said the female staff was rude but the food was good so I thought \"why not try it for myself.\" I like to form my own opinions. I am pleased to say that I really enjoyed this place. I am guessing they got rid of the grouchy female because the staff was very friendly from the moment we walked in. The menu is listed right on the wall and it's very easy to navigate. The food was delicious. The veggies were fresh and cooked perfectly so they still had a bit of crunch; no mushy veggies here! The portions were also large enough that I got two meals out of my order; Kung Pow Shrimp and Lettuce Wraps. I love that they have organic and gluten free options. I also had the Thai black tea, which was made fresh and took about 5-10 minutes, but it was worth the wait!! It was like a dessert in a glass. I also like that they have smaller side options. It makes it much easier to try multiple items, without having to spend a lot of money. I will be going back!"], ["Elisabeth E.", "First off its nice to find a place with gluten free chinese food. Since I've been gluten free, chinese food has been difficult to come by. Many places either just are not sure about the gluten free status of their dishes or its just a no based on all the sauces. Shen cafe has which sauces are gluten free right on their menu board so its very simple to navigate. You walk in and the atmosphere has a modern feel to it with energizing colors. I haven't been in when its been too busy yet so I've been able to order quickly and food comes promptly. Once I ate there and another time I got take out. I've been pleased with the food both times. You can choose your meat, vegetables and then the sauce you want, so rather than there being a menu with specific dishes it is a make your own combination type of place. They also have loose tea which I love. Both times I've eaten here I haven't gotten sick afterwards so thats a pretty good sign that their gluten free status is legit and cross contamination must be pretty well controlled.  Food is also pretty affordable and portion sizes are good. I definitely think this is a nice Chinese place in Lincoln and certainly a great place for anyone trying to avoid gluten. Sadly my favorite Chinese food items are still off limits."], ["Sarah K.", "The interior looks nice.  We were expecting the food to be good, and it looked good when we received it.  However, the sauce was not good on either of our dishes.  It tasted very salty and kind of off, like it was a premade sauce.  This is a shame because I like the concept and the vegetables and meat appeared to be of good quality.  The sauce really ruined it for us though and neither of us finished our meals.  In sum, there are other options in the area for Asian food that do the sauce right."], ["Jeffrey D.", "Not bad and close to where I live.  My wife picked up some food here and it was ok.  I am not a huge Chinese food fan so it does take a considerable amount of work to impress me.  The price is good and the food is good.  We got takeout so the service doesn't really apply here."], ["Ellen P.", "I saw the Shen Cafe from the outside and thought it looked interesting and that it may be more than just typical generic Chinese food.  I was wrong. I got the Gengis Beef with fried rice and while the meat and onions weren't too bad, the fried rice was bland as hell.  Picture cold rice with some soy sauce on it, and that's the rice.  But the strangest thing was the addition of weird freeze dried rice puffs that looked like mini packing peanuts.  It was beyond bizarre and I have no idea why they were on my plate.  The crab rangoons were way too sweet and the egg roll just tasted greasy and bland.The inside is really pretty, which is the only reason it gets two stars.  However, the men's bathroom was apparently appalling, so there's that.  Basically, if you want good Chinese, you're better off going across the street to HyVee."], ["Blake H.", "Good food, but a very unfriendly staff. They make the restaurant just as much as the food does."], ["David N.", "Good food, plenty of seating, quick service, very friendly staff. I came here after leaving hungry from the China House. Here I ordered sweet n sour chicken  and some other chicken, that was served up looking like General's chicken. Whatever,  I was hungry."], ["Rumil B.", "Good news: I still love it! Bad news: now I am always torn about what to get since I've tried so many things on the menu and I like them. The biggest shame is that I didn't try the lettuce wraps sooner because they are so delicious."], ["jane s.", "Tried this place twice now. Not impressed. Had the veggie fried rice and eggrolls, as well as the tofu in sweet and sour sauce. Food was very bland. It was a carry out order and they didn't include any utensils, napkins, or sauce in the bag, and one side was brown rice instead of the fried rice I ordered. The only upside was the milk tea: fresh brewed and very sweet, just like it is in Asia. I would only come back for the tea."], ["Adam L.", "Works kinda like Chipotle, pick Ur ingredients but its on a Shiney board so it's hard to read. We got ours to go, it was past 8. Sauce was too thick and was overly salty, the price is cheap and they give you more rice than meat (I'm Asian but I still prefer meat over rice). Soup is not good,  tastes like it's from out of a can or made from powder."], ["John W.", "Service was fantastic and food was great. Some of the freshest Chinese my wife and I have had. Ordered the mix of shrimp, beef, and chicken with Szechuan sauce. My wife got Kung Pao shrimp. Both were delicious. On our way out we each got bubble tea - was the best we've had. Tea is brewed fresh for each order and it isn't too sweet. Great way to finish the meal. We'd recommend the Thai black tea. Peter is a recent grad from UNL who started this restaurant with his family. He's got a great, modern vision for where Chinese food can go. Great addition to Lincoln's restaurants."], ["Brandon D.", "Went in and got dinner to-go. Very friendly and the place is clean. Makes me want to go dine-in next time. Food was great!"], ["Luke V.", "Nice place really close to me i never knew about.  Clean,  comfortable dining, friendly service and really good boba and thai tea."], ["Matthew R.", "Oooooo......it's so swanky in here. Feels upscale yet all their meals are under $10.  Did I mention how swanky it is."], ["Sherry S.", "This place is Chinese in the Chipotle model. Choose your meat, your sauce, your rice, then add extras like soup, egg roll or won ton. The also have bowls of lo mein or rice. Everything is made after you order. Egg roll was Just out of the fryer. Too hot too eat. The hot & sour soup was brothy not gelatinous like most Chinese places.I got the Ghengis Kahn steak and made it Blazing. Steak was really tender and the sauce a little sweet. Spouse got veggies in Shen Sauce.  Shen is yummy brown sauce with a hint of ginger. Good value.  Three courses for each of us for $25. The have beer too. Try it!"], ["Avery M.", "Quick lunch with good fast Chinese food. A build your own style menu, you get choice of protein, sauce and sides. Great deal with the two for two giving you multiple choices for sides at two bucks.Friendly owners with a great concept and vision for something unique. Strong offering back to the community with donations to local charities.My companion changed his order to what I had and they had to resubmit the order. But they gave us the sesame chicken that was accidentally made in addition to the noodles.Owner said loyalty was important to him. I agree, excellent approach. Keep the food top quality and you will have a customer for life."], ["Liz K.", "Great fast casual. Great service. Sauces are interesting."], ["B. S.", "Awesome place.  Portions are good, prices are great and the staff here is super friendly.  This is one of the places you goto to feel like family.  Orange Chicken and Sweet N' Sour were some of the best I had."], ["Kayla W.", "I got a Thai Iced Tea, GPO with chicken and fried rice, and an eggroll. Loved the entrée, love the iced tea, was sorely disappointed with the eggroll. I'll return, it is a great atmosphere and it is nice to put together exactly what you want in terms of sauce, meat, etc. Not the biggest servings, but a fairly good value for the price."], ["Carla R.", "I tried this restaurant for the first time this last weekend. I got the Shen Mix with chicken and my friend got the Szechuan Bold with beef. We also got an order of crab rangoons, which were excellent. The vegetables and chicken in my dish were cooked very well--the veggies still had some crunch. However, I thought the sauce on my dish was way too salty, as did my friend on their dish. The food is delicious, though!"], ["M G.", "Recently i saw an ad for this place on campus, never saw an ad for it before so i think a lot of people were just hearing about it. Exceptional service. Definitely liked the food,  had chicken with the lemon sauce. Do try the dumplings. I only have one complaint, the owner's son (steven?). Thanks."], ["Jonelle M.", "This place was yummy!  When we came in we were happily greeted and were offered to have the menu explained to us which was a huge help.  The great thing is that you can customize your selection to get exactly what you want.  The food was fresh, the veggies cooked perfectly and the flavors delicious!  Download the PickIt app and you can score a free soda while also helping charity. I gave it 4 stars because I felt the servers who brought out the food could have been a little more professional, but overall it was a great experience and we will be back!"], ["Elaine C.", "My friend and I went to try this cafe.  Food was ok - no surprise.  The taste of the food reminded me of those of food courts.  Their style lets us pick the type of rice, the ingredients, the sauce etc.  But somehow the menu board doesn't explain too clearly so most of the customers in front of us (including us) had to further ask for details and that made ordering more time-consuming.  We ordered the broccoli mix with steak but the steak looked like just sliced beef, nothing like the steak shown on their photo."], ["Krislin G.", "Good food. Fresh ingredients. Menu is a bit confusing, but overall pleased with the experience. Dining area is clean and modern."]], "Rolling Wok": [["Chad T.", "This is our favorite place for Chinese food in town.  It is cash only which can make for a slight disruption at times but that is made up for by the quality of food, portion size, and accessibility to our home.  Each meal comes with two rangoons and tends to cost roughly 7 dollars per entrée.  I fell in love with the garlic pork and rank it above any other meal I have eaten in a Chinese place in town.  My wife wants me to promote the chicken fried rice."], ["Arnold F.", "Great food. Good flavoring on all the dishes. The portion sizes are great and the service is speedy. Good pic for Chinese for sure. They only take cash so be prepared"], ["Bruce D.", "We love the Rolling Wok for quick take out. My younger daughters like the honey shrimp (it is sweet enough) and my oldest daughter likes the veggie delight.  We always get the steamed rice.  They are fast and relatively cheap.  I can feed 5 for less than $25.  Note that they only take cash or local checks."], ["Madison N.", "I'm going to try to hold myself back from writing this review in caps, but THIS IS THE BEST CHINESE FOOD IN LINCOLN. I love me some Chinese food, so I've tried quite a few places. I always come back to rolling wok when I want food that I KNOW will be good. I always get Tso's chicken and it's always good and fresh and they have the food ready for us very promptly. They are also very friendly. My boyfriend and I have basically made this place a weekend ritual. Rolling wok and movies, priceless."], ["Rosa V.", "I've been going here for 20 years. The food is awesome, big portions, and tasty. My favorite dish when I was pregnant was the moo goo gai pan. Now I get tofu fried rice. Expect great service and hot delicious food."], ["Jane D.", "good food, will only take checks, a business should except cards/  they are ok to eat they deliver, not my first choice though.  Very clean, good prices, very prompt."], ["Alan W.", "The food here is really good. Tried their hot and sour soup for the first time tonight, and I relaly like it! Rick, who both took my phone order and delivered it, was very friendly and helpful! I am, just as the rating says, a fan of Rolling Wok!"], ["S a.", "Ditto to the comment that they will happily sub tofu on an entree, so broccoli + tofu w/peanut butter sauce is a standard for us.  As prev. reviewers have said: typical strip mall Chinese ambience, but kid friendly, fast, inexpensive. Oh, and they have vegetarian egg rolls, which is rare.  Fine dining? NO, but a reliable family stand by."], ["Shy C.", "Typical Chinese Food with typical chinese menu. What's good is that they can substitute any of the chicken or meat to tofu. I think this place is delicious, but I have to say they're food is VERY OILY! I feel like saying that is an understatement, it's VERY VERY VERY VERY VERY SUPER DUPER, RIDICULOUSLY, FATTENINGLY OILY!!!!!! I don't really like to eat here much, but my bf likes how they make \"Vegetable tofu with mongolian sauce\" which is the ONLY thing we order everytime we're there. Crab rangoons - no me gusta. It's very plain and not very satisfying. And the fortune cookies - eck! As soon as I taste it I spit it out of my mouth! :( Panda express has better ones.What i also didn't like is that because they close at 9:30, if you come at 9:15 they will make your order to go and won't let you sit because they want to clean up. I think that's very inconsiderate of your customers. On the good side, their service is very quick, they give a good amount of rice with the entree, and they deliver - but after 5pm. They don't take credit cards, so make sure you bring a local check or cash!Bottom line: I don't like coming here. The only reason is 'coz my bf does. I'd rather go to Panda Express or Hot Wok if I want inexpensive and quick Asian food."], ["Nikki B.", "Typical Chinese food for Lincoln, but above-average value.  Big portions, daily specials, & entrees come with fried rice & two crab rangoons.  They don't take credit cards (boo), but the service is typically pretty quick (yay).View their menu here:  vandornplaza.com/Rolling…"], ["Christina H.", "I really enjoy Rolling Wok. The employees and owners are very friendly, and the place is always clean. Their fried rice is just the way I like it, clumpy and delicious. I particularly recommend the hunan chicken."]], "Dat's Cuisine": [["Jim S.", "We had a late 2 PM lunch at DATs before going to a show at the Lied Center.   Wow, all three of us loved this small but nice restauraunt!  The food was so fresh and plentiful.  The prices where very good.  I had Plum Chicken with added vegetables, my wife had grilled chicken with vegetables (Teriyaki sauce).  Our friend had sweet & sour chicken plus vegetables.  We all raved and want to go back.  Came with egg-drop & crab soup (the only option) and two crab rangoons.  Both were wonderful.  The fried rice was good but not as remarkable.  The 99 cent oolong tea was very hot and in a large covered China cup.  All plates and bowls are blue on white china.  The staff was hard to understand, but they worked hard to please and we eventually got through the accent barrier.  Everything was very clean including the bathrooms. We all walked out of the restaurant saying \"I will be back\"!"], ["Jason V.", "Why eat at Panda Express when there is a local place with a huge menu and fresh food and large portions. I mean it's just Chinese food but it's better than Panda."], ["Don M.", "Dat's Cuisine provides exceptional Chinese/Vietnamese food at a reasonable prince.  The place may look a little but like a hole in the wall, but the food is fantastic.  My only complaint, at times, is the service.  The food comes out fast, but it doesn't come out together at a group.  So one person may get his food much later than others in your party.  But I've been numerous times and love the food."], ["Katie F.", "Large portions, but the food is not remarkable. Hole in the wall, the decoration is nonexistent, as is the atmosphere."], ["Alek Z.", "I give Dat's 2 stars based more on the service than the food. The lady who waited on us seemed nice enough, but was very inattentive. She didn't even ask my buddy what he wanted to drink. As for the food itself, it was decent. I've had better. It wasn't so much bland, just unmemorable. Tasty enough if you just need some Asian food, but you could probably find better in Lincoln.The prices were about right, maybe a little on the high side, but nothing major. For what I paid, I was decently full. The atmosphere's nice enough. Plenty of space, big-screen TV, etc.Overall, 2.5 stars might do this place more justice, but 3 just seems too generous."], ["Caden Z.", "Worth a try for Asian food, however the atmosphere and service left a little to be desired. Food came out quick which was good; probably since the restaurant was empty at the time surprisingly (~6pm)"], ["Courtney G.", "Reliable Chinese food close to campus.  Good vegetarian selection!"]], "China Inn": [["David Y.", "China Inn is one of my favorite Chinese restaurants in Nebraska. I've had a lot of dishes here and some of my favorites are:Crispy Chicken- Chinese style fried chicken with a slightly spicy/sweet sauce and cilantro. Wan Za- variety of seafood fried in spicy sauce.Green Beans- (sounds strange to have this here) Green beans with tiny pork bits. Always really fresh and delicious.For more Chinese-American dishes, their general tsos is solid as well. Everything is relatively cheap and the portion sizes are plentiful. Highly recommended."], ["Charles B.", "Authentic Chinese, mostly Hong Kong style. Be sure to ask for what veggies they have off the menu, e.g., mustard greens, abalone mushrooms. Spicy boiled beef w/ cabbage, bok choy w/ black mushrooms, and spicy eggplant are our favorite dishes. Often Allison, the owner, is handling the room by herself, so be patient."], ["Cheng J.", "Chinese food is good. The lady in the front desk is nice. The only negative thing is that light is too dark."], ["Todd H.", "Rangoon was good.  Kung Pao Chicken Flavor was okay but there was hardly any chicken in it and it was extremely greasy/oily.  Floor was filthy and from what I could see of the kitchen, it was as well with dirty dinner dishes stacked around.  Server was prompt and polite but they missed it on the food."], ["Mick B.", "Fun place to visit on a rainy night...provided it's 2001! Why is this place still open? Didn't that dysentery scare in 2003 ruin this place?"], ["Herb H.", "This is my favorite Chinese restaurant in town. Cheap ($5.95 lunch includes drink), order at the counter, fast, good taste, good amount, CANNED pop instead of fountain, which I think is a plus.Family owned I'm pretty sure. Nice people too."], ["Nathan C.", "Not just some of the worst Chinese food I've ever had -- probably the single worst dining experience of my life. Note the date of the reviews listed here. Years ago, China Inn was hands-down the best Chinese (Americanized and authentic) food in Lincoln. The line during lunch hours was nearly out the front door. No longer.Now, you can wander in right after noon and get any table you want with zero waiting. In other words, other people have figured out just how bad the food has gotten. Unfortunately for us, it took two visits in mid 2012 to figure it out for ourselves. On both visits the food was cold, poorly timed (one person got their food 10 minutes before the other on both occasions) and simply terrible. On the first visit I opted for one of the authentic Chinese dishes. Bland and tasteless. On our second visit, I thought I'd go the safe route -- there is no way in hell anyone can screw up sweet and sour shrimp, right? After 20 minutes of waiting in the empty restaurant (and listening to some confused, angry bickering in the kitchen) my dish finally appeared. And let me tell you, we could not get out of there fast enough. The fried rice was simply a glob of greasy brown rice reeking of peanut oil. I tried one bite cautiously and nearly spat it out. The shrimp was hardly fried with tons of watery breading slimed onto it. But I am nothing if not persistent. Seeing as how we were starving and in a rush, I figured I'd drown this nightmarish concoction in sweet/sour sauce and gulp it down. But China Inn has apparently fallen into such dire straits that they are watering down the sauce and even the spicy mustard. Both were literally soupy and tasteless, as if they'd been cut several times over with water. Upon seeing this, I shook my head at my wife and then headed to the counter. I told the woman that the food was terrible and that we wouldn't be paying for it. She apologized profusely (but without any surprise on her face at all) and we walked out. We loved China Inn during its heyday. Very sad to see it has fallen so far."], ["Foe M.", "The food was not tasty; not a good chinese restaurant. I tried the beef with garlic sauce and it was a disaster."], ["Joshua S.", "Best Chinese in Lincoln. Peanut butter chicken and four seasoned green beans are a staple every visit"], ["emily v.", "Upon entering, we found our way to a booth on the far end of the  restaurant. The dimly lit space was welcoming on a cold, wintry night. Light flashed through the ceiling fans as if a film noir was being shot; if only a man in a fedora and trench coat had been smoking in the booth behind us! In all seriousness, the food is great. Fresh, crunchy veggies and succulent meat. The chicken we ordered was fried crisp without the inch-thick breading that comes on most other Chinese-American restaurant's chicken. Noodles had a great pan scorch on them that gave extra flavor. We ordered our dishes extra spicy, and they had a fantastic balance of flavor (as opposed to the burning your palate without delivering a modicum of taste).On my radar for the next visit is the crispy duck. Be sure to check out the back page for tasty authentic treats.My husband and I ate our fill and the bill was under $15. Definitely one to put on your list."], ["Andy M.", "Absolutely THE BEST CHINESE in Lincoln. I was introduced to this place by friends years ago, and I still can't get enough. The location is unassuming and the decor is a bit \"hole in the wall,\" but the food is always great. This is not Chinese-American food like many people think of when they think \"Chinese\" (though those dishes are certainly available and great), but honest, authentic Chinese food.Some favorites for the less adventurous: Crispy Chicken (fried whole bone-in cutlets cut up and served in a sweet mild chili sauce), Peanut Butter Chicken (fried bite-size pieces).Moderately Adventurous favorites: Ma Po Tofu (spicy and flavorful with ground pork), Peking Duck (on Fridays and Saturdays), Stewed Fat Pork (pork belly in a sauce of pork fat and soy), Fish With Crispy Bean Sprouts....and my absolute favorites, for the true foodies: Salty Shrimp (eat head-on and shell-on, as they come), Spicy Intestines in Hot Pot (half tofu, half intestines, all delicious).Really, you can't go wrong with anything on the menu. Everything on the inside of the menu is traditional Chinese-American favorites you'd find on menus everywhere else in town. These are well-made renditions. But by far, my favorite dishes at China Inn come from the back page of House Specialties. Be adventurous and try one (or see my recommendations above)! I'm still working my way through the list - for the adventurous eater, you can't go wrong.Perhaps most importantly, YOU WILL FEEL GOOD HOURS AFTER YOU EAT THIS FOOD! I guarantee you can't say that about any other Chinese restaurant in town. Go ahead, take the challenge. They use restraint in their use of oil, salt, and starch, so the food is healthier and you feel better. My stomach is always happy when I leave, and this feeling continues throughout the day/night.Service is friendly (if a bit scatter-brained) and prices are incredibly reasonable: under $15/person for a great, filling meal with leftovers to take home. Meals are served family-style, so go with a group to experience the most variety. You seem to get bonus points for using chopsticks and ordering the more adventurous dishes - these things will only enhance your meal.I have introduced probably 20 people to this place in the last year. After you have a great meal, be sure to tell your friends and post another review on here. They could always use the business, and they deserve great success. If you have any doubts, take a look at the clientele and tell me it's not a sign that the food is really, really good :)"], ["YS Z.", "I cannot believe this restaurant is still running. The only good point is cheap price. Other than that, crowded tables, tiny space, rude service, poor sanitation, terrible room decoration, and more are all terribly poor."], ["Shirley P.", "Lincoln Journal Star has listed China Inn as the best Chinese food in Lincoln.  Every item is delicious on the menu.  Everything is pretty cheap, but if you want to splurge, you can get a whole fish (steamed or fried) for $22.Favorite items: Duck (half a duck, peking style for $10), Wan Za (battered and fried sea food in a hot sauce), Triple delight with pan-fried noodles, Jum Bong (Korean seafood noodle dish).Crispy chicken, general's chicken and peanut butter chicken are favorites among the American guys I know. The restaurant is very vegetarian-friendly:Tofu mushroom, family style tofu, eggplant with basil, water spinach, chinese squash tofu, green beans w/o pork. The service staff is also very friendly."], ["Amy C.", "I love China Inn!  My favorite item is the Spicy Boiled Beef.  I also love many other items on their menu and enjoy trying their more authentic dishes.  The prices are also very good.  I wish I still lived in Lincoln so I could eat here more often!"], ["Kerry G.", "We found this place probably about ten years ago when my brother was playing in a chess tournament in a nearby hotel. I remember being very impressed back then, and last night my mom and I were in Lincoln to go to a lecture and decided to refind the place. She remembered it being kind of close to Cornhusker and I remembered it being near some sort of grocery or big box store, and we both turned out to be exactly right.It's one of those really unprepossessing hole-in-the-wall sort of places that turns out to be really good.The menu is a mix of Chinese and Korean dishes, with the very authentic selection of Chef's Specials on the back. I was not brave enough to try the Spicy Intestine in Hot Pot and I don't have the faintest idea what Peppered Cattle Baiye or Shredded Luffein Tofu even are, but I ordered the Triple Delight with Panfried Noodles, which the waitress claimed was her favorite.When it came out, I could see why. A nice, varied mix of tender-crisp vegetables in a good sauce with plenty of seafood and meat and nice crisp noodles.The crab ragoon were also yummy, fried nice and crisp without being too greasy and well-stuffed with filling.The disappointment of the evening was my mom's dish. She was curious about the Pork Chop Noodle Soup and probably should have asked the waitress, but her English did not seem that great so she just ordered it and it turned out the pork chop was fried, like really thin chicken fried steak. Neither of us likes fried meat that much and the whole soup had a fried sort of aftertaste from the pork so it wasn't what we expected and wasn't to our taste.Otherwise, a very good experience and the other solid dishes we passed on the way out looked as good as mine, so we will definitely go back sometime when we're in Lincoln again."], ["Nikki B.", "I heard a rumor that China Inn is owned by the same folks that run Windchimes.  I'm unsure if it's true, but they both have FANTASTIC Chinese food, & this place is cheaper than Windchimes.  I highly recommend the Peanut Butter Chicken.My complaint:  If you ever eat here in the winter, don't take your coat off, or get it to-go.  The door opens directly into the seating area (no vestibule), and it's freezing!"], ["Xinrou T.", "China Inn is one of the best Chinese restaurants with close-to-authentic Chinese food. I am a Chinese from Malaysia and I really miss the food from back home. Thus, I am always craving for good Chinese food, the closer the taste is to the food back home, the better. The price is very reasonable for the food quality. Even though the food tastes good, the cleanliness might be a little lacking. I remember a friend and I getting a horrible stomach pain after eating at that place during lunch one day. (Note: we did not eat breakfast, and it wasn't food from the night before, because we felt pains right after dinner, which meant it couldn't be dinner we just ate. And we eliminated all other possibilities.)One more downside about this place is the hospitality and service. Not the best I know of all the restaurants I've been to. To me, I'm quite used to this unfriendliness and \"strictly-business-attitude\", because quite a number of restaurants back in Malaysia have that sort of attitude. But China Inn's main boss can be quite unfriendly and mean, and could care less about me (because I've worked there before for a short while and couldn't take the stress and unfriendliness). Other than that, the food is pretty awesome for Chinese cuisine. I say that because even though I've been treated really badly before by them, and do not enjoy working there, I still go there often to have my fix of Chinese food. That does say something about the food there, I suppose..."], ["Amanda G.", "China Inn is probably my favorite restaurant in Lincoln.  Don't be fooled by the first couple of sections on their menu which is the typical syrupy American stuff.  Go for the specialties and the dishes on the back.  Their green beans are my favorite and my husband (normally the kind to go for meaty stuff) will kill for their tofu and black mushrooms.  (And I agree with the previous poster about the kim chi--excellent!)Best of all, this is a family-run business and if you go as regularly as we do (about once a week) they really get to know you.  The friendly woman who runs the restaurant recognizes us now and always goes above and beyond to make our visit great. They have completely secured our loyalty."], ["Jules T.", "I found this restaurant during my college years. It's one of the best things I did during this time. They have the best chinese/asian food when the korean woman owned it. I used to get plenty of free kim chee. Not just one kind, but several variations of kim chee. Cold, spicy, sour kim chee, yum  makes my mouth water. The best foods to order here are from the chef specials, they are unique and delicious. Spicy string beans, korean bbq ribs, salty shrimp, just order from the specials. The space is small, a bit dirty, it's constantly busy, the bathroom is gross. It is now owned by a chinese family and I'm not sure if the menu is quite the same. You can't get kim chee for free anymore which is a big disappointment. They serve beer and wine. Good for kidsGood for large groups, but just plan on waiting especially during busy lunch dinner hours."]], "Imperial Palace": [["Dallas P.", "Fun place to eat. Service can be hit or miss. Food is closest to real Chinese if you order from the secondary exclusive menu. If you don't have Chinese friend with you ask for the menu and order two or three cuisine and don't forget rice. Enjoy China!"], ["Elisabeth E.", "I was really pleasantly surprised on my visit here. I thought for sure I would be watching everyone else eat and I'd be out of luck. There was a server who was brought over to speak with me since her English was excellent. She knew exactly what gluten was and what I could have. The sauce is a garlic white sauce and I could pick whatever wasn't fried to have them put it on. I ordered the cashew chicken and it with the sauce was delicious. The egg drop soup was also gluten free and very good. My coresidents all enjoyed their meals as well.Atmosphere is pretty traditional for Chinese dining with a lot of decorations with red and gold, dragons, and those great Chinese astrology place mats. Everyone was very friendly, food came out quickly and was a large portion, and price was very reasonable. I'll definitely be stopping by here again sometime soon."], ["Quetzal C.", "Do not miss this great gem in Lincoln!  The food and service are great. The menu offers many options, including vegetarian & gluten free items that cater to even the pickiest eater. The staff is very friendly and can help explain the menu. The crab rangoons, fried rice and lemon chicken can't be missed. The dishes with Chinese charters on the side are authentic Chinese cuisine and are perfect for those who are looking for an authentic dining experience."], ["Krystal G.", "My review is solely based on takeout. Passing through town and stayed at the quality in for the night. Imperial delivered to my door. Not the quickest delivery but I'm not sure how far they were and in their defense, there was also a storm that night. My house lo mein was the best I've had. I sporadically order lo mein from Chinese restaurants, usually to be disappointed by a greasy and unsatisfying dish. On the contrary here. Noodles, meats and veggies were cooked perfectly, noodles were super flavorful and not overly greasy. My boyfriend and I devoured the dish. Unlike his curried fried rice. Bland. Required two packs of soy sauce just to give it enough flavor."], ["Sam K.", "I'm pretty content with this place! The staff is friendly and I have absolutely no complaints about the food. The decor is pretty cool too! One of my top 3 Chinese places in Lincoln."], ["Mariah T.", "I took my mom here for lunch, and it was absolutely horrible. They sat us down and ignored us for 10 minutes they even served the people after us. Finally he came over and we told him our order and. I got my freezing cold soup and they forgot moms. We told him twice she finally got her \"Sizzling rice soup' which to be honest looked like some cleaned out of the kitchen sink and put it in her bowl.when we got our food it was covered in this salty brown gravey. I got the Beef and Broc and mom got something else. I was so dissapointed we paid the bill and left. Than went to Arbys cause we were starving. I heard so many good things from friends and even on here but to be honest I'll never go back. We got sick after that place! I don't complain much but OH MY GOD I had to warn other people don't go for lunch the server was a jerk and the food was freaking disgusting."], ["Angie W.", "I have been going to Imperial Palace since I was a kid. I stopped going to the restaurant regularly because: a) the service is not as good as it used to be, b) I would usually go on the weekend, but it started to seem like the restaurant was constantly closed for weddings, and c) Golden Wok across the street has a children's menu, which is very nice. I do, however, still always order my delivery from Imperial Palace. As others have noted, they have an authentic Chinese menu, which is great. We like the beef in hot oil. The old Chinese standbys like Mongolian Beef are also tasty. Delivery is usually pretty fast, but not necessarily inexpensive. I do not live at all close by though, and they still deliver to me, which is great because all of the Chinese places near me suck."], ["Jer s.", "Very good food! :)   A business/Restaurant youcan count on, they care."], ["Cheng J.", "A nice Chinese restaurant. Food there are real Chinese ones. Some of them are of course modified a little bit to fit Americans. After all it is a nice place worth to go."], ["Don M.", "We have been making the Imperial Palace our \"go to\" place for takeout for some time now.  It one of the usual \"I buy, you fly\" places that I send my wife when she doesn't feel like cooking.  Normally, we have a good experience and the food is pretty good.   However, we got take out last Friday night and the food was well below their usual standard.   I ordered the moo shoo pork which is usually superb.  I am not sure if they changed their recipe but it was watery, and flavorless.  Even with addition of plum sauce did little to add flavor.   My wife ordered the sesame chicken which does not have the little pepper indicator in the menu which means it was not hot.  She immediately noticed flecks of red pepper in it and it was too spicy for her to eat.   I will say they are one of the only places in town that you can get shrimp toast which is one of may all time favorites.  So for that reason alone we will continue to stop by for occasional take out.   Shrimp toast good.   Everything else was strictly mediocre."], ["John N.", "Their food is mediocre. I can't tell you that I prefer other restaurants than this place. They started to get really arrogant because they have a good business in catering for weddings. The waitress didn't seem to care about us and more worried about being right. I will never ever go back to this place and I will not give this place a good rating."], ["Valerie W.", "We live in Omaha and have to drive down to Lincoln every time we want great Chinese food. Well worth the drive! Best Chinese food in Nebraska! The Sesame Chicken and the Chicken Lo Mein are excellent. The service is sometimes sub par but the food definitely over shines it."], ["Erica M.", "This is one of the few great Chinese restaurants in Lincoln. The food is great and comes with a great price. Excellent sesame chicken with a delicious sauce.. Yum ! The decor and tables could use some updating, and the lighting. could definitely be brighter."], ["Mark S.", "I was thrilled to see that they offered an \"authentic\" menu.  Most of it is in English except for the really hardcore fare (chicken feet, etc.).  Portions are huge.  One entree is easily enough for two or three people, plus it comes with a huge bowl of rice.  If you want to try some authentic-style dishes I would recommend:Twice Cooked PorkCumin BeefRed Chili Oil BeefService was very good, food comes out out quick and hot.  The staff really opened up once they recognized I respected them and was sincerely interested in their culture on my second visit.  I will definitely be trying some more authentic entrees on my next visit to Lincoln."], ["Lily Y.", "This place offers the most authentic Chinese food I've ever had in the States! - I have a say as a resident of Queens in NY, as a native Beijinger  (of course we always order from their Chinese menu). It's totally surprising and lucky to find such a place in Lincoln, where me and my husband temporarily work. Our conversation with owners of the restaurant explained: both of them went to a well known culinary school in Beijing before moving to US, which makes sure their recipes differentiate themselves from those Americanized Chinese takeouts.  Besides delicous food, generous portions, I recognized the decor, including gate and wall reliefs, laterns, are handmade artworks from central China, adding warmth and elegance to overall ambience. Servers very friendly and helpful. Highly recommended!"], ["Foe M.", "Decent chinese food, not as good as I hopede it will be. I came here more than once, but the food was not full of flavors as I expect chinese food to be."], ["YS Z.", "Authentic Chinese food. Special Chef's menu, which changes frequently. Always surprised to find new dishes. Everything is excellent, comparable quality to the best Chinese restaurants in east and west coasts. The only downhill is the room decoration, which is kind of old and requires renovation."], ["Lindsay O.", "Imperial Palace is a good old skool type sit down Chinese restaurant.  It is everything an Americanized Chinese restaurant should be...cheesy decor, minimal English speaking staff and decent American menu.  However, this place does have the \"other\" menu...and I've found the food to be superior on this menu, though it might be a bit too far out for the average Midwesterner's tastes.  I would recommend the Salt and Pepper shrimp from that menu and from the American menu the Mu Shu pork is divine.  All and all this is a good Lincoln mainstay restaurant and probably one of the better Asian restaurants in the city."], ["Joel G.", "Princess delight  and Mo Shu Chicken were great.  A little bit pricier than expected $9.25 and $8.25, but great service and food came out quickly."], ["Jose C.", "Really good place to eat! I love it!"], ["Denise B.", "The Imperial Palace is your quintessential Chinese food joint - complete with sculpted red ceiling tiles, dangling paper lanterns, black-lacquered wall-hangings and ornate gold dragon decor.  Granted, it is a bit rough around the edges (some dilapidated booths, and a big screen TV precariously balanced in one of the larger booth seats), and the parking lot is hard to get to but I enjoy it none-the-less.The husband and I have tried several dishes - the crab rangoon is always hot and fresh, and more than just cream cheese, the egg rolls are decent - the egg drop soup is run-of-the-mill, but not bad.  I like the balance of their entrees - they avoid all of my regular annoyances with chinese food places.   Their meat is cut and prepared in reasonable bite-size pieces, the sauces are not sickeningly sweet, nor nauseatingly salty - they are just right, and their sticky rice is the perfect stickiness for chopstick lovers.  I even like their lo-mein noodles.Imperial Palace has become one of my favorite places, not because it is off-the-charts extraordinary cuisine, but because they have good food and they deliver every night from 5 to 9 - FAST!  It says something when my crab rangoon arrives at my doorstep still steaming hot.  I love not having to worry about dinner - that's almost worth an extra 'star' in my book.  :)"], ["Regina V.", "I used to go here as a kid, and it was one of the best restaurants in town.  We came here while visiting my mom, and we couldn't believe how far downhill it's gone.  The beef in the broccoli beef was so chewy it was nasty.  The potstickers were equally poor in consistency, though the flavor was ok.  The one redeeming dish was the green beans.  While my homemade recipe is better, they were decent.  I haven't tried other Chinese restaurants in Lincoln, but I certainly won't be back to this one."], ["Mitch C.", "Ok, the \"American Chinese\" menu is standard, but the \"Other\" menu is unbelievable.  Thebeef in hot oil is excellent, as is the ma pa dofu and the szechaun green beans.  Truly excellent Chinese food for Nebraska. Also, the owner is very nice and gave us some szechuan peppercorns to take home.  Highly recommended for real, good Chinese."]], "Great Wall": [["Jenay S.", "Best Chinese I've ever had!  Great Wall is my go-to whenever I want Chinese.  Friendly staff and cleanly eating area.I get the peanut butter chicken every time...it's amazing!  The sauce is delicious.  It's not dry and crunchy, like I've had at many other restaurants.  You also get a large portion for a great price.Highly recommend!"], ["Angie G.", "I totally agree with the 5 star ratings for this Chinese fast-food joint.  The most important question; would I recommend this place to others?  HECK YES!I get the Cashew Chicken and have never been disappointed with the food.  At some places, you get that \"funky\" chicken that is, shall we say, gross and scrap.  I have ordered several times here the same dish and have never had a bad meal.  That being said, the Cashew Chicken is different from others I have had at other locations. It has a slightly \"sweet\" taste - don't get me wrong, it's delicious ...just different than I am normally accustomed to.Also, LOVE the eggrolls.  I know they are frozen but I always order two orders just for me so I don't have to share. (yes, I am piggy.)When I leave Lincoln, I am really going to miss this place most of all!"], ["Sue S.", "This is fantastic. They officially take the cake for the best crab Rangoon in town, stuffed full of filling. And the wonton soup is amazing. Huge wontons. My personal favorite dish is the Singapore mi fun. It's curry flavored with the really thin noodles, shrimp, chicken, beef, pork and then some veggies mixed in. Soo flavorful. My fiancé likes the general tso chicken, that's really good too. But the Singapore mi fun has my heart. Best part is they deliver. So If you are super hungover or a lazy food fat fatty that doesn't want to leave Netflix, they've totally got your back. I love them."], ["Quan L.", "Best take-out in town.  Visited Lincoln for a month and this Chinese restaurant was better than the other ones I've went to.  Crab Rangoons were amazing, lots of cream cheese fillings compared to many I've been to.  Hot & Sour soup was great too.  Big portions for the price.  There's also a special Buy One Get One Half Off on Wednesdays from 4:30pm to 8pm I believe.  I also used some coupons from their menu and online website, they're only valid for pick-up and take-out though.  There are some tables for you to dine-in as well, but all the customers I see that come in get take-out while I was eating there.  Friendly family restaurant, great service, and great prices.  Try it out!"], ["Jameson H.", "This place is amazing. My wife and I get take out all the time. Kung pow chicken and peanut butter chicken is a pretty typical order for us. They are always quick and responsive to requests. If you like crab Rangoon, just ask them to swap out the egg rolls that typically come with the meal. You always get a lot of food for the money. Sometimes my wife will get 2-3 meals out of it. I've even had to save some for leftovers a few times! Great Wall is probably my favorite restaurant in town. We are moving to Minnesota soon and I can only imagine how many more times we will get this before we leave. Try it and support this little family restaurant!"], ["Ai C.", "They deliver to my work and I am so glad I tried it! The orange chicken dinner is delish!!! It was enough for left overs and the best orange chicken I have tried in town. Will definitely be ordering again!"], ["Kendall R.", "The only place we go for quick Chinese food. Staff are awesome and the crab Rangoon are the best!"], ["Nikki B.", "Small restaurant, generous portions of mediocre Chinese food.  A table of the employees ate lunch next to us.   One of them brought out a piece of meat in his hand and plopped it onto his food.  Faded greenish pictures of food on the menu sign to match the faded greenish lighted photo of the Great Wall of China.  Disney Channel was on the TV, but no kids in sight.  Employees were friendly, store was clean, and they brought food to our table.Overall, weird dine-in experience for my only time there.  I wonder if they do most of their business via takeout or delivery?"], ["Austin B.", "The peanut butter chicken here is sublime.  For just $5 at lunchtime, you can get a huge pile of it with rice and an egg roll.  Great Wall is one of my go-to spots when I'm back in Lincoln."], ["Crystal Z.", "This is, without a doubt, the BEST Chinese food I have ever had.  All of the entrees are super delicious - never had one I didn't like.  Their lunch deals are incredibly reasonable.  Of everything on their menu, their crab rangoon is beyond exceptional.  I no longer live in Lincoln, and have been searching high and low for a crab rangoon that comes even close to measuring up to their amazing crab rangoon.  I have yet to find it, and probably never will, because Great Wall does it so perfectly.  I would 100% recommend making this your go-to Chinese place."], ["Brian Z.", "No fortune cookie.  Amazing crab rangoons.  Meal was average."], ["Mollie M.", "This is the absolute best Chinese food I have ever had!! The chicken is excellent, any of it!  It actually resembles chicken meat, not mystery meat like other places. I have never had a disappointing meal and they always prepare the order accurately. Very reasonably priced also!"]], "Lee Garden Chinese Restaurant": [["Tess A.", "Absolutely delicious. The deco is bare and makes you think the food will be mediocre but definitely more than exceeding our expectations. Prices are low especially for the quality of the food! Will be back again and will be recommending it to our friends and fam!!"], ["Don M.", "Tragically, I must say that I have to give up on Lee Garden.  It has been my \"go to\" place for Chinese since it came into the neighborhood.  Good prices, generous portions and delicious food.   Sadly, I think something is going on here.  The last three times I have attempted to eat here, (yeah I said attempted) I have been thwarted.  Three times ago, we ordered take out and the order was all wrong.  Wrong rice, not enough crab rangoon, things were forgotten.  Okay, I thought, given their past history it was just a fluke.  Forgive and forget.  Two times ago, I stopped by in the afternoon about 1:30 in the afternoon and the cashier told me that the cook had \"stepped out\" and it would be at least 15 minutes.  So I left, unfulfilled.Just less than a half hour ago, I stopped again.  Shortly after 2:30.  The cashier took my order but I noticed there was no cook.   After waiting 10 minutes, I stood up and asked if there was a chef?  The cashier said she \"thought\" he was in the bathroom.  I asked for my money back and she got on the phone and talked to someone in what I presume was Chinese, and then opened the register and gave me my money back.How are you supposed to run a restaurant when there is no cook present?  Once, I can chalk up to a fluke, emergency, or something else.  But twice in a row isn't a fluke.It is terribly irresponsible and I won't be stopping back in anymore. I have eaten at Lee Garden over 50 times.  I dare say I am one of their most frequent customers.  Not anymore.  I am leaving them at 2 stars because their food is still good.  If there is someone there who will cook it for you.  Peeved and disappointed."], ["Paula W.", "Lee Garden is under new ownership and Tyson is the best He cares that the food is healthy and is using FRESH chicken breast in his dishes. Try his sesame chicken it is the best and they deliver! I was just told they will be mailing coupons very soon too!"], ["Jo L.", "Under new owners August 11, 2015.  We loved the Mongolian beef and Orange chicken.  The meat was fresh and the chicken was breast meat fried in a light but crispy batter.   The beef was tender and the portion size was generous. The waiter told us the sauces were made on site and you can tell by the end result which was high quality food.  The kung pao sauce was served with the dumplings and was very flavorful but not too spicy.  I will definitely try the kung pao chicken next time. They plan to offer delivery, so I will try again."], ["M R.", "We have come here several times. The  price is reasonable. I liked the crab Rangoon, Kung pao chicken."], ["Miranda V.", "The majority of the menu is inedible and is doused in salty soy sauce. I've tried several items and have never been able to choke down more than a few bites. Plus they give you free soda when you order delivery but they never ask you what kind. They just bring you whatever they feel like. I definitely won't be eating here again."], ["Trey B.", "Very good! Fast delivery. Large portions for a reasonable price. Kung pao chicken is great if you like spicy."], ["Heather S.", "We have now eaten this restaurant's food several times. Each and every time it is always quick service and the food is hot and delicious. I really like their general Tso's chicken. Their crab Rangoon is also amazing.  We also didn't realize every time we get an order, they give us cans of soda. They are the most random kinds, but it is fun to see you what you get every time. I would highly recommend this to anybody that wants delivery Chinese food."], ["Greg S.", "Good food. The smaller \"Dinner\" menu was plenty and you receive an egg roll, soda, and entree. Nice clean restaurant friendly staff."], ["Love L.", "We were looking for a fast cheap dinner. This was all of that and tasty to boot. The Orange chicken had a really awesome flavor with lots of Orange zest in the sauce. My only complaint was that there was a little too much of this delicious gooey goodness to the point of being a bit overwhelming. Overall though, a good run of the mill Chinese food place."], ["Audrey F.", "Lee Garden is  the best. I have never had anything here that tasted bad.  Lee Garden is a awesome place.  Whatever you order. It will be delicious . I always try out new Chinese restaurants. Lee Garden is my favorite. I am so glad they are near where I live."]], "Panda Garden": [["Taylor R.", "Lincoln is full of small gems like this :)I don't have much experience with Korean food, but I loved this! I got the Bulgolgi, which came with rice and the kim chi salad bar. It was super tasty, and I left comfortably full. As the other reviews have said, the couple that runs the restaurant is very kind and hospitable.Overall, a wonderful experience!"], ["Ben J.", "I've had Korean many times before , and walked in with no expectations- they bombed it !Amazing kimchi \"salad\" bar , everything else tastes good and surprisingly fresh ( I would think that an Asian restaurant wouldn't have an high standard ) , the owner came over and showed us how to eat the specials. The price was on the lower end and totally worth it ."], ["Eunji K.", "Amazing customer service and food! The owners are such a sweet and generous Korean couple who truly enjoys providing good food for their customers. We ordered \"Hae Mool Juhn Gol\"(Seafood Stew) and it tasted like a home-cooked meal. There was a generous amount of seafood (mussels, shrimps, octopus, and fish), vegetables, and noodles. We also ordered \"Bi bim bap\" and vegetables were fresh and the seasoning was just right. They have self-serve kim chi and side dishes area and everything tasted so good. They also had watermelon as dessert. I was surprised by the quality of the food. I'm from Houston and I think this place tasted better than any of the Korean restaurants in Houston."], ["Jessica L.", "The owner of the restaurant is super friendly. He came over and asked me if I had enough food and gave me extra rice lol. Good food and good customer service :)"], ["Jennie C.", "Review is for Korean food.I must be spoiled, because I'm used to Koreantown (Annandale, Virginia) on the East Coast. Listening to K-Pop, all you can eat barbeque, and endless varieties of banchan.I was prepared for a change in the Midwest, but I can't overlook certain things.Jjyangmeyon (black bean noodles): Alright. Not the best, but not the worst.Soondubu jigae (spicy tofu soup): I got the seafood, which I felt they kind of skimped on because I received 4 or 5 pieces of octopus. I didn't recall any other seafood. And they used firm tofu! Where's the soft tofu? And my egg? :(I thought it was interesting that they had a small area where you could get yourself banchan. It looked the staples: kimchi, water kimchi, bean sprouts, cucumbers, and either overripe daikon or old potatoes. I'm used to fresh kimchi which is sweeter, but their kimchi is very fermented: very sour and acidic.And I hate writing this review because the service was OUTSTANDING. You can tell the owner couple works hard, but I do feel like they cater to Western tastes. I would like to come back and try some of their other entrees (japchae: glass noodles, bibimbap: mixed rice bowl, sellongtong: beef soup). But I'm kind of hesitant.So 5 million stars for the owner and the staff, because I know they are hard working. But not so much for the Korean food."], ["Hannah P.", "Their jjamppong is the bomb, great broth and they don't skimp on the seafood, full of mussels, shrimp, and squid. Is it a little pricey? Yes, but I was happy to even find a decent korean restaurant in the middle of Nebraska. My colleagues tried the chinese food and were not impressed, but the owners are korean so you should probably stick with that. I have tried the jjajangmyeon was not that great though. But on a cold day, jjamppong definitely hit the spot."], ["Nate R.", "They have amazing rice ! It has egg in it and it's to die for! I got the sesame chicken and it was pretty good. I will say that my buddy got the Orange chicken and our meals where identical - the sesame ..... Take it as you will. Good place though. Convenient, , quick and pretty much exactly what you would expect. Works for me!"], ["Don M.", "Thought I would try the \"other\"Korean restaurant in town.  I got the Bulgolgi.   Their menu is vast with both Chinese and Korean but if you don't get the special it is expensive.  Service is lacking. Pay at the counter and pick up at the counter like a McDonalds.  Today it is freaking hot in here.  It has to be at least 85 degrees in here.  I am literally sweating while I am eating.  The \"ice water\" was luke warm.  The Bigolgi is was tasty but very average.  I was very disappointed.  Was hoping for better.  Overall, I won't be back to try the other items."], ["Jessica B.", "Good Korean food, okay Chinese food. If you're into Korean food, it's perfect! But I would prefer Yami, which is the only other Korean restaurant I could think of in Lincoln. At Panda Garden, it's kind of like self serve. You get your sides at the mini table and pour your own water. I don't really like that because I don't know how long those bins of sides have been sitting out. At yami, they give you mini plates of the same appetizers as panda garden, but it's much easier that way. It just seems more professional! The people are nice as well! Very sweet couple. I just think I like yami better because it's a little fancier, and clean!"], ["Lynn H.", "As good as it gets in Lincoln I would say. I haven't tried the other Korean restaurant (up next will be Yami)  but so far, I'm quite impressed and excited to know there is a place I could go for Korean food. Living in southern California and about a 10 min car ride to Korean Town in Los Angeles, I know a thing or two about Korean food. Disappointed there isn't a Korean BBQ place around but this is kind of like a Tofu House.Had one of the the lunch special on Friday- Bibimbap, came with egg drop soup (would have preferred kimchi chee gea but that wasn't an option for the lunch special...overall good experienceFYI: not a table service place, you order the food and gotta watch for your order to be called. Also not the best selection of side dishes (really there were none beside kimchi and a couple other kimchi type things). They don't keep the gochujang (Korean red pepper paste) out but if you want to add more to your Bibimbap (cause they really don't put enough on) just ask."], ["J C.", "I enjoy this place for Korean .  Kim chi bar , never spelled Kim chi before so probably spelled wrong , was appreciated.  Nice people and tasty food.  definitely be back."], ["Robin S.", "I didn't try the Chinese menu but it looks like it has been adapted for regional tastes.  If you're looking for authentic Asian food, stick to the Korean menu.  I went for the Korean food and I was not disappointed!  The Korean food is a bit pricey, but I haven't seen another Korean place in Lincoln.  Will definitely be a repeat customer.I had the Gahl bee tahng - grilled marinated shortribs in soup with noodles, tofu, and vegetables, a bowl of rice, and three banchan (small Korean side dishes - in this case, kimchee, marinated eggplant, and a salad with apples, cucumber, carrots).  Very filling and hearty.  A bit pricey at $12.95 pretax, but worth it if you want delicious Korean food."], ["Poncho Y.", "Will let u know when belly full! it's been on Lincoln a while and it's good, I'd still go other places 1st but it does it's job."], ["S a.", "Disclaimer: the five stars is for the KOREAN menu, not the Chinese menu.  Lincoln has plenty of places selling fried rice in a strip mall.  The reason to go to Panda Garden is to get Korean food.  Ignore the generic Chinese menu and look to the right of the counter for a photo menu of totally delicious Korean food (the owners of PG are Korean -- they know what they are doing).Yes, it takes longer to come out than the generic lo mein, and it's probably twice as much ($10 rather than $5 for a meal), but it is totally worth it.  Plus, your entree will come with a dazzling array of kim chee.  Where else are you going to get that in Lincoln?A word to the wise: if you order the dolsot bi bim bap (the winter version served in a hot pot), DO NOT let them talk you into pouring the salty   \"chicken soup\" (cheap bullion) into the pot.  It's much more delicious without it."], ["Ray S.", "Based on the other review I went to Panda Garden and ordered from the Korean menu. Although I'm not Korean, I grew up in southern California where there are lots of Korean restaurants. I ordered the Bibimbap, and thought it was good. However, it only came with three types of kimchi on the side. One of them was very good, the other two were average. I am used to larger restaurants that usually give around 5 types of kimchi, so I was a bit disappointed with that. This is a mom and pop restaurant, though, so it's understandable, and again the main Bibimbap dish was good. Many Korean dishes are spicy (including Bibimbap), so if you don't like spicy food, be sure to ask which dishes are spicy and which aren't. I will go back when I get another craving for Korean food."], ["Ted S.", "I always try to stop by Panda Garden when I'm in that part of town. Good food, good people."]], "Zhang's Cuisine": [["Cliff D.", "Really good Mongolian beef and orange chicken.  My wife and kids can't get enough of the crab Rangoon.Run by a great, local family."], ["Dr. S. K. N.", "I stopped into Zhang's, for the first time, this last Saturday afternoon, just as the football game was winding up, so I had it all to myself.   I had the General Tsao's Chicken combo plate, I believe it was, with fried rice and an eggroll.  I took it to go, and it was still piping hot when I got home a half an hour later.  It was arranged, jam packed, in a plastic box so pretty, it reminded me of a bento box.  Rice on one side, chicken on the other, with two pieces of steamed broccoli dividing the two.  It was delicious!  And plenty for two meals.  Reasonably priced.  Vivian (I believe I spoke to) was charming, and we discussed the merits of going all over town doing errands and enjoying new restaurants while the rest of the town was watching football.  (Though it was on the TV--if I wanted it). I can't wait to go back again."], ["Christina K.", "I love the Hunan Shrimp or Chicken! The sauce is spicy but not too spicy and some how buttery. It has a huge combination of veggies in the dish, which I love. Best in the city!"], ["Mark J.", "It took me a while to find a few dishes I like nut now I enjoy their general Tao and sesame chicken.  Also the egg foo yin is good bit a lot of food."], ["Chrissy M.", "We've eaten here three times now. Never been disappointed. We've had the pepper steak, sesame chicken and chicken fried rice. Delicious. Good prices, great people."], ["john l.", "This place is the BEST! Vivian (the owner I believe) always makes me feel Welcome! I use to order take home every Thursday so she starting calling me Mr. Thursday. But Now I'm Mr. Tuesday as well! The food is some of the BEST in town, sure it has a lot of the some stuff as other places, but I truely believe it is much better then the other places in town. Great portions, better service! I am a FAN!!!"], ["Herb H.", "$8.99 for lunch Curry Chicken, no drink, water in small styrophone cup, no atmosphere, bland service, out of the way.Totally not worth $9 for lunch with no drink. The curry chicken was not bad, but not worth $9.I won't be going back."], ["Molly K.", "This is one of my favorite place to go for fast food Chinese. It's more Americanized food so not somewhere to go for more authentic Chinese. I recommend going with one of the anytime dinner combos which will fill you up for about $7.95 and  comes with your choice of about 20 different entrees, fried rice and either an egg roll or 2 crab ragoon. I have tried the sesame chicken,  cashew chicken, general chicken,  and orange chicken and all have been good."], ["Spencer S.", "Zhang's is a worthwhile experience. It occupies sort of an odd niche, because it is relatively expensive for takeout Chinese, but their ingredients are top shelf. They're like the Bentley of Chinese takeout: it's the best you're going to find. Obviously something cheaper and more purely functional could get the job done (see the Golden Wok or Yang's Cafe or similar), but that's not what you use Zhang's for. It's a quality meal, and there are often leftovers (see photo).I'd also recommend eating in over delivery. As you can see from the schizophrenic reviews on Yelp, your experience may vary wildly depending on whether you get the food delivered or not. Yeah I know we're in Nebraska, but remember the language barrier. My wife and I have always eaten in the small dining area, and we have zero complaints. The owner will even act as a waitress if you dine in.Support this place so that those of us who live in South Lincoln don't have to keep driving all over town to get some decent food. There's nothing down here! There's a reason you're Yelping this place - it's because you don't want to have to drive all to hell and back just to eat! So go!"], ["Mike S.", "I finally found the best Chinese food in the city. I don't eat meat so I often eat bean curd dishes, this place has the best General Tso's tofu I've ever had. lightly battered perfectly fried and not too spicy. the bean curd country style was also very good. I will only come to this joint for my vegan needs. Many other places only offer tofu as a dinner dish. I got it for lunch and it was awesome!"], ["Rachael N.", "This is the best fast food Chinese in Lincoln. I absolutely love the Orange chicken, it's a must try. So try it."], ["Ashlie K.", "This was my first time going to Zhang's. I went in and ordered to-go. You do get a LOT of food this. The crab rangoons were super yummy, they packaged them with napkins in between so they weren't all soggy when I got home. I had the vegetable low mein which consisted of more green vegetables than any other vegetable which I appreciated. Definitely worth a trip out there."], ["Mary S.", "Amazing food! A little bit pricy for one person, but one \"meal\" is plenty for two people, in that case it's a great deal!"], ["Joshua S.", "Seriously lacked flavor.Mongolian beef - little to no flavor and not spicy at allBeef and broccoli - extremely blandChicken and vegetables - had to add soy sauce and sweet and sour just to add some flavorPeanut butter chicken - was runny and little flavor"], ["Zach P.", "I am always a little skeptical about \"fast-food\" Chinese food that isn't ordered from a table, but Zhang's always delivers quality Chinese food. The first time I came in with my family, I was worried about the quality of the food. I ordered an order of crab rangoon to share with my family as well as the General Tso's Chicken combo. When I first come to a new Chinese restaurant, I use these two dishes to set the standard on the quality of their food. When the food arrived, I was impressed with the filling of the crab rangoon that had a nice blend of cream cheese and krab. I then moved on to the chicken and was very pleased with the sauce that was not taking over the flavor of the chicken. Instead, it added a sweet, tangy-yet-spicy enhancement to the perfectly fried chicken. From then on, this restaurant has been a favorite of my family. Although I do prefer Imperial Palace in the city to Zhang's, this is always a great place to go with the family, especially when we just want to go out to a restaurant near home."], ["Greg S.", "Outstanding!!!!The Chinese food in Lincoln is not the greatest. After eating at several restaurants there are very few I actually enjoy. South Lincoln is the hardest area to get good Chinese. Here we go...after seeing Zhang's while going to Target many times and passing it up but we decided to try it Sunday. Wow! This stuff is amazing. This is definitely up there close to calling it the best Chinese food in Lincoln.The crab rangoon is fantastic. It has actual crab in it, and is nicely fried. The Kung Pao is fresh tasking and just great. I ordered General Tso's and again it was very good. The sauce's flavor was PERFECT. I only wish it was a little spicier. No big deal though, it was so good. The fried rice...most restaurants here serve rice that is old and dry. Not here, the fried rice had great flavor, the grains were soft, and it tasted fresh.When you're down at Super Target do NOT pass this up."], ["Dan S.", "Building on the tradition of the original Zhang's on Coddington and West A, this location has outstanding chinese food at great prices.This location has a nicer atmosphere and more seating - along with a fountain soda machine. The crab rangoons are a must try. If you are looking for the best deal go over lunch and you get a lot of food for $5."], ["Kate H.", "At least there's crab in the Rangoon. Everything else I ordered was yuck. The dumplings are just weird. They're very heavy and have almost a gravy soaked inside. The general tsos chicken had tiny yellow broccoli in it and they went for heat rather than flavor. I couldn't stomach it."]], "China Buffet & Mongolian Grill": [["Lacey L.", "Been here too many times to count. This is one of my favorite restaurants to come to. The service is always fast and the waitresses/waiters are always on top of drinks. They aren't around so much that it makes you think they are watching you eat. That's a pet peeve of mine. Food has always been fresh. If you want something cold head on over to the frozen section, pick out your favorite pasta, veggie, sauce and throw it all together. If you haven't tried it, I'd suggest you try it out, especially on either Friday's or Saturday's because they have crab legs. Yum!"], ["Jill S.", "If I was rating on any of the other half dozen times I have been there it would be a 5, our favorite Chinese buffet in town. But the last experience was Terrible and left us not feeling well later that night. We came at 5pm which I think made the difference, we usually come around 6 or 7. The issue with coming at 5 is the food tasted as if it was left overs from lunch or the afternoon and hadn't been switched out for dinner yet. Everything was just off and not what we are used to getting. The hot and sour soup tasted bitter and the egg drop soup had no salt which is weird for a Chinese buffet where I am pretty sure salt is the main ingredient. Nothing was fresh or as appetizing as it usually is. The insides of the crab Rangoon had darkened to an unappetizing dark dry consistency. I may give them another shot in the future, onlyTime will tell if they can redeem themselves"], ["Jason B.", "The food isn't going to be the best, it's a buffet. But it's not bad. The guys manning the grill could move the food around a bit more, some parts got overcooked, and the sauce didn't get mixed as well as I would like. Other than that, this place is great. There is a big staff keeping things cleaned up, plates cleared, and the buffet refilled. They serve crab legs on Friday and Saturday night, and the night I was there, they did a great job keeping them refilled. I didn't see a single pan that had run out of food all evening. Ambiance is a bit noisy, but don't go to a buffet restaurant for a quiet conversation."], ["Jason B.", "Fantastic! The food is great. The service is prompt. They are quick to clean up your plates and refill your drinks. This place is my new thing. Well done, everybody."], ["Steven T.", "Been awhile sine we have eaten here and will say for a buffet I am not disappointed. A lot of your standard Chinese fare but the food is fresh, flavorful, and hot. I would put it above average but not sensational since it is a buffet.Obviously the food is good since this place is CONSTANTLY busy. Even on a Sunday there was a wait but we were seated in about 5-10 minutes. The Mongolian grill is smaller than a place like HuHot but has a good selection and they are quick"], ["Jerad D.", "Denise R. seems like a cheap bitch. Their policy on coupons is reasonable. They are for new customers; to try and get them in the door. Oh, you only got a salad, so sorry you don't understand how buffets work. Sorry your picky-ass daughter only had a salad. She could have hit the Mongolian grill 6 times for the same price. Oh well. She missed out on some good food. This is not gourmet food, we are after all talking about a buffet.  With this context in mind, the food is reasonable. I have been here about a dozen times and have left full and satisfied every time. They have something for everyone, especially on crab leg night. One improvement needs to be the dessert area. Pineapples from a can, gross sheet of weird powdery cake with honey(?) and dry-ass cream puffs. I'll just stick with soft serve when I'm done, thank you."], ["Tori C.", "After checking around Lincoln and being disappointed in so many Chinese restaurants we decided to give it one last shot. Remembering a similar china buffet from my home town in Texas I have to admit I am pleasantly surprised. The delicious scents wafting from the Mongolian grill had our mouths watering prior to being seated. The food was delicious, our waitress was a doll and not too pushy on the checking up on us. I almost didn't want to leave. We will definitely be coming back."], ["Nestor G.", "Food is always nice to eat. Nothing amazingly good, typical for a buffet. I would say better than most I've been too. The staff are nice, never had a complaint on the service. Can get pretty full but overall a good eating experience for those \"all-you-can-eat\" type days"], ["Austin M.", "I've been here a few times in the last two months. Each time I've left disappointed. Quality of the food is very bad, every dish. Terrible if it's not fresh. Waiting staff are friendly and attentive. If you're looking for good Chinese food, I'd suggest Mr. Hui's. If you're looking for a good Mongolian grill, Hu Hot isn't far."], ["Pra R.", "The Mongolian bar (Raw food selections) is OK but they don't have \"Squid\", like Sakura restaurant.  Also, they don't have Sushi, unlike Sakura one.  The food at buffet is better than Sakura one in my opinion.  Hum...I did not see \"Crap legs\" I wonder they are for \"Dinner\" buffet only because I only had \"Lunch\""], ["Sarah K.", "This is my favorite place to get the Mongolian grill style food in Lincoln.  I probably come here about once a month and am always pleased with the grill options and how my food is prepared. The crab Rangoon and hot and sour soup are really good also. My husband enjoys coming on Saturday evening for the crab legs and on Sunday for the crawfish. The buffet items are better than your typical Chinese food, but aren't nearly as good as the dishes you can make with the Mongolian grill selections. This place is usually quite busy, but they still manage to keep it pretty clean and ensure that your water glasses do not go empty. Overall, the best option in Lincoln for this style of food in my opinion!"], ["Don M.", "I surprised my son and daughter with a trip on Saturday afternoon for lunch.  The surpise was on me.  This place has REALLY gone down-hill.   It tastes almost exactly the same as every other buffett in town, as if they are using exactly the same recipies.  The Spring Rolls which used to be good were awful, chewy and had \"funky\" taste.  The fried shrimp seemed like it had been setting there for hours.  (Maybe they had been?).   Crab Rangoon, a family favorite, was disliked by everyone who commented that it didn't taste right.   The Mongolian Grill had a chance to be the bright spot, but both myself and my daughter had difficulty getting our sauce combinations right.  (our fault, admittedly.)   I continue my quest for the elusive \"good Chinese buffett.\"  If I ever find one, I will be sure let let Yelp user's know."], ["Adrian B.", "I am not a 'Buffet' person and have never found a decent one here in Nebraska but my opinion changed once I visited this restaurant.  The place is packed on the weekends but manages to seat you within 10 minutes at most.  The Mongolian grill is the reason I go, the vegetables and meats are always fresh and plentiful.  I would never risk seafood at a Midwest buffet but the shrimp are always on ice without a 'fishy' smell.  They entire grill has never let me down.Amazingly the appetizers are also top notch.  I enjoy the succulent hot wings and the Hot and Sour soup is always pleasing.  The Crab Rangoon's are hand made without a lot of crab but huge and tasty regardless.    The desserts are poor so I just have a bit of watery ice cream to clear the palate and leave the place virtually wobbling with satisfaction.  I don't eat there too often as it's too good and I don't wanna get fat.  When I look around at the clientele I realize I don't want to be a 'buffet person', but on the occasion I indulge.  Go on treat yourself!"], ["Renee W.", "I headed in looking forward to some good Mongolian Grill, and this one is okay. The selection for their mongolian grill wasn't that great.  I would have liked to see more veggies and more different sauces.The Chinese buffet portion was also pretty small and the food seemed like it had been sitting around in a vat for a while, even though it was lunchtime. There were a lot of people there who all seemed happy with it, but it was just mediocre to me. There also wasn't much of a dessert selection.I would probably go here again with other people, but not my first choice."], ["Lelay P.", "Awesome!!!!! truly is, and i'm asian too! i say that because whenever we go to any chinese resto or buffet ( and that's very rare) i almost always say, why am i paying for this when i can cook it myself even better?, this place though? the bomb! i want to go live here just so that i can go here at least once a week, i would go everyday but not only will not be good for my financial situation, it wont help with my weight too, their food is really really good!"], ["Rosy M.", "This place was not very good. The quality of the food was less than what you would get at Panda Express."], ["Angie W.", "I am not generally a fan of Chinese buffets because the food is usually not that great. This place, however, is excellent! Their meat dishes are actually full of meat (rather than a bunch of veggies with a smattering of meat), and the meat is nice and tender. The hot and sour soup was super flavorful, and the crab rangoon was huge and yummy. They have a wide variety of options, including a Mongolian grill. The service was perfect."], ["Jenna H.", "Let me start off by saying that any buffet style restaurant immediately gets no better than a 3 star from this reviewer, unless for some reason they have the option to make me whatever I want including 5 star Bobby Flay made dishes with the option to take home enough food (without sneaking it in my purse) for the next few days.  The place: The new China Buffet and Mongolian Grill has an modern asian fusion type feel.  It is located across the street from the Gateway Mall and down the street from both the not-so \"Gourmet China Buffet\" and Hu-Hot which would probably both get 2 stars, but thats other reviews for other days.  Ever since it opened it has been PACKED, we had to wait for a table.... at a buffet, (weird).   The bathrooms:  new, so i will check back in later to see how they look when the shiny new bathroom smell wears off.  The food:  high points: crab rangoon like NO OTHER!  and as much of it as you can eat, your choice of traditional Americanized Chinese dishes and a \"salad bar selection\" of choices for the grill including at least ten different sauces.  My significant other went mad over this!  He's an expirimenter of food so his creative \"abilities\" or lack there of when it comes to food were whetted here instead of on my dinner plate.   low points:  there wasn't as much buffet style Chinese food as I thought there should have been and no sushi??? Even the not so \"gourmet\" china buffet has sushi.   The Price:  8.95 on Sundays, but the drink costs extra, they always get you on the drink.   Concensus:  We liked it, ate way too much and felt like crap afterwards, but thats what buffets are for.   and the food was good."], ["Hung D.", "Great place for the $$ nice environment, friendly staff, great services,  tasteful food without the grease! plusKids eat free Tuesday!"], ["J C.", "I would have to say quality has diminished since they opened."], ["Paul C.", "Good food at a good price.  The selection is a little limited, and the Mongolian grill is no HuHot, but for the price it's a decent deal.  Dinner, drinks, and tip for 2 was $25."]], "The House of Hunan": [["Austin S.", "You can tell this is a family owned restaurant. They take pride in what is cooked and served to their customers. The appetizers and entrees are cooked correectly without insta shortcuts. Overall great food but restaurant needs to update its ambience."], ["Michael V.", "This place wouldn't answer the phone 30 minutes before closing. Then when I went to the establishment, they said it was too close to closing time and wouldn't serve me. Worst business ever."], ["Lianna N.", "Don't let that Chinese name fool you- the owners and their cooks are Vietnamese. That being said, there is some delicious viet cuisine to be had here. *Disclaimer* I haven't experimented or tried many Pho places in town (I'm lucky that the best pho comes out of our kitchen) but when lazy or out of time, the parents come to House of Hunan for a reliable and tasty bowl of Pho. They also open late which is a plus for those nights where you realize it is 8 and no one has eaten yet.Having spent a good amount of time on the east coast and eating Pho there, I can definitely say the portions here are larger for the same price, thats a huge +++! I recommend coming here to try Pho if it is your first time, or to start coming here if you are a regular Pho lover like myself. You'll enjoy each aromatic bowl with high powered AC and a smile."], ["Peter James B.", "I've been a customer since before they changed owners and added Vietnamese selections. I am of the opinion that their pho keeps getting better and better every year! At this time I feel they have surpassed my other favorite Vietnamese restaurants in  Lincoln. The fresh spring rolls with the peanut sauce are also a must, though I usually prefer their delicious vinegar-based sauce even more!"], ["Jocelynn R.", "Excellent food and service. Note to self when you ask for spicy, and she asks you 1-10, 4 IS REALLY HOT!!!!! Hopefully that helps you on your scale( cuz I like habaneros)...."], ["Gigi A.", "If you're looking for some authentic homemade pho, this is it. Service is extremely friendly and pho comes out very quick (within minutes of ordering). For those of you who have never tried pho, it is a delicious, savory thai/cambodian tripe soup that doesn't quite compare to any American food at the top of my head. It's a comfort food without the extra calories, best suited for cold Lincoln nights, or for breakfast when hungover. Its hydrating and fragrant. For those of you who have tried pho, this is decent but certainly not the best pho I've ever had, so it'll likely fill your craving for pho but might not knock your socks off completely. Atmosphere is divey/ mom and pop with depressing florescent lights - whether you love that or hate that will vary from person to person - personally, I don't enjoy that. I wish they would put some money into making the place a little more inviting and possibly less harsh lighting."], ["Jawed B.", "Pho was best that I had in Lincoln or Omaha area.  Spicy beef Hue style Pho is definitely the best I ever tasted. You may find some dust on the blinds but look over it for the tasty broth."], ["CM B.", "Went for lunch today.  I went for Vietnamese food.  Excellent Pho.  I like the broth with a little oil to make it more full to the taste.  Very hot temperature so it didn't cool too quickly, because we all know a big bowl of Pho can take some time to eat. Ordered deep fried egg rolls and they were delicious!  Priced right and you can't go wrong.  Owners were very charming and prompt with refills.  Nice flow of patrons coming in and out.  Bottomline: yummy for the price and pleasant to eat in.  5 stars!"], ["Chantel G.", "Best egg drop soup and Chicken Cow Mein in Lincoln Hands Down!!!! Been the same for years and I hope they stay the same for years to come!!"], ["Soon C.", "The service is really amazing especially the politeness of the waiter. And the food is amazing by far all the pho I've tasted in other restaurant. Definitely a high recommended place to eat!"], ["Fazle H.", "Would always come back, the pho' is very good for a small town like Lincoln. There are a few other places in lincoln like this. its family owned so the pho' doesnt taste factory made. i usually get a large #1 and i ad lots of hot sauce and squid sauce."], ["Derek H.", "Some of the best pho in Lincoln.I'm not sure about their chinese (as I've only ordered / been recommended to get their pho) so stick to the pho menu and you will be golden.They give you a large plate of veggies for your pho, a lot more than some other places. And upon request they will bring out several chilli sauces."], ["Toni L.", "Didn't have high expectations coming in so at least it wasn't a huge letdown. Food: House of Hunan confusingly serves both Chinese and Vietnamese food. I was really skeptical that their Chinese food would be any good, so opted for something safe, meatball pho (yelp.com/biz_photos/hous…). It came with a decent plate of veggies (yelp.com/biz_photos/hous…), so I was pretty satisfied in that respect. The broth, however, had sort of a weird aftertaste. Everything else about the dish was ok, but I just couldn't get myself to enjoy eating this at all. Usually a large portion would be a plus, but in this case, I just wanted to get it over with. My friend got the bun bo hue (yelp.com/biz_photos/hous…) which is a beef broth noodle soup strongly flavored with lemongrass. She's Vietnamese and loves coming here. Atmosphere: The restaurant is fairly large, but could use some maintenance. The tables are a bit dirty and some seem like they are falling apart. Service: Order, get your food, pay. Pretty typical. Synopsis: Wasn't really feeling it. After going to Denver and eating their amazing Vietnamese food, I was sort of hoping there would be something surprising in Lincoln. Not so..."], ["Chris B.", "On the outside, House of Hunan is a Chinese restaurant but they also serve Vietnamese food.  I thought it funny that on the front of their menu it says Chinese but on the first page when you open it it says \"Vietnamese Menu\".  I had the large bowl of pho (vietnamese beef noodle soup) and I thought it was good.  The bowl was pretty large and it definitely hit the spot.  The amount of food I received for the price I paid was definitely a plus.  I have noticed that many Vietnamese Lincoln restaurants charge a premium for their noodle soups.  As far as taste is concerned, I have had better pho at many places but the pho at House of Hunan was good.  Would I come here again for the pho?  Yea, I would.  The veggies served with their soup was also very, very fresh which is always a huge plus for me.I did not get a chance to try out the rest of their menu but maybe I will the next time I come here."], ["Chad H.", "The food was very good. I got the pho with meatballs and sirloin and it was very tasty and even better when I added some of the ground up chili paste.I gave it 3 stars because the service was not very good and the soda I got was totally flat and the completely forgot about the dumpling appetizer we ordered. Service is a big deal to me and is was definitely lacking even though it wasn't very busy."], ["Jules T.", "Pho 3 starsMi wonton soup 4 starsCha Gio 2 starsGoi cuon 2/3 starsService/atmosphere/ decor 2 stars"], ["Chris P.", "Best Cashew Chicken in Lincoln."], ["Nathan M.", "Wonderful family that works here, and great food.  I recommend ordering from the Vietnamese menu and load everything up with chili paste and fish sauce."], ["Nicole P.", "Mom is in town, I wanted some \"Chinese\" food that was close. Tried House of Hunan for the first time. Went down pretty good. Spent the hole night pissing out my @ss though. My bf had gotten something different but he also was very sick. Mom didn't get sick though. We all had something different. So, I guess, there's a 1 in 3 chance this place will make you piss out your @ss."], ["S a.", "A good variety of relatively quick lunch options. It's not the best Chinese/Vietnamese restaurant in town, but it's perfectly creditable.  If you're in the neighborhood, it's a pretty decent lunch option in a part of town without a ton of choices."]], "Hong Kong": [["Jen C.", "I have been to Hong Kong twice and both times I was overwhelmed with how great the service and food were. Food is fresh and you get exactly what you are expecting. The store is clean and the staff is friendly. The only thing that I didn't like (and I'm not down grading them for it because I am sure it annoys the staff just as much) is that they seem to be the only place with a public restroom on this little strip. Lots of people from the Little Cesar's next door came in and used the restroom and left. Overall, if you're looking for a good Chinese cuisine for take out in Lincoln, this is highly recommended by me!"], ["Peter James B.", "My new favorite Chinese take-out! The have the BEST hot-and-sour soup in town, no question. Their crab Rangoon are the smaller, triangle ones, but cooked perfectly every time. Their entrees are very generous in portion, and always very fresh, with high quality ingredients. You never get a taste of overly syrupy sauces or skimping on the key ingredients. The quality is consistently high. They do have a sit down area, which is small but never cramped feeling. We occasionally eat in, but usually take-out."], ["Tim B.", "Very average and ordinary Chinese. We came in on a Friday night at 7pm. Total ghost town. We ordered takeout, and while it took a while to get, the gentleman was polite and gracious. But when we got home? Total disappointment. Peanut butter chicken was thick and gooey, not the saucy, creamy style you'd expect. It seemed like there was way more breading than chicken. The Kung Pao was fine; it was spicy, but just plain. The crab rangoon was good, however, but not enough to outweigh the other issues. All in all, not a place we'll come back to -- especially when there are other similar places in town with much better food."], ["Lyy N.", "The crawfish here is just wonderful and the people are so nice. Most the time people come for to-go food so there was not much people in the restaurant every time I stay to eat ( which is really awkward lol )."], ["Susan L.", "What first sold me on this place was the flavorful and freshly made hot and sour soup with plenty of vegetables.  The second was their Egg Foo Yung served as patties and topped with a mouthwatering sauce.  To get exactly what I want, I order the Vegetable Egg Foo Yung with  shrimp added.  They are also very accepting of making dishes exactly the way you want.  Owners are very nice, polite and accommodating."], ["Kai Z.", "Cheap and delicious. They serve you a lot food you can't image. lol Always nice to try it."], ["Jamie S.", "Great food, great price. Our family's favorite \"fast food\" Chinese.Highly recommend the honey chicken and the potstickers."], ["Rumil B.", "Typical Chinese take out. Huge servings for what you're paying, but the flavor could be improved. Decor is pretty lacking, so the target market obviously is not the sit-down crowd. They're very nice and speedy though, so if you're just looking for a quick meal to go then this isn't a bad option."], ["Deni M.", "Tonight was the second visit that I had made to Hong Kong.  I love the fact that how the entrees are displayed is how they actually appear when served.  They have a great variety of appetizers, including won ton soup, which isn't always served at Asian restaurants.  I took a friend and my son there and he had the Sweet & Sour chicken while my friend and I had the Sesame chicken.  Delicious.  Great service, low wait time, good portions.  Decor is basic and traditional but very appropriate.  Most of all the place is CLEAN and one has a clear view of the kitchen -always a plus!  I'll definitely eat there again.  Prices are reasonable, too."], ["Conrad C.", "pretty good for a basic Chinese fast food joint.  i highly recommend the Singapore Mei Fun (spicy shrimp, pork, and chicken) was quite delicious."], ["Pra R.", "Typical Chinese-American restaurant although I ordered from \"Asian selection menu\" on the board (Beef Ho Fun).  It is probably taste good for American but not for Asian, like me.  The restaurant has wifi and is clean."]], "Mr Hui's": [["Stefano B.", "It really is as good as it gets IF you don't order off the American/Chineese menue, I agree with others that hands down it has THE best hot and sour soup in Nebraska (I probablly have 10 of their take out containes in my cupbord) . Who ever came up with the recipie for that soup is pure genious. Be adventurous and order off the chef's special, sure, it's not going to be the american type you get in most resturants, but your eating real Chinese food here when you order off the chef's special page. They are always quick to greet and seat you. I've never not ordered off the chef's special menu so I can't tell you with any degree of certancy on how the americanised chinees food taste."], ["Michael H.", "This is another place that is so close to our house and yet we never discovered it.  The food is great!  I will start off with the black tea.  Order a pot, it has such a great flavor, I would trade my morning coffee for it.  I usually order off the \"Chefs Specials.\"   Their boiled beef in hot oil and the Mongolian beef are terrific.   I know some people have commented on the decor and how it looks just like the pizza place that was in here before.  Who cares, I would eat this from a truck on the street.  Oh and the crab Rangoon, BEST EVER!!!!"], ["Sarah K.", "I decided it is time to write an update to my review.  The food can be great, but lately I've been getting entrees where the meat is cooked, but the vegetables are basically raw which messes up the flavor and the texture.  For example- onions need to be stirfried to a certain point, if they are raw the flavors are off (and they've been raw the last few times I ordered). I hope this is just a new chef that needs some time to figure everything out because I really enjoy the various authentic dishes this restaurant has to offer.  Or perhaps they are trying to get the dishes out too quick. I am completely fine waiting another couple of minutes for my food so that it is to the right level of done."], ["Jennifer B.", "Six months ago, I would have given this place 3.5 stars. We have eaten here several times. Unfortunately, the service and quality has gone down a ton! What a bummer. Will be searching for a new Asian food place."], ["Jeff K.", "I had lunch once at the North restaurant once and enjoyed it so I wanted to try the #2 store at 70th and Pioneers. We went around 6:00 pm on a Sunday and it was not too busy. I ordered Crab Rangoon and biscuits for an appetizer. You get four crab and ten biscuits.   Both are excellent. The crab Rangoon filling is plentiful and has a very good green onion flavor. The biscuits melt in your mouth. I recommend both. I had Orange Chicken and my wife had Cashew Chicken. The Orange Chicken is spicy with the right amount of orange flavor. Although I didn't try the Cashew Chicken but my wife said it was excellent. We took home lots of leftovers as the portions are large. We didn't see a wine list or any alcohol on the drink list so guessing they don't have a liquor license yet. My wife ordered a hot flavored tea and it came in a to-go coffee cup. Was expecting a little hot tea pot with a tea bag. Was kind of disappointed. This location is in the old pizza place. They have changed the interior some and added secluded tables where the booths once were located. It looks nice, like a typical Chinese Restaurant, without a bunch of Chinese art on the wall. The food is good, large portions, great flavor. I recommend it, but without a wine list, paper napkins instead of cloth, and the tea issue, it gets four instead of five stars."], ["Rita I.", "My colleagues and I just landed and were hungry so we drove around checking to see what's around. It was a sunday afternoon and we were the only ones there but it made sense; we just came after the lunch rush. We were sat down at a booth and were greeted to take our drink orders first while we check out what they had. The drinks came promptly and as we were getting ready to order.. Most of our choices were all out! We were a bit devasted but we were hungry and went with their recommendations. Portions were huge and we definetlt took a few boxes home. We def would go back..just not on a sunday after the lunch rush. ;)"], ["Brad S.", "The Kung Pao Chicken is really, really good. Best I've had. Fried rice is excellent."], ["Jade E.", "Fast, amazing service.. Huge portions! Hands-down the best hot sour soup I have ever had! Kung pao shrimp has incredible flavor.. I ordered it extra spicy and the temp was perfect! I recommend this place to any chinese food lover!"], ["Renae N.", "My husband and I eat here from time to time, and I heard of it from a Vietnamese friend of mine studying at UNL who has lots of Chinese friends. I like that you can get traditional American/Chinese food here, but they also offer REAL Chinese food. So if you are feeling up to trying something new, you can. When I go to a restaurant that serves \"foreign\" food, and I see natives of that part of the world eating there, I always trust the place a little more. This is the case with Mr. Hui's. I see mostly asians when I go, and they're speaking unfamiliar languages, therefore I feel I can trust I'm getting authentic food, which I appreciate. I mean, I appreciate a good, well made generic General Tso's chicken once and a while, but I'm glad we have Mr. Hui's in Lincoln."], ["Guanbo S.", "This is my second review for this business. The service is OUTSTANDING! Unlike many other typical Chinese restaurants you would normally expect, you actually get high quality service dining here. The food comes in large portions and as a Chinese myself, they are very authentic! Always having exceptional experiences here bringing my friends with me. Highly recommend!"], ["Jodi Z.", "We had carryout on January 28.  we ordered beef lo mein without onion, garlic chicken with steamed rice, hot and sour soup, crab Rangoon and egg rolls.  the beef lo mein had onion even though we ordered without but the worst part is the noodles were overcooked and mushy.  We threw it away.  The garlic was in a spicy sweet sauce but they didn't include any rice so we ate without.  the soup, egg roll and crab Rangoon were all very good but it wasn't worth the trip across  town for it.  I don't think we will return anytime soon."], ["Cara G.", "This is the best Chinese food in town! Service was outstanding, this is a hard line to tow, my boyfriend and I both serve/bartend so to say someone was outstanding is a lot. The servings are huge for the price, the only down side was the hot tea tastes off. I'm not sure if they add an herb or something but it definitely tasted off. I definitely recommend going there!!"], ["Duane C.", "Never been to Mr Hui's before, but I will say that I will be going back.  Called in a take out order at 4pm on a Friday night, phone person said about 15 minutes,  I showed up in 10 minutes and it was ready.  The restaurant isn't real fancy, locate in a strip mall with a simple but clean seating area.  I had the Mongolian beef, spring roll and the veggie mix, all  were very good.  One thing I didn't care for was a employee sitting at a booth in the lobby rolling/preparing some type of food, Mr Hui,, please keep food prep in the kitchen.  Here's another weird observation.  The containers that the food were served in were fairly substantial plastic, and I will admit,  I ran them through the dishwasher and kept them."], ["Mitch G.", "Try the Hot Sour Soup! It's amazing!!! So is everything else on the menu that I've tried..."], ["Amber C.", "This place rocks!!!! Consistent north restaurant to south restaurant food quality. Friendly, quiet ambiance, prompt service. Portion to $ is respectable. Amazing, do yourself a favor and check it out! Favorite out of 7 dishes tried: CRAZY SPICY CHICKEN (simplest dish of all, packs a bunch)"], ["Ro B.", "Great meal. Friendly service. Quick food preparation. Order the steamed buns early as they take some time, but well worth any wait. Great place overall."], ["Jordan G.", "Have ordered takeout for 6+ people several times and the food has been consistently great.  Lots of menu options and better quality of food than your typical Chinese restaurant."]]}