{"Sportscasters Bar & Grill": [["Andy B.", "Decent setup, good for watching sports w/ lots of tvs and softer than normal seating. Food is typical bar stuff, lots of fried offerings. Service is adequate if not a bit slow although that might have just been my server. I was here to watch NCAA tourney and had a good time.I ordered the Chicken Muss, chicken was a bit fatty but lots of mushrooms and cheese, it was tasty.As for the TV's, they are primarily in two locations, a bank above the bar and a much larger bank of TV's opposite the bar. Seating is arranged to provide optimal viewing and the further away you are from the main wall the higher the seating. The also have darts and Golden Tee, but this place is primarily set up for watching sports on Television."], ["Andrea A.", "This place is generally what you would expect - crappy fried food and cheap beer. I did have to explain to the bartender how to make a drink advertised by a poster in the bar (Angry Balls - not complicated). It was fine until my group of 4 was joined by 2 more to watch the game, and the manager refused to let us push 2 tables together. We could have mimicked people around us and occupied two tables with our 6 people and yelled at each other, but no allowing the tables to touch. Additionally, the manager and the server were super rude - as if we had requested to watch golf on Huskers game day. We left - the rule has no reason (we would spend the same either way) and was rudely applied. Better dive bars to watch the game."], ["Melissa S.", "Its a decent bar with decent food. The wait staff is hit and miss. Last time we went our waitress was absolutely the best! Fun, fabulous service, memory like a steel trap. This time...meh...not so much. Brought one person in our party draft beer every single time he asked for a bottle. Forgot to order both of my sons meals. Laughed and walked away when I asked for some extra bread for my daughter....I guess we were kidding...but its a fun atmosphere and walking distance to our house so we go quite a bit!"], ["Marv W.", "Not much of a Sports Bar. We have gone there for lunch and although there is some sports on the TV's, they have rap music blaring over the sound system.We went there to watch the NFC Championship. There was a sign on the door saying they were going to close immediately after the game for a Christmas party. We asked if they were staying open until the game ended and they assured us they would. The game went into overtime, they would not serve anymore drinks and shut the main TV screen off so they could start their XMAS party. We had to leave and go to another bar to watch the end of the game. Bar manager said we gave last call, which they did not for us, and was very rude to get paying customers out of the bar.SO they took our money throughout the game, but we get kicked out before it was over.Horrible Bar and really not a sports bar. More of a ber that benifits what the employees want!If you want to watch sports, find a serious sports bar, not this one!Horrible!"], ["Matt R.", "My friends and I go to Sporties a lot. They give you pitcher coupons each time you purchase a pitcher. Then you can turn then in for a free one. The food is your standard greasy bar food that we all love. I'm not sure why other reviewers gave the waitresses sub bad reviews but I've always been taken care of just fine. The outdoor smoking area is heated and large. Lots of TVs too with decent drink specials."], ["Mary F.", "Friday night: not enough servers. Our server was extremely apologetic, but hire more people when you know it's Happy Hour and Friday!!! The beer, Shiner Bock, we ordered was flat. We sent it back with the recommendation of letting the bartender know. However, we just received another type of beer in return. The \"bar\" food: horrible. The jalapeño chicken sandwich: all bread and condiments. We received no water, no silverware and no follow-up service. The Onion Chips were deep fried, greasy and nasty. You could find much better service and food many other places in Lincoln, NE. Would not recommend, would not go back. We know food and beer, both were terrible here."], ["Josh S.", "The waitresses here are completely useless, you have to tell them everything two or three times and even then they just shrug their shoulders. And if that doesn't ruin your experience enough, wait until you get the bill!  $3.75 for a can of domestic beer?  $9.50 for a pitcher of rotten domestic beer?  I didn't see any breasts, where are these prices coming from?! The two TVs that we were watching just suddenly quit working (5:30 on Sunday, middle of the 4th quarter) and I do not know if they are capable of fixing it, but I do know the employees did not care enough to even try.  Food is disgusting and you will invariably receive it 20 minutes after it is cooked (see remark above about waitresses being as helpful as a disease).  The next time someone asks me to sub here for pool leagues, I will just have to laugh it off.  NEVER AGAIN."]], "Green Gateau": [["Kaley Z.", "Love this place!!! Have been coming to Lincoln, NE for four years now for work and found this GEM the first year. My coworkers and I have always enjoyed at least one dinner during the week as well as their brunch on the weekend. Both are wonderful. Never a bad service; wait staff have always been attentive, nice and fun. Food has also been definitely something \"to write home to mom about\"...absolutely delicious!!The roasted red pepper soup is the best I've ever had and is a must try. As an appetizer we get the baked brie which is just melt in your mouth delicious with candied apples inside. The steak is delicious too as it should be in steak country :-)If you visit you definitely won't be disappointed."], ["Gary P.", "We have been to this restaurant many times in the past. It used to be well run with efficient staff. Now, it has declined into a poorly run place. The waiters are extremely slow. When we complained about the sun being in our face, they said the curtains were down and that they couldn't do anything more. Really? Other people complained too and nothing was done. There usually tremendous artichoke chicken was tough and hard to chew. When our friends complained, nothing was done. I really have a hard time believing this place will stay open with poor food and poor service. I hate to see this happen because I have really enjoyed going here with friends or on a date in the past. Hope things change quickly."], ["Hal S.", "OK, another Lincoln NE restaurant under my belt (so to speak). Went here with my dining associate (from work as we are travelling from New York City) and we've been eating at the same half-dozen restaurants for a couple of months. So this is new for us and we were very pleased. We both had fish but I had the Orange Roughy off the menu (not the special) and she had a salmon dish off the menu.  Yes.. you can get good fish in Lincoln! Our guacamole appetizer was first rate, and the service was very good. Even though the waiter appeared to be bus-boy and waiter and brought the desert tray, he never appeared rushed or frazzled. We walked from the Holiday Inn downtown, a few blocks south and one block east so parking was not a problem! When you're on business 4 nights a week for months, you need choices. This will be part of our round-robin of restaurants that we frequent; for sure."], ["Sally O.", "Yum! From the roasted red pepper Gouda bisque to the artichoke chicken.... Both were out of this world fabulous tasting!"], ["Lindsay H.", "We went for brunch several months ago and had an amazing experience. Our waiter was exceptional and restaurant is very cute. I was pregnant at the time so didn't try any of the mimosas or fun brunch drinks but the coffee was great and the service was prompt and attentive. I had the biscuits and gravy - amazing. Better than my grandma's - sorry grandma! Huge portion and even with my crazy preggo appetite I barely put a dent in it. My husband had steak and eggs and finished every last bit. I had an amazing apricot dessert - I can't remember what it was called but it was heavenly. We will definitely be back!"], ["Elisabeth E.", "I was here the other night for dinner and was really pleased. We had a reservation and were seated right away. The atmosphere is cozy with a couple front rooms with big windows. Behind the greeting area is a long bar filled with pastries and delicious looking desserts.Our server was awesome, I really enjoyed interacting with him. So nice and polite and very helpful with gluten free options. At dessert he even gave me a quick tutorial on how to use the blow torch for the creme brûlée as I just bought the same one but haven't used it yet. There is a gluten free menu with a good amount of options and the vday specials they were also willing to try and make gluten free. We ordered the chips and guacamole that was prepared table side and was delicious. The chips were gluton-y so the server brought me out a generous portion of vegetables to eat it with. I ordered the bacon butter fillet which was cooked to an appropriate temperature and was good, sides were also tasty. My date had the ahi tuna and lobster special which was so beautifully plated and he said it was really good. I enjoyed the creme brûlée dessert and he liked his green gateau cake. Overall pleased with food.Food is a bit pricey but I think the quality is there as well as the portion size. I'll definitely be back!"], ["Holly H.", "One of the best restaurants in Lincoln. My boyfriend and I went there for our anniversary last night and had a wonderful time. I had the salmon salad and he had the pot roast. He chose the dessert and I can't remember what it was called, but it was basically a mascarpone cornucopia with a chocolate and caramel drizzle and caramelized pears. I would've chosen one of the chocolate cakes or the apricot torte, but the mascarpone concoction was ridiculously tasty. We also tried the Grey Goose mules and they were delightful. We will definitely return."], ["Paul C.", "We had to make a trip down to Lincoln on a cold Saturday but luckily had planned a stop at Green Gateau before heading back.  The restaurant has a soothing and upscale decor, a pleasant and professional staff and an amazing brunch menu.After much debate (I tried to talk myself into the frog legs but wasn't sure that's what I wanted at 10 a.m.) we went with \"two\" beignets and I got the eggs Oscar Benedict (a traditional Benedict with Maryland lump crap).  By \"two\" beignets, we did not ask how how many were in an order and there were 2 for.  We had one with lemon curd and the other with strawberry jam.  I LOVED the strawberry jam and Chantilly sauce and the beignets themselves were HUGE, fried to perfection - light and fluffy despite the appearance of being doughy.The Benedict was well prepared and the presentation was well executed.The prices for the meal were VERY reasonable and the I am glad we made the trip - definitely a \"to do\" when in town."], ["Ruth S.", "Delicious! Went for brunch on a Sunday at 10am. Got sat right away on the patio. All the food was exceptional. Pancakes were top notch griddle cakes. Hashbrowns were plentiful. Waiter split the check three ways with no problems. Very pleased with the experience and meal!"], ["Stacy K.", "I'll keep this short and simple: GET THE LOBSTER BISQUE. A whole bowl. Then eat all of it, and order about 5 more. Amazingly delicious. Everything else was great too and at a very reasonable price point! Hurricanes were nice and strong :)"], ["Julie A.", "Always have loved this place! Such good quality food with variety and a French twist. Awesome breakfasts and desserts! Make sure to get espresso and a scone to go!"], ["Kay G.", "Fresh guacamole and uniquely craveable warm spiced chips. Made table-side makes all the difference. Truffle fries with three dipping sauces are delicious. Rich, flavorful French onion soup. Silky creme brûlée. Quality coffee. Lots of tasty menu choices. Love the decor and ambiance. Wish they'd rework their Bloody Mary recipe because it's bland, but the fried bacon strip served with it is off the hook."], ["Jeffrey D.", "French fusion, mostly American food.  We stopped in one Sunday afternoon for a bite for lunch.  The portions here can be really large.  Something to consider before going on an all out blitz like a refugee returning from a quest int he wilderness.  The service was good and the atmosphere was not bad.  Parking can be a challenge like anywhere in and around downtown.  Overall, great place for brunch."], ["Taylor R.", "This place deserves 5 stars just for the mac & cheese--gruyere cheese with pasta, chicken, and veggies! Very rich but incredible, especially on a cold Lincoln day.The rest of the experience was great. The wait staff was attentive, even with the 20+ people in our group. The atmosphere is friendly and rustic, but still upscale. It all contributes to an excellent meal.My only regret is that I didn't try any baked goods. Next time!"], ["David W.", "Food art. Food porn. Foodgasm... the vibe was a little iffy. Couldn't quite tell if they were going for fine dining or not.  But it didnt matter. Our server was very farmiliar with all menu options and helpful in recommending some tasty options. I landed on a duck dinner that was FULL of flavor to the last bite. Slid right into a coffee with my creme brulee, leaving me in a food coma. Bring your date!"], ["Katharine B.", "We went for dessert and drinks. At least that's what we intended. I had one of the seasonal cocktails, and my husband ordered a flight of wine. We also selected two deserts (including the signature Green Gateau), but we were so impressed that we decided to take two more deserts home with us for breakfast the next morning. They were all fantastic, but it's no surprise the place shares the name with their signature cake - it was amazing!The wait staff was attentive, helpful, and friendly. Plus, they didn't judge us for taking dessert home for breakfast. Next time we are in Lincoln, we'll definitely be back for a full dinner."], ["Jenn R.", "One of THE most favorite places I've had brunch at in Lincoln. I'd go just to have a plate of their bacon. My dining partner and I were lucky enough to get in on a Sunday after a patiently waiting (we weren't aware of how busy they'd be and that reservations would be highly encouraged). Definitely a place I'd like to hit up again if in the area on a Sunday morning again."], ["Moira R.", "This is my favorite restaurant in Lincoln! I love the atmosphere - it feels like a little tea room. I always get the Pick 2 Combo with the Gateau Spring Salad. This salad is amazing! This is also one of the only restaurants where I order a beverage that isn't water or alcohol - their Gateau Iced Tea is a blend of strawberry and apricot tea and it is a must try! Their brunch is really great as well and they accomodate large groups, which is always a plus."], ["Jessica B.", "My second time coming and it was AMAZING as the first time! The server was a very nice man, talked about his wife. Adorable. He was very informative and funny. The environment is so classy and sophisticated so I definitely recommend dressing up a little. The LOBSTER BISQUE IS A MUST. My boyfriend prefers the red pepper soup because he doesn't like seafood, but if you do, ITS AMAZING. You get a croissant with butter everytime and it's just perfect. So light and fluffy. Yummmmy.I ordered the special Shrimp and Crab! I'm a seafood lover clearly lol. My boyfriend ordered the chicken pasta, I forgot the name. His was delicious as well!And of course we ordered dessert. They present all the deserts in front of you and I think that's so cool. The server explained what it all was. I chose the Green Gateau just because I loved it the last time. And Jacob got the Tiramisu, both so yummy! Can't wait to go back for another special occasion"], ["Nicki J.", "This place insanely delicious! The eggs Benny were to DIE FOR! The pastries and baked items are fantastic, and the service is stunning! Great location, but pretty crowed on a weekend. Definitely a great breakfast spot!"], ["Rebecca F.", "I am a big supporter of Green Gateau! There is a reason GG is established within the community, be it their longtime kitchen staff who know how to create a great menu or  Lori the manager who genuinely cares about your experience! The food speaks for itself. Having worked there , I had the opportunity to try a number of dishes and loved every one of them! My personal favorite was the Croque Monsieur(lunch)/Madame(breakfast)! By far one of the best things on the menu.As a previous server I was impressed with the amount of training they provided as well as the mentorship of their Trainers. Christine was my favorite, she genuinely cared about your success. As with most restaurants there were servers who were only there for themselves but management was always willing to listen to complaints and take action when needed.I will definitely refer GG to anyone traveling through or locals who haven't been. You will be forever addicted, especially if you try the Croque!"], ["Fazle H.", "I came here with some co-workes for lunch on sunday.The portions are very generous for what I was paying. I ordered the corned beef hash and there a few appetizers. Its not authentic french food at all. Its more like american food with a sprinkle of french influence. The only think that french was probably the name of the place and the french toast. i would come back here again since the food was pretty good, price was reasonable and the service was fast and frinedly."], ["Audrey B.", "Delicious Sunday brunch.  I had the Croque Madame with a perectly cooked egg and tasty hollandaise.  The best part of the meal was the bloody mary, which came with a pickle spear and a crispy piece of bacon- unique!  Attentive,  friendly staff."], ["Eva B.", "Wonderful brunch.  The iced tea is a must with any meal.  Don't forget the desert! The staff is knowledgeable and professional.  They enjoy their job"], ["Tender N.", "Another also-ran pseudo bistro.I've long been perplexed by the astronomical rating of this place, and I'm sure I'll get a lot of upset reactions for not joining the cult of mediocrity, but I really don't care.The single worst thing I've ever eaten in a restaurant of any kind in Lincoln is the potato salad at The Green Gateau.  Cold, slimy, and flavorless.  It was as if someone had mixed some steamed onions and boiled potatoes with a milk and fat free sour cream sauce.  No salt, no seasoning, no acid, no flavor at all.  Bad taste memory.  Probably replaced a good one from when I was a kid.  Unforgivable.  I had it as a side with a reuben that was mediocre at best, though I've had a lot of restaurant reubens and they are almost always disappointing.  The Green Gateau was generous enough to inexplicably put diced red potatoes in theirs, just in case it got too close to tasting like something.All arguments about why people eat out aside, it's just not acceptable in my mind to charge these prices when the quality isn't there.  I'm willing to pay good money for good food.  I don't feel like that's the deal you get here based on my experiences.I've been dragged here under protest a few times for family function breakfasts, lunches, and brunches and have never left with any feeling other than disappointment.Redeeming qualities:+ The prices are high for the quality of food, but the quantity is sufficient for a meal unlike a lot of \"fancy\" places. If you can choke it down, at least you won't leave hungry.  Just feeling unfulfilled. + The servers have never insulted me to my face, nor done anything overtly racist at my table.  I've read a lot of over-the-top (probably fake or heavily embellished) reviews just absolutely roasting comically poor service at places.  I haven't been wowed enough at the Green Gateau that the service stuck out to me as special, but also haven't had any horror stories that stick out, either.  If service is more important to you than flavor, this could be your place.+ I didn't get violently ill.  No food poisoning is a really strong selling point for any place that serves food for money and definitely a big reason I didn't go all out one star.  \"Hey, our food isn't poison!  And we have a fancy-ish atmosphere for Lincoln.\"   A great slogan that they can use for free.+ It's like crack for self-proclaimed foodie women in their early 20s who don't know how to cook.  If you have a female date who is still in college or around graduation age, take them here if you're too lazy or inept to make something better at home for them."], ["Andrea A.", "Best brunch in town. You must make reservations if you want to come here Sunday morning though because the wait can be long. The eggs Benedict are great as is the quiche. My favorite is the chocolate espresso muffin, there's nothing like it."], ["Sasha F.", "I reserved a private room for my husband and our parents and siblings for lunch after our small Capitol building wedding (12 of us total). I reserved the room a week in advance with no problem at all. We arrived and the service was wonderful! Food was great and we could not have been happier to end our wedding day here. Can't wait to return!"], ["Jill V.", "I love Green Gateau. The food is excellent with many good choices. I especially recommend the grilled vegetables and quark. I've only given 4 stars because the prices are a bit high."], ["Michael F.", "The service was exceptional, the true standout in our experience.  Blake was our server, a university engineering student, who carried on a great conversation, while guiding us through the food and wine menu.  What I love about a great restaurant is the time that a server will take with a table -- the guacamole made fresh at the table, an interlude to discuss shared experiences, and the patience to allow a table too much time to discuss a dessert.  Regarding the food, I was thrilled that the jerked chicken was powerfully flavorful and legitimately spicy."], ["Jess K.", "The service was super friendly, and when I went, they had some unique dishes. Good quality stuff right there :)"], ["Amanda K.", "We came here for brunch while family was in town, based on a recommendation from my co-worker.The atmosphere is quaint and homey.  It is a little tight when walking through the crowded restaurant, but that's to be expected in an old building.Our service was wonderful.  I can't remember our server's name, but he was very nice and explained the menu perfectly.  I ordered the bloody mary on his recommendation and was SO glad I did!  It came with bacon in it!The food was delicious.  We ordered beignets to share before our entrees came out, which was kind of mistake because they were so huge.  They came with lemon curd and strawberry preserves to dip in.  \"Cloud's of happiness\" is how my uncle described them.  I had the huevos rancheros.  After the beignets, I could barely touch my plate, but the little I did have was delicious!  I'll be returning the next time we have family in town.  I don't think this will become a regular brunch spot just because it requires a reservation if you have any hopes of getting a table in less than an hour.  That does not groove so well with my Sunday morning sleep-in schedule."], ["Hannah P.", "Came here for lunch with colleagues today and was pleasantly surprised by the food! All the soups we got was good, frog legs were decent too, albeit a bit over battered/peppered. I got the French connection with was so good and everybody else liked their food too. The portions were huge by the way. It was interesting that you can get a muffin as a side item, but it was amazing! Chocolate espresso, it's not a side item though, definitely a dessert. For dessert, we split the pear cannoli and creme brûlée, which they torch at the table. They were pretty good but not the best I've had. The bad thing about this place was that there were a lot of flies flying around, not good for a restaurant. But food and service-wised, great experience."], ["Frances F.", "Not worth the wait. Was there on Mother's Day and had a reservation for 11 am and was not seated till 11:30 am, by that time I didn't feel like having breakfast. Ordered a chicken salad sandwich that was bland. Do not recommend for lunch. Didn't get our order till after 12 pm. Very bad planning."], ["Erin F.", "The food here is delicious. I've eaten here multiple times and have always had a great experience. The breakfast crepes are out of this world good. The breakfast muffins are super yummy. You can't go wrong with their lunch you pick two combos. I got a soup (great) and roasted veggies with cheese (perfection). Staff are attentive and super friendly. The only thing that left a sour taste in my mouth is that when I got a cannoli to go one day I checked my bill and saw it was $6. A $6 cannoli is super overpriced and just absurd. It also was mixed with peaches and tasted like margarine and was just yuck. I was not pleased about that."], ["J P.", "Not impressed. I have been a regular for years, the filet tonight was the worst I've had in recent memory, and the creme brûlée was covered with barely warmed sugar crystals. Beware, I may have just caught them on an off night..."], ["Rumil B.", "I've been here a few times with my girlfriend and I've had a positive experience each time.The wait staff is friendly and the atmosphere is fantastic (the interior is way nicer than outside). There is pretty limited parking, and it's been pretty busy each time I've gone (dinner, brunch) so having a reservation wouldn't be a bad idea either. I've only ever gotten the seafood, since I don't usually go out to eat at places and order things I can make myself. The calamari is my favorite appetizer, and I also really like the truffle fries. It's a little pricy as I'd expect a little larger portion for what I pay, and the wait is just a tad longer than I'd like, but at the same time it's good food, and they're serving lots of people. Also, it seems like they're pretty family friendly as I always see children, but they also have a bar and plenty of wines to choose from. Definitely recommended."], ["Heidi I.", "We have been to this restaurant 3 times on our way to Chicago from Colorado (as Lincoln is our 1/2 way stopping point) for dinner. The food is impeccable! The duck sausage is a must and their sauces are totally on point. This is a must eat-at restaurant! So french and so delicious. Major attention to detail down to even the vegetables on the side that every other chef forgets about. Perfection. We'll continue to frequent this restaurant as long as they exist!"], ["Mackenzi M.", "Bad service and terrible management. Tried calling to make a reservation this morning, and was put on hold, and forgotten, three times. After the third time, a manager picked up and informed us that they do not take reservations. Which I know is untrue, because we have made reservations many times before. The only reason we continue going back to this restaurant is for the amazing food - definitely not the service. We have been blatantly ignored on multiple occasions.  Food has been forgotten, and then not brought to us at all. We have had to ask to get refills of water and coffee. And servers have walked past us two, three, or four times before checking back on our table.All in all, the only acceptable words to describe our experiences at this establishment is BAD SERVICE."], ["Max C.", "I've been to this place multiple times and let me tell you... every one of those visits was amazing.  Their deserts are delicious.  Some of my favorite entrees would have to be the Lavosh with Duck and the Stuffed Rainbow Trout!  Would MOST DEFINITELY come back here if i'm in the area."], ["Katy P.", "I love this place. We went here for the first time last night for my birthday. The food was delicious. Our server, Doug, was wonderful. It will now be our Go-To place for special occasions. We really want to try brunch and lunch, too.We had the Calamari to start (mix the two sauces, the hybrid sauce is great), then we each had a cup of the lobster bisque (get it... just do it). I had the french connection, and I have a love for a proper french dip, but this was my favorite of all time. So so so good. Husband got a special which was grilled frog's legs, beef tenderloin, mashed potatoes, and onion strings with a Bearnaise sauce. He was in heaven. For desert, he got the chocolate marquis cake... excellent. I would have tried the lemon cake, but I was really in the mood for creme brulee. It was good, but next time I will get a cake.Bottom line, it was a perfect evening, and we will be back."], ["Mark J.", "I love Green Gateau.  We usually go for brunch on Sundays and this place has some great food.  I love the deserts too.  I don't think we have ever had a bad meal at this place, although the service can be a little slow and parking is horrible.  You usually have to park about a block away, so as long as you go into it knowing you will have to do a little walking, its not bad.  I probably could use some extra walking anyway!"], ["Kathleen T.", "It isn't easy to find an interesting and varied menu in Lincoln.  Green Gateau has that and more.  Our favorite restaurant in Lincoln for any meal.  We don't love the location so try to go at the beginning or end of the hours and have never experienced parking problems.  It can be very busy, but wait staff is prompt, friendly and attentive.  Many years ago, the restaurant decor had the feel of grannie's attic, but is now refreshed and simplified and more sophisticated.  Portions are large so eat half and same room for dessert, because they have an excellent selection.  We like breakfast out, and this is THE place to go.  Our evening meals have been outstanding.  Even their house salad is yummy.  Do give the Green Gateau an opportunity to delight you...."], ["Mark C.", "A neighborhood restaurant for those who live in Lincoln and visitors from out of town.  We booked reservations and visited as part of our anniversary.  Inside of the restaurant is lots of wood and a long bar.  It does not look like much from the outside, but inside was nice.  Great service from Sue who was very friendly, informative, and attentive.  Menu has a good selection and the wine list is fairly extensive.Started off with a 2008 Helfrich Gewurztraminer - decent.  Appetizer:Baked Brie en Croûte -  Mild & buttery-soft cheese with caramelized pears and cranberries, baked in a french pastry shell, served with crostini and balsamic truffle glaze - tastyLobster Bisque - absolutely delicious, creamy and great flavorEntrees:Macaroni and Cheese -   Green Gateau serves a crazy Mac and Cheese, you pick your ingredients - large macaroni sautéed with cream, butter, sharp cheddar and gruyère cheese. baked au gratin with sourdough bread and parmesan crumbs. choose up to (2) ingredients: truffle oil, ham, green chili, salsa,lobster sauce, bacon, chicken, duck sausage, caramelized onion, prosciutto, smoke rib ends, mushrooms, jalapenos, spinach, broccoli, tomato or blue cheese - Wife really liked hers - she went with truffle oil and chicken.Candied Walnut Crusted Salmon - Norwegian salmon fillet seared with a candied walnut crust, served over sauteed spinach and wild rice pilaf, finished with lemon zest vinaigrette. - Mine was good, but would have liked the candied walnut crust to come across a bit stronger.  Wild rice pilaf was good as well as the spinach.Dessert:Chocolate Marquise - Alternating layers of creamy chocolate Marquis, bittersweet chocolate ganache, mocha butter cream and dark chocolate cake. Topped with chocolate ganache, and chocolate curls.Lemon Italian Crème Cake - Creamy layer of lemon mascarpone filling between 2 layers of moist cream cake and dusted with powdered sugar. Served with raspberry melba.We liked both our desserts.Worth a visit if you are looking for a place to try in Lincoln.Side Note - Not a lot of parking.  There is a small parking lot on one side of the restaurant.  As you approach on the one way street, the lot is immediately before the restaurant, do not go fast or you will be past the entrance before you know it and have to drive around the block to try again."], ["Veronica H.", "After a week of restaurant mishaps the Green Gateau was just what I needed! The food was wonderful, the service was impeccable, the prices are great, and the bloody marys are fantastic! I don't have enough good things to say about the Green Gateau. It's always been one of my favorites, and it always will be! They never disappoint! Highly recommended!! Go Now!"], ["Echo D.", "Food and price are just  ok. I want they cook small portion and lower price. Im not a pig"], ["Michael G.", "My favorite place to dine in Lincoln. Every menu item I have tried has been wonderful. If you like duck, don't miss out on their Duck Bangers and Mash. I would also wager that there isn't a better Mac and Cheese in town. Add the chocolate ganache to finish sweet.I can personally recommend brunch, lunch or dinner. Also great for takeout."], ["Justin S.", "WONDERFUL!This place has something for everyone. The food and service is exceptional. I had the \"The Chips\". The fish was cooked perfectly and the fries weren't too salty. We had a refill on our drinks before they were even half empty! The Gateau Tea is a MUST!This is a great place to take your family, parents, business associates, or even a date!I can't wait to go back! I wish they had a location in Omaha."], ["Melissa M.", "High quality and unique food. Great place to try something different. This is a hometown favorite. The breakfast is awesome. Everything is good so you cant go wrong."], ["Molly K.", "This is one of my favorite restaurants in Lincoln. The lobster bisque is amazing! There is not any lobster chunks but you can still taste the lobster. A bowl of the soup tastes really expensive but it is only $4. I usually get the french connection minus the mushrooms and onions. It's basically a french dip sandwich with bacon. They have really good fries and I am picky about sides.  I also like their blue cheese potato salad. I haven't tried any of their desserts because I'm too full after eating dinner."], ["Paul W.", "I've always loved eating here. Never had a bad experience. The food is always good, the staff is friendly and the pricing is great. It has a lot of personality and an European flair, which is reflected in their menu. The location is not the best for larger groups as it can make parking difficult and sometimes the restaurant can be too dark and feel a bit claustrophobic. Having said that, still gets 5 stars."], ["Heather M.", "I ate here for the for the second time with my husband. We were seated in a quiet booth which is exactly what we were hoping for. The atmosphere was very quaint semi romantic.  We started with the truffle fries which were good, but we've had better they were lacking a little flavor the first time I had them here they were better. I had the tasters trio that started with the seafood bisque that was amazing as usual. My main course was the Orange Roughy. I substituted the summer squash and zucchini for asparagus. My fish was lacking a little in the flavor dept however the sauce was very good and my asparagus was very woody. My husband had the Duck Bangers and Mash. His was delicious!  It's very hard to cook good duck especially for someone whose been hunting it for years! For dessert I had the Creme Brule again I've had this before and loved it however this time it had no vanilla so I sent it back and they were very gracious and took it off the bill. My husband had the long horn filled with marscapon and pears with caramelized pears on the side and a chocolate sauce.  To die for! I had one taste after mine was sent back and it made my mouth smile! Overall it was good just an off night for the chef. We will definitely be back!"], ["Elmo J.", "Easily in the top five best restaurants in town.  Be sure to grab a bowl of their roasted red pepper soup - it's life changing!  They also make a fantastic chicken fried steak that's is made to order with fresh meat.  Also check out the fish & chips, very good and the fish is always fresh.  The truffle fries are out of this world.  Service is usually good, but I have had very bad service on a handful of visits."], ["Lisa I.", "My favorite restaurant in Lincoln! The food is fabulous, the service is great and the atmosphere is simply wonderful!  I haven't had anything that I did not love and I have been many times! The perfect date place, or a great family place as well!  I highly recommend it!"], ["Jennifer M.", "My first experience with the Green Gateau was almost 20 years ago on Valentine's Day.  The food was wonderful, and the dessert sold me for life.  Though I no longer live in Lincoln, I visit Green Gateau every chance I get. With all the years of scrumptious meals, I'm not sure where to even begin.Food: Those who have read my other reviews, know that I adore desserts. I don't say this lightly when I say that Green Gateau is one of my all-time favorite places for dessert. I always have a terrible time deciding between the signature Green Gateau cake and the Chocolate Oblivion Truffle Torte, my two favorites. The Green Gateau may not be a favorite for everyone, but I love it, even though cake desserts are rarely on my list of favorites.I've had all types of dishes, from a cheese platter, to full meat main dishes, and never been disappointed. The presentation of the food is always elegant, though the prices are far from standard fine dining. I'm an avid tea drinker, and Green Gateau has its own special blend of strawberry and apricot flavors that I order every time. It's popular enough that the local coffee shop, The Mill, sells the blend (or they did last time I was there). Atmosphere & Service:The atmosphere of the restaurant is quite charming, offering various rooms for more intimacy than a fully open restaurant. The decor is reminiscent of an earlier era European eatery without being gaudy. The servers are always pleasant and competent. You can enjoy a meal in casual wear or your finest without feeling out of place.  If you're looking to dine on weekend night during prime time, I recommend reservations. On a holiday like Valentine's Day, reservations are a must.Parking:There is off-street parking next to (off 10th Street) and behind (off L Street) the restaurant, a boon for the downtown area. It might be hard to get a spot at a really busy time, but otherwise we've never had trouble finding a spot in one of the two lots.Overall, I recommend Green Gateau for any meal of the day.  My personal favorite: Stop by for tea and a mouthwatering dessert at high tea time and relax with a friend."], ["Tiara M.", "Oh boy. I went to Green Gateau for lunch today with my husband. One of my biggest pet peeves is when a waitress is critical of my selection. \"Yes, for now I just want Ice water while I look at the menu\" \" Is that all?\"\" I'll start with a cup of soup and a coffee and a croissant.\" \"Just the cup of soup then??\" Its like, yea, I get it, you are computing your tip in your head based on the final anticipated bill, you have made that excruciatingly clear.  But here's the thing, If I find you attentive and friendly, and I only order a 6 dollar lunch, I will tip 100 percent instead of 20. I think tips should start at 5 bucks, no matter how small of a meal I order. But I only gave my waitress 10 percent  today, and I regret  giving that much.The lobster bisque was salty and my croissant was stale. I told the waitress the croissant was stale, and instead of whisking it away and bringing me a fresh one, she said  as if she had to personally go and make one from scratch \" did you.....did you want me to get you a new one?\""], ["FS O.", "I could write a lengthy review, raving about the place, but will simply say that it is the best food in town. So often I find myself saying that a place had good food \"for Lincoln\" since the cuisine scene is pretty bad here. But the Gateau is truly good by ANY standards. Truly wonderful fare, great service, and prices just high enough to keep out the riffraff."], ["Adrian B.", "This restaurant has a touch of European quality to it without being pretentious or over priced.  The breakfast brunch is the stuff of legends and is packed but well worth the wait on weekends.  I mainly visit this place on a weekday for a lunch because I love the peppercorn battered Mahi-Mahi fish and chips.  You get 3 fillets with an appropriate pile of fries to compliment the dish all for a very affordable price.  They have their own unique and tangy homemade tartar sauce and malt vinegar upon request.  The beautiful old wood decor and various different rooms to eat in give you a real sense of intimacy.  The waitstaff are very efficient and well dressed like a proper restaurant should have, something often lacking here in Lincoln.  This place is an institution and their dinner menu is splendid.  The Roasted Duck breast never fails to impress. I for one am not a dessert person but you have to indulge in a Creme Brulee which is heated table side."], ["Lisa J.", "Great for brunch! We went on a weekend, the day after a football game, and because we got there before 10, we didn't have to wait to be seated. After 10, there was a massive line.Food was wonderful. Their anniversary special of $5 for specific breakfast dishes was a great deal. Be warned that the French Slam only comes with 1 egg, which was not quite enough for my husband. But thankfully my strawberry-cream cheese filled French toast was more than enough for my husband, my daughter and me. Service was OK -- it was a bit busy, so we had to wait a bit for our food.And be forewarned that they do not have a kids' menu. We ordered eggs and a side of fruit for our daughter, and that came to $8 -- more than my meal.We'll definitely be heading back there when we are in town for another game."], ["kaitlin p.", "This place is my go-to place in Lincoln.  All their food is fantastic, and their handmade burgers are a thing of genius, (I always ask for mine on a croissant, so delicious).  Also, the place itself is very quaint, perfect for any occasion.  There service is usually pretty nice, and there are some servers that are spectacular (Jessie, that's you)"], ["Marina G.", "Best food and service in Nebraska and all neighboring states!!!I would love for them to be open all the time!"]], "Mellow Mushroom": [["Robert L.", "My wife and I have been to the MM in Gatlinburg several times, and we were elated to find that one was in Lincoln, NE on the way home from Denver. We found the location while driving through Kansas, and spend a good 2.5 hours arguing with our stomachs about when we're going to eat.So we ordered maybe a little too much, but we were fine with that. We stared with the buffalo wings and a Muffelotta. The wings were ok, and the muff was pretty good assuming you drown it in marinara. (The wife and I both are not huge fans of olives, and it turns out this thing was covered in them -- not the restaurants fault).We also ordered the \"House Special\" pizza. I could not get that thing in my stomach fast enough, it was simply amazing!The only real downside we can see is that we ordered this shitty amber beer made in Oklahoma, which tastes like giraffe crap and pine trees. I would know what this tastes like.Good times and good food!"], ["Linsey O.", "Just tried the Mellow Mushroom yesterday with my downtown buddy. My favorite part was the atmosphere, when you walk in the door you feel like it's the 60's and I felt like a hippie. Loved it! The drink menu was interesting, lots to choose from. I ordered the TKO and it was delicious. Perfect mixture of tangy and sweet. We ended up ordering the Hummus appetizer with pita bread, it was delivered to our table quickly and was fabulous! The bread was warm and perfectly chewy. Then the time came for our pizza. We ordered a 14\" Maui Wowie to share (six slices). What an interesting combination! One slice in we noticed a hair on our pizza (eek!!) Long, wavy and blonde. But whatever it happens! The manager was just walking by and noticed our faces, quickly asked what was wrong and had our pizza re-fired right away. She even took it off our bill! I feel like it's a good day if a hair in your food doesn't ruin your experience. Well done folks!"], ["Jessica H.", "Yia Yia's has been one of my favorite Lincoln pizza stops for a long time but now Mellow Mushroom is a contender.  When it comes to pizza, what matters to me is the crust and having a unique blend of toppings.  Mellow Mushroom offers just that.What might nudge them to the top? Customer service and atmosphere. What a fun, trippy, happy place to be! I'm trying very hard to force myself to visit downtown and the Railyard now that it's full of new restaurants, events, shopping and people, and this proved to be a great adventure.  The awesome colors and decor and the laid back atmosphere make it a fun place to hang out while Yia Yia's is a dark bar you can't take a family too.  Don't get me wrong, love Yia Yia's. Always will.  It's a good place to meet friends for dinner for drinks and pizza kind of place. My friend and I showed up on a busy Friday night.  We were told we'd have to wait at least 25 minutes but we were actually seated quickly. My very first impression? I was worried.  The kid seating us looked to be about 14.  However, he proved me very wrong and was professional and courteous!  Then our waiter was an \"awesome dude.\"  Shaggy hair, pretty blue eyes, peace love shirt and a great attitude.  He knew the menu well, he was very attentive, overall the service was fantastic!So lets get to the real reason we're all here, the food.Drinks! It was ladies night so we each got a drink. My friend had the classic margarita and I had a chill pill. Trust me, I needed it.  I'm a fan of gin, and the addition of the cucumber was unique and fresh.  Drinks are kind of pricey at $7 for each small tumbler but it was a nice splurge. Something unique.  For appetizers, my friend and I shared the stuffed Portobello Mushroom (portobello mushroom cap stuffed with artichoke hearts, feta cheese, sun-dried tomatoes, spinach and mozzarella. Baked and drizzled with a balsamic glaze.) and the Capri (vine-ripened tomatoes, fresh mozzarella and basil drizzled with a balsamic glaze). The mushroom ($9) is pretty pricey for what you get (one mushroom, which the waiter was very clear about).  It was good, not an over the top experience, so for the price, I wouldn't get it again. Now the capri was wonderful.  It had a larger portion, the mix of flavors fantastic, herbs were fresh, the mozzarella so yummy and smooth.  To be honest, you don't really NEED appetizers because the pizza will fill you up but I love trying new foods and I wanted to have some to take home.  For our pizza, we split a large.  It took some doing but we managed to each eat three pieces, so we both took home a couple slices.  The waiter let us know we could do a half and half so we had half house special (which is everything but the kitchen sink) and holy shiitake pie.  I could have eaten probably any of the combinations on there and look forward to returning to try them out.  If you're wanting something a little traditional (i.e. toppings and red sauce) the house special is a great option. The sausage and bacon, heck all the ingredients, are fresh and yummy.  The holy shittake was BOMB!  Olive oil and garlic base, Shiitake, button and Portobello mushrooms, caramelized onions, mozzarella and MontAmoré cheeses. Drizzled with garlic aioli and black truffle oil. Garnished with fresh chives and shaved Parmesan.  Yeah, get this! The crust (whole grain) was also very taste.  Overall it is a little spendy but it was a good experience. I will be back!"], ["Brandon A.", "I think Mellow Mushroom is at a solid 3.5 stars. I went with 4 solely because of the pretzel appetizer. I had gone twice before and didn't even consider getting an appetizer. The other day someone at my table ordered the pretzels. I was expecting little pretzel bites... whatever. These things were big pretzels and they brought a lot out! Dipped in the beer cheese sauce is a dangerous combo. Another veteran move is to save the beer cheese after the pretzels and use it for your pizza crust. As for the pizza: pretty solid. Definitely a fresher, less greasy type of pizza. You can't go wrong with the house specialty or buffalo chicken. I also love that they incorporate bacon a lot. For a vegetarian option, we also tried the kozmic karma and it was pretty good. Brat"], ["Michelle S.", "Great, great pizza. The Holy Shitake Pie is holy moley delicious. Meatball app is tasty as well and service at the bar was great. Tons of great beer options on tap. Highly recommend a visit to the Haymarket location of Mellow Mushroom!"], ["Dayna A.", "My first Mellow Mushroom visit. Restaurant was clean, wait staff friendly and quick, and my food was served promptly (even though they had to make a new pie for my order of a slice). Tie dye cheesecake was awesome as well--liked the orange zest as an addition to the plain cheesecake."], ["Genevieve W.", "Very good pizza. Really artsy place and relaxed. Great and friendly staff did have to ask for a refund though. Food took a while to get out but it was worth the wait. The cosmic karma pizza was very good. But everything there is sooooo expensive. That is the main drawback. Overall I was very pleased and will be coming back. Great place to get together with friends and enjoy good food."], ["Erik Y.", "This place would make your hippie parents/grandparents proud.  You walk in and instantly feel like you are on an acid trip.  Lots of color and bizarre sculptures all over the place.  The food is excellent although I have only ever had the pizza. The Thai pizza was awesome. Love the Thai chili sauce they use. The Maui Wowie was great too. Very fresh. I personally did not care for the Holy Shiitake pie, it was a little to earthy for my taste.  Overall it's a great place for food and a stoner trip ambiance.   They should add that category to yelp right?"], ["Miguel D.", "I had the Maui Wowie deep dish. The chicken was so tender and juicy that I almost forgot to notice the pineapple and delicious crust. Overall great experience. The Moscow Mules could use a little more punch, but other than that it's a great choice for pizza!"], ["Heiko S.", "Enjoyed the Spinach, Mushroom, Tomato calzone.  Good favors and nice thin chewy crust.  Recommend."], ["Chris S.", "While there aren't a ton of Mellow Mushroom's across Nebraska, there are in the country and this one is no different than the others. While bringing a cool, fun, upbeat atmosphere, the pizza here is average, at best, although after a football or basketball game it remains packed, regardless. They've done a great job with the location here and if you are coming to drink, grab a salad and eat pizza you'll think the pizza tastes far better than if you were sober. However, if you are with a large group or kids, there's a place for you here. It a fun place to eat, just don't come here for the food."], ["Courtney M.", "Went in on a very slow Tuesday night, the restaurant had maybe 5 tables seated when our group came in (8 people). While the server was very friendly, we were amazed at how long we waited to get our drink orders taken. Then how long it took for the drinks to get to us. Once we ordered our food it took an insanely long time for our food to come out...remember there were maybe 5 other tables, and most of them were finishing their meals when we arrived. Several people in our group ordered wings but when they finally came out, they were slightly warmer than room temperature. While they tasted good, for as long as they took to come out they should have been hot. The pizzas came out nice and hot and while most were yummy the house combo was pretty flavorless. We were surprised that the sandwiches came out after the pizzas. I'd say that we'd be back, but we won't. Based on the \"speed\" of service if you're attending an event near by, I recommend coming in well before event time or going somewhere else. If they're that slow on a slow night I can only imagine what it's like when they're busy."], ["Gabriel G.", "Summary [4/5 Stars]:The food was absolutely delicious. Some of the best pizza I've ever had in Lincoln. The catch? You'll want someone else to pay. The medium pizza costs upwards of $20 (for 6 slices)... which really puts a damper on the evening if you have a large appetite. Food [5/5 Stars]:I had the Mushroom Stew alongside slices of the Mellowterranian and Hawaiian pizzas. Everything was filling and incredibly scrumptious. Value [2/5 Stars]:If you and a friend are going out for a big dinner, stay away. If you have an adult's appetite, your ticket will end up being $45+ (before tip). The food may be filling, but it's not quite filling enough to warrant a half-Benjamin price tag. This is really what stops MM from making it to 5-Stardom.Customer Service [4.5/5 Stars]:All of the employees, especially our waiter and hostess, were incredibly friendly and helpful. The smiles are just as much part of their uniform as the tie-dye shirts. If you don't tip atleast 20%, even on your large bill, you're heartless.Atmosphere [4.5/5]The interior is really something else. The entire restaurant's structure is built to look like the underside of a mushroom... and the walls are covered in funky murals. Though perhaps not a great place for a business meeting, it's a whole lot of fun."], ["Jordan J.", "The atmosphere at Mellow Mushroom is straight out of Austin Powers. It's fun, inviting and fosters an environment that everyone will love. My only experience here was on a balmy Saturday in January. It was about six hours prior to a concert across the street, so it was only about a five-minute wait for five people.The food was reasonably priced -- except the pizza, which was far too expensive, even for a specialty pizza joint. It's a shame, though, because the pizza was almost* delicious. The waitress warned us that the kitchen was abnormally busy and it would be about 30 minutes to get our food. No sweat; we were in no hurry. However, when 30 minutes turns into over an hour to get pizza, it becomes a problem. It's like they weren't prepared for someone to order a few 'zas. When it finally arrived (with no genuine apologies for the wait), we found that the pizza was rather burnt. *It was edible, but would have been much better without the char. Not a great first impression for a place with such an inviting atmosphere. It wouldn't be my first choice for pizza -- due to price, wait time and the way the pie was prepared, but I'd give it another chance and order something other than pizza."], ["Laurel C.", "Mellow Mushroom is like the pizza joint on your corner that sucks but you still go because it is there. The pizza is always bland and the beers couldn't be more expensive, yet you find yourself there because of location. Tonight I showed up at 9:15 only for the manager Jeff to tell me they decided to close early. I should have told him to close for good because what he lacked for in courtesy he made up for in rudeness. Don't go to this place as they don't care about you and certainly don't care about quality of food. I tolerated poor service and taste for location- place is a complete joke. Please do yourself a favor and order Dominoes."], ["Lauren R.", "For those not familiar with the chain, you'll think it's fine, so go and enjoy craft brews and yummy pizza.  If you are an out of towner/non-Nebraska native who's lived in the south looking for your nostalgic Mellow Mushroom experience, curve your expectations...let me explain:It's a Mellow Mushroom not in the south.....so they don't know any of the \"older/classic\" menu items. I had to explain/special order a \"Jamaican jerk chicken pizza\", our medium pizza ended up being around $36 (jerk chicken, pineapple, and we added onions...how is that an almost $40 pizza??). Not to mention our pizza was doused with onions and pineapple but only had about 10 pieces of chicken on the whole pizza, dude...that chicken was like $7 what the hell?  If you lived/been to states that have more established Mellow Mushrooms, it's standard that it's an off menu special, with a shit ton more chicken on it...oh well.  Either way their jerk chicken sucked reguardless, I would't call it jerk chicken at all...don't know if it got midwesternised or what, but barely any flavor.Not worth the special trip to lincoln for us personally, we'll save our next Mellow Mushroom trip when visiting ATL or the like.Two stars cuza) excellent craft brews as their chain is known forb) their honey wheat crust is still yummyThe real mellow mushroom menu used to be: durhamtakeout.com/cgi-bi…"], ["Kassy E.", "Mellow Mushroom is an EXPERIENCE! Everything from the way they place the pizza on the table to the decor is thought out.I have tried the Thai Dye (my personal favorite), Cosmic Karma, Holy Shitake, and Veggie Lovers.  I have also had the Ruben Sandwich-TO DIE FOR- and now have the problem of wanting to order a sandwich and a pizza.The super fun thing that you can do here is split a pizza in half with two of the flavors so you can try more than one- then you can get through trying all the flavors faster (because believe me you will want to try them ALL.) They were even nice enough to split our pizza in half the other way with cheese and no cheese for my husband and I.They have GF crust options, Vegan cheese options, and even Tofu that you can sub for the meat (it sounds weird, but totally works.)The thing that strikes me even more than the food, though, is their customer service. One time when we were there they messed up and put one wrong half on our pizza. It wasn't a big deal to us because we had wanted to try that one too, but before we even had the chance to notice it, they owned it and told us they had another large pizza of the other flavor in the oven for us. When they brought that out, they realized that they didn't have any cheese on the one half, so they made us another medium pizza of that flavor with the cheese (BOTH for FREE.) Needless to say we left a good tip, but the way they handled it was really impressive.The one catch to this place is that it is really expensive.  We normally get the medium and polish it off wanting more, but not wanting to pay for more.  If it was cheaper, I would probably buy stock and go everyday."], ["Travis F.", "I'm so disappointed! We were really looking forward to eating here. Everything we ordered was all over the board, from \"outstanding\"to \"You've gotta be joking\". First, we ordered drinks. I got a draw ($4 very fair) my wife got a drink called \"Strawberry Fields\" and it was awesome! We ordered a Muffaletta Cheese Bread appetizer and it was EXCELLENT! If you like Muffalettas you have to give it a run. Unfortunately, that's is where they peaked. My wife ordered a Mole' Chicken Burrito off their 'limited time' menu and the chicken was so dry, she had to order extra sauce and sour cream just to get it down. The flavor was good, but dry chicken? Come on. I ordered a 10\" \"Mighty Meaty\" pizza and added 2 extra toppings... $20 YIKES-O-RAMA! Now, don't get me wrong, I'll pay for good pizza but this wasn't it. First it was burnt on half of the bottom. There was not much sauce and the flavor was just so-so. The place looks nice and is very clean. The chairs are cool (for a while). They look like mushrooms, but after 20 minutes they feel like medieval torture devices. For the money ($61 for 2 dinners and appetizer and 3 drinks), I would skip this place and go eat somewhere else."], ["Jonah K.", "The pizza is good, and uses fresh ingredients, but overall, the food is overpriced.The last two times I have shown up at Mellow Mushroom, it was during advertised business hours. The doors were locked, and even though there were customers eating, a server came and told us they were closed.  It's kind of frustrating to make a  20-30 minute trip across town only to be turned away.  For that reason, I will never eat there again."], ["James W.", "Stopped in for Dinner with the Wife and our son yesterday for dinner, we each got a small pizza and got our son the meatballs with Marinara and Mozzerella.  We've ate at Mellow Mushroom in North Carolina but this was our first experience here in Lincoln.  I got the Mighty Meaty which has always been my favorite.  It was good but definitely not as good as I recalled.  They also forgot to bring my wifes side salad she ordered which wasn't a big deal as long as we didn't have to pay for it obviously.  The service was a bit lacking but the gentlemen seemed nice enough, just lacked some efficiency.  I would definitely return just based on past experience with the chain and hope for a better experience overall."], ["Jessie D.", "Best pizza I've ever had!  Love the crust and so many topping choices.  Kosmic karma is my favorite"], ["Jason Z.", "Nothing spectacular here.  After word of mouth raved about this new place, I tried it.  The pizza I got was $pricey$ for the amount delivered.  Also, the crust was burned, but since the service was slowwwww I decided to just eat it and be on my way.  For the money, I'll pass and go somewhere else in the Haymarket.Nothing to rave about, just new establishment buzz."], ["Katy B.", "Went in on a cold windy afternoon. Service was friendly and prompt. We started with hot wings for an appetizer. They were good, but I prefer my wings grilled or if they are baked like these were... I like when the skin isn't just soft and gooey feeling, but has a sear to it. My house side salad was alright, I got it with the oil and herb vinaigrette. For out meal we split a small (10 inch) pizza with red sauce, mushrooms, spinach and vegan cheese. I really liked the marinara red sauce they use, it tasted really good. The pizza was good, we both liked the crust and toppings. For vegan cheese.. it was good. Not my favorite vegan cheese I've had, but I appreciate having the option! Would definitely go back and try some other things out on the menu."], ["Don M.", "Stopped by for the first time today and had the Mushroom Club Hoagie in the small size.  I have to say it was delicious and more than enough for lunch.  It was too big to even get my mouth around.   Service was relatively quick, though our server had a bit of a problem getting our check sorted out when it was time to leave.  For having the name \"mellow mushroom\" it isn't mellow.  The music was loud and the place was hopping! The music was almost too loud for good conversation.Looking forward to going back and trying the pizza, salads and appetizers."], ["Liz H.", "I love pizza and I loved this restaurant. I got the soft pretzel appetizer with the beer cheese dip which was awesome. Probably didn't need the dip for an extra $2 or whatever it was-the pretzels were good enough on their own. You can do half and half of any pizzas (we did the Maui Wowie and their BBQ Chicken) both were very good. Food took a little while but the waitress explained it would as wood fired pizzas take a little longer than regular oven baking. The place seemed overstaffed but we assumed they were still just training a bunch of people. We sat at a high top table which normally I'm fine with but the stools seemed to be several inches too short for the tables which left me feeling uncomfortable. Overall, an excellent addition to the new Railyard area and I will definitely be going back!Oh- and I heard the waitress tell the table next to us that they serve pizza by the slice at lunch so it wouldn't take so long over the noon hour!"], ["Tracy K.", "Pizza was great and lots of local beers to choose from!"], ["Jason D.", "5 stars for atmosphere. and nice people .4 stars on the flavor, texture and variety of pizza.2 stars on the skimpy amount of toppings... 5 stars on the beers and drinks"], ["Matt S.", "Do not order the white pizza.  It is horrible.  Loaded with onions.  Everyone talks about the pretzel appetizer.  Average at best.  The only reason this place survives is because it is located next to the stadium."], ["Dan W.", "Fun place, unique pizzas, always a pleasant staff. It is a fun place to experience."], ["Julie S.", "I really liked this place. The atmosphere and staff were great. You could watch them make the pizzas, they throw the dough back and forth and up in the air. Pretty cool when it's a large pizza. The menu gives you a lot of choices. I liked that you could order two of their specialty pizzas on one pizza. I would go back."], ["David R.", "If you would like to be more than a Nebraskan and have a taste of traveling without the expense of gas, airfare, rental cars, transfers to the port or taking a cruise ......you have landed and will be enjoying handcrafted cocktails not even found in LA.  Today, tomorrow or when you are seeing top talent playing at Pinnacle Bank Arena, the mellow mushroom is a must.  If visiting Lincoln Nebraska, the Haymarket and the Railyard and need a taste of hippie made modern with great wings and chocolate cookies to die for.......the Mellow Mushroom in Lincoln Nebraska"], ["Andy B.", "I went to Mellow Mushroom for a lunch meeting, and thank goodness, because if I had gotten the bill and was paying myself I would have been upset! Before I even talk about the food (which was average) the price is what you have to know about. We had 2 side salads, a medium (14\") pizza, and soda's - the bill with a 20% tip was...$47! In Lincoln, NE I could easily feed a family of 4 for $47. The pizza alone, 6 pieces mind you, was $23, and side salads were almost $6 each. And, on to the food. I had a Caesar salad, which was good, lettuce crisp and fresh, good dressing. The pizza was their BBQ chicken, and it was average at best. The crust is thin, but instead of being crisp it was chewy, nearly wore out my jaw trying to eat it. There was very little chicken on the pizza, the sauce was good, but not enough of that either, and not a lot of cheese. I don't need my pizza to be overloaded or anything, but for $23, I would have expected it to have a LOT more toppings. The service was great, very friendly and helpful. They did a good job of keeping up with our drinks, brought the bill right on time, etc. There are plenty of places to get Pizza in Lincoln, and across the country, that have better food for a much better price. Unless I hear that MM has significantly lowered their prices, I won't be going back."], ["Kristine N.", "Pretty good restaurant but it's pricy. Garlic bread appetizer, yum, can't go wrong with that. Ordered a lil chef salad to start and it was huge! I couldn't even touch my main course after the salad. I had the jerk chicken hoagie and it was good but pretty spicy. Came with lots of peppers and onions. My coworker ordered a small pizza which came with 4 slices and it was $14. Crispy, delicious crust though. My glass of wine was $6. That's pricy for Lincoln but it was good."], ["Leslie K.", "Tried out the Mellow Mushroom last night.   Hmmmm, long wait with a texting and waiting list that had its issues.  45 minute wait, but great pizza!  The wings weren't so good, nor the margarita, go across the street and get carry out wings.  The music pretty loud - and I like music!  Wait staff pretty good, owner there and conscientious of customers and delay.  But, great pizza."], ["David L.", "The pizza and pretzels are great.  This would be a great place to hang out before a husker basketball game."], ["Ian H.", "Not too bad, lots of hipsters working there though. Stupid hipsters ughhhh!!! Close to the stadium,  getting ready for the neb-miami game."], ["Nathan F.", "The food here is pretty good, but it is fairly pricey for pizza. Service is good, and they have a wide selection of choices. It is located in the Railyard entertainment area, for those out of towners who read this, that is a fun new bar and restaurant development in Lincoln.  Good selection of craft beer and if you haven't tried I would recommend it to see if you haven't tried it before, but expect to spend around $30+ for a pizza."], ["Ashlie K.", "We ordered the pretzel appetizers with beer cheese dip. The pretzel are made fresh and are super tasty. The calzone I had was awesome and you get two huge pieces, two people could eat one order. Another person ordered pizza which was also awesome. They make the pizzas fresh, you can watch the kitchen make the food. You are warned that it takes about 25 minutes for pizza. Waitress was phenomenal and the owner was on site making sure everything was going well. Cool atmosphere, very groovy."], ["Shimmy G.", "Update: the service has drastically improved  since my first few visits. Now the quality of service is up to par with the quality of the food!"], ["Lauren A.", "This is my favorite restaurant in the new Haymarket. It is expensive, but the options are endless! I recommend building your own pizza (or calzone). My personal favorite is a cheese pizza with avocados and black olives. Yes. It sounds weird but trust me, try it! The crust is also adds to the greatness - perfectly crisp and helps with the decision to eat another piece (guilty!) For an appetizer I always get the spinach artichoke dip and again, delicious. I am not one to eat dip without something to put it on, but I could eat this plain. Yum.Lastly, the only reason I gave it a 4/5 instead of a 5/5 is because the waiters are kind of slow moving or \"mellow,\" if you will. But that doesn't have to be too much of a bad thing because it fits with the theme of the restaurant."], ["Nicole G.", "I first discovered Mellow when I lived in Texas. Their pizza and build your own salads but their service is terrible!! Every time I come the hostess stand seems to be a site of chaos and confusion; waits are always long; I've often been overlooked for customers who came in after me;it commonly takes over 10 minutes to first see a server at your table; 20 minutes for a cocktail;and while I understand pizzas are made to order 45 minutes seems a little extreme. Ordering take-out is nearly as stressful as the hostesses take your order at the stand in the midst of all the noise and chaos so they can't hear you on the phone nor are they familiar with the menu. Frustrating to lime the food so much but pay so much for terrible service!"], ["Andrea B.", "I have to give it all 5 stars because I have no complaints. We stopped in for lunch during the Husker Spring game and it was packed but the bar had plenty of seats so we sat right away. I ordered a Butterfly drink that was delicious, strong, and refreshing. The bartender checked our IDs, said hi using our names, and introduced himself. It was refreshing and personable. We split the stuffed mushroom appetizer, and a meatball hoagie. Both were delicious! This will definitely be on the list for a husker day pit stop."], ["Heather J.", "Food was good and unique, however, the price is too high and the service is terrible. First they lost our order ticket, then didn't even offer to try to make up for it.  Once we were done we waited forever for our the waitress to come back which she never did. We finally gave up and tracked someone down to get the check.  We were very close to leaving without paying.  I will never go back."], ["Janet L.", "It's all about the crust. Best pizza in Lincoln, hands down. Moved here from Michigan 2 years ago and was startled to find myself in a pizza vacuum. Never knew pizza could go so wrong. My husband and I have been hoping for a good pizza place in town. First trip to Mellow Mushroom I was hooked on their pretzel appetizers. The bread was so flavorful and had a fantastic texture. Though they are on the expensive side, 2 pieces fill me up. On a recent visit, the bread was a little too dense - didn't seem to have developed to their normal standard. However, since I've been there several times already, I'm giving them 5 stars."], ["Jodi F.", "We've been to the Shroom a couple of times now, and I have to say, I am impressed. I love \"different\" pizza, stuff that you wouldn't normally think of putting on a crust, so I'm right at home. The crust is good - thin & crispy with a nice thick edge. Service is quick and always friendly. A definite \"keeper\" for us."], ["Phillip J.", "Very good pizza.  Great beer selection.  Good wings.  -1 for being expensive."], ["Jon K.", "We decided to try something new and we ended up very disappointed. I have a pet peeve with restaurants putting Mac and cheese on the kids menu, then serving them Kraft Mac&cheese out of the box. So we end up paying $5.50 for boxed Mac & cheese from a $0.99 box. Twice! (2 kids) Although they did get chocolate milk.We wanted to share a pizza so we ordered their Mellowterranean. If, you like your chicken dry and your pizza crust tough then this pizza is for you. $22 for a medium pizza is not a good value for what received. We will not be back.The service was just ok, with an only somewhat busy restaurant on a Tuesday evening."], ["Jayme D.", "Waited for a table while larger groups that came in after us were seated. Left and went across the street and got right in. Avoid this one if it's busy they are very disorganized."], ["Verleen R.", "After our 25 minute projected wait turned into an hour plus, we ordered overpriced pizza at a tiny corner of the bar, two of us standing, two seated, not optimum for dining comfort.  Moments later the hostess came and summoned us, rudely, I might add, to the front to be seated.  We told the bartender we were being seated so please send the pizza to our table.  He didn't seem to understand the concept.  As we were shown to our booth, another hostess was seating a group in our booth!  Our hostess simply turned around, went back to the hostess stand and put our menus away.  No apology, no effort to find anything else...NO NOTHING!!!  It was at this point we all sat our drinks on the hostess stand, and left....vowing not to return again.  Worst dining experience EVER!"], ["Tom D.", "So our kitchen is getting a new wood floor installed - good excuse to go out to eat. We decided to try the newly opened Mellow Mushroom in Lincoln's West Haymarket. Lincoln has a number of great and famous pizza joints - Lazzari's, Yia Yias, The Isle Pub & Pizza, Valentinos, Piezanos, etc. - so we weren't expecting anything to top those...but we found one!  We ordered their House Special pizza and we were really amazed by the freshness of ingredients, the amount of meat and veggies (including thick slices of applewood smoked bacon, quality hamburger, pepperoni, green pepper, onion, and fresh sliced tomatoes, and more).  The hand tossed wheat crust was nicely toasted on a pizza stone and dusted with a delightful combination of cheese and spices.  The pie was substantial, not sloppy with sauce and not tough and dry like so many others. It held up well on the plate or fork and above all tasted fantastic!  The menu also contains salads, calzones, hoagies, and over 50 beer selections (many of them unique craft beers on tap). I can tell you that this is serious pizza delivered in a fun, creative, lively, and comfortable atmosphere.  With pizza like this - I might never stop remodeling my kitchen!"], ["Meg J.", "Bonus for having Coke products. Cheese bread was awesome. We went in early on a Friday and were seated right away. We dined outside and was nice. We had two pizzas with different toppings. After we had our pizzas  the waitress then told us we can purchase a larger pizza and split it. Would have been nice to know but still great pizza. Will definitely go back."], ["Tanner E.", "Awesome pizza! I had half Bayou Bleu and half Philsopher's Pie. Both equally awesome! The service here was great too! Although I am pretty sure our waiter was on some kind of mushrooms himself, however, there was nothing to dislike about this place. The only complain is that the high top tables and chairs don't sit right. They were quite wobbly and the chair height to table height was way off. The chairs sat almost uncomfortably low, even for a tall person like myself. A tad pricey, but still excellent pizza. The crust is maybe the best part of the pizza (And this is coming from someone who normally throws the crust out I hate it so much.)"], ["Hudson G.", "Pizza is way better than Yia Yia's.  Unfortunately it's a franchise, which means it will do really well in Lincoln as people love franchises around here. Decor is godawful. Service was really slow. Pizza was great and really expensive."], ["Jake S.", "I have been in twice and my only complaint was the wait.  The pizza is different from what I'm used to, but in a good way.  Very unique and slightly chewy crust which I'm a big fan of.  The price can be a bit of a shock to small-town people that are used to the 10-15 spent on an average delivery pizza, but the ingredients and quality are deserving not to mention that I can usually put down serious amounts of pizza and 2 slices of large with a beer and I'm stuffed.  Which reminds me that they also have a great beer selection."], ["Josh T.", "Best pizza in town. Fresh quality ingredients. Crust is amazing. Fun atmosphere. Great to see the dining options in Lincoln improving with the expansion of the Haymarket. Not cheap, but if you appreciate quality, this is a great spot."], ["K. M.", "Pizza was delicious! It's 90% about the crust and the crust was perfect.  It had a nice crunch but was not over greasy.  Pizza had a decent amount of toppings too.  Service was excellent.  Our server was very attentive and we were never without full drinks and it was a busy night."], ["Shaun S.", "The service waa a bit sketchy.  Loved the house pizza.  The sugary glaze on the thai pizza was nasty.  Tofu on a veggie pizza? Blech...."], ["Lady C.", "We went to the restaurant at about 4:00p.m there was no wait and the place was nearly empty.  We still had horribly slow service, the kind where your waiter goes MIA for extended periods of time and when he was visible he was chatting with the hostess.  The pizza seemed like a cross between Pizza Hut and Sam and Louie's.  It was chewy, processed and very different than what I expected.  Maybe we ordered the wrong thing, but the waiter recommended it.  With all the new restaurants in the Railyard, I don't see a reason to go back.  The atmosphere is adorable and colorful and fun, really it's too bad the pizza wasn't better."], ["Raymond T.", "This is a limited review, because we only had a couple of appetizers.  We went on game day, so service was understandably a little slow. Good drink selection, although my \"Big Red\" seemed a little light on alcohol.  We got the muffuletta cheese-bread and the caprese salad, both of which were excellent.  We'll go back again."], ["Audrey F.", "I ordered take out. Small Piizza and Hoagie. Came to $27.50. Besides having a French dried up roll, about 1/3 of the Hoagie had nothing on there. It was skimping in everything. Would of been happier if I would of picked up a $5.00 sub. Would of been a lot nicer than the $10.00 dried up Hoagie. I could of got a better tasting pizza, dough and all from the frozen section of the store. If you want OVER PRICED food, this is the place for you."], ["Jon C.", "Great location right across the street from Pinnacle Bank Arena, great food and great service. Much better than the food and service I received at Buffalo Wings and Rings which is across from Mellow Mushroom. Mellow Mushroom is right up there with Lazzos as far as food and service. They also serve much more than just pizza. Their oven baked BBQ wings are fantastic."], ["J C.", "Thought the dough was really delicious with great texture.   Went before a football game with my son and he doesn't do much beyond pepperoni so that's what we had.   We sat at the bar for a little while while waiting for a table outside.  Really fun decor.  The bartender was very friendly and engaging.  He entertained my son while working a really busy bar which was pretty impressive.  My only complaint that day was the sun.  some kind of canopy or umbrella would make for a way better outdoor experience."], ["Dani W.", "Came in with a group of about 10, they don't take reservations or call ahead so we had to squeeze into a large booth so we could get seated in a reasonable fashion.  Beer menu is nice and expansive.  We split spin artichoke dip and pretzels.  Both very good!  Then we got buffalo chicken pizza and a house special pizza.  I was a fan of both, but really enjoyed the buffalo chicken.  Prices are ok.  This is a great addition to the new entertainment district."], ["fan n.", "One word, EXPENSIVE.  It was good but not worth the price. I think you can get better pizza cheaper. Yai Yai's is better in my opinion."], ["Mary A.", "We wanted to go to the new scene down at the Rail Yard area.  We decided to sit at the bar and eat because the wait was 45+ minutes for just 2 people.  Bartenders were cool.  Good selection of beer on tap.  When we ordered, an appetizer and pizza, both took a long time to get out.   I know it was busy, but 35 minutes for garlic bread and another 40 minutes for pizza.  Needless to say we had to spend most of the night at the restaurant waiting.  It was okay."], ["Tom J.", "Wow.  Great food and great service.  Had lunch there and will be back soon.  If it's full, try to sit at the bar. Fonzie took great care of us and proved to be quite entertaining.  Great to have mellow in Lincoln!"]], "Runza": [], "Risky's Sports Bar & Grill": [], "Dino's Eastside Grille": [["Jodi F.", "Have been here several times and always an enjoyable experience. I love that they have healthy options that taste amazing - so I don't feel guilty dabbling in the array of microbrew options. Their salad wrap appetizer is absolutely amazing. On the other side of the diet spectrum, their pizzas are incredible. . . Service is always great too. Definitely a favorite for us!"], ["Kevin C.", "Passing through the area and decided to stop here based on the reviews. When we told them we were a new customer the chef came out and met is personally. I had the salmon with the mango salsa and it was phenomenal. The service was also amazing. Will definitely come back if I'm in the area."], ["Melissa M.", "I have eaten here several times. It is not as good as Lazlos in my opinion but always has pretty good food overall. I like that you can usually get in here with no waiting."], ["Ritch P.", "What a great find in Lincoln Nebraska!  It's like having your own professionsl personal shopper for beer, whiskey, bourbon and scotch.  If they recommend it, it's great!  Definitely recommend it if you're wanting an authentic Lincoln experience without all of the novelty of a chain/franchise.  Nowhere will you be treated better!"], ["Christina B.", "Good food, good service, and the games are always on. Yes, I'm paying a bit more for the drinks, but they are good, too! If you're on this end of town, I'd say Dino's is worth a visit for a quality, low-key bar and dining experience."], ["Erick V.", "The Paulie is out of this world 10 stars. Also free game room for the kids. Manager Tony was very friendly. We will definitely be back here to eat again!!!"], ["Aaron R.", "Dino's is a great family environment with reasonably-priced kids meals, a pool table, shuffle board, and X-Box game room with spy cam so parents can see the littles! Yet, it has a bar and grill feel with adult beverages for the grown ups. This is becoming a family favorite of ours, because the service is consistently fast and friendly and the menu has something for everyone with great value. We have enjoyed everything we've ordered. Get the nachos, they are huge; a meal in and of itself with fresh chips and toppings, yum! They also have a party room that you can reserve for your group. The only down-side is that it is way on the east side! A bit out of the way, but worth it. Any chance of opening a Dino's West Side or Central?"], ["Nikki B.", "Looks like a sportsbar, eats like a restaurant.I just had some surprisingly good salmon & green beans here, but they also offer the normal sports bar fare like wings & pizza.  My bf's dad is a huge fan of this place, so we stop by for beers often.  They have a small party room toward the front, plus a game area with pool & shuffleboard.Excellent restrooms!UPDATE:  Holy buckets.  Try the Thai Chicken Pizza.  It's very good."], ["K. M.", "Loved this place! They had a great food and drink menu.  Food was amazing! Service was some of the best we've ever had (Thanks Joell!).  We'll be back for sure!"], ["Paula M.", "Great food, service and atmosphere!  We will definitely come back next time we are in Lincoln!  The burgers and fries were a hit and the Mediterranean pizza was wonderful!   The pizza just had a bit too much feta cheese but that was an easy fix."], ["Charles H.", "i don't know why there is a $$ on this place, it should be a $$$ as it is a bit upscale compared to similar properties in Lincoln. The food is good, not zOMG great and the service is good.  It really is way out on the east side, so it has to be a destination.  Unfortunately I drive by several restaurants that do at least as well for less so while it's good it isn't THAT awesome.  If you are in the neighborhood it's good, not a place to avoid but definitely not sheer awesomeness. Parking is adjacent to the strip mall."], ["Kirk A.", "The food is great! The service is great (unless you get a server named Raven). They have a descent selection of beers. This place is a more upscale sports bar. They have TV's everywhere you look, even above the urinals. I have not had anything on the menu that I was not satisfied with."], ["janet c.", "We went with my in-laws for dinner on a Sunday night.  Three of us ordered the special which was a prime rib dinner.  All three of us ordered it medium and all three were well done.  It was disappointing at best.  My husband likes the atmosphere so we went back.  Again, I ordered the special thinking that you don't offer a menu item for a special that you don't know how to cook.  It was a steak.  I realized it was a mistake when I saw that several people at the table next to us had ordered the steak and they did not eat their food.  They were busy so it took awhile to get our food.  My steak was cold and grisly.  I took it home for my dogs to eat- I felt bad giving them something that I didn't like.  From reading the reviews, I would probably think the food was better if I drank a lot more beer."]], "Red Onion Bistro": [], "Baskin Robbins": [["Kay G.", "Friendly, efficient employee was there today, and that made it a nice experience. The ice cream is good. We call ahead to make sure the store is open."], ["Road F.", "It was ran by \"folks\" that didn't speak english or hispanic orders,  like Malt, Shake, Sundae... weren't in their repertoire.  Apparently in transit to another job of any kind. It quickly   C L O S E D .. Oh well . Cant seem to get my favorite Ice Cream close by anymore. I remember the day with the Cows wallpaper. ."], ["Jason Z.", "There's no point in going here.  Nobody works here and one time when my four year old and I stopped we caught the person behind the counter closing up way early.  She looked guilty as if she was doing something wrong.  She handed us some \"free\" ice cream cone cards and turned the lights off.  We went up the road to Cherry On Top, it was close by and made our own sundaes for cheaper.  Plus, they have an actual place to eat rather than a tiny card table like Baskin Robbins has.  Skip this place, it's not worth your time."]], "Heidelbergs Sports Bar & Restaurant": [], "The Normandy": [], "Doc's Place": [["Michael S.", "Lots of bottled beers.....cheap drinks!"], ["Kristine N.", "Good vibe, good music, and diverse crowd. There's a pool table, dart board, a lounge area, and several tv's. Really cheap drinks (Bulleit & Bacardi for $3.75!). Door guy is super friendly and nice but service sucks. It wasn't even that busy but the bartenders took forever to refill drinks (we were sitting at the bar too). If the male bartender would stop talking about banging all the cocktail waitresses and the female bartender just paid more attention, it would have been a great spot."], ["Angie W.", "Doc's Place = Thieves!While I used to enjoy going to your bar, I will never again step foot inside of it. Last night, I ordered a Moscow Mule for my friend and left my ID. I've ordered several Moscow Mules at your place before, and I understand and agree with the reason for leaving the ID. What I do not agree with is charging me $20 to get my ID back after your bartender forgot to give it back to me last night. If I or anyone else stole a mug, I would hope that he would have made note of it. Obviously, he did not, so taking $20 from me is nothing more than greed, poor customer service, and theft on YOUR part. What makes more sense... having your bartenders keep track of customers who steal things, or you stealing $20 from a good customer who would have came back and spent way more than $20 in the future?Note to Yelpers... go to Jack's next door or Starlite down the street!"], ["Adrian B.", "I have been going to Doc's on and off for a decade now.  The place is in a nice hidden location in the Haymarket it's off the beaten track from the usual plastic cup sipping college crowd.  I have noticed that the attendance is less that it was and if your not a regular you don't get very good service.  I miss the days of Kim and Heath who were fantastic bartenders.  I don't like the new bar staff at all, they seem too busy talking to themselves or their 'friends' at the bar. They used to service the most delicious Indian food in Lincoln, it was called 'Boss Curry' but alas there's no food anymore.  The mixed drinks are well executed but the beer selection on draft is next to nothing.  The place is in desperate need of a remodel with ripped black plastic leather stools at the bar, not very appeasing for a 'upscale martini bar'.  But Troy the owner is always friendly and stops by for a laugh.  I do stop by from time to time but if they remodeled the place I would be a regular again."], ["Jen D.", "I think this must be a bar that banks on business from regulars. And if you're a regular, that's awesome. If you're not, you can probably expect less than stellar service. That being said, when we finally did receive our martini's, they were quite delicious."], ["Shane O.", "Great beer selection, good prices, DARTS!, decent crowd.  Service was ok, a little slow and the bartenders knew nothing about beer but they were at least nice.  Got lucky and hit this place on a home football weekend and it was still empty early but it looked to be filling up when we left.  Definitely worth a stop if in Lincoln and looking for some good beers on tap."], ["Nikki B.", "This is the bar where we inevitably wind up everytime we go out.  More grown-up than the crowded college bars, but way more more fun than a stuffy martini bar.  Plenty of table seating, and a small quieter area with couches too.  Good beer selection, very friendly bartenders, & raspberry Lindemans Framboise on tap! Definitely a Haymarket gem.Doc's Place is located next to the Ridnour Room in the Apothacary building.  Often during wedding season, you'll see bridesmaids/groomsmen escaping from a reception (in the Ridnour Room) into Doc's.Beware:  The (very clean) bathrooms are located indoors, but outside of the bar, so don't get lost!"], ["Anastasia B.", "I agree with Nikki B's review.  For somebody who is trying to avoid the rowdiness of \"O\" street on a saturday night, but is seeking someplace a bit more eclectic than Randy's Grill 'n Chill , give Doc's place a shot."], ["Tina L.", "A friend and I walked into here for the first time and we both thought it could be better. Definitely not as much of a welcoming vibe as you have in most bars, like other reviewers have pointed out, it seems to be much better if you're a regular. It seems like a good place to have some drinks with a group of friends."], ["Salmon P.", "Atmosphere leaves something to be desired, but no matter who's behind the bar, they will make you a perfect martini."], ["Sarah M.", "Casual, reasonable, good selection, friendly staff"], ["Shelby M.", "Doc's Place is a comfortable bar with a huge beer selection, excellent and original martinis and even great scotch. The staff is friendly, the crowd is great, and there is good music, seating, and atmosphere.  Very highly recommended. Most people who go there once keep going back!"]], "Henry's on South": [["Jeff K.", "We stopped for dinner a couple weeks after Henry's opened following their remodel.  We were glad to see some of the regular staff on hand to serve us. The change to the place is nice and it is now set up with more lounge seating and less dinner seating. We started out with a couple drinks, a Manhattan for me and Red Priestist for my wife. The bartender makes a very good Manhattan so I was happy to see her back behind the bar.  Both drinks were good. We had a meat/cheese plate and I have included a photo. There was a raisin spread that I was hesitant to try but glad I did. I'm not a fan of them but really enjoyed the spread. The bread and the meat were tasty. I had the Hungarian Chicken for dinner. The sauce is very tasty, but if you can't stand any heat, stay away.  It was spicy. I loved it. My better half had the German Sausage and cabbage. Again, very good flavor to both. To top it off we shared the sea salt caramel with some coffee. We overheard the dessert was made locally. Great flavor, crust, and caramel. If you haven't been back since the remodel, you need to go. Check their hours before going for dinner. With the new seating it is set lounge style so dinner seating is slim. Highly recommended by Both of us."], ["Lindsay H.", "We love Henry's! We have been 3 or 4 times and have always had wonderful experiences. They change up their menu frequently and everything we have tried has been delicious. The waiters and waitresses are always personable and attentive. I love the feel of the restaurant and they recently remodeled. It is warm and inviting and a great place for a date night or to meet up with friends. It is pretty small so I would recommend reservations on weekends. Apparently the owner is a Washington state native (as am I) and alumni of UW (Go Huskies). I always love to support fellow alumni. I wish they offered more Washington wine, but that is a personal preference of mine and I am definitely biased in that aspect."], ["Joshua G.", "My wife and I are adding Henry's on South to our date night rotation, for sure. After reading other reviews, we made a reservation, which was a good plan; the restaurant was full from when we arrived to when we left.The host was friendly and the waitress was top-notch, but the food is what really matters and it was delicious. The four people in our party each had a different entree and we were all in flavor heaven. I loved the Hungarian crepes. The menu is smart - you'll see what I mean when you get there."], ["Mark A.", "We only stopped for drinks and dessert but it was a nice neighborhood place.   My only warning nag is that there is no A/C so on a warm night it can be pretty toasty."], ["Amanda K.", "This is, by far, my favorite restaurant in Lincoln.  I love the atmosphere, it's cozy, classy, and friendly.  Andrew does a great job of walking around to all the tables and making everyone feel at home.  The menu is ever-changing and exciting.  I've never had a bad dish here.  I tend to be much more adventurous at Henry's than other restaurants, because I trust them to make anything delicious.  Also, the bartender is wonderful.  I can't remember her name but she's always working on Friday and Saturday nights when I'm there.  She always gives the best recommendations for wine and her cocktails are on point!I'm contemplating moving to South Lincoln, just to be closer to Henry's."], ["Kevin H.", "Service was good. No problem at all with the service. The food was edible but not any better than you would get at a school cafeteria with fancy plates. Wife had the chicken. It had to be buffalo sauce on it. My friend had some walnut linguini stuff not impressed. I had wild boar. Just like grandma's goulash left overs. My other friend had ox tail it was really pretty good. Won't go back. 3 out of 4 is bad."], ["Jill V.", "I absolutely love Henry's. I've had the oxtail, steak, crepes, and meat board. I've also tried the lemon financier cake, the chocolate torte, and the sea salt caramel tart. All have been fantastic. The place is usually busy and the atmosphere is very comfortable. The potions are small and a bit pricey but worth it for special occasions."], ["Jean C.", "On the road. Stopped and sat at bar. Good very special and wonderful.  I gad Hungarian crepes and spouse had polenta and kale.  Loved them both. Bartender such a treat to talk with. Made a great nada drink for spouse who was driving.  Hope to return."], ["Dennis N.", "Our second outing to Henry's on South was just as impressive as the first... We had their house special bottle of a Napa Rose, cold cucumber soup, berry salad and grilled shrimp with mango salsa.  Amazing flavors, fresh and just the right spices.  Looking forward to being regulars.  My favorite spot for a fancy dinner in Lincoln!"], ["Rick A.", "Nice place.  Quick and friendly service.  Fairly priced and food was delicious, hot, and good portions.  Good wine selections for Lincoln"], ["Tim M.", "Their salted caramel tart is insane.  If I weren't so embarrased, I'd order an entire baking sheet full of these to take home.You're crazy if you don't try one when you come to Henry's!  :)"], ["Matt S.", "Some friends and I walked in around 9:30 and had amazing service from the bartender and what I think was the manager.  Had a bottle of wine.  Manager, I think, brought us some olives that were great.Here is where this experience turns.  The Owner.  This guy had apparently had someone pee in his Cheerios that day.  As we were the only people left in the place we had just finished our first and only bottle.  As we asked for another from either the bartender or the manager, the owner from across the room yells \"No!  Closing time, gotta go!\"  Now, I can understand if it was 1am or even midnight but this was around 10:30.  I'm sorry for trying to give you my money.  I have worked in foodservice for many years and this was mind blowing.  You own a restaurant, you do not get to go home early on a Saturday night.  That's how it works.Also if you are going kick your paying customers out, you shouldn't be pouring drinks to your staff that just ended their shift.  Your staff is great, and you sir, are not."], ["Natasha V.", "excellent food, even some vegetarian options for those who are not meat-eaters. i had to spaghetti squash and i just absolutely inhaled it and i am not normally a fast eater but it was sooo good.huge selection in both wine and beer including local brews so it can be hard to choose which ones you want. at least it was for me since there were so many high-quality wines and beers to pick from."], ["Clay N.", "Every single dish is both intriguing and delicious. The service is at once professional and personal. Love it!"], ["Gabby A.", "We walked in and were greeted by a very friendly hostess who sat us at our reserved table immediately.  I had purchased a groupon to this new place quite a while ago, and we'd tried to get in on Friday but had to settle for reservations on the following Tuesday.  Warning to you all:  get reservations here anytime you want to eat (not just the weekends).  The place was full and they turned lots of walk-ins away during our hour and 20 minutes in the restaurant.Our waitress came and took our drink orders.  We both ordered Zipline beers ($3 for this awesome locally brewed beer, definitely a bonus).  We received them and ordered a flat bread pizza for an appetizer.  Then, we waited and waited....and waited some more before she came back to take our dinner orders.  We waited long enough that I was afraid she'd forgotten about us entirely.We received our appetizer and were both pretty pleased with it over all.  It had perfectly cooked steak, cheese, balsamic drizzle and awesome seasonings.  However, the crust was pretty crispy.  Borderline burnt crispy, but we hungrily ate it up with minimal complaints.  It took a very long time after we had finished our appetizer to finally get our entrees.  Our waitress never asked to refill our beers, though someone else came around once to refill our waters.  Finally we got our meals.  I had shrimp over coconut rice with a mango salsa.  The rice was amazing.  Well done on the flavors in this dish.  The coconut shined but wasn't overpowering and the shrimp was perfect with it.  The mango salsa was a great compliment to the whole dish.  The gent had a crepe dish filled with slow cooked chicken and topped with a red paprika sauce.  The two bites I had were pretty good.  The chicken was wonderful but the sauce was a bit much.  Overall, we both enjoyed our food but neither of us feel the immediate need to go back.  The fact that we were the only people under the age of 60, the location, and the less than stellar service will probably keep us away.  Add to those things the fact that you pretty much have to get a reservation to eat here..."], ["Avery M.", "Great pace to a meal. Liza was our server and performed excellently in our party of six.We ate the Greek plate, Margherita flatbread for appetizers and had the French onion soup, all were excellent. I had the Flat iron steak and macaroni and cheese, extremely happy with both.For dessert we had the Cheesecake and salted caramel chocolate tort which were fantastic. The cheesecake was fresh and amazing.Wonderful experience and excellent food. Would return."], ["Jan Michael B.", "My wife and I love Henry's. The menu is amazingly well crafted and rotated frequently. The wine selection is one of the best in town and always improving. The ambience is exactly what the bistro is, a small niche eatery with a macro-based culinary worldview. We've never had a bad experience, and we show up with high expectations!If you're looking for an Applebee's price and portion, Lincoln has plenty. Henry's is for the foodie without the pretention."], ["Charles S.", "Some small things to add which don't really change much but keep the restaurant from going higher in the ratings. One of our party asked for iced tea and was told it was 'out of season.'  Excuse me, if you can make hot tea you can make ice tea, right: brew the tea put in ice. I wanted an NA beer, and was told maybe next summer they would have it. I think I was there a year ago and got a similar answer. How hard is it to keep a few NA beers around? One of our group noticed no salt or pepper on the table. I guess the cook thinks everyone should like the food exactly the way he spiced it. My wife asked for some bread and the waiter thought he could find some extra which he did. He also said he thought the olives he brought at the beginning was a good substitute. My wife wanted the bread with the meal, not as an appetizer.  In spite of these quirks the main dishes were very good, service was fine, and prices reasonable. Portion size is such that it is unlikely that you will need a doggy bag."], ["Sarah K.", "I've been to Henry's three times so far and every experience was wonderful.  They are pretty busy most of the time, so reservations are recommended.  I had a reservation and went with a group of four on one occasion, on the other two occasions I went with one other person and we sat in the bar area with no reservation.  The food is excellent.  Everything I have tried was delicious, but the swordfish steak stands out the most.  The drinks and the service were also really good.  Henry's has a small-plates theme, and we typically ordered about 1.5 dishes per person.  The portions are great though, and I really would have been satisfied with a salad and only one plate of a main-course.  Overall, I'd definitely recommend giving it a try!"], ["Zach B.", "I went to Henry's the other week to meet up with some friends. The place was packed and they had managed to get a spot at the bar. You need to make reservations any day of the week. They probably can only serve 50 people at a time. The kitchen is open air but the restaurant is intimate in size. The place is connected to a wine shop and an art gallery (which just opened). My party of 5 all ordered a variety of drinks from cocktails to beers. Everything we had was great. They offer wide selection of wine and beer and a moderately sized bar. The appetizers were pretty much gone when I got there but they sounded good. I ordered the baby back ribs which were really good! They do have a bit of a kick to them. (Someone on here complained about them being too spicy...Hello?!?! It's BBQ, what do you expect?) Other folks in my group got the mac and cheese (very tasty) and some fish dishes which were also good. The desert is a must have. Great cheesecakes and torts. Overall, I really enjoyed this place. I hope it makes it. I think they might have a few glitches to work out according to other reviews. I think the chefs and owners know what they are doing."]], "Applebee's": [["Derek S.", "This review update is to give more food recommendations after sampling almost everything on the happy hour menu.I always go with an order of at least 20 boneless wings for myself and wife to share.  Our favorite by far is the sweet n' spicy.  These are simply fantastic with great flavor, the perfect amount of heat and require absolutely no dipping sauce.  We think ranch or bleu cheese actually ruins the awesome taste of these wings.Next the sliders, you can't go wrong with any of the 3 options they have, cheeseburger, french dip or pulled pork.  I usually go with the cheeseburger & french dip.  The cheeseburger is declicious with the grilled chopped onions and special sauce, perfection.  The french dip has juicy tender meat with an awesome buttered toasted bread and great au jus for dipping.Lastly give the nachos a try.  A nice portion of chips and cheese.  They're simple but the queso they put on is off the hook.  It has chunks of jalapeno and salsa that has just the righ amount of kick.  The onion rings are crunchy and amazing when dipped in the bbq sauce, but the portion size is small compared to your other options.  Won ton tacos are average in my opinion and usually gets ordered the least.Spread the word and help support your local applebees!"], ["Jeffrey D.", "Maybe we caught them on an off day but I have a feeling there is more to it than that.  It was very busy and there were many groups hanging out watching the game.  That should be situation normal though here in Nebraska.  As we are not demanding customers we are very easy to please.  We had trouble getting utensils and refills for our water.  The food came out late and some entrees were completely forgotten.  We reminded the waitress and she came back a few minutes later with my meal.  The food was ok, but we are pretty sure we aren't going to head back."], ["Jeremy S.", "I have food allergies so when I placed my order I gave explicit directions for preparation which were ignored. I asked for no butter on anything and ended up with buttered vegetables draped over everything on my plate. With my dairy allergy I couldn't eat anything on the plate. But wait there's more: similar instructions for my wife's entree were ignored as well. Will not be eating here again."], ["Echo D.", "They need better training for waitress. I got my soup without spoon and took 5mins to get the spoon. I had a cold soup. When we finished appetizers the waitress  brought us check to pay. She didnot serve our entree yet WTF. She totally forgot to serve our foods and Never asked refill drinks.  WTH. I hate going to franchise restaurant  but no choice for new year day."], ["Greg S.", "Horrible, lied about the size and cost of appetizer, over salted food, and manager just walks around not interacting with any of the customers. Lesson learned: tell your pregnant wife when she gets a craving for Applebee's hell no."], ["King B.", "I hate to bash on chain restaurants, as they are easy targets, but I will say Applebee's earns the negativity. First our food was cold AND undercooked. When I asked to speak to a manager I was told there was not one on duty.......okay?!? Then after asking for a properly cooked meal I was told I would be charged for another plate. I will NEVER go back to this slop house of a \"restaurant\".  Seriously who continues to eat their swill?"], ["Arlyce K.", "My son took us out for dinner for my birthday, I choose Applebee's as there is a great selection.  We (2 couples) all did the 2 for $25.  We had the Bourbon Steaks and the Napa Chicken & Portabellas - both dishes were EXCELLENT!!  But the reason for this review is to make people aware of what a Great Waitress we had...her name is Sandy.  She was truly OUTSTANDING!!  She answered all our questions, made recommendations, and checked on us frequently but not to the point of being overly irritating.  She was absolutely the best waitress we have had in a long time, even at more high class places.  She definitely deserves a raise!!"], ["Jason K.", "As usual the food at Applebee's was very good. Hard to beat their 2 for $20 deal also! However, this review is in regards to our amazing server we had this past Thursday. His name is Brian (Don't know his last name). Brian was friendly, funny, & prompt. Definitely made our dining experience even more enjoyable. Best server I've had in a long time!"]], "Venue Restaurant & Lounge": [["Jeff K.", "Started out with drinks consisting of their signature Manhattan and cidar sangria. They we both extremely good.  After drinks we ordered dinner. I had their linguini with chicken and my wife had the Hungarian mushroom soup. Again, both very good. See the photos.  We both had wine with our dinner but I can't remember exactly what it was. Our server was prompt and catered to our needs and our water glasses never dropped below 3/4 full.   This is very important and they met that goal. Two things that explain only four stars. (I would give them 3 1/2 if I could). They offered no bread at the beginning of our meal and they would not honor the Yelp free dessert coupon after I checked in. Come on guys, it's just a dessert. I would have purchased two coffees with it so you would have made money."], ["Heidi H.", "My experience started out interesting, as there was some sort of mistake made on the order entered online. I showed up to pick up my to go order 30 minutes later to find out they didn't receive it properly. The gentleman who helped me recovered the situation professionally and appropriately. The food was delicious. We had the black truffle Mac and cheese, spinach artichoke dip, spätzle, crab bisque, asparagus and the turkey Apple sandwich. If you're a Mac and cheese person, I wouldn't strongly recommend it, but it's a good dish to share. The flavor is delicious, but there was definitely something missing to it. The sandwich was well made, with modifications honored perfectly. The bacon was perfectly cooked and was overall a delicious sandwich.The asparagus was delicious as well. I personally don't love asparagus that is super thick, so I wouldn't order it again myself, BUT if that is how you like it, definitely get it! The spätzle was amazing. It's my first time trying it and I LOVED the flavor, texture, etc. The crab bisque was hands down the best I've ever had! I live in Southern California, and get it pretty much everywhere they offer it, and this beat all of those out and then some. If you like crab, get it. You won't be disappointed. The spinach and artichoke dip was amazing. It was served with bread and chips and was perfectly prepared. My friend is a huge spinach and artichoke dip person and orders it everywhere, and she raved about how good it was.Highly recommend Venue."], ["Toni B.", "Ate here the other night with my boyfriend. We walked in late (around 9:15) and sat ourselves in the bar area. We were greeted immediately. Service was good, not overly friendly, but prompt and efficient and not rude :-)We ordered the Rhode Island calamari for an appetizer, it was perfect. Maybe the best calamari I've had. Very fresh and flash fried just enough to make the breading barely crunch. Flavor was on point. For entrees we decided to share the three by the sea and drunken noodles. The seafood on the 3 by the sea was absolutely perfect. It was a salmon filet, either 2 or 3 scallops, and 3 huge shrimp on a bed of creamy risotto. I can't believe how fresh this seafood was. Living in the Midwest, fresh seafood is not too easy to come by, but I have my few places. Wow. I seriously do not have enough nice things to say about how perfectly prepared this dish was. The combination of the risotto and the teriyaki reduction brown sauce with each bite of skillfully prepared fish was almost orgasmic. As for the drunken noodles, they were served in a bowl with disposable chopsticks. The noodles were very nice, mixed with out of the shell edamame, red bell peppers, cashews, red onion, and cilantro tossed in a perfectly spicy hoisin type sauce. The menu gave the option to add beef tips but we thought it sounded good without meat. I work at a Thai restaurant, so I wanted to try a different take on the traditional Thai dish. I have to say, it was very different at venue. Delicious, but we should have added the beef tips. I feel that the dish was missing something, whether it be egg, more veggies, beef tips, just needed a little more substance in my opinion, but I suppose I am a little biased. Thank you venue! It was a delightful dining experience and we will be back soon."], ["Jill V.", "I've been to Venue several times now and the food has never disappointed. I love the atmosphere and the drinks are very tasty. The Sunday brunch is a bit pricey for the selection but still delicious. They do not honor the Yelp free dessert offer. I've notified Yelp but they won't remove it."], ["Elisabeth E.", "I'm updating this review after dining here a handful of times and every time it's excellent. The service has been consistently great, the quality of the food superb, the taste combinations and freshness of the ingredients wonderful. I dined here for restaurant week one night and I was so impressed at their generous tasting menu. They only had a 20.00 menu which included a fillet option! Excellent appetizer and dessert choices as well. Portions were exactly as when I dine here on regular days. Classy restaurant week presentation you guys, I was impressed. Below you will find my original review.This place has been recommended to me a couple of times and I now that I've finally made it in I can see why. A friend and I came in for dinner last weekend and we were seated quickly. The restaurant is elegantly decorated with low lighting and seating in a circular arrangement with a beautiful sculpture in the center. The menu is clearly labeled for gluten free which made ordering simple. There are a lot of great options to choose from and I was super excited by all the gf noming potential. We decided to share the crab cakes which were truly amazing. My friend enjoyed a beautiful salad presented with a cucumber slice wrap. We each had the house cut steak with asparagus and the spinach risotto. I had a side diver scallop. We finished with creme brûlée. I was continuously impressed with the flavor and quality of each course. Portion sizes were good and we left very satisfied. Our server was pleasant and knowledgeable about the gluten free menu options. Food came out in perfect timing and all the courses were spot on. It is a little pricey, it was 100.00 for the two of us with only one alcoholic drink and the dessert was free with the yelp check in. Overall, great dining experience and I definitely will be back for more."], ["Leena T.", "Came here a few weeks ago for a friend's birthday and forgot to post. My friend made reservations beforehand and it was also my first time. I loved the atmosphere of the restaurant. The two servers we had were constantly attending to us, superior job girls, especially for our table with over 20 guests!For my meal, I ordered the Venue steak with crispy onion straws with a side of grilled asparagus and yukon gold mashed potatoes. I also ordered the crispy Rhode Island calamari for an appetizer and used my yelp's free dessert for the dessert I conveniently forgot the name of. (The one with a warm cookie & ice cream) and I forgot to mention the amazing bread with their three sauces! My favorite to dip/spread was the sweet pecan one. My meal was $35 and I would definitely recommend this restaurant as a place to try with a group of friends and/or family or simply for a nice date.Disclaimer - All my photos I post are slightly edited for these reviews."], ["Jill S.", "Perfect date night location. I've eaten in the restaurant several times and have always enjoyed the service and drink menu! I've also have had the luxury of experiencing their catering on several occasions. The guys and gals that run that are some of the sweetest people. Some people complain about the prices but I think they forget good quality, made from scratch food cost actual money to produce, this isn't a chain people! They truly care about the dishes they are sending out and I have never been anything but ecstatic about what has been placed in front of me. And besides the portions aren't skimpy like at some restaurants around town that are trying to charge the same prices. It's a great place, great for date night, special occasions, and catering. Great people great food!"], ["Nancy S.", "I was pleasantly surprised to find a restaurant of this caliber in Nebraska while passing through. It could rival any restaurant in Manhattan or San Francisco.Clearly the chef has a passion for food and exudes professionalism. Everything is house made. Pasta, charcuterie, brilliant sauces and locally sourced vegetables. I simply love this place!"], ["Cory S.", "A great place to eat where you wouldn't expect it.  I wasn't in the mood for a huge steak or anything, but they had some veggie options that were great.   I had some spicy noodle something or another.  it was great, just the right amount of spice and flavor.  Everyone else loved their meals, not a complaint around.  They also have a nice selection of local beers which is tough to find in nicer places. overall a good experience, we will be back."], ["Bouleregard U.", "I'm only giving this one star instead of a half or none.  Very slow service. Took over an hour to get our meal after it was placed.  Three of the 7 orders were wrong.  The food was cold.  It's a nice looking Resturant with good selections of wines. But it took so long to get a wine list we gave up ordering any.The atmosphere seemed nice but the service ruined everything.The quality of the food was ok...the steak was tasty and tender but was cold."], ["Billy F.", "I have eaten many meals in my life. However anytime I go to Lincoln I look forward to dining at the Venue for one of their many great meals. I love their salmon, but their fillet is the best I have ever eaten.  I'm one of those that prefer my fillet prepared med well. I still amazed that they can cook this fillet perfectly without butterflying and it melts in your mouth!"], ["Natalie H.", "My friend rented the private room for NYE well in advance and to our surprise \"private\" included two other large parties.  I ordered food immediately, that within the two hours I was there never came, but I was still charged for.  I had to dispute the bill with a waitstaff that treated me like it was my fault they were understaffed and incompetent.  The process of having this charge removed from my bill took nearly a half hour and we ended up missing the countdown and subsequently, having a bad New Year's.   Luckily my friend did get her meal so I did not go hungry the rest of the night, but unluckily the reason she shared it was because it was terrible.  It was an asian noodle dish that had clearly been overcooked, over seasoned, and left sitting out long enough for the noodles to stick together into one clump, though there was no way of returning the dish because there was no waitstaff present until the end when they expected us to pay for food and drinks we did not order.  This place was a disaster that clearly needs better management.  I will not be returning."], ["Kelly W.", "We chose this spot for an intimate retirement dinner for my Mom on Saturday, and Venue didn't let us down.  The waitress was eager to hear about our occasion, and accommodated all of our special needs throughout the meal.  The food was all pretty darn good, but the stand-outs were the Lobster Rangoon, Papardelle Pasta, Spinach Mascarpone Risotto, and Hungarian Mushroom Soup.  I'd skip the Art/Spin Dip next time though- not bad, just not amazing!  The atmosphere is in this place is unique, some of the seating is in the round but you still feel cozy at your table itself.  Black tablecloths and napkins give it a classy edge, and the service is top-notch!"], ["Liz K.", "This restaurant has really changed and not for the better. Slow service, they ran out of the special after two people ordered it! The wine glasses were spotty and 3 glasses/dishes were dropped and broken while we were there. Food has become mediocre and fairly expensive with an a la carte approach."], ["Sam K.", "When my girlfriend and I have a little extra jingle in our pockets and want to eat at a nicer place, the Venue is certainly our favorite. I'd have to say my favorite selection is the strip steak, with white cheddar macaroni and cheese and mashed potatoes. The prices are a little high but if that's what I pay for this kind of quality then I don't mind. The staff is very attentive and you can tell that the cooks pay close attention to every single meal that goes out. A+!"], ["Erik Y.", "Nice place for lunch or dinner.  Its not the best place in Lincoln, but it is probably in the top 5.  Its got a decent selection of dinner options and wine.  Good date night place, or good place for a special occasion.  Usually the food is good, but a few times in the past I have had a little inconsistent prepared steak/seafood.  The servers are very accommodating and have always been willing to go the extra mile.  Also of note:  They have 2 private dining rooms for large private parties.  They have a very large projection TV/Screen in one of the rooms for presentations. This is great for business meetings or to celebrate a special event in private and show pictures/videos."], ["Jerad D.", "Overpriced mediocre food and crappy service. (They are understaffed, our server was nice, I blame the management) The decor here sucks too. Sorry for the short review. I don't want to waste anymore time here."], ["Laurie A.", "I've been to four catered events in the past month.  Two were outstanding- dishes were presented well and labeled.  Servers were attentive.  The other two events were disappointing. Dishes were not presented well and labels were missing at one event.. we were guessing at what they were- one contained shellfish and definitely should have been labeled as such.  The last event was dismal.. one serving line for over 300 people and they ran out of food.  Servers were not attentive and people in line had to alert them that food was low or simply gone.  The response from the servers was that they had run out of food.  Instead of removing those dishes, they left them sitting empty.  The last 50 people in line did not get salad or salsa or chips."], ["Lori C.", "Had the cod special. It was absolutely delicious!  The made from scratch tartar sauce was a wonderful addition."], ["Suren K.", "Got the roasted duck breast. Was soft, juicy and had a perfect texture. Jam complements duck really well, and the combination of potatoes and snap peas gives a variety of textures that blend together really well."], ["Helen P.", "The food was good, but expensive. It made for a nice date night, but not one that we'll be doing on a regular basis due to price. Definitely leave the kids at home!I will say I was pleasantly surprised by the tiramisu. I don't usually like fruit in my tiramisu, but it really worked here."], ["Kinga W.", "One of the best restaurants on town. Always good quality food @ the best Moscow Mules too!"], ["David S.", "I've always considered Venue one of the best if not the best restaurant in Lincoln. Took some family members there this Tuesday evening but found myself apologizing for hyping it up a little too much to them.  The atmosphere is always great and a beautiful night allowed for outdoor dining.  But, most of the courses of food left something to be desired.  We had appetizers of Lavosh and Escargot, neither were exceptionally good.  The heavy cheese sauce on the Escargot was too overpowering, would have preferred them in just butter sauce and the Marinara Lavosh was kind of bland.  I had a 6 ounce filet for the main course with a side of mashed potatoes and mac & cheese.  The filet was very thin for a filet which led to it being more well done that the medium rare I ordered.  I didn't care for either of the sides as well, the mac and cheese was very salty and the potatoes overly seasoned.  Since I did have a free desert (thank you Yelp) for checking in, I tried the chocolate cake with salted caramel.  No complaints here, that was delicious.  The rest of the members of my party had similar experiences to mine.  One noodle dish was fairly under-cooked and the quality of the filets was not up to standard on everyone who tried it.I wouldn't go as far as not recommending Venue to someone wanting to try a nice restaurant in Lincoln, but for the price you pay here, I feel you should have had a little better experience.  My biggest complaint would be on the filet.  We're in Nebraska folks, we should be getting the best cuts of meat available!"], ["Robin R.", "I love this place. The food is great and they have a huge selection of gluten free options which I have to have. The staff has always been friendly and the atmosphere is calm."], ["Katie S.", "Went here tonight, not impressed at all. They were not that busy they are clearly understaffed in waiters/waitresses and on the line. First off, the house made frocaccia bread was not even close to true frocaccia bread.Plating of the food was horrible, if it's not pretty I don't want to eat it. I've ate burgers plated better.Spinach and mushroom risotto under cooked, steak over cooked and \"hand cut\" is bogus, the sear was impressive though. Four pieces of over cooked shrimp with undercooked crunchy noodles. The fingerings were dry, no flavor, no salt, no pepper, over oiled, and cut into too big of pieces.Overall not impressed and was confused with the menu I didn't know of it was American contemporary or the cheesecake factory with the weird selection and choices. $9 FOR ABOUT 4 OUNCES OF WINE that was room temp slash attempted to be chilled.The dessert menu is a waste of space.I can go on about this and I was highly unimpressed with the lack of quality here."], ["Cyndy P.", "All I can say right now, as I eat at this fabulous place, is YUMM OMG YUMOK Update: After eating all my food, I cleaned my plate which is very unusual.  I had the Crab cakes - the best I have ever had... I could eat these all day every day.  Then I had the Salmon and the hubby had the Chicken Marsala.  The salmon was cooked perfectly and the flavors of the ratitouille and the potatoes went with the salmon beautifully.  The hubby said the marsala was awesome, so I tried his and he is right, their Chicken Marsala is awesome.  For dessert I went with Creme Brulee and he went with the bread pudding.  The creme brulee was awesome! it was so creamy and not too sweet.  The hubby's bread pudding was so yummy as well. It was a blueberry pecan bread pudding with whipped cream (real) and a berry sauce.  I of course had to try this as well and it was so frickin good.  So, I of course asked him when we could come back and what we would celebrate next to have an excuse :)"], ["Avery M.", "Great food and atmosphere. Wonderful facilities for a business meal with excellent facilities (projector, conference phone) and excellent service. My companions had a range of appetizers and cuts of quality beef. I had the delmonico and wished it had been augmented by available sauce/seasoning combos which I did not select. I did request the bacon scallop which was cooked perfectly. Our wine was selected by or server who did a fantastic job pairing a wine with the numerous beef selections. I thought the wine had an appropriate level of depth and tart to cut the juice from the steak. It has been some time since I've been here but it was pleasant and would encourage my return."], ["Amanda K.", "I liked the decor, though it was a little dark.  The nice white tablecloths made me and my fiance feel a little underdressed.  I started with a delicious ginger mojito and he had a Sam Adams seasonal draft that we both enjoyed and are still talking about.We had the appetizer that was on special that night; a spicy tuna roll.  It was average.  I ordered the pecan bleu salad and it was awesome.  I was in the mood for something light and fresh.  He had the special that night which was halibut.  The tastes were there but the fish could have been a little warmer.Overall, solid place.  We will be returning."], ["Shawn G.", "A mediocre restaurant in a less-than-mediocre town. Some things that were great:- Duck tacos.- Lobster Rangoon- Creme BruleeSome things that were not so great:- Every entree I tried.- The drinks.- The server's knowledge of the menu (he was very friendly and eager to help, though).Some things that were downright bad:- The strawberry shortcake.- The decor: An elegant and modern design completely ruined by the fact that whatever fixture was in the center of the dining room (fountain?) was partially removed and covered with a tarp.-The price for the quality of food."], ["David M.", "Returned to the Venue for restaurant week.  The food was great.  A creative and different take on crab cakes, but vey good.  The Chicken Marsala was delectable.  The atmosphere is great, very well decorated.  The waitress did not know the dessert menu well, told us the seasonal cheesecake was chocolate when it was not.  Dessert was decent, but not the best."], ["John S.", "We are from out of town (Massachusetts). We discovered Venue and decided to give it a try. We were pleasantly surprised at the ambiance, presentation, and quality. The outside of the restaurant throws you off a little. It seems like the restaurant would be somewhat mediocre, however when you walk inside it is a different story. Music is at the perfect volume, and the selection is very good.I asked for something special on Open Table for my wife and I, so they made things special. I wouldn't expect that from a lot of restaurants but they delivered. Quality- nice job. I had the Chilean sea bass and my wife had the special. We were duly impressed with our service professional Andrea as well. She wasn't pushy and allowed us time, while also providing privacy.Overall, we come to Lincoln on a monthly basis and will be visiting Venue on every visit. Thank youJohn Shultz"], ["Dani W.", "Came in for lunch on a time budget and service was good and we were out on time, plus in my book!I had the black and bleu burger and it was very good!  My dining companions had the pecan wrap and the special sandwich of the day.  They also both enjoyed them, except the special sandwich was a bit over toasted and caused some mouth injuries but he still enjoyed it.  One of them had the mac and cheese and she said it was very good!I will return!"], ["Shaun S.", "The crab cakes are heavily breaded and not tasty.  The caper sauce that comes with them is not edible.  The salmon was heavily coated with a anise flavored salty spicy masala that was not good.  The tuna was also over salted and it would have been nice to have some lemon or lime wedges provided with that dish.  The steaks were very good. The service was good initially but tapered off throughout the dinner.  It would be helpful if the chef focused more on the actual ingredients verses the spicing of the ingredients.  I did enjoy the high class atmosphere of the place but if Im going to fork out $150 for a meal I expect better."], ["Cynthia L.", "Decided to dine at this establishment, since an Italian restaurant fell short of my craving for Gnocchi. Parking was plentiful, since it was in a public lot. Decor was modern and chic. Hostess was friendly and was seated immediately upon entering. I expected to wait or possibly be turned away, especially since it was a Friday evening. Ambiance was moderately loud and at times, it was difficult to carry a conversation. Service was mediocre, and took more than ten minutes before she arrived. She did tell me that she would be with me in a few minutes, which did linger on; but it was a given, since it was pretty busy. For an appetizer, I tried the Ahi Tuna which was cooked to perfection and had the Tuscan Gnocchi for a main entree. Although the Gnocchi was tasty, I was disheartened that it was pan fried, compared to the regular version in boiled salted water. It was not bad at all, just not what I expected and craved for. The wine menu was plentiful and when I requested the Prosecco, I received a confused look from the waitress. She stated that she wasn't sure that she had that, especially because she noticed that I didn't have a wine menu. I reassured her that it was on the wine menu, since I had done my research ahead of time and checked their website. She returned a few minutes later and notified me that it was only sold by the bottle, which I had no problem with and complied.My overall experience was above average, but not superior. Pricing is moderate and fair. If in the general vicinity, I would most certainly entertain the idea of dining here again, and recommend this restaurant to others."], ["Brent G.", "Amaze-balls. Driving by you'd have NO IDEA...YEP ALL CAPS YELLING. THIS.PLACE.ROCKS   Had the duck and pear ginger mojito. Girlfriend had the salmon and drunken gummy bear martini (vodka infused gummy bears) waiter was nice attentive and made great recommendations. just do it."], ["Karla P.", "I just moved to Lincoln from California with two friends and we were looking for a great meal for our first night. We were directed to The Venue by a friend of ours so we decided to give it a go. Upon entering, we were greeted by two younger looking hosts, one of which was obviously unimpressed by our appearance/ and demeanor due to the snide comments she muttered under her breath about our casual appearance.We were seated promptly and given menus to peruse. Upon scanning the room a couple things were brought to my attention. One, the head chef was eating on the cooking line in plain site for the all the guests to see, a big no no being from the service industry myself. Two, the main dining floor had a hotel lobby restaurant vibe that almost sterilized the entire experience. Three, the ambiance that was trying to be set was trumped by the cafeteria like clamor of the guests' conversation.After were seated, a server approaches us and takes our drink order, not two minutes later, another server approaches us and greets us again to take our drink order. Once the staff figured out who was going to serve us, we proceeded to order our starter.We started out with the crab rangoon dip, which was pretty tasty. For our entrees, we decided to split the baja fish tacos with a cashew cilantro rice, the chicken lavouche pizza (cheese, chicken, artichokes), and a flank steak with Bearnaise sauce and bersain cheese and chive mashed potatoes. Much to our dismay, almost every dish fell short of our expectations and the hype that seemed to be generated about this restaurant and its \"well rounded\" menu. The fish tacos and rice were room temperature at best, and upon returning to the table, we were unimpressed with the tacos bland flavor and overall lackluster appeal. So we pushed the tacos aside and moved on to the pizza that was served with a garlic dipping sauce. When the pizza hit the table, you could tell it had been sitting for a while before it was served as the cheese was already starting to solidify again, and in the first couple of bites, my friend found a large bone in the chicken. The third dish that we order was a steak that was actually really tasty, however, its nearly impossible to screw up a steak in Lincoln, NE so that dish seemed to be a no-brainer.Our server Dayton was more than helpful and hospitable to us and our every request, but unfortunately, the venue is not an establishment i care to return to again."], ["Kaitlynn K.", "My boyfriend and I went to the Venue for my birthday and for Valentine's Day.  Each time was amazing.  They have a great wine selection and the menu is to die for.  Each time he had steak while I enjoyed seafood.  The waitresses were always great and explained any questions we had in detail.  Their suggestions were equally as great.  The atmosphere is great, dimly lit but just enough. You're never too close to another party and it's still a private dinner."], ["M B.", "Love Venue - great food and wonderful atmosphere. This was our first time going to one of the special occasion buffets. It did not disappoint. Can't wait to go back!"], ["Jay K.", "Venue is one of those restaurants that has had a rollercoaster history.  From being the hottest place in town to, used to be good and now right back to one of the best in town.The restaurant has an energetic vibe without being loud and out of control.  The service is always friendly and attentive.  This has become a regular Firday Happy Hour place for me with great specials and a comfortable bar/lounge area.  On my most recent visit I had the Seafood Bisque and Shrimp Po'Boy.  The bisque has always been a favorite and I'm glad it has a place on the new menu.  It's creamy and has a little kick.  The Po'Boy has become a new favorite.  The shrimp are lightly breaded (nothing ruins a good shrimp po'boy like overbreading) with a tasty southwestern flavor.There is also a revamped dessert menu which has a fantastic bread pudding on it.  The desserts are made in-house and I have yet to try them all but so far the breading pudding stands out.Tips:  The Sandwich Special of the Day is ALWAYS good.            If doing Friday Happy Hour get there before 5pm, gets packed fast......and try the Mule."], ["Keely H.", "Before I had lived on the east coast and traveled to the west, I thought the Venue stood up to my idea of what four and five-star restaurants would be in bigger cities.  The Venue is still a great restaurant, but great for Lincoln.  Put it in a place like LA, Chicago or NYC and I don't think it would be as fabulous.That being said, I do love the Venue.  I agree with Neelie's statement that it's a huge restaurant with a great deal of ambition.  They have a nice menu, with a few selections that change seasonally, as well as a pretty large wine list.  I could do without the fountain you could easily trip into that is placed in the middle of the room, but aside from the decor I really have nothing to criticize.The last time I went was with some family that had come into town.  We were a big party, loud, obnoxious and the kind that likes to order many bottles of wine however our waiter wasn't flustered in any way.  There was a NY Strip, a Black & Bleu and three of the Three By Sea (scallops, shrimp and salmon) ordered and I had the Grilled Scallops.  The steaks were cooked fantastically and the threes looked delicious and they don't skimp on portion sizes.  In the past I've tried their lavosh and flat bread pizzas and those don't disappoint either.Prices seem decent for the food and drinks, the employees are all very nice so all in all the Venue is a fine place to go for a good steak and decent seafood in the middle of the country."], ["Dan B.", "My first stop at Venue several years ago wasn't that great, but my most recent experience was excellent.  This time we weren't ordering from the regular menu, though.  Instead, we went for one of the specialty dinners that feature a set menu and that are regularly offered at Venue.The food was really good.  I think the chef showed a lot of skill and creativity in the dishes that he cooked (including a plantain encrusted red snapper and a fantastic banana curry). He also came out on several occasions to explain a particular dish or the concept behind the dish, which I enjoyed.  I think they could move some of those specialty dishes over to the regular menu without any trouble at all.The atmosphere and decor were very nice, in my opinion, and all of the wait staff were friendly.  I will go again!"], ["Gabby A.", "For the price, it's nothing to shout about.  There are much better places than this in Lincoln.  The best part of the meal I had here was the appetizer.  It was crab rangoon dip and it was very delicious.  I'd go back for that, but only that.  The rest of my over priced meal I could care less about (pizza and salad which I split with a friend). The decor is ridiculous and borderline cheesy.  They are trying WAY too hard to be urban chic.  Seriously, tone it down a bit.  You don't have to try that hard to be a classy, relaxed place.  Honestly, go somewhere else if you want a nice, pricey meal.  Try the Bread and Cup, Blue Orchid, or the Parthenon."], ["L B.", "Started with the Asiago dip. This dip had a lot of artichoke hearts in it for the artichoke lover out there. The dip came with hot slices of baguette and tortilla chips..pretty good but pricey($9.50)..I had the Angus burger and added grilled onions..yum, but......the bottom bun was a bit over grilled and hard as a rock(too bad) great taste if the cardboard bottom didn't ruin it for me..the entree came with very good fries though! The turkey club looked good and probably would be my first pick next time(if I come back)..waiter was very nice,helpful, but absent for most of my dining experience. No comp on the cardboard bun though:-)..oh well.. total bill $31.14"], ["Lori R.", "I have eaten at Venue a number of times, lunches, dinners and special holiday buffets. Have NEVER been disappointed. However, I SHOULD take them down a star for calling their Noise Level \"Quiet\"...maybe if everyone shut their mouths, wait staff walked on tiptoe and no one dropped anything. The extraordinarily high ceiling makes for a very loud and echoey dining experience."], ["Michael C. B.", "Venue is a solid, reliable choice for New American fine dining in Lincoln. The room is well-designed, around a central water feature, with additional tables at the periphery. The bar is very attractive, and there are numerous attractive elements, including a nice display of wine.  There is a partial view into an open kitchen.  We go often and enjoy our meals there. The menu offers a wide range of styles and prices, from flatbread pizzas and wraps to fully-realized main courses emphasizing steak, duck, and fish.  (The duck breast dishes are my favorite.)  Good range of appetizers and desserts. Service is very friendly and competent (occasionally a server has an off-day) and servers are attentive but do not hover or overly upsell the food or wine.   The wine list is extensive and well-chosen, with a  markup from retail that seems average for this class of restaurant. As for the prices, well, that's what a nice dinner costs these days. Venue has decided to price in line with similar restaurants in Omaha, KC, and elsewhere in the region. Obviously this is not the place for you if you are looking for cheap, plain food and a TV in the background with a game on.  To me, it's in the top tier of Lincoln restaurants along with The Oven, Blue Orchid, and Dish."], ["Davenport E.", "Very good.  American/French."], ["Natalie M.", "The food here is very good. It is upscale dining with a casual feel. The service was horrible, however. We literally watched our waiter wander around the restaurant instead of checking on his tables. Both times I ate at this place it took the server at least 15 minutes to take our drink order."], ["Norman K.", "I visited the Venue last night with my family.  We went based on the recommendation of a friend.  The place was great.  We were able to get right in with no wait.  The people working the host stand were very friendly.  We got great service at the table.  The waiter did a great job leading us with recommendations on drinks and dinner.  I had the Ahi Tuna based on his recommendation, it was AWESOME.  Try.  Good wine list, a little basic but what I would expect in Lincoln."], ["Nikki B.", "I'd like to build myself a house out of Venue's risotto & eat my way out.  YUM!   I've never NOT enjoyed my food here.  Service has been satisfactory.UPDATE:I'm not changing my 4-star rating, but here's a tip:  Order the salmon.  Do not order the salmon salad."], ["Ryan C.", "I delayed writing this in order to give a fair review. I've been to Venue several times, and as much as I want to like this place because of its great location and menu - its just really failed to impress me on any level. I've ordered a steak on each visit, and every time its over cooked. Presentation of the food is uninspired, and the flavor is nothing to write home about. The atmosphere is ok - the water display in the middle seems cheesy though. And for some reason the noise level really bothers me there - its as if I can hear every conversation going in the restaurant. Greet & wait staff has always been great, but there are too many drawbacks to rate this higher than 2 stars."], ["Dylan G.", "Is there a bigger sin than overcooking a filet mignon, ordered medium? Perhaps doing it to two steaks?My girlfriend had fond memories of this restaurant, so on a recent trip to Lincoln we decided to splurge and treat ourselves to a couple of steaks. We would have been far more satisfied eating at the Culver's next door. When you're dropping $100 on a meal (it would have been more if the waitress had ever asked if we wanted another cocktail), regret should not be the first emotion you feel when you walk out the door.I shoud mention the pros: the drinks were great (again, the one drink we were served, as our glasses sat empty through our entire meal). The appetizer -- the crab rangoon dip -- was pretty stellar as well. Ideally, we should have just enjoyed a few drinks and an appetizer and gone somewhere else for dinner.But, back to those steak dinners: it is CRAZY easy to cook a steak that is, at worst, passable. Our filets were brown all the way through... the difference between a steak ordered medium and a steak ordered well done is not something that happens within seconds on a grill. These steaks were essentially ruined. My side, the asiago crusted sweet potatoes, were okay, but basically just tasted like pumpkin pie filling with rice krispies on top. My girlfriend was far more unlucky, with her risotto cake just coming out bland and sticky. Disappointing. Forgettable. A shame because we loved the look of the restaurant, especially since it's part of a much longer strip mall setting. It was just a bummer walking out and glancing to our right, knowing that we could have paid 1/6th the price for a meal at a burger joint that would have at least had the decency not to ruin a piece of red meat."], ["Lilly C.", "Husband and I decided to try Venue because we had heard a lot of good things about this place.  Me being from California, my friends thought I might like Venue.................they were right. I thought the lounge looked super cool, like a fun place to go have cocktails.  We didn't eat in the lounge, but I will definitely go back for some cocktails and bar food.  Our server was Rachel; she was very pleasant.  We had the chicken spring rolls, which very good.  They were served with a sweet asian chile sauce and a peanut sauce; the chile sauce was both of our favorite.  We both had ribeyes with risotto cakes and asparagus.  My steak was cooked to perfection, and my husband seemed to enjoy his. We had a really nice bottle of wine. After dinner we were stuffed, so no room for desert.  All in all, it was a very good experience."], ["Justin T.", "My wife and I went to Venue for the first time on our anniversary.  We split one if their 10 inch pizzas.  It was called white and we added potatoes.  It was amazing!  We have been craving it ever since and are determined to go back to get it again soon.  I would have rated the experience higher, but our waitress was kind of snooty.  She wasn't mean, but she could have been a little nicer.  I'd still recommend that pizza."], ["Jules T.", "My duck was delicious.Calamari was a little sad because of the small portion, but it was still very tasty.A bit pricey for Lincoln, but it was worth it.The service was great, food was good.They have a children's menu."], ["Raymond M.", "Immediately upon entering, you are greeted by a large flat water wall embedded with colorful Murano glass object d'arte which also serves as the backdrop for the receptionist. Although common on both coasts, Venue is an interesting and unique restaurant for Lincoln.  Lincoln, Nebraska is a sleepy little football town enriched by little else than their unnatural distraction for Husker Red.  The interior of Venue is loungesque separated into casual and hip areas. The owners spared little expense and their interesting and delicious menu selections have paved the way for 2 more locations which are being constructed beyond the limits of Lincoln.  The entrees are relatively expensive for Lincoln proper, but they are offering residents a new and unique option.  The location is also in the area of the Lincoln well to dos.  With everything from Roma style crab pizzas to Tex-Mex rib-eyes, Venue provides Lincoln with an alternative perspective to run of the mill menu items.If you are in town on business, it is a great lunch or dinner alternative and if you live here it is a must try, especially if you are looking for a taste of what you might find in the swankier parts of NY and CA."], ["Raymond W.", "We ate there twice on our last business trip. The first night we fell in love with their crab cake and venue dip. The dip was so huge it could have served as an entree by itself if you weren't famished.  The ribeye was a beautiful steak but I thought there was too much salt in the seasoning. The next night we again had the crab cake but I opted for the venues signature soup which was terrific.  The flatiron steak was how it was described - lean and flavorful. I should have translated lean to mean tough and again I thought the chipotle was heavily slanted to be more salt than necessary and ditto for my risotto. My partner had the ahi tuna and the risotto was too heavily seasoned with chunks of black pepper; so much so that her mouth burning."], ["Undercova A.", "A huge restaurant with a great deal of ambition.  The menu has many option ranging from fresh fish, beef and pasta to \"small plates,\" pizza and dinner salads.  A varied wine list which fits every budget.  I loved the bar.  Rather than having patrons on bar stools, customers sit on regular club chairs and the bartender is below the bar in something that resembles an orchestra pit."], ["Alexis A.", "I actually ate at the Venue in Kearney, Nebraska while visiting my parents.  The food was pretty good, though it's hard for a Nebraska restaurant to mess up a medium-rare steak.  The waitress enjoyed flirting with my boyfriend, but at least she was friendly... I would probably go here again, as the food was good.  It was a little pricey and for the same service, quality and experience, I would have a much better time at The Oven or Blue Orchid."], ["janet c.", "I usually order the salmon or crab cake salad.  My husband will also order seafood.  The food is good, but it's a bit more expensive and more eclectic than we prefer for a casual weekend dinner so we only go on special occasions.We like the atmosphere and bar at Venue.  It's a good place to meet friends for drinks."], ["Kenton D.", "This was my first time for dinner at Venue...no hosts were there ..and we had to wait literally for ten minutes...I really loved their Wild mushroom soup with chips...The food was ok..and I would say better than most of the restaurant in Lincoln... Their Three Sea, I guess, is over hyped and way expensive! Chicken Roulade was just ok..Service was good and the ambiance is great...They had offer on yelp; free dessert for an entree..The free dessert was great.. Bottom line, food is great...but it comes with some price!"]], "Carmelas Bistro And Wine Bar": [["Ashley M.", "We had brunch here today and it was amazing! My friend ordered bread pudding French toast and she just raved about it!! I had the grilled Caesar salad and clam chowder soup. The soup has SO much clam and bacon in it, it was fantastic!! The salad I could have done without. We also ordered the calamari for an appetizer. It was smothered with a sweet pepper sauce which made it kind of slimy. I would surely ask for the sauce on the side next time. Last but certainly not least, the Bloody Mary I ordered was a meal in its self and super delicious!!"], ["Jeff K.", "Stopped by on a Sunday evening. It wasn't very busy at 6:00  ordered the Bistro Burger and the Chicken Juliet. The chicken was great as usual. The burger not so much. It was my fault for not reading the toppings as it had blu cheese and I dislike that a lot. I ended up scraping it off. I thought the burger was a little dry though. And the fries not so good. They were not hot. The ketchup was good. Seems like they do their own if I remember correctly. The service was something to be desired.  I've had the same issue here before and I did not recognize any of the servers. First, no bread. Other tables had bread, but we seem to have been forgotten. Not good service. I should not have to request the bread. Water glasses were not filled quickly. I didn't feel like the server was very interested in our experience. I gave three stars only because the food is good and it's worth a visit. We will go back at some time but there are other places nearby that have steady, reliable service."], ["Jessica H.", "Classy place right thur. :)I stopped in on a Friday night to enjoy a bottle of wine and cheese tray with friends.  The inside is lovely, great decor, wine all around, there's even a gift shop.  Our service was excellent, meat and cheese tray was also very good and complimented the wine well.  I will be back.  I was dressed down (heading from casual day at work) and would liked to have looked a little better, but I wasn't made to feel uncomfortable either.  Place is a bit pricey."], ["Elisabeth E.", "I've been here three times in the last few months and have definitely enjoyed the food, but had mixed experiences on the service.The atmosphere is amazing. Beautifully decorated with lovely wall art, rich curtains, and warm colors. The lighting is low and it is broken up into a couple cozy rooms.The menu is surprising for Nebraska. It feels closer to home like something I'd find in Napa or Sonoma. Proschuitto, truffle fries, bisques, figs, I've been in heaven with all the gluten free options I have here. My favorites have been the pig and fig flat bread which they do gluten free and their lobster bisque. I've so far had both the rib eye and the Capone sirloin with the bacon jams, both were great. I haven't been hungry enough to try dessert yet, portions are generous.Service is interesting. I have only eaten in the dining room once and that was actually a really good experience. Server was nice and friendly, food came out correctly and promptly, and everything went by ideal.Ive come two other times for their first Thursday of the month wine tasting event, which is a steal by the way. 10.00 for six generous tastings and 5.00 of that can go towards the purchase of an already discounted bottle of wine. Both times I've done this service has been ridiculously slow. Both food takes forever, water glasses empty, plus the guy that does the tastings always forgets you and your server has to keep reminding him you've been waiting. Last time he left without even giving us the option to buy wine. Or server did, we paid for two bottles he apparently was out of. So we were given replacement ones, of a different type..So.. The wine night could use some organization.Price is really affordable for the quality of ingredients and portions. I would definitely recommend giving this place a try. Seems to be hit or miss for a lot of yelpers, but overall I've been pleased."], ["Cherie L.", "I am giving this experience two stars only because the waitress was trying so hard and a nice person. We started out our  by ordering a sweet Brandy Manhattan, only to be told that they had no sweet vermouth. A small matter, unless you run a fully functioning bar. My S.O. ordered the sea Bass which he has had before and it was beautiful and delicious.  I generally have their scallops, but took a leap and decided on the filet, at $27.00. I ordered it medium rare and when I cut into it, it was well on the outer edge, then medium well with a pink center. We asked out wait person to ask the cook to try it again because it was clearly over cooked.  After a bit, she returned my original steak and said that they had thrown it back on the grill since the middle of the steak appeared \"under cooked\".  So ridiculous that we were rendered nearly speechless. We requested that unless they could cook it correctly, we would not ne paying for it and asked to see a manager. The waitress returned and said that she felt the grill was defective, not the chef, and that she had been communicating with the manager via telephone. Needless to say, we never saw the manager. RED ALERT! A fine ding establish running itself?? The waitress was very apologetic I sincerely felt sorry for her with no back-up. I took my meal to-go since my friend had long since finished eating. I have eaten at Camelias several times, and the only thing consistent about the place is it's inconsistency! Had a couple of not great dining experiences initially, but keep being drug back there by friends. When it's good, it's very good, but tonight was a night that has made me think the gamble is not worth the money to repeat."], ["Brian B.", "My wife and I have eaten here many times and enjoyed it very much until Tonight (Saturday night-6:30pm).   I was surprised that the place was so empty during such a peak dining hour!  On the bright side our service was fine and to be fair my wife enjoyed her salmon, however my food was way below par compared to prior visits. I ordered the million dollar burger which I mistakenly believed was the same great Kobe beef burger I'd had there many times before (not inexpensive at $16 for a burger, but in the past had been worth it).  Well, have you ever grilled too many burgers on the grill for your family at home and refrigerated the leftover burgers for a few days and then warmed them up in the microwave?  The meat has an old meat flavor. That's what the burger tasted like at Carmela's tonight.  Had to return it as I just couldn't eat it. So I ordered the pasta with marinara and Meatballs. Same problem with the meatballs and couldn't eat this entire either. Not sure what has happened with their beef supply but it will keep us from returning. We spent over $80 for dinner and a couple of drinks and I had to warm up some leftovers out of our fridge when we arrived home to finally have something that tasted decent.  I understand now why only a third of there tables were full Saturday night at 7pm when we left. Too bad...."], ["Alexi A.", "Summary- great lunch with pretty good service. Loved their salads.Food- 5 starsEverything that came to our table for lunch was awesome.My Rachael's sister sandwich was great as was the salad I got on the side. My wife was happy with her smoked salmon blta and the quiche looked great too.Service- 3 starsA little slow overall but friendly and helpful.Atmosphere- 4 starsNice place with wine bottles everywhere. Might get loud when crowded?Drinks- Didn't try anything but the wine list was killer."], ["K C.", "Hey peeps they changed the menu... Bummer AVOID the bruschetta horrible. Imagine a martini glass of cold tomatoes on bread. GO BACK TO WHAT YOU USED TO SERVE.  Fancy glasses of tomatoes and goat cheese are not good."], ["jane s.", "The first time I ate at Carmela's in July of 2013, I was very impressed with the vodka penne. However, shortly after that, they changed their menu and each of the 6 or 7 times I have been back I have been seriously underwhelmed. The food is heavy, greasy, and the the ingredients seem cheap. The bread they bring to the table is tasteless and soaked in oil, the pastas are all drowning in butter, and the pizza crust is bland. The only reason I'm giving it 2 stars is because the service is good and they clearly label vegetarian and gluten free options. Overall, we have given it too many chances and been too disappointed to go back."], ["Amanda K.", "The food was delicious and there was wine, so yeah.  The service left something to be desired.  We went on a dead, Tuesday night.  We had to wait 10 mins before the waiter even acknowledged us.  She spent the better part of the night gabbing with her friends at another table, leaving our waters empty, not clearing plates as we were finished, and had us strumming our fingers waiting for the check.  I'll try again, but I was not super impressed."], ["June G.", "Amazing food and service.  We tried a little of everything on the menu, the Juliette, duck, and lobster mac.  Wow.  No idea why they are only 3 stars."], ["Karina S.", "Here's an email I wrote to the management of Carmela's after a terrible dinner. I never received a reply from them so I'm copying it here to let others know about our experience.Here's the email:I'm writing to comment on an extremely poor dining experience at your restaurant last night (Friday, March 7). My husband and I have been to your restaurant at least 6-8 times, but it's been at least 6 months since we've been there. The last time we ate at Carmela's was during restaurant week. At the time we were disappointed because of the way that Carmela's approached restaurant week (compared to other restaurants) but we decided to give it another try.There were problems with both the service and the food, and I don't expect we will be back. However, I thought that I would send an email describing some of the problems so that things can be improved. Particularly with service, there were things that seemed like poor training. None of the personnel who helped us were rude at all. In fact, they were all very friendly. However, they didn't seem competent. Here are several of the things that were problems:1) We didn't get a wine list when we were seated. This wouldn't be a problem if it was fixed quickly, but no one noticed this until our server asked us for our drink order. We had to tell her that we needed a wine list to make a decision. This was after she already stopped at our table once to ask if we wanted appetizers. She should have asked about drinks and made sure we had a drink menu before asking about appetizers, not afterward.2) The salad was served with the wrong dressing (twice). I ordered a side salad with my dinner. The server said that the house salad was the Sonoma Signature, which is supposed to come with a dijon vinaigrette. It was served with a creamy dill dressing instead. When I asked the server if she could bring the vinaigrette instead, she agreed, and quickly brought out a RASPBERRY vinaigrette (not a dijon). The salad was edible, but not good, especially since I didn't like either dressing. There's a reason I ordered a salad with the listed dressing and didn't request a substitute dressing when I put in my order. The server should ask if someone wants the standard dressing or an alternative.3) Our salad/soup were brought out before our drinks. This is just bad.4) No one seemed to fill waters. We both had empty water glasses for awhile. Finally, the server came over and asked if I wanted more water or wine. Water should just be refilled automatically if it's empty! This isn't just the server's problem. Host staff and others can do this.5) The jacket with the bill was so greasy we didn't want to pick it up to put the card in.My husband liked his dinner (the burger) although I really disliked my food. However, that's not related to the service problems so it doesn't really seem relevant to this email. However, related to the service, the server didn't seem to notice that something was wrong when my meal was mostly untouched. I'm sending this to make you aware that additional training is essential to remedy some of these problems. As I mentioned, all of the service staff were friendly, so it didn't seem like it was a problem with a lack of willingness to do a good job or a poor attitude, but a lack of training on some of these basics.End of email"], ["Sarah A.", "Went for brunch and it was just okay. They don't have a cappuccino machine which was surprising and disappointing, and the coffee was too weak to be worth the effort. The food was good, but nothing special. Go here for dinner if you want a great meal paired with great wine, find your brunch/lunch fix elsewhere."], ["Carolyn W.", "We were here on a Saturday night at 9 pm.  There were several empty tables but we were told we would have to wait for a table or sit at the bar.  We took the third choice-left and went to Kinja.  I don't plan to come back again"], ["Anita D.", "Great service. Filet was cooked to perfection and presentation impeccable. My husband had salmon and was equally impressed. It was difficult to share the dessert served in a wine glass. Would have been better served in a shallow dish."], ["Mary F.", "We got a reservation on a Friday night & we had superb service and meal. Though we prefer beer over wine, we had a good selection of beer. I had the ahi, which was served with mashed potatoes and great, fresh veggies. The portions were great. Hubby had salmon which was served over wasabi mashed potatoes and he liked it a lot. We split the wedge salad which was plenty for two and enjoyed the complimentary loaf of bread. For dessert, we had the \"Better Than Sex Cake,\" their signature item. It wasn't anything special: chocolate cake, chopped up heath bar, whipped cream and ice cream. It was average.We used a groupon which is always an incentive to eat at different places. They have a great patio, but it was too cold to eat out. The noise level was fine even though it's really a big room with a separate bar area."], ["Dani W.", "Came for after work drinks and dinner.  My first complaint is that there is no moscato by the glass.  Plus the prices of just a glass of wine are a bit much for Lincoln, don't you think?Food was good, not great.  I had the burger because the ingredients were interesting.  It was really good, but very very messy.  Which seems out of place for a restaurant that is trying to be pretty nice and fancy to have such a sloppy burger.Service was ok.  Was seated promptly but the server just seemed overbearing but then not helpful enough...if that makes sense.I'll be back, but not often."], ["Stacey K.", "When Carmelas first opened I had high hopes.  Now I doubt they will be in business much longer.  Their mark up on wines is outrageous.  The waitress had no personality whatsoever and had to read the specials word for word from her notes.  The bartender made overflowing martinis that were sloshed to our table by the server.  One person at the table ordered their martini dirty but they all came that way.  The mashed potatoes seemed like they were instant.  Ugh.  Go across the parking lot to Venue!  Next time I will."], ["Adrian B.", "This was a very mixed experience for my wife, mother and I.  The server greeted us on a busy Friday night in jeans which was a poor look for an 'upscale restaurant' but she was nice.  The service through out the meal was awful.  Took 10 minutes for the server to come to our table and greet us.  When we asked what the blue berry beer was like she snootily replied \"I don't know about the beers here\".  Insinuating that she only knows about her wine.  I guess gourmet beers are below her understanding, you should know your product as a server and not alienate your customer!The food I will say was good, the crab cakes were fantastic, my wife's coconut shrimp was greatly over battered and dry as a bone and over fried.  The seared scallops were tiny and paled in comparison to the ones we ate at the Dish.  The server then left us sitting for about half an hour before our main courses arrived.  I had to physically go to the bar and order us drinks.  When the main courses did arrive we were given no clean cutlery and sat waiting for nearly 10 minutes until I again physically got up and asked the greeter for knives and forks.  The server then finally came back and brought us bread, half way through our entree's.  She could have cared less and did not apologize for abandoning us.  Luckily the head chef or owner I presume came over and apologized for the poor service and gave us a free drink which again took 10 minutes.  Desserts were good but we had a pretty miserable experience for our first time and for the cost of over $150 this paled in comparison to The Dish.  We will not be back and live just 5 minutes from the place."], ["Dennis N.", "This is a great place to eat in southwest Lincoln.  We love their salads and they know their wine and have lots to choose from, unlike many of the restaurants in Lincoln.  We use the Passport Dinning card but they are discontinuing that at the end of 2012.Last night we had the Penna Pasta with Lobster and it contained huge chunks of real lobster, not just a 'lobster sauce' and also had the \"Dinner Cakes\", three large deep-fried crab cakes that were more than I could eat.  Dinners run $20-30 and salads $10-15.... but they are a full meal.  I would preferred crab cakes grilled, but they were good.  They were served with green beans almondine which were very fresh and risotto, which was cold.They have high-top tables in front of the restaurant for outdoor seating and the sound level, when they are busy is much better for conversation outside."]], "The Single Barrel": [["Michelle H.", "Kait is the rain man of whiskey. The girl is that skilled at picking out something that meshes with an individual palette. If you're feeling like trying something new, let her take the reins and pour you something good.Also, for a steakhouse, the veggie sandwich is really tasty. I wish there were more options for those who don't eat things with faces, but I'm pretty happy with that.As a flexitarian, I also love the meat selection. It just tastes fresh.The staff is fantabulous. And hot."], ["Christina M.", "This is my first time here, and even first time in Nebraska, and I was impressed! I sat at the bar and have great conversations with the bartender and others. I ordered the Barrel Burger (with bacon) and WOW it was so tasty! There was something special about that tomato compote with the bleu cheese. Fries were also good, and tasted the local cider beer. Overall, I enjoyed the food and service and would definitely recommend it for a casual dinner out."], ["Joshua F.", "As a whiskey geek, I was excited to get to check out The Single Barrel to see what all of the fuss was about. I'd come in most excited about their bourbon offerings, and I wasn't the least bit disappointed. They have a great selection of bourbons, with really reasonable prices on most things. They even have some pretty rare offerings that you're unlikely to find in many other places (I got to try a 30 Year old Jefferson's Presidential Select, which was an incredible experience). As great as the whiskies are, I was really impressed by the food. The Single Barrel is particularly proud of their locally-sourced meats, but as a vegetarian, I wasn't able to take advantage of them. That said, I tried their roasted veggie sandwich, and it was absolutely amazing. Rather than just being a bunch of bland veggies stacked on soggy bread (which I've had far too often), the wide variety of vegetables were perfectly seasoned and cooked until they were just tender. A layer of amazing fried eggplant chips added a great crunch, and the pesto aoili kept everything moist and creamy. Oh, and do yourself a favor and order the maple black pepper grits - they're astounding, and pair extremely well with bourbon! Finally, I need to acknowledge the service - we were served by Kait, the head bartender at The Single Barrel, and she was incredibly welcoming and hospitable. She really knows her stuff (both about bourbon and the menu), and her passion for the restaurant was absolutely clear. This is a great place, and I can't wait to go back."], ["Elisabeth E.", "I came here for restaurant week and was very pleased with both the special menu they put together as well as their usual menu. The atmosphere has a rustic country feel to it. It is one very large room with a stage in front where on weekends a lot of bands play and they have other events. There's a long bar on one end and the restaurant itself is one large room with lots of tables placed throughout.We dined early on a week day and were seated quickly and our order was taken promptly. The server was very pleasant and knowledgeable about gluten free options.For restaurant week they had only a 20.00 menu with three very nice appetizers, entrees, and desserts to choose from. I had the bacon, egg and fingerling potato frisée salad, the pork lion with a cherry thyme cornbread sauce, and the banana creme brûlée for a dessert. The salad and dessert were pretty good but the entree was excellent. A perfectly cooked pork lion with a cleverly concocted sauce.The service was good, gluten free options were abundant, and food quality and quantity were excellent. Price was very reasonable even for their routine menu. I definitely look forward to visiting again soon."], ["Meghan C.", "Wow! What a meal!   How has this place not been on Man Vs Food yet?We had a difficult time deciding what to order, as it all looked pretty good. For an appetiser we started with cornbread, which comes with bacon jam (delicious!) and jalapeño honey. We also ordered a barrel of crispy bacon (which again comes with the jalapeño honey) (picture included). Bacon was extra crispy, and standing upright- heaven!For dinner, I ultimately chose the PB&J pork chop- as it looked mouthwatering tempting: charred pork chop over a peanut butter sauce with that bacon Jam (seriously - how had I never had bacon jam before?) with maple black pepper grits. It was all better than I imagined! The pork chop was prepared beautifully- and the combination had so much flavour! Our server explained many people substituted out the grits- oh heavans no! Get the grits- it completes the flavour experience!My colleague ordered the brisket- which was also smoked to perfection. We both agreed that this place would be amazing and packed in the winter- something about smoked meats and whiskey would definitely warm up a Person during a Nebraska winter.Lastly- it is a whiskey house- and their list is deep, and relatively inexpensive compared to other parts of the country. A Macallan 15 made for a nice pairing.If in Lincoln- and looking for a chop house for Nebraska beef, steaks etc- definitely check out Single Barrel!"], ["Tater L.", "I want to tell yall it's great- hell the reviews I read coming over here tonight were great- to be honest - I got my hopes up- People who've taken the time to review it seem to really love it... (Same people that tell you \"OMG- it was the best movie ever!!!\" And you're like WOW! Gotta see that!!)Then you get there all excited that Yelp Land has helped you discover this little gem of Lincoln- and then you eat- and realize you will never ever get that meal back.  And you're bummed.  And you think - wow Yelp just let me down.. You think.. I could've just eaten a bland burger at - well anywhere - but this hurts - because this place has 4 stars.And there are some good things to say.  Staff is nice, attentive, friendly- the atmosphere is cool - the game was on, band playing... I mean that counts for something.  This is the Midwest and we don't wanna hurt feelings being overly critical- but somebody please get Robert Irvine out here in a hurry.  The \"Blackened Pork Chop\" at $16 was maybe 1/2 inch thick- maybe.  (that's what she said!) For $16- it should be more substantial.  It was cooked ok- but peanut butter sauce does nothing for it - and the seasoning boring and bland.Ok, details on the burger-  \"The Barrell Burger\" --signature item right?? Comes with like some kind of bacon blue cheese butter or topping or whatever - sounded awesome- but upon arrival it was a pretty lackluster flavorless burger. The burger was over cooked - not juicy at all- and no seasoning.  Only flavor came from the Carmelized onions - I'm feeling sad again...Look - it's not bad- just a huge letdown after glowing reviews- so my 1 star is for the YELPERS of Lincoln who stole my joy on a rainy September night and led me to 2star mediocre dinner - I'll get over it- but  hugely let down.  Ready for your accurate review?:  average food served by nice people - skip it or not- your life will be absolutely the same.  Tater LoneStar"], ["Seth L.", "We eat here monthly, if not more (the wait staff and management know us by name every time we go in).  The food is always excellent, never had anything we ordered sub-par, ever!  The service is second to none and usually very quick even when they are busy.  Our only complaint is that they cut the menu back and took bison off of it. The steaks are a little pricey, but completely worth it.  If you are looking for something \"lighter\", the burgers and the Ruben is also very good."], ["Shelly B.", "Great menu but something was missing in the atmosphere. Our waitress was super nice and the food was good."], ["Dawn B.", "We were delightfully surprised at this restaurant.  We stopped in LIncoln, NE for the night while on a trip and stayed at the Embassy Suites in downtown Lincoln (also would give hotel great review) and the Single Barrel was directly across the street so decided to give it a try.  They have very unique items which made it difficult to decide because they all sounded so good.  The food was excellent and unique and the service and friendliness of the staff was superb.  Defintely would go back and definitely recommend!"], ["Karen G.", "What a treat. We had tasty drinks of blackberry peach mimosas and appetizer of cornbread with dipping sauces. The soup was terrific and the side salads are made with fresh veggies. Our server explained items on the menu and was very attentive. We will certainly be back as we had wonderful food and it's close to the Pinnacle Bank Stadium."], ["Daniel D.", "I'm sure Kait is getting tired of these good reviews lol, but I figured I'd add another anyways. She was great! I realize being kind is part of her job but she actually seemed sincere, friendly without \"trying\", and a great smile.  I was craving steak before I walked in here, I went for the KC strip cooked \"medium\", it was very tasty. I don't know if it was planned on their end or not but I liked that I wasn't offered steak sauce (a lot of restaurants do these days), I took it as their own confidence. I never ask for it either, unless the steak is bad enough I can't make it through the last few bites... I ordered the mashed potatoes as my side, and they were delicious as well! It was quiet when I went because it was still early,  but the atmosphere seemed real nice, very organized and clean too!thanks,  keep it up!"], ["Jeffrey D.", "We happened to have a Groupon with a friend and stopped in.  The interior is roomy.  The steak is local(ish) from Nebraska.  I liked the way it was prepared.  They also had a nice complement of microbrews available.  The appetizers are nice.  For the price this is one of the best steaks you are going to get.  The service was excellent also.  It is definitely worth it!Overall, great food at a great price."], ["Gene B.", "Nothing fancy here, but tasty food and a fantastic whiskey list.  We went with a NY strip and a ribeye, and were not disappointed.  Meat and potatoes.  The cone of fries, mashed potatoes and potato croquettes all mighty fine.  Our server was upbeat and interactive.  I have no complaints.  If that seems ho hum, read some of my other reviews."], ["Sierra T.", "First things first, our waiter Holli was AMAZING!!! We talked to her for like 20 minutes straight and she was just totally awesome. The food was through the roof my dad was even impressed (and that takes quite a bit) I highly recommend getting their meat because they smoke all of their meat themselves and it is just excellent. Atmosphere is easy going and friendly. Totally recommend coming her and asking for Holli as your waitress!"], ["Rita I.", "Was craving steak and the name just shot out at me. Bar atmosphere and the food is great! After 10 the place becomes a bar\\club saloon with live local or touring country bands. I had the filet and it was great! A little too much medium for me but i couldn't resist and I was hungry. I had the green beans as a side and it was well cooked! Still crunchy!!! I'd definitely go back when I visit Lincoln again."], ["Michael D.", "Just got in from Connecticut had dinner here the rib eye was great service was the best try the deserts GREAT!!! Will definitely come back next time I'm in town Mike"], ["Nora B.", "Food-Amazing. Forget what it was called but the fires with pork and cheese starter..just get it. Also had the brisket Reuben which was surprisingly delicious..the brisket tasted a lot like pastrami. Drinks-Amazing. We came in early for happy hour there was only one beer on draught but likely it was tasty. The bartender asked if I liked a couple things and threw together a delicious lemonade gin jalapeño drink. Yum. Service-Amazing. Great bartender. Maybe it was because we were in before the rush but she was personable and gave great recommendations. All in all great night."], ["Bulent T.", "Tons of fun.  Went there after the NU vs Southern (near) Miss game.  The Sidetrack Band was there.  They might not be a great band but they are great fun.  Katie was our server and did an excellent job during a very busy time.  She was very attentive.  We had appetizers and they were all very good.  We will return."], ["Allison K.", "If you are from the area and haven't been to The Single Barrel, I wonder what is wrong with you! Really the best place in Lincoln for bbq, steaks, and great drinks. You have to get the Stack appetizer and their smoked brisket is outstanding. If you can, save room for their puppy chow cake. #lifechanging!"], ["Kelly M.", "Great service, friendly staff, cool atmosphere. We had the steak Cobb salad, blackened pork chop with cole slaw. Everything was excellent!! We are driving through to Omaha and then Chicago-otherwise we would definitely return if we lived in the area!"], ["Rick F.", "I was with a huge group and the service was efficient. My food sample size was small: just brisket and a side of beans. The brisket was impressive. Crusty on the outside, smoke ring and then a pink center. Excellent. Beans were great as well. No too soft , great taste and chunks of brisket. They could be a meal themselves. Can't say much for the atmosphere. I think it was an old printing plant and looks it. (With the addition of a few stylish enhancements). Excellent beer selection. Absolutely going back. Also a good value."], ["Paul G.", "Stopped in for lunch on a business trip, I had the friend pork belly sandwich, it was amazingly good. The bartender and clientele were friendly as well. I definitely recommend it."], ["Ed B.", "We came here last night for dinner. The venue is more suited for concerts than a restaurant. You walk in and right off the bat see how open it is. Specifically this meant that there were far less talbles than would be normal for a restaurant setup. The decor was sparse and nothing special. Again probably to accomidate the concert scene. The place seemed a bit unclean from the aspect that the menus were sticky and it looked like it had seen many people that day which we came to find out that there were from a concert given earlier that day. We were told that this was the reason for the gin we wanted and several menu items being out of stock due to 2 heavy days. Not sure that is an excuse for a venue that has been around for a while and does this type of operation probably nearly every weekend. You also present yourself as a butcher and offer meats to take home and cook as well as catering and you are out of bacon and some cuts of steak? Moving onto the food. The menu has emphasis on bbq. There are some non-bbq items like a few salads and steaks. We tried the cornbead appetizer. It came with 3 different spreads which were a jalepeno oil, bacon and sour cream butter. It sounded more promising than it was. Nothing special just plain old corn bread which is about what you get out of a box mix. My wife had the bbq sampler which consisted of ribs, pulled pork and beef brisket. It came with a side of brisket baked beans as one of the many choices offered. All of this was outstanding. Really good bbq. I ordered the 18 oz. ribeye steak medium rare with a side of sour cream and chive mashed potatoes. The steak was very good and cooked to perfection. The mashed potato was good but would have been better if served hotter than luke warm. All in all it was a decent place. Anything better than a 3 star rating would require better ambiance in a restaurant setting, cleaner place and having the items you like in stock in my opinion."], ["Cliff D.", "Very good steak.  I had the barrel cut and enjoyed every bite.  My wife had the pulled pork sandwich and it was one of the best we've eaten.Had trout cakes as an appetizer - also delicious.  Drinks were reasonably priced, food was fantastic.Strange layout - a restaurant that wants to be a cowboy bar/line dancing club too I suppose.  We are early - no band or dancing - and it was very good."], ["J D.", "Great service and good good. The blackened pork chop with the blue cheese bacon butter and maple pepper grits were awesome!"], ["Mark B.", "If there were 6 star ratings, this place would get 6!  Excellent atmosphere, food and service.  If you ever visit Lincoln, NE, be sure to make this one of your eating stops.  The PB&J Blackened Pork Chop will leave your tastebuds dancing and wanting more!"], ["Leo L.", "Have gone here at night to drink multiple times but never had dinner.  Had a party of 15 last minute and were limted on options so ate here for the first time last night and was super impressed!  Had the peanut butter jelly pork chop and my god! So much flavor and so wonderful!  Everyone in the party was very impressed. Lots of awful food options in Lincoln, they might not have great ambience but much better food then many others."], ["Erika R.", "Went there for lunch with a big group, and the service was really slow (although quite friendly). However, the food was definitely worth the wait. I got the pb&j pork, and it was amazing. The flavors were unique, well-paired, and the meat was high quality. The place has a cowboy tone, but it was too empty at lunch to tell what the real feel of it would be. I want to come back for an evening visit!"], ["Aaron N.", "My wife and I love Single Barrel. Excellent food, especially the mushroom and bacon gratin, and perfectly cooked steaks."], ["Linda H.", "We had an awesome meal! But our waitress  Holli was awesome!! So helpful in chosing my meal and just a lot of fun!"], ["Joel B.", "The food is very good and the service is very goof as well. Our second time there in our travels to the West make a point to eat here."], ["Sondra Z.", "We really enjoyed our ribeyes - great flavor.  The grits and single barrel cake were just okay, probably won't get those again but will definitely be back."], ["Michael M.", "Had the sampler platter.  It had a 1/4 lbs of ribs, brisket, and pulled pork.  wait staff was great as well.  I will be coming back!"], ["Patrick C.", "Stopped in to meet up with my best friend and had a great evening.  Emily was our server and she was awesome!  I am a cider drinker and Emily suggested the Apple Ale and I am glad I took her recommendation - it was pretty good!  We ordered the arancini (my fave!), italian sausage dip and pork poppers and all were really good. We both had the potato chowder, my best friend had the wet aged strip with green beans and I had the (mammoth!) 32 ounce porterhouse with french fries and sauteed mushrooms.  Finished up with coffee but neither of us had room for dessert.  A great evening catching up with my best pal over great food and an awesome server.  Definitely would come back when I am in town.  Emily, if you read this - thanks for amazing recommendations and for putting up with some good-natured harassment!"], ["Mallory P.", "Bison reuben was great, as well as the green beans! My friends had the chicken ceasar. It came with olives that they said complimented it very well! Both under $10. Would definitely come back again."], ["Andrew S.", "After many visits, this place is hit and miss.  The food is trying to be upscale, but sometimes misses.  The service is usually acceptable but on one visit I had an additional $2 added to my tab after leaving (noticed when I paid credit card).  I don't necessarily blame the restaurant, so I didn't bring it up and I haven't seen that waiter since.  My last visit was great, the sausage and gnocchi was excellent.  The prices are plenty fair for what you get as well.  I only tried the steak once, soon after they opened and have not tried again.  Partly b/c I expect a lot from a $25 steak and not many places can deliver.  And partly b/c it was cut wrong and therefore cooked wrong.  It was thinner at one end than the other and so the thin end was too well-done and the thick end was ok.  Someday I will try another steak here, just not yet.  This is the place that snagged the sidetrack band for gamedays.  I was here for a gameday last year.  Its a little weird tailgating at a 'nice' place, but it works.  That time I tried the house burger and did not like it.  Soggy greens do not belong on a burger.Also, there is usually only one option for your vegetable that changes monthly or so, so if you don't like it, too bad.  I am not a vegetable eater, but so far they are better than the veggies you will get anywhere else, i.e. they put effort into them and make them fresh unlike other places."], ["Kat G.", "We are on a trip from Arizona to Iowa. We yelped for restaurants in Lincoln not too far from Hwy 80. We stopped in at Single Barrel. We Sat at the bar and were greeted with a great big friendly smile from Jessica. Super sweet. She had excellent recommendations and was very knowledgeable. We had the \"party fowl\" sandwich and fried eggplant.  Both amazing. Definitely would make a point to stop here again."], ["Kycgeek J.", "steak was excellent, service was good, the only reason not 5 stars was a somewhat strange listing of sides and nothing \"normal\" like a baked potato"], ["John B.", "Stopped in for a steak on a business trip.  I passed the smoker in the alley that wasn't active. I ordered the cowboy ribeye and couldn't resist a half pound of brisket as an appetizer. I had been told there was no good BBQ anywhere near Omaha. The BBQ sauce was thick and KC style, not my thing. But the brisket didn't need it!!  3 perfect slices with a great smoke ring, rendered fat, and very tasty!!  The ribeye was good too!! Kait provided top notch service and I will be back!!"], ["Alan B.", "You know how when you're grilling a hamburger and it smells so delicious, but the taste never quite matches the aroma? Well, The Single Barrel serves a hamburger that tastes like that smell. Best burger I've ever had. The thick-cut brisket is equally outstanding. Additionally, this place has one of the most extensive bourbon selections around."]], "Ding-A-Ling Bar": [], "Longwell's": [["Ashley Rae T.", "Longwell's is the perfect place to catch your favorite team playing. With multiple big screens throughout the bar and restaurant area, you won't have to miss out on anything. If it's a (relatively) nice day you can sit outside and catch the game on the Railyard's Cube (a 14x40 feet behemoth that can be seen throughout the Railyard's open pavillion). Dependent on how busy they are or what team is playing seating can get a bit cramped, but the outdoor seating option seems to still be viable, at least till the first snowfall. The interior is what most people have come to expect from a modern bar/restaurant of this elk; a dual bar, one with seating that gives you a front row glimpse at the many many beers on tap, (surprisingly, Longwell's doesn't actually brew its own beer, instead opting to provide many Lincoln staples like Empryean and ZipLine), lots of high tops and a glass encased party room. I was a bit disappointed that they play music instead of audio from the game on the big screen but it only slightly affected the experience. My friend and I decided on three items to share: a half order of the Fries Rule add pulled pork, Spinach and Artichoke Dip and the BBQ Bacon Cheddar Sliders. The Fries Rule w/ pulled pork are Longwell's super delicious version of loaded fries/potato skins. The half order was so big that even after splitting it with my friend there was leftovers for my lunch the next day. At first I liked that the pulled pork didn't come pre sauced, but as with most loaded fries it needed a little bit of moisture so I ended up topping it with bbq sauce. The fries were super crispy, although I do wish they were lightly seasoned.The spinach and artichoke dip was really creamy and didn't separate into an oily mess when it got cold. Would have liked more spinach or artichokes in the actual dip but that's my complaint with most restaurants dip. Would have also liked 1) handmade and 2) warm tortilla chips as the side. Overall pretty decent but you should definitely eat this first unless you want to battle with a top layer of cheese to get to the dip underneath when it does cool off.The last thing I tried and certainly my favorite of the night were the BBQ bacon cheddar sliders. We got three nice sized sliders on pretzel buns, not too much sauce, not super small burgers patties in comparison to the bun and shredded cheddar which I like a bit more on sliders (no worries about cutting a slice of cheese to fit). Also no bacon skimping which was a plus. Would order these little guys again."], ["Lianna N.", "For a 1 hour stop on a bar hop to grab a few craft beers and watch some sports or socialize- 4 stars. 1. I cannot speak for the food since we did not eat there. 2. I cannot speak for the fall nebraska football season or any big game night for professional sports- but on a fairly \"normal\" night which we visited, I had a great time.The beer menu is huge, and they have about 70 something beers on tap. We wasted no time asking for the 6 page menu and scouring it for our favorites. We had some out of town guests from the west coast visiting, and pointed out some of the local (zipline) or fairly local beers from the midwest, which they were excited to try. I thought the pricing was fair, about $5 ish for the 10oz and $6-8 for the 16oz. The bartender was fairly attentive to me after helping the people who had arrived first. He at least acknowledged me, which to me is the most important thing when there is a big crowd waiting to be served at the bar. It's sorta \"Hey I see you there and am mentally taking note in the order which I need to help the customers\". I was pleased with this service and it is much better than other bars I have been to when busy. There are 2 or 3 wall sized screens on one side of the room, and smaller TVs on the other. When you are there at night I swear it will blind you everytime they are on a white screen. However, its a HUGE screen which means yay you get to see the game. Just depends on what you care about. I could see this place getting nuts  during the Huskers season, and having a lot of high energy that comes with Nebraska's favorite team."], ["Jennifer A.", "Service was terrible.  Lots of beer selection.  Had to go get silverware for food and own drinks.  Would not return.  Fun atmosphere and giant tvs"], ["Rachel Y.", "Not a bad place. Food was excellent. Got the burger and added mushroom and Swiss. Partner got the brisket. They asked the temperature on my burger but then delivered it well done. If you're gonna ask, make sure that's what I get :) also, we walked in and there was a table full of people working that day (with staff shirts on) and, I assume, other coworkers who were not working that day. The on duty employees would get up, take care of their tables and go right back to socializing with the table of off duty employees/friends. Not the best environment to walk into. But our server was great! He was not a part of the Sunday funday crowd. I'd definitely return. Especially to watch a game. The tvs here are huge!! Great beer selection, just a little too early in the day for me."], ["Drey C.", "I love the stuff jalapeño cream cheese burger always my goto. I like to add barbecue sauce on top, and it's very convenient because it's always at your table. I feel their services is a little shaky at times when not busy."], ["Kendall D.", "If you want to grab a few beers from a VERY large selection, watch sports, and have a decent stuffed burger, all while having your ear drums blown out and having to shout across the table, you're in luck! It's a sports bar; however, they do have private rooms up for reservation. They actually do have delicious stuffed burgers, but I wouldn't stumble in again unless the main purpose was to have a bunch of different kinds of beer with my meal."], ["Anthony A.", "Ryan the bar man knows his stuff. If you want a cocktail ask for him.Apart from that it's a sports bar.Did it eat so can't comment on that side."], ["Dan O.", "Their specialty is the large number of beers they have on tap- about 76.  You can choose a sampler menu.  I only ordered wings besides the beer.  The smokey wings were good.  The servers were responsive.  Great location and lots of flat screens to check out sports events.  Worth checking out the next time work brings me back to Lincoln NE!  Will repeat!"], ["Jessica B.", "YUMMY! If you like beer apparently, this is not good according to others' reviews. But my boyfriend and I came here for burgers and were SOOO delighted :)I had the Rule G, I'm not much of a cole slaw person but it was so good and cooked perfectly! My boyfriend had the duffified and it was really good as well! The only bad thing was that our sides were cold. I think it was because it was a Friday night maybe. Or the burgers took way longer to cook than fries? I'm not sure. But I got sweet potato fries! SO good. We'll probably come back :) They also have 24oz burger called the big arse burger and if you finish, you get a picture on the hall of fame haha."], ["Timothy P.", "Best thing is location, walked down to the bar after a Nebraska Huskers football game. GO BIG RED! Anyways, managed to find a seat outside with some friends.  Had some pretty solid nachos, couple good beers and left.  Price a bit more then I like but what are you going to do?"], ["Jill V.", "This is a nice place if you want to sit back and enjoy a game on the big screens. The food is a bit above typical bar food and the beer selection is incredible. The downsides are: I've been there 3 or 4 times and every time they're out of one of my order selections, the beer (even inside) came in a plastic cup. I understand the plastic for the outdoor area but I expect glass inside."], ["William P.", "The location is obviously great and it seems initially nice that they have so many beers on tap.It does seem that they don't quite know what it is they want to be. They have a lot of beers, but quite a few of them are domestics, which makes it not as comparable to other regional tapped-beer destinations. You can get these domestic beers anywhere, and they probably have twenty of them. I get that they need to have some of these to satisfy event crowds, but it really takes away from what it could be...THE area craft beer destination. But it isn't. They are often out of the few beers that you can't get many other places, but they never seem to run out of say, Bud Light. It's not an altogether bad place, but it is a bit disappointing. How many people are going to be drawn to a place with \"76 taps\" and order a Coors Light? Perhaps it's more than I realize, but it seems that by trying to please everyone, they are thereby pleasing no one."], ["Christina H.", "Coming back the next time we are in the Pinnacle Arena area.  The beer selection is five-star with more than 100 to choose from.  For $8.00 I was able to choose four different kinds of beer from a list they called a \"flight\" each flight has a different theme; foreigner, local, coastal are just a few examples. The menu included burgers, brisket, ribs and wings. We tried the dip n share beer cheese bread bowl appetizer, which was delicious. I had a turkey burger and my husband had creole wings, both tasty. I ordered a cornbread muffin which came with honey on the side. If you want mouth nirvana put these two things in your mouth in quick succession 1.) cornbread muffin dipped in honey. 2.) a swallow of Boddington's English Pub Ale. The service was a bit inexperienced, which is why it wasn't a five-star overall. The servers haven't tried many of the menu items themselves and so were unprepared to advise on the food. Also, we tried to access the free WiFi there and couldn't for unknown technical difficulties."], ["Erik Y.", "Cool little bar, with over 70 beers on tap.  You can take your beer outside and enjoy it at some outdoor seating.  Great location, right by Pinnacle Bank Arena, and great view of the jumbo screen.  They also have a number of large TVs in the bar.  Fun place but as with a lot of places in the Haymarket, I would like it if it were a little bigger.   If you try to go on a night where there is a event at Pinnacle Bank Arena, you won't get in unless you get there early, or late."], ["Tim S.", "When we arrived they told us to sit anywhere. Then another person stops by the table and tells us we have to move because we are just drinking. So we move. We wait a little while then someone comes by and informs us that they don't have table service for those tables and we will have to order from the bar if we want anything. At $8 to $12 a beer and at least that for a drink I'm old school enough to expect a little better treatment. Maybe just me but Longwells gets a big ole thumbs down on their server friendliness and customer policy's."], ["Luke V.", "Been here a few times service never too great, food is just okay. Recently I had the pork belly sliders and first off after trying them I am almost sure they are not using pork belly. Pork belly usually melts away in my mouth but this stuff was tough as a cutlet with none of that bacon-like crisp. Was sorely disappointed as I have known some great pork belly sliders in the past but this simply does not even compete."], ["Alexander A.", "It was busy before the Rush concert, but the service was horrible. Everyone had an awful attitude and acted like they were doing you a favor to serve you. I asked for food and got a sigh and she said \"it'll take awhile.\" Safe to say that was my only visit to Longwell's. Disappointing from a bar with such a great beer selection."], ["Christina B.", "Service was great and friendly! The food was pretty good I got ribs tried brisket and had a side of Mac n cheese which was yummy. I also did the beer flight. 3 of the four beers I wanted they were out of stock, so I asked for three different ones and two of those were out too! I mostly came for the beer so it was disappointing to see they were out of many of them. Then when I needed a box they didn't have any so I had to stuff my food into a small container which was not ideal. Don't display beers if you don't them."], ["JP F.", "Rude service, uneducated staff, long lines! Won't come here again! Also way to many rules! You can't sit here or there!"], ["Sarah K.", "I will give this a 2-star review.Pros: several beers on tap, something for everyone. Can accommodate large groups of people (with food order) and of course is in the rail yard so area is enjoyable. Had pleasant experience here prior. Cons: yesterday with a wedding party (about 20 people) got beers and headed outside. Well aware that the seating indicates to see a hostess but we took up a table outside when there was plenty open area. We were rudely advised that we had to leave the area since we were not ordering food or go inside to drink (where we would have taken up much more of the restaurant) Working out the issues with seating and servers  is necessary before I will ever return to long wells- go to Gate 25 if you have a large group they were more than accommodating."]]}