{"Parthenon Restaurant": [["Elisabeth E.", "Came in here a couple weeks ago for the first time and was really pleased. I've seen the chain a few different places but never had the opportunity to try it. The restaurant has a really cute feel to it with an intimate atmosphere and adorably decorated. We were here on a weekday around dinner time and were seated and our order taken quickly. The menu has a lot of good options and it made it hard to choose, so obviously I'll just have to be back to nom again sometime soon! We decided to go with the mussels appetizer in a white wine sauce which was good but the type of mussels they had were quite a bit smaller than I'm used to, must have been a different type of mussel, but they were still good. The seafood souvlaki was awesome and the lamb shank had unbelievable flavor. There are a lot of gluten free options and I had plenty to choose from.Food quality and quantity were good, price affordable, and service excellent.. I'll be back for future noming."], ["Don M.", "I am certainly no expert on Greek food.  But I know what I like.  The Parthenon has consistently amazing food and superior service.   Not only that but they regularly offer different and unusual cuisine outside of what you would consider \"Greek.\"   The wait staff will usually take the time to chat with you and make you feel like you are family.  Stopped in today and had the beef souvlaki on rice with fried Zucchini fingers.  For an apetizer I had the Potato Zucchini soup.  All was delicious.   One of my favorite restraunts in town.  I just wish it was closer.   Give them a try.  OPA!"], ["Lindsay G.", "I felt like I need to update my review, since in our experience it seems like Parthenon has slipped the last couple times we have been. Went tonight and tried the calamari as an appetizer. The breading had good flavor, but crumbled off the second you touched it and all we were left with were plain pieces of rubbery calamari that were hard to chew. I tried the moussaka, which was ok but the top was very burned in some places as was the bottom, so I ended up not being able to eat 1/3 of it. The slaw I had as one of my sides had so much vinegar that it was completely inedible. My boyfriend's side of zucchini had so many tomatoes it should have just been called pasta sauce. The good news was that the gyro was great as always. I think from now on we'll just stick to gyros and fries."], ["Julie M.", "Our food was GREAT! The staff was really helpful, and the portions were huge--definitely share worthy. The gyros platter, Greek salad, and vegetarian pastitsio were delicious. Loved the lemony Greek potatoes, and the saganaki was melty and crispy and delicious. Extra charge for the pita might be my only complaint. Go alone, with family, with groups--just go! Although I am saying $$, you can get by on the low side very easily and the portions are so big you could split the bill!"], ["Jonny K.", "Been here quite a few times. Love the Dolmathes and the Orzo stuffed peppers. Could eat the hummus and pita bread as a meal itself. The baklava ice cream is amazing. Sometimes the service can be a bit slow. About the only place to find good Greek food in the area."], ["Holly H.", "I absolutely love this place. The service is great and the servers are very helpful with recommendations. I'm crazy about the salmon, but I've never had anything here that wasn't excellent. I once had baked butternut squash as a side and it's the best I've ever had. You won't find better (or fresher) hummus anywhere. The dessert case is a magical sight to behold, too."], ["Laurie A.", "Seems to be slipping... went last night early and the place was nearly empty.  Immediately a group of people was seated right next to us... in an empty restaurant.  We ordered and I asked to sub a salad for both of my sides.  Why on earth do you charge $2.00 for a side salad when I'm not taking any of the side dishes is beyond me.. and why do you offer sides that are all carbs when I'm ordering a pasta based dish?  You accommodated me and my request so that was nice.  Our food arrived and my salad was swimming in dressing.. almost to the point of being inedible.  My friend's fries were not done so another order was sent in.  The pastisio was bland.  I've had it there before and don't remember it being so bland and tasteless.  The service was amazing, atmosphere great, but I don't think we'll be back."], ["Jeffrey D.", "To be honest I sort of knew what to expect.  They cater every week at work.  The food is good and lots of it.  I get the gyros at work and they are loaded with meat and come with a huge salad.  We opted for a slightly different menu.  The pita break was super fresh and so good, a great start was the humus sampler.  The entrees were very good too.  The service was also good.  Overall a great place for taste, value, and service."], ["kristen m.", "I am a super picky and enjoy very few places like I did my lunch today. The chicken gyro was delicious! The pita soft warm and fresh, the chicken juicy but not gross it seems uncooked juicy, tender and incredible flavor and the tzatziki sauce was delicious as well. Additionally,  I treated myself to a honey cookie and that also didn't disappoint. Another incredible plus was the super nice, super sweet and helpful waitress who took care of me! I will definitely be coming back in the hopes of a repeat!"], ["Erik Y.", "From Yelp: Best Greek Restaurant in Lincoln.  They know how to do Greek food, and the atmosphere and menu is full of good options.  My personal favorite is the lamb suouvlaki.  It is perfectly seasoned and very tasty.  For an appetizer you really want to try the Saganaki, it is a large piece of cheese they set on fire.  Very cool presentation and tastes great.  Their gyro entrée is also very good with homemade tzatziki sauce (mix of  yogurt, cucumbers, garlic, sault, olive oil, lemon juice and dill.)  The flavor is great and the pita bread is excellent.  They tend to put to much dressings on their salads so you may want to tell them to go easy on their dressing or have it on the side and add it yourself.For dessert they have a ton of great options like Baklava, melomakarona cookies, and other assorted cakes and pastries that have a combination of honey, nuts, chocolates, and cakes.  You could probably eat something different over 15 different visits and enjoy them all.They also cater, and I have used them to cater a few events and they always do a nice job."], ["Hope G.", "My boyfriend and I went there for a casual dinner and we got a five-star meal and experience. There are so many options for appetizers as well as main courses and don't even get me started on the desserts. Unfortunately we did not save room for desserts but we plan on going back for just desserts as there were so many beautiful desserts to choose from. I ordered a classic gyro with the hazelnut broccoli as my side. The broccoli was the best broccoli I have ever tasted and the gyro did not disappoint. Our server's name was Allan and he was also one of the best waiters that we have ever had. He was extremely helpful with choosing menu items and gave a wonderful description of the specials. I cannot wait to go back and try some different menu items because I know everything I try will be a delightful experience. **I only write reviews if I have a really good experience or a really bad experience. This was definitely worth taking my time to write the review**"], ["Echo D.", "Very  impressived restaurant in lincoln. The  owner say hi and thanks to all customers when they leave. They have many different kinds of Greek Mediterranean menu. I really liked humus sample."], ["Katy P.", "Love it! The broiled baby octopus app is one of the best things I've ever eaten. The saganaki is really good, too. For entrees everything I've ever tasted is great. favs so far are Braised Lamb shank which is amazing, and veggie moussaka! I love their pilaf, and the Greek fries are a must. The deserts are out of this world. 3 people could easily share a pastes... So rich!!!! But delicious. This has become my favorite place in Lincoln."], ["John R.", "A staple in our date night restaurant repertoire.   Consistently good food.As far as appetizers, get the hummus sampler.   While the Spanikopita and Tiropita are really good, we've fallen hard for the hummus.   My favorite would have to be the sun dried tomato hummus-tastes like pizza with a little zing to it.    I could just about live on Parthenon hummus.I've had several of the main dishes.   I had the lamb a few years ago on Easter.  It was perfect.  No complaints at all.   The gyros are also really good.  But the entres cannot compare to what I believe is the ultimate expression of the pasta side:  the kritharaki.   Get it.  Get an extra side of it and take it home.   Simple orzo pasta, olive oil and tomato sauce and yet all those flavors combine to form a unique taste that I cannot get enough of ever.   My wife has tried making it at home and come pretty darn close but the Parthenon's recipe is not to be duplicated.   Let me repeat myself:  Get some of it.  You want some.  Then, if you're not stuffed to the gills by the generous portions, go shop the dessert cases.   I have  had several of their desserts, I have no recommendations-you simply can't make a bad choice."], ["Kimberly M.", "We visited Parthenon for a date night 1/31/2015. Due to eating preferences and food allergies between the two of us, we often choose chains so that nutrition/allergen information is readily available. I'm always nervous to try local places for those reasons, even though I would truthfully prefer to support local establishments. Anyway, I can tell you the food was fantastic. I'll describe some of those dishes below. But I also want to say that I mentioned my food allergy to the server who assured me I would be taken care of only to disappear and come back a few minutes later with the owner. I'm ashamed to say I've forgotten both of their names now (I think our server was Judy?)... but I will absolutely not forget that kind of customer service. The owner said to me that he has a relative with food allergies and was very kind about answering any questions I had or making any needed modifications to my meal selections. I've had proprietors at other establishments openly display their annoyance before, so this was a most welcome and relieving helpfulness. When you treat a customer that way, you are guaranteed to have my business and support. Now, onto the food. Appetizers- hummus was very flavorful and the pita bread was substituted with fresh cut veggies (celery, carrots, cucumbers). I usually eat hummus with some kind of chip or bread but this was a healthy alternative that I'm now actually going to enjoy in my own snack-life! We read a lot about the flaming cheese... will have to try that next time!For the meals, I had a difficult time deciding between the lamb and seafood souvlaki. The owner described the seafood souvlaki as his most underappreciated dish that he personally prides himself on. But I was really hankering for the lamb, so the seafood will be my choice the next time. The seasoning was perfect and the meat was well cooked. The first bite had me saying \"mmm\" so that's always a good sign. The rice pilaf and the \"side of the day\" (green beans tossed in a light oil) were also very flavorful. My boyfriend chose the stuffed salmon with rice pilaf and the lobster bisque soup. He said that the salmon was great, the rice was very good, and the lobster bisque was amazing. I didn't choose to order any but I did sample a bite of his.... and I'll definitely have some of that next time! No dessert for us. I did enjoy some Greek wine. That was a new one for me but I really enjoyed the wide variety of options and the selection I made (after a recommendation from the server) was paired well with my meal (can't remember the name of that, either). Overall, a 5-star experience for the food and the level of customer service we received."], ["Steven D.", "Great food.  Had the gyro sandwich with a caprese salad.  Great balsamic vinegar.  Wait staff was very courteous and attentive."], ["Anush J.", "First time here. Came to the city to take an exam. I ordered the lamb souvlaki combination - it came with the souvlaki and gyro meat. The gyro was soft and flavorful without being greasy. The souvlaki was more chewy than I would have liked, but I enjoyed the overall taste. The fried jalapeño side was very good - with a bland sauce to cool the sour spicy jalapeños. The rice was good but had many uncooked grains in it."], ["AC C.", "This little gem of a restaurant is a big reason to miss Lincoln... Oh so delicious...We went for a Sunday brunch when I went back for a visit. The atmosphere of this restaurant is so perfect for catching up and eating great food. One friend ordered the Greek omelete and pancakes. That omelet was beautiful! Stuffed with feta and gyro meat and tsatziki. Looked so good. He said the potatoes were crispy and tasty as well. The pancakes were so light and fluffy...and was that a hint of lemon?!?! My best friend ordered lamb souvlaki which is always our favorite dish. Yummmmm. I ordered a rare lamb burger because I know they do a great job of grinding their own and the seasoning is always just right. OMG was it tasty...and huge! Probably a half pound of lamb! They have special side dishes for brunch, and on this day, they had a pumpernickel stuffing. I am still dreaming about that delicious dish. It was like pumpernickel bread pudding. Super crispy on the outside and tender and fluffy on the inside. Stuffed with onions and that bread was incredible. Had to be homemade bread. So good. It was a huge piece and I took it back to my family gathered at the hotel, and they thought it was so good that a group of about ten headed straight over to the Parthenon for lamb souvlaki, stuffing, and a tray of desserts. The only boo for the whole meal was the coffee...none of us liked it. Weak and flavorless, reminiscent of a bad diner. Did not fit with the rest of the experience! The service was really good and the owner truly cares about customer satisfaction and high quality dishes. Lucky Lincoln!!!"], ["Josep A.", "So. We've eaten here several times. A couple of weeks ago was our last. Im going to disagree with the notion that the place serves amazing food. Not a reflection of the owner that I understand is indeed a very nice gentleman. Nov 18, there was a live band we are fond of. We went already with the idea of not ordering anything, as our previous experiences had not been good. (Salad swimming in oil, not good tsatsiki, bland falafel, etc) We caved in and ordered a pizza. First attempt, soggy wet middle. Server returned it for a re-heating. Second attempt, pizza still soggy the further center you went. Server returned it and we got a new one. the new one's crust was doughy and raw. the center was soggy. We tried to eat it regardless, but could not. The server was very kind (can't remember her name... tall, blonde, very kind). The manager... different story. His pizza was raw, it was failed twice, rather than just comping it and apologizing he decided to argue with my wife about \"you ate most of it\" and other arguments defending his poor food. It was not just our pizza, a friend of ours ordered the same pizza and had to go through the same process as we did, reheat and all. The Manager decided to argue, and then said he'd go and talk to the owner... he never came back, figured we tire of waiting and pay... Server apologized, and let us go. She actually knows what she is doing, trying to get us the customer to have a good experience and come back, maybe because of her.  Manager, you don't argue with customers, we are not out to scam you out of a 10 dollar plate. The food is just not that good. The server was super kind, the owner is apparently a great guy, the manager is not. The food is not the best, its subpar food.As far as us eating here, not again. Sorry, but when I go out to eat, and pay for food, I expect it to be worth the money I'm paying, and this place sadly does not uphold that standard. Obviously we are the minority, so reader you might like this place, that's ok, we've personally experienced better greek food at Garbanzos."], ["Reed N.", "I had the Athenian salad and added gyro meat for a quick, filling business lunch. It is romaine lettuce, onions, tomatoes, cucumbers,green peppers, capers, feta cheese, black olives and is topped with anchovies.I forgot about the anchovies and was diving in pretty hard when I thought something was wrong with the gyro meat! LOL They put about 8 anchovies on top and I had about 4 in one bite. That will wake you up!Everything else on the salad is simple and good. It comes with a quartered pita. My only complaint was the dressing. There was too much of it. It would probably be best served on the side so you can control the amount."], ["Rudy S.", "best greek restaurant I have been to.   service is always excellent. food is always above. excellent wine list.    specials are always excellent. choice and value. very reasonable cost  for what is offered. eat here usually once a week."], ["Wesley B.", "I can't say enough good stuff about this place. The food is terrific, the staff is very friendly, it's just a great place to eat. I'd recommend this to anyone."], ["Derek B.", "Very good atmosphere, food was good, but, not great. I wish they had a 3.5 stars. That would be my rating. I don't think the food was quite as good as King Kong's overall, but, had a better atmosphere and service for a \"date night\". I would go back if in the area, but, I wouldn't make a special trip. Had the Gyro Platter. Meat was good. I ordered extra meat and couldn't really tell the difference from those who had the regular portion. I wasn't overly impressed with the Greek Potato. Sald as good. Their Tzaziki sauce was very good, probably the best I've had in Nebraska. Again, not bad, just didn't meet my expectations."], ["Danielle R.", "Decent Greek food and excellent service! The babaghanoush wasn't the best I've ever had but it was decent. The Greek salad that came with the meal was huge, enough to split with another person. It had great flavor, as well as the dressing, but they went a little heavy on the dressing. I'll know to ask for it on the side next time. We ordered the eggplant pita, which was \"lightly fried\". It was downright fried on a pita with lettuce and tomato. Nothing fantastic but still pretty good and I didn't have any leftovers. I'd go again, maybe branch out and try something different."], ["Mark J.", "The Real Deal Greek.  This place is great, and I love the souvlaki and gyro plates.  Perfectly prepaired and the  tzatziki sauce is homemade and tasty.  Oh and for an appetizer you have to get the flaming cheese.  It is so good but you can feel your heart clog as you eat it.  Worth it imo.  Drink and wine selection is decent, and the service was really good.   The desert is the best thing about this place.  They have a case with like 20 different options and they all look amazing.  But we stuck with the Baklava and Chocolate Baklava.  YUMYUM"], ["Jim A.", "Absolutely outstanding.How refreshing to find real food prepared on site.The walleye and catfish were not only fresh, but perfectly prepared.The crab ravioli was spectacular.What a treat.  Will be back next trip over I-80."], ["Ashley K.", "Just moved to lincoln and this was the first place we stopped to eat. We will definitely be regulars!! We have been back time and time again and have never been disappointed!!! The owner, George, is always out serving guests and will stop to chat you up if there isn't a large dinner crowd!!!"], ["Roger B.", "Walked into the Parthenon  and was greeted by a large dining area, fortunately split into what amounted to separate rooms.  We were early enough that there was no wait for a table.  As large as the place is, there was a line waiting for service when we left.  Amazing.  My wife and I started with the dolmathes platter.  They weren't bad, a nicely flavored mix of meat and rice drizzled with some type of lemon sauce.  I had the gyro platter with Greek fries.  There was something about the Greek fries that tasted off.  I don't know if it was the spices or what.  My wife ordered the moussaka with the vegetables of the day.  She had no complaints about the meal.  The Baklava for dessert was good.  I did see on the menu that there were vegetarian options."], ["Christina C.", "I am in Lincoln for business and I have eaten here twice. I wasn't impressed the first time but I decided to give them a second chance since I love Greek food so much.I found their pita bread to be fairly tasteless. This is not bread I would eat by itself, like I do some others. I was unhappy that that the only choice of hummus had roasted red pepper. I am allergic to red pepper and hummus is one of my favorite foods and I couldn't have it.Instead of the hummas, I tried the roasted garlic and feta dip. I LOVE roasted garlic, but I did't like it at all. It was very bitter and hot. It tasted like they put a LOT of raw garlic in it and little, if no, roasted garlic.Every side dish they have is a carb. They have 2 side dishes of the day that might be vegetables. The first day they were both vegetables that I could not eat. They have a entree served with asparagus but they would not serve it to me as a side dish. The second time they had a stewed cabbage and carrot dish that was okay. It was over cooked and bland but at least it was vegetable I could eat. The Greek salad was pretty good. It had a lot of ingredients unlike a lot of restaurants. My only complaint is that there was too much dressing both times I ordered it.On the first night, I ordered the portabello chicken and it was cooked very well, I just thought the cheese overwhelmed the flavors. The second night I ordered the stuffed salmon. The \"stuffing\" is basically a crab cake on top of the salmon. The flavor was pretty good, but the salmon was cooked well done instead of medium or even medium well.As for the service, it seems to be hit or miss. The first night it was pretty busy and my service was good. The second night it was much slower and the service was pretty bad. The waiter came up to tell me to ask him if I had any questions. As I was starting to ask him a question, he turned and walked away. At the end of my meal I sat for 10 minutes waiting for my check. There were only 3 other tables filled at this time.I don't see how people are saying this is the best Greek food they have ever eaten. This may be the best Greek restaurant in Lincoln, but it isn't great Greek food."], ["Matt M.", "We were in Lincoln last week and I saw this place had great reviews. Needless to say we were not impressed. The service was very odd and the food was mediocre. A few of the appetizers (stuffed grape leaves & hummus) were ok but the entrees were lackluster. The lamb was overcooked and under seasoned, the gyro meat was dry, the potatoes lacked flavor & the spanakopita was left with only one bite taken out of it."], ["Sam L.", "Great food great staff kid and pet friendly. The best Greek food in the Midwest family ran. Wine dinners will rock your world. Bacon wine dinner will make you see the gods of Greece."], ["Sarah P.", "I have never had a bad experience here. The entrees are delicious. The baklava is heaven."], ["Nicki L.", "All of the food we ordered was absolutely lights out. The owner is incredibly involved in his food, and he is super friendly and pleasant, as was the rest of the staff. I was truly only disappointed by the fact that I could not order every menu item and shove it in my face. The wine and beer selection is not vast, but seems to be quite solid, again, everything we ordered was perfect. I am very much looking forward to finding myself in Lincoln, NE again soon, if for nothing else, to get my hands on the calamari and baby octopus."], ["Randy P.", "AMAZING...AMAZING...AMAZING!  What more can I say about this place.  Eat here at least once a week; can't get enough of their authentic Greek food; try a special they will blow your taste buds out of the water.  Great, fun group of employees and owner(s) who always stop by to make sure everything is perfect.  Yes the food takes time to come out, yes it's cooked fresh to order, and YES I'll wait a little longer for my order; it's well worth it."], ["Lelay P.", "This place is over-priced, food was okay, the servers are nice but I honestly wouldn't come here again if I'm paying. It's just not worth MY money."], ["Peggy N.", "I am visiting Lincoln, NE for two weeks and tried this restaurant as it located near my hotel and came highly recommended by coworkers.  I decided to get my order to go and just hunker down in my room for the night but restaurant is really adorable so I may need to come back and eat in while I am here.I sat at the bar to order and noticed a large beer selection for such a small bar.  The bartender was quite friendly so I ordered a beer and sipped while I purused the extensive menu.  The selection was large and everything sounded yummy.  Not only did they have their daily selection but also specials of the day including daily specials on sides and desserts.  I finally selected the Chicken Souvlaki which came with pita and rice and a choice of one side.  I chose one of the daily side specials, roasted beet salad.  The chicken was grilled and delicious.  The beet salad was unique in that it was incredibly spicy!  But super yummy.  I love beets so it is hard to go wrong.  I will go back while I am in town to try something different simply because all of the choices looked equally good.  Also good to note: they have several vegetarian choices and a separate vegan menu.  And the appetizer menu had many fantastic looking choices as well!"], ["Brittany S.", "The Parthenon is, by far, one of the best restaurants in Lincoln! To start, the appetizers are amazing! I would highly recommend the souvlaki (flaming cheese). It gets even better with fresh and delicious entrees. Almost all the pastries here are flown in from the Greek fishing village, Tarpon Springs in Florida and are authentic, fresh and delicious! There are always tons to choose from!The owner is always very friendly and helpful, as are all the servers! I've never had a bad service experience here!"], ["Tore L.", "Pet friendly on the patio! Excellent service!"], ["FS O.", "REALLY nice people running this place.  However, that's about all I can rave about in a positive way. I have had Greek food many times in many places, including Greece.  Let me assure you, THIS IS NOT GREEK FOOD!!!  This is better categorized as \"Food by Americans with a Greek last name who have forgotten how to cook Greek food.\"  The Greek potatoes were steak fries -- 'nuf said."], ["Dani W.", "Came in around 9 on a Thursday. The staff was great even though we left right at closing, they were attentive and pleasant. We got the flaming cheese and it was pretty good, at least get it once for the effect!  I had the jump spankopatia and it was good, but ill get something else next time. The corn and black bean side was delicious as was the taziki sauce. The pita bread was light and complimented both the cheese and my friends gyro. We finished with some baklava that I also recommend. I felt like we ate a lot of food and the price was very reasonable."], ["Brad B.", "The food was all good. The Saganaki was superior. The leg of lamb was 50/50...a little on the dry side but good effort. Here's what pisses me off: the unannounced upsell. I asked the waitress if I could substitute a cup of soup for one of my sides. \"Sure,\" she replied. Then there's a $1.99 extra charge on the bill. \"Do you want some pita on the side?\" she asked. \"Sure,\" I said. Then there's an extra charge on the bill. It didn't amount to much but it would be SO much better if she had told us."], ["Derek S.", "this place has decent greek food.  you get large portions for the price.  the staff in my opinion was attentative, but slow after giving your order.  the flavors are as authentic as you will get outside of greece.the spanakopita/tiropita was good, but the fried oysters are where it's at for appetizers.  thick crunchy breading with a fantastic dipping sauce packed full of flavor and spice.the mousaka was below average and almost to the point where it was mushy.  however, the pastitsio or greek lasagna was very good.  the dolmathes was exactly how it was supposed to taste, cooked well with traditional greek flavors.  the greek fries are just steak fries, so fyi on that one.people who were with us said the stuffed salmon and gyro sandwich were delicous and highly recommended.  honestly, both of those caught my eye and when my wife and i go back, that is definitely what i will be ordering."], ["Michael S.", "The pita bread was a tad disappointing, but otherwise, nothing to complain about.  I wanted to get dessert; but the entrees are generous."], ["Hanna D.", "Vegetarians, Vegans, those Omnivores looking to please yourself and your vegetarian and vegan friends:  This place is awesome, everyone can get something.  You want squid?  You get it.  Your sister wants vegetarian mousaka covered in sheeps feta?  She'll get it.  Your brother has gone totally vegan - he's got a whole section of the menu to himself (first I've seen in an omnivorous restaurant - very forwardthinking), with several tasty options (orzo stuffed peppers; stuffed portabello mushrooms, to name a couple).  Looking for an appetizer for everyone?  Try their hummus sampler, with 5 homemade options to please everyone.The service was great, the food was delish, and I can't wait to eat my way through the veggie options on the menu."], ["Brandon P.", "Best Greek food in Nebraska!"], ["Wayne W.", "Great Greek place...at least as far as the food is concerned.  The service was horrible even though we were only one of three couples in the place.  It took them forever on every course and drinks."], ["Andy A.", "mediocre food, not always served hot.it is ridiculous that they push spendy wines with $10 entrees. a separate full size drink menu? all the laminated things all over the tables? and a food menu that has 4 times as many things as it should?"], ["Wyn R.", "I think the reason this place gets good reviews is that Lincoln is seriously lacking in the Greek food category.  Granted, they do a few things well.  But come on, how hard is a gyro.  I like their appetizers, but any time I get something other than a gyro or a Greek salad, I'm disappointed.  And they have no clue how to cook vegetables unless you want a vegetable that is mush.  Gross.  Honestly, it's mediocre at best.  Just makes me miss Papa John's.  The food was the same, but a lot less expensive.  Plus, I really miss their Greek omelet."], ["Jim C.", "Parthenon is in the same vicinity as the Runza we tried the day before, it wasn't hard at all to find. We had the Hummus appetizer, the red pepper gave it a salmon color, really tasty. I almost had the Gyro, but since that's what I always get in a greek restaurant, I went for the special - Kibbeh platter, lamb meatloaf with pine nuts, moist and full of flavor, a tad too heavy for lunch, hummus, same as the appetizer, and what looks to be tabouleh, chopped parsley, mint, tomato, lemon juice and olive oil in a small dish, they were a bit stingy with that and the pita bread, but they bring more if you ask.  And of course the have Dog Tuesdays, bring your dog to the restaurant for some K9 buffet."], ["Bob H.", "Great food, great service. We ordered a lot of items and they were all excellent. Best of all, the more Greek your choice, the better. It's the real thing. The kids loved it too and I can tell this will be their gateway to an expanded palette and taste for ethnic foods. Good atmosphere. At first I was put off by the fact that you get a drinks+appetizer menu first, without dinner menu. But to get it all at once would have been overwhelming, plus I am so happy I got those appetizers! Baklava dessert was sublime."], ["Gabby A.", "One of my favorite places here in Lincoln.  Wonderful Greek/Mediterranean food!  The service is probably the best I've ever received in a Lincoln restaurant, and is probably in the running for the best service I've ever received anywhere.    The meat dishes are spectacular, and you should always start your meal off with a saganaki (flaming Greek cheese).  I also really love the mousaka (Greek eggplant lasagna).  The flavors are unique, and the portion is just right.  The wine list is spectacular, and they do flights so you can try a bit of everything.  End your night with one of their dozens of delicious desserts.  The Parthenon is a great dining experience from beginning to end!  Opa!"], ["Dennis K.", "I don't think the Greeks would recognize this food as theirs. For example, the tzatziki has a hint of garlic when it should be loaded. It's good food most of the time (kudos for that, honestly), but it's only tangentially Greek. What do you expect in Nebraska? One thing that I find annoying is that you order hummus and they give you too little bread, then they charge for more bread. Also, the wait staff are often inexperienced. To their credit, they serve Greek wine and beer, and the baklava is pretty good."], ["Brent G.", "Excellent variety of Greek foods....the best I've had since I was in Greece. Good service and positive, pleasant staff."], ["Matthew P.", "Went at around seven thirty on a Saturday night with friend.  We were warmly greeted and  seated immediately at a table near the back on the main dining area; while I am not a fan of tables, I did have a good view of most of the restaurant. It seemed, as one might expect on a Saturday, to be date night. With the exception of two large groups and then another table of three gays, everyone else was coupled off and leaning in closely to one another.  I didn't notice the it being loud, and even though this establishment is in a strip-mall the interior was  comfortable enough.The service was good. The hostess, wine guy, waiter were all very attentive. I did feel like they were pushing the wine menu a bit hard, though. Our waiter and the wine guy both suggested one of the \"specials,\" which I think were all in excess of forty dollars.  My buddy mention that it recently became legal for restaurants to re-cork bottles in Nebraska, so that probably why they were pushing it so hard.  It didn't really matter to me and if the waiter had maybe suggested a cocktail after I said I wasn't having wine, he could have probably made the sale that way.   However, there was an advertisement on the table to a six course wine and food pairing, which priced at $50 seemed very reasonable to me. This sort of event is likely the only reason I would return, unless I had out-of-town guests that absolutely needed  Greek food on their trip to Nebraska.For dinner I had one of the \"Kazas Family Recipes\" which was named the Parthenon Pasta Platter.  It was just fine, nothing spectacular but solidly good: pasta on a bed of spinach with shrimp, artichoke and feta cheese. The Really Good feta cheese (and the bed of spinach) is probably what made the dish for me.  My side was pumpkin risotto, which I actually enjoyed more then my main course.  In retrospect, I should have just ordered appetisers for dinner, as those that i could see on other tables looked good.  After we were done eating, a man who I would have guessed was a manager or owner stopped by the table. He  cleared out dishes and asked how everything was, eyeballing my half eaten meal.  He looked genuinely concerned and I appreciated that, explaining  I can rarely finish a restaurant sized portion of anything.  In closing the meal, the waiter offered to split the ticket which was very nice because my friend and I were obviously not on a date.   The hostess held the door open as we left the building.  However, I am still only rating this establishment a three, because it is a restaurant and the food would have needed to be more memorable for me to consider myself \"a fan.\""], ["Carrie B.", "WOW!  This place is great!  Probably the best Greek food I have ever had and definitely an unexpected find in Lincoln!  The gyros are definitely the best I have ever had.  We ordered a fried calamari appetizer and got a HUGE serving that was fried to perfection.  Although we barely had room for the combination plate for 2 that followed, we made room for the delicious combination of meats and sides.  The side dish made from orzo was tremendous, and I'd love to have the recipe!  The service was just as spectacular as the food, and the waiter was very knowledgeable about the menu offerings.  Very impressive place!  If you'd like to have a nice, sit-down meal in Lincoln and don't mind spending a little more money than the average meal, I would absolutely recommend the Parthenon."], ["Frans S.", "Very nice modern decor! Friendly owners! The food is only fair however! A bit over price! Service was good! Basically just an average ho hum American restaurant but at least it's NOT a chain restaurant"], ["Gigi F.", "I was in Lincoln on business.  Three of us stopped for dinner.  Flaming cheese, Greek Salad,  Nebraska Lamb Steak and  Greek Green Beans.  Baklava for dessert.  The waiter was a young college kid who couldn't answer basic questions about the wine or food, but he tried really hard.  The green beans were way overcooked, but everything else was delicious.  I would eat there again!"], ["Tom H.", "Incredible food and service!  Menu is extensive and reasonably priced. Dessert selection is out of this world!Chef will drop by to make sure you liked the meal, very nice guy.Dog night is back!  Tuesdays, bring your dog and sit outside with the other dogs!  They even make special dog food!"], ["Dan B.", "This is a great little place with a lot of personality and charm.  The food is usually good, regardless of what we order, and the service is typically A+.  Seems to have a pretty decent wine selection and even a few decent beers, too.My usual order here is the gyro.  The meat is flavorful and tender.  I have also tried the whole fish (snapper, I think) and a couple of other entrees.  They were all good, but I keep coming back to the gyro.The saganaki is also a typical dish we order.  I have yet to be disappointed by this appetizer.  It's not anything fancy, but who doesn't like flaming, melted cheese?  It's a \"can't miss\" on the menu.The spreads are very good too, and it's worth ordering some extra pita.  We've tried the baba ganoush, the hummus, and several others.My only bad memory of Parthenon is the calamari.  It was greasy and over cooked both times we tried it, but that's a pretty short list.There are also a few side dishes that aren't my favorite, but every place has those.  Most times, people have to figure those out for themselves."], ["Cherie L.", "Love it! Food rocks, service is good, and the ambiance is nice. Outdoor dining is great. They really try to serve authentic greek fare and drink. Love the lemon chicken and greek salad!"], ["Joel G.", "I thought it was pretty darn good for Lincoln.  Great service.  Enjoyed the inventiveness, fusion with other cuisines.  Fried Green Tomatoes.  Outside seating is really nice.  Didn't like having to pay for extra pita, but so it goes."], ["Bill K.", "Consistently good food and pleasant service!"], ["Meghan A.", "I used to live in Lincoln and The Parthenon was my boyfriend and I's favorite place to go! The pita bread and hummus is AMAZING! I always get salmon, which is always cooked perfectly and tasty. Service is always great, and George is a great owner! He really cares about the patrons and takes great care of them."], ["Brandon B.", "Parthenon has decent Greek food. We had the stuffed grape leaves and the spanakopita, and our friends each had souvlaki. All were pretty tasty. Wine samples are ample. The only complaint about any of the food was the green beans (soggy and flavorless) and the salad was slightly overdressed.  The service is a bit strange. You are given only a drink+appetizer menu when you sit down, and it takes a REALLY long time to finally get the real menu. Must work for driving up the bill, but it was a bit annoying. Our waitress was too enthusiastic to be real ('Is everything AWESOME here?'). This is the second time we've had that kind of over-the-top service, so maybe it's the training. Generally, a good place to go for dinner. There are usually coupons in the newspaper to help lighten the bill."], ["Rosy M.", "This is definitely the best Greek food in town. Great service too."], ["Steve W.", "Went there with a group from work the other night. They have a nice variety of dishes available. I had the Greek Salad and Lamb Souvlaki and it was very good. The lamb was tender and nicely seasoned. Good wine list and not too expensive. The service was very attentive despite being quite busy. It's probably the best Greek place in Lincoln. Give it a try."], ["Ray S.", "I'm not sure how how this place gets such good user reviews. The service was great, to be sure, but the flavors... not so much. When I ordered an entree, it came with about 4-5 total different kinds of things on it. Only one item was good. The others were average to bad. One was wayyy over-salted. It was very strange to have one good item and the rest not be good at all... I would expect that if a restaurant were bad all the food would be pretty much bad. But here the flavors were really hit or miss... but mostly miss. There are definitely better places to go out to eat in Lincoln."], ["Lady C.", "This restaurant is oh, so good!  Their waiters are pros, so much so that they have upsold my bill by at least $20 everytime I dine there, but this is only to provide a full experience, from appetizer to desert it is amazing."], ["Betty B.", "I love the Parthenon...George, the co-owner, is so authentic...so genuinely caring about great food and new recipes,  I also know that he  treats his staff with dignity and lets their creativity flow, giving them the advantage to whip up new recipes and event ideas.  I've never seen such a sweet restaurant tied together as a family business.  Last night I had a special dish that had a subtitle of \"eggplant shoes.\"  It needs to be a regular on the menu...scrumtious!"], ["Brandon F.", "Personally I am a big fan of the parthenon.  the food is excellent, and the service is good as well.  The fried calamari is some of the best I have ever had, and what I rate all other calamari against.  Also Sunday brunch is very good as well.  Get the greek omelet, or maybe the ham and eggs.  In the summer grab a seat on the patio, a nice white wine, and spend the evening overlooking the always scenic super saver parking lot."], ["Adam R.", "Average overall, but worth at least one try.  Only complaint is the main dish servings were small, but sides/extras made the meals more than enough.  Good atmosphere, good seasonal beer selection, would go back again if I had a coupon."], ["Beth B.", "I love Greek food and this is the best I've found in Lincoln.  Inexpensive drinks and the dinner prices are also reasonable.  Start with saganaki appetizer and greek salad.  Several very good appetizers.  I always have the greek potatoes as a side.  Make sure you check out the dessert case at the back of the restaurant!"], ["Brad G.", "If you are looking for the ultimate greek omelet, this is your place.  I think they only serve it on Sundays.  George, the chef and owner, is a gracious and wonderful host."]], "Sultan's Kite": [["Gary P.", "First time at Sultan's Kite. Everything looked and smelled so good it was hard to choose.  The line was long with regulars so I thought the food must be good or they wouldn't be there. They all looked like they worked in downtown Lincoln. I had the a pita with chicken and wedges and the flavor was different. I left feeling satisfied without the usual feeling from a sandwich shop. It isn't a fancy place but it is clean and well run.I would definitely go back because there is more to choose from! :)"], ["Michael U.", "Cool menu - good location on O Street. College kids running the place. Good met the need.Free water offered. Lamb Gyro was pretty tasty"], ["Misty C.", "For some reason, there are a number of falafel joints in downtown Lincoln, Nebraska (and one just added to the Haymarket District). Many of them, including Sultan's Kite, are open after last call. Those other joints are ok, but the food and service I get at Sultan's Kite makes it vastly superior to anywhere else I've had falafel. Ever. In my life. They have a menu on the back wall, but since falafel is the only vegan option (besides my side of potatoes) that's all I care about. Even their lentil soup is somehow not appropriate for vegetarians, and that is clearly stated on the menu. There is no vegan sauce option, either. In any case, the falafel is the greatest. For real.So, normally a joint that really doesn't have a lot of variety for me won't get a 5 star review, but I'm going to cut the Sultan some slack because I always leave completely stuffed and can get my falafel 4 ways: wrap, pita, rice bowl, or salad. I always get a wrap, and the guys give me a nice smear of hummus as a substitute for the sauce. One could also ask them for a drizzle of olive oil and I'm sure they'd oblige. Lettuce, red onion, and tomato, and I'm set in terms of my wrap. But there's one more awesome thing I need: a side of real potato wedges! Don't eat them with your fingers because they use turmeric in the preparation of said wedges and you'll turn yellow. In conclusion, they're great for lunch, after last call, and any time you want falafel. Be prepared to be stuffed as the portions are generous. Get potatoes, use a fork. Superior to all falafel joints in the known universe and all of recorded history. Yep."], ["Brandon A.", "Of all the Mediterranean food in Lincoln, particularly in this area, I like Sultan's the best which is why I'm giving 5 stars. The pita bread is phenomenal, but can obviously make your gyro a little messy because it is loaded with meat. The wrap is a cleaner and easier to eat option because it's bigger, but not near as good as the pita bread (IMO). I enjoy half gyro and half chicken shawarma. French fries are available upon request which I enjoy with a gyro. Fries are the only area Gourmet Grill has an up on Sultan's. At the end of the day, Sultan's fries are fine. I just think Gourmets are amazing. Brat"], ["Abhishek M.", "My skepticism because of the name was quickly gone when I ate tonight at Sultan's Kite. This is the real deal! The food is legit - fresh, tasty, healthy and inexpensive.I tried the Chicken Shawarma on salad and left feeling full, satisfied and guilt free since I skipped out on the rice and pita. To indulge, I got a side order of the falafel and they were crunchy and delicious. I can now see why the front desk agent at the Cornhusker Marriott, who referred me eats here 5 days a week. I would too, if I lived here."], ["Karina C.", "Very good gyro's although a bit messy. Staff is really nice. You don't have to wait for food at all. Cheap! It's not fancy at all, but it serves the purpose."], ["Kaley S.", "The Good:Tasty and quick spot to grab a bite while you're traveling across the country -- super accessible just off the highway, right downtown, park on the street and you're in and out in minutes! The Bad: Limited options (go only if you like Greek food!)The Food: I had the falafel with rice and red sauce, and it was good! The sauce was supposed to be mild but I found it to be a bit spicy, which I enjoyed. I was happy to have found a light, not-unhealthy meal in Nebraska while we travelled across the country.The Service: Super quick  -- order right at the counter as they make it in front of you, sit down and eat it, or take it to go (it will come to go unless you specify otherwise).Overall:Great spot to grab a quick, casual bite if you're in Lincoln Nebraska."], ["Chris C.", "This little restaurant in downtown Lincoln is great. LOVEd the falafel pita. My wife had the Korma and was delighted. This is a good stop if passing through Lincoln, as we did. Quick, awesome value, delicious, and the employees are nice."], ["Elleen P.", "Came here with a pretty big group of people at like 3 in the morning, when they were closing up, but they still invited us in to order (I felt terrible.. haha). So service I'd give a 10/10. Shared a chicken gyro with my friend, and it was a good size for us since I don't think either of us were really hungry. The pita was good (albeit soggy since it was sitting on the bottom, but that's the nature of gyro plates) and the rest of the ingredients were just really solid. The place is a little run down but hey, that's how you know it's legit lol"], ["Calin D.", "Who knew one could find decent Hummus in Lincoln Nebraska of all places?The falafel sandwich was also yummy, though the staff was certainly surprised that I, with such a large Nebraska-looking frame, am mostly vegetarian. (Not always, just mostly.)The potatoes are also quite good, and the drinks are plentiful, which is useful when washing down pita and hot sauce.The town of Lincoln has probably seen better days, so this nice affordable joint with plenty of seats and decent Mediterranean food was worth the detour.Cheers!"], ["Britny W.", "So tasty. Good food for the price! The chicken Shawarma was definitely our favorite, paired with potato wedges and a pita- perfect."], ["Matt H.", "I had the chicken shawarma on pita bread with salad.  It was very satisfying and the medium sauce has just the right amount of heat that I still felt after finishing the meal.  It was my first experience and the staff was very helpful and even handed out samples.  A little on the high side for cost but not a spoiler.  Will come again."], ["Weston J.", "This is one of myfavorite places in Lincoln.So goddamn tasty.Hard to choose one dish.Schwarma? Gyro? All of them?Baklava, for sure.Haiku review."], ["Chris J.", "I read the reviews and tried it out.  This is very good Greek food.  I didn't think the chicken was amazing, but it was very good.  The gyro meat was extremely tasty too.  Potato wedges are giant.  Very affordable with the quality food you are eating.Not really much of a restaurant.  This is a \"order at the counter\" and take it home type of place.  They do have about 6 or 7 tables, but it is not a dining experience.This is a solid 4 stars because of the food and prices!"], ["Lewis Marklin M.", "Was down by the college when I stumbled upon this place and you don't think of Mediterranean food when you think of Lincoln but this Place rivals any other that I have had and it is in my opinion a much better option for lunch then any fast food place and much healthier, services fun and friendly."], ["Hina G.", "5 stars: The potatoes and their spicy yogurt sauce is to DIE for.4 stars: The service (friendly-ish people, depending on who is working) and falafel. The falafel itself is pretty good but paired with the sauce is heavenly.3 stars: salad- I hate all salads but if you like salad then you'll probably like this one. It's Greek style.2 stars- Chicken korma. I used to be a HUGE fan, but then about a year ago, something changed. The chicken that used to be succulent and soft became tough and dry. The sauce on the chicken is still really good- but the chunks of chicken are chewy and bland.1 star- The lentil soup. So bland. So unsatisfying. Lentil soup (daal) should be earthy, filling and make you feel like you're being wrapped up in an Indian's mother love. Theirs is watery and way too bland. I like it when places keep their lentil soup simple, but Sultan's Kite needs to step it up a bit more.Overall, a great place to go and beats out Gourmet Grill and Ali Baba's by a mile."], ["Jessica S.", "Quick and delicious! My new favorite place to eat, friendly people and I have never been disappointed with their food."], ["Michelle S.", "Visiting from out of state. Have been to the middle east for Mediterranean food.   The Sultan ' s  Kite rivals the best I've had.  Flavorful chicken,  some of the best falafel,  and excellent tzatziki (sp?).  All,  we're told,  from \"mom's\" own recipes.   Very tasty!"], ["Amanda S.", "I am addicted. Love the staff. I am a fiend for chicken shawarma. Pita. Wrap. Rice bowl. Haven't been disappointed."], ["Janet C.", "The gyro with spicy tzatziki is incredible. Fresh soft pita filled with perfectly roasted meat, fresh lettuce, onions, feta, and a choice of mild, medium, or spicy tzatziki sauce.  Be bold try the spicy, it adds a new layer to this familiar sandwich.  Finish off your meal with a fresh piece of baklava- you won't be disappointed. The Diet Dr. Pepper option on the soda fountain was a pleasant surprise."], ["Sarah K.", "This place isn't fancy, but the food is great and very reasonably priced. The service is friendly and prompt.  It will likely only take you about 5 minutes to get through the line, even If there are 15 people in front of you.  My favorite is the chicken tikka korma, which at the time of this writing costs about $8 with tax. All meals come with Greek potatoes and a side salad.  The portions are generous and I typically have leftovers. In addition, they are open late. Highly recommend!"], ["Colton D.", "Great food for a great price! Ordered two dishes the salad and the pita along with an order of humus and for desert baklava. All for just $20."], ["Joy K.", "Fantastic!!! The lentil soup was \"amazing\" according to my 9 year old daughter!  She really didn't want to try anything new and after we insisted she said she \"wasn't going to eat anything.\" :) reluctantly ordering the soup was her big compromise.  One bite later, she was a huge fan!  Everything was great!  Don't let the term \"spicy\" intimidate you away from that sauce! Yum!!"], ["Brad S.", "Good stuff. Great value. Chicken schwarma  and lentil soup. Red sauce not very hot and I'm a wimp."], ["Jill D.", "First time at Sultans Kite. Everything looked and smelled so good it was hard to choose.  The hubs got his favorite...a gyro...and I tried chicken tikka korma on rice.  We also split a side of falafel.  His gyro was generous in portion, the meat tender and yummy, and the tiziki perfect. We both had a few potato wedges and loved the subtlety of the turmeric in them.  My chicken was tender and lovely.  It came with a salad that surprised me with its tastiness...best feta ever and wonderful dressing!  The only thing I am not sure about is the falafel...I don't have much experience with falafel."], ["Mary G.", "We had gyros, potato wedges and fries. Food was excellent with large portions for a reasonable price. The clerk explained the ordering system as he recognized it was our first time there. Good times had by all, two thumbs up!"], ["Michael S.", "WOW, Fast and delicious, Excellent Swarma, Gyros and Falafel, helpful courteous guys behind the counter!! While in Lincoln this will be my lunch spot every time!"], ["Riley W.", "Seriously, some of the best post-downtown at 2:30am food I've ever had. Sultan hooks it up. 10 stars, breh."], ["Perry W.", "This place is great!  They seem to specialize in a few really good things, so whatever you choose you will enjoy!"], ["Jon B.", "Best gyro in Lincoln & it's not even close. I recommend the hummus & pita for a side, but you really can't go wrong. Glad I only live 2 blocks away!!"], ["Alex G.", "Never had a gyro before, so I don't know what to compare it to- but it was pretty good. Potatoes/chips were dang good"], ["Jeff K.", "Highly recommended. My son and I stopped in during a recent motorcycle trip because of the Yelp reviews. We both had the chicken schwarma on salad with the red (medium) sauce. Very delicious and generous portions. Bargain prices considering the quality and quantity. Would not hesitate to recommend or go again."], ["Shruti S.", "Husband and myself are on a road trip and we  started the day from denver.. after a very long day wanted to stop by a place for good dinner. They place simple but slurrrpppy medeterain food. This place will not disapoint. They dont have a wide range of options to select from but serve tasty food. I would certainly recommend !!"], ["Katie C.", "Yep, this place gets 5 stars because of the freshness and the simplicity. Simple concept, and wonderful favors.  Never disappoints"], ["Derek L.", "The chicken tikka korma was delicious!  Got it over rice at the suggestion of the employee because I was hungry,  and it didn't disappoint.  It was quite a bit of food."], ["Chip L.", "An excellent and helpful staff with great food - what else can you ask for? I was given a free sample of their chicken and asked if I wanted half of that with my gyro rice bowl. I did just that. The hot sauce was on the side so I could add as much as I wanted. Highly recommend!"], ["Brad B.", "Food was amazing!  Friendly staff. Let my son's try some samples so that they knew what they wanted. Family of five ate for $35.  Very reasonable!  Will be back!"], ["Ryan G.", "Top notch, had the gyro salad and it was awesome. Serving are generous, and the employees were nice. I will definitely eat here again when I come back to town."], ["Erika R.", "I got the chicken tikka korma on pita. The sauce was pretty tasty, but the meat was super dry. The pita was also disappointing. Portions were large. Friendly, fast service, but didn't really feel like the meal was worth it."], ["Jessica H.", "Sometimes I have a big craving for their lemony potato wedges and some of that delicious taziki so I make the trek downtown for a fix.  I WISH this was not downtown but I get it, great location for college kids and people leaving the bar (even open late).  The first time I went here my friend and I biked downtown and decided to check it out.  I wasn't sure what to get but ended up with chicken shawarma salad.  Mmmm.  I haven't had a lot of mediterranean food to compare to it but what I've had here I've loved.  Despite the location I will keep going back but I know I'd go more if it was not downtown.  That first visit I also took some time to visit with the guy working since my friend and I were the only ones there early on an afternoon.  He was very nice, took time out to explain food and tell me about himself and the company.  The inside is small, seems a little deli-ish, but if you don't know just ask.  It's worth it!  Great prices too."], ["Sarah G.", "Great spot for a quick lunch. And they definitely don't try to overwhelm you with the menu (but know what you want... vague references to 'whatever sounds good' or 'everyone' on your chicken schwarma could result in some confusion). Speaking of which, I didn't know what I was being asked at one point. but it was only $1 so I went for it. Turns out it was a healthy side of roasted potatoes! Mmm... I'll return next time for the chicken tikka korma."], ["Jonah K.", "Currently one of my favorite lunch spots. Loaded gyros with fresh vegetables and flavorful sauces, all at a great price. The service model is similar to chipotle, with an assembly line behind the counter, so it's easy to build what you want without a long wait."], ["Omar R.", "Nice clean place located in a very cool area. Very affordable and VERY delicious. I ordered the chicken schwarma and was happy to know that I was not misled by the overwhelming positive review. I definitely plan on coming back whenever I am in Lincoln again. They use square so i thought that was pretty cool."], ["Truthful T.", "There is no other way to eat Mediterranean food. The shawarma and gyro fall apart from being roasted for so long.  The menu provides you the opportunity to try a little bit of everything and its all delicious! The amount of quality food you are provided is extraordinary, if I am in Lincoln again, this will be a staple for me.  The staff is friendly, courteous and helpful.  The entire process is supremely efficient. If you have not tried this place, you must!"], ["Matthew A.", "We heard about this place from Yelp just passing through town. It was a great choice for lunch. I wasn't sure what to order, but the guy there suggested the chicken shawarma wrap and my sister in law and I both enjoyed it. Kind of messy, but delicious."], ["Renae N.", "I have been in Lincoln for 4 years, and never made it to this place (my husband had a bad experience when it first opened up and never wanted to go, even though I did, he finally relented). I was impressed! It was incredibly busy over the Friday lunch hour. The food was fast and very, very tasty. I had the falafel on a pita. The staff seemed distracted and uninterested in helping much, but I got my food quickly."], ["Krystal Y.", "They have delicious chicken gyros, hummus and pita! The tzatziki sauce was fresh and they have spicy tzatziki sauce options which also sounded great. Overall a great, inexpensive and quick bite to eat while passing through Lincoln, Nebraska!"], ["Krisha B.", "This place is really great especially if you aren't sure what you want. They have gyros, falafels, wraps, and rice bowls. Everything is really good! It's a casual atmosphere and the price is moderate. Ask for a sample if you are unsure before you order."], ["Ted B.", "Being a food-y college student I tend to spend my money wisely when it comes to good eating. This being said, I had read only good things about Sultan's Kite so I figured I would give it a try. The food was nothing short of great. The problem I found myself faced with was the absolutely awful service. Behind the counter were two guys, one clearly a manager of some sort and younger kid. The manager type character served with the biggest attitude I have ever seen and was beyond rude (hurrying me out of the store, grunting of obligation when I asked for something else,etc..). I am one who likes a restaurant for the food it serves, but this man's attitude will permanently keep me away from his restaurant. Too bad, I thought I found the best greek food in town."], ["Nathan C.", "Absolutely one of the best places to eat in Lincoln Nebraska. If you are a true foodie like I am, you will come to appreciate Sultan's Kite."], ["Amanda B.", "I'd eaten at Sultan's Kite before I realized so many Yelpers had given it a near perfect rating. So, on my next trip I analyzed my way through the meal and decided that I agree!  My partner in crime always gets a gyro. I usually get the Chicken Tikka Korma, side salad, and potato wedge. He's not hip on Indian flavors, so I love that their gyros fit his bill!  Sauces and dressings are all delicious. The spicy tahzikki is my favorite. I even get excited thinking about their rice!There are only a few tables and booths in their galley- style restaurant, so I've only taken my food to-go. The best part about this place? The value. For way, way less money, time, and effort I can get some of my favorite Indian/ Mediterranean flavors. And feel uber satisfied."], ["Josh C.", "Wow...  a lot better than what I expected.  Actually the chiken korma was very good.  Curry taste green soup was great in this cold weather. ..Go for the chicken!!"], ["Melissa M.", "When you come here you have to get the chicken tikka korma. It is so good. Other people with me who order something else are always sorry when I give them a bite of mine."], ["Alex M.", "Great food and proximity to SCC's downtown campus. Very quick service and always clean."], ["Liz G.", "Writing this as a frequent traveler living in Chicago, just to add some perspective.Let's keep in mind that 3 stars means A-OK and Sultan's Kite is very good, just maybe not 5 stars top of the Lincoln rankings good. Although I haven't tried too many places yet...  I had a gyro pita topped with the taziki and the spicy chutney- in hind site I should have only gotten one. The gyro meat was very flavorful and piled on as was the sauce and toppings. Thinking back I must not have gotten the chutney because there was no spice to the pita, if it was on there then we need to talk about spice levels. I also got some baklava which was really good, super flakey and just the right amount of sweet.I would recommend this place if you want some quality food in the area for the great prices, quality and amount of food you get."], ["KR H.", "Lunch gyro...Mediterranean choices.Get it like you want it...bowl, in a pita, salad, etc.It's always hot fresh and high qualityLine moves fastBaklava is ok, but I've had better... Everything else you can't go wrong on."], ["Curt S.", "Saw all of the great reviews on here so I talked my family into trying it out.  My two boys (11 & 14) were not thrilled about going but quickly changed their minds when they were able to try samples of the Chicken Shawarma and Gyro meat.  Now they are already asking about when we can go back!The restaurant is clean, the staff is friendly and the food is GREAT.  Don't worry boys, we are definitely going back!"], ["Jan M.", "Road trip from Minnesota to California, looking for lunch in Lincoln. Found this great little place on Yelp. Easy to find off I80. Good food, good prices. Worth the trip off the freeway! Thanks for the great lunch!"], ["Kelly G.", "Delicious! Their chicken shwarma is packed with flavor and the chicken itself is so tender and perfectly seasoned. The veggies were a little wilted when we went there for dinner, but aside from that the portions are huge, the flavors amazing and the price is great. Go there!"], ["Nick H.", "I went in before my friends to go to the bathroom before getting in line, but the guy at the end of the line said \"there was nothing for me back there.\" When I came back with my friends the guy said \"Oh now are you gonna be pissed?\" Which is completely unprofessional and ridiculous. If your service isn't fast, why should I have to wait in line before I have to pee? Awful service and there are plenty of places nearby that are not so ridiculous."], ["Katy P.", "New to town, and so far this is my FAVORITE place. I love the chicken shawarma with the spicy taziki. The falafel is the best I've ever had. And the baklava.....I could die. Great meal, I would eat t everyday if I could."], ["Ganisha S.", "I came here with my sister when they had recently opened and LOVED it. I was in town from California for work and could not get enough of the Chicken Schawrma!I was in town again a few weeks ago with a co-worker and we decided to come here. When I walked it, the gentlemen working there remembered me! He remembered where I was from, what work I do in Lincoln, and even my sister. The gentlemen was so kind and energetic. Incredible service! I had the falafel this time and it was to die for! We loved the service and food so much, we actually went back the next day before flying back home. I will come to this restaurant every time I'm in Lincoln, no doubt."], ["Gigi A.", "You really can't go wrong with the humnus or the shawarma. Good hummus says a lot about a place, and their hummus is awesome! So is their pita bread, don't know if they make it on site but its delicious.Quick, easy yummy food.I wish my local middle eastern place was this yummy. But alas, I shall return for their hummus.Oh, and their red taziki sauce is pretty awesome too."], ["Jill S.", "One word. Amazing. The food is delicious and so reasonably priced. The chicken schwarma is amazing and I am so happy that this restaurant is in Lincoln. It is a GEM of a place. The portions are perfect, the service is so friendly and fast. I would go here more often if I worked downtown."], ["Malcolm C.", "This is a must try, good fast service... Everything on the menu is great.  You can't go wrong with this place!!"], ["Emma C.", "I was really nervous to try this place out but i ended up loving it. I had no idea that the cook was the owner. The staff was so polite and I would suggest this restaurant to anyone."], ["Christine L.", "YUM! Both the chicken shawarma and the chicken tikka korma are DELICIOUS. Their potato wedges are amazing too! All of their sauces are scrumptious but my favorite is the green chutney. The combination of cooling creamy yogurt with a fairly high level of heat cannot be beat. I crave it regularly. I hear that the rest of their menu is also fantastic too!Sultan and all of the folks that work here are friendly and make me feel welcome each and every time, even though I just grab my order to go. Love this place!!"], ["Michelle M.", "This is my go-to restaurant! If I could give it more than 5 stars, I would! I have tried everything on the menu and loved each dish I have eaten. My favorite is the falafel. Sometimes I get food to go. Other times, I take a little longer to sit and enjoy my food. The staff is always super friendly and fast. It can be a little difficult to fit in a big group of friends, but the size of the place is what gives it its charm."], ["Alek Z.", "As promised, I came back. Several times, in fact. After trying the delicious gyro, I then had the chicken shawarma, the chicken tika korma and the falafel. All were very good and served in satisfying amounts. The baklava's been consistently well-made, too.I've yet to get a custom \"Sultan's Choice,\" but I definitely will my next time through, in the near future."], ["Garrett E.", "Sultan whips up some chicken tikka korma that explodes with flavor. The first time I had this I came back the next day for the same thing. After eating this 25+ times, I grew tired and decided to try to chicken shawarma. My mind was blown to parts to unknown. I have yet to hit my limit on the shawarma and get excited every time I head the Sultan's way. Have them add a couple pieces of falafel on your shawarma for the ultimate wrap.Don't get a gyro! They're the same everywhere!!"], ["Christen N.", "I moved from Lincoln to North Carolina and I have to say this is the one restaurant I miss the most. Small menu, but AMAZING quality. I was a frequent customer for many years and I don't ever think I had a bad meal. It was consistently great. I even brought in relatives from out of town for  my UNL graduation dinner (yes-we ate here as I needed one last fix) and guess what, they are still talking about how good their food was. Don't go to Lincoln without eating here! P.S get the korma!"], ["Dustin R.", "The food is top notch! The staff is great!"], ["Margo H.", "You know, Sultan's Kite isn't fancy.  They don't' have a huge menu but what they have is very good and very affordable.  Crave-worthy in fact. Maybe you've heard good things about Sultan's Kite from your favorite and most lovable drunk who only eats there after the bars close.  Maybe you've wondered if you should try it sober.You should.  Especially for lunch. If you like Mediterranean food at all this is a very good place to go.  Maybe not on a date first or second date.  Not for a formal business lunch but certainly a great place for all other dining with others occasions.  If you are going to a movie or just want to get out of the office hit up the Kite.  I highly recommend the Chicken Schwarma rice \"bowl\" with the salad.  Oddly enough  the salad dressing is one of the highlights of the meal.   I like the modular menu and nicely priced sides and extras. A The service is good and the atmosphere is acceptable for the style of dining, although in winter it tends to be a little cold due to the large front window."], ["Koji L.", "It's a Togo order place but go have lots of seating.  You choose your meat and choices of rice or bread.  Good stuff"], ["Adrian B.", "I have been a customer of Sultans since his days at his previous establishment downtown and was interested to see how his new venture would go.  I was not disappointed in the least.  The Chicken Shawarma and Chicken Tikka Korma are to die for!  I like to get a combo of both dishes with rice and he was happy to oblige.  He always remembers my order before I even place it and the Baklava are sweet and moist which is hard to achieve.  The place also has lovely lentil soup.  I see college students constantly flocking to the place so can tell it's gaining legendary status with it's cheap prices and variety.  Not just another Gyro place.  I recommend it to the open minded foodie."], ["Conrad C.", "you can't go wrong with the Sult. hummus & pita and lentil soup is my usual meal.  the chicken shwarma is delicious.  simple, cheap, good food!"], ["Ingrid H.", "I love this place! It's a great spot for legitimately good gyros & falafel in Lincoln. Reasonably priced, good service. I'm on my way to becoming a regular."], ["Jimmy T.", "A taste one cannot resist to have a second order.  Highly recommended!  A zing to the taste buds!  Yup,,"], ["Toni A.", "So delicious! One of my favorites since Sultan opened last year. I try to go at least once a week and usually get a different thing each time. Like Cindy E mentioned, you get to build your own entree and portions are huge. Options are limited but what they offer is all wonderful. The Lentil soup is good if a bit think for me. My favorite is the chicken schwarma on a pita with salad but I do also enjoy the chicken tikka korma on rice. If you want to go crazy and mix it up, Sultan is willing to do half orders so you can get both korma and schwarma in one order. I have not tried the gyros as I am not a big fan of lamb but I have tried everything else on the menu. Three different sauces are offered: traditional tzatziki, red chutney (medium), and green chutney (spicy). Hummus is available as well. The owners have recently expanded to offer made to order breakfast which includes several different omelets, hash browns and pancakes.  This is rare in downtown Lincoln unless you are in one of the hotels so it's a great locally owned option. I definitely recommend Sultan's Kite to anyone visiting Lincoln. Not only are you supporting a locally owned business, the food is delicious!"], ["Sherry W.", "I didn't think there would be any food in Nebraska except steaks and corn (no offense to native Nebraskans!), but Sultan's Kite was a pleasant surprise. The chicken shwarma was juicy, flavorful, and most importantly not overcooked. The highlight here is definitely the spicy tzatziki; I'd never had spicy tzatziki before, and now every time I see tzatziki I wish it was spicy. It's got a bit of bite, but it cools your palate too. Sultan, you've spoiled me."]], "Gourmet Grill": [["Travis P.", "Get the Spicy Z Plate.  I have no idea what Z stands for, but it was amazing.  It was a large gyro with spicy chili sauce that came with crinkle fries.  I tried the corn nuggets and enjoyed those too."], ["Christina B.", "The owner is a snake. Came here with my inebriated friends while I personally was sober and he was trying to rip each and every one of them off. Good thing I was there to catch every \"math error\" he had. Would have made around 40 dollars off of them if I was not there. Other workers are great people but the owner himself (longer haired guy) is a snake do not come here unless you are paying close attention. Food sub par. Never returning to this place only because of the owner himself. Be aware people he will take advantage of you."], ["Alex G.", "I had the \"Philly Steak\". Good size and more than filled me up with tons of fries. Nothing to write home about."], ["Justina J.", "Been here twice, and I've always been impressed with the quality of food. May be a hole in a wall, but worth the trip for your starving belly."], ["Adam J.", "Used to be one of my favorites but has really gone down hill. Last time I went to employee was outside smoking and when he came inside to help me he only rinsed his hands off. No soap was used! Sick. Then the fries that I was given was at least 2 hours old. What a disappointment. From now on I will only be going to Ali Babbas."], ["Alek Z.", "They might not be the \"King of Gyros,\" but they're pretty decent. I'll try to rate this place in and of itself, but I just can't help but draw comparisons to Sultan's Kite. At the latter, the portions are bigger for the price and the baklava's better. But for their own sake, their food is pretty decent. I ordered a gyro, a SoBe and a baklava. The gyro was decent, although a tad on the dry side as I got closer to finishing it. The baklava was alright, but also a bit dry. Plus it was one piece for $1.49, while at Sultan's Kite you get two pieces for that price. I think the whole deal came out to like 12 bucks or so.The servers looked legit and were nice enough. In short, not a bad joint overall, but you get more bang for your buck over at Sultan's Kite.Interestingly, they're located right next to another Greek place, Ali Baba, which I've yet to check out."], ["Don M.", "Lots of greek restaurants within walking distance of this place.  When I go, I get their gyro.  They are not the best gyro in town, nor are they the worst.  I prefer their french fries, and enjoy the seasoning.  So when I am in the mood for french fries instead of greek potato's this is where I go.   Well worth the effort to give it a try and see for yourself where it falls in the Greek spectrum in Lincoln."], ["Sarah C.", "YUCK. My friend wanted to go here to \"support the locals\" while passing through and we all regretted it. None of us were satisfied with our gyro, chicken tender or burger. The placed seemed dirty, like the tables were covered in film. And according to friends, the washroom was nasty too. The only reason I'm giving it two stars is because the guy working was super sweet. You'd think though that if something has \"gourmet\" in the title, that might be what you get, not the case here....."], ["Jamison H.", "Hot & spicy Z plate!Enough said..."], ["Tom D.", "I was quite impresses with the service, menu, and appearance and taste of the food at The Gourmet Grill. This place is nothing fancy or even remotely trendy - and it's not trying to be.  It's just great gyros, burgers, kabobs, and crinkle cut fries. Loved it!"], ["Sara S.", "The food wasn't bad taste wise. But... I watched the Guy making our food and after he handled our money and gave us change back, he scratched his forehead, ran his hand atop his hair and then went to touch my hamburger bun, all without washing his hands, I asked him to wash his hands, and he did, he then went outside to smoke and his fellow co-worker came in and made a grand gesture pointed towards me about how he too was washing his hands, in almost a mockery, If hand washing was a joke. No thank you to this place.  The food isn't worth salmonella. And sanitation isn't funny. Who knows what he would have done if I hadnt been watching."], ["Ian R.", "Very average.Had the gyro plate.  Consisted of a (starting at the base and moving up) of pita bread, gyro meat, assorted vegetables (tomatoes and onions), tatziki sauce, and french fries.  No real taste to the sauce either; however the fries were crispy and flavorful.The meat, the principle component of the dish, is standard-issue Kronos meat.  I find it too salty and lacking any real character.  Also since the meat is not freshly sliced off, (it is stored in a heated container) it becomes soggy and lacks any crispiness.One of the biggest problems I had was everything was piled high on a tiny plate and after a few bites food started falling off.  Very annoying when you're trying to eat the food.  Bigger plates would solve this dilemma.At $6.80 the value/quantity ratio is pretty good but I wouldn't go out of my way to come here again."], ["Jimmy H.", "Are you drunk? If you can make it about a block check out Sultan's Kite. It is way better! However, the staff is nice and the food is okay. It is a bit dirty, but pretty inexpensive. The Portions are large so if you want it and can't crawl anywhere else then just do it."], ["Paxton F.", "There is a lot of hullabaloo as to weather this place or Ali Baba's has the better gyros.  I personally choose this place based on customer loyalty and I like the seasoning on their fries.  The gyros are very similar though.  This place definitely has the quirkier staff, they can be as strange as it gets.  The owner, who everyone calls George (not his name) is great and is a pro at dealing with swarms of drunkards hovering for his fare.An enjoyable experience."], ["Salmon P.", "Love it! Though I always get it confused with the place next door. What's that called again? Oh never mind. They're both the best."], ["trevor c.", "BEST Gyros in Nebraska. Awesome, very friendly employees. Everything is cooked fresh and the portions are plenty big enough. Great location on 14th and O st. with outdoor seating. This place has a huge fan base with very loyal customers."], ["Chris S.", "I can't tell you how hungry I was when I stopped for lunch here. The boys at Gourmet served up some hot gyros in record time. It definitely hit the spot. The outdoor seating gave extra entertainment as we could hear the cheers echo down the bars on O Street as the Cornhuskers scored touchdowns."], ["Kelly R.", "This was probably my fave dining experience in Lincoln(well, besides Ivanna Cone...hello!). We were wandering amok, bellies growling, and happened upon the Gourmet Grill. Great Gyros eaten outside on a nice, sunny day. Who could ask for more? The fries were good too! Piping hot, with a dash of seasoning salt. Yum!"], ["Sarah A.", "Gourmet Grill definitely has best gyros in town and the fries and Greek potatoes (I think that's what they are called) are fantastic.  You certainly won't go home hungry."]], "Falafel King": [["Jeremy A.", "It's good. Food is what can be expected. Atmosphere is kind of 'not clean enough, but so whatish.' I was just driving through and wanted something different for lunch. I wasn't disappointed."], ["Dan B.", "Ok, the name is misleading.  Genuinely the worst falafel I have ever had.  Not fresh (not fried to order) greasy, yet bone dry falafel balls.  Hummus was good, pickled veg was good...but it did not come with any white tahini or tzatziki  type sauce at all, which could just be the way the do it in Iraq....but with limp dry balls it was badly needed.  Probably my first and last time.  I want fresh food.  More than that I want un-lazy, hot, decent food. I am going to buy an edible lunch now from somewhere that serves today's food."], ["M R.", "Its a nice place to have some decent middle Eastern food. I tried the falafel and sandwich, pretty delicious. Best part about them , the price is very reasonable."]], "Ali Baba Gyros": [["Rob J.", "One of the best gyros I've ever had. Great prices. Good atmosphere. I love hole in the wall places like this."], ["E G.", "Great gyros. some say it's a bit overpriced but you get a lot of food. So you basically get what you pay for. :) The man who helped us (I'm guessing is the owner) is super friendly. :)"], ["Avinash P.", "Awesome food and great atmosphere. A must try!"], ["Luke I.", "Sorry. Not a fan.  I ordered the falafel and wanted to substitute hummus for the white dairy sauce.  This was not acceptable to the owner, and I had to pay an extra 5.99 for a side of hummus.  The veggies were pale and old.I'll try the other gyro place down the street.  No problem!"], ["Danielle H.", "Hole in the wall right near campus, open late and serves the best gyros! Big portion sizes! Friendly service, highly recommend."], ["Derek S.", "The best place for a gyro or chicken kabob in town! The Z- plate is the greatest thing I have ever eaten anywhere. The staff is friendly and they are open late. Don't be fooled by the other ripoff place in town, this is the real deal!"], ["Zac T.", "Friendly employees, great food, cozy and nostalgic dining area. If you grew up in Lincoln, maybe just went to college there, I'm sure this place is familiar. Everything on the menu is very good, definitely get a gyro if you can't decide what to eat!"], ["Arnold F.", "The gyros are yummy. The place gives off a quint family run atmosphere. Great care goes into each dish. Good food, good people. I would eat here again for sure."], ["Jon A.", "I have certainly had much better gyros before. It was just very average and not worth my 8 dollars again. The Tzatziki sauce was sub par to say the least."], ["Solomon H.", "Always good gyros to have for anytime of the day!  Portion is adequate for the money & the steak fries are good compliment !"], ["Kim R.", "Been going to Ali baba's for a decade and a half....it's amazing ...every damn time! !!!! Best steak fries EVER!!!"], ["Teddy W.", "Best gyro in town. Little pricey and you definitely gotta ask em to make it good or they will skimp. Awesome after the bars, or even just a switch it up dinner."], ["KR H.", "Reasonable PricesFast serviceGreat quality food and lots of choicesNever had anything I didn't really enjoy.Serving size is generous.This place is a lunch treasure.Better than your average gyro place for sure."], ["Lilah R.", "I have been an Ali baba's fan since I was in high school and extremely picky on what I would even try.  Now any time I can find an excuse to get to downtown it's a sure bet I'm stopping at Ali baba's.  The gyros are massive.  If you're looking for something light to snack on I would try something else.  The gyros are cheap and are more than enough for you to pick at for the day.  The service is always great.  Don't expect anything fancy decor-wise but if you are enjoying the night life down town and are looking for something to end the night, Ali baba's gyros are the way to go."], ["Lisa S.", "Food was delicious, good service, will be back soon to get my favorite Greek food in Lincoln."], ["Janet L.", "I love the gyros and steak fries here! By far, the best gyros in town, and the steak fries are fantastic"], ["Alek Z.", "Pretty decent for Americanized Greek food. In fact, they're more deserving of like a 3.5 star rating.I'm on a crusade to try out all the Mediterranean joints in town, so I stopped in here earlier today for lunch. Their menu seemed to have quite a few options, but whenever I try someplace new I always order the standard: gyro and baklava. I was feeling especially hungry so I got the plate with everything on it. I was pleasantly surprised by the succulency (new favorite word) of the meat, that part was good. The sauce was good as well, but there was something a little off about it. Either this was some kind of ranch dressing or it was a style of tzatziki that I'm unfamiliar with. It was pretty tasty, if not possibly somewhat unauthentic. The baklava was also pretty good, so extra points for that. The whole shebang plus drink came out to like $10.39, which seems about average. Overall, I've got no real complaints. A pretty standard but satisfactory joint."], ["Sarah P.", "I love the Z plate. Fills me up every time."], ["Don M.", "We have several places in town to buy greek frood.  Some are fancier, some are stranger, but for a simple gyro sandwich, there is no better place in Lincoln to go.  Large portions of meat and generous sauce is what sets this gyro apart from any place else in Lincoln.   It may not look fancy, but taste is the determining factor isn't it."], ["Ibrahim A.", "Good restaurant and deserve 4 stares.Please try it and you will love it."], ["Stu F.", "Serving college kids. If your expecting decent food try somewhere else. I'm a food critique with over 100 reviews on TA."], ["Christina H.", "I really enjoy Ali Babas. The people who work there are friendly and helpful, and the food is consistently good. The menu is ridiculously extensive. I say ridiculously because there is no reason to get anything other than the cheese gyro. But that's just my opinion. My brother had the falafel and said it was very good as well. Reasonably priced and a great location. The interior is rather boring, but it's got that hole-in-the-wall charm that I think adds to the whole experience. Overall:Service: Always friendly, those guys are great.Food: Consistently good; large menu.Atmosphere: Acceptable. Charmingly acceptable."], ["Toni A.", "Going out to eat is almost like a mating ritual for me and my partner so we tend to go out to eat frequently. When we want a burger, we head over to Ali Baba Gyros. Yes. CHEESEBURGERS. Mushroom Swiss to be exact. It does take extra time as they make your meat patty fresh from frozen but they are nice enough to tell you that it will take extra. It's great that they know people are in a hurry downtown. Open late, you can head in until 2am or so and still order off the menu. I am not a fan of lamb so I don't get gyros, but the burgers are the big draw for me. You get a choice of steak fries or freshly made crinkle cuts. Cheese sticks are delicious and so are the fried mushrooms. We have ordered onion rings but they were undercooked and not delicious so we stick to fries. Ali Baba has a large selection of items; almost too many! But there are some vegetarian options on the menu and they usually make everything fresh to order although some may be frozen. Overall, a good choice for downtown Lincoln any time of day. During the warm months, they have a great outside seating area where you can park your bike, sit, enjoy the weather and people watch."], ["Sina S.", "Gotta try this place! It's a Lincoln staple and has been around forever. I get the same tandoori chicken kabob every time! It's tasty on pita or over salad. I like the portion size and I can save it for later or just save my appetite for this delicious/healthy dish!"], ["King B.", "A very friendly staff and a large menu. If you are downtown and are having a Greek craving, stop in. We have been going there for years and love the owner! Vegetarian friendly with some good American choices as well."], ["Ruth F.", "I've been coming here for years, ever since George's Greek Gyro's moved down the street and I realized that, as a vegetarian, there was no longer anything I could get there but a salad on a pita.I kind of like the Greek ranch sauce (I think of it as a tzatziki variant) and the Greek fries are awesome.I usually get the falafel, which I've been happy with.  There's a big menu, carefully chalked in on a big chalkboard above the owner's head.Credit cards OK but it costs extra to use one.The place is a little dinged up (it's been a restaurant, without many changes, for about the last 25 years now; my dad started eating at George's in the early 80s) but that doesn't bother me.  The stupid TV they installed does.  I keep saying I'll stop coming here because of the TV but I still come by occasionally."], ["Kim J.", "I hate to give this place a bad review.  But the food was terrible.  I had to go to Lincoln for a meeting.  I have searched Omaha for a good falafel sandwich but have yet to find one that I consider even mediocre.  As I was driving in, I noticed this place and they had a sign that said \"falafel\".  On the way back I had to stop. I will say that the guy that served me, that I assume was the owner was wonderful.  He was VERY VERY nice.  I ordered the falafel sandwich with a side of hummus.  They make their own bread which was pretty good but it was a bit thick for me.  When he initially brought me the sandwich, there was no sauce.  I asked for yogurt-tahini sauce.  What I got was some disgusting sauce that was closer to a bad ranch dressing.  I was able to dip the falafel in the hummus, which had alot of poor quality oil, similar to motor oil, on top of it.  The sandwich did come with fries, which were the best part of the meal.  When I initially saw the fries, I thought--oh--i didn't want fries.  But they were good.The owner had a conversation with another customer and told him the most popular thing is the gyro and that is what most people order the first time they were in.  He was impressed that I had ordered the falafel.  I should have told him how bad stuff was but he was so nice.In their case under the cash register, were some delicious looking pastries.   I asked him where they were from because I recognized the boxes from a place that I used to frequent in Dearborn MI.  He was familiar with the place but reported that they made the pastries themselves.  I had to get some, so I ordered two to eat on my drive back.  They too, were a huge disappointment.  I think they were stale and had a rather rancid oil and honey quality to them.  Maybe their gyros are better....."], ["Jimmy H.", "They hook it up on the gyro meat! They are open late which works well for the kids going to Harry Potter's midnight premier or after you get out of the bar (I am the latter)."], ["Quetta L.", "OMG!!  The tandoori chicken kabob is the best late night food ever (but you're going to have to wait for it!)Those lemon-y potatoes are so tasty as well."], ["Salmon P.", "Love it! Though I always confuse it with the place next door. What's that one called again? Oh never mind. They're both the best."], ["Josh S.", "I am never disappointed here.  Great people run this place, and the food is fantastic.  I like the Z plate, the chicken kabob, and the burgers.  All very tasty and reasonably priced.  Plus they are open late!"], ["Ben L.", "We've been eating at Ali Baba's for years and it's one of our favorite places in Lincoln.  Our go-to meal is the gyro plate, which is a great value for the price.  You get a generous helping of gyro meat piled on their delicious pita bread, covered with onion, tomato and their great tzatziki (not ranch) sauce.  The greek potato fries are fantastic too.  The owner is one of the most friendly and likable people running a restaurant in town.  He's always happy to see us when we drop by.  If you're in Lincoln, it's definitely worth a try."], ["HK T.", "Tried this place on a recommendation from a coworker.  I was pretty disappointed with the Gyros.  Large portion - but the gyro meat was very salty & I couldn't finish my gyro."], ["J C.", "i think the best Gyro hut in Lincoln"]], "King Kong Restaurant": [["Jacob B.", "Get the gyro! I'll just throw that out there first. The restaurant itself has a burger-joint feel but with a gorilla themed twist that is fun. However, King Kongs has some interesting pieces to their menu including a Philly cheese steak and a gyro.I couldn't resist trying the gyro platter, and I was not disappointed. The platter came with crispy fries, a tasty Greek style salad, and a loaded gyro that tastes great. The price was fair and the service was very fast. The parking lot and drink machine could use a little maintenance but I consider those minor problems.If you are looking for good fast food, I would recommend trying King Kongs."], ["Frosty D.", "Hit the drive thru and got a gyro. Don't eat gyros all that often but know good from bad. This one was very good. Would have picked up a burger, but the price indicated it was probably as big as a pizza.  Maybe next time."], ["Walt G.", "The staff was surly, the food was poor and the prices were way too high. I have no idea why this place gets good reviews. It was awful."], ["Beca H.", "I love the chicken gyro! Thats all I will get with the greek potatoes! Love it! I did however receive and unwanted hair in my potatoes one day. I picked it out and kept eating. You get a lot of food for what you pay in my opinion. It's like 5 pounds of food for 10 bucks."], ["Stephanie V.", "Great Gyros, Huge Burgers... Not sure what The King Kong decor has to do with Greek food but overall good place"], ["Joe T.", "I have not been in one since my college days.  Visiting friends I decided to stop in here for lunch after visiting the zoo.  It brought back memories of my college days.  They still have the different size burgers depending how hungry you are.  Years removed from college, I ordered the regular King Kong combo.  The food is still as good as I remembered it.   A good place for burger that is better than fast food but does not take to long."], ["Lisa B.", "Love the food and always friendly service!! We will be back. Love love the Greek food. And burgers! Salad...burger and baclava. My boyfriend had a gyro I am going for that next time. Awesomeness! Muy Rico! MUCH I SIMON GRACIAS!"], ["Elena C.", "Cool concept and delicious food!! I love the independent vibe, the colorful atmosphere, and the burgers. These guys really have the perfect greasy dank burger meal down. I would compare it as being a step above B-Bops or Burger King in quality, flavor, portions, and atmosphere. I ordered a double but ended up having to take a patty off because it was so large! A problem I never have at BK. Their food is that much more quality and filling than the chains. Good stop on your way to and from Rado! ;)"], ["Jessica B.", "I've never been so disgusted and have never given a one star. I went here for the first time and i had a giant burger and fries. The burger was burnt and was nothing special. I could've made it at home. The fries seemed like I could've bought a frozen bag at walmart and sprinkled a whole buncha seasoning on it. It made me feel gross. I'm sorry but I will never come back. Ever! I'm surprised it's still open to be honest. I was just so disappointed /: next time I'll go to Diary Queen across the street."], ["Ryan M.", "Though I know a lot of people like it, this place has never impressed me with their food.  There are places in Lincoln to get better versions of each menu item at around the same price.So what does that leave?  Convenience?  I suppose if you're traveling along I-80 and need to stop for gas and a meal, that might be the case.  But as others have pointed out, there's no point in trying to eat this stuff in a car, so you'll want to actually go in.You'll get plenty of food with an order, that's not an issue here.  The place is reasonably clean, quick with service (drive thru also moves along fine), and the portions are large.  I'm just not a fan of what actually makes up the meals.Over the handful of times I've tried them, I've found the food bland, overly greasy, and having what little flavors remain muddled and run together.  It just smacks of poorly done everything, at least regarding the food.  Even the gyros are only average, if that, and consistently reward me with an unhappy stomach.Now, before the management change a number of years back, the service here was awful.  So bad that I refused to ever go again.  When the management changed, I gave them another chance and can happily say things in that area have vastly improved.But the food hasn't gotten any better.  I tend to try them every six months or so, for some unknown reason, and am always disappointed no matter what I end up getting.  This last time was probably my final attempt.  There are just too many options within a reasonable distance that can offer a better, similarly priced version of something on their menu."], ["Heidi J.", "King Kong promises a fun atmosphere for the whole family. The food portions are humongous , so make sure you go with an appetite. The place was clean and the staff were friendly. It was also very easy to find."], ["Derek B.", "Went here a LONG time ago and ordered a burger, WAS NOT impressed as meat seemed very dry.  However, I gave it a chance about a month ago and came back twice.IMO, come here for the Greek food, meaning Gyro's, Greek Salads and Greek Potatoes.  You don't go to a Greek place for a cheap steak or an overpriced burger.  If you stick with the Gyro's you should be fine.  One of the other posters said they didn't think it was the best Gyro in Lincoln or that the portion size was that big.  However, I have to disagree.  I have been to Ali-Baba's downtown and I think Kong's is better both in taste and in size.  I haven't been to the Partheon yet, but, plan to do so as I have heard good things.  The two times I've had Gyro's here, they have been very good sized (I'm sure it does matter who's making the Gyro's that particular time as far as portion size.)  Once I had the Gyro platter and I was stuffed.  The Greek salad and Greek potatoes were VERY good as well.  I asked if they sold their Greek dressing, unfortunately the answer was \"No.\"  The dressing is that good.  Also, I think the flavor of the meat is some of the best I've had in Nebraska.  If it weren't for my bad experience with the Burger, I would probably give this place 5 stars.  Also, a tip:  If you like your food HOT, be careful when asking for your Gyro HOT.  I did, the dry rub was very good, but, EXTREMELY HOT.  I almost couldn't eat it except for drenching it in extra Tzaziki sauce.  So, I'd ask for the hot rub on the side."], ["Joe M.", "One of the best gyros I've had. Great fries. The burgers are good too, and huge! I made the mistake of ordering the double cheeseburger... I couldn't finish it, but I love leftovers!"], ["James G.", "It was late, and we were road weary.  Stayed at the hotel right next to this place, and walked over.  It had \"this can't be good\" written all over it, but it was different, decorated with gorillas outside and in.  There were only two other people in the place, and four employees.  They sell burgers and gyros and the portions are enormous.  The meat hanging on the gyro thing looked gross, but the wife went for it anyway.  I stuck with a King Kong burger, which is 1/2 pound of meat.  Had fried zucchini too.  Ate in our room.  Surprised - it wasn't that bad.  Not great by any stretch, but reminded me of drive-in food.  The gyro ended up tasting way better than the burger.  French fries are double-cooked so very tasty."], ["Lucas H.", "To be honest, I was expecting to give this place about 1 to 2 stars. I'm not exactly sure how they stay in business, because they're overpriced, the pictures of food look disgusting and the place seems pretty rundown. It must be because of the food. I got a gyro plate for $10 and was surprisingly impressed. The Gyro was good and the fries were excellent. If they were able to consistently produce this quality, I would come back."], ["John S.", "Had the gyro and fries, was not disappointed. The gyro was huge and I trashed it extremely quickly. Would go again!"], ["Don M.", "I am a fan of King Kong.  The gyro's are not the best in town and they tend to have slightly less meat than some of the other places, but you can always pay extra to get double meat.  They still taste good.   Their burgers are outstanding and you can build them as big as you want.   Personally I am a big fan of their fries which I think are among the best in town, as well as their fried zuchini and fried mushrooms.   I will say that I ordered their steak one time and it was chewy and fatty and took forever to eat it.  It was like eating an old boot.  So stay away from their steaks, but everything else is great."], ["Sarah J.", "Love this place every time I eat here the food is fresh,testyThe manger is so nice he care about every single customer. I love the food this place is the best."], ["Lucy C.", "we have been travelling from Chicago to Colorado and I have to say this is the WORST place we have stopped on the entire drive. staff was unhelpful and unfriendly. my husband ordered the food in English, the guy at the counter was a native Spanish speaker so my mom tried to talk to him in Spanish. he ignored her and continued speaking to my husband in English. we tried to order 3 Ault meals and 2 kids meals, which if you are not a child they will not sell you a drink on the same order...we got 5 kids meals and no drinks. so we bought 3 drinks separately for 7 dollars plus over 30 dollars we had spent on kids meals. basically we got 5 frozen food meals for 40 dollars. should have gone across the street to McDonald's."], ["Cheryl H.", "Stopped at Lincoln overnight and chose King Kong for Mediterranean food.  The Greek salad with grilled chicken was fabulous----crisp, fresh, yummy dressing.  The chicken was perfectly cooked.  The gyro plate with chicken and potatoes was a delicious blend of hot and savory with cool and crunchy.  The pita was tender.  The Baklava was okay!  It's fun inside, if a little loud."], ["Breann C.", "This place was a nice departure from the regular fast food joints you find on a road trip. We read another review and decided to go for it. We both got the chicken gyro- which had a ton of tasty grilled chicken. It was super filling and made fresh when we ordered. We passed on anything fried and each got a side salad. The salad was a pre-mixed Greek salad of iceberg lettuce, bell peppers, onion, and tomato. There was feta too and it was dressed with a vinegar dressing. It actually had a little bit of spice to it and wasn't bad, however the portions were kind of random (not tomatoes in one and lots of peppers in the other- you get what you get).We will likely stop here again on our next crossing of Neb. Yehaw!"], ["Renee W.", "MMMMMM This place is great!  The burgers are HUGE.  My fiance ordered a double something and he actually couldn't even finish it.  He normally eats 2 Whopper meals and is still hungry!!!!  I love the Gyro and the breaded zucchini.  If you ask for it you can get Gyro sauce for your zucchini instead of ranch...yum yum.Inside is sort of....well, it looks like a stuffed animal factory puked inside a McDonalds, but don't make your opinions based on that or you will truly be missing out!  Plus, kids love the stuffed animals ha ha. The staff is friendly and you can usually see the owners there (at least I think they are), and they are sweet in their own quirky way...some people may take offense to it, but I find nothing offensive about them at all...they just love to have fun and get to know people.A SPECIAL WARNING: most of the food is too big and messy to try to eat in the car, even while parked...i'm serious about this......I've tried several times, it just doesn't work out."], ["Adam H.", "On our way back to Colorado from the East on I-80 when we wanted something to eat. We saw the Gorillas and decided to investigate further. After checking in with our trusty yelp reviews we decided it was worth the risk. The gamble paid off big time! I had the Friday special which was a gyro with fries they were beyond amazing. My wife had what seemed to be the biggest Greek salad in history; my daughter had the chicken tenders. I will say that was the BEST gyro I have ever had and my wife loved the salad, we thought it would have been more expensive than it was, but it was no more expensive than Wendy's or Arby's (both in the same vicinity). I liked the place so much I pleaded with owner to open one In Fort Collins, Colorado, he declined. Bottom line is, try it, you will like it! I really believe this place is the only reason people remain living in Nebraska."], ["Jasmine M.", "On a long cross country drive from Maryland to Denver, Colorado, this was a nice pleasant road trip surprise! I was getting tired of the same old fast food, but I saw this huge King Kong sign from the highway and knew I had to check the place out.So how was it? Oen of the best gyros I had in quite some time! Not only was the food good, but the customer service was chill. The kid behind the counter was really nice and the entire atmosphere of the place has King Kong vintage posters, stuffed animals, and everything is basically King Kong themed. I even blogged about it!Worth checking out, especially if you happen to find yourself passing through Lincoln, Nebraska."], ["Mick B.", "A double Kong burger and fries is a hangover's widowmaker. King Kong is so trusting of the locals that they have chained down their giant gorilla statues. Who doesn't want a 400 lb ape in their lawn?"], ["Derek S.", "Not a bad place. The gyro and fries are pretty good. Also had good reviews about the Kong burger. A little pricey, but the size makes up for it.  If you like gorillas, then this is the place for you! They really took this theme and ran with it. There is even an electronic gorilla band."], ["Jake O.", "I'm a youth pastor from Iowa; a few weeks ago I was taking my teens to Nebraska for a youth rally, and we decided to stop at King Kong for lunch. First of all, there was a somewhat older woman who seemed to be in charge, and rude does not begin to describe her behavior. One of the young men in my group is from inner-city Texas originally, and was dressed exactly like it. She began taking our orders by asking me where we were from and why people dressed like that in Iowa. She made several other derogatory remarks about him, and was generally rude to us the whole time, interrupting our prayer and then sitting right next to us to keep an eye on my young friend.Now to clarify, the teen I brought did eventually strike back, which I do NOT condone, and I have had many conversations with him about it. He went and got a water cup and filled it with lemonade, and didn't pay. I began to offer to pay, but before I could, the woman kicked our entire youth group out, and made a show of trying to humiliate the young man from our group. As I said, I strongly discourage his behavior, but I had every intention of paying for him, and even tried explaining to her that I was a minister, but she was dead set on kicking this young man out long before he ever did anything.In short? This is the worst service I've ever experienced in my life, at any level of food. I've had my food dropped on the floor at a dirty KFC, and I'd go back there before I'd return to King Kong burger.Service aside, one of my teens pointed out that the food is served in comically large portions, to the point where no one finished their burger, even the hungriest of us.I wouldn't say don't eat here, but I recommend you know what kind of people they employ here, and do your best to look like a white, middle aged male."], ["Mike M.", "First time here and I got the gyro, fries drink special. It was $9.60 with tax. The staff was friendly and the food was served quick.  I like a gyro and order them often when traveling. The gyro was big but bland. Very little flavor. A big portion of fries but they're frozen and again little flavor. Hey, the diet pepsi was good.  Overall it was a mediocre meal.  From what I experienced and looking at previous reviews they give  you a lot of food but the prices reflect it so there is no deal there.  It was like I went to McDonalds and supersized it.   Filled me up but nothing special."], ["John G.", "Took the fam with a Groupon for lunch. 1st visit. Cost over $20 AFTER the $10 Groupon for 2 adults and 2 kids. Big portions. Tasted ok, but not great. 2 employees were gawking at my wife. Completely unacceptable... Been burping gyro for 4 hours. I'll never go there again."], ["Lesley W.", "Best gyro I've had in a very long time! Well worth the money."], ["Marisa V.", "All I can say is, do not judge this place by the way it looks outside. Decoration is a bit cheezy but the food is awesome. I had the grilled chicken salad and it was superb. The chicken was well marinated and grilled..yummy! My hubby had the gyro and fries. Yummy.. :) Fries were so good. I thought about taking food home but it would probably smell the car up..I will definitely go back next time we are in Lincoln. :)"], ["Alexandra B.", "first thing: this place does NOT serve chinese! it's fast food.Heard great things about this place from a friend, and decided to stop in for quick dinner on our way from Colorado to Illinois. Super convenienty located off the highway. It was pretty busy when we got there! I hear their gyros are great, but I got a 1/2 lb King Kong cheeseburger with cheese fries - burger was big, but just okay. Great cheese fries! My friend said the gyros in Chicago are better...can't say I'm surprised though! How many authetic Greeks can there possibly be in the middle of nowhere, Nebraska? Surprisingly though, the sirloin steak looked amazing. For fast food, it's pretty good and the outside/inside decor is pretty cool - gorillas everywhere :) Stop in if ever driving through!"], ["Rob S.", "I decided to try this restaurant simply because of the big King Kong on the top of the restaurant.  What I found was a place with an interesting variety.  They have some very large burgers starting at 1/2 pound.  I chose the Super King Kong - 2 lbs of beef.  I figured, why not?  I was not able to finish the whole thing (I did choke down 3/4 of it.)  It was one of the best burgers I've had.  Good charcoal taste.  Highly recommend it, but bring your appetite."], ["Hj V.", "Possibly the best thing about Nebraska!!! We had the BEST gyro salad I have ever eaten!!! This place is goofy looking, but the Greek food here is fabulous."], ["matt a.", "was working in Lincoln and decided to give the place a try.i like to try new places while traveling.the woman at the register was a bitch i guess.but that said the food was excellent and large portions for ten bucks.i had the chicken gyro plate.huge.get the greek potatoes they are incredible.i would not go if you are trying to drive and eat."]], "Sinbad's Restaurant": [["Jill D.", "We wanted to try a new restaurant tonight and found Sinbads on Yelp.  The reviews looked promising.  We were not disappointed!  We tried a combination platter so we could have a taste of many things.  They were all wonderful!  Loved the lentil soup, the chicken kebab and the biryani, but the falafel really stood out to me.  I had never tasted one I liked before.  Can't wait to go back!"], ["Taylor R.", "Doesn't get more authentic than people yelling across the restaurant in Arabic.Seriously though, my meal was so yummy. I started with the hummus, which had a little spiciness to it--different but good! I had the Sambosa for my main meal, also tasty. However, I made the mistake of filling up on pita and hummus, so I had to take most of my entree home. I don't mind enjoying it again though :)Lincoln has a lot of hidden, local places, and this is one. I hope to come back!"], ["Fazle H.", "Great restaurant,  good food,  nice people and fast service. Ordered the lamb and it was pretty good. The okra soup was not too but a little soggy.  The lamb came on a bed of rice and with a full piece of pita bread. The bread itself was homemade and you can tell by the taste and texture of the bread itself.   It's more of a local neighborhood joint. I can't be too excited about the place or return because I was ripped off. The lamb entree was $11.99 and it came with a soup.  I still can't figure out how the final bill came to $15 and some change.  Even with tax I can't see paying more than $13."], ["M R.", "The price is a little expensive, but I liked the combo kabab at $16.99. I took out as lot of food to eat in. The waitress is friendly and was showing a smiling face. That's very important for me. Good place to stop by . management should reduce the price to bring in more customers."], ["Mike O.", "Good authentic middle eastern.  The combination beef chicken lamb Kabob plate was well done and plenty for dinner."], ["Malcolm C.", "This place is great.  Everything on the menu is fresh and amazing...this is a place worth going to time and time again...inside is very friendly, quaint and clean!! Do yourself a flavor and stop by!!"], ["Alek Z.", "A hidden gem for Greek and Middle Eastern food lovers! The outside is rather unassuming, but don't let that fool you. The inside is pretty clean, and the food is good and inexpensive for the portions you get.I got the small (lunch-sized) lamb gyro, which was actually a pretty filling meal. Just know that it's served as a meat dish, with the pita bread (two nice, fluffy pieces) is served separate. The lamb was delicious, easily competition for The Sultan's Kite. The cool thing too is they serve a free cup of Iraqi tea with each order! For dessert I asked for baklava, and the guy showed me their three different styles of \"baklava.\" Now I put that in quotes not because it wasn't totally delicious, but because two of their styles were ones I'd never seen before. One resembled small cannoli, and the other, which I got, kinda looked like funnel cake. It was made of intertwined, clear pieces of hardened dough, and covered in clear honey. It was freaking succulent.And the prices were great! For all that plus tip, I didn't shell out more than 12 bucks, for a filling lunch. Totally recommend this place."], ["Sultan K.", "The food is average. The cook is always siting outside smoking cigarette. There side dishes are ok the main dish is not so good."], ["Brady C.", "I am definitely a regular here. In my opinion this is the best Middle Eastern/Mediterranean restaurant out of both Lincoln and Omaha. It is Iraqi styled and they have amazing kafta kabobs, chicken kabobs are tender and not dry, beef kabobs also tender and very flavorful. Plus you can help yourself to free tea. Service is great, owner is awesome, food is delicious. I started out just getting the Kafta Kabobs when i would go there but changed my order to the small combo which includes kafta, chicken, beef kabobs along with Iraqi style bread, salad, and a sambosa, along with a tasty garlic dipping sauce or dressing... very filling, but incredibly delicious. Closest Kafta to the ones I had actually gotten in Iraq. Hummus is very good too, but i don't order it much considering the Small Combo more than fills me up."], ["Brittini R.", "I can't say enough about this restaurant!!! From the outside it looks a little run down, but inside it is clean, cozy, and quite. A great spot for a cute couple or a hungry group, the combo plates are super great to share. The rice kubbah is amazing, and you HAVE to try the hummus! Free tea and super fast service. I don't know why this place is always so dead, the food is amazing!!! Don't be afraid to poke your head in the kitchen if no one is around or just grab a menu and sit down.  After two visits I feel right at home here! The servers don't go out of their way to bother you during your meal so make sure to let them know if you need something. Personally I like to be left to enjoy my meal without a waiter trying to shove a check down my throat and rush me out the door. I always feel welcome at Sinbad's!Also they no longer use styrofoam plates! I saw previous reviews mentioning this but I think Sinbad's has stepped up their game since then. I thought the serving size was fair, I always leave fat and happy."], ["Andrew M.", "Cute place with kitschy paintings, grilled meats and Russia Today on TV. Had the mixed grill plate: the chicken was especially good, salad left something to be desired. Seems like the place to be on a Sunday night if you're an Iraqi man in want of like company. No booze, obviously. Order at the table, pay at the register."], ["Ibrahim A.", "I believe this resturant is the best  middle east restaurant in lincoln."], ["Tina L.", "Great food at great prices! They've upped the prices recently, but I think the food is still worth it. It does look a tad dive-y from the outside but don't let that bother you. I usually order the beef teka, shawarma, gyros, or beef kabob with rice, and usually have enough for leftovers. The garlic/yogurt sauce they give you is very tasty and although they only give you small portions of it, a little goes a long way. The free Iraqi tea is great. Next on the list to try is their lamb!"], ["Timothy S.", "My favorite place in Lincoln. Best garlic sauce ever! And the eggplant soup is killer."], ["Gabby A.", "Alright, Sinbads...you've won the five stars.  I love this place.  Within around a 6 month period you have recently become one of my favorite places here in Lincoln.I think what I love about this place is that they change things up, and the same dish will have different spices and blends to it every time I order it.  This may be off putting for some, but for me it's wonderful.  I love trying the meats and rice and being wowed with different tastes and sensations every single time.  The hummus is the best I've ever had, and the Iraqi bread served with it is excellent.  Go to Sinbad's....NOW."], ["Miss K.", "I would recommend giving this place a try if you like mild middle eastern food. The service was great, the food was good and fresh, the presentation was well , and the prices were right.  I ordered the chicken teka kabob plate which comes with soup, salad , rice and chicken breasts that are slowly charbroiled.  I also ordered pockets stuffed with meat and spices... and the garlic yogurt sauce is Soooo good for dipping.   This is not a fancy place, but well worth trying. They take visa as well."], ["Foe M.", "Decent middle eastern food."], ["Wyn R.", "This place is pretty divey, but the food is solid and tasty.  They make these middle eastern eggroll type things that are FAB!!!!  And I could eat their hummus by the gallon.  I like the chicken tekka quite a bit.  And I love the fattoush!  But, the soups aren't very tasty at all.  And if you've got a Middle Eastern food jones in the summer, be sure to call in a take out order.  I'm not sure they run the AC, and it's hot as hell in there.  But during winter, it's just fine.  The staff always gives good service, and lavishes attention on my baby girl."], ["Braden J.", "I love this place. Every dish I have had has been delicious. I love the combo platters. You get a bunch of different types of their meat dishes, flafel, a heaping plate of wonderful rice, fresh salad, and a choice of one of many great soups. The service is top notch and super friendly. This place blows all other mediterranean places out of the water in Lincoln. Cheap and delicious!"], ["Joel G.", "Invited to sit down, given menus, and water.  The food arrived promptly but the portions didn't look like the photos.  I didn't like the styrofoam plate it came on. Don't think I'll be going back.  Prices didn't really justify the amount on the plates"], ["Cameron M.", "Awful! The chicken is dry, soup taste like shit, they even messed the rice up. How do u mess up rice? On top of that it smelled like i was inside a huge asshole."], ["Sarah A.", "I've visited many restaurants all over that US that offer Mediterranean/Middle Eastern food but I always end up coming back to Sinbad's.  I have been going there for years and it has yet to disappoint.  A sure bet every time, especially for a first timer, is the Small Combo which includes generous portions of chicken and beef teka, a perfectly seasoned beef kabob, and kubba.  And of course they include plenty of bread and rice.  I also always get their bean soup which pairs perfectly with the chicken teka, bread and rice.  Be sure to finish with the hot Iraqi tea (add lots of sugar).  I love this place!"], ["J C.", "Camerons makin stuff of.  They have decent food.  I occasionally get for take out.  Atmosphere is kinda  of iffy but food is decent.  Its not gourmet but have yet to find gourmet mediterranean/middle eastern food anywhere in the world.    Its a good joint, give it a try for take out, for sure."]]}