{"Bhupi G's Hurry Curry": [["Hina G.", "I absolutely love this place. They deliver to the dorms for a small fee, which is perfect when I am missing food from my native land. I always get the same thing:Samosa (their green chutney is awesome)Soup (throw some green chutney in there too- party in your mouth!)Chicken tikka korma- this dish really isn't all that impressive but for some reason, I keep ordering it. The chicken pieces are dry and the sauce is too salty, yet I still get it all the time?.  IDK what's going on there.Naan- some GOOD ASS naan here. Chewy and buttery.I usually get this delivered but I have eaten at the location once too. Very Indian Bo-ho vibe with prayer flags and hipsters working behind the counter. Go there when you want a super laid back vibe."], ["Fazle H.", "My first visit her was very upsetting, i ordered the lamb biryani  and I was handed 16oz cup of food,  it looked like 8oz. So I tried to find everything wrong with it so that I can be justified in giving a bad review,  which at the time i thought they deserved. But the biryani actually had a lot of meat in it,  in fact it didn't even have any bones in it.  The price is a little steep for the quantity, but they are the best indian food I had in Nebraska.  And get this,  the place a run and owned by hippies. Yep no Indians here,  so I guess I would recommend this place. But only 4 stars because of the price,  since the food is a little over priced to me. The food also lacks some spices leaving a bland after taste."], ["Brian I.", "This was such a fun stop in Lincoln. Great food, a lot of personality, and a fun vibe."], ["M R.", "Was surprised too see the name of the place and ownership has changed. The owner was very friendly, and came up to assist us. We ordered Biriyani, the food was not at all Indian, the only reason we visited this place was the Indian cuisine. Please watch some cooking videos , there are hundreds on YouTube. The taste was Burmese or Bhutanese, we never use cashews in Biriyani."], ["kaitlin p.", "My friend and I were hungry, and we wanted Indian food, cheap(er) Indian food. In Lincoln I always thought that was hard to come by. While the Oven is delicious, it's expensive and a bit more formal than we wanted. So I searched Indian and found this place, and I'm so glad I did. The people were nice, the place was casual and decorated colorfully. But the highlight was the amazing garlic naan. Wow. My Chana dal was awesome too, a bit spicy, but overall delicious and full of flavor. The rice was a tiny tad undercooked, definitely not a big issue because it paired so nicely with the dal. Alls that to say, I'm glad this place is here, Lincoln needs it."], ["Lucas H.", "Friendly staff and prices are great. The problem is the food sucks. I love garlic, but the garlic naan was dry and so overly garlic, I couldn't finish it. The chicken tikka madras was chewy and not in a good way. Overall, not good. Lincoln's Indian food options suck."], ["L R.", "i came here specifically for the Saag Paneer because I was told it was the same menu as Sher-E-Punjab. This is NOT the case. This sounds silly, but it tasted too much like greens. It's like there weren't enough spices in it...or maybe it wasn't cooked long enough.  I couldn't finish my dish. The mulligatawny was good and I had some of my friend's chicken tikka makhani, which was very flavorful. I had a good experience overall. The staff was friendly and the new decor is great. They were playing Beyoncé songs the whole time...not sure if that is a plus or a minus."], ["Krisha B.", "This is pretty much an Indian fast food place. The atmosphere is really cute. They were playing Wutang Clan pretty loud which I probably would have loved 10 years ago. I suppose it's a nice throwback but my mom wasn't into it. The food wasn't bad. It's not made to order so the rice and naan were a bit dry, both he lamb and chicken vindaloo were good, the chicken tika masala was good but a bit runny."], ["Deryl H.", "Awesome little Indian place with delivery to campus. In my office had the chicken vindaloo which actually had some heat to it, surprising amount of spice for what is common in Lincoln. Visited in person more recently and loved the quick service. Lots of combinations of sauces, meats, and veggies, and sides. The flavors are fresh snd leaves you wanting to come back for more. I give it five stars not for being the 'best' Indian food around, but for being awesome at what they do and how they do it."], ["Weston J.", "The food was tasty and delivered promptly. I am likely biased from my fandom of Sher-e-punjab, which is what this place used to be. The quality of food has declined (only slightly) but the prices remained the same. And probably most importantly, there is no longer a limitless buffet of Indian food as there used to be on Sunday's. While it wasn't Sher-e-punjab, it was still decent."], ["Jenn N.", "I.  Love. This. Place.   If I could write poetry, I would write a poem place. This is by far, the best, ever, Indian food I have ever had in my life. This puts in any other restaurant, to shame! I find their smart ass attitude and advertising is refreshing it's not stuffy or boring.I love the inside of this place, they've done a great job remodeling. The free Wi-Fi is really great, greater. I am going to this place three times this week, because I'm too lazy to cook. If you want food, really nice atmosphere, more modernexperience at decent prices, then this is the place to go. I recommend this restaurant to everybody I know."], ["Laurie A.", "We ate at Bhupi G's last night and it was fabulous!  From the decor to the aroma.. it is a very inviting atmosphere.  Jason was friendly, service was great, food was promptly delivered and after we ate we chatted with Jason about the business.  We had an amazing time and will make it a regular stop."], ["Ann A.", "We loved Sher-E-Punjab and we also love Bhupi G's. The food is fantastic.  When we were there they got slammed with a lunch rush and seemed very overwhelmed. Because there are so few tables people are either coming in and staking out tables before the rest of their party gets there, or they're scanning the room in a panic to see if a table will open up for them.  The music was also too loud.  The tables couldn't get bussed fast enough. Lincoln is a growing city and people clearly love Indian food!!! I wish this place could get into a larger location but then that becomes a much larger operation.  Bhupi G's has the best Indian food in town, just as Sher-E-Punjab did."], ["Michelle M.", "After reading the article in the Daily Nebraskan student newspaper, we were excited to try out this \"new\" Indian restaurant. We were not disappointed! The wait for our food was a little longer than expected, but we were patient. We loved the cool wall hangings. The staff was very nice. They kept some of the old tables and chairs and added a wall in order to funnel customers to the cash register. The Tandoori chicken was just as savory as we remembered. The rice and Mulligatawny soup was tasty and really hit the spot on a cold night. As word spreads, I am sure this place will be a popular one for Indian take-out. If you loved Sher-E-Punjab, you will love this place! Same food. New owner. Same friendly service. We will definitely be back!"], ["Jordan N.", "I must say. I was impressed! This isn't your run of the mill indian joint; it's more thought out and laid back than that. Some reviews made comparisons to Sher-E-Punjab, but I'm not sure why. I didn't see any direct correlation beyond the physical location (lovin Bhupi G's funky decor!) I really enjoyed the mulligatawny and it's balance between savory and spicy (it has some kick!) I would recommend the spinach naan with some of their really hot chutney (the green stuff without the yogurt). I haven't tried enough of the curries yet to identify my favorite, so ask for recommendations there (although the lamb madras tends to be my go-to!)"]], "Taj Mahal Cuisine of India": [["Virali M.", "As soon as we entered the restaurant, we were surprised by the elegance yet simplicity of the hotel. It's has beautiful decor and it's just comforting. Right opposite our table (we were facing the kitchen) is the kitchen from where the chef cooks. Everything is freshly made, nothing is frozen. You can see him cooking! It was pleasant to know where your food is coming from, and how it's being prepared. Once we were seated, a white woman served us (who we later learned, is the wife of the chef, who is Indian), she gave us water. For drinks we ordered a mango lassi (then another one later). The mango lassi was fantastic! It had a distinct mango flavor without it being too overpowering and sweet. It wasn't sour (like most places) nor was it too sweet. It was cold and was the perfect balance. It was also served in a cute wine-esque glass! Kudos!For appetizers, we ordered papadum, which was seasoned with crushed cumin and salt, and the papad itself was made with cumin. It was roasted to perfection and it was served with this sort of spicy, cilantro infused, tangy yogurt chutney! It was mind blowing! The combination with the cumin seasoned, mild papad with the tangy kick of the chutney was fantastic!We wanted to order bhindi masala (okra in curry), but I didn't want the curry. I just wanted sautéed, crispy, okra cooked with turmeric, red chilly powder, and salt. We asked the waitress to request the chef to speak to us. Immediately, he came over and welcomed us with a warm smile and made a quick joke about how it would cost us extra to talk to him, which I found extremely nice of him.I spoke in my native language, which he understood, thankfully (otherwise it would've been hard to explain my requirements). We gave him the specifications and he agreed to make it the way I wanted.Next, I told him that I wanted to try the paneer tikka korma masala, I've never had it before, so we went to the kitchen and got me a spoonful of the curry and asked me to taste it. I told him that I wanted it spicier and he agreed to make it that way. Personally, I have never seen any chef do that! I was extremely happy!We ordered a yellow lentil (dal) and garlic and regular naan, our order also came with cumin, turmeric, salted rice.Like I mentioned before, everything is made right in front of you. There aren't any doors to the kitchen and you can see what he's making.Let's talk about food.The naans smelled scrumptious! I could eat them right there and then, WITHOUT anything, that's how good they smelled. They tasted even better though. They were soft, fluffy, crispy on the top, and topped with delicious butter.The garlic naan rocked! What's different about this naan is that the garlic is stuffed INSIDE the naan and not outside. Usually, it's outside and eventually the garlic falls off and you're stuck with a regular naan, but you're paying more. I got a bit of garlic in every bite, it was wonderful!Now for the vegetables, the paneer tikka korma masala was FABULOUS! It was tangy, spicy, sweet, acidic, yet mellow. The paneer (cubed cottage cheese) tasted extremely fresh, it was soft, and had a wonderful milky flavor, the way it's supposed to taste. Usually, different restaurants use week old paneer in their dishes and it tastes really bland.The bhindi (okra) was made the exact way I like it. It was crispy, spicy, salted perfectly, and just plain delicious, there weren't any words for it. I can't give you a better definition.The dal wasn't that great, to be honest. I could have done without it, but it was nice to try, especially if you're looking for protein overload and are a vegetarian.The rice that comes with the food wasn't so great either, I'd just order basmati rice with the food, it tastes so much better. We didn't order it because we were full.After dinner, the chef and his wife came by our table and we had a brief chat for at least 15 minutes which was refreshing and extremely nice of them. They both are wonderful people.Last but not least, I had the mango cheesecake. How can I describe this to you? The graham cracker crust had cinnamon, cardamom, and a distinct butter flavor. It was followed by the most delicious, velvety, and soft cheesecake ever. On top was their famous mango puree or sauce, it wasn't sweet nor sour, just right. It was topped with a maraschino cherry.Go to this place if you're ever in the Lincoln area! Amazing food, amazing hospitality, amazing people, and most importantly, amazing atmosphere!"], ["Fazle H.", "I thought the first time I ate here was just fluke,  but the food really is terrible,  no flavor at all,  very bland.  I gave him a second chance but it was a complete let down.  The chicken was just dry and flavorless,  the rice lacked spices,  and the food didn't have any spices or salt.  I felt bad for the for the guy at first but he is just bad a cook. Can't believe I gave him a second chance and my money."], ["Cathy B.", "Mediocre. Papadum was burnt at edges and stale tasting. Veggie samosas were undercooked and tasteless. Served with what they called chutney. We got lamb vindaloo (ok), chicken Tikka masala (rubber) and sag paneer (ok). Tandoori mixed grill featured weird and not edible \"kebab.\""], ["Darko R.", "Not only was the food excellent, the owner was very welcoming, very knowledgeable on his food and its history. Recommendations were spot on. Willing to prepare anything we wanted even if it was not on the menu. I'm still craving the goa tuna that I asked him make vindaloo spicy, insanely good."], ["Ashlie K.", "Yummy yum yum yum. I love the Taj Mahal. It is quiet and the owner and his family are really nice. My first taste of Indian food was at The Oven and I disliked it so much that I didn't want to try this place out but it has changed my mind.I usually get the eggplant masala with paneer. The owner makes his own paneer, it is soooo tasty. My boyfriend usually tries something new everytime we go so I get to sample. There has not been one thing bad I have tried. We also get the garlic naan which is also super tasty. Everything is made right there, nothing is frozen, you can tell. I do usually get the salad instead of the lentil soup, I like the mustardy dressing. The lentil soup is tasty, though.This restaurant is also great for vegetarians and vegans, there is a large menu just for that with great options. The mango adult beverages are also super tasty."], ["jane s.", "My husband and I have been frequenting the other \"popular\" Indian place in town and were looking for a change. So glad we tried this place! It was by far the best Indian food we have had in Lincoln! So flavorful, deliciously homemade, and tons of veggie options for us vegetarians! The soup and the naan were both amazing. My husband had the special eggplant dish and I had my standard Dal dish that I always order at Indian places. Both were phenomenal. The owner chatted with us and was so nice. Also, the next day the food sat well with us and we didn't have digestive issues like we do with some spicy places we have tried. We have found our favorite Lincoln Indian place and we will be back."], ["Ram M.", "Horrible food. Have you ever had veg biryani with eggplant, if not checkout this restaurant. I saw one or two pieces of brocolli in it. Chef came and ask whether we want cashew and rasin on it, without that I can say its rice and eggplant curry mixed.Service: we asked to split the check three ways and server said they need add extra for  it(never heard that before). The extra was 20%, when we asked for explanation, she left it at table and walked away, don't have the courtesy to explain. Rudest restaurant in Lincoln ...."], ["Rachet W.", "I ate here a while ago and wasn't super impressed with the vegetarian thali, but decided to give it a second try with some friends to check out the vegan menu.  After reading the reviews on here, I was expecting good things.  The only parts of the meal I enjoyed were the bread we ordered, and the soup I got with my entree (for which I had to pay extra.)  The included salad IS very small, with only iceberg lettuce and one carrot.  The sauces were unimpressive.  My friend's chicken was dry and flavorless.  The vegan skallops I and another friend got were not worth the $11.  To top it all off, the management seemed put out about splitting the check onto two credit cards.  The owner came over to lecture us about how we should have asked for separate checks from the start."], ["Nicole M.", "My fiancee and I ate here for the first time last night, and it was delicious! The restaurant closes at 10pm, and we got there around 9:15pm. Harish (the owner) was the only wait staff present, and we were seated promptly. He asked if we wanted to see the vegan menu (which is quite extensive), and he never rushed us. The food was very good, and Harish was extremely cordial - it was like he was hosting us at his house and not his restaurant. Toward the end of our meal, we invited him to sit with us and we talked about his worldly travels, and he even gave us tips for traveling on a budget! I prefer Taj Mahal over The Oven!"], ["Levi A.", "This has been a favorite of mine for over 15 years. Good food, nice, quiet, and relaxed. The owner (Harish, who immigrated from India) makes it a point to speak with his guests whenever possible. Family owned, Taj Mahal is authentic Indian including a large selection of vegetarian and vegan dishes. I love the Lamb Biryani!"], ["Cindy E.", "My husband and I visited here for the first time tonight. We recently stopped eating animal products, so our options for eating out have changed quite a bit.  I heard about Taj Mahal's vegan menu, and tonight we finally checked it out.  If you are vegan (or want the vegan menu), ask for it when you enter, so you will be given it when you are seated.The vegan menu is two pages, and their breads and appetizers are vegan, too (this is on the regular menu). They have one vegan dessert (which we didn't try this time), too!  The food was very good and service was friendly and quick. The atmosphere is nice (we were there for dinner and it was darkly lit and kind of romantic).   I would definitely recommend this for vegetarians and vegans, because you won't find such a lengthy menu at any other restaurant in Lincoln, but anyone who likes Indian will enjoy this (there is a regular menu full of meat dishes).  Enjoy!"], ["Susan S.", "The food here was good, but the service was not.  The night my husband and I went, there was only one person there...and it was the owner/cook/waiter.  Very strange.  He literally started loading his vehicle to leave as we were eating our meal.   The atmosphere is nice enough, but we felt almost guilty for \"being an inconvenience\" to him.  I have owned a cafe and know that repeat business and word of mouth is HUGE.  I would bend over backwards to please my patrons.  Sorry to say, we considered going back here with friends because the food was good, but chose another place because of our crumby experience."], ["Shaun S.", "Horrible experience. Frozen appetizers, no chutneys.  A grilled chapatti is not roti. Slow service, expensive.  They did not deduct the unedible food from the bill when I complained.  If you want Indian food go to the Oven."], ["Lelay P.", "The place? Don't bother. I did not even see a single Indian face in there. Food? I wouldn't take it if they gave it to me for free. It's a lot cheaper than The Oven, but you're sacrificing quality. My boyfriend had the diarrhea for 25 minutes in the bathroom the next day. The food gave us a headache from the MSG in their food and it set in while we were still there. The salad was a joke. Sick joke, not at all funny, it was served on a tiny plate fit for a small rabbit and it had several slices of the cheapest lettuce you can find with a single baby carrot."], ["Patrick C.", "I thought this restaurant was great.  The owner (who was clearly Indian) was the only staff there and waited on us.  Very cordial and friendly, good service, and GREAT food!  I have absolutely no complaints about this place and would recommend it in a second to anyone looking for good Indian food."]], "The Oven": [["Jill D.", "The Oven is one of our favorite restaurants in Lincoln. We always have had an excellent experience. Our only downfall is that we love one dish so much (safed maas) that we rarely branch out and try other things.  Seriously...the lamb is so tender and the sauce divine.  We also love the Mullagatawny soup. Pretty sure I would happily eat that every day! I wish it weren't quite so expensive. It is worth it...but we just don't come as often as we would like."], ["Jill S.", "I have never had a bad experience here! The food is always fantastic and the service is great. I prefer this one over the one in the Haymarket because it's less crowded and parking is a breeze. Prices are very reasonable. 2 entrees and 2 types of Naan can easily be done for $35 which makes it a treat we can have more often. I loved trying the sampler which had lots of different types of veggie curries. Great place and great for date night. Highly recommend the chicken tikka korma, soup and spinach Naan."], ["Jessica H.", "When it comes to picking out dinner, there is one thing my husband and I can agree on...indian food! Mmm, naan naan naan.  I've heard The Oven (the downtown location) is expensive and the service rude and since we already liked two other indian restaurants, I never made it a point to go here.But, they now have this location and it's much closer than any of the other places so we thought we'd give it a shot.  We went late (8 p.m.) on a Friday. There were very few people there, which my husband really prefers.  The decor was classy, we were seated quickly, and from the maitre de to the waiter, the service was fantastic!  My husband ordered the tandoori chicken, his usual.  And I had a mixed tandoori entree.  We both had the soup, which is spicier than I expected but equally delicious, and of course, naan with mint chutney.  It came out scorching hot and melted in our mouths.  I love this stuff! It lacked seasoning, and I've had some that is, at the very least, salted, but it was still delicious. Our meals came quickly and the food was great. We will get the tandoori chicken again.  I think it was a little bit dry and well (almost too much so) seasoned, but it was very satisfactory and we will be back. Prices were also comparable to other locations around town."], ["Marie B.", "Would love to be able to comment on the food, but we drove all the way here to find the restaurant closed an hour before the posted closing time on a Sunday. No explanation, no sign--just closed. Very disappointing. Won't be returning."], ["Jennifer B.", "The food was excellent. Loved the naan and the mint chutney. Unfortunately, the service was very slow. Go for the food and if you don't mind spending a looooooong time waiting for a server."], ["Purple Lotus M.", "This restaurant is really good! I am gluten-free and vegan and try to make sure that before I say a restaurant is good, I have found several dishes that I can eat and that they are indeed without compromise. And truly, this food is delicious. The mulligatawny soup, aloo gobi, bengan bearta, aloo chole, and bombay dal are my favorites. Try them!"], ["Tony C.", "Wait, there is a silver lining. Yikes!  What the heck happened to the Oven? It used to be the standard for Indian cuisine. The chicken tikka masala was awful. The chicken was tough and had a weird, rancid flavor. The sauce was watery, the consistency of soup. The lamb madras was tough and barely braised and also had a funky taste. And the soup tasted old and as if it was never salted and had a unpleasant gray-yellow color. This comes as a shock since the food has until now had consistent quality. This was takeout. I called and they properly offered me a refund. So, there was a silver lining.  I will be reluctant to order takeout soon. I will treat this as anomaly since I have dined at both locations for 20 years.  However, no restaurant is entitled to a positive review for past meals and service and patrons should expect at least consistency and at best improvement."], ["Sowmya U.", "I wouldn't give even a single star for this restaurant as food was really terrible. Garlic powder on naan is just the worst thing I ever tasted in my life. Canned tomato puree on all curries and terribly tasting soggy appetisers. Nothing seems to be freshly made in this restaurant . I wouldn't suggest this place for authentic Indian food."], ["Ashley K.", "I docked a star because my server had trouble understanding what we were ordering, however, the food was delish! We ordered a few different appetizers and the lentil soup was great. Plenty left to bring home for lunch the next day!!!"], ["Sarah P.", "Eat the Tandoori chicken! It's delicious! I love everything about this place!"], ["Deryl H.", "Excellent food and quick service. We had exactly one hour for a date while our son slept his early evening nap in this infant carrier. Just finished when he woke up. I recommend the LAMB TIKKA MADRAS."], ["Dennis N.", "The Oven in south Lincoln continues the tradition of great Indian food found in their Omaha and Haymarket locations.  The resturant is smaller but very open and more up-scale than the Haymarket in my opinion and I love their out-door seating when the weather is nice in Nebraska.I love their breads and Mullitgauny soup (sorry about my spelling) and their Nan and Papado breads are excellent...but sometimes the Papado isn't as fresh as others.  The soup is spicy.  My first choice of a dish is the Chicken Tika Korma (it is a little spicy) and the second is the Chicken Mogali --- Please given them a try.  The food is consistent.  Service can vary.Also, they take the Passport card that allows you to get a free entre."], ["Melissa R.", "My husband and I decided to give The Oven a try last night after a Husker game.  We didn't get there until late (they are open until 10:30 pm) and were greeted and sat at our table promptly.  The ambience is beautiful and classy and the restaurant was very quiet even though there were two other parties of couples having drinks and talking.  Several of the employees were sitting at the bar having a glass of wine and our waitress seemed like she would rather be sitting with them than waiting on us.  We attempted to order the mixed appetizer but were told the fryer was already turned off.  We were very disappointed as it had been a long day and we were extremely hungry.  My husband ordered the lamb tikka madras and I the Chicken jalfrazie.  We ordered some garlic naan to go along with our soup that came with dinner.  I'm not sure what the soup way, seemed to be some sort of creamed type soup but it was served with a dollup of rice in the middle and a lemon garnish.  Adding the lemon juice made it phenominal and the garlic naan was the perfect amount of crispness and the mint chutney was absolutely amazing. Our dinner arrived quickly and was served with plenty of rice.  My husbands dish only had five or six pieces of lamb but was very flavorful.  My dish had large pieces of green and red peppers, tomatoes, and onions and several pieces of chicken.  Both were very mild on spice level as we are used to being able to pick our level of heat with the indian restaurants we frequent.  My dish was large in portions, but I had to share with my husband because his wasn't enough to satisfy his hunger.The food was great, we will definitely give it another try to see if we have a  waitress that seems less pre-occupied and hopefully be able to try the appetizers as well."], ["J C.", "Still one of my favorite places to go with my wife in Lincoln, either location."], ["M N.", "Americanized Indian Flavor - therefore the food was bland. Where did the spice in the Indian Food go?  I use to love The Oven, now it has moved down on my list of places to eat in Lincoln.   Ordered the following:+ Rose Lassi - to me, it tasted like \"rose water\" instead of \"rose lassi\"+ chicken tikka korma and it was suppose to be spicy.  It was more of a tomato paste then what korma is suppose to taste like. +  chicken bhutan - and it too lacked the authentic taste; too much coconut milk+ Roti and Naan - Roti was good and Onion Naan good+ fried shrimp appetizer, was overcooked and burntI have lived in India and eaten Indian food in bigger cities - so I am familiar with the Indian Flavor.The service was good - nothing spectacular - the atmosphere was busy - the wait was 30-45 mins however, not worth it for me.  So if you are looking for Americanized Indian - this is the place for you.  Something more authentic, look elsewhere.  Plenty of parking and no devices if you have to wait.  There is a waiting area that would seat 7 total as well as a full bar."], ["Gigi F.", "I was greeted and seated promptly.  I waited a long time for a server.  From where I was seated I could see a server using their cell phone.  The soup was hot and well seasoned.  The papadum and nan and samosas were some of the best I've ever eaten.  The chicken tikka masala tasted like tandori chicken in tomato sauce. My server came back 20 minutes after serving the food to see if I liked it.  A little late!  I'd try it again!"], ["Ryan C.", "When it comes to Indian food, the Oven nails it! One of my favorite restaurants in Lincoln! Excellent food, service, and atmosphere! The chicken tikki korma & the chicken tikki kadai are amazing! They also have several different types of naan to choose from, and their curry soup is awesome!"], ["Felix K.", "This is, hands down, my favorite restaurant in Lincoln, NE.  There are 2 locations, I prefer the atmosphere and neighborhood location of the Haymarket one better than the one on Pioneers Blvd.  Everything I have tried has been spot-on amazing.  My personal favorite is the Lamb Korma.  I am not even a lamb fan, but it is just so good.  The jasmine rice is good enough to eat on its own.  The Naan and other breads are good.  The Mulligatawny Soup is the best Mulligatawny I have ever had.  SO good.  I have tried Indian food all over - Arizona, Washington, Utah, Oklahoma, even Eastern Europe - but this is by far my favorite Indian place."]], "Tandoor Indian Cuisine": [["Marcella W.", "My favorite restaurant in Lincoln! Super tasty. The service can be slow, as it seems they never have more waitstaff than they absolutely need, but the food is consistently delicious and the prices are fair. I highly recommend the Shahi Paneer, and my mom swears by the Chicken Goa and biryani dishes. It seems biryanis give you the largest amount for the price."], ["Rumil B.", "A little pricy but super delicious.We got three different dishes, all of them left us saying \"yum!\" instead of \"well that was alright I guess,\" which is what usually happens at the Oven. I loved mine in particular, the thimpu chicken, and the garlic naan as a starter is a must. Took a little while for our food to get to us, and I'm never in this part of town, but I'd say it's definitely worth the wait and the drive and the price."], ["ISellGolfStuff A.", "Respectable Indian cuisine.I've had better, but I've also had much MUCH worse. I got the Lamb Korma (my go-to Indian food standard) and it was very good. I've come back a few times and have never been disappointed. The portions are large; two people can split one entrée with an extra plate of rice. Prices are great if you're splitting, but a little high for a single person. $14 for  Lamb Korma isn't the most I've ever paid *ahem* The Oven*ahem* but I would have felt better about $12.The naan here is great too. I typically get the Kashmiri naan (here called house naan) and they don't skimp on cashews or raisins here.Overall, in my top 3 Indian Restaurants in Lincoln, and for sure the best one in South Pointe. Give it a try!"], ["Jeffrey D.", "I needed to get out of the house so why not go for dinner?  Tandoor is close to the supermarket so why not?  I have never had food prepared in a tandoori oven (charcoal) that I know of so another why not?  It was not very busy so we managed to get our meal quickly.  We tried the garlic and raisin bread.  Both were delicious.  Then a curry soup to get started.  I had the mixed grill and my wife the red curry and she actually got it nearly as hot as she liked it.  The service was good and the food was good too.  The prices were decent.  Overall, a decent meal at a decent price."], ["Bryan E.", "Love Indian food and this is the first time I've been to Tandoor. The atmosphere isn't as good as The Oven but the food is better. Huge portions. Ordered the Goa Lamb and have enough for lunch tomorrow too."], ["Solomon H.", "Food is always prepare after you ordered.  Bread with the green is awesome, might be a little spicy for some.  I love it!  I have Bhutanese chicken & asked for spicy sauce."], ["Jason M.", "Hands down the best Indian food I have had! The portion sizes are awesome; well worth what you pay for!  The wait staff is knowledgeable and very friendly. After recently moving to Lincoln, this is an establishment we have visited multiple times and look forward to coming back many more! Oh! Try the House Naan! You won't be dissapointed!"], ["Kitchen Imp Z.", "This is a great find. We were in the Oven rut for a long time -- three years, in fact, since moving here -- and we're thrilled to find this place! The Mr and I have lived in a number of major international cities before coming to Lincoln, so we have a pretty broad spectrum for comparison. The malai kofta is a thing of beauty, chicken tikka korma is really good, and the various types of naan are all outstanding here - freshly made. Careful on the spicy scale - they mean business - so if in doubt and not a huge spicy fan, ask for a 2.Just a note for those who are unfamiliar with India and its cuisine...To the person who wrote:  \"The Indian food is about as authentic as the Asian staff. Friendly service, but slow and strangely uninformed. I asked if they had tamarind chutney to which he replied \"I don't know.\" I'm pretty sure the mint chutney was some kind of ranch dressing.\"I suggest taking a look at a map. The \"Asian\" staff you are dismissing as inauthentic is Bhutanese. Did you know that India is right next to China? Bhutan -- the kind of food this place specializes in -- is a country, and it's right between indian and China, like Nepal and Tibet. That's why the people looked \"Asian\" (by which I assume you meant \"Chinese,\" since Indians are also Asian - South Asian) to you. They are. The \"mint chutney\" wasn't mint chutney or \"some kind of ranch dressing.\" It's Bhutanese raita, a yogurt-based sauce eaten with spicy food. Don't be misled by the uninformed - this place is excellent."], ["Echo D.", "They have many different naan. They were all good. Food spicy level satisfied  me finally. I love freaking spicy food. Nice service and good price."], ["Andrea F.", "Tandoor is the best Indian food I have had in Lincoln. When we go, we always get the Aloo Chat for an appetizer. It's absolutely delicious and has a unique flavor. We also get the Tendi Naan which is basically to die for, some of the best bread ever. We get a variety of different entrees for the main course which we will often times just split because the portions are HUGE! I think my favorite is the Goa chicken, but it's hard to choose. We never leave disappointed nor hungry. Their food is very reasonably priced and the service is always great and friendly. When we order for carry out it is always ready on time. The restaurant is very small but super cozy and inviting. I highly recommend and we will keep coming back!"], ["Susan N.", "For consistently good Indian food and consistently good service, this is a safe bet for visiting family and friends. And for those of us who live here, it's a great neighborhood treasure."], ["David N.", "I ate there tonight.  Awesome, love it!  The Chutney is fantastic.  It's spicy, but I love it.  The naan is served hot, I recommend the garlic naan.  I had the seek kabob, for the first time, kind of like sausage cooked on a stick in the oven.  It's good.  I also recommend you get a side of tikka korma sauce, if you like spicy food that is, to dip your meat, or naan into, if the chutney is not enough.  The soup is very good too."], ["Jessica H.", "I've ordered out from here a couple of times and been impressed.  Since relocating to Lincoln I've always gone to Sher-Pun-Jab (and will continue to) but if you're looking for an Indian option on the south side of town, this is a good one.  It's in what I think looks like a specialty/expensive shopping area so I assumed it would be too. But I was wrong! Prices are comparable to other Indian cuisine in town.The first time we ordered,  I went out of my comfort zone and ordered Thimphu Chicken (boneless chicken curried with onions, tomatoes, mushrooms, cauliflower and potatoes in a light creamy sauce).  It was delicious! Light on the spices.  My husband got the Tandoori Chicken (half).  Between us, we had enough rice and leftovers for another meal or two.  Meals come with rice and mulligatawny stew. Because of the portions, the second time we just ordered the Tandoori chicken meal (full) and split it.  We did NOT order the dinner for two option, just the regular dinner. And we STILL had leftovers. AND in comparison to Sher-Pun-Jab, the tandoori chicken here blows it out of the water.  It's very good, very moist. And the mulligatawny is comparably good.  We'll keep coming here, maybe we'll eat in next time."], ["Heather A.", "Best Indian food in Lincoln! I recommend the Nan with cashews and raisins. Their soup is amazing. I haven't disliked a single dish yet. Everyone claims that the Oven is the best. The Oven has the ambience but very high prices and okay food. This little place doesn't have much Decor but the food is amazing and the prices are good. I don't go for the ambience I go for the food."], ["Myra G.", "The best Indian food in lincoln. Price is reasonable. The food is always on point. Beats THE OVEN in quality, portions, and price. The only bit of criticism is that it seems like it's family own/ran so the service could be better. BUT nothing too extreme"], ["Marie B.", "The Indian food is about as authentic as the Asian staff. Friendly service, but slow and strangely uninformed. I asked if they had tamarind chutney to which he replied \"I don't know.\" I'm pretty sure the mint chutney was some kind of ranch dressing. The mulligatawny was a better choice than the mustard salad. MUSTARD y'all. The papadum seemed to be poured from the pan of oil they fried it in rather than lifted out. I spent the next hour resisting the overwhelming urge to pat it with my cloth napkin. The masoor dal was pretty good but the aloo gobi, my favorite dish, was a miss. And the naan... I could not diagnose the problem but I think it started with being undercooked and burned at the same time. To sum it up, it's probably better than fast food and will do in a pinch, but it ain't really gonna hit your Indian food spot."], ["Alex P.", "The food is very consistent and traditional. The prices are very reasonable for the portion sizes. The madras lamb is my favorite but I really can't complain about anything I've had from their menu and I've had almost everything they serve! Hands down the best Indian in Lincoln along with mother India in Omaha!!!"], ["Brandon F.", "I have never been disappointed when going to tandoor. In my opinion tandoor is better than the more expensive Oven. The food is always delicious; my favorite dishes are the steak kabob and chicken shahi korma (chicken in cashew and raisin sauce). The naan is always good and the mulligatawny soup is as well. If you like chai tea you can get a full pot of it for only 3 bucks. The atmosphere is not super fancy but its nice and the food comes out quickly. When I have the willpower not to eat it all I take half home since you get a pretty large serving."], ["Maddie L.", "Though it's lacking a bit in atmosphere, the food was WONDERFUL! We happily drive across town for the delicious Chicken Madras and Bhutanese Chicken. So good!"], ["Michael V.", "Stopped here driving through Lincoln. The location was in a very nice area. The food was very good. Service Excellent!The Lassi was different... it seemed more like a smoothie. There was something about the food that didn't seem authentic... but taste was good and the portions were generous. Overall I was pleased."], ["Samantha P.", "I absolutely love Indian food - it is my favorite food I'm the world. To a point where if I could only have one food for the rest of my life I would choose Chicken Tikka Korma, and \"The Tandoor\" is by far my favorite restaurant in Lincoln. The food never disappoints and the service is good. The prices are very reasonable, especially considering the quality of the food. If you are looking for an Indian restaurant in Lincoln this is the place to go!"], ["Weston J.", "Nom."], ["Harry H.", "Family of three dined for early Saturday dinner.  Environment was clean, quiet, bright, though one has to look a bit for the restaurant after exiting off Old Cheney Road.  Server was young, and perhaps beginning, but overall service was fine.My wife enjoys Indian food more than I do, and she was impressed with the options and food quality.  I had mixed grill kabobs and they were great.  I found the spiced food was just fine for me, though I understand if some view the cuisine as a bit Americanized.  We tried several appetizers, had three entrees, and multiple glasses of wine among us, and total bill was under $90.I enjoyed the meal experience, better than my past visits to the better-known Oven."], ["Brittany S.", "I have been to this place multiple times and have really tried to like it simply because many of my friends enjoy it. However, try as I might to like it, I really really can't find anything I like here. I hate spicy food and have told my servers that every time. Yet, I somehow have continued to end up with food that is WAY too spicy for my liking... so much so that I can't eat more than a few bites. The one thing I thought I really would like, the naan, has been burned every single time I've been here. On our last visit, my husband's food was presented in such a disgusting manner that he could not even eat it. The look and smell actually made him gag. They were very kind and offered to make him something different, but after the first encounter, he refused. I have given up trying to like this place... Kudos the people who love it, but it simply isn't for me."], ["Karma J.", "I love Indian cuisine. this is probably the best chicken tikka masala I have ever had because we don't live in NE and we go to every Indian restaurant we find. Solely because my husband loves chicken tikka masala. They call it chicken tikka korma in this restaurant. My husband loves it. For some reason, he can eat the spicy chicken tikka korma but not my spiky cooking at home. Oh, you should def. try the stuffed nuns. Our favorite is Tendi nun, it's their own recipe. Might want to ask less spicy if you can't handle any spices at all! Coz it has a tiny amount of spice in it. Ohhhh it's so good!!!! And their Thimphu chicken, their own again! But again, ask for less spice."], ["Sarah K.", "Tandoor has pretty good Indian food overall, but the lamb shahi korma is absolutely delicious and I still haven't found a better dish anywhere else.  In regards to beverages, they provide a generous portion of wine by the glass.  The service is hit or miss though, which is the only thing keeping it from getting five stars."], ["Greg S.", "We went on a snowy wintery day and the place was nearly empty. It seems like their to-go service was busier than the inside. First I'd like to say the NAAN is great. We got the jalapeno cheese and the standard garlic naan. We used the jalapeno cheese as a starter. The yogurt base dipping sauce was spot on. I ordered the lamb curry and it was very good. My wife ordered a chicken tikki korma and it was moist and well cooked. I liked her meal more than mine, but my curry was better than the oven for sure. Overall it dethroned the oven as the 'best' Indian food in Lincoln easily. The reason why it didn't get 5 stars is because the rose water dumplings. That was the most disgusting dessert I've ever hand. EVER. It was like eating a flower."], ["Elisa V.", "We got here for lunch 8 minutes before they closed and they were really nice the whole visit. The mulligatawny (?) soup was very tasty as was the basmati rice. I had a rose lassi and it was good, but did not have as strong of a rose flavor as i am used to or prefer. The rose flavor was actually not detectable by me. The chicken tikke korma was pretty good, but my kids and i did not like the chicken masala. The tandoori chicken was really enjoyed by my husband. We would eat here again."], ["Adrian B.", "I have been going to this restaurant since it opened in 1999.  The place may not have quite the classy atmosphere of The Oven but looks great after a recent remodel.  The quality of the food is very comparable to that of the other Lincoln staple.  The prices are slightly less and the portion sizes are outstanding.  My wife is always able to take home enough for lunch the next day.  The takeout service is very busy anytime we visit and the lunch menu is very reasonably priced.    Now to the food, the naan bread is the best in Lincoln.  They have authentic tandoori ovens where you can see the chef toast the bread until it comes out steaming and crunchy on the outside but soft and buttery on the inner.  The mulligatawny soup is slightly more watery than most restaurants but this is made up by the fragrant basmati rice.  The main courses are impressive, I tend to order lamb dishes as it's hard to find quality lamb here in Lincoln.  I like a good sloppy lamb curry so opt for a light Lamb Korma curry made with coconut or a spicy tomato influenced Rogan Josh.  My wife prefers chicken so often gets the most popular and internationally recognized India dish, Chicken Tikka Korma.  The Tikka Korma is always sweet and tender with a light but tangy red sauce.  I always explain to people it's basically a good starter dish for the novice much like sweet and sour chicken for Chinese food.  If you do not like actually curry's they have fantastic grilled Chicken Tandoori which is prepared on metal skewers and grilled in their oven.  If you want a good Indian beer to cool the palate try a King Fisher in a large bottle.  They also have a good wine selection.  If your looking for a nice cooling drink that's non alcoholic try one of India's best secrets a Lassi.  Similar to a smoothie made with ice, milk and fruit.  They come in mango (my personal favorite) or strawberry.  These drinks have been proven to cool the mouth and stomach after a good onslaught."], ["Susan S.", "We have been here several times and have enjoyed the food.  The service is VERY slow, so don't plan to take in a movie as well.  We had communication issues with our server and weren't able to ask questions and get a clear answer.   The naan is the best in town and the atmosphere is good.  My friends had never had Indian food and were able to get a nice combo meal that included several small portions that they could share for just over $20.  The soup/salad are good, but not great.  Portion sizes are more than sufficient.   Worth a stop, but consider ordering take out so you don't have to deal with the slow service or tipping a waitress who can't communicate with you or answer basic questions."], ["Renee W.", "Let's start with I LOVE INDIAN CUISINE!!!  My favorite place in OC was a little family owned/run hole in the wall in Huntington Beach.  So upon moving to Lincoln, I searched for the same here. Tandoor was very close.  The atmosphere was great and the servers very attentive, however it's hard not to be attentive when we are the only customers, the place was EMPTY.  Of course it was rather late on a weekday.I ordered one of my favorite appetizers, samosas and was really looking forward to it's potato-y goodness...dipped in the simpleness of the traditional sweet, yet somehow sour without being sour sauce.  That was when the first disappointment hit.  It wasn't served with the traditional sauce, instead we got something more like ranch dressing.  My craving of 2 weeks....was not satisfied on this visit. My Chicken Korma however was excellent although again, I'm used to it coming with a few cherries in it, but I know not all recipes are the same!!  On MY meal alone this place would get 4 stars but....My fiance was with me and this was his very first and possibly last experience with Indian Cuisine, which saddens me.  He does not handle spice well at all.  We informed the waiter and asked for the dish with the very very least amount of heat in it.  He suggested the tandoori shrimp and that he would tell the chef to make it with no heat...no spice...completely mild.  I had my worries...tandoori shrimp is not known for it's mildness.Well, he gets his dish and both of our eyes start to water as soon as it hit the table.  He took one bite and immediately started choking down water and whatever else he could get down to try to kill the spice.  I took a bite and just about did the same.  I am a person who can down a bottle of Tabasco and think it was tomato juice and I could not handle his dish.  I don't know if this was a burp in the kitchen communication or a cruel joke on the wimp, but I was horrified that this happened.  He vowed to never eat Indian again... The staff didn't seem like it mattered much to them so sadly, it gets 2 stars."], ["Ryan C.", "Unfortunately I can't rate Tandoor as high as others - my visit was a nightmare. Visited on a sweltering hot day, and it just so happens the a/c was broken. So here I am dripping with sweat before my meal even arrives. I ordered the tikki korma, and the chicken was so dry I had to chase it with water to avoid choking. I'd like to give Tandoor a second shot, but it'll be down the road a while."], ["Ryan T.", "I've tried Indian food in several major cities in the US, and I have yet to find a place outside of Lincoln that even compares to Tandoor. The service is fast and friendly - they know my name there. The flavor is different than The Indian Oven but is incredible. I always get the Chicken Tikka Korma and it's delicious. Everything on the menu is really great. The restaurant isn't super nice, but is good for a business lunch or family dinner. If you're unfamiliar with Indian, the staff are very knowledgable and can help you pick something you'll like."], ["Dan S.", "Best Indian food in Lincoln. The Bhutanese Chicken and Tendi Naan are the only thing I order and they are amazing!"], ["Stefan N.", "Hit there last night at dinner rush.  Place was very busy.  Ok I understand we might have to wait and service might be a little slow, we're not in a hurry.  Here's the thing: At least make eye contact with me and tell me that you acknowledge my presence instead of acting like I don't exist.  We finally get to sit down and have a leisurely dinner.  Food was so-so.  Soup was cold, my main dish wasn't very flavorful.  Even after the rush slowed and there were empty tables, service was still poor.  My wife finally got up herself to go refill her water glass.  The other thing that bugged me is that the place is kind of dirty.  scuff marks on walls, doors, raggedy curtain by entrance.  Not a very positive experience."], ["Stew N.", "Good food all around, and very authentic - no more or less hot than this food should be. This is the best Indian restaurant we've found in Nebraska. Not sure what the California dude on this page was expecting, but our samosas came with a spot-on raita, and the whole mix went well with the excellent, just-chalky-enough sweet lassi. Nothing was amazing, but everything was very good. I was completely satisfied with the value. I especially enjoyed the ability to order generous plate of hot pickle on the side for basically pocket change."], ["Brian B.", "Service is friendly and very supportive if you haven't had Indian cuisine before. The restaurant is a bit worn but the food was good and the service was excellent. Price value was very good in my opinion."], ["Phil W.", "After eating at every Indian place in Lincoln, I can honestly say that this place is, by far, the best in Lincoln.  Several of my Indian friends agree!"], ["Brandon B.", "This is the best Indian food I have had in Lincoln. Hands down better than The Oven, and a little better than Sher-E-Punjab. The mulligatawny soup was the perfect mix of spicy and sour, with just the right amount of cilantro on top. The House Bread was chock-full of raisins and cashews, delicious, hot and filling. We had chicken and lamb, and couldn't stop eating... Flavorful and perfect for a Friday night dinner."], ["matt g.", "Wonderful food.  Of course vegetarian mulligatawny which is the best and the garlic naan is fantastic.   It is weird I now live in San Francisco and I can't find vegetarian mulligatawny anywhere.  It is absolutely wonderful!!!"]]}