{"Fazoli's": [], "Vincenzo's Ristorante": [["Weston J.", "Crab and artichoke Bruschetta, have it pre-meal.And have all the wine.Haiku review"], ["Brian B.", "3.5 stars.The Good: Friendly and quick service. Charming atmosphere. Fair beer selection and choice of wine and martinis. Food prices seemed reasonable for what you got. The bread that comes with most meals was awesome!The Bad: The garlic cheese bread was neither very garlicy nor cheesy. It was just ok, but given the $6 price tag and the much better free bread with your meal, I would definitely skip this one next time.The Middling: I got the Big Vinny Trio and my wife got Penne Diavelo. The trio was ok. Everything hit the basics without standing out in any way. Definitely more towards the American side than the Italian. My wife's Penne was supposed to feature a \"touch\" of cream but was actually pretty heavy.Overall I'd come back and try them again. It's a cool location downtown, prices were all right, good drink selection and the food was \"good\" if not much else."], ["Hal S.", "I've been on assignment in Lincoln Nebraska for two months so far and this is the first time at Vincenzo's. I went with a dining partner and she had been here several times and was eager to order her grilled salmon again. But we started with the Artichoke Brochette as an appetizer. It was a very generous portion and I thought it was very good. I didn't get a feel for how she liked it but she didn't finish her half. I ordered the salmon stuffed with crab meat. My partner ordered her grilled salmon and stressed that it be cooked medium, not medium well. The entree's came at the same time with a side of  roasted potatoes and sauteed vegetables each. The vegetables were sliced squash, broccoli, and others that I'm sorry I don't recall. They were good.My salmon was fine, a little to much of a creamy white sauce that I didn't recall would be on the fish, but it was good and cooked to my liking.My partner, however was disappointed with hers. It was too well done. The server said she would bring it to the chef and she reappeared promptly saying that it would take about 5 minutes to remake the order. The order came promptly and the waitress was told that it looked good and would be fine. However, I could see from the side that the center was decidedly under cooked... in fact raw. It seemed that the chef might have even retaliated, it was so obviously not cooked. When the waitress came by to check, she was told to take it away and my partner had no interest in eating any more. The doneness of the first serving could be been debated, but there was no excuse for serving the second serving. Then the manager came out and took a seat by the table. She went over the details and asked if there was anything she could do. We said thank you, but no.I have to say at this point that there is no doubt that the restaurant is very concerned. The waitress never gave a hint of annoyance, and the manager certainly did anything and everything she could. She did not charge for that meal. I would try it again, with someone else or alone. I liked what I ate, but again that second serving for my partner was inexcusable. If I have occasion to go again, I will follow up here."], ["Lisa D.", "Awful! Truly awful! The one in Omaha is much better. Hostesses and waitress were idiots! Pizza was disgusting, frozen party pizza tastes and looks better. It was stale and looked as if it had been sitting around for a few day. Chicken parmesan is not the typical kind it did not come with pasta and chicken was fatty. Please don't waste your money or time!"], ["Paul C.", "This was a last minute decision when my other plans fell through but I am SO glad they did.  GREAT ambiance, service and food.  From appetizers all the way through the cheesecake and chocolate torte, there was NOTHING wrong with the food.  The special was shrimp risotto and the only downside was I couldn't eat it all.  For the price and portion, you can't go wrong!  Will definitely be back on future visits."], ["Victoria C.", "Can't begin to express how great the experience was. We got to sit by the window, our server was awesome, and the food was delicious. I had the fettucini chicken Alfredo. For dessert, the boy and I had the tiramisu. And Oh. My. Goodness.  It was a light mousse. Never had anything like it. Thanks for a great time!"], ["Elisabeth E.", "We were here last night for a birthday dinner and it was my first time dining here. The atmosphere is fun with a big open dining area and neat black and white photos of Italian culture on the walls. The wine situation was fun, they brought out a carafe with house chianti that was 14 ish and half the table just shared that and it was really good chianti too. Gluten free ordering proved to be a bit challenging. They don't have a separate menu nor do they denote gf options in any way. When I asked the server she pointed to one dish and seemed confused. I asked if the steaks were ok and she said- I don't know, if the sauce has starch in it don't order that one...I was at a bit of a loss for words, I had to ask her to please go ask the kitchen as I obviously don't know how they prepare their sauces. It came back that steaks were good, so I ordered the Gorgonzola steak with roasted vegetables and potatoes and the side of scampi. Our side salads came out quickly and mine was crouton free which was an excellent start. Meals followed in good time and the steak and Gorgonzola sauce was excellent. The steak was a perfect temperature and very juicy and the sauce was amazing. The potatoes and veggies were a delight. Only the scampi fell short of my expectations. The portion size was very small for over 7 dollars extra and the sauce was heavy in the citrus. Overall bill wasn't bad as the steak was 25 and well worth it. My friends were all really pleased with their meals and the rest of the service was good. I'll def be back for that steak, minus the skimpy scampi"], ["Sam S.", "Vincenzo's Ristorante was a chance find for us and a great find at that. We were on the way through Nebraska on a road trip and stopped in for dinner. We enjoyed a very good meal all around. The garlic bread with cheese was excellent. The garden salad with house dressing was great. Both of our pasta dishes were also very good. The sauce had a great flavor and an enjoyable spice. Our server Dani was friendly and personable. Her lavender colored hair was cute. We also talked to the owner for awhile and he told us a little about the history of the restaurant. I guess they've been making the people of Lincoln, Nebraska happy for many years.If you're looking for a great Italian restaurant then I'd encourage you to give Vincenzo's Ristorante a try. I was very happy with our experience and our meal."], ["Kent M.", "Great lunch stop today, had dessert first of a banana cheesecake and was excellent. Now the Sicilian Flatbread. REALLY good also. Great service. Always a favorite lunch stop. Thanks folks. Well done."], ["Jason Z.", "I'm not a huge pasta/Italian kinda guy, and this is my third visit here in the last five years, the others being forgettablly mediocre... That being said, I found my new fave meal in the Haymarket.I can't pronounce it flawlessly, and it sounded like a safe bet, but it's:CAVATAPPI FORMAGGIO AL FORNO.  Cavatappi pasta tossed in a white cheddar cream sauce, the baked with breadcrumbs and Provel cheese. (Add chicken or shrimp for an extra cost)It was so thick, so delicious, so filling, and soooo much.  I added chicken, $3, to the meal roughly $11 total.  I was impressed, the sauce actually tasted like cheddar, not the usual bland, flavorless, inoffensive, unimpressive sauce you typically get when I eat out.  It tasted like a light cheese flavor, like cheddar should. The Provel had a hint of smokiness, and the crispy breadcrumbs topped it off perfectly.  Seriously this was everything I love in pasta.  The guy washing dishes walked out from the back to thank me for making his job easy since I licked the bowl clean.The soup prior was over shadowed by the awesomeness of the main course, but it was a spicy, creamy tomato diaviola soup with onions and sausage.  I loved the onions, they were just right.The service was poky, the lunch time had maybe four tables total, but we had a giant group, so maybe that slowed things up.All things considered, I'll be back for that pasta again, possibly soon."], ["Jessica H.", "I plan to review this place again sometime when I can give a much better one. I met my friends here for MY bachelorette party and of all the menu items, I enjoyed the wine the most. Lots of it! So I don't necessarily remember ALL of the restaurant.  I do, however, remember they have a lovely sausage dish and that it was the perfect setting for my party.  They set up a long table to accommodate a very large group.  The decor is very classy and the service was solid."], ["Bob M.", "I went here for dinner because it was across the street from my hotel.  I found the selection of food to be lacking.  I got the steak accompanied by the world's smallest $8 shrimp scampi.  The mixed vegetables were not only overcooked, but cold which is a combination that I cannot deal with.  Also the steak was very much undercooked.  I ordered medium rare and it was raw in the middle.  I would put it as barely rare.  Really better choices in the area."], ["Christa C.", "I've only been here a couple times, but my experience was so poor that I don't think I'll ever go back. I didn't enjoy any meal I've had there (although I am very picky about my Italian) and the service is not the greatest (even though the restaurant is empty every time I go). Given the experiences I've had there I would also say that it's pricier than I would want to pay for the quality."], ["Darryll F.", "Overall great! Went there after nephew was hooded with his doctorate degree. Large portions. Prices were right. I was with a group of 12, so I saw several dishes. I had the spaghetti w/Italian sausage sans cheese. The first order came with cheese (it happens and I don't trip on it). They quickly took it back and replaced it with a fresh dish. Long Island teas I asked for little sour, but it came with too much sour, so they happily dumped it out -- instead of trying to adjust the current ones -- they made fresh ones, which were perfect! And, they apologized in both instances. Carrie, our waitress had her hands full on a graduation night, but she performed very well and overall service was great. Wifey had a spinach salad that she loved. Shrimp scampi was great. Steak w/rock shrimp was plentiful and juicy. The crab stuffed salmon looked great! The pasta w/tortellini was enough for two people and well-prepared. The only disappointments were the kids pizza, which may have been 'homemade' but the crust was like crackers and not appetizing. Also, I was really disappointed w/the tirimusi. More marscopone cheese and whipped cream than anything. I didn't taste the ladyfingers nor cocoa or liquor soaked in which should have been present. However, it was free because staying at the Hilton down the street your room key gets you a dessert or wine -- but it cost them that coveted 5th star."], ["Tim S.", "Been there many times with good results. Tonight, not so much. Ordered a draft beer to start - not cold. Ordered a meal, it was cold. Not a good experience. Might give them another shot sometIme but not soon."], ["Jennifer D.", "My hubby and I went to Vincenzo's for a date night. It was his first time there and I hadn't  been  in quite a while. We found the atmosphere very relaxing and romantic - great place for a date!  We started off with the Arancini which was delish. I had the Cavatappi Formaggio Al Forno with chicken. The sauce was so smooth and creamy and wonderful. My hubby had The Hill and couldn't  stop raving about the sauce, sausage, and meatballs.  You get quite a bit of food so we both have leftovers for later...can't  wait!  The service was great and we look forward to returning...soon!"], ["Lindsey B.", "This place had excellent service, reasonable prices and great food!Another great dinner in Lincoln for $20.  Quite the steal considering I had wine, a salad, bread, and chicken fettuccine alfredo."], ["Charles L.", "In Lincoln shopping for a new house due to relocate. My wife wanted Italian. The menu looks great so we opted to go. From start to finish everything was exceptional. My daughter loved it too and she is 7. starting with toasted ravioli and everybody loved it. cocktails and wine were superb. My wife had baked manicotti the cheese one. And it was awesome I had linguini with pesto again awesome. My daughter has been getting with marinara she loved it. Awesome! service was fantastic the coffee was fantastic prices were great I highly recommend. Only drawback that I can see was that I ordered expresso and they didn't have it which is odd to me for being Italian restaurant but I still give it 5 stars. Once we move this will become a regular meal for us."], ["Rico R.", "I'm laying here in pain as I write this. Pain in a good way from being so full. I thought the food was amazing here. Place was nice inside, fast and friendly service, but 5 stars for the food. The antipasto was all my favorite things on one plate, and had great presentation. The bread was great, side salads tasty,  and my main course was the \"something I can't pronounce or remember\". I wish I did. It was the spicy sausage dish with mushrooms, peppers, and more. I by this time was so full I could only eat half, so I have a box full for tomorrow. Best food I've had in Lincoln. Real reasonable price too. Highly recommended!"], ["Adam W.", "Not only were the appetizers and main course fantastic, but the service was terrific and speedy! We barely had to wait even though it seemed very busy at the time."], ["Derek S.", "The sampler appetizer is a good place to get things started. Loved the toasted ravioli from it.My table had three people get salmon, and all three portion sizes were wildly different despite the same cost. One of them (luckily not mine) had a piece that was comical.We paid 17 for the dish which was a little expensive but not over the top. Would go again probably."], ["Luis M.", "The food here is good, and many dishes are different than what you find in most Italian restaurants. The food tends to be heavy / cheesy / saucy, and a few dishes edge toward salt-bomb territory. The wine list is acceptable but nothing to write home about. The desserts? Meh. The coffee is not so great, sadly, and it seems the espresso machine is broken every time we visit.However. This place has the best steak I have eaten in Lincoln. I'm not sure whether that's just blind luck or what, but the steak here is really honest-to-God fantastic.I am sure my review sounds like faint praise, but the bottom line is that my wife and I are fans of Vincenzo's and eat here relatively often."], ["Suttie S.", "I love to try new places to eat and try to mix it up a little bit so we thought we would try Vincenzos out. We were welcomed with a 45 minute wait and a half empty bar that was having a party in it so it was off limits I was told by our rude little high school hostess without the mostess is for damn sure. We sat waiting as patient as I could be and watched a table that had been empty since we had arrived and my wife made the comment of I bet we get the table that has been empty for the last 20 min as sure as hell we did. Our waitress could tell we were not real happy. She turned our whole evening around for us and made sure we paired the right wine for the meal we had ordered. We started off with their Crab & Artichoke Bruschetta and then to our main coarse of Pasta and stuffed pork chops. The food was cooked perfectly and season very good as well. I would recommend them on their food but not on their service at all. Was very put off by a couple of high school snobs that should have been working in the kitchen scrapping plates and doing dishes and let someone with a little class and personality to that job. Big Love"], ["Shashank S.", "Went here for lunch. Service was a bit slow but the food was excellent. Had an old world Italian feel to the restaurant with large black and white posters of Italian family photographs and a mural of a map of Italy. Food was excellent for all of us, ordered spaghetti and meatballs, my Italian coworker declared them delicious, baked manicotti with chicken and spinach. Price was very reasonable also."], ["Mark S.", "We were on limited time to make a flight home at the airport, but wanted to have dinner before being couped up for 4 hours of flying time and then only having crappy airport food options.  The manager made sure that we were helped immediately.  Our lovely server was very well trained and perfectly on cue in every way.  We love spicy food (alla arrabiata being my personal Italian favorite) and were not disappointed.  I had the Penne Bolognese Fiorno and my friend ordered Spaghetti with spicy sugo sauce and spicy Italian sausage.  We both raved about how good our entrees were.  Each entree came with a salad; we requested the House with red wine vinagarette, and a side of freshly baked wheat bread rolls, which we also enjoyed along with a glass of house Chianti.Total came to $30 including tax, which we consider an excellent value for two entrees with included extras, two glasses of wine, excellent service, and exceptional taste.  We were both stuffed and unable to finish our meals.  Our experience was enjoyable in every way; ambiance, service, food, etc.  We were able to make the airport with plenty of time to spare.  Only negative applies to the entire Haymarket area - finding a nearby parking spot can be a real pain.  This time we had no choice except to drive there, otherwise we'd normally walk over from the hotel.   We were lucky and found a spot directly in front on the second pass.  So we seemed destined to have a great experience at Vincenzo's.  If you want a cheap price along with the food and service level that come with it you will probably be better off eating at Olive Garden (The Horror - blech!).  We'll be back in Lincoln in two weeks for an extended stay and plan to return for another meal at Vincenzo's."], ["Dan C.", "Vincenzo's for lunch is almost a must do when I'm in Lincoln. The Penne Bolognese Fiorno is awesome. Penne tossed with pepperoni, sausage and red peppers, then baked with parmesan cheese is a calorie laden treat. Service is always good and at lunch at least, reasonably priced. FYI when in Omaha avoid the restaurant of the same name on 76th & Pacific, it's as awful as this one is good."], ["Jeff M.", "Service was slow!!! Food came out COLD!!! Over all not good!!! Will not go back!"], ["Salmon P.", "What are you guys talking about? This place is great. Right across the street, a pitcher of wine, great service, delicious food. I love this place!"], ["Wayne S.", "Great food, nice facilitie. Had the spaghetti and meat balls, very good, sauce was awesome. Reasonable price too. Parking was hard, but found a place in a city lot that was only $1.00, had to use a credit card to pay, no cash..."], ["emily v.", "My husband and I were looking for some 'comfort food,' and we found it here. I had Shrimp ala Vincenzo, which was jumbo shrimp stuffed with crab and artichokes served over cappelini with a tarragon butter sauce. Although the pasta was a bit overdone, the flavors were just what I was looking for. My husband had a spicy Penne Diavolo. Although spicy, to be sure, it was not over the top. Our entrees were served with crunchy salads in a rose wine vinaigrette and warm italian rolls that were actually quite good! We finished up by sharing an order of tiramisu. The marscapone filling was delicious, and tasted of fresh brewed coffee. I do wish there was a larger showing of ladyfingers though!We both went home with boxes, so portions were generous. With two glasses of wine each, we spent a total of about $70 after tax and tip, which I considered a great bargain based on the quality of food. Our service was impeccable as well. Our server was there promptly when we needed something, every time, but did not nag us constantly with chatter and questions (we prefer to enjoy eachother's company rather than that of the stranger bringing us our food!).A great place, we will be making this a regular stop!"], ["L B.", "I had the chicken Picatta that had capers, mushrooms, and a white wine sauce. The plate comes with a boneless flat,but not too flat piece of grilled chicken topped with some delectable sauteed mushrooms and capers round out the saltiness. The dish comes with a choice of steamed veggies or pasta( which my server forgot to ask me which I wanted) I chose the pasta with Asiago sauce(rich)..overall this place was 3 stars,but it was tasty so go try it out for yourself next time your in the Hay market area of Nebraska!..GO BIG RED:-)"], ["John R.", "After one just OK experience, Vincenzo's has turned around on me. What a great Italian restaurant... Growing up in NJ and moving here for school, I was left without authentic Italian food. This place has become my staple for Italian in Lincoln. The menu is pretty authentic and offers a verity of flavors.. Not just a pasta place. Service has defiantly improved over the years and I love recommending this place to friends. If I to had pick a negative, it would be the wine list. Not very stunning but doable on any given night.  Stop by when it's not so busy and you'll enjoy the trip even more. Favorites: calamari, veal Soto, tiramisu."], ["S a.", "Why, why, why do people like this restaurant?  The ambience is okay, I guess, and the food isn't going to kill you (except slowly as your arteries harden).  But really, Vincenzo's, leave the Provel \"cheese\" to people in St. Louis who apparently don't know what real cheese is supposed to taste like.  Provel is PROCESSED CHEESE.  It is essentially fake-Italian Velveeta!Does anyone really need a quarter inch of processed cheese food product melted on top of what would otherwise be decent pasta?  I guess all of those 4-star reviewers did."], ["Nancy A.", "We had the crab and artichoke bruschetta and was yummy,but rich. We shared the chicken soto which was good was way too much for one person, especially with the appetizer. Pleasant service."], ["Kyla B.", "Ordered the Shrimp Scampi and a glass of Asti. Was very impressed with the service I received and the food was amazing! I highly recommend dinning there!"], ["Lelay P.", "Great ambiance. Excellent service. Food is good. Not good for big groups though, splitting check is a big hassle."], ["J C.", "Id like to say its the best italian in lincoln but is the only italian in lincoln I think.  Food is good, I drink the house wine cause I ain't picky and it always makes for a good time.  I really really wish they would add sidewalk seating.  Everyone else does and this is the only italian eatery and no sidewalk seating?  I,  and am guessing many others would eat here more often if you could sit outside from may through october.----update.  they now have outsdie seating i see.  this is a plus"], ["Josh S.", "Great place to go for lunch.  The chicken soto is amazing!"], ["Abby G.", "Vincenzo's is awesome for AUTHENTIC Italian food in Lincoln. Good atmosphere, great service, and decent prices. I highly recommend the spaghetti and lasagna."], ["Chris S.", "Another huge warehouse space converted to food use in the Haymarket district. I feel a little dwarfed by the high ceilings and rooms that go on forever. But I got over that once the food arrived. I had the pasta, what else was I going to get? It's a solid Italian place, the waitstaff were helpful and friendly, and like Kelly mentioned, the coffee was refreshingly good."], ["Jules T.", "I've always enjoyed this place, but it has been a while since I've been back. I just remember escargot."], ["Kara R.", "Chicken Picata is one of my favorite dishes - but it's hard to come by. There chicken picata was excellent. I agree with Wyn A that it is a little pricey - although I've heard that all dishes are half price during the lunch hour. Anyway I thought the atmosphere was great. We were treated very well. Great service. Overall very impressed! I can't wait to go back!"], ["Kelly R.", "Let me start off by saying that I probably would have given this place four stars if I had ordered something different... The atmosphere here is very nice, and waitstaff was attentive. My boyfriend and I were both happy that they served GOOD coffee, since we had been surviving on HOTEL COFFEE in the A.M.'s . The house salad is yummy. Great herb-y dressing. But my dish. It was so....rich. i ordered the Stuffed Cannelloni which was described as \"shells stuffed with Chicken and Spinach, in a white sauce, covered with cheese\". SO, to me...white sauce is butter/wine sauce. They meant an almost alfredo-like sauce. There was TONS of the stuff, topped with a sheet of cheese as thick as my finger. I couldn't even TASTE the cannelloni. I was so disappointed. It wasn't \"bad\", I guess. I was just expecting something different. My boyfriend seemed pleased with his baked ravioli, so all is good. The dessert menu looked tempting, but we were saving ourselves for some Ivanna Cone!!!"], ["Wyn R.", "Really good food and lovely atmosphere.  The crab and artichoke bruschetta is divine.  The pasta dishes are a little pricey.  But, I say that about all pasta in finer Italian places.  We all know what it's made of, why charge so much?!?"], ["Tricia M.", "I have always loved Vincenzos but after this latest visit I will never be back again. I went with some girlfriends for a night out on the town. We were seated in a corner table and the place was nearly full, as it was a Saturday night. When we were nearly finished with our meal (which was just average; I think the quality has declined over the years), the manager came over to our table and said that another table had complained that we were being loud. At first I thought he was joking, because if you've been there when it's full you know how loud it can get in there. I would be the first person to admit if we were being loud, but I can guarantee that we were not. When my friend asked if he could clarify, he responded in an extremely rude fashion, specifically calling her out and betraying her. Then he came back to our table a second time and I explained to him that we were not being loud and the noise volume in the restaurant was normal for a Saturday night. We said that we had planned on ordering dessert, but after this treatment, we would not. He said that was our prerogative. When I said that we would never come back again, he again replied that was our perogative and then stormed off in a tiff. Our waitress came over to our table and apologized, saying that we were not loud and that this manager is known to be rude and mean. We left, without dessert, vowing that none of us would ever be back again. The managers name was Mark."]], "Florios Italian Steakhouse &  Lounge": [], "Little Caesars": [["Tim V.", "Little Caesars is one of my favorite pizza-chain restaurants (next to Pizza Hut, Domino's, Papa Johns, or Godfathers) that makes great pizza at a good price.  For a $6.00 pizza that is hot and ready to take, hence the nickname \"Hot-N-Ready\" pizzas, I find it very convenient for ones who are hungry and in a hurry, or to just pick one (or more) up and take back home to eat."]], "Noodles & Company": [["Jill S.", "Great food, besides the flat like paper thin potstickers. Just let them cook with out squashing them!! Love their food other wise. And sign up for their email deal and get a free entree on your birthday up to a $10 value and also buy one get one free emails often. Which is great because their food holds over great in the fridge"], ["A B.", "So if you have a gluten intolerance, and you live in Lincoln Nebraska and you think Noodles & Company is a good option, you should proceed with caution. They don't know the menu, they have \"outdated\" information available to consumers that says entrees are GF that aren't, and while the cashier was gracious and concerned, the manager was an asshat. Look online for the latest and most accurate information before you order, talk to the cashier, reiterate that having gluten by mistake will cost you a day of your life, and hope they'll care enough to give you safe food."], ["M. Z.", "Nice service, considerate waitress, great noodles. Will be back again and again! P.S. Love Japanese pan noodles and pad Thai!"], ["Gabe A.", "Good food and great location. Love how campus and downtown are steps away. Best patio concept of any Noodles I've been too."], ["Alex W.", "I love Noodles. Noodles & Company gives you a good variety of choices, and you can even build your own if you would like. Normally, I have never had a problem with this location, been to it a few times. We went yesterday, for Mother's day, and beat the main lunch crowd. So it wasn't particularly busy. I ordered my normal Pad Tai. It always has a bit of spice to it, but this time it was super spicy. It was so spicy I couldn't even finish it, and I've never had that happen. It was also very dry and my noodles were sticking together. My brother ordered the exact same thing, and his had plenty of sauce and his wasn't nearly as spicy as mine. My other brother ordered his noodles with Shrimp, and they completely forgot the shrimp. The gentleman that brought us our food told us he'd take care of it. It took quite awhile to finally get it, and my brother was almost done with his meal by the time the brought it to us. They did bring my brother a rice crispy treat since he had to wait so long. He did like that. Everyone else's dished seemed to be okay. My mother did order the butter noodles with chicken and she made the comment it didn't have the normal seasonings on it, that it was kind of bland. Was not impressed with it yesterday. Will I go back, yes. Normally they do a good job. Parking it a little tricky though."], ["Tatiana H.", "I love this place! The food is fresh, and tasty and the service is fast. The employees are very friendly and I like the music."], ["Don M.", "First time in this particular Noodles.  Staff was super nice and the meal was better than my last two trips.   It came out fast, and hot.  My son's first time here and both loved it.   The chocolate chip cookies are good too.  All of the ingredients in the noodle bowls taste really fresh."], ["Tash K.", "For a quick late night meal this place met all criteria and more, because it wasn't dripping in grease and didn't make me feel like i swallowed a bowling ball. Service was also very friendly."], ["Meka A.", "I love the new layout. I like how there was menu's everywhere and the staff was extremely knowledgeable on the food. I hadn't eaten there for about two years so it was great they were able to help me figure out what went well with what. I thought parking would be a problem but they had tons behind the building. I would say the only negative would be the price but it's so good I don't care."], ["Mallory P.", "Haven't been here multiple times, but I don't plan on ordering the pasta fresca here ever again. I've noticed it seems to be dependent on the individual store with this dish because I've had the same thing happen at one other Noodles. The pasta fresca here was just really bland, barely any seasoning other than pepper. The downtown Noodles seasons this recipe great so if I'm in the mood for pasta fresca I guess I'm going there instead."]], "daVinci's": [], "Da Vinci's Italian Sidewalk": [], "Pickleman's Gourmet Cafe": [["L S.", "Dank sammiches - you should eat emThe pizza is also swell. Always on point, I recommend anything with chicken. Skip jimmy johns and come here, where the gourmet sandwiches actually are."], ["Chad T.", "Today  I ordered the asiago chicken bacon club which was quite tasty.  The price for my combo alone was on the slightly higher end but  I was able to get a free kid's meal with my ticket from the children's museum which made our meal very reasonable.  Staff was friendly and put in additional effort to make our lunch enjoyable.  Recommended."], ["J Z.", "Ordered a pizza around 6:20 pm for delivery. About 7:30 I called the restaurant to see where my food was. The person who answered the phone cut me off immediately upon calling the restaurant and said \"if you're calling about a delivery the driver should be out already. Anything else I can help you with or not?\" So I just hung up and waited for my pizza. All in all it took an hour and a half for a pizza to be delivered to a location within 2 miles of the restaurant. The driver reeked like pot, but his excuse was that he got lost.. Again less than 2 miles from the restaurant downtown Lincoln. Food was room temp. Driver didn't even have a pen."], ["Erik Y.", "Picklemans.  Hey look, its another sandwich shop!  Lincoln is way short on these, I think there are only 432 of them.  That said, Pickleman's is a pretty decent place for a sandwich.  Its not bison witch's but they do have some nice options.  The Italian Club is really a good sandwich.  Salami, capicola, pepperoni, ham, provolone, lettuce, Tomato, mayo, onion and V&O + Italian seasoning.  Good flavor.   The Meatball is also really good, much better then subway et al.  So, if your downtown and hunting for a sandwich shop they are hard to find, jump on over and try Picklemans.  Or better yet, call them up or order online, the deliver!"], ["Claire D.", "Good toasted sandwiches, just a little disappointed that it took them 1.5 hours to deliver to my work .5 miles up the street on Broadway. After a call, they told me my sandwich was on the way. 30 minutes later it was here. Tip; don't order if you're hungry, order in advance...2 hours in advance to be exact. Or go in and get your sandwich to heat up for later!"], ["Sharon S.", "Decent sandwiches for the price, service was fast and friendly. Staff was great and made good conversation with us. The food was comparable to jj's. They had a full range of toppings for your sandwich. Chips and drinks are extra but still reasonably priced."], ["Ali C.", "ordered delivery from them twice and it took over an hour both times to get my food. I am 5 minutes away from the location."], ["Gary P.", "I really like this place.  I took off a star because it's a little pricey but they have a great atmosphere and good sandwiches so I suppose you get what you pay for in a downtown that is overcrowded with sandwich shops.  They also have good service so a good lunch experience overall."], ["Sam K.", "I ate here for the first time and got the hot Italian beef sandwich with mozzarella, peppers, and au jus. I was pretty impressed, and wolfed it down! However, someone took me out to lunch that day, so it wasn't on my own dime. I didn't realize they were a little pricey here, so that's why I'm keeping the rating a little low. When choosing a sandwich place in the future, this place probably won't be the first one I think of because I would rather go somewhere cheaper."], ["Ryan S.", "Downtown, has cookies, subs and pizza, whatever don't you want?Go now, staff was friendly and legit."], ["Casey E.", "Eh. Chain restaurant with over priced small portions. Plus the atmosphere was like eating in a giant warehouse."], ["Daniel A.", "I've had lunch here so many times. The ingredients are good quality, so the sandwiches turn out great. Compared to Subway sandwiches, world of a difference. Great service too. Very friendly staff."], ["Ryan L.", "Foods great and the hours are even better. The only down side is the service is horrible. Delivery drivers take awhile, waited for 1 and a half for my pizza once. By time the pizza got to me it was room temperature. After it took that long to get a pizza to me I began asking how long it would take to get here after orders, seems very reasonable to ask that. Since I've been asking that workers have been sarcastic and rude, I've been told multiple times that my food will get here sometime before tomorrow. Works act as if asking how long until my order will be here is asking to much. Anyways I love picklemans but the service is horrible, like many Lincoln restraints downtown."], ["Wendy H.", "Ordered online from the SLU location.  Food arrived warm, order was correct, and delivery time was unbeatable.  Delicious!!"], ["Lisa K.", "tried for the first time for lunch - online ordering was not spectacular,it did not allow customization like extra this or hold that, but my order was ready when I got there. got a half salad/half sandwich combo - have to say the portions were great (esp the salad), & for $7 bucks you couldn't beat the food. Would've given 5 stars if they delivered - I'm .02 miles outside their delivery zone."], ["M M.", "Loved it!Reminds me of Potbelly's in Chicago (menu and decor look the same).The name threw me at first...wondering what \"Pickleman's\" would serve.Definitely recommend this place."], ["Caden Z.", "Helpful staff and good food. The prices are reasonable as well."], ["Alek Z.", "They're pretty dece. I got the Asiago something or other sandwich, and it was pretty good. Cost me like 9 bucks for delivery, so that wasn't too bad."], ["Phillip J.", "Good pizza.  Only went here because Ya-ya's was so damn busy.  They do not serve alcohol.  Will try sandwiches next time."]], "MoMo Pizzeria & Ristorante": [["Justin S.", "My family and friends really loved our lunch at MoMo. We each had a different pizza and swapped slices. We had the Primavera, Greek, Lobster Hollandaise, Baked Potato, and Brie and Portebellla. All were unique and well balanced.Also enjoyed the Caprese Salad and the Grape & Gorgonzola Salad.They have an impressive Whisky/Whiskey collection."], ["Elisabeth E.", "I've been here a couple times now and I've been generally impressed. The atmosphere has a great date night ambiance with low lighting and plenty of seating with space for conversation and privacy. The service has been pretty good both times. Last time I was here we came in on a Friday night around dinner and were able to get a table quickly. Our server was nice and we got our food out in a timely manner. My bf is rather picky, and we usually don't agree on restaurant selection, but he absolutely loved his meal. We ordered the cheese tray which had three different types of cheeses, grapes, a relish, and a little pickle dish. Everything was really good, and they accommodated my inability to have the bread with it by throwing in some extra cucumbers for me, which was appreciated. For my entrée, I had steak pasta with the Gorgonzola cream sauce and it was amazing! It's particularly easy to be gluten free here. The kitchen is aware of what to avoid, prepares food in a safe place, and is even willing to transform non gf menu items when possible, what a treat!! They substituted the pasta with zucchini noodles. The first time I came here I had the zucchini noodles with the bolognese sauce and it didn't quite work for me, but in this dish it was perfect. The bf had the chicken cannoli and was basically in heaven. Portions are really good size and I had plenty to take home for another meal. Prices are pretty reasonable and I think the food quality is excellent. I definitely recommend trying it, I know I'll be back, especially since the bf approved which is a rare honor."], ["Sondra Z.", "First the good:  our waiter Eric was amazing!  We had several apps - portobello fries, garlic cheese bread, and brussel sprouts.  All were really good, but the Brussel and kale sprouts - absolutely amazing.  Next up came the pizza - lobster and shrimp with hollandaise sauce, and marguerita. Both pizzas had good, crispy thin crusts.  That's the best thing I can say about them.  What a let down after the great apps.  The sauce on the marguerita tasted off, can't put my finger on what the flavor was but metallic ketchup is my closest guess.  I liked the theory of the pizza, closest to a traditional Roman marguerita with just sauce and cheese and not chunky or sliced tomatoes, so I had high unfulfilled hopes.We were having a good time so risked desserts.  Vanilla gelato with honey bourbon sauce and candied pecans, tiramisu, and bread pudding.  The tiramisu  was solid.  I didn't try the bread pudding because it was inhaled quickly, apparently it was good!  The gelato was sooo good.  The sauce and pecans were perfect.I'll go back, but will have apps and dessert next time and skip the pizza!"], ["Krista B.", "I made an account just to rave about the quality of this place. The decor is very chic and modern as well as clean. Our waitress Tonya was very knowledgeable about their food and drinks and helped me find a red wine I liked and a beer for the boyfriend. For our app we chose brussels and kalettes which were very flavorful - a hint of sweetness with savory from the bacon. They were also cooked to a nice crispness but still juicy on the inside. Entree: I chose to try the prosciutto and egg pizza - I requested the egg be done hard instead of over easy like the menu had it. Tonya gave me a slight attitude because of it (she must have something against people that don't like runny eggs), but it was just a slight  hiccup in her otherwise stellar performance. The pizza was excellent - it was a crisp thin crust and was   not too greasy. Boyfriend ordered the special which was a seasoned steak and brussels with potatoes. It was also delicious - the steak was cooked perfectly as were the veggies. Dessert: We ordered the tiramisu.  I've never had it before but from what I could tell it was excellent. Very thick and creamy but not too rich either. It was perfect to end the meal. All in all it was a pretty good price for the quality of food, service, and portion sizes. We will definitely be back."], ["Jessica H.", "Still a fan, just updating my review with more pictures and food reviews.  We stopped at MoMo's late on a Sunday afternoon, close to 3 p.m.  We had been working in the yard and made a trip to Menard's and while we looked acceptable (we cleaned up from yard clothes) we did get some funny looks.  Remember this is a golf clothes is as casual as you should get kind of place. They served us no problem.I had been dying to get another taste of those lovely brussel sprouts and kalettes, so that was the first thing we ordered.  This batch had fewer kalettes, more sprouts.  It was still yummy BUT those crispy, melt in your mouth kalettes are my favorite and I would have liked to of had more.I was there with my brother and husband and we all were in the mood for very different things and all left full and pleased.I had the pie of the week, duck confit, with a white sauce, a very mild mozzarella and a peachy relish.  I have to be honest I was kind of disappointed.  The seasoning didn't seem even around the pie and had I of had some salt on the table, I probably would have given it a little sprinkle or two. There was flavor, the fatty duck and the peach, but nothing salty to balance it out.  This could also be remedied with a better cheese too.  The crust was yummy, as always.  I love MoMo's pizza crust and creative toppings, just not sure this was the one for me.My husband had the steak arrabiata. This looked SOO good and he refused to let me try it.  It included pan seared marinated sirloin, radiatori, cherry tomato, spicy marinara, leeks, romano and parsley.  I'll have to try it sometime.My brother had the baked chicken cannelloni.  This is a VERY cheesy dish.  It was tasty, a bit too salty for my taste buds, but good.  When I have pasta stuffed with deliciousness, I'm never a big fan of the ricotta goodies that fall out and you have to eat them sans noodle BUT this spinach ricotta mixture was very tasty and cheesy on its own. With an appetizer and three solid entrees we spent $60 (not including the tip) which for the quality of food, the good service, nice atmosphere, it's well worth it.  I am still a MoMo fan and will return!"], ["kristen m.", "Such potential but fell very short. Interior is very well kept and neat. The menu is nice but over priced. The food another story- sandwich was soo small and had little to no flavor. I have a pet peeve that food only tastes good bc of cheese or condiments - this should never be the case they should only add to the dish. That was the case here. Sadly even the condiments only made the sandwich edible. The salad that came with the meal was also very lack luster. Bottom line for Lincoln it's nice to not be a chain but I can't say I will be rushing back anytime soon. Additionally, our waitress smelled like cigarette smoke when she returned to our table a few times."], ["Fazle H.", "Omg this place is an absolute rip off fest.  The pizza was an absolute insult to my pallet, they even ruined a perfectly good salad.  This place tries so HARD to be something is not,  trust me Im the king of lincoln,  raised in a REAL STATE,  in a REAL CITY, called Pompano beach, florida, a suburb of ft. Lauderdale, and i had food at pizza Hut that's better than this debauchery, don't believe the hype people. If you are going to eat here,  just light your money on fire,  you will get more pleasure out of that vs. eating this f**k fest.I ordered a simple Margherita pizza,  it was soggy,  flimsy, and the consistency was so off. I only ate it all because I don't waste food and I paid good money for this joke.  I understand there's hungry people in the world and they would appreciate the food here. However, if you are going to open a business then at least serve food that doesn't pi*s people off. My wife and I asked about the business and the chef. It turns out homeboy was a sous chef at a bar and he was only promoted after the head chef became ill. God bless google.  The food here is supposed to be homemade,  homemade food is never this bad unless the person is just a bad cook. You have to be a real bad \"chef\" to make me write a review this long. The waitress was nice but very fake,  no one is ever this extra perky. We asked about the menu and she sounded very rehearsed. My aim is not to tank the business but to get them to serve better food or hire a chef that doesn't suc* who can cook better food.  One of my complaints is that yelp won't let me give zero stars."], ["Dennis N.", "Great place for small plates and a good glass of wine. They're pizzas are a specialty but I've never had one. We like their Brussels sprouts, caprese salad and warm olives. Excellent wine list."], ["Johanna K.", "Had fabulous bruschetta. The bread was warm and had the perfect crunch and the topping was perfect! The carne pizza was also excellent as I prefer super crispy crust. I'm taking away one star only because I think it was a little overpriced with small portions and the service could be a little better. That being said, the management brought over toys to keep my little ones occupied."], ["Eamon H.", "Went again for our fourth or fifth visit for my birthday recently. Pretty solid experience. Still wish the dough had more flavor but very much like everything else. Something that bugged me that night (and bugs me in other restaurants):  Ordered drinks at the bar while we waited for a table. When our table was ready I asked to transfer the drinks. \"We'd prefer you close your tab here, sir\". And we know why of course: \"I want to be tipped and I don't trust the server to tip me and therefore since we don't have a good system let's make it the customer's problem\". Why can't restaurants figure this out? When I griped to the owner he shrugged and did an aw shucks excuse along the lines of \"We're just a pizza joint\".  Bullshit. If I'm dropping $100 for 2 people it is not a 'pizza joint'."], ["Gigi A.", "Zero stars.This place should not exist, but sadly it does. It preys on a small town and the lack of upscale feeling restaurants, especially on the south side of town, which I honestly believe is the nicer part of Lincoln. Having lived in places like NYC and Miami, I can tell you this is terrible food. This place wants to be a nice, modern, hip restaurant/bar.What it actually is though is an entirely different thing. It's pretentious and the service is downright rude, and condescending. The waitress went on for about 5 minutes in a very chipper tone. (read: memorized)Food was very overpriced for what it was. I will happily  spend $100 for dinner at a nice restaurant. This place charges like a high end place and serves you cold, disgusting pizza with dough that tastes like vomit and servers with a stick up their butt. Even their salad was terrible, how hard is it to fuck up salad? Come on!"], ["Jeff K.", "Stopped by for a light dinner on a Wednesday evening. Enjoyed some chorizo potatoes as an appetizer. I enjoyed them but my wife thought they were spicy. The sausage had a good flavor and the sour cream topping countered the spicy side.  I would definitely order them again. We both had sandwiches and a glass of wine. She had the ham and cheese and I had the chicken. Excellent sandwiches!  Great flavor all around. The cheese on the ham and cheese really added flavor to it.  The sandwiches came with a side. A salad for my wife while I had the fruit. Both were great. The fruit was full of flavor and was ripe. Wine was the Seghesio Cab and Alamos Malbec. This was our third visit since they opened and we have never been disappointed."], ["Roger L.", "Dropped a star from my previous review. We came early to avoid the rush--it was my wife's Birthday. Our server was never quite 'on'--a bit too hurried. Our second round of drinks took too long. We asked for only one egg on our favorite arugula prosciutto pizza. She told us they forgot in the kitchen--instead of saying they were getting it right she said, \"is that OK?\" We love the meatball appetizer but it was very salty tonight--too salty for me but some in our party said they were great--I'll defer to the majority.Our server never asked if we wanted dessert, after dinner drinks or coffee. That said, the tiramisu was excellent. We'll be back, but I'm hoping for better attention to detail and more focused service."], ["Cindy C.", "Momo's has hit their stride.  Had my best meal ever -- trout with a pine nut stuffing topped with arugula and a lemon vinegarettee. The textures and flavors were out of this world!  My husband enjoyed his porchetta wih potatoes and kale. Lilli's cocktail menu is one of the best in Lincoln. Creative takes on standards plus a few new infusions. Nice selection of wine and beer.I appreciate the friendliness of management and bartending team. Looking forward to a beer tasting meal on September 11!"], ["Susan N.", "I love their food when they get it right. But when they are busy, they don't get it right. And it's not okay. Everytime I've been here on a busy evening, the salmon gets overdone, the olives unevenly heated, and the service is apathetic. :(. It's a drag too because I really love their pizza. And the golden beet salad is still out of this world. Just go when it's not busy."], ["Laurie A.", "Fantastic! Brought a friend who wanted to dislike it.  He didn't like the commercials and had a mindset that it would be a terrible experience.  Instead he turned into a cheerleader!  Praising the meal and the service.  We will definitely be back again."], ["Heather W.", "My husband and I went here for Lincoln restaurant week. The food was absolutely amazing! and the customer service was fantastic! Even with 2 small kids, the staff was friendly and helpful and brought our food right way. Anything you order on the menu will be tasty. We will definitely be back!"], ["Sam K.", "I really don't understand the hype with this place. First of all, the place is always crowded because it is not very big! Right when you walk in you practically run into the bar. The tables are all super close together, and honestly I've had better pizza at Little Caesar's and paid less than half for it. We went back a second time and tried their sandwiches and again, nothing special. I also had the carrot coriander soup and it made me want to vomit - very poor flavor. Both waitresses we had each time we went there seemed super rushed and unorganized. Doesn't put off a good vibe for customer service."], ["Chad W.", "On a trip from Michigan we came to MoMo's  and bought 3 specialty pizzas. They were excellent with fresh veggies on them. Clean place and great service."], ["Chris G.", "My husband is from Gilbert Az, they have no short age of amazing restaurants. We have been looking for a good Italian restaurant in Lincoln. We found it, from the appetizers, main dishes, but the best was the tiramisu. If this place was in AZ, they would have a 2 hour wait!"], ["David M.", "This restaurant has a very upscale feel.  The first thing you see when you walk in the door is the pizza oven and the pizzas within, which definitely increases the appeal of getting a pizza.  Service was friendly and quick.  We ordered 2 pizzas and were served in about 20 minutes.  The Margherita pizza was decent, but the rosemary chicken pizza was superb.  Looking forward to trying more of their pizzas.  They have a very good wine selection."], ["Nancy W.", "We ate at MoMo's last Friday evening and had a good experience.  We were told there would be a 30 minute wait and actually got called in less than 20.  Between three appetizers and two pizzas we had plenty to eat for 3 people.  The waiter was very nice and efficient and made several suggestions on what we might enjoy.  Not a huge total bill for what we got including two drinks and two desserts.  We will definitely go back.**Tonight I was on my own for dinner so looked on-line to see about take out.  It said yes but when I called they said no.  How hard is it to put a pizza in a cardboard take home box?   Very disappointed!!!"], ["Dave P.", "Went tonight with a large-ish group of 6.  Service was good and fast considering the level of care & attention to the food.  The wine came out promptly and was served well.  The appetizers came out fairly shortly thereafter, and met expectations, which were fairly high based on the pictures I'd seen in a Journal Star piece.   For entrees we had 3 different pizzas, a pasta dish and the salmon salad.  The salad was good and fresh and well received by someone who only eats salads they've home grown.  I had a chance to try the pasta, it was good but possibly nothing to write home about.  The real show stealer was the pizzas, which are hands down the best Neapolitan style pizzas I've had in... decades.  Quality of ingredients was top notch, the crust was perfectly done, and the sauces were an excellent balance between the toppings and the crust.  I don't post many reviews here, even to places I love, but I felt compelled to give this place a glowing review because the food was just phenomenal."], ["Marissa M.", "The absolute WORST costumer service I have ever experienced. I have traveled world and never been treated so poorly. The older hostess is extremely unprofessional and rude. I would never recommend this restaurant to a friend or stranger. A horrible establishment."], ["sarah t.", "My suggestion: keep working on the dough. Try wood fired pizza in other states and see how much better it is. Flavor and texture need improvement."], ["Jamie S.", "NOT KID FRIENDLY and SLOW!!!! I went here for lunch with my mom and 2 kids.  We got a table right away which is great, but one of the high hairs that they brought had a broken strap, and they did not offer another chair (they must only  have 2 for the whole restaurant). I asked if they had any juice as my kids don't drink pop, I was told they had none...which I have no idea how this is when they have a full service bar...I asked and the waitress said all of their drinks were pre made. So we got milk which is fine (actually what I asked for first but she must not have heard me over the noisy environment). My mom and I got water right away while we had to wait 10 min for the kids drinks. We then waited about another 15 to order, and another 30 to get out food. We got the pepperoni pizza and the 4 cheese sandwich. Pizza was subpar, crust was chewy, top was greasy and the 4 cheese sandwich was pretty much just a mozzarella grilled cheese couldn't taste the other 3 cheeses in it.  Sad to say that to get a good wood fired pizza you have to go to a place connected to a gas station....blue mountain pizza puts this place to shame."], ["Wendy K.", "Excellent food, and I like that we could dine outside in a non-smoking space (so many outside patios seem to invite smokers since the restaurants are non-smoking). The chicken sandwich was excellent as was the tiramisu and there was a good selection of wines both by the bottle and by the glass.  My dining partner had the bianco pizza, which she wasn't overly crazy about (she liked my sandwich better :). A couple criticisms...  there is no menu available online, so we took a chance deciding to eat there (I think they are working on their website).  It worked out well, as there was a good selection.  Also, there is no take-out menu available (our server said they aren't even doing take-out), which is disappointing as it's nice to be able to pick up food from your favorite place when you have young children and don't always have the time to go in and dine (a to-go parking space, or curb side pickup would be better yet ;).  All in all, a good restaurant that I will probably return to."], ["Tony C.", "It is good to see an alternative to the conventional heavy-as-lead pizza that calls Lincoln home. I hope this place grows with the times and from feedback it receives. This past Friday evening the thin crust rosemary chicken and egg & prosciutto pizzas were adequate, but they are not yet enough to warrant a return trip for the following. The cheese was bland and character-less. The arugula had no bite and had little flavor. The eggs were also bland and pale yellow (sure sign of factory production). The wait staff sung the praises of the pasta and esp. the cannelloni then proceeded to tell us that they were, darn, all out of the cannelloni. I asked and it appears that none of the ingredients on the pizzas were locally sourced.  I was told that the mozzarella was Roseli, part of a large food service conglomerate.  This is mass produced cheese. All this suggests that none of the ingredients are locally sourced at this restaurant,  hardly \"slow food\", contrary to what was reported in the Lincoln Journal Star Ground Zero (the food reviewer simply took the owner's word for it). Is this too much to expect from a modern eatery?   I am appealing to the owner here: prove it, just don't say it, that you actually use locally sourced ingredients. Local animal, dairy and produce are all available in this area. List all the locally producers you use. Dante's in Omaha, which has the best pizza in the state, does this. This will get me to come back. Service was a bit scattered, but this always smooths out if a restaurant is committed to growing and serving its customers. Pricing is more than acceptable."], ["Chris L.", "I like to say it was a good time but it so wasn't.   While we waited for a table we watched the kitchen drop dough and use it we saw the chef take off his hat several times and comb his hair with his hands and then go back to making pizza.  We saw the pizza wheel being spun on the ground wheel side down and then used on the pizza.  Over an hour wait on 1pizza and a plate of salty spaggetti the food was horrible.  Pizza was raw on the bottom and salty.  I called the next morning to let the manager know and 5 words into it he hung up.  So I'm not EVER coming back and the pizza tasted like it came from chunky cheese.  It wasn't all bad nice building.   We would of left but It was my wifes friends bday and she wanted to stay.  The waitress went to get the manager to let him know about the raw pizza and saltiness of the food but she couldn't find him. So that is why I decided to call the next day."]], "Valentino's Pizza": [], "Olive Garden Italian Restaurant": [["monica b.", "We ate there sept 25 for a late lunch.  the place was packed. it's as good as i expected. i  enjoyed the soup and salad with seconds  of both and my husband had the chicken marsala which was delicious and tender crammed with mushrooms.  a week after this experience we realized that somewhere on our cross country vacation.... we lost our credit card.  we were able to trace the receipts  we kept to the last time we had used it. It was at this olive garden.  we phoned the manager and he mailed it to us that night.  i was incredulous!!! after all the horror stories on the internet about waiters who take your card and return with another card... and  then rack up charges. quite a compliment to the integrity of the people who work at olive garden!"], ["Kuanlim P.", "went there for my birthday. I really like the place and pasta. Nice service."]], "Piezano's": [["Sam K.", "Quite a staple of Lincoln - amazing home made, delicious pizza. They do not skimp you on toppings and their food makes your taste buds explode each and every bite. That being said, I have read other reviews (and heard from other people by word of mouth) declaring that the employees there are rude, snippy, etc. I just want to say, that depends on your definition of \"rude.\" Would I say our waitress on this visit was overly chipper and constantly smiling? No. BUT - first of all, the pizza that my girlfriend and I ordered took a while, and came out a little bit after our friends' calzones made their way to the table, and PIEZANO'S COMPED OUR PIZZA! And honestly it wasn't that long of a wait! We were so impressed! Another instance that occurred is they had drink prices listed and I was going to order the whole table some pitchers of soda but the waitress just straight-up told us to order glasses of pop and she would keep refilling them for us for free. There is NO WAY I could say that their customer service is bad after that. If you want rude and snotty service go to Brewsky's. Piezano's is A-okay!So in summary, keep it up Piezano's. There's nothing better than a locally owned restaurant that doesn't stray from their values and cranks out hundreds of perfect meals every day."], ["Justin S.", "I did the Sunday lunch buffet with a few friends. At $6.99 it was a good deal. Gotta love genuine bacon at the salad bar! There was also cheesy bread. For pizza they usually try to have two to four types at the lunch buffet. When I first went up there wasn't much fresh pizza available, but a fresh pepperoni soon came out. The crust is substantial, but not in a good way. It detracts from the toppings. The pepperonis were good, but it might just have been cause that pizza was fresh out of the oven. The other toppings were average.The table at our booth was a collapsible table with wide legs that were way to wide for the booth. It was strangely difficult to get in and out of the booth.I'll probably come back, as it is a nice way to get a quick lunch with a variety of flavors, but probably not for a little while."], ["Jonny K.", "If you like thick crust pizza, this is the place for you. Not much seating or parking, and it always seem to be cold in there but the atmosphere is great and the pizza is good quality."], ["Rigs R.", "I wont be going back.. I ordered a thin crust for delivery and got a 5 pounds of crust, pizza....First thing i said when i ordered was I wanted a Thin Crust and somehow the lady answering the phone leaves it out...I dont know about you but I dont want or like eating 5 pounds of cooked doughso i just ate the toppings off a medium pizza and throwing the rest out...Twenty bucks for a few pepperonis and i GOT RIPPED OFF...I RECKON IF YOU ORDER A XLARGE YOURE LOOKING AT 40 BUCKS LOLshould of went to Burger King lolol"], ["Lisa T.", "Go for the Caesar's pie. If you're not into massive portions, split it with a friend. It's amazing."], ["Steve M.", "I lost track of how many times I have driven past this place wanting to try their food. On April 23, I finally did it. To my surprise, they had something called potato pizza. I ordered the small size potato pizza with shrimp added and a side of BBQ wings. The food was great and the service was really good."], ["Shirley P.", "WORST DINING EXPERIENCE I HAVE EVER HAD.  We got there at 5:50pm tonight (Saturday night).  We ordered an ice tea, water, antipasto salad and a 16 inch pepperoni and cream cheese pizza.  Water and salad came out fast.  But after an ice tea refill, they run out of ice tea.  How hard is it to make tea when it's 6pm on a Saturday night? My husband asked for a diet coke instead and she didn't bring that out for at least 20 minutes saying she made it but someone stole it.  Our huge salad only had one dressing container, even though the other table's single serving salad had the exact same size dressing.  I'm fine paying the fifty cents for more dressing, but it doesn't make sense to give me the same size dressing as an individual dinner salad when my salad serves 4.45 minutes later and well after 6:30, our waitress tells us they dropped our pizza.  They will make a new one and it will come quickly.  We ask for it to go since it's been AN HOUR SINCE WE SAT DOWN!  The pizza came about 20 minutes later and it's a 10 inch!  The waitress argues with me saying I ordered a 10 inch.  Are you serious?  She's wearing slippers and yoga pants to work.  We just wanted to leave but I was so pissed.  The waitress didn't charge us for the ice tea (so generous) but that was the worst $20 dining experience I have ever had.  When we got home almost two hours later since we left the house for pizza, the 10 inch pizza wasn't even that good."], ["Jon S.", "The Caeser's Pie is delicious. My wife and I shared a \"family\" size, which comes out in an 8-inch Pyrex dish. It is really delicious. I've only had their pizza once, and it was good...but salty. I think overall their red sauce tends to be on the salty side. My wife and I want to try the pizza again and order toppings that aren't salty too and see if that makes a difference. Service was good. It was a bit slow, but they were busy. Prices are very reasonable."], ["Veronica H.", "Great for Delivery, Good for Take-out! Great Pizza, lasagne, and the kids pizza is good too. You'll gets lots of toppings on your pizza, and a generous family sized lasagna. I've only ever has their food to go, therefore I have no comment on the in-store dining experience."], ["Jane S.", "I have heard from people who have lived around here for a while that this is a great place, not so much. The garlic and cheese on top of the calzone was burned. The cheese, although lots of it, was flavorless. How does one manage to not have good cheese in a pizza place??"], ["Renae N.", "THIS IS THE BEST PIZZA IN LINCOLN (possibly the world). I've had a lot of pizza in a lot of states and even a few different countries, and this is my favorite pizza. It is the best pizza I have ever eaten.My favorite is the Chicken Tuscany. They have cream cheese on it, which is amazing. I'm not a big fan of pepperoni pizza, but I am at Piezano's. I have never been disappointed here, and always bring out of town guests to show this local pizza joint off.A tip...the parking lot is a nightmare. It's tiny and the spots are all angled oddly so that it's almost impossible to get out when you leave. If it's after regular business hours, I usually park in the lot next door, to the east. It's also easy to get to Piezano's by bike, because it's on South street, not far from the Rock Island Trail."], ["Matthew K.", "I have never had a bad experience here. I would give it a 5 star, but it isn't the classiest of places and lacks a good ambiance, but if you don't care about that and just have a desire for great pizza, this is the place for you!"], ["David M.", "One of the best places to get a pizza in Lincoln.  A thicker crusted pizza with lots of flavor.  If you're dining in, it is small, but with good service."], ["Jim L.", "I've been sitting here reading the other reviews, and can't believe what I'm reading.  Did I come on a bad night?  I got the regular crust meat pizza.  The crust at the edge tasted pretty good on its own, but the rest was a mess of mushy nasty provel (cheese of the devil) on half-cooked dough that tasted like some Lutheran old lady's \"Italian\" Sunday hot dish.  What is it with Nebraska pizza shops and provel cheese?  (If you don't know what provel is, it's basically a cheese blend, similar to American cheese, invented for people in St. Louis that didn't like stretchy cheese.  I'm not making that up.)I can't stand provel.  It's tasteless mush.  But hey, if you like Valentino's, you'll love this place, it's rather like two Valentino's pizzas stacked on top of one another and half-cooked.Mush!I read recently that 25% of people are super-tasters, 50% normal tasters, and 25% non-tasters.  So I'm thinking 25% of pizza eaters will love this place.  I'll let you decide which 25% I'm talking about."], ["Jason D.", "Okay"], ["Joshua H.", "Kind of on the pricey side! Good pizza....service is awesome....worlds tiniest parking lot :-)  all in all good stuff :-)"], ["Derek S.", "I think this is the best pizza in town hands down.  My wife and I go here at least twice a month on minimum.The pizza is continuously delicious with a sweet sauce, tons of cheese and high quality toppings.   They have the option for 3 different crust styles.  I've tried all 3 and the thin is probably my favorite.  It is light and crunchy.  The sicilian thick is almost too thick, but still very very good.  Their wings are plump, juicy and full of meat and have an italian hot/spicy flavoring that is out of this world and as unique as it comes.  Also, so far the best wings in town and close to the best I've ever had.The staff is always friendly, fast and attentative. Everything in this place works together and they do deliver.  The parking lot is a little small and be difficult to get out of . . . just an fyi"], ["Brad G.", "Meh, the pizza is nothing special. They have s small parking lot, so you may have to park around the block on the street. Other than that, nothing to write home about."], ["Nancy L.", "The best pizza I've had in Lincoln. Honest. We got the bacon, ham, cream cheese, and potato pizza on their medium crust and it was bomb. I will be returning soon. Soon and often."], ["Ryan S.", "Very nice place. Ceasars pie was great.  C-shells was ok, very salty.  Portions are large, we could have probably split one entre and would have been plenty.  Service was ok, but not great.  Fast but not super friendly.Bathrooms were pretty gross.  Old and dirty and dark.  Very gas station like.Cost was very low.  Less than 20 bucks for two with no drinks.   We would come again for sure and try the pizza."], ["They Call Me L.", "Zowie!  And to think I had to travel over 500 miles to get some good pizza.  I've been in BoCo since April of this year and have yet to find a real go-to place for pizza.  So here we were in Lincoln, having just watched the Huskers finish off the Huskies, and we wanted to get away from the downtown dinner crowd.  With the aid of Yelp, we found Piezano's.  It's a cute little place, with about 10 tables.  The parking lot is small - you need a compact or midsize car to really maneuver around in there, and they should really make it back-in only.  Anyhoo, we didn't have to wait for a table, which is fortunate, since we were starvin' Marvin, not having had any foodstuffs since around 10 am, and it was about 9 hours later by this time.  They had just two beer options available that night - Bud Light (ewwww) and Fat Tire.  We ordered the cheesy garlic bread, Cesar's pie (a baked pasta dish), two calzones, and a pizza (thin crust).  Our waitress failed to bring out the appetizer first, which would've been nice to stave off our hunger, but we actually didn't wait that long for all the food to come out, so that kind of made up for the oversight.  And in general, the waitstaff was very pleasant and helpful.  At any rate, back to the food - everything was absolutely delicious,and I'm not saying that just because I was ready to devour anything in sight that was edible.  The sauce, the cheese, the spices, the crust...'twas oh-so-divine.  I wish I  could put this place in my pocket and transport it back home."], ["Dave R.", "This is by far, the best pizza in Lincoln. Ever since the new owners took over a few years back, everything has massively improved. We have tried both dine-in and carryout, and every time it was a hot and tasty meal. We've introduced several friends to Piezano's and they absolutely love it. There is just something about their crust that is just so much better than anything else. And the sauce is very, very tasty. They don't overdo any element; it's just a harmonious balance of awesome.Note their parking lot only fits maybe 8 cars and their dining area is not the biggest. And unless you're westbound on South St, it's a tricky place to drive to, but well worth it!I know I'm a bad Nebraskan for saying this, but I can never go back to Valentino's or anything else again."], ["Cory O.", "The Service: Honestly I've only ever had take-out from these guys so I can't really rate the service. When I arrived to pick up the pizza however they were attentive and helpful.The Food: The pizza is good, really good actually. Personally I've been rocking the hawaiian pizza (thin crust) and it's just delicious. I'm not even a Hawaiian pizza kind of guy but it's soooo good! Any pizza you get is hot, fresh, and tasty! They have other actual itialian dishes but I've never ordered any of those.The Location: Easy to find/get to, a nice small spot that's clean and works.The Cost: Pretty reasonable considering how good the food is, maybe 22 bucks for a large pie when you order take out."], ["Paul W.", "Piezano's in my opinion without a doubt makes the best pizza in town. I've had pizza at all the other popular and talked about places in Lincoln but this one still beats them. It's the combination of generous toppings of fresh veggies and tasty meats on their delicious in-house made crust that, in my mind, makes it stand out. If you love pizza, you owe it to yourself to check out Piezano's. Their meat combo is amazing."], ["Matt M.", "Drove by this place many times and I finally stopped. I haven't tried the pizza yet but the baked pasta dishes I got were outstanding and the staff was very friendly."], ["Brandon B.", "We had a pepperoni pizza and a vegetarian pizza. Although everything tasted flavorful, it was incredibly salty! Wow! The salt aftertaste ruined the experience of the pizza for us - it's certainly better than other pizza places in town, but you will need a lot of water to finish your pizza."], ["Gabby A.", "Piezano's is delicious.  They have some of the best pizza in town, and also a wide range of affordable Italian dishes.  Their pizza has a great crust to toppings ration, and they have a very large list of  toppings.  They have great pasta dishes as well, my favorite being the Pasta Piezano (add broccoli and chicken-you won't be sorry).  To top it off-they deliver!  This place is fantastic!"], ["Eric H.", "Piezano's is one of my favorite places for pizza and pasta in Lincoln. The place is a little small so getting there early is recommended on weekend nights. Parking is a bit cumbersome here and you can only get to it from the north side of South St."], ["Kyle A.", "Don't hope to get any customer service,They got my order wrong and not only said I was wrong and it was my own fault, but basically said tough shit.Edit: Now that I tried there \"thick crust\", I wish I could give them zero stars. part of its doughy and undercooked, if anyone let this out of their kitchen they deserve to be shut down."], ["Masrur O.", "Check out their Veggie pizza it is awesome!"], ["Toninette C.", "Piezano's is simply the best!"], ["Steph H.", "Amazing.  My new favorite pizza. I'd been there a few years ago and had pasta, but this last time we got deep dish and the toppings we got were cream cheese pineapple.  Oh my gosh so good.  The crust is yum yum yummy.  Can't wait to go again!  And it's close to my house, so that is even better."]], "Pizza Hut": [], "Lazzari's Pizza": [["Erick C.", "Their pizza is very good. It isn't anything that will make you rethink your concept of pizza, but it is well done and tasty. The pizza I had was a little spicier than I like, but I admit to being a wimp, so it's probably just a pleasant bite for most people. It's a small place, very cozy. The place is very comfortable in feel, but it does seem a bit... used or even beat up, I suppose."]]}