{"Parthenon Restaurant": [["Rudy S.", "best greek restaurant I have been to.   service is always excellent. food is always above. excellent wine list.    specials are always excellent. choice and value. very reasonable cost  for what is offered. eat here usually once a week."], ["Wesley B.", "I can't say enough good stuff about this place. The food is terrific, the staff is very friendly, it's just a great place to eat. I'd recommend this to anyone."], ["Derek B.", "Very good atmosphere, food was good, but, not great. I wish they had a 3.5 stars. That would be my rating. I don't think the food was quite as good as King Kong's overall, but, had a better atmosphere and service for a \"date night\". I would go back if in the area, but, I wouldn't make a special trip. Had the Gyro Platter. Meat was good. I ordered extra meat and couldn't really tell the difference from those who had the regular portion. I wasn't overly impressed with the Greek Potato. Sald as good. Their Tzaziki sauce was very good, probably the best I've had in Nebraska. Again, not bad, just didn't meet my expectations."], ["Danielle R.", "Decent Greek food and excellent service! The babaghanoush wasn't the best I've ever had but it was decent. The Greek salad that came with the meal was huge, enough to split with another person. It had great flavor, as well as the dressing, but they went a little heavy on the dressing. I'll know to ask for it on the side next time. We ordered the eggplant pita, which was \"lightly fried\". It was downright fried on a pita with lettuce and tomato. Nothing fantastic but still pretty good and I didn't have any leftovers. I'd go again, maybe branch out and try something different."], ["Mark J.", "The Real Deal Greek.  This place is great, and I love the souvlaki and gyro plates.  Perfectly prepaired and the  tzatziki sauce is homemade and tasty.  Oh and for an appetizer you have to get the flaming cheese.  It is so good but you can feel your heart clog as you eat it.  Worth it imo.  Drink and wine selection is decent, and the service was really good.   The desert is the best thing about this place.  They have a case with like 20 different options and they all look amazing.  But we stuck with the Baklava and Chocolate Baklava.  YUMYUM"], ["Jim A.", "Absolutely outstanding.How refreshing to find real food prepared on site.The walleye and catfish were not only fresh, but perfectly prepared.The crab ravioli was spectacular.What a treat.  Will be back next trip over I-80."], ["Ashley K.", "Just moved to lincoln and this was the first place we stopped to eat. We will definitely be regulars!! We have been back time and time again and have never been disappointed!!! The owner, George, is always out serving guests and will stop to chat you up if there isn't a large dinner crowd!!!"], ["Roger B.", "Walked into the Parthenon  and was greeted by a large dining area, fortunately split into what amounted to separate rooms.  We were early enough that there was no wait for a table.  As large as the place is, there was a line waiting for service when we left.  Amazing.  My wife and I started with the dolmathes platter.  They weren't bad, a nicely flavored mix of meat and rice drizzled with some type of lemon sauce.  I had the gyro platter with Greek fries.  There was something about the Greek fries that tasted off.  I don't know if it was the spices or what.  My wife ordered the moussaka with the vegetables of the day.  She had no complaints about the meal.  The Baklava for dessert was good.  I did see on the menu that there were vegetarian options."], ["Christina C.", "I am in Lincoln for business and I have eaten here twice. I wasn't impressed the first time but I decided to give them a second chance since I love Greek food so much.I found their pita bread to be fairly tasteless. This is not bread I would eat by itself, like I do some others. I was unhappy that that the only choice of hummus had roasted red pepper. I am allergic to red pepper and hummus is one of my favorite foods and I couldn't have it.Instead of the hummas, I tried the roasted garlic and feta dip. I LOVE roasted garlic, but I did't like it at all. It was very bitter and hot. It tasted like they put a LOT of raw garlic in it and little, if no, roasted garlic.Every side dish they have is a carb. They have 2 side dishes of the day that might be vegetables. The first day they were both vegetables that I could not eat. They have a entree served with asparagus but they would not serve it to me as a side dish. The second time they had a stewed cabbage and carrot dish that was okay. It was over cooked and bland but at least it was vegetable I could eat. The Greek salad was pretty good. It had a lot of ingredients unlike a lot of restaurants. My only complaint is that there was too much dressing both times I ordered it.On the first night, I ordered the portabello chicken and it was cooked very well, I just thought the cheese overwhelmed the flavors. The second night I ordered the stuffed salmon. The \"stuffing\" is basically a crab cake on top of the salmon. The flavor was pretty good, but the salmon was cooked well done instead of medium or even medium well.As for the service, it seems to be hit or miss. The first night it was pretty busy and my service was good. The second night it was much slower and the service was pretty bad. The waiter came up to tell me to ask him if I had any questions. As I was starting to ask him a question, he turned and walked away. At the end of my meal I sat for 10 minutes waiting for my check. There were only 3 other tables filled at this time.I don't see how people are saying this is the best Greek food they have ever eaten. This may be the best Greek restaurant in Lincoln, but it isn't great Greek food."], ["Matt M.", "We were in Lincoln last week and I saw this place had great reviews. Needless to say we were not impressed. The service was very odd and the food was mediocre. A few of the appetizers (stuffed grape leaves & hummus) were ok but the entrees were lackluster. The lamb was overcooked and under seasoned, the gyro meat was dry, the potatoes lacked flavor & the spanakopita was left with only one bite taken out of it."], ["Sam L.", "Great food great staff kid and pet friendly. The best Greek food in the Midwest family ran. Wine dinners will rock your world. Bacon wine dinner will make you see the gods of Greece."], ["Sarah P.", "I have never had a bad experience here. The entrees are delicious. The baklava is heaven."], ["Nicki L.", "All of the food we ordered was absolutely lights out. The owner is incredibly involved in his food, and he is super friendly and pleasant, as was the rest of the staff. I was truly only disappointed by the fact that I could not order every menu item and shove it in my face. The wine and beer selection is not vast, but seems to be quite solid, again, everything we ordered was perfect. I am very much looking forward to finding myself in Lincoln, NE again soon, if for nothing else, to get my hands on the calamari and baby octopus."], ["Randy P.", "AMAZING...AMAZING...AMAZING!  What more can I say about this place.  Eat here at least once a week; can't get enough of their authentic Greek food; try a special they will blow your taste buds out of the water.  Great, fun group of employees and owner(s) who always stop by to make sure everything is perfect.  Yes the food takes time to come out, yes it's cooked fresh to order, and YES I'll wait a little longer for my order; it's well worth it."], ["Lelay P.", "This place is over-priced, food was okay, the servers are nice but I honestly wouldn't come here again if I'm paying. It's just not worth MY money."], ["Peggy N.", "I am visiting Lincoln, NE for two weeks and tried this restaurant as it located near my hotel and came highly recommended by coworkers.  I decided to get my order to go and just hunker down in my room for the night but restaurant is really adorable so I may need to come back and eat in while I am here.I sat at the bar to order and noticed a large beer selection for such a small bar.  The bartender was quite friendly so I ordered a beer and sipped while I purused the extensive menu.  The selection was large and everything sounded yummy.  Not only did they have their daily selection but also specials of the day including daily specials on sides and desserts.  I finally selected the Chicken Souvlaki which came with pita and rice and a choice of one side.  I chose one of the daily side specials, roasted beet salad.  The chicken was grilled and delicious.  The beet salad was unique in that it was incredibly spicy!  But super yummy.  I love beets so it is hard to go wrong.  I will go back while I am in town to try something different simply because all of the choices looked equally good.  Also good to note: they have several vegetarian choices and a separate vegan menu.  And the appetizer menu had many fantastic looking choices as well!"], ["Brittany S.", "The Parthenon is, by far, one of the best restaurants in Lincoln! To start, the appetizers are amazing! I would highly recommend the souvlaki (flaming cheese). It gets even better with fresh and delicious entrees. Almost all the pastries here are flown in from the Greek fishing village, Tarpon Springs in Florida and are authentic, fresh and delicious! There are always tons to choose from!The owner is always very friendly and helpful, as are all the servers! I've never had a bad service experience here!"], ["Tore L.", "Pet friendly on the patio! Excellent service!"], ["FS O.", "REALLY nice people running this place.  However, that's about all I can rave about in a positive way. I have had Greek food many times in many places, including Greece.  Let me assure you, THIS IS NOT GREEK FOOD!!!  This is better categorized as \"Food by Americans with a Greek last name who have forgotten how to cook Greek food.\"  The Greek potatoes were steak fries -- 'nuf said."], ["Dani W.", "Came in around 9 on a Thursday. The staff was great even though we left right at closing, they were attentive and pleasant. We got the flaming cheese and it was pretty good, at least get it once for the effect!  I had the jump spankopatia and it was good, but ill get something else next time. The corn and black bean side was delicious as was the taziki sauce. The pita bread was light and complimented both the cheese and my friends gyro. We finished with some baklava that I also recommend. I felt like we ate a lot of food and the price was very reasonable."], ["Brad B.", "The food was all good. The Saganaki was superior. The leg of lamb was 50/50...a little on the dry side but good effort. Here's what pisses me off: the unannounced upsell. I asked the waitress if I could substitute a cup of soup for one of my sides. \"Sure,\" she replied. Then there's a $1.99 extra charge on the bill. \"Do you want some pita on the side?\" she asked. \"Sure,\" I said. Then there's an extra charge on the bill. It didn't amount to much but it would be SO much better if she had told us."], ["Derek S.", "this place has decent greek food.  you get large portions for the price.  the staff in my opinion was attentative, but slow after giving your order.  the flavors are as authentic as you will get outside of greece.the spanakopita/tiropita was good, but the fried oysters are where it's at for appetizers.  thick crunchy breading with a fantastic dipping sauce packed full of flavor and spice.the mousaka was below average and almost to the point where it was mushy.  however, the pastitsio or greek lasagna was very good.  the dolmathes was exactly how it was supposed to taste, cooked well with traditional greek flavors.  the greek fries are just steak fries, so fyi on that one.people who were with us said the stuffed salmon and gyro sandwich were delicous and highly recommended.  honestly, both of those caught my eye and when my wife and i go back, that is definitely what i will be ordering."], ["Michael S.", "The pita bread was a tad disappointing, but otherwise, nothing to complain about.  I wanted to get dessert; but the entrees are generous."], ["Hanna D.", "Vegetarians, Vegans, those Omnivores looking to please yourself and your vegetarian and vegan friends:  This place is awesome, everyone can get something.  You want squid?  You get it.  Your sister wants vegetarian mousaka covered in sheeps feta?  She'll get it.  Your brother has gone totally vegan - he's got a whole section of the menu to himself (first I've seen in an omnivorous restaurant - very forwardthinking), with several tasty options (orzo stuffed peppers; stuffed portabello mushrooms, to name a couple).  Looking for an appetizer for everyone?  Try their hummus sampler, with 5 homemade options to please everyone.The service was great, the food was delish, and I can't wait to eat my way through the veggie options on the menu."], ["Brandon P.", "Best Greek food in Nebraska!"], ["Wayne W.", "Great Greek place...at least as far as the food is concerned.  The service was horrible even though we were only one of three couples in the place.  It took them forever on every course and drinks."], ["Andy A.", "mediocre food, not always served hot.it is ridiculous that they push spendy wines with $10 entrees. a separate full size drink menu? all the laminated things all over the tables? and a food menu that has 4 times as many things as it should?"], ["Wyn R.", "I think the reason this place gets good reviews is that Lincoln is seriously lacking in the Greek food category.  Granted, they do a few things well.  But come on, how hard is a gyro.  I like their appetizers, but any time I get something other than a gyro or a Greek salad, I'm disappointed.  And they have no clue how to cook vegetables unless you want a vegetable that is mush.  Gross.  Honestly, it's mediocre at best.  Just makes me miss Papa John's.  The food was the same, but a lot less expensive.  Plus, I really miss their Greek omelet."], ["Jim C.", "Parthenon is in the same vicinity as the Runza we tried the day before, it wasn't hard at all to find. We had the Hummus appetizer, the red pepper gave it a salmon color, really tasty. I almost had the Gyro, but since that's what I always get in a greek restaurant, I went for the special - Kibbeh platter, lamb meatloaf with pine nuts, moist and full of flavor, a tad too heavy for lunch, hummus, same as the appetizer, and what looks to be tabouleh, chopped parsley, mint, tomato, lemon juice and olive oil in a small dish, they were a bit stingy with that and the pita bread, but they bring more if you ask.  And of course the have Dog Tuesdays, bring your dog to the restaurant for some K9 buffet."], ["Bob H.", "Great food, great service. We ordered a lot of items and they were all excellent. Best of all, the more Greek your choice, the better. It's the real thing. The kids loved it too and I can tell this will be their gateway to an expanded palette and taste for ethnic foods. Good atmosphere. At first I was put off by the fact that you get a drinks+appetizer menu first, without dinner menu. But to get it all at once would have been overwhelming, plus I am so happy I got those appetizers! Baklava dessert was sublime."], ["Gabby A.", "One of my favorite places here in Lincoln.  Wonderful Greek/Mediterranean food!  The service is probably the best I've ever received in a Lincoln restaurant, and is probably in the running for the best service I've ever received anywhere.    The meat dishes are spectacular, and you should always start your meal off with a saganaki (flaming Greek cheese).  I also really love the mousaka (Greek eggplant lasagna).  The flavors are unique, and the portion is just right.  The wine list is spectacular, and they do flights so you can try a bit of everything.  End your night with one of their dozens of delicious desserts.  The Parthenon is a great dining experience from beginning to end!  Opa!"], ["Dennis K.", "I don't think the Greeks would recognize this food as theirs. For example, the tzatziki has a hint of garlic when it should be loaded. It's good food most of the time (kudos for that, honestly), but it's only tangentially Greek. What do you expect in Nebraska? One thing that I find annoying is that you order hummus and they give you too little bread, then they charge for more bread. Also, the wait staff are often inexperienced. To their credit, they serve Greek wine and beer, and the baklava is pretty good."], ["Brent G.", "Excellent variety of Greek foods....the best I've had since I was in Greece. Good service and positive, pleasant staff."], ["Matthew P.", "Went at around seven thirty on a Saturday night with friend.  We were warmly greeted and  seated immediately at a table near the back on the main dining area; while I am not a fan of tables, I did have a good view of most of the restaurant. It seemed, as one might expect on a Saturday, to be date night. With the exception of two large groups and then another table of three gays, everyone else was coupled off and leaning in closely to one another.  I didn't notice the it being loud, and even though this establishment is in a strip-mall the interior was  comfortable enough.The service was good. The hostess, wine guy, waiter were all very attentive. I did feel like they were pushing the wine menu a bit hard, though. Our waiter and the wine guy both suggested one of the \"specials,\" which I think were all in excess of forty dollars.  My buddy mention that it recently became legal for restaurants to re-cork bottles in Nebraska, so that probably why they were pushing it so hard.  It didn't really matter to me and if the waiter had maybe suggested a cocktail after I said I wasn't having wine, he could have probably made the sale that way.   However, there was an advertisement on the table to a six course wine and food pairing, which priced at $50 seemed very reasonable to me. This sort of event is likely the only reason I would return, unless I had out-of-town guests that absolutely needed  Greek food on their trip to Nebraska.For dinner I had one of the \"Kazas Family Recipes\" which was named the Parthenon Pasta Platter.  It was just fine, nothing spectacular but solidly good: pasta on a bed of spinach with shrimp, artichoke and feta cheese. The Really Good feta cheese (and the bed of spinach) is probably what made the dish for me.  My side was pumpkin risotto, which I actually enjoyed more then my main course.  In retrospect, I should have just ordered appetisers for dinner, as those that i could see on other tables looked good.  After we were done eating, a man who I would have guessed was a manager or owner stopped by the table. He  cleared out dishes and asked how everything was, eyeballing my half eaten meal.  He looked genuinely concerned and I appreciated that, explaining  I can rarely finish a restaurant sized portion of anything.  In closing the meal, the waiter offered to split the ticket which was very nice because my friend and I were obviously not on a date.   The hostess held the door open as we left the building.  However, I am still only rating this establishment a three, because it is a restaurant and the food would have needed to be more memorable for me to consider myself \"a fan.\""], ["Carrie B.", "WOW!  This place is great!  Probably the best Greek food I have ever had and definitely an unexpected find in Lincoln!  The gyros are definitely the best I have ever had.  We ordered a fried calamari appetizer and got a HUGE serving that was fried to perfection.  Although we barely had room for the combination plate for 2 that followed, we made room for the delicious combination of meats and sides.  The side dish made from orzo was tremendous, and I'd love to have the recipe!  The service was just as spectacular as the food, and the waiter was very knowledgeable about the menu offerings.  Very impressive place!  If you'd like to have a nice, sit-down meal in Lincoln and don't mind spending a little more money than the average meal, I would absolutely recommend the Parthenon."], ["Frans S.", "Very nice modern decor! Friendly owners! The food is only fair however! A bit over price! Service was good! Basically just an average ho hum American restaurant but at least it's NOT a chain restaurant"], ["Gigi F.", "I was in Lincoln on business.  Three of us stopped for dinner.  Flaming cheese, Greek Salad,  Nebraska Lamb Steak and  Greek Green Beans.  Baklava for dessert.  The waiter was a young college kid who couldn't answer basic questions about the wine or food, but he tried really hard.  The green beans were way overcooked, but everything else was delicious.  I would eat there again!"], ["Tom H.", "Incredible food and service!  Menu is extensive and reasonably priced. Dessert selection is out of this world!Chef will drop by to make sure you liked the meal, very nice guy.Dog night is back!  Tuesdays, bring your dog and sit outside with the other dogs!  They even make special dog food!"], ["Dan B.", "This is a great little place with a lot of personality and charm.  The food is usually good, regardless of what we order, and the service is typically A+.  Seems to have a pretty decent wine selection and even a few decent beers, too.My usual order here is the gyro.  The meat is flavorful and tender.  I have also tried the whole fish (snapper, I think) and a couple of other entrees.  They were all good, but I keep coming back to the gyro.The saganaki is also a typical dish we order.  I have yet to be disappointed by this appetizer.  It's not anything fancy, but who doesn't like flaming, melted cheese?  It's a \"can't miss\" on the menu.The spreads are very good too, and it's worth ordering some extra pita.  We've tried the baba ganoush, the hummus, and several others.My only bad memory of Parthenon is the calamari.  It was greasy and over cooked both times we tried it, but that's a pretty short list.There are also a few side dishes that aren't my favorite, but every place has those.  Most times, people have to figure those out for themselves."], ["Cherie L.", "Love it! Food rocks, service is good, and the ambiance is nice. Outdoor dining is great. They really try to serve authentic greek fare and drink. Love the lemon chicken and greek salad!"], ["Joel G.", "I thought it was pretty darn good for Lincoln.  Great service.  Enjoyed the inventiveness, fusion with other cuisines.  Fried Green Tomatoes.  Outside seating is really nice.  Didn't like having to pay for extra pita, but so it goes."], ["Bill K.", "Consistently good food and pleasant service!"], ["Meghan A.", "I used to live in Lincoln and The Parthenon was my boyfriend and I's favorite place to go! The pita bread and hummus is AMAZING! I always get salmon, which is always cooked perfectly and tasty. Service is always great, and George is a great owner! He really cares about the patrons and takes great care of them."], ["Brandon B.", "Parthenon has decent Greek food. We had the stuffed grape leaves and the spanakopita, and our friends each had souvlaki. All were pretty tasty. Wine samples are ample. The only complaint about any of the food was the green beans (soggy and flavorless) and the salad was slightly overdressed.  The service is a bit strange. You are given only a drink+appetizer menu when you sit down, and it takes a REALLY long time to finally get the real menu. Must work for driving up the bill, but it was a bit annoying. Our waitress was too enthusiastic to be real ('Is everything AWESOME here?'). This is the second time we've had that kind of over-the-top service, so maybe it's the training. Generally, a good place to go for dinner. There are usually coupons in the newspaper to help lighten the bill."], ["Rosy M.", "This is definitely the best Greek food in town. Great service too."], ["Steve W.", "Went there with a group from work the other night. They have a nice variety of dishes available. I had the Greek Salad and Lamb Souvlaki and it was very good. The lamb was tender and nicely seasoned. Good wine list and not too expensive. The service was very attentive despite being quite busy. It's probably the best Greek place in Lincoln. Give it a try."], ["Ray S.", "I'm not sure how how this place gets such good user reviews. The service was great, to be sure, but the flavors... not so much. When I ordered an entree, it came with about 4-5 total different kinds of things on it. Only one item was good. The others were average to bad. One was wayyy over-salted. It was very strange to have one good item and the rest not be good at all... I would expect that if a restaurant were bad all the food would be pretty much bad. But here the flavors were really hit or miss... but mostly miss. There are definitely better places to go out to eat in Lincoln."], ["Lady C.", "This restaurant is oh, so good!  Their waiters are pros, so much so that they have upsold my bill by at least $20 everytime I dine there, but this is only to provide a full experience, from appetizer to desert it is amazing."], ["Betty B.", "I love the Parthenon...George, the co-owner, is so authentic...so genuinely caring about great food and new recipes,  I also know that he  treats his staff with dignity and lets their creativity flow, giving them the advantage to whip up new recipes and event ideas.  I've never seen such a sweet restaurant tied together as a family business.  Last night I had a special dish that had a subtitle of \"eggplant shoes.\"  It needs to be a regular on the menu...scrumtious!"], ["Brandon F.", "Personally I am a big fan of the parthenon.  the food is excellent, and the service is good as well.  The fried calamari is some of the best I have ever had, and what I rate all other calamari against.  Also Sunday brunch is very good as well.  Get the greek omelet, or maybe the ham and eggs.  In the summer grab a seat on the patio, a nice white wine, and spend the evening overlooking the always scenic super saver parking lot."], ["Adam R.", "Average overall, but worth at least one try.  Only complaint is the main dish servings were small, but sides/extras made the meals more than enough.  Good atmosphere, good seasonal beer selection, would go back again if I had a coupon."], ["Beth B.", "I love Greek food and this is the best I've found in Lincoln.  Inexpensive drinks and the dinner prices are also reasonable.  Start with saganaki appetizer and greek salad.  Several very good appetizers.  I always have the greek potatoes as a side.  Make sure you check out the dessert case at the back of the restaurant!"], ["Brad G.", "If you are looking for the ultimate greek omelet, this is your place.  I think they only serve it on Sundays.  George, the chef and owner, is a gracious and wonderful host."]], "Sultan's Kite": [["Gary P.", "First time at Sultan's Kite. Everything looked and smelled so good it was hard to choose.  The line was long with regulars so I thought the food must be good or they wouldn't be there. They all looked like they worked in downtown Lincoln. I had the a pita with chicken and wedges and the flavor was different. I left feeling satisfied without the usual feeling from a sandwich shop. It isn't a fancy place but it is clean and well run.I would definitely go back because there is more to choose from! :)"], ["Michael U.", "Cool menu - good location on O Street. College kids running the place. Good met the need.Free water offered. Lamb Gyro was pretty tasty"], ["Misty C.", "For some reason, there are a number of falafel joints in downtown Lincoln, Nebraska (and one just added to the Haymarket District). Many of them, including Sultan's Kite, are open after last call. Those other joints are ok, but the food and service I get at Sultan's Kite makes it vastly superior to anywhere else I've had falafel. Ever. In my life. They have a menu on the back wall, but since falafel is the only vegan option (besides my side of potatoes) that's all I care about. Even their lentil soup is somehow not appropriate for vegetarians, and that is clearly stated on the menu. There is no vegan sauce option, either. In any case, the falafel is the greatest. For real.So, normally a joint that really doesn't have a lot of variety for me won't get a 5 star review, but I'm going to cut the Sultan some slack because I always leave completely stuffed and can get my falafel 4 ways: wrap, pita, rice bowl, or salad. I always get a wrap, and the guys give me a nice smear of hummus as a substitute for the sauce. One could also ask them for a drizzle of olive oil and I'm sure they'd oblige. Lettuce, red onion, and tomato, and I'm set in terms of my wrap. But there's one more awesome thing I need: a side of real potato wedges! Don't eat them with your fingers because they use turmeric in the preparation of said wedges and you'll turn yellow. In conclusion, they're great for lunch, after last call, and any time you want falafel. Be prepared to be stuffed as the portions are generous. Get potatoes, use a fork. Superior to all falafel joints in the known universe and all of recorded history. Yep."], ["Brandon A.", "Of all the Mediterranean food in Lincoln, particularly in this area, I like Sultan's the best which is why I'm giving 5 stars. The pita bread is phenomenal, but can obviously make your gyro a little messy because it is loaded with meat. The wrap is a cleaner and easier to eat option because it's bigger, but not near as good as the pita bread (IMO). I enjoy half gyro and half chicken shawarma. French fries are available upon request which I enjoy with a gyro. Fries are the only area Gourmet Grill has an up on Sultan's. At the end of the day, Sultan's fries are fine. I just think Gourmets are amazing. Brat"], ["Abhishek M.", "My skepticism because of the name was quickly gone when I ate tonight at Sultan's Kite. This is the real deal! The food is legit - fresh, tasty, healthy and inexpensive.I tried the Chicken Shawarma on salad and left feeling full, satisfied and guilt free since I skipped out on the rice and pita. To indulge, I got a side order of the falafel and they were crunchy and delicious. I can now see why the front desk agent at the Cornhusker Marriott, who referred me eats here 5 days a week. I would too, if I lived here."], ["Karina C.", "Very good gyro's although a bit messy. Staff is really nice. You don't have to wait for food at all. Cheap! It's not fancy at all, but it serves the purpose."], ["Kaley S.", "The Good:Tasty and quick spot to grab a bite while you're traveling across the country -- super accessible just off the highway, right downtown, park on the street and you're in and out in minutes! The Bad: Limited options (go only if you like Greek food!)The Food: I had the falafel with rice and red sauce, and it was good! The sauce was supposed to be mild but I found it to be a bit spicy, which I enjoyed. I was happy to have found a light, not-unhealthy meal in Nebraska while we travelled across the country.The Service: Super quick  -- order right at the counter as they make it in front of you, sit down and eat it, or take it to go (it will come to go unless you specify otherwise).Overall:Great spot to grab a quick, casual bite if you're in Lincoln Nebraska."], ["Chris C.", "This little restaurant in downtown Lincoln is great. LOVEd the falafel pita. My wife had the Korma and was delighted. This is a good stop if passing through Lincoln, as we did. Quick, awesome value, delicious, and the employees are nice."], ["Elleen P.", "Came here with a pretty big group of people at like 3 in the morning, when they were closing up, but they still invited us in to order (I felt terrible.. haha). So service I'd give a 10/10. Shared a chicken gyro with my friend, and it was a good size for us since I don't think either of us were really hungry. The pita was good (albeit soggy since it was sitting on the bottom, but that's the nature of gyro plates) and the rest of the ingredients were just really solid. The place is a little run down but hey, that's how you know it's legit lol"], ["Calin D.", "Who knew one could find decent Hummus in Lincoln Nebraska of all places?The falafel sandwich was also yummy, though the staff was certainly surprised that I, with such a large Nebraska-looking frame, am mostly vegetarian. (Not always, just mostly.)The potatoes are also quite good, and the drinks are plentiful, which is useful when washing down pita and hot sauce.The town of Lincoln has probably seen better days, so this nice affordable joint with plenty of seats and decent Mediterranean food was worth the detour.Cheers!"], ["Britny W.", "So tasty. Good food for the price! The chicken Shawarma was definitely our favorite, paired with potato wedges and a pita- perfect."], ["Matt H.", "I had the chicken shawarma on pita bread with salad.  It was very satisfying and the medium sauce has just the right amount of heat that I still felt after finishing the meal.  It was my first experience and the staff was very helpful and even handed out samples.  A little on the high side for cost but not a spoiler.  Will come again."], ["Weston J.", "This is one of myfavorite places in Lincoln.So goddamn tasty.Hard to choose one dish.Schwarma? Gyro? All of them?Baklava, for sure.Haiku review."], ["Chris J.", "I read the reviews and tried it out.  This is very good Greek food.  I didn't think the chicken was amazing, but it was very good.  The gyro meat was extremely tasty too.  Potato wedges are giant.  Very affordable with the quality food you are eating.Not really much of a restaurant.  This is a \"order at the counter\" and take it home type of place.  They do have about 6 or 7 tables, but it is not a dining experience.This is a solid 4 stars because of the food and prices!"], ["Lewis Marklin M.", "Was down by the college when I stumbled upon this place and you don't think of Mediterranean food when you think of Lincoln but this Place rivals any other that I have had and it is in my opinion a much better option for lunch then any fast food place and much healthier, services fun and friendly."], ["Hina G.", "5 stars: The potatoes and their spicy yogurt sauce is to DIE for.4 stars: The service (friendly-ish people, depending on who is working) and falafel. The falafel itself is pretty good but paired with the sauce is heavenly.3 stars: salad- I hate all salads but if you like salad then you'll probably like this one. It's Greek style.2 stars- Chicken korma. I used to be a HUGE fan, but then about a year ago, something changed. The chicken that used to be succulent and soft became tough and dry. The sauce on the chicken is still really good- but the chunks of chicken are chewy and bland.1 star- The lentil soup. So bland. So unsatisfying. Lentil soup (daal) should be earthy, filling and make you feel like you're being wrapped up in an Indian's mother love. Theirs is watery and way too bland. I like it when places keep their lentil soup simple, but Sultan's Kite needs to step it up a bit more.Overall, a great place to go and beats out Gourmet Grill and Ali Baba's by a mile."], ["Jessica S.", "Quick and delicious! My new favorite place to eat, friendly people and I have never been disappointed with their food."], ["Michelle S.", "Visiting from out of state. Have been to the middle east for Mediterranean food.   The Sultan ' s  Kite rivals the best I've had.  Flavorful chicken,  some of the best falafel,  and excellent tzatziki (sp?).  All,  we're told,  from \"mom's\" own recipes.   Very tasty!"], ["Amanda S.", "I am addicted. Love the staff. I am a fiend for chicken shawarma. Pita. Wrap. Rice bowl. Haven't been disappointed."], ["Janet C.", "The gyro with spicy tzatziki is incredible. Fresh soft pita filled with perfectly roasted meat, fresh lettuce, onions, feta, and a choice of mild, medium, or spicy tzatziki sauce.  Be bold try the spicy, it adds a new layer to this familiar sandwich.  Finish off your meal with a fresh piece of baklava- you won't be disappointed. The Diet Dr. Pepper option on the soda fountain was a pleasant surprise."], ["Sarah G.", "Great spot for a quick lunch. And they definitely don't try to overwhelm you with the menu (but know what you want... vague references to 'whatever sounds good' or 'everyone' on your chicken schwarma could result in some confusion). Speaking of which, I didn't know what I was being asked at one point. but it was only $1 so I went for it. Turns out it was a healthy side of roasted potatoes! Mmm... I'll return next time for the chicken tikka korma."], ["Jonah K.", "Currently one of my favorite lunch spots. Loaded gyros with fresh vegetables and flavorful sauces, all at a great price. The service model is similar to chipotle, with an assembly line behind the counter, so it's easy to build what you want without a long wait."], ["Omar R.", "Nice clean place located in a very cool area. Very affordable and VERY delicious. I ordered the chicken schwarma and was happy to know that I was not misled by the overwhelming positive review. I definitely plan on coming back whenever I am in Lincoln again. They use square so i thought that was pretty cool."], ["Truthful T.", "There is no other way to eat Mediterranean food. The shawarma and gyro fall apart from being roasted for so long.  The menu provides you the opportunity to try a little bit of everything and its all delicious! The amount of quality food you are provided is extraordinary, if I am in Lincoln again, this will be a staple for me.  The staff is friendly, courteous and helpful.  The entire process is supremely efficient. If you have not tried this place, you must!"], ["Matthew A.", "We heard about this place from Yelp just passing through town. It was a great choice for lunch. I wasn't sure what to order, but the guy there suggested the chicken shawarma wrap and my sister in law and I both enjoyed it. Kind of messy, but delicious."], ["Renae N.", "I have been in Lincoln for 4 years, and never made it to this place (my husband had a bad experience when it first opened up and never wanted to go, even though I did, he finally relented). I was impressed! It was incredibly busy over the Friday lunch hour. The food was fast and very, very tasty. I had the falafel on a pita. The staff seemed distracted and uninterested in helping much, but I got my food quickly."], ["Krystal Y.", "They have delicious chicken gyros, hummus and pita! The tzatziki sauce was fresh and they have spicy tzatziki sauce options which also sounded great. Overall a great, inexpensive and quick bite to eat while passing through Lincoln, Nebraska!"], ["Krisha B.", "This place is really great especially if you aren't sure what you want. They have gyros, falafels, wraps, and rice bowls. Everything is really good! It's a casual atmosphere and the price is moderate. Ask for a sample if you are unsure before you order."], ["Ted B.", "Being a food-y college student I tend to spend my money wisely when it comes to good eating. This being said, I had read only good things about Sultan's Kite so I figured I would give it a try. The food was nothing short of great. The problem I found myself faced with was the absolutely awful service. Behind the counter were two guys, one clearly a manager of some sort and younger kid. The manager type character served with the biggest attitude I have ever seen and was beyond rude (hurrying me out of the store, grunting of obligation when I asked for something else,etc..). I am one who likes a restaurant for the food it serves, but this man's attitude will permanently keep me away from his restaurant. Too bad, I thought I found the best greek food in town."], ["Nathan C.", "Absolutely one of the best places to eat in Lincoln Nebraska. If you are a true foodie like I am, you will come to appreciate Sultan's Kite."], ["Amanda B.", "I'd eaten at Sultan's Kite before I realized so many Yelpers had given it a near perfect rating. So, on my next trip I analyzed my way through the meal and decided that I agree!  My partner in crime always gets a gyro. I usually get the Chicken Tikka Korma, side salad, and potato wedge. He's not hip on Indian flavors, so I love that their gyros fit his bill!  Sauces and dressings are all delicious. The spicy tahzikki is my favorite. I even get excited thinking about their rice!There are only a few tables and booths in their galley- style restaurant, so I've only taken my food to-go. The best part about this place? The value. For way, way less money, time, and effort I can get some of my favorite Indian/ Mediterranean flavors. And feel uber satisfied."], ["Josh C.", "Wow...  a lot better than what I expected.  Actually the chiken korma was very good.  Curry taste green soup was great in this cold weather. ..Go for the chicken!!"], ["Melissa M.", "When you come here you have to get the chicken tikka korma. It is so good. Other people with me who order something else are always sorry when I give them a bite of mine."], ["Alex M.", "Great food and proximity to SCC's downtown campus. Very quick service and always clean."], ["Liz G.", "Writing this as a frequent traveler living in Chicago, just to add some perspective.Let's keep in mind that 3 stars means A-OK and Sultan's Kite is very good, just maybe not 5 stars top of the Lincoln rankings good. Although I haven't tried too many places yet...  I had a gyro pita topped with the taziki and the spicy chutney- in hind site I should have only gotten one. The gyro meat was very flavorful and piled on as was the sauce and toppings. Thinking back I must not have gotten the chutney because there was no spice to the pita, if it was on there then we need to talk about spice levels. I also got some baklava which was really good, super flakey and just the right amount of sweet.I would recommend this place if you want some quality food in the area for the great prices, quality and amount of food you get."], ["KR H.", "Lunch gyro...Mediterranean choices.Get it like you want it...bowl, in a pita, salad, etc.It's always hot fresh and high qualityLine moves fastBaklava is ok, but I've had better... Everything else you can't go wrong on."], ["Curt S.", "Saw all of the great reviews on here so I talked my family into trying it out.  My two boys (11 & 14) were not thrilled about going but quickly changed their minds when they were able to try samples of the Chicken Shawarma and Gyro meat.  Now they are already asking about when we can go back!The restaurant is clean, the staff is friendly and the food is GREAT.  Don't worry boys, we are definitely going back!"], ["Jan M.", "Road trip from Minnesota to California, looking for lunch in Lincoln. Found this great little place on Yelp. Easy to find off I80. Good food, good prices. Worth the trip off the freeway! Thanks for the great lunch!"], ["Kelly G.", "Delicious! Their chicken shwarma is packed with flavor and the chicken itself is so tender and perfectly seasoned. The veggies were a little wilted when we went there for dinner, but aside from that the portions are huge, the flavors amazing and the price is great. Go there!"], ["Nick H.", "I went in before my friends to go to the bathroom before getting in line, but the guy at the end of the line said \"there was nothing for me back there.\" When I came back with my friends the guy said \"Oh now are you gonna be pissed?\" Which is completely unprofessional and ridiculous. If your service isn't fast, why should I have to wait in line before I have to pee? Awful service and there are plenty of places nearby that are not so ridiculous."]], "Amsterdam Falafel & Kabob": [["Nathanael E.", "Yes, you are indeed an attractive man Mr. Amsterdam.The food is also fantastic. I've long fantasized of an Amsterdam Falafel in falafel deprived Lincoln, now my dream is a reality, except for the nightmare that is parking in the Haymarket.I haven't tried the Chicken yet, but I love the beef and the falafel. I think lamb would be a very welcome addition, but I can't complain about this too much.PROS:1) The atmosphere is quaint, but adequate. I like sitting on the patio or at the bar facing the street. It is an excellent point from which to observe the many species of hipster pedestrians that frequent the area and to critique their waxed mustachery and neck beards.2) The Lincoln location is spatially superior to Dundee in that patrons are able to enjoy their food without becoming intimately acquainted with the hygienic habits of their fellow patrons. Yes, some patrons smell better than others, this is a reality in the realm of hipster food, I accept this.3) The music isn't all rockabilly, indie, my favorite-obscure-band-is-better-than-your-passe-mainstream-band, but mostly it is. Thankfully, I have yet to hear them play techno or anything else that might induce awkward Roxbury-like neck seizures. I consider this a public service and am forever grateful.4) The hours are fantastic, especially if you have glaucoma and a penchant for mass quantities of savory finger food at 2 AM, I won't judge and neither will that oh so sexy Mr. Amsterdam.5) The Moroccan soup is very good, albeit different from my original expectation of a Grateful Bread-esque Moroccan Tomato soup. There are no scones involved with Amsterdam cuisine, so it is a bit unfair of me to compare them to Lincoln's premier institution of homemade soup, patchouli and kitschiness. Unlike GB, they do accept Visa/Mastercard...bonus.CONS:1) The feta fries are a genuine threat to my BMI, if it wasn't for these fries, I would no doubt be as svelte and attractive as Mr. Amsterdam himself. Alas, I can only allay my endomorphic angst by stuffing my rotund face with massive quantities of curry feta cheese and golden, crispy french fries.2) I have been known to wear suspenders in public and am occasionally mistaken by college students as an employee of Amsterdam Falafel. This doesn't bother me much, but really Mr. Amsterdam, I would greatly appreciate an official Amsterdam Falafel t-shirt to complement my pant-suspension proclivities and also that I might better fulfill my role as falafel evangelist.SUMMARY:With or without a complimentary t-shirt, I will go out into the world and spread the falafel gospel. This disclosure does weaken my negotiating position with the smokin' hot Mr. Amsterdam, but it is a chance I am willing to take, for the falafels that I love so dearly.Amen"], ["Carmen B.", "Bennett--F_CK the haters, you're a great guy. Not too hard on the eyes neither... Taking away one star for no cheeseburgers, but adding one back for the beer."], ["Ryan F.", "What a falafel! I was in Lincoln yesterday to play at Vega with my band which is currently on tour, and my drummer and I strolled over to grab some grub. What we got was the spicy felafel over mixed greens, with some combination of garlic and red spicy sauce (recommended pairing), and additionally we each got a tallboy PBR and shared a side of hummus/pita/veggies to dip. Everything was really great, to say the least.. The felafel themselves were indeed spicy, which I demand when seeking something with a kick; some things are just not as spicy as advertised. The veggies and greens and pickled stuff were working well with them too, and it ultimately felt like eating a salad with some new flair added. If you come through here and you like felafel do yourself a favor and grab some of this mouthwatering goodness. Don't let the super-new and chain-y vibe throw you: the food is really good. I heard the kabob was something special too.."], ["Jim S.", "After I asked them tocheck with the Health Dept, they did and have reversed their policy.  Dogs are now allowed in the outside patio."], ["Regan K.", "Dave G is the greatest! Excellent service and delicious food. Also, it's open super late so you can satisfy your cravings at any hour."], ["Solomon H.", "Nice location in the Haymarket district.  When you walk in there you are looking at the order taker with on menu over head.  I order Kabob- beef with the hummus, chick peas & curly fries-spicy.  The food is prepared nicely on plate & I ordered some chicken kabob added on my meal.  The kabob was a bit dry but the rest is good."], ["Rumil B.", "Loooooove it. Came here accidentally (they're open til 3am). Staff was super friendly and helpful, the place is small but clean, and the food is delicious!1. You HAVE to get curry fries. Better yet, the feta fries. 2. You HAVE to get it spicy. 3. You HAVE to get extra sauce. Just writing this review makes me hungry for more."], ["Gary R.", "The falafel was everything it was supposed to be although a little dry for my liking.The kabob salad I would never recommend, the gyro meat was dried out to the point that the texture was like beef jerky/potato chips.I going to conclude they were just having an off day but it will be a while until I decide to take a date there again."], ["Adrian B.", "A tough one to review really.  After being a devoted fan of the original location in Omaha it was always going to be tough to top the only real donner kebab house in Nebraska.  Sadly they copped out with serving the kebab with lamb and went for beef.  The sauces were excellent, the topping were fresh and plentiful and the curry french fries were outstanding.  The decor is the typical minimalist industrial motive which is popular right now, the chairs were a bit spartan and hard.  Really reminded me of a Chipolte.  The service was polite and efficient and friendly.  When they asked me how I like the experience I said it was great but a disappointment they did not make real Donners which are served with lamb.  I've eaten them in England, Spain, France and even Canada.  The gentleman obviously did not want to hear that and immediately walked away without a response.  The only other major gripe was the dried out chicken cutlets they used for their Chicken Kebob.  You should have real chicken on a spit simmering for hours bursting with juice when sliced thinly as all kebob houses I've been to in the world have.  Not this dried out excuse for chicken.I will be back and have recommend the restaurant to friends.  I'm sure it will do well and is a breath of fresh air for Lincoln."], ["Janet L.", "Tasty and a good price! If you have dietary restrictions, there are plenty of vegetarian, vegan and gluten free options. I ordered the falafel plate. Falafel patties are large, crispy on the outside and warm and soft inside. The \"herb\" sauce is what I think if a traditional yogurt/dill type sauce - yummy. They have a different take on tabbouleh. The tabbouleh seems to be almost all bulgar wheat. There's a yummy chickpea salad, and the hummus is good (hidden under the falafel patties). Lots of nice outdoor seating."], ["Fazle H.", "They have another place in Omaha that is a bit more humble than this.  Went in on Saturday for lunch and today.  The food is good and at a very reasonable price. The hummus plate is pretty good but my favorite is the kabob sandwich.  It's of a generous portion and just one is very filing.  The place is very clean and great for lunch"], ["Jill V.", "We were excited to try Amsterdam for the first time last week. We ordered our food as take-out so we could watch the game at the Railyard. We ordered two kids' meals and two adult plates. Unfortunately, they gave us the salad instead of the hummus we ordered. The curry fries (in the kids' meals) were quite tasty and spicy. The beef kabob meat was also quite tender and flavorful. The chickpea salad was pretty bland and the falafel was dry. It definitely needed the hummus to help. The kids were also disappointed that the kabob meat didn't actually come on a skewer. The food overall was pretty messy to be considered street food - it wasn't as though you could walk around and eat this without spilling."], ["M R.", "Awesome kebab and the price seemed to be quite reasonable. I must say they have a good chef must be originally from Egypt and the food was quite authentic."], ["Aaron A.", "I stopped onto this place on a lunch time whim... will definitely try to go back! Curry fries were really good and the beef kabob sandwich i had was awesome also. Really want to take the vegitarian girlfriend in so she can be the ultimate judge on their menu. But i feel like this place is a good go-between for both of us, as far as the menu is concerned... i recommended a try of this place at the very least"], ["Beau B.", "Food was good but....Gyro was $8 so I expected a loaded sandwich... nopeSmaller than the one in OmahaWay less meat(They actually weigh it out)Gyro meat was also inconsistently cooked, dry in some placesLove this place in Omaha, sad it's a bit different in Lincoln, but it's still good food."], ["Elmo J.", "Great little doner kebab place!  They even have curry fries with the little forks - just like in Europe!  Prices are okay, a tad high but the food is good, place is clean & they have outdoor seating."], ["Sean T.", "THE GIST: There's a lot of falafel-based competition in Lincoln, but this place definitely has the goods to go head-to-head with most of the established joints. I had the spicy falafel sandwich with fries, my partner had the regular falafel sandwich with fries, and we were both more than satisfied. Will be returning soon! THE GOOD:*Curry fries were to die for; definitely the highlight of the plate.*Both the falafel and the spicy falafel were delicious, slightly moist, with a touch of nuttiness: exactly what you want in a falafel! The pickled cabbage in the sandwich is a nice traditional touch that adds a burst of flavor as well.*The grilled pita is a nice touch -- not only does it add a slight crunch to the texture, but it helps prevent the sogginess that can sometimes plague an otherwise great falafel sandwich on fresh pita.*The hummus and spicy green sauce were both excellent dressing choices.*Menu is simple and clearly laid out, identifying veg-friendly options clearly.*Portions were more than generous, especially at this price point.*Quick, friendly service.THE NOT-SO-GOOD:*The spicy red sauce was a bit flat -- it had plenty of heat, but not much else going on. Just to be clear, it wasn't \"too hot\" in the sense of being overwhelming or unpleasant (I'd say it was just a bit spicier than standard sriracha or the like), but it wasn't a very well-rounded flavor. Ideally, you want some of the pungency and complexity of the peppers to come through with a bite of vinegar and/or garlic, but this didn't have much at play outside of the capsaicin.*There isn't a ton of seating available. It was fine during our visit, as there were several empty tables, but I can imagine they'll fill up quickly if this place gets more popular, especially during football games and the like. (OTOH, complaining about crowds on gameday in Lincoln is like complaining about snow and ice at the North Pole.)*Beer wasn't available yet, but this is supposed to be remedied by Monday.THE UGLY:*Nothing to report at this time!"], ["Christa C.", "I love this place. The food is always good and decently priced. The curry fries in particular are amazing. While there is only a few menu items they have a lot of add ins so you can make a unique meal every time. There isn't a lot of seating though so it can get a little busy. Definitely a place I recommend!"], ["J C.", "Nice alternative to quick burgers and tacos.  Stopped by here before a baseball game.  Really good sandwich.  Reasonably priced.  Curry fries are genius.  have been seasoning with curry when making fries at home since."], ["Drake C.", "Nice clean place. Really good food. The service was also really friendly. It was just a little slow during lunch service."]], "George's Gyros Gourmet Grill": [], "Falafel King": [], "Domino's Pizza": [["James S.", "I like this dominos they always do good. My food always gets here pretty quick and it taste good. So for fast food pizza its great. The customer service is good as well"], ["Don M.", "I am not a HUGE fan of Domino's.  I am a huge fan of how cheap they are.  A medium 2 topping pizza for $6?  That's cheaper than some frozen pizzas.  They taste better now too since they reformulated their pizza.  Good crusts.   It is a good cheap option when no one wants to cook and we don't want to spend a fortune.My complaint, and the reason for the low rating, is based upon my customer service experience the last two times I have ordered.   Something has changed here and I think it is time for me to spend more money for better service.Last time I ordered I ordered early in the afternoon with a delivery time of 5:30.  It was after 6:00 when the pizza was delivered.  Why have the option of selecting a delivery time if they are going to blow you off?Tonight, I ordered a pizza and was watching the online \"tracker.\"   After it was done baking, it sat for over 15 minutes in the \"quality check phase.  Then once it was updated to show \"out for delivery\" it took nearly 30 minutes.  That means my pizza was sitting in a heat bag for nearly 45 minutes.  The pizza arrived warm, mushy, and below average.So, I think I am going to take a break for a while from Domino's.  I think it is time to explore some of the local establishments, pay more, and get a superior pizza and certainly superior service."], ["Christoph S.", "I was an idiot and placed four orders. Then I cancelled three of them after they'd made them all. They were very nice about all of this. Good on you guys, I would've flipped out."], ["Andy H.", "Gave this place 6 orders on 6 different occasions. Sometimes over lunch, sometimes over dinner. Always burnt, clean the oven maybe?? They either forget or refuse to add extra meat or cheese when asked but always charge for it with promises to credit the account next time. They've never remembered dipping sauce and the place is generally a dump. It's a franchise, how hard can it be? The 48th and Leighton shop is worth the drive. Way better."]], "Daffodil Mediterranean Cuisine and Catering": [["Chad B.", "Was blown away by the hospitality of this restaurant. Food was spectacular home made. This has been the best meal I've had in Lincoln since I got here. Other places were good but this one stood out as great. If I come back to Lincoln I will definitely be back."], ["Marc B.", "The food here is incredible.  I actually overheard a woman after a sample of eggplant parmesan say 'that was so good, I want to cry'.If you are anywhere near here, you MUST go.  The food and service is crazy good."], ["Robert F.", "Me and my buddy are visiting from California and the food/service was awesome. The owner gave us a sample of all her food and treated us like guests in her home. The food was AMAZING and we would become regulars if we lived here. If you want to take your taste buds off the map....stop by here you won't be disappointed."], ["Abigael N.", "Don't let the atmosphere or appearance scare you away. This place has delicious food! As soon as we arrived, the owner gave us samples of all the food they had. The chicken asiago was delicious. The eggplant parmesan was very good as well. The prices were a bit much considering the conditions of the restaurant, but I left happy!"], ["S B.", "Simply amazing! All Lincolnites should try this place. The lady at the counter is simply delightful. Nothing else to say."], ["Oscar t.", "Fantastic. From out of town and found this through yelp. Didn't let me down. Owner let me sample every dish before I picked my order. Food was top notch."], ["Spencer S.", "My wife and I had an incredible experience here. The owner gave us samples of literally EVERYTHING, chatting the whole time. By the time we were ready to order we were almost full.We settled on a gyro plate and a lamb shank. While we waited for the food, we were given complementary saffron tea and baklava, both delicious. When the food came, complete with a tray of saffron rice, it was amazing. All the ingredients are fresh . . . I'm running out of superlatives. My wife put it best: you can just tell when the cook \"gets it.\" The food is not too salty, or too chewy, or too anything. It's just right. They should call the place Goldilocks. For the moment, they don't take credit cards, but the owner assured us they'd be getting a card reader next week. The place is already starting to get a reputation as a place worth going to. With food and service is like this, it won't be long before they're very busy. So get in early while the owner still has time to chat with you and tell you how pretty your wife is."], ["Mark F.", "The food and service are super!  Enjoyed the Chicken Asiago and Baklava for dessert.  Portions are very generous and the owners are very warm and welcoming.  Will be back!"], ["Kerry L.", "This place is awesome. Definitely not a spot to go to if you're looking for a light, cheap meal. The food is homemade with love and the portions are big. I loved the cozy environment and I felt the way you feel when your mom cooks for you. Very cool place to have in Lincoln. They are getting ready to relocate to Farmer's Market. I do wish they offered some healthier, lighter Mediterranean options. I will definitely be back."], ["Kinga W.", "They have the best gyros ever plus a lot of really tasty food. Everyone in our family finds something to love here even our kids."], ["Sarah A.", "Outstanding Persian cuisine, fresh ingredients, hospitable hosts. Some of the best food in Lincoln."], ["Sara W.", "excellent food....my favorite gyro in town.....very personable service....i would eat here every day if i could!"], ["Jason D.", "hands down, the best gyro sandwich I've had. everything the sweet proprietress offered was delicious."], ["Peter W.", "I can't say much about this place that hasn't already been said. The food is wonderful. It is worth going for the baklava alone, but you won't leave disappointed by the lunch-dinner offerings either. The owner is charming and eager to help you leave satisfied. My only complaint is the space itself is rather crowded and there doesn't seem to be much infrastructure to how everything is set up. For instance, it wasn't easy for me to figure out how the pricing of the food worked. Shannon's review seemed very true: I couldn't tell if I was supposed to haggle or not when the owner started listing the price for the meal. It all seemed really loose. This made me feel a bit uncomfortable, but I will come back and see if I feel any better about it having made it through my first experience."], ["Jon S.", "My wife and I love this place. Hands down, you will not find better Persian food in Lincoln. And by Persian, I mean a combination of various Mediterranean dishes. There are gyros, baklava (lots of different kinds), and dishes from all throughout the Mediterranean - not just Greek.The atmosphere is a little bit different, so just be prepared. It's a very small place and you will sit really close to the food, which is laid out much like it would be for a catering event. The owner is very friendly and will let you try anything. She'll also let you mix choices so you end up with a plate of whatever you want. The Pomegranate Chicken is delicious. So is the Walnut Chicken and the meatballs.They also have really good gyros that are prepared in the back. Anything can be carried out, but the gyros are especially quick. It's a homey atmosphere, and the service is a little bit weird, but don't pay attention to that. Just go and enjoy the food. You won't be sorry!"], ["Eric W.", "I can't believe it took me this long to visit the Daffodil!  What an amazing place!  Small?  Yes.  But nothing wrong with that. Minimal \"atmosphere\"?  Yes, but it is like visiting a relative who is an awesome cook!  I don't know about anybody else, but atmosphere is good for a night out. The Daffodil is good for the FOOD!  By the time we sampled everything, we were ready to say we were full!  But, it was SOOO GOOD, we had to soldier on........  I can't say enough about the food.  So, just go there and eat.  If you need atmosphere, get carry out!   What a wonderful addition to the Lincoln food scene!"], ["Brooke L.", "Best food in town. Come hungry and ready to eat. She will give you samples of everything! Try everything that's available and splurge a little."], ["Dennis N.", "Delicious food but fairly expensive and no atmosphere.  We spent $30 on lunch for 2"], ["Karen J.", "My new favorite restaurant.  Casual restaurant with the friendliest staff and home cooking.  Enjoyed the generosity of tasting - so that I had to have a three meet dish which was no problem for the lady.  Will definitely go back!"], ["Greg B.", "VERY friendly service! It's like going into your Persian grandmothers kitchen, if you happened to have a Persian grandmother. She let us taste a few dishes so that we could pick what we wanted to order. It was all incredibly amazing and flavorful!!"], ["Mary P.", "Amazing food. Got to sample everthing before settling on meatballs and rice. Definately going to go back very often."], ["Keely H.", "I haven't written a review in a looooooooong time, but this place is just so great and I love to see local businesses thrive, so I wanted to add another radiant review for Daffodil!  Five stars for the food, five for the service, five for the location, four for the lack of space and the fact they don't yet take plastic.I had a hankering for a gyro and often frequent Gourmet Grill and The Sultan's Kite downtown but after hearing wonderful things about both the food and the owners, I wanted to give this place a try.  Tucked away about two doors down from Fortune Palace on 56th and Old Cheney is this teeny little restaurant.  There are only about five tables inside so I wouldn't say it's all that great for groups, but they do offer to-go orders and catering for larger parties.  I saw only the woman up front and a young man back in the kitchen so if you have a larger order it can take a bit of time, but put on your patience pants because the food is worth it.  Also remember to bring plenty of cash, because they don't yet take credit cards or checks.I ordered a couple of gyros, the pomegranate walnut chicken and rice and some baklava to go.  She boxed up each individually (save the baklava, which I told her she could just stuff in one box because they were all headed to the same place; my stomach) and when she had to use some force to close the box over the gyros (they're LARGE) she wore gloves, which I appreciated.  The service and cleanliness is excellent, but what really puts Daffodil over the top is the taste of the food.  HOLY MOLY the gyros were good, chock-full of flavorful meat, tomatoes, red onion, lettuce, feta (at no extra charge!), jalapenos, green olives and pickles and topped with a delicious tzatziki sauce.  The pomegranate walnut chicken is shredded chicken swimming in a sweet, nutty sauce served with rice and it's the perfect combo of sweet and savory.  The baklava.....well, just go get it.  Go get the pistachio baklava.Daffodil may be tiny but the food is awesome and the couple that runs it seem to be some of the nicest individuals you will meet in the food service industry.  They really have a passion for people and sharing their delicious creations with everyone, and as cliche as it sounds, they truly make you feel like you're a guest in their home for dinner."], ["Justin D.", "Absolutely amazing. Tried this place for the first time. I had the gyro and it was fantastic. Will be going back"], ["Nahid M.", "I found this place while I was visiting Lincoln. Owners are very friendly and she lets you sample literally everything. Food is amazing."], ["Chuck F.", "This little restaurant is such fun. The owner is so enthusiastic she insists you sample everything before you order. You could eat your fill without buying anything. I love the meatballs and baklava. It's great for takeout."], ["Jason S.", "I'm always looking for new places to eat in Lincoln.  I'm also on that lifelong quest to find the best foods I can possibly experience.  I need to say that Daffodil is most definitely my new favorite, not just in Lincoln, but overall.I stopped in on a whim, directed to the door by  the \"Gourmet Gyros\" yard sign.  Glad I did.  This place has the best Gyro I have had, easily the best in Lincoln, but that's not what makes this place incredible.  It all starts with the owner, a beautiful souled Persian lady who I remembered from her stand at the Old Cheney Markets in the summer.  She is usually serving baklava (just one more item made of awesome from her hands).  These pastries were displayed on the counter at her restaurant and I figured it was the same person.While I waited for my Gyros, she gave me samples of the foods she had out, like a previous reviewer (Spencer S.) she gave me baklava, saffron tea, saffron rice, meatballs, eggplant, masala... each bite went straight to my heart.  I couldn't believe how delicious these were.  It made me wish I didn't get the Gyro.  We talked about her restaurant and her foods.  They had lamb shanks left over from Valentines Day that looked and smelled so good, she said they had sold out of her fish dish the night before, the menu is set but she has specialities that pop up from time to time too.  It was clear this wasn't just a place I would return, but a place I wanted to tell all my friends about.  So that's why I'm here, people need to try this place.  It's a true gem.Enjoy!  :)J"], ["Brandon B.", "We went to Daffodil catering and take out today for lunch. It has now moved from a soft open to an official open, and the menu has grown accordingly. We had chicken curry and a beef and bean curry, both with saffron rice, and a spinach pie. Wow, wow, wow. So delicious. And very filling. It is such a treat to have a great Persian place here in Lincoln. The only complaint is that you should expect to be here for a while. Even though all of the food is already prepared, the owner will chat with you during your entire meal. It feels a little like you have been invited into her living room. This isn't bad, but lacks formality. You still get tea and baklava before your meal for free, and still have to ask for water. But the quality of the food more than makes up for these minor inconveniences. We will return often."]], "Ali Baba Gyros": [["Rob J.", "One of the best gyros I've ever had. Great prices. Good atmosphere. I love hole in the wall places like this."], ["E G.", "Great gyros. some say it's a bit overpriced but you get a lot of food. So you basically get what you pay for. :) The man who helped us (I'm guessing is the owner) is super friendly. :)"], ["Avinash P.", "Awesome food and great atmosphere. A must try!"], ["Luke I.", "Sorry. Not a fan.  I ordered the falafel and wanted to substitute hummus for the white dairy sauce.  This was not acceptable to the owner, and I had to pay an extra 5.99 for a side of hummus.  The veggies were pale and old.I'll try the other gyro place down the street.  No problem!"], ["Danielle H.", "Hole in the wall right near campus, open late and serves the best gyros! Big portion sizes! Friendly service, highly recommend."], ["Derek S.", "The best place for a gyro or chicken kabob in town! The Z- plate is the greatest thing I have ever eaten anywhere. The staff is friendly and they are open late. Don't be fooled by the other ripoff place in town, this is the real deal!"], ["Zac T.", "Friendly employees, great food, cozy and nostalgic dining area. If you grew up in Lincoln, maybe just went to college there, I'm sure this place is familiar. Everything on the menu is very good, definitely get a gyro if you can't decide what to eat!"], ["Arnold F.", "The gyros are yummy. The place gives off a quint family run atmosphere. Great care goes into each dish. Good food, good people. I would eat here again for sure."], ["Jon A.", "I have certainly had much better gyros before. It was just very average and not worth my 8 dollars again. The Tzatziki sauce was sub par to say the least."], ["Solomon H.", "Always good gyros to have for anytime of the day!  Portion is adequate for the money & the steak fries are good compliment !"], ["Kim R.", "Been going to Ali baba's for a decade and a half....it's amazing ...every damn time! !!!! Best steak fries EVER!!!"], ["Teddy W.", "Best gyro in town. Little pricey and you definitely gotta ask em to make it good or they will skimp. Awesome after the bars, or even just a switch it up dinner."], ["KR H.", "Reasonable PricesFast serviceGreat quality food and lots of choicesNever had anything I didn't really enjoy.Serving size is generous.This place is a lunch treasure.Better than your average gyro place for sure."], ["Lilah R.", "I have been an Ali baba's fan since I was in high school and extremely picky on what I would even try.  Now any time I can find an excuse to get to downtown it's a sure bet I'm stopping at Ali baba's.  The gyros are massive.  If you're looking for something light to snack on I would try something else.  The gyros are cheap and are more than enough for you to pick at for the day.  The service is always great.  Don't expect anything fancy decor-wise but if you are enjoying the night life down town and are looking for something to end the night, Ali baba's gyros are the way to go."], ["Lisa S.", "Food was delicious, good service, will be back soon to get my favorite Greek food in Lincoln."], ["Janet L.", "I love the gyros and steak fries here! By far, the best gyros in town, and the steak fries are fantastic"], ["Alek Z.", "Pretty decent for Americanized Greek food. In fact, they're more deserving of like a 3.5 star rating.I'm on a crusade to try out all the Mediterranean joints in town, so I stopped in here earlier today for lunch. Their menu seemed to have quite a few options, but whenever I try someplace new I always order the standard: gyro and baklava. I was feeling especially hungry so I got the plate with everything on it. I was pleasantly surprised by the succulency (new favorite word) of the meat, that part was good. The sauce was good as well, but there was something a little off about it. Either this was some kind of ranch dressing or it was a style of tzatziki that I'm unfamiliar with. It was pretty tasty, if not possibly somewhat unauthentic. The baklava was also pretty good, so extra points for that. The whole shebang plus drink came out to like $10.39, which seems about average. Overall, I've got no real complaints. A pretty standard but satisfactory joint."], ["Sarah P.", "I love the Z plate. Fills me up every time."], ["Don M.", "We have several places in town to buy greek frood.  Some are fancier, some are stranger, but for a simple gyro sandwich, there is no better place in Lincoln to go.  Large portions of meat and generous sauce is what sets this gyro apart from any place else in Lincoln.   It may not look fancy, but taste is the determining factor isn't it."], ["Ibrahim A.", "Good restaurant and deserve 4 stares.Please try it and you will love it."]], "Quiznos": [], "Sinbad's Restaurant": [], "Gourmet Grill": [], "Old Chicago": [["Jodi G.", "My friends and I were happy to find the restaurant open on the 4th of July!. We enjoyed Bloody Mary's and pizza. Service was okay as they were busy on a Holiday weekend."], ["Tina K.", "I wanted to write great food.  Greay atmosphere. Great service when i first drcided to vidit olf chicsgo.  It did not happen.The waiting area is borrible.  People tripping over themselves.  If you have a kid or two prepared to keep them from getting teampled.  Get a few benches or seats...you know you get busy.Holy coq....the $5 kid pizza is exactly the same pizza as the adult $12 pizza.  RIP OFF!!!!  I ordered a small and GOT THE SAME SIZE AS A KID.  2.5 times the price for the 3xact same size as a kids pixza.  Wow.The first bill come with marked one pizza free....it was never adjusted to reflect.  Second error that is in favor of tbem.  I ask to get the bill adjusted to reflect manager writing.Here comes desert.  I order the ice cream cookie Sunday off the kid menu for my three year old and a 9 inches desert for my wife and I.  The kids one comes with 1 scoop of ice cream and the adult arrives with one scoop a hot pan and no playes.  We use a napkin to eat the desert.The desert bill comes and the kid is chatted an adult price PLUS a scoop of ice cream  What was supposed to be 1.59 desert turns into almost $5. Mess up after mess up after mess up.Make an adult small bigger than the kid pizza if you are g oing to charge $12.Get the waiting area fixed.Bring playes with a hot pan...using napkin to eat was no fun.Bring two s oops of ice cream with the large adult desert.If you differentiate between the kids meal and adult at least make the servings a noticeable difference in size.For those of you who do not have kids you would not see you are paying for a kids meal.  For those who have kids...you will see what I am talking aboutNot going back.  I hope this prompts some changes.  I doubt it but I can at least hope."], ["Jeff K.", "Four of us stopped here for lunch on a Sunday. It wasn't too busy so we thought we could get in and out quickly. That wasn't the case. After being seated we waited ten minutes until the waiter took our drink order. Then another ten minutes until he took our food order. Then add another twenty five minutes before our food arrived.With all that I had to run down the waiter to get our check. And he filled my beverage as I was paying the bill. The only saving grace was that the food was excellent. See the photos. However, for a chain resturant they should have the service part down. If you have plenty of time to waste then go. The food is really good. But the overall experience was not. I will go back but not too soon."], ["Erik Y.", "Great Bar/Restaurant.  Old Chicago has a great location in South Pointe Mall, and has some decent food.  Lots of great drink specials and happy hour options.  They do appatizers very well like the trio, Sicilian Pepperoni Rolls, and Italian Nachos.  The food is also decent but I have found the calzones to be a bit too greasy for my liking.  The burgers are classic bar food, as are the wings.  The beer selection is fantastic, tons of stuff on tap.  They have a beer tour you can sign up for, and they have great happy hour specials you should try out."], ["Fazle H.", "I really like the game day specials they have. the 2 for $8 or 3 for $11, its every dya theres a pro football game on. the portions are very filling. i usually get teh 3 for $11 and im always full before i get to me 3rd option. for a chain restaurant they offer very good in a warm atmosphere. its almost the kind of place i would come to with  my FAC. The food and dirnk options are plentiful. The wings are actually very good, and i really like the buffalo chicken pizza."], ["Jeffrey D.", "Good food and lots of beer on tap.  We had the trio appetizer and it was great, though a lot of food for an appetizer.  Also the 8\" meats pizza.  There are many other menu options.  Overall the service was good and the prices fair."], ["Mark J.", "Love the tour and all the beer on tap.  Also love their pizza.  Great to munch on with friends.  Perfect location in Southpointe."], ["John M.", "Never ate at an Old Chicago before so was meeting a date here just to see. Was disappointed with our waitress as she brought me a refill on my water without being asked but then ignored my date needing a refill (had to get the hostess to get it). Had cheddar burger and it really didn't have much of a taste to it. Waitress then didn't bring $0.21 of change back, so she didn't get a tip. Maybe I should have ordered pizza."], ["Dan W.", "It's not often I give such a poor rating for a bar that offers such great beers, but after last night I feel as if I must.I was on a freelance job all day and went to Old Chicago Saturday night at around 5:15 to satisfy my craving for a pint. Side note: I just moved to Lincoln from the east coast and heard good things from my landlord....1. I walked in and awkwardly stood in the waiting area as the hostess frantically made notes on her notepad. A male worker then came over and grabbed the family waiting next to me to show them their seats...um...still no one said anything to me after they left and I was the only one there. So feeling a bit out of place I slid over to the bar and bypassed the hostess.2. The bartenders were frantically running around and never said anything for about 5 minutes when the female bartender asked for my order. I ordered an Ayinger Oktoberfest bc it looked just kingly sitting there on its throne amongst all his other glorious companions. Note: she didn't ask what size I wanted & if I had ever been there before (I hadn't)3. The beer looked handsome, tasted succulent, and satiated my aching soul...but when the bill came it was 7.99! 9 bucks for a freaking tiny glass (I only tipped a dollar and trust me, I'm usually a generous tipper so that was rare). I'm not sure how difficult it is to import Ayinger, but on the east coast, I could get the same size for $5 easy.4. The only interactions were asking if I wanted anotherOverpriced beers and the service was nothing to write home about. The only reason I give it two stars is due to their decent selection. Ugh...that was disappointing."], ["Sarah L.", "Sit at the bar, ask for Sybil- best service and she is full of menu & beverage knowledge!"], ["Elaine G.", "We were there for lunch. Many empty tables, but they tried to seat us a a table between two families with small children and there were strollers and diaper bags everywhere. I ordered the spinach chicken avocado salad and after digging through the salad I discovered there was no chicken in it. After waiting they finally brought me a small dish of cold chicken. Not our best experience there."], ["Jodi F.", "The food and beverages are always good. They often run out of the seasonal beers and had done that tonight as well. It tool over 15 minutes after being seated to get a drink, and it was after 9 pm and the place was less than half full. Again, the food is always good and the prices are more than reasonable. I recommend sitting in the bar area for better service."], ["Aaron T.", "First time going to this place. My wife said he had been here before with her family. Great beer selection. Food came out in good time. I'd give it a 4 star because our calzones did taste good, but, they just were not hot inside. They were warm as if they cooked it just enough to be finished, but not long enough to cook everything inside and get it nice and hot. I will give the place another shot if I'm ever in that area. Maybe it was just the wrong day?"], ["Derek S.", "my wife and I love this place.  we often visit for good food and drinks.  the staff is always friend, but can be slow at times when they get really busy.  the beer mini-tours are always a lot of fun.  this place is great for sports games and happy hour.happy hour includes half-price appetizers and cheaper drinks.  you cant beat their full size apps for the price.  the italian nachos and pepperoni rolls are both absolutely delicious and amazing and I am eat them weekly.  the pizza is average, but they have the best meatball pizza in town.  the strombolis and calzones are actually better than the pizza and completely filled with toppings of your choice.  the chicago beef  and classic italian sandwiches are out of this world.overall, a great environment for sports games, happy hour and a place to hang out with friends and famiy."], ["Jason S.", "I used to live in Lincoln and now miss Old Chicago.  Whenever I visit, I make sure to go back and get my craving out the way.  My favorite pizza is the Double Deckeronni.  They have a great selection of beers and I try to get different ones each time.  Italian Nachos are always delicious as well."], ["Charles H.", "You know when there are at least 10 places in town to get better pizza it might be time to hang your hat on your calzones instead.  The food is below average, it's on par with Applebee's. The only appeal is the bar and the broad selection of beer available. The appeal to this location is if you are waiting for others shopping or for a movie to start next door. This is part of a mall for those from out of town, and parking is in a huge lot facing the front of the restaurant. There is a beer garden/patio area available for outdoor seating."], ["Jules T.", "I have to say I prefer the downtown location, but this one is just as nice. A huge selection of beer, tvs, pool tables. Good service and outdoor dining during the right season. The food is basic and what you come to expect from a chain. Great for large groups."], ["Steven L.", "Much noisier than the downtown location. The building itself isn't as cool to me as downtown either. However, my service on this particular day was pretty good & the Chicago seven calzone was good."], ["Suttie S.", "Have been to Chicago and have eaten at what they call the best pizza in the world. But I think I can go to Old Chicago at South Pointe and get something a lot better.  Beth our server was on top of her game like no other and the pizza was the best. I love their beer selection as well and never leave this joint without a full stomach and a good buzz. Thank you for another great meal and evening with great service and food."], ["Kirk A.", "The only reason I keep going back for the very wide selection of beer. It's great if you are into a noisy environment with servers who care more about flirting with the bartender than getting you taken care of."]], "Olive Garden Italian Restaurant": [["Nathan G.", "My wife and I ate at the Olive Garden by Gateway Mall in Lincoln Nebraska last night. They have a lot of new dishes on the menu. The food was delicious. The server was prompt and friendly. The restaurant was very clean."], ["Niccole M.", "I mean its commercialized Italian food. I got the Bruschetta Caprese, which could have used some flavor to compliment the tomato's, along the the Long Island Limoncello made for a nice snack. The service was a bit slow and our server had us check out using some electronic thing. I did not care for that, it took longer to get it to work right than it would have for him to just of ran our credit cards."], ["Bev T.", "Olive Garden is a chain restaurant that provides consistently good quality food. This particular Olive Garden is in a good location. Easy to get in and out of. During busier times, it can be difficult finding a parking space near the restaurant in the lot. The restaurant is clean and well maintained. The staff is friendly and helpful. Service is usually fast. I love the all you can eat soup and salad. If I am not sure where to go eat, this is my go to place, because I can always find something that will appeal to me."], ["LuiSa H.", "This was the WORST service I've ever received in a normal situation we would have just left but we were traveling and hungry. It took 10 minutes to get service and the only came when another waitress came by and asked how we were.then 2 minutes later our waiter popped up. My husband ordered his food and got the wrong thing and getting a second basket of bread was like pulling teeth we asked 3 times but each time he came to our table he had completely forgot or at least acting like he did. We weren't told about the specials so we couldn't save 5$ no big deal but it would have been nice to know before the kind hostess told us halfway through our meal. I will say that the food was delicious as always!"], ["Genevieve W.", "This is one of my oh to places when I lived in Lincoln and when I come to visit to go out with my friends. Service is friendly and super helpful. Even when my God-daughter had a 4-alarm melt down in the middle of lunch. They helped us get out of there as quick as possible because she would not settle down while teething. They are also great to make recommendations ! Resturaunt is always clean. Food is always good and prices are reasonable!! I love the soup, salad, and breadsticks special! I love Olive Garden and will be back again in the near future!"], ["Veronica H.", "We went to Olive Garden for an early dinner/ birthday celebration hoping to have great service and great food. This is Not What Happened.First off; we were passed off to another server because our server wanted to leave early. Second my coffee up has pasta sauce stuck Inside of it! Third: when my salad arrived our  new server tried to pick the old food off the plate, discovering that it would Not come off she sighed rolled her eyes, and said she would bring another plate. Like I should just accept the one with the old food she picked off! Fourth: My husband order Steak with Mashed potatoes, the potatoes were cold, hard, and obviously old! Disappointing Birthday Meal."], ["Charlie W.", "Good italian food. Not the best Italian food in town, but its the best chain. They have a huge menu with anything italian that you could ever want. The salad and breadsticks are complimentary and unlimited and are both delicious. It's very easy to fill up before your massive entre gets there, but who's gonna complain about that? Pretty cheap for the amount fo food you get.  I leave stuffed with a box of leftovers every time. My favorite is the 5 Cheese Ziti Al Forno - baked cheesy goodness. They also have good drinks, but as with any chain restaurant, they're overpriced. Oh, and get the freshly shredded cheese that they bring around over everything."], ["Jeremy B.", "Food was great. Salad awesome. Service lacked usual level that we have come to expect. It was just ok"], ["Lacy D.", "My meal was great, but the biggest reason I'm writing this review is because our server was probably the best I've had in a long time. He could teach a customer service class. Incredibly attentive and quick even though he was very busy. Good customer service is hard to come by, great customer service is rare, but tonight, we experienced wonderful customer service. Kudos!"], ["Jennifer W.", "Service so far has been great. However, my plate came out with a hair right on top. Yuck. I am still waiting for the replacement ...  and still waiting for the drink I ordered 8 minutes ago.  This Olive Garden used to be great, but in the last six months or so the quality has really gone down.The wait has been so long that my husband is finished with his meal.Update : the manager just came out with my food and said it was not his fault. Hello? You're the manager. Take some accountability for what's coming out of your kitchen."], ["Caden Z.", "Olive Garden is a very well-kept restaurant and has a great atmosphere. The night I ate here it was extremely busy, every table was seated and there were people waiting at the reception area. Me and my girlfriend got a table for two in a more sectioned off part of the restaurant which was nice as it was at least a bit quieter. The food, while a bit expensive for how much you get, was well made and put together. I would eat here again, especially since I'm a big pasta fan.Hopefully it won't be quite so busy next time, however. :P"], ["River H.", "We visited Olive Garden on a Saturday night. We just wanted soup and salad, plut one small plate and one appetizer. Adding 2 glasses of wine our bill was up to $50. The food is good in my opinion. Typical restaurant food, very flavorful but not complicated. Our server was Cody, who is very good at his job. He was friendly and even checked in with us to see if we need anything after we paid and was just hanging out to finish the wine. I would definitely ask for him again."], ["Randy P.", "Never ending pasta bowl, how about the true promotion from this pit of disease the \"Never Ending Trips to the Toilet Bowl with Explosive Diarrhea!\"  Great place for immediate weight-loss and intestinal distress; if you're into that sort of thing.  Much better establishments in Lincoln that serve quality Italian food.  Your money would be better spent in the frozen foods aisle of Super Saver; they have a lovely selection of Bertolli frozen pasta selections to choose from that are of much higher quality than Olive Garden aka. \"Palazzo Diarrea.\""], ["Jules T.", "Its like any other massed produced chain restaurant. That being said, my mom loves the overly salted, buttery bread stick s and I can't get enough of their soup and salad."], ["Brian M.", "Perfect food.Perfect service. I can't really say too much more about the OG that any other diner won't already know."], ["Megan C.", "Amazing service and great tasting food. The manager is accommodating to food allergies and needs. Xanadu was an amazing server. Best service I've had at an Olive Garden."], ["Laura K.", "Good food at this OG in Lincoln. Loved the lunch specials and the flavors were there. Panini's came out hot and of course the salad is always great. The lunch portions were just enough to continue on with the day ahead. Service was great also."], ["Ryan C.", "Its the Olive Garden what do you expect? Only the greatest casual Italian dining experience this side of the Mississippi. Kidding, no but seriously its amazing! 2 words: stuffed mushrooms."], ["Kerry L.", "Always great service at this location, the food is typically good. The restaurant is always clean. Prices are high for amount of food."], ["Abby G.", "Was dragged here again by the boyfriend 2 weeks ago.....same crap. We were given hard breadsticks twice, the portion sizes have shrunk yet again, the new entrees are no better than the old ones, but the service was great. At least they know how to train their wait staff.....would be nice if they had decent food though since it is a restaurant and all."], ["monica b.", "We ate there sept 25 for a late lunch.  the place was packed. it's as good as i expected. i  enjoyed the soup and salad with seconds  of both and my husband had the chicken marsala which was delicious and tender crammed with mushrooms.  a week after this experience we realized that somewhere on our cross country vacation.... we lost our credit card.  we were able to trace the receipts  we kept to the last time we had used it. It was at this olive garden.  we phoned the manager and he mailed it to us that night.  i was incredulous!!! after all the horror stories on the internet about waiters who take your card and return with another card... and  then rack up charges. quite a compliment to the integrity of the people who work at olive garden!"], ["Kuanlim P.", "went there for my birthday. I really like the place and pasta. Nice service."]], "Bruegger's Bagels": [["Kelsey B.", "I work two doors down from here and I would be lying if I said I didn't visit quite often.. I started only going for the coffee in the mornings, but have recently discovered the bagels.  Wow.. They're amazing.  I know Bruggers has been around for awhile, but I never stopped for some reason until the past month.  Now, I'm addicted.  The smoked salmon sandwich and the chipotle turkey sandwich are also wonderful if you're in for lunch.  If my metabolism didn't decide to slow completely down after college, I would be here every day! :)"], ["Deborah D.", "Excellent bagels.  Wait staff was ok.  Not nearly as nice as most people in Lincoln Nebraska not very friendly. My sandwich was ok.  The restaurant was not clean. Dirty tables and dirty floors. I felt as if I was imposing on the girl when I ordered."], ["Don M.", "Solid store.  Good service.  Excellent bagels.  Clean and in a decent location."], ["Lori M.", "Service is too slow at peak morning hours. Need someone to jist run the register. Took me 15 minutes in line for a cream cheese bagel and coffee."], ["Jennifer B.", "I really thought this would be a cool little place to get a good sandwich... Boy, was I wrong. The guy making my sandwich was super rude and actually wiped his nose on his arm while assembling it!!! All I can say is NEVER AGAIN."], ["Beth H.", "Yummy! The turkey chipotle sandwich is delicious! I would recommend getting it on a bagel instead of the regular multigrain bread. It was definitely worth the stop. I didn't try the coffee, so I can not attest to its quality, but several women walked in after me and ordered lattes, so I imagine it is probably pretty good too. An inexpensive, tasty lunch!"], ["Gabby A.", "Bruegger's is the best bagel you're going to find in Nebraska.  Unfortunately, we have a major lack in authentic east coast style bagels and most Nebraskans have become accustomed to the puffed up knock offs they serve at places like Big Apple Bagels.  Bruegger's comes close to what you'll find in NYC or other big cities on the east coast.    An authentic bagel should always have a crackly, crispy exterior and a chewy interior. They do a good job of hitting that standard.  They actually boil their bagels which is the traditional way to cook them, and gives them their unique crackly outside.   They also have very friendly, fast and efficient service."]], "King Kong Restaurant": [["Jacob B.", "Get the gyro! I'll just throw that out there first. The restaurant itself has a burger-joint feel but with a gorilla themed twist that is fun. However, King Kongs has some interesting pieces to their menu including a Philly cheese steak and a gyro.I couldn't resist trying the gyro platter, and I was not disappointed. The platter came with crispy fries, a tasty Greek style salad, and a loaded gyro that tastes great. The price was fair and the service was very fast. The parking lot and drink machine could use a little maintenance but I consider those minor problems.If you are looking for good fast food, I would recommend trying King Kongs."], ["Frosty D.", "Hit the drive thru and got a gyro. Don't eat gyros all that often but know good from bad. This one was very good. Would have picked up a burger, but the price indicated it was probably as big as a pizza.  Maybe next time."], ["Walt G.", "The staff was surly, the food was poor and the prices were way too high. I have no idea why this place gets good reviews. It was awful."], ["Beca H.", "I love the chicken gyro! Thats all I will get with the greek potatoes! Love it! I did however receive and unwanted hair in my potatoes one day. I picked it out and kept eating. You get a lot of food for what you pay in my opinion. It's like 5 pounds of food for 10 bucks."], ["Stephanie V.", "Great Gyros, Huge Burgers... Not sure what The King Kong decor has to do with Greek food but overall good place"], ["Joe T.", "I have not been in one since my college days.  Visiting friends I decided to stop in here for lunch after visiting the zoo.  It brought back memories of my college days.  They still have the different size burgers depending how hungry you are.  Years removed from college, I ordered the regular King Kong combo.  The food is still as good as I remembered it.   A good place for burger that is better than fast food but does not take to long."], ["Lisa B.", "Love the food and always friendly service!! We will be back. Love love the Greek food. And burgers! Salad...burger and baclava. My boyfriend had a gyro I am going for that next time. Awesomeness! Muy Rico! MUCH I SIMON GRACIAS!"], ["Elena C.", "Cool concept and delicious food!! I love the independent vibe, the colorful atmosphere, and the burgers. These guys really have the perfect greasy dank burger meal down. I would compare it as being a step above B-Bops or Burger King in quality, flavor, portions, and atmosphere. I ordered a double but ended up having to take a patty off because it was so large! A problem I never have at BK. Their food is that much more quality and filling than the chains. Good stop on your way to and from Rado! ;)"], ["Jessica B.", "I've never been so disgusted and have never given a one star. I went here for the first time and i had a giant burger and fries. The burger was burnt and was nothing special. I could've made it at home. The fries seemed like I could've bought a frozen bag at walmart and sprinkled a whole buncha seasoning on it. It made me feel gross. I'm sorry but I will never come back. Ever! I'm surprised it's still open to be honest. I was just so disappointed /: next time I'll go to Diary Queen across the street."], ["Ryan M.", "Though I know a lot of people like it, this place has never impressed me with their food.  There are places in Lincoln to get better versions of each menu item at around the same price.So what does that leave?  Convenience?  I suppose if you're traveling along I-80 and need to stop for gas and a meal, that might be the case.  But as others have pointed out, there's no point in trying to eat this stuff in a car, so you'll want to actually go in.You'll get plenty of food with an order, that's not an issue here.  The place is reasonably clean, quick with service (drive thru also moves along fine), and the portions are large.  I'm just not a fan of what actually makes up the meals.Over the handful of times I've tried them, I've found the food bland, overly greasy, and having what little flavors remain muddled and run together.  It just smacks of poorly done everything, at least regarding the food.  Even the gyros are only average, if that, and consistently reward me with an unhappy stomach.Now, before the management change a number of years back, the service here was awful.  So bad that I refused to ever go again.  When the management changed, I gave them another chance and can happily say things in that area have vastly improved.But the food hasn't gotten any better.  I tend to try them every six months or so, for some unknown reason, and am always disappointed no matter what I end up getting.  This last time was probably my final attempt.  There are just too many options within a reasonable distance that can offer a better, similarly priced version of something on their menu."], ["Heidi J.", "King Kong promises a fun atmosphere for the whole family. The food portions are humongous , so make sure you go with an appetite. The place was clean and the staff were friendly. It was also very easy to find."], ["Derek B.", "Went here a LONG time ago and ordered a burger, WAS NOT impressed as meat seemed very dry.  However, I gave it a chance about a month ago and came back twice.IMO, come here for the Greek food, meaning Gyro's, Greek Salads and Greek Potatoes.  You don't go to a Greek place for a cheap steak or an overpriced burger.  If you stick with the Gyro's you should be fine.  One of the other posters said they didn't think it was the best Gyro in Lincoln or that the portion size was that big.  However, I have to disagree.  I have been to Ali-Baba's downtown and I think Kong's is better both in taste and in size.  I haven't been to the Partheon yet, but, plan to do so as I have heard good things.  The two times I've had Gyro's here, they have been very good sized (I'm sure it does matter who's making the Gyro's that particular time as far as portion size.)  Once I had the Gyro platter and I was stuffed.  The Greek salad and Greek potatoes were VERY good as well.  I asked if they sold their Greek dressing, unfortunately the answer was \"No.\"  The dressing is that good.  Also, I think the flavor of the meat is some of the best I've had in Nebraska.  If it weren't for my bad experience with the Burger, I would probably give this place 5 stars.  Also, a tip:  If you like your food HOT, be careful when asking for your Gyro HOT.  I did, the dry rub was very good, but, EXTREMELY HOT.  I almost couldn't eat it except for drenching it in extra Tzaziki sauce.  So, I'd ask for the hot rub on the side."], ["Joe M.", "One of the best gyros I've had. Great fries. The burgers are good too, and huge! I made the mistake of ordering the double cheeseburger... I couldn't finish it, but I love leftovers!"], ["James G.", "It was late, and we were road weary.  Stayed at the hotel right next to this place, and walked over.  It had \"this can't be good\" written all over it, but it was different, decorated with gorillas outside and in.  There were only two other people in the place, and four employees.  They sell burgers and gyros and the portions are enormous.  The meat hanging on the gyro thing looked gross, but the wife went for it anyway.  I stuck with a King Kong burger, which is 1/2 pound of meat.  Had fried zucchini too.  Ate in our room.  Surprised - it wasn't that bad.  Not great by any stretch, but reminded me of drive-in food.  The gyro ended up tasting way better than the burger.  French fries are double-cooked so very tasty."], ["Lucas H.", "To be honest, I was expecting to give this place about 1 to 2 stars. I'm not exactly sure how they stay in business, because they're overpriced, the pictures of food look disgusting and the place seems pretty rundown. It must be because of the food. I got a gyro plate for $10 and was surprisingly impressed. The Gyro was good and the fries were excellent. If they were able to consistently produce this quality, I would come back."], ["John S.", "Had the gyro and fries, was not disappointed. The gyro was huge and I trashed it extremely quickly. Would go again!"], ["Don M.", "I am a fan of King Kong.  The gyro's are not the best in town and they tend to have slightly less meat than some of the other places, but you can always pay extra to get double meat.  They still taste good.   Their burgers are outstanding and you can build them as big as you want.   Personally I am a big fan of their fries which I think are among the best in town, as well as their fried zuchini and fried mushrooms.   I will say that I ordered their steak one time and it was chewy and fatty and took forever to eat it.  It was like eating an old boot.  So stay away from their steaks, but everything else is great."], ["Sarah J.", "Love this place every time I eat here the food is fresh,testyThe manger is so nice he care about every single customer. I love the food this place is the best."], ["Lucy C.", "we have been travelling from Chicago to Colorado and I have to say this is the WORST place we have stopped on the entire drive. staff was unhelpful and unfriendly. my husband ordered the food in English, the guy at the counter was a native Spanish speaker so my mom tried to talk to him in Spanish. he ignored her and continued speaking to my husband in English. we tried to order 3 Ault meals and 2 kids meals, which if you are not a child they will not sell you a drink on the same order...we got 5 kids meals and no drinks. so we bought 3 drinks separately for 7 dollars plus over 30 dollars we had spent on kids meals. basically we got 5 frozen food meals for 40 dollars. should have gone across the street to McDonald's."], ["Cheryl H.", "Stopped at Lincoln overnight and chose King Kong for Mediterranean food.  The Greek salad with grilled chicken was fabulous----crisp, fresh, yummy dressing.  The chicken was perfectly cooked.  The gyro plate with chicken and potatoes was a delicious blend of hot and savory with cool and crunchy.  The pita was tender.  The Baklava was okay!  It's fun inside, if a little loud."]]}