{"Taqueria El Rey": [["Agustin T.", "Great place to eat. The prices are fair in a good way. it's worth checking out"], ["Joe S.", "As authentic as Mexican food gets. This is the real deal. Sopes, tortas, real Mexican tacos, everything here is good. Can't wait to try more of the menu. Refrieds are excellent smoky flavor, real Mexican cheese, flautas were really crispy. Good red salsa, green salsa and thick tasty chips. Small but family run and busy."], ["Niki M.", "Took a chance after reading the great reviews and people didn't lie. This place had great tacos!"], ["Lianna N.", "Five stars for Mexican food in Lincoln and taco Tuesdays! I have only been there once so I cant speak for the rest of the menu yet, but the tacos are quite delicious. I definitely recommend giving this \"hole in the wall\" a try-I especially enjoyed the cheek meat taco. Fatty and oh so good. Great service and they also have Mexican bottled sodas and other Mexican drinks. Oh and Mexican candy by the register! I'll definitely be back. Eating tacos here will make you never want to return to your local fast food joint."], ["Daniel A.", "This place was good. The service was fast, the staff is very friendly. The food is your usual selection of TexMex or southwestern US-Mexican food. The portions were very big and it's nice that they accept credit card and cash. They also have a good selection of other authentic Mexican products, like sodas and candy."], ["Nate R.", "I dropped in for lunch with a date on Valentine's Day for a quick pick up and we where impressed with there prices and quality! Good job guys! You get 5 stars because you had friendly service and you food was better than your local competitors!"], ["Chris B.", "If you ever have the misfortune of visiting Lincoln  NE at least they have very good Mexican food, not sure what else to say if you want mexican this is a must. Get the pork tacos."], ["Saul P.", "This is definitely my favorite Mexican food joint in town. Growing up in East LA I got pampered with really good Mexican food this is the only thing that comes close. I know they have a couple locations in Omaha, I personally like the Lincoln location much better. El Rey seems like it's family owned, there's one cook in the back but the orders are promptly served to you. Always fresh, always good! The location is nothing to brag about and it's really small but they've made the most out of it and they always seem to have an open seats. Highly recommend the torta de milanesa, and tacos with any of their meats."], ["Randy S.", "Very good food. Service was excellent.  Small place but very busy.  Definitely worth visiting."], ["P D.", "Great food but they act like they don't know what their Thursday special is for nachos! They also act like they don't understand English. Very dirty as well."], ["John M.", "One stop here and you'll find it hard to eat Mexican cuisine anywhere else in the Lincoln area. I'm serious. Managed to stumble upon this hole-in-the-wall madre y padre eatery on accident last summer while getting my haircut across the street. Driving down 27th Street you're almost surely to miss it, but this my friends is one of Lincoln's best kept secrets. The food is exquisite. A landlocked individual such as myself has to wonder, \"Is this how Mexican places are in the southwest?\" Worth every penny. Fresh, quality ingredients that are bound to provide an epiphany of sorts for your taste buds. Plus, burritos are $3.50 on Fridays. Chipotle-sized burritos that taste even better than Chipotle."], ["William P.", "The space is really small, so I prefer to get take out here most of the time. They've allowed me to call ahead, which is cool. The burritos are really good. A previous reviewer suggested getting the lengua tacos. I was told they no longer have lengua. But everything I've had there has been legit. The prices are really reasonable, so I will for sure continue to return here."], ["Bill G.", "Closer to 3 1/2 but i i will give it a four rather then a three.  The place is has cheap, typical mom and pop mexi decor but who cares, I go for the food.  It is good.  Service is spotty at times but that does not bother me much because the joint is small and all you have to do is wave your server over for more drinks or salsa refills.  The carnitas are good and the salsa's are very good.  The food leans towards rustic so if you think Taco Bell is good mexican food, it might be a stretch for you.  I have not tried the other highly rated mexi place in town so until then, this is my #1."], ["Lelay P.", "Wow, small but the food they make is so good, I'm betting this is the best mexican food in Nebraska. It's very authentic and very affordable. It's definitely worth a try if you're in the neighborhood."], ["Kayla W.", "Very very small joint, set back in a parking lot next to what I believe is an auto place and a hair salon. Their daily specials are worth checking out -- burritos are 3.50 M&F, and are giant. So so good. The staff is all very friendly and knows me when I come in. The tacos, although small, are cheap and go on special twice a week for .99 - so buy four or five of different meats and make those a meal.My favorite thing I normally get is a chicken burrito, but the pastor and lengua is also really good and I haven't tried something that I didn't like. For what it's worth, this is my favorite mexican place in town -- even without margaritas!Credit cards are accepted for purchases over $5!"], ["Shaun S.", "Great place, ordered some chicken and pork tacos.  Both were very good.  Nice folks too and the prices are good."], ["Kristin R.", "Perhaps the best lengua tacos I have every consumed.  They make me happy.  I try to order other items, and I have, and when I do stray from my usual, I am quite happy.  However, I am addicted to their lengua tacos.  If you have not been, then you must go.  Go right now.  Chop, chop!"], ["Ray S.", "Being from southern California, I frequently get an itch for Mexican food. This is the only place in town that is tasty enough to scratch that itch. I've been to many of the other recommended Mexican places on Yelp, but none have been nearly as good as Taqueria El Rey. Make sure you choose al pastor (pork) for the meat, it's the best one. The chicken is good too though. I would recommend their tacos, tortas, and pozole. I've tried a burrito and combo plate, and it wasn't good compared to some of the other menu items."], ["Michael C. B.", "Authentic and tasty taqueria with a good choice of meats and all the traditional dishes.  Friendly servers and staff.  Minimal decor but clean and comfortable, with parking in front.  It's about half a block south of O St., on the east side of 27th, set back from the street. (This is the Lincoln branch of the Omaha taquerias.) We had 4 different tacos - chicken, carnitas, chicharron (pork rind), and cachete (beef cheek). All were excellent.  Also a sopa (thick corn cake) topped with puerco al pastor, and two quesadillas - lengua (tongue) and puerco al pastor.  Needless to say, that was way too much for two people, and we took much of it home.   There's a selection of non-alcoholic drinks including horchata, including some Mexican bottled drinks."], ["Keith A.", "Found on yelp.  Small and rustic.  In a parking lot about 20 yards east of 27th street.  We've been to mexican restaurants all across the country.  This place had some of the best homemade mexican food we have ever eaten at rock bottom prices.  Burritos were so big we couldn't eat them all - and we were hungry!  Horchata was also homemade and delicious.  You don't want to miss this place."]], "El Rancho Authentic Restaurant": [["Greg S.", "Service left something to be desired and my wife said she saw some patrons eating chips from the baskets on the counter (yet to be served to future patrons). Hmm, not sanitary at all. We had to request water, which overall isn't any big deal at all. However, I did ask for hot salsa (salsa served with chips is mild) yet the waitress continued to clean and do other chores. She didn't bring the hot salsa until she brought our orders. Food though was very good. I had a chile relleno and it was great. I asked for black beans and received what looked like refried black beans but man-o-man were they good. My wife had flatas, which only come in chicken, and she said they also were good. So all in all we thought the service was about 3-star and the food about 5-star. The margaritas were okay but I've definitely had better tasting. Overall we will be back."], ["Jessica H.", "El Rancho is what it says it is.  Authentic.  Great prices.  Great food.  I've been here several times and it's a great haunt for a group of friends that want some yummy Mexican and strong, tasty, cheap margaritas in a casual environment! It's not fancy, it's a little run down, but it's good enough for me and my friends to have a good time.After a pedicure at Queen's across the street (love Queen's), a couple of my girlfriends and I found ourselves here enjoying our feast, enjoying our drinks and the great service.  On a Monday night it's not particularly 'hoppin'' which we liked.  The waitress also recommended the pork taco with pineapple and we all agreed it was phenomenal.  Do yourself a favor and add one to your entree!I had the combo fajitas, which never disappoint.  One of my friends had the chicken mole (they were nice enough to bring a sample of the sauce before ordering as it was her first try) and my other friend had a trio of items.  We were all very satisfied.  Prices are low, quality is good (the guacamole was fresh and delicious). Portions are large.  And again...those margaritas!  I've also hit up the taco truck behind here several times. I'm not sure if they are part of the restaurant, I assume they are, but I do love them! Great after a summer bike ride."], ["Amanda K.", "This was my first experience at El Rancho and I really wanted to like it.  The salsa was   tasty and I enjoyed my margarita, but that's where the good time ended.  My burrito came out a whole 5 mins before my fiance's chimichanga, so we sat across from each other awkwardly eyeing my food because we were both so hungry.  When I finally cut into my chicken burrito, I thought they made a mistake.  I'm used to chicken burritos containing shredded chicken, and this was cubes of questionable quality meat that I assumed was pork.  After looking at the beautiful, shredded chicken in my fiance's chimichanga, I was convinced that I had received the wrong order.  I asked our waiter and he informed me that it was, indeed, chicken.  I ate a couple of bites before declaring it inedible to my fiance.  He then was nice and switched plates with me, giving up his white meat chimichanga and suffering through the burrito.  I think he was just trying to avoid watching me send back my food.  He has this major problem with sending food back at a restaurant.We are both waiting to see how his stomach handles that weird meat..."], ["Christine L.", "Love this place! Delicious, authentic Mexican food. Friendly service, generous portions, and low prices. Seriously. Try this place!"], ["Amanda B.", "They have a full menu of authentic Mexican cuisine.  I often pick up a large container of salsa To-Go.  I just can't get over the cleanliness of their restaurant (or lack there of).  In the summer months there are flys everywhere.  Took our kid once and his high hair hadn't been cleaned in ages.  I won't even get into the restrooms.  Take pride in your restaurant and your business will thank you. 3.5 for their food. 1.5 for the atmosphere. 3 for service."], ["Tina L.", "I've only tried the tacos from the taco truck but they were pretty good, with generous servings of toppings and onions on the side. I enjoyed the lengua (tongue) ones the best!"], ["Joel G.", "I had the mole enchiladas.  I think this is the most authentic Mexican restaurant I've eaten at yet."], ["Alan W.", "I love this place! Everything here is great! I love the steak fajitas, and the guacomole is the most amazing I've had anywhere! Not going to speculate here what they do to make it so amazing. I might accidentally give away a secret family recipe if I do! Sometimes, the TV's are a bit loud, but that's fine if you don't mind professional wrestling. I'm not a fan of it, but it doesn't bother me enough to lower my rating of this fantastic place. It helps it's within walking distance of my home. Oh, and almost for got to mention that they make great margaritas!"], ["M. N.", "I was pleasantly surprised coming from out of town.  Very good food, I asked for something not on the menu and they didn't bat an eye.  Courteous, comfortable, not too noisy.  Not an Abuelo's or a Manuel's by any means, but very good and I'll go again when I am in town."], ["Caroline K.", "Go straight for the taco truck in their parking lot!  Best tacos al pastor north of the Mexican border."], ["J C.", "decent mexican food and always seems to have some decent deal for lunch going.  I dig the atmosphere as well.  Will visit to try some of the salvadorian sometime"]], "La Paloma Mexican Restaurante": [["Marc D.", "Absolutely Wonderful!Hands down one of the best Mexican/Tex-Mex Establishments I have ever been too.A very newer building with a pretty open concept dining room and a small bar in the middle.   The Margarita's are very good!  The service is friendly and has the down home feel.The food is heavenly.  Quality is apparent in all aspects of the dishes. The green chili sauce is the best I have ever had.  Great bits of roasted pork that are so tender they will melt in your mouth.This is a must stop at location!!"], ["Kyle K.", "Stopped in here for a business lunch. Friendly hostess seated us right away and brought us chips and salsa. The chips are fried flour ones and fresh. There were two salsas: one medium and one hot. Aside from texture (tomato chunks in one), they were the same amount of heat. The steak tacos were of the street style variety (small) but delicious. The lunch came with two of them; with a generous helping of streak. For an extra $2, I ordered the beans and rice to go with it. Pretty good!"], ["kristen m.", "Chips are the stand out item... I don't enjoy them find them very heavy and greasy but I can clearly see how these chips are loved by many. The chips are the only standout item. Salsa lack luster. My meal not good and was sent back due to finding something in my chicken. Yuck. Totally lost appetite after the heavy chips, flavorless salsa and my chicken tacos containing a mystery item. Can't say I will ever be returning."], ["Joe M.", "A decent Mexican restaurant for the price. The tortilla chips were the best I have ever had and were absolutely delicious. My wife did not enjoy her meal though and had to send it back because she found a foreign item in her food. We will most likely not return."], ["K C.", "Wow! The chips and salsa are the best in Lincoln. Try the spicy they make it on site and nothing goes better with that \"zing\" then a blue margarita. Better yet... A carafe. There's talk of a tequila tasting soon. Stay tuned. Like 'em on Facebook so you get info first.7/30/15Back for Blue Margaritas!  Awesome."], ["Kendall D.", "Chips are amazing. Staff is friendly.Their chicken enchiladas are easily the equivalent of what I assume heaven food to be. Not to mention, they give out WAY more food than one pays for. Also, not that busy! Definitely my favorite Mexican restaurant in Lincoln. Excellent!"], ["Andy R.", "Great place to grab some food and drinks! I try something different every time and its always delicious. Staff is friendly and attentive, and can make a damn good margarita."], ["Kent M.", "Excellent today for our 5 group. We had a variety of chow. All was beautiful appearance and tastes same. We all were impressed with food quality and the same excellent service. Zero issues or complaints. Will def return."], ["Doug S.", "We're from the Chicago area and visiting here in LincolnWere hungry for Mexican food and decided to try LaPaloma.We were very impressed with the staff, food, and drinks."], ["M M.", "Great chips...salsa was ok. Decent food for the price. Had the steak tacos and they were fine. This place didn't blow me out of the water but it wasn't terrible either."], ["Sirin D.", "The seafood was worth it. Salsa could be better, but the margaritas were tasty. The service is fast and friendly too"], ["Will N.", "Very casual mexican food. Personally I think it's hard to find really good, authentic mexican in Lincoln, but the green chili and chili rellenos are the best in town. Not a big fan of the flour tortilla chips. Many menu items are \"hit and miss\" like most average restaurants."], ["Daryl T.", "I would absolutely come back to La Paloma again when in Lincoln. The restaurant staff is both friendly and attentive. I also agree with the earlier reviews that the flour chips and salsa are very tasty. However I prefer the traditional corn chips over the flour, but they were still very good.  They bring both a mild salsa and one a little spicier to your table and the salsa has very good flavor. Their traditional Mexican dishes are very good from both a quantity and taste perspective.  The prices are reasonable.  I had their taco salad and it came in a fried flour bowl.  It was a little unconventional in that it had peas, broccoli and fresh green beans versus tomatoes , onions etc. It was still very good but I prefer the traditional. My 7 years old daughter swears by their taco burger.  She is usually quite picky but she wolfed it down which was great to see but a little surprising.  The only thing from stopping me from rating it a 5 is that my other daughter ordered a children's quesadilla and all she received was a one flour tortilla with cheese folded in half. Very plain and underwhelming.  I would recommend that they add some rice or refried beans (increase the price if needed) so it feels more like a Mexican meal. Overall very good and we will be back next time we are in Lincoln. Like I said earlier we have had great experiences at this restaurant."], ["Eric V.", "I was very happy with my first trip here.  I love the chips and the tamales were very good too!  Mexican is usually not my first choice but I will definitely be back when in town in the future."], ["Dr. S. K. N.", "I must have gone on a bad night, judging by the stellar reviews.  Hair in the chips. Not great food. Staff was pleasant, and I love the building.  Went looking for water...whatever you do, don't look in the back room... Waitresses scraping the dirty plates. Rare is the place that is so off-putting that I don't want to finish, or take home leftovers.  This was one of them."], ["Michaek V.", "Good chimichangas.  Nice interior decorations, large restaurant.  Chips are deep fried tortillas. Very nice and prompt waitress named Nisha.  Recommended."], ["Kat R.", "La Paloma was the worst Mexican dining experience that I have ever had. The salsa is comparable to canned tomato sauce and the portions are about 1/2 of what you would get at other Lincoln Mexican restaurants for the same price. The rice was simply not good and it seemed like the fried ice cream was put into a fried taco salad bowl and coated with a corn flake like substance instead of being actually fried. It did have a nice atmosphere and great service which is why I am giving it two stars. However, the food was mediocre at best, we left hungry and dissatisfied."], ["Jerry M.", "Tried the pork carnitas. They were excellent.  Fast friendly service. Nisha was a great waitress."], ["Jared P.", "Great food and staff. Always a treat! Food is made fresh and brought out by a smiling server."]], "Copal Progressive Mexican Cuisine": [["JD F.", "Original, refined, delicious.We like eating street tacos late at night covered in green salsa from places where the menu doesn't come in English; where a large sign out in front advertises cheap tripe soup. We think of this as authentic Mexican food. Copal is not that.Copal is the authentic, refined Mexican food you would eat at your compadre's casa in Mexico City--if your compadre can cook like a four star chef. The restaurant is clean, welcoming, (easy parking), and a welcome respite from the typical tex-mex places across Lincoln.The presentation and taste of the sweet corn soup was impressive and delicious. The flavors and textures were well combined. The duck tamales were just as appetizing; crispy outside combined with the soft corn tamale inside with a delectable duck filling made for a lovely main course. The chiles en nogada hit all the right notes--the filling was the right blend of flavors, the walnut sauce had the right hints of sweetness and the whole entree was filling without being too much food; understated and authentic. We look forward to returning and trying more on the menu.One constructive criticism: our waitress did not seem to understand how to appropriately describe the specials. She called the braised short ribs \"ribs\" and the seared tuna tostada \"tuna fish taco.\" Granted, new restaurant, new food to Lincoln, new wait staff, but this is just a little constructive feedback for the owner to enhance this fabulous restaurant."], ["Nathanael E.", "This is one of Lincoln's best and most unique restaurants.Copal fills an underserved niche in the Lincoln restaurant scene, that of progressive cuisine, Mexican or otherwise. Offhand, I can't think of any other restaurants that I would put in this category, maybe there are some, but none come to mind.I have been there a few times and each time I explore a different entree, all of which have been superb, but my favorites heretofore are the Tilapia Tacos and the Shrimp Aljillo.If you are vegetarian, the menu selection is a bit limited, but I get the feeling that they would be willing to accommodate substitution requests.The wait staff have all been very welcoming and attentive in their service. I always like to tap into the staff expertise when exploring a new menu and I suggest taking advantage of the staff expertise at Copal.The prices are inline with expectations, a meal for two will run $40-$50 and will be worth every penny.This restaurant has not been open long and I expect to see the menu evolve over time. I still have many items yet to explore on the current menu, but I can't wait to see what they will do in the future.The professionalism on display at Copal is immediately evident. The owners definitely have an eye for detail and customer delight. You are in good hands here and I expect continuous improvement in the future.The atmosphere is nice, simple and open. The acoustics are not perfect, but certainly not a show stopper. During busy hours, I can see this being more of an issue, but I've definitely seen worse. I have faith in the ownership to address this moderate issue. All they need is some acoustic buffering in the form of panels or similar strategically placed decor.This is the place I try to steer my business lunches, too bad they aren't open on Mondays.Overall, the few negatives are negligible and the upside quite strong. I heartily recommend Copal to anyone seeking new and stimulating dining experiences in the city of Lincoln."], ["Jeff K.", "We sat down and had some chips and really good green chili sauce while we looked at the drink menu. There are a few drink choices, about three wine choices, and a bunch of beer choices. We settled on the house margaritas and a Mexican beer.  The drinks were good and came in a small mason jar.  The beer came with a chilled glass. I ordered the guacamole for an appetizer. It was fresh and tasted great. The chips were very salty though. Everyone ordered chicken enchiladas. I had the green sauce while the other two had the cocoa flavored sauce. I enjoyed the green sauce but the cocoa flavored sauce was a little strange. Dessert was really good. Well worth ordering. Overall we enjoyed our dinner and would recommend it."], ["Cindy C.", "Polite, friendly staff greeted us in a nicely appointed restaurant.  Manager brought out complementary green sauce and chips and welcomed us to the restaurant.  We enjoyed two Mezcal cocktails. Pours seemed a little light. Highlights were the duck tamales and chiles en nogada. The tilapia tacos were too spicy for our guest.  Portions are small and rice and beans have to be ordered asides. Food arrived quickly and our water was always topped off.  The only challenge came with paying our tab.   We waited over 10 minutes to get the attention of a server.  I will be back to try other items.  The restaurant needs a little time to hit it's stride.  Glad to have them in Lincoln."], ["Ann G.", "We went here for my birthday and I have to say, it's definitely worth a visit! We went on a Wednesday night and it was very full. Our party of 4 had about a 5-minute wait, but I think we may have beat the rush a little bit because I saw a lot of people waiting midway through our meal.The food is excellent and rotates seasonally, so I'm excited to go back in a couple months and see what's new. The menu isn't huge, but we were all happy with our dishes. The drink menu is unusual and excellent -- there was a respectable pina colada at our table as well as an avocado margarita that I loved. Portion sizes are fairly small, and the price of entrees can be either pretty cheap or a little more than I'd normally pay -- not much middle ground. Our server seemed like she was pretty new to waitressing, but she was definitely very passionate about the restaurant. Verdict: a little pricey for the portion sizes, but the quality is amazing. There are some kinks to work out since it's a new restaurant, but I plan to go back.Bonus: they gave me a tequila shot for my birthday in a traditional cup that I could keep!"], ["Ryan C.", "I was genuinely excited to try this place out, has a pretty interesting concept, and I'm generally a fan of \"mexican\" food. To start off, this place is pretty pricey for what you pay. I was pretty blown back by how much some of the dishes cost, so I opted for a pretty generic dish that was more affordable. So I Ended up getting the mole chicken enchiladas, which were good. It's really hard to outshine mole`, it pretty much tastes the same wherever you go. The serving size was pretty small, could have had more, and the chicken was a little dry. I'm complaining a little bit but the dish wasn't bad, I was pretty happy to find a place that had mole` in general. They also gave out free chips with a green and red option for salsa, which were both pretty tasty. The major gripe (and what killed it for me) was the service. They didn't have enough people running the bar and floor that night so they were extremely slow on their drinks. We got them wayyyy after we got our dinner. We wanted to enjoy our tequila drinks with our food so we waited to eat till we got our drinks. Our food ended up getting a little cold because we were waiting awhile. They have a pretty hefty menu of drinks and types of tequila, which was nice. The mixed drinks were thought out and definitely accompanied the flavors of our dinner, but when we actually got them. All in all, the place was descent and has potential to be a better restaurant. I'll give them the benefit of a doubt and say they're new and are working out their kinks. I have no desire to go back unless it's payday and I have the money to shell out over 20 dollars for Carne Asada. Which, by the way, is the most expensive Carne Asada dish I've ever seen. I might go back in a few months when they get their footing on service and bring down prices a little. I know making Mexican dishes doesn't cost a great amount so why over charge so much? By all means, don't let this review discourage you from going there and trying out something different. Just expect to pay more than what you're getting in terms of service and price. Oh and to call it \"Progressive Mexican Food\" makes the restaurant sound pretentious and off putting. My friend and I were making fun of it the whole night, specially when the restaurant wasn't holding up to it's slogan."], ["Sue H.", "We had dinner here last Friday evening. The decor is understated and tasteful. The staff was friendly and helpful. I had one of the specials, grilled tuna tostada. It was delicious! One of our party had Carne Asada, one Emmoladas (mole), and a couple had Enchiladas Rojas. Everything was fresh and tasted great. They have a good selection of good tequilas. I highly recommend this restaurant."], ["Leslie S.", "So I kind of knew what to expect after reading reviews... It was about half full at lunch and it was fairly loud in there but not as bad as I thought it would be. The menu is small compared to most Mexican restaurants. We did not care for the verde salsa but it was complementary so there really isn't room to complain. Prices are decent but can range drastically from $8-$19.  No notation for it being a \"lunch\" menu so I think it's the same all day. I ordered the tilapia tacos and could only finish half of them. There were 3 in the basket. They were a bit spicy but not unmanageable. My husband got the enchilada Rojas and they were very tasty and the chicken was tender. Lots of reviews said the servings were small but I found them to be just fine. Quality equaled quantity. All in all we won't rush back but I wasn't disappointed by anything other than the free salsa. We were sad that there weren't any tacos on the menu. We love fancy street tacos!Service was VERY good and attentive."], ["Meghan E.", "I've been to Copal twice (once for lunch and once for dinner) and can confidently say it's one of my new favorites! The restaurant is clean, bright and the staff is very welcoming. The best part is the incredible flavors - I ordered the Enmoladas and the Duck Tamales - both were flavorful and delicious. I would highly recommend Copal to anyone who enjoy a unique dining experience."], ["Michelle H.", "I was extremely pleased to see a new restaurant was opening in the College View Area, and gathered a group (including two kids) together to see if Copal was as progressive as it sounded.  Ambiance:The entrance was not very visible or marked, but I enjoyed watching certain members of my group wander around the building looking for the right door.  The dining area was attractive.  The noise made it very difficult to hear members of my own group, and some music or sound-absorbing panels would add greatly to the dining experience.  The two tables the staff pushed together for our group were different heights, which was uncomfortable for the two people seated at the \"crack.\"  I liked that there were cloth napkins and heavy silverware, but would have appreciated a smaller set for the kids as the forks wouldn't fit in their mouths.  Service:Copal has only been open a little more than two weeks, and it definitely shows.  The staff were very friendly and attentive, but need some training in proper restaurant service.  Our meal was brought out in shifts (due to a missing entree), so some of our table had already finished their plates by the time the last person was served.  The server was very attentive, which was good as our order came out wrong...for more than one member of our group.  Our server did give our group some good suggestions from the menu.  I overheard another table's server telling her guests that they should \"hurry up and order drinks because the bartender is slow.\"  Not necessarily a good plug for the restaurant.  Overall, I felt like the service issues can be easily remedied with a simple training.  Food:The green salsa and chips were a nice start to our meal.  I ordered the red salsa as well, which tasted like chunky tequila.  Not a good choice for the kids.  I ordered the tilapia tacos, and thought they were very tasty.  The flavors blended together well, and it tasted fresh and of good quality.  As a previous reviewer noted, the portion sizes are smaller than one might expect here in Lincoln, but the food was plated nicely.  The duck tamale I tasted was cooked very nicely.  In looking around the table, all the food did appear fresh and cooked beautifully.  What I found disappointing about the food is that there were so few vegetarian options listed on the menu.  In a neighborhood swarming with vegetarians, it would seem like a good idea to list vegetarian options, or at least have several different menu items with no meat (beyond just soup).  Half my table are vegetarian, and the server explained what substitutes could be made.  However, if people don't seen any veggie options listed on the menu, it will be hard to pull in the large Adventist crowd that is centered in that area. I really REALLY wanted to love this restaurant...and I think that possibility is still on the table.  Hah.  Table.  I'd give Copal some time to iron out some kinks, and they might possibly be the greatest foodie joint in the College View area."], ["Marie J.", "The food was ok but it is SO LOUD YOU CAN NOT HAVE A CONVERSATION! Yes, I'm screaming because that's what dinner on Friday night was like. Best part of evening was going to the bathroom where it was pleasantly quiet. Great place to dine if you want to look at your cell phone all night or dine & dash. The place seriously needs acoustic work, ASAP! Hang some Mexican tapestry from the ceiling or something to take the decibels down significantly. Hang some window coverings to help noise! Figure it out!!!The house Marguerita was ok but mostly ice, no booze. Mole enchiladas were good if you like boring. Spicy shrimp was excellent! It's a knock off of Bonefish Grill bang-bang shrimp but 1/3 the size for the same price. Churro dessert was hard as a rock, should have ordered the flan. After $35/person for a drink, entree & dessert, it's unlikely we'll be back until we hear the noise level is fixed. Or it's dinner with someone we could care less about chatting with on a non-weekend night."], ["S a.", "Delicious food, carefully prepared. We were a big group on a night when there was another big group AND the room was full, so the kitchen seemed kind of overwhelmed. Still, even after a wait, everyone agreed -- the food was TOTALLY worth it!"], ["Andrew B.", "Overall a good experience great atmosphere food was good a little higher price than most Mexican but homemade fresh recipes will definitely go back and try again"], ["Sherry S.", "This is what Lincoln needs.  Edgy interpretations of old standards. My husband, our son and daughter in law went here on a game day Saturday night. My son ordered the Copal Margarita and the madehim a new one as he thought it had too much orange liqueur. The second one was excellent. We had guacamole which was a little too creamy, we like it with a coarser texture, and pico de gallo which tasted good but the cilantro seemed intense and not \"fresh\".  The four of us each had something different: duck tamales, enmoladas, entmoladas, and chile nogadas.  The duck tamales were good.  The entmoladas with tomatillos sauce was classic enchiladas with a fresh green sauce.  The mole in the enmoladas was classic as well, with chocolate and chiles a little sweet.  The chile relleno was the surprise  the filling of beef, pork, nuts with a VERY creamy sweet sauce.  Do no expect savory. It's sweet but good.  Tried the flan, Churros and tamales for dessert.  All were yummy but the tamales were unique and the flan and Churros were safely but very well executed. Service was attentive and our waitress requested feedback about the food. Personal peeve of letting water get low, they didn't. Try it but don't expect La Paz or Ticos.  This is unique Mexican in Lincoln with flavors you won't expect but will enjoy!"], ["Kelly W.", "Unlike any Mexican restaurant in Lincoln, and that's a good thing! Some reviewers mention small portions. Yes, they are smaller than your average gut-bomb Mexican joint, but the ingredients are of a higher quality, everything is made fresh from scratch. That said, we did feel the portion for the Duck Tamales was too small to be considered an entree. The Paloma is an excellent drink and we also enjoyed the Day of the Dead Hefeweizen. The Enmoladas were delicious, the homemade mole is very distinctive and rich. The service was prompt, attentive and friendly. I do wish our server would have had a better answer when I told him I was torn between the refried beans and black beans. He just told me his preference instead of describing how each is prepared. I chose the black beans and loved them, great flavor, not mushy or overcooked, just right. Looking forward to returning!"], ["Tom S.", "Each of the 4 times I have eaten there, it has been great. I have brought my family several times and each time we leave, we are thinking about which dish we will try next. Some of our favorites include the enmoladas, duck tamales, shrimp al ajillo and enchiladas rojas. Within our family we have tried over 10 entrees and multiple deserts, and all have been excellent."], ["Shelley D.", "Food was very tasty and fresh. We were a little disappointed that with a party of 4 adults, we were only given a small container of salsa and a few chips. We ordered the red salsa, same thing. I think if chips are paid for, you should receive 1 free refill. We ate on a Friday night after 8 pm. Pretty busy, and had to wait for our server to bring napkins and silverware long after we were done with our small chips and salsa.  On the other hand, the flan for dessert was delicious."]], "Cómo Se Taco": [["Rumil B.", "So this place has gotten better each time I've eaten here. And trust me, because I eat here a lot.Unfortunately they got rid of their queso--they said it was just hard to maintain the consistency. Hopefully they bring it back. The lemonade is a little too tart for me, but I'm not a big lemonade person so maybe try it if you're into sour stuff. The horchata is pretty good, I haven't had it many times before this place so I can't say how it compares to other places. But I believe it's made with almond milk. The Thai tea is delicious too. Tastes somewhere halfway between Pho Factory and Banhwich. They've also added rice bowls and salads, so you can get your choice on one of those instead of the typical tortilla. Each employee is also really friendly and helpful with recommendations/explanations. I wouldn't expect anything less."], ["Jacqueline V.", "I found out about this place a few weeks ago & was pretty darn excited to try it. Based on all of the pictures & Yelp reviews I saw, I knew I'd like it. I ordered the Seoul Food (I think that's what it was called) with beef. Being a BIG foodie, especially Asian fusion food, I HAD to get that. I don't want to say \"salty\" but that's the only word I can think of right now for the sauce. But thank God for Sriracha! But overall, I liked it. My bf & I also ordered the chips with guacamole. THIS IS MY FAVORITE. We devoured that thing in minutes. Guac tasted very fresh. The chips were crispy & flavorful.  Definitely not oily like another Yelper recently stated. As for the drink? I was actually pretty disappointed. Urgh, I LOVE LOVE LOVE boba, so my standards for it is pretty high. So I decided to play it safe & not get their Thai tea. I saw that they also had CUCUMBER LEMONADE. If you've ever been to Southern California & been to to Lemonade, then you know how AMAZING their famous cucumber lemonade is. Again, my standards for that is also pretty high. So, horchata it is!I don't know if it's me or what, but my horchata was very sour. I could not take more than a few sips. Sigh* Overall, I liked this place. The service was quick and the staff was nice. Especially the tall friendly guy who took our order & recommended some items off the menu for us. It's a small establishment with enough sittings for everyone. AND, you can choose what kind of meat you want in your tacos as well! Plus ~This is definitely a place I'd come back to whenever I'm in town visiting if I'm craving something more than traditional street tacos."], ["Lynne T.", "The first time I had the Seoul Korean with steak and Thai gallery with chicken. I thought the Korean taco was a tad bit salty to which I couldn't finish it. The Thai chicken was good. I didn't like the cucumber lemonade which tasted weird to me. The guac was good but didn't like the chips. They were too oily. Second time around I tried the Thai tea which was good. Overall it's decent. A little pricey side but that's because they're not a typical taco."], ["Elisabeth E.", "Since I've been in Lincoln I've just been continuously impressed with these restaurants, and the newest member of the family is no exception.  As soon as I saw they were open I had to give it a try. It's in the same location as Honest Abe's used to be prior to their move this spring. The inside has had a little change of decoration. It is still a pretty small space with limited seating so I imagine there will be a lot of taco take outs. The taco selections are as unique andInventive as you've come to expect from GUP restaurants. Each taco I had was different and had an unexpected twist. I had the GUP which was my favorite. The Thai peanut one was also delicious and the Jamaican had quite the kick to it. You can select your meat for each option. They have tofu for a vegetarian option and of course they thought of gluten intolerance in their menu design, I just love my options at GUP restaurants. Corn tortillas make any taco a option and the homemade corn chips and salsas are amazing.Everyone is always very friendly at all of their restaurants and there's a lot of crossover between them. Overall I was again really impressed with the quality of food, reasonable prices, unique flavor combinations, and overall friendliness of the restaurant. I'll be back soon."], ["Ms. L.", "I thought this was a great place to eat. Regional spins on tacos. Foodies will love it here. Very flavorful. Do not dine if you want American-ized \"Mexican\" food."], ["Ashley M.", "Wow!!! I just happen to be driving by leaving ace hardware around lunch time today & seen this place. I am in LOVE!!! Lincoln totally needs new and fabulous places like this. This is not your typical taco place. This is so much more. I seriously can't race enough about how good these tacos are. Well, I only had two but I will be back to try the others for sure. I highly recommend the Seoul with steak and the Lima with chicken. Phenomenal!!!"], ["Greyson M.", "First time trying this place. Always have loved the Honest Abe's chain, but not a fan of the tapas at Sebastian's. Wanted to give this place a try, and is was a pleasant experience. I'm a big fan of Korean food, so I went with the Seoul Food. It was saucy, meaty, and full of flavor. I enjoyed the experience. Taco prices were slightly high, but that's how the food prices are for this local company restaurants. I would certainly go back if I had a quiver for non-traditional tacos."], ["Greg H.", "A rare miss from the GUP restaurants. Maybe my expectations were too high. I had the One Night and Seoul Food. The flavor was less than exciting and the portion size left a lot to be desired. For a $3 taco I expect a lot more. Hopefully they make some changes to bring it up to the level of their other restaurants."], ["Sam K.", "Be forewarned: there is no \"normal\" taco. And, a \"normal\" taco is what I was expecting when my buddy decided that's where we're eating. However, that's not necessarily a bad thing. Here's how ordering there works: there are currently 5 different tacos you can choose from: The One Night, the Seoul, and the Lima Parade seem to be pretty popular. Then, you choose what kind of meat you'd like on it: steak, chicken, pork, or tofu. If you're really hungry I would order 3 tacos. I had 3 Seouls and mixed and matched the meats. Whatever meat you choose, it's topped with Asian-themed fried rice, cilantro, daikon and carrot slaw, crispy wontons, and the meat is marinated in a teriyaki-like sauce. The tacos were pretty darn good, I just wish they were bigger. We also got chips and regular salsa, which was pretty bland. I'm sure the specialty salsas have more flavor but I would give an 8 out of 10 to our meal overall. I definitely recommend that everyone gives it a try!"], ["Mike W.", "This place is fantastic. It's in the old Honest Abe's space in Meadowlane, run by the same owners. Tonight we had the guasacaca, which is a Venezuelan take on guacamole. It was excellent and went well with their homemade horchata. We also had Gup, Seoul Food, and One Night tacos. All of them were unique and tasty. Think Sebastian's Table in terms of quality and creativity, but Honest Abe's or a food truck in terms of being casual and fun. Definitely looking at trying the rest of the menu. It's not the fanciest restaurant in town, but we had a great time and had plenty of space to settle in and have a very good meal and nice conversation."], ["Ryan C.", "Visited on 09/15/2015 at around 11:30AMQuick Tips:- Tacos are a little pricey but you get what you paid for in good flavor- Dining area is small, but HEY, they're tacos. Sit outside and eat them on the curb if you need to.- You pick your own taco to meat combinations- Not your typical tacos, but ask the cashier for meat to taco suggestions - 2 to 3 tacos should fill you up- Really fast service, had tacos in my hand at around 5 minutes- Good service, they asked how I liked my meal. Friendly.This place is pretty good. It's not your standard taco fair but that's what makes Como Se Taco stand out. They have 7 well thought out taco combinations that work for specific \"worldly\" variants of tacos. Your price depends on the meat you choose for whichever taco you choose to order. I really wish that they didn't let you pick the meat, you know they specifically choose the flavor combinations to pair with certain types of meats so why complicate the menu? I see why they did it, to please customers into having more options, but I personally trust their gut. They could at least have on the menu next to the names \"Suggest choice of meat: Chicken. To help lead the customer into making the right decision because I firmly think that choosing the wrong (or incorrect) meat can change your look on how the tacos taste. For example, I had the One Night taco and thought that chicken would be the best choice. The One Night was very good, almost a kick in the mouth of flavor but there was something missing which was the correct meat choice. I thought it would have tasted a lot better with the pork. I guess that's also another reason why they give you a choice, so next time I can try the same taco with a different meat. I also tried the Seoul Food (with steak), Lima's Parade (with pork), and The Peanut Gallery (with chicken). My least favorite was probably The Seoul Food taco with steak. I thought the steak itself didn't have very much flavor and the sauce over powered the taco and adding cilantro would have helped. Don't get me wrong, it was a good taco but it didn't stand out as much among the others. The Lima's Parade (with Pork) was probably the most well balanced in terms of flavors. I felt the ingredients complimented the meat instead of trying to mask it. The pork itself was tasty and could stand on it's own. If it made sense, I would probably order every taco with pork as the meat. The Peanut Gallery (with chicken) was also very good, a thai themed taco with a sweet thai peanut sauce. I really like the peanut sauce because I'm a sucker for sweet food but again it was a little empowering over the meat and other ingredients. The amount of sauce is pretty much a personal preference and small gripe but some of the sauces had just a little too much of a big kick. If they could find a balance in the sauce to ingredients ratio I think the tacos would taste even better. All of the tacos had rice, which I thought was a little unnecessary for tacos. Maybe the only taco it worked for was the Seoul Food taco because it had kimchi fried rice and added some depth to the overall taco flavor. For the other tacos, the rice didn't really make a difference. They should just add more meat. I also had the chips and salsa which was pretty good. The chips were home made and had the perfect amount of salt on them. The salsa was a tomato based pasty salsa. It was good but it was almost like an italian salsa haha, if that makes sense. As opposed to chunky salsa with fresh cut tomatoes, onions, cilantro, lime, and whatever. Their horchata was alright, it had a little too much cinnamon for my liking but I did appreciate the sweetness it had. Sometimes a lot of Horchata can get watered down and it becomes tasteless. There was a hint of Jasmine or something different in the horchata but I couldn't pin point what it was. Overall the place was good and I would definitely go back and try it again. Possibly try some different taco combinations and see what's good. It's a little pricey for tacos but the tacos are good for what you paid for. If they made Himica I would probably eat there all the time. Place is definitely better than Honest Abe's."], ["Katie H.", "We tried out Como Se Taco tonight for the first time.  My (not so adventurous) husband had two pork Plain Janes.  He said they were okay, but he left hungry.  My son had a Plain Jane and a Korean taco.  He LOVED the Korean taco and said the Plain Jane was good too, but not as good as the Korean.  I had (at the suggestion of the people at the counter) a Korean Taco and the Lima.  I really liked them both, but I liked the Lima by far the best.  We also had chips and salsa.  We weren't crazy about the salsa.  It just wasn't the kind we prefer.  Not bad though.  The kiddo and I will be back again, as we loved it."], ["Preston K.", "The new venture from Ground Up restaurants is another success.  All of the tacos are definitely worth trying and it is fun switching up the different protein options.  A couple that really stuck with me however were the Jamaican and The Peanut Gallery.  The drinks are great to go along with the tacos.  The Thai tea is killer and ridiculously good and the Horchata doesn't disappoint either.  The Guasacaca is a smooth, creamy guacamole with a kick of lime that is an awesome addition to the tacos.  The next time I am intending to try the other salsas, but one thing that completes the dish is the chips.  I am assuming they are made in house and are nice and thick perfect for scooping up every last part of the salsas and sauces.  The interior:  Awesome.  I am such a fan of this smaller space that Abe's used to be located within.  It houses a lot of excitement, especially when this place blows up and has lines coming out the door too.  It is all part of the experience and part of the fun.  I'm a fan of the mostly white color scheme that they used as well as the fun graphics within the restaurant.  All in all, if you like Honest Abe's, you will like Como Se.  The fun and functioning flavors within the tacos, awesome and super nice staff, and generally pushing boundaries within Lincoln, NE confines of food, Como Se is a must stop for anyone who likes food in Lincoln, NE."], ["Peter W.", "I probably would have enjoyed this place a lot more if I didn't come so hungry. The guy behind the counter told me that two tacos should be enough for one person, so I took him up on that and ordered the special (slumdog millionaire I think) and the Jamaican sensation plus a side of the chips and guac. After my two infant-sized tacos came out, I realized I would need at least 5 tacos to approach satisfaction. They were indeed delicious, and I would definitely come back now that I know what I am in for. but given my hunger, I regret not going elsewhere."], ["Andrea F.", "This is a really different take on tacos, so if you're expecting traditional \"mexican\" tacos you're wrong. That being said, it's really refreshing to have a different take on tacos which bring some really unique and interesting flavors. We started off with the Guasacaca and spicy Chipotle salsa which were both very good. Not the best I've had, but still good. For tacos I had the One Night and the Peanut Gallery. I was very impressed with the Peanut Gallery (I'm a huge fan of Thai peanut sauce). Both tacos were very good. The tacos are very small but also pretty inexpensive. I loved the bread/tortilla they're served on. The restaurant is really tiny so it's difficult to sit down, this will likely be a spot they outgrow like Honest Abes although I don't think they will attract the same following. I would definitely recommend if you're in the mood for something different!"]], "Pancho Villa": [["Jill D.", "This place really surprised us. We came because of the good reviews and they were right!I got the carne asada chimichanga and it was the best chimi I have ever had in my life!  Huge too. Took about half of it home.  Hubs had a chile relleno burrito.  He really liked it but for whatever reason it didn't come with rice and beans and he missed them.  The thing I crave, however, is the tomatillo and avocado salsa.  My God...it is delectable!  Even after we could eat no more of our entrees, we kept munching on the chips and salsa."], ["Adrian B.", "Visited on a very busy Friday night with my two children.  The place was packed and there was only one server and she was drowning from the start.  I saw a sign that they are looking for additional help and they needed it.  I ordered a Shrimp dish with Diablo sauce which was very good, had a unique smokey Chipolte flavor infused with fresh lemon.  This was complimented by fresh tomatoes, lettuce, and lovely large slices of avocado.  It was impressive and what I imagine proper Mexican food tastes like.  My wife had a Shrimp Burrito which had nothing but rice and beans on one end and all the shrimp stuffed in the other.  You could tell the chef was run ragged.  The tortilla chips with Salsa were very greasy but the actual Salsa was fresh and spicy.  Something I appreciate but some people may not be able to handle.  My son had a beef taco meal which was plentiful and looked good.  So long story short we will go back when it's not so busy and they have help.  I feel the place has great potential for a family owned little restaurant.  It was hard to see people getting their own menus, watching chefs having to help take orders and waiting 45 minutes for our food."], ["Jay L.", "We were here a year ago and enjoyed it even more.  You have to get the guacamole based green sauce it's amazing!  I hope I can get some to go.   If I wasn't so full my plate would be empty. I ordered #24. Get it you'll love it.  I don't know how someone could give this place A bad review."], ["Ann G.", "This restaurant has a special place in my heart. Wednesday and Thursday nights are cheap margarita nights, and yes, they pack a punch! The food is excellent and portion sizes are generous. The fajitas are served with a flaming tequila show, which is fun. I tend to order the shrimp fajitas or Eli's deluxe plate, which has steak, shrimp, and cheese. The salsa here is probably the best in Lincoln. The green salsa has an avocado base, which is unusual and delicious, but don't forget to try the red salsa too."], ["Leo B.", "Great staff, friendly service, and the food was delicious!The kids menu had options that you actually won't feel bad feeding to your child. I highly recommend the steak & shrimp chimichanga!"], ["Rob R.", "The food was pretty good. The wife had margaritas, which looked excellent. I was not impressed by the location or the menu. The inside of the place seemed a bit underwhelming in my opinion as well. We went for lunch, so maybe it's better at dinner, I don't know. It was not a disappointment, but no real wow factor there for me at all."], ["Heather B.", "Hot. Fast. Fair prices. I think a lot of people drive right by and don't really realize it's in that sparsely filled strip mall thing. Check it out!"], ["Anita M.", "Worst restaurant EVER. Watch your bills people! My husband and I stopped in out of town. We ordered the guacamole and at 7 dollars were expecting a decent bowl of it. What came out was a half of an avocado mashed in a bowl the size of the small salsa bowl. They couldn't have used more than half of one avocado to make that order. Then they brought out red instead of green enchiladas, and what I received back was clearly re-doctored Red enchiladas covered in green sauce, it tasted awful. My husband ordered the chili Verde and it was mostly gristle with the occasional miracle of a piece of pork. Then we go to check out and all of a sudden our bill magically jumps several dollars. I was expecting to pay around 25 and she charged me 42. Claiming a mixup she then tells me that the guacamole I paid for was seven dollars. That barely covered the discrepancy in price and it was severely overpriced at that! After I disagreed with her and said that couldn't make up for the gap, she wouldn't show me the receipt itemized so I grabbed a menu and read the prices of what we ordered out loud. Only then did she relent and charge us less after comparing that to the total. It was my opinion that she was attempting to pad the bill. The place was silent and severely lacking. The food was slop at best. Stay far far away from this place!! I would give it zero stars if I could."], ["Jake M.", "Fantastic food, friendly staff. My go-to is the Expresso burrito with steak. The green salsa is also fantastic. Don't let the location fool you--this is one of Lincoln's best."], ["J M.", "Some of the best Mexican food I've ever had turned out to be in Nebraska. Go figure"], ["Shannon C.", "Amazing service, food and quality at a great price. As a California person I LOVE my Mexican and have high standards. This does not disappoint. Check it out and enjoy!"], ["Lindsay H.", "On a cross country drive and thought I'd risk getting Mexican food in NE, mostly due to its proximity to the freeway. SO glad I did!! The place is clean, the service was quick and friendly, and the food was great!! I had the veggie burrito and a house margarita. Loved how they put sauce over the burrito, but even if they hadn't, it still would have been great. Their guacamole was yummy and they didn't skimp putting it in my burrito--a huge plus for me! The two house salsas were delicious. Too bad I'm only passing though... Is gladly come back here again and again!"], ["Maddie L.", "Since when do you have to pay extra for salsa refills? I have to say, that was my favorite part of coming here- we could ignore the bad service and inconsistent food (and in fairness, when it was good, it was really good, but equally bad when it was bad) for that delicious green salsa. But frankly, if you're going to charge $1.95 to eat it, we'd just rather support another restaurant. It's just really, really bad business if you ask me."], ["Jacob H.", "This place is awesome! Very good food very good flavor. Try the green sauce! Very friendly staff."], ["Kendall R.", "Service was horrible.  Food was ok. But if you want great food,  go to Hacienda Real."], ["Mohan R.", "Excellent burrito! This place is middle of nowhere and it was one of the best Mexican food I have had."], ["Sadie S.", "Great staff, clean dinning area and great menu selection. Free chips and salsa and the chips were nice and hot the salsa was perfect. The portions are good sized and they got it out quickly. My son devoured his quesadilla and my fried chimichanga was gigantic. Only four stars because I felt they used too much cheese and it was a bit salty but I would absolutely love to try other menu items! Will be coming back"], ["Susan B.", "Grew up in Los Angeles and grew up with the best Mexican food i think...... and Pancho Villa is hands down one of the best ive had...."], ["Bob N.", "A simple strip mall cafe has produced one of the most amazing Mexican dinners that I have had in more years than I can remember.  The blended Margarita sparkled after 15 straight days of diving.  I had the 3 item Revolution dinner and it was served on a plate so large that it could have been a turkey platter. An amazing abundance of some of the best Mexican food I have had. The only problem I have is that I live in Palm Desert California and can't come back every week."], ["Chris L.", "Great chips and salsa, good proportions. We had 5 in our party and everyone enjoyed there food and drinks. I had the Mango margarita blended and it was perfect. We will eat there again."], ["Angela M.", "Authentic, yummy, and recommend the expresso burrito. Delish! the owner is great and hard working too!"], ["Christen N.", "I love eating at Pancho Villa. Their food is always freshly prepared and everything is made from scratch. The green salsa is amazing and I love the expresso burrito. They have really good lunch specials too."], ["Toni A.", "Yum! We stopped in on a Wednesday night for an impromptu dinner out. It was our first time visiting Pancho Villa's and I can confidently say that we will be back. Location: unless you know that this place is tucked in the corner of the strip mall, you could miss it. The open kitchen is nice and there is plenty of seating. Parking was easy. No TV! Yay! you can sit and chat without the background noise overwhelming your conversation. Menu:  Being an AZ transplant, I have eaten a lot of Mexican food and this was probably some of the best in Lincoln. Appetizers were 1/2 off so we ordered a quesadilla to start. It was huge and when paired with the green Avocado based salsa, delicious. Both salsas that come with the complimentary chips and salsas were just spicy enough. We each ordered a super burrito with carne asada for $8.95. It came with a light red chile sauce on it NOT tomato sauce like other have eluded too. `These were so big at one point I just couldn't take one more bite. We were full all night. Like literally, for HOURS. The food came out quickly and was good. $2.50 Margarita? YES PLEASE. They are fooling around with the margies. You have the choice of sugar or salt and they pack a punch. Fountain pepsi products, lots of bottled beers and Mexican cokes. There are a number of burrito options (yes, some even with parmesan cheese in them so READ the descriptions), combo plates, and appetizers. They were in the middle range of price but considering the quantity, freshness of the food and quick service it was worth it. Service: service was nice and she was very quick. With one server it may get a little slow but imagine they staff more people on busier nights.Overall: definitely going again. You should try it too if you haven't already. Wishlist:  White Menudo! with lots of hominy! They had to take it off the menu since no one ordered it."], ["Lisa G.", "I love Pancho Villa!  The food is delicious. I especially love the Guadalajara tacos & my fiancé loves their super nachos. Their margaritas are totally yummy!  I have liked everything I've eaten there."], ["Lynn W.", "I stopped in on my drive cross country.  I don't know what other Mexican cuisine is available in Nebraska, so I can't compare.  It was ok.  The service was friendly and fast, the food was fresh, but it was just ok.  I guess I was happy to find it instead of some fast food joint.The green salsa was very delicious. The Horchata was crunchy and not well mixed."], ["W J.", "Really good all around. Big margarita is great.  Had tacos and chile relleno. Quick service.  Will go back again."], ["Gabby A.", "I've eaten at Pancho Villa twice now and it has definitely given my other favorite sit down type mexican restaurants a run for their money.  This place is tasty.First the chips and salsa.  WOW.  They have two different kinds of salsa that you get complimentary with your meal.  One is a red salsa that has a nice kick to it and wonderful flavors.  The other is (for me at least) the star of the salsa show.  It's a green salsa with tomatillos and avocado.  YUM.  I love avocado, so a salsa verde that also boasts mushed up avocados is about the best thing to happen to my taste buds in quite some time.  The atmosphere leaves a bit to be desired, but it's clean and very bright.  There isn't a lot of decor on the walls and it's a bit bland.  Not a huge deal at all, because the food is awesome.  I just think a bit more character would help give it an extra punch.  The top shelf margaritas:  AWESOME.  Don't even waste your time with the cheaper marg.  These are more expensive and worth every single penny.  They make them from scratch.  No high fructose corn syrup laden mix in this drink.  Just the good stuff like you'd get in mexico.  Top shelf tequila, cointreau, fresh squeezed lime, salt on the rim and ice.  So simple, so delicious and so much better than a mix.The food:  Very good.  The first time I went I got the chili relleno burrito.  It was HUGE.  for 7.95 I got a burrito that was the size of my forearm.  The chili relleno was so good, with yummy cheese and a light batter.  It had more cheese, rice, beans and then a fantastic sauce on top.  The burrito sauce was seriously good stuff.  The second time i got a combo plate that came with an enchilada and a Guadalajara style taco.  I love the traditional tacos.  I got al pastor for the meat on my taco (you have your choice of meat for any of their dishes here) and chili verde in my enchilada.  Both of these were knock out.  The chili verde sauce was fantastic and the stewed pork in it was tender and flavorful.  The al pastor was also wonderful.  The marinade on the pork was flavorful and made the pork very juicy.  I really like the rice here and I'm pretty picky about my Mexican rice.  This stuff is very good.  The service is pretty good.  The first time our waitress was very friendly and helpful, the second time it was a little less so.  Over all, I think they really care about customer service and keeping their patrons happy.  If you haven't been, check this place out.  I think you will be pleasantly surprised."], ["kate w.", "Were you disappointed when Lucy's restaurant closed?  Luckily there's a nice replacement.  On the end of a strip mall behind a strip mall on the North side of Cornhusker.  The Santanas remodeled the interior for a cleaner look.  Totally different menu.  Start with complimentary chips and red and green salsa's.  The green salsa is from bits of avacodo not tomatillas.  This is not quacamole but it is good and a nice change from standard salsa.  We tried the regular burrito for $5.95.  A behemoth  stuffed with you choice of meat.  Combination platters range from $8 to $14 and include seafood and vegetarian offerings. Standard mexcan food items and some new twists like Tortas & Milanesa with emphasis on fresh food. I haven't had a chance to eat through the menu yet but so far it would make Pancho Villa proud."], ["Jim S.", "Wonderful Mexican Food.  It seems very authentic style yet quite tasty to a gringo.  The green sauce is some of the best i have ever had.  The people are very friendly and the prices are reasonable.  I scheduled a club meeting at this restaurant and everyone loved it!  Guess you can tell this is one of my favorites!"], ["Anastasia B.", "I want to drink the green salsa!"], ["Greg S.", "My wife and I love Mexican food so we thought we'd give PV a shot. Getting to it is not straight forward if you're coming from anywhere but east. However, the roundabout way was worth the effort. The atmosphere has a native flavor (i.e. music and decor) in a clean modern strip mall. The food that we had was flavorful, especially my wife's enchilada and taco. My chili verde was good but could have used more verde sauce. The chips and salsa was very good and you get a guacamole sauce with a hot salsa. Prices are about par for Lincoln's Mexican restaurants. All-in-all it was a good decent meal and we will be going back."], ["Lisa B.", "We hungry travelers stopped at PV while passing through Lincoln.  The nachos and two side order enchiladas fed my friend and I for THREE FULL MEALS; and we certainly don't eat like birds!  The enchiladas and nachos were made of the same ingredients so there wasn't much variety for our buds, but all around very tasty!  Stop in!"], ["Anita B.", "Excellent! Seems a small menu restaurant but will surprise you! Homemade dishes that will please the palate!"], ["Ben L.", "A solid Mexican restaurant tucked away in a little strip mall.  It could be easy to miss but it's definitely worth it check this place out.  They have an extensive menu and the food is quite good, featuring things you're unlikely to find in more \"Americanized\" Tex-Mex style restaurants like menudo and meat selections like lengua (beef tongue) and cabeza (beef cheek).  I ordered the super burrito, which is absolutely massive.  It's enough food for at least 2 or more meals and a great deal for only $6.95.  Most of the entrees range in the $6-$12 price range.  I look forward to coming back and trying something else off the menu."]], "Oso Burrito-Meadows": [["Kaitlyn H.", "I love OSO, I've been coming here since I was in high school. They have great vegetarian options and specialty burritos. Support local business!"], ["Jerad D.", "I've been to this restaurant about 5 times total, but today will probably be my last time. The food itself is really tasty, similar to a chipotle. The food is the only reason I have come back somany times. When you approach the restaurant will appear closed due to the dark decor, low lighting and nobody behind the counter, but you will find it open at normal timesEvery time I walk into the place ALL of the employees are outside smoking. I don't alway dine at traditional meal times, but this is consistent behavior for weekends, evenings etc.  Then of course you have to wait until someone decides to come in and help you, wash and dry hands, find gloves, etc. The food prep section is dirty, with employee drinks, dirty dishes and assorted crap all over. The place isn't busy most of the times I have been in here, but there are always dirty tables and food all over the ground. Tl;dr The food tastes good but the manager, if there even is one should be fired. This is what a chipotle would be like if it were run by 17 year olds."], ["Jill S.", "Get the nachos they are huge! The grizzly sauce is a must also, it's a spicy red sauce. They have mulligatawny soup, random I know. It's actually really good and a great substitute for the ovens soup. I wasn't a huge fan of the fish burrito but that's probably because my allegiance is to Deleons on that front. The loaded fries and chips and guac (you can get a free side of any of the salsas with it, just ask) are a great accompaniment to a burrito. When you want a break from chipotle of qdoba this is the place to go. They also have great vegetarian options such as potato and tofu to add to your burritos or rice plates"], ["Sam K.", "Puts Chipotle and Qdoba to shame. A little pricey so you would expect things like the decor to be nicer but have never been dissatisfied with the food. Keep it up!"], ["Jill S.", "Holy Cow this place is yummy! The variety and quality of food is awesome. I highly recommend to any burrito lover."], ["Mutts W.", "A curry burrito?! That's got Mutts written all over it. It's like going to a Chipotle at the UN, but all the delegates get along. Costs more than our usual tour fare from TBell, but well worth the investment. If you're gigging in Lincoln,  definitely worth dropping in."], ["Teddy W.", "Bad ass food, but the place is kinda whack. It's never open, they close early whenever they feel like, and now they have posted on their Facebook that they deliver. Which is a lie. Metro dinning delivers, but under those standards Popeyes, KFC, Olive Garden, and Chucky Cheeses deliver. It's the gnarly dirty place to get a burrito, but it's ran by people that don't take it serious. If a smart person owned the place it could be a goldmine."], ["Rusty S.", "This is a great burrito place if you have the ability to actually enjoy something that isn't a corporation.  Qdoba and Chipotle are great at giving you a standard burrito, i.e. rice, beans, w/ chicken, beef or pork.  OSO does have the ability to give you that standard burrito or rice bowl but where they really shine is in their specialty burritos.  I have tried numerous different styles and they are excellent, but my all-time favorite is the Buffalo Chicken burrito.  I suggest requesting that they \"double steam\" or steam the burrito twice since sometimes a small amount of the burrito could be slightly cold if you get too many toppings (which I seem to also do, I can't help myself).  This is a great local place and I will never be back to Chipotle or Qdoba."], ["Keith S.", "Love this place! As a burrito aficionado I can say this is hands down the best burrito in town. Their salsa is where it's at...try the grizzly. Staff is friendly too!"], ["Steven S.", "BEST BURRITOS IN TOWN!!!!  Very awesome and helpful staff too!"], ["Dani W.", "I got a chicken rice bowl and added all my usual toppings.  I'm not a fan of the chicken flavored rice.  Otherwise I was pretty happy with it.  Also got guac and chips and fail on the store bought chips and guac with minimal flavor.  One saving grace I noticed was that there is Faygo for sale!  I might come back just to get a rock n rye.I prefer Chipotle but this is closer to home so I'll probably try it again."], ["Brittany S.", "Want a burrito that is a million times better than anything you could ever get at Chipotle? This is the place to get it! The food is consistently amazing... every single time I come here, everything is fresh, hot and delicious. What makes this place especially wonderful, though, is the large selection of proteins and sauces. Even vegetarians have options here (they're not just limited to eating beans... mushrooms and tofu are also offered!). For a truly excellent burrito, I would recommend the chicken pesto burrito. However, I don't think that you'll be disappointed with any of them... they're all amazing!"], ["Ruth F.", "This place uses local ingredients when available; I suppose that wouldn't include this time of year.They're vegetarian friendly; you can get tofu, portabella mushrooms, potatoes or guacamole instead of meat.  Even the soup was listed as being vegan.  They sell alcohol (beer, mostly) and an interesting assortment of indie-ish sodas (Sioux City and one other brand) in addition to the usual soda products or Gatorade.  Some interesting choices, such as peanut sauce (?).  Mini burritos are available for the kiddies, as are waffle fries (fried while you wait).  Oh, and they have coloring mini-booklets and buckets o' crayons for the little ones.Got my fajita burrito on a plate instead of in a wrap; it was cold and I'm not sure why there were raw carrots in it (?).  My spouse seemed content with his guacamole burrito, and my dining companion liked her nachos.  Would have been 4 stars if the peppers had been warm, for the vegetarian options and the indie sodas if nothing else.  They're local, and I'd pick them over Chipotle for that, but I don't know if I could say they were better."], ["Gret P.", "I grew up in Nebr, eating the various burritos the state had to offer.  Never have I come across one so gripping.  I am absolutely in love with the pineapple habanero salsa that was drizzles throughout my potato burrito, and I have been dreaming about it ever since.  When I go back to visit family I will definitely be making a stop here!"], ["Shovel S.", "I am certain that no finer burrito exists in Nebraska.      Oso was unexpectedly badass and I wanted to tie the whole restaurant to my car and bring it home to AZ with me."], ["Skoolly T.", "I couldnt ask for a better burrito! Good Job Lincoln!"], ["Herb H.", "Just like chipotle in my opinion. Same food, same price, same environment, different name, not corporate."], ["Doug D.", "One of my favorite places to eat in Lincoln. Always consistently good and friendly staff as well. My favorite is the fish tacos and the Big Nachos with pulled pork."], ["David F.", "The food is fine, but on a Sunday afternoon, the bathrooms are disgusting. Really no excuse for this. And judging by the state of the fixtures, the management/owners pay very little attention to this. Very, very disappointing."]], "Amigos/Kings Classic": [["Jill S.", "I wanted to take the time to give 5 stars for some of the best fast food service I have ever had. The employees were super nice, really enjoyed my stop for lunch"], ["Lisa P.", "This is the best quick mexi/american place for food. One of my favorites"], ["Peggy C.", "Service was great, it was the best wrap I have ever had at amigos! Thank you Firas and Jamal!"], ["Donald G.", "3 times I went to this locations before I got it through my head not to go back. Each of these times the fried items that I got were not crispy as you would think. Like my crisp meat burrito was anything but and was actually COLD in the middle... 3 times! The mexi fries are barely fried enough either. This place is lucky they haven't gotten someone sick but it is gonna happen soon... and it won't be me."], ["Jennifer A.", "Mmmm \"Mexican\" food! After a night of drinking and mediocre food at Chez Hay, the BF and I were ready for some grubbin. They had some interesting choices and I wanted something greasy and fried. I went with the crispy chicken \"burrito.\" Sorry for all the quotation marks, but this was not a burrito. It was more of a large taquito or perhaps a flauta. Whatever it was, it was good! Nice and crisp on the outside and filled with some kind of white chicken filling. It tasted slightly ranch-y. I could have eaten 3 or 4 of these. I forgot how much it cost, but I think it was almost $2.50 which is sorta pricey considering the size. The BF had a few tacos and there were no complaints there either.Next time I'm in Lincoln, I will be stopping by again. This place is loads better than Taco Johns,"], ["Austin B.", "I've got a big, hardened, decaying spot in my heart for Amigos.  The soft tacos are great, one of my favorite applications of sour cream.  That and they always have that big tub of hot nacho cheese next to the condiments, mmmmmm.  For better or for worse, it is some of the greasiest fast food that you are going to find and that's probably the only reason it tastes good.  I think it's probably a little overpriced for what you get, especially considering they don't bus the tables for you anymore..."], ["Kate M.", "mmmm.....Amigos. Best fast food Mexican in Lincoln! The tacos are fabulous!! Crispos are good, the crisp meat burrito is delicious and the mexi-fries are yummy! The best item on the menu? Their nachos. The only thing that makes me sad about Amigos? The fact that they are only in Nebraska. Make some expansion plans!!!"], ["Jules T.", "It was a high school and college favorite. It's awful food and it's not really mexican, but I'll stick by it."]], "El Potrero": [["Jill H.", "My daughter and I love to eat at Mexican restaurants and we have pretty high standards for what is considered \"good\"  El Potrero is \"okay\".  The chips were warm and arrived well before the drinks, which was weird because eating them made us thirsty.  The salsa was mediocre; I thought it was okay, my daughter didn't like it.  Our server seemed either confused, unhappy, resentful, or a combination of all three.  He kept backing away from us when we were ordering... what's up with that?  Turns out he wanted nothing to do with us and we only saw him one other time when he actually brought refills for the completely dry/empty drinks.  I had to get up and go inside to find someone to get our bill.  The saving grace for the visit was the fajitas - they were good!  I got chicken and my daughter got steak.  We each had some of the other's and they were hot and tasty and the vegetables were nice.  The patio is a lovely place to eat but this restaurant REALLY needs to address the problem with their service before they lose all of their customers."], ["Weston J.", "The food was good.Margarita is so big. I drank the drink gone. Arroz con Pollo.Also, did I mention thebig margarita?Haiku."], ["Don M.", "Not sure how this place has stayed in business so long.  Very sub-par.   Great location though."], ["Ruth S.", "No good. No blending of the margaritas. Their cheese was gross! It was pretty milky, not your standard chihuahua. Chips tasted funky but were fresh. Lacked salt and the salsa had no kick. They wouldn't split our check or accept more than one form of payment. The waiter made rounds never; but when I did manage to flag him down they did bring what was asked for. They were accommodating with our large group on the patio but other than that I have nothing good to say about the place!"], ["DJ H.", "The tamales had the consistency (and flavor) of tire tread. Apparently, they were made then refrigerated (or maybe even frozen), then heated up (or thawed out) in a microwave. The chile rellenos were, likewise, inedible, They were obviously not fresh either and, to make matters worse, the seeds were left in. (They are always supposed to be taken out.) The rellenos were way too hot to eat.Also, tomato sauce is for Italian pasta not a relleno. How about looking up a recipe for relleno sauce?The rice and beans had no flavor at all.The waiter must have called me \"amigo\" thirty times. It got kind of irritating after a while. He should have called me the Spanish word for \"fool.\" As a Mexican, he must know what the food is supposed to be like, so I assume he knew what awful food he was serving.  Ergo, I felt like I was being treated like a 'dumb gringo\" who didn't know any better.The 100% absolutely worse Mexican food I've ever had.This place makes one long for Taco Bell."], ["Kendall D.", "Service wasn't great, considering we were the only table there. Food took... what seemed like a lifetime. Overall, it was good, not great... just average. There are better Mexican restaurants in town."], ["Blake H.", "Worst service EVER! I had to get up twice to ask our waitress for service. I do NOT recommend, nor will I ever return. The food and drinks were not worth it at all"], ["Sydney M.", "Ew yuck gross gag. Such a lovely location wasted on such crap food. I tried to eat the enchiladas, each flavor was worse than the last. Cheese tasted like rubber bands, refried beans were gray mushy matter with no sign of ever existing in bean form. The chicken had cartilage or something else unidentifiable and hard in it and the ground beef was over seasoned. All in all under huge wet slabs of lettuce, it sat, in a puddle of watery sludge. I wish I could tell you the trip was at least worth the margarita, but sadly it wasn't. Jalapeño margarita has actual chunks pickled jalapeños blended  in, not the best texture. Never again El Potrero!"], ["Mackenzie B.", "The food here is excellent! The customer service ,however, doesn't match the food. We sat on the lovely patio area that over looks the Haymarket and we had several waiters ask us for both our Drink order and our food order. It seemed that they had no system on who was waiting the tables. The food is terrific though, definitely worth it."], ["Katie C.", "I give it 5 stars because my husband and I have gone here for lunch regularly for about 6 years. Their lunch menu is good and their service at lunch is fast. We like the tamale, caldo de cameron, and the beef fajita."], ["Tina F.", "Don't go here place sucks. Food wasn't to bad . Services was horrible. Waited for ever to get drinks and food ,ask for something never got it. Order 2nd drink got it the wrong thing . Waitress act like she was half a sleep. Never going back."], ["Kristine N.", "Ordered a grilled chicken salad and a side of steamed veggies to go. The salad was a good mix of spinach and other greens, tons on flavorful chicken, and tortilla strips. The side of veggies was a whole dinner plate of veggies, good deal for a couple bucks. Came with fresh & warm chips and salsa. Yum."], ["HB B.", "First time here and I wish I lived  closer. great service and great food. hot fresh chips and fresh home salsa!!! I had the chiminchunga supreme with shrimp and mushrooms,  simply awesome!"], ["Brad E.", "Don't waste your money. I had a steak chimichanga which was suppose to be deep fried instead it was soggy and the steak was like chewing rubber"], ["Aimee K.", "Another Lincoln review I forgot to write... this place gets the job done when you're craving Mexican food! It probably won't blow you away but I'm generally A-OK with a solid margarita, rice and beans, and a cheese enchilada. That's what I ordered here (plus a beef taco) and it all tasted great! The margarita was standard but I was happy with it, and the food overall was excellent. My friend adored the shrimp tacos, for you seafood lovers.Environment and service is only so-so, but if it's nice, sit outside! The patio is so nice and overlooks the busy Haymarket and it definitely beats the atmosphere of inside the place, where it's pretty quiet. Cheap Mexican food, good margaritas, a kick-ass patio... what else do you want from a casual dinner? Go try it out and end up in a food coma like I did. It'll be worth it!"], ["Ben Y.", "This place used to be one of favorites, but the food is awful now.  They use THE ENTIRE chicken...I won't get any more graphic but that pretty much explains it.  I hope some new ownership takes over and turns it back into a wonderful place to enjoy Lincoln's Haymarket District."], ["William P.", "Location/space are both good. Food is bad, cheese is plasticky and menu is unimaginative. I have a hard time understanding why this place is still in business, but clearly my opinions on this place are in the minority."], ["Mike D.", "The evening was beautifulThe food was OKThe service made my birthday last a decade,  I only wanted dessertI thought it worth the waitSo ordered a dinner  and appetizers in anticipateWhen the food came The water did not, and I found myself choking on beans, rice and the lotFinally awaiting my sopapilla I needed only to order But the waitress apparently headed for the border. I never received  a dessertNor the candles on my cakeBut I did get a bill to finish my wake.  Not having my special birthday dessert I feel hurt, cheated and robbed And knowing my age without candles, I just sobbed.  As for El PotreroI will never go backAnd will recommend that you keep their menu out of your stack.  Yuck!"], ["Mary G.", "I've frequented El Potrero on numerous occasions.  While I enjoy the patio and location in the Haymarket, I'm really fed up with their service and quality of food. Their queso blanco, looks like whole milk from the gallon with very little flavor.  It takes forever for water refills, to order drinks, etc... I'm glad that the Haymarket is expanding and new restaurants are opening up."], ["Bob B.", "If you like canned crushed tomatoes, you'll love the salsa, and chile colorado. Service was okay, beer was fairly cheap, but the food was horrible. Sauce for the chile colorado was canned tomatoes and hot sauce, which wasn't cooked very long, still tasted like the can. The meat in most decent restaurants would be fairly large chunks of beef, there's was grilled round steak (with plenty of gristle) that was just thrown into the sauce, not simmered in it as it should be and the menu claimed.There are a lot of places to eat in Haymarket, this won't be one I return to on the next trip to town."], ["Alisha B.", "My friends and I love going here for dinner. Service can be sub-par, but we love the food and drinks. I could live off of the cheese dip and I've never had anything I didn't like off the menu. They just added a few new menu items and they were delicious! And if you go for your birthday, you get a free shot of top shelf tequila :)"], ["Becca H.", "My burrito was pretty good and I would be willing to go back, but the service was not great. When we asked for specific things it was quick but we waited for a while to get drinks refilled and the queso dip took so long that we ended up cancelling it. We also waited ages for the waiter to come by so we could ask for the check."], ["Jeff Q.", "The food was good.  The burritos were both very filling.  Even on a busy night, due to a men's Nebraska basketball game, we got in and out in 45 minutes.  Service was slow at start but once we got our waiter the service was excellent.  Margarita was also good."], ["Susan S.", "We love this place!  The chips and salsa are out of this world and the service has always been great.  Sometimes it's a little slower than others, but it's a hopping area and can get super busy.  The margaritas are good, not great...you will want to go to LaPaz for the margaritas...but the food is better here.  The cheese dip is awesome, as is the salsa.  I don't think I've ever ordered food I didn't really enjoy.  When I was single, my friend and I  would come here every Friday before the bars and split the huge margarita and fajitas (plenty for 2).  Now that I'm married, we bring the twins and they always find something that they enjoy as well.   My folks make a point to stop here for lunch every time they come to town.  The outdoor seating is an extra bonus when it's nice outside!"], ["Ricardo A.", "I would a give another star to this restaurant but the service was a little slowbut they are friendlier! The food is great and give u big portions...but the waiters only show up to take your order and to take the plates away...they should try and make conversation with your guests..."], ["Abby G.", "The food here is cheap for a reason. I got the tacos supreme, they came out with only half of the stuff on them that was supposed to be on them, and they were mostly lettuce. I would have said something to the waiter, but it took him forever to come back. The service in general was not very good. It would be a good place to have a few drinks and eat chips and salsa, but you can get much better food at pretty much any other restaurant in the surrounding area."], ["Elise H.", "I'm Mexican and I love this place! This place, along with its sister locations in GI, Kearney, and Omaha, are the only mexican restaurants my family will eat at. Margarita pitchers, $2 house tequila, and a great patio in the Haymarket.I always go with the tostaguac or chile relleno (both on the a la carte menu). Shrimp nachos are another favorite. Anything with that delicious white sauce on it is sure to please. Love this place, love all the cute Mexican boys working here, and will continue to spend birthdays, game days, and random week nights basking in the tradition that is EL POTRERO. Ole!!"], ["D S.", "Stopped here hoping to enjoy some great Mexican food.  Chips and salsa left a lot to be desired.  Ordered enchiladas with green sauce, which were rather bland even with the sauce.  My wife had tacos de carne asada which were also mediocre and overpriced.  Service was marginal.  Food came FAST...like too fast!   Made me think all they had to do was reheat it.  Anyway, wouldn't go back.  We have Mexican everywhere we go and we cannot recommend this place except to gringos who wouldn't know any better anyway."], ["Jessica J.", "Listen - I'm from Los Angeles.  No mexican food can compare.  But this place is cheap, SUPER FAST & relatively tasty.  What do you expect for Mexican food several thousand miles away from Baja?  It's cheap, easy & tasty... that is a winner in my book."], ["lynn n.", "Their lunch specials are reasonably priced.  The service was great and the food was pretty good.  I ordered the chicken fajitas lunch special and a lemonade.  The fajitas came with rice, beans, guac, sour cream, salsa, and 4 small tortillas.  The chicken fajita portion was large enough to share.  The total bill was under $10.  It's a great casual restaurant and their drink specials are tempting and cheap."], ["John R.", "This place is just gross. BEFORE I read in the paper that it had numerous health code violations, I've eaten here probably twice. It was just awful, i returned only for the margaritas..but have not been back since. It sits itself in the Haymarket, which hosts a verity of restaurants and bars. However, this is the worst restaurant out of the bunch. Simply put, it is flavorless \"Mexican\" food... not fresh, not appetizing on any level."], ["jennie p.", "What I like about it: Patio seating in the Haymarket, pitchers of margaritas and pina coladas, free chips and salsa, service is decent, and a good happy hour.What I don't like about it: The food is awful, bland and boring. Come for the booze, but don't come hungry.The food at La Paz is better."], ["Joel G.", "Pretty good taco salad."], ["Kaytee D.", "Better than I expected, considering I've been living in California for 20+ years. Sure, \"carne\" here means ground beef and the cheese is a little more Velveeta than cojita, but this is the Tex-Mex you grew up with. The chips were warm, the margaritas cold and the Happy Hour long. Great service, too."], ["Dana N.", "Wow just discovered this place-in OMAHA! Apparently it has been there 6 mos- Really good, fresh tasty mexican food. Also from LA and not too many good authentic mexican places here except Riveras on 120th/blondo, alvarados on 90th and a few places on 24th. However this restaurant is a BIG family size restaurant. Had a steak burrito-excellent. Husband is Peruvian and thought his food was excellent too and big portions. Will be back for sure. Great chips and salsa also"], ["Virginia M.", "My brother and I had lunch at  El Potrero in the Lincoln Hay Market mid week, mid afternoon.  I loved it, but then what do I know, just having flown in from a Grits and Rice state   I say try it...especially if you are touring the Hay Market area!!  From reading the other reviews I wish we  could have stayed for Happy Hour.VA from SC"], ["David C.", "Bland Mexican food.  Nice patio. Great location in the Haymarket District.  Enchilada platter was ok, carne asada tacos nothing but a mountain of carne.  Food was inexpensive.  Chips and salsa pretty good."], ["Stephen B.", "Terrible food. Unless you're looking for 7-11 style microwaveable burritos, enchiladas etc. The \"wet mole sauce\" they pour on their food is on par with a can of chef-boy-ardee. The best thing about this place is the drink menu. Large pitcher margaritas starting around 15 bucks, with a number of options to upgrade the liquor quality for a few dollars more. Go here for drinks and sit on the patio."], ["Topher T.", "Came here for lunch. The food was good. I had the fajitas. The plates came out sizzling and hot. The steak was juicy as well as the chicken and  the shrimp wasnt over cooked. My friend had the chicken quesadillas. Great presentation and a large portions. The margaritas were delicious, even though our orders were wrong. I ordered a strawberry margarita on the rocks with sugar and I got salt. My friend ordered a mango blended margarita and received a lime margarita. Other than that, the food was good and will come back."], ["Glenn C.", "We ate here when we dropped our son off for college in August, 08. It was pretty much by default because downtown was busy and El Potrero was the only place we could get a big group in. The food wasn't terrible, just not really much flavor to it. Mid-west mexican some would say. The service was OK and they did accomodate a big group pretty quickly."], ["Kim G.", "Ate here today and it was pretty good.  We eat a lot of Mexican food.  I always get chicken and El Potrero's is simmered in a good sauce (some places it's plain chicken!).  I LOVED the enchilada sauce; it was kind of like a cheesy ranchero.  Had two chicken hard-shell tacos and the shells were actually thick enough to keep from falling apart from the moisture of the simmered chicken.  Here they use Monterey Jack instead of Cheddar (which I like).  The salsa had a lot of flavor - lime and tomatillos - but no heat at all.  Nothing was spicy, but it did have good flavor otherwise.  The strawberry margarita was so strong I couldn't finish it!  Prices were unbelievably low.  The kids had chicken strips and french fries which were exceptional compared to most.  Service was awesome but we were there at 1:30pm on a Monday so it was fairly empty.  I subtract a star for the lack of spice only."]], "El Toro Mexican Restaurant": [["Chad T.", "This is our favorite place to go for a night out for Mexican food.  The wait staff makes the experience a positive one as they are attentive, friendly and quick with refills.  Portions are generous and I am yet to try something that I did not enjoy.  The environment is good for bringing your family and we love to treat out-of-towners to a treat at El Toro.  Price is comparable to any casual dining Mexican restaurant in town.  5 Stars"], ["Sookie M.", "Sadly disappointing!We went here based on previous Yelp reviews looking for a solid Mexican place, but sadly we were highly disappointed.The restaurant itself is nice, though rather small and had a fairly long wait line. The staff was impressive as well, attentive and friendly.As for the food-- the chips and salsa were amazing (and free!). Easily the best part of the meal and I appreciated their offering of both hot and mild salsa. These salsas tasted fresh and delicious.I ordered two enchiladas and a taco combo and my wife had ordered the taco and tamale combo. To say it was bland and boring is an understatement. Both my wife and I had similar complaints, just underwhelming overall. Very disappointed considering some previous reviews... Hope we just ordered the wrong plates but I would have a very difficult time recommending this place after our experience."], ["Scott N.", "Consistently good food with excellent service. Prices are reasonable. Wide variety on the menu. Nothing fancy, just good Mexican food."], ["Drey C.", "I'd say one of the best Mexican restaurants in town. With lots of options and great food."], ["Marcella W.", "Pretty strong Mexican food for Lincoln! Better than the handful of other Mexican places I've tried. The chimichanga was tasty, and I liked that they serve cheese only options as well as meat, because I really liked it that way. The guacamole was also particularly good, exactly like the guacamole at the Mexican restaurant I got at our favorite Mexican place growing up. Beans and rice and chips were pretty middle of the road, though the salsa was good. Service was fast despite the crowded state of the restaurant."], ["Zac V.", "If you don't like El Toro, you're a fool. Always delicious, never takes too long to sit down or to get your order."], ["Sam K.", "This is a FANTASTIC authentic Mexican restaurant. One of my favorites in Lincoln. I order something new each time and am \"wowed\" by the flavor that explodes in my mouth (my favorite of all time were the tamales). Highly recommended!"], ["David S.", "El Toro is our regular Mexican restaurant in LIncoln.  The food is great and the Margaritas are the best in town.  And best of all, the staff and management will treat you like family when they have seen you in a few times."], ["Susan R.", "I grew up in the Lincoln area-El Toro is one of the places I always look forward to when I visit. Every entree I've tried has been fantastic and the margaritas are superb. The servers are knowledgable and friendly, graciously accommodating a friend with allergies. And it's a Great value! Can't wait to eat there again!"], ["Brian B.", "Stopped in for a late lunch, got 2 beef tacos with beans and rice.  Beef was a little bland, but the beans, rice, and salsa were excellent!"], ["Kate K.", "Just recently decided that El Toro is the only restaurant where we can go and always have a good experience. Food is consistently good. We often get their fajitas, and I'm also a big fan of their mole.  Chips are great, waitstaff is great.  Trying to think about anything negative.... Hmmmm. Um. I got nothing.  I have insider info that their kitchen is one of the cleanest in town.  Even their high chairs are clean and believe me, most places high chairs are truly disgusting."], ["Kenny A.", "The food actually filled me up!!! Very delicious and very happy with the food and service.. Best Mexican Restraunt to eat at!!"], ["Daniel G.", "The same wait staff has been there for years.  They are very professional & genuine.  I hesitate to share one of my favorite things about the place because it could be seen as a negative, but here goes...   You can always get in.  Even on mothers day @ 12:30, no waiting.  Its like people forget about it, idk.  I have NEVER been disappointed there, & usual visit once a month."], ["Jack F.", "I had given up on Mexican up north.  But my two nieces talked me into this one  -- I went knowing I would not like it but I wouldn't say anything to hurt my  beautiful ladies -- boy I learned a lesson!  Listen to the ladies!!This place not only has vegetarian on the menu  -  they listened to what I wanted that wasn't on the menu and made it for me to perfection.  Salsa (which is what I judge most Mexican restaurants by) was very good.  Then I asked for their hot Salsa, telling them Im a Salsa type guy, they brought me a real hot one, plus a couple of more for me to try.  I ended up with a great dinning experience.  My wife agrees with me on this one - you need to try it yourself.  Especially if you actually life in this snowbound area and like Mexican food   -- here is your one spot in Lincoln to get the real deal!  No ketchup salsa here!!"], ["Erica M.", "I have been coming to this restaurant for YEARS and i absolutely love it. They seriously have the BEST mild salsa ive ever tasted ( I actually order it by the 16 oz container several times a month!) YUM!"], ["Adrian B.", "As stated in previous reviews this is not high class dinning experience but if you want a local neighborhood Mexican restaurant with large portions and friendly service this is the place.  It's always packed on the weekends with a line out of the door, so that's a positive sign.  You are always greeted up entering and do not have to wait long for a table.  The prices are fair and the portions are gargantuan, we always leave with a to go box.  It's just up the street from my house and is a nice backup if dinner does not turn out well (don't tell my wife he-he) or I just want a warm meal, total comfort food.  This restaurant has been open for over 15 years and will continue in the same legacy."], ["Shaun S.", "Awful experience. Watery stringy chicken, flavorlous black beans.  The chips and salsa were decent., Im not sure how a chile rellano can have no flavor but they pulled it off.  I saw some kids enjoying chicken nuggets and fries.  Should have went for that."], ["Tanner H.", "This tiny, hole-in-the-wall Mexican has become one of my South Lincoln favorites. I find myself making a weekly appearance there and I have to this point never left disappointed. If we're talking strictly cuisine, I do feel there are better Mexican restaurants in Lincoln, but El Toro comes with some perks that set it over the top. Food -Good, fresh, and huge. Always start with the complimentary chips and salsa, which is nothing too extraordinary. I always fancy their hot salsa myself. I am always a fan of their Arroz con Pollo, any fajita platter, and (on occasions) their Chorizo con Huevos. I tend to stay away from fried food, but my friends always enjoy their chimichangas and burritos just fine. When I go with my fiance, we normally split a meal and both leave stuffed. I feel that I'm a pretty big eater, but their plates tend to be ginormous. So either go hungry, or bring a friend. I've never had enough room for desserts.Drinks-Ladies and gentlemen, this is the reason I have given El Toro 4 stars. Wednesday and Thursday, El Toro has very healthy sized  flavored margaritas for $2.50. Let's just say after two of there, I'm looking for someone to drive me home. They have over five flavors to choose from for the special, but my personal favorite has become the blue on the rocks with salt on the rim. They also run beer specials on Mondays and Tuesday. I have also had their pina colada, and was quite impressed - though the amount of real coconut milk is probably enough to clog my arteries for a while! Service-Only once has there been a little mix up in who was supposed to take our order, but besides that it is always fine. They have one man there (I assume he is the owner or the manager) who is dynamite, always a bright face and adds a lot to the experience. All the other servers are very timely and helpful, they have a small staff so they tend to be very experienced. It should be noted that El Toro is quite small, they only have 2 locations where tables of five or more can sit, so taking a group of over four is not highly advisable without a reservation. Overall, it's a very charming restaurant. Good food, good drinks (unbeatable specials), and good staff."], ["Shon M.", "I'm from California and I miss good Mexican food.  El Torro is one of the best places I've been in the Midwest.  I'm also a vegetarian and they have a number of good options."], ["Meg J.", "The chips and salsa are so great I even call them to go."], ["Cheryl N.", "Food is the most authentic I have found in Lincoln.  Great food and service.  It is a total dive restaurant but clean....just a dive.   If you aren't the Carlos oKelly type of diner, you will love it."], ["Jerad D.", "I used to like this place a lot. Either my tastes have changed or they have, but, the huge portions are not enough for me anymore.  Every dish is full of sauce, and it seems like they are trying to cover up the real ingredients. I generally like the Morales restaurants, but this is my least favorite."], ["Poncho Y.", "As a Mexican, not.that tasty, chili Colorado very bland and pork verde as well. Very disappointed."], ["Chris E.", "I grew up eating Mexican food. The food here is average Northern Mexican \"home cookin'.\" The lighting is horrible and the waiters insist on calling us Gringos, \"amigo.\" I am not their friend ... I'm a customer. Last time I went I waited as the hostess took take out orders and ignored my party ... we walked out. Go to New Mexico for good Mexican cooking. The Morales chain if cafes is vastly over rated."], ["Ryan C.", "Diamond in the rough. From the outside it doesn't look like much. Its located in a small commercial space in the corner of a strip mall. But once you walk in the door you know its legit. From the staff, to the food, to the prices, its about as good as it gets in the capital city. Food is VERY flavorful and comes with big portions so bring your A-game. Seating is limited, and this place is always packed so go early for a table."], ["Brad G.", "This may have been the worst mexican food I have ever had.  I ordered the advertised special, Pollo Arozo for $11.99.  It tasted like dirt, really bad dirt.  The tortillas were hard.  My friend had a combination plate and it was not much better.  The chicken enchilada was canned tasting.  The portions are huge though.  Huge portions of bad food."]], "Qdoba Mexican Grill": [["Jill S.", "Great service today! Everyone was super nice and the guy who made my new style of tacos took a little bit of time because they are very complicated and I tried three different kinds. But he offered suggestions and talked to me while he made them which made the wait tolerable. Not to mention this addition to the menu is so fun! They have creative combos. You can get them on corn or flower and one of them is even a double decker taco with a hard shell inside glued with nacho cheese sauce to the soft shell! It was hard to choose a favorite out of the 3, they all offered something different. Can't wait to try the other 3 next time to narrow done my favorites!"], ["Caden Z.", "Overall: Good food, little more expensive than I would like. Food:The smothered burrito is a great option. Atmosphere:When I went (around 3 PM) it was almost empty inside, which was nice."], ["Seth M.", "If you would like to dip your bland chip into some form of cheese creamer mix with the occasional goodie found in concoction along side pretty decent burrito this place is for you."], ["Jason B.", "I wanted a quesadilla, and saw this place. These guys take their quesadilla seriously. There was a long counter with a large selection of ingredients, sort of like a subways, but better. She made me one about the size of a dinner plate and it was delicious!  They make other stuff here also, but I'm coming back for their fantastic quesadilla. Well done guys"], ["Kiara M.", "Workers are nice. Always clean. Food is pretty good but their chips are way to salty! I love salt and I can't handle it so that's saying something! I have to pick through my Chips and that's a problem. Other than that I love everything else"], ["Erik Y.", "Pretty good 'Mexican' burrito place.  I like this a little better then Chipolte simply because they keep the meat more mild and if you want spicy you can add sauce to spice it up.  My mom can't have to much in the way of spicy foods so I tend to take her to Qdoba because she loves mexican but not the spicy stuff.If you do like spicy, the green sauce is mild and very tasty, the red is a bit hot but not bad.  I think they might have another sauce that is super hot but I have not tried it.Staff was nice enough but they were so busy for lunch I did not expect much.  Price is just like every place else, about $6-8 for lunch.  The Guac is very good, and fresh made which is a big plus in my book.Bottom Line, this place is good, but not going to knock your socks off.  Nice option for a big burrito or taco's for lunch, but try the Guac, its very good."], ["Alek Z.", "Surprised I'm the first one to review here, this place is a pretty popular spot. And they're pretty good. Their nachos and queso are delish, and their burritos ain't bad at all. They also serve beer, but their selection's limited to like Miller Lite, Bud Light, Negra Modelo and a few others. Plenty of seating, plus I think there's a second story, though I haven't been up there yet. Prices ain't too bad.Definitely recommend this location."], ["M M.", "Came here to eat outside on the rooftop during the beautiful weekend weather.  Where I'm not a huge fan of their food, I love eating outside.  It was Saturday for dinner and there were lots of people enjoying the weather.  We went upstairs with our food.  My husband came down to use the restroom only to find that they had closed off the upstairs already.  Why would they do that on such a nice day?  When we first walked in I asked if upstairs was open and would have left had they said no."], ["Cory O.", "Steak queso burrito!!!!!"]], "Super Taco": [["Alyssia H.", "This place was a gem! I had ground beef tacos x 2, my kids had a chicken quesadilla, and my husband had the tamales (lunch special). Everything was really flavorful and well put together. The man who helped us was also very nice. We walked away feeling sufficiently full and ready for another 8 hours driving!The meal was super reasonably priced at $25 including drinks."], ["Daryl T.", "We found another little Mexican restaurant tucked away in a small strip mall and gas station. I knew this place was going to be good when I saw a number of hispanics at the same restaurant.  As soon as we walked in we were greeted by the staff.  The restaurant lacks ambience but makes up for it in friendly service and tasty food. The decoration is very nondescript. I had the chicken taco salad.  A deep fried flour tortilla bowl with a generous amount of chicken. They brought out their own concoction of hot sauce which had some heat and was tasty, My wife had the enchiladas platter with rice and beans and all was good. My son (the human vacuum) had a burrito which he devoured in like 4 bites.   Our girls had kids meals which they both finished. My three year old did not get her meal until about 7-10 minutes after we got ours.  You know how tough that is on a 3 year old.  That was my only complaint. If anything would like th kids served first as it takes them longer to eat and they get upset thinking they are not getting a meal like everyone else. I liked it, food was really good, the owners were very friendly and it wasn't too pricey."], ["Lianna N.", "Well...maybe I came at a time that was just too busy or something [they were packed], but we got tucked into the \"overflow\" part of the restaurant and were constantly forgotten. Forgot our waters, forgot to take our order (we had to go hunt her down), brought my food after a really long wait yet forgot my utensils...list goes on. I didnt try the tacos here which they are famous for...but eh, I'll continue to go to el ray.However, their menu is quite extensive and they serve specialties like menudo on weekends. I would like to go try that!"], ["Debbie S.", "Great place. This isn't just \"authentic\" this is legit real Mexican food! I'm not from here and I'm so glad to have found this place. Reminds me of my mommas cooking. Very friendly staff. Thank you Super Taco!"], ["Jessica N.", "I really don't like giving one-star reviews but my experience at Super Taco was anything but super. On our cross-country roadtrip we ended up in Lincoln around lunchtime and found this place via Yelp search. While the storefront turned me off, my boyfriend was determined to give them a fair shot.Not having any idea what to order, I went by pictures and selected a gordita. When asked for a meat choice, I was overwhelmed by the options (three different kinds of pork!) but settled on the seasoned pork. Unfortunately the first thing I noticed on my gordita was a small hair. Then a second one. I scooped them out of the sour cream and pushed forward. However, my first bite disappointed. The shell was like a fried pancake, but not as tasty. The meat was pretty flavorless, and the only other filling was cheese. I snacked on the guac that was served on the side but only made it through less than half of my meal.My boyfriend had much better luck, ordering three tacos, his favorite of which was the taco al pastor. I tasted it and it was a huge improvement from my meal. Other than the food, I was also unsatisfied with the cleanliness. The water glasses looked to be older than me (very chipped) and there was absolutely no soap or paper towels in the women's restroom. I just hope the men were cooking."], ["Rebecca B.", "They have the most amazing posole. Even on what might be a 100 degree day, it's worth it! About 2-3 times a month I'm down here (about a 20 min drive) for some posole after a night of drinking. I don't even have to order anymore. The gentleman working just looks at me and says, \"posole and water?\" Great service, great food!"], ["Sam K.", "I wish this place was in a bigger location - not because I mind going to it but because it is so easily overlooked and not many people seem to know about it! This place is GOOD. I could talk for hours about the steak burrito I had. And you can see the staff making your food not too far way from you, and you can tell it's fresh, not frozen. Triple A-plus!"], ["Jill S.", "I cannot believe I haven't been here earlier. Excellent, authentic and delicious food. I highly recommend the tamales. Friendly staff provide superb service and all at a reasonable price."], ["Mega S.", "I tried the carne asada tacos and the horchata. It was drier than I expected but okay. I prefer the other Mexican restaurant El Chrappo or Chaparro."], ["Jeff G.", "This is simply the best Mexican food in the area! If you haven't been to Super Taco yet...do yourself a favor and come in. The Sope and Tacos are absolutely fantastic!"], ["James S.", "Not a bad place to eat. Drove past it the first time thinking it was a stand-alone restaurant, but its in a strip mall and parking can be almost non nonexistent at times.Service was fairly fast. Food was pretty good, a lot of it home made right on the spot. The green sauce is very much like a bell pepper sauce and the hot was good as well.The lettuce and tomato in the taco salad wasn't watery or soggy. Very crisp and fresh.My only complaint is that they do not have a soda fountain. Everything it out of bottles, which again isn't too bad, but the wait staff never came around to see if I wanted a refill. The wait for the check took a long time too. Other than that, very good."], ["Christina B.", "This place is awesome! I love getting the mini tacos they are priced pretty cheap and great quality. I love that they have tripe it is rare because people are scared to try it but it is yummy and they cook it just right. The staff is super friendly and make you feel at home and they seem very nice. Only problem was rice seemed to lack flavor but other than that great place I would recommend to anyone!!"], ["B P.", "Seriously some great stuff. Best place between a cash advance store and ace rent to own that I have ever eaten at."], ["Fazle H.", "This was the best Mexican place i have been too,  and i rarely give 5 stars.  The carne asada was grilled just right and had the right amount of fat on it,  the menudo was a new item so i had to try it,  it was beef tripe in a spicy broth. It will great eats in the winter."], ["Mark F.", "Packed and I know why!  Hawaiian Torta was outstanding!  Prices were unbelievable for the quality.  It is a keeper for Lincoln!"], ["Lori C.", "Surprisingly good. I didn't expect to find anything I liked here but really enjoyed the quesadillas. The nachos are not that great as the cheese is really bland."], ["Jerry W.", "I've been looking for quite sometime the taste of good Mexican food. I found it here. There food tastes great and for a good price. Carna asada that is so delicious topped perfectly with cilantro and onions. If you like good tacos this is the place to go."], ["Seth M.", "My hero Super Taco allows me to sleep well at night knowing someone in Lincoln is producing delicious tacos."], ["Mike D.", "I had to come back to Yelp and write my first review just to boast about how good this place is. Being from Omaha, I am in no shortage of great taco places down on 24th Street. Fortunately for us, Ken B. and I were in town for a concert and decided to stop here before the show with a couple others.Let me say, this is a typical looking taco place in the Midwest, not run down but not somewhere your average person is going to decide to eat just to check it out. We were a little confused as the one side has ice cream/deserts but is actually part of Super Taco still. We sat down and were promptly addressed by our server. She was fantastic and for the most part understood what we were saying/ordering. She was slightly surprised when we ordered Lengua, Tripa, and Cabenza tacos.My order (at first) was of 2 tacos lengua and 2 tacos al pastor with a large horchata. The horchata was great, not overly sweet and had a great rice flavor to it. The lengua was cooked well, not the greatest I've ever had but still delicious. I always order with just cilantro and no onions and they didn't overdo it on the cilantro because of that. The tacos al pastor were by far the greatest tacos al pastor I have ever eaten. Out of the multitude of taquerias in Omaha no where came close to Super Taco. I ended up ordering 3 more by the time we left. It was cooked perfectly so it was crisp on the outside but the meat was soft and tender with an amazing flavor of the marinade they used as well as pineapple! I make it my goal to come here every time I visit Lincoln, if you love real tacos, you need to check this place out."], ["Carmen E.", "The best Mexican in Lincoln! Taco lovers rejoice! If you love beef try out the lengua taco or burrito, both are delicious and a great value. El pastor is also an excellent choice. The meals will definitely fill you up.Next door (but part of the same store) is a dessert shop with awesome Popsicles in fruit flavors I've never heard of, but if you ask for a certain flavor, sweet for example, they'll pick you out a flavor that will blow your mind."], ["Shain W.", "I just moved here from Arizona (the heart of Mexican food) and I was extremely happy with the food. The adobada and carne tacos were tender and flavorful. The sauces were fantastic as well! The only reason I didn't rate it five stars was because the service could've been a little better. I will definitely be back."], ["Abigael N.", "This place is not very good. I ordered the carne aside burrito while my boyfriend ordered a carne aside taco. Overall, the quality of the meat was horrendous (but still edible) and did not taste like any other carne aside I have ever tried. They did not offer chips like many other mexican restaurants do. The price wasn't too bad, but the taste in general was not good. Would never come back. Staff was nice though."], ["Kenny N.", "Ha! Clearly at Super Taco, you should only order the tacos. My girlfriend's gordita came replete with two hairs and funky pancakey taste. The womens restroom also didn't have paper towels. Anyway, I probably should have given her some advice. The tacos were really tasty especially the al pastor. The chicarrones were a little chewier than I'm used to. Just order the tacos here."], ["Will N.", "I love eating here for lunch, the days I have class on East Campus. Tacos and guacamole are my \"go to.\" Clean restaurant and friendly staff."], ["John I.", "I enjoyed this place. The food was GREAT. The Owner was very nice and was fun to talk with. The super platter tasted great. The prices are good. And the food will FILL you up!"], ["Josh H.", "This place is the best. The tacos are amazing. Al pastor is second to none, but the milanesa and cecina rock. I'm still working my way through the other tacos."], ["Sarah G.", "I had a dream about Super Taco the other night... probably caused me to drool a little on my pillow. Mmm, I'll have the Tacos Al Pastor... zzzzzzz.Food worth dreaming about, I surrendered myself to the taco bliss and let the friendly young lady who took our order pick out my lunch. Ended up with 2 chicken, 1 carne asada and 1 pork steak and pineapple masterpiece.Served with red and green hot sauce I couldn't get enough of, this was dining perfection. As I stuffed the last delicious morsels in my mouth I wondered out loud how many of these little beauties I could eat in a sitting. Four was definitely enough for a workday lunch, but even when we were done and comfortably full I still wanted more (which probably brought on the taco-inspired dream)."], ["Nate R.", "True authentic Mexican! This place is the best in Lincoln and the staff are very nice. They remember how and what I ordered after a couple visits."], ["Scott S.", "Straight hot fire! I get there lengua tacos every time, I find myself craving these things throughout the week.  The name of the restaurant kind of sounds cheesy and generic.  It's located right down the street from my apartment and my brother finally got me to try it and I've been addicted ever since.  Super Taco definitely delivers when it comes to authentic Mexican flavor."], ["Cass A.", "This is a great place to grab a quick bite. Though the place is not super fancy, it's not a dive either and was super clean. The service was super friendly and fast. The food was real good. Good sized portions with good flavors and nicely platted. The burritos are large and very tasty. Definitely worth stoppin in!!"], ["Christi R.", "Super Taco is one of the best restaurants in Lincoln. The location is a little off-putting but it is right near my house, so I decided to check it out. It was great. It is a family-run business and all of the workers are extremely friendly (particularly the daughter and the male owner!). They remembered my order the second time I went in there."], ["Katie F.", "Extremely cheap and fast food. The customer service is excellent. I had both the grilled beef tacos and the al pastor tacos. I dig the la pastor tacos. Speaking of tacos, if you are looking for the American cheese filled, ground beef, crunchy tortilla taco, this is not the place for you. From what I understand, it's authentic Mexican, but I can't verify that because I have never had authentic Mexican. My boyfriend had the enchilada platter and he really liked it. It was topped in mozzarella and I can confirm that it was delicious. The place is divey, but definitely someplace I would go back to for lunch."], ["Kendall R.", "Wasn't impressed. Not enough flavor for me. Was surprised by the beans, was not expecting what looked and tasted like white beans mashed up. Very disappointed."], ["JE C.", "Seriously tasty, authentic Mexican food and nice staff! Had their tamales today, no complaints. I would definitely recommend to anyone."], ["steve h.", "Fresh homemade tacos. Very yummy. I read one of the other reviewers complain that they don't have fountain drinks. That is because they import a lot of their drinks from Mexico.  That means you can get real coke made with cane sugar and not corn syrup.  Check it out."], ["Meka A.", "BEST LEGIT MEXICAN FOOD IN LINCOLN!  The food is amazing and the prices always surprise me for the quality and quantity. I usually get specially made steak burrito and it's never made incorrectly, always on point! sometimes I'll splurge and get their ice cream which is pretty awesome, especially since it's just next door. the staff is just as good as there food. It's family owned, the owners and there daughters are usually there working WITH a smile! you can tell they love what they do. They always make me laugh and are always welcoming. I honestly can't recommend a better Mexican restaurant. Also I love how they have photos for their food."], ["Andrea A.", "Never even got the chance to eat here! We called because we were thinking about having a district dinner here for work. When I called I told them that I needed some information I was flabbergasted by the response from the employee \"I don't have any information I'm just an employee\" and then was HUNG UP ON! I called back in frustration to ask to speak to a manager, same employee answered the phone and when I asked to speak to a manager the response was even worse\"I don't have a manger.\" and then was hung up on AGAIN! I now REFUSE to eat here, even if they have the best food on the planet. WORST CUSTOMER SERVICE EVER!"], ["Michael A.", "its good, great service"], ["Spencer S.", "Super Taco is rad. It has a dude in a giant sombrero and a Superman \"S\" on his freakin poncho painted on the window.It's worth coming here just to get a pile of tacos. As of this review they're $1.35 a piece and 4 of them is enough to get you through til dinner without threatening your co-workers with deadly colon bombs. You'll want more, though.You can tell this place is great because 1) despite the tacos being a simple affair of corn tortillas, onions, your choice of meat, and cilantro, they're delicious, and 2) the place fills up with Latinos at lunch time. Since there are only about 8 Latinos in all of Nebraska, that says something.I come here about once per week for tacos, have been for about 6 months, and I look forward to it every time. A little restaurant that can turn a simple taco into awesomeness is worth its weight in gold in ANY city, but especially in a city that has no idea how to do Mexican food. Taco John's, are you kidding me? Frying up a frozen tater-tot and calling it a \"Mexi-fry\" doesn't make it Mexican. But, I digress.Super Taco's service is friendly and JUST quick enough to be doable for lunch. They take cards, as long as you're buying over $5 worth of food. If you take my 4-taco lunch advice, you're good."], ["King B.", "I cannot say enough good things about the place. Wonderful owners, affordable prices, friendly (and beautiful) waitresses, and their El Pastor tacos are amazing! Yes the place could use some new booths and on occasion the side orders are not hot enough, but I am hooked regardless."], ["Brittany S.", "I have never been disappointed eating here! The staff are fantastic bilingual for me and my husband. The asada (steak) is so good and never fatty I am very picky about that! Everything in the menu is better than the picture and completely filling. I recommend this place as often as possible!!!"], ["Renee W.", "Okay, so I read that some dude was crapping on this place because of a friggin Margarita..... well, to be honest this is your typical \"pappas and beer\" kind of place like you find in Downtown LA, Tijuana, Ensenada...etc... If you want good, authentic Pappas and Beer, go here... if you want your hoity toity margarita, then I would go to Carlos O Kelly's or something, seriously because this isn't really a Margarita sort of place and anyone who walks through the front door would be able to figure that out.I grew up in the LA area and did my fair share of camping in Mexico on the bluffs in Ensenada....and I can tell you, this is pretty much the closest you will get to the real authentic Mexican street taco, here in Nebraska. I used to really miss these little gems and would pig out on them every visit to CA, but now I found Super Taco and now....I pig out on them a couple times a week!  I'll admit, I haven't had anything else here but my fiance had the flautas and...well he was a little disappointed because they were taquitos (corn tortillas instead of the flour)...but I still say its a great place :)"], ["Lisa I.", "The best Mexican restaurant in Lincoln if you are looking for authentic Mexican food.  It is wonderful.  A super nice family runs the place and they are always working so hard.  The atmosphere is not great, but the food makes up for it!"], ["Gabby A.", "I had written a review for the Sun Valley location, but I'm pretty sure this location has closed.  I have tried to go several times and the place has been locked up.I have absolutely no problem making the trek to this one though, because Super Taco is amazing.  It has become my favorite place to go for the real deal Mexican food I so often crave.  Their meats here are so delicious.  You can get all kinds of stuff you can't find at your typical Mexican restaurant (tongue, cheek, stomach) along with much of the usual stuff and it's all good.  On my last visit I had Tlacoyo which had incredible beans, seasonings, crema, and queso fresco and I of course had to add one of their fantastic Mexican tacos on the side (my meat of choice being Adobada-a delicious marinated pork).  My boyfriend got a burrito with steak that was huge and also incredibly delicious.  All this wonderful food rang it at about $13, so you really can't beat the price.  Their traditional Mexican tacos are $1.35 a piece so order a few and make a meal out of it or tack one or two on to one of their many other menu options.  Either way, you gotta try these little babies.  They also have liquor drinks and many Mexican beers to compliment your meal, and many desert options if you're in need of a bit of something sweet to finish it all off.  They also take all major credit cards (with a $5 minimum I believe) and add to that their friendly, informative and fast service.  This place is great.  Give them a try and I'm pretty sure you'll feel the same."], ["Charles G.", "BOOM!I got 2 tacos al pastor and 2 carne asada, they were both awesome, plenty of onion and cilantro and lime, plus their hot sauce was great!This place is as good as my favorite taco place in Phoenix, and in my opinion nothing else needs to be said."], ["Brian K.", "The chicken quesadillas are unreal they are so good."], ["Brett W.", "I had a couple of buddies introduce me to this place and I am glad they did.  The staff is wonderful and the food is great.  We have stopped in few times towards the end of there shifts and they still go up over an beyond to do a great job.  It is a great restaurant!"], ["Dan C.", "I asked an Hispanic friend to recommend a restaurant in Lincoln, I don't speak enough Spanish anymore to understand what transpired between my friend and the 2 or 3 other Spanish speaking folks in the group but the consensus was Super Taco. I tried it today and it was killer!!!!! I lived in Tucson for a few years so I was kind of thinking that it would be an American interpretation of what Mexican cuisine should be like. I was wrong, the Norteno cuisine I loved in Tucson is alive and well here! The \"kick\" doesn't come from the food, it comes from the salsa you choose to add to the food. This is a gem in a strip mall in the middle of Nebraska. Whoulda thought?"], ["Ted C.", "Service was quick and courteous. Food was great an reasonably priced. Don't let the name or the strip mall location fool you: this is good Mexican food.  The carne asada was Awesome."], ["Roy H.", "We brought a crew in town to work, three mexicans on our crew.  They each said it was very good Mexican food from the Mexico City region of Mexico.  The beans gave it away - very light colored - they were good.  The owner was very friendly and even changed the TV to the football game for us so we did not have to watch telemundo!  We travel all over the US working and the food here was as good as it gets.  We ate there twice during our stay in Lincoln.  I had the steak, the enchiladas, and my crew had the tacos each time.  I espicially liked the pico de gallo.  It's a little out of the way but worth the drive.  This is the only location - the owner told us he shut down the other location."], ["Angie W.", "Super Taco is fabulous!  My husband and I go at least once a week, and the steak tacos can't be beat.  The meat is so unbelievably flavorful and, unlike other Mexican joints in town (aka D'Leon's), it is tender, not greasy, and not covered in slop (i.e. guac, cheese, and pico).  Instead, there is just some cilantro, onions, and lime.  I also recommend the salsa verde, which is really tasty.  My mom has also had the chorizo burrito, which was excellent as well."], ["Ms G.", "Disgusting. From reading other yelp reviews, I suspect we were served other people's food scraps. Let me be fair and say we previously enjoyed good amount of amazing southern California mexican food from family businesses. Our carne asadas from here consisted of seasoned shredded fat. The \"burrito\" would also be a very loosely defined term here. One positive was nice staff, but one of them was eating a peach behind the counter and there were food scraps scattered on the floor. We were relieved the next day that we didn't get sick from this place."], ["Dave H.", "Very good, authentic Mexican food.  Very friendly service.  Would go again and again."], ["Chris E.", "Amazing tacos, wide variety of  fillings to choose from, both accessible (pollo, steak) and authentic (lengua). Also, their tortas are incredible and super-filling. LOVE this place, and I go back as often as I can! Also, their red sauce and green sauce are both other-worldly, no other restaurant in Lincoln can compete with these sauces!"], ["Janet L.", "Just moved to Lincoln and I was a little worried about finding my staple mom-and-pop type ethnic restaurants.  Having lived in central Mexico for 2 years, this is the real stuff.  My favorite are the Tlacoyos!  I've never seen a place in the US (granted - I haven't lived in Texas, etc.) that served Tlacoyos!!  So excited.  I would say that their cuisine is central Mexico. I also called one day to ask to pick up 18 tacos for a work pot-luck, and people thought they were great.  They also serve Nopales! What a GREAT find!  It's now my go-to Mexican place in Lincoln."], ["Luis M.", "I'm half-Mexican. I'm from California. This place is truly authentic. I eat the chicken sope practically every single time I come here, and I wash it down with a Mexican Coke. What more need be said?I think a second location may have opened up down on Sun Valley Parkway -- at least, it's called Super Taco II -- but I haven't checked it out."], ["Mike S.", "Tacos are good. Steak meat is burrito tasted like roadkill. Margaritas were horrible with basically no tequila. When we complained she added two more shots and charged 7.00 for it. What a bummer. Charged me 2.50 for the burrito that I sent back. No itemized bill until I asked. No ice in my water. Probably wouldn't go back. 10.50 for one well margarita and not even a buzz."], ["Jessa J.", "Very good, authentic mexican food, especially for Lincoln! The guac was so fresh and very tasty! Loved the street tacos. The tortas also very good. Great service too! I'm a flan fan, and it was just not good so therefore giving the review a 4 instead of a 5 :) I'll be back!"], ["S a.", "Super silly name, but accurate.  The tacos are super.  4\" corn tortillas, doubled and piled high with the most delicious meats, sprinkled with cilantro, and served with a wedge of lime, some pickled onion, and a slice of nopalito (cactus).  Do yourself a favor and try a cut you wouldn't ordinarily eat (cabeza, lengua).  They are so much better than every boring chicken breast you've ever met.  You could make a meal of three (although at  $1.35 a piece you might as well spring for a fourth or fifth or...)."], ["Nikki B.", "Dangerously craving-inducing.Lincolnites:  This food does not taste like not Amigos, Chipotle, or Mazatlan.  My friend took me here once for lunch & I keep coming back, because the tacos are delicioso!  Friendly service too.  Usually crowded with hungry Mexican-Nebraskans wearing work boots at lunch.TIPS:- The tacos are (rightfully) small, so you'll want at LEAST 2 for a lunch.  After you taste them, you'll probably want at least 10, actually.- If you prefer to watch TV while you eat, you'll be watching Univision.- If you don't like onion, make it known when you order.  They use a lot."], ["Brandon B.", "Yummy little tacos! We had two chicken tacos, two carne asada tacos, and a chicken burrito. The tacos come on two small corn tortillas, with meat, cilantro, and onion. Don't skip the salsas - the tomatillo is mild and the red salsa is hot. They are a perfect finish to the meal. The burrito was jam packed with shredded chicken, beans and rice. It was good, but the tacos made the meal. And we fed two people for about ten dollars - a great deal for good food."], ["Maggi B.", "Excellent food. Variety of choices and wonderfully prepared meats. Had a tongue and pork skin burrito w a spicy peppery red sauce. Plus... Open till 10pm. Perfect for a late night dinner."], ["Andy A.", "my new favorite adobada burrito!"], ["Amanda G.", "Yes, yes, yes, an authentic taco place in Lincoln! (You can tell because most of the meat choices are things the average American wouldn't touch with a 10-foot pole.) The chorizo, asada, and chicken tacos are simply sublime and come with strips of nopales (prickly pear) and a little roasted onion on the side--a perfect accompaniment.  Perfectly seasoned, fresh ingredients, and (unlike lots of other places) Super Taco does not amplify flavor with excessive oil.  As of today they're open 10-10 and take credit cards for orders over $5 which you will easily reach by scarfing down too many of their $1.35 tacos."], ["Jason S.", "Pineapple Torta is one of the best sandwiches I have had.  Super Taco is currently my favorite Mexican restaurant in Lincoln.  I just keep going back.  I have ventured into the menu several times and come away with a new favorite dish every time."], ["J C.", "Pretty damn good food.  Quit it with all the \"authentic\" speak.  Does that even have any real meaning anymore."], ["Eric H.", "If you are in the mood for authentic Mexican food, this place in the strip mall at 56th and Holdrege is it. Don't let the name or the location fool you, this place is the real deal."]], "El Chaparro": [["Patrick T.", "El Chaparro is the real deal when we are talking Authentic Mexican food!Which is sometimes a bummer for a vegan! Cause yep they have lard in the beans! Oh well! The chips are great and so is the salsa!They have great hot sauces, and the flavors hit you with a punch! It's a pretty small joint, so it can fill up fast during the dinner hours! Our waitress was really nice and very attentive to my diatary needs and made sure I had the perfect little meal crafted especially for me!The really great thing about El Chaparro is that it's super super super cheap! WOW this is the spot to go if you are on a budget!"], ["Mark D.", "Usually when I come back to a city I've been before I have one or several places I just have to go eat while I'm back there. Aside from people, foods are what I remember best from places I've visited. As we were driving into Lincoln my co workers asked where to go, I honestly had no idea, sure Lincoln has a few staples such as Tasties, Misties, deLeons and of course Runza yet nothing that warranted something along 'they have the best damn [fill in the blank] in 100 miles.That changed after grabbing a quick bite at El Chaparro with my son last night. Best damn tacos North of Texas, by a long shot. After having lived in Texas for a few years I have given up on finding great Mexican food somewhere people didn't speak with a drawl. No more!  I've found a 'have to eat here at least once' spot for when I'm back in Lincoln and reinvigorated my desire to possibly, maybe, find some good Mexican closer to home as well."], ["Kush A.", "Outstanding authentic Mexican food.  Tried it a few times and never left feeling less than impressed with the the quality of the food, exceptional bang for the buck too!Great staff, can't believe it took me 10 years to find out about this gem.Barbacoa burrito and their fajitas are a must try."], ["Agustin T.", "The burritos are meaty so that's a plus. The portion of the food is great. You get your money's worth here"], ["Austin T.", "Another cheap Lincoln restaurant that serves some great food. I got the two chicken tacos with rice and beans, and they were really solid! I wish I would have gotten the cinco tacos instead, because the portions for the rice and beans were pretty small. However, the tacos had really good flavor, and the tortillas were perfectly soft and warm, not rubbery. Definitely the first place you should go for you Mexican fix!"], ["Chris B.", "Such good food. Tongue tacos are to die for. Very fast friendly service. Very casual and laid back. If you enjoy authentic Mexican food then certainly give them a try."], ["Eva B.", "Love this place!  The food is excellent, especially shrimp.  The prices are affordable, and enjoy the horchata"], ["Chad K.", "Always wanted to try this place,  and finally did.  Great food and very friendly staff, with fair prices.  You can't go wrong for authentic Mexican food.  And they are always open late."], ["Sandy T.", "We wanted to try a New Mexican restaurant in Lincoln, we have our favorite places! We went here based on the positive reviews of the best \"Mexican food in Lincoln!!!\" This is the best Mexican food in town...IF.... You are super drunk, have the munchies or its 1:45 am and nothing else is open! My husband had carne asada or at this place Jack Links covered in onions. I had the enchiladas and a tamale...never had a chicken tamale and didn't care for it, very dry. The enchiladas were decent but nothing special. The beans were super runny. And the rice I could have made better at home with a box of Rice-A-Roni!! Well now we know El Chapparo is definitely NOT the best Mexican restaurant in town! I could name you 20 others including Taco Bell that I would rather eat at than this place!! We will never be back again! And there were a lot of very loud conversations from behind the counter that was very distracting and annoying!!"], ["Mike G.", "Favorite Mexican restaurant in Nebraska. This is where the Mexicans eat. Says it all. Always busy. Grand burrito and Cinco tacos. Both excellent."], ["Laura S.", "We stopped in for dinner passing through Lincoln. The three of us got tacos- chicken, steak, and shrimp. The shrimp were the best. They came with onions and cilantro. Rice and refried beans were standard. House made salsa was really tasty. Kind of a hole in the wall place. Service was not super friendly, but very fast."], ["Dezeray D.", "Best Mexican food to be found in Nebraska, also best Mexican food I've had outside if southern California.Go eat there now!They also let you do to goIts not the prettiest ever, but the places with the best food are often not."], ["Alex G.", "had the tortas, they were really good, and they were very reasonably priced. will be coming back to this establishment yo"], ["Michael C.", "Probably one of the best Mexican restaurants I've ever been to. But also one of the least Tex-Mex places. If you want authentic Mexican, with a very kind Hispanic wait staff, Mexican. TV playing, Mexican music playing, etc, it's the place. If you want Tex-Mex, maybe not."], ["Amos L.", "Fantastic little restaurant with authentic, cheap food. The staff is friendly and energetic. Everything I have tried is amazing at an amazing price. The atmosphere is not glamorous, but simple and cost efficient which is perfect."], ["Sarah G.", "I'm really waffling between two and three stars here... Words like 'decent' and 'regular' are springing to mind as I try to write this review.Even right after leaving the restaurant I was having trouble remembering anything that stood out to me in terms of flavor -  aside from the bottles of salsa (with ample cilantro) that were provided.The chips seemed fresh out of a bag, and weren't replenished (greedy American want, I know).After much deliberation I ordered chicken enchiladas - pretty standard fallback item when I can't decide on anything else (and our server had no recommendations for me besides the generic... 'everything is good' resonse). I did consider the taco platter option, but didn't want to risk it given my love for other tacos in town.It's unlikely that I'd return, but if 'regular' food where what you see is what you get and there's not too much confusion or challenge is right up your alley, then this might be the place for you."], ["Brandon A.", "Ive been to Mexico more than a few times an I must admit this is my favorite restaurant in town.  Ive tried several menu items an never have been let down. The food is spectacular an the prices are more than fair!  The Chorizo Torta is hands down my favorite sandwich in the city of Lincoln!  Its a big bun covered in chorizo fresh tomato lettuce avocado. I'm sorta a chorizo connesuar an El Chaparro has it down to a science.  Love the tacos tamales chips am that delicious home made salsa. Highly recommended:)"], ["Sara W.", "Decided to try this place after reading the reviews, wow wish I wouldn't have. The food has no flavor, the chips are left sitting out and very stale! I had the cinco tacos al pastor the only flavor came from the cilantro and onions, even the salsas had no flavor. My fiancé had the fajitas and also said they had no flavor."], ["Chris M.", "Ate here twice within a couple of days. Had cheese enchiladas one day and a grande chorizo burrito the next. Both dishes were very good though I liked the burrito the most. Their fresh made quacamole was outstanding. The taste and overall quality of the food coupled with the low cost makes this a place I will surely visit again the next time I am in Lincoln."], ["Steve S.", "It's the best Mexican place in town, in my humble opinion. And by that I mean it's not Mayonnaiser Mexican -- it's authentic. I tend to get the five tacos with beef, with a few fried peppers. I tend to go for lunch, though I know it does a brisk after-hours business.When I'm sitting in this place, with Liga MX futbol or a classic Univision telenovela on the TVs above, realizing I'm one of the only people speaking English in the joint, I can't help but feel like I'm back on the West Coast, where these kinds of awesomely basic family-owned dives were legion. The atmosphere ain't much, but I don't go there to be wowed by the waiter's wine-pairing knowledge. It's lovably divey. The food is superb and the staff are friendly and a joy to have around. What's not to love?"], ["King B.", "After reading the glowing reviews I decided to drive across town and give them a try. Huge mistake. I am not sure if the bottle-blonde waitress is a racist or simply doesn't care about making money. I waited at the counter for 5 to 10 minutes and I was not greeted by ANYONE. Not one person asked if I needed anything or wanted to order. The fore-mentioned waitress then proceeded to smile at me then text away  while completely ignoring me. Never again. I will be sure to tell everyone about the rude treatment I received. That's alright, I will continue to go to Super Taco. So much more friendly there!"], ["Alek Z.", "From what I've had, possibly the best Mexican restaurant in Lincoln. I've been going here every now and then since freshman year and have eaten most of the menu. Pretty much all of it is good, and there's enough variety for whatever kind of Mexican food you're in the mood for. The prices are pretty cheap, and most plates are served with quite a bit of food.However, the main attraction for me is that they serve the single greatest non-alcoholic drink ever invented: HORCHATA. It's a really simple drink, just rice water, sugar and a little bit of cinnamon, served cold. It's got enough sugar to kill a horse, but OMG it's so good. It's like the baklava of drinks; I know it'll kill me some day, but until then I have it with abandon. I'll have a glass there and then get a big gulp cup to go.Another big draw for them is that they're open until 3 a.m. most nights, so it's an excellent late night destination. Their parking lot out front is pretty small, so you might have to park on the side of the street, but it's usually not too crowded."], ["Elmo J.", "Tried this out based on the Yelp reviews...great food!  Never knew this place existed!  The \"cinco tacos\" (I got 2/pork..2/chorizo...1/steak)...all were very good!  Definitely a place to try, open until 2am...can't beat the prices."], ["Shawn K.", "Awesome food, quick service, extremely reasonable prices. As in my dinner was $5.84 including tax and I'm stuffed."], ["Erica M.", "This place puts the \"authentic\" in Authentic Mexican food. The Rice is very tasty and reminds me of the mexican rice my grandma used to make. The beans are also very very good and im head over heels for the chicken enchiladas, definitely affordable. Dining room is small, but most hole-in-the-wall delicious places like that arent very pretty."], ["Toni A.", "Being a relatively new transplant from Arizona to Lincoln, I was sure I was going to miss having a good Mexican place to visit. So when I moved  I was happy to be in the same neighborhood as El Chaparro! I love that they are open until 3am and the servers are always great. Cinco tacos with your choice of meat, burrito grandes and enchiladas are all delicious! This isn't fancy but it's good. The Menudo is hard to come by as they usually sell out fairly quickly. They only offer red which is not my favorite but at least they offer the option!"], ["Brian K.", "The best spicy sausage meals or steak fajitas ever."], ["Amanda B.", "This is authentic Mexican food.  If you are looking for over-sized portions, fancy tex-mex sauces, or gimmick-y reinventions then you will be disappointed.   Amazing salsa.  We always buy a large container on our way out.  No surprises on the menu. I enjoy their rice & beans with whatever I choose!The atmosphere isn't fancy.  Although the dining area, the kitchen, and the bathrooms all appear clean. Good, simple service to go with good, simple food."], ["Todd D.", "OK, i'm writing this as a single experience customer driving through Lincoln on way back home from a Colorado spring break. I chose this place based on Yelp reviews, and my guess is it's fine for cheap eats by local college students.  But my experience was not very good. The food was average, albeit quickly served.  The place is a bit rough - our table was dirty, and plus the tiolet was all clogged up.I can't recommend it for travelers passing through, i would definitely choose somewhere else.  Only good part was family of 4 ate for $30."], ["Lacey M.", "This is the best place to eat...ever. Best mexican and also just THE BEST. I get cheese enchiladas every time and a TON of their amazing, homemade hot sauce. They have amazing chips and THE BEST cilantro-ey homemade salsa you've ever had. I don't live in Lincoln anymore and it is a tragedy that I can't eat El Chaparro everyday. It's so good. I can't talk about it anymore because I'm depressed that I can't be eating it right now.SO GOOD."], ["Alexis A.", "Love this little hole in the wall. Great for take out! Favorites are the chile verde burrito, cinco taco combo, nachos and enchiladas. For eat-in, I wouldn't recommend it, only because I don't think they serve alcohol. I think the service is very friendly and the food is well-priced. Some of the best Mexican in Lincoln."], ["Ali L.", "Great steak burritos for around $7."], ["Wyn R.", "My husband and I love this place.  If you want authentic, no frills Mexican, this is your place.  Admittedly, the wait staff knows us, but even before we were regulars they were always very friendly.  Awesome char broiled cinco tacos!  Yummy green chile burrito.  And I love their beans and rice, as does our 1 year old!  One word of advice, you have to salt everything.  I don't think they cook with salt at all."], ["Angie W.", "We usually venture out to Super Taco because I love their carne asada tacos, but we actually live closer to El Chaparro, so we decided to give it a try. We had been there once before, but it was after a late night and, well, at those times anything tastes good... otherwise the Highway Diner wouldn't be in business. First of all, their chips and salsa are TO DIE FOR. In the El Chaparro vs. Super Taco competition going on in my  head, this round goes to El Chaparro. I was disappointed that I didn't find an option to order my carne asada tacos individually, although, to be fair, I didn't ask if this was a possibility. Instead, I went straight for the cinco tacos option. My husband ordered enchiladas, and my daughter ordered a hardshell beef taco. The tacos were comparable to Super Taco - small, traditional, onion, cilantro. lime, etc. However, I think Super Taco's meat is more flavorful. More importantly, Super Taco's salsa verde (which is a huge flavor addition to a carne asada taco) is super yummy. El Chaparro's - well, it wasn't for me. I felt it was pretty bland. So, Super Taco wins this round hands-down. My husband was 100% pleased with his enchiladas, and my daughter happily ate her hardshell taco. We did end up paying more than we would at Super Taco but, again, maybe I could have ordered the tacos individually (I usually only get two), which would have brought the price down."], ["Joel G.", "Had pretty bad heartburn last time after the chicken mole enchiladas"], ["jennie p.", "I absolutely LOVE this place!Hands down the best late-night Mexican food in Lincoln.But you better get there as soon as you can after last call because this tiny space fills up fast.Why I like it:  1.  Grande Buritto con pollo. MMMmmm!  2.  Quesadilla con carne asada (grande, no chico)It's also good at times other than 1 o'clock in the morning."], ["Josh S.", "I was back in Lincoln recently and of course I had to stop in because the food here is always delicious.  Unfortunately this time I was swiftly reminded of the one (and only one) negative thing about this place - that one young waitress with the bitchy attitude.  You know who I am talking about!  What is wrong with that snotty girl?  I have never seen her with a smile on her face and she only acknowledges and converses with people who speak Spanish.  Not only that, she goes out of her way to give bad service.  She rolled her eyes at me for adding guacamole to my meal!  Considering it costs $2 to add that, most of which is profit, why was she so mad about it?  Because she had to scribble one more thing down on the check?  Good grief!  She was also purposefully slow and ignored any attempt of being flagged down, despite the restaurant being empty.  She must be family or something, I don't know how she can remain employed after consistently acting like this.  She is in dire need of an attitude adjustment!  I was hoping she was done for a couple years ago when she was pregnant, but so much for that idea...  Now I guess I have to call ahead and make sure she is not working before I come in."], ["Nancy C.", "Every two weeks, we spend a lunch hour here since a friend and I work about two blocks away. For such a relatively small sized restaurant, they offer an extensive menu that hasn't disappointed me yet plus the service is great and they all seem to love what they're doing.  If I could produce such fabulous food, I guess I'd be happy to be working there too. Their rice and beans are so so good, actually I've never had a bad meal here--it doesn't seem possible.  Enjoy!"], ["Jerad D.", "So good, I usually get the fajitas or torta.  Always good, and fresh and authentic.  I especially like the telemundo that is always playing in the dining area.  Open late, until 2 I believe, it is perfect for getting some take out after leaving downtown. Two people usually can eat here for about 20 bucks for a full meal with tip.  It is probably a little out of some peoples comfort zones, but go for it, you will not be disappointed."], ["Conrad C.", "this place rocks.  love the mexican diner ambiente, seriously good food, not expensive, friendly staff, and they're open every day till 2am! yes!"], ["J C.", "I think the best mexican in lincoln,  you will not be dissappointed in the food.  Take out or dine in, im always happy.  The gal taking my order always makes me feel like im eating at her kitchen table and I like that feeling.   nothing stands out to me as it is all excellent.  Food Seems fresh and made with care.  The bonus is when dining in, seems to always have a novella or some latin show with really hot woman on the tube."]], "La Mixteca": [["John O.", "They moved to Havelock, and they are an amazing place to eat - the food is wonderful. We moved to Lincoln from California and we have been searching for a good Mexican place to eat - and yes, we found it here."], ["Andrew H.", "La Mixteca has recently opened in the space where Downtown Buffet was between 10th and 11th on the north side of O Street. Simply stated the best Mexican food in Lincoln. I got the Torta MIxteca and it was by far the best torta I have had in Lincoln. It was a fresh toasted bun, loaded with avocado, tomato, cactus, milanesa, ham, and cheese, all toasted together in a delicious, huge sandwich. My spouse got the Motitos, which was like a grilled burrito but much better in a homemade tortilla with beans, rice and pork. They also have a salsa bar with fresh made salsas for your complimentary chips, or to add to your meal, the red onion salsa was surprisingly spicy, but really tasty.I would have given this place 5 stars, except for a lacking beverage selection. They only have bottled Pepsi products, and none of the Mexican sodas you usually find in traditional Mexican style restaurants. Hopefully that does not stop you from trying this new awesomeness."], ["Peter W.", "I agree with the previous reviewer regarding the torta. Really good and massive. $7 pays for a whole lot of sandwich here. Looking forward to trying out more of their selection later. I definitely recommend giving them a try."]], "Tia Lety's": [["Joe S.", "This time we added the sweet corn tamal with beans and cream. Delish! A tad sweet and adding the cream and beans make this perfect.This place could be my favorite Lincoln restaurant."], ["Sarah K.", "Been here a couple of times and found it to be a good experience overall.  The interior is clean and comfortable and they have a couple of tables that can accommodate larger parties.  We found the service friendly and prompt.  The food is good and is unique for the area.  We enjoy the pupusas, a stuffed corn tortilla filled with your choice of fillings. We like the pork, cheese, and beans mixture.  Probably our favorite items are the pasteles which are deep fried pork and vegetable tacos served with a fermented slaw.  The sweet corn tamales are a nice sweet treat also.  The tacos have good toppings and the meats we've tried have been tasty. The pork tamales are a little different than what I've had elsewhere, in that they are stuffed with not only pork but a variety of vegetables.  In sum, definitely a place to go to get unique and tasty salvadorian food!"], ["Gabby A.", "Oh, I love this place.  I used to visit their old restaurant in the downtown area and was so sad when they closed.  When I read they had opened a new place on North 27th I was jumping for joy!I honestly think the food is better than I remember (if that is even possible).  They have expanded their menu a bit and offer lots of latin american foods, not just Salvadoran cuisine.  The space is bright and cheery, and the staff has been very friendly on the two times I've visited.  On the first visit, the gent and I decided to order a wide variety of items to try.  I got two papusas (one cheese and one pork and cheese), and a chicken taco.  The gent ordered the pasteles and a sweet corn tamale with crema and refried beans.  This ended up being a ton of food!  I had no idea the papusas would be so large!  I will start with the papusas:  they are absolute perfection.  Honestly, the best papusas I've ever had.  They are grilled to a golden, crispy perfection.  They aren't too greasy, and the fillings are fantastic.  The pork had a wonderful flavor and was in no way chewy or hard to eat (as another review on here suggested).The pasteles were amazing as well.  Filled with meat and beans, these are little fried indulgences. We loved these babies! The sweet corn tamale is heavenly as well.  This isn't what most of us have had before.  These tamales are slightly sweet (think sweet corn on the cob) and it pairs perfectly with the slight salty/sourness of the crema sauce.  LOVE this!   My chicken taco was decent, but not not the best I've ever had. That was, I suppose the weakest link of the bunch, but by no means a bad taco.  I would also like to add that all of this food set us back about $16.  That's incredible!I've been here again just for papusas, because really you can make a meal out of just two of these.  One minor complaint is the lack of beer/liquor.  I think the gent and I would come here a bit more often if they served beer and mixed drinks, but hey, we can get it over it.  :)"], ["Agustin T.", "The service was great but my burrito was lacking meat. It was mainly rice.  I understand they can't fill up my burrito with a ton of meat but if I had to estimate I would say I only had 1/5 worth of meat in my burrito."], ["Myra G.", "Great up until you tell them you are returning the food because the meat was not chewable. The manager/cook came to give us a lesson on how we don't know how to cut meat and she was very defensive. They charged us the full plate even though we did not eat it. Do not order the carne asada plate $10.95.... Not worth it. Their defensive attitude is what will keep me away from this joint."], ["Regan K.", "I've been coming here for YEARS. The food is amazing! Go try a pupusa revueltas, you won't regret it. It's a thick corn tortilla stuffed with meat and cheese. They also have some of the best burritos in Lincoln, but be warned: they're HUGE."], ["Ashlie K.", "We went a second time. This time I got tacos with shredded beef. That shredded beef is amazing. I will order it on everything I get there."], ["Brianna P.", "This place was excellent. Neither my husband or I have ever tried El Salvadorian food, and this was the absolute most wonderful food! We had an order of pastelles, two pupupas and a torta, everything was PHENOMENAL! The flavors were outstanding and so fresh. Try it out!! Even if you are on the fence, you will not be disappointed!"], ["Cheryl N.", "I rated it four stars because it isn't high dollar. I recommend the tacos not just because they are delicious, but thy are extremely low in their cost. They're service is great and the waitress I got helped us with what we wanted since it was our first time here.  The sauces served are tasty and ask for the hot sauce.   It is fiery and flavorful.   The papusas were excellent.   Plantains perfect.   Atmosphere is fresh and clean.   Kids enjoyed the full choice of jarritos.   Anyway.  Very impressed and glad they are open.  We drove across town to check it out and highly enjoyed it.    This is not \"everyday\" Mexican food.  This is a food vacation to Central America.   It is well worth the trip."], ["Deana F.", "I really wanted to like this place. Sadly, the service was so bad that I couldn't enjoy the few good flavors that passed under my nose.  We were late joining our party that had previously arrived by 20 minutes. They had previously been served chips and had declined a refill. I guess the server thought we wouldn't want any according to their decline. As our friends were ready we quickly chose and ordered. 25 minutes later I asked for chips.  Friend ordered salsa and chips. Salasa was thin soup consisteancy. Flavor not bad. Guacamole was like toothpaste squeezed from a tube. Sorry but it was horrid.   I ordered shrimp fajitas. Tortillas are homemade and muy thick. Very tasty and hot. Unfortunately the sides of beans and rice were completely forgotten. 15 minutes or so after served my shrimp I asked about the sides...told him to forget it. Flavors on shrimp was great. If the front of the house and the kitchen could get coordinatated, it might be worthwhile."], ["Lindsey C.", "We tried 5 different items on the menu and every single one was delicious! Sauces actually taste like someone made them from scratch instead of taking it straight from a can, even the refried beans! Tamales were outstanding and the cashier was very friendly! Will go back!"]], "El Chaparro Fine Mexican Food": [["Angela M.", "Best Mexican food in Lincoln!!! After living in California for 6 years it was a challenge finding a local authentic Mexican restaurant.  Haven't eaten any where else since finding this place."], ["Maggie W.", "I spent serious $ going to see Prairie Home Companion at the Pinewood Bowl Amphitheatre, so I needed a cheap dinner before the show, and ended up at El Chaparro.Dang.Jamaica, horchata, and 5 tacos for 5 bucks. (Seriously, I did not need 5 tacos, but there they were...) The Mexican rice here is no friggin joke, either. So delicious. Some of the best Mexi rice I've had in a hot minute. Husband had enchiladas and was quite pleased, especially with the sauce.The place is unassuming and fast-food-looking, and while the service was okay, the bathrooms left something to be desired. But the food was good enough that I was still quite pleased with my experience. If you're in Lincoln and in need of some cheap grub, this is your place fo sho."], ["Daryl T.", "I used YELP when we were in Lincoln to find this Mexican restaurant  This restaurant appears to be a family owned. I really like supporting local business owners. There are not a lot of tables in this restaurant but there were a few when we arrived that were open. Just waiting to be cleaned off.  We ordered our meals and it took a while for the food to arrive but must say everything we ordered was really very tasty.  They provided free chips and salsa and had a nice variety of meals on the menu. The kids loved their chicken strips and fries, my wife enjoyed her burrito and I enjoyed my chicken enchiladas.  For four of us, including drinks, before tip was under 30 dollars.  Really a great price for good food.  This is one of those places you typically would drive past but must say the food is really good. The waitress and staff were really nice.  As for atmosphere, this is really more of a hole in the wall experience.  We will absolutely be back."], ["Taylor R.", "From the telenovelas to the great food, this is definitely as authentic as a Mexican food place can be.I got a tongue burrito (yes--you read that correctly). It was massive, and at only $6, a good deal. The meat choice may not be for everyone, but I loved the tenderness.For dessert, I got the sopaipillas. Oh my goodness. The greatest thing I have ever tasted. They were basically sugar nachos with a gallon of whipped cream on top. Let me tell you, I ate the entire thing with no regrets.Will be coming back!"], ["Rashmi K.", "Bad barbacoa experience here, almost ruined my spring break. It's possible to have decent Mexican food here though, I'm sure, the other people at my table (of Mexican heritage) seemed satisfied, but I most certainly was not. Just don't get the last barbacoa of the day, in fact, ask the waitress how many more barbacoa servings there are left today and if it's any digit lower than 5, just skip it!"], ["Bernie S.", "Awesome, Awesome tongue tacos. Don't be squeamish on trying tongue. The meat just melts in your mouth like a good brisket does. I only gave 4 stars since the chips & salsa you get at the table are nothing special."], ["Mega S.", "BEST MEXICAN RESTAURANT hands down! I am from Los Angeles and came to Lincoln because of my job. I was pleasantly surprised that this is here because everything is made from scratch. The five tacos carne asada is amazing, the enchiladas- you can't go wrong. The price is so affordable! A plate full is like $5. The horchata... YUM!"], ["Brian K.", "The steak fajitas are awesome. The salsa and chips that are free are also very good. Don't let the outside of the building or the location (next to Dead Man's Run) fool you. This is some good authentic Mexican food."], ["Okyo T.", "This is one of my favorite secret spots for Mexican food in Lincoln.  The 48th street location is never really that busy, so you're guaranteed to get your food real quick and hot.  The menu has very reasonable prices and an extensive amount of items to choose from.  I would have to suggest ordering the shrimp tostadas, which are not on the menu, but they used to be and they will make them for you upon order.  This is the secret item off the menu that I keep coming back for.  Also the shrimp quesadilla is quite tasty as well.  There's something about how they grill everything that gives it such a unique flavor.  Sometimes food can be real spicy, especially on the weekends.  They don't serve alcohol, but that's not always a bad thing."], ["Amanda L.", "So, I wouldn't really call this Fine Mexican Food or Fine Dining, but it's tasty.  I ended up at this location after my mom read the sign \"abierto\" in the 13th st. location and thought it meant closed. The food is very reasonably priced and the complimentary chips and salsa were pretty decent. Our waitress was friendly and efficient and the restaurant was clean. It's not the Mexican restaurant I've ever been to but totally worth the money. (entrees ~$4.5-$6) It's better than the Mexican food I've had in Seattle."], ["Heather B.", "Love this place :)  Free chips and salsa--pretty spicy!  Cheap meals. Fast friendly service.  The parking lot and business itself isn't super \"nice\" but if you're just looking for a good, quick, cheap meal...this is your place.  Not very \"commercial\" at all.  Definitely a family run type of business.  I frequent and love El Chaparro.  Where else can you get a chimichanga dinner with rice and beans AND a soft drink for 8 bucks?? :)"]], "Mazatlan II Mexican Restaurant": [["Don M.", "I enjoy Mazatlan II.  I much prefer their sister restaurant, La Mexicana simply because the ambiance is cooler, and the store in front of the restaurant.  Hwoever, Mazatlan II has the same menu and the food is just as good.  There is an older gentleman working there whose sole job, it appears, is to keep your glass full of water.  I dare you to take a drink without him noticing, and racing to your table to refill your glass.  ha ha (It's not quite that bad, but almost).The free chips and salsa are delicious and I don't think I've ever had anything on the menu that I didn't like."], ["Jason Z.", "It earned the 3.5 stars.Service was TOP NOTCH.  All servers rotated to help all tables.  Within 30 seconds of sitting, we had salsa, chips, waters, and even kid's waters.  Impressive.We ordered a kid's meal taco and a Deluxe Manadero Burrito.  My meal didn't come with rice or beans, as advertised.  Plus, there wasn't any refried beans (that I noticed) in it, also, per the menu.  The meat on both meals was pretty gross, it was sopping with grease and the kid's taco was so drippy that the hard shell was pretty flimsy after it cooled down.Otherwise the portions were massive.  But you can put a large amount of mediocre food out, it's still just mediocre.And a note to the staff:  Just because the majority of the people in your restaurant appear to be white, non-spanish speaking folk, doesn't mean you can carry on with certain conversations in spanish... I overheard some interesting banter between the serving staff.  Not all of us are Donald Trump, some of us gringos can speak spanish.  It's a bigger world than you realize."], ["Elisabeth E.", "We started joining a group of friends here on Wednesday nights for discount margarita night. The margaritas are really good. The flavors are delicious and just the right amount of tequila in them. The only problem is the blended ones frequently are riddled with ice chunks you have to fish around. My favorite is the blended peach margarita.I also love the chips and salsa which are gluten free and I really have issue resisting them. They do have a gluten free menu which is nice but I've only ordered food once. I had the beef tacos and mazatlan nachos. Both were pretty greasy and the cheese on the nachos was a weird flavor. My bf who's a great garbage disposal didn't want it either. I also didn't feel great after I got back home, so I have some concerns about the gluten contamination with the food.Price is very affordable. Atmosphere is traditional for a little Mexican restaurant. Lots of bright colors, only about 10 or so tables. Service quality has been both good and bad depending on the server there that night. So I'll likely be coming back for chips and salsa and discounted margaritas, but I'll avoid eating here in the future"], ["Jonathan C.", "The atmosphere is very quaint to this restaurant. The food is very good. I am usually not a big fan of rice and beans as a side dish. But the rice here was cooked perfectly and actually had some good flavor. The pricing for the food seems pretty fair. The only reason I gave it four stars was the service was okay but not really friendly and honestly I couldn't really tell if it truly was a service or a communication barrier. If you're in the area I recommend coming to this restaurant it is definitely worth a visit."], ["Ryan M.", "I like this restaurant, but the food is hit and miss.  And by that I mean the menu is extensive, but some dishes are much better than others.  The standard enchiladas are pretty bland and uninspired, but the Burrito With Fajita Chicken is fantastic and bursting with flavor.On their own, the refried beans and rice are pretty bland, but I always consider them a small addition to each bite in the entree.  In that respect, they work well within many of the dishes.  Most of the bland dishes also serve as a good base to be enhanced with something like Cholula, which helps bring them to life.The restaurant has a welcoming atmosphere and is always very clean.  The wait staff is quick and attentive, and the unlimited chips and salsa prior to the meal are welcome (the takeout portion included with to go meals is massive).  It's not a cheap place to eat, however the portion size is large at dinner and easily makes two meals for me.I think finding the good dishes is key here, because plenty are just average.  If what you're looking for happens to be a good dish, it's a solid four stars for me.  If not, then the average food knocks it down to just three stars."], ["Gregory H.", "Outstanding service!  Excellent food, that comes fast every time!  There is really nothing on the menu that I have not loved. Fajita burritos are great!  Excellent margarita specials all the time.  The staff is amazing!  My wife and I eat here about once a week."], ["Aimee K.", "Stopped in Mazatlan a while back on a trip to Lincoln, and wasn't sure what to expect. I'm happy to report that it was pretty fantastic from beginning to end! I didn't try a margarita (shame, I know) because I was in desperate need of a coffee. Surprisingly, it tasted great and our server kept the refills coming! The service was solid the entire time, that's for sure. Very happy employees who know the menu and how to create a nice dining experience.Without doubt, order the queso to go with your chips and salsa. It's some of the best I've ever had and I bet you won't stop eating it until it's gone. I ordered a combo platter (hey, girl's gotta eat) with two cheese enchiladas and a beef taco. It all came with a HUGE helping of beans and rice, and everything tasted tangy, fresh and delicious. There wasn't really anything that special about it, but it fulfilled every ounce of my Mexican food craving. I was actually sad that I ran out of room in my stomach.This place is perfect for lunch or dinner in Lincoln, and I saw a ton of different margarita options if you're in the mood. The atmosphere is more family-friendly than nightlife oriented, so keep that in mind.Aaaaaand now I'm craving Mexican. Give this place a shot if you're in the area!"], ["Sean O.", "Margaritas are great.  Food is marginal.  It's not real nor American Mexican.  I would come back but don't expect a lot except a lot of booze in the margarita."], ["Amanda M.", "Ick. No no no, this is NOT Mexican food. This is Taco Bell-esque but 4x the price. If you have been to Casa Bonita in Denver, this is a step below... and Casa Bonita is disgusting. I got a taco and a chicken enchilada. The taco completely disintegrated the moment I picked it up. The chicken enchilada was very, very dry. All the cheese on top did not disguise how truly awful it was. I ordered the flan \"to go\" and didn't check to see what it looked like until I got in the car. The \"whipped cream\" that was supposed to be on top was actually straight cream poured from the carton (see picture). The flan itself was hard and chewy. I took one bite and threw it away. I felt bad for the cleaning staff in my hotel who had to see that in the trash can. I'm sure they were horrified.My fiance was so disappointed with his meal. He was grumpy for the rest of the night, and the worst part of it all is that for two very shitty entrees and one inedible piece of flan it came to about $30.  The waitstaff was nice, but there is no way this is 5 star Mexican food. I'm sorry that you have to put up with this crap, Lincoln. Yelp definitely steered me wrong this time."], ["Russ F.", "Nice service and ok unlimited homemade salsa and chips.But the entrees were very obviously poured out of a can.  I had the \"Vegetarian Burrito\" which consisted of vegetables that tasted pickled like they were out of a can.  Think Sysco peppers that you'd put onto sausage & peppers subs.  I got 3 or 4 bites down before my body literally wouldn't let me eat any more.Avoid at all costs."], ["Lorne B.", "The worst Mexican food ever! My steak fajitas were spoiled!! They freeze all there food you can taste it. I got food poisoning if you don't want it do eat there!!!!!!"], ["Lacy D.", "The food is fantastic here! My husband and I love this place and I love the look of the place. One of the best Mexican spots in town in my opinion. I only give it 4 stars because the service leaves a little to be desired. They are there and helpful, but not always the most friendly."], ["M M.", "Decent food (not the best I've ever had, but decent). Nice option other than Carlos Okellys in the neighborhood. Large portions...only wish they had smaller portions for less in cost."], ["Johana F.", "Great food, great service. What a nice southwestern environment there is. I ordered their horchata for my beverage; fantastic. It is literally homemade and they presented it with ground cinnamon on the top. For my entrée, I had the carnitas. I wasn't thrilled since they were not \"real\" carnitas as they weren't shredded like it is traditionally. Rice and beans deserve an A+. Can't wait to go back!"], ["Okyo T.", "I give this 5 stars for the Margaritas alone.  You don't order the cheap ones either, order the Mazatlan Margaritas or top shelf.  It's worth the price, since getting a drink this tasty and this strong, it would cost this much at any other drinking establishment.  I prefer the Sagria Margarita, which are sometimes the Friday night drink special.  (There's a game to these drinks, once you knock your straw out, you know you're feeling it!!)This is the most authentic of Lincoln's larger Mexican restaurants.  To some newcomers the prices may seem more than usual, but in any other city this is considered average or normal.  I would suggest ordering a large combination or large \"plate\" for that matter and sharing the dish.  It's more fun to eat and share than to stuff yourself crazy.  The fajitas are ALWAYS sizzling hot.  The enchiladas have a real homemade flavor with the red sauce.  Even getting a veggie burrito is quite satisfying with all the grilled vegetables involved.  Service is great and quick!  If at all, there is rarely a long wait for seating."], ["Katie F.", "Cheap. Great food. Fast service that is extremely customer oriented. Chips and salsa at every table. Their salsa is excellent, providing various levels of hot. Offer the typical entrees, but also offer cheaper, small portions. Time after time this is my favorite place for Mexican in Lincoln."], ["Kathy S.", "I came here the night of the blizzard and they were still open. I was the only one in the place, the service was great and friendly, good margaritas and plenty of food. I made a special request for my dish and they delivered it better then I had hoped for.. I will be back for sure."], ["Niki B.", "For the people who say this is authentic Mexican food, you have obviously never REALLY experienced a true Mexican meal. Yeah this place isn't that bad.. The food isn't the best quality, but the service is great and the restaurant is really clean. When I went to the ladies room, it was immaculate which is an indicator that they keep their kitchen the same way. I had the chicken and steak fajitas and it was covered with raw chili powder and it was swimming in oil. The steak was really chewy too. But the chips and salsa were really fresh and tasty. Great place to get a strong margarita though! I would give this place another chance, but I think I'll be safe and stick with tacos next time."], ["Aaron T.", "I read all the previous reviews and Amanda's 1 star, so I'm giving it a 3 star. My pork meal was really good, didn't mind the rice and beans. My wife however had chicken and said it was really dry, tasted like styrofoam,and her beans were not good at all. The service was great, kept up on all refills and chips. Place was not too busy during lunch hour, so they may need to change something up. Place is good, and I would go again. They just need to make some changes."], ["Frank G.", "I never expected to find good authentic Mexican in Lincoln, NE but this place is a diamond in the rough. The chips and salsa are fantastic by themselves but the sliced mushroom, jalapeño and cilantro dip stole the show. WOW!!! I ordered the pork carnitas with a batch of corn tortillas and was mesmerized by the flavors and amount of food in front of me. Great service and a solid selection of Mexican beer. This is a must visit when in Lincoln. Check it out.  You won't be disappointed."], ["Mike I.", "One great joint for Mexican food. I travel a lot and this was excellent. I had the tacos al carbon the meat was tender , juicy, and tasty. So many times the beef is overcooked. It was just right. The salsa was homemade and fresh , just a touch of heat. Fresh food and fast friendly service. Clean interior and bathrooms."], ["Wade C.", "When I arrived to Mazatlan I was craving flauta's (fried tortillas filled with chicken or beef) and unfortunately these were not on the menu, but when I asked the waiter about the possibility of ordering them anyway, he didn't hesitate; it was no problem. Great service, and the flautas were delicious!Also, the atmosphere is very clean and contemporary. Not a dingy mexican joint by any means. Check it out if you're ever on the north side of Lincoln!"], ["Chris D.", "One of the absolute best Mexican restaurants in Lincoln. Great food and timely service."], ["Abby G.", "This is probably as \"authentic\" as mexican food is going to get in Lincoln. The chips and salsa you get before the meal are awesome. Fresh, hot chips with 2 kinds of homemade salsas. Unfortunately, the entrees are pretty bland and usually swimming in some kind of weird sauce. I had the lunch special of 2 beef tacos today and it was ok. Kind of bland, nothing was really seasoned. It's a lot of food made with fresh ingredients for less than $7 so I can't really complain too much. Basically it's satisfying, but I've had better.The service is excellent, more than likely because you have one person to fill your drinks, one person to take your order, and one person to bring chips and salsa and pick up your plates lol. It's not my favorite place, but it's close to where I live, fast, fairly cheap, good/clean atmosphere, and will definitely fill me up so I will be back."], ["Nick F.", "Amazing - the best sit-down authentic mexican restaurant in Lincoln - abuela (grandma)  would be proud!"]], "La Paz Mexican Restaurant": [["Jen J.", "I have never had a poor experience at La Paz. The food and service are spot on. The last time we went there it was a Saturday evening and they were really busy but neither the food or service was compromised because of it. The manager was walking around refilling drinks, bussing tables, delivering food, etc. Our waitress was very friendly and always made sure we were taken care of. La Paz is definitely the place to go in Lincoln for good Mexican food!"], ["Natalie E.", "Chips were warm but flavorless, but the salsa had a good consistency, not too runny or chunky. It could use more cilantro and/or peppers though...it tasted mostly like tomato and onion. I was disappointed in how many pre-made ingredients they use. I asked for an accommodation and found out that they pre-make most of their meats and entrees. So I really only had a few choices on the menu.  Disappointing. The menu is very Americanized and lacks dishes I would expect at a typical Mexican restaurant (i.e. barbacoa, carnitas, etc). They had \"Mexican\" potato skins on the menu. Enough said. My dish tasted very \"food service,\" not like freshly prepared ingredients. The decor is outdated as is the exterior of the building itself. Needs upgrading if they want the ambience to enhance the dining experience. It's made up of a lot of random Mexican/Texan kitsch. Our server was fine, but didn't have much of a personality. Not very attentive."], ["Lindsay H.", "Hi Rick, we ordered the shredded beef and mushrooms both times. The first time we got peppers, mushrooms and onions and the second time there was only ground beef in the quesadilla."], ["Joe M.", "The best Mexican restaurant we have been to in Lincoln. The food was very good for the price and our service was the best experience since moving here this summer. We will definitely return in the future."], ["Elisabeth E.", "Had lunch here the other day and was really pleased. We were seated quickly, and our order taken promptly. The atmosphere is what one would expect in a little Mexican restaurant. Lots of colors and fun decorations. It's not a very big place so there isn't a ton of seating.I was pleased that the server immediately was familiar with the gluten free world and brought me out a separate menu to order from. There is a decent amount to choose from. I ordered the steak soft tacos with corn tortillas and they were fantastic. My aunt and uncle also really enjoyed their meals. I was also able to enjoy the chips and salsa.Price was very affordable and the portion size was great. I definitely plan on visiting this place again soon and maybe giving their margaritas a try."], ["Jay S.", "Not sure how this establishment has 4 stars...I'm from az.but I live in mn,so I know good and bad mexican food to a science.i passed thru town and gave la paz a shot.i ordered the chicken enchiladas via servers suggestion.the salsa that came with chips was bland no flavor similar to pace picante.i got my food,rice similar to canned rice,chicken enchiladas had two sliv ers of chicken in each,equivalent to about 1/4 of a chicken breast..for 11 dollars this food was pretty much a beans and cheese masked plate..if your looking for texmex  that a 40 year old lady white lady who isn't the best cook and uses ingredients from hy-vee this may be your place..."], ["Paige O.", "Best Mexican in Lincoln! I always get the cream cheese enchiladas, they are phenomenal!"], ["Julie A.", "La Paz is always very good Mexican American food. Fast service! Love their salsa & chips, jalapeño poppers and steak tacos! Reasonably priced too!"], ["Agustin T.", "The burritos were short but they it was all meat. Great customer service and the green salsa was spicy. You could tell the red salsa was from the can though and the drinks were warm when served."], ["kristen m.", "Been there twice. The stars are for the service sooo nice and helpful. Food isn't soo impressive. The chips are good but the salsa is lacking flavor. The pork wasn't very tasty kinda reminded me of bad wedding food. The fajitas were tasty but super small portion for the price."], ["Tracy K.", "Excellent food.  We were staying at the hotel next door so it was convenient, but it was also very good.  Seemed to be busy to on a Friday night.FYI. Margaritas are blended, not frozen. Can get them on the rocks too."], ["Shelley W.", "Took a risk based on reviews for a good Mexican restaurant in Lincoln.   Was not disappointed.  Very good food.  The flank steak tacos are great.  Marinaded strips of flank steak cooked just right.  The shredded beef enchiladas had a tasty red sauce.  The server was very friendly and made good recommendations on menu choices."], ["Joe S.", "Great prices, and we really enjoyed our second visit. This would be more frequent if the lines weren't so long! Great enchiladas and chimichanga."], ["Don M.", "LaPaz is a pretty solid restaurant.  It is my wife's favorite Mexican restaurant, but not mine.  The free chips and salsa are a nice treat.  Yesterday when I stopped by I had the seafood enchilada.  The taste was pretty good but it was pretty unappealing visually.  The \"seafood\" was a mushed up paste, and other than the shrimp, you'd be hard pressed to identify what was in it.  My wife had the nacho's.  It was pretty good.  The downside was that when she was about to finish she found a big ol' hair in it.  I showed it to the waiter who immediately comped her nacho's.  So, I think that was excellent customer service on their part."], ["Charlie W.", "5 stars for the best Mexican food in Lincoln.  And they've won plenty of awards to prove it. The chips and salsa and the margaritas (2 essentials at a mexican restaurant) are great. Especially the chips and salsa, its easy to fill up before your entre. My favorite thing on the menu is the cream cheese and chicken enchiladas, but everything I've tried has been above average. They put cream cheese and queso on a lot of different things, which is what really puts La Paz a step ahead of the other mexican restaurants in town for me."], ["Greg S.", "Came here tonight and the service was okay tonight but quick. The margarita was okay at best, the bartender obviously doesn't know how to make a proper marg. We waited for quite some time for our orders to arrive...On the order of 20 to 25 minutes. The waitress probably spaces our orders sitting under the hot lamp. My chile relleno was tepid but still good. Barbie's faluta was \"excellent\" except for it was barely warm. As good as she ever remembered it. Oh well, still like the atmosphere."], ["Charles L.", "My wife, daughter and I were in town looking at house due to relocating from So Calif to Lincoln.We ate here on tuesday, July 1. All of us are vegetarians so mexican is usually safe but limited. Read the menu on line and had a very large selection for us. We eat a lot of Mexican food since we live in So Calif. Food was very good. Just needed a few tweaks and would be dynamite. My wife had the veg chimichunga which she liked. She did not find the need for a side of beans though since beans were inside. Also, the sauce, tomatoes, etc on top could have been on the side and the chimi would have stayed crispy. Just a nit pick...sorry.My daughter had a bean and cheese burrito which she liked. She LOVED the kids margarita. Sugar on rim instead of salt too.I had the potato enchiladas.  Very good.Waitress was very nice and helpful.I had a margarita and my wife had a daiquiri.  Both fine.The reason they get 4 stars instead of 5 is due to a pet peave I have... drink order is taken up front= great. Not asking us if we want a 2nd drink when our food comes= bad (and you as a business are missing on extra revenue). Drinks are low or gone by the time food comes...why not ask the patron if they want a refill????We all wanted 2nds...that would have been another 15 - 22bucks in the till and couple more for the tip....just saying. Staff needs to upsell...even the little things.We will be back and often after our move. Please ask if we want a second round."], ["Mark J.", "Its ok as far as Mexican food goes.   Typical Mexican food, nice staff but they are a little heavy handed with the cheese.  I am not much of a fan of this.  The chimmis are decent, but skip the seafood, its poor quality.  Margaritas are well made and the chips and salsa are fresh and tasty.  Décor is  a bit dated and the place is smaller then I would hope so if its a busy night/holiday you might have to wait a while to get in."], ["Emily P.", "La Paz catered a small family gathering for us in June. They were super easy to work with and very accommodating to our various dietary needs. And they carried all the food out to our car for us when we came to pick it up! Nice! Most of all though, all the food was crazy delicious. I could not stop eating the Enchiladas La Paz, and my husband ate more than he needed of the Chili Verde Burritos. :) I am pretty bummed that I don't live in Lincoln anymore to enjoy La Paz more often!"], ["David W.", "Ate dinner with my wife and son around 7:30 pm the lot was full.  Thought about leaving,  glad l didn't.   We were seated promptly,  our waiter was effeicant, getting drinks, chips and order.  Love love the salsa. Loved the friendly service from everyone,  all employees we encountered made my day.  Food was great, drinks were refilled quickly, and I believe  everyone generally cared that our meal experience was the best it could be.  Always my first choice for Mexican!"], ["Crystal H.", "I had enchiladas and everything on the plate was AMAZING!! I'm very particular with my Mexican food. This was soooo good!!!"], ["Scott S.", "Hands down the best Mexican food in Lincoln!  The chips and salsa are dangerously good, I find myself eating at least 1 basket and 6 salsas every time I eat here.  I recommend the Sante Fe chicken tacos served with there chipotle sour cream, polished off with a jalapeño margarita.  For dessert try there honey sopaipilla's with ice cream. There service is always speedy and friendly!"], ["Donald G.", "I have since moved to Massachusetts, but if I am every in Lincoln, NE again I will be coming here! The enchiladas are NY favorite, but the tacos and the chimmis are great too. The owners are very gracious hosts and the hosts are very accommodating. Milder Mexican friendly environment, calm and delicious. The other Mexican restaurants in Lincoln can't compare.... Do not skip this little gem for the blandness of Carlos O'Kellys... This place has mild fare with much flavor!"], ["Nick G.", "First time eating here. Service was great. Chips and salsa right away when we sat down. Food came quickly after placing order.  I had the seafood enchiladas and they were delicious. Would recommend this place to anyone."], ["Amanda K.", "Good, basic Mexican food. The chips and salsa were good. I ordered the house margarita and wasn't disappointed. Though I did enjoy my second margarita much more. But the third one was the best, by far!Anyways, I got a beef burrito that was pretty standard. They use shredded beef, which I prefer. Good beans, good rice. Everything was just good. Have I had better Mexican? Yes. In Lincoln? No. So I'll be back."], ["Paul B.", "I wish I could tell you how many times I have been to LaPaz Mexican Restaurant over the years - but it is way to many to count.  LaPaz in on our short list of restaurants we frequent here in Lincoln and I have NEVER had a bad meal.Here's a surprise - ask for the non-menu-item - Raspberry Jalapeno Margaritas!  They are AMAZING.We'll be back - probably this weekend (no matter when you read this - HA)"], ["Jose D.", "I'm glad with the responsible reply from ownership. I was part of a group of 15. Even though we called ahead the room was not ready. The server was overwhelmed not in the mode of fixing anything. . Any way, made from scratch does no make it authentic it make it fresh, that said, I think they have better days ahead."], ["Matt W.", "We went here on a Tuesday night figuring it wouldn't be too busy. It was pretty full, which is a sign of how popular the place is. Seated fast, our waiter was really good. I had a platter with flautas, a seafood enchilada, and a beef tamale. The flauta was excellent along with the side of rice and fresh guacamole. My wife had the chicken & cream cheese enchilada. She said it was great as well. The chips and salsa they give are really really good too. It's a nice atmosphere to get some Mexican food and have a few margaritas with friends. The food came fast too. I'd highly recommend."], ["Gary P.", "This is our all time favorite Mexican restaurant.I must admit that it is addictive.The food is awesome, the ambiance is great, and the prices are unbelievable. We love going there early so we don't have to wait for a table because the word is out in Lincoln (it is voted #1 every year here) and LaPaz is one of the best places we love going out to any night of the week."], ["Jason Z.", "Fantastic lunches, superb dinner, and their catering is just top notch.  Never ever had a bad meal here.  Ever."], ["Glen S.", "La Paz...tasty, satisfying and savoring.There aren't many Mexican restaurants that I can say satisfy me, but La Paz did.  There really wasn't anything that made La Paz stand out besides the fact that the food hit the spot...the right spot.Price: great!  again, about what I expected but nothing too spendy.Food itself: oh, it's great!  I'm a fan of mixing everything together (because that's how it ends up anyway) and the plates served were just that.  It was perfect for me!  And I enjoyed eating off other people's plates!Heck yes I'll go back."], ["Tom T.", "When was the last time your food arrived so hot you had to let it sit or blow on it? Yeah, it had been a long time for me too. Thank you La Paz for bringing me my lunch hot and delicious. I'm from Texas so my Mexican food standards are pretty high and La Paz is as good as I've ever had. Ordered spinach, cream cheese and mushroom enchilada and seafood enchilada and pork tamale and enjoyed every bite. Chips were were not typical \"restaurant style\" but uniquely thick and tasty with thick hot sauce. Great service and reasonable price. Sopapilla for dessert was outstanding. And did I mention the food was served HOT, not Luke warm like too many restaurants do! What a unique concept!! We will be back."], ["Cindy N.", "Best Mexican restaurant in Lincoln! Cream cheese chicken enchiladas are where it's at."], ["Mary S.", "As far as Mexican food goes there is really nothing special about this place. Nothing really caught my taste buds attention. Service was everything you expect but nothing more. Drink specials were pretty good."], ["Mary A.", "Hands down favorite Mexican restaurant I. Lincoln!"], ["Susan S.", "We love La Paz for the amazing food, margaritas and free chips and salsa.  The food is great.  We have eaten here a LOT over the last 10 years!  The atmosphere is wonderful.  Great place to meet your friends for a night out...they have plenty of options for the kids as well.  They offer 2 heats of salsa and both are yummy.  The service is always great and we have never been disappointed."], ["Devin B.", "A short walk from my hotel. Nice authentic feel. Very dark. Had the chicken burrito meal. It was good. Had a clear almost gelatin type sauce. It was different and wasn't smothered in cheese, which I liked. Service was good."], ["King B.", "A HUGE part of the reason we go here is for a particular waitress named Nock. Please ask for her section, she is AMAZING! The food is decent, though we have noticed the portions seem to be getting smaller, but the quality remains. I suggest the La Paz Taco or the house combo."], ["Justin T.", "This is our absolute favorite place to eat in Lincoln.  The atmosphere is great.  The food is done exactly the way we like it.  Unlimited, free, chips and salsa is a great way to start off each meal.  We go here almost every Friday evening and will definitely continue to do so."], ["Gabby A.", "I've enjoyed my experiences here.  When I go, I do not expect authentic Mexican food.  I expect Tex Mex, and they do it well.  I really like their chile rellenos, and they have some very good chicken and cream cheese enchiladas.  Their refried beans have a unique smoky flavor, but I hate the rice. The service is great and as stated many times in earlier reviews they have great chips and salsa.Go here for Mexican-American food, but do not go here if you're expecting authentic Mexican food.  Try a Morales family restaurant instead (La Mexicana, El Torro, Las Margaritas etc) or if you're looking for something off the beaten path truly authentic try Super Taco."], ["Thomas L.", "This is a favorite restaraunt for my wife and I.  It's a date night regular and we are always satisfied with the food, I have never had a bad meal and the service has always been friendly and prompt.  I would reccommend this place to anyone who loves good Tex Mex."], ["Sherry S.", "Love the Taco La Paz.  Good Salsa.  It's good and service is decent."], ["Sam S.", "I had lunch at La Paz yesterday.  It seems like I tend to judge a mexican restaurant by the chips and salsa as much as anything else. The chips were great.  Very fresh, great salt.  The salsa was OK, slightly above average but I prefer salsa that is less chunky and with some kick.  I understand though that you have make salsa for the masses a little less spicy.  For lunch I had the chicken and cream cheese enchilada and it was good.Service was excellant."], ["Angela W.", "My first yelp review has got to go to my favorite restaurant ever. I will be honest-I haven't been there in about a year, but that is only because I have moved away. I still think of this place and actually crave their food and chips on a regular basis. Maybe there is some drug in it??This is a local restaurant just off their main road \"O\" Street. Tucked away but pink enough to be noticed! Food has never been anything but fantastic. I have ordered the chicken tostada more times than I can count. It is always served fast (with a smile), hot, and delish! They have a wide range of other dishes too and I have tasted most of them-all good, but always went back to the tostada. The chips and salsa keep coming. They will bring out three servings if you let them (for free). Even when I wasn't eating there, I would buy pints of their salsa as well. Margaritas are awesome (not very strong though).Service was always wonderful. Food was cheap. Never waited longer than 15 minutes ever. Fun music. Managers always around making sure everyone is happy. Bathrooms clean. This is a great place to go alone for lunch (if you must)...or with a group. They make you feel at home and comfortable either way.Oh...I am homesick! When you go, have some chips for me!!"], ["Wyn R.", "The *best* place in Lincoln for Gringo Mexican food.  Fantastic salsa, full of fresh chunks and a lot of cilantro!  My favorite is the combo plate with a beef and pork burrito, your choice of enchilada and a chile relleno.  This place NEVER disappoints."], ["Ryan C.", "Jalapeno margaritas and cream cheese & chicken enchiladas are the best! Cozy atmosphere, friendly service, and all at a decent price. As far as Nebraska is concerned - mexican food doesn't get much better!"], ["Luis M.", "Everyone in Lincoln seems to just love this place, but I don't quite know why. I think it is pretty good as very Americanized Mexican food goes, although there are a lot of salt bombs on the menu, and I'm not sure how I feel about cream cheese in \"Mexican\" dishes. There's much, much better Mexican food to be had in town, and certainly much more authentic Mexican food. If I were eating in this neighborhood I'd probably skip La Paz in favor of TwoTwins Cafe up the street, although mind you the latter is not a Mexican restaurant."], ["jennie p.", "Some of the better American style Mexican food I've had in Lincoln, and the margaritas are delish, too!The atmosphere is appropriately tacky - there's definitely the standard sombreros hung on the wall and chili peppers strung from the ceiling, but somehow they've managed to do it tastefully.I can't remember what I've eaten here, but I know it was good and definitely way better than at El Portrero in the Haymarket."], ["Sarah A.", "A very good little Mexican food place.  And quite reasonable prices.  And the only Mexican restaurant I know of thats in a pink building.  :)"], ["Becca C.", "Definitely the best Mexican in Lincoln! Try the cream cheese chicken enchiladas.... that is if you have room after their AWESOME chips and salsa you ate while waiting!! The chips are always warm and so good. Try their queso with them for a nice treat."], ["J C.", "It's local so thats cool.  chips and salsa good.  always busy on weekend so must be doin something right.  I always like the food.  I always end up ordering multiple pitchers of margaritas when i visit so they must be good too.  .... i thought of another mexican restaurant in a pink building-  casa bonita in denver, co."], ["Jay C.", "This is my husband's all time favorite restaurant. I started eating there with him and now I am hooked too. The food is awesome, the ambiance is great, and the prices are unbelievable. We now live in California and La Paz is one of the places we have to visit whenever we come back."]], "El Mariachi Taco Cantina": [["Chuck L.", "Best, most authentic Mexican in Lincoln. Try the Arrachera Poblana. Yum!!!If you are early or late to anything are the Pinnacle Arena make this a part of your experience.  I love Carne Asada and they slice their steak in thicker slices and make it medium rare upon request!!Extra good. I just hope they hang I. There. Completely unknown to those with the the Mexican slant in their taste buds."], ["Jennifer A.", "Fantastic!  Great portions, service was good.  Salsa and chips yummy.  White cheese dip was super.  Had the combo fajitas and they were amazing!  Would come back"], ["Ryan W.", "Tried out this restaurant when stopping in the Pinnacle Arena. I had the Nachos EL Mariachi which was awesome! I had steak, pork, and ground beef - plate was heaping and I could not finish them. My better half had the Taco Mixtos, which were \"very good\" per her words. Pricing was very reasonable, service was outstanding. Atmosphere was comfortable to include the chairs we sat on. It looks like they have some good Margaritas here but we did not partake. Huge plus - there is a parking garage next door making access easy in the Haymarket area... I can only image what it is like in here on a Husker Game day... Well worth the visit - highly recommend."], ["Rumil B.", "So yeah, this was a 1/5 experience for me but since they're pretty new I'll give them the benefit of the doubt and bump it up to a 2. The chips were fine but the salsa tasted kind of ketchup-y. The mango margarita was only 4.50 but apparently because they skimp on the mango and the tequila.I had the Tacos Mariachi and flan. The tacos I was expecting to be really flavorful because it was literally just fajitas. But they had no flavor! I've never had flavorless fajitas before. I had to add a lot of hot sauce to make it taste okay. The flan was weird. It didn't have the caramelized sugar on it. Instead they poured some kind of sauce on it. And the texture was weird, more like a cheesecake.The service was fast. The waitress carded me twice though. She needs a lot more experience. Hopefully this place gets better over time or they'll just be taking up space right next to the arena. But I probably won't be back."], ["Luke V.", "Slow Sunday afternoon so service was good. tacos were authentic and cheap. I would recommend the El pastor and adobada tacos and definitely try the green sauce, it's good. 3 stars because it's nothing above average but if you like cheap Mexican food this may be the place for you."], ["John B.", "Not a very good experience  The food tasted like they microwaved something out of the freezer.   Definitely not authentic mexican or of much quality."], ["Brittany S.", "Can you say wow?!! Yes I can, because this New Mexican restaurant is amaze balls!! Very authentic and bilingual. One down side was the hostess hit or miss. The food is to die for and the price is amazing. I don't like the rice because it wasn't authentic Mexican rice but still good. We had 3 drinks, 3 huge platters, and it was only 40$!! Yummy."], ["M M.", "Love their chips and salsa. Usually get a chicken quesadilla x 2 for a total of $6-8. Great price for what I get. Haven't really adventured past that and couldn't tell you about the rest of their menu."], ["Adrian B.", "If you like $6 generic burrito's, watered down salsa and poor service this is your place.  Was greeted by two shouting servers from the bar area who could not be bothered to walk to the door and tell us to seat ourselves.  We had to walk over and ask them what they were screaming over the load music.  Service was poor and matched the greasy chips and rubbish salsa (ketchup).  Steak was over cooked, shrimp was over cooked, tortillas were so chewy I gave up eating them.Not given any cutlery, water, or offered another drink in an hour of eating.  Decor is pleasant and bright.  Lots of TV's on with no sound, pointless...Won't be back."], ["Jason G.", "I will preface this review with the fact that both of my experiences have both involved take out so my experience with the service has been limited.  Over all the food I've had has been pretty good, and the service quick and friendly!  The place it's self is charming with the feel of a typical American Mexican restaurant....brightly colored, with lots of tables, Latino music and tele novellas on the TVs...It's basically what the owner thinks the typical Midwestern American thinks a Mexican restaurant should look like.   On my first visit I ordered 1 chorizo taco and  1 al pastor taco Although they are only $1.50 each, they are relatively small, they were delicious, and I wished I had ordered 2 more, the take out came with 2 different salsas and both were good, not to spicy, and a little smokey.  The tacos are loaded with, lettuce, pico, creama and Queso fresca (that delightfully delicious white crumbly cheese) and busting with the herby goodness of fresh cilantro, and served on yummy soft shell corn tortillas.Today I paid them another visit, also for a take out order....learning from my last visit I ordered four tacos.  I revisited my favorite from my last visit and ordered two of the al pastor, but decided to go with 2 chicken tacos this time.  The Al Pastor were as delicious as I remembered, but the chicken tacos were a let down...the chicken had a bit of a canned flavor to it like I was eating Campbell's Chicken Noodle Tacos....it was weird.  The toppings and salsa were just as delicious as my last visit.  The moral of my story is this is a good little Cantina with a some authentic Mexican flare, covered up by some Midwestern dumbing down! It's located directly across from the a Pinnacle Bank Arena, and would make for a nice stop before a concert or a basketball game for some decent cheap food, and a margarita...."], ["J. Scott S.", "Great queso i n the enchiladas, even the refritos and rice are remarkably good. Huge sopapilla sundaes. Great place."], ["Todd S.", "First visit.  Food was great and service was even better.  Very friendly servers and atmosphere.  Will come again."], ["Jessie D.", "5:30 on a Tuesday evening there was only one waiter for 8 tables.  The waiter was very unfriendly, never smiled, was obviously stressed with all the tables he had.  Service was very slow.  My husband was served the wrong meal.  Rice was not good.  Will not go back."], ["Christina H.", "This place is at an excellent location right across the street from Pinnacle Bank Arena in Lincoln, NE. We avoided the fight through traffic and stopped for a margarita. They happened to have a $3 special for the margaritas which were delicious (original on the rocks with salt). The free chips were just ok served with a salsa that was mild. Prices were reasonable for the entrees considering this location!  The server said the fajitas would be good to try ranging in price from $11.50-$13.50. Since we are local I'm sure we will be back to try the food!"], ["Julie S.", "The service is Very Slow, if you have time to sit and wait for your food this is the place to come. The chips and salsa are good, guacamole not so much. Margaritas, pre-poured and sitting in the bar. Food finally came and needs some flavor, no spices."], ["Michael H.", "While I enjoy laid back service, I do not enjoy service that is so lax that we have to ask for the chips and salsa which were supposed to be brought out when we sat down. The fajitas were decent but the Nachos Mariachi had meat that was bland and looked very unappetizing. If you're lucky, the waitress might remember she is in fact a waitress and offer to refill your drink."], ["Cari F.", "Not good at all...excruciatingly slow service, no one got our orders right, our drink order was given to another table and my chicken was more of a mystery meat."], ["David S.", "Brand new so still working out the kinks but food is awesome.  This isn't tex mex.  It's the most authentic Mexican food in Lincoln. Caldo de Res and enchiladas verdes were top notch."], ["Alexa D.", "When you walk in there is so much to look at with all the beautiful decor!! Then, it just went downhill. We walked in and someone from the bar yelled at us to sit wherever we would like. We sit and our server came right away with some kind of chewy chips and salsa. We never got any water.  I ordered a margarita to find out they only have one small size. (This wasn't bad, just I found it odd- first Mexican restaurant I've ever been to with one size) margarita was tasty but didn't taste like tequila was in it. My husband and son ordered some steak tacos and really liked them. I ordered a chicken nacho that was worse than any fast food nacho a person could have. It was a cold nacho plate. It literally was a cold plate of chips, some warm refried beans on top, a canned, cold orange cheese sauce poured over with nuggets of diced chicken? And lettuce. The best thing about this plate was it looked pretty and the beans were warm. The chicken tasted like it came out of a gerber baby food jar. When the server came and asked if we liked our food I gave her my barely touched plate. She asked what was wrong and I said there was no real cheese and the chicken tasted canned. She ignored I said anything and asked if I'd like to order a taco. I said no thank you. But when we got the bill, they did take the poorest excuse for a nacho off our bill, so that was very nice to see. I still will never go back though."], ["Joe M.", "The food took quite a bit longer that I had expected; after all, I only ordered tacos. When the chicken and beef tacos arrived they had very little flavor. Quite disappointed."], ["Emily C.", "The food has no flavor. The chicken in the tacos was gray and bland, and the tacos don't even come with lime wedges. The corn tortillas tasted pretty good, but if the tortilla is the best part of a taco then you have a problem. The salsa tastes like ketchup. The pupusa was okay. The margaritas are cheap but not that delicious and definitely light on the tequila. The service was quick enough but not very friendly. Overall, you're better off going to El Potrero and definitely better to go to La Mexicana."], ["Susan S.", "Not thrilled.  The location is top notch, but the service and food was poor.  We ordered for ourselves and our 2 children.  They didn't seem to know what a flour tortilla filled with cheese meant and brought us the weirdest thing we've ever seen (and didn't eat)....a hard shell taco filled with melted cheese.  The kids turned up their noses and so we gave it a taste...not something we would eat either.  Big waste of $.  They took our order for a margarita and never brought it, but charged us for it anyway.  They were not busy and had lots of wait staff, so not sure what the problem was.  The prices were VERY reasonable, but with such poor service, we won't try it again.  The chips were so-so and the salsa was very bland.  Disappointed since we are huge mexican fans and eat out often.  Next time we will walk the extra few blocks to go to El Potrero."]], "Mazatlan Mexican Restaurant": [["Genevieve W.", "Always great authentic food at reasonable prices!! I love their guacamole and wonderful tortilla chips. The salsa they bring back to the table right away is amazing. They bring you a mild which is like a pico de gaio and then there is the spicy. The bean dip and the cheese dips are also delicious. So is their appetizer platter with cheesy chips, quesadillas and taquitos. I must mention that their refried beans are made with a whole lot of the L word.... Lard. Traditional wonderful refried beans! The place hasn't changed decor since I came here as a kid so it's s bit nostalgic.  It's pretty clean and well maintained though. The bathrooms could use a bit of updates but not bad. The patio out front is awesome. And the restaurant itself is well kept and clean. Staff is friendly and they bring your order out quickly. Would highly recommend for any craving of nice sit down traditional style Mexican food!!"], ["Steven T.", "This is as close as you will get to Mazatlan Mexico in Nebraska. The food is as authentic as you can get and well priced too. At busy times the restraunt can be a little crowded and loud but one can handle it for a good meal.Tonight my wife and I had the Morales Special and for the cost of $27.95 you get a lot of food. I am talking a huge ribeye steak, two chicken breasts, prawns with onions and mushrooms, beans and rice, guacamole, sour cream, fresh pico, and tortillas. It says a dinner for two but four could eat on it easily. This plate with all that costs less than 2 separate meals. Cannot beat the bargain."], ["Brandon F.", "The worst service I have ever received in any restaurant. The servers have a weird attitude that was aloof and disrespectful. It was as if they were doing us a favor by serving us. We asked for any spicier salsa than their bullshit concoction served with the chips and they simply said \"no.\" They take your order and 30-45 minutes later you'll get some bland crappy \"Mexican\" food that would only impress the most sheltered of people. Cholula was the most flavorful thing I ate that evening and I can do that perfectly well at home. In fact, I would be more satisfied chugging a bottle of Cholula and calling it a wonderful Mexican dining experience. I'm disappointed that people return here and keep the restaurant in business because it's an epic failure."], ["Mitch G.", "Amazing food. Menu is authentic and not \"tex mex\" so if expecting low grade, crappy, pseudo Mexican food you will be disappointed. Been coming here since they opened and never had bad food or service."], ["Cole K.", "Probably some of the best Mexican food in town but absolutely the WORST service in town. The waiters are slow and incredibly unresponsive. They will not even check up on you once you have ordered. The staff is  cheap in that they clearly ignore tables that haven't ordered expensive/alcoholic drinks. I once ordered a soft drink when I was seated, and the waiter did not stop back by to check on us, and waited for over 20 minutes to bring my soft drink only when my meal arrived. Loved the food but will never return because of this horrible (borderline disrespectful) service. Go here if you want to play the fun game of flagging down anyone that can help you...it's a real challenge!"], ["Rudy S.", "excellent Mexican food. service has always been excellent.  food very good.  large servings. excellent margaritas. Julio & Claudia are the best servers but all wait staff has been very good   chips are the greatest even better with the CHEESE DIP."], ["Kendall R.", "We did more waiting for service and the check, than we did enjoying the meal. I had the chicken enchiladas with creamy cheese sauce.  I swear the cheese sauce was melted Velveeta queso. Yuck! I have given this place several chances and won't be giving them another. If you want GREAT Mexican food, go to Hacienda Real at Southpointe."], ["Chris P.", "I love this place.  I've never had a bad meal here and I've dined in a hundred times at least.  The staff is always courteous, the food always and hot and fresh."], ["Kat R.", "I loved the food I got here. It was a little pricey, but it wasn't too bad. The service was fast when I was there, but the store was not busy. Prices were reasonable and portions were big. I'd definitely go back."], ["Aaron O.", "Decent food for the lunch special, $1.25 to add sour cream though? C'mon! Potentially the reason the rest of the menu is 120% more expensive. Might return for drink specials, oh and the spicy salsa was great!"], ["Matthew H.", "Always have had good experiences here. I highly recommend the Cancun fajitas (my wife likes shrimp, I get the steak). Also, they have amazing chicken tortilla soup; it comes in a huge bowl and is a great value, especially if you order off the lunch menu. Excellent service, good chips & salsa, and fair prices. My favorite Mexican place in town."], ["Amanda K.", "The entrees were hot, cheesy and delicious. Very typical Americanized Mexican food.  The staff was friendly. The only thing to complain about we're the chips and salsa. The chips were HARD (you can't even call it crispy). We couldn't eat much of them.I had a burrito and it was just blah.  My fiance had the fajitas and they were AWESOME.I'm giving this place 3 stars for the fajitas.UPDATE:  I added a star for the margaritas.  YUUUM!  Chips are still blah, but I did order some cheese dip on my last visit.  Anything. Tastes. Good. With. Cheese. Dip."], ["Gary P.", "Typical non-authentic mexican fare, cover every dish with cheese and stick it under a broiler and then dump a quart of sour cream on top and serve.  Seriously, the staff is nice and works hard, but I feel it is just not good food."], ["Aaron T.", "This is some great mexican food. My mother-in-law took us here for lunch. We ordered the lunch specials. The meals were very fresh and very hot. Loaded with flavor. The beans and rice were also on point. The bill wasn't too high. I will defiantly eat here again if I'm in the area. Try to stop here if your in for some good mexican food."], ["Joshua H.", "Awesome food! I grew up in Seattleand when I moved to Lincoln I found a ton of places serving nasty old seafood...not this place! Get the seafood acupolco burrito mix of shrimp scallops crab octopus ...good stuff..everything is Taste :-)"], ["Morgan H.", "Sad excuse for Mexican food. I ordered the enchiladas sunrise and had pork verde filling for my enchiladas. The green chile sauce lacked flavor and there wasn't much on my plate. The pork was okay but I expected it to be more tender if cooked properly in the sauce. The eggs were over cooked and there was about a tablespoon of run to them. This is such a simple dish. It's sad that a restaurant that has several locations can't handle the basics. 2 stars because the service was good."], ["Chaviva G.", "When I lived in Nebraska, everytime I went to Mazatlan I got a Pina Colada, because they were -- hands down -- the most delicious I've ever had (to this day even!). The food was always piping hot, the servers were always friendly, and the restaurant was always packed with families, college kids and couples. I remember going on a date here once, even. That was awkward. At any rate, I recommend this and any of the family restaurants -- Las Margaritas, La Mexicana, etc. -- to anyone looking for delicious food at a reasonable price and outstanding pina coladas!"], ["Meg R.", "Good food, good drinks!! I would come here again. Nice atmosphere."], ["Marlo C.", "It was ok. We were in a rush and the rest of our party had already ordered and some had already gotten their meals when we got there 10 mins late. We were asked what we'd like to drink, both wanted water. The server asked if I could just drink the water already next to me (which wasn't mine). I said no, I'd like another. (I found that to be insulting, I would never ask someone to do that) She left and never returned!! Not even to take our order. We waited 15 mins before my bf got up and went to the bar and tried to get us water. The bartender said that our server could get us some. So we waited longer. When we saw her again, we asked for our water and she said \"oh\". \"OH??!!!\" We were not impressed. After 25 mins we got water and she walked away. We asked when she walked by again if we could order. And of no suprise, she said she'd be back and didn't come back for 10 mins. By then all of our friends had eaten and most had paid, and we had yet to place an order after being seated for 30+ mins. I ordered a cheese quesadilla (I knew it would take the least amt of time to prepare). It was enormous (which was good but by then I was less than excited to eat it) and it came with guac, sour cream, and pico. My bf said he didn't feel like eating, so I asked for the bill. For $12, it was NOT NOT NOT worth it AT ALL. We may go back....someday. We believe in second chances, but first impressions are lasting."], ["Angie W.", "I went to Mazatlan last night with a couple of friends.  I am a chips and salsa fanatic, and I was not thrilled with the chips.  They were hard and not very flavorful.  The salsa was not the best, but definitely not the worst... \"a-ok\" in Yelp terms.  I ordered chicken enchiladas, which consisted of shredded chicken with some cheese and a bit of sauce.  They were pretty tasty, and I had no complaints.  My two margaritas were excellent, and I am very picky about margaritas!  No complaints about the service whatsoever.  All in all, a solid experience, but nothing in particular that would set it apart from numerous other Mexican joints."], ["Jules T.", "They have the best margarita. I prefer the mazatlan margarita on the rocks, usually in pitcher form if you have a large group. The food it great, hot, fresh, huge portions to share.  The nachos, burritos, churros, fried ice cream are great, my favorite is the skillet faijtas with shrimp. The staff is friendly, great for kids, busy on weekend nights. You can also get one free shot on Cinco de Mayo which usually turns into 2, 3 shots later. It's clean, cozy, parking is can be difficulty during their busy hours but I've always find a spot.Bathroom: Clean(locally owned, family restaurant) They also have a second location on south 27th"], ["Elizabeth I.", "Had a good dinner and margaritas, and the staff was attentive and friendly.  Soooo much food.  Maybe it was just the particular entrees but i might recommend sharing one and ordering more if you need it. Um, it's been a while, I can't remember what I had but I do remember that I enjoyed it."], ["Heather B.", "This is really good Mexican food.  It's a sister restaurant to co-owned El Toro, Las Margaritas, and La Mexicana. The service is great, and it's just a nice atmosphere. Feels like a real \"meal-out.\" I like these people and would recommend it to anyone... especially the chicken mole. And they have good salsa."], ["matt g.", "Really good and pretty cheap.  There is a great selection of margaritas and the food is always consistent.  It is a wonderful place to go with a large group."]]}