{"Thai Garden Restaurant": [["Spencer S.", "My wife and I walked here after yet another day walking around campus getting ourselves set for the school year.This place is walking distance from the City campus, about a block south from the Union. Upon entering there's a little wooden bridge spanning...nothing. It's just in the middle of the entryway. I suspect that, like we did, most people don't know what the hell to do with it and just walk around. Kind of awkward.We got two orders of tom yum, and a plate of basil beef. At $1.50 each for the appetizer-size soup, the tom yum is a great deal. It is hot, in every sense, and it'd be great for walking around on a cold day. The basil beef comes in a decent size portion, which it ought to for $8. It is very tasty. I noticed that some earlier reviewers dinged this restaurant for blandness, but that wasn't my experience.The service is good, better than it has to be, actually. We irritated the servers with questions about ingredients and soup bases, questions that people who's first language isn't English tend to find exasperating. Nonetheless, they remained friendly and patient, and best of all, they didn't lie just to shut us up.So this place is a win, as far as I'm concerned. I'd definitely go back and try some other dishes."], ["Anne C.", "Awful...possibly the worst Thai food, or any food I've ever had in a restaurant. It was cold, greasy and the Pad Thai sauce tasted like watery catsup. Half of our dinner party got sick. Run!"], ["Jill S.", "This place is tucked into the side of a building with a parking garage exit right outside the door. Didn't really know what to expect. The food wasn't bad per se but wasn't what I was expecting. I could be wrong but I think it's a regional thing. I ordered pad Thai. Which is a pretty straight forward dish. Either it is pad Thai or isn't, there isn't much wiggle room with a entree like that. It came out with the correct noodles but that was about the only thing that clued me into the reality that I did in fact receive what I ordered. I would say the sauce was sweet and sour sauce mixed with soy. Nothing close to the pad Thai I have had anywhere and everywhere else ever. But again it may be that the pad Thai where the owners are from have a different regional take on it. It wasn't bad, I ate it. I also ordered the fresh spring roll. Again not what I expected. It was noodles, lettuce and Krab (the K) isn't a spelling mistake! Usually these have pork and shrimp or at the very least tofu. The peanut sauce that accompanied it was grainy and weird frankly. If it weren't from the lack of flavor from the roll I wouldn't have used it at all. The server/would assume owner was very sweet and was very accommodating of our group of 6 that stopped in at 4:30, I'm sure not their peak hours. They accommodated all 6 of our separate checks with no problem which was nice and why they got two stars as opposed to one for the food. Maybe I ordered the wrong thing? I don't want to tell you not to give it a try, but maybe be forewarned it might not be the usual dishes you order but a different take on them."], ["Laura T.", "They get two stars because the water was clean and the atmosphere is nice. The waitress looked lanxious and worried, not friendly and welcoming. There was one other table table there. The food was bad. The noodles for chicken and fried rice noodles were hard and rubbery, the dish flavorless. The combination noodle soup was the worst: one piece of beef, lots of fake crab, 3 pieces of butterflied shrimp with huge veins and tails still on. No sides. No Siracha. Save your money and go to Blue Orchid. I wish I had."], ["Cheryl L.", "I was really disappointed tonight when I came here and was told that they were out of beef so Panang Beef Curry wasn't available.  I ordered the Green Chicken Curry instead and it was somewhat bland. I will try again some other time and hopefully they will have beef."], ["Erika R.", "The egg drop soup was delicious, great texture and flavor. I got the pad see ew, which was pretty tasty and the meat was good quality. The veggies left something to be desired and my friend's tofu wasn't very good, but overall it was a solid meal for a reasonable price."], ["Ariel M.", "Was not that great. I've had better Thai food. They're curry was pretty watery and the soup was not very flavorful."], ["Ben Z.", "I was surprised to see this restaurant looks much nicer compared with my last visit. They have redecorated the restaurant with good-looking lanterns and plants. The bridge were taken away. It looks more spacious now. Food tastes a little different but much better to me. The only problem is that it is still difficult to find in the downtown area."], ["Jessica C.", "Great food, I've had better pad Thai goong, but it was good anyway. Will come back, beef satay was amazing."], ["Awais A.", "This is by far the worst Thai restaurant I have ever been to. Will not spend money here again."], ["Alison H.", "Order the Tom kha for an appetizer, for $1.50 it was a good deal. It's not like any other Tom kha I have ever had, as it had cabbage in it. It was different, but I ate it. After being told the green and red curry dishes are exactly the same (not sure how/why that is...) I decided to order it anyway. A couple reviews said that the food was bland, but never about the curry. Well, I don't know how curry and coconut milk can be bland, but it was EXTREMELY BLAND! I could not even eat it without putting soy on it... Yes I said I put soy sauce on my green curry! Crazy! Will not return!"], ["Brandi Z.", "After going here twice to eat for lunch I can't help but finally comment on the food and service. I was told to come here if I liked egg drop soup, but their egg flower soup was quite disappointing. I'd compare it to scrambled eggs in broth with a weak/watered down flavor.The first time I got the chicken fried rice. I figured there would be some oil because after all, it's fried rice, but it didn't expect it to be so much! There wasn't a lot of chicken, but I figured hey, I was getting a rice dish after all, so I overlooked it. For taste, it was alright. Not really any seasoning or anything to make it stand out. Our hostess was quite attentive to us during the busy lunch hour, so it wasn't an altogether bad experience.The second time I got the Basil Chicken. For this meal I expected it to have more chicken since it was a chicken dish, and to be spicy as the menu suggested. It let me down on both counts. The chicken pieces were small, half the plate covered with more onions than I'd care to have. If you're going to put that many onions on a dish, they should change it to Basil Onions. There was no spice to speak of. When a menu tells me spicy, I expect my nose to start running and my tongue to burn. Nothing from this dish. It was bland and I hardly got a hint of flavor. Also, not once did our hostess come refill our waters. She came to give us the soup, our main dish, and the check, but that was it. It wasn't even that busy of a lunch service yet she still didn't have time to get us water.However, both times I quite enjoyed the spring roll. Maybe I'm just not ordering the right things, but I know I won't be going back here anytime soon.A note on the atmosphere: it's a quaint hole-in-the-wall place with a bridge to nowhere that takes up space, but after going to the bathroom with a ton of cleaning supplies opposite me, I felt like they had to have a better place to store all of their chemicals than in the women's bathroom."], ["Andrew W.", "I no longer live in Lincoln, but I had to write about Thai Garden after a recent visit.  I loved and still do love Thai Garden's Coconut Potato Curry.  This was my first place that I discovered curry back in college.  The flavor was so different from what I typically ordered from a Chinese restaurant, my only comparison.I ate at the Thai Garden a dozen different times and always had the same woman take my lunch order.  She was excellent and took care of the entire restaurant by herself.  I always wondered how she did it.I hope to walk over that little bridge again and order a plate of Coconut Potato Curry.  Thank you for such great service over the years.This small restaurant is worth a visit.  I am glad I discovered it and have cravings and wish I lived closer some times."], ["Tessa P.", "Meriocre food. HORRIBLE service. Over priced and when I need a togo container for my barely mediocre soup they brought me a box. Soup can not be contained in a box. Sorry. I left it and the grey pieces of meat behind."], ["Jessica J.", "Is it possible for Thai food to be bland?  I didn't think so until i ate at Thai Garden.The egg flower soup was straight up chicken broth with scrambled eggs.The egg roll was completely devoid of flavor & the sweet chili sauce had the consistency of water.The Pad-see-Ew tasted like rice noodles & vegetable oil.  The chicken was funky flavored & the broccoli would not look at home in a garden.  Maybe in a can or freezer.My friend's meal was no better.Blue Orchid is ridiculously over-priced for what it is, but in comparison, worth every penny if you want decent thai food in Lincoln."], ["Jeff P.", "No wonder there's nobody here, the food stinks. I've never had flavorless \"curry\". I don't even think it was real curry. And it was missing the coconut milk that was supposed to be in it. The chicken was very over cooked.  The tom gai soup was weird. It was full of cabbage and had barely a hint of coconut milk.  Service was poor, as they seemed perturbed that we showed up during their lunch (they were eating right next to us).  Even for Nebraska, if you're thinking of Thai, forget this place."], ["D R.", "Possibly the worst thai food i have eaten. Pad Thai was a orangy pink color. Peanut sauce looked inedible. The only fortunate thing was the food i ate went through my system pretty quick!"], ["Ali L.", "I miss my Pad Thai from here. I always told myself I would go and try something new, but those cravings always got the best of me. Whenever I come through Lincoln I stop in here. The lunch special comes with soup and a spring roll for about $8, and it's walking distance from UNL campus."], ["Melissa C.", "Decent Thai food for reasonable prices.  The Tom Kha Ga was very tasty and well spiced. The yellow curry was supposed to be spicy, but was barely even mild. Spring rolls were good and tasted fresh. Thai iced tea was delicious. Great service here, much more impressed with the service at this Thai restaurant than any of the others in Lincoln."], ["Wyn R.", "Meh.  They do a few yummy things - the fresh spring rolls, the fried spring rolls, the chicken satay, and the Buddhist Delight.  But, that's about it."], ["Mechaela A.", "I loved this place when I lived here and I still love it today.  I visited for lunch while in town recently.  The pad thai is still super delicious and my friend said the sweet and sour tofu was good.  Nice sit down place close to the University with fast service."], ["Steve U.", "Good Stuff.   Just got some take-out Pad Thai, it's close to my office.  Was delicious and the price was right.  I used to frequent The Thai House, will have to go in sometime and have a 'dinner' to see how it compares."], ["Gabby A.", "I do eat here on occasion, but it is not my favorite Thai.  The food lacks spices and is always a bit on the bland side.  The Thai Rolls are pretty tasty, but I haven't ever been crazy about the main dishes.  It's very cheap and very fast, so that's usually what draws me in every once in a while.  I have always stuck to the curries, so I can't speak for any of the other dishes.  If you're willing to spend a bit more for much better food, go to The Blue Orchid."], ["Rosy M.", "I've only ordered one item (Phad Thai), but it was so tasteless that I refuse to go back."], ["Lisa M.", "First time to dine, and I am very dispointed, everyone realized that \" Thai Gargen\" must be thai restaurant, actually it is not, it owns by Chinese couple, a wife is waitress and husband is a cook, they are listing  the menu information looks actually Thai food. Soup does not have any favour, only water and MSG, I was from Thailand, I asked her in Thai language, how come my order does not have to what it indecated in the menu, she said \" no\", not just only me had a comments,but other people next to my table also had commence about the curry too....finally I tested a little then paid and walked out...other people also walked out the door as well...."], ["J C.", "Jessica L's review is way off base and most of her other reviews are as well.  This place is well worth the visit"]], "Blue Orchid": [["Lincoln C.", "One of our favorite places. The staff is awesome which always makes our visit more enjoyable.  Been coming here for over three years on a regular basis.  The food is wonderful and we have never had a bad experience.  The food is always consistent.  It's wise to make a reservation as they can be busy and hard to get a table walking in. Hands down our favorite restaurant. Period."], ["Erin L.", "I was a bit disappointed. I hope I have a chance to come back and try some other menu items. The ambiance inside seemed fun and cozy, but it was too nice outside to be inside. Not a lot to look at on their patio tho. I got the yellow curry which was more like a soup honestly and the potatoes and chicken inside were not very flavorful. Dude but that drunkin money drink was my jam. I would order that on the reg if I lived in Lincoln."], ["David B.", "Don't try to find this place at the address given.  It is in fact inside the musty old Grand Manse building, though you wouldn't guess it until you get inside and start wandering the corridors and find a sign.  The best way to get in is actually around the south side of the building, away from the street.Unlike the rest of the building, the restaurant is not musty, and the Thai food is decent though the servings are small."], ["Elisabeth E.", "I've heard a lot about this place and was pleased to finally get to check it out a few weekends ago. I did try to stop by a couple months back and discovered they close after lunch for a few hours before opening for dinner again, so do keep that in mind. We went on a Friday night around 7:30 and were seated quickly. The atmosphere is calming with low lighting, a nice open dining room, and a subtle Thai ambiance in the decorations. The service was great and our order was taken quickly and food came out at a reasonable time. Nearly everything on the menu is gluten free so there are lots if options for those trying to avoid 'da glutensensMy boyfriend had this amazing Thai iced tea that tasted like orange cream. We enjoyed the Chicken satay for an appetizer. The chicken was moist and tender and it came with a sweet and sour cucumber salsa and peanut sauce. The peanut sauce was amazing. I had the panang curry with scallops and he had the drunken noodles. I thought the panang was pretty good, decent scallop serving, and my boyfriend always loves the drunken noodlesPrice is pretty average and portion sizes are good, I took some home and they even sent extra rice with me. I'll definitely be going back."], ["Weston J.", "Tom Yum soup is good.Tofu, veggies, spicy shit. More like Nom Yum soup.Haiku review."], ["Michelle P.", "Definitely my favorite Thai place in Lincoln.  It is tucked inside the Grand Manse building, but definitely worth it. You'll have to park elsewhere and walk unless you get really lucky, but don't let that deter you. Great Pad Thai and curries. I've been for date nights and more casual dinners and lunches with friends or co-workers."], ["Queen B.", "It's the better of the two Thai within 5 block radius. The atmosphere is chill and a bit reserved but I ate here wearing my flannel and sneakers. Nbd. The portions are decent but it's about $20 a person. Water tastes horrible even with lime. The food isn't spicy at all so ask for the spice rack. This place is kinda pricey but it's nice."], ["Tyra W.", "Overall 3.25 stars. I found the staff a little awkward. Our first host muttered something and walked away which left us confused. Another hostess came over and wasn't sure where to seat us. The restaurant wasn't packed and there were plenty of open tables so I assumed it would get busy after our 7pm arrival. We were asked twice by each host if we had reservations to which we said no every time. So maybe they prefer reservations? Our server may have been new (who knows), seemed very nervous (almost flustered) I would say. It made our experience a bit awkward since he was stand by our table until we stopped eating to ask us something. Then he would awkwardly stand there after we answered his question. However, our cocktails were on point. He had the drunken monkey (banana infused Jameson) while I had the champagne with a twist. Besides the awkward staff flow, food I would call average and service was slow for the amount of business present in the establishment. I definitely wasn't blown away but did leave satisfied at the end of our visit."], ["Raj T.", "Excellent food excellent service.Jamie our waitress was superb and gave excellent customer service. Keep up the good work Jamie."], ["Rumil B.", "Like I said the last time, I just keep finding new reasons to love this place. I'm pretty sure I know half the wait staff by now, and they have never led me astray with their recommendations. New favorite meal as of late: Thai rolls, Thai tea, khao soi, and matcha cheesecake to top it off. And just in case you weren't sure, if you ask them for Thai spicy it actually means Thai spicy. Trust me."], ["Kaley Z.", "What a great little place tucked away hidden from the Main Street. So glad we found it because the food was really great. I admit I was nervous finding Thai place in the middle of the country but they did not disappoint at all. Food was super delicious and the staff was fantastic. My waitress even had the chef cook my dinner a second time since I made the mistake of ordering my spice level too high; definitely a difference from the east coast. The second dish prepares was delicious especially after my lips and mouth calmed down from tante previous fire. The dessert was awesome...chocolate coconut cake with homemade coconut ice cream with toasted coconut flakes. Would go again and probably will before I leave town."], ["Rebecca F.", "Went to Blue Orchid today and must say I thoroughly enjoyed my experience! The server Mickey was professional and knowledgeable about the menu. Mickey suggested the Thai rolls and they didn't disappoint! I then had the garlic dish with Chicken and enjoyed the sauce and veggies although I will say the chicken was a little rubbery. I can work with that though as the rest of it was suburb! I will definitely be back for the Thai rolls, and next time am looking forward to trying the desserts!"], ["A C.", "Superb service...thanks, Shawn.  A bit cool temp inside during our visit midweek.  Tofu Spring rolls as an appetizer met our hunger but we expected a thinner, wet, lighter wrapping.  The Khoa Soi was divine with tofu, coconut cream, noodles, curry and a smoked chili side sauce; an unusual yet yum entree.  The Drunken Noodles are, apparently, popular but not enough zing or bang for our tastes.  Lots of jalapeños on the menu, rather than red chilies.  The Ginger Flower with vodka, rather than gin, was a welcome, suggested, drink pairing.  The martini was shaken, not stirred; perfect.  All in all, Blue Orchid is a find around \"O\" and 10th."], ["Jenny D.", "I sat and the bar and had great conversations with the bartenders. They make well executed cocktails and provide prompt service.The chicken satay appetizer could serve as a meal and is very delicious. The lamb massaman was fantastic. Highly recommend checking this place out if in Lincoln!"], ["Sharon N.", "This place is great. I got the Khao Soi, which tasted amazing and was the perfect level of spicy for me. It is a little pricy, about $15-$20 per person, but not anything unreasonable. Overall I was impressed and from now on I'll be coming here whenever I'm craving Thai food!"], ["Kimberly M.", "One of the best Thai restaurants I've been to in the Midwest. Every curry is delicious but make sure to request if you'd like a spicer version. Drinks are incredible, especially the lemongrass and Thai chili martini as well as the Ginger mojito. Save room for the creme brûlée!"], ["Aimee K.", "Dear Blue Orchid,Thank you for changing your tune! Seriously, my last visit was so much better. I had a great Thai soup, and the yellow curry was out of this world good. Service was much better and it looks like they've made some positive changes. So glad my experience here was better this time around!"], ["Win K.", "They made their signature dish: Orchid Chicken with tofu (instead of chicken) for me! The presentation of the food in a pineapple shell was fabulous! Perfect fine dining place! And dessert was amazing too!"], ["Carl F.", "Heard good reviews, BUT not even close to being good with what I experienced. I totally agree with previous comments about staff being awkward.Started with Tom Yum and added shrimp ($2 up charge), mostly clear w/ 2.5 slices of mushrooms, 2 small chunks of tomato, some cilantro and 2 small shrimp (which were still cold). When waiter saw I hadn't finished the soup he asked was the soup ok, I said no, it was not to my liking... Yet full charge on bill. For the main course I ordered the Pad Thai w/ scallops, came w/ 5 decent sized scallops but noodles weren't cooked well and the dishes flavor was weird. But I ate most of it. Recommendation: go elsewhere!"], ["M M.", "Love their lunch special. Have had a major craving for their drunken noodles lately. Decent staff and pricing. Heads up...their Thai rolls are the crunchy ones, not the spring rolls. I was mildly disappointed the first time I order spring rolls when I was actually (apparently) wanting the spring rolls."], ["Edward L.", "I had lunch here right before I had to catch a flight to go home during a business trip. As soon as I walked in, I told the server that I was in a hurry and he did not disappoint me once. The service was fast and he was friendly the whole time. The food was so delicious. I am a asian man so for me to say that I was impressed by asian food is the highest form of praise. The location of Blue Orchid is in the heart of Lincoln and it's close to the airport. I got Thai food here that makes Thai food in Georgia just seem cruddy. If you are in the area and you crave Thai music, make sure you stop by here!"], ["Abigael N.", "Their food is simply delicious. The Pad See Ew is some of the best i've ever had! The Tom Kha was also superb! A perfect amount of seasoning including just the right amount of acidity. Price was adequate, not too high for such a nice restaurant. Would come again!"], ["Jon M.", "Stopped by for lunch. It is hard to see the restaurant from the road but we managed to eventually find it. We went during lunch and it was not crowded at all. Te service was great and the good was excellent. We were a party of 6 and everyone lived their meals. I had the drunken noodles and they were delicious."], ["Christopher M.", "Great Thai. All 3 entrees were delicious. A gem in Nebraska! I have a friend that went to Thailand for 7 weeks and I think he would like this place!"], ["Mike S.", "I go to BO at least 3 times a month. Sometimes for dinner, but mostly for a great Saturday hangover lunch. The pick, Panang Curry w/ Tofu add veggies. It only costs $1 more and is worth every penny. The dinner portions are big, but I like the stable price of the lunch option and I always get the Thai rolls. The plum sauce is most likely store bought and it makes the appetizer so awesome. My wife loves the Tom Yum instead of the rolls, but I like to share. I had originally tried to go thru the menu and get something new each time. Since I hit the Panang Curry I feel there is no need to try something new. Spicy with a hint of sweet. Add a little red chili w/ garlic paste and it is phenomenal. Wash it down with a glass of Chang and you are good to go.If you have the chance try the Mango and Sticky Rice, which is seasonal, it completes the experience. Definitely the best Thai food in town, possibly the region. The staff knowledgeable, courteous, and polite."], ["Shimmy G.", "It's been 2 years now. Go ahead and disregard my previous reviews. I Iove the food and service at Blue Orchid. The food is nothing like Lincoln, NE but the friendly service certainly is."], ["Joel H.", "We love this place. The food is great, and the interior of the place is very nice. It's in a weird location in ally. It is easy to get to though. The last time we went they took a while to fill our water, but the food was excellent as always."], ["Steve S.", "Been to the Blue Orchid several times, for both lunch and for dinner, but never by choice. It's always someone else's suggestion. I dunno. People I like and respect talk about this place as if Wolfgang Puck and Tom Colicchio had a super-baby that creates magical Tom Yum Gai, spring rolls and Yellow Curry. Really, I think it has a lot to do with the fact that when it came onto the local dining scene, it was simply the first-to-market in its particular restaurant niche in Lincoln. It gave self-proclaimed sophisticates a new place to see and be seen, and to talk about when they weren't there. In the first few years it definitely leveraged that word-of-mouth, building a loyal customer base that established it as the only place to get omigod omigod omigod Thai in the whole wide world.But I've never been there when something just hasn't been a little out of whack. And it leaves me, unfortunately, with a view of the place as disjointed and mediocre. Above all, the acoustics in the place are just plain bad -- it's like trying to have a dinner conversation in a school gymnasium. Other times, the wait service has been inconsistent, even a tinge of distracted and slightly dismissive. During our most recent visit -- a Tuesday night, in which I said I was giving the Blue Orchid one last chance for redemption -- we waited an hour and 15 minutes after ordering our entrees. The food is not worth that kind of wait. It's certainly not rave worthy, especially for the price. I'm always perplexed by the panting reviews of how it's the best Thai food ever on the planet, or maybe even the galaxy or the entire universe including Heaven Above. It's ... fine. Not ungood. Just not all that great. I often get the ginger and garlic stir fry with chicken; it's a serviceable dish but this too has morphed over the years to be more pepper-and-onion-heavy (yes, I know it's stir fry) with less and less chicken. I was still hungry following our last visit.It's weird. The Blue Orchid has assumed this almost legendary spot in the local dining pantheon. So it clearly must do something right -- or, it could be that there's no legitimate challenger to its particular niche in the local dining scene yet. Me, I've yet to have a visit to this restaurant since its inception that hasn't been underwhelming or frustrating or, let's face it, both.A final note: I don't know what's going on with the southwest corner, near the front of the restaurant, but during a visit in May 2013 it looked like someone pulled a string out of dry paint there, leaving a horizontal line of exposed wall and chipped paint all around one of the seating areas. If it's an intentional design element, it fails, unless it's trying to give off the vibe of \"We're Upscale But Not Afraid to Look a Little Decrepit.\""], ["Christina B.", "I got the chicken pineapple stir fry. Not too impressed with the quality. Chicken is very dry and sparse. Sauce is very good however, love the veggies seems fresh. Price definitely does not match the quality. All I'm all not the greatest experience and will most likely not be returning."], ["Rose L.", "I had the drunken noodles. It was good and semi spicy without them asking how spicy I wanted it. This place seems more pan Asian than Thai. The staff were friendly and the service was fast. I'd go back again."], ["Pat Y.", "Pretty good Thai restaurant but need better serviceEnvironment: Nice environment, I like their high ceiling.Food:Good food.  I ordered a Tom Yum soup, green salad, Orchid Chicken and Thai ice tea.  The task is good but small portion.  I like the Orchid Chicken especially the way the put the whole disk in the pineapple.Service:When I walk in restaurant, there were two waiters by the door, but no one care the greet me.  When the greeter came, she greeted me and led me to the table.  Then waiter of that table came (not the two I meet at the door).  She is very pleasant and professional. I assume the other two waiters who I meet earlier will do the same when they server the customer who was assigned to their tables.It is standard price for big cities like Los Angeles or New York, but may be fairly high for other places like Lincoln.I gave it three stars because of the services. Not the wait they served me but the other waits that I met.  They should at least give the customer a smile or little greeting when the customer went into their place if they are standing next to them even though the customers may not be assigned to their tables."], ["Sara O.", "Great Pad Thai! 5 Stars, so good and yummy.  I ate the whole thing. Had nice big pieces of tofu and meat! The Panko Chicken 3.5 starsMint Julep - 3 stars- too sugary and sweet for my tastes.Service- 4 starsThis is a surprisingly good Thai restaurant! I would def make a visit here again if I am ever in Lincoln.  On par with thai that I have had in NYC, DC, Boston, and Baltimore. I still crave the pad thai from here even after leaving Lincoln a week ago."], ["Steve F.", "The Panang Curry, with vegetables & salmon was wonderful. Superb curry, very flavorful & delightful coconut base! The Drunken Noodles were recommended to us by a resident of the building the restaurant was located in and they were fantastic. Rich & complex flavor with just the right heat to really kick it up a notch. We ate here 2 out of 3 nights that we were in Lincoln!"], ["Peter S.", "Good."], ["Lacey M.", "Holy delicious. To vegetarian friends who need a suggestion: Drunken noodles. I skip tofu and go with all veggies, but you can get tofu if you like. I get it extra spicy with some extra spiciness on the side.Also the mini spring rolls on the side...spicy, of course. with the sweet sauce. AND a ginger mojito. You won't find a more delicious and lovingly prepared beverage."], ["Jake Z.", "The food was super tasty and the service was good. Me and my wife really love curries but sometimes are afraid to get them at new places. However I am so glad we did here. The red was super flavorful and had quite the kick to it. I went with the khao soi to change up from the traditional yellow curry with rice and it was fantastic. I highly recommend."], ["Sudhansh C.", "If your an Asian and like spicy recipes then you have to try this.The red curry and Thai basil fried rice are awesomely good"], ["Eve W.", "Had the spring rolls and the silver noodle salad.  Horrible. Returned it all.  Usually love Thai food, but the ingredients were not balanced, the noodle salad was drenched in fish sauce and vinegar. Waitress was very nice."], ["Chancy B.", "The food was edible, but not exactly up to par. The service was nice but poor. The menu was to simple, no beverage listed no desserts listed. Not some place I would visit again. Not by choice that is."], ["Dani W.", "Came here with 10a group of eight for dinner on the Thursday after Christmas.  First off, yes, it was busy.  And it seemed they were understaffed, but our service was sub par.  I'd say at least 10-15 minutes between ordering drinks, and then again after ordering apps, and then again before getting apps, and then again before ordering meals, and so on....Honestly the reason its a 3 and not a 4.We got appetizers of: prawns cake, thai rolls, spring rolls, papya salad, chicken satay.  Two of everything except the cakes.  We did not get the cakes until after our meals arrived and then we got two orders of the cakes even though we only wanted one.  Plus they were so late coming out and not even an apology!Some of the meals we got at the table: drunken noodles, crying tiger, blue crab fried rice.  The crying tiger is very good!  I had the noodles and very good portion size and they were tasty.  I'd probably try something else but I'd have them again.I'm not sure we were even offered dessert, but at that point we were so tired of just sitting that we wouldn't have gotten it anyway.Would I come back?  Sure, but I would hope the service is better."], ["Angie P.", "This restaurant is sadly just about the best Lincoln, Nebraska has to offer! Beautiful ambiance but amazingly mediocre food. The \"spring roll\" is not quite that. Has all of the right ingredients but reconstituted in the wrong order. The pad thai had stale peanuts and NO flavor, but the drunken noodles were acceptable and spicy. If you order the scallops, be prepared to order something else to eat as well!The reviewer that said this is on par with major city Thai is smoking Ka Prow leaf!"], ["Kenny N.", "My one visit to Lincoln and this is where I'm taken. Excellent choice! They have a great lunch menu, offering two courses for $9.95. I ordered spring rolls and pad thai. The spring rolls came with a tasty sticky brown sauce. Be wary of those spicy jalapeno slices, though.The pad thai was also quite good. It was served with a healthy pile of crushed peanuts and lime slice. The sauce dominates the flavor profile, but it was less peanut flavor dominant which I appreciated. I definitely recommend this restaurant for visitors, especially for lunch."], ["Michael G.", "Excellent Pad Thai and Thai Basil. Friendly and attentive staff even during the lunch rush. Also great for takeout."], ["Stefanie N.", "Been here twice, first time was for dinner a while ago but I remembered it being pretty good. Second time went for lunch and I can say that while it wasn't stellar, it wasn't bad.  Had the mussels as an appetizer and it was only ok.  The dipping sauce that comes with it is supposed to be some sort of lemongrass garlic but honestly, all I can taste is a ton ton of fish sauce with a bit of lime.  Definitely too overpowering for the mussels.  The tom yum broth was a lot more clear then anywhere I've ever had it but doesn't lack in taste.  Definitely a great soup.  Had the chicken Pad Thai and maybe I caught them on a bad day?  Seemed like it was tossed in the wok for a minute too long, the color was extremely dark.  I remember the first time I had the Pad Thai here, it was good.  The service is good and so is the decor.  I would come here again."], ["Alexi A.", "Yelp wins again. When the other place my in-laws suggested was closed I hopped on yelp and Blue Orchid popped up. A solid experience was had.Food-4 Stars. Nothing overwhelmingly awesome but solid Thai food. Drunken noodle I had I requested as hot as they would make it and it was appropriately spicy. Noodles were done well as were the veggies and the beef. Also had a thai spring roll for an appetizer, which was good although a little small.Service-5 Stars. Excellently helpful and patient waiter. My in-laws can be a little challenging and he was flawless. He was also friendly, timely, and explanatory.Drinks-4 Stars. Good thai iced teas and iced coffees.Value-5 Stars. Great deal for lunch at I think $9.25 for an appetizer and an entree (although very lunch sized).Atmosphere-5 Stars. Very nicely done inside, I was impressed."], ["Ingrid H.", "This place is just okay. There aren't many options for Thai food in Lincoln, so it's good for that reason. However, the food is a bit bland / not spicy at all. The lunch deal is pretty reasonable ($10 for an entree and a side), but it does seem a bit overpriced if you go there for dinner. It also seems to get really busy on weekends, and the service suffers as a result. Go there if you're in the mood for Thai, but don't expect to be blown away."], ["Purple Lotus M.", "Pros: -Good food-Very Attractive Ambiance -Good location-Great service-Authentic Thai-Vegan & Gluten Free friendly-Best Thai of NebraskaCons:-Parking is not that great-Lots of customers (as its popular)Bottom line:The best Thai in Nebraska says it all. Go there. Especially if you have special dietary needs. They are the best."], ["Colin S.", "Hip modern atmosphere and great Thai. The food is extremely flavorful and the service has always been amazing. This is the perfect place for a business lunch."], ["Randolph M.", "Not crazy about Lincoln - its pretty ugly and rundown and full of Nebraskans - however I enjoyed my meal here. It wasn't particularly expensive and was way more upscale in atmosphere than Nebraska deserves. The food was better than anything else I've had in the state, but really, thats not saying much."], ["Melany L.", "JUST THE FOOD: The food is mediocre Thai food. If you have had really good Thai food in your life this restaurant will disappoint you. If you are stuck living here for a while well this is the best you will get. I've been here twice, had a shot at the pad thai, the drunken noodles, spring roll appetizers and summer roll appetizers, and of course THAI TEA!. The main dishes were a good sized portion, a little bit on the bland side but not bad by any means, It just wasn't great. The appetizers are teeny tiny. I mean microscopic, \"LIKE THE SIZE OF MY THUMB\", and I have tiny fingers!!! The thai tea didn't disappoint, but does it ever?As far as ambiance goes, this place is very cute and chic looking. There is a beautiful walkway and fountain leading up to the entrance, inside is very modern and organic looking with blues and greens throughout the place."], ["Adrian B.", "The only place in Lincoln to consume quality Thai food.  The building is very impressive as it's the converted original court house for the city.  The lovely big high ceilings and spacious seating gives the place a true feeling of relaxation and civility.  The menu is beginner friendly with their version of Sweet and Sour Chicken (Orchid Chicken), the soups are great too.  The only grip I have about the place is the service which has been slow to disastrous since day one.  I guess you can claim them as consistent in that way...  There's a server gentleman with long dreadlocks who looks lost and has worked their for years.  Do not go for lunch from the office if you only have an hour as it will exceed your time limit.  Improve the service and it's 5 stars!"], ["Dave V.", "Food was excellent. The spring rolls were awesome, drunken noodles were out of this world. Wife had the pink gimlet cocktail and I had the mojito. Both excellent. This would have been a five star experience if our waiter had been at all attentive.Atmosphere is great and off-street parking is available."], ["Kari T.", "Every time I'm home in Lincoln, I HAVE to stop at Blue Orchid. It is by far my favorite restaurant in Lincoln and has been since it has opened. I would say that lunch during the week is the best deal (you get an appetizer and a lunch portion of a main dish for $9.95), so I always try to go during the weekdays. Weekend evenings get a little busy, so be prepared to potentially wait a little while.The food is delicous, I always order the Tom Kha soup and the yellow curry with chicken as my meal. However, the panang curry is also a favorite. My absolute favorite drink on the menu is the pineapple basil martini, although during the day I love the Thai iced tea!Definitely stop by Blue Orchid, you won't regret it!"], ["Bob B.", "Went based on the reviews here, since there were many more good than bad. After eating I was wondering about the people who complained about the portion sizes, they seemed quite ample.Had the Chicken Satay appetizer and for those who complained about small sizes on the appetizers, they didn't try that one. 5 good size marinated and grilled tenderloins with a good dipping sauce. The cucumber and onion salad was good, with a little kick thanks to the chili oil and jalapeno pepper.The waiter told me the red curry was a 7 on the 1-10 scale for heat. I beg to differ, closer to a 4. However I tend to like hot, so that may be why.  The flavor was great, enough heat you knew you were eating curry, but plenty of sweet at the front end from the coconut milk. I would definitely stop back in. The only reason they got a 3 instead of a 4 was somehow they were out of Thai Iced Tea at 5:30. On the upside, the Thai Iced Coffee might be my new favorite drink. The bitter from the coffee was a great compliment to the sweet coconut milk."], ["Cory O.", "Last night a friend and I had a chance to sneak over to Blue Orchid for a nice lil' dinner, here's my review.The Venue: Located in a tight spot between the old courthouse and some other large building it can be a little tough to spot if you're driving by. Once you enter the restaurant you'll notice it's clean, smells nice, and is pretty cozy and open. My friend mentioned that \"it looks cute\" and I'd say that about sums it up.The Service: When we walked in I was greeted immediately and from that moment on we were well taken care of until leaving. Spot on, prompt, and good service.The Food: My friend and I ended up splitting two orders, Thai basil chicken and (of course) beef pad thai. The dishes were presented well, tasted great, and were what I was expecting.The Cost: It was cheap by all accounts, our bill was about $35.00 and some change (plus tip) for two entree's, a beer, and an appetizer. No sweat there.The Bottom Line: The bottom line is I'd definitely come here again, the menu is a little \"Americanized\" but the food is good, the wait staff is on point, and the atmosphere is nice.P.S. If you park in a lot about a block down the street your first hour is free :)"], ["Teeg S.", "Great stop before the Leid Center!"], ["Daniel T.", "I read some of the reviews on the site. Overall they were excellent. So I ate there. Service was excellent, the saketini was perfect and the panang salmon was exquisite!!! Don't miss this eatery if you are in Lincoln or anywhere near Lincoln!"], ["Supat R.", "The Best Thai and Asian Restaurant ever... Love the foods, drinks, services, place. Strongly recommend :)"], ["David B.", "Love this place.  They have some of the best thai food I've tasted.  Would definitely recommend this as a necessary place to eat when in Lincoln.  Khao Soi is my favorite dish."], ["Mike P.", "What's going on here? The last two great Thai restaurant meals I've had were both in the state of Nebraska. I'm thankful my potentially snobby prejudices have been challenged in this seemingly Asia-distant  area.Since the restaurant is a little more upscale than your smaller, more typical neighborhood Thai place, you might wind up paying a couple bucks more per entree, but the expense is definitely worth it. I'm a big curry fan and the Panang was suggested by the hostess. I was kind of bored of curries at the moment, but glad I took the suggestion. It turned out being perfectly spicy and sweet. The flavors stood out from themselves and had at once a distinct familiar, yet unique taste, avoiding a simple bland coconut and curry paste sameness. The staff were nice though I got my order to go. Highly recommended if you are in the area."], ["Tanner H.", "After dining at this establishment for about the 10th time - I figured it was time to give this place a review. Blue Orchid is consistently heralded as Lincoln's premier Thai restaurant, and for good reason. After my first dining experience went awry (a server recommendation gone terribly wrong and 20 minute wait on beverages that eventually came looking and tasting hastily and lifelessly made) - all other experiences have been pleasant and even quite memorable. Food - Very good, unique, and lively. Drunken noodles with tofu, Asian delight, yellow curry, and pad thai with chicken top my favorites. It seems everyone I dine with there has a different favorite dish - and thus I'm convinced that  it's hard to go wrong with any of there entrees. Their appetizers tend to be very small and not worth the money, but besides that everything seems spot on.Drinks - They usually carry one of my favorite wines (Klinker Brick Zinfandel), but when this is not carried - I normally go with a Sapporo (which I find to be quite refreshing when served on tap). Their ginger mojitos are raved about by many of my peers, but I have never been overwhelmed by them. Their thai ices teas are also very delicious.  Service - Usually very pleasant and attentive. I've had some very pretentious servers as well that tend to work to hard on their \"cool\" factor and less on their \"serving\" factor. During my one unfortunate experience, my food bill was removed from my ticket - though I would have appreciated a apology from the manager. They seem to strive for excellence.Value - For Lincoln, it's fairly high, but still manageable. My date and I usually get out of there for around $60 with drinks and dinner.Atmosphere-The high ceiling doesn't provide the most intimate setting, but still impressive and relaxing. Overall it's a fantastic Lincoln version of Thai food. It is one of my favorite of Lincoln and tends to climb the ladder with every visit."], ["Stephanie P.", "#199 So, after an eventful afternoon, we decided to hop onto Yelp to look for a decent dinner location. We were in the mood for Thai food and Blue Orchid immediately popped. Despite the fact that the entrance is in a sort of random driveway of the Grand Manse, the interior decor of the place was impressive. They were able to maintain the industrial architecture of the ceilings, while also creating a classy ambiance throughout the restaurant. I loved the spillover of their theme 'blue' to the table, with their blue goblets for water and blue plates - super cute. It didn't take too long before we figured out what we wanted since their menu is quite condensed, only showcasing the best options. We ordered 6 entrees (Drunken Noodles, Rad Na, Pad Thai, Khao Soi, Silvernoodle Salad, and the Pacific Medley), as well as both of the soups on the menu (Tom Kha and Tom Yum). The soups came out in record time and I definitely enjoyed the Tom Yum. I'm really into sour soups and they did not hold back on this one. The tofu was actually a bit too bland for such strong flavor and I'm sure it would have gone better with chicken, but I still think it's incredible. As for the entrees, I was only able to sample the Pacific Medley and Rad Na since they were the only vegetarian options. The Pacific Medley, though, was definitely on point and my favorite hands down. The shrimp were plump and juicy, while the scallops were deliciously buttery and melted in my mouth. The calamari were chewy and tender and paired well with the strong, spicy flavor of the sauce. I was also a fan of the gratuitous amounts of basil that were present as it balanced the entire dish by cooling it down. The waitress was great at the beginning, but dropped the ball a bit towards the end of the night. Once the dishes were served, she was a bit aloof in terms of her presence. We clearly saw her rush through certain things, like refilling out water, only to then saunter back over to the bar to chat up the other waitresses - an unappreciated sight. So, a star was knocked. Overall, great experience, great Thai food, love the architecture and ambiance."], ["Laura P.", "This is one of those places where once you find one thing you like on the menu you'll keep coming back for it. I really like the ambience of this restaurant; it works for a semi-casual dinner date or business lunch. The service is generally friendly and helpful but when it's very busy service can be quite slow. Heed the spice warnings on the menu. I've never had a bad cocktail here. The soups are great but the rest of the starters are a disappointment. All the vegetarian entrees are outstanding."], ["Ali L.", "The trendy Thai Fusion place of Lincoln. However, the Panang Curry with Salmon is phenomenal. Some items are hit or miss, but this was always my favorite thing on the menu. Spring rolls are decent if I remember correctly. Go for $10 lunch unless you want to spend around $16-20 per person for dinner."], ["Jennifer B.", "Enjoyed my trip to Blue Orchid thoroughly.  Our waiter was knowledgeable and helpful.  Service was prompt.  The lettuce wraps were a punchy way to start off dinner, and I found the butter-cream chicken delightful.  You don't have to like Thai food particularly to find something on the menu you'll be happy with.  Don't miss the jackfruit-infused vodka!"], ["R. Jonathon J.", "The staff was very friendly and accommodating; especially, considering I walked in at the last minute. The food looked great and tasted even better.the decor was nice. I got lost trying to find it due to the alley entrance but it was worth the walk."], ["Jules T.", "The food is pretty good.Really slow service.Over priced for the small portions.Lunch is the best deal.Great bathrooms.Not great for kids."], ["Charles G.", "I've eaten at Blue Orchid a couple of times since my first experience, and though I still adore some of what's on their menu, I have to knock the place a star for a few reasons:1.  I was quite drunk the first time I ate there.  (Not their responsibility, of course, but it colored my judgment.)2. Many of the items on the menu are simply too sweet for my taste.  I don't recall this problem on my first visit, but considering \"1\" above, well... 3.  The service is spotty.  Sometimes they're on the ball, but oftentimes not.  On my most recent visit (with a party of 8 for lunch), the food was poorly timed, and to add to that we had to ask for additional flatware, rice, etc."], ["Tam-Anh N.", "One of my top favorite restaurants in Lincoln. I've eaten at a lot of Thai places and it doesn't get much better than this, especially in the midwest. I'm very impressed with the food here. The pad thai and the yellow curry are... amazing. I switch back and forth between these two entrees all the time. I've been going to blue orchid since it opened and I don't see myself stopping anytime soon. The food here is always amazing while the service fluctuates, but I think it's worth it for such lovely food at cheap prices. Just writing this review makes me want a huge plate of pad thai... with a side of yellow curry. :D I constantly recommend this place mostly due to the food, but the restaurant itself is very nice. It's a good-sized place with tasteful decor, outside seating, downtown location, and a full bar. You can't go wrong here. The only downside: parking is a pain."], ["Robin S.", "I went a couple of months ago, so this review is from memory.  Excuse the hazy details.I had the lunch special with Tom Ka Gai (chicken and mushroom soup with coconut milk) and green curry.  My friend and I split an order of egg rolls.  The egg rolls are ridiculously overpriced - four for $4 or $5 (hazy memory).  $1 each wouldn't have been bad but the egg rolls were only about two inches long.The Tom Ka Gai was okay, but the spices didn't taste authentic.  It kind of baffled me, I couldn't figure out what was missing, but something was definitely off.  Then came the absolutely bizarre green curry.  It was spicy as I'd asked, but carried the overwhelming taste of jalapenos.  The curry also contained a lot of cabbage ... it just wasn't traditional Thai food and I can't bring myself to go back again, no matter how much I need Thai food."], ["Wyn R.", "I really don't know why people love this place.  I think it's very mediocre.  Small portions.  Way overpriced.  Snotty wait staff every single time I've been.  Basically, I don't go any more."], ["Shaun S.", "Overhyped!  The food was average.  Pad Thai and the pineapple shrimp dish were ok.  The hostess strutted around with her nose in the air. Food is pricey.  I dunno, for me a made from scratch Indian curry is way better."], ["John L.", "Was a little difficult to find and the city brochure was not helpful because it stated the wrong address. Eventually got there and was well worth eat. The food was very good. Never would have thought to get good Thai food in Nebraska."], ["Kate H.", "Not your traditional Thai food, but a great American take on Thai!  I love the thai rolls (small flash fried noodle and chicken stuffed spring rolls) and the perfect trio - a dish with beef, chicken and prok, pineapple, snow peas and peppers in a thick honeyed pepper sauce.  Yum!  The wine list is small and lacks variety, especially by the glass, but they make some really good cocktails to make up for it.  I have only ever been for dinner, and find it to be a great date spot because you can hold a conversation without having to yell over the din.  On a weekend, reservations can be key because they fill up fast but during the week you generally don't have to wait too long."], ["Chaviva G.", "When Blue Orchid opened, I was excited. I had a friend who was -- at the time -- on the wait staff, and he let a bunch of my friends and I know that the food was outstanding, so we got a group together to go. Talk about the worst decision ever! Let me back up. We arrived during the dinner hour, and knowing that the restaurant was fairly good sized, we figured the six or seven of us would have to wait, but no that long. Wrong. We waited more than an hour for a table, and we'd wanted to leave on many ocassions, but our wait-staff friend guaranteed us that although the service was shit, the food was divine. Well, he was right, but we all were weighing whether DELICIOUS food is worth HORRIBLE service. To this day, after several more unfortunate dining experiences at Blue Orchid -- slow service, long waits, but delicious food -- I can say that I haven't had a desire to go back. From the reviews, it doesn't look like things have gotten much better, either. You can go elsewhere for cheaper food, probably not as delicious, but the service would definitely be faster. Support the local business at your own risk!"], ["Becca C.", "I went to Blue Orchid last night with a friend. This was my third trip and I was not disappointed! Our server was VERY knowledgable and friendly. Top notch for sure in that aspect! We had questions about the beer menu and she was very helpful. We started with the mussels. This is the reason for the 4 stars vs. 5 stars. The dipping sauce they came with was fabulous with a kick of spice. But the mussels themselves were a bit fishy and I have had better. As for our meals, but friend had the Drunken Noodles with salmon and she said it was excellent. I had the Pad Thai with shrimp and it also was excellent. I couldn't wait to eat my leftovers for lunch today!! I can't wait to go back!"], ["Joel G.", "I can't believe I forgot to write a review for this place!  I guess it is because I come all the time!  One of the top three restaurants in Lincoln.  My favorite dish is the Rama Garden, followed by Panang Curry.  Great ambience and service.  Upscale, it's not so much traditional Thai cuisine as Thai Nouveau."], ["Rick M.", "Drunk noodles. And Tom kha soup were wonderful. Excellent server. Ordered the heat I wanted (8) and got it. Recommend butter chicken if you prefer not hot."], ["Ryan C.", "Don't understand all the hype. Service is poor, atmosphere is crowded and loud, food is overpriced and the sauces seem to be extremely sweet. On a positive note, the decor is clean and trendy. This is another restaurant I want to like, but each experience is more underwhelming than the last."], ["Kate K.", "I've lived in S.F. And Chicago and have been able to experience many wonderful thai restaurants. This place is the BOMB. Great waitstaff too! I love you, panang curry. Marry me."]]}