{"David's Dumpling & Noodle Bar": [["Brian R.", "As always when I am in Raleigh, I have a meal at Davids noodle bar. The hot and sour soup is some of the best that I have had-I always use the quality of the hot and sour soup as a quality test for the restaurant. The dumplings are fabulous and the rest of the food on the menu is fist rate. You could not go wrong eating a meal here."], ["Roo C.", "Enjoyed a nice lunch here with my family & I appreciated how vegetarian friendly the menu was.As far as the food, the mushroom & edamame dumplings were really good.  My entree was a little reminiscent of a food court dish but the pear & ginger ice cream was amazing! Overall, I left full and happy.  The service was great.  The portion sizes were good and the price was great. So, I'll definitely be back."], ["Kristen R.", "Wow, what a neat little place! I've been wanting to go here for a while now because I love everything noodles & dumplings, and I'm glad I did. I came here with a friend earlier and westarted off with the half-fried dumplings and the shrimp summer rolls. The dumplings were absolutely scrumptious! Perfectly crispy bottom, tender flavorful pork filling, and a refreshing little side of a tangy-sweet coleslaw. Definitely a lil banger. The summer rolls were a bit disappointing since we only got one little shrimp in one of the halves, and peanut sauce it came with was very oily. For my entree I went with a recommendation  from our server from the chef's specialties: Lionshead infilled scallop with Chinese baby broccoli. Wow! So so delicious. Tender, juicy, flavor packed pork balls with a perfectly cooked scallop in the middle + topped with a perfectly balanced sweet/salty sauce. Overall I really enjoyed my experience here. The service was wonderful and the food came out promptly. I'm excited to come back and try more!"], ["Victoria K.", "I recently discovered David's and went there twice. Once for lunch and once for dinner. It is worth mentioning that the menus vary drastically between the two meals. At lunch you can get the Chinese dishes and appetizers but none of the soups and noodle dishes that are available at dinner. That being said, the food here is spectacular. I was able to go with large groups both times and I believe we sampled nearly everything on the menu. The papaya beef salad is out of this world refreshing and full of sweet and sour flavors. The fried dumplings are so good and served with a great sauce. A surprisingly delicious appetizer was the vegetarian dumplings which I definitely recommend. My favorite is the chicken curry with Indian roti. I can't even explain how it's so good but just do yourself a favor and get one for the table. The soft shell crab salad and salt and pepper wings were also good choices. For entrees, the Malaysian curry noodle soup was the winner but the general Mao chicken, pad Thai, moo shoo pork, and pork and dumpling soup were also delicious. To top it all off, there are pictures of David hung throughout the entire restaurant giving you the feeling that he must be this famous chef who is probably off traveling the world or something. Wrong. David can be found seating guests, bringing food, clearing tables, cooking, and saying goodbye as you leave. He really cares about his establishment. Go here!!!"], ["Heather D.", "Great food and great service at a great price! Had the half fried dumplings to start, then pad thai and ginger garlic chicken. I would recommend any of those dishes, and we will definitely be back :)"], ["Jeff F.", "Great food, from a chef who is dedicated to his craft!  I absolutely love everything that I've ever eaten at this restaurant.  The staff is great.  It's impeccably clean.  I recommend it to everyone who wants Asian but not the same old Asian that seems to be served everywhere else."], ["Phil E.", "2 Words:  Excellent Meal.  Great change up if your sick of burgers, fries, and pizza.  I started with the Shrimp Rangoon (amazing).  I also had the Seafood Deluxe.  My friend had the Pad Thai.  See photos.  Mine was good, but the Pad Thai looked better."], ["liza l.", "Delicious every time.  Try the Malaysian  curry soup and mu shu pork.  The owner is a nice guy too. Very hospitable!"], ["Laurie V.", "Sooooo good!Everything!I loved the Hot & Sour Soup. I loved the quick service.I loved all the dumplings and fried delights.  I loved the bahn mi sandwich that happened to be the special the day I was there for lunch with my friend. He bought, but I think lunch was fairly inexpensive.  And we shared a LOT of different things!"], ["Lynne V.", "Service was awesome! Food was great served while it was still hot and wasn't sitting under a heat lamp! I could have just stayed here for hours ordering their appetizers! I loved their half fried dumpling, Vietnamese fried egg roll, and their drink Mao Thai."], ["Adélaïde M.", "Very nice restaurant, tasty food. Expensive but very very good and original. I recommend this place."], ["Kim B.", "I love Asian food but not the type that is fast and greasy.  David's is a quaint little spot perfect for a casual date, a meet up with a few friends or just a squat at the bar to watch the game with a beer. Cool to have in the neighborhood type of joint very common in various neighbors in NY.  Unfortunately service was friendly, but slow and I think our server had a lot of tables so perhaps they were short staffed. We tried several appetizers.  I just loved the half fried dumplings.  I am no dumpling expert but most of the dumplings I have had are sort of doughy, with a pinch of meat.  We usually just dip it in some sauce and gobble them up.  So American.  It's a carb, who cares, no problem have a beer. BUT these dumplings were full of meat.  Yessssssss meat!  And someone took the time to season the meat and bam..great tasting gotta go back and get me some more dumplings.  We also ordered the mushroom edamame dumplings and so...... if you are a vegetarian they are decent.  I was a vegetarian for a couple of years, but this girl loves chicken and fish so I \"could not\" do life without them. However I am a big lover of vegetarian meals from time to time so I think they hit the spot.We also tried the satay chicken and the Vietnamese cool spring rolls.  My son loves chicken satay and he said they were \"whatever\"...huh?  They were dry so you just had to do what???  drown them in the peanut sauce gobble them up, have a beer.  The cool rolls were also dry and I was disappointed because I order these from Pei Wei all the time and even though they are a chain, those cool rolls are what's up!   I would not order these two again.Our entrees were the Malaysian Chicken Curry, the Low Mein with Shrimp and the Pad Thai rice noodles with chicken. The showstopper was the Malaysian Chicken Curry. This dish is not your run of the mill chicken curry dish. All of the spices just pop off and slap your palate to attention.  The dish has just the right amount of kick so it is not overly spicy but just perfect and I promise you I do not care for spicy dishes. I thoroughly enjoyed my entree.  Now you know those other two people who were with me? They kept dipping their forks in my bowl.  And I am like....How many \"let me have a little taste\" does it take before you get the memo; you my friend, have ordered the wrong dang gum entrée, but this right here?  It is MY DISH! My son said he would not run back. He liked the dumplings but he felt the overall experience was \"whatever\"..not special.  Even Jesus couldn't win them all. My husband would go back because they have a TV, and beer and noodles with shrimp.... nuff said!   I will go back and I would recommend to a friend setting the right expectations.  I did not feel it was a five star experience, but it was not a bust at all.  I will order the dumplings no matter what else I am planning to have.  I would love to try another unique entrée but how do you go back and NOT HAVE the Malaysian Chicken Curry????? Well that my friends..is Food for thought."], ["Tricia A.", "Service was on point. Chx pad thai is delicious!!! My boyfriend pho and said it was one of his top favorites. We will definitely be back next time we are craving Thai!"], ["Lauren R.", "I have very mixed feelings about David's.  Maybe I wanted to love it so badly that my high expectations doomed David's from the start.The Good:* The atmosphere and location are awesome.  David's is in a stunning old brick building, and the interior has clean and modern lines--shiny wood, glass and brick.  The restaurant gets a lot of outdoor light during the day.  Really, the atmosphere inside is surprisingly hip.* David himself brought out the order of half-fried dumplings--yay!!!* Lunch prices.  All of the lunch entrees are $8, which is a really good price for the great atmosphere and the plentiful amount of food.  With the noddle dishes, you almost have enough for a second lunch in leftovers, especially if you start with any dumplings.The Bad:* My Singapore noodles were really, really disappointing.  The dish was oily but not very flavorful.  And I've only had Singaporean cuisine once, but it sure did have a ton of flavor!  The rice noodles were tasty, but there was only a bit of veggies (onion, a few things of broccoli and some shredded carrots) and hardly any spice or heat.  I knew it wasn't a spicy dish, but Asian dishes can be nonspicy without being bland (think delicate Cantonese flavors).* The half-fried dumplings were quite good--but also greasy and fell apart easily.  But they were also tasty."], ["Jason W.", "I was told about this place through a customer at work. I decided to hit them up today and I have to say this place is amazing! We are vegetarian/pescatarian and they're menu accommodates almost any quick dish to be just that. The General Maos tofu was ridiculously flavorful and a must try. Please show these guys support. For price, quality, flavor, selection, and service this place is hands down the best. Also, Kim our waitress is on top of her game even with a restaurant full of people. We will definitely be back."], ["Nancy T.", "I was surprised at the level of authenticity of the noodles and soups here...  But I still have to say that this is just an okay place to go for authentic chinese noodles & soups but it will make do when I have a craving.  It may be just my tastebuds but the wontons were not up to par - the taste was a little bland.  But the soup base was so flavorful and the egg noodles and greens were kept simple and to the point.  The spring rolls were great... ambiance was a little more upscale than most noodle places, so I'd recommend for a nice little date night.  Beware of the horrible parking though ...  if you can't find a street parking spot (usually taken over by college students) the little parking lot on the side is usually packed too."], ["Alex P.", "We had an incredible experience. David himself greeted us at the door and seated us. We had a very nice tea more. We had we had an order of the famous dumplings. As well as the potstickers. We also have the cool spring rolls. The service was great. I got with the waiter recommended. Which was thedry dumpling soup. I forget the name. But it was a brothless soup. I think this place is going to be one of our regular spots"], ["Ron W.", "So sad, too bad...   When David's Dumpling & Noodle Bar opened up I was so happy to have a sorta authentic Chinese restaurant ITB.  There were some items that stayed true to what I've learned is Chinese food while others strayed off that path a bit.  Especially given the breadth of what they cover.  Fast forward to the last six months and both visits were a downgrade.  I had a stir-fry lunch where the sauce was a bit gloppy and gooey.  I cook some Chinese every now and then and I never could understand how to make a sauce like this. Just way too sticky and dark, a standard American-Chinese offering that is just blech to me.  My most recent visit brought me out some really over-steamed and brown dumplings.  Really odd, they didn't look anything close to what a pan-fried dumpling and bore no resemblance to David's earlier dumplings.  The roast pork-noodle dish wasn't bad but didn't have any complex flavors to it.  Mostly salt, disappointing.  I bang my head on this one, outside of Cary and Morrisville I haven't found very good Chinese in the area.  I have to guess that to stay in business, these Chinese spots just need to serve what the public wants.  Which is unfortunately, not what I want and appreciate as good Chinese.  I got my fingers crossed that some day, we'll get a decent Chinese restaurant in the hood.  Sad thing is I KNOW David's Dumpling could do it if they really wanted to..."], ["Enda W.", "The best Asian food in Raleigh, full stop. The fact that the ambience, decor and service is top notch as well, only adds to what is already 5 star.It is well priced and I would recommend to others. My wife and I go back regularly. The thought of which is making me hungry..."], ["Charles F.", "We cruised thru town grabbing a Volvo ferrying it back to ColoradoFound the Half fried dumplings excellent, Others were all good but not outstanding. Staff was attentive. Worth a drop in very decent Asian. Noodle dishes were quite good as well"], ["Cody M.", "My absolute go-to restaurant for good Asian food in downtown Raleigh.MUST GET:Indian Roti with Curry SauceMalaysian Curry noodlesYUM!Side note: I normally order food to go, but the interior is nice as well and seems like it would be accommodating for large groups."], ["Renee D.", "The service is stellar and the food is incredibly flavorful. I will be back to try more!"], ["Barbara B.", "Absolutely delicious! Great dumplings and noodles here by David (who is always loitering about the restaurant). I highly recommend David's Original Half-Fried Dumplings for an appetizer. I'm also a big fan of the Grilled Vietnamese Lemongrass Beef Rice Noodle Salad and I've gotten it both times I've been here. The restaurant interior is much swankier than expected from it's location close to NC State and it's artfully decorated with pictures of David as he makes his dumplings. Great service and the first time I ate here, our group was given a free strawberries and cream dessert to boot. Take out is extremely fast as well. Great spot for awesome Asian food - I'll definitely be back."], ["Eric G.", "One of my favorite restaurants to go to.  The chicken pad Thai is amazing!!!  Also their got and sour soup is some of the best I've ever had.  Service is always fast and the prices are very reasonable."], ["Emily G.", "I discovered this noodle bar tucked onto the side of hills borough about a year ago. Every time I go I find a delicious new vegetarian dish, and my meat-eating friends feel the same about their choices. I have not had a bad meal at this restaurant, I would recommend it to anyone who enjoys Asian cuisine."], ["Jill H.", "5 stars because this is the best Chinese food I have had in America. Meals I have experienced (lunch only):Green Papaya Salad with Shrimp - Good portion size, delicious, not as spicy as expected.David's Original Half-Fried Dumplings - Great dumplings. Pork mixture inside.Open Top Pork and Shrimp Sui Mai - Excellent. The mixture inside was good, the flavor was spot on.Crispy Spicy Wontons - Don't let the name fool you. These reminded me of the Sui Mai, just fried and topped with an amazing brown sauce. I get these every.single.time. They are addicting!Moo Shoo Pork with Steamed Buns - Steamed Buns!!! And the pork is the best I have ever had. Pad Thai - Not the best, I would not get this meal again.If there were something I would knock a half star off for, it would be service time. Lunch took an hour and a half and they were not busy, we had a party of 4. Free tea with lunch. Meals come with egg rolls. I would eat here every day if I could."], ["Val T.", "Yummy banh mi sandwiches, friendly wait staff.  I'd return."], ["Alexis P.", "My boyfriend and I love going to David's. We go every so often and always receive great service and great food (4-5 stars) but every time we have been to David's the owner goes around mingles with the guests but skips over us. Even if he is chatting up a group of people two tables down we are always ignored... and I LITERALLY mean always. He even gives out what seems to look like complimentary desserts and we can't even get so much as a \"Hi, how is your dinner?\" We love going to David's but we do not like feeling under-appreciated for out steady business. I don't think we'll be returning to David's in the future unfortunately..."], ["P M.", "My wife and I had a great experience. Service, ambiance, and food was excellent. The wait staff was cordial, and recommended some selections. We started with David's Original Half-Fried Dumplings and Fried Vietnamese Spring Rolls -choice of chicken. Our drinks Highland Seasonal -IPA (crisp and a slightly hoppy, perfect compliment with the ginger) and Fizzy Apple- Hana Fuji Apple Sake with l'Armangia Moscato d'Asti, (sweet to compliment the orange heat.)The dinner started with a complimentary ginger soup shooter, very scrumptious and complex it was a nice surprise. Dumplings were amazing, light and power packed with flavor. We love ginger sauce and it was a hit. The spring rolls were flaky thin and crispy with a touch of sweet. Great compliment with the chicken inside. For dinner we chose Beef with Orange Peel and Pork with Chinese Pickle Turnip and Ginger. We split dinners to get a taste of each. Orange beef had a slow burn heat and sweet with a orange peel finish, a rich flavor all around with fresh steamed vegetables and white rice. A combination of mild heat and sweet was delicious. The pickle turnip was very light and distant mild vinegar, very faint that combo' with the the ginger and vegetables and delicate pork strips in a light brown sauce  and white rice that was the best dish of the night. Drinks complimented both dinners. It made our tastebuds swirl with amazing flavor. We had a great time and the service was swift and efficient, just perfect for a great date night."], ["Tiffany S.", "Everything here is amazing!!! Especially their hot & sour soup...the absolute best in the area. I decided to try their Malaysian chicken curry w/ Indian roti, omg, to die for!! I'm in food heaven . And Tom was super awesome & attentive, even while being super busy! Kudos David for a fabulous food experience!!!"], ["Connie L.", "mmm host was kind of weird. he told me there was an hour wait. then 5 minutes later he was like nevermind and seated us.i had the viet lemongrass salad and it was pretty good. friends had the noodle soups and they liked it!"], ["Emily S.", "This place is solid. I was part of a party of 4 and we all ordered different things (Half Fried Dumplings, Garlic Ginger Chicken, Hunan Beef, Kung-Pao Chicken, Seaweed Salad, and Chinese Vegetable and Dumpling Soup). Everything was tasty, nothing was overly salty, (which I think is a common problem with Chinese food) and we all agreed that the ingredients were very high quality. The Half Fried Dumplings were the highlight. They were delicious. Everything else was good. I'd say the highlight is the quality of the ingredients. I'd happily go again, but it probably won't be somewhere that we add to our regular rotation.I think my husband probably put it best. When we were talking about the meal afterwards he said, \"It was really good and I enjoyed what I had, but I don't know that I'll be craving it later on or missing eating here if we go a long while without coming back.\"Service was decent, our server did a great job of answering our questions, and parking was not an issue, which is great for downtown.No complaints but not blown away."], ["Victoria Y.", "The food here is really good! We stuck to the noodle and dumpling dishes and we found the food to be the perfect portion. All the dishes tasted really clean and healthy. Nothing we tried was too overly greasy or salty and the food had the perfect umami flavor without tasting like it was loaded with MSG. We were seated promptly and the staff were kind. I liked that the food came out quick and our waiter was really cool! He gave great recommendations and answered any questions we had about the dishes. Also, I noticed the owner was walking around cleaning the tables and serving food as well. He came over at the beginning of our dinner and gave us some Carrot and Ginger soup. My only gripe is that the food is a little pricey, but other than that, it was very pleasant and I will definitely be coming back."], ["Tom R.", "Was in town past 2 days and we popped in for dinner was pleasantly   surprised !Dinner was great servers were great and super reasonable We had the moo shoo pork and the cashew chicken .. Was really good .."], ["Colleen L.", "This is the place that my fiancee and I consider our \"default date night restaurant.\"There's plenty of parking, and the place is rarely packed. It's pretty quiet and we've even had success hosting large parties (of 20+) here."], ["L J.", "I'm from NY, so I'm on a big hunt for Asian food that will stand up to the highly competitive and tasteful food found in the city.  As far as Asian food in Raleigh, this wasn't bad.  We shared the roast pork ramen and the moo shoo with buns. It was a bit greasy but flavorful.  We would come back but probably not for a while as it didn't strike me as awesome.  The search continues..."], ["AJ W.", "Went into David's tonight in a party of two. Wasn't too busy. Service was ok but friendly so nothing too special there. The food was good. Unfortunately I was very disappointed with the half fried dumplings. They lacked crispiness on the exterior but the flavor was good. Also, they no longer make house made noodles which was disappointing. I got the curry noodle soup and it was what you would expect, nothing too special. The good surprise was the moo shu pork which I would highly recommend. The seasoning was traditional and tasty while it was served with the soft white Chinese buns. They only give you 3 buns though, so expect to shell out another 2.50 for some more buns. I'd go back, but only for the moo shu pork."], ["Bradley B.", "Dinner, desert, atmosphere and friendly staff all fives, even the locals that we're having dinner were awesome!"], ["Kristy A.", "I love this place.   The food is consistently good, the exposed brick decor is inviting and casual, and the pricing is really reasonable.   Today's experience was lunch.   Plenty of options there and the meals are all inclusive at lunch - you get the entree, some rice, a little eggroll, and the beverage.   For $7.95.  Seriously.  I ordered the General Mao's Chicken this time (the Cashew Chicken is my favorite though).  The portion is nicely sized for lunch.  It looks a tad small, but I was satisfied when I was done and without the overly full feeling that usually accompanies a trip Asian food for me.  If they'd served me twice as much, I would have ate it and then been miserable, so I appreciate the portion control.  Perfect for a day when I needed to go back to work and not be in a food coma.  My tab came to a little over $8 with tax.     Four stars instead of five because of the parking situation.   It's Hillsborough Street, so you never know what you are going to get there.  They do have a small lot and there is some street parking, but they are full more often than not."], ["David M.", "The food here is absolutely delicious and well worth a visit. The atmosphere is very nice and there is easy parking to make it even better. It was a bit unfortunate, however, that I happened to have gone on a day when the whole staff had been tied up in the back while a gang of rogues pretended to be them as a diversion to a grand heist! We took our time coming to this conclusion, but have found it to be the only explanation for the slowness we experience.Having worked in a restaurant in the past, I can completely sympathize with the fake staff as I'm sure it was like the first day of work for all of them. Plus, the experienced mentors were bound and gagged in the back!For our order it took about 40 minutes before they decided to ungag one of the cooks and get them to teach them how to make General Mao's chicken - luckily one of the cooks broke. The fake waitstaff had it easier than the fake kitchen staff, they got a good number of things correct and were quite attentive! Well done you!The biggest let-down for us was that the police finally came to stop the heist before we had a chance to get dessert. Still, I am really looking forward to trying the fake kitchen staff's Kung Pao chicken in 10 to 20 years."]], "Dalat Oriental Restaurant": [], "Shanghai Express": [], "Fu Kee Express": [["Ken C.", "Customer service is one of the main things that separate restaurants. And let me tell you, this place blew me away. One guy ran everything, but still took time out to converse. He even offered me a free drink while I waited for my food. Wow. It also helps when the food matches the service. He uses white meat, unfortunately rare for Chinese restaurants. Great first experience, which means future visits to come."], ["Brittanie H.", "Came here on my lunch break today. I have driven past Fu Kee in the past but never stopped to dine. A Yelp search led me here. En route to Fu Kee, I attempted to call several times to place a pick up order.  My calls went unanswered. Upon further inspection of the reviews I saw that it was a one-man show. I knew then I would just have to wait until I arrived to place my order. This was a bit of a downer as my round-trip commute to the restaurant would cut my lunch break in half but I decided to suck it up and sojourn on. Upon arrival, I noticed the place was mostly empty with the exception of another client placing his order. Kind of disappointing being that my calls went unanswered but I did see that the gentleman was alone. So kept a positive outlook. The client in front of me tried to give the owner business advice about hiring another worker of which he was not accepting. \"Too expensive!\" he barked repeatedly before gruffly taking my order:  broccoli and brown sauce with white rice. My total was $7.55 for the lunch special which didn't include anything other than what I ordered :0(. A bit steep when compared to the other lunch specials in the area. After 10 minutes, the order was complete and I headed back to the office. Upon arrival, I found the generously portioned lunch box. I thought, \"Well maybe it was worth it!\" I took the first bite and  was let down by the flavor. The sauce lacked seasoning as did the broccoli despite its crunchy, freshness. Overall, thought it was an upset.  I certainly wouldn't venture to the area solely for Fu Kee in the future. Ah well..."], ["Jon B.", "Very good and freshly made Chinese take out. I've gotten the General Tso's for lunch a few times. It is a decent sized portion and just the right amount of spice (not too hot, but still let's you know it is there).The owner is very nice and does all the cooking himself. That is probably the main drawback, though, since he is a one man show. If he's cooking don't expect to get your order taken until he's done. It is worth the wait, but if you're short on time have a Plan B ready in case there are some others ahead of you."], ["Nina Q.", "I love Fu Kee's.  As many of the other reviews have noted, Fu Kee's is only operated by one guy.  And for one guy, he's pretty dang efficient.  He's got huge portions and he never skimps on the meat, or the sauce.  The food is always delicious with plenty of seasoning.  My favorite is the Crab Rangoon and his Orange Chicken.  The dinner portions are huge, with the meat filling up an entire takeout container.  The Rangoons are huge with ample stuffing that is the perfect consistency.  I've heard he adds honey to the mixture to keep it so perfect, but hands down it is the best Crab Rangoon I've ever had.  The orange chicken is SO GOOD.  Big pieces of white meat that aren't 75% breading.  There'll even be a few orange slices in there for extra orange-y flavor.  Just these two dishes are enough to feed 3 people.I've seen some complaints on here about how long the wait is, and I've seen customers walk out in a huff due to standing at the counter without anyone greeting them in the restaurant.  He's a one-man operation!  Ordering ahead of time for takeout at Fu Kee's is absolutely necessary.  The wait times he gives are usually around 20-30 minutes, which is actually quite reasonable, especially for food this delicious.  I've had a few other entrees, including the Mongolian Beef, Pork Fried Rice, and the Chicken with Garlic Sauce.  All are certainly tasty, but not quite good enough to rave about like the Orange Chicken and Crab Rangoons.  All in all, Fu Kee's is a very solid choice for Chinese takeout in the area.  I live all the way in NW Raleigh, and I can't stop myself from venturing here at least once a month."], ["Petey M.", "This place is awesome.... great food and stellar service. It's a one man show so try to hit it on off hours or be prepared to wait. It is well worth any wait though."], ["Meaghan G.", "Best Chinese food in the Triangle Area!!! And this is coming from a Boston/New York transplant who swore that no Chinese food would ever compare.While I am still very loyal to my choices back home, Fu Kee has become my top choice for NC.  Sesame chicken is all white meat and the crab ragoon is made fresh each day, which is totally above and beyond any competitors.  A true fan can totally tell the difference. No amateur food here.   The owner is incredibly and efficient and knows his stuff! The egg rolls are the only thing I pass on, but that's most Chinese places except Tsang's in Norton, MA and Quincy, MA, so I'm not about to hold that against this place.  Transplants, come here! You won't be disappointed."], ["Santana D.", "This really is a one man show she deserves a break when ever he wants one.  That being said do not go here starving however the food it totally worth the wait it's hot, fresh. And delicious."], ["Mike D.", "Holy Smokes.....Let's cut the poor Dude some slack. A common thread throughout most of the reviews for Fu Kee is the fact that Mike the Owner is a one man show. Most of us say how good he is, not how fast he is. Unfortunately at lunch today I saw Mike and a Customer get into a heated \"discussion\". To enjoy some great Chinese/American cooking please remember to allow for the time factor."], ["Lori R.", "This is not fast food!  This is one dude who knows his stuff and takes his time to carefully prepare some pretty darn good Chinese food.  First time I tried it, I ordered three different meals take-out and got more like six out of them.  Most recent experience was on a Friday night.  Almost keeling over at the gym, I headed over to bring home sustenance.  There was one table of two eating, and one other couple waiting for food.  I watched him cooking for awhile before he came to take my order.  As I handed him my credit card he informed me it would be 20 minutes.  Yikes!  Oh well, I was committed at this point.Sure enough it took about 18 minutes and I was handed a bag full of General Tso Chicken and Hunan Scallops, and a container packed with enough rice to feed an army.  Both were good, but neither was spicy.  Easy to remedy though.  And again, a good four meals-worth.I would say order ahead, but I never saw him answer the phone (which rang constantly).  So if you get a craving for Chinese in North Raleigh and are okay with waiting for good quality, this is your place. Now, I have to say...am I the only one that thinks the name is, well, a little odd?  I even googled it to see what it might mean because surely it couldn't be pronounced a certain way?  Couldn't come up with an answer though."], ["Joe B.", "A One Man Show!Owner/Cook/Cashier/Everything-In-Between was super friendly & the Food was excellent. Read the reviews on Yelp & decided to make the trek to Capital Blvd. I am about 1 hour & 30 minutes away from home (Will Travel 4 Food!) but \"The General Tao's Chicken\" (Not A Typo) was well worth the drive. Even the owner said \"You Drive This Far For Chinese?\" Was glad to have experienced Fu Kee Express and will gladly visit again if I'm the area. Lucky for ME I have \"Kin-Folk\" around the area!"], ["Ashley T.", "Every time I come here I am always reminded why I need to come here more often. Such great flavor and they are happy to make modifications to dishes as needed which is also great!"], ["Steffenie L.", "First time ordering Chinese food since we moved here so we turned to yelp. We ordered 5 mins before closing but he stayed open long enough for us to get there to pick it up. We ordered the crab Rangoons, sesame chicken, and general tao's chicken. Everything was very delicious and plentiful. We probably could have ordered only one dish and been fine. Will definitely be back. The employee/owner? was super friendly."], ["Susan F.", "Since moving to NC, we really miss northeast style Chinese takeout. We find Chinese takeout in NC to be very bland. So when I read the Fu Kee Express was offering the closest northeast style dishes in the Triangle, I had to try it. Mike, the super friendly owner/chef, is from NJ. He immediately asked me about my 603 area code and said that a high percentage of his customers have MA, NY and NH area codes.  I tried the lunch special General Tso's chicken ($6.25) which comes with fried rice. I was skeptical about the rice, it was yellow and resembled Spanish rice more than what I was use to- the fried rice with dark soy sauce- but it was full of flavor.  The General Tso's is made with chunks of white meat, not dark and was also full of rich flavor.As for whether it is true to northeast style, we'll have to try more dishes. Other reviewers mentioned that Mike is a one man show, and it appears he is. My order was ready on time, but I could see it being a challenge at times. Also, the plaza Fu Kee Express is located in (across from Belk at Triangle Town Center) is getting a facelift and it may draw more traffic."], ["Angela J.", "This place is awesome!!! It is a one-man show and he knows exactly what he is doing. There is a little wait but well worth it!! He even gave my daughter a free drink for the wait. I had the beef and broccoli and the portion size was huge. Will definitely return again."], ["Oliver M.", "Typically I order General Tso's Chicken, Sesame Chicken, or General Tao's Chicken--all of which are breaded. The dilemma is that so many Chinese places use SO much batter so your pieces of 'chicken' are really like 70% dough and you feel cheated. I was delighted to see that Fu Kee Express does NOT do this. The breading is so light it's perfect, you get big MEATY chunks of chicken. It is so delicious. HIGHLY recommend. I've never had better Chinese food. Note: It seems Fu Kee is a one man operation--absolute props to him for choosing to serve high quality food. He said the chicken is fresh everyday--after eating it I 100% believe it, his Chinese food doesn't even compare to others. Fu Kee is in a class of its' own."], ["Laura G.", "I had the General Tso's and it was delicious. I thought the wait to cook it was a bit long, but it's not like at the mall where the food is already cooked behind glass. This is the real deal food, he cooks it for you. I will certainly return as this restaurant is really close to me and very reasonably priced."], ["Eric S.", "I told the dude at the counter I would review this place on yelp. And because I'm a man of my word, here I am. I kept it simple. Ordered the general tsos chicken. The food was ready on time and was damn good. I got lost on the way there and it was still piping hot when I got it. Heyyyy...job well done.Personable service and the best Chinese food I've had since I moved to North Carolina. Good work, man. We will be back. :)"], ["Joe W.", "I have to admit that I stopped in this place mostly because of the name.   However after ordering the Kung Pao chicken I have to say this place is FU KEE great. (Someone had to go there)  The place is one of the cleanest Chinese take out places I have been to and the food was excellent.   I'll definitely be back."], ["Larry G.", "After reading the reviews and hitting up every major Chinese takeout/restaurant in the triangle, I have to say that the one man shop Fu Kee Express is the winner!  A quick rundown on some of the competitors that may get their own yelp review in the near future:C&T Wok: First time we ate there was great and we thought we had found a winner, but the quality dropped significantly the second time.  As my boy Hulk Hogan would say, \"consistency brother!\"Banana Leaf: Very good main dishes but the appetizers like the crab rangoon, eggrolls and spring rolls tasted like they were the Trader Joe's brand.Beansprout: Good not great.And there were a few other competitors that lagged, at least another 3-4 that we ate at before we came to the realization that NY/NJ quality Chinese food may not exist in the triangle.And then I read the yelp review of the day from Mike D.  I think I ordered takeout from Fu Kee that day.  I bookmarked it for sure but I didn't want to let this moment pass me by.  I braced for disappointment but was cautiously optimistic.  Potentially finding our new takeout spot was as important as finding out that Arianna Grande's name was inspired by Princess Orianna from Felix the Cat.  I'll let the score speak for itself, the crab rangoon is a big step up from banana leaf but the sole weakness I have found are the eggrolls which I don't really care about but my grumpy wife does.  Spare ribs, general tso, wantons, lo mein, fried rice, chicken and broccoli, egg foo young were all exceptional and we are going on 3X now.  The owner is super nice and will also remember your face and preferences.Another fun fact that cemented Fu Kee as an elite Chinese restaurant in the Triangle are the fortune cookies and noodles.  The owner receives them from companies in Westchester, NY and Brooklyn respectively.  Bless this northerners heart."], ["Eric S.", "This guy is a legend - a one man kitchen. The food may take some time to be ready; for a weekend dinner its been about 20 - 30 minutes, but its well worth it. It tastes great, and the menu has plenty of options. Recommended if you have the time."], ["Kory B.", "Good stuff. One man show. Cook, answers the phone, and I'm assuming everything in between. The food is excellent. I would have given it 5 stars if only the guy would get some help! He would be THEEE Chinese food place to go if he had someone to answer the phones and a team to deliver for him."], ["Katie R.", "This place has the most delicious Chinese food! I recommend the general Taos chicken and the sesame chicken. They are my favorites. He makes it with white meat chicken and its worthy of the wait. The reviews are not exaggerating it definitely is s one man show. But the owner is so nice and always remembers me and my order when I come in. I would recommend this place to anyone looking for good Chinese food."], ["Ashley M.", "As many have said, the owner/chef is a great cook and a nice guy. I'd recommend getting the General Tso's Chicken -- lots of large, juicy chunks of meat and delicious flavors. If you're a vegetarian or love tofu, the Szechuan Tofu is also delicious. After ordering, I noticed that they also have a General Tao's chicken, which I believe is General Tso's chicken but made with all white meat. I'll try that next time and will definitely be back!"], ["Eric N.", "Best Chinese take out around just wish there are more staff so I can get my food faster"], ["Rick D.", "Great Chinese take out! Nothing frozen, all freshly made. Homemade egg rolls, all white meat chicken, better than a fancy bistro!"], ["Casi M.", "The food and customer service are just the best! Just went for the first time and the owner (who works there by himself as the cashier, host, chef, etc) was very friendly and asks a lot trying to get to know his customers. You can tell he is super passionate about this place. He said the reason he is the only one who works there is because he \"doesn't trust anyone else to cook the food\". I can see why! The white rice is so good and sweet and the \"general taos (tsos) chicken was very tender and spicy. I haven't had Chinese this great in a while so I'll be a frequent customer. Highly recommended!!!"], ["Deb C.", "Fresh ... FRESH ... FRESH!!!  You ask for it, it gets made from what we southerners call \"scratch\"!  It's not fancy. It's not expensive. It is delicious, simple, and customizable. The owner/cook/manager has a great sense of humor and enjoys his work. Try not to share this with too many people though - we don't want him getting so busy he doesn't have time for us!"], ["Esteban E.", "Had lunch today at Fu Kee, the food is OK but the owner's customer service sucks. He is a one man show and seemingly over worked. He's too money hungry to get help. Which take away from his customer service."], ["Mandy M.", "Excellent Chinese food.  Friendly service from the \"one man show\"!  He does it all himself and it is worth the wait.  Go expecting to wait and it is not a problem.  Crab Rangoon is the best!"], ["Kelly B.", "Came In tonight to get some great Chinese food that is fast but good. When I first pulled up wasn't sure if they were open bc I didn't see anyone, but to my surprise they were open. I get  it's just a one man show but it took him at least 5 mins to acknowledge I was there. I ask for general chicken with up graded shrimp friend rice from pork... To my surprise a large charge of 4 extra dollars since this fried rice had very little veg and minimal seasoning. The highlight of the meal was the general chicken, it definitely tasted  far from food court general chicken. Forget about the egg roll, it's about as flavorful as card board. I stand by my review of 4 stars bc what should have been the highlight was. I won't bother upgrading my rice again. I also will ask to substitute spring roll for an egg roll even if there is a small charge. It's a little over priced but worth it"], ["Austin F.", "Definitely a hidden gem in Raleigh! The food is always cooked fresh and bursting with flavor. The general tso is a must have! Owner is super nice, that wait time might be a little high durning lunch but it's worth the wait!"], ["Ryan D.", "Absolutely phenomenal. I've been going to Fu Kee Express for about 2 months now and I have no plans to go anywhere else. Some of the best General Tso I've ever had (he uses all white meat, very tender)"], ["Sara Rose R.", "Had high hopes for this place but besides our food not being ready when we got there (30 mins after ordering) the food just wasn't good. Not much flavor and the vegetables were so overcooked I couldn't eat them."], ["Mona H.", "Best take-out in the area! The owner really knows what he's doing, and is super friendly. This was my first time getting take-out from here, and I'll definitely be coming back. The Four Seasons I ordered was absolutely loaded with meat and veggies. And he prepared it just the way I requested-- broccoli and mushrooms only. The eggdrop/wonton soup mix was super tasty. The crab rangoons are also really tasty, but they are lacking in crab meat. Overall though, I love this place and I recommend it!"], ["Darlene H.", "The best General Tao's Chicken I ever had.  The chicken was not that strange looking stuff I usually encounter in Chinese food. And fresh veggies in the vegetable fried rice!  Great!"], ["Nikki F.", "Amazing.... We will definitely  be back. One man show but that makes it great.  Wonderful  cook that aims to please."], ["Lerone J.", "Came in from Texas and read the reviews about this place so I decided to give it a try. It is definitely a one man show and he does a very good job of maintaining.  Food was ready very promptly and he was very nice. I ordered general sol chicken and chicken Lo mein. Lo mein was very good and flavorful. Rice was decent, it being yellow was different was good nonetheless. The general sol chicken was not very good. Too much batter and just not that tasty. That's the reason for 3 stars."], ["C E.", "Update--I went back yesterday and tried the Dragon and Phoenix which is the Orange chicken and shrimp.  It was YUMMY--I even brought the leftovers for lunch today and it still tasted awesome warmed over!!! It's a bit pricier that other Chinese take out places but I'm a believer that you get what you pay for and this food is SO worth it!!!!!!"], ["Bobby G.", "The family decided to come here for lunch and wow the food is awesome and the owner is supper nice everything. Is cooked to order and real meat is used you won't find just bread in your sweet and sour chicken but white meat and the other plates we got are all great."], ["Dustin S.", "I am leaving this review before I have even ate my meal. I highly suggest to anyone that hasn't ever been here, please know what you are ordering. I just ordered General TSOs chicken with pork fried rice ( for one person I thought) and he charged my $27.00. Evidentially I needed to say combination plate which is $9.00"]], "Five Star Restaurant": [["Jennifer H.", "How is it that I have never written a review for this place? I have been coming here for my Sesame beef and crispy green beans for over 10 years, probably closer to 15. The location is not convenient to my home or I would be here at least once a week. Last time we got take out, they forgot to include the green beans (so sad!!). We will always come back. You can't get crispy green beans or sesame beef like this anywhere else.The building is cool. Lots of character."], ["Zeke F.", "Something has gone terribly wrong at 5 Star. Once upon a time it was was really good Asian fare in an edgy dining atmosphere, but that is not the case anymore. The place has apparently been reduced to just a mediocre bar with the worst excuse for cuisine I have had in a long time. I spent $30 on takeout for a relaxing night in, but would have had a better meal microwaving something in the frozen food section of Harris Teeter. The food was bland and lacked any resemblance to what I ordered. I ended up with wonton soup that tasted like someone ran some ginger through bath water, potstickers that were soggy with an undetermined filling, Shrimp in \"Lobster\" sauce that lacked anything resembling a Lobster sauce, and they even over cooked the side of steamed rice!Bottom line...this place needs to step it up to compete with all the other dining options in the area. What a disappointing experience :("], ["Chelsea M.", "First of all the food took FOREVER to come out. Second, the flavor in my veggie lo mien was so lacking I had to add Sriracha to it. I had to add it to Chinese food. Third, they charge you for a fork. Seriously, yall. Not everyone on the surface of the earth uses chopsticks. The saving grace was that the portion was good for the price and the staff was nice to us."], ["Greg B.", "I had been to Five Star a few times with friends from work and had good experiences so I convinced some other co-workers to go there with me for lunch today. First of all, the service was terrible. It took 20-30 minutes just receive our soup & salads. When one of my buddies finally asked the waiter if they could speed up the service a bit he replied \"that's up to the cooks, they're cooking as fast as they can\". Keep in mind they weren't very crowded and I don't know why it would take so long to throw together a garden salad with ginger dressing or a cup of hot & sour soup.When the food finally did arrive it was mediocre at best. I had the \"Generals Chicken\" and it was way overcooked and dry. All of my co-workers had pretty much the same opinion of their food, overcooked, bland, dry, etc. It was as if the meals were precooked and then just thrown in a skilled with some oil to heat it up. Again, I have no idea why it took so long for something so unsophisticated.I doubt I will every be able to convince these friends to go back to Five Star."], ["Pamela R.", "If your looking for a dining experience in a warehouse, come to 5 Star.  If your looking for exceptional Asian cuisine, this place is ok.  Not the worst place but not the best either.  What it  lacks in a tremendous food experience, it makes up for in atmosphere.  The interior is a little industrial with great warm colors. The layout is a little awkward and there is lounge seating in an area near the bar that is brightly lit that doesn't make much sense but maybe on a weekend night it does.The food was decent.  I had the steamed pork dumplings which were good.  I would order those again.  I also tried the  Five Star General's Chicken as my entree.  It came highly recommend by the waitress that night.  Large chunks of chicken that were tender.  It tasted a little plain but still good nonetheless. I didn't try any of the fancy drinks but hunkered down with a tried and true Tsing Tao. Can't go wrong with that. I would not be opposed to trying them again to see if my experience improves."], ["Amy H.", "This place is touted as one of Raleigh's hidden gems so I went in with high expectations but left extremely disappointed.The atmosphere of this place is really cool albeit not remotely what you'd expect from a Chinese place. It's in the warehouse district and it has kind of a 90s Seattle grunge type vibe. The 90s alt rock they were playing fit the decor perfectly. Sadly though, the 90s nostalgia was the only thing I enjoyed about this place and the only reason I'm giving this place two stars instead of one.My evening turned sour before I even got my food. The hipper than thou, very much not Chinese waitress was extremely rude to me. I was dining alone because I had a night class that night and couldn't even get dinner until 9:30 pm and most people don't eat that late. She seemed utterly baffled at the concept of someone dining alone and gave me attitude about it.The food was god awful. Even my dumplings were bad and it's pretty hard to make dumplings not delicious. They were very oily and one even sprayed a stream of grease at me when I bit into it! My entree was even worse. I got Thai peanut noodles and the noodles were mushy. The sauce was overly sweet and didn't have the nice sesame taste that I expect with this dish. I asked for some hot sauce in an attempt to make it taste better but their hot sauce was gross too. It tasted like ketchup (which is definitely the worst condiment ever).Supposedly Five Star is a nightlife spot as well as a restaurant. I would possibly go back for a beer if I was in the mood to relive the 90s. However, I hope the bartenders are nicer than that nasty waitress....."], ["Harsha Vardhan Reddy M.", "Serving is very late.  Food not good. Don't try the chicken fried rice at all. We ourselves can do a nicer job."], ["Brent W.", "Delicious food supported by excellent service. This isn't your typical fast food Chinese more of a eclectic mixture of haute Chinese and simple food. It's all flavorful and well executed, it's exceedingly fast from order to table. The service was exemplary and they were so nice and attentive the whole time. A great dinner experience."], ["Alexa L.", "I don't even know where to start on this one. This place was an incredible letdown. Everything about it. The food. The service. The atmosphere. It was just a bad experience.Food: Ok, so I don't understand the appeal of going to a place that serves the same type of food that I can get at a chinese take out for way less money. I'm paying $15 for sesame chicken that I can get for $7? I gave them the benefit of the doubt and expected it to be like a \"WHOA OMG this is the best chinese food, so worth it!\" moment but it wasn't. This is NOT authentic chinese food, nor is it great flavor. Super salty, too fried, little variation. Literally get a plate of just deep fried chicken. and rice. That is it. So everyone got tired of eating the chicken. At least the portions are big..Service: WOW I wish I can say this wasn't the WORST service but it was. I asked the server for a sangria (which is a pretty generic drink that most bars can make) and she just looked at me rudely and said they don't have any. She didn't try to suggest a similar type drink or anything. Just a flat out \"No, sorry.\" Like...what?! And then when throughout the duration of our meal she always seemed like she was bothered. I've never had such rude service. EVER. And oh yeah. To top it all off, she completely screwed up our bills. She actually forgot to show up and give half of our party their bill in the first place until we had to find her and ask why they didn't get one. And then it's all wrong anyways.. So I think we actually stayed a whole extra half hour waiting for the bills to be sorted out. Atmosphere: AWKWARD. Basically we had our dinner in the middle of a....dance floor? They already had a DJ and people just drinking along the walls of the roo, and so it was so uncomfortable eating as we know that people are just watching us eat as they drink and socialize. Like, WHAT IS THIS. Either be a restaurant or be a club, but don't try to be both at the same exact time. Couldn't you have brought in the DJ a little later in the night? Ok, I'm done. To sum it up, this place did not leave the greatest impression. Won't be coming by here again. Do yourself a favor and just go to p.f. changs. or your nearest chinese takeout."], ["Mollyann R.", "So. Much. FOOD! My boyfriend and I went here for dinner for First Friday and had enough food left over for 2 meals for each of us. Based on the rave reviews we heard, we ordered the Heat Seeker Shrimp for an appetizer. They were on special for $5 for First Friday. They were good, but not as good as expected. Huge portion for an appetizer!I also ordered the Asian Sangria to drink. It just tasted like white wine with slices of some fruit thrown in. Not anything special. My boyfriend ordered the Five Star's General Chicken and I ordered the Crispy Sesame Beef. We also got a side of the fried rice. I wish that we would have just ordered the appetizer + one meal to share. Wayyy too much food! The Crispy Sesame Beef is a unique idea but I did not love the execution. It was a bit dry, I had to ask for some more sauce.The food was just alright. Pretty standard for Asian food in my opinion. However, the reheated leftovers almost tasted better than when the food was served fresh in the restaurant!"], ["Santana D.", "I was not a fan not only was the food extra american....but the door service is something to be desired because they almost refused to let me pick up an order because they had a band playing....who does that.....get out of here I do appreciate that the chicken is not a mystery and juicy.....but maybe thats part of the charm of greasy american Chinese food."], ["Yiwen T.", "My friends and I have visited Five Star quite a few times. It is located in the Warehouse district in downtown Raleigh. The restaurant is easy to miss as it is just a large, nondescript brick building on the outside with a small sign above the door. On the inside, it boasts lots of space with a lounge type atmosphere. This place also turns into a club late at night.The main reason we come is for the food. Their Crispy Beef and Heat Seeker Shrimp are by far our favorite dishes on the menu. The Crispy Beef is an entree and the Heat Seeker Shrimp come in either appetizer or entree portions. Rice comes on the side for both orders. There are several good appetizers on the menu along with tasty and affordable entrees. Wednesday nights after 9 pm were our favorite times to go as they would have half off appetizers. It's a great place to meet some friends, drink some beers, and have some Crispy Beef and Heat Seeker shrimp. They also have a full bar with some draft beers on tap. If you are looking for authentic Chinese food, look elsewhere. But, if you are interested in good Asian fusion dishes for affordable prices, this is the perfect place."], ["Stephanie H.", "I have been to Five Star a few times now and have enjoyed it each and every time. It can get packed once it gets later in the night and the wait time is ridiculous but if you go earlier enough you should have no issues. We started off with the Crab Rangoons which are always delicious then split the Sesame Crusted Tuna. I opted for this since it was not fried but would probably not get it again. For an entree, we decided to split the Beef and Broccoli which was a huge portion for the price. I wanted to try something new so I decided not to get the Crispy Sesame Beef which I highly recommend. HIDE YOUR CATS"], ["Chad R.", "Amazing atmosphere. Amazing food. Amazing service. I am a manager of a restaurant and I would like everyone to know that if you are visiting NC please please please check out 5 star. If you can remember and it's later in the evening plea see each ask for Meredith. She know her drinks. She knows her menu. And she makes sure your please. Good good good job 5 star"], ["Ron W.", "It's been an up and down relationship, Five Star!  When I first met ya, I thought you were really good.  A couple of more visits and I thought your food had suffered.  So we broke up for a bit and took a breather.  But you know what, that wasn't the end.  My last two visits have shown off a refreshed interior along with better food.  Better ingredients, more care with the prep and flavors along with the usual solid service.  So I've got my fingers crossed, Five Star!  And I'm hoping you'll be that frou-frou Asian place that I can support because I'm pretty picky when it comes to the food of my people.  Honey-walnut shrimp and Asian short rib tostadas, aside.  Fusion is good.  Sultry ambiance is good.  Keep up the good work and let's get our relationship, back on track!"], ["Chip R.", "Most of the times I have stopped by Five Star in the past has been for a drink with friends or some apps and had good visits at the bar. This week during Restaurant Week downtown I went to enjoy their $20 fixed menu selections and had a great experience.I like the atmosphere, a bit dark but nice. You can dress up or down, and can also be a good date spot. A great space that reflects both the warehouse feel and stylish accents. They have great upbeat music instead of the same old hum drum background stuff and I like that. Once settled in, I examined their 3 courses for $20 Restaurant Week menu and was pleased with the offerings. I started out with the Crab Rangoon, and it was some of the best I've had anywhere locally. For my entree, I chose the Crispy Sesame Beef. Wow, what a portion of beef! With the vegetables and sauce together in the beef, it was wonderful...even though it was a good sized portion I finished it off as I enjoyed the flavor of this dish. For dessert, some warm chocolate cake. Although it did not match the entree it still was a good finish to a great meal. Bottom line: A great Restaurant Week experience, I recommend the Crispy Sesame Beef if you come for dinner here at Five Star. Great sized portion with wonderful flavor. I intend on visiting Five Star more in the future."], ["Jeanette H.", "I came to Five Star while in town visiting a friend. We decided to partake in restaurant week before a show that night. We made reservations early as our show was at 7pm. When we arrived it was pretty empty but by time we left it was packed. Restaurant week is my favorite thing and I can't believe how inexpensive it is. The Five Star menu was $20 for three courses consisting of an appetizer, entree, and dessert. For the appetizer we all got something different and decided to share sort of tapas style. We had the heatseeker shrimp, Crab Rangoons, and Chinese BBQ Pork Tostadas. I am not a shrimp person but with some peer pressure I decided to try it. It was actually very good and did not taste \"fishy\". The serving size for the shrimp was also very large. I would have never guessed that we would get a whole bowl of shrimp. The crab rangoon was my appetizer of choice. It was very good (I'm not sure why I have always loved crab rangoon even though it is seafood). For my entree I had the Grilled Beef Tenderloin and it had a Sweet Pepper Relish and Black Bean Sauce. They also give you rice as well. The tenderloin was perfect! The relish and sauce mixed with the rice made a perfect side!  Everything was cooked to perfection.By the time dessert came out I was stuffed. But lets be honest...there is always room for dessert. I went with the warm chocolate cake. It wasn't too bad but I was hoping it would have been a bit richer. It was a little light on the chocolate taste. Overall this was an excellent dining experience and the service was great as well."], ["Robert D.", "First review on Yelp. Gotta say this place has their food nailed down. We came in around 5:30pm on a Friday so not many people were there yet. The service was great with our waiter giving us some good suggestions along with a history of the building.We started off with the Heat Seeker Shrimp. I'm not much of a shrimp person, but gotta say I found myself munching down on these until I had to pull them away before I filled up. I had the Crispy Sesame Beef and I gotta say this was an incredible dish. Lots of food, we should've split this one, but even though I just made it through about half, reheated this stuff was still just as great. Lots of flavor with just enough kick to keep you coming back.She had the Five Star General's Chicken. While this was also a great dish with great flavor and the chicken cooked so well, after the Crispy Sesame Beef, it just didn't have the same kick. I would still order this one again and again, reheated it was still great.This place is definitely in the rotation now!"], ["Andrew W.", "Since Five Star is directly next to my office, it's basically turned into my 2nd cafeteria. The lunch menu features $8.00 \"power lunches\", including my favorite, the curry shrimp. The general's chicken and crispy sesame beef are also very good options. The power lunches come with a shrimp roll or soup, and your choice of white or fried rice.At dinner, I prefer to share with a group. The heat seeker shrimp are always a must. I'm also a big fan of the crispy green beans and scallion pancakes. The entrees are huge portions of some of the lunch items. You can feed a family with basically two entrees and a few small plates.At night, Five Star turns into a dance club. I've heard stories that it used to be a hole-in-the-wall before it was a restaurant. Five Star was a venue for Hopscotch Music Festival pre-2014, but the downstairs is pretty small and it's relatively far from the other venues.Service can be hit-or-miss, especially at lunch when they are running with a small crew. At dinner, I haven't had any issues.Five Star is one of my favorite restaurants downtown and a great option for a casual dinner."], ["Anthony M.", "What a great place!! Food was awesome and the decor and atmosphere had a great urban feel. Happy I read through yelp before so my fiancé and I didn't order too much food. One appetizer and one entree was enough. Also, song happy I didn't pay attention to the negative reviews! This place made my night!"], ["Ligeia C.", "The experience gets better every time I go.  The first time I went fascinated! Now I have been several times as a regular customer and twice for restaurant week since they open! For restaurant week they offer one of the best deals in town. Can't beat it.  I love chef Beni Velazquez and his delicious food!"], ["Justin B.", "Hands down the best Chinese food in Raleigh. The Fried rice is perfect and everything on the menu is good (I've had it all). Staff and service is always phenomenal and friendly and the food is always consistent. Lunch deals knock most other places out of the water, $8.00 power lunch with more than enough food and a drink is included."], ["Laurie V.", "This is a great little gem and I can walk here!  I don't enjoy tofu normally, but I went with my vegetarian friend, and they made tofu taste REALLY good.   I also had the shrimp pad thai and the crab rangoon.  It was the best crab rangoon I've ever had.  I hadn't tried it in awhile and the last time was from a greasy Chinese take-out, which I think used imitation crab meat.  But not here!  It was the real deal.  My friend was whining about sitting at the bar, but I thought it was the best spot in the entire restaurant and we didn't have to wait.  Besides that, the bartender was really sweet.  She was busy, but she took time to talk to us and made sure that we got everything on time.  Portions were huge.  What I did find strange is that had we *not* opted to sit at the bar, there was a long wait.  It didn't seem to be busy, nor crowded in the dining room- the bar actually appeared to be much busier.  So maybe they were just short-staffed in the FOH?  Either way, I would return here again and again.  I gave Five Star just Four Stars, but it has potential to live completely up to its name.  I will keep you posted!"], ["Virginia H.", "The food was delicious but this place has a few serious downfalls that warrant this two star review. I'm not sure if management knows what kind of vibe they are giving in the dining area. In some ways it is very nice with wine glasses for your water and the candles on the table. However, the carpet is super cheap, the walls have chipped paint, and their music comes from a generic wireless speaker that is visible to all patrons up on the ledge of the wall near the ceiling. Gratuity is 20% for five people or more, whereas most places I go, the cut off is six or more. Also, they make you use chopsticks and if you want a fork they charge you 75 cents. I think that is insane. I think they could up their prices on the entrees by 25 cents and end up making more money and appearing classier and not so cheap to patrons than charging to use forks. Also, the lack of forks also means you have no knives at the table, making it very hard to cut up your food (chicken in our rice or the peppers in our salad)The heat seeker shrimp, pot stickers, fried rice, and mixed green salad were all great and reasonable priced. However, most Chinese places are reasonable priced and you always seem to have a ton of food for what you paid for, so five star is no exception to the norm. Overall, I was not really impressed and would rather so somewhere else (that doesn't charge for forks) for good Chinese food."], ["Caroline J.", "I went here for the first time with a group for a birthday dinner. Most of my friends have been here before, and some said it's good/some said it's not that good. The one friend said he didn't like how sweet the sauces are and how they put so much on. I love sweet Asian foods so, it's cool with me. I thought it looked really nice inside, we sat in the middle of the restaurant right in front of these mirrors/couch area. I thought it was kind of awkward since there were people just sitting on the couch and if I just moved my head slightly we'd probably be staring at each other. Eh, but it wasn't a problem, kind of funny. So there was a group of 10, and so I know there were a lot of us. But I don't think any of us cared that it took a awhile to get drinks, food, etc. The waitress was really really....not good though. My boyfriend thought she was either new or just not good at being a waitress. I wouldn't mind as much if she looked like she cared. She just seemed spacey and blah. Some of the people ordered appetizers, and she didn't ask me if I wanted anything (I mean I didn't want anything anyways) BUT she brings something out and asks if it's mine--ummm I didn't even order anything at that point. I just thought...uh maybe she could pay attention? In the end, our checks were so screwed up. Three of us didn't even get our bills, and she didn't even come back. So we were just so confused and waited a long time. Finally, we see her and one of the guys goes up to her and she comes over. She just says that \"oh yours has been paid for\" to one of us 3...we're all so confused. In my mind I thought oh like someone must of paid for the birthday girl.....but the girl who didn't get charged wasn't even the birthday girl-she was just sitting next to the birthday girl. Our friend clearly told the waitress who the birthday girl was, but she was too ditsy to pay attention. I really liked the food though. The portions were huge and the broccoli just tasted so good/fresh."], ["myra f.", "If I could have done 2 and 1/2 stars I would have. Food good. Soups lacking but everything else quite good. Appetizers were nice sized. Shrimp that everyone raves over is good but quite sweet. If it sits in the sauce at the bottom it's soggy. Calamari very good. They were out of all dumplings when we were there. Egg rolls were decent. Dinner portion sizes are huge. Definitely share. We had chicken, beef, shrimp entrees all were well cooked.  Now for the down side. Service, awful. Our waitress needed training. She was pretty bad. We had a party of 8, very easy group. Between apps and entrees it took over an hour and a half for food to show up. No explanation nothing. We were not in a rush, but there was no reason for such a delay. While the restaurant was busy as it was graduation that day, it was not over crowded.  Drinks from the bar, we only did one round because service was so bad. The drinks themselves were quite good. It took a half hour for drinks to come from the bar. We could see them made and placed on the bar, as our table was about 8 feet from bar. Our waitress brought them over one at a time. Some of our tables meals came out before others. Very inconsistent. Some items we ordered never showed up. Some items only part of the item came out, example a chicken dish with pancakes, only the pancakes came??For the icing on the cake, they charge a 20% mandatory gratuity on the bill including the tax. If we had not had such bad service I would not be so upset about this. If an establishment is not going to properly train servers then please don't make the gratuity on top of the tax. The bartender seemed trained, cooks were obviously trained as food was very good, hostess very nice, waitress UGH..."], ["Cait H.", "I love Asian cuisine. I mean, like really a lot. Like pretty much any day of week you could offer it to me and I would pretty much say \"yes\" without hesitation.That being said, I obviously loved Triangle Restaurant Week at Five Star. We made a late reservation on a whim and went downtown for some good eats. We started with the Heat Seeker Shrimp and the Crab Rangoon; both were piping hot, but I'd have to give the edge to the shrimp. They were battered and fried just enough to be crispy (not heavy or mushy), and were spicy enough to make me wiggle my nose with happiness. The Rangoon featured actual seafood and not just cream cheese, which also made my belly glad.I ordered the Five Star General's Chicken (their take on General Tso's) and Jay tried the Crispy Sesame Beef. Both were delicious, heaping portions and I would order them both on a return visit in a heartbeat. Our meals came with large bowls of rice and we were full enough to have leftovers for the next day.Dessert was kind of an afterthought, since we were so full (chocolate cake for me, and apple cake for Jay), but the ginger-infused whipped cream on the apple cake was a stroke of genius. I immediately had visions of topping hot chocolate with this lovely concoction. Yum.The menu features a lot of the classics, but if everything is as good as our TRW meal, I'm sure you can't lose. I will absolutely be back."], ["Nicki S.", "Our office move right across the street so this is the perfect place to grab a quick lunch! Tried multiple items from here, never been dissapointed. The service has always been friendly. Food has always tasted fresh. They also have sandwiches in case you're tired of traditional dishes. The Asian BBQ sandwich was so delish so recommend giving it a try if you're not feeling rice and meat style!"], ["Cara K.", "I absolutely adore 5 star. It is without a doubt the best \"chinese\" food downtown. The Five Star chicken is so dang delicious, though the spiciness level can vary sometimes which ain't that cool. But other than that, I can't recommend it enough."], ["Karmilla C.", "I think the \"Heat secret shrimp \" it's highly over rated, we ordered it because we saw the great commoners and highly recommended by their waitress, however, it turned out a bit disappointed, the dish is too salty and nothing really special, the other appetizer from the menu are much better! Well, the general chicken was not as good as I remembered, wondering if the chef is changed, however , similar dish - fired sesame beef was way better than general chicken!  Since they are quite similar, you may not want to order both of them at the same time perhaps you can try different dishes!"], ["Lauryn C.", "I had a craving for some good Chinese food while I was in DTR.  I was right around the corner from Five Star and I realized I've had a lot of drinks here but I've never actually eaten here.  I stopped in around 8pm on a Wed night, there were a few big tables around us but it wasn't close to being full.  The hostess informed us that the kitchen was very far behind so she was going to have to put us on a 15min wait, weird.  Given that amount of people in the joint there is no reason a kitchen should be that far behind it's not like this is a new restaurant figuring it all out. Anyways we decided to grab a drink at the bar, and after meeting the friendly bartender and some folks at the bar we decided to just stay at the bar to eat as well.  I guess Wed. nights are very popular here because of the 1/2 price apps till 7pm.   Well we already missed the deal but decided to go ahead and order the tuna app and the tofu lettuce wraps. I'm really glad I went for the apps and didn't order a full meal here the entrees were pretty pricey and after taking a couple of bites from our apps yikes - it wasn't horrible but man of man I've had way better versions of both of these dishes around town.I love the atmosphere here, and I dig the bar but as far as coming here to eat, no thanks there are too many other great options around town!"], ["Rose L.", "Ah Five Star, you are one of my favorite late night spots in Raleigh. After an evening on the town I love to stop at Five Star for a bite to eat on my way home (open until 11:30p or midnight every day!). They serve huge portions and my boyfriend and I usually end up getting a couple apps to split. The heat seeker shrimp are one of the best known, a little sweet and spicy mix and an appetizer big enough for 3-4 at least. I also love the scallion pancakes, crab rangoon and the green beans as always a 'healthier' but tasty option. I've tried the spicy beef noodle as an entree, ended up splitting it and still having a large portion to take home (again, the servings are large). You can also get a side of lo mein or fried rice if you want to jazz up your appetizers (although note that they don't put proteins in the sides). I love hot and sour soup, but that's probably the only thing I've had so far here that I wouldn't recommend, there are so many other better options of the menu. Definitely try to hit them up on a Wednesday night or on First Friday as they usually have great specials."], ["Laura G.", "We went for Restaurant Week and what a wonderful experience we had. We were given a nice romantic table by the window and an excellent waitress served us. For starters we both had the Heat Seeker Shrimp. This app was big enough to be a main course. The shrimp were served to us steaming hot and the flavor was excellent. Hubby said he tasted some heat in the dish, I would have liked it to be spicier. But even without it being spicy, it was a delicious hit and once again I was eating the garnish (carrots, cucumbers) and drinking the sauce from the bottom. For our next course hubby had the generals chicken, which was huge and so yummy. It didn't have any greasy fried taste, the pieces weren't too big to put in your mouth, it was just wonderful. I had ordered the duck, but when it arrived it was about six little tiny pieces of duck, so before the waitress put it down, I made a sad face at the lack of food, so she immediately asked me what I would like instead, and within minutes the sesame beef was sitting in front of me, the same huge portion as my hubby's, and I was a happy diner. For dessert we both had the banana cake. The best part of that was the caramelized banana. This was a wonderful meal at a nicely decorated restaurant with lots of helpful wait staff. I asked one to take our photo and he was real nice about it too. We parked on the road by the Trolly Pub, so that was fun too to see where it originated and the cool mural on the wall. I'd love to return for lunch soon and see how that will be."], ["Gregory H.", "There's a good deal of hype going into this place.  While if find it okay, I don't find it particularly worthy of the hype.  The place is not clearly marked on the outside.  There is no sign outside, so one really has to be looking for the place in order to go here.  My bride and I finally figured out where the entrance was and upon our arrival we were asked if we had reservations - with the hostess adding something about first Friday (what the heck is first friday about, why does it matter, and what does that have to do with reservations?).  No, we didn't have reservations but that was okay, we were seated in about 20 minutes.  For a place this hard to find, I thought it odd that we would be asked about reservations, after all, I didn't really think of it as upscale when we finally found it.  It must be that popular.Kudos to the staff for bringing us each a glass of water while we waited on the couch by the DJ's booth.  Couldn't hear squat above the music and background noise, so my bride & I had our conversation by text message.Heat Seeker Shrimp wasn't exactly hot - it was sweet and fried, but I wasn't really expecting deep fried, and I was expecting something spicier, - something to make me sweat - I was a little disappointed.  The red curry shrimp was tasty, but again, I was expecting something spicier... it just wasn't.  Sparkling water was on the menu, but they didn't have any - I was brought club soda with a lime - it was actually an acceptable substitute.Our server was all business, no small talk, no real interest in our presence there, not a conversationalist.  I think I can understand, dinner hours were winding down on a Friday night and she probably wanted to get her cleanup done and get out of there for the night.Parking - okay folks, I don't know what the deal is in, around and near downtown Raleigh.  I have to say I am miffed about the parking.  There wasn't any street parking available, and I found what I thought to be a municipal lot by the Vintage 21 church (there was a round sign with a (P) on it), in the dark and the rain, I didn't see any indication of having to pay for parking, but when I got back to our car, you got it... a $30 parking ticket - goes on my list of why I can't stand downtown Raleigh (or Chapel Hill for that matter), but that's a whole different story.At the end of the day, Five Star is only worth about three - it's okay, but it's not a place I'd go out of my way for."], ["Eranthe B.", "Love five star....the best Chinese food ever. ..I used to live in Raleigh now I live in NYC every time I come down I must go here to get my fix. .. get the heat seeker shrimp or the pork fried dumplings!!!"], ["Kelly B.", "We went in on a slow monday night with my mother-in-law and sister-in-law who were visiting out of town. Service was very quick and pleasant. I ordered lo mein with tofu, my husband got sesame beef, mother-in-law got generals chicken, and my sister-in-law got korean bbq ribs. When we got our food everything was GREAT!! our portions were huge.......except for the fact that my sister-in-law literally got 2 3-inch sticks of meat with barely any meat on them......it was so funny I should've taken a photo! The fact that the portions of noodles and rice on our plates were so large.....and then they bring out 3oz of meat just thrown on a plate and charged us $8.95  for it is very questionable! My mother in law even asked the waiter if they were serious....he offered nothing else... no substitutions for the cabbage that she did not want with it. It was quite terrible customer service on their part. All he said was \"that's what it comes with\". How are you going to throw GIANT portions on three people's plates then give the fourth person a plate with a sorry excuse of two \"ribs\". It was quite embarrassing on our part because my husband really wanted to show his mom and sister a good time at a restaurant that he frequents often. We may give them another chance, but until then i am very unimpressed with their customer service."], ["Eda T.", "Consistently great food and service. Remember to make a reservation on weekend nights."], ["Taylor G.", "Service was really amazing - I've had our waitress as a bartender here before. It's nice to always be welcomed back to an establishment by someone who's so genuinely happy.Now the food was a little lacking. Stay AWAY from the \"_____ with noodle\" dishes. You'll be better off just getting the $4.50 low mien with one of the proteins they offer. You'll be scratching your head at the end of your meal wondering why you spent $20.DO order any of the proteins with rice. They give you a much larger portion, and it's overall tastier. All in all, I'll come back here alone for the service, and just order something else."], ["dave f.", "Good food and nice staff. It's not orthodox Chinese but still, fresh ingredients and a good beer selection."], ["Dani V.", "Would like to thank the staff for being so amazing this past Sunday! They opened early for me to have a gathering and were so nice! The food is spectacular, my favorites being the calamari and lettuce wraps! I am very thankful for service they provided!"]], "Pei Wei": [["Lynchburg S.", "It's your typical pei Wei. Food is tasty and service is good. Only gripe is they are inconsistent with the amount of food in the meals. We've ordered a big order and some have more rice/veggies/meats than others. Not a huge deal, but it requires us to usually double the order to make sure there's enough of everything."], ["Ali B.", "My husband and I used to go to Pei Wei all the time at Cary town center but recently moved to midtown and now go to the falls location. In the last month or two it has really started to go downhill both in terms of food quality and service. Tonight was the third try and maybe the last. We ordered online to go. Food was done on time which was great but the guy that brought us the food when we got there for pickup treated us like more of a burden than a customer. We are usually asked if we need soy sauce, utensils, etc. This time we weren't asked, so my husband asked for extra soy sauce. The response was something along the lines of, \"You already have 4 in the bag\" as if we are trying to rip them off of a couple soy sauce packets I something.When we got the food home, the flavor in general was underwhelming. Thai chicken lettuce wraps were ok but the lettuce that came with it was browning on the edges like it had been sitting in a bag in the freezer for a while. The Kung Pao was a major disappointment. Both dishes were way too salty. I was also there for lunch during the work week about a month ago getting take out when I witnessed staff copping an attitude with each other - the chefs in the back getting attitudes with the folks trying to manage customers. It looked like a major breakdown in order management and communication. In their defense, it was really busy at the time. One of the guys we recognized as doing a fantastic job managing/running the Cary town center location extremely successfully during busy times was trying to control the chaos at the falls location but to no avail. He was polite as usual to us and other customers but it's hard to run a ship that big with untrained staff and frustrated chefs that ignore you when you ask for an order correction."], ["Barbara G.", "PF Chang's on a budget! Wonderful food, fast, friendly, fresh and fairly priced. My daughter had the honey chicken. It was a delicious combination of sweet crispiness with a touch of sour and dash of spice. The brown rice has a wonderful nutty flavor...wish I could make rice like this at home! I had the shrimp Pad Thai at a 50 cent up charge for shrimp...well worth the extra change as there were plenty of juicy shrimp in the dish. Pad Thai was coated in a wonderful broth and the perfect amount of egg...delicious!  Can't wait to return!"], ["Brittany G.", "Pei Wei is a good spot if you are in a pinch and are craving some asian-inspired food (I'm pretty sure nothing in this place can be described as authentic) but the food (like other Asian chains i've noticed) can be very hit or miss. I enjoyed my steak fried rice and edamame last night, but I do remember vividly times were the food was way too salty or served with hard rice. Perhaps it's the change in their menu but things are looking up for the restaurant I used to equate to a slightly nicer Panda Express. Oh and free fortune cookies! Yum. Service is always pretty good, the wait may be long but management circles the dining room to make sure everyone is happy. The place is also very clean, as workers are quick to pick up your plate the second you finish (not kidding, the woman cleaning up last night took up a bowl from our plate the minute we took our last bite). I'd say if you're in the area and looking for something quick and not-that-fancy then definitely stop by. If you're looking for something authentic or a nice sit down relaxing dinner, skip!"], ["Farid A.", "Mongolian beef and noodles. Was really good. Also nice soda machine where you can pick any type or flavor Sushi was not rolled well but overall I liked"], ["Brie B.", "Yeah. I love it here. I am so surprised how good the pad Thai is. The perfect mix of sweet and spicy. The cilantro is a nice touch as well but can be over powering. If you have not tried the lettuce wraps you are missing out on life. I wanted something filling and light. The lettuce wraps fit the bill. And the dipping sauce is awesome ! Since your food is made to order take out takes like 20 min. That is the only downer about this place. If you are looking for a semi healthy lunch visit this location!"], ["Teresa C.", "I stopped by for a quick dinner. I had the  lettuce wraps and a  cup of wonton soup. The soup was excellent same as other locations. But the wraps had way too much sauce on the mixture.  They were still good but not as good as other locations.  If I eat here again I will request light sauce.  Service was excellent and staff was very nice too."], ["Dennis B.", "I just wanted to take a moment to pay extreme gratitude & admiration of JoJo and his staff at PeiWei on Wake Forest Rd in Raleigh, NC. I'm always impressed by the food and friendliness of the staff.  I usually get the Chicken Pad Thai which is by far the best Pad Thai anywhere in Raleigh.  But especially on my last visit, I apparently left my wallet there.  I had been looking everywhere for the past 36 hours and  I had no idea where I left it.  JoJo actually went out of his way to track me down and let me know I had left it there.  Most people may have just held it in case someone called, but he actually found me!  Perhaps most impressively, the wallet had over $100 cash which was all accounted for!!  I couldn't believe that in this day and age there are genuine honest people left in this world!  I'm so happy for this.  The long time table busser who found it and turned it in was not there at the time but I hope to show him my gratitude next time I see him, and I sincerely thank JoJo and his staff for their honesty and integrity."], ["Craig P.", "Like they all say, PF Changs at half the price.The Crab Wontons are a must, served on spicy chile sauce, I have at them as the meal with a side of brown rice (don't judge)I also recommend the Honey Chicken & Sesame ShrimpGreat concept, excuted well"], ["M A.", "I love Pei Wei for their perfect portion sizes. The shrimp ginger broccoli is my absolute favorite. The manager and staff at this location are always very nice."], ["Matt E.", "If you get your food to go...give them an extra 20 minutes on top of the allotted time they originally gave you to pick it up ;)"], ["Anna L.", "New to the area. Location is great the employee's where great, quick and friendly. The place is clean.... The food here  has never been disappointing."], ["Trupti T.", "There is not much you can expect from a fast food chain.  The service here however is excellent.  The food comes out quickly and they remember you if you go there frequently.  What I had on my visits there definitely was good in tasting.  I wouldn't say it lacked in the flavor department.  The overall experience was good, this place seems pretty popular during lunch time, the portion for the value is good as well."], ["Kimberly W.", "My first visit to Pei Wei and I was so impressed.  I am sorry it took me so long to try one.  The staff was courteous and kind and attentive.  The food was awesome and very reasonably price.  A new favorite for sure."], ["Rob W.", "They serve some pretty good food here in a fast food style. You will be served quickly and the prices are very reasonable. There are lots of good choices on the menu. I like the rice noodle dishes."], ["Toni S.", "I just left Pei Wei during lunch and the food was quick and tasty. The staff could be a little friendlier but the Manager was really nice."], ["Annie F.", "Food is as expected. Kids love coming here. Portions are perfect. Great service, polite; however,  if the music was lower the noise level would not be as high. Kids were dancing around and enjoying without being disruptive to the other patrons."], ["Jennifer C.", "I love Pei Wei and often find myself eating here once or twice a week. If you're gluten free they have some pretty good options. I mostly go with the gluten free sweet and sour chicken and I would never know it's gluten free. They have gluten free soy sauce available for dine in or takeout. I wish they would expand the gluten free menu to include more items that they use soy sauce based items. Great for gluten free, fast food takeout! Love that they offer both brown and white rice and the rice is cooked better than I ever can get it! They do get very busy, especially at lunch during the week so I usually try to order at around 11:15am for lunch or after 1pm. Especially when they have special offers or coupons. There are rarely enough people on the registers to handle the rush which stinks. Dinner is usually pretty slow."], ["Josh P.", "Tastes a little too generic. It's not bad, but it just lacks spice and salt and flavor. Okay, so maybe it is bad."], ["Leah A.", "Amazing food.  One of my favorite places to eat in Raleigh.  Ive tried several menu items and they are all delicious - Very consistent."]], "Panda House Chinese Restaurant": [], "Imperial Garden Chinese Restaurant": [["Elise W.", "Stopped in on my way back from RDU for a quick takeout order of orange beef with wonton soup. A bit pricey at $15, but absolutely worth the money. High quality meat, flavorful, and a huge portion. In fact had enough for two adult dinners and leftovers for lunch the next day. I would even  go as far as to go out of my way to stop by this place!"], ["Scott B.", "I have been looking for a nice little sit down Chinese restaurant for a while in Raleigh. I'm so glad that I saw the reviews on Yelp for Imperial Garden. Friendly servers and a nice layout for seating so you don't feel like you are in a huge place. The service was quick. We went on a Saturday night at 6 and were seated right away. They have the crunchy noodles already sitting on the table waiting for you.The pot of tea for two of us was only $1! What a steal. The Kung Pao chicken was labeled as spicy and it actually was. I find too many times the menu says it is spicy but rarely is it. My daughter really enjoyed the sweet and sour chicken. It wasn't swimming in red sauce, just the perfect amount to give it flavor.Overall a great experience. No doubt we will be going back. The live piano player was a nice touch too. Played a good variety and mostly songs you all know."], ["Kevin L.", "This was the first time I ate at this restaurant. The service was very nice. Our waiter was very friendly. The food was delicious. Defiantly worth trying."], ["Julia S.", "I ordered take out Pork Moo Shu, Chicken Chow Mein, Wonton Soup and steamed egg roll.  I returned everything but the Moo Shu Pork.  The entire meal was horrible, bland, no flavor!.  Pork was just okay - VERY little meat mostly veggies which I think is really cheap on the restaurant's part.  I have obviously ordered the wrong items considering the other positive reviews.   Never again. Positive - the lady at the desk gave me a full refund (although I offered to pay for the pork) which was the right thing to do.  Thanks for at least being a classy place."], ["Eliot W.", "It was a really great experience and I'd like to start off by saying I would recommend this restaurant to friends and family. With that being said the 'Flaming Pu Pu platter' was a slight disappointment, luckily the entrées of 'Curry Beef' and 'General Tso's' kitchen were awesome. The entire stay was great also, the live piano player really made it feel like a special occasion, and while the staff may have been a tad spread thin there were extremely nice and attentive."], ["Christopher C.", "If you are from the NJ/NY area then must try this place. I am hard pressed to find better Chinese Food than here. Good menu selection, great service and the best piano player. Favorites are pan fried pork dumplings, sesame chicken, king pao shrimp and Singapore noodles."], ["Mark H.", "I had the pork with Chinese bbq.  It was wonderful. The one thing I really like about the place is they have live music with a piano player playing things like a medley of show tunes or something that sounds familiar."], ["Erika L.", "Wonderful.  Fantastic service.  Great food. Huge portions.  We had a great experience"], ["Greg C.", "Not great, but not terrible.  We had the lunch specials.  Hot and sour was standard and nothing special. Szechuan pork was on the greasy side, with overcooked vegetables but ok flavor. Fried rice was greasy.  I would not go back again but was very affordable for lunch."], ["Megan D.", "This place is great! We stopped in for the Sunday buffet. The selection was great, they have the best crab Rangoon I have ever eaten. Everything was piping hot. The interior is a little shabby and dated but the fantastic servers and the live piano music make you forget all that."], ["Rachel H.", "Not a whole lot of vegetarian options, but I got the home style bean curd, which was delicious. I love the atmosphere, chill bit lively. However, they loose one star because the eggrolls were terrible. I'm a big eggroll lover, and these were way too greasy. The fresh eggrolls came with a peanut sauce that tasted like pure sugar. Bleh!"], ["Kent L.", "Imperial garden.   My hidden gem.     I love Asian food and especially the takeout classics.   And this place hits everything I love about cheaper Chinese restaurants right on the head.   I walk in and get a seat and boom !   Complimentary soup of choice . I chose to get the wonton soup and it wasn't that yellow liquid mystery base I'm used to , it was a brown tasty stock.    And then I decided to try the buffet ( because the menu had too many good choices ).  The buffet was great ! It was small and fresh .  most buffets cook large amounts and let's the food sit out, here they bring out small freshly cooked batches of food.   I was very impressed by the selection too, the lo mein was great.   I also liked that there weren't crazy selections.  When I goto a Chinese buffet I like to see Chinese food! Not beef wellington or French fries and hamburgers.   I'd goto .....ugh......golden corral.  (Ew).   And I love the dumplings, but be wary they are large. Just 6 dumplings could be a whole meal.   Do yourself a favor , don't goto that run of the mill buffet try this place .  OH!!  And they have a live piano player to help with the tunes while your eating !!"], ["Pam M.", "Excellent food, great service, and a talented piano man almost every night.  This is our favorite Chinese restaurant."], ["Joe H.", "Dude....first off I have lived in Raleigh for over ten years and never been here before...TEN YEARS WASTED!  This place is awesome!   I grew up in the 80's/90's and this sooo brings me back.  Hands down best Chinese in all of Raleigh,  my only regret is that I did not start eating here back in 2002. Now if you are looking for Asian Fusion, or modernized Chinese dishes...don't waste your time, you will only be disappointed.  However if you want old school Chinese good with old school (80's) atmosphere then look no further."], ["KK W.", "This place has so many old school touches, if it weren't for the free refills on diet coke I would have thought I was having Chinese food back in 1982!  The soundtrack was slow piano music, playing the themes from movie love stories from the 70's and 80's (Ice Castles anyone?)  We had the dumplings which were 5-star--- outstanding, probably the best I've ever had.  The General Tso's chicken was very food, I love that they have steamed brown rice (not fried rice that some places try to pass off as brown rice).  The egg roll was ok, it was huge, but a little dry, nothing to dip it in, and overloaded with cabbage and nothing else.  If you're a fan of chinese you should def. give this place a try!"], ["Nathan R.", "We drive 60 miles to eat here when we are craving Chinese. The service is always great and enjoy the piano also. The food is always hot and tasty. The crab rangoon , dumplings, egg rolls are yum! The main dishes as we like spicy are very good . We highly recommend this for Chinese fix!"], ["Callie L.", "This place is right by my old apartment, I can't even tell you how much I miss it!! Dumplings are huge and delicious. Love the piano man! Take out is always great too. Basically have loved everything I've ever gotten from here."], ["Ryan H.", "I ordered take out recently based on great online reviews.  We were greatly disappointed.  Ordered the tempura shrimp.  There was no tempura.  The shrimp was so over cooked that I could have bounced it across the room.  The batter wasn't anything near tempura.  It was (literally) 1/2\" thick, heavy batter.  The most awful stuff ever.  Just seems lazy and not caring.  Kung Pao Shrimp.  It was a bowl full of peanuts in sauce with about 5 shrimp and no veggies at all.  Sad.  Fresh Spring Roll was full of overcooked cabbage - nothing \"fresh\" at all.  $35 wasted."], ["Mark B.", "Best old-school Chinese in Raleigh. I was a regular for more than 10 years until moving out of the area. Food is fresh and tasty, staff is super friendly. Food is great- love, love, love the Egg Drop soup, the Kung Pow Chicken, and friend rice.The Sunday lunch buffet is awesome- I usually don't like buffet food, but they make it in small batches, so it tastes a le carte.They've been open for over 20 years, and here's to 20 more!"], ["Dee C.", "Do you have any idea how hard it is to find a good egg foo young? They nailed it!   I'm a Jersey girl who desperately misses a good foo young and gravy.  The gravy makes this meal absolutely delicious.   The customer service is very good as well.   I've had decent garlic sauce from here as well,  but not the best I've had.   Overall,  good takeout...good service!"], ["Lawdy F.", "I wanted to like this place since I had heard good things about it and I appreciate the old style Chinese restaurant experience but I personally found it disappointing. Complementary fried noodles- good. And I like the dunk sauce they have on the table. Imperial Egg Roll- cabbage explosion and not much else, You'll be loading up on the sauce to get any flavor out of it.  IMPERIAL BEEF- I wanted to take any food quality issues out of it so I ordered the Imperial beef which is a NY Strip \"with our special sauce\", so no issue of poor cuts or grizzle should enter the equation. The steak was prepared to a uniform brown- no searing, no pink middle. The \"special sauce\" was just a nearly tasteless brown sauce that added nothing at all to the experience. In fact what happened is that a nice steak was unseasoned and then poorly prepared and then further degraded by being covered in a superfluously  ooze. For the $20 it would have been better just to send the steak out with the broccoli. Sweat and Sour Chicken- Kind of heavy on the breading and a bland sauce that was all sweet and just a faint background vinegar. More like candied chicken. The piano playing I wanted to like, and he seems like a nice guy but it was problematic. I am not OCD at all but it is a bit stress inducing to be there for dinner service when he is constantly shifting between songs. It puts you in the mind of \"Name that Tune\" where you can't enjoy the food because you are trying to recall the song. Worse he plays in a medley style (\"those imperial Star Wars....\") where each song gets about 60 seconds before he is on to the next. I would suggest that he just stick to classical pieces and let them go 5 or 10 minutes, so that the playing complements the meal rather than constantly distracting the dinners. I wast keen enough on Imperial to try it again. Perking Garden would probably be a better choice, but in reality in North Raleigh its probably better to just skip Chinese and go to a Thai restaurant (for instance Lemongrass) which will be an all around superior experience."], ["Jess S.", "My go-to Chinese take-out place! Never has disappointed. Prompt service, great food. The selection is relatively standard; it's nothing extraordinary or particularly unique. Whatever I have ordered though has been simply spot-on. I rarely end up actually dining in, however whenever I do, it's enjoyable. There is a live piano player which oozes classiness, and the decor has an 80's + Chinese feel to it (if you can imagine that) which makes me smile"], ["Cait H.", "Dear Fried Pork Dumplings, you had me at \"they'll take a little longer because we hand-make them to order\". Love, CaitSeriously, this app is the main reason to go to Imperial Garden. My parents usually pick this spot for a nicer sit-down Chinese experience, and they don't usually disappoint. The atmosphere is pretty standard, but the live piano music is really fun. If you have no whimsy, you'll probably hate it. But my brother and I usually find ourselves grooving to whatever Elton John hit or showtune is coming out of the piano man. (He takes requests too! A little girl gave him a dollar and he played Row, Row, Row Your Boat. Fantastic.)I always start with hot tea, but they have a beer, wine and soda menu. The wait staff usually leaves the pot of tea on the table for you to pour yourself, but if they notice your cup getting low, they'll run over and pour for you. Unnecessary, but appreciated nonetheless.The fried dumplings are a family favorite, so we always get 2 orders. It does take a while for them to come out, but it's totally worth it. The dough is chewy and crisp in all the right places, the pork is juicy, and the dipping sauce (or pour over the top sauce, depending on your mood) is salty and scalliony. I would be completely satisfied to have rice, a plate of dumplings and tea for my meal, but why stop there?Most of the entrees I've tried at Imperial have been very good; Chicken with Garlic Sauce, Mongolian Beef, Hot Shredded Beef, Mushu Pork, etc. Yes, it's Americanized Chinese fare, but hey - I like what I like. I always have fun and enjoy myself. The portions are plentiful if you feel like sharing.They have Tsingtao (beer) which my Dad loves and apparently pronounces correctly, because the staff is usually surprised and/or excited about that. One time, our waiter exclaimed that he was from the part of China where this beer is brewed (my Dad has traveled there on business) and they chatted away about the locale while the rest of us chomped on crunchy, salty noodles. The service is great; a combo of friendly and prompt.Sometimes you get a secret, surprise dessert after your meal...which I have to say, I hate. They bring individual squares of a chocolate cake-ish dessert with some kind of coffee/mousse filling. If you like coffee and chocolate, you'll probably be in free dessert heaven, but I usually take a few bites to be polite and stop there. Fortune cookies please!"], ["Penny P.", "Ordered the Hunan beef, sesame chicken, hot & sour soup, wonton soup and egg rolls... all were on point! Such good Chinese food for a good price! Great service, wonderful piano music instead of the typical Chinese CD soundtrack you'd normally hear where all added bonuses! Definitely going back for another meal!"], ["Claudia D.", "I got take-out from Imperial Garden many, many years ago and found it to be just okay.  I'm looking for a good Chinese restaurant in north Raleigh as I'm tired of driving all across the city for good Chinese food.  I saw really good reviews for Imperial Garden and was excited to see the Sunday buffet so we tried it out.  Most of the dishes were just okay or a little disappointing.  Salt and pepper shrimp - chewy and just tasted like fried shrimp; sesame chicken - small pieces of chicken swimming in a thick sauce; crab rangoon - very thick and hard; eggroll - overcooked and not much flavor; fried rice - nothing interesting; sweet and sour chicken - nothing special.  The dishes we thought were good were lo mein,  Moo Goo Gai Pan and Hunan Beef.  The mocha cake on the dessert bar was good.The wait staff and the cashier all had excellent service skills.  They were quick to supply drinks and take plates and always with a smile and with  friendliness so I really wanted to like this place.  I also liked the overall feel of the place - the lighting and the layout was more on the airy side than most Chinese restaurants.  (although there were a few too many geegaws strung around).  The best thing about the place was the piano player.  He was excellent and he played a huge variety of songs throughout the time we were there.  Lastly, and in contrast to the professionalism of the wait staff, was the kitchen help that kept the buffet stocked.  It is unappetizing to see a man wearing heavy work boots, jeans, a tank top and a backward baseball cap preparing/stocking the food.  Really?  Who wants to see hairy armpits over their food?Please keep in mind that most of my reviews are positive so I'm not trying to find every little thing to criticize.  I really hoped this restaurant would be our new go-to place for Chinese food.  And with all the good reviews on its kung pao chicken, we will return and try that dish."], ["Nancy E.", "Accidentally came here a year ago and enjoyed it.  Happened back tonight and love the atmosphere.  Great hot and sour soup!"], ["Richard B.", "The food and atmosphere earns a solid four stars.  I added the extra star for above and beyond service.  We went looking for a Chinese buffet and discovered the restaurant had gone out of business.  My wife got out her phone and suggested Imperial Garden.  When we got there, we looked inside and realized it wasn't going to open for another hour.  As we turned to walk away, the hostess came out and asked us if we wanted to eat!  We accepted and had the entire restaurant to ourselves.  The food was well made and served family style so we could share.  We will definitely go back."], ["Richard W.", "Always good food and service. Love the piano playing. They could use a makeover though with maybe new color scheme"], ["Daniel L.", "very disappointed after reading all the great reviews for this place.  The three entrees we ordered had very heavy sauces on them and the portions were pretty small compared to other joints.  I'm always on the look out for a good chinese take out restaurant in north raleigh - and this isn't one of them."], ["Liang Z.", "Small variety and quality, fresh food. I liked the egg noodle Lo main, Hunan chicken and white rice. The banana egg roll was fantastic, one of the best light dessert I ever had. We went there for the Sunday buffet brunch, good atmosphere, they even had a pianist there provide quality entertainment. Only thing disappointed me was the wonton soup, the broth was good, but the wonton was not up to par.."], ["Carol L.", "Solid Chinese restaurant in Raleigh! Waitstaff really friendly - with a piano man! He apparently takes requests, fyi.I had maybe 8 or so dishes here, all of them very tasty and flavorful. A few standouts that I'm craving right now:- seaweed battered fish: so creative! they put seaweed in the batter to give it a special kick.- peking duck: crispy perfect skin, tender cut duck meat, green onion, wraps, hoisin sauce. WIN.- green bean stir fry: I forget which meat it was cooked with (chicken? beef?) but the sauce, omg the sauce. I'd mix in a big bowl of rice into that sauce right now if I could...- seafood dishes were all solid. They pack 'em in!I'd definitely come here again for any Chinese food cravings."], ["Eric A.", "One of my favorite restaurants in Raleigh. They have a secret menu,  so ask the head chef what entrees they have that are not  listed.They were very friendly and this place is worth the visit."], ["Mike D.", "I've been going to Imperial Garden ever since Mina and Patrick Yang closed down Hang Chow on Creekside Drive back in the day.  Though a solid chinese restaurant with excellent food I have to admit I have noticed a difference in food prep the last several months. General Tso's Chicken, a long time favorite  has totally different sauce, a lighter more sweet based, unlike the fiery dark sauce of the past, scant green peppers and the chicken is prepped diferently,  Pork with Bean Sprouts and Diced Chicken with Green Peppers are still delicious but lack that hot kick that set them apart from other Asian spots except for maybe PF Changs.The dumplings are still good, but again prepared differently than in the past. One of the few places you can get Wan Fu, a delicious white table wine that goes so well wih Chinese fare. I would submit the change in management a while back has resulted in some changes in the kitchen thus preventing me from anymore than a soild three stars."], ["Tacorice D.", "Delicious gem. Great lo mein. Quality buffet for Sunday lunch with pianist. Very tasteful."], ["Geoff W.", "This is our local go-to place for Chinese for both eat-in and take-out. We have never had a bad meal, always on time for takeout. I often judge a restaurant on the quality and care they demonstrate on the basics and their Peking ravioli aka Potstickers are really tasty; they take a while, but worth it. Also the Hot 'n Sour soup is the best I've had around Raleigh and ranks with what I have had in China. Management and service very nice as well."], ["Emily E.", "Just finished eating and was a little disappointed. We ordered pork lo mein but got shrimp, chicken and pork. Weird. My husband ordered the imperial chicken which was pretty good but way too much breading. I'm not sure if we just ordered all the wrong things, but I will try this place again...only I'll order different things."], ["Michael D.", "Good food served family style. Dig the piano player. Very friendly, hospitable hostess. All around good."], ["Shannon D.", "Review after 2nd visit:We got the Mixed Vegetables Delight, Sesame Chicken, and Beef and Broccoli.  It was good but I guess Chinese seems so boring to me right now.  If you like good, typical Chinese style American food (I think \"real chinese food\" is probably very different), this is the place.  The owners are friends of my in-laws so they are there a lot.  Be sure to ask for no MSG...My review before eating there tonight:Trying them again tonight but the first time I ate there I had almost immediate lower digestive issues...they use MSG and I assumed no one does anymore so didn't ask.  I called them today and asked if they use MSG and they do so if you are sensitive to it like I am, make sure to ask them to leave it out.  I'll update this review after tonight's non-MSG meal (hopefully they'll leave it out)."], ["C R.", "Best Chinese restaurant in Raleigh hands down! It is located in a small shopping center off of Sawmill and Lead Mine in North Raleigh. My friend took me here and I am so glad he did. We went on a Friday and walked into a man playing a piano! What a great surprise! It was December so he played Christmas songs. He plays the piano Tuesday-Saturday. They have beer and wine as well as Pepsi products. I ordered the Orange chicken and it was to die for!! I cannot wait to go back. They serve their dishes family style meaning they place the main dishes in the center of the table and everyone gets their own rice dish so everyone can share. And after the meal you get a little piece of cake (at least we did and the table next to us). Excellent service and food came out fast! On Sundays they have a lunch buffet from 11:30-2:00 for $8.95 ($4.95 for kids 4-10)!!! I haven't been to it but I can't wait to try it! They also have a lunch menu and everything is under $8! Saw lots of people getting take out."], ["Rhonda T.", "Old school Chinese restaurant with a piano player. Delicious, good quality food, excellent service. Best place in Raleigh for Chinese food."]], "Red Pepper Asian": [["Josh P.", "I tried the beef chow fun, which didn't have the traditional fermented black beans, but tasted good. I also tried the sesame tofu, which looked overcooked, but tasted perfect. Also had some wonton soup, which was quite good. Overall, a very good dinner that I will have to try again. It's a bad location, but has a pleasant look and friendly waitresses. The music was a little odd in that it was the same song on a loop, but it was a mild enough song that didn't bother us."], ["M M.", "Great Asian takeout option for east Raleigh. I've gotten the takeout here a few times, and each time it has been great. Love the Thai basil with tofu, and the red curry. Friendly staff, never a problem with order accuracy or timeliness. The restaurant is very nice inside as well, but I haven't dined in to date."], ["Scee J.", "Ok if I really want some Asian food. Conveniently located right off 64 between jersey mikes and Hamricks. Take out is pretty quick and accurate. I do like that they have lunch specials on Saturday too."], ["Anne K.", "We just got back from Red Pepper and we had a great meal.  My husband enjoyed his Kung Pao Beef but says he wanted it to be a bit spicier.  Our friend had General Chen's Chicken and he says it was quite good.  I had Pan Fried Noodles - which were served on a very generous plate.  I also tried the spring rolls and they tasted fresh and yummy but were just a touch on the oily side.The service was fast and friendly and I suppose the biggest testament to the quality of the food was that all of us (even my 5-year-old son) polished off our entire plate of food.  There were no leftovers at all.  The prices were also reasonable, so no complaints there.For me, the best part is that Red Pepper Asian is less than five minutes from my house.  I'll definitely be back!--AnneK"], ["Ben F.", "This is the best Asian restaurant in Raleigh.  The hot and sour soup is a favorite start, the egg rolls are to die for, and dont miss any of the amazing entrees, my favorite is the orange chicken. Keep up the good work Red Pepper!"], ["Margaret M.", "While I haven't yet returned to the restaurant, I have discovered the owners used to own Fortune Palace which was my favorite Chinese restaurant ever. I had upgraded to 4 stores solely based on that because I have missed that restaurant."], ["Joshua W.", "I don't normally write reviews.  But on a business trip to Raleigh, my co-worker and I decided to get some Asian food and this was on the yelp list as a good place after lots of reviews.  After eating here, we will be doing something I've never done outside of hotel restaurants...we will be eating here again tomorrow.  The food was FANTASTIC!  It is easily in the top three asian restaurants I have ever eaten at (and I've been to more than a few in a few different states).  Great job to the staff and I look forward to lunch tomorrow as well."], ["Tai R.", "Pricey, but best chinese food in Raleigh. Authentic, clean restaurant,  great customer service. The thai basil beef is AMAZING! My family also loves the general chen's chicken."], ["Maxine W.", "Ever since we moved to Raleigh 7 years ago, we've been searching for some good Asian food and because we couldn't find any, we stopped eating it. ..until we came across this place!!! Simply the best we've found in the area.  The food was fresh and very good. The service was good and  our server was very helpful. The place is clean and cozy.  Definately worth the visit. This is our spot from here on."], ["Rachel T.", "Got the beef chow mien and it was delicious! Should give this place a try. Service was very nice. Also they have a 100 rating."], ["Justin P.", "Remember 2 years ago when there was this amazing place in Raleigh called Fortune Palace? Well the owners of that restaurant has now opened up a new restaurant and this is it! Because we are friends with the owners, we know that they opened up a new restaurant because everything is working and it's a lot smaller. This place is in the middle of nowhere and that's what makes the place so glorious. It's in the the middle of some run down strip mall that has maybe 4 different stores throughout the entire strip mall. Let's call it a hidden gem. The food here is just spectacular. Although it isn't \"Chinese\", the calamari is definitely their most popular, and their best appetizer. The table next to me ordered 3 orders of it! That just proves how much people like it. With a condensed menu, there are various noodle, rice, vegetable, chicken and seafood options. And that's only a little bit of the menu. They also have a bunch of different Malaysian curries, which I think are very tasty. We ordered beef wide rice noodles and it was delicious. We also ordered a shrimp and green bean dish that had a very unique black pepper sauce that was absolutely outstanding. Just as a precaution, some of the food can be pretty spicy, so if that is something you don't enjoy, then you might want to ask your server. Speaking of service everyone there is so friendly. They can start up a conversation with anyone! It is also quick and attentive. Even if this place is not really in your area, I would highly recommend going out of your way and give this place a shot!"], ["Brandon P.", "I've been looking for decent restaurants for lunch on this side of town and I'm happy to have found this gem.  I ordered the Gen Cho chicken, with wonton soup.  The soup was served in generous portion and had good flavor.  Loved the broth.  The entree was cooked perfectly.  It had just the right amount of breading on the chicken to produce a crunchy texture, yet the chicken was tender and juicy inside.  The sauce, despite being described as \"hot\" on the menu, was fairly mild, but still delicious.  The service was polite and expeditious.  I spent less than 7 bucks for a great lunch.  I will definitely return."], ["Matt R.", "Found this place accidentally but I'm glad I did. The szechuan green beans were great! It's places like this - great food, good price, simple dining - which I'll want to come back to."], ["J K.", "Great quality food and service. One of the best in Raleigh. Take out is just as fantastic and always timely. Try the pork dumplings app, pan fried...awesome! Great lunch specials, Singapore noodles and any shrimp menu item is a must try."], ["James W.", "Red Pepper just opened and it has become my favorite Chinese/Thai place in East Raleigh. It's the kind of place that, were you to move to a new city or neighborhood, you'd go to the local Chinese place and think, \"It just isn't the same as Red Pepper.\" The staff gave great service and were quick too, and the Pad Thai was spot on. Even if you don't live in East Raleigh it is worth making the trip over here."], ["Phalon L.", "This place is yummy!!! I must admit, I was skeptical because the location is in a strip mail. My guest and I arrived at lunch and when we walked in, I was surprised . The inside is small, quiet, and cosy.  We were looking over the menu and I was disappointed. The lunch menu is very small, but we asked the waitress for a full menu and that was a game changer. We order the spring rolls, soup, and three other dishes from the menu. They were all amazing!!! Can't wait to get back to this place!"], ["Kendra B.", "This restaurant serves typical Asian food, but all of it is very fresh, and not over-processed or over seasoned. Staff is kind and respectful, decor is warm and bright. Prices are very reasonable. We could eat here  every day!"], ["John K.", "The food was tasty, the serving sizes and prices reasonable, and the service was friendly. They had items for both vegetarians and meat-lovers but were willing to accomodate special requests. Definitely a cut above your typical Chinese take-out but a bit more casual than P.F. Changs, for example.  We will definitely be going back when want something quick and tasty!"], ["Quynh N.", "I love the food here!! Our family comes here once and awhile and they never disappointed. We always get the famous calamari, chicken wings for appetizer; Mongolian beef, beef chow fun, house pan fried noodles. They are all very good. I'm never afraid to try new food here because they always deliver. The restaurant is small and it's located in a very small and kind of old shopping center, but quality of their food and service is more important to me."], ["T Mac G.", "I ate here for the 1st time tonight, and it was very good. I ordered the  Combo Lo Mein(chick,shrimp&beef) it had nice big slices of tender meat. Really nice staff and close to home. I'll definitely be back!!"]], "Golden Palace": [], "Peking Garden": [["Michelle Y.", "Rarely go out for Chinese since I normally just make authentic at home.   Growing up in a chinese family run restaurant I am really picky when it comes to chinese restaurants.   But on the rare occasion we have a hankering to have chinese outside, we've always had to let the hankering subside.  But we pleasantly came upon Peking Garden which was listed on Restaurant.com.   Picked up a $25 for $2....so we figured it was worth a try.  We tried the peking duck, beef chow fun, and shrimp and lobster sauce.  The Peking duck was ok.  The duck skin wasn't crispy like it should have been. Only got 4 pancakes which was not enough for the amount of duck you got (half a duck without bone).  But my 3 year old enjoyed just eating the duck alone.The shrimp with lobster sauce was quite tasty.  Would have been better if it was a little more saucy and a little less water crest.  There was a lot of water crest and tiny pieces of carrot in the dish.  A little more sauce would be nice so it could go over  the rice more.  I am used to shrimp and lobster sauce prepared a little differently.The beef chow fun was very nice...best part of the meal.  Noodles were perfectly softened and flavorful.  Nice big chunks of beef.  Very very nice dish.Will definitely go again but most likely will try different things."], ["David P.", "Best Chinese in Raleigh."], ["David W.", "Peking Garden is an excellent restaurant with an extensive menu of Asian standards along, with the more exotic authentic fare.  The food preparation is good, service almost always top-notch, and their Sunday Dim Sum seems right off of Nathan Street, Hong Kong. My wife and I have made it a tradition to have dinner at Peking Garden before attending a film at the art house, just around the corner."], ["Jodi L.", "Would not have found this place but for Yelp, but we'll return. It strikes that perfect balance between takeout joint and snooty Asian Fusion. It's just good, authentic Chinese food."], ["Sharon C.", "We finally found an excellent Chinese restaurant in the Raleigh area.  The place was a complete surprise!  When you walk in, you are amazed - you think it's just another strip center restaurant.  Instead as you walk in you see a beautiful rock and decorative \"pond\" in which large, colorful fish are swimming.  Further back is an extremely large aquarium with your standard and colorful fish assortment.  The walls are all done in a knotty pine with brick trim.  The tables have white linen tablecloths and napkins.  You truly forget you are in a small (kind of seedy) shopping center!The service was also excellent with an attentive and knowledgeable waitress and a very friendly host at the door!The food was tasty and well prepared with fresh ingredients.  The presentation was good and  portions were ample.  The Hot and Sour Soup had a good consistency, contained many \"goodies\" such as tofu, pork, and mushrooms, and was seasoned to perfection - hot enough without being scorching.  The prices are just a little high for making this your \"neighborhood\" restaurant with prices starting at $10.95 for many entrees.  Seafood entrees ranged from around $12.95 to $14.95.  On our next visit I plan on ordering the Fried Bananas for dessert! The food was well worth the trip from Cary and worth the money but we  would probably save it for a special occasion.  I can now call NC  my home!"], ["Montie C.", "I grew up in the North Hills area and have eaten at Peking Garden many times and tonight was not good. We waited for a good 5 minutes at the door for a table, a long time for drinks and even longer for refills. There was 6 of us so we got the family style dinner and typically the egg rolls would come with the soup but they didn't the egg rolls were good but it took 10 minutes after finishing before we got our soup. The hot and sour soup was the best part of the meal. But again, even though the restaurant had all but cleared out, it took forever to get our main course! The \"rule\" is that customers can forgive a wait for food during busy times but not a wait PLUS cold overcooked food! The Thai Bangkok had a great flavor was luke warm and on the menu was marked as spicy but NOT a single bit of heat! The waitress was overwelmed and she tried but when we told her the food was cold her's and the managers excuse was \"we are very busy\" but not when the food came! Overall the atmosphere was nice and the food wasn't aweful but 2 or 3 more waitresses and better problem resolution would have helped."], ["Peter B.", "Great food, delivered...always good."]], "Beansprout Chinese Restaurant": [["Emily P.", "BeanSprout is my favorite place to get Chinese in downtown Raleigh. They won my love the week I moved back here after college with their range Chicken.Unlike most Chinese restaurants where Orange Chicken is an exceptionally sweet, sugary dish the Orange Chicken at BeenSprout is spicy and has pieces of actual orange peel in it. It's absolutely fantastic. Their sesame chicken also takes a spicy note rather than a sweet one, which is something I definitely appreciate. If you're looking for something sweet I recommend the lemon chicken. The lemon sauce comes in a bowl the same size as the soup, so you'll have plenty to cover all your food. Portions are also HUGE so either come prepared to share with a friend or  take some home for another meal."], ["Luke S.", "Beansprout is a curiosity. Outwardly it is a small dingy place with yellowing wallpaper and a mediocre dine-in atmosphere. They have the same menu as almost any Chinese place you go to (which makes you wonder what many-headed beast secretes these menu signs in such high numbers?). How is it then that their business is thriving? They don't even deliver. Because they are delicious and cheap and accommodating. Cheap lunch specials and ample dinner specials modified to taste.  When you buy especially terrible fried rice or lo mein at some places you come to notice a strange, chemically aftertaste that persists in your mouth like an unwelcome guest. Beansprout has never done this to my poor, often-abused taste buds. As a person who eats a fair amount of cheap Chinese food, this is my favorite in Raleigh bar none."], ["Sarah A.", "My worst food experience in Raleigh. Went with my family who became quite ill after eating there."]], "Golden Dragon": [], "Red Dragon Chinese Restaurant": [["Ana R.", "The Best Chinese food I have had since I moved to the triangle in 2013.  The restaurant is clean, the service superb and the food delicious and homemade"], ["Adrienne J.", "The good?  Service was good, people were very nice.The bad:  the food was terrible, and I'm not a picky eater.  Everything was either completely bland or way too salty.  The General Tso's chicken was a gelatinous, mushy mess, the veggie lo mein was tasteless, the hot and sour soup tasted like a salt lick, and the broccoli in \"garlic sauce\" was in a sauce that tasted exactly nothing like garlic.So disappointing."], ["Teri B.", "The reviews are right when they said this restaurant used to be much better.  I ate there for lunch the other day and the rice was hard (could not eat it), dumplings were bland and my daughter could not eat the chicken dish.  They did not ask why.  The service was good but, I wouldn't go back.  It's hard finding a good Chinese restaurant in the area!"], ["Bill K.", "Picked up carry out last night....Somewhat disappointed in the quality of the carry out that we have enjoyed in the past.Very bland and no pizzazz in flavor that reminds one of quality Chinese food.If we were dining there, the meals would of been sent back to kitchen.Looking to move on to another Chinese restaurant."], ["Alexa R.", "I hadn't been here for many many years, but in high school, this place was my jam! Last night I decided to get some takeout. Either they have gotten worse since I was in high school or my taste buds have changed. I ordered the same thing I always used to get, sesame chicken with fried rice and pot stickers. The pot stickers were bland and the sesame chicken was underwhelming. The fried rice was good but nothing special.All in all I was disappointed with my red dragon reunion. To top things off it was about 23 dollars. I thought that was a bit hefty for takeout but they are pretty huge portions. I would say the food is pretty average all in all and I'm not sure I'll be returning.. At least not any time soon."], ["Jennifer H.", "Having worked just up the road for the last two plus years, you would have thought that I would have discovered this place much sooner!  It was a small, but cute atmosphere, and. A pretty busy place for a Friday lunch.  I was very impressed with the  pricing!  I ordered shrimp with vegetables  and it was a generous portion at a VERY reasonable  price-under $7.00!!  I failed to mention that I also got wonton soup as part of the lunch special!  It was easy on the wallet, quick speedy service, and  a flavorful meal! Keep up the amazing food and service, I will be back!"], ["Seinna M.", "Well, it's  ok, not my favorite place but it's close to home and it's better than other near by places. I found it a bit expensive for take out food,  dinner for two $39 Nothing memorable about their food and the LoMein noodles were overcooked."], ["D M.", "I can't even describe how bad I feel to write this review.  I'm hoping that the owners of this establishment will see this and get there act together. The dumplings fall apart as soon as you stick your fork in them :(The sesame chicken tastes like its ketchup chicken and the pork fried rice ( usually is good) but that day it tasted old! This place was amazing about 2 years ago. Now, not so much!The last time I was there, I barely touched my food.... They didn't even ask me if I liked it. I had to send something back once before, so I didn't want to do it again. I won't be dinning at this place again!I will have to drive 25 min to imperial garden, ( In north Raleigh) rather then 5 min to this place."], ["Reiko H.", "The reviews for Red Dragon are all over the place.  I ate lunch there yesterday, and ordered the shrimp Lo Mein with the crab ragoons.  Although the portion was kind of small, the food was tasty.  I had a good waitress with no complaints.  I went at the tail end of lunch, so they ran out of fried rice.  Overall Ok food if I am in the area, but I wouldn't make a special trip to eat there."], ["Mark W.", "There seem to be a lot of negative reviews for this place, so I figured I'd stick up for it a bit. I've lived in Five Points for a little over a year, and usually find myself choosing between Red Dragon and Peace China if I'm in the mood for some traditional American-Chinese food. I've come in person to dine-in several times, and ordered take-out several times as well, including in snow and rain, without having any of the bad experiences other people have had on here. My favorite dish here is the Moo Shu Pork, and I especially enjoy ordering it while I'm dining in. I'm not sure if all of the wait staff do this, but there's an older man who assembles the wraps in front of you when he brings out the dish, and he does an amazing job. You end up with four perfectly wrapped pancakes, with just the right amount of both sauce and filling. I haven't ordered another dish in person since realizing that they do this here. I'm not crazy about the mushrooms they use, but the other ingredients are all good and the pork has no fat. I've ordered other dishes for takeout, and it's worth mentioning that they seem to cook the ingredients separately and then combine them in the final dish. For takeout, this means if you order something like sesame chicken, all of the broccoli is at the bottom, and all of the chicken is at the top. If you don't empty out the whole carton, you may not even realize that there's broccoli in the dish until you go for leftovers. On top of that, the service has been consistently attentive and fast. I've never had an empty water glass while dining in, and the food has been ready when I've come to pick up an order. I wouldn't come here expecting much small talk, but they're very efficient and good at doing their jobs. Generally, I'm between four and five stars for Red Dragon, as long as you appreciate it for what it is - good, fast, American-Chinese food. The dinner prices are a little high, but nothing in Five Points is cheap, so it seems fair to me."], ["Nina P.", "Hidden Gem Chinese food in Raleigh, close to Crabtree Valley Mall and the perfect spot to enjoy a delicious lunch or dinner with a special client or your loved ones! My Fav is the Mongolian beef...service is like eating dinner at your parents house... amazing spot!"], ["Lindy P.", "It takes a LOT to write a 1-star review.... in fact, I've only written 1 in 102 reviews so far.  But the Red Dragon in the 5 Points neighborhood is just horrible.  From service, to food quality, to atmosphere, to taste... it's just THAT bad.It was a rainy Sunday night and we were searching for take-out Chinese food that's tasty and not too expensive.  Naturally, I hopped on Yelp and searched the downtown Raleigh area for take-out chinese.  Sara is allergic to ginger, and I know that's tough to find at an Asian restaurant.  After reading some decent reviews at Red Dragon, I gave them a call.  The lady that answered the phone yelled at me to be quiet because she was talking to a customer in person, which was extremely rude.... honestly, I'm not sure why I didn't hang up on her.  But she told me they could make the sesame chicken without ginger, so that was a plus.  I ordered it with fried rice, and I also ordered General Tso chicken with fried rice.  She took my phone number and said it'd be 10 minutes and hung up without telling me the total.  When I arrived to the restaurant at the corner of Oberlin & Fairview, it looks cute from the outside & is right beside Mandolin (upscale restaurant).  When you walk in Red Dragon, it smells weird and there's a few tables & booths, but only 2 people were eating.  There are no signs to direct you to the take-out window down the hallway.  I waited 5 minutes for the lady to acknowledge me, and she then took about 10 minutes to get the food together (it took me 15 minutes to get there, so I'm at 30 minutes when she said it'd be ready in 10).  She threw the boxes in a bag & told me it was $33.... and I about died!  It's a cheap looking Chinese restaurant, and 2 entrees for $33 seems a bit high. We made it home and opened the bag to find 3 boxes.  I ordered 2 entrees and 2 fried rice, so I expected 4 boxes.  I called back and told her we're missing an order of fried rice, and she yelled at me and told me \"You share, You share\".  Okkaaaayyyy.... well the rice was super dry and the chicken was extremely questionable. The \"sesame chicken\" was flat little pieces of \"chicken\" drenched in sweet & sour sauce with a few sesame seeds (I'm not sure it was really chicken). The general tso chicken tasted like it had been microwaved from last week.  Nothing fresh or tasty about this place, and the service is AWFUL.  It'd be one thing if it was cheap, but it's more expensive than P.F.Chang!!  I guess I'll have to go back to 5-star and give it another chance, because Red Dragon definitely isn't the place to go for good Chinese food."], ["Amy L.", "I had heard wonderful things about Red Dragon from Raleigh natives saying it was the best Chinese around. While the fried rice was on point, the sweet and sour chicken was disappointing. Instead of the standard sweet and sour sauce, they used some hot pink concoction that probably gave me a cavity. Needless to say I'll be ordering something else if I return to Red Dragon.The service was average, but the food was a bit expensive (over $20) for a lunch date at your run of the mill Chinese restaurant."], ["Brenda V.", "We went to Red Dragon tonight for the first time and loved it. The wait staff was very attentive and the service was very fast. We ordered the shrimp with lobster sauce and the mixed vegetables platter and thoroughly enjoyed our dinners. Everything tasted amazing and even the crab rangoon appetizer was delicious. It's located in the quaint five points area and is a good change of pace from the downtown restaurants. We plan on going again : )"], ["Tiffany B.", "Service was very good and prompt. We had such high hopes for this place but again, like most places in the South, everything just has that underlying sugary taste in everything. Chicken with vegetables should not be sweet. Nor should Mongolian Beef. Yuck. Such promise but lay off the sugar!"], ["Stephanie D.", "I'm not sure what all the negative reviews are about on here. I've never had anything other than awesome service at Red Dragon. I ordered crab ragoon and twice cooked pork. It was ready in 10 minutes,just like they said it would be. If you order takeout there is no sign directing you to the window, which is a little weird. However, the food I ordered was awesome. I will say that's all I've ever order, but every friend that has been there loves it as well."], ["Katie S.", "Paper wrap chicken & shrimp toast are awesome appetizers! Good authentic Chinese food. Family owned. Friendly"], ["Patrick W.", "Red Dragon is one of my favorites spots in Raleigh.  It is a tiny hole in the wall kind of place, but where the waiters wear formal outfits with bowties.  There are probably only 15 tables in the whole restaurant.  This is one of those places where I just go for one thing because it's so good.  That is their Sesame Chicken. Now, I know what you're thinking.  Sesame chicken is the most Americanized, cliche of Chinese dishes.  But this is not your run-of the mill, sticky brown hunks of fried chicken.  Instead it is cut in thing strips and slices and then lightly fried.  The sauce is a tomato-based sauce with just right amount of sweetness (not super-sugary like many sesame chickens are).  It is absolutely addictive.I would say that this is where Red Dragon excels--they have good Chinese food that is not going to scare off your typical American, but is different enough from the norm to delight."], ["Lindsay S.", "I've visited Red Dragon twice in the past month and I must say that I actually really like it.  It's located in a tiny little restaurant tucked away on the corner of Oberlin and Fairview near Cameron Village.  If you're not careful, you'll miss it because there's no sign outside, but there is parking behind it.  My friends and I visited a few weeks ago for some dinner.  We shared a spring roll as well as the Pot Stickers app.  The Pot Stickers app comes with 6 steamed dumpling pot stickers.  They were steamed just the right amount with a really nice sauce to dip them in.  Pretty good!  As for our entrees we shared the Orange Beef, off the specials section, and Chicken Fried Rice.  The Orange beef was chunks of sauteed beef in a spicy orange sauce and they mean it when they tell you the beef is hard to cut and chew!  I gave up after a while because of the effort, but the flavor was really good and the spice was just right.  The Chicken Fried rice was pretty standard except the vegetables seemed far fresher than most would get with that dish.  The portions were so large that we were able to split them between the three of us.  Last week I went to pick up some takeout and going the distance was worth the trek down there because it's much better than any other I've found in the triangle.  I choose to try the Happy Family special.  It consisted of beef, chicken, and shrimp with mixed vegetables.  Again, I was most impressed with the fairly fresh vegetables.  The portion size was enough to stretch two meals and pretty good.  My only complaint about the Happy Family dish is that it was lacking in flavor.  Perhaps having some sort of sauce would make it more appealing because I probably won't order it again.  I think the food is priced appropriately and when I've been in the service was very good.  We felt well taken-care of and that they attended to all our needs.  Glasses always full and friendly greetings.  Now, if only it was a little closer to where I live...still, I may pop back in another time.  Really well done Red Dragon!"], ["Chutikan H.", "I like their food there. it is not so plain like other Chinese places.  It is small cute little place."]], "Kome Asian Cuisine": [], "Pearl Chinese Restaurant": [["Matthew G.", "Hey you guys have to clean that fishtank... Doesn't really add to the cleanliness of your establishment."], ["John M.", "Pearl is a pretty good take-out Chinese restaurant if you're in the southwest area of Raleigh. I've been coming here on and off for years whenever I'm in the mood for Chinese. I'm not a big Chinese food patronizer, so I can't speak to how it compares to others. But, I wouldn't travel from one side of town to eat Chinese here, and I wouldn't leave this area to get take-out Chinese anywhere else. I usually order General TSO chicken when I go there and it's good."], ["Jonathan C.", "If you're looking for good Chinese food, good prices, and quick service -- Pearl Chinese is indeed a hidden pearl in Raleigh. I live across the street, so being able to walk over to grab take-out whenever the mood strikes is honestly one of the top 10 reasons I love the location of my house. For me, my order is usually roasted pork with broccoli and fried rice. Always a winner. My hubby gets the sweet and sour chicken -- another winner every time. The lunch combo prices are excellent as well.I've been a customer for, gosh, probably more than 10 years by now. Man, that suddenly made me feel old -- haha. But seriously, if you are in the mood for Chinese take-out: This is the place for you!"], ["Rebecca K.", "Pretty standard Chinese takeout place. I got the Shanghai chow nian gao, veggie lo mein, and general tso chicken. The nian gao was quite good for an American Chinese place, and the general tso chicken was nice and crispy. I wasn't drunk so maybe that's why I thought it was just ok, but it was adequate hangover food and I'd order from there again!"], ["Olivia C.", "this place is great!! hadn't been here in 5 years since I was last living in Raleigh for college, but lemme tell ya it hasn't changed a bit! still amazing food and great service! the only thing I'm mad about is that it's taken me 5 years to relocate the shinning light known as Pearl!"], ["Julia H.", "When I think 'Chinese takeout' at mealtime, I'm not thinking delicate, artfully prepared, skillfully plated delicacies - I'm thinking something that knows a deep fryer, the ubiquitous sticky brown sauce, and the inclusion of broccoli. Junk food, Chinese style. I stopped in to Pearl this weekend to sate the craving, and was not disappointed. Sure, the interior is nothing to delight the senses, but I'm not there to eat the decor, so unless you're eating in (like the satisfied-looking group of Asian college kids there when I arrived) it shouldn't be an issue; don't let it make you doubt the food! Service was quick and the young lady behind the counter was helpful in answering the few questions I had; there were numerous handwritten menu additions on sheets of paper decorating the counter offering all manner of interesting specialties far beyond the typical General Deep Fried's Sodi-yum standards, which I plan to investigate at some point as well.The Szechuan tofu I had was simple and to the point - tender-crisp fried tofu, spicy sauce (that actually had spice!), vegetables including my beloved broccoli, steamed rice. The vegetables suffered a little from being enclosed in the very-heat-retaining container during the drive from Pearl to my dining destination, but were still unlimp enough to indicate that they had been nicely cooked prior to their impromptu extra steaming. The tofu wasn't tough, with just enough of a crisp bite to remind you of the magic that is frying, and either MSG is not used or I'm losing my pretty nasty reaction to it - or the precautionary sweetened beverage I knocked back afterward did the trick better than usual (tip for others with MSG sensitivity: rapidly drinking a sweet & caffeinated drink tends to cut back on the reaction for me).So it isn't fine dining laden with culinary wonders in a lush, elegant setting. Enjoy it for what it is, and give it a try! Remember - don't fear the strip malls, for they tend to hide some real gems."], ["Will W.", "The food is ok.  They charged my debit card ten dollars Extra, and no one had a clue why. And did the samething to a friend. It just makes me wonder how many people they have done this to and got away with it. I will not be returning.  I would tell everyone check your bank statements make sure you aren't being overcharged."], ["Alicia X.", "Good place for a cheap quick meal. I don't expect much for takeout food. This is definitely much higher than the average. I think this is better than most other Chinese takeout, maybe the best around NCSU. A plus is it opens till 11 pm. Always a good choice for late dinner."], ["M L.", "Pearl Chinese restaurant is a hidden gem that is placed in a somewhat unappealing shopping center on Avent Ferry Rd between a laundromat and a Japanese restaurant. The restaurant has no frills and the floors look like they have been there since the construction of the building. However, I am giving this restaurant 5 stars based solely on the food alone. Pearl Chinese is my go-to Chinese restaurant whenever I'm craving Chinese food.Pearl Chinese is the first Chinese restaurant that offers both conventional Americanized Chinese food and authentic Chinese cuisine. If you want to get the best experience here, definitely order something off the authentic menu; I promise you won't be disappointed. They have a huge menu with a lot of variety of dishes to choose from, and inside the restaurant, there are even more food options that aren't listed in the take-out menu. My favorite, must-try dishes here are definitely the Shanghai Chow Nian Gao which is a platter of thickly sliced rice noodles with green peas, carrots, beef, shrimp, and chicken and the boneless spare ribs. Both are amazing dishes. Also, the food portions are huge and are very reasonably priced for what you get."], ["Brett L.", "Was initially hesitant from ordering from here as it looks dirty from the outside (the whole complex kind of does), but it's got good food, and it's got great prices.  Singapore Mei Fun - highly recommend it.  Don't be turned off by the appearance, it's good affordable food.  I get take-out there about once a week, and have been for the past 9 months."], ["Lauren R.", "I initially wanted to give this place three stars, but the tofu I ordered was cooked to perfection and so delicious that it definitely deserves four.  My initial disappointment was that my order had almost no vegetables!!Back up--craving some good Chinese takeout, I browsed Yelp, several restaurants' rather primitive websites, the local food blogs, etc. before deciding on Pearl (partly because it was after 10pm and they're luckily open til 10:45 on weeknights).  I opted for the Kung Pao Tofu.  I absolutely love well-cooked tofu and it's something I can't make well on my own, so I jump at the chance to get it at a restaurant.  It was ready really fast.  For around $7.50 I got a combo with an egg roll, white rice, and the tofu.  The egg roll wasn't very good--actually it was pretty bad.  It didn't taste fresh and I wasn't sure what the filling was.  The white rice was white rice and the fortune cookie was a fortune cookie.  The tofu, however, was crispy goodness.  It was lightly fried and not too oily.  It was cooked perfectly and held up in the container full of steam and in my refrigerator to be used as leftovers (it was still delicious after I microwaved it the next day).  I was disappointed in the rest of the dish, however.  I ordered kung pao tofu expecting a spicy dish full of chilies and vegetables.  There were literally two pieces of broccoli in my dish (two--I counted and fished around to double check) and no other vegetables (no red peppers, not even any chilies).  And this is rare for me to say in the realm of take-out Chinese, but there wasn't enough sauce to coat the rice, tofu, and mix it together..  Also, the sauce was thicker/stickier and didn't have enough spice.  The heat element was completely issing.Overall, I'm conflicted between the five-star tofu and the lackluster rest of the experience.  Prices are reasonable and portions are good (definitely 2-3 meals for me)."], ["Chris F.", "The interior is almost endearingly run-down, but the value is unbeatable. As other reviews have noted, the chow nian gao is a big draw here (sliced rice cake stir-fried with meat and veggies). The small chicken chow nian gao is sufficient for me and is $5.25 if I'm remembering correctly (no menu online unfortunately). The large is about $7 and makes two meals for me. Every so often, I really crave this chewy rice goodness.For your ameri-chinese needs, the general tso's is pretty decent and also a great value."], ["Rachael H.", "I ordered take-out from here last night. I placed my order on the website and then paid upon pick-up a few minutes later. The online ordering system is rudimentary, but convenient. My order was ready within minutes and they sent me an email when it was ready. I gave my phone number when I went to pick up the food.We had the chow nian gao per the reviews here and it was delicious. The noodles are a thick rice noodles; the sauce is sticky and savory, but not hot; veggies are carrots, snow peas, bamboo shoots, mushrooms. We also got the fried pork buns and the crab rangoons. They are offered in small and large sizes and for two people, the small is enough unless you want leftovers for 2 the next day. Overall, this was an inexpensive dinner for two that was convenient and tasty. I'll definitely return."], ["Ryu K.", "I order take-out from this place quite often. Their food tastes legit, prices are very fair, and their service is awesome."], ["Chris S.", "I'm giving it five stars because of what I'm expecting from this place: cheap, Americanized, Chinese food. They have great deals for lunch."], ["R Q.", "My husband and I have been coming here for years and it's always a great value.  They serve plenty of meat with entrees, but skimp on the broccoli, which we find amusing. (When we order Beef 'n Broccoli, we order a side of steamed broccoli, to mix in). I also enjoy the fried tofu. Quality is consistent and everything is cooked well - no limp vegetables, everything tastes fresh, shrimp is deveined, squid not rubbery, etc.Most importantly for us, they are open late, for Raleigh restaurants! Pearl is a very good no-frills Chinese takeout-place. Our faves: Sesame Chicken, Orange Beef and Shanghai Nian Gao."], ["Jane Y.", "Being chinese, I'm not usually the kind who'd frequent \"fast food/american\" chinese restaurants. I was hesistent to come here, but due to a chinese food craving that led me to desperation, I came here for lunch. BOY am I glad for that moment of weakness! This place rocks! I didn't get the american chiense food, but I did get the chow he fun (which is stirfried flat rice noodles) with chicken, beef, pork and veggies.It was SO good and not very greasy like many other chinese places that tries to do chow he fun. The small was enough for a meal and a half and only $6.50! I'm actually going to go there today again because I'm craving it.This place is great! definitely worth a try."], ["Meagan G.", "Better than average Chinese takeout. I lucked out when I moved to the area and friends recommended Pearl. It's always a challenge to find your go-to takeout places when you move. Pearl has a lot of specials and unique offerings, but I tend to stick with what I like when I find it. Their tofu dishes are great, just crisp enough, with plenty of flavor.  Staff is friendly and efficient. A pick-up order always takes 10 minutes, no matter how busy they are. As an added bonus, they have a frequent customer card, so you can earn $10 off."], ["Julia B.", "Pearl is good for that quick fix when you need chinese takeout. The food tends to be less greasy than other options in the area, and the price is right. Pleasantly surprised by the quality of the dumplings. Wrappers are a little thick for my taste, but the filling is better than at most comparable establishments.While not my favorite Asian dining establishments, Pearl's menu should be in a kitchen drawer for those nights where you just want some Chinese takeout."], ["Ann H.", "A decent place with decent food. No gourmet dining here, but plain plentiful food. Pearl has a ginormous take out or dine- in selection at prices far more reasonable than expected. A main course with rice and a drink for way less than ten bucks. Add an egg roll or 2 and you'll still be under ten for lunch. The inside of Pearl is utilitarian. Some basic tables and chairs with a floor that looks like it's been there since the dawn of time. It's one of the first Chinese restaurants I've been in where the cash register prints your order in Chinese characters. Very cool. Although their menu offers Szechwan and Hunan dishes and labels them as hot, they really aren't, especially if you're preconditioned to spicy hot food. Pearl is okay. Basic. Inexpensive. Filling. Friendly staff. If that's your criteria, you can't go wrong here. Otherwise, there are places with better tasting food in the area."]], "Jade Garden Chinese Restaurant": [], "Peace China": [["Philip J.", "Was eating the generals chicken, bit down and chewed on chicken bone twice. The second piece that had bone in it was large enough that it cracked a tooth filling. I told the guy working the cash register what happened & showed him my plate, he looked away & said \"I'm sorry\". I have an appointment at the dentist tomorrow thanks to Peace China's General's Chicken..."], ["Amelia R.", "What we ordered: broccoli chicken, crab Rangoon, plain lo mein, sweet and sour chicken, and general tsao's chicken. Everything was delicious. Only complaint was the sweet and sour sauce was more spicy than sweet or sour. Overall good choice for a good price."], ["Molly K.", "Just ordered a broccoli beef.  It used to be big enough to share.  Very small (large portion). When I asked for a small chicken, they said they never serve for dinner.  I have ordered small portions since they opened.  There is a blunt rudeness when I questioned this.  This order ( I tried to take picture to upload has a bit of broccoli and some beef.  Very small."], ["Meredith D.", "What a solid place to take-out food. Bf and I have ordered out here twice (about 6 months apart), the second being last night, and had the same thing both times. Still deliciously satisfying!It's hard to beat a meal for two for less than $20 with leftovers.We get: Wonton soup, shrimp lo mein (dinner combo comes with fried rice - we like it with chicken - and an egg roll), and red curry with chicken and udon noodles.What is one thing they could do to fulfill our greatest wish for Peace China? Deliver."], ["Julia H.", "What's that, Peace China? You already offer some of the freshest takeout in town plus a side of environmental consciousness, and now you've upped your game by adding more vegetarian options to the lunch menu? Five stars, my friend."], ["Tim D.", "The Thai Basil Chicken is great! You have a choice of steamed white rice or brown rice with entrées. I've become a big fan of spring rolls with spicy chilli dipping sauce. Very cool & hip decor. One of my favorite places to eat."], ["Amanda M.", "I would NEVER go back. Crab rangoons - Fake Crab - Fried Rice - Not fried at all. Save yourself and go 2 miles away to Red Dragon or Hillsborough Street! NEVER AGAIN!"], ["Laura H.", "I loved this place. Went because there was a groupon and I didn't feel like cooking. Interior is basic and clean. Small booths and tables to sit at. Medium sized menu. I got the shrimp noodles and himself had a tofu dish. We also got spring rolls. The rolls were nothing exciting, basic, but not a huge amount of flavor. The main dish was delicious. Good portion size, fresh and not too sticky and heavy luke Chinese food can be. Friendly staff and quick service. I will definitely be back!"], ["KK W.", "For YEARS I've been saying \"if only Chinese takeout places would get better plastic forks that didn't collapse when you tried to stab your food, or plates made of cheap styrofoam that melt under freshly fried sesame chicken.  Or spend the money and effort to keep the bathrooms and the restaurant clean.  I would gladly pay more per entree if they just invested a little in these niceties instead of skimping on everything to keep the prices down!\"  Well Peace China is that place!  It's a little more than other Chinese takeout places but it has these amenities.  And the food is good, it's your standard Chinese takeout, which I love, so I'm a fan.  OH, and don't forget that it's the only Chinese takeout place I know of that serves BROWN RICE.  If you order brown rice at other places, you get white rice soaked in soy sauce or something.  Yuk!  Yay Peace China"], ["Callie L.", "Easily my favorite spot to get Chinese food!! Always fresh, always delicious. And I swear they found my iPod from high school and whenever I eat in I always start to feel reeeal nostalgic. Sesame chicken, general tso's and dumplings. All you need."], ["Greg C.", "We ordered two dishes. Chicken Lo Mein was ok except the chicken is very poor quality - maybe frozen or old, or both. General Tso's Chicken was too bready and in overly sweet sticky sauce.  Fried dumplings were blah with some ground pork filling that tasted mealy and bland. Not much better than the other poor quality hole in the wall Chinese food places in this area."], ["Mike S.", "the food is inexpensive and made to order.  It is also tastefully decorated and in a great location.  only problem is that I've been there 4 times, and every time the food has just not tasted very good.  if you want inexpensive, hot food in a great location served in a fancy restaurant three doors down from O2 fitness that tastes like dogfood, this is your spot.  The Pad Thai chicken I had today came with flattened, noodle-shaped chicken.  my guess is it was boiled and canned.  but still, for $8.50, i could have done worse."], ["Justin G.", "This place is everything fast food Chinese places should be. Its very clean and the food isn't as greasy as most Chinese take-out. The staff is friendly and you have a million choices of condiments. My only recommendation is to add Sesame Chicken to the menu."], ["Ron W.", "Every now and then, I get a craving for the food of my people which brought me over to Peace China in Seaboard.  While the Seaboard area is not the most obvious choice for lunch, they've got some nice options there with J. Betskis, 18 Seaboard and now Peace China!  The place is really simple: open kitchen, formica tables and inexpensive Chinese food.  Lunch specials are $5.25, throw in an egg roll for a combo lunch and you're looking at about $7.  Menu choices are standard Chinese-american fare: General Tso's, chicken in garlic sauce, beef and broccoli, etc.  Nothing too exciting but fine for what I needed today.  I ordered up a couple of my faves to go: shrimp with lobster sauce and a garlic chicken.  Food portions are good and everything tasted pretty good.  One thing different about the garlic chicken was that Peace China uses quite a few veggies in it: mushrooms, peppers, onion, cabbage, broccoli and zucchini!  Much better than the typical soggy stuff you get.  Service was fine but a bit slower than expected, at least you know the food is fresh.  I'm sure I'll be back here sometime soon because while Peace China isn't the best Chinese food, it's tasty and convenient which is good enough if you live in the hood!"], ["Ander W.", "This is a good place and a deal.  We've eaten there twice.  Each time we got an appetizer and two dishes for about $15.  Overall we liked our dishes. We did stray from the Chinese choices and get Pad Thai once.  That was disappointing. The other dishes had had good flavor. Our only complaints are that the food marked as spicy is barely spicy and it would be nice for the food to have more sauce to spread some on the rice.Also, the fortune cookies are self serve so don't forget to put them in your bag if you get takeout."], ["Justin W.", "I've updated this review to five stars, not because it's the best restaurant in town, but for what it offers, it's the best in its class.Cheap, fast, convenient Chinese take-out. Even when it is dead slow, the food is still consistent, which is hard to come by at most Chinese take-out restaurants. The dining area is clean, they offer a variety of bottled beer (Tsingtao is a Chinese lager...also have Carolina Pale Ale, Hoegarden, Asahi which is a Japanese beer).The most impressive thing about this place is actually the people behind the counter. The service is great! The manager Wei (at least I believe he is), is a great guy. He always greets you with a smile, asks you how your day was, and if you're up for it, engages in conversation during the slower times. I've noticed many customers speak with Wei as if they've known eachother for years...you just don't see that anymore. It was very refreshing. I ordered a lunch plate and while I waited he offered me water. He also asked me if I would use delivery if they offered it -- I responded with an enthusiastic ABSOLUTELY, and he thanked me for my input.For what it is, Peace China serves food priced right and offers phenomenal customer service."], ["Renee S.", "At the intersection of hunger, pure laziness, and overall blahdom - all I wanted was cheap Americanized-Chinese food, but I didn't want to put in effort beyond that of my computer to get it. Much to my dismay and disappointment, many of the cheap Chinese places near downtown Raleigh don't have websites or online menus making my lazy quest to find reliable cheap Chinese food rather difficult. We found Peace China's website. The website is well built and looks rather professional with colorful, clear pictures. Done and done. Called and placed an order for pickup for two $7.25 Dinner Specials: Cashew Chicken with Pork Fried Rice and Mongolian Chicken with chicken fried rice that came with two fried eggrolls. Peace Chinese is tucked away in the back of Seaboard Station. The outside looks nice and the inside is your typical cheap Chinese food place, but very clean. The food was ready, it took 30 seconds to pay - all in all, quick and easy pickup transaction.  But I'm still on the quest for a quick and easy, reliable cheap Chinese food place - because of the food at Peace China, not good. And they were doing so well...The eggrolls  were very bready. First the fried outer shell, then another bready inner thick layer and maybe one or two shreds of cabbage, one carrot and some microscopic bits of mystery meat. The chicken pieces in my chicken fried rice were very generous chunks of chicken, they even had grill marks, but they were eerie pale and lacked flavor of any type. It reminded me of boiled chicken but they could have at least have sprinkled some pepper on it, maybe some soy sauce, something. The cashew chicken had more chunks of zucchini (zucchini in cashew chicken?!) than chicken and the Mongolian beef was grade D chewy beef drowned in a thick beef sauce. At least it had a spicy kick though..."], ["Warren H.", "The only worse Chinese food that I ever ate came from a grocery store frozen food section.  Kung Pao Chicken is my standard order at a new restaurant.  I judge Chinese restaurants on this selection, and if good, I come back for other menu choices.  I will not  be back, ever.  I asked for the manager, he never arrived at our table.  The chicken was stringy, chewy, and tasteless, like frozen and then overcooked.  No taste to the sauce.  Not one thing positive to write about this place except, well,  I saw no rats, it was not on fire, no robbery while I was there, and so far I don't think that I was poisoned.   But the cook needs to go, far away.  The owner should be ashamed of the quality, I mean lack of, of the food, which was also cold by the time I was almost finished.  I could not finish the food, it felt like a forced feeding because I was very hungry, but I should have gone to the grocery store next to it and bought the makings of a sandwich.  I wish I did not have to give even one star."], ["Brandi C.", "Very good for fast food takeout. It's not fancy, but it's fresh and not too greasy. Price is awesome for the quality. Several vegetarian items."], ["Carter E.", "Great experience!  First time here but the prices are awesome and the quality is excellent.  Came here on Christmas Day and not sure what to expect but was pleasantly surprised.  They even have chicken nuggets for the kids.  Highly recommend!"]], "Hibachi Grill and Supreme Buffet": [["Katrina P.", "One of the most delicious cheapest restaurant in Raleigh. they have verity of Chinese and Japanese food. there is a good sushi bar with enough variety. the workers are friendly,"], ["L H.", "The food was okay and the service was non English speaking of course, but what kept me from ever coming back a couple years ago was a very stupid note on the napkin holders at every table saying that you'll be charged 30% for wasteful food habits.  There was no explanation other than it's the manager's discretion as to what constitutes too much saying of food."], ["Danny R.", "I am tolerant and can eat just about anything. But I was disappointed with everything I put into my mouth with the exception of the fruit. Nothing tasted right and in many cases, looked right. The food was either overcooked, too salty or too greasy. The signs that were everywhere about the restaurant's not assuming responsibility for under-cooked foods should have been a warning sign. Unfortunately, this was a place my daughter wanted to try on a daddy-daughter dinner night out, Initially, I thought she would appreciate the variety and trying some new things. We found ourselves spitting food into napkins and leaving disgusted and unsatisfied, $23 later. DO NOT EAT AT THIS RESTAURANT."], ["Tasha J.", "Start with the good...nice selection and spacious.Now the truth...we found bugs in our food! No way to sugar coat that one! No, they were not part of the large food selection. When the waitress called the manager to the table she instantly started picking the apart and trying to convince me that I was delusional. You wonder if I made a scene...no not at all!! Too classy and soft spoken!!  Plus, I have Yelp! Guess what before she got to the last bug that was \"just a seed or something\" I did get a picture for you guys!! All in all we didn't get very far 3 plates, 3 people and a few bugs spoiled the dinner!"], ["Georgina H.", "Would definitely rate this lower if possible.  Sesame chicken was super inconsistent,  one piece was fried and not that horrible but it was followed by something really squishy and probably not chicken. Tubs of raw seafood were sitting in the floor. The food was cold and lacked flavor. They had more American foods than Asian. Just really awful, I try to find something good about everything but not this time."], ["C C.", "I love buffets and have been to many in the area and while traveling across the US.  This is the worst one we have been to.  While the hibachi was ok, there wasn't anything else other than the ice cream that really tasted good.  We aren't super picky and tried a lot of things, sushi, meats, veggies, fried foods, but we both stopped eating midway through the meal and just looked at each other and realized we were both feeling grossed out. Cleanliness isn't great either and the place was mobbed around 2pm on a Sunday, but none of that would have killed us if the food had tasted good.  This is the first time we have struck a buffet off our list ever.  :("], ["Robert L.", "Had been very disappointed here years ago and stopped coming.After reviewing the Wake County Restaurant Inspections, I decided to give them another try.Food was good including hibachi and desserts. Service was fine.Regarding the signs about wasting food one yelper mentioned, the same thought could have been worded in a much more customer-oriented way. Obviously, a guest being charged this could easily refuse to pay it. There was a similarly misworded sign about sharing with non-eating members of a party. A bit of training in business English would really improve guest impressions.There are coupons available in mailed magazines and the web.Decent place worth a try."], ["Brian Z.", "Large selection of extremely greasy and bland food. It was busy so we had high hopes but after about half a plate we wondered why so many people were actually eating there.  Most food has no taste at all.  Wont be back!"], ["Eric F.", "My son's favorite restaurant. Huge selection of food. Most of the time everything is good but sometimes its not. Atmosphere, service and staff are good. It's a very busy place and lots of people like it."], ["Jeff H.", "I hope you like fried food! The sushi and salad bar were about the only things not deep fried. The restaurant was not very clean and the floor was sticky. The Hibachi grill attendant let my food burn, and ignored the lady in front of me when she asked him to remove her steak because it was cooked more than she asked for. The fried food was soft and not crisp at all. Who wants a soggy egg roll? I would recommend skipping this buffet."], ["Robb E.", "Getting worse. Used to be really good but the food is just so greasy now. It's time to take a look at the quality."], ["Josh P.", "Good hibachi, Chinese dishes, and sushi beyond the normal Cali roll. Nothing exceptional, but it was all tasty. Service is attentive and quick. Had a great visit."], ["Anthony L.", "Standard buffet items. Everything I tried was very good. I especially enjoyed the hibachi grill. I realize that when you go to a buffet, or any self serve style restaurant, you're  sort of rolling the dice hygiene-wise. But my family and I watched two small children helping themselves to ice cream by scooping it out with spoons and then using their fingers to push the ice cream into their bowls. One little guy liked what he had been licking off of his fingers so much that he decided to lick the spoon clean before dropping it back into the cookies and cream. I grabbed the first employee I could find and let her know what had happened. She said okay, picked up the spoon, replaced with a new one and walked away. Leaving everyone else to enjoy cookies and cream and little boy saliva. This happened as we were leaving, so I told another employee by the door, including the fact that the first lady's response was less than spectacular. This woman didn't even make a move to do anything. Just looked at me like I was the one being ridiculous. Needless to say, first and last trip."], ["Catherine F.", "We ate here today and I must say we were very disappointed. We are seafood lovers and they typically have seafood that tastes great. This time however, the crabs had a terrible odor and left a horrible taste. I literally had to eat other foods to cleanse my pallet. This was tainted seafood. We I also tried the clams and they were very slimy. The sIime was thick and gooey. I felt as though they were not safe to eat either.  We left after 10 minutes. I told the hostess and she admitted that they had several other complaints pertaining to the crab.  She literally admitted the crabs were bad. I was speechless. She still did not care at all. Later I overheard them discussing the food cost as if they were willing to risk the health of their customers rather than sacrifice the loss of the food. We explained that we are repeat customers. She said sorry- we have had other people walk out today. We will not return ever. The food use to be good but not now. The sanitation grade is also very low. Please do not waste your time here. We literally had to come home and prepare safe food."], ["Hannah K.", "When I first moved here, my mom had come with me and we were itching for some Asian food! So when I found out there was a Chinese food buffet, I said Mom let's go!! WE were both surprised that they had similar selections like they do back home (CA). We both definitely enjoyed our fill of asian food buffet goodness! However my Mom and I are both very sensitive to MSG. AFter our meal we were both struck and the effects of the MSG were horrible! Both my mom and I were suffering!! The food is delicious because there is MSG in it! I get it, who doesn't use MSG now a days? But I think it might a little lethal the amount that they use! I was surprised to find sushi here, although I didn't truly trust it, but what I did get was okay (rolls). The other food, well I was in paradise (of course this is before the attack of the MSG). Would I come back here? Yes! Is it quality food? I mean...you get what you paid for! What did you like most? All the different selections! What didn't you like? How hot it was in the restaurant!"], ["Logan L.", "Worst Chinese buffet my boyfriend and I have ever been to. I'm not typically a picky person either. The food was cold and mediocre at best, plus if you waste any they'll tack on an extra 30% to your bill... Which is an obvious problem when the food isn't good."], ["Cody O.", "Very impressive selection, and the food is fresh. They have chicken cooked about 8 different ways. Nice decor, and a really amazing fountain at the front of the restaurant.  As a big fan of Chinese Buffets, I consider myself to be a near expert on the topic. This is, without a doubt, the best Chinese Buffet anywhere in Raleigh. Excellent service, vast selection of food, very reasonable prices. This is exactly what a Chinese Buffet should be!"], ["Laura G.", "Have come back a few times since my initial review and for $8.00 you still can't beat the price of this buffet. There are quite a few types of sushi that are to my liking (I have to preface that with that I don't like sushi that is fried or with mayo), so that narrows my sushi buffet eating choices. I did find there were also less Chinese foods and more American foods, I think they are catered to the Hispanic population more than those who come for Asian foods. Also some of the foods were lukewarm as opposed to hot. I prefer my soup to be hot as well as my egg rolls, etc. I will return again when I am in the neighborhood at noon and in need of an inexpensive lunch, but I am sad there were no egg, radish, other fish types on the sushi bar and the Chinese food choices have shrunk. Do something to heat up the food and then alert me Hibachi Grill."], ["C M.", "Quality has really gone downhill. About a year ago this was the best buffet around. Now the food was barely warm, old, and the cookies were stale. So sad. :/"], ["Kevin F.", "This place is the Golden Corral of Chinese Places. Yes there is a huge selection but what you have to pick from is low quality. It doesn't really matter if there's a lot of food if it's all junk. You'll be over whelmed at first with all the choices and the labels make it sound good. After your first couple bites you will realize the quality is poor. I've tried this place 3 different times. I'd say save your money."], ["Chao G.", "My best Chinese buffet. i like it so much, the price is ok, and the food is better than other chinese buffetyeah, just make sure do not come at Saturday night. They are so busy at that time, you need to wait  for seats and u can not get ur grill fast ."], ["Tierea H.", "They have good food for a great price. I like that you don't have to wait on your food, you can just get up and get it when you feel like it. I do however think they need waiters that speak better English and more attentive waiters. I would not come here for desserts because they don't have the best desserts.Their cookies were rock hard. Their ice-cream however was great. I also love their sushi bar and but my favorite was their spinach and cheese.  Overall the food was good. Me and my mom love coming here."], ["Robbie C.", "Gave two stars cause the fresh fruit was good and deserving of two stars. Servers cleared plates with a smile but that's where the good ends.  Priced at $11.99 per person, the buffet did have large selection but everything I tasted was rubbery, over salted or too fishy smelling.  I'm not a fan of sushi, nor do I eat meat or chicken. But everything I did try that was cooked was pretty nasty.. At least the fruit and salad was good."], ["Daniel L.", "what was I thinking.  yes, we were hungry and didn't have any plans for the evening but that shouldn't have meant for us to head over to a chinese buffet restaurant that we weren't all that familiar with.  All I knew about the Hibachi Grill & Supreme Buffet over on Capital Blvd. was that it's always busy with tons of families going in and out of that place.  It's located right next to a Sam Ash music store in a strip mall and whenever we had to go to Sam Ash for stuff in the past, I'd always notice how busy the buffet place was.  And if it's a busy place, it's gotta be good, right?  Obviously not. This place was disgusting.  It's a windowless, rundown restaurant full of customers there just to fill their face.  The wife and I have been more health conscious over the years so a buffet shouldn't have been on our radar anyway.  But we didn't feel like going to the same old places this particular night so we opted to go to this buffet and boy are we regretting it now.  yuck.  It's your typical chinese buffet that also offers a hibachi style grill as well as sushi.  everything was just \"meh\" with nothing really special that would explain why this place is packed day in and day out.  I just have to conclude that your average buffet patron doesn't really give a hoot about taste and simply wants a stuffed tummy.  My kids really didn't seem to mind though.  As long as they got their ice cream for dessert, they were happy.  whatever.  All I know is that I'm never going to set foot in that place ever again.  What a waste of money..."], ["Patrick S.", "Yelp never leads us astray in Raleigh...Lunch, where to go for lunch? We settled on chinese and then after a quick review we decided to continue our all-buffet week by going to Hibachi.There are lots of good things to say about this place:AMEX gladly accepted here!Quick and attentiveClean and well litBoothes or tablesReasonably priced---$9 w/tip for lunchThe selection of Chinese/Asian favorites as well as American favorites makes this the place to go if you want chinese and one of the kids or co-workers is finicky and wants potatoes n gravy! Everything was hot and fresh and tasty...they have a grill in the back but I never tried it as I was so focused on a repeat of the Hong Kong chicken and the Coconut chicken...also, they have they hard, sugar-coated blanched peanuts...my favorite!!!I never tried the sushi since I was apprehensive about there true ability to do good sushi in a buffet joint! Didnt want to be let down...If you want to weigh 300#, eat lunch here everyday! Oh yah, they have salad too...baha."], ["Kelly P.", "Great pricing for what it is...I think for 7.99 for all you can eat.... this place is not bad... the food was decent .. all they need now is servers that speaks more than 4 words of English...The shrimp stir- fried with onions and their peppered chicken were the two items that made me come back for more..."], ["Nicky V.", "My friends and I come here something like once a month (or every two months). The food is great and for a good price, but what really stuck out to me was the exceptional water.Let me walk you through my experience: Immediately upon walking in a hostess sits my party of four at arguably the best booth. \"What will you have to drink?\" she asks. \"Water.\" \"Would you like that with or without a lemon?\" Okay let me stop you right here. Most restaurants don't give you this sort of choice. They'd rather you sweat over whether or not you get any fruit in your water. I've even been upset with other restaurants for not telling me I would or would not get a lemon in my drink. Not telling the customer whether he or she will get a lemon is perhaps the biggest turnoff for a restaurant as far as I'm concerned. Good on Hibachi for offering such an option.So I go and get my food. It's pretty good, but boy am I thirsty from eating it (not saying the food is dry, just that I was pretty thirsty on this day). And what do you know, here I have this water glass filled to the brim, with the perfect amount of ice and a lemon as gorgeous as the first sunrise (on the brim of the cup) waiting to embrace me like true love.Also, I should mention that Hibachi doesn't just make you use a straw. They bring you your cups and straws (wrapped) separately. Personally, I chose to use one, but some of my companions did not, and I respected that because that's their own business.So I sip on this water and let me tell you, Yelp community, there is nothing on this great planet I would rather have passed through my lips at that moment. It was cold (due to the perfection of ice to water ratio). It was refreshing. And it didn't taste like lemon.Whoa. It didn't taste like lemon? You must be wondering why this seems so great to me.Some restaurants put lemons in their water and it gives it this weird, half-lemon-half-water taste. If I wanted extra watered down lemonade, I would have asked for it. Instead, I asked for water with lemon. And this, my friends, is for aesthetic purposes only.Think of a glass of water without a lemon on it.Now think of one with a lemon.Which looks like the most delicious thing you could ever have? I'm going to guess it's the one with the lemon.Throughout the meal(s), the staff refilled my water a few times. All the while, they maintained the perfect ice-water ratio, thus keeping my water in a perpetual state of optimal refreshment the entire experience.Drinking this water, I felt my soul grow weary for all those lost to war. I felt generations of emotions and felt the expansion of the universe. I saw through time.So if you find yourself on Capital Blvd, be sure to stop by. Sure, the food is great and costs only $10, but if you get anything at all, make sure it's the water. I would even pay $10 for this water. Good news is that I don't have to (and neither do you), because this enlightenment inducing water is free of charge."], ["Thomas W.", "this was my first experience eating at this establishment. overall the atmosphere good as was the food. the service at the table was adequate although drink refills somewhat slow. the variety of items on the bar was great or you could choose from the raw bar and have the food cooked on the grill. the taste of the food was good as well. pretty much what was expected."], ["Jacques W.", "Use to be really good, but seeing as it is I'm sitting at home two days from work due to food poisoning, I cant say that anymore.  I'm guessing it came from the sushi. That's the one dish I couldn't finish"], ["Shaun B.", "Not bad, just your typical Chinese Buffett with a lot of options.  There really is something for everyone.  Just be realistic with what you expect.  For under ten bucks, it's a good value for a cheap meal. Service was fast and efficient and the restaurant was clean.  All the food was hot and was being refreshed as needed.  Good basic sushi selection and freshly prepared food from the grill. One of the largest varieties of any of the buffets in the area."], ["Ron W.", "All-you-can-eat buffets, the bane of my existence!  It's a love-hate relationship for me, I love the convenience and choices but it really kills me because my appetite control is non-existent.  Do I... a. Avoid all you can eat buffets?b. Punch an extra hole in all my belts?c. Take a deep breath in before putting on pants and pray I don't reach the structural limits of my buttons and zippers?  Hibachi Grill Supreme Buffet is going to force me to go with option B or C because it is an all-you-can-eat and pretty darn good!  It's a big space with tons of seating and day-glo lighting in the buffet area.  You've got 8+ buffet islands, PLUS the mongolian grill, PLUS the sushi station!  You can choose from standard chinese-american fare that's really tasty.  Or go with more American food like ribs, BBQ chicken, salmon, bacon wrapped scallops, mashies, and pizza.  Beef and broccoli, coconut chicken, braised string beans, chicken teriyaki, mussels, yum!  There are some salad and healthier options but who in the world would come here for greens?!  And of course there's ice cream, jello and fresh fruit to finish things (or you) off!   Everything I tried was actually pretty decent and fresh, key to any good buffet.  With the tons of choices you've got here, I can't imagine anybody would be unhappy.  Service was prompt and personable, the gals came by often to refill drinks and clear tables. Seating is comfortable and the place is really clean!  And the kicker is that lunch is about $7, a ridiculous price for all the food you've got here at Hibachi Grill.  So yeah, it may not be gourmet but if you're on Capital and looking for something that will please the entire family without denting your wallet, Hibachi Grill and Supreme Buffet is a great choice!  Just make sure you punch that extra hole in your belt before stepping into the place, you've been warned..."], ["P C.", "This restaurant is pathetic, poor everything..--------------there is some confusion for folks here, there is a second Hibachi chinese buffet further north on capital blvd at Millbrook road, that restaurant is 4+ stars and quiet possibly the best chinese buffet in raleigh... the supreme grill .. this one... it just sucks!"], ["Alicia X.", "Not impressive at all. Not many choices for sushi. The beef for Hibachi seems not fresh. The food are too oily. Don't have much seafood as other Chinese buffets. Very slow to refill the food. As a Chinese, I cannot find anything even close to Chinese food. Won't come back again."], ["Adnan C.", "In short: above average Chinese buffet, most of them fresh and delicious, large selection, lack of beef dishes.This is probably the best Chinese buffet in Raleigh, I have been to 8/9 others. As you can guess from other reviews, there's a lot to choose from. I like starters a lot (read : fried and salty) and you can easily fill 2 plates with 1 starter each. All of them were fresh, crispy. In the main courses, there are shrimp dishes, crawfish(!), and* lots* of chicken dishes. The sauteed shrimps were large and tasty.  I am not a fan of American-Chinese style of fried-sticky-sweet chicken, you will get plenty of these here. But dont worry, lot of chicken dishes are there with salty-\"umami\"ness that will satisfy you.One big grudge is the lack of beef dishes. I like beef, and was disappointed to see  only 2 beef dishes---beef brocolli stir fry and beef pot roast (though, it was named prime steak).There is a hibachi section where you can make your own mix of raw food and the griller will cook it for you. We havent used it though.The desert section is adequate, nothing fancy. The desert section in Golden Corral was much better.Overall, we were satisfied, and it would've been our choice for preferred Chinese Buffet if we did not live in South Raleigh.   3.5 star."], ["Frederick L.", "Nothing like having the midday munchies hit JUST as you are passing by this awesome buffet! They have tons of selection here including the Hibachi Grill section and a really good Sushi Bar. My weakness at these buffets are, of all things, the dinner rolls! They are so good! Buttered, oven fresh, and oh so good.I like to start with the Sushi bar to get the ball rolling. Great selection of stuff. I can never remember what they are called or what I had, but I usually go down the line of them and tend to favor anything that is bright and colorful, LOL! Great Sushi Chef they've got here.As for the entree, I'm a huge fan of the General Tso's chicken, bourbon chicken, fried rice, chinese dumplings, pepper chicken (starting to see a pattern) and sesame chicken. They are all cooked to the level you would expect in a sit down and order from the menu restaurant. Of all the chickens, I highly recommend trying the General Tso's if you haven't done so already! Sweet and tangy, yet conservative like a comedic politician, LOL! (Don't ask how I came up with that, it just came to mind). In all seriousness, it is fantastically tastey!The restaurant itself is large and extremely clean. They have a gorgeous oriental type water fountain structure thingy to the right as you walk in to the place. Probably the largest one I've ever seen. The staff is phenomenal and I couldn't help but to notice the really attractive hostesses. I get the feeling my girlfriend will now ban me from going here, LOL!A great dining experience and one of the best buffets I regularly go to!"], ["Max L.", "Since Yelp removed my initial review, I am reposting. Surprised by the positive reviews. Has broad selection, but most is mediocre and lacks flavor."], ["Thomas V.", "Selection was large but the quality was mediocre. Friday night so the place was busy and loud. No beer, no wine, can't think of a Chinese place without Tsing Tao. Price was reasonable."], ["Nene K.", "I used to think that buffets were for poor, distasteful souls who could not see the value in a portion-controlled, quality meal. So when my mom suggested that I try the new Hibachi Grill on Capital Blvd, I instantly dismissed it as \"not the kind of place I frequent.\"I finally went to the buffet as part of a celebration for my dad's birthday. And I've been going back ever since! Guys, the food here is top-notch, and this place gets it right every time. In the mood for dumplings? All the time! Fried shrimp? Why not! Fresh, fresh sushi including unagi sushi? Of course! And for those who aren't into the Chinese/Japanese/American cuisine hybrid, there are plenty of more down-home options like mac & cheese, ham, and scores of chicken dishes. More than you could ever imagine. I've never eaten dessert here, but there is a sizable selection of ice cream, fruit, and other delectables. Yum.And did I mention the price?? $6.99 for the lunch buffet, $8.99 - $9.99 for the dinner buffet. Criminal. Prices hover around $12.99/person for holidays such as Christmas, Mother's Day, or Father's Day. Verdict: There is nothing more American than a Chinese buffet. If you are someone who tends to avoid buffets, for whatever reason, you may give up that habit when you visit Hibachi."], ["Caroline H.", "The only things good about this place are the service and the day glo décor.The buffet is mostly to be avoided--it alternates between syrupy chicken done ten ways and mysterious cheesy casseroles. The hot n sour soup lived up to neither of its adjectives. In fact, almost no spice is in evidence in any of the dishes.The hibachi grill is one of the better options here, though the aforementioned lack of flavor is in effect here as well. The sushi is also better than the buffet (nothing spectacular, but that is to be expected at a Chinese buffet). If they can do the extras mediocre, why not the main attraction? Instead, the buffet was basically inedible.Avoid, avoid, avoid."], ["Mike O.", "The Cadillac of buffets. Seriously, at lunch $7 gets you the full buffet, crazy-fire-esque hibachi grill, and better sushi than even some Japanese restaurants I've been to. The only thing missing here is burritos, but I guess that wouldn't really fit now would it? I've never had a better buffet in my life. Protip: Make sure you try the coconut chicken!"]], "Wang's Kitchen": []}