{"Mellow Mushroom": [["Candace B.", "Mellow Mushroom never disappoints! Great service, seated immediately  & food came quickly- even though they are super busy today. Our food came out hot (almost too hot) and was cooked to perfection. It is possible to screw up pizza and other pizza-type food. I had the jerk calzone and it was amazing. Couldn't finish the whole thing but know what I'll be eating for dinner!"], ["Gina B.", "I wish I loved Mellow Mushroom. Nothing would give me more pleasure. Let me first come clean that I'm gluten-free. I've tried a few places GF fare and was thrilled: Amante and zpizza, so was curious to try Mellow's version. Gotta say... I was less than impressed by the creative topping options and pizzas they have available. Also, I felt pretty sick the next day. I think it was the toppings and not the dough though. Also, they only have 1 size available for GF pizzas and it was extremely pricey. 1 pizza and a glass of house wine was $35! Crap, I could have had a filet and a class of wine at Sullivans. There menu is generally very limited for the GF crowd. Sadly, I think I'll be going to zpizza for my next GF indulgence.Sorry MM. :("], ["Rachel M.", "I was extremely bitter after coming here because the groupon of the day was for here and i didn't see it! So before you go here check your daily goupon! Other than that i wasn't too impressed with their pizza. We ordered the Red Skin Potato Pie pizza, but everything except for the sour cream, mounds of cheese, and ranch dressing seemed non-existent. Was below what I'd get at a Pizza Hut in my opinion.However, the atmosphere is great, the servers are pretty good, and the alcohol list is pretty extensive if you enjoy a good drink. I'd probably come back again with friends because it is a nice place for groups and the foods bearable."], ["Filipe T.", "There's nothing like a Mellow Mushroom pizza and some beers to go with it. Their pretzels are awesome and get the BEER CHEESE with it. I love the hippie, laid back staff and atmosphere.Great selection of beers and their pizzas are world famous, so nothing much to add here."], ["Sean S.", "Definitely one of the best Mellow Mushrooms I've been too. Solid service, amazing pizza, awesome draft list, and a perfect location at the top of Glenwood. Great way to start your night for dinner and then work your way down to the bars (Cornerstone!)"], ["Dee K.", "Hubby and I went here for lunch before a family wedding. I had the Stuffed, roasted portabella mushroom. Our food was AMAZING!! My mushroom was stuffed with high quality ingredients and then roasted, on a bed of greens drizzled with balsamic, and what a presentation!! Hubby had a maui waui pizza, with pineapples, ham and banana peppers, ingredients were fresh and service was friendly and quick, Great dining experience."], ["Justin J.", "Pretty good, but not much distinct flavor in their pizza.Cool atmosphere though in downtown.We went for lunch and they helped us out to get us in and out in time.It is a bit pricey though for what you would think.Best splitting a medium even between 2-3 people to cut down on price.Overall- pretty good!"], ["Codi Alyssa B.", "We LOVE Mellow Mushroom. Definitely our pizza place of choice; this location is always clean and friendly when we visit."], ["Jennifer C.", "Mellow Mushroom has an extensive menu and I've sampled quite a bit of it. Before I was gluten free I regularly visited the Shroom for a beer and their awesome pretzels liberally dosed with Parmesan cheese. Get the order of 5 and take some home, trust me. Who wants to go to a restaurant just to eat salad? If it's a Mellow Mushroom salad, pick me pick me!! Their Esperanza dressing is the BOMB and their salads, even the smaller size, are huge and have a variety of ingredients, not just your typical lettuce, tomato, crouton. Get a small salad and pretzels if you feel that bad about it. The pizza is also top notch in my opinion. I loved the wheat crust, they have a huge array of toppings (even green olives and bacon, which is my fave I don't care if anyone thinks it gross. Try it and then talk to me.) They have some awesome specialty pizzas (Muffuletta, they did one with mashed potato \"sauce\" once). Now that I'm gluten free I stick to salads and their gluten free pizza. It's not the best gluten free pizza in the world, but it's better than nothing! Pizza is one thing that I still haven't been able to find as good gluten free as it's non-gluten free variety. Get LOTS of toppings and you'll be able to overcome it. I recommend at least three. It definitely gets loud in the restaurant and outside, especially on a busy day. But their outdoor area is spacious (covered \"porch\" and uncovered area available). If you can't deal with drunk people I wouldn't visit past 9pm on a weekend or you'll deal with the Glenwood South crowd."], ["Kristian C.", "Great food. Service can be a bit slow, but I could his place some slack bc it is always busy. Some of the best pizza in the area."], ["Brian G.", "Mellow seems like a fixture in and around college campuses - I think this is the fourth one I've visited. It's consistently really strong pizza. I normally pick up but this location has a nice patio area as well as an indoor section and bar area with lots of TVs if you're trying to watch a game. A little pricier than most pizza spots you'll find around town, but generally worth it."], ["Maria J.", "The pizza here is absolutely delicious. Kosmic Karma is one of my top choices. It's fun in the summer when you can sit out on the patio and enjoy the weather. Definitely a great place to grab a beer and enjoy some food without spending a fortune."], ["Steven Natalie P.", "Unique pizza creations, calzones, hoagies and salads. Laid back atmosphere. Fresh ingredients."], ["Dave R.", "My mouth waters when I think of the pizza I ate at the Mellow Mushroom.  It was cooked fast and was absolutely outstanding.  I will be back!"], ["Jason E.", "The Mellowteranean was delicious. Great beer too."], ["Ashley W.", "Good place to grab a slice and brewsky with friends.Last Saturday night, my friends and I managed to nab a table on the patio with no wait what-so-ever. It surprised me since it's usually overflowing with people, but this time it was the inside that was full and not the out. I think we were lucky due to the chilly weather and the absence of fair-goers. We got a decent table near the fence -- my only complaint was it was a bit *dark*. They could use a little more lighting in certain areas. I was a bit nervous to sit out on the patio, due to the frequent street solicitors on Glenwood Ave. -- but the fence that surrounded the enclosure let me give out a great sigh of relief! *swig*My friend and I ordered Big Boss Harvest Time (pumpkin seasonal) and it was absolutely delightful. For grub, we went with a medium Maui Wowie for three of us -- which allotted to two slices per person (6 slices total). The pesto base was interesting, since I'm used to tomato-based sauce with ham and pineapple combos. The jerk chicken and banana peppers were a little wrench in this pizza -- I did not enjoy the tangy chicken because it was dry and out of place. The Applewood bacon and mozzarella cheese were the saving grace of this pizza -- c'mon, who doesn't like BACON?The waitress was sweet and on point -- our glasses never got empty. Pizza came out at a decent time too! Definitely want to come back for a *warmer* afternoon on this patio with another cold one and a calzone for a change!"], ["Jenessy A.", "The dough is amazeballs!As I walk in, I remember to take my allergy medicine because I am allergic to tomatoes and I am in the land of. Gah! I resort to having a barbecue blended pizza which I customized to my liking with spinach, ricotta cheese and more cheese. To my surprise BBQ also has ketchup in it which has tomatoes. Fun times right? I still ate it and didn't blow up so I was in the safe zone. The pizza servings were big for one person, I would've easily shared with someone and the bread, oh my. Super fresh ingredients. They had all kinds of pizzas to choose from including meat lovers to veggie. And for some of you who may float in my boat of anti-tomatoes can still participate in this awesome guilty pleasure."], ["Rob W.", "This is the place to go for Pizza. It is always lively here. I like the outdoor patio seating, which is ideal for watching the people walk by in the Glenwood South area. I am also a big fan of the gluten free Pizza option. You can make just about any kind of Pizza you can imagine. Our service on our last visit was outstanding.."], ["Kuanyu C.", "\"You either mellow at 30, or your head explodes - take your choice.\" -Laurell K. HamiltonI will be remiss not to point out sometimes I just can't get mellow here; if you get here on popular nights, the wait can be such an appetite killer. On a good night however, the aroma of freshly baked dough and delicious toppings will open up that appetite for you.What's very unique about Mellow Mushroom pizza, IMHO, they add (perhaps) cornmeal into the dough? There is a slightly sweet taste and the dough is more snappy (less soft and chewy).There is a good number of veggie-lover choices on the menu, but of course I enjoy their more meaty choices. Philosopher's Pie is one of my favorite"], ["Samantha L.", "I'd eat pizza every day if I could and this pizza is up there among my favorites.  The crust is a perfect mix of crunchy and chewy, mmm gluten.  My boyfriend and I usually order a small in whatever our choice is and swap slices.  We've tried the Mauie Wowie, Magical Mystery Tour, and the Funky Q Chicken.  All were delicious.  Even with the smalls, we bring about half home.  They warm up nicely in the oven the next day, although nothing beats a fresh pizza.We've never had to wait very long, but it was difficult to find parking.  There is extra parking at the auto place across the street (after a certain time of day).  That was full a couple times we visited, but we had some success stalking someone coming out for their spot."], ["Adam W.", "There is lots of local love for the Mellow Mushroom, so I had to give it a try.  The pizza is not your typical pie.  The crust is a bit thicker and more puffed up than what you're probably used to, and features a nice hint of cornmeal.  I happen to like cornmeal crust on pizza so this is a good thing, though your mileage may vary.My jerk chicken pizza was generously topped with fresh ingredients and was quite tasty.  My daughter loved her cheese pizza, on which the cheese was perfectly melted to the proper point and not a bit beyond.  I was advised to try the margarita (margarita with pizza?  why not, I'm on vacation), and it too was quite good. Even though the place was quite busy, service was friendly and fast.  Choose to eat inside, or enjoy the large, partly covered outside patio.  The parking lot attached to the restaurant fills up, but we were able to score parking at the gas station across the street (allowed after 5pm)."], ["Eugene C.", "Good dining experience. Fits the typical mellow mushroom restaurant vibe and service. Nice people there."], ["Kellie F.", "I only come here because of its location and outdoor patio.  The food is okay although I've never eaten anything bad.  It's just the menu is ok, but it is what it is! My kids love it so I'm here more often than I like to admit.  I love their signature salad dressing and the fact I can custom order a salad how I want it.  The kids swear by their pizza, but I'm a thin crust kind of girl and their crust is a bit more.  It's a great stand by restaurant in my family."], ["Beth B.", "On a recent visit to Cary, I went to two different Mellow Mushrooms in one day.  This one was far superior to the Cary location in every way.  Sure, I had had a copious amount to drink before our late night visit to this location, but that doesn't really impact my opinion.  This particular location was really charming & eclectic.  We ordered some drinks & a small Mega-Veggie pizza (red sauce base with feta and mozzarella cheeses, sun-dried tomatoes, spinach, green peppers, mushrooms, onions, black olives, Roma tomatoes, broccoli, banana peppers, artichoke hearts and tofu).  Tell you what - I don't even like tofu, but this was hands down the best veggie pizza I've ever had.  I'd eat it for every meal if I could - yeah, it was delicious for breakfast the next too.Our waiter, Kaz, was really terrific - fun, cute, talkative.  AND, he didn't kick us out even though the restaurant was pretty much closed by the time we left.  Loved this pizza, restaurant & experience :)"], ["Doug P.", "Consistently tasty w/ a friendly and warm welcoming staff. Great place to get good grub and grab a local beer."], ["Robin C.", "Best pizza we have had in a long time (and we have been searching hard) hand tossed crust, really tasty sauce, and good variety if toppings all fresh. Italian sausage was outstanding. Atmosphere was relaxed and comfortable. Service was fantastic. We will return again!"], ["Star B.", "Food is good but not a place for a quick work day lunch. Took over 50 minutes from when we ordered till we got a simple sandwich and a Greek salad. Went there today, got seated quickly but took 15 minute to place our order and another 50 minutes before I gave up and left to go back to the office. My friend stayed to get the food. Server was very nice tho. every time I inquired about the food she said she did not know what was taking so long.  I will go back but definitely not when I am in a hurry."], ["Briana B.", "Great pizza and atmosphere. I love that you can sit outside and enjoy food and drinks with your friends on a nice evening."], ["Michael B.", "This was my second visit to Mellow Mushroom and I have to say, I am a fan.  They had a big party posted on Facebook for their 10 year anniversary.  I have to admit, it was a great event.  They had what seemed like all you can eat free pizza, face painting, corn hole toss, pizza eating competition, smoothies, and prizes.  The beer was cheap at $1 and the mixed beverages were cheap at $3.  Both times I have been to Mellow Mushroom the waitstaff was excellent.  They are very friendly, and really rave about their establishment.  If you ask them a question, they will gladly answer it, and make recommendations about the menu.  The food is good, and I would gladly go back to for a second, third, ... or whatever slice.  My only regret was that I found out I had a food allergy or something after I ate the pesto sauce.  Too bad because it was mighty tasty."], ["J G.", "The mushroom soup was on pae with any gourmet restaurant I have ever had. If you love mushrooms like me, this is your Mecca."], ["Tina W.", "the place is kinda dark but okay. It is the first mellow mushroom experience for me and it really surprised me so much. everything's perfect. highly recommend"], ["Kelly M.", "I love the Mellow Mushroom!  The atmosphere is so much fun, and the pizza is great!  This place is ALWAYS crowded, but not in an annoying way.  I've gone twice with large groups (over ten people) and they were so accommodating.  The waiter both times was courteous and patient, as you need to be with so many people.  He offered to put everyone on separate checks, and even split pitchers of beer between people, instead of just putting it on someone's bill, which was great.  The draft beer selection is great, and fairly cheap.  They also have an outdoor, covered and heated patio, which is great because it is warm and takes all the overflow of people who do not fit into the restaurant.  I have never had to wait long for a table, and even when it is extremely busy, the food comes at a reasonable time. I have never felt like I waited forever to get my pizza. The Funky Q chicken is my absolute favorite. I will purposely order a large pizza so that I will be sure to have leftovers.  It is SO SO good.  I cannot say I have expanded my range too much, because both times I went I got the same pizza because I enjoyed it so much the first time.  Maybe next time I will get a little more adventurous and try something new!Basically, if you have not tried the Mellow Mushroom yet, go.  The pizza is great and the service is awesome as well.  You will not be disappointed!"], ["Jen N.", "What a groovy place to enjoy a far-out pie and a few dyno-mite beers!  The outdoor patio has some lovely gigantic mushrooms to shade you from the sun, while indoors is funky, dark and cool.I think I selected just about the best pizza on the menu: the Magical Mystery Tour loaded with mushrooms, spinach, feta and jalapenos with a pesto base. O.M.G. - out of this world!  We also tried the garlic pretzels. Wow!  Delish!Very nice draft beers and a good selection of other refreshing beverages.  The wait staff aim to please.The restaurant is conveniently located on the corner of Peace and Glenwood.  Parking is a bit of a challenge but once you've landed a spot, there are plenty of art galleries and nightclubs right down Glenwood St.Definitely a fun place!"], ["Rick B.", "Overpriced in my opinion. If your a pizza freak, then you will probably like the uniqueness of their style. But the ingredients were not that much fresher or better than the chain pizza restaurants. Two medium pizzas and a pretzel appetizer - $65.00!"], ["Scott S.", "Really good.  The outdoor seating is what makes this place so good.  I mean the pizza's are good too - creative and well made, but it's not enough to keep me coming back without the great outdoor atmosphere.If it's nice outside, get here."], ["Rebecca R.", "I don't go to Mellow very often but when I do I always enjoy the food. I had the gourmet white pizza last night and it was delicious. The crust is tasty and I could eat it all by itself. The reason I have given it a three is because 1) the price and 2) unfriendliness towards dogs.  The price while not terribly expensive is still not cheap. I can go elsewhere and get a large pizza for less than a small at Mellow Mushroom. As for the dogs they have a great patio with plenty of room yet don't allow dogs. They have lost business from me for that reason."], ["Jennifer S.", "This place is so good! I had the Build-Your-Own Calzone and it was fantastic! The calzone was HUGE and fresh from the oven when it was brought to my table. They have tons of ingredient options, which was great for me because I loaded that sucker with veggies! Their drinks are great too. I had the Purple Haze which was recommended to me by my server. The cocktails come in shakers with a glass so you can pour your drinks at your own pace. This is a great place!"], ["Alan M.", "Amy was my server today I had a pretzel and small Greek salad she recommend her favorite pizza wow delicious! and friendly service"], ["Matt C.", "Thank you Senor!  My friend Shawn recommended this place, he is from the Raleigh area...They were playing Phish-band on the radio when we walked in...  Instant 5 stars.I am a pizza snob also.  The standard is New York Style, which you can find in many places in the Tri-State area.  Though the pizza here was not quite what you'd get on the streets of New York, it was pretty bomb a** pizza!They had a terrific selection of micro-brews on tap also.You won't be disappointed."], ["jerrilynn s.", "We were from out of town and were looking for an independent pizza place. We thought with the somewhat hippie-type decorations we had found one. The pizza with a medium thick crust was very good, the service was very good, the ice tea was very good, and my husband enjoyed a local brew. We found out later the Mellow Mushroom is a chain restaurant. We would go back. It is better than any of the national chains."]], "Fleming's Prime Steakhouse & Wine Bar": [["Brian H.", "Awesome Service, Wine and Food. That's about it."], ["RodyandReeree B.", "My husband and I went here for our anniversary.  Food was good but not $200 worth of good after dinner and drinks for 2. And we were still hungry!!! Atmosphere was nice but a little loud which made it a little hard to hear the waitress. No real rhyme or reason to the menu...not sure if we'll go again. But I do suggest you try it."], ["Denise C.", "FILET- was ordered medium and came out  medium-rare at best.  If you are a steak house you should know how to cook a steak. Service also left a lot to be desired.  Cocktails that never came.  A bottle of wine that was brought after the appetizers.  The entrees came out only a minute or two after the entree."], ["George G.", "Steak was good ... A simple salt / pepper season served hot.  I had the bone-in ribeye medium rare.  Apps were average - calamari soft / spongy, pork with compote was OK,Sides lacked - cream spinach was dry and the mushrooms average.  The side portions were small for family style but party of 5 did not finish them.Wine menu not extensive, though some good selections for red.  All in all, not too bad for steak in BBQ country."], ["Sarah F.", "Unfortunately I do not have many good things to say about my experience at Flemings in Raleigh. First, the restaurant has a lower sanitation rating, 93.5 if my memory serves me correct, than Taco Bell in Fayetteville, NC. We ordered two small plates as our meal, an appetizer, and two sides. The portions were decent, but not nearly large enough to warrant the price tag. The shrimps and scallops I ordered were demonstrably worse than many seafood dishes I've had at restaurants such as Applebee's. All in all, I paid $122 for two people.  We ordered one appetizer, 2 small plates, 2 sides, and two 6oz glasses of brut. I can unequivocally say that this was the worst $100 meal I have ever had. This restaurant and it's food are exceptionally average, and when coupled with steep prices, makes this the last time I will ever dine and Flemings; I am not one to do so, but I will likely go out of my way to prevent friends from having the same poor experience that I had."], ["Ian Maren C.", "Amazing!! We ended up going because we had a coupon deal with our Amex.  It was def worth it.  The staff was amazing and the steak was delicious!!! The calamari for an app was great and sides were amazing.  Very quick efficient service without rushing you out the door.  The drinks were amazing but overprices as usual at a steak house so I think we'll stick to house wine or beers next time.  Highly recommend."], ["Jan B.", "Not sure what all the fuss is about... Invited as a guest so didn't make any negative comments during dinner. I wanted my petite filet mignon medium well but waiter told me it would be pink (which I don't care for) so I switched to well done.  Another at table  ordered same cut \"rare plus\" and hers was twice as tall.  So I gnawed my way through my charcoal mass.  Sides and desserts were fine. I've had better meals at a quarter of the price though."], ["April B.", "WAY OVERPRICED. The appetizers, cocktails, and dessert were pretty good, but the entrees were overdone and way too small. I ordered a house salad and scallops. The salad consisted of iceberg lettuce, tomatoes, onion, and little to no dressing. When my scallops came, there were only FOUR small ones on the plate, aside a vegetable mixture that was cold and overcooked. my fiancé's surf and turf was just \"ok\". We were SHOCKED when we got the bill- $190! For what?!? The service was, um, interesting. Our server seemed to be jacked up or strung out on something and was in a HUGE hurry, not giving us time to answer her or fully articulate what we wanted. Don't think we'll be returning. We'd rather go to Sullivan's any day!!"], ["Holly S.", "Delicious. Bone in ribeye and 8oz filet were out of this world! The wines were also great and affordable and my hubs thought the beer selection was killer too.Our server was great, attentive but not hovering- and knew her stuff! Only downside is the price- like WO!- but so good its worth the splurge! Will be back...eventually.... once my bank account recovers a bit :)"], ["Al W.", "I had the main filet (16 oz.) with peppercorn and F71 (?) sauce ... It was good. The French onion soup was good too. I think I may stick with Sullivan's though as my steak place."], ["Tasha J.", "I will start by saying the level of customer services is amazing, which is a major plus for me when I'm visiting an upscale restaurant. Flemings has one of the most knowledgable staffs that I've had the pleasure being serviced by in awhile. Our waiter knew the menu without looking at it and was able to recite selections as if she was in a poetry contest. She also knew each wine and what paired well with the menu items which is rare. Timing of the food was perfect, each course was presented and accompanied by the appropriate condiments without having to ask. Drinks were filled without her being a pest. She treated her position as a career to say the least instead of a job in which each member at our table had a face and a title and she served us well during our visit. I had not seen service of that magnitude in years and in North Carolina ever!However, the food did not match her level of service, she did know exactly what to say and it was not hollow excuses and apologies..she recalled each order as if they were engraved in her brain and quickly confirmed the steaks were not cooked to perfection and that she would speak with the chef immediately. Even after the second attempt each steak returned the same only slightly darker than before instead of wasting more food everyone accepted the incorrect orders and thanked her for her polite and professional attempts. I give two stars and wish that yelp would allow separate reviews, 1 for customer service and 1 for food because her level and respect for her craft is/was amazing and deserved 10 stars (which I don't say often), but the food is over priced and no better than that of Long Star or an average steak house and for what we received tonight I would give 1 star!"], ["Scott S.", "Flemings is solid, but nothing spectacular.  I actually came to this location twice in the last few weeks - once for restaurant week and once because they gave us a free $25 gift-certificate for being a new customer at this location - which was awesome!The food is quite expensive, but good.  During restaurant week, both my steak (fillet mignon!) and my GF's came out cold.  Yes, cold.  The inside was kind of warm.  I was pretty POed but I never say anything at restaurants in situations like this, so dealt with it.  Anyway the flavor was still ok.The second time we went, the fillet mignon was basically perfectly cooked, I was very happy with it.  It was also  enormous.Oh yea, and sides are extra and served family style.  So that raises the cost even higher.I'll probably go back eventually, but not without a financial incentive, there's enough steakhouses in raleigh to keep me happy for a while.  For this price, I'd choose angus barn."], ["Jon M.", "Just finished having dinner at Flemings in Raleigh North Carolina. I had the porcini rubbed filet mignon with a big baked potato with butter and sour cream. The steak was cooked to perfection at medium rare and the baked potato was one of the tastiest that I've had in a very long time. My associate and I shared a bottle of Stags Leap Cabernet \"Fay\" 2005. Took a little bit longer to open up that I had anticipated, but once it did it was excellent, especially for the price point! I recommend this restaurant to anyone coming to Raleigh!"], ["David E.", "We went there on a Sunday to celebrate our anniversary and they treated us like royalty. It was not too crowded so that might have been part of it. By the end of the night, wait staff in other parts of the restaurant wished us a happy anniversary. We started in the bar where they had great specials. The blueberry lemon drink was delicious and potent. My wife loved her moscato. We loved to the dining room and took advantage of their prime rib special. We lied it all: salads, steak, sides and dessert. So much delicious food. Friendly and knowledgeable wait staff. If there is one negative is that their normal menu is expensive and ala carte. We look forward to coming back here."], ["Rachel H.", "Still one of my favorite steak restaurants- hands down!  Returned for dinner to try to use the $25 gift card my boyfriend and I received for our anniversary dinner.  We both had the prime rib dinner special, which is normally $40 on a Sunday night (includes a salad, prime rib, a side, and dessert).  However, Fleming's was having a Memorial Day Weekend special where the prime rib dinner cost $29.95.  Totally a great deal, especially because the sides and desserts alone can be over $10 a piece.  A normal full course dinner for 2 can cost around $150, without drinks.  For this meal, my boyfriend and I ordered a total of 3 cocktails during their happy hour (which runs during their weekend!), and the prime rib dinner.  Total came out to $90 (NOT including tip) so tonight's dinner was totally worth it!  Pros- I was a little worried that because the prime rib dinner special was on promotion over the weekend, that the portions might be a little smaller.  Totally wrong.  The portions are their regular size, so my man and I think we definitely got our money's worth!- As mentioned in my previous review, the quality of the steaks were excellent.  Cooked to order.  Quality meat.  The prime rib was a nice thick cut and not dry.  Not too much fat, either, which we totally appreciate.  Definitely some fat, but we didn't think we were constantly trimming down our meat.-  The sides were full size portions and so were the desserts.  We were glad we didn't order an appetizer!   - Fresh ingredients.  My boyfriend and I ordered the Fleming's potatoes and the sauteed green beans for the sides.  Not canned, frozen, or whatever.  You could tell both side dishes consisted of fresh ingredients.  A good quality restaurant can distinguish itself by using fresh ingredients in everything.  - Excellent service.Cons- Unfortunately, because we had a meal that was on promotion, we weren't able to use our gift card.  However, the manager was nice enough to extend our gift card for another 5 months, which made up for it.Tips/Recommendations- If you do get a gift card, make sure you read the fine print.  Apparently, our gift card can only be used in the dining room only and cannot be applied to promotional meals.  In other words, we couldn't use the gift card at the bar to take advantage of their happy hour specials.  I understand the logic behind it, but it's still kind of a let down.  If you want to lure customers back and promote brand loyalty, there shouldn't be so many restrictions.  - Be on the lookout for promotions!  If you sign up for their email updates, you'll know when they're having great deals.  That's how I discovered the Memorial Day weekend special- an email update.  I've always been good at spotting deals and saving money, and as my boyfriend would say, \"That's one of the reasons why I love you so much!\" Hahaha....Final Answer- Been back and will be coming back again!"], ["Kathleen B.", "My hubby and I came here for our anniversary at the recommendation of friends - I guess I set my expectations too high.When I pay $40 for a petite filet that was not cooked the way I asked for I guess I get a little testy. The service was exceptional and they corrected it immediately. I love filet but this one didn't make my mouth water - pretty middle of the road. The sides were yummy - but I didn't go there for the sides - it's a steak house. The wine was good and kept me happy. We didn't order appetizers because we knew we would not have enough room for the steak. The truffles they sent home were delicious and probably the best part of the experience. Maybe it was just an off night but we will likely not try this place again unless it's restaurant week because I'm just not chancing having an ok steak for upscale prices."], ["Candace C.", "I've never had anything here that wasn't crazy delicious. Wait staff always bends over backwards to help and accommodate, VERY friendly. They always have an awesome dish to recommend (not to mention a wine that pairs perfectly with it). The happy hour 5-6-7 deal is awesome. Can't get enough of their calamari! Especially for $6! Full dinner can get pricey (especially if you're like us and order mulitple bottles of wine) but for a special occasion, so worth it."], ["Chastity L.", "My daughter & I have frequented Fleming's on several occasions, we always sit at the bar.  On more than one occasion we have had the pleasure of being taken care of by Art, who is very knowledgable in everything from dinner menu, cocktails & wine.  We continue to visit this establishment due to his outstanding guest service....always above & beyond!!"], ["Tammy M.", "WOW !!  A 3-course prime rib dinner on Sunday night for only $29.99.  We had never been to Flemings (we usually go to Sullivan's) so we thought we would give it a try.  Wine list was extensive.  Had no problem making a selection.  The wine was good.  We choose the wedge salad and it was OK (nothing special at all).  The blue cheese chunks were there.  It is served with only blue cheese (no balsamic).  I like the balsamic......gives it a \"kick\".  The herb bread (with spreads) was also very good.  Served warm.The Prime Rib......OMG !!   My husband took one bite and said \"it tastes like dirt\"......I took a bite and said......BLAND !!!  It had NO taste at all.  NO seasoning......YUCK !!I guess we should of sent it back and got something else but honestly, it left a \"bad taste\" in our mouths for this place.  The sides (which are served family style) were OK.  NOT great !!I can say that the chocolate lava cake was fabulous.  I have had this often at different restaurants.  Here, you have to wait an additional 15 minutes if you order it.  REALLY !!???  It was not that special.   We won't go back.   The atmosphere was kinda \"stuffy\" for us."], ["Michelle S.", "Can't talk enough about the dry aged strip. Delightful. Pair with markham merlot. Have the key line tart. Sit in the bar with Bethany, art and nick. Can't go wrong."]], "Yard House": [], "McDaids Irish Pub & Restaurant": [["Jennifer B.", "$5 signature cocktails special today. They have \"not your father's root beer\" too! On tap Stella, Harp, Smithwick's, Guinness, Magners Irish Cider. Chandler at the bar is friendly & funny, we will return here just to see her!!! Found a delicious 15 yr old scotch so smooth Dalwhinnie mmmm. We had a delicious smoked Gouda grilled cheese on rye (you can choose other cheeses and bread, there were also toppings you can add for a small charge), delectable tomato soup that came with a dark soda bread, the Thai-Reland Chicken nachos sans chicken sub short ribs for an additional $3, HIGHLY recommend!MONDAYS $3 Magners 16 oz$3 Irish WhiskeyTeam Trivia 8pmTUESDAYS $7 lg burger$3 local draughts 12oz$3.50 Catholic school girls (vodka, peach schnapps, pineapple juice, splash Sierra mist, splash cranberry)Karaoke at 9pm (seasonal)WEDNESDAYS1/2 priced Thai-reland chicken nachos 1/2 priced wine glasses & bottles$3 Hoptimist IPA 12 oz draughtsDJ dance party 10 pmTHURSDAYS $2 brown bag mystery beers$3 baileys Irish cream cheese cakeFREE comedy show Every LAST Thursday of every monthFRIDAYS $8 beer flights 30 oz$7 Irish Whiskey flights 3 ozSATURDAY $5 signature cocktails special$3.50 Not Your Father's Root BeerSUNDAYS$2 PBR 12 oz$3 build your own Mimosa bar (fresh fruit purées & chilled syrups available)"], ["Nick P.", "Downgrading for some bad service. Sat at the bar when the place was dead, asked to have the Alabama-LSU game put on TV. Bartender put it on. But then a little while later, some people asked the same bartender to have another game put on, and she put their game on. WTF!? I was here 1st and wanted to watch the Alabama-LSU game!"], ["Lori R.", "Nothing makes Husband happier than a restaurant with \"pub\" or \"tavern\" in the name.  So when a Groupon came out for this pub, I knew I had to purchase it.  Sure enough, Husband was asking to go right away, so off we went to Hillsborough Street on this hot Saturday afternoon.  Am pleased to report that parking for free on the street was no problem.  Am assuming most of the students have scattered.  It's been a long time since we've been to this part of Hillsborough Street, and it's looking a bit run-down, but then there is this McDaid pub oasis that is worth trudging through the college desert to find. We pretty much had the place to ourselves for awhile, which is a shame, because it was really good!  Dana was our server, and she treated us right.  Camel Husband is hard to keep hydrated, and she managed to do so.  We both had unsweetened iced tea, but Saturday is $5 drink day.  You can pick from their specialty drinks for $5.  Husband tried a cherry whiskey one that had Dr. Pepper in it. (uh, to each his own, but he liked it okay).  I had to try a Bloody Arse.  Hah, who could resist a vodka drink with that name?  It involved an orange vodka with ginger beer and grenadine.  I would have liked it a lot better, I think, without all the ice that watered it down.  Both of us were glad we didn't pay the regular $8 price for them, but still they were decent.  Now the FOOD...uh, Husband insisted (okay, perhaps I was the one that noticed them) on the pimiento cheese fries.  These were even better than described:  \"Hand Cut French Fries topped with house pimiento cheese topped with chopped bacon and scallions.\"  The bacon was excellent quality and there was cheese sauce and cheese, pimiento cheese... cheese on cheese and it was beyond rich and way too good! (see drool-worthy pic)  Fortunately Husband ate most of this.  I was trying to pretend that the hour long Pump class I had gone to earlier was going to ward off the evil fat calories, but finally had to say what-the-heck and enjoyed every amazing bite.   Meanwhile, I had to try a small order of the 2 Gingers Whiskey Wings.  These are \"Irish Smoked Wings tossed in 2 Gingers Whiskey Sauce\"  (think honey and whiskey)...smoky, sticky and finger-lickin' good.  Husband doesn't do bones, so I was on my own, which meant taking some home.  Made for a perfectly respectable dinner later.  Highly recommend these to wing lovers!   Now, we had to do our $30 Groupon best (couldn't include alcohol), so for our mains, I chose the Boston Bibb Salad. And Husband chose the Guinness Braised Short Rib Sandwich.  Both of these were excellent!  Husband was finally feeling the rich fries pinch, so he only ate half of his sandwich. For a dollar extra he loved the side salad.  Both of us loved how they grill the red onion that goes in salads.   There is so much more to explore at this Pub...from family platters, to brunch, lunch specials, trivia, and comedy that we will so be going back!"], ["Christopher H.", "Let's see now.  Overall a really good experience here.  I'm new to the area and have been trying lots of bars, restaurants,  pubs, etc and always find my way back here to good Ole mcdaids at least once a week or twice.  Bartenders are pretty chill, and make an amazing atmosphere no matter the time of day.   Food wise I would say the create your grilled cheese deal is awesome.  Make it however you want it day or night at least when the kitchen is open.  Their chips are good even on their own.  Which I sometimes order 3 of them.   Oh and definitely try the pot roast I promise you won't disappointed.  Swing on by and have a good time.  Especially with this crazy heat.... hmmm I should hit the pool.."], ["Blake M.", "I'm a grad student at NC State and my department's building is literally across the street from McDaids.  Whenever we have a guest to the department, whether a speaker or job candidate, we generally go to McDaids after the days events for a drink.  And none of us like coming here.  We basically only come here because we have a colleague who uses a wheelchair and Mitch's isn't wheelchair accessible.The staff generally have no clue what is going on.  This past visit, an employee close to tears demanded her manager tell her what she did wrong right in front of our table.  It usually takes forever to get your check or even a glass of water.  Maybe we only come here on days when the drink specials aren't for my beverages of choice, but I find the drinks to be way overpriced.  Between the clueless and incompetent staff and overpriced drinks, I would never come here independently.To be fair, I can't review the food.  The menu isn't vegan-friendly and we only ever come here for drinks."], ["Michael M.", "Being in the area I have tried this place a couple to many times. With disappointment every time. I will say the first time my girlfriend and I went in we had a pleasant time. But now it's to the point we'll never return. With bad attitude employees to watching them marrying liquor bottles, and a disappointment on the food. One of the last times I was in before this, the bartender treated his other coworkers with disrespect. Finding out that an employee was having a party there that night the bartender was acting like it was gonna be a big deal that 20 people were coming into the bar when there was literally 3 people there to begin with, (and this being a saturday night at 7pm). Every time I have been in there there's only been one waiter or waitress on and if they were to get busy they can't handle it. I will say the server we had last time was very attentive and it was busy for it being a snow day. One of the biggest disappoints was ordering a whiskey on the rocks and finding out it was an additional 2$ for it being on ice, and I can say they charged for the ice because there wasn't hardy any whiskey in the glass. it was watered down by the time it was given to us. The menu in general is a headache trying to figure out what has an additional charge is and what isn't . The menu looks like a 3 year old wrote it. For anyone that lives close and is looking to go out to a bar please save your money and spend it on something better than McDaids, this place deserves to be shut down and not have any business. We will never return and make sure to tell people not to eat or drink there, especially for the bartenders attitude the curly hair guy who thinks he's better than everyone else. Hope this helps make your decision!! Don't eat or drink here!And I forgot I watched a father and son walk out because he was gonna be charged a ridiculous amount of money to add another piece of fish to his fish and chip plate and no one was being helpful or caring about it."], ["Monica W.", "We came in for dinner on a Sunday night.  The place was pretty empty except for the bar area where people were watching football.  There was no hostess, we looked around and almost walked out when the hostess came from the bar area with her phone in hand, texting.  She walked up to the hostess stand, finished her texting, then asked us how many.  Did that really happen? Yes, yes it did. Our server overheard me ask my husband if that really just happened?  He was very helpful but we waited almost fifteen minutes for a beer and glass of wine.  The server was very apologetic and throughout the course of the night very helpful. We ordered the Cottage Pie and Braised Pot Roast.  The food was on point, very good, good portions, decent prices. I want to see a good place on Hillsborough succeed, but they have got to have some management present.  I only saw the one server and bartender the rest of the night."], ["Jeanne R.", "Although I haven't been back yet, I just realized that after my last review the Business Manager replied and apologized for our bad experience.  I really appreciate that and will be sure to give this place another chance."], ["Chandler C.", "Awesome food and cool people!!! Must come and hangout at the bar and have some \"fish and chips\". Also you can never forget the great Irish whiskeys they have."], ["Anthony G.", "I had a reservation for the private room and without notice when we got there they had decided to cancel our reservation for a party of 20. They were rude about it and the servers were impolite. I wonder why people who are not friendly end up in a people business? The food was bad and the place seems like commissary at Litchfield. This place is only good for college students drinking and eating greasy French fries."], ["Fernanda S.", "This pub is the most recent addition to Hillsborough St, and everyone at State is celebrating - the Irish style. I came for lunch with a friend and had the McDaid's burger, it was pretty good and quite big - I almost didn't finish my plate. They also have different options of food if you feel like eating healthy. The view is quite pleasant, you can choose to sit outside and enjoy the view of campus just across the street, adequate for a Fall afternoon. Their beer selection, of course includes Guinness, and a couple other European beers and ciders (mostly Irish,English and German). So if you want to enjoy the EuroCup or perhaps watch the Irish Rugby Finals while drinking a proper Irish beer, this should be the place to be."], ["Alexander A.", "Actually really good! Waitress was a bit off and the dessert was expensive but overall the food was fantastic!I had Thai risotto and my friends tried the Reuben and the burger. All were great. Would recommend to a friend."], ["Nash P.", "Always a great spot to grab a drink and some food in an awesome atmosphere. Tyler always makes us feel at home. Perfect spot for a meeting."], ["Victoria Y.", "This place is okay. The food is pretty good, but nothing overly impressive. I can't really say much other than that. The waitress we had was nice, but she didn't really seem to care to be there."], ["Rich B.", "I would really give this place 3 and a half stars, but that's not an option.  McDaid's looks almost identical to Porters.  It appears they kept most of the same furniture, except the bar stools are mix and match.  Walked in today and we were greeted by a super friendly hostess and seated immediately.  I was happy she put us near the bar, as there were a few families down in the restaurant section.   The bartender was our server and did a good job.When we looked at the menus, the first thing we noticed were the high prices.  The sandwich prices were par for the course nowadays I guess, but everything else just seemed high for what it was.  $12 for fish and chips?  I'll pass.  Ordered the corned beef and cabbage, as the picture they had online for it looked absolutely delicious.  I figured at $14 it would be just about the same as the picture.  I was wrong.  The corned beef was delicious, but there was no cabbage.  They had substituted brussel sprouts for the cabbage.  Yuk!  The carrots were undercooked.  On the plus side, the sauce was great and they didn't put too much on the food.   They had $2 beer specials which is great.  Didn't have one today, but definitely will in the future.   I'll be back to McDaid's, but hopefully in the meantime they tighten up a bit.  I'm sure any negatives were due to the fact they opened just about a month after Porter's closed."], ["Ken D.", "I can't believe I forgot to write a review for this. I LOVE this place. Has become my go to place for food or just a beer. At this point i've had practically everything on the menu food wise and beer wise and i've definitely had all of their whiskey. Please give this place a shot even if you've been here before! They've improved even since I started going there"], ["Alicia X.", "A good place to hang out for NC State students, just steps from D H hill library. I had lunch here with a friend. We order the cottage pie and slice corned beef. Both very delicious. The beef is very well cooked and very soft. The pie is made by potato and has beef inside, yummy!"], ["Hilary O.", "A chill Irish Pub...conveniently located downtown Raleigh. Good food - but nothing mind blowing that I saw on the menu. I went with the curried chicken salad sandwich and it was surprisingly delicious - great flavor and texture. The waitress was very sweet. Good hamburgers too. Definitely give the blue cheese Mac and cheese side a go if you're not calorie counting of course :)"], ["Hannah W.", "Some of the best chicken fingers I've had, but the service was HORRIBLE. They had $1 off beer flights but when my friends noted the discount wasn't taken off when the checks were handed out the waitress replied with \"Oh well we got busy so stopped the special.\" I'm sorry.. what. It was advertised all over the place, and you just can't do that. It took forever for all the food to come out, and everyone in the group got their food at different times. Probably wouldn't go back. It's a shame Porter's isn't still there."], ["Andrea F.", "I took the family for lunch hoping for great Irish food. We were disappointed. No classic Irish stews, the Ruben was marginal and the lunch special salad was the size of a small side salad. The service was good. And the atmosphere was nice though there were a lot of flies.If on Hillsborough St there are better , less expensive places for lunch."], ["Jessica R.", "After more visits, I am updating my review for three reasons: 1) The staff are very friendly and accommodating, particularly Rachel at the bar - she's great!2) After trying more of the menu items, the good is quite good. 3) They are trying to bring more of a happening scene to Hillsborough St., which I appreciate. Especially trivia on Thursdays!"], ["Joanna F.", "My new favorite spot on Hillsborough St! Went here for drinks, dinner (meatloaf!), and a comedy show and all three were excellent, and the atmosphere couldn't be beat."], ["Ashley B.", "Meh- it's just okay. I much preferred the gastro-pub/ bar food done properly that Porters offered. This seems to be just another bar aimed at the college students across the way. Food isn't anything to write home about and neither is the beer selection."], ["Michael L.", "Visiting NC State with our son and had dinner here. Outstanding service and great food. Amazing selection of whiskeys.  I eat at Irish pubs frequently and highly recommend this one."], ["Randolph C.", "Really surprised - great versions of Irish pub standards. Fish and chips and pot roast entrees were both excellent. Prices for food very reasonable, will definitely be visiting this place again."], ["Haynus S.", "McDaid's opened in what used to be Porter's City Tavern.The restaurant has been redecorated with more dark wood, high top tables, and celtic flair, but the layout is essentially the same.The menu has a mix of app's, soups and salads, burgers/sandwiches, and entrees.  Calamari with sriracha bbq sauce and pub nachos?  But, they do have boxty's and curried chicken.  A decent selection of sandwiches, and the entrees have your usual suspects of fish and chips, corned beef and cabbage, shepherd's pie (made with \"ground meat,\" not lamb), along with a curried chicken dish, which I thought was a nice touch, something you don't typically find in most \"Irish\" pubs.But it ain't cheap!  The have some lunch specials of \"half a sandwich and...\" for $9.Most of the sandwiches are around $9, and the entrees start at about $12, which isn't too bad for dinner I suppose, but I can make most of these dishes myself.Their tap beer selection is somewhat limited (a half-dozen or so beers).  I did not look at their selection of bottles.  They do not have a whiskey list, nor do they offer many whiskeys.  Bushmill's, Bush Black, and Bush 10 year, plus Jameson's and a few scotch whiskeys.  Unimpressive for an \"Irish pub.\"Waitstaff were prompt and courteous.Parking is on Hillsborough Street right across from NC State, so if you're not familiar with the area, be prepared to have to jostle for parking, unless you hit up the pay lot a couple blocks down.For lunch, this place was pricey (about $15 per person, for a sandwich, non-alcoholic drink, tax and tip).If this place is a homage to the \"original\" McDaid's, I would be offended were I the founder."], ["Jon G.", "Big menu but I went with a burger (which is rare for me). Turned out great! Fried egg, bacon and cheddar cheese on soft bun. The egg was only a little runny which was perfect and the bun didn't get overly soggy or sloppy. Blue cheese Mac and cheese was ok, very similar to porters old recipe. Could've been a little more creamy but complimented the burger. \"Big ginger\" drink was tasty. This place is fine for a lunch with a buddy but prob wouldn't do as a first date."], ["Paul S.", "It's what you would expect from a good Irish pub (i.e. same beer selections and food selections) but the quality was better than most.  Wife got the fish and chips, and I got the bangers and mash - both were good and we'd go back."], ["Sean S.", "Good food, friendly staff, and Guiness and Magners on tap!  Definitely a great addition to Hillsborough Street.  A new after work must!"]], "Raleigh Times Bar": [], "Saint Jacques": [["Emmanuel L.", "We came to St. Jacques on my parent's final trip up the East Coast as they retire to France. They had been here many times and had regaled me with how wonderful this place was.As a French person and a food lover, I have a tendency to have high expectations for a restaurant that claims to do French dishes and while I have no idea of the costs of the meal [as I wasn't paying ;) ], the quality of the meal was truly worth the detour - delicious, elegant and leaving wanting more. It was traditional and each dish was truly recognizable while still having a small flair of inventiveness.The pace of the meal was appropriate for this type of restaurant, the mannerism of the staff were spot on, the ambience [noise level, music, volume in the restaurant] was very pleasant. As a lover of art, if there was one thing to say of any critical nature, it would be to refresh the art on on the walls...I hope that the people of Raleigh, NC have St. Jacques around for a very long time to come."], ["Eli P.", "Great food and attention to detail. The decor and attire is a bit formal, but the staff was very attentive and friendly. It's was our first time in this type of place but Danny, our server, was down to earth and helpful throughout. The sweetbreads were delicious, as was the short rib. Great experience."], ["Sandy N.", "The perfect mixture of deliciousness and interesting presentation! The menu changes a lot here, but I love whatever they offer each time I come by! Great staff in an intimate setting!"], ["Vu N.", "I had an amazing dining experience at Saint Jacques on Mothers Day. The service was absolutely incredible and flawless.  There was so much attention to detail in how the food was served and how each course was properly prepped for. It was definitely some of the best service I've ever had from a high end restaurant. For Mother's Day, there was a three course meal for $55 a person. I chose the French onion soup, braised short rib, and chocolate raspberry marquise. Overall, the food was amazing with great depths of flavor in each course.  Although French food is known to come in small portions, I was very full after the three courses. I started off with the French onion soup, which only felt right at a French restaurant. The soup was awesome. The broth was so tasty and the onions were perfectly cooked and caramelized. The Gruyere cheese imported from France really brought the soup to another level. It was so good I had to get an extra piece of baguette to soak up the soup. My mom ordered the mussels in a white wine sauce, and it was also very good. The sauce was so light, yet had a great creamy flavor that really complemented the mussels well without overpowering it. It was a true French classic. For my entree, I had the braised short rib. The short rib was extremely tender, tender enough to cut with a fork. The sauce was really good and you tell they deglazed the pan with a red wine because all those favors were in the sauce. The carmelized onions on top of the beef made the dish. They were so rich in flavor and the wine used to carmelize them was incredible. The beef was served on top of a perfectly cooked risotto with a side of carrots. Overall, the dish was a great success and very filling. The chocolate raspberry marquise was extremely rich and delicious. It is basically a thick and rich dark chocolate mouse that was served over a sweet raspberry sauce.  The chocolate was definitely the star of the dessert end is perfect for any dark chocolate lover. I also tried some of the bacon salted caramel ice cream. If you love bacon, you have to have this!  The bacon flavor is incredibly strong. It literally tastes like you're eating bacon instead of ice cream.  You can really taste the quality of the bacon and how it was perfectly cooked and infused into the ice cream. I love bacon and thought it was a masterpiece. Overall, I would highly recommend Saint Jacques. It was a definite 5 stars and one of the best dining experiences I've ever had."], ["Irem D.", "My favorite is \"Coquille Saint Jacques\". It is really \"A wonderful gastronomical creation.\" Combination of shrimp and scallops is great. You can find delicious French meals here. Service is so good."], ["Graham P.", "Luckily, we were on the company's dime for this visit. One soup, one snails, two entrees and three drinks $122 plus tip. Do NOT order the herb encrusted lamb, unless you are into extremely small portions of meat (5 wafer thin slices about 3\" x 1\") - perhaps the kitchen was running out? Not enough meat or herb crust to even get a glimpse of flavor, which was made even more bland by an undercooked risotto and stringy broccoli rabe. Certainly not haute cuisine! The only positive thing was the onion soup and the home made bread.  Decor is horribly outdated and drab. Restaurant was cold.  Wine very expensive $60+ per bottle. Do not be fooled by the website spouting about the French owner. He sold out to someone else, and he has an American head chef.  There really is nothing French about St. Jacques anymore. Sad.  Never again for us."], ["Peter Y.", "Pure dining experiences don't get much better than this. From the exceptional service, to the outstanding food to the amazing atmosphere; Saint Jacques has it all.There's a reason why Saint Jacques is littered with 5-star reviews, and guess what? They're all warranted. From the very moment you step into the door, you're made to feel like a valued, long-time customer. The conversations with the host and servers come easily, especially with the help of their delicious wine selections. If you're an indecisive person like me, I highly suggest you base your choices around your waiter(ess)' recommendations. You can't really go wrong with anything, given their attention to detail with each and every dish. From the amuse bouche samplers to their rustic entrees to the robust, after-dinner coffee, everything was made to perfection. Out of their food dishes, I would recommend the Brie en Croute, Foie Gras, Coquille Saint Jacques and Duck \"en Duo\". But like I said, you can't really go wrong with anything. The best part of everything? You can experience all of this without having to burn a hole through your wallet. Their menu is extremely affordable, especially given the quality and freshness of their food and ingredients. Come here ASAP! I can not endorse this place enough!!"], ["Keiko M.", "Great French Restaurant!When I went there, I was too full to order many things. Once I tried a scallop appetizer, my stomach started groaning again. I ordered escargot and French Pino Noir. Soup de jour was tomato soup. Really rich and so tasty. They served 3 deferent breads. Good but I prefer warm breads. About 60 USD French lunch for two ppl. Sounds pricy but worth it here. But I wish they were a little bit cheaper... That's why I give 4stars.One waiter speaks French and is really friendly. I thought he is French first.Parking lot is in front of the restaurant.I can't wait next visit there!"], ["priya b.", "If there was a way to give a negative star I would. When we arrive in time for our appointed reservation we were rudely told that because we had my son we could not be seated because this is a \"fine dining\" restaurant. We have been to much more, five star, fine dining restaurants in New York like per se and Daniels, which were much more crowded than this half empty place, and never been turned away with our son. All the other finer dining restaurants knew how to treat children well. Not to mention our son is extremely well behaved having been to much nicer places than this.  So readers beware don't try to go to this unfamily friendly Resturant in a strip mall in Raleigh because they apparently believe it's ok to turn away people."], ["Patrick F.", "One of the better meals we have had in Raleigh, although one of the most expensive.   Had the Brie, foie gras, scallop, sea bass, and short rib.  Everything was prepared to perfection and delicious.  Sommelier was knowledgeable,  and service was good.  A diamond for sure."], ["Laura H.", "From booking to leaving everything was fantastic. Our table was ready and waiting for us. Great service without being over bearing. Useful practical advice on menu items, no pretension at all.The food was SPECTACULAR. It was well seasoned, well presented and well portioned. We had a 3 course meal. being picky...the pate could have had a little more kick to it and some music...or slightly louder music would help with early evening ambiance. I certainly don't want loud music but a little touch would be nice.Highly recommend...go here right now!GO!"], ["Snazzy M.", "Holy mother of God this place is amazing. I am trying to figure out another excuse to go back to Raleigh after my business trip this week.The servers are gracious, the food is SPECTACULAR, the ambiance is surprisingly quaint and romantic for a strip-mall French place.. :) Go here, post-haste, and get yourself some Coquille St-Jacques, stat."], ["David L.", "Food: 3Decor: 3Service: 4Been here about 3 times for dinner in the past month or so.1. Cranberry wheat bread and sourdough bread~Pretty good. I really enjoyed the wheat bread, and the sourdough bread was okay. Would have liked both hot.2. Crab fritter with strawberry amuse bouche~Okay. Didn't really taste the strawberry, and the fritter could have been hotter.3. Mixed green salad~Okay. 4. Striped sea bass special~Really good. Bass was cooked very well.Service was pretty good."], ["Norma G.", "Oh my - what a experience! This was my second time dining at Saint Jacques and it is officially my favorite restaurant. From the moment you step inside, you are treated like a VIP. The soft music playing in the background, white tablecloths and chair covers, and superb service makes each meal here so very special. My friend is moving away (so sad) so last night was our Bon Voyage celebration. The owner Lil Lacassagne is a wine expert, and visits each table, offering to recommend wines based on your preferences and the dishes you are ordering. We shared the Cheese Tasting (a selection of French cheeses served their spice and carrot bread, home baked baguette crostini. Accompanied with honey, nuts and grapes), and Lil recommended the Vouvray. When I tasted the cheeses and then sipped my wine, I finally realized what wine pairing means - it took my taste buds to the next level! I had to order a 2nd glass. It was spectacular. Another server came around with a basket of 3 different fresh breads. Last night they had cranberry rolls, salted focaccia, and rosemary baguettes. I tried the cranberry roll and a slice of rosemary baguette. Both were delicious.For my entree, I chose the Spring Lamb \" Chasseur\". This dish was braised lamb in a dark tomato, mushroom and caramelized onions stew. Succulent reduced roasted juice, served with homemade goat cheese gnocchi. OMG - when the plate was placed before me, the aroma made my mouth water and I had to hold myself back from inhaling it. Slow down and enjoy it Norma! Savor every bite! I had a glass of Cotes du Rhone with this dish.Not wanting this meal to end, we decided to share the cherry clafoutis. So good. We had a wonderful evening and I cannot wait to return!"], ["Nadia Z.", "Lovely place!As soon as you walk in, you feel like you are in another world (forget about the strip mall where you parked ;))Service is fantastic & friendly.Food is absolutely fabulous.Owner LiL, is adorable & makes you feel at home.Raleigh peeps, give this place a try, it's worth it!Great for a date, a family or a girls night."], ["Michael H.", "Saint Jacques is easily in our top 5 restaurants in Raleigh. In fact, I'd put it in the top 3, and on some days it would make the top of the list.This is real French cuisine; not the heavily salted, drenched stuff that so many people pass off as French. This shouldn't be that much of a surprise since the owners are French (in fact, they organize annual trips to France).The only thing that's deceiving about this restaurant is its unassuming location. But please don't let that trick you; when you come through the doors you'll be in the hands of one of North Carolina's most talented culinary crews."], ["Brian S.", "We went here for our wedding anniversary and had a very enjoyable time.  The food was very nice and the ambience was actually quite nice given it is essentially in a strip mall.  I personally think the price was a little high for the overall experience but for the North Carolina area, it would be worth repeating.  We did have a mediocre wine selection which was grossly overpriced (as to be expected) which did bloat the bill some.  They did bring us a nice dessert with happy anniversary written in chocolate on the top of it.  Overall, it was a 4.5 out of 5.0 but unfortunately we have to give it either a four or a five and I feel for Raleigh it deserves the nod for a five."], ["Samantha W.", "I met a longtime friend here who's a regular.  And for good reason.  This place is amazing.  The service was attentive but at the same time, we had enough space to chat, sip, and dine.  I am not a fan of onions in any way shape or form.  Except for the onion soup here. It is divine! Bursting with flavor, hot and cheesy.  The beef bourguignon, a French staple, was delicious and paired well with my red wine selection.  The beef was fork tender and the sauce enhanced the flavor without overwhelming it, as good French food should.  We ended our meal with the chocolate mousse.  It is as rich and decadent as you can imagine.  It's too bad I live on the other side of the Mississippi, or else I too, would be a regular here!"], ["Sam Z.", "If you're looking for good French food in Raleigh, come here! It was the best French food I've had since living in Raleigh and such a great atmosphere. The service is phenomenal. The escargots and scallops were delicious as was everyone's appetizers and entrees. The desserts were good but not as good as the rest of the meal. Be sure to try this place for a special occasion and make a long evening of it to fully enjoy it!"], ["Andrew D.", "For the prices they charge, This old-fashioned strip-mall French restaurant invites comparison to actual French restaurants in France, and by that measure they don't quite stack up.The good:**Coquille St. Jacques appetizer was spot on**Escargot app was good not great**My wife loved her duck 2-ways (1 in a crepe)**I loved my elk special (at $42)**Service - top-notch and personableThe so-so:**bread wasn't warm or fresh (again, at these prices those things matter)**the amuse bouche was also cold, and just OK**Their specialty dessert - at $11 - was a scoop of vanilla ice cream, with something crunchy on the outside, with a little chocolate sauce drizzled on top, and pretty disappointing."], ["Yelp H.", "I don't think there are sufficient words to describe what a diamond this place is. Took my husband here last night for his birthday. All I can say is, our experience echoed all of the wonderful reviews found here. Everything about this place is top-notch - the decor, the staff, the food. They made us feel incredibly special, in a very sincere way, and we literally felt like we had been magically transported to France. Probably the best dining experience we've ever had. Worth. Every. Single. Penny.Do it...go!"], ["Ben B.", "Amazing food! I eat out a lot, far more than I should, so when I say a restaurant is the best I've been to in years it means something. Well I can honistly say this may have been the best restaurant experience I have had, ever.Where to start? To food was fabulous, every single course was delicious, perfectly cooked, and perfectly seasoned. The menu is great, the service flawless, and the decor and ambiance spot on and very intimate and inviting. Heck, even the portions were perfect in size, not too big and not too small. The price is also shocking reasonable given the food and the service.I wish I could give this place 10 stars, I would (and will) absolutely eat here again!"], ["Jo D.", "We had an amazing dinner at this place.  The waiter James was so helpful with picking out wines, to dinner to dessert.  The service was superb!  Can't wait to go back there again !  Thank you for great food , service and atmosphere:)"], ["Bovinius M.", "Delicious French food and impeccable service without being overly stuffy or pretentious. The Foie Gras 2 ways was lip-smackingly rich and creamy.  I preferred the seared hot version as it brought out the earthiness of the liver more.  It was served with a little pastry and a sweet caramelized onion.  The port reduction was sweet and complemented the dish. The duck I left up to the Chef to decide the temperature--I think mine was medium to medium rare? It was pleasantly pink in the center.  The duck was succulent and rich without being greasy.  It came with a small pile of wonderfully seasoned spaghetti squash which had just enough of a chew to add some texture to an overall soft dish.   There was a savory delicate crepe  stuffed with duck, dried cranberries, and mushrooms.  Everything tasted great and each component of the dish balanced each other beautifully. I ordered lemon mille feuille for dessert.  Crisp layers of pastry with lemon mascarpone filling.  The lemon is not overly tart and incredibly refreshing.  The top of the dessert had just a few curls of lemon zest.   Very fresh and bright dessert.  Portions I think were just right for me--not too big or too small.  I left satisfied but not stuffed to the gills. Over the course of our dinner, Lil, one of the owners, was attentive and friendly.  The service here is excellent.  The restaurant is on a the small side but I think that makes for a more intimate and romantic dining experience.  The dress code is business casual but you could dress up a little bit if you're having a romantic evening out.   We came for our anniversary and I definitely want to be back before our next one."], ["Bryant W.", "This restaurant instantly became one of my new favorites in Raleigh. I'll start off by saying a couple things...I'm not a big fan of \"white cloth\" aka fancy restaurants and would prefer a good \"hole in the wall\" joint any day. I'll also so that if I have ever had French food before I cannot remember but if French food gets any better than this then french food may be my new favorite. I am ashamed to admit that I don't really know much about French food outside their bread, cordon bleu and beignets. So naturally I ordered the Brie Pulled Pork and Chicken Cordon Bleu. Sorry, I wish I had taken a picture to post because it was put together very well and it tasted as good as it looked. My girlfriend got the sea bass and it was a very well prepared piece of fish and tasted great as well but I still preferred mine over her's. We also got the Strawberry Parfait for dessert which was absolutely phenomenal.  Everything we had down to the bread was just too notch. This was a true culinary experience. It's definitely a dressy place and the atmosphere there is nice but don't expect to be blown away. Service was as good as the food. I cannot say enough positive things about this place. All you foodies out there are doing yourself a disservice if you have not been to Saint Jacques. When I save up enough money I will go back...ha!"], ["Liz B.", "I can't confirm or deny that St.Jacques, as the website proclaims, is \"the only true French restaurant in Raleigh.\"  I can confidently say, however, that this is authentic French cuisine, served in a pleasantly non-stuffy environment.My Francophile, wine-crazy father has been taking me to French restaurants since I've been able to walk, and I have been to many of the most celebrated ones in New York and Paris.  I lived in France to study art for a semester abroad during college, and have also visited France at least ten times over the course of my life.  So if there's one cuisine I know well, it's French.  After reading all the excellent reviews here, I knew that I had to go to Saint Jacques for my birthday dinner.  After my parents drove down to NC to celebrate with me, we made the trek over to Raleigh to check it out.The restaurant is located in a strip mall, which is unfortunate, but oh well.  I parked outside a karate studio and walked over to the unassuming exterior.  And once we entered...oh.  Weird blinds covering the windows to help us forget that we're in a strip mall, old framed prints on the walls, and weird completely covered chairs which look like wrapped corpses, all in pale whites and greens.  As others have stated, the decor is not the prettiest.  We sat at our table and my father immediately busted out his chosen wines.  (They have a very reasonable corkage fee.)  At first there were issues with chilling the white wine properly, but eventually it worked out.The servers were dressed up in formal serving attire, but most of the diners appeared to be dressed pretty casually.  You'd feel awkward in blue jeans or Birkenstocks, but you can get away with slacks and a button down shirt.  The service was refreshingly unpretentious.  Our server had a strong Southern accent and was very knowledgeable, yet good-humored.  You're not going to get a Pepe-Le-Pew with a perpetual sneer and nose in the air.We got a smoked salmon amuse bouche in a little spoon, which was fine but underwhelming.  They make their own bread, and we had a choice between three types: a white rosemary (by far the best), a focaccia, and a wheat (too hard and not memorable).  They were frequently out of the white rosemary, which frustrated my bread-loving mother.APPETIZERS:Mushroom risotto (my dish): very creamy, very rich, and a bit too heavy/salty for me.  I would have preferred to taste more mushroom and less cheese/cream, but the texture was impeccable.  After the first few enjoyable bites, it became a struggle to finish.Beet and goat cheese salad (Mom's dish): beautifully prepared red and gold beets with warmed goat cheese and greens.  Light and delicious.  Mom devoured hers.French onion soup (Dad's dish): definitely the star of the starters.  You might think that this is a boring starter when you can get onion soup at any mall restaurant, but the Saint Jacques version is a revelation.  The richest, most delicious broth +  perfectly caramelized onions + gooey melted Gruyere = heaven.ENTREES:Mignon Béarnaise (my dish): medium rare, with already cut skinny pieces of beef accompanied by asparagus and truffle fries, as well as bearnaise sauce.  The beef was flavorful, but not as melty-in-the-mouth as I would have liked.  I was a bit underwhelmed.  The asparagus was cooked perfectly well, and the fries were fine but not as crispy or richly truffle flavored as I expected.  The dish was solid, but not mind-blowing.Black sea bass with spaghetti squash primavera (Mom's dish): the fish was light, moist, and impeccably cooked.  The spaghetti squash was an unusual counterpart but worked well, soaking up the sauces and seasoning to enhance the dish.  Mom loved it but ran out of steam halfway through eating it.Duck \"Aux Picholine\" (Dad's dish): Dad is a duck-a-holic and has duck almost every time he goes to a French restaurant, and thought St.J's version was very good but not extraordinary.  The wild rice side was really the star of this dish; I tasted it, and was blown away by its meaty, earthy flavors.DESSERTS:Cherry Clafoutis (mine): loved, loved, loved it.  I haven't had clafoutis since my last trip to France, and this version was perfectly authentic.  It's sort of like a warm, thick, sweet pancake studded with cherries.Home made ice cream/sorbet (parents): delicious.  There were two flavors, mango chili and dark chocolate.  Both creamy and richly flavored, especially the to-die-for chocolate.  My parents demolished it within a couple minutes.Overall, I was very impressed by Saint Jacques, which manages to offer an authentic French cuisine experience in North Carolina--not exactly a haven for French culture or food.  The decor lacks vitality and elegance (as others have mentioned), and the food doesn't quite measure up to the best I've had in NY and Paris (a pretty high bar), but I was very pleased with my meal here.  I'll definitely return to try other classic French dishes on their menu."], ["Amanda D.", "Sometimes you forget just how exquisite a meal can be. One visit to this gem will surely remind you. This is, without a doubt, one of the best restaurants in Raleigh. From the crisp white tablecloths, the black or white napkins (depending on your attire), attentive service and expertly prepared dishes, you just can't go wrong. Stepping into to this little restaurant is like stepping into another world. The fresh bread was to die for, the french onion soup the best I've ever had, and the butternut squash ravioli was just sinful. So rich and creamy. I just cannot heap enough praise on this restaurant. I will be back!!"], ["Shirley C.", "Who woulda thunk it, one of the best dining experiences of our lives...located in a strip mall, next to a Jumbo China and Great Clips???  That's right folks, Michelin star service in a strip mall.  Service was great from the moment we entered.  We were promptly seated, the hostess pulled out my seat, and changed the napkins from white to black to match our outfits (what restaurant does that???)  Feeling very coordinated we were ready to order:* Shrimp and salmon amuse bouche - small bite of a salmon and shrimp cake, fishy yet refreshing at the same time.* French onion soup - definitely lived up to the hype, the soup was cheesy and sweet.  The hubby drank it up and that says a lot for a man who doesn't drink soup!* Escargot - oh lala...oh so butterly and garlicy.  I was dunking anything I could find into the leftover garlic butter, it was delish!* Sweetbread - interesting...but not a fan.  Sweetbread was cooked in a sweet and sour sauce and laid on a bed of potato, sausage, and cabbage frittata.  Kinda felt like we were eating sweet and sour at a Chinese restaurant...* Lemon sorbet amuse bouche - tangy and cold palate cleanser...yum!* Beef Wellington - special of the day.  Filet mignon topped with foie gras and wrapped with puff pastry.  Serviced with potato and carrots.  The filet was cooked perfectly and the foie gras added just the right amount of richness.  * Foie Gras \"2 Ways\" - cold foie gras on top of a crispy slice of toast.  The foie gras was sweet and creamy on its own.  Pan seared foie gras on top of a caramelized sweet onion and tomato puff pastry.  oh so good, my favorite of the 2.  * Saint Jacques Vacherin - meringue with vanilla ice cream.  Good, but the meringue was easily missed...we thought it was just a dome of ice cream!Overall, food was 3.5 stars but service is definitely 5 star worthy!"], ["Joan D.", "My goodness, is this place AMAZING!!!  One of my very reliable foodie friends has been recommending this place to me for years and I finally made it out there.  We went for lunch and I can't express in words how much we LOVED it!  It's spendy but you will walk away planning your next visit, I promise you that one...GO as soon as you can, you will thank me later!"], ["Chip M.", "There is so much to say, but I'm not sure where to start. I really will try to be succinct. I brought my wife here for her birthday as she loves French food, even my meager stabs at it. We've been to Rue Cler and Vin rouge, and while we enjoyed them both, Saint Jacques raised the bar. We arrived at the strip mall next to the Harris Teeter, smiled and went in where we were courteously greeted and shown to our reservation. Everyone was friendly, the area was small but filled with tables in a way that you still felt private as much as one could expect. The server was prompt and helpful in navigating the menu. I had a lot of questions and he was patient, helpful and not a bit condescending which was very greatly appreciated. Yes, I'm not a gourmand, but please be nice as I try new and fancy food. I usually don't factor in service in my reviews; it's just not an issue for me as I focus on the food. But for those who are interested, the service here is impeccable. Really, you won't be disappointed. Wife started with the bacon and bleu cheese torte with a blackberry gelee that was full of flavor and struck a nice balance. She ordered the duck which came med rare, brilliantly crispy on the outside, moist and tender breast meat, and her favorite part was the port wine caramel sauce that brought out succulent flavors of the duck. I had the sweetbreads, and honestly, they were excellent. I've never had them before so heads up there, but the cutlets were lightly breaded, tender and well-seasoned on a little frittata of potatoes, sausage and cabbage. Very unique and delicious! I then had the scallops with mushroom, roasted pork belly topped with pomegranate foam. Sounds odd, I know, but it added a really smooth and subtle fruit flavor to the scallops, which were excellently prepared by the way. Great dish. It was on a bed of creamed spinach like none I've ever had. Every bite would push a little seasoned cream out the edges and fill your mouth with a sweet prize of fantastical flavor!Desserts were great as well. We had the lemon millefeuille and the Vacherin, each well balanced, not overly sweet, but great texture and taste. Overall, Saint Jacques gets a full 5 stars. I think Nana's is a notch or two better, but that's not to discount the quality and creativity of the meal here. A very excellent choice.Last comment is on the bathrooms. What a pleasant change! They have an assortment of hygiene products, lotion, breath mints, mouthwash, dental floss, q-tips, magazines, variety of feminine products (per wife) and even deodorant. Not that I am into using a communal under-arm product, but I guess if it was that tragic, you'd be grateful it was there. First dates anyone...??? Even the paper towels are sturdier than any bounty sheet I've ever touched. Well done!"], ["Heather B.", "Authentic French Cuisine In An Unexpected PlaceVisit: April 17Within minutes of crossing the threshold of the Saint Jacques, I was transported to a little café in a narrow side alley of Paris. The owners created an ambiance of quaint French elegance making it oh so easy to forget the unfortunate locale in a strip mall, the North Ridge Shopping Center at the corner of Falls of the Neuse and Spring Forest Roads, close to the Harris Teeter. The only difference between the interior of Saint Jacques and equivalent Parisian bistro was we were not seated within inches, elbow to elbow, with other patrons.My husband and I began our journey into Saint Jacques cuisine with an aperitif. We selected the Marquis De La Tour Rose Brut from Loire.  Since we will be visiting Loire Valley this summer, we are trying to learn more about the wines from this region to enhance our holiday. We enjoyed this bright, crisp, and lightly effervescent rose. We decided to share the Old World Warm Goat Cheese Salad. The spinach salad was topped with a oblong piece of goat cheese that was very lightly breaded and pan fried mounted on a crusty buttered piece of French bread. The goat cheese was simply divine. To me, it tasted like a tangy brie...all melty richness with the bite of goat cheese. Very lovely. I really liked the addition of the small grapes to this dish and with the peach vinaigrette, a subtle sweetness added another layer of complexity to the salad.My husband and I try to adhere to a pescatarian diet (vegetarian + fish) so we were pleased to see 3 entrees featuring fish and all 3 sounded amazing. By the way, I later found out that Saint Jacques offers a vegetarian menu with a few items that are vegan and gluten free.  If you are a vegetarian, ask for the menu. I chose the Champagne Corvina and Andy ordered the Scallops on Their Crispy Seafood Pillows. Since our knowledge of French wine is weak we asked our server for recommendations for our entrees. He sent the sommelier over to discuss our options. The sommelier was French, loved his accent. I was immediately impressed and confident we would receive a fabulous pairing. The sommelier did something unusual from most of my previous experiences, he asked us about our preferences. We actually had a short conversation about what kind of wines we like and based on this info he made recommendations. Let me just say it...wow! My confidence was not misplaced. The sommelier paired a chardonnay with my entrée, which was a white fish with firm flesh similar to Sea Bass but it was the sauce that the sommelier was aiming for. The Champagne dill cream sauce was lusciously rich and creamy and there was an accent of acidic tomato involved. The un-oaked chardonnay came alive and enhanced the dish while the food improved the flavor of the wine. A sensational pairing. The white fish was perfectly prepared...moist, light, and flakey. The combination of the crabmeat with the white beans, spinach, and cream sauce was to die for. Half way through our meal, my husband and I switched plates. The scallops were a delight, also perfectly cooked so each bite melted in my mouth. I was not overly impressed with the seafood pillows, basically a fried ravioli. I thought the ravioli was dry with too much dough. Andy thought they were great. Well, we are each entitled to an opinion. I did love the lemon and tarragon béchamel cream sauce. Yes, the French know cream sauces and the chef at Saint Jacques knows his/her stuff. The lemon flavor was pronounced and it paired exceptional well with the Riesling from Lucien Albrecht that the sommelier suggested. The wine list comprises wines from the major regions of France. In addition to the extensive collection of French wines, there are a few bottles of wines produced in North Carolina and small selection of bottles of domestic and international beer.Since we shared an appetizer, we had hoped to have room for dessert but it wasn't the case. We will have to try dessert on another visit. Saint Jacques tasted like the restaurants I have dined at in Paris. I can't wait to go back so I can feel like I'm in Paris without the 8 hour plane trip."], ["Anthony G.", "Words cannot describe how amazing this place is. My wife and I made a reservation for 2 to celebrate our wedding and it was the best. From the moment we walked in the staff made us feel really special and even other people in the restaurant congratulated us. This place is filled with love, genuine kindness, and has such a great atmosphere. The food was great! Everything was so delicious (the lamb loin was our favorite) and the presentation was stunning. My wife and I will always remember this night and are glad we can always return to experience our wedding. It was perfect."], ["Alex N.", "The food here is stunningly good.  I really can't recall the last time I had perfectly executed French.  Forget the haute cuisine here.  There are no presentation frills.  Nothing to distract you from the delicious flavor, no photoshopping was done in the creation of this dish.  We ordered the foie, wild boarguignon, scallops, cherry clafoutis, and creme brulee.  The bourguignon was unbelievably good.  It tasted familiar, but yet I had never had it cooked like this.  My only regret was that it wasn't enough.  The clafoutis was traditional in every sense of the term.  Again no-frills and it came out perfect.  I was so consumed marveling at how good my dishes were, I completely forgot to taste the others.Service is unobtrusive, there aren't multitudes of staff mulling about and floor conversation is kept at a minimum.  Pace was great, although we didn't order enough courses for that to be a real factor.  Forget my nothing to distract you comment above.  The decor here is just dated.  It doesn't exude French charm, but rather outdated strip mall restaurant.  The place caters well to the older crowd and in speaking with some friends, there is no real attraction from the younger crowd.  We all know the food is good, but modernize the front of the house, please.4 and 1/2 stars for the perfect food.  1/2 off for the retirement community decor."], ["Shaun B.", "I was very impressed with both the food and the service.  The house made pâté ws delicious.  The onion soup had a delightful broth with a natural sweetness from well-caramelized onions. The steak frites was fabulous and the scallops very very good.  The escargot also nice with a good amount of garni that was perfect for dipping with the house made bread.  BTW, the salted focaccia was unbelievably good. Desserts: a rich Charlotte with carrot cake center and cleverly constructed mille fiulle.  The best part of the experience was the owner.  He visited each table, talked about the food, made conversation, and generally made us feel welcome. Kudos for Raleigh having such a place."], ["Deena G.", "This is the best fine dining experience I've had in the triangle.  Mussels are wonderful, and the french onion soup is to die for.  I've been twice and had two stunning entrees.The wine list is also exemplary.  I visited with my dad, and the sommelier/owner recommended two wines we just loved.  Dad thought it was funny that he strongly advised us to order the cheapest wines we were considering in both cases.  Now that's a good dude!Service is excellent; attentive but not too fussy.  I will definitely be back to celebrate special occasions."], ["Fred B.", "My wife and I ate there Thursday night in celebration of our 22nd wedding anniversary based on the recommendation of a friend. It was absolutely the perfect quiet, intimate place you wish for, for a celebration meal.We started with homemade Foie Gras Pate' and an order of Escargots( I know, boring). Both were outstanding, hard to say which we liked more, but the garlic and parsley butter the escargots were in was as good as I've had. We then shared French Onion Soup(more boring, but classics are classics for a reason) which was rich and perfectly seasoned, with a thick topping of  imported Gruyere cheese.We shared an entree of sauteed Halibut, scallops, and shrimp in puff pastry with a  sauce of butter, herbs, and small green peas. Again simply awesome.The service was impeccable, attentive but no hovering. The Chef/Owner Lil was not there that night, he was on a \"date\" with his daughter, but his wife, Lori was there, and visited our table several times to see if we needed anything. This is just a great French restaurant, the best by far in North Carolina, and one of the best in the country - and we have eaten at some great ones in NYC. We will definitely return, and soon."], ["Anthony G.", "I'm tres indignant! I made reservations three weeks ago for St. Cocks or Jacques to dine there on Valentines day. I got dressed up and we went  to St. Crap.  We got there 10 minutes early and the woman could not find my name finally we were found and seated. The place was tres Fran-say. very pretty with waiters walking around sans smile and avec waxed faces. We got a prixe fixe menu that was $80.00 dollars per person because it was Valentines Day! I was like what? Now when I made reservations three weeks ago the owner did not say anything about a special menu as he should've mentioned. And today when they called to confirm they did not say it either. We got there hungry and dying to try the food and when I told the owner that no one had said anything about a special menu and not the regular menu he was like Oh, well,  come back another time. Now Had I been the owner I would've apologized and given the person a regular menu because one should always accommodate  BUT instead he was like whatevs bitches. This pretentious place is nestled between a Jumbo China and Muscle Max very attractive very chic. So we went to Tribeca Tavern dressed for St, Jacques and spent maybe $30.00. I could not believe  the lack of respect and customer service.  I will not be coming back to this bitchy Foie Grassy assy place."], ["Chenel C.", "I could waste letters of the alphabet but I elect brevity....this place is ehhhh. I can't even remember what I ate here and that was just last week. I wish I could rate this place as a SMH but alas 1 start will have to do."], ["Michael M.", "A hidden gem.  The reviews speak for themselves, and I echo their compliments.  Saint Jaques provides amazing quality food.  I had the braised beef with goat cheese gnocchi, paired with a great Bordeaux.  Serves was unmatched, hard to believe they're not in the high rent district.  Priced appropriately (my dinner and wine was $45 before tip) and worth every penny."], ["Julie R.", "We just went to St. Jacques for my husband's birthday and it was really an incredible dining experience. The service was warm and gracious, and they made my husband feel special from the moment we arrived. The food was outstanding, also. We had the escargots, short ribs (my favorite!), a grouper special, and the \"Chocolate Ball of Dream\" for dessert. Every bite was perfection. We definitely want to return, and it was well worth the investment to have such a special night. Thank you, St. Jacques!"]], "Tazza Kitchen Cameron Village": [["Emily H.", "I'm on Yelp often, and this place has been bookmarked for a while. After finally getting around to eating here, I just gotta say... it's a shame I didn't come here sooner! Tazza Kitchen is fantastic. My boyfriend and I went here for dinner the other night, and the atmosphere, the food, and the service were all wonderful.We ordered and shared the following three items:1. Cast iron goat cheese appetizer 2. Kale and chilies salad (w/ chicken added) 3. Spicy sausage and black pepper honey pizza All three were off the charts.. so good.. why didn't I come here sooner.... goat cheese appetizer.... warm, delicious bread........ kale and chilies... spicy sausage..... pizza.. mhmSorry, so easy to get carried away with food as tasty as this. Anyways, from what we experienced, the quality of the food here is top-notch. Fresh and flavorful--you can taste the difference. I didn't feel like anything was overpriced either, especially for the quality and portion sizes. An appetizer and two entrees were able to fill us up pretty well, and let me tell you, we can eat. The atmosphere was nice and relaxed with the decor being a mix between modern and rustic, which again, I adored. Overall, I had a great time. No major no-nos in my book :) If you haven't ventured here yet, I urge you to do so! You won't be disappointed."], ["Kelsey T.", "I FINALLY got to try the Spicy Sausage and Black Pepper Honey pizza that everyone has been raving about! If other restaurants are smart, they'll start having honey as a toppings option also. The contrast between the spicy sausage and the black pepper with the sweet honey worked amazingly. Another thing that I really like about Tazza's pizzas is that they have very thin crusts. It makes the pizza not too filling and I don't feel like I'm in a food coma when I finish, unlike my experiences at most pizza places. I wouldn't recommend these pizzas for sharing, unless you are ordering some other items, because of this reason (And also because it is just too good to share). But another thing with them having such a thin crust, is that the weight of the toppings and cheese overpower it a bit, so the crust went somewhat limp. But it really does taste amazing.Now that I've done my part raving about the pizza, back to the rest of the meal. I'm a sucker for goat cheese and I knew I wanted to order it after seeing the many pictures of it on yelp. It came out super hot, but I couldn't wait for it to cool off. Even when it was burning my tongue, the richness of the cheese was delicious. The bread that came with it for dipping was good too. It was a sturdy bread that could hold its own with the cheese.We went on a Wednesday night and the restaurant was pretty busy, but the service was good The restaurant was very clean and I love the décor. There is something about it that is simple, yet trendy. Overall, it was a great experience and definitely want to come back and try their brunch."], ["Farah K.", "So my experience at Tazza was very disappointing! I will start off with the positives: 1) the customer service was great, the server was attentive, friendly and even comped the chicken on my salad (I will explain later why she did this)2) the decor is cute and cleanNow for the negatives:1) I ordered the spinach and apple salad with chicken. The salad was nothing special and my chicken was EXTREMELY over cooked making it taste like old rubber. I picked out all the chicken and left it on a plate, hence why it was comped! 2) I also ordered a side of beets which were flavorless and watered down- it was a very unpleasant taste. My friend ordered the butternut squash as a side and I was quite underwhelmed.I expected way more considering how fresh and delicious the description of the items sounded but unfortunately as of now I won't be returning!"], ["Sohini G.", "Was unexpectedly and pleasantly surprised by this place! We were craving pizza and came here mildly sweaty in work out clothes. We were a little out of place, however sat outside and wasn't a big deal. Drinks---seemed pretty average. Got a couple glasses of wine. Didn't try any cocktails but the prices were average.  Ambiance/service---cute patio! Great service Food---delicious. We split the chorizo nachos and the sausage and honey pizza. Both awesome. The nacho chips were unique (I think maybe made with fried wontons?) and better than tortilla chips. The pizza was delicious...the sausage and honey combination was amazing. The thin crust was also perfectly baked. They say it's personal pizza size, but splitting an app and pizza was perfect for 2 of us and we left stuffed. Overall great food and a good place to catch up with friends. Would def frequent here if I lived closer, only wish they had a happy hour!"], ["Alexa L.", "Great food! Great atmosphere! okay service..We came for brunch and my fiance got the spicy sausage and black pepper honey pizza, which was very very good--sort of sweet with a spicy kick. I got the huevos rancheros which was pretty good, but not something i'd come back for. The decor is great, and you can tell it's a hip spot as a lot of college students/young professionals seem to eat here.One thing I wasn't a fan of was the service. I understand brunch is a busy time for the restaurant, but we hardly saw the server, and it was a LONG time waiting for our food to come out."], ["Shannan C.", "This review is based solely on my two Sunday Brunch experiences, and I really can't speak to dinner, but I've enjoyed both trips to Tazza and I don't even live in Raleigh (SoDU WHAT WHAT!?!) I've dined here about 11am on Sunday twice and can say that it's a cute spot for brunch. I've had both the Crab Eggs Benedict and the Breakfast Platter. The crab eggs Benedict was really good, but not quite enough food for a large appetite, so the second go round I went with the breakfast platter which was a decent amount of food. Tazza's coffee is also extremely good. Restaurant coffee can be hit or miss. This coffee is on point. So the reduction in a star is the because of the restroom situation. And it is a situation. One that they really need to remedy at some point. There are only two bathrooms- one men's and one women's and its really not enough for a busy restaurant. I'm not even 100% sure how the building code restroom requirement is being met here unless they've slowly added more seating since they opened..."], ["Elizabeth K.", "\"Know your farmers, love your food.\"^^^^^^^^^^^^^^^^^^^^^^^^^^^ already a good start!Tazza has a wonderful, unique wine selection. I like having more by the glass options that tastes great than having to choose a bottle from pages of wines.. (I recommend the Cococciola!)The food was simple and delicious. We had the shrimp & crispy polenta and the garganelli pasta & fennel sausage. I liked the fresh tomatoey-ness of the first dish, but not a huge fan of the texture of the polenta. The exterior was crispy but since most of the polenta has been soaking in the broth, it was mostly mushy. But I liked the earthy flavor of the polenta. THE PASTA WAS DELICIOUS. First off, the pasta was perfectly cooked. I mean, not overcooked and not too al dente; it was just perfect. Combined with the salty fennel sausage, it was a simple pasta dish that I will daydream about for days. The chocolate budino is luscious. Presented in a small glass jar, it looks like a homemade chocolate pudding/custard/mousse/fudge goodness. The topped almond and salt flakes really helped compliment the richness of the chocolate. It may be a bit overwhelming for those who aren't obsessed with chocolate though. I thought I was....but good thing my friend and I shared one!No big complaints about this lovely restaurant. Prices are just as expected for $$. Great vibes, friendly service, and yummy food & wine. I definitely plan on returning!"], ["Brittanie H.", "We come here pretty often and it's always spot on. Tonight we got something old and tried some new things. Instead of my Moscow mule, I decided, per our awesome waiter's suggestion, to opt for a Kentucky Mule which is the same just with bourbon instead of vodka. It was quite tasty and still had that ginger beer punch but with a smooth, southern quality. For a starter we did the poppy Caesar which is a really well-executed version of a traditional Caesar. However, the lackluster romaine is replaced with a beautiful rainbow chard, the Parmesan with gran padano and beautiful brown butter croutons. The dressing is clearly made in-house and is light but flavorful. You will scrape the plate for every dressing covered shred of gran padano! Mark my word. For our entrees, we got our regular spicy sausage and black pepper honey and we also tried the three meat. Let me just say that the sausage and honey NEVER disappoints. The honey melds so well with the sausage in a way that's truly above the status quo. They have a similar spicy sweet pairing with the three meats. It's topped with a carrot slaw which creates a perfect balance of flavors. This is no ordinary pizza my friends. This is premium-ingredient, farm-fresh amazingness. The meal was great from start to finish."], ["Shawn N.", "Met my expectations and then some!!! One thing to note...I felt the crowd was a little pretentious for my liking but other than that everything was excellent including the service. We sat inside, the chairs/tables are a little small but you can manage.Food wise....the menu is small but specialized, combos that you may never think about. For example, we had the sausage and honey pizza. The size of the pizza is like a small with very thin crust. Easily tackled by one person. The taste was heavenly!! Everything flowed perfectly together including the nice crisp crust, delish! Also had the chicken tacos w/ a side of watermelon. The tacos were very complex, taste wise. You could tell that there were a lot of flavors but they came together perfectly. The watermelon had a splash of oj with mint and cheese, intriguing as it was it worked as well. Just a piece of advice....call ahead to get your name on the list! We went on a Saturday at 7, when I called it was a 25min wait....took us 20mins to get there...walked in and our table was ready! Enjoy!"], ["Nadia S.", "Oh mi goodness... I have a new restaurant to add to my list of faves in RaleighEverything about this place is amazing.... the energetic ambiance, the option of outdoor seating, the wonderful service, and of course... THE FOOD!I shared a few items with a friend and everything was pretty out of this world.... The crab cakes came with a really tasty slaw.... the scallops with sweet potato risotto, fried sage, and brown butter were finger licking good... but you guys... the black pepper honey pizza.... I have no words. You just gotta try it. SO GOOD. This is def a great place for a fun date night or a girls night out ! Can't wait to come back"], ["Lori R.", "I just love this place.  Don't know why it's not called \"Lori's Kitchen\"!  Quality ingredients done so right.  And not afraid of spice.  Maybe they have a closet I could move into?  Husband asked me where I wanted to go for my birthday, and I did contemplate some of the birthday email freebies that had come my way, but visions of brick oven excellence compelled me to bypass all else and come here.  Let me just say that not being born yesterday means sometimes wise decisions and this was the perfect one!Tazza Brussels Sprouts and Spicy Chicken Wings made for one very happy Birthday Gal...one who refuses to hang her head in shame for requesting to take home a Spicy Sausage & Black Pepper Honey Pizza for day-after-birthday breakfast.  (thanks Husband!)Brussels Sprouts are so full of flavor, and those wings...right up there with the best I've ever had! I have yet to have anything here that wasn't super yummy!  In addition to our fabulous food (Husband devoured his Pepperoni & Peperonata Pizza) our delightful Server helped me find the perfect wine for me!"], ["Gary G.", "Great evening.Inventive yummy food, manageable noise level and cheery service.Spiciest green salad I've ever eaten (fun).Nicely prepared Brussels sprouts (w bacon topping).Very tasty pizza, very hot and we'll topped. Terrific crab cakes, w/large meaty chunks (& not a small portion as I'd read in another review)."], ["Connie L.", "Tazza is now definitely on the top of my list of favorite restaurants in the Triangle area.The atmosphere is super cute. Love the view of the open kitchen and wood fire oven in the back. There's a decent sized bar area too.Started with the Brussels sprouts and goat cheese dip because we couldnt decide on one! And glad we got both because they were perfect together. The goat cheese was mixed in with a tomato/marinara sauce and came with basically the bread/dough they use for the pizza. It was good! but if you don't like goat cheese, beware that it does taste strongly of goat cheese.I make Brussels sprouts all the time at home so I was semi-hesitant on ordering. but NO... GET IT! SO GOOD! I don't even like bacon but it was amazing! super flavorful and loved the mustard seeds.Of course we had to get the black pepper honey pizza which was delicious. I thought it was comparable to pizzeria toro (my friend says toro is better) but i thought it was super delicious. the sausage is super flavorful, slightly spicy, balancing out with the honey, and the crust was thin and crisp. We were awfully full and couldn't finish everything but had to get dessert of course. Got the flourless orange cake with caramel gelato. I am typically not a fan of caramel, but it wasn't overly sweet which was good. the dessert itself was not super sweet in general which was good after a semi-heavy meal.Overall, service was great. Had to wait about 15-20 minutes for two around 7:30PM on a Saturday night. Everything was delicious and can't wait to go back!:]"], ["Alan A.", "Food and service were both fabulous! The goat cheese appetizer suggested by our server was delicious!"], ["Heather M.", "The fact that they only use local ingredients is just a bonus.They really know how to work their magic with their wood-burning oven!Interior is absolutely lovely: dimly lit, modern tables and seats, a nice bar, cool decor on the wall- I was pretty much digging this place the moment I got here.The food was so gooood. We got their spicy sausage & black pepper honey pizza, cast iron goat cheese, and meatballs.I never thought honey could compliment pizza so well! It made my tastebuds go wild~The goat cheese had a surprisingly nice zing to it- no ordinary cheese here!The meatballs were so flavorful and not like the typical meatballs you'd get anywhere.The brick oven bread that came with the meatballs and goat cheese was amazing! Who knew bread could be so good? It had a crunchy crust, yet a moist center.Service was lovely- our server was nice and she made sure we were happy with everything.Mmm the only \"complaint\" I can think of was that our plates came out one at a time in a 10 minute period which wasn't really a problem for us but it could be for groups.No free refills on sodas but we didn't care because who wants to get full on that when you're here?"], ["Amanda H.", "Let's be honest, Tazza - you had me at overhead patio space heater. Admittedly, I was a little disappointed when I pulled into the parking lot to find Cafe Catura no longer there, but I'm so glad we decided to be adventurous and try out the new resident. Tazza is apparently under the same ownership as Catura, so it had that going for it. Top that off with a great new concept (New American, dinner-centric, creative updates to classic recipes, a bar focused on craft cocktails and a quality beer and wine list) and we have a winner! Because it's gained popularity quickly, we did find there was a wait to sit inside. However, we agreed to take an immediate seat on the enclosed patio, which ended up being a great choice. With both a toasty space heater and strings of Edison lights overhead, I think I actually prefer this atmosphere to the darker interior. On top of the stellar ambiance (did I mention the soundtrack was consistently on point? Hip but homey and never too loud) the food was fantastic. We started with a chunky flavorful guacamole served with homemade tostadas, then moved on to a hearty, Crispy Potato and Arugula Salad and rustic Fish Tacos. Both were unique and impressive. I took half of my salad home as leftovers. It didn't even make it to the next day -  by 11pm I was retrieving it from the fridge and starting this review. Bravo, Tazza! Looking forward to trying your brunch and writing an update soon :)"], ["Larry G.", "Now this place is legit.  There are a ton of good restaurants in Cameron Village but I'd say that Tazza Kitchen would be my top choice.  From top to bottom, all of the courses were superb and I can honestly say that I can't wait to go back in a few weeks when the family is in town.  We ordered across the menu from appetizers to deserts, and you can't go wrong with any dish.Service was strong and the atmosphere is great.  The yelp reviews don't lie, get on it."], ["Jami C.", "What a fantastic atmosphere! Loved the ambiance of this place. I ordered the chorizo tacos and they were excellent. The service was great as well. No complaints!"], ["Justin M.", "Superb brunch.  One of the best I've had and very reasonably priced.Party of four, patio.  I got the breakfast platter.  Good portion size and good variety already included.  Biscuit and marmalade were great - cripsy outside.  Hashbrowns were homemade - firm, crispy, yet moist.  Crispy bacon with great smoky flavor.Good service.Rest of the group was happy with their pizza and huevos rancheros."], ["Nina Q.", "Tazza is just incredible!  I got a little taste of how delicious this place was when I last came for brunch, but then I listened to my fellow Yelpers and got the Spicy Sausage and Black Pepper Honey Pizza and my life hasn't been the same.  I try to come back every 1-2 weeks to get the pizza for take-out because its just SO GOOD.  The honey plays really well with the hint of spicyness from the pepper.  The freshness of the ingredients also makes the flavor pop.I've also stopped here for other items on their dinner menu.  We had the meatballs (pork, beef, veal, grana padano, parsley, brick oven bread) as an appetizer, the Chicken Stuffed with Prosciutto (over celery root purée, tomato reduction) and the Bolognese pasta.  Tazza has a seasonal changing menu, so I think these two main course items are on rotation right now.  Everything we ordered however was amazing!  The flavor was packed in every bite and even better than we imagined.  The meatballs were a little runny, but they packed in a lot of meat onto the plate.  Hands down though, I'm ordering my Spicy Sausage and Black Pepper Honey Pizza the next time I come in...it's the absolute best."], ["Anila Y.", "I probably don't even need to review Tazza Kitchen, but apparently their menu changes. The pizza I had (Charred onion and olive) was great. It was definitely an artisan thin crust pizza, and very flavorful. The staff was very friendly and attentive. What i loved the most was the ambience however. The decor was perfect and I love the open kitchen that you can look into while you eat. I would definitely recommend coming here for a date or a special occasion. Added bonus: one of the few places open past 10 :) Another added bonus: Their jalapenos are SPICY!!"], ["Sue W.", "I went there for Sunday brunch.  The seating was fantastic. They have both indoor and outdoor seating.   There were plenty of seat so there was no waiting in line at all The food was excellent.  I had the crab crake omelette and it was delicious.  Also the French toast was yummy too.  Our waitress was very nice and patience and came by often to checked on us.  Def will go back again.  Want to try their dinner"], ["Christina C.", "Went here on a Friday night with my husband. We wanted to try somewhere new and this place had gotten great reviews on Yelp. And now I know why! The food is really really good!! We started with the Brussels sprouts...once I saw bacon jam I was sold. They were delicious and I wish I could make them at home!! My husband had the black pepper honey pizza for his entree which he said was good. I had the fish tacos which were GREAT! I was hesitant since I've been disappointed with tacos in NC before...but these were creative with original flavors. Very tasty. They came with a side of squash that was also good...it was nice to have a side of vegetable instead of stuffing myself with chips or something. For dessert (yeah we went all out!), we had the almond orange flourless cake with salted caramel gelato...OMG!!! I could've eat 5 plates of this and not regretted it! You must try this if you go here! Apparently there is some guy in Richmond who only makes salted caramel gelato for Tazza Kitchen. And he is a master. Drinks were also delicious and the service was awesome. It took forever for our sprouts to come out and the server took them off the bill! Also, they have a big gluten free menu for us Celiac people. Almost everything on the regular menu is on there except for the pizza - plenty of options which is always nice...and all of the desserts are gluten free! Make sure to get there early because it gets packed and they don't take reservations. We will definitely be back soon!!"], ["Brett M.", "I love the food here and I love the atmosphere but it's a little pretentious of them to not take a to-go order over the phone. Apparently, you have to come to the restaurant to place a to-go order. I realize this isn't a take-out restaurant but it's not that crazy of a request."], ["Nili P.", "I have been to this place twice and have enjoyed it both times. I did not give it five stars because I have not tried the pizza. I have tried all the veggie apps and they are delicious. The flautas in particular were super yummy. The kale pesto pasta is a good option for veggie eaters as a main course if you do not want to get pizza. I would get it again as an entree and I am not vegetarian. I thought the olive oil cake was okay but really enjoyed the orange almond cake and salted caramel ice cream. The ice cream is a little on the sweet side but the almond cake helps balance it out. The restaurant was packed both times I have been there. Weekend and weekday. So either make reservation or plan to get there earlier if you have a bigger party."], ["Lindsay H.", "Went here for brunch today and lost some of my love for Tazza. My pizza was burnt, my boyfriend's meatball sandwich had a borderline inedible amount of pesto on it, and the \"thick cut bacon\" was 2-3 measly strips of undercooked, chewy bacon that was not at all thick cut.I would still give Tazza another try because of the good experiences I had and maybe it was an off day, but it was just not doing it for me today."], ["Kahla B.", "In town for a conference and this was recommended by a local boutique owner.  I'm so glad. The weather is lovely, so I could sit outside under the covered patio. Wonderful.  Food? Loved the shrimp tacos and then I tasted the roasted squash.  OMG.  I may come back tomorrow."], ["Christina L.", "Very chill and trendy place to eat. All of the staff and dressed very boho sheik, the whole place has a very relaxed vibe. When we got there it wasn't busy at all and we got sat right away, in seats of our choice. The gentleman who helped us was very nice and checked in on us frequently. I got the mushroom pizza which was very good it was light and not to greasy the only thing I'd say they good do better was not burn the crust so much, but I won't hold that against them. Overall a great place to eat."], ["Nicholas S.", "First of all, if you know what \"genre\" of food this is, please let me know. The menu is an amazing, eclectic fusion of items. I was a little bit nervous when placing my order because I didn't know what to expect, but I trusted Yelp and our server to guide us. I stopped by for brunch with a fellow Yelper and we were both thoroughly impressed. Both the atmosphere and food was top-notch. We sat outside in the covered seating area. It was the perfect setting for a mimosa brunch! I tried the burrito and it was great! A wonderful fusion of flavors. I also tried my friend's brioche rolls with whipped marscarpone. WOW. Just wow. I didn't realize rolls could actually make a meal more enjoyable. I also tried a little of the mimosa. I guess I'm supposed to say it was good since it had freshly-squeezed orange juice, but I thought having pulp in a mimosa was a little bit weird. It tasted great, but had a strange consistency. That may just be a personal opinion. Also, just to note, don't go in if you're looking for a heavy meal. The portion sizes are a little light for the price, but make up for it in taste and quality! Overall, I'd definitely go back again!"], ["Jesse P.", "Amazing. Probably the best 'date night' place in Cameron Village without a doubt. The girlfriend loves coming here, food is good, well made and definitely all served local. Place gets pretty busy so I would recommend getting a reservation if you want to go. The pizza (spicy sausage one) is on point, I wish they had those oven baked brussel sprouts but I guess it's not in season, which is a good and bad thing that they're rotating their menu. Love it"], ["Lauryn C.", "Yup I'm moving a star up since my last review. I've now had the opportunity to visit Tazza a handful of times. It's been my go to place to meet a group of friends for dinner or even just to grab some cocktails at the bar. They really do a great job serving up only the freshest food and changing up the menu by what veggies etc. are in season at the time. The bartenders are skilled and can make a mean mojito, hand crushing the ice and all.I love the atmosphere at Tazza and really enjoy dining on their patio. Plus the service is always top notch which keeps me coming back time and time again. Some menu favorites right now for me are the Brick Oven Oysters, Brick Oven Carrots, and the Potato and Arugula salad. But now let's talk about my latest visit and why I'm giving Tazza 5 stars. They just started their brunch service and they are putting out some tasty dishes. Thanks to Kuanyu C for putting together the UYE brunch, we had a great group of Yelpers to enjoy this beautiful Sunday afternoon on the patio. Of course it wouldn't be a Yelp brunch without some mimosas to start things off right. They fresh squeeze their orange juice and serve their mimosas in 1/2 carafe yay! Not sure how many we had but we had quite a few. I also had to try a Bloody Mary, being that it's my favorite drink and it wouldn't be an official brunch with out a BM. As always Tazza steps it up with their cocktails, clearly they muddled the tomatoes, pickles and what ever other delicious ingredients that went into this drink. I will take a Bloody Mary pitcher please extra spicy:) Now you're probably wondering about the food? It was a hard decision with all the amazing choices.  But after seeing that sausage sandwich on FB that morning it was already in my head and I just needed to try it, plus our waitress highly recommended it. I think I made the right choice! Sausage made in house topped with guac, pickled red onions, a friend egg on crispy ciabatta bread. I'm pretty sure everyone at the table wanted a bite but I didn't share I ate the whole dish. Some other favorites at are table were the breakfast burritos, french toast, frittata, and crab cakes benedict. No complaints from anyone, the food was enjoyed by all. You can't go wrong with dinner or brunch at Tazza it's a great addition to the Cameron Village dining scene!"], ["Angela W.", "The food here was really good. We ordered the brioche (amazing!) and had pizzas and the spicy chicken sandwich. Our waiter was really nice. But it took an hour once we ordered to get our food. It was even a long wait to get the bread (something that can soften the wait). For this reason, I wouldn't recommend this place to friends. However, if you can get here at a less busy time (we arrived Sunday at 12:30), it might be good to try."], ["Liza T.", "Tazza is a great place for dinner, drinks or just apps! I haven't tried the brunch yet, but I've only heard great things. My only problem with this place is the prices. They charge a lot of money for not a whole lot of food. The pizzas are really good - but they don't have ranch which stinks for a ranch lover like me! The service is amazing, though, and it's a really cool, modern atmosphere. I would definitely recommend this place for a night out with the girls or just for fun drinks after work!"], ["Rose L.", "Tazza Kitchen moved up on my radar from my favorite dinner spot to now my favorite brunch place as well! I came here a couple weeks ago for a UYE brunch on a Sunday afternoon (thanks Kuanyu C.). There were so many choices on the menu that looks appetizing it was very difficult to decide but I finally settled on the fritatta. Honestly, I don't usually order this dish so I'm not sure what jumped out to me about it but it was probably the smoked mozzarella, lime mayo, roasted corn, pico de gallo and cilantro description. Before my meal arrived our large table enjoyed fresh squeezed mimosa carafes and I had a coffee. Our waitress, Rachel, was so lovely! She was quick to make recommendations, was pleasant even with our large party and kept my coffee cup full. The fritatta was amazing, from presentation to taste, it was one of the most delicious meals I have ever enjoyed (and I don't say that lightly). The cilantro with lime mayo and mozzarella and corn gave it the most delicious flavors imaginable and the side of hash-brows were perfect, I felt the dish was created for my taste buds! I can't wait to return to TK and try some of the other menu options!"], ["Eric S.", "This may be the best pizza in Raleigh. I was skeptical at first. This place had all the red flags that I normally associate with Americanized pizza places that try to do too much. Pizza is simple. And Tazza delivers on that front. I'm not going to lie, I was half expecting some booshie attempt at authentic taste. As if upscale decor and proper lighting could somehow make up for sub par food. I even noticed a couple reviews mention hipsters(?) I had no idea what to expect.Thankfully my fears were way off base. The menu is simplified but the food is anything but. As others have said, the real winner here is the Spicy sausage and black pepper honey pizza. The shit's good in a way that I can't even explain. It's like your initial response is to argue with your tastebuds as you eat it. How does this even work? What's happening to my mouth? Just enjoy it. Don't fight it."], ["Jen D.", "Had dinner at Tazza with my boyfriend and another couple. It's a cool place, albeit a little cramped. The food and drinks were great, but the portion sizes are a little small. I ordered the scallops entree, and my boyfriend had the tacos. For the amount of money that I paid (over $100 for two people), I was disappointed to still be hungry at the end of the meal.The other couple ordered a pizza, and it looked delicious. For next time, I think that's the way to go."], ["Laurie M.", "What a gem of a restaurant!  Delicious food, great service, reasonable prices, beautiful decor.I've been here a bunch of times since moving back to Raleigh and really like it.  Now I live across the street from it, and I look forward to many return visits.  I have enjoyed dinner on the sidewalk with my dog, as well as group dinners and bar drinks inside.  The crunchy potato and arugula salad is uh-mazing, and the flautas are pretty delicious.  One thing I didn't like was the kale & chilies salad, which is overly spicy (haha that's probably why I wasn't a fan, because I failed to heed the word 'chilies' in the title).  Servers are friendly and quick.  The bar is nice if you can get a spot.  All-in-all, two thumbs up!"], ["Bryan G.", "Great cocktails, great pizzas, great service! Wish they were open for lunch!"], ["Viktoriya M.", "Wow guys! Your pizza is fabulous! Did I say that? FABULOUS!!!! The service is outstanding, the quality is excellent! I think it was the best pizza I've tried so far. Thank you for modifying it the way we wanted. Great job!"], ["Norma G.", "I tried Tazza KItchen last week, after reading all the rave reviews. Well my experience lived up to the hype. It was a beautiful evening so we sat outside on their covered patio. There are also tables on the sidewalk, without any cover for those days when you want to soak up the sunshine. We started with the Brick Oven Cauliflower. Wow! The texture was perfect and I loved the addition of mint. I wouldn't have thought of that combo but will be adding it to my cauliflower in the future. The grana padano cheese and red onion completed the dish. So tasty, and you don't feel guilty for ordering it. My friend and I decided to split the Kale & Chilies salad (we added chicken) and the Spicy Sausage and Black Pepper Honey pizza. The kale was cut into strips making it easy to eat, and the lemon vinaigrette complimented it nicely. Then the pizza - wow. We spoke to the manager and he told us the sausage is made in house, and the pork is sourced from Green Button Farms. Many of the other ingredients are also local (check out their website for details). This is a big selling point for me. I can taste the quality, and while I usually shy away from mystery meat, this sausage is a known entity and absolutely delicious!We also shared a bottle of Frascati. It is similar to Pinot Grigio and went well with our meal. To end it all, we split the Chocolate Budino. OMG. Yum! I will be back to repeat this meal exactly. Service was impeccable. Can't wait to return!"], ["Megan G.", "We LOVE this place! The drinks are so fresh! The food is amazing! The atmosphere is fun! A must try in Cameron Village!"], ["My Girl M.", "Great food and atmosphere. We had time for one last dinner out on our vacation and wanted someplace relaxed and cool, but something that pleased everyone since we were tired. A quick look at the menu online and I knew this was the place. The menu selection makes the most of the wood fired oven. We had the goat cheese appetizer, which was reminded us of warm pimento cheese. Good, but our favorites were the roasted broccoli and meatballs. Have been trying to recreate at home we liked them so much! Pizza with arugula and prosciutto was excellent, steak and potatoes a hit (they allowed a substitution of broccoli instead of potatoes, nice).And a special note about desserts here. Excellent. The chocolate budino was a real treat. First \"new\" chocolate dessert I have had in ages. And the peach cobbler special was fantastic, with a really unique astringent flavored semifreddo ice cream that was a perfect compliment to the cobbler. Clean, great service, and at least the night we were there, the place to meet your match.com date."], ["rachel b.", "My new favorite place in town. Came highly recommended by several friends and did not disappoint. Everything was delicious but the chorizo nachos are not to be missed! Just make sure you call ahead for reservations, it's been packed every time we've been."], ["Susan F.", "Tazza Kitchen has been getting great buzz since it opened at Cameron Village, so my expectations were high and I wasn't disappointed. I met a friend at the bar for drinks and appetizers. Service was spot on and the bar comfortable. I had the goat cheese starter, which is goat cheese and marinara baked in a cast iron pan and served with brick oven bread drizzled in olive oil. So simple, yet so rich and wonderful. I would have licked the pan if I could have. My friend had the margherita pizza, again simple flavors superbly executed. I love the cocktail menu, and went with a Manhattan, my litmus test for a new watering hole. It was perfect, served in a classic, wide mouth champagne glass with a rich brandied cherry. Overall, we're fans. The superbly executed dishes, the chic, comfortable space, reasonably priced menu and ample parking, Tazza Kitchen is the whole package. Oh, and their social media, huge kudos to whoever is running it. Follow Tazza Kitchen on Instagram (tazzakitchen)- it's total food porn."], ["Stephanie G.", "I discovered Tazza while visiting my sister down in NC, and if I lived closer, it would surely become a staple in my life. Their brick oven bread is the greatest bread I've ever had in my life, hands down. The locals know where it's at, this place was absolutely packed at 8:30pm on a stormy weeknight. Not to be missed."], ["Paul H.", "Hands down, the best place to eat at Cameron Village! I went on a Monday night and the place was hopping! I assume this is because most restaurants are not open on Monday nights, giving this newer establishment a great chance to shine. The General Manager, Sam, and the waitress, Rachel were very friendly and insightful of the choice in cocktails and food items that graced the menu. I highly recommend getting the \" Carolina Greyhound\" or the \"Victory;\" both cocktails were made with fresh ingredients in house and were not overpowered by the liquor.  I love good customer service, and these ladies were on point with filling up my water when emptied, to making sure my order was satisfying!I ordered 2 different types of Wood-Burning oven Pizzas (Spicy Sausage and the Prosciutto and Arugula), along with a side of the Bacon glazed Brussels sprouts, which were out of this world! I saved room for dessert and had the best gelato in my life.....the Salted Caramel.  Wow! Don't bother to get eat the cake that comes with it....just get a double dose of the sweet and savory gelato. (FYI....I had a friend accompany me, so I did not eat all this by myself...although it was so good enough that I could!) The layout was very rustic Italian, with a contemporary edge, making it seem very inviting. They even have nice space heaters outside, should you decide to dine outdoors! This place blows its previous establishment, Cafe Caturra, out of the water- a much better selection of drinks and food items to make it worth a weekly date night, or gathering among friends for a weekend dinner."], ["Eric M.", "So we got there an hour before close, and I'm sorry guys, I'm sorry for doing that. It's not cool. And I was ready for a horrible experience. The last time I walked in to a restaurant an hour before close, I did have a horrible experience (read my review of Casa San Carlo from just a few weeks ago--9/6/14). These guys rocked it out. Seriously y'all eat here. My waiter was named Geoff and he was mad funny and honestly the best server I've had in months who wasn't a friend of mine already.  I would have totally made fun of his name, and called him G-off like the Australians say, if he wasn't such a great damn server. Not to keep contrasting the two restaurants, it's neither fair nor useful, but the waiter from Casa San Carlo wrote me an apology for his service. If you're reading this, Pat K.-- 1) it's really creepy that you're lurking my yelp profile like that 2) come eat here and get Geoff as a server. He'll show you what's up, even at 10:30 on a Friday.So I'm on a hunt for the best best fish tacos in Raleigh. The current winner is Rockford, believe it or not. These guys put up a good fight, but I still give the edge to Rockford. What Tazza did do well was experiment. It had tomatillo confit on it. And crunchy quinoa. I used to work with a chef who honestly was one of the greatest cooks who has ever fed me in my life, and one night, he was serving something with quinoa in it, and dismissed it as trendy bullshit. Actually, maybe it wasn't him, but it does sound like something he'd say, he was the type of guy who hated lots of things, but so am I. Anyway, the point is that this quinoa was crunchy. Yes, that sounds weird. Friend thought they were peppercorns, and so did I honestly, until I looked at the menu after the fact. It didn't have much flavor, but it did add to the texture. Quinoa is trendy (or is it passé now? I can't keep up with you kids) but these guys were doing new things with it. Taking chances. This crunchy quinoa chance wasn't particularly good, or bad, but I applaud them for trying it. The fish itself was a bit buried in the mix, and so as a whole, the tacos didn't knock my socks off, but they were good. Good as in I'd probably give them 3rd place city wide so far. Friend got vegetable pizza which has \"squash, zucchini, red pepper, caramelized onion, fresh mozzarella, queso fresco, chili flake\" on it. She added sausage, so I couldn't try, but honestly it looked really good and she didn't stop talking about it the rest of the time she was with me and has since sent me two texts about how good it was. It's not cheap, not at all. But Tazza is on point. If you don't mind shelling out a few dollars for food that combines different cultures and styles of cooking, and food that will make you think as well as make your stomach happy, check it out. They've got a brunch menu I'm really looking forward to trying. And the guacamole-- but I'm sorry it's hard for me to pay 7 dollars for guacamole. I know that's normal at a lot of restaurants prices, and I pay stupid prices for things at other restaurants ($5 bowl of edamame with salt at an asian place recently, I mean come on), but $7 just seems like a lot.Only real negative was the music was a bit loud, and sort of shitty indie bands like Modest Mouse (I actually really really love modest mouse) and the Avett Brothers (I really do not love the avett brothers, not even a little bit), but when Friend mentioned that to Geoff, he turned it down a bit, which just goes to show you how awesome that guy is. Anyway TL;DR: Seriously y'all eat here."], ["Alex N.", "One of the smoothest run newly opened restaurants I've seen in a while.  These guys were barely open two weeks before we showed up and everything went well.  After converting the Cafe Caturra space, the makeover looks really successful.  Not that I was complaining about it before, but the new decor is much more rustic/modern and really jives with the menu.  It has this cool wine country feel to it.The menu reads pretty well.  I always do like it when the ingredients are transparent.  We ordered the spicy fingerlings, cod, garganelli pasta & fennel sausage, and gelato & cake.  The potatoes were standard fare, but the spicy jalapeno sauce was a nice touch to a typically boring plate of potatoes.  I don't normally like it when my fish has been broken up, unless it's being served in different preparations, but this cod, lentil, salsa verde, and picked fresnos combo worked just fine.  A touch on the too well-done side, but it tasted good enough to not care too much.  I'm a sucker for great pasta, and what this one lacked in a rich gravy was all made up for in the sausage and garganelli.   You can taste the fennel, which wouldn't have been possible with an overpowering sauce.  The garganelli, which I haven't seen used around these parts, is about a cool of a pasta as there is; sauce can really get in there unlike some of those other tube-shaped pastas.  Lastly, the dessert could have really done without the overly sweet gelato.  That almond and orange cake could stand on it's own.Some of the dimly lit tables feel cozy, though the restaurant is bustling with so much energy, you might feel a little left out.  Still, the staff's menu knowledge is great and they are excited to be open.  The menu is really quite short and unless they put out some specials, I could easily see myself eating through this menu quickly.  4 1/2 stars for this great start.  I know I nitpicked, but the experience really was great. They were slammed for dinner on a Friday night, which bodes well for their staying power.  I haven't wanted to come back to a restaurant so much in a while."], ["Gina B.", "Another fan of Tazza is born! While I was sad to Café Caturra go, like many of us, I waited in hopeful anticipation of what was coming next. Not another pizza place please! Thankfully, Tazza Kitchen answers a much needed prayer for an upscale dining option in Cameron Village. It's a perfect date spot or, in our case, Tuesday dinner after pedicures for the girls. Tazza seems to cater to the hip late 20's to early 40- some crowd with ease.I was impressed with the renovations inside. The kitchen is opened up and the ambience is warm and inviting. Equally, I was thrilled with the number of gluten-free options on the menu. I challenged the Chef with a little ingredient switcheroo and he/she appeased with no issues. My only complaint is the serving was a little small and even with the gluten-free dessert, I was still hungry. Hmm, maybe I need a starter as well next time. The prices were reasonable. $16 for an entrée? Can do! Rest assured, we'll definitely be back as this is our new favorite spot and will surely be a hit!"], ["Jessica T.", "I've heard Tazza described as \"hipster\" and I can definitely see that. I love the food here, but their menu is limited which also limits their ability to substitute things. It's great for dinner or drinks and apps with friends or a date, but my parents (who can be a little picky) were not big fans. I usually order lots of appetizers and eat tapas style when dining here, the eggplant dip is my favorite."], ["Ellen J.", "Good food, good service, pleasant atmosphere.  We had a salad and shared the shrimp and crispy polenta. Very nice. We'll be back to try the pizza."], ["Anthony G.", "In the once quaint Cameron Village there is a jewel called Tazza. Sometimes I call it Gaza because of the war for parking and the crowds of mean yankees. Unfortunately and you know what I'm going to say, it is crowded on weekends because of those ugly, monstrous apartments and it's crowded most weekdays because of the monstrous apartments where all of the people who read that Raleigh was once one of the most wonderful places to live, ran here for the gold rush and moved to the ugly apartments. Tazza has dining al fresco or dining adentro. The food is superb! We got 3 apps and I don't recall the names but they were all good. I got a personal pizza and added caramelized onions and shrooms. It was great! Our stoned waiter who looked like a jewelry maker from Roswell said the wood burning oven made everything taste better and that was SO the case. The rigatoni was really well done and I ordered a Caesar but didn't realize that it was Kale, which is not my favorite thing to eat. I tasted someone's meat ball (NO, that's not whatI meant) and it was intense. This place is full of flavor and has the ambience of a cool place in LA. The waitstaff is very cool and swift (we always get the stoner and he's very sweet) So come to T and eat. Its great to gather here with friends and even a date with a cute by if you're out of the closet. No reservations (which sucks)"], ["Michael H.", "As many others have noted, Tazza replaces Cafe Caturra. I was never that crazy about the latter, and it's great to see Tazza's more culinarily adventurous menu. I had one of the chef's daily specials (it wa sa fish dish of some sort; sadly I don't remember what), and I was delighted with the presentation and taste.We'll be back."], ["Liv J.", "The Kale salad is amazing and a must! This place rocks. I used to frequent their Arlington location when I lived in Va. So happy to have Tazza Kitchen here in Raleigh. So fresh and delicious."], ["Str8 S.", "What a pleasant surprise! I was not at all expecting to have such a wonderful experience at this new spot. Maybe I carried my previous baggage from the former tenet, Cafe Craptura. Anyways, let's start with the room. A handsome bar runs almost whole length of restaurant dead ending into an amazing wood over. The bartenders on staff the night we were there are familiar faces. Highly experienced and friendly. Go with the Margarita, could be best in town....:-0! Dinner, we had a great waitress that help walk us through a solid selection of apps and then dinner. You put meatballs on a menu and I'm going there. F them up and I'm going to crucify the establishment....I am happy to report these balls tasted great!...did I just say that?  They were light, tasty and had a great soft smoke taste from being cooked in the wood oven.  Moving on to pizza...finally a place in Raleigh that actually knows what a Neapolitan pizza is! Amazing wood fired pizza. Easily, hands down, no contest, down goes Fraiser, best in town. Don't even bother with next years survey. They win. Period. Rest of dinner was a whirlwind, did I mention the margaritas? But everything that came out of the kitchen was great. Then came the check, drinks, apps, and dinner for $60...extremely reasonable for the quality of the meal we had. I'll be seeing you guys again, sooner than later and as often as possible. Nice work."], ["Payton A.", "I loved Tazza at first sight. It was raining and already dark out by the time my boyfriend and I made it to the restaurant, and the sexy atmosphere and gorgeous bar were exactly what we wanted on such a night. We were seated at a hightop near that beautiful bar and agonized over what we wanted to drink, because all the cocktails sounded phenomenal. Our server was attentive but unobtrusive, and very good at his job. The more I drank the more I was amused by how good he knew he was. About midway through our meal, all the iPhones in the restaurant alerted us to a flashflood warning, which was just one more excuse to stay and drink!One of the cocktails smelled exactly like freshly mowed grass and was about the same color. I love savory cocktails, and was a huge fan of this one. I also had a glass of wine and a fruitier cocktail (I know, I know -- not the best idea) and enjoyed both but they weren't as memorable as as the grassy drink. The boyfriend had one of the best Manhattans I've ever had, another cocktail, and a beer. We did an excellent job of picking our meal, if I do say so myself. We started out with the cauliflower appetizer. It is non-negotiable: you must order the brick oven cauliflower, it's so good. The crunchy potato and arugula salad was also phenomenal; the warmed mozzarella was delightfully smoky against the pepper of the arugula and the surprisingly light maple vinagrette. We may not ever get the chance to try another kind of pizza because of how fiercly we felt about the sausage and black pepper honey pizza. It was so delicious and exactly what we wanted on such a drizzly night. Take a date or have a girl's night at Tazza -- you won't regret it."], ["Rod O.", "Now that I'm on a Diet, \"Tapas Portions\"  (Taz-za) are Perfekt !  I can eat about anythinj out of a Bowl, even prefer it!  The BEST parts of the Meal made us say we are looking forward to Dinning here Again and Soon!  The Poorest parts of the meal only told us what we would not order again!From the BEST First, I'll describe what I enjoyed most, down to what could use a little work... From Two \"Entrees\" Small though really Perfektly sized and One StarterPolenta Cakes and Shrimp 5 yelp stars !  Sauteed Tomatoes and Garnished with Green Onions this was the BEST interpretation of this Dish I have experienced!  Only criticism is that is was slightly Oilier than it needed to be, still 5 yelp stars!Both \"Entrees\" had the Perfekt amount of Meat for the price!  5 starsBread 5 stars !  This Bread  joined our Starter and was the best part of that dishPasta and Sweet Fennel Sausage Smothered in Grated (NOT from a Can Thankfully) Parmesan... Where is the Hidden Camera ? ? ?  I hate, HATE Parmesan in this proportion ! ! ! !  That Much Parmesan in a dish like this. it is Impossible to scrape enough of it off!!!  Parmesan is NOT mentioned in the Description of this Dish (I would have asked for it on the Side or to be OMITTED from my serving) This Dish had worse problems :  Too Oily, If it had a \"Sauce\" it was OIL!  The Pasta was only ok, NOT a-ok... The Sweet Fennel Sausage was VERY NICE and the ONLY Component that \"saved\" the Dish!  \"Saved\" to an edible Degree! Even without the extra cheese this dish only gets  3 yelp stars!  It was Good ONLY (not very good) Just Good!  3 stars for this dish even IF they had severed it with NO Parmesan or even a proportionate amount of Parmesan!  Iron Dish warmed Goat Cheese with Tomatoes, severed with Bread!  SAVED by the Bread!!!  The Bread was FANTSATIK!  The Bread was so Wunderful we fantasized about how good the Pizzas must be (They Looked GREAT), this Dish was my least favorite and I AM a FAN of Goat Cheese....still, I guess there is another way to mess it up!!!  2 yelp stars for everything in the Iron Pan!  Nothing was wrong with it Except the Flavor!NOT Counted in my Overall yelp star Rating of this Establishment though worth Mentioning:Service : 5 yelp stars  :  Extremely Polite and Friendly though not at all chatty!  My only small suggestion and surprise was how they had ALL Dining Parties seated together a small section of the Restaurant!!!  Tables are close and when you have that few people in a Restaurant they should be first spaced out then as it gets busier fill in the empty tables!  Most places have learned this!  THIS Place NEEDS to Learn this, before someone takes you to school!!!  Just say someone did and do it NOW!!!!  I do NOT intend to blame a new business for taking Poor Antiquated advise about Seating Patrons, most Restaurants used to do this, trust me, if your customers thought they had a choice MOST would NOT choose to be seated in one cluster when the rest of the place in EMPTY ! ! !  Intended to be a NOTE for the Owners first, then all the Customers who really want the BEST Experience in an Establishment, though will NOT say anything because they do NOT want to be a Bother, \"Oh just Seat me anywhere and I'll write about it later!\"  We Noticed!!!  It is NOT a big deal to me, it just makes this place look like a spokes Model for Dummies!  \"How to seat Guests in your Restaurant for Dummies\"!  Tazza"], ["Mariann D.", "Did not really know what to expect coming here- but it was delicious! The atmosphere was very cool-very pretty woodwork, not too loud and very inviting. We ordered the spicy sausage and honey pizza and it was great! It is definitely something I will crave from now on. We had an order of guacamole to start, and it was good. It was very lime-y, but tasty. Our waiter was charming and funny and didn't bother us too often. Two things I'll complain about- the glassware didn't smell good. You know when you drink from a glass that did not dry properly or was washed with dirty water and it is horrible?!? Well, the glasses were smelly. I couldn't drink the water. I asked for a ginger ale, and thankfully, it came with a straw. The other complaint- if you're going to charge $2 for a ginger ale, don't only bring me the tiny 10 oz glass bottle with it. I know I can get a 6 pack of those tiny bottles for $4 at HT....just hide it and I never would have known I was being ripped off"], ["CityGirlCece F.", "Excellent pizza at Tazza Kitchen tonight. Oooooh.... the gravy!! I mean, great sauce. (I'm not Italian, why am I speaking this way?) I can't remember the last time I had pizza when ALL the ingredients were just right. Sauce, crust, cheese and fresh herbs/basil. Did I mention how delish that sauce was??? Our server said they make it in-house. I'm impressed. Really liked the kale & chilies salad too. The chilies part kind of deterred me at first but glad I went with it. Flounder rocked! 'Nuf said.  As for all the rest.... service, ambiance, decor... it was all excellent too."], ["David B.", "Delicious. Some things are a few dollars more than you might think they should be, but that's what I expect when dining most places in Cameron Village. Regardless, the menu is well thought out and created with excellent flavors and combinations that are simple, yet imaginative. My favorite things that I can't branch out from are the arugula salad with warm fingerling potatoes and blobs of mozzarella. It's freaking great. And the sausage with black pepper honey. Dang. I need more of both of those dishes in my life. I live going with a friend and splitting the pizza and getting the salad each. Beer list is pretty decent with several area brews. The wine list is extensive too. The outside patio is like sitting in a greenhouse during summer months when the curtains are down, so wait for a table inside if they're not rolled up. Also, my friend has requested balsamic vinegar three times now and they oddly don't have what I'd consider a pretty basic ingredient for a restaurant of this style. Then again, having multiples of the same place, I understand standardizing a menu between them-if that's what the thought is behind not keeping a fully stocked kitchen. Anyway-I will definitely return and I highly recommend you try this restaurant."]], "Margaux's Restaurant": [], "The Point at Glenwood": [["Daniel P.", "Stop here for tasty food and perfect service! We have been coming here for nearly a year every Sunday for brunch and often times during the week for the great food. Everything We've tried  has been excellent and have not been disappointed. I certainly recomend the pizza, the camaleri is our favorite and I love the Roast Chicken.While service has never been bad, it's never been more than mediocre until today. Our server Scottie was phenomenal and did a fantastic job at making us all feel welcome. It was as if his sole job at that time was to offer us hospitality and ensure we were pleased. Thank you Scottie for making my day! I must say, this visit was likely the first I can remember that my beverage was refilled before I , my husband, or daughter was drinkless for 5 to 10 minutes before being offered a replacement. A beat wasn't missed and there wasn't a moment I had wanted for anything.One thing is I wished I would have known about the Mimosa and Bloody Mary with option to create my own for the past year I've been visiting, but am pleased to have been offered it this morning and surely will enjoy it in the future. Make my own? How fun!If I had thought to write a review based on my past it would have been 2.5 stars for great food and ok service that wasn't anything to complain about nor anything to rave about. But my review for today is 5 stars for the value I got in service paired with the as always flawless culinary fare."], ["Hunter M.", "Good service and good food every time we go. The place has a great atmosphere and a great back patio."], ["Joe T.", "I will never set foot in this place again. Our bill was hit with a $24 surcharge; non-taxable. When I politely asked our waitress what that was for, she had no idea. Next thing I know, the manager came over to our table and said, \"so you don't want to pay your bill!\". He couldn't explain what the charge was for; something about paying no tax to the ABC board?! Then a waiter came over and said it was a glitch in their system, and they couldn't really figure out what it was for, but that we still owed it. It was complete nonsense."], ["Salvadore D.", "Great neighborhood spot for food. They have a wood fire oven so the pizzas are great and the salads are awesome as well. We live right down the road and one day we were walking by to get coffee before dinner and realized we forgot to buy lemons for our dinner and we stopped in to see if they would sell us a lemon as a shot in the dark and they gave us two for free so they are awesome!! Really nice people"], ["Nicole J.", "I have heard great things about this place, it didn't fail me.  Great service...food perfect. Had the Taco appetizer and Greek Pizza. Unbelievable!  We will be back no question."], ["Deborah S.", "Great selection on menu. My hubby loved his ribeye steak that was cooked in the wood fire oven. Two of my kids made their own pizzas. They loved doing that and enjoyed the pizza. My other two kids had daughter the Greek pizza and chicken fingers. They both enjoyed it. I had the daily special, scallops wrapped in bacon with  sautéed spinach and a baked sweet potato.   It was all delicious. We had to have dessert since it was presented on a platter. ;)The dessert was delicious.  Our waitress Carla was exceptional. Great service and great food."], ["Catherine B.", "I came for lunch on a Thursday and the food was not good. We got pizza, pasta and 2 chicken wraps. All the food came out cold. The grilled chicken in the wrap was burnt tasting and chewy. We both could not eat it. The fries were great but that was about it. I think overpriced for low quality food."], ["Jenn L.", "I think this place has by far the best pizza in Raleigh...the cheese is delicious, the crust is perfect (not soggy at all) and it does not get weighed down by the yummy toppings.   We ordered it for a large party and everyone raved about how delicious it was. We do take out and also dine in.  The service is not great, but the food makes up for some of servers."], ["Mike O.", "Only had the Irish Nachos, and homemade fried Jack cheese sticks but they both were fantastic !  Nice selection of drafts, some the most friendly folks ever ! Will definitely try it again !"], ["Jessica B.", "Came here on a Sunday for brunch with friends and food was okay.  Some of the items were lacking flavor but overall not bad.  Wish they had a bigger selection of pastries and meats to pick from."], ["Stacy W.", "We passed by this place while traveling somewhere else but decided to stop for dinner. We had good appetizers, my husband had the pork barbq and coleslaw egg rolls and I had the blue shell crab dip with pita. Good flavors. The entree my husband had was beef tenderloins with a baked sweet potato. It needed a flavor boost but was tasty. I ordered the lasagna and it was awful. It was a huge bowl of greasy mess with very little sauce. I love Italian food but I could NOT eat this dish. When I called it to the waitress attention, I was told that thats the way lasagna is and they refused to take it off my bill. I took two bites. I told the waitress I was unhappy and the took off half the price of the greasy mess and an apology. I Will NEVER go there again. Too Expensive on top of everything else. Ugh!"], ["Tommy A.", "Went to the Point for lunch with a few people I work with. We all ended up getting the Pizza buffet which according to the menu started at 11am. There were no pizza out at 11:30, but the restaurant was pretty much empty. Within a few minutes of ordering pizzas started to come out. Most were just your traditional style meat and veggie pizzas. They tasted alright, although none were memorable. Service was kind of slow, shocking when you consider no one was there, but they were nice when present. Overall I would say for lunch it is pretty good if you are in the area, although I would not go out of my way to return."], ["Randy W.", "First visit to the point.  Service was fast but only somewhat knowledgable.  The food (i ordered a salad) was terrific.   Go.  It's worth it."], ["Lori R.", "It had been almost a year since we've been here.  Decided to go back for the pizza lunch on a recent Saturday.   While the pizza is still good, the salad is okay, and the price is very reasonable, I just can't excuse the fact that they have done nothing nothing nothing to the bathrooms!  The women's restroom is just as much of a disaster as it was a year ago.  There's NO excuse for that!  If management/ownership doesn't care about the bathrooms, I don't want to know what they don't care about in the kitchen."], ["Amanda F.", "Went for the brunch buffet. It's a solid choice of brunch options and with all you can eat, this needed 4 stars. It's not the best brunch food I've ever eaten but it was perfect for what we were looking for - easy, cheap, tasty and good options. For $13 and all the food and coffee you could drink, I'd certainly go back.Omlettes, waffles, french toast, pancakes, bacon and sausage, quiche, fruit, GIANT cinnamon bun, hashbrowns, salmon etc etc"], ["Jesse C.", "Living in the neighborhood I would love to be able to even like this place. I've given it several chances and it always fails miserably. With the exception of one of their bartenders...the service is pathetic. Pizza is ok, but nothing else on the menu is worth even close to its price. This place is basically a bar for ex frat dudes in their 30's-50's. It's too bad this place didn't care more about the quality of both their food and service. But it's obviously not the case.Won't be back and would not recommend to anyone I know."], ["Ron W.", "Classic is as classic does and The Point is certainly a classic at Five Points!  Step inside and you know you're in a local neighborhood joint.  Mixed crowd at the bar, lots of regulars, cozy dining room and a wood burning oven in back get your attention.  I haven't been to the Point in ages just because the parking is a bit tight at Five Points but it's a solid spot for a bite or beer.  I ordered up some buffalo wings and a steak sandwich for dinner and although we're talking bar food, it was all surprisingly good.  The wings were crispy and lightly coated with a sauce that had a good kick in the end.  And the steak sandwich?  Decent but what really made the meal was a nice pile of onion rings.  Loved these rings: thinly cut with a non-greasy, light but crunch coating, reminds me a bit of what I might get at a clam shack.  Table service was solid, the Point pretty much only has dudes on their staff.  The only niggling issue was slow service at the bar.  They seemed to be having problems with the touchscreen so it took about 10+ minutes just to get served a Bud Light.  With three people behind the bar, not sure how it took so long.  But otherwise the Point was perfectly fine and a good spot for eats before catching a movie at the Rialto next door.  Don't forget there's parking in back (along with a deck), just shoot down the narrow gap between the two buildings.  It's been probably two years since my last visit but I'll be back soon enough.  Those onion rings were worth the trip alone, hopefully I'll be bumping you up to four stars soon..."], ["Rachel V.", "First time here and we probably should have tried the pizza as this appeared to be the most popular choice among diners. We did notice two gentleman that came in and immediately ordered the pork chops that looked great. We ended up having tasty cucumber gin cocktails since they were out of the blue cheese stuffed olives featured in one of their special Martini's, the appetizer sampler and it was good - duck wings Interesting. We shared the pick 2 wood-fired scallops and oysters and they were good, we just weren't overwhelmed overall. Lettuce wedge was just okay as well. Glad we tried it, but next time we will try the pizza."], ["Dustin R.", "Located in the Five Points area of Raleigh off of Glenwood and Fairview street, The Point is weirdly aloof about just which of the Five Points it represents, and, frankly, being THE Point comes off a little haughty. The logo above the door is a star, and that doesn't effing explain anything. Normally I'm the type that will immediately dismiss a restaurant/bar for not having enough clarity in their branding, but because I am self-tasked with providing you ALL the necessary information for you to decide whether or not this place is WORTH A VISIT, I went there.  -Have you enjoyed going to restaurants in the past?You bet your ass you have. In fact if you're being honest with yourself, visiting restaurants is right up there with watching movies and talking to friends as a premier activity in your life. Well The Point checks all of your restaurant boxes. Food? Yep. Beverages? Yep. Service? Yep. Comfortable AC settings? Yep. What more do you want?....VISIT. The fact that it is a restaurant and you like those should be enough. But let's dive deeper.-Are you the kind of person that likes a diversified menu?Sometimes you're not sure what you're in the mood for. Sometimes you want pizza and your darling girlfriend wants a damn Sesame Crusted Tuna Caesar Salad. No need to turn this gaping difference in specificity into an argument about emotional neediness, just take her to The Point....VISIT. They've got a strong gourmet presentation on various classics like burgers and tacos, but they also throw in some fancy salads and hoity-toity apps. There's definitely something on that menu for you.-Do you like places that turn into raging boozehalls after 10pm?This place DOES THAT! And if you're the type of person that reads this blog and likes that atmosphere, then I'll bet YOU'VE ALREADY VISITED. And you know the main pitfall of the post 10pm crowd.-Are you offended by raging frat-stars?This is one of the heavyweight frat bars in all of Raleigh. The Thursday night crowd is famously frat-tastic with swoops for days. Natural Light is actually a featured beer at The Point. If you don't know what that means, then this probably isn't the place for you....NOT WORTH IT. Stick to the lunch and dinner times.-Are you into cultural diversity?This is really just a more heavy-handed variation on the question above. Let me put it this way: I think I may have seen one black guy there one time for about 10 seconds....NOT WORTH IT if you're not a WASP, but you should definitely VISIT if you're a non-WASP trying to make a statement.-Is a black guy eating a burger at a restaurant that one blogger call \"fratty\" really a ridiculous idea of a stand, and how could that possibly be a helpful piece of information in deciding whether or not a place is worth visiting?Hey, why is this getting so heavy? Maybe you should just VISIT so you can be part of the convo.-Do you like $2 Bud Light drafts after work on Friday.That's better. Let's keep the main thing the main thing and keep the mood light. You love affordable domestic beer, so YOU'RE VISITING. And that's The Point.Maybe starting to get it, Dustin \"What's the point?\" Riedesel"], ["James O.", "First time for each in our group of four.  Overall the food was very good, the service was good, the prices were very reasonable, and the parking was tough.........but the Five Points area is like that for most of the businesses there.  The server was very prompt with getting the table set for our reservation, getting water and getting drink orders.  Since we were all first timers we grilled him a bit on the favorites, and he was very knowledgable about the menu, and very helpful.  We all ordered something he recommended.  Started with the BBQ wontons - really good and next time I won't share mine!  Salads were good, nothing to rave about, but how often do you go someplace to eat their salads anyway?  I had the yellow tail tuna over jasmine rice.  It was cooked perfectly, the rice was really good, but I would have like a little bigger serving.  I need to lose 10 pounds so it was probably better that way!  The steak medallions got a rave from one of us, as well as the salmon, and the flounder in parchment.  The wine and beer selection was very good also, with two getting a craft beer on tap, and the other two getting wine.  Definitely a very good experience for our first time and will definitely repeat, maybe trying to get in some, music next time, along with one of those awesome looking pizzas coming out of the wood fired ovens."], ["Larry B.", "My very last disapPOINTment. Service is very slow, the waiter didnt know the dishes, the food is average at best. I ordered the taco plate and it is obviously a very high-margin dish. What I mean is that the chicken was dry and tasted like it was already processed and pre-cooked, the cook just slaps it on the grill for a few seconds. The guacamole definitely came off a pouch or a can. The salsa was the watery kind you get in a bucket at the supermarket, the tacos shells were left out of the Costco bag for a few hours and were getting soggy. Probable cost of the dish 3 dollars, sold for 16 plus tax. I can do much better at home. I live in Five Points and I have given this place enough chances. This is it for me I'm afraid.This place has no Soul. Because the owner tries to do everything, he does nothing well. Is it a bar, is it a club, is it a sports bar, is it a restaurant, is it a pizzeria, is it a taco place, is it a steak place?With only 25% occupancy on a Friday night at 9 pm, maybe the owner should get the POINT.STICKY BATHROOM........THIS IS NOT ACCEPTABLE........PLEASE HAVE SOME RESPECT FOR YOUR CUSTOMERS."], ["Emily P.", "The Point is either the place I start off, or the place I end up, after going to see a movie at the Rialto. The bar/restaurant is split into two sides, one a bar with card tables and the other a mildly nice sit down restaurant (I've been taken here on a date before-although I wouldn't exactly recommend it).The food is good, and the alcohol is about on par price wise with surrounding establishments. Most of the crowd here seems like regulars. They have wine and beer tasting for free on Mondays and a card night on Wednesdays I believe"], ["Valarie G.", "Great food and fast service.  The only thing I would possibly change is to make the sweet tea sweeter and not be out of the corned beef hash.  Also waitress gave the orders to the wrong people, but I'm being picky.  Very good brunch place."], ["Bob M.", "Great and very comfortable bar.  Great bartenders and they have all of the right things.   Great view from the bar.Wonderful fish platters and very fine coleslaw.The owner makes his presence known in a very good way.I love the way the crowd changes with the hour; families early, older people for a couple of hours, then young people coming in after the movie at the Rialto.Wonderful place."], ["Tom R.", "We eat at The Point once or twice a week. Never a bad meal! One of the biggest menu selections around. Reasonable prices. Great service. Recent remodeling well done. Great pizza and soups."], ["Andrew J.", "I ate lunch there yesterday with a pretty large party, including five young children. They were very accommodating, and everyone enjoyed their meals. The menu isn't what I would call exotic, but I've tried several different items and never been disappointed."], ["Steve S.", "I'm a big fan of The Point and we've been going there for years.  They have things you just can't find at your national chain.  Things like wine/beer tastings, live music, and local beers on tap.  The food is all above average and some are excellent.  I recommend the Korma Curry, Manzanita pasta, or wood fired pizza and a local draft.  For brunch, the steak benedict was legendary.  I don't recommend the hummus - too bland and we haven't had good luck with any of the desserts - overly sweet.I probably wouldn't take a first date there, it isn't quaint.  However it is a nice, fun, neighborhood restaurant and one of the best places to meet and hang out with friends."], ["Helena K.", "Conveniently located just a few doors down from the Rialto Theatre, The Point is the perfect place to enjoy a few beers and a snack after the movie. The staff are friendly and I felt right at home at the bar with their eight beers on tap and full bar. I only ate the hummus---which was decent---but the menu seemed passable, if not overly veggie-friendly. Cool place."], ["Whitney H.", "My wife and I have been going out here for some time. It is the type of place where you can wear jeans and get a steak or gourmet seafood. The manager is really goes out of his way to make sure that everything is right. The wait staff sometimes is inexperienced as with most restaurants in Raleigh. We have been to the Sunday brunch one time. I would check to see if they still have it. They had buffet or you could order off the menu. Also had live music."], ["Jeff F.", "I really wish I could give The Point more stars, the food is great, but the service we had was horrendous.  I don't know if it's was just a bad server, bad night, or just bad luck on our part.  Since I am not convinced it was the restaurant's fault, let's just focus on the food first.  I ordered a fish and chips special, it was good, not a lot of flavor but not a greasy mess like most fish and chips.  The fries were some kind of potato wedges, they were cooked right and very tasty.  The cole slaw was excellent too!  My son ordered the kid's pizza, it was very good, but I noticed other kids that ordered it actually got to assemble it before it was cooked, I guess that proves my point about getting a bad server:(  My gilfriend ordered some kind of curry chicken, and while I don't know much about Indian style food, I tried it and it was very good too!  I also ordered a caesar salad, which the server forgot to bring until after our food came, but it was one of the best I've had in a while!  We would have ordered dessert, but again, our server was so slow we would have been there all night.  The worst part about the service was after I gave him my credit card we waited 17 minutes for him to come back!  Then he comes back with some odd reciept that didn't have a space to put a tip amount, so I figured he must know he sucks!  The only other negative about this place is the bathrooms are kinda gross, and I peeked in the kitchen and it doesn't look to be the cleanest kitchen in the world."], ["Cindy H.", "I had been to the this place before but I think under different . I was pleasantly surprised at how the menu appeared to be much better than just bar food / college food fare. Prices were reasonable and best of all, service was spot on. Friday night, before the 7PM Rialto movie, was quite busy but we were seated (party of three) and were out in time for the movie. Good food - just a couple of appetizers so nothing to write home about but I'd be willing to give other menu items a try. But a great place, above quality than the TGIF/Chili chains. Support Local!"], ["Helen E.", "After passing by for over a year we stopped for a sat dinner. Nice afternoon we parked a block away and walked it arrived about 7:30 , looked like nice friendly family place had several tables with families enjoying the dinner time. Wait was short . several empity tables .we were seated and given out menus after waiting and read .we notice couple that had came in after us was waited on and then being served, ( we were in the middle of the resturant waiting,) after 15 min. we started to look around after 25 we left , Sorry for the price of the things service should have been better!!"], ["Donna H.", "Some friends and I recently tried this place for the first time, and our verdict was \"just okay.\"The draft beer list was slightly above average, largely because it included the three standard beers from Big Boss. We had a mixed reaction to the appetizers. The hummus was good, but the cheese sticks were disappointingly bland.The menu has a lot of variety, which would probably made this a nice place to go when all your friends are in the mood for something different. The entrees we had were fine, though the portion sizes were a little extreme. Thankfully, taking half my meal home was convenient that night - but that isn't always the case and I hate feeling like I'm wasting food. So you might want to think about ordering appetizers or side salads and then splitting something with your date.The service was friendly but a little slow. There may have been some confusion over whose table we were, because it took quite some time for anyone to come by for drink orders. And we probably could have had a last round of beers while we were waiting to pay. We were asked if we needed anything at least four times by people other than our server. I appreciate the dedication, but it made me feel a bit hovered over.This will probably end up being one of those places we go occasionally for beer and appetizers."], ["Steve M.", "Very good pizza"], ["Courtney J.", "Always great food and service. Their pizzas are fanstic! We can usually walk in and get seated pretty quickly. Also offers a fun bar atmosphere on one side. Family friendly too. Parking in back and on street."], ["Melissa P.", "The fact that this place is a few blocks from my house wins points. On the other hand, I just love this place. The bartenders know my name and make me feel welcome. It does tend to draw a \"fratty\" crowd, but they don't bite :o)"], ["Louise O.", "Great neighborhood restaurant. My mom and I arrived around 5:30 pm and it filled up by 6:00 pm. Great service. Very affordable wine list. They even had wines for under $20 a bottle. However, it is very disturbing to see Yellowtail on any wine list. Makes me question the wine purchaser's work ethic--this is just plain laziness. Surely there are countless of more inspired choices than Yellowtail. I had the prime rib, which was their special that night. I would skip it next time. The twice baked potato was too cheesy. My mom had the fish in parchment. She enjoyed it. Very generous servings. I enjoyed the tortilla soup the best. We didn't have it, but the pizza looked pretty good."], ["Kelly Z.", "We will never spend another dime at this place! Although Chelsea and Brian(servers) were fantastic, the experience was horrible!The owner's sister was having a party & the music volume was RIDICULOUS! The Mgr would turn it down, they would turn it back up, like children. Couldn't even have conversation and enjoy a meal with my GF! People were pissed, the owner is clearly a greedy individual. His customers did NOT come first,but he got his money,for sure! He should've shut it down for her party. Also....not to make a bad situation worse, but it smelled like urine by the server station at the back, where we sat.  So, unable to visit with my partner, I also had to smell pee the whole meal! We ate so fast just to get out of there! I felt bad for the waitstaff and the manager. What are you gonna do when the OWNER uses such poor judgement? The manager acknowledged that it was unacceptable, but he was stuck. Such a shame."], ["Leo T.", "It only gets 1 star because the cheese grits were good.  The food was mediocre at best and over priced for brunch.  The experience may have been better if our server was better.  Most of the orders came out mixed up.  There are WAY better place in the Glenwood area for brunch, I suggest taking this one off your list."], ["Brian W.", "I was surprised by The Point's homey feel.  With all the money circulating in Five Points, it's always great to be reminded of how down-to-earth the commercial side of the neighborhood is, and The Point seems to fit in well with that vibe.We went in here for a drink, and ended up getting a drink and dessert... the drink was good, inexpensive, and served by a very cool and friendly bar-tender.  The dessert - though served by the same bar-tender - was inexcusable.  My friend got a \"key lime pie cheesecake\" and it was clearly a freezer-section boxed pie, but it cost almost $8.  Not cool.  I know it's not exactly a dessert place, but it would nice if the put a LITTLE effort into it, or at least charged what it was worth.Nonetheless, I will definitely continue to go to The Point when I'm in the area because of the comfortable (both socially and physically) bar and the great staff."], ["Liz A.", "We are from Boston and were visiting family who took us to The Point. Made reservations for a party of 8 and were seated very comfortably. I wish we lived closer! The food was amazing! Everyone ordered something different, the kids can even step up to the kitchen and make their own pizza. At The Point, they have a wood fired oven and they use it. My NY Strip steak was cooked in there. All the people in our party ate well and were very satisfied with their meal. Turns out, we were in good company, the NC governor was seated at the next table over. My cousin keeps mumbling something about tax dollars at work...."], ["Jason G.", "I have always gotten good food and service here. The pizza is great and they have some of the best soups around. I love the cheese grits and Sunday brunch."]], "Sullivan's Steakhouse": [], "The Borough": [], "Humble Pie": [["Daniel N.", "This place looks a lot better than it tastes. Like a hipster.Sunday morning conch shell is a nice change of pace for a second.Confused as to if they are going for modern or trendy. Staff seems humble."], ["Allison Anita H.", "Our server was extremely attentive, personable & informative. The food was UNBELIEVABLY fresh, well seasoned & palatable. First time hearing Peter Lamb & the Wolves. Amazing!  I was ready to camp out for LIFE!  Had the Ricotta Gnocchi, Lamb Meatballs & Short Rib Tostadas! Can't wait to go back. A MUST TRY!"], ["Sum H.", "Food was great, atmosphere was cool. Food was overpriced for portion size."], ["Meg F.", "Delicious food, fun wait staff, and a very cool, edgy decor made for a delightful Father's Day brunch!"], ["Lauren R.", "What a find!  It's tucked into the warehouse district of Raleigh, and only marked by a big red \"H\" such that you could easily miss it.  Except when it's open during summer--in that case you can't miss the large and brightly lit patio (that's usually full).I've only been for brunch, but brunch was great.  Definitely call ahead to make a reservation--we did, and if we hadn't, we would have had an hour-and-a-half wait when we showed up at 11am.  Getting there early gave us the benefit of what I consider Raleigh's best patio.  It's large, it's festive, it's covered with plenty of fans.  And, it doesn't overlook a parking lot!!  The inside of the restaurant has high ceilings, and is really well decorated--warehouse chic.We had a leisurely brunch--two hours--and never felt rushed.  Service was a bit spotty at times, but I understand when waitstaff is busy with large groups at brunch.  Entrees were a little pricey ($10-14) for brunch, but not when you consider that they bring free biscuits (heavenly--soft on the inside but crispy on the outside) to the table and free breakfast potatoes as a communal side (also tasty).  All three of us ordered the huevos rancheros--which was unusual in its presentation but delicious--runny eggs, chorizo, torilla chips.  We also got bloody marys at noon (preorder them and they'll bring them out for you right at noon).  The boody marys were very good!"], ["Kirsten E.", "Great food but dreadfully overpriced.  I guess if you have cash burning a hole in your pocket and don't care, then I'd recommend going here but otherwise there are equally delicious places to go for much less"], ["Michelle O.", "I went to humble pie with a group of girls (with a reservation which they happily said would not be a problem and that they  could easily accommodate) for the first time and had a terrible waiting experience that managed to get worse as the night progressed.Before the whole group even arrived, they were mixing up drinks. Once everyone sat down, we had to constantly track down people to re-fill waters, remind them who ordered which food and drinks. The worst and most important part of this experience was the end- the waitress asked how to charge the bill and we asked if we could have it individualized/split (since they have tapas and people typically share). She tells us okay no problem but says it will be a little bit. We allow 40 min before only one of us (me) goes to ask politely if they are having difficulty with remembering everyone's orders and that we could gladly tell her which orders we had, then asked about how much longer it is going to take -while asking the waitress who responded with \"I didn't forget just taking a long time with the system splitting checks\"- a guy who looks like a manager and acts like one interrupts and says \"with your big group it is taking longer because it is so complicated to have to split checks.\" I ignore his rude / attacking behavior and continue to say \"okay, well it's just that some of my group needs to leave now..\" he cuts me off again and says \"yeah people to see, things to do, places to be.\" I politely smile back and say \"yes but also some of them need to get some rest to wake up early in the morning\"- again he interrupts and says \"yeah well I need to be up early and here for brunch too.\"At that point I am completely in shock that neither of them have apologized to the table for how long it is has taken them (over 40 minutes now) and most of all for how rude that man was to me. One other girl went up to ask a few minutes later if she could just pay for her portion- they gave her the same story with the system taking long and said they were almost done. She also told them that any other restaurant would have already come by the table and would have apologized for how long it was taking. Finally the situation got resolved only by one of the girls giving her credit card to pay for the whole group of about 13. There was still no apology before we left. I will say that the food was decent but overpriced for how much you get but the service outweighs the taste of the food. I will never go to this place again and will never lead anyone astray by suggesting it either."], ["Melissa T.", "Humble Pie is delicious but don't come here hungry! Admittedly, they are a tapas restaurant, but I asked my server which \"entrees\" were a regular meal-size. She indicated that the scallop dish was \"a regular meal size.\" INCORRECT. MAYBE MEAL SIZE FOR A SMALL INFANT CHILD. The scallop dish was three scallops in a sauce. Although I ordered an appetizer in addition to the \"entree\" I still ended up going home and drowning my sorrows in an entire family-sized bag of Ruffles. All this being said, the three scallops were very tasty. I just wanted more. And if you are down to spend copious amounts of money and buy three entree dishes then you would probably enjoy this place. Also, it is worth noting that this is a great place to go for just drinks. They have a large outside deck with a bar and they often play live music. (See their website for which nights.)"], ["Jessie H.", "Margs were good!! Shared 5 vegetarian dishes between 3 people and were sufficiently full. The flavors were unique and delicious! Our favorites were the spinach tart and Pea Buratta on bread and Brussel sprouts and our least favorite was the mushroom gnocchi."], ["Felicia A.", "good food ,the services. was good I can easily come here with friends that were both vegans and meat eaters and all would be happy.  great as a first course for sure. they do not bill themselves as a vegan restaurant however they did ok    we are off to the remedy or fiction kitchen for a proper vegan desert"], ["Lindsay B.", "Great food and atmosphere.  Manager was especially helpful and friendly.  A little crowded, but that is to be expected for such a fabulous place."], ["Mollyann R.", "I frequent Humble Pie for Sunday brunch. They are only open on Sundays from 11am-2pm. Short hours, but I have never had an issue getting seated.For the first time, I got to enjoy brunch sitting outside yesterday and I loved that experience! Large patio area.They serve their brunch with biscuits with jelly and butter to start. Yum! Once it hits 12pm, the bar gets busy making bloody marys, mimosas, etc.I love love love their Huevos Rancheros!The atmosphere is really fun here. I adore that they use Holly Aiken card presenters. Support local!"], ["Jeff S.", "We enjoyed a nice pre-dinner date here. The weather was perfect for outdoor seating. It was half-price wine night, so we had a bottle.We noshed on their fried green tomatoes - they were OK. But it was really just the deck and the wine that had our attention.Would definitely come out again, esp on half-price wine night :)"], ["Kristin S.", "What a fun, lively environment on a Saturday night. The menu offers a variety of tapas choices. The food was delicious! We had 4 different options: a cheese/honey dish, Brussel sprouts, fried chicken, and Gnocchi. Everything was incredible delicious!The sangria and margheritas were really great too. Highly recommend this restaurant."], ["Elizabeth M.", "Came here with a group of 8 on Mother's Day for the first time. We made reservations in advance so there was no worries about waiting. (Though, I have to give Humble Pie some props casue our original reservation was for 7 people and we called a few hours before our resrevation requesting to add one more. It seemed like no problem for them and they were very nice and accomodating about it). We arrived and were immediately seated inside. The outside space is very nice! Perfect for a warm day! My mom and I ordered Mimosas and my husband ordered a Bloody Mary. The Mimosas were good but I just dont know if they were $7 good. Kinda steep for a mimosa! My husband said that his bloody mary was just ok. I ordered the huevos rancheros. Other items orderd at the table were breakfast burrito, pancakes, breakfast sandwich etc. Everyone really enjoyed their food. The huevos were excellent....I mean beans, eggs, chorizo....yummm! The potatoes and biscuits that came out before the meal were an unexpected addition and delish!The food was excellent but the service was just mediocre (hence the 4 stars instead of 5). The waitress forgot my husbands bloody mary and we had to remind her to bring it. I think it came sometime during the meal. Maybe it was just a busy day but she was super spacey and rarely ever came by. In addition, two people (myself and my husbands father) made requests to alter the meal slightly. My husbands father just got into a biking accident and had super crazy sore teeth. He asked the waitress to leave off the tortilla chips (cause he couldnt eat them) on the huevos rancheros and she said they were kinda on the side and thus, not a big deal. I asked if they could leave off the sour cream on my huevos rancheros and she told me that I could scrape it off. No joke. So, I scraped it off and my father in law just ate around the chips. They were two stupid simple requests and I guess it was just kinda weird that we were told to basically eat around it. Good thing the food was so good that it made up for the odd service!"], ["Mallory P.", "I've been to Humble Pie several times and in various capacities, from brunch to last meal of the year to debaucherous company Christmas parties to Hopscotch Music Festival pregames.Humble Pie is divine. Unforgettable dishes include the braised short rib tostadas (they will make you utter lame, hyperbolic sweet nothings like, \"Is this deliciousness even legal?\"), shrimp and grits (my now-husband was visiting me from Rhode Island when he ordered this and am 99% sure this played into him moving to Raleigh), as well as the trout (this was a transformative, satisfying, wake up the next morning still talking about it date night entree). The interior is everything I want and need from a delicious, no frills, locally charged restaurant. Order any meat on the menu and you will be pleasantly surprised by the care that goes into it, from the texture, to the taste, to the presentation. Humble Pie is an awesome representation of Raleigh, and I would recommend it to any foodie local or visiting (bonus: the staff is equally wonderful)."], ["Joanne K.", "Aways one of my favorite places to go ! Love the outside bar area ! I bring everyone who visits me to this restaurant and they rave about it !!"], ["Kuanyu C.", "Shame on me for thinking Humble Pie is but a brunch spot. One night here with all the tapas offering with a best friend, and I had to completely change my story.One night, after beer tasting at Tasty Beverage (I have come to learn, that is a sentence of beer snob equivalent of \"One time, in band camp\") we slowly moved toward Humble. Amazingly for a Thursday night we actually got dibs on the table.Let's relive the 8-course tapas feast:1. Hummus - a bit standard, a bit awesome flavor2. BBQ Shrimp - that Basque BBQ sauce was quite exquisite, add the tangy slaw, we quickly devoured them all3. Spinach Tart - in the form of thin crust pizza, shallot, garlic with goat cheese and parmesan; SOMEONE took a giant bite before realized we had to take picture4. Ahi Tuna - sesame crust, seared to perfection, add cilantro and Sriracha, lay nicely on fried rice balls; only three? how is a couple supposed to share nicely?!5. Short Rib Tostadas - added chimichurri, and mango salsa on the side; again, only THREE? You can't possibly share evenly!6. Grilled Asparagus - with fried egg on top, over easy, once the yolk broke, blended with miso butter, became awesome sauce; with lesson learned previously, we divided evenly and to each's own7. Airline Chicken Breast - interesting name, interesting taste; crisp proscuitto and sautéed mushrooms on top; quickly got devoured.8. Chocolate Torte - perfect finish to a meal; whipped nutella, strawberries, and balance the sweet with sprinkle of sea saltPlus, this meal was padded with lots and lots Sangria, so it was definitely \"eat merrily, and have a good time.\""], ["Megan S.", "they were out of 2 of the dishes we wanted to try. did not care for the beef tartar or gnocchi. meat and cheese tray was small for $20"], ["Chad B.", "We came for brunch and it was average. I found the food to be incredibly bland and relatively flavorless.  I had the breakfast burrito. A massive amount of egg with a little bit of cheese in a tortilla that was either stale and dried out or just poorly cooked. A side of some sort guacamole dip was the highlight of what I ate here. But even that was bland. The coffee was lukewarm. Orange juice was warm- had to add ice to it. No one brought us biscuits (every other table had them), but after hearing about the biscuits from a companion who ordered the biscuits and gravy we didn't miss much. Like bricks apparently. Service was slightly above average. There were not a lot of items on the brunch menu- maybe 5 dishes. I won't be back. Health score was a 93."]], "Coquette Brasserie": [["Ryan R.", "Got into Coquette a little after 6pm on a Wednesday and it was pretty dead.  I had some colleaugues from work and was concerned I brought them to the wrong place.I asked the hostess if it was always this slow and she said it usually picks up around 7.  It did, the place was pretty full by the time we left around 8.The crowd is a little older than what I am used too.  Must be North Hills.  I think the woman across from me was asleep, sitting up.The food was good.  Not a huge fan of the potato Croquettes but the trout was excellent and the hanger steak my colleagues ordered look very good also."], ["Michelle W.", "We had a gift certificate to the Urban Food Group, and decided on Coquette as our choice for a much needed date night. I made reservations, and we were seated within 5 minutes of being there. It was a busy Saturday night, with gorgeous weather, and we scored a nice 2 top next to the window, which was open, which made for a very nice setting. I really like the feel of the place, but not sure if I would have been happy sitting at one of the table against the back wall, as they do not have the same open feel as the front part of the restaurant. Our waiter came and was very nice, and explained some specials that were very French, and my husband and I just weren't following (we are not very versed in French food...at all). We both ordered a cocktail, and I got a salad as an app, and Jeff ordered the filet with bearnaise sauce and fries, and I got the same, but I got the hanger steak. Our cocktails came out fast, and were delish. I got a champagne cocktail that had gin and apricot syrup and champagne - so yummy! Jeff got a Rye Collins, which involved whiskey and sour, and he loved it (smelled so strong to me). My salad also came out fast - endive, poached egg, bacon, croutons, cider mustard dressing. If this came in a large portion, I could have eaten this for my meal. It was so wonderful. I don't love bacon (gasp), but this was GOOD bacon. It was more like pork belly I guess. Our steaks also came out relatively fast, and we both ordered a glass of red to go with dinner. I ordered the Bordeaux, and although it was $10 a glass, it was worth it. It was really good. I was disappointed with the presentation of both of our meals. The steaks were drenched with sauce, and bearnaise is really rich. Also, my steak (hanger) was sliced for me, but not in nice even slices...it looked butchered. And then the fries....although they were good, there was so many of them and they were just thrown on the plate with no care whatsoever. It just didn't feel like the chef cared about this plate of food at all. The flavor was good, but again, way too much sauce overpowering the steak. Jeff agreed that the sauce was too much, but he also enjoyed the flavor of his filet. We had a lovely evening here, and did enjoy our meals and drinks. I am teetering on 3 and 4 stars, but I just feel for the price of the main course, the presentation could have been better, so I am giving 3 stars. We will go back, and I recommend this place for sure."], ["Bruce B.", "This place is serious French cooking! We lived five years in France, and the ambience is \"bonne\" et le cadre is \"agreable\". (Oh well, we've been speaking Franglais all our lives!) The generic Merlot by the glass was well above average, people tried snails and frog's legs for the first time, and everything no matter how \"unusual\" was great - don't worry, it will taste fantastic no matter what you order! (Except the burger - that's good, but just a burger. If you want a burger, go to a burger joint, you Bohemian!) Pour le chef: boeuf bourguinion, normalement avec des carottes?! Mais c'etais bon..."], ["Ellie S.", "This place was delicious! Incredibly spacious and pretty inside, it would be a great restaurant for a big brunch get together. We just had the two of us, our 3-year-old and our two dogs, so we opted for one of the two little tables available outside. Our waitress was fantastic, went above and beyond. We got the quiche lorraine, which was a towering piece of jiggly-ness. Thought for sure there was no way such a large piece could be good, but wow. It was amazing. The croque madame was delicious but felt like it was missing something - couldn't quite put my finger on it. And their pancakes were awesome, a hint of lemon I think. All in all, we will definitely be back."], ["Ashley T.", "One of my favorite restaurants in Raleigh. Excellent food, great atmosphere, and always good service. Perfect place for just a light meal or cocktail, or night out for a special occasion."], ["Drew L.", "My girlfriend and I had our first visit for sunday brunch, which turned into quite the day after bottomless mimosas.  We always heard about this place but never got around to it because we lived relatively far away at the time.  I remember the day like it was yesterday.  The weather was perfect and the inside was a bee hive! The only thing was, I dropped her off and it took me forever to find a parking spot.  The location is prime time real-estate, which you must take into consideration if you have other things to get done that day.  Fortunately for us, this trip we had nothing but time to enjoy ourselves.  That being said, waiting 25 minutes for an open table of 4 wasn't so bad, knowing that we had bacon with a side of champagne and vitamin C right around the corner.   The service was just fine, but was better than the food.  I won't rant and rave about their dishes as they were just par.  A neat look place as the bathrooms were stupendous."], ["JP S.", "French style for sure.  Entree portions were small-medium and I left a bit hungry after my Lamb shank... more bone than meat.  Can't really complain as I was with a group and we had our meals paid for, but if I returned to POPocket I would have been dismayed as that entree was $26 and really not worth the $ to me.  Wine by the glass starts at $8 which is reasonable.  Service was prompt and very good.  Our servers were attentive enough.  Atmosphere was bustling and a bit noisy, not too good for a business meeting where conversation is important."], ["Brian G.", "This was my second visit and first during the dinner rush -- our group did not leave disappointed at all.With a large group going to a busy spot on Raleigh for dinner you are never really sure what type of service you will get. Thankfully Coquette has a large back room where they usually sit all of their large tables. We had a group of 10 and had made a reservation a few weeks ahead of time.Server was very attentive about filling drinks and getting our orders as well -- He certainly had to be working there a while because he knew how to move around the table well and get our table going on ordering too. My cocktail (I ordered and Old Fashioned) ended up tasting more like a Manhattan then I am used to. I usually make my own at home and they didn't' have a similar color at all.Our food was really solid - we had a number of the appetizers to start -- the mussels were a hit -- and for our entrees a few people ordered the duck while I went with the monkfish that I really enjoyed too.Even those that ordered salmon had it cooked correctly too -- we were all pleased with the meal.Some of our table got desert that they all enjoyed too.We will certainly make sure to go back again."], ["Liz O.", "I do t think I could ever get enough of brunch here. The people are great and the food is amazing. I think I could eat the steak sandwich every week."], ["Erik A.", "My wife and I love this restaurant.  Having a toddler has prevented us from visiting as much as we would like, but over the last 5 years we have dined here close to 25 times.  The food has always been fantastic.  We went 2 times just in the past week, and I decided to try the Zucchini Charlotte, it was phenomenal!  A few times our service hasn't been as spot on phenomenal (waited close to 5 minutes after being seated for water/bread), but overall we are happy and will continue to offer this restaurant our patronage."], ["Amy L.", "I came here for dinner a few months ago and remembered having a good experience so I thought I'd come back again to try their brunch! We ordered the Eggs Benedict and Croque Madame, but was thoroughly disappointed. I was wary the moment the food came out, because of the plating - or lack thereof. Unfortunately, the food was equally disappointing and seemed mass-produced. Both dishes were bland and mushy, and both were drenched in sauce as if they were trying to hide what was underneath.I really liked the charming decor of the restaurant, but will not be returning for a meal!"], ["Jennifer C.", "I discovered this restaurant about 6 months ago.  I have eaten here at least 6-7 times and every time it has been absolutely delicious.  The lunch sizes are perfect and. Very reasonably priced.  The food is fresh and delicious.  My favorite is the lunch salmon and the gnocchi with the cranberries.  So delicious.  I haven't been there yet for dinner but lunch is 5 stars for sure!!!!!"], ["Kuanyu C.", "I'm glad to see they finally let go of the illusion that \"Le Plateau\" is actually petite; it is not coming on a plate either. This abundant \"fruits of the sea\" still comes in a gigantic basin ice bed, with half lobster tail, 6 oysters, 4 clams, 6 jumbo shrimps, 6 mussels and 4 halved scallops. CAUTION: It is market price.I already know that plate was going to be awesome, but what about this fix menu for the \"Taste of North Hills?\"~First Course~1. Frog Legs Meunière - Pan seared with lots butter, on top of roasted potato fingerlings and sautéed swiss chard2. White Bean Soup - with basil pesto added for flavors~Second Course~1. Flounder Fricassée - Pan seared, pomme puree** with creamy vegetable sauce 2. Pork Au Poivré - Roasted pork loin to almost perfect medium, adds garlic & leek butter, pomme puree and grilled asparagus~Third Course~1. Crème Brûlée - serves with fresh fruits2. Flourless Chocolate Torte - with raspberry sauce, whipped cream, and chocolate flakesAll these, added up to a very happy meal, right before movie time.**pomme puree is just fancy way of saying mashed potato, or at least this is how I always make my mashed potato. I love it, but kinda wished not both dishes came with it. If these are the only two choices on the fixed menu, at least give them a bit variety!"], ["Jon S.", "I visited Coquette Brasserie last week as part of a business function.  Perhaps the server was just trying to pace us because we were involved in conversation, but the service was a little slow.I don't think I have ever ordered lamb shank in a restaurant before, but I decided to try something different and was pleasantly surprise.We had the petite tarte flambée for appetizer and it was delicious.  The bacon lardons were an awesome addition.I would go back."], ["Mark B.", "The food was very good but pricey."], ["R J.", "Of course I had to review just about every review before I/we tried it. Our waitress was so nice and knew the menu very well.  I ordered the Pan Seared Fois Gras - yum! It us some vanilla compote that really added the extra touch and it was seared to perfection.  We had the Oyster Du Jour. They were delicious, but I would have rather had the mignonette sauce frozen and on top of my oysters. My husband had French Onion soup and thought it was delicious. Most French onion soups (in our opinion) are really salty/full of sodium unless it's homemade done right. Well, this was done right. Delicious. He then had Coc Au Vin and said the chicken was very moist and overall was very delicious. We ended with the profiteroles. They came out filled with ice cream and the server poured a hot chocolate sauce over them. Yum. I'd have to say - so far, I liked it. I was a little sketchy when I walked in and the decor reminded me of an older restaurant - but those went away as the restaurant packed very quickly."], ["Scott J.", "Excellent meal. Reasonably priced. Attentive service. Lamb was wonderful. Bread fresh and tasty. Greens well prepared. Average ambiance but overall superb lunch."], ["Sam Z.", "Have only been for brunch but all the things I've had have been good. My favorites I've tried are the salad nicoise and eggs Benedict options. Their omelettes are ok but nothing special- I'd go with something more unique. The menu is small but good options for sweet or savory. Will have to try it for dinner sometime!"], ["Michelle T.", "I'm only giving this place 3 stars for the manager and wait staff. The food was truly sub-par and quite a decline over the last year. I have frequented this place many times with friends and family for its location and beef- bourguignon. Sadly, on my last 4 visits, the food was truly lackluster! See the photo of the quiche, and know it tastes just as it looks. The steak was much worse, with absolutely no flavor! Can ANYONE please explain why there is such an infestation of flies in this place?!? When the doors are open AND closed! Bread anyone? (If you've been there, you know your bread is the landing spot for the flies, as it remains uncovered all day in the open)!"], ["Cameron B.", "4.5 for sure...nearly perfect!!Brunch is not just for the post-church crowd. It's clear that if you aren't sipping bottomless something on a Sunday afternoon, you aren't alive! Seriously, check your pulse next Sunday. With out a mimosa in your hand, your heart finds it difficult to pump. That's why on my most recent visit to The Triangle I had my buddy line up reservations a month in advance. We STILL had to wait 20 minutes for our table, but how can you ask people to rush in a restaurant themed after people known for ordering 1 cup of coffee and setting for hours?!?!With pieces of quiche the size of your head, a bread basket of crusty fresh bread and butter sprinkled with sea-salt, and mimosas that really do just keep appearing before you can see the bottom, this place had me before I even cracked open the menu. The space, large and industrial is Euro-sized by large wooden cabinets that house their extensive selection of wines, exposed brass fixtures and that classic white apron on the smiling staff. With plenty of natural light, the restaurant was a buzz with energy. There are no less than three people taking care of your table which means the service is excellent and fast with out being pushy.With plenty of pork on the menu, I opted for the burger with thick cut bacon bits and a runny egg on a croissant! ZOMG!!! Done perfectly medium, the patty was great, the bacon, amazing and that yolk just put it over the top. Heaven forgive me, I had to eat it open face and left the second bun for my bottomless-pit friend.....the mix of yolk and buttery croissant almost stopped my heart (hey....good thing I was holding that mimosa to keep it beating!)!! My friends got an omelette (MASSIVE) filled with a bechamel sauce that was very tasty and a Monte Cristo sandwhich pressed to perfection. There was NO room for dessert, and I opted for more mimosas instead of coffee! With reasonable brunch prices, great flavors and great service, there will be long lines at Croquette for years to come. Keep alive, keep drinking!!"]], "Village Draft House": [], "42nd Street Oyster Bar & Seafood Grill": [["Neelam P.", "Came to 42nd Street for a special occasion and it was definitely a special experience. We didn't know you had to sit AT the oyster bar to get steamed oysters, so we asked to get seated there which didn't take too long and we were re-accommodated with ease, which was a nice surprise!I was still getting into oysters but am willing to try anything. We were a group of 3 and we only ordered oysters, the half shell selections, the oyster sampler and a  1/2 peck of the steamed oysters. This was definitely plenty of food along with the delicious hush puppies they give you on the house! My favorites were the variety of the half shell raw oysters and the 42nd Street Baked Oyster!Overall - was a great experience and will definitely be back!"], ["Alexa L.", "We came on a tuesday for their happy hour. I actually don't like raw oysters, so I ordered from the regular menu. Hushpuppies are to die for. I actually took some home with me! They were served hot, with butter on the side. One of the best hushpuppies I've had!I ordered the shrimp and grits which were pretty good. It was a very large portion size so you'll definitely have leftovers. Everyone loved the oysters, 75 cents each!One person from our party ordered the grilled chicken which he didn't very much like, but I sort of think the first mistake was ordering chicken at a seafood restaurant, so I'm not holding that against 42nd street! Great knowledgable staff. Cool interior, very classic---feels like you're in a 1940s jazz club or something..I can't quite describe it, but you'll know what I mean when you see it for yourself.I would definitely come again and try the rest of what this raleigh institution has to offer."], ["Bethany W.", "We had dinner during restaurant week, but ordered off the regular menu. Overall, the experience was a mixed bag. The place has a great atmosphere, the cocktail menu was varied and delicious and the crab cakes that I ordered were much more \"crab\" than \"cake\" - so good!There were two things that made the experience less than perfect. The waitress's recommendations were always the most expensive items on the menu - for drinks, appetizers, and entrees. As former servers, my husband and I know that your best/most unique items are not always the most expensive. We went with the oysters she recommended (the most expensive) and when she brought them to us she told us they were the last ones and apologized for how small and unappetizing they looked! We were surprised to have been served them and charged full price for something that was admittedly sub-par. Unfortunately the night ended up feeling more like a sales experience than the nice meal that it could have been."], ["Bridgette R.", "It's always cool to come to an iconic restaurant.  When my mother was alive she insisted coming here for the oysters as that was her favorite food and I would say this restaurant is the BEST place to get those and their oyster bar service is bar none the best as I have been drug to everyplace in the triangle Area.  =)  I don't eat oysters so yes I say that with some drudgery.  But 42nd deserves accolades for that. I've had the fried seafood here before and it's fine.I've had their seafood soups/ stews that have changed in flavors and they were all good.Their hushpuppies are standard but good and fresh.  I enjoy them.Last night I got there early (they serve food at 5pm and I was there at 4:30).  The parking lot was empt so I called from the car.  They said the lounge was open and to come on in.  A sign would  have been nice on the outside for dorks like me.  I realized I'd never sat in the lounge here before.  I have always had a reservation and was ushered to a table.  The lounge reminded me of the old bars in the 70's my mom used to work in.  Extremely heavy barstools with \"leather\" seats that I kept almost slipping off of.  =)  Very dark interior.  Lots of framed photos of stuff I don't recognize and a very long wooden bar. Very nostalgic but genuine - not like the places that try to recreate that look.  The bartender was attentive and friendly but unobtrusive. I ordered a glass of wine and he let me have a taste before pouring which never happens at restaurant bars so I was impressed.Once my party arrived we got an \"island\" at the oyster bar so my sister could have her steamed oysters.  We toasted mama with some beers and munched on the very hot hushpuppies that appeared out of nowhere while we were chatting.Her half peck of steamed oysters were very good.  A couple were overcooked and she had asked for medium but that happens.  Our friend got the surf and turf of crab legs and filet.  The crab legs were beautiful but the filet looked really dry to me.  She ordered it medium and it was cooked correctly but watching her cut it (sawing it) told me I did not need to order steak here.  She did not comment either way. It came with a steamed squash medley which she did not want and I gladly ate - it was just steamed no flavor of any kind.  That's ok.  a little hot sauce fixed that.I ordered the fried green tomatoes with pimento cheese and shrimp.  There were 5 on the plate and no side dish.  A salad would have been nice.  But you have to order that a la carte.  It was good.  Nothing to rave about.  The shrimp was a good size.  It was AOK but again nothing that made me ooh and ahh. There was nothing really wrong with it either.We had ordered the crab and artichoke dip but it came out after the entrees.  It was the highlight.  VERY crabby in a good way.  Very little artichoke but maybe they were creamed in there?  None of us liked that the pita was deep fried.  They were greasy.  I took half of the dip home. So for nostalgia on many levels I'm glad I came and I would NOT refuse to come if invited for a special occasion like this one.  However, although I've been here over 25 times in the past, it's not someplace that would be on my top 10 to come to.  For the money there are so many other options in the triangle area."], ["Kalvin K.", "Great airport food from a local seafood restaurant. I was recommended this location by a colleague and was pleasantly impressed with their delicious food. They have an excellent seafood bisque and I was amazed at how good it tasted. Definitely will stop by here for dinner again with my work travels."], ["Robert T.", "Always quality. Love the freshness and tastiness of the food. Good service and a willingness to be flexible. Finding a table can be tricky during prime hours."], ["Jeri T.", "I've eaten here before and enjoyed pretty decent results. Today was not one of those days. My fish/crab/lobster bisque had a shell, which is understandable. But couple that with the multiple shell pieces and grit I had in my Oysters Rockerfeller was just too much. I was so looking forward to yummy melted cheese atop a bed of spinach and my oyster. What I got was a humongous mound of spinach, literally 3 times the size of the tiny oyster with a sprinkling of not-a-bit melted shaker-style Parmesan cheese from a pizza joint. I mean, seriously. Just stick it back under the salamander for a bit. Service was quick and friendly, but it certainly wasn't worth the $30 spent."], ["Priscilla S.", "Love, love this place. We first went for a romantic dinner. Our meal was delicious. The atmosphere was nice and dim. The staff was great.We returned with friends recently for drinks and late night snacks and were overwhelmed by how cheap the drinks were and how delicious the bar food is! We ordered 5 items from the late night menu and every one was excellent. Our waitress was a pro and checked in often. The band was a nice touch and the dance floor was packed. We'll definitely be back for a night cap."], ["David Kasey K.", "42nd Street is a Raleigh institution and you only need to dine here once to know why. I've now lost count the number of times my family and I have enjoyed an outstanding dinner here. We highly recommend, and be sure to try their Blue Yonder oyster. Best shell oyster ever!"], ["Trevva B.", "Simply delicious!! Buffalo oysters appetizer, Chilean sea bass!! and Aha tuna followed w/ a snickers martini!!! Atmosphere is very nice with oldies playing. The service was fast and pleasant. Great  experience!!"], ["Brian E.", "I didn't eat here but stopped in for drinks. While the drinks were a little on the pricey side, I really thought the service was pretty good and there are a few things on the menu I probably would have tried like the crab cakes."], ["Dale D.", "Classic Southern Seafood Restaurant serving very fresh caught marine delicacies and Southern style vegetable sides which includes black-eyed peas, collard greens, and cheese potatoes. A lengthy list of local craft brewery beers includes multiple styles brews: ales, lagers, hybrid and specialty beer such as Porter and Weizenbier. The dining room is fairly loud, especially when the after-work crowd starts filling up the bar area, but the service more than makes up for it with a reputation for excellence. Recommendations include steamed oysters, seafood bisque, twin lobster tails and many calabash style fried seafood dishes."], ["Chris G.", "A downtown Raleigh institution. Best place to grab some oysters in the area. Fun place to bring the group when they have a band. Seafood is fresh and tasty. Gotta get the potatoes as a side. Service has always been solid. Great bar too.Only once in the dozens of times that we've been here has there been an issue with anything. The management went above and beyond the call of duty to make it right. They really didn't have to go as far as they did to correct the situation (it wasn't that big of a deal), but they further proved why I'm a customer for life."], ["Adabelle E.", "I really wanted to try this out since it's a classic Raleigh restaurant and everyone always talks about it. I've been to the one in the airport and the Rockefeller oysters were delicious! I decided to check it out last night since it was restaurant week. Our server was great and knew everything about the menu. Overall I really was not impressed with the food, it was average. We had the mahi mahi and the brisket. I know this is a seafood place and you should try seafood there not meat but our server recommended it. The food wasn't bad it was just average. Our server told us only one of the things on the restaurant week menu was on the actual menu. Maybe we'll go back and try an entree that's on the actual menu."], ["Bruce G.", "I haven't actually been back to 42nd street to eat lately, but felt the need to do a quick review and upgrade to five stars. The main reason is when I visit other oyster bars in the area, I feel they don't measure up to the 42nd street experience, and I often mention that in other reviews. In short these are the best oysters you will find in this area, period!Oh, and the five stars is strictly for sitting at the oyster bar. Make sure you do that at least once. I have ordered their steamed oysters, oysters on the half shell and baked oysters such as oysters rockefeller...all of my oyster experiences here have been excellent."], ["Jim P.", "Terrible salad.  Goat cheese strawberry pecan salad with raspberry dressing¼ of lettuce was wiltedOnly  1/2 a strawberry!Almost no goat cheese.   Included a slice of lemon (WTFIWT?)Eat anyplace at the airport but here for lunch.  Cheaper and better places to go."], ["Erin H.", "Things I liked:Food was good and seemed freshHealthy choices with lots of steamed or grilled seafoodThings that I did not like:Very crowded Seemed understaffed. The person to my right and left had to rush. They had different servers who I saw working hard, so it seemed like a staffing issue.You have to commit to a half dozen oysters. Since I travel alone, I like just 2 or 3.Overall good food. A little pricey even for the airport but I'll come back for sure."], ["Jeff F.", "The Buffalo Shrimp hear is delicous. I've been here twice. The food was always good. Place is a little pricey but worth the money."], ["A C.", "I think the only thing worse than getting oysters Rockefeller full of shells with bacon very very clearly missing would be if they oysters were spoiled.  I guess that's the only saving grace I can say about my experience here. I had one oyster that was literally the size of a nickel. I mean Cmon at that point why even serve that one?  And out of the 6, 5 had shell shrapnel. On top of that my shocktop was $8. I mean really?  I get it, it's the airport and margin/markup on alcohol is always high but CMON MAN. I heard great things about the normal location but sadly it didn't translate to the airport terminal one."], ["Andrew L.", "Definitely one of my favorite airport restaurants I've ever been to. The oysters rockefeller are amazing, as is the tuna sandwich. Drink prices are pretty normal for a airport bar, but the food and service are way above par.As a nice additional touch, when I was at the bar, the bartender had set out a surge protector at several spots for phone/lap top charge. An awesome extra step that kept me for quite a bit longer."]], "Cameron Bar and Grill": [["Sarah W.", "We absolutely love this place. The cheese steak and fried pickles are to die for. Eddie recommended a great bottle of wine (that was half off) and took great care of us. I can't wait to go back."], ["Michael J.", "Great food. Great service. Shrimp wrap is phenomenal. Buffalo shrimp and grits appetizer was amazing."], ["Jessica S.", "My daughter and I stumbled upon this restaurant by accident because she was participating in a competition at Broughton HS. It was an amazing experience! Our server, Austin, was very knowledgable about the food and the beer selection and he was also very attentive. I had the jambalaya and it was the best jambalaya I have had in a restaurant. My daughter had the chicken fingers and waffle fries. The fries were extremely crisp and delicious! We will definitely come back again when we are in this part of town."], ["Kristy A.", "Saturday brunch?  Yes please.   I'm not sure what happened to Saturday brunch around town, but it beats Sunday brunch by a mile.  Why, you ask?   Well, for starters, you aren't surrounded by all the just-came-from-church people and their zillions of restless kids.   Another plus...I don't have to hear \"I'm sorry ma'am.  It isn't noon yet.\" when I try to order a cocktail.    Cameron serves up a great Saturday brunch.  It wasn't crazy crowded and we were able to talk and enjoy the morning.  The brunch part is actually just a short menu addition which is available from 10-2 (which means that you can order from the regular menu too).  The extra menu has some great stuff - from a traditional breakfast to a waffle sandwich to several different benedict options.   I ordered the waffle sandwich, which comes advertised as scambled eggs, cheese, sausage, and bacon between a waffle.  The server asked if I wanted my eggs done another way, so I chose over-medium.  They actually came over-hard, but it was fine and and I still think it was a better choice than scrambled.  The portion size is pretty healthy - the whole waffle is quartered and the pieces serve as the top and bottom buns for two stuffed sandwiches.  What I liked most was that the waffle was sort of soft - it probably would have been impossible to eat otherwise.   It could have used a hint of syrup or something, but it was good as is.   To top it off, it is served with fresh homefries or fruit - your choice.   My friend had a portobello mushroom cap benedict, which looked great at well."], ["Ron W.", "Oh yeah, finally under New Management may mean something.  My first visit to the Cameron Bar and Grill was sorta blase and non-descript.  I found the whole experience pretty average and the bar was set.  Roll forward two years later and the place is now being run by the Eschelon Group (Mura, Oxford, Sono) so I'm expecting a lot more.  Since it's right around the corner, I've got no excuse to not visit.  Inside it's basic, upscale pub decor with a lot of black and vintage Raleigh pictures.  There's two small dining rooms but I ate a the bar.  The brisket sandwich with collards and onion rings sounded really interesting and it was!  A nice thick brisket on top of some slightly tangy greens, yum.  I can't say it was an amazing meal but pretty well executed.  My earlier visit was also solid so I can say that the Cameron Bar and Grill has stepped up its game.  Probably 3 1/2 stars but I'll need another visit, Cameron Bar and Grill!  Keep up the good cooking and hope you raise things up another notch even if you don't bring in any more new management..."], ["Doug H.", "These guys went above and beyond in service. My wife called ahead to let them know I had very strict diet needs. When we arrived, the manager and chef met with me to discuss options they could prepare for me. They prepared a delicious chicken salad for me that met my dietary restrictions and I was stunned at the very reasonably priced, special meal for me. I can't wait to return and eat something from their menu."], ["Lindy P.", "We headed to Cameron Village last weekend to get brunch at the Flying Biscuit, but the wait was incredibly long... and Cameron Village had a lot of outside seating.  Most of their patio is covered by an awning, and their tables have umbrellas.  It was a great setup!  The inside looked tastefully decorated & kinda transitional, and it smelled clean in there.  I remembered I had the Gouda Grits & Andouille Sausage Shrimp at the Yelp Jet Set Fete event a few months ago, so I knew the food was bangin!We were quickly seated by the hostess and greeted by our server within a couple minutes.  I don't remember the name of the burger I ordered, but it had habanero-jalapeno relish with ghost pepper aioli.... and my god, that was one of the best burgers EVER.  The meat was seasoned wonderfully, but admittedly it was a bit overcooked- but that didn't detract from the awesomeness that brought to my taste buds.  Sara got some kind of omelet wrap, and she liked it okay, but wasn't anything to write home about.  My dish, on the other hand, must be known that this is SO good... and so spicy.  It's hard to find a spicy burger around here, but Cameron Bar & Grill knows how to do it."], ["Rick D.", "Solid brunch. Attentive service.  The southern Benedict was very tasty, would definitely order again.  The steak & eggs Benedict was very tasty as well, though the Texas toast didn't hold up very well and turned to mush under the steak.  Different bread is needed, something with a bit more strength."], ["Kathi M.", "Excellent service and great American standards with a twist.  Pimento cheese made fresh is amazing.  Mac and cheese with jalepenos.  Fried goat cheese salad add shrimp.  Yum."], ["Frank C.", "Good bistro dining experience with an adequate beer list and all the staples you expect from bistro dining. Of particular note is the brisket Rubin  with collard kraut. An unbelievable flavor experience transcending the traditional deli sandwich. You have got to try this masterpiece."], ["John S.", "Reasonably priced pub fare. Come early before it gets too crowded and noises  drinks are expensive except for beer, which is cheap. Large selection of craft beers.  Separate bar and dining seating. Quick food service of you are in a hurry."], ["Vic P.", "Great food with unique twists.  Got a burger served with ghost pepper relish and it was very good.  Was fresh and just the right amount of flavor.  Will definitely go back.  Service was very good as well."], ["Charlie F.", "I read about the many Raleigh restaurants that were participating in Triangle Restaurant Week, and after looking at many menus I decided to head across town to Cameron Village and the Cameron Bar & Grill for the $15 lunch special.I was impressed that the hostess immediately mentioned that they were participating in the TRW and had that menu on top of their regular menu at my table.  My choices included the fried pickles, the bison sliders, and the banana pudding.Fried Pickles were delicious, and the portion could have satisfied 2 or three persons,  The dipping sauce had just the right amount of heat.  Bison sliders were served with the onions, tomato, and lettuce on the side as I like with cheese, mushrooms and sauteed onions with mayo,  This was my first taste of bison.  Really liked the use of a leaner, less fat meat with a taste that is different than your typical hamburger.  Then there was the banana pudding YUM!!!  Great plating and delicious!  (Good thing my Dad who makes an awesome banana pudding doesn't read Yelp, because this one rivaled his!)The walls have large b&w images from the early days of Cameron Village.  I enjoyed this because as a Raleigh native (and an old guy) I remember when Cameron Village looked that way.  I liked the separate seating areas, the horseshoe shaped seating areas, the dark woods, and the angled mirrors.  The only thing I found very distracting from the overall look was the flooring, which I am assuming is a relic from the days when this was a retail store,  The floor had many marks and bare spots which was very unattractive."], ["Amy L.", "We decided to head into Cameron Bar & Grill since the wait for Flying Biscuit's brunch was too long. Wow, was I glad we did. The service was excellent and the restaurant had a very cool vibe. The brunch menu was expansive and my meal was delicious. Next time I head to Cameron Village for brunch, I know where I'm headed!"], ["Brittany G.", "Came to Cameron Bar and Grill last night with my boyfriend, after parking on Glenwood South provided too much of a challenge. I had been past here many times before while eating at The Flying Biscuit (aka my favorite place in Cameron Village) and have always been curious or what they specialized in. The drinks were good, but basic, and the crab cake sandwich seemed more filler than meat. The Cesar salad was pretty good, but for the price i've experienced better. Nothing really wowed me about this all.While the dinner and drinks were only so-so the dessert (a creme brulee) was excellent! That and the service was perfect! Kudos to our waiter for being attentive without getting in the way of enjoying our meal. I doubt i'll be back, but it wasn't a terrible meal. Just more cons food-wise than pros."], ["Joe H.", "I had the Death Valley burger here, with waffle fries.  The burger was pretty tasty--spicy, but not as spicy as I expected something with ghost peppers to be.  Came medium rare, as requested--good.  Fries were pretty good too.  One dining companion had the cheesesteak, which looked pretty messy--cheese whiz everywhere.  But it was allegedly very good."], ["Kelly M.", "Went here for dinner and trivia the other night and thought this place was fantastic! Be warned, if you decide to go for Trivia they take reservations and you should definitely make them! It's really popular, and only done in the second room.  The front room of the restaurant was fairly empty with plenty of seating, but if you wanted to be involved in trivia you had to sit in the back to see/hear.  We really lucked out by grabbing a table just as a group was leaving. Our waiter was really nice and very patient.  Since we were talking so much it took forever for everyone to decide what they wanted, and he had to come back three times before we were finally ready. We started off with a round of beer (they had triangle white on tap, one of my favorites) and all ordered burgers for dinner. We each got something different, they have a great selection of burgers including the Graceland, made up of peanut butter, banana & bacon (I was not that brave). I got the Atlanta, pimento cheese with a fried green tomato and a dash of hot sauce and it was fantastic!! So juicy and savory and cooked just right. I chose hot chips as my side and they were really good as well, especially dipped in some ranch dressing, yum!We got there around 8pm, and our food arrived around 8:25, just before trivia was set to start at 8:30. The food didn't take that long to cook, we just took forever to order. We enjoyed our meals while discussing each question. It started off fairly easy, we were at the top of the charts for the first round, but preceded to decline at a steady rate after that. The questions got so much harder, but it was still really fun. The atmosphere was really chill, and laid back and it was so relaxing to just enjoy a few beers, eat a delicious meal and guess at some trivia questions. Prices were very reasonable and they had a good selection of beers on draft, including some great local breweries. I see from other reviewers that they do Saturday and Sunday brunch, and I am always looking for some good brunch, so I will definitely be back to try it!"], ["Avi T.", "French Toast is amazing. Great food. We love to sit outside. The eggs Benedict is really as well. Some people ate so caught up in the place next door they forget Cameron has amazing brunch."], ["Scott K.", "Hey you! Yes, I'm talking to you.  You said you were looking for a place to go for a good meal. Maybe get a burger while watching the ball game.  I'm telling yah go to Cameron Bar & Grill.  They serve soups, salads, burgers, crabcakes, fish tacos, Philly cheesesteaks, wings, pork chops, braised short ribs and pasta dishes.  On this visit I had the \"Atlanta\" burger which is fried green tomato, pimento cheese and hot sauce.  This was a really good burger.  Since the is place is in Cameron Village, parking can be difficult.Food AStaff BDecor ALocation CHealth Inspection Grade 96.5"], ["Alex Q.", "I've only been here one time so my review might change, because I want to give it another chance.  The lighting is dim and the place has a cool setup but there was no one in there and you could hear a pin drop.  Sat at the bar and we both got burgers.  Mine was just okay and way overpriced.  The beer selection wasn't very good and I didn't see a drink menu."], ["Mike O.", "The bathrooms are clean here. The appetizers are okay. They have pita and hummus like a lot of places, and it isn't knocking anyone's socks off. They have these egg roll-y type things that are tasty, but probably not very healthy! The shrimp and grits is okay, too. Not bad at all, but not overly memorable. Seems to be a regular bar and grill aiming to go for a touch of class. But bar food is still bar food: tasty, greasy and probably not very good for you, but it goes well with the suds!"], ["Sean S.", "First time here, the salmon was amazing! Beer and wine list is diverse, the service was excellent and the outside seating area overlooking Cameron Village is perfect."], ["Korrie B.", "I love Cameron Bar and Grill. Brunch, Lunch or Dinner, this place delivers a quality meal.Service is always great. (Kay being LITERALLY the most amazing server I've had!)While lunch and dinner are great (trio of sliders, grilled salmon salad) to me, Brunch is the real winner.  Go, eat outside, smile knowingly at the poor chaps lined up for Flying Biscuit, and dig in to an amazing Waffle Sandwich!  (just ask for syrup on the side)I would be amiss if I didn't scold them for not carrying my very life source...iced coffee.  Come on people...we NEED our iced coffee!"], ["Lindsay S.", "Brunch at Cameron Bar and Grill is delicious and it's the only meal I've enjoyed at Cameron Bar and Grill.  I've actually been two Sundays in a row recently - April 29th and May 6th -- because I liked it so much!  They serve brunch from 11am to 2pm on Saturdays and 10am to 2pm on Sundays.  I feel like Cameron is one of the classier places in an already very classy Cameron Village.  I love that all their brunch dishes are served with either fresh cut fruit or homefries.  Their fruit sides are always really tasty and fresh.  The first time I went was with some friends and my sister.  Two people got the Portobello caps which is a benedict dish with portabello and peppers (obviously).  My sister got the Waffle Sandwich which basically is some evil creation straight out of Heaven and Hell when you think about combining fresh made waffles with bacon, cheese and sausage in the middle.  I, on the other hand, have gotten a Waffle every time.  The first time I got a side of sausage and the other I got a side of bacon because the Waffle doesn't come with any meaty stuff.  At $7 it's not too bad for a giant waffle and the quality which is received and considering it comes with a side.  It's big, fluffy, and like eating a cloud.  A little sweet, but not too sweet.  The service has been very good on both of my visits.  The first time I sat in side and the second I sat on their covered patio which I loved because I'm a girl who's all about a patio!  My only complaint is that the first time I went there Mimosas were on special for $3 and I misunderstood that to be a Brunch special, but it turns out that was only for that date.  Mimosas are usually $8, which I found out on my second visit....from now on I'll remember to ask every time what the specials are, but I was surprised that the server did not share with my table what the specials were.  A couple other special events to make note of: For Happy Hour, Monday thru Friday from 3pm-6pm, all appetizers will be half off.  For Thursdays, they have trivia so you can bring your friends and enjoy the DJ trivia and prizes are awarded for the top 3 teams.  I'd love to check those out because they seem awesome too.  Cheers to Cameron.  Doin' it well."], ["Liza T.", "I eat here all the time and absolutely love it! Great atmosphere, awesome staff and yummy food! I usually get the Fried Goat Cheese salad now the Strawberry Salad and it's always so good - I mean, who doesn't love goat cheese? And, the Buffalo Chicken Sandwich is so amazing! Try it with ranch on the side. The brunch here is also bomb! Trust me, the breakfast lover. I also come here sometimes with my dog and eat outside and must say the staff is so friendly and accommodating and brings him water every time. This is such a great local spot love it!"], ["Nathan H.", "I met a colleague here for a business lunch and it turned out to be a great lunch spot. The atmosphere was three-star: pleasant and modern but a little sparse. I had the pimento cheese, fried green tomato, and bacon sandwich. It was four-stars awesome. The service was prompt and professional. This is a solid lunch spot and I will be back."], ["Valerie B.", "Amazing staff! Our waitress was attentive and knowledgeable. I ordered the crap cakes and they were super tasty. I always eat crab cakes and this were good! The meatloaf was great too a large helping. The citrus cheesecake got the spot and the    Mac and cheese was a hit at the table too!"], ["Emma A.", "Ok, so here's the story. I came to brunch here with a friend and we wanted to go to Flying Biscuit. The line was long, so we had a seat at an outside table. When the waitress came, I glanced at the brunch menu and said, where's the biscuits? There were none, and I was so confused...this place is called Flying Biscuit? That's when it hit me, we weren't at flying biscuit! Although I got the restaurant completely wrong, Cameron Bar and Grill brunch menu was an great alternative to the crowded Flying Biscuit. I ordered the shrimp and grits, which were wonderfully rich and creamy. The crispy bacon set the flavor off. I don't think this is available on the menu anymore, but it was really good when I tried it. The toast (not the biscuit I was hoping for) that came with it was pretty good too. I want to return to try more things on the menu.So next time, I'll set out for Cameron Bar and Grill instead of Flying Biscuit."], ["Tom M.", "I visited with my five year old for dinner and we waited over 20 minutes and no one came to even take our drink order.  I wasn't crowded and I saw waiters visiting multiple table more then once.  However, no one ever stopped.  I told the hostess, as we were tired of waiting and decided to leave, and she was somewhat apologetic. Needless to say, we will never return."], ["Ryan W.", "One of my go to places. The Porterhouse Porkchop and shrimp and grits are so good. Classy atmosphere and attentive service. Last night was on point. Brian had great suggestions and was enthusiastic as well as knowledgeable. We will be back again."], ["Kathryn E.", "For some reason I had super high hopes for Cameron Bar & Grill...I think in my mind I had expected a somewhat 'nicer' atmosphere but the warm dark wood interior was still welcoming. We came for TRW (Triangle Restaurant Week for all of you 'non-foodies') and dived into a 3-course $20 menu. First up was a decent spinach salad with fresh ingredients and amazing vinagrette. Second batter was pulled-pork nachos which were sorely disappointing and scantily clad with a few droppings of pork and sauce. Third to the plate was salisbury steak which was the best part of the meal- delicious sauce and awesome roasted potatoes and green beans. Nice.All in all, a pretty decent meal for the price and we had a perfectly delightful server. I would definitely return to give this place another shot- I suspect TRW menu may not have been it's best showing."], ["Ela P.", "Good atmosphere, great food. Their drink specials are pretty top notch. I would recommend the Dianwrap, though their burgers are decent as well."], ["Gina B.", "WHAT is going on with all the 3 star ratings? This is a fantastic date place and where else are you going to get fantastic home cooking and a great cocktail for $8-14! I heard they were under new management, so we headed down to give our review of the new menu. I love me some meatloaf. The new menu features bison meatloaf with spicey ketschup (and I mean spicey)!!! I am gluten-free and the server had no issues swapping out side items for me. My friend ordered the shrimp and grits. I had a little sample. Ok, it wasn't a sample... I all, but licked his plate...some business about his not liking sausage...whatever, his loss my gain... his dish was delish!!!Cameron B & G feature alcohol specials nightly. We went on a Tues night and they had 1/2 off bottles of wine. Not shabby. Restaurant.com offers discount gift certificates for $10 or $25 off purchase, so be sure to check out those as well. Very casual venue... perfect for any night out. Service at the bar was less than great, but is usually better."], ["Megan B.", "I absolutely loved this place! Our server Laurie was so nice and helpful. She even helped me pair a wine with our crab dip. She was attentive but not in your face. I'm a catering manager at a restaurant in Chapel Hill so I have high standards and she hit everyone. The crab dip was so good and the shrimp and grits was amazing. My chicken pita wasn't what I thought it would be but it was still pretty good. Want a cool place to come chill and get some good food - this is your place!"], ["Stefanie B.", "Cameron Bar & Grill is the gem of Cameron Village. We always have wonderful meals here and I love the ambiance- upscale but casual, with old vintage photos of Cameron Village all around. Over the years, their menu has seen some changes- but we always manage to find something we love. I've  heard great things about their unusual peanut butter/banana/bacon burger. They used to have this incredible slider trio with pulled pork, meatloaf and one other (I can't remember!) that I wish they would bring back (hint!). I don't do burgers, but I love heat so I have found myself stuck on the Death Valley- but they let me substitute a black bean patty for the actual burger. It is delicious but it is HOT. Fried green tomatoes= awesomeCrabcake= awesomeCaesar Salad= awesome (I'm frequently disappointed by the various versions of a Caesar around town so it's nice to find a great one)Bartenders are always friendly and attentive, sometimes they have live music on Friday/Saturday evenings, and the patio is great on a nice day. Thumbs up, CBG!"], ["Christine T.", "My friends and I wanted a brunch option for New Years day and this place happened to be open and serving brunch (bonus!)  I didn't have much in the way of expectations but I have to say I was pleasantly surprised.  This place was really good, I got the waffle sandwich. It comes with bacon, sausage, and eggs.  As I don't eat eggs I asked for it without eggs.  I would totally come back again.  Oh and one other thing, the service was excellent!"], ["Mary B.", "The food and service were great!  I had the short rib sandwich and my date had the shrimp wrap. Both were lovely and tasty.  I would have liked more horseradish but that's all I would want differently."], ["Megan B.", "My husband and I decided to try something new for dinner one night and chose Cameron Bar & Grill. The outside seating was full but it was nice and quiet inside. My husband liked the selection of beers they have on tap and I LOVE that you can get the \"burgers\" with chicken or a black bean burger instead of beef. Despite this, I ended up ordering the low country pimento cheese sandwich with fries. It is incredible. I day dream about this sandwich. Their fries (waffle cut!) are also fantastic. My husband thoroughly enjoyed his Memphis burger and beer. The best part is that we had a great dinner for $24 (before the tip.) I think we found a new favorite spot!"], ["Margaret M.", "Thrilled to be back at CBG for Triangle Restaurant Week... always an interesting menu and good value. Last time I wrote about the great ambiance but ugly floors. The floors are fixed! They are beautiful wood tone.So this visit? Loved it, too. We had lunch... the seafood corn chowder. Though I don't see anything \"Chesapeake Bay\" about it, it was very tasty and enjoyable (I grew up on the Chesapeake Bay).  The fried green tomato with pimento and collards was delicious.  The open face turkey sandwich and the Pork Overload were also good, but I missed the offering of a dessert this time.In any case, we know we'll be back because we've enjoyed their fresh comfort food that has a unique twist."], ["Ashley O.", "Fries were cold, philly cheese steak came on a stale bun, blackened shrimp wrap came with 4 shrimp IN THE WHOLE WRAP. Came on a Friday night and the place was empty. Save your time & and go to Draft House instead. Never will head back here."]], "Solas": [], "ORO Restaurant & Lounge": [["Jennifer C.", "Each time I dine here, I am never disappointed! At this point, I've sampled multiple menu items and love them all. Buttermilk fried chicken, pot stickers, shrimp dumplings, and gnocchi are just a few of the dishes I've tried & they are amazing!! Especially the buttermilk fried chicken and green tomatoes, it is an absolute must someone in your party order this dish; you won't regret it.I've always enjoyed the service I receive here, prompt and courteous each time. The decor and ambience of the restaurant are very modern, chic, and classy. I love oro! It's easily one of my favorite DT Raleigh restaurants. Try it for yourself, you can thank me later :)"], ["Rhoda G.", "I want to give 4 or more stars but I can't because of the service we have received Saturday night. First off, the food is great. I enjoyed my crimini mushroom soup and Newton's Fall cocktail. My friend got the green beans and those were tasty. I'm not even a green beans fan! However, the timing between my first and second courses was way too long. Luckily talking to my friend and my cocktail kept me occupied. When I finally got my duck gnocchi, my friend still hasn't received her truffle mac n' cheese after even 10 minutes. We weren't the only ones satisfied with the service. A couple at the bar left after waiting 20 minutes and the couple next to us demanded their check because of the wait. I wouldn't mind coming back again but I will avoid this place on Friday and Saturday nights."], ["Earlene M.", "Myself and two friends had an early dinner at Oro after Billy Elliot today. They good news is the food is great. The bad news is our service was average, at best! Our food came out TOO quickly, and all at the same time except for my Macaroni and Cheese, which our waiter forgot. As more tables came in upstairs, they seems to get quicker service and had eaten and checked out before we were finished. Our waiter was not attentive to getting plates removed. If we heard it once, we heard it 10 times, I will be right back to get those plates, and he had NOTHING in his hands.Their tables are small, and in most tapas and small plate restaurants the food comes out a plate at the time.It will a while, if ever, we will dine there again. There are too many other good restaurants to choose from!"], ["Lee L.", "Food was good, but too small of plates, and way over priced. Wouldn't really recommend this place."], ["Michael B.", "This place is definitely one of the more trendy spots in Raleigh.  the decor is awesome and has that metropolitan feel that seems to be in right now. my girlfriend and stopped in for drinks as we had just finished a meal at capital club 16. so we didn't try any food which is why im not giving five starts until i can have the full blown experience. but as for what i have seen and experienced, i most certainly will be coming back to try there full menu and give a more detailed review of this very trendy place."], ["L. E.", "Don't go with more than 2 people. We had a large group and we were basically forgotten about (its not that big of place either), had to go to the waiters to ask for more water several times, food came out cold, food was way over salted (don't get the 3 bean dish), manager lady was rude, she ruined our friend's birthday surprise even after explanation. We knew they didn't split checks and that they split the total evenly which is fine for 2-4 people, but when we asked to split just into 2 groups since our party was so big and not everyone got drinks, they were really not nice about it. I just expected way better from all the other reviews.  We wont be going back."], ["Cait H.", "I surprised my beloved with a birthday dinner out this year and Oro delivered. We're big fans of the small plates concept at Buku, and I liked the slightly Southern twist to Oro's menu. I started with an Endless Summer, a delicious adult beverage featuring citrus vodka, pear puree and passion fruit juice. Please sir, may I have another? Jay liked the draft beer offerings and we quickly moved on to selecting as many delicious bites as we could stomach.We opted for the:Shrimp & Grits- Andouille Sausage and Green OnionFish Tacos- White Fish with Cucumber, Mango Salsa, and Wasabi GuacamoleVeal Ravioli- Crispy Spinach and ParmCaramelized Pork Belly Skewers x2- Pork Demi, Thai ChiliYou'll notice that I said Pork Belly Skewers x2. Yes, they were good enough to order again. These little meaty lollipops were a marriage of bacon-crispiness and pulledpork-tenderness. Oh jeez - delicious. The chef came out to speak to us and heard that it was Jay's birthday. He presented us with the very beautiful, and complimentary, Campfire dessert (which is totally what we were going to order anyway!) The middle of the plate was ablaze and we were able to roast marshmallows, dip them in chocolate, roll them in graham cracker crumbs and pop fresh blackberries, strawberries and bananas after eat s'moresy bite (that makes it healthy!)Our wonderful time at Oro was only dampened by a financial snafu the next morning. Apparently if you charge your bill to a debit card, depending on your bank, you may be charged the amount of your bill, as well as a second charge for the bill + tip on your statement. I called Oro to inquire and they've heard of this issue in the past with debit cards, but that it's the bank's fault (Wells Fargo, in my case) not the restaurant's. The additional charge was gone in 24 hours, but it was still not something I'd love to happen again."], ["Anthony G.", "If Sweden had a K&W Cafeteria it would be ORO, Oro for gold and the Mac & Cheese is golden! It was one of the best I've ever had. The portion was tiny (Unlike the one at Taste and Humble Pie) but it was great. The Spring Rolls were good, as was the Flat Bread with cheese and so forth. Yes, we know the portions here were Tapa size as the waitress explained but Tapas in Spain are usually quite filling at ORO they were not. Well, they are if you order 3 or 4  and share. Thank god I wasn't hungry otherwise I would've swiped someone's meat ball. The place got crowded fast and the clientele does not look the same as they did when ORO first opened, it was like an airport. I like that you can order 2 oz of wine. The sweets were very good, Creme Bru-haha and a bananarama pudding very tasty. ORO isn't one of those places I'm dying to return to, it was good but with so many choices you can experience this place once and that is enough."], ["Justin N.", "We had attended an event at ORO once previously so we decided to try it out for dinner last weekend, before going to see the NC Symphony. We live almost an hour away so we budgeted an hour and a half to eat and walk to Memorial Auditorium. We were seated upstairs and it was almost ten minutes before a server spoke to us. We ordered drinks and that took 10 minutes to deliver to the table. We wanted to ask questions about the menu but it was 30 minutes from the time we sat down until the server came to take our order. In the end, we sat there for an hour and a half. In that time, we had a small glass of wine each and we only shared a couple of appetizers. We never got the chance to have entrees or even second drinks. Finally, we had to leave but out server was unavailable to check us out. We walked downstairs and asked for our check. We explained why we were leaving. They still charged us for the wine and appetizers. We didn't ask for anything. We paid and left. This was the worst dining experience we have had in some time. We went to the symphony hungry and later had to find late night food to eat because we never had dinner. I don't see us returning."], ["Ashley W.", "My family stumbled in for dinner on Friday quite unexpectedly, and it was amazing! We weren't aware this was a \"Tapas\" place from the street--I actually thought this was an Asian/sushi place because of the name. Oro translates to \"What?\" in Japanese--I only know this due to my teen obsession with the Rurouni Kenshin manga...Anyways, back to the food! We split 8 orders of tapas between 5 people:- Truffle Mac & Cheese (2) -- Absolutely DIVINE--could not get enough! Medium-sized casserole dishes were filled to the brim with this heavenly, cheesy manna- Fish Tacos (2 plates with 4 tacos) -- Large chunks of crispy grouper, mango salsa, and thinly sliced cucumbers. Paired with the wasabi guacamole, this was the BEST tapa dish for flavor.- Fried Chicken & Green Tomatoes (1) -- best green tomatoes I've ever had! I would recommend order one plate per 2 people. Chicken had a sweet, honey-flavored brine.- Smoky Ribs (2 plates) -- perfectly done and delightfully tenderOur eyes were definitely bigger than our stomachs (hence, my mom placing our entire order all at once). I would recommend PACING yourself through your meal... The dishes WILL come out fast! You definitely get a LOT of food for your money. NO kids--this place is ritzy... Also, I recommend wearing something dressy because it is more of a *lounge* than a restaurant. The people around us were either on dates or out for after-work drinks/desserts. I'll just say there were a lot of yuppies... My only negative was that when we got to the door, we were told there was a 30 minute wait since we had no reservation. Meanwhile, there was a handful of empty tables around the room. After my mom pleasantly chatted with one of the hostesses for 5 minutes, she cleared a table for us. Being nice can get you places. Definitely will be back to try the rest of the menu!"], ["Laurie V.", "I really like the bartender, Corrie.  He is a sweetie-pie.  The food is fair.  Not excellent.  Fair.  That's the best word I can conjure. I had the foie-gras bone marrow dish.  It kinda tasted like chicken. (I hate when people tell you things \"taste like chicken\", but it really did. Nothing like the foie gras I've had before.  And nothing like the bone marrow I've had before.)  I had higher expectations. I also tried the pork belly.  Now THIS was pretty good.  Not the best that has ever grazed my palate, but pretty darn good. The restaurant was drafty on a chilly day.  Every time the door opened I froze.  For some reason I got an email that my reservation had been cancelled, so I had to call the restaurant to receive my Open Table points. (These points are a hot commodity!)  The hostess didn't seem to believe me that I was actually there and challenged my request.  Not very nice of her!  Finally she promised me they credited my visit.  But she still never did. Sidenote: Finally Open Table did credit me. Sooooo, aside from the really friendly service at the bar, I'm not sure this would be at the top of my list to revisit."], ["Aaron A.", "POISONED !!!If you are gluten free DO NOT EAT HERE. My wife has celiacs and was poisoned by her meal here. While the dishes may be labeled \"Gluten Free\" DO NOT TRUST THE KITCHEN. Apparently they are not safe & careful about contamination.A pity because the food was good. But paying $80+ for the privilege of vomiting is not something I can recommend.Sorry ORO - you failed.EDIT: After sending the restaurant a note about the problem they offered a full refund and said they would review the GF procedure with their cooks.I would still avoid the potato pancakes which apparently are deep fried in a common cooker."], ["Tanya D.", "Great food, fair prices. 4 instead of 5 stars just because of minor things. Our entrees were delivered about 5 mins apart. The table for two was wide, and we felt far apart (and loud). Food...though...oh wow! I had the gnocchi with duck. Yum! He had the bison and potato, super Yum. Less than $50 for fine eats and a drink apiece. I want to try more. :-)"], ["Annie G.", "Absolutely loved my first visit to ORO! It was First Friday so my friend and I were worried that since we didn't have a reservation that we wouldn't get seated. But we were offered 2 choices, the bar or the \"chef's table\" as we called it. We opted for the chef's table and it was the best choice we ever made! It was so exciting and interesting watching the chef's cook all the food. We were trying to guess what they were making and would look over the menu to try and figure it out. It was a blast! You could also see all the orders coming up so we were like, \"Oh, what's that? I want to order that!!\" Sadly the host said that these particular seats (4) were not very popular. Good for me I guess, cause I would ONLY sit there from now on.We ordered the truffle mac n cheese since our waiter said it was delish and really popular. It was soooo good! I was amazed to see how fast it was cooked too! My mac  n cheese takes a good hour! Next we had the spring rolls were that were also good and really fresh. I want to try everything on the menu and was sad that I was already full. The tacos were very popular and looked fantastic. They used naan bread for the shells. For dessert we got the s'mores. YUM!!!! You get marshmallows, berries, chocolate syrup and crushed graham crackers with a little fuel cube that makes a fire for you to roast the marshmallows. It was so fun! After we ate, the executive chef came over to us and chatted for a bit. He was super nice and use to live near me in CA! He had an awesome gold bracelet too :)I can't wait to bring my husband and my other foodie friends too!!"], ["Dirk W.", "I tried this downtown Raleigh place after reading a friends 5-star review on Yelp during a recent trip.  I wasn't disappointed.  They have an awesome selection of wines by the glass and an extensive menu.  I started with the beet salad which is a large portion and includes plenty of greens.  For an entree, I had the Sea Bass on a bed of braised ribs.   After reading a few reviews, I had to order the corn....all I can say, you cannot leave this place without trying it.  Possible the best item on the menu."], ["Daniel K.", "This restaurant is a perfect reason why I should make an effort to sample downtown Raleigh's food scene more frequently.  My wife and I were invited to join our son, our future daughter-in-law and about 20 of their friends for a birthday celebration here on a Monday night. The restaurant was a terrific venue.  The space was modern, quite roomy and very pleasing to the eye. The group spent about 45 minutes having cocktails at the bar. I was impressed with the selection of top shelf spirits and wines. They had several single malt scotches that one usually does not find at a restaurant bar and a very nice choice of wines by the glass.  Eventually we were seated in an upstairs room that was open and airy. Our group opted to allow the chef to prepare a tasting of the restaurant's whole menu rather than place individual orders. That was definitely a good move as it gave us a chance to experience all the different dishes this very talented chef creates each day. Each selection was delicious and the quantity delivered to our group was plentiful. My two favorites were the calamari, which was cooked perfectly and beautifully seasoned and is among the best I have ever had, and the mac and cheese, which was absolutely great.  The servers were attentive and very friendly. The food came at just the right pace for a big group and our glasses were always filled. It was a terrific dining experience in a very comfortable restaurant. I loved the food. I will definitely be back."], ["Kristy A.", "This place was really a pleasant surprise.  I went here with a large group - 12 people - and had a great time.  Our server was great, the food was great, the place had ambiance and was comfortable all at the same time.  Would have been 5 stars except for one thing - the NO SEPARATE CHECKS policy - ugh!   I tried a whole bunch of dishes since I was with a big group.   We started with the beet salad - diced beets with a little bit of goat cheese and some vinaigrette.   Then on to the fried chicken and tomatoes.   This was four decent sized pieces of boneless fried chicken and two fried green tomatoes, all drizzled with a buttermilk dressing.   Really good.   Then the truffle mac and cheese.   Good, but not special.  Definitely worth eating, but I would probably try something more unique on the next visit.  The grilled corn came next - 8 small pieces of corn on skewers with a little mayo based dressing.  Tasty and flavorful.  We finished the savory portion with the crispy shrimp.  Three large shrimp with a cabbage slaw.  This mess of food was split between me and one other person and it was more than enough.  We were stuffed, but that didn't stop us from tasting a few of the leftovers.   The pork belly was amazing.  4 or 5 chunks of succulent tender meat.   The jerk chicken was good - not really my thing.   The gnocchi and duck breast was good, though oddly proportioned.  Lots of gnocchi, which was soft and light.  Three little pieces of duck breast.  What else...the octopus was eh.  And I didn't try it, but my friend from Spain wasn't impressed with the paella.   Overall, though, lots of great dishes.   We finished with the smores dessert which was pretty awesome and the bread pudding, which I wish I had skipped.   The smores was a pile of marshmallow, a pile of fruit, a pile of graham cracker crumb, and a ramekin of chocolate sauce - with a flaming sugar cube in the middle.  Inventive and tasty and fun.    I will say though that the no separate checks policy was super annoying.  I almost subtracted two stars instead of one.  They told us in advance and all, but still...   We spent $500 there...and a good half hour trying to divvy up the bill.   They will take multiple credit cards, but you have to do the math yourself.  No easy feat with 12 people.  You are probably thinking \"why didn't you just split it 12 ways and be done?\"   That definitely would have been simplest, but not everyone knew each other and some folks definitely out-ordered others.  The split checks ranged from $25 to $55."], ["Karen A.", "Oro never disappoints! 8 of us had drinks and dinner there last night. The food was DELICIOUS, and the service was wonderful. I can't wait to go back!"], ["Lori R.", "Love the ambiance of this new restaurant.  5-stars for the cool automatic wine tower!  5-stars for the nifty \"fireplace\" on the wall upstairs.  5-stars for the mostly friendly staff and the wonderful service, and for the comfy chairs.    As for the food, I would mostly order differently next time.  Favorite, by far, was the caesar salad.  I would not only get it again, but would crave it and want to go there for it, which is the ultimate compliment I can give a restaurant.  Heather B posted a pic of it that shows the anchovies, freshly shaved parm and the shrimp croutons, which really MAKE this salad.    We also shared the \"crispy shrimp\".  Again, look at Heather's pic for reference.  I wish I had read prior reviews, as I would agree with them.  There is nothing \"crispy\" about this shrimp.  There are three of them with a mushy batter.  The slaw was good and it was crispy, but the description of this item should really be changed to change expectations.     The other item the two of us chose to share was the meatball \"flatbread\".  This is a menu item for those that prefer little to no spice in their food, but that kind of person might be unlikely to order it since the description mentions \"red chili flakes\".  If there were any they were totally invisible and completely tasteless, as were the small meatballs, the swipe of something that was supposed to be a tomato sauce, and the crust that was not thin and flat, but oblong, slightly thick and again, tasteless.  Thank goodness for the basil.  I would so not order that again.   Others in our party did the \"smoky ribs\", and the filet.  I tasted a rib and it was good, nice and tender. Did not detect a smoky flavor.  It was a generous portion.     Drinks:  Please refer to Heather B's review for a description of the \"Enomatic system\".  It did indeed look very cool, and I would have loved to try something from it, but I will have to win the lottery first (am always hopeful!).  That being said, there are other options.   I was very happy with the $8 glass of chardonnay that I ordered off the regular wine list.  Husband enjoyed his Sweet Josie beer.  Sometime I want to go back and try the cocktail sampler... three 2 oz. tastes of different cocktails for $15.    Speaking of drinks...a dislike for me was that they serve water without ice.  Might be a hip, popular thing to do, but it's not refreshing to me.   Dessert:  three of us ordered it.  I HAD to try the \"coffee and donuts\".  Am not a big dessert gal, but am a sucker for donuts.  These were donut holes served with \"orange sugar\" (couldn't detect the orange), with \"mocha and sweet cream dipping sauce\". I can't tell you how good this sounded to me, and how good I think it could be.  The donut holes would have been much better with a lighter texture.  The insides were an interesting texture, almost creamy, but not necessarily in a pleasant way.  They would have been better lighter, imho.  Would have loved to taste some orange on the sugar that was sprinkled on them.  The mocha \"sauce\" was almost a pudding, very very bitter with a lot of cream on top.  Think it would have been a lot better sweetened up a bit.  With a little tweaking, this dessert could be over-the-top.  As it is now, I would not order it again.    Husband ordered the strawberry tiramisu.  He liked it, but was expecting something more tiramisu-like, based on that name being in the description.  He thought it was more like a strawberry shortcake.  Based on the pics I see here, and the one I took, you can see that they've changed the vessel it is served in.    Sometimes it is about expectations, and menu descriptions should be just that, accurate descriptions of what you get.  I'm thinking some tweaking might be in order here.    Will also add that one thing that really bothered me about this place was my Stepmom asked to sit at a table by the window when we walked in.  She (we) were told it was \"reserved\".  Oh okay, we'll sit elsewhere.  Needless to say no one ever showed up for that \"reserved\" table while we were there. Just guessing we weren't a cute enough group to warrant a window seat.  Needless to say none of us forgot that, and we haven't been back."], ["Ariette V.", "Risotto and Tuna were good, all the other plates were ok, but nearly cold - the design of the restaurant is really nice, but we were disappointed with regards to the food - there are many better places in Raleigh"]], "Capital Club 16": [], "Jimmy V's Osteria & Bar": []}