{"Neomonde Bakery & Deli": [["April H.", "I've eaten here many times, and often stop in after classes to get some of their baklava ends (pretty darn cheap at $6 a pound). Solidly delicious food, and great pastries/baklava. I get the sampler platter and have yet to get something I wouldn't get again, though I switch it up because there's always more delicious options! The attached store is also great for any and all spices with things like whole nutmeg, cloves and cinnamon sticks that can be quite pricy elsewhere very reasonably priced."], ["Bee T.", "Neomonde has been one of my most favorite places in Raleigh and I'm a frequent customer but I'm not too sure about recent  experiences. I've been a loyal customer since 2002. I purchase some grocery items and food from their Deli department. I sometimes take food from this place to my sister in DC. But recently, my assumption is after their most recent remodeling, their quality of food and service have been compromised. Tonight, I've ordered one of my olde timer usual's which is a half beef/lamb shawarma sandwich which it comes in half pocket pita. When I got it I've noticed that it is a lot emptier than usual, what I'm used to get is a half pita full of meet and variety of pickles, see the picture. I told the girl at the register and she said this is how it's been always. The manager checked on us and said oh yes we changed how we cut the pickles, but that was not what I was saying they had changed what/ how much goes on those sandwiches which is sad. She offered to get me more pickles but I didn't want her to go through the trouble. They also used to have 'the best' tabbouli but most recently they have changed it to quinoa and most importantly less parsley. So it's more quinoa salad than tabbouli, you see less green and more white... I wish they had kept the original one and added the quinoa one as a second salad option but hey ....  My friend at work told me: don't you love and go often to that Neomonde place, they have a $25 for $50 coupon online, why don't you get it? Of course I got it and it is the most inconvenient coupon in my life. So the $50 come in five $10 coupons. You can only use it on deli items, if you happen to get a drink, like a bottle of water, from the frig next to the register you have to pay that separately as that's something they don't make!!!!! You can only use one per order regardless of how many entrees you order. If your food end up being $7.47, you can't use coupon because you won't get the rest of the credit back or if your order is $16.38. You have to pay $6.38 with a card or cash... Anyhow not worth the effort at all.. I'm not sure whether the management has changed or they're consulting with someone as their new rules and menu and food preparations have been totally changed and it's not that appealing any more. Even the new decoration in the restaurant area with the glass ceiling looks very old fashion and outdated. This palace has been always on the expensive side for a cafe but the quality of food and service were differentiating factors but unfortunately both a declining."], ["Emily R.", "The past few times I've visited I've ordered the sampler platter and have been very happy with it. Today I had the baba ganoush with fresh-baked whole wheat pita, mujadara (lentils, rice, carmelized onions), potato salad (Middle Eastern style with cumin, green onions, bell pepper, lemon and mint?), and a falafel. The potato salad was so good I had to immediately tweet about it, and the falafel was awesome - not too dry. I washed everything down with a Dr. Brown's diet cherry soda. I try to visit at off times like 3 pm to avoid a line and I focus on the vegetarian options because that's what they do best!"], ["Eric S.", "NeoMonde has made it so I can't enjoy Mediterranean food anywhere else. It's just that good. After eating here, I tried med deli in chapel hill and just thought to myself, \"what am I doing with my life?\" It felt like dating a girl you kinda sorta liked, but knew another girl that was just better in every way. I don't want to live that way. I don't want my life to be about settling. Life is too short. Don't settle. Eat at Neomonde"], ["Sarah G.", "Woo Hoo! Wish we had one of these in Austin.   Here staying with friends in Raleigh for Dawn's orientation nearby at UNC-CH.  aNima just said a similar place is Mediterranean Deli on Franklin when are in Chapel Hill.  Tried the four salad plate but everything each of the 9 of us had was really good!!!"], ["Maya G.", "I came here at night and was kind of convinced I was going to die. I'd been warned that it was a little off the grid, but the reality was that it was tucked behind train tracks on a dead end street. However! I didn't die (always exciting) and instead had a lovely eating experience. Neomonde's is a deli/restaurant hybrid: you walk up to a counter to order where virtually everything is on display. After you pay, you take a seat and they bring the food to you. The seating area is vaguely cafeteria-esque. That being said, it's very well done--the furniture is appealing and the ambiance is warm and friendly.As a vegetarian, I was ecstatic about the multitude of salad options--it actually took me a good 10 minutes of standing at the counter to actually figure out what to order. I got a lunch special, which was a half-pita of falafel and two salads. From that, I chose a pumpkin chickpea salad and a kale pomegranate salad. It also came with a baklava, but my date snagged that. ;)For the price, it was quite good! The falafel wasn't particularly distinctive, but the pita was stuffed with a variety of different greens and herbs that were flavorful and crunchy. The salads were delicious--I'd never before considered a world where chickpeas and pumpkins meet, but it turns out it's a world worth living in. I'll definitely be back!"], ["Andres B.", "This place is fantastic, regardless of what you get. But seriously, get the hummus - it rules. Any of the shawarmas are also delicious. Service can sometimes be a bit spotty, but never discourteous and the food more than makes up for it."], ["Satty C.", "I love the food here -always fresh and healthy, and a wide variety of options to choose from. Great spot for Sunday brunches! I always get their platter combos. Their salads have never disappointed me."], ["Jesse P.", "Delicious! This is one of my favorite lunch places with my girlfriend as it's real healthy and clean. A lot of good options, all healthy and vegetarian based, even when there's a long line it goes pretty quick. Would recommend the large platter and get two different meat kebobs, the kafta and the chicken. So many different sides, I actually really like the warm/cooked cabbage side and then the other one I always mix up, tabouli, etc. Pitas are good but not as good as Med Delis ;)"], ["Felicia A.", "always the very best.  I have been enjoying this food for more than 25 years. I have watched the family grow this bakery and deli into a must have! type of food.  they have always taken care of me with respect and kindness!!  the staff has changed from momma and auntie on the kitchen. but the people are still the best.  they have not forgotten what makes them special"], ["Eric D.", "Great food. You get to taste if you ask. I loved making my own sampler. I will be back."], ["Kate T.", "The ONLY reason this place has three stars is because the majority of the food looked fresh and good. It lost two stars because it was pretty loud in there and when I asked the girl behind the counter if they had avgo lemeno, she looked at me like I had a third eye. That's like owning a North American restaurant and not having grilled cheese. What?! How can you not have one of the staples of every Greek menu?  I ate a beef kabob. There was only beef on it. No veggies. Waste of time. Go to a real restaurant!"], ["B C.", "This place is awesome. The food is delicious and the employees treat you like family. I have had two events at their restaurant and one catering event. I would always recommend them because they are so easy to work with."], ["Alice L.", "Their chicken and lamb skewers are awesome. They are served with this delicious garlicky pasty thing. THAT garlic paste is absolutely delicious. It is worth having garlic dragon breath for three hours after no matter how much you brush or rinse. Tried the lentil tabbouleh, regular tabbouleh, but my favorite is the chick pea salad- all delicious but chick peas were especially yummy. Had their regular hummus and their jalapeño cilantro one (AMAZING!) tried the veggie lasagna - not a favorite. Kind of tasteless compared to their other items. It's a healthy, inexpensive, and very tasty meal. Wish I had room to taste some of their sweets as they all looked so good. Next time!"], ["Charles C.", "I wanted to like this BUT they wont make a club sandwich so I drove a long way for a club sandwich they had all the meats for but refused to make. And I call Bullsh÷= on the we are \"Lebanese\" excuse.Bad yelp review for sure for not fulfilling an easy customer request. I guess they missed that day at Capitalism school."], ["Michael H.", "Little out of they way place with great food.  GF options include tabouli made with quinoa, 3 different deserts.  Love the lamb and chicken kabobs.  Tatziki was pretty good as is the hummus.  Well worth the drive."], ["Carly N.", "I have eaten here several times and it is always consistently good. They are mid-way through a renovation and the place is looking really good. It is counter service and the line moves pretty quickly. They label all their dishes with allergens and offer a huge variety of gluten free dishes and desserts. They even offer gluten free pita bread. Oh my, it was so good. They have a huge variety of sides to choose from and their sewers are always good. They offer a good selection of kid's menu items, skewer, sandwhich, etc. They have a little grocery store in the restaurant, too. Make sure you grab a fresh pack of pitas to take home and some olive oil."], ["Daryl B.", "Awesome Mediterranean food.  We had the spinach feta pie, sampler(4 salads), white chocolate strawberry mouse cake. Excellent all around, especially the cilantro jalapeño humus.  Definitely a new favorite spot in town."], ["L N.", "Neomonde is a hidden pearl in a sea of mediocrity that is the Raleigh food scene. Delicious, yet healthy, I always take my visiting out-of-state friends here after they get their fill of Bojangles and other southern fried favorites. I would even dare say this is the best Mediterranean in NC but I think Med Deli in Chapel Hill takes that title by just a hair. Very vegetarian friendly, my favorites are the vegetable lasagna and the baba ganoush (which beats Med Deli's baba ganoush). Plus I'm always down to support a local family resturant."], ["Raisa C.", "I've been here twice. I'm not the hugest fan of Mediterranean food which may be the problem but it's decent Middle Eastern food and a nice set up but nothing extraordinary."]], "Petra Grill": [], "Shish Kabob": [["Steph C.", "I spent a few days in Raleigh for a conference, and like any good professional on a work trip, I hit the bar way too hard on night one and ended up puking in my room the next morning. After a nap and a panel, in which I was an active participant, I needed some sustenance, bad. I stumbled over to Shish Kabob, which was right outside the hotel, in the lovely City Plaza.The place was small and casual, basically a take-out spot with a few tables outside. It was empty when I went in at three in the afternoon, except for a guy manning the register and grill. He was very nice and helpful. I ordered a Phoenician Platter and a Diet Coke, and it was a decent solution to my problems.The platter came with two kabob skewers and three sides of my choosing, which didn't seem like an inordinate amount of food until I held the container in my hands. It was a large lunch--I got it with chicken and beef kabobs, with sides of rice, tabouli, and hummus with pita. The chicken was tasty, if on the dry side, marinated in a garlic sauce. The beef was also nice and flavorful, with a little bit of toughness. I really liked the fluffy rice and the fresh tabouli, and the hummus and pita were satisfying. I sat alone on a planter in the City Plaza and ate with the top of the styrofoam container flapping back and forth in the breeze--a moment of calm in a busy week. I'd recommend Shish Kabob if you need a quick meal in the area. The kabobs aren't the best you'll ever have, but they should do the trick if you're hungry."], ["Joann F.", "Love this place. Food is great & staff is always nice. Not authentically Greek. Just Mediterranean, which is fine, the food is fresh. Just wish there was inside seating & a customer restroom. Otherwise it would've been a 5 star."], ["Jöshua M.", "Sometimes you need a quick and easy meal that hits the spot. You may also want this meal to actually be healthy. Shish Kabob perfectly hits the trifecta of [reasonably] healthy, cheap, and fast. Prices, selections, and portion sizes are all very comparable to other Mediterranean houses. For sides, I have only tried their salad, and I was impressed. Their salads have a delightful amount of ingredients.I have no real complaints about this place. If you work nearby, Shish Kabob provides a very good lunch."], ["Arpie M.", "This is real deal Middle Eastern food. Excellent lamb and beef souvlaki and gyros,  hummus and babaganoush. Ingredients taste fresh.  Self serve and utdoor seating only."], ["Matt G.", "Had walked by this place several times and was curious to try some of their food. Had the chicken and rice with tzatziki sauce and bread. Everything was very tasty. Flavorful meat, tasty spices in the rice and One of the better tzatzikis I've had. This is much better than any fast food in the area, perfect for a quick and relatively healthy meal. My dish was 8 usd which i don't think is bad at all. I look forward to coming back soon next time I'm in downtown Raleigh and try the lamb. Also, the staff seem very friendly."], ["Harry A.", "Great food. I had lunch and dinner here. Get the gyro! very reasonable price for a lamb gyro. and very tasty. I would definitely come back to this place if I am ever in the area again. Oh I should mention there is no place to sit inside the joint - its all outside table seating. and you order and pick up from the counter yourself. This isnt a sit down and have a waiter place. This is an upgrade from a fast food place. a tasty upgrade, but still its not a restaurant restaurant if that's what you need."], ["KevAndKate C.", "The meat on my gyro was dry and crusty, the salad was limp and old too.  Bummer, as this place used to be great. Sidenote: I asked for water and they charged me for (and later gave me) bottled water - typically when there is a self serve soda fountain, \"water\" means tap water - other establishments usually clarify before charging a customer."], ["Jeffrey O.", "Great gyro! I stopped by here when staying in town, and I wanted to eat a gyro there for ever meal after that stop. I will certainly be back any time I'm in town."], ["Assaad K.", "Good people working there. The food is not authentic Lebanese, not even close. It is more Greek...Do not expect to get a Lebanese shawarma or falafel, like you do in Lebanon. Tzaziki sauce is not Lebanese.The location is clean and the guys working there are friendly. That's why I gave it 3 stars."], ["Melinda L.", "Stayed at the Marriott next door to this place and ended up picking up dinner to take back to my room here three nights in a row. Nice, big charbroiled burger with fries (enough food that I wasn't able to finish) and also had the garlic chicken kabob one night. Food was good and inexpensive, and the guys running the place were very nice. Came in very handy."], ["Karen A.", "This is our absolute favorite place for Lebanese food (outside of Lebanon). We drive 1 hour past several other Arabic food places just for their shawarma. Their taboulli is perfect, their hommous tastes just right. Plus, they'll make it just like you want it. We always ask for our sandwiches to be wrapped a certain way, and they always are happy to do so. Highly recommended."], ["Lizzie P.", "I love this place! I work just down the street and I often go to get their lamb kabobs and salad.  There tzatziki is so delicious with the tender cubes of lamb, and the salad is always fresh.  The pita is, of course, delicious as well.The owner is super friendly, and always very polite.I would recommend stopping in for a light, delicious lunch.  They are open for dinner as well- one time I stopped in and got takeout, and it's not as busy in the evenings.Pricing is really good too :)."], ["Erin W.", "It doesn't look like much but it was so yummy!! I was 100% satisfied with my meal, which means a lot coming from a picky eater. Do yourself a favor and get a gyro in a warm pita from Shish Kabob"], ["Bethany A.", "Great place to grab a quick bite in downtown Raleigh! My boyfriend and I stopped by before a concert one night when we were in a rush and got to enjoy delicious wraps. They're made right in front of you (yay open kitchens!) and were filling and flavorful. I'd come here again if I happen to wind up in this area of downtown Raleigh."], ["Janet S.", "For under $10, I had a lamb shish on the most delish rice ever, cinnamon cand clove flavor, topped off with the best tadziki ever.  Just a few minutes walk from the convention center."], ["Deborah L.", "Holiday hours said until 4 pm, we went at 3 pm and the doors were locked. Workers behind the counter just stared at us, two people were eating inside. No one even bothered to tell us they closed early or anything. Poor service. Closed early."], ["Ron W.", "Man can not live by music alone so a stop by at Shish Kabob was a must-do during the Hopscotch music festival!  This small storefront was packed but the staff here is efficient.  I ordered up a chicken shwarma sandwich which was a tightly rolled up pita with chicken breast, lettuce and tomato, yum!  Great food to eat on the run, Shish serves up their wraps in tin foil so you just peel it off as you eat.  The sandwich was well put-together with plenty of grilled meat and veggies.  For a quick stop in, Shish Kabob does the job if you're in City Plaza.  Grab a seat outside, watch the people go by and enjoy a relaxed lunch here!"], ["Justin B.", "Great lunch special, lamb is always cooked well and service is fast. Consistent food."], ["Erin B.", "Great spot for a quick lunch. Conveniently located by the Marriott and the Convention Center. Fast service and great Mediterranean options - kabobs, salads, gyros, hummus... I ordered a chicken kabob served with a Greek salad. Slightly overdressed salad but the marinated & grilled chicken was perfectly cooked."], ["Stuart F.", "Glad to see some decent vegan options (falafel pita). I appreciate the low price. I would bump this up to five stars if they start labeling what is vegan, and if they used compostable to go boxes. (Which I know cost more, but I think customers are happy to pay a few extra cents to not damage the Earth.)"]], "Justin's Grill": [["Thomas W.", "Great locally  owned store and made to order anything  with any combination  you please. Very friendly  owner - operator and always a great experience.  Easy to stop by to grab an egg white  omlett  on the way to work. A great healthy  alternative  to bagels...."], ["Rae W.", "I'm giving this place four stars for the customer service. I stopped in for lunch take out and ordered the Greek salad. I love Greek salads but this one wasn't that great. The grilled chicken tasted like rib meat and I'm not a big fan of iceberg lettuce. I could only eat half the salad.Like the other reviewers, the owners seemed really nice. I do like that they make your order fresh and it only takes a few minutes. Next time I will try the gyro.For the size of this place, it was very busy during lunch but I didn't wait long for my food."], ["Lindsay L.", "Pretty good gyro for a great price. Love supporting locally owned establishments with good service. Also got the rice and lentils. They were ok, probably could've used more flavor/ seasoning but I was satisfied for only paying $9. Most Mediterranean places would charge upwards $11-15 for the amount of food they give you here. And definitely get the baklava!! All in all, this is a perfect spot for a quick drop in lunch if you're looking for Mediterranean in this area. Although every time I come in, people around me order the burgers and say they are pretty good too."], ["Bob B.", "I have lived in this neighborhood for close to 20 years and had seen the restaurant and never stop by even though I support almost all neighborhood businesses.  I got a full lawful and fries and a drink and it was great. I have been back several times and it is even my first choice on some days to get a good quick meal.I encourage more people to go to this restaurant because they have more than the Mediterranean food along with hamburgers and other grill items."], ["Biorunup J.", "I have tried  lunch items. The food is delicious looks every thing fresh.lot of options too and Desert taste yummy!!"], ["Rebecca W.", "This is a hidden gem for great Mediterranean food and a really decent price. Whenever I see someone come and order an cheeseburger I want to shake them and tell them what a disservice they are doing to themselves. I recommend the Mediterranean platter with the lentil rice but if you like grape leaves they are a must! The owner is also incredibly nice and polite. One of my favorite finds in raleigh!"], ["Kevin F.", "This place really surprised me. With a name like Justin's Grill I was really questioning what the gyro's would be like. I decided to give it a try and when the food came the first thing that hit me was the portions. They are very big. Not too big but you'll definitely be full after. The service was awesome and I believe the owner is the one who brought us our food. He even hooked us up with some seasoning on the fries. The gyro looked good but how did it taste? I was happy after my first bite. I finally found a place in Raleigh that has good gyro's. The price wasn't bad either. A gyro, fries and drink for $7.25. I went to this place again the next day and noticed this time several people had hamburgers. I was tempted but with a recent memory of a gyro in my mind I decided to try it again. I was a little worried maybe that first day I was really hungry and possibly the gyro wasn't that good. Nope, the gyro was just as good as the day before and I left happy. I went back today and tried a cheeseburger. It was pretty good but I think I'll stick with the gyro's. This place is really deceiving. The name throws it off. Before I left the second time the owner brought me over what I thought was cheesecake in a small cup. I took a taste and it was strange at first. My mind was expecting cheesecake and what I was tasting was citrusy. The owner said it was a mousse made from a south american fruit. It was great and not something I would expect from a small diner. The service has been awesome all the times I've been to Justin's Grill. It's really a great place that gets overlooked with the bigger chains around. Stop by and try a gyro or burger you won't regret it."], ["Kyle E.", "Always friendly. Great stuff in this secret shack of Mediterranean love. The taziki sauce is on point. Always enjoy a good creamy sauce. Pricing is very fair. Will I go back? Duh... Do babies cry?"], ["Kyle M.", "Great locally owned spot. I've been here several times for breakfast and dinner. It's always a great experience. The owners are friendly and very excited to provide great service. The chicken shawarma pita is amazing and their tabouleh is always fresh. My fiancé's family recently enjoyed a burger so there is a little something for everyone."], ["Michelle K.", "I'm starting to think I will never find a good tuna melt in Raleigh.   I had high hopes when the lady behind the counter explained that it was served open faced with melted Swiss.  Yum!  Sadly, that is not what I got.  I got a tuna sandwich on toasted wheat bread with white American cheese that wasn't even melted.  No thank you."], ["Dustin V.", "Excellent small diner with good pita sandwiches. Haven't tried anything else yet, but have had the gyro pita twice and it's delicious. Could use more pita with the generous side humus though. Definitely coming back!"], ["Bruce G.", "I stopped in Justin's grill for a late(ish) lunch after running some errands on my lunch break. They specialize in Greek/Med type food and have a lot of more of the lunch type fare like sandwiches and salads. The place is small with a few tables close together and surprisingly there weren't many other customers there when I visited. I ordered the gyro combo with fries and a drink. The gyro was good. The bread tasted fresh the lettuce and tomatoes were fresh and the cucumber sauce added just the right amount of zing. The fries were cooked to order so they were hot and delicious.I was going to give a higher rating, but when the few customers that were there left, I was their only customer and a few of the employees embarked on a massive clean-up effort while I was still there, eating. Brooms, mops, wash cloths, the whole kitten caboodle! Now, I enjoy a clean dining establishment as much as the next person, but I wish they could have waited until closing time, or until no-one was there (I kind of felt like I was in the way of their efforts.)The food was good, though nothing spectacular. A solid place for a Greek lunch."], ["Jeremy J.", "This place has great Mediterranean food, and I think that the service is fine. If you are in the area, you might as well check the other stores out too. Justin's Grill has been the lunch place for my family for several years now, but it does unfortunately have to compete for customers with Neomondes Greek Food just a short drive away."], ["Joseph W.", "Although I have eaten here many time's and always loved the food, today I brought my whole family including my Grandmother, who, has lived in North Raleigh for over 20 years and never tried the food at Justin's Grill. The food was delicious, and fast. My mother actually said it was the \"Best BBQ Chicken Sandwich\" she may have ever had. I was thrilled that my family loved the food. Whether you're in the mood for a burger, a cold sandwich, breakfast, or meditteranean, this restaurant has offers something to fit the bill, including a fantastic patio for nice Spring days to dine on."], ["Liz D.", "My Husband and I have been going to Justin's for over a year now and we still love the place. The staff is always friendly and after no going for several month then stopping in one day on lunch they still remembered me and starting asking how my hubby was. They really define what friendly staff should be and of course the food it pretty good.Update: It's now been over three years since we first started going there.  The same couple still owns the place and they are still super friendly. The Chicken Shawarma is my favorite item on the menu. Their fries are tasty but sometimes underdone. I did try a hamburger once and it wasn't thrilled. It wasn't bad but it didn't have a whole lot of flavor like the shawarmas do.  There may be better places to eat in the area but to get a quick lunch at reasonable prices and helped by a friendly staff this is one of the best places in the area."], ["Amanda R.", "I've eaten here a handful of times, and it has been consistently delicious. The gyro beef-lamb blend is tender and seasoned to perfection, and the two sweethearts who run the place pack those things full of that meat and fresh lettuce and tomato...Also, don't get me started on how good the tzatziki sauce is! The only bad thing about Justin's is that the times are inconsistent. It always seems to be closed when I drive by, but I've also managed to go in when the restaurant wasn't supposed to be open. It's always worth a try, nonetheless."], ["Kristy T.", "I've been going to Justin's for lunch once or twice a week for about three years now.  I can't say enough good things about this place.For starters, the food is awesome.  Everything is simple and freshly prepared.  The menu includes sandwiches, burgers, salads and a great selection of mediterranean specialties.  I have tried many different things on the menu including their grilled chicken salad and tuna melt but I have to say it's their mediterranean food that has won me over.  The grape leaves, tabouleh, hummus and falafel are all just amazing.What also makes this place worthy of five stars is the people.  You are always greeted warmly upon entering and thanked repeatedly for coming when you leave. You are always asked if you enjoyed your meal.  It is very apparent that they want your experience in their restaurant to be completely satisfying. Overall, if you are looking for a quick yummy bite to eat at a reasonable price and great customer service you really can't beat Justin's."]], "Alexander's Mediterranean Cuisine": [], "Jasmin Mediterranean": [], "Tarbouch": [], "Taverna Agora": [["Katie B.", "Love! I was craving Greek food and it just so happened to be my birthday, so I got to pick where my boyfriend and I went out to eat, Taverna Agora it was!I had been wanting to try this place, I had heard from a few friends it was the place to go if you want delicious Greek food, or delicious food in general and now that they have relocated to a convenient downtown location, I was willing to venture on in.Our server was friendly, very attentive and I enjoyed conversing with him. He gave great recommendations for the food as well.We had the Fried Zucchini as an appetizer and I was quite happy with the size of that. Usually most places provide measly portions for appetizers. I had the Lamb Shank as my main dish which had just enough of a hint of cinnamon to it and a decadent sauce with a yummy potato and some veggies to go along with it. My boyfriend had the Athenian chicken which he enjoyed and we had the Baklava cheesecake for dessert, which was outstanding. I thought I would save some to bring home, but no, just devoured the whole dessert. We enjoyed sitting on the main level in the patio area, it had a nice view of the street, great people watching.We will most certainly be back! Thank you Taverna Agora!"], ["Cindy E.", "Great food and service! Sat at the bar and enjoyed a Gyro Platter! Delish!I was eating alone, but never felt uncomfortable!"], ["Laurie V.", "Opa!  Taverna Agora just joined the downtown community and I am happy to welcome them here!  Memories of a past vacation to Athens and to the Greek islands came flooding back as I enjoyed my lunch. Today they invited some local downtown businesses to participate in a \"mock service lunch\" for their FOH and BOH to get some practice.  I went with two of my colleagues that I work with at my day job.  We were extremely satisfied with the service, the ambiance, and the food. We started with two appetizers: the hummus and the tzatziki (yogurt/cucumber dip).  Both were served with fresh warm pita chips, carrots, and cucumbers.  Both were appealing to the tongue. I chose the moussaka as my entree.  It was tasty, similar to a lasagna, with layers of beef, eggplant, tomato, and a top layer of bechamel sauce.  That top layer was amazing- rich, fluffy, and flavorful.  I tasted hints of ginger and cinnamon in it, as well.  One of my other colleagues tried the burger, which proved to be hearty and flavorful (I believe it was topped with a spicy feta mix), and the other ordered the salmon, which was really nice, as well.  The portion sizes were large and satisfying. For dessert we shared the lemon cake. It was light, which was perfect because we were full.  The icing was really really good.  The ambiance of the restaurant is quite lovely with wood plank ceilings, warm decor, and traditional blue/white Greek knick-knacks and art on the walls.  I also liked the hanging lantern lighting.  We did not go upstairs to the rooftop deck, but from the outside it looks like it will be a nice space.  Our server was no stranger to the service industry.  He had worked as a server somewhere in the mountains and recently moved to Raleigh right in time for Taverna Agora to open.  In fact, ALL of the staff were friendly and attentive.  Our beverages were constantly refilled.  Our food came in a very timely manner.  And we were greeted with warm and friendly smiles.  The other nice part: not only is my day job across the street practically, but I also live about a block away.  I will be coming back for sure.  Welcome Taverna Agora- I think you'll love your new downtown location and we (residents and businesses) are happy to have you join us here!  Opa!"], ["Viktoriya M.", "I was so excited about the rooftop and Mediterranean food. The place is beautiful indeed. The food wasn't good even though we were assured of it's authenticity. Great place for romantic evenings, for appetizers or beverage. As for the authentic food, I would go somewhere else."], ["Robb E.", "Absolutely the best meal I have had all year. We started with pita bread and spicy Feta cheese dip and fried calamari. Both were absolutely delicious. I had the lamb shank which just melts in your mouth my wife and daughter had scallops in orzo pasta. It was superb. Our server was excellent as well."], ["Holly P.", "What a treat! I met a friend and her parents last night and I can honestly say we were all quite impressed.  The ambiance was quite darling. Our Server, Don, was incredibly jovial and had a perfect wine recommendation. I have never been much of a Pinot Noir drinker, but he made a believer out of me with the Meiomi! The infused olive oil and fresh bread with the wine had us swooning long before the meals arrived. Everything was cooked to perfection and in generous portions. The sweet description of \"Agora\" most definitely applies - we gathered, we drank, we ate and truly enjoyed. I can honestly say it was one of the best meals I have had in a very long time and I look forward to bringing my husband in the very near future.  Yassou!"], ["Andrew K.", "I'm definitely in the minority here, but I really didn't enjoy Taverna Agora. Let me set the stage for you: It's a gloomy Wednesday. My wife and I are tired, sick of work, and the daily grind. So, struck by some inspiration, I wait until wifey is predisposed and call Taverna Agora to find out if they are vegetarian friendly. They affirmed six ways to Sunday that they are. Cool. So, I tell my picky vegetarian wife we're going to take a walk to lift our spirits, and I surprise her by entering Taverna Agora without any warning. That made her happy, at least she wouldn't have to cook that night. So, that's where we were at. Kind of bummed out, and a good meal could have been the difference between a dsythmyic night and a happy night. Usually I don't write a review about a place unless I've been there multiple times, but I won't be returning to Taverna Agora, so I have to base this off of one dining experience. In my mind I'm comparing this place to Kipos in Chapel Hill, which I believe to be far superior. Anyway, we started with the hummus, while my wife was searching the menu for all of the vegetarian options that I was assured of over the telephone. Her options amounted to just side dishes. The hummus was okay. But no better than okay. At least it was cheap. And that right there is damning with faint praise. I ordered the Athenian Chicken. And maybe it was just an off day, but it was really bland. There wasn't much spinach on it, and there wasn't much cheese either. So, my $17 dollar entree was pretty much a bust. My wife got a variety of side plates with the goal of getting vegetables. It seems like Taverna Agora's vegetable selection is only carrots and cucumbers. Absolute weak sauce. So, neither of us enjoyed our entrees. Now, let's make the situation worse. Our server was preoccupied with a table of 20..... why on earth didn't they assign us a different server? What it resulted in was food that was brought out a little bit less than warm, and having to wait 20 minutes for the giant table to all split up their checks before we could pay up and leave. I haven't dined and dashed since that one time in the Doylestown Perkins (sorry!) as a teenager, but man was I tempted to that night at Taverna Agora. Anyway, I would (and maybe will) give this place another chance, but there's no way my picky vegetarian wife would go back. The ambiance is nothing special. It looks like a diner, again, I liked the decorations in Kipos much better. One last pet peeve: they do the old marketing trick of pricing things at .95 cents. Like the Chicken was $16.95, the steak was $24.95, do they honestly think people won't understand that they're paying $17, and $25 respectively for those dishes? Sorry, I just think that's a kind of classless move that borderline insults the customer's intelligence. Maybe it's a fun place to drink. Maybe the other meat dishes are good. But I can say that the ambiance was a snore, the chicken was dry and bland, and they are not vegetarian friendly. What was my hail mary attempt at salvaging a bummed out evening turned out to actually make it worse."], ["Casey K.", "One of the first meals I had in Raleigh upon moving to the city. My mom and I just got drinks and appetizers for dinner and it was truly more than enough food. My favorite of the appetizers was the fried zucchini, big portion with large zucchini slices and a delicious sauce. We also got the dip platter which was really good and you could definitely share with at least 4 people as an appetizer. We also got the calamari, which was good and the sautéed shrimp, which I really wasn't impressed by at all. I got a blueberry lemonade cocktail, which was also good. Our waiter was great and we enjoyed sitting in the front area, which is in the AC but you still get the outside breeze. Its not the best Greek experience I have had, but I would definitely go back again to try more things."], ["Lake C.", "We were there twice during the Bluegrass Festival.  What a pleasant surprise to find such a nice place right next to our hotel.  This is not your average Greek restaurant.  Everything is a cut above.  From the beautiful decor to the rooftop lounge, it is all top notch.  Did I mention the food?  Our first visit was just for drinks and cheese flambé and that hooked us.  We grabbed our traveling companions and returned for Sunday brunch which was quite good.  The service was first class as well.  I would highly recommend!"], ["Michael G.", "I would give this restaurant 4 stars for food but have to give it 3 stars because of the inexperienced bar and wait staff. They all need better training."], ["Heather K.", "I wanted to love this place because I love Greek food and have really been missing my old Greek spot where I used to live. But everything was just ok. Not bad, but not worth coming back for. Service was great, but the food was bland. I'd give it another try to check out the rooftop, we were seated inside. Maybe the ambiance makes up for the mediocre food?"], ["Bob S.", "Just had a gyro with Greek fries and a baklava... The rooftop now has sliding glass walls for the winter... Love it on the roof ... Best place in town for authentic Greek food ... They just installed floor to ceiling glass walls on the rooftop patio ... It is now four seasons love it"], ["Cherif G.", "I have been there twice: once for brunch and once for dinner. The service is very good and the terrace is as good as it can get in Raleigh, so thumbs up for that. I also enjoyed the Tzatziki and the greek coffee. the feta and spinach pie was decent too.However...The brunch  menu is a rather poor attempt to \"greekify\" american brunch favorites. Dry pancakes were served with tons of sugar and cinnamon, and some walnuts if I remember right. Spanakopita benedikt: take the feta and spinach pie ingredients, place them in a phyllo base and add a poached egg and hollandaise. Sounds pretty good to me except that the phyllo looked and tasted like paper. Come on guys! Get some butter on each layer and bake it until it turns brown! It was like eating the newspaper in which fish and chips come in :-).The dinner was a real downer:Scallop Santorini... orzo pasta with no seasoning. What about a pinch of salt in the boiling water? The tomato sauce was joyless and tasted like canned tomatoes (in NC, in the summer...). Seared scallops??? They looked and tasted like they were boiled directly out of the freezer: No color, no sear, no taste, super bland. They were as white as the houses in Santorini. That explains the name of the dish.Fisherman's pasta... same scallops as above, rubbery shrimp and some mussels I did not even want to try.My advice if you want to go there would be to enjoy the terrace, have a few small plates to share and finish off with a greek coffee. OPA!"], ["Anna S.", "This is a beautiful, I mean rooftop-garden-level stunning, delicious, and fair priced Greek haven. I was in a time crunch around lunch time and stumbled across it; the staff understood and had my food to the table in less than ten minutes. My food was absolutely heavenly, and I was seated in the middle of a well designed and tastefully decorated dining room. This is definitely a place for Sunday brunch and hopefully a rehearsal dinner!!"], ["Adam L.", "Food was good. It's different than what you see at every other trendy restaurant downtown. The roof-top is BEAUTIFUL, but they need to extend the hours that it is open.The waitstaff wasn't great it seemed. Slow to get to the tables, flustered while busy, etc. I'll go back, but for the atmosphere."], ["Demi D.", "Great Greek food and great service! Love this place and I will be a regular. Chicken souvlaki pita is the best. Also great decor- lovely!"], ["Nicki S.", "Went to this place today because it was only a few block walk from my office. What a pleasant surprise! The food options were great - lots to choose from. I had a chicken pasta but it was delicious! Great flavor and fresh. Will definitely try again for more option! Love that there is a rooftop area also, especially as the weather is nice!"], ["T Caleb R.", "My wife and I swung by for a late lunch.  The outdoor seating upstairs was great.  The food was excellent and reasonably priced.   And if you happen by try the baklava, it was amazing.  The service was attentive and quick. All around this was a great restaurant."], ["Rachel B.", "I went to brunch here this past Sunday and all I can say is wow! The rooftop seating is absolutely beautiful and so scenic. I got the French toast and it was delicious. Not to mention they had $3 mimosas which you can't beat :) I will definitely be going back!"], ["Scott F.", "Everything was great, and the inside of this place is really well done!  Service was great too!"]], "Taza Grill": [], "Zoës Kitchen": [], "Greek Fiesta at Crabtree Mall": [], "Monapita Mediterranean Grill": [], "Greek Fiesta at Towne North": [["Kate S.", "I like Greek Fiesta.  Used to eat here almost weekly and am glad to try them again.I think they have improved over the past year or so, it used to be that any kebab I would order came out slightly charred - but the 2 times I've been here in the past month this didn't happen at all.  Well done.Their gyros are good, sometimes they can be a little watery (my experience in the past) but so far so good.  Haven't had that problem the last 2 times.  I love how they season their fries.Also, prices are pretty reasonable, not bad.  You do get quite a bit of food."], ["David H.", "Food is good. Greek music is a NIGHTMARE. I guess they want you to eat quickly and leave."], ["Todd M.", "I stopped in between appointments for a quick bite......I won't go back.......I ordered the gyro with fries.......very little lamb and the French fries was served to me in a huge clump.......avoid this place at all cost......."], ["Dustin M.", "WAY overpriced for what you get. Kind of dirty too. We both ordered a Gyro with the side Greek Salad. The salad, no joke, was a mere 3 finger finch of iceberg lettuce. I was somewhat upset that they don't serve potato salad with the Greek Salad. We won't be going back since our expectations are on the high side. We'll enjoy a wonderful Greek Salad and Gyro when we visit Tarpon Springs, FL or The Hungry Greek in Wesley Chapel Florida."], ["Cheri K.", "I really love this place.  The food is fresh, healthy and delicious.  They have the best sweet tea in a big clear beverage server with pineapple floating in it.  The staff are friendly, attentive and the atmosphere is pleasant and CLEAN!!   They are happy to sub an item on the platters if I don't like it.  Sorry, not a fan of grapes leaves but they sub the tabouli for me instead.  The best tzatziki in the area and absolutely love the chicken pita and the Mediterranean platter!   Once in awhile the chicken is a tad dry but overall a favorite spot for lunch or take out."], ["Jennifer B.", "I LOVE Greek Fiesta.  I come here 2-3 times per week for lunch.  The food is fresh and delicious.  I get the Mediterranean Platter with chicken kabob, or Grilled Chicken Pita.  The staff is super friendly and helpful!  if you want fast Greek, this is the place to go!"], ["Rod O.", "Impressive!!!  Gyro, Tzatziki, and Baklava!!!  Value!  Gyro Wrap was BIG and FLAVORFUL!!!  Tzatziki is Thick and on the Winning Tzatziki Sauce!Baklava with or without Pistachios!  My Wife is part Greek so I ordered the Pistachio version! Yummy!  Other Desserts that have similar components to Baklava!  The Gyro and Tzatziki were good enough that I already decided to go back!Both of the Men working here were very Friendly and seemed eager to IMPRESS!  Like to make sure you'll be coming back and telling everyone how good it is! No Coffee!  No Coffee means, No Arabian-Style Coffee!  I have a list for that!  I thought with a name like \"Fiesta\" I would have a place for them on my \"When in Tex-Mex\" yelp list!  No!Open Kitchen puts me at Ease in a way... Interior is much Nicer looking than you would think for a Walk-up Counter-Service type place still a BIG step above \"fast-food\" ! ! !6-23-2013 UpdateTook my Bride Here and ordered: Kabob Platter with Rice, Tabbouleh, Pita, Tzatziki and Two Steak Kabobs - Hummus and Pita Dish!  The Kabobs were Very Good!  Tzatziki Excellent and the Tabbouleh was Superb!  The Hummus was good!"], ["Alexis C.", "Great fast Greek food! They are always very accommodating for alterations on platters if there's something you don't like. I've always had very friendly experiences here with the staff. Hate that they got rid of their punch cards, but I'll still go see them!!I love the Mediterranean platter. Comes with one Kabob (or two if you pay $1 more), Greek salad - lettuce, tomato, olives, onions, cucumber, and feta. Pita bread, hummus, taziki, and stuffed grape leaves (dommas, sp?). Get the lamb kabob, you won't be disappointed!"], ["Josh P.", "I was really disappointed by the gyros here. Barely warm gyro meat and watery tzatziki. Now I have yet to find a good gyro in the Triangle, but this one was extra bad."], ["Laura V.", "LOVE Greek Fiesta!!!!  :). Always delicious and fresh!  The staff are always super friendly and accommodating!  This trip was even more fun, free birthday lunch!!  :)Thanks to Mike and his gang for making me feel even more special on my super special day!!  :)The magic power of baklava!  :)"], ["Lauren H.", "I am a regular at Greek Fiesta and it is one of my good-to places if I am eating fast food. I consider it to be somewhat healthier than your average fast food and the food at Greek Fiesta is also reliably tasty. The people who work at this location are very nice and I am here often enough to be recognized by the regular staff (not sure if this is a good or bad thing). When going to other locations, I used to always get the sampler platter, which includes tabuoli, grape leaves, hummus, pita and a kabob (chicken is my choice). The hummus is very good for being from a fast food place. However, my regular choice now is the chicken and cheese pita with a side Greek salad. Their Greek salads are really good and include a lot of feta (my favorite) as well as a good amount of dressing. Josh will usually get the gyro which he has said is good too. I consider the prices to be a little bit high for what you get (although the food really is very tasty so I don't mind paying it), coming in at nearly $10 for a pita, side salad and drink. If you get a combo, you can also choose fries if you would rather not have a Greek salad. All-in-all, this is a good place to grab a quick bite but don't expect to pay the low prices here that you may at other fast food spots in the area."], ["Lloyd R.", "Yum!  Fresh, healthy, and full of taste!  Reasonable priced. We loved it and recommend!!"], ["TJ W.", "Good Greek food, friendly staff that brought food out to us. Cucumber sauce and humus are great, Greek Salad isn't the best."]], "Troy Mezze Lounge and Bar": [], "Sitti": [["Ivan C.", "Great place.  I can easily say this is my favorite place in downtown Raleigh.  The food here is special.  Over the last couple of years it has become a little less spunky, which I miss, but nonetheless, it is good.  I regularly get the mixed grill or kafta kabob platter, the garlic whip alone is worth it to me.  The samkeh hara (sp) is a salmon dish they prepare with what I think is kale and rice and it is the best salmon you will have in town without having the get a second mortgage on the house.  There is something that must be said about places that marinate their meats before cooking them and this place does it very well.  The chicken is NEVER dry, the kafta is juicy, and the steak is always tender.  Their appetizers are also very special from the avocado hummus to the baba ghanoush.  Try the lamb, you heard the aunt in my big fat greek wedding, even vegetarians can eat it (don't do it though if you ARE a vegetarian - something about the flora in your gut).My only complaint is that it gets a little loud sometimes.  The place is wide open and almost always full, so everyone is trying to talk over each other."], ["Elizabeth K.", "2 years later and I finally came back to Sitti! (I still think they need to improve on their host staff. They are neither welcoming nor friendly.)Like deja vu, their course timing was off. I wasn't even finished with my Sitti salad (which is very light, simple, but surprising delish) when our entrees came out. And since we were seated at a 2-top table, there was no room to keep both my salad and entree so I had to give up on my salad before I was done. I ordered the Fatteh: stewed lamb over basmati rice, crispy phyllo chips, pine nuts, whipped yogurt and garlic. Now that I reread the description, I do want to clarify and say that I did not get the crispy phyllo chips but more so crispy pita chips (big difference IMO because I love phyllo). I barely touched my dish. I already knew that lamb would have a strong, distinct meat flavor in contrast to the more commonly consumed beef, pork, or chicken. However, despite the lamb, the fatteh lacked flavor overall. It was quite honestly BLAND. And because even the pita chips were dull-tasting, I couldn't bare to finish it.Our awesome server realized that and seriously asked how I thought of my dish. Apparently the fatteh has had some negative responses before me. So he kindly took it off my bill and treated us to an amazing dessert. I don't even know what it was, and it's not on their website. But it definitely had phyllo! as well as thin slices of banana, pistachios, honey, and I think maybe a ricotta filling? something light and creamy, and there was definitely some lavender, which was absolutely amazing.  Sitti has only improved 1 star from my second experience. 1. Food (besides the Fatteh) is actually pretty good (I just will try a different entree).2. Servers are awesome.3. Host staff needs work.4. Do they still have courtyard seating? From what I remember, it's great for a summer dinner.5. Please let me finish my courses. I'd rather wait a few minutes for my next course than feel rushed."], ["Penelope B.", "I came to Sitti with two friends knowing nothing about it other than that it was a Lebanese place, and middle eastern food generally is friendly to my allergy cluster so I figured it was worth a shot.The atmosphere is pleasant and slightly upscale but not uncomfortably so, and the space is well balanced between large windows and slightly low lighting.  Service is friendly almost to the point of being overbearing, but since my group had a lot of questions this was fine.  Now that I've talked about everything but the food... The food is wonderful.  Everything was fresh and perfectly prepared.  There are cold mezze, hot mezze, entrees, kabab, and pizzette.  The menu marks for vegetarian, vegan, and gluten-free, though the sides like moujadra are not marked - just ask, staff are good with questions.  The only big thing to watch for is that the falafel is not gluten-free, alas, so I had to comfort myself with vegetables and various dips, halloumi, and the roasted fingerling potatoes - even with my restrictions it was very easy to find a good meal and my major difficulty was that I couldn't try everything I wanted to.  My friends had and enjoyed the pita, tabouleh, and a meat dish, so bring your omnivore friends who complain about rabbit food and then kindly offer to share your vegetables with them.  As far as I could tell there is no soy or corn on the menu, and it's easy to avoid gluten."], ["R P.", "One of my absolute favorite restaurants in Raleigh! I stop by every time I visit the city. I order the Chicken Shawarma plate, comes with chicken, rice (only lunch), pickles, onions, garlic whip, pita bread, and I add a side of mozzarella cheese. Everything tastes just right! The service has always been great to me as well. The restaurant is decorated very elegant, Lebanese style. Great place to come with friends or family!"], ["Anousha H.", "While visiting we decided on Lebanese food for a late lunch. Sitti was recommended to us by our local friends & family so we made our way downtown. The restaurant is a large open & welcoming space. I loved all the family pictures around the place. There is a downstairs area too, although we dined upstairs. We were seated promptly with no reservations and our waiter was very accommodating. The menu was the typical items one would expected from a Lebanese restaurant and since it was cold out I decided on hot tea, their selection was limited. They had about three different kinds presented in the tea box. I ordered the yogurt dip for appetizer. It was tangy & delicious. The bread is fresh & warm brought to the table. It was perfect. I ordered a lentil soup and a small house salad with olive oil and lemon vinaigrette which was delicious. The soup wasn't hot which is major let down for me but maybe others don't care as much. The flavors were good. I also tried some of the grilled chicken kabab and rice & I was not blown away. The flavors were there but I have definitely had better. Overall experience was enjoyable & I will check back in next time I'm in town."], ["Scott J.", "Had a fabulous meal at this Lebanese restaurant. Ate a lunch if goat cheese and dates/oranges which was scrumptious. I ha MN D falafel which was done perfectly. They brought out Pita bread with Zaatar oil which was excellent. It t was inexpensive. Good service. Highly recommended"], ["Isaac A.", "The interior is fantastic,  open area with nice seating and plated eating area.   The menu process were pretty fair about $10 a plate.   I ordered the chicken Shawarma.   The bread that came out with the dipping sauce was very delicious.   The service wasn't that great,  in comparison in observing the other waitstaff that were more engaged friendly and telling guests that it was a celebration of Lebanese independence day I guess and we're given cards and a treat bag.   Of course I longingly looked over wanting one.   The bathroom was nice,  I actually liked the smell of the hand soap.   What was weird was the gap in the stall walls in the bathroom.   Who wants to go pee on a urinal and you can see inside the stall?   Thankfully the toilet was set back that you couldn't see the person,  but boy that would've been awkward. The copious itself was surprisingly good,  although I was criterios l curious to try the chicken pomegranate.; a dinner item I was told.  I would probably would consider coming back but I want a different server.   The Harry Potter server with the arm ink looked like he was fun and  they're was another girl who was laughing and telling jokes.   I wanted her. ..eh ha oh well."], ["Holly C.", "Pretty great overall. The hummus and grape leaves were really very good, and I had a glass of delightful Lebanese white wine. We did not get to sit in the coveted window seat, but this is surely an ideal date locale-made evident by the couples eyeing each other over plates of falafel."], ["Andrew K.", "Man, Sitti is good. Ever had Lebanese food? I never did before I went to Sitti, don't be afraid, it's excellent. Slight complaint from my picky vegetarian wife: the vegetable kabobs are cooked on the same surface as the meat kabobs, so...... for some picky vegetarian people that may be a no-go. We learned that because we were seated once at the table that can look right into the kitchen. Anyway, regardless of what you order at Sitti, they start you off with a basket of delicious, warm pitas. I don't know exactly how to describe it, but they taste different than your standard pita. Maybe a little bit more airy? Maybe a little less floury? I'm not sure, but it's good. And the pitas are perfect for the Hummus you should order. Come on, it's only $6 bucks, and it's probably the best Hummus I've had in Raleigh so far. So, I've had a variety of dishes at Sitti, and have been really pleased with all of them. The lamb chops (though pretty pricey at $28) are great. The chicken kabob is also really good. My picky vegetarian wife liked the vegetable kabob until she learned about the aforementioned grill issue. My go-to at Sitti is the Artichoke Chiken. I usually balk at eating Artichoke anything, but at Sitti it's great. For people who don't know anything about middle eastern food I strongly recommend the Sitti tasting plate, it includes a variety of appetizers (hummus, baba Ghanouj, and the freaking awesome cheese rolls), as well as a kibii and garlic chicken. This is a great parent option. Sitti is right downtown, and it can be a nice people watching perch if you get a seat by the windows. Wifey and I went the night that NC State beat Villanova to get to the sweet sixteen, and we got to watch the city progressively lose it's mind while we enjoyed great food. It kind of made me feel like Nero watching Rome burn. Is that weird? Yeah, that's weird, give me a break, I'm listening to Tame Impala, and it's influencing my thoughts. Anyway, the service is okay, not bad, not great. Good enough. The ambiance is okay, not bad, not great. If you want a quiet experience, ask to sit downstairs, but doing that makes you invisible to your waiter, so you know, take that risk if you want. Another benefit of Sitti is that it is open on Sundays, which is trickier to find in Raleigh than one may think. So, in summation: you should try Sitti if you haven't, and due to the sampler plates, I can't think of anyone I'd be reluctant to take to Sitti."], ["Greg W.", "Don't fall for the restaurant week menu. We took a group of friends here during restaurant week. We've been pleased with Sitti and their setup, it's an open floor plan with a high end and swanky bar that oozes with class. This is accomplished with crisply dressed bartenders, lots of wood accents on an asymmetrical bar top, and modern decorations and cubby holes to hold the liquor on display. We started the night off with a few lighter drinks. They have a wide array of wines priced from the reasonable to the swanky, European choices. We did not venture into the cocktails, but they looked interesting and a bit out of the ordinary which is something that I find interesting. All in all, the drinks offered at the bar will provide patrons with something to match their taste and compliment their food. During restaurant week, there were a few of the offerings that were posted on the official menu submitted that were not on the printed menu when we arrived. This typically is not an issue because of the large menu that features their unique (Mediterranean/Middle-Eastern) twist on classics, but two of the options missing were vegetarian. That left nothing for the vegetarians to choose from on the restaurant week menu so they ended up ordering from the standard menu which increased their cost. That said, the food we ordered was excellent. I had the kabob plate with all the fixings and a mix of meat (kefta, chicken, beef). The vegetarian meals ordered were full flavored and enough to fill up the women who ordered them (runners, so no small feat) which is a typical complaint I have of such dishes - not the case here. The pita/hummus/tzatziki was a light starter full of lemon, parsley, and tart notes. It's better than most I've had in the area.I would highly recommend Sitti for those who enjoy Mediterranean and Middle-Eastern cuisine. However, I would not recommend their restaurant week menu based off this experience. If you plan to visit, go for the normal menu and enjoy your meal that way versus going for the restaurant week menu. It feels akin to a bait and switch and we typically end up ordering off the standard menu. However, items not being on a posted/official menu (not running out of it) is unacceptable in my mind - especially when it impacts individuals with a dietary restriction."], ["Cindy T.", "Atmosphere 4 starsFood 4 starsService 4 starsEverything was great! We had awesome service, food fresh and tasty. Def go back. Great Arabic food."], ["Tiffany C.", "Some of the best pita bread and olive oil dip I've ever had. EVER. End of review.Okay, fine, there are about 357928735 other things to love about Sitti. How about its prime downtown location smack in the city center, stone's throw away from excellent bars and coffee shops galore? How about the way the sun streams through the giant windows just so such that dining in the early sunset hours gives you that warm buzzed feeling of being drunk on life? This isn't even getting to the super-cool patio out back.Oh right, and food! The kabobs here are so savory and yummy. I've been here once for lunch and once for dinner and the quality is always top-notch. My thoughts about Sitti are so rambly and all-over the place it's like my mind is a kid in a toy store - where do I start? The garlic whip is something made of heavenly cloud fluff and when you dip your juicy, tender meat in and bite into the two thoughtfully the only thing on your mind will be \"MUST. HAVE. MORE!\"One of my absolute favorite places in Raleigh and I'm hoping I'll find a suitable replacement when I leave NC (very soon) :("], ["Bobby H.", "My 4th time here and the food is always great.I love sitting downstairs where it's a little quieter, but the window seats are also great for an early dinner.The food has been great each time, though I've kept it to steak, chicken and all the hummus varieties.Feedback from my group is that the flat  breads are also great.Only semi issue is that the service can be a little hit or miss. Always polite, but not always on top of things."], ["Whiz D.", "Came from New York and was comparing it to the food there. What can I say as I was spoiled to the top Lebanese restaurantin my backyard in queens (wages). This place is ok, but not wow."], ["Danielle H.", "Yet another satisfying dinner in Raleigh with hubby Hancock! This time at a Lebanese restaurant, Sitt!! To start we had beet hummus, avocado hummus and pita bread. We also got Gaindes - a garlic butter base shrimp. I had to have my gin, lemonade and elderflower liquor mix - Delish. For dinner Matthew had Lambchops in a sweeter sauce. I had Fettah, or tender lamb stewed pieces over basmati rice paired with a Cabernet! For dessert we had Ashtha - or a banana, honey and pistachio dish with phyllo bread :) another great trace reservation made by my hubby in our new city! We wanted a little more in the decor and ambiance but it was great food nonetheless #hancockhelping - we'd be back To try more dishes!"], ["Andrea P.", "Just got back from Sitti, and I have very mixed feelings.The food was pretty good. Our table ordered the trio of appetizers and got baba ghannouj (delicious), feta dip (meh... the feta was overpowering), and the hummus (Incredibly bland).  For my entree I chose the goat stew, which was very tender and perfect in texture but lacking in flavor; the white truffle polenta compensated a bit, although I would've liked to see more play between the truffle and the creamy polenta... what I had seemed more like reassurance that I was getting my money's worth of truffle. The rest of my table was pretty happy with their kabob and market fish entrees. The drink I had was the Hibiscus Royale, which felt risky because I was worried about how natural that flavoring would be -- that worry was for no good reason, as the drink was great.The desserts looked great, and I was very pleased to note the Scotch collection Sitti offers.  I've been having trouble finding good arrays of single malts in Raleigh, so this was very exciting!The service was unapologetically terrible; granted, we had the new waitress, and it was a Sunday night, but she messed up everything and was impossible to get a hold of.  Worst of all, she never apologized for her mistakes; she actually seemed to be glaring at our table while her coworkers corrected her mistakes.  Very frustrating!"], ["Khoa N.", "Amazing lebanese food!! Thats all i have to say about it. They give me little food, but its so good so i dont mind. Definitely recommend this place."], ["Tasha R.", "This is my favorite restaurant ever. This food was the best. They have the very best fatoosh  and marinated lamb chops I  ever tasted. The reduction marinade was the best  ever. The reduction sauce was to die for and the chops were grilled to perfection . Nothing better. Had some great hummus and the best fatoosh I've ever had. I wished I lived in Raleigh so I could eat their twice a week. Truly the absolute best."], ["Christina C.", "So my review is not for the normal menu. Came here for a friend's birthday and since there were so many of us they gave us a pre fixed menu. The food was really good! I have to eat gluten free (Celiac) and they did a great job at accommodating my dietary needs. They made sure to bring out alternatives for me if there was a dish I couldn't eat. I think on the normal menu they have indicated what is gf as well. My friends also really enjoyed their dishes. The ambiance was nice and the service was great. Our server was very friendly and attentive. The only weird thing was that they originally told us we couldn't split the check and had to bring cash. So many of us decided to order drinks at the bar to make life easier once the bill came. They didn't like that and ended up giving us separate bills for the drinks (but still didn't split the main food bill)...I don't get it but whatever. I'll definitely be back to check out the rest of the menu!"], ["Trupti T.", "I have always been a fan of Sitti, good experience all times I have been here.  The food is good, the atmosphere is very city like, hustle and bustle.  Recommended to make reservations as this place is always packed.  The drinks here are pricey but good and strong.  Food everything I have had here is well made.  I do love the basket of hot pita bread they give.  Overall always a good experience here."], ["Gregory H.", "I've never claimed to be a big fan of Mediterranean food, but being invited to a company outing by my wife's boss brought me to Sitti last night.  The place itself seems to be both Divey and Classy at the same time, a nice feel, not pretentious, but certainly not a hole in the wall and not too casual either.The hummus and the feta with the pita bread were pretty good with the hummus being a bit on the burnt/smokey tasting side and the feta having some pimentos and some leafy greens in it.  I think I liked the feta better than the hummus but considering I'm not normally a fan of hummus, it was actually pretty good as well.Lamb Chops - holy smokes!  Lamb Chops!  Aside from the song that never ends, the lamb chop dinner was incredible.  Served up with some green veggies, finger potatoes and an amazing sauce to dip the meat in, I started eating it not knowing what it was, now I'll be eating it forever only just because this is the meal that never ends, it goes on and on my friend... you get the picture.  Most places make the meat too salty, this was perfectly seasoned and cooked to medium perfection. My only complaints:  Carmenere is not by the glass, and the Manhattan (up) was way too heavy on the sweet vermouth.  I think there was enough vermouth for 1/2 dozen cocktails in that Manhattan."], ["Shannon G.", "Where to begin....the service was awesome, the pita bread is the best I have ever had, not to mention the beautiful ambiance. Very recommended. Great place for a romantic date night."], ["John H.", "It was a dark and stormy night, I fought my way  through the heavy winds and saw a light at the end of the tunnel- that light was Sitti. Suddenly I could see everything: colors, digits, spirits in the shadow of the night. Amit took me to rice, he's a spirit. #backtothefoodSuddenly the steamy pita bread found its way to my table. I was too drunk to eat it & 92.6% of it ended up in my lap. My lap was overwhelmed with joy. My emotions were on a Foods here really fast. Looks good bye"], ["Liana L.", "The food quality is great.I ordered beef kabob, not used to the sour flavor in it though. The Astra desert is great, but the banana ruined the taste. Anything else is fine, but nothing surprising."], ["L K.", "First, the place is very big and clean! Our waitress was very sweet and friendly!and now on to the food!We ordered the hummus to start and OMG the bread that comes with it was sooooo soft and warm and tasty!! I think I ate like 3 breads lol Definitely get the hummus and bread! You will not be disappointed! For the meal, I ordered the falafel with the orange and goat cheese salad. I dont think you can call it a ORANGE and goat cheese salad if you serve the salad with tiny slivers of oranges on each corner of the plate. ( total of 4 sliver of oranges) The salad overall had not much flavor and it was actually pretty bad. ( thank goodness the bread was good so I could fill up on the bread) My husband ordered the Kafta kebob and he thought his meal was just okay too. Overall the only thing we thought was great was the bread. Maybe we will stop in for some hummus and wine/beer next time but we will skip the meals!"], ["Jennifer B.", "Tonight tried two specials: sweet potato hummus (OMG delicious) & a feta cheese dip served with pita points that pun intended was right on point! This is our 4th time here & we have never had a disappointing dish, the food is ALWAYS predictably scrumptious. The grape leaves here are a must, well wrapped & don't fall apart as you bite them. As aromatic as they are flavorful. Anything lamb is worth trying they cook it perfectly. FYI: Lebanese & French bottled wine is 1/2 price on Mondays"], ["Andy G.", "The bread was amazing.  But that's just about it.The inside was really nice it was sort of fancy, minus the overwhelming fart smell.Our server was just okay, I noticed the other servers were going out of their way and I was jealous because our's didn't seem to care nearly as much.The food was okay, the portions were a decent size.  I ordered the falafel and it seemed a little burnt.  I would consider going back....maybe?"], ["Carolyn M.", "Amazing kabobs. I had chicken and steak and husband had kafta. The Steak was AMAZING. The chicken was well seasoned though a bit dry. The kafta was okay, but husband wasn't impressed and will get the beef next time. The house rice was bland, but quickly fixed by adding a bit of their garlic whip. The garlic whip is literally great on everything. The hibiscus royale cocktail was amazing- not overly sweet. The 137 south was okay.Our server was fantastic!  The ambiance is fine- I'm not a fan of the community seating arrangement and it was CRAZY loud in there on a Saturday night. May go again during the week and see if it's quieter. Got used to it though- it was Saturday night, after all."], ["Lexie D.", "I've been to this restaurant twice now and both times were very good. If you aren't familiar with the type of food, you may find the menu a little confusing or unsure of what to get. The waitstaff is very helpful to explain anything on the menu to you. The prices are fair for the type of food you are getting and I feel the portion sizes are just as fair."], ["Sejal M.", "Nice spot. Not really vegan friendly. Need an appropriate bread substitute to really feel satisfied-esp when I ordered the dipping trio and some veggies came out about 10 minutes later...the falafel (listed as vegan) was tasty."], ["Allison B.", "I am sitting here trying to think of a better restaurant than Sitti, and I just can't! I don't think I've ever loved a place more than this. The portion sizes are massive, even for the price, they are huge! The prices on fish are usually amazing, not as pricy as you would expect, but you do have to ask them for the market price. The appetizers are usually so big, you can order them as entrees along with a side, and have a very filling meal for around $10, which is a steal for the quality and quantity of food! Another this is the ambiance. You can either be casual, or as fancy as you like. Or a student like myself, and no one will give you strange looks, haha.I would say this is easily the best restaurant in Raleigh!"], ["Brian K.", "Ok - quick update on the price changing bait/switch thing that happened...Joe the bartender reached out to me personally to explain what happened..I apologize for referring to him as an SOB - that was anger - not fair, and I take it back. Sorry Joe! You're alright!!Joe explained that the owners had launched a new drink menu, along with price changes that very day and it had not been announced or discussed with the staff so they did not know.The owners should have made this known so as not to embarrass their staff who are working hard to keep a crown fed and filled.Joe offered to buy me a bottle of wine - I appreciate that..But after bashing you on yelp I'm thinking you might hit me over the head with it so I'll stay put for a while :-)Owners - why did you raise your prices!! BOOO!!!"], ["Laurie M.", "This review is based on the events customer service I experienced at Sitti.  The food is okay, nothing extraordinary if you are looking for contemporary Lebanese food; it's great that the building has been restored, although the interior is pretty non-descript.Last fall my sister got married and had her rehearsal dinner in their event space in the back.  It's a great setting and we were all very excited to be at Sitti.  Months before the event, my sister put me in touch with the events staff so I could have a special dessert bar after the meal.  I was very detailed with everything that I needed and asked/answered relevant questions.  I thought everything was under control and I dropped everything off as I said I would.  Well, the night of the event, I did my part (set-up, wait staff instructions, etc) and the event staff completely dropped the ball on their agreed responsibilities (staffing the dessert bar so I could enjoy the party, providing liquor *a huge part of the whole set-up!*, keeping the desserts stocked, packing everything up and setting them aside at the end of the night so I could pick them up a day and a half later).  During the event when I politely asked a waiter if he could stay at the dessert table and serve desserts to the partygoers, as we had agreed, he snarkily replied that it wasn't his responsibility or something really rude like that (it's been a while so I forget what he said).  So, all of the money ($600) and time (15+ hours) I invested in the dessert bar went unappreciated and unenjoyed.  And the worst part was when I came back a day and half later to pick up the leftovers (as we had agreed), they had ALLOWED THEIR STAFF TO TAKE WHATEVER WAS LEFTOVER.  That means all of the uneaten desserts (which were plentiful, as practically no one touched the food, and it was all salvageable, like packaged cookies) and supplies.  AND, this really killed me as well as my sister and her husband, the camera bag that I accidentally left with the supplies was missing.  This had memory cards with the thousands of photos I took of their other parties as well as their own photos, plus the camera bag itself was expensive.  When I approached the events staff with these concerns, they deflected my problems and essentially said it was my fault (\"You signed a contract\" -um no I didn't and you never mentioned that during our months of planning- and \"We aren't responsible for your items; you left it after the event in a shared space and we had to throw out the food to not attract rodents\" -so you throw out whatever food's left in the kitchen every evening?  and what about all of the leftover milk you left for me in the fridge???  and you sure as heck didn't mention staff's sticky fingers or the shared space as a concern during our planning).  They said a regional manager would call me and she never did; I was so done with Sitti at this point that I didn't pursue it.  If the events staff thought that I was being unreasonable or needy, I wish that they had told me that when I first reached out them instead of doing what they did; it would have saved some time and money.  And I am embarrassed to say that when I talked to the event staff (Lauren?), I got frustrated and said a choice word, so that was my b.My brother-in-law left a generous tip for the wait staff, which in hindsight was not merited, as the service was lacking.  At the end of the dinner, the waitstaff brought out trays of dessert plates for the table to pass around, but they left them on the tray stands in the doorway as if a waiter was to carry them to the table.  So again, wasted food and money and a failure in the customer service department."], ["Jill O.", "Sitti is my one of my go-to restaurants for \"girls night out.\" Mostly because my girlfriends are really cool about sharing food, and Sitti has \"tastings\" that provide a variety of delicious Lebanese items to try.  I'm addicted to the cheese rolls, and I've had both the \"Sitti Tasting\" (which is my #1 choice) and the \"Vegetarian Tasting\" (when dining with vegetarian friends) on more than one occasion, never disappointed.  I realize some people are against sharing, but at Sitti, it's a fun adventure, and it's easier on the wallet too. Although I enjoy sharing, it's by no means required at Sitti...you can definitely order your own entrees.The ambiance in this restaurant is exactly what I'm looking for in a dinner downtown, and the service has always been attentive, even when they're packed.  I'd recommend making a reservation since they're often busy, especially with so many events downtown these days.  Sometimes the parking decks nearby are free on the weekends (although this past weekend it cost $7 for the deck since Bikefest was in town), so if you don't want to pay for parking, leave yourself some extra time to hunt for street parking."], ["Carsten C.", "I went here twice for dinner, within one week. The first time, I had Samkeh Harrah (salmon) as the main course, and bread pudding for dessert, both delicious. Service was good, nice atmosphere, overall such a good experience that I decided to come back a few days later. This time, I ordered the lamb Fatteh. What I got was a pile of nicely prepared rice, large chunks of lamb, pita chips, and a few splashes of yoghurt. The lamb was so dry and chewy that I literally choked on one chunk that I didn't cut into small enough pieces. Don't know how they managed to ruin the meat like that - anyone who has cooked with lamb knows that it's easy to tenderize it with a yoghurt marinade, and I would expect a Lebanese restaurant to be able to prepare lamb properly. Won't be coming back, but they earned their 3 stars with the salmon."], ["Rohit B.", "Like the ambiance but that's it. The food lacks vegetarian options and the vegetarian stuff itself is of above average quality.Please disregard this review if vegetarian food is not a limitation for you and explore this place for yourself. :)"], ["Cat L.", "Had quite an enjoyable evening at Sitti. The food is very authentic. And the service was good. Like many other yelp users mentioned, it's not a quiet place to dine. But certainly delicious & lively. On a personal note, I always ask for water with light ice & I was happy to see water brought to us with no ice at all. I could see how some would find this annoying. But I was grateful for the gesture."], ["Ray K.", "Excellent dishes downtown. Great for party. Ordered the Samkeh Harra salmon and kafta kabob as part of the set dinner we had. The basement can accommodate a nice party."], ["Cassie B.", "Two words. Garlic Whip. Two more words. I die. We decided to come to Sitti after the Avengers movie. In the end credits, they go eat \"shawarma\". I wonder if the national average for shawarma intake increased after half America watched Chris Hemsworth chowing down on a gyro?  All I'm saying is it should have. This mess is legit good. I think I probably ate my weight in shawarma.  The garlic whip was amazzzzing too.Sitti has a cool back patio also. If the weather is nice, ask to sit back there. Very pretty and quiet. So in the words of Tony Stark/Iron Man: \"Alright. Hey. Alright. Good job, guys. Let's just not come in tomorrow. Let's just take a day. Have you ever tried shawarma? There's a shawarma joint about two blocks from here. I don't know what it is, but I wanna try it.\"Go try it!"], ["Angela C.", "Loved the feel of the restaurant and had a great time with our server. Had a few appetizers: stuffed peppers (really great) and baba ghannouj (not the best I've had). The entrees were great: kabobs, fish, and steak. Definitely a place to put on your list."], ["Michael B.", "This place was marvelous - I definitely recommend coming with a group and ordering platters to share. The cheese rolls were crisp yet chewy; loved the hummus and baba ghanouj. The NC trout with polenta - amazing. Ambiance and decor were quite inviting and conducive to the dining experience, and the server was quite knowledgeable about the menu as well. All of her suggestions were spot on. I suggest not missing this one, especially if you like Lebanese food."], ["Reg T.", "The mezzo trio is a good combination  (pick your three) of dips. The avacado hummus is a must try as is the maharashtra (spelling?). I had the salmon dish on a bed of kale with siti rice which was perfectly prepared. Lively ambiance on a Thursday night and really good food makes this place worth another visit."], ["Whitney S.", "We love Sitti and while searching for a wedding venue in Raleigh were surprised to find out that they have a lovely courtyard and event space available.  We had our wedding here and can say that it was an amazing experience. We worked with Amy as our event coordinator and she was great. She made sure we felt comfortable in the planning stages and went out of her way to keep us informed and answer questions.  Sitti's food is amazing. Lebanese fare with veg/ vegan options.  They have a great beer and wine selection as well as amazing desserts.  Sitti's staff are knowledgeable, efficient and extremely good at what we do.  Despite being a fairly upscale restaurant, their catering/wedding prices were very affordable compared to other local venues. We highly recommend Sitti for your next lunch, anniversary dinner or large event.  They excel at what they do and we are so glad we had them as our wedding venue. Can't wait to come back for anniversary dinner."], ["Gabriel C.", "Went first time with a friend and loved it. Took my wife 2 weeks later for date night and we enjoyed everything. We had the starter meze of 3 different Lebanese dips (you choose the 3) served with what appears to be homemade pita and it was excellent. My wife had an artichoke chicken entree and I had the shrimp kabob. Both were great but I was particularly taken by the shrimp.  Excellent atmosphere... we had a seat in the corner window. Price is definitely fair and we look forward to going back and trying new dishes."], ["Austin G.", "I was in town for training and tried this place based on the Yelp reviews.  The staff seemed friendly.  We had a reservation and were seated quickly.  I highly recommend the Jalapeno Business (cocktail) if you like spicy drinks.  My favorite dish was definitely the Beef and Lamb Shawarma (highly recommend)....followed by the Kibbeh Nayyeh.  We also had the Kibbee Mikli ( I would not order this again) and the Goat Cheese Stuffed Peppers (good but a little bland).  Overall, it was a great experience."], ["Jennifer C.", "Oh Sitti....if I could only give you six stars I definitely would. My friends and I visited Sitti again this holiday season for our party. This year, we had 14 people, so we had to do Sitti's family style option. We ordered everything off a select menu ahead of time, and each person would pay one price for their food (soda and tea included!). I was slightly worried everyone wouldn't get enough to eat and that there would be a problem because I was the only person of the 14 who needed gluten free items. Sitti assured me I could order separately if my group couldn't agree on some items that were safe for me. They even offered to let me bring in my own dessert because of their limited options. Turns out we came to an agreement on enough gluten free items. We arrived the night of and ordered drinks. The server made sure to identify the gluten free person (me!) first thing. Throughout the night, she made sure I had things plated separately if needed and alerted me to what items on the table were not gluten free. The restaurant made sure I had veggies for my hummus (instead of pita) and my own separate portion of rice for the main course. There was plenty of food for everyone (we even took home leftovers!) The coordinator and server were more than pleasant to work with. At the end of the meal, the server put a piece of flourless chocolate cake in front of me. I was so surprised! Never have I had a restaurant take such good care of me! Sitti is a class act!"], ["Connie L.", "everything we had was delicious!had the sitti tasting plate which i liked because we got to taste a little bit of everything.my favorite was the baba ghanouj- love eggplant & yummy with the warm pita yummmthe chicken shawarma was also goodfriends like the kibbee mikli and cheese rolls- very good (but felt too guilty eating it)shared the chicken artichoke- super flavorful! loved the artichoke and sun dried tomatoes!the lentils- really good! loved the feta cheeseveggie kabob- loved the grilled taste of the veggies, it also came with harissa sauce! delish!overall, every dish was delicious! was not let down by a single one.walked in on a friday evening and was able to quickly grab a seat at the bar.. otherwise you should probably make reservations:]"], ["Kristy A.", "It's been years since I have been back here and I'd forgotten what I nice change it is.  On this occasion, I sat at the bar.   My companion and I had some wine (nothing special, but did the trick) and then the Sitti Tasting.  Basically a bento box with six different appetizer options.  It was served with their really awesome pita bread - soft and delicious and perfect to scoop up the dips that came with our sampler.   We followed this with a shrimp dish - sort of reminded me of a scampi.  That dish was good, not great.  The rice was a little bit of a miss - it had a weird texture or something.   We finished with a little chocolate cake and salted caramel ice cream.   Overall, a winning evening.   In all honesty, the tasting platter was really enough for me with the dessert.  I could have skipped the middle dish altogether.   Service at the bar was good.   Atmosphere is nice - trendy, but casual enough that you feel like you can relax and enjoy."], ["Chris M.", "For those of you who have never been to metro detroit (dearborn) to try middle eastern food this likely seems excellent.  It is lacking in flavor though.  Their hummus is not consistent and the schwarma is just not good.  I didnt find their pilaf rice to be that good either.  Drinks here are pricey.  You can easily drop 80.00 on two people here while the same meal should only cost you 30-35.00.For raleigh though, this being the only middle eastern place i can see why it works."], ["M.F. S.", "The four and five star reviews on here baffle me. Especially since there is such great middle eastern food in the Raleigh area to pick from - so much better than this place. This restaurant came highly recommended but we were incredibly disappointed. Every single thing we had was underseasoned, in fact, some of it seemed that it had no seasoning at all! So bland. The falafel appetizer was extremely crunch and difficult to even get a knife through, bland on the inside. All I tasted was a bit of cumin. Lamb and beef shwarma was not like any shwarma I had before. Usually it's sliced off a roast in thin pieces. This shwarma was in little chunks, like the size you'd get in a Chinese stir fry of beef and broccoli. Super underseasoned, bland. My husband had a chicken kabob sandwich which he said was very bland and boring as well. No seasoning. Even my son's kids meal of chicken and fries were underseasoned. The fries desperately needed some salt. The tahini sauce that came with everything literally tasted like tahini thinned out with water. Hardly any flavor at all. My Sitti salad was nothing more than some old lettuce on a plate with tomatoes that tasted like they had been in the fridge for 2 weeks, some cucumber and the most bland dressing I've ever tasted. Again, no seasoning at all. I think this place stays busy and benefits from being in a good location, but I can't understand why it gets the high reviews. Jasmin bistro, which is a chain, is so much better, as is Alexander's in Garner. Even Greek Fiesta is a lot better. Also, our waitress accidentally spilled water on me, didn't even apologize, and simply handed me a few extra napkins. I would never go back."], ["Nicole E.", "We went here tonight for a group dinner.  It was served family style so I didn't get to see the menu, but everything was amazing.  I started with a drink called 'Jalepeno Business' which was spicy and delicious.  Next up were the appetizers which included stuffed grape leaves, fried cheese, hummus and pita.  It all tasted fresh and a little bit unique - you could tell that Sitti put their own spin on things.  Then for dinner some falafel with grilled veggies followed by cookies and baklava.  The service was prompt, the atmosphere great, and every bit of food I tried awesome. I would happily return."], ["Emily S.", "Went at prime lunch time, the food came out really fast and was delicious. Our server George did a great job as well."], ["Claudene F.", "Went to dinner at this restaurant after having looked up yelp reviews. I got the chicken kabob and my friend got the lamb kabob. Both are equAlly delicious! The interior of the restaurant can be improved a little bit but overall still a good ambiance.One thing though is when we got our check, our receipts were attached to this postcard that had a picture of a creepy guy... My fave is the pita bread!"], ["Jen L.", "Oh yeaaaah yummy! Stopped by for lunch and was promptly greeted by a friendly hostess. Simple, earthy, trendy and not too loud inside. High ceilings, wood posts and tables lend to a relaxed and comfortable atmosphere.I love hummus but REALLY love what I found here today- sweet potato hummus! They make it themselves with roasted sweet potatoes with just a hint of cinnamon and sweetness. Served with plenty of fresh and light pita bread.Then I move on to the field green salad with oranges, dates, walnuts, and goat cheese  topped with a perfectly grilled piece of delicious salmon. Just perfect! Even the dates were fresh and moist- more please!Hands down recommend you stop here and try it out. I almost want to go back for dinner- haha!"], ["Belle R.", "I got food poisoning last time I was here, and began throwing up a hour later... Just sayin', I love Sitti, but I was extremely sick."], ["Cathy C.", "I've been here twice now and both times have been great experiences. First was on a Friday night, and this time during lunch time on a Sunday. Both times, seated immediately without any reservation. Excellent & very friendly service all the time. On this visit, the two of us shared the avocado hummus, sitti tasting, and chicken artichoke flatbread. Now this was a looot of food and we had more than enough leftovers for another full meal. This also turned out to be a bit of hummus & baba ghanouj overload, but who can complain about too much hummus? Not this girl. Also, I didn't get this on my most recent visit but the tri-color quinoa salad is one of my favorite dishes to share here. The endless pile of warm pita is dangerously awesome too. I can probably eat that and their hummus all day long. I'll definitely be back to try their other dishes!"], ["Melissa D.", "I know dining in groups can bring a unique set of challenges. That said...two of us arrived early for our friend's birthday dinner and were directed to the bar (not a problem at all!). While the bar was busy but not overpowered, the bartender was chilly at best as we took two stools, no smile or warm greeting whatsoever. The Southern Proper, however, warmed my heart, so I was willing to overlook it.Our party was seated quickly, and our orders were fresh and pretty delicious. My Sfiha pizzette wasn't hot anymore, but still pretty delicious and not worth sending back since I was hungry enough. Service overall though seemed a bit lacking. Our birthday girl ordered a piece of pie, which she was charged for, but didn't receive until a couple of reminders. And time between receiving and running our bills took a great deal of time (about thirty minutes) since we had a show to make at 10 pm. All said, with a smaller party, these things may not have been issues. And since the delectable food can often make up for lukewarm service, we'll be trying Sitti another time, just the two of us."], ["Sajeev M.", "My goodness this place was good, I wasn't expecting this while traveling to a city I knew nothing about. Downtown Raleigh is definitely moving up in terms of things to see and experience, and this restaurant is a part of this positive change. I had the filet with black pepper and a cognac cream sauce.  Yes, it was just about perfect, and I am not usually a fan of large amounts of black pepper.  I asked for medium rare, I got it.  Quality was just about perfect, the veggies and potatoes on the side were flavorful and just the right quantity.  Appetizers were all great, they do hummus and tabouli right and proper, while the spicy feta cheese dip was shockingly intense...in a good way, that is. So yes, if you're in downtown Raleigh, this is one place you really gotta experience.  I'll conclude with the jalapeno infused cocktail I had: it was this amazing blend of tangy and spicy that worked brilliantly with the filet.  After all that spice?  Finished it off with a pretty good Crème brûlée, I kinda wish the sugar on top was a bit more caramelized(?) but that's about the worst thing I could possibly say. Definitely coming back if I come back to Raleigh."], ["Bridgette R.", "Had a mommy's night out here with a great friend.  She and I love similar foods.  She has been here many times.  It was my first visit.  Great ambiance, great service, fantastic food.  We had a wonderful night.  I can't wait to return."], ["Brad P.", "The food is great but it can get loud.  The times I have eaten at Sitti for dinner it was rock concert loud.  I don't know if it was a drink special or the acoustics of the old building,  I really did like their garlic aioli brings an intense garlic flavor that has to be tried to be believed.Atmosphere 3The dining room itself is kind of cool.  It is an older building that appears to have been some sort of retail space so it has big picture windows and a art deco style of design in the interior.  The one down side is it can get really loud.Service 5I have yet to have a bad experience with the service.  The wait staff have been consistently cordial and attentive.Food 4The food is some of the best Mediterranean food in Raleigh.  Everything I have had there has been delicious.  I got the Lebanese Tasting on my last visit and all of the items were great.Price 3It is not a cheap place to eat.  You can expect to drop $25 or more per person for dinner but the food is good."]], "Jasmin Mediterranean Bistro": [["C F.", "Great food for the price.  Nice atmosphere and quick service. Awesome hummus. Mediterranean Platter is my favorite."], ["Rob W.", "This place is OK for a quick meal. They have a pretty nice selection of items on the menu. I had the chicken platter. The meat and salad were nice. I also ordered the stuffed grape leaves, and they were a little weak, possibly premade days ago. All in all it was OK, but there is better in town."], ["Jeremy A.", "Jasmin is a great spot to stop in for to grab a quick lunch and they have a lot of options that revolve around pita sandwiches or platters. Our orders were ready very quickly and I'm the only one that had to wait because they freshly fried the falafel which is way better then leaving them under a heating lamp. Definitely going to be going back here again and adding it to my lunch rotation."], ["Leah A.", "Very delicious food.  I got the gyro Platter and the portions are large.  I paid 11.00 for the gyro platter and a fountain soda.  I felt the amount of food you get and the prices are reasonable.  I dined in and the atmosphere here is relaxing.  It's fresh and delicious"], ["Dwayne D.", "This is my second visit to this location. Good healthy food selection. Plenty of seating and clean. Today I ordered the gyro platter. Lots of food and worth the cost. I have ordered this before but didn't receive nearly the amount I received today. I guess it depends on your server for that day. Anyhow, nice fresh presentation and served hot. I highly recommend ordering this if you are hungry. Plenty of parking and friendly staff. I would also suggest saving room for a dessert."], ["Peter Y.", "Healthy, fast, cheap, tasty. Get their Jasmin platter, which consists of a protein (gyro meat or chicken, get the chicken), 2 sides (the coleslaw wasn't great, but the Greek salad and grape leaves are yum. I'd also recommend the hummus, as your platter comes with some pita to dip in) and some warm, soft pita bread.The amount of food is fairly generous (though it really depends on how generous your server is) and it tasted fresher than it looked.The prices were fair, and you can get in and out in about 5 minutes.All in all, a pretty solid lunch spot."], ["Andy W.", "This place is great spot for a cheap dinner or lunch.  The platters are filling and they have a decent amount of options on the menu.  My last visit will probably be my last visit.  The lettuce on my salad was old and soggy. The lamb meat was cold and had been sitting out for a while and I just really didn't feel the love.  The guy that made my food was a nice but his attention to detail was piss poor."], ["Eric H.", "This place is just ok. Nothing special. I came here looking for a healthier option lunch. The portion sizes are small and the prices are high. For example, I wanted a side of humus and for $3.99 I received a small bit of humus that fit into the small section of the portioned paper plate. What is that...3 or so ounces?So far I have witnessed two or three patrons walk out before ordering. This is an ok place, but there are much better options nearby that aren't so expensive."], ["Bruce G.", "Pretty good place for lunch. Ordered the gyro platter. Everything comes separate so had to scoop up the lettuce, tomatoes, sauce and put on all on the gyro. Not a big deal, but I prefer the gyro already put together I suppose. Fries were good and I liked the sauce to dip them in.I would come back again for another lunch visit."], ["Nathan P.", "When they're not openly hostile or rude they tend to be indifferent...so the service is pretty rotten.Sanitation is dubious.If a gyro and a drink cost three and a half dollars I might eat here three times a week despite the service and the clotted blood under the line cooks' fingernails and the chorus of insects chirping behind the counter......just the worst quality bleached-out cheap-for-them-but-not-for-you frozen fries, mealy tomatoes, brown-on-the-edges lettuce, two-dollar-one-size go-cups...This is what it tastes like...when doves cry..."], ["Jon B.", "Good Mediterranean food within five minutes of my house? Thank you, Jasmin! I had not eaten at any of their other locations, but heard it was good so I was excited to try them out. Have been a few times now and the food has been very good each time. I've had the gyro sandwich, falafel sandwich, and a platter which Mrs. B and I shared. The Jasmin sauce they give with the fries is like crack, and the falafel is probably the best I've had around here other than Neomonde's.Not sure what is up with the complaints about the pricing. I haven't found them to be any more expensive than other Mediterranean places in the area. The platters have a decent amount of food which can be shared if you aren't starving. A gyro sandwich combo runs around $8-9. I've had a bit better and a bit worse gyros for the same price."], ["Mary T.", "The food is good. The prices are okay. Their ability to correctly pronounce \"gyro\" is unfortunate."], ["Brittany G.", "I enjoy this new Jasmin location significantly more than the Hillsbrough street one! Much cleaner, quieter but still full of people enjoying the food! The counter layout seemed to help the flow of people as well. Came here on my lunch break (I just realized that it was FINALLY opened) and was overall impressed with the food! The gyro pita was stuffed with meat and veggies, the grape leaves were filling and came with a side of yogurt to dip them in and the baklava was wonderful! I could have ate them all day! My bill came to just about $10 even, which in my opinion is a bit pricy for a regular lunch, but i'm sure i'll come back every now and then when i'm craving a good gyro."], ["Jordan P.", "Enjoyed the food but wow is the service horrible. More so at this specific location, but also at other locations. I have called in three times for a pick up order where no one answered the phone. I called 4-5 times thinking I had the wrong number and no answer. When someone did pick up, there was laughing in the background and I was told \"we didn't hear the phone ring\" or \"um we were on the other line.\" The one time someone did answer the phone, the woman on the line was rude and hung up on me and continued to have a bad attitude when I came to get my food. If you would like to keep any customers coming back (because the food is actually pretty good) I recommend you invest in attentive and polite staff."], ["Kenghis K.", "I was in the mood for some Mediterranean food, so I thought I'd stop by Jasmin and grab myself a bite to eat.  When I walked into the store, I was greeted by a nearly empty dining room with two or three tables filled with patrons who were already eating.  Sadly, that was the only thing that greeted me.  Neither of the two employees working in the front paid me any attention.I work in the food industry, and I have always made it point to greet customers when the step into the restaurant of where I'm working.  It is professional and welcoming to our patrons.  If I can't attend  to a customer right away, I ask them to wait for a moment and I will get to them as soon as I can.I didn't even get eye contact with these two.  The woman working the hot table was plating a to-go box, but she never even looked up and made eye contact with me.  Giving her the benefit of the doubt for just being super focused, I patiently waited 7-10 minutes waiting to get some service.  The real kicker came when this girl came in behind me.  The moment she came in, the woman looked up, looked right past me, and greeted the girl.I was livid.  There I stood waiting all that time for service and didn't even get a greeting.  Then this girl comes in a few minutes behind and she instantly gets acknowledged.  Needless to say, I turned around, left and drove 10 minutes to Neomonde where my patronage have always been appreciated.I've been reflecting about why I was treated the way I was treated and am still baffled.  This is the conclusion I've come to so far.  All of the other patrons were male, so I've ruled out my gender.  I'm usually a quiet person, but the girl who came in behind me was also quiet and didn't even say a word.  The only factor I can think of was that I was the only Asian in the establishment.  I would hate to think that my race played a factor in the quality (or lack of) service I received.  However, if that's the case then I would be disappointed that places like Jasmin would feel that way towards people like me."], ["Josh P.", "Gyro meat is occasionally fresh off the spit, but if you don't see the spit then don't order it. Because it's just being kept in a warmer and it will taste like it. This location has an issue with cleanliness. I saw empty containers of food sitting on the back counter collecting gnats."], ["Molly M.", "I love this place for lunch - it has replaced Zoe's Kitchen as my go-to quick Mediterranean. Their hummus and pita are particularly delicious and I love the perfectly spicy shawarma chicken."], ["KK W.", "Not perfect but quick, unique and delicious.  After spending time in New York City I have been on the hunt for good shawarma in Raleigh and have not had any luck.  Until now.  Come at lunch before 1PM and the shawarma is FANTASTIC.  I've also tried the gyro and the spicy chicken panini, which has shawarma and spicy mediterranean slaw wrapped in a tortilla and grilled on a panini press.  It is absolutely fantastic.  Also the lentil rice is good, the baba ghanouj (sp?).  Nothing really negative to say about this place, except that when they get busy they have a hard time keeping up.  but that's easy to forgive when the food is awesome!"], ["Chip M.", "Came here for lunch while I was getting my tires rotated/balanced at discount tire. Granted I came at about 1:30, I was the only person in the place. Not usually a good sign. The staff were friendly but a little spacey. I asked for some recommendations but got little substance in return. No big deal. I went with a veggie bowl and was pleasantly surprised. It was flavorful, full of lentils (sorry about the other reviewer) and the tzatziki was ample. For $10 it was a bit high for what I got, though I would like to try it again before I search elsewhere. It was really decent, albeit generic, Lebanese food that certainly won't offend anyone. 3 stars... for now."], ["Kim B.", "We went here a couple of weeks ago. Food was okay but too pricey in my opinion for the value. They remind me of a subways because they try to fill you up on everything but the meat and take make sure you don't get much. My son loves gyros and again it was just okay so think I won't be back."]], "Greek Fiesta at Falls Pointe": []}