{"Kadhai The Indian Wok": [["David B.", "Always my favorite place for Indian. The buffet is always full of delicious dishes and I get to try a lot of different foods. There is always a good spice level to all of the dishes, so it is not just bland food. Seasoned well and full of flavor. Some Indian buffets in the area are terrible. This one is not. I introduce this place to friends all the time. I've never heard a complaint. I come usually twice a month I love it so much."], ["Jordan M.", "Lovely little place. The lunch buffet was wonderful and the service was quick and friendly.  I will definitely find my way back there again.  Something should be done about the address though. The directions would have taken us 14 minutes in the opposite direction; we did find it near where the map shows it should be, but we couldn't rout to the spot."], ["Michael H.", "Kadhai is our go-to Indian restaurant, and they've done right by us for years. In fact, I don't think we've ever had a bad meal there. The only possible thing I could criticize is its location in a very non-descript strip mall (sort of an ambiance \"blah\"), but I'm willing to overlook that for the excellent food and friendly service."], ["Avanti V.", "Horrible service. A couple Indian girls who serve have very poor people's skills, don't seem to understand the order.... Huge language barrier!! The food is even worse! Wouldn't go back even if paid to eat there."], ["Cameron P.", "Some of the best Indian I've had in a long time, though I'll admit I eat it infrequently. Atmosphere was inviting and staff was very friendly. A little pricier than I'd hoped to spend that evening ($13-$18 entrees), but the portions were huge and delicious. Would highly recommend the Tandoori Chicken Masala special if it's available. Only four stars because the service was a bit slow - my girlfriend and I were the only two people there for an early dinner at 6 p.m. and noticed sizable waits between appearances of our server."], ["Steve A.", "Visited this place with co workers that know the people and owner a while ago and the food was delicious.When back to order a take out and was totally disappointed. Ordered the Butter Chicken and received 3 nuggets of chicken swimming in a pool of sauce. I told my coworker that took us there about the Take out experience and he informed me that if I go back they will do better with my order.Well, since I was \"ripped off\" I chose never to return."], ["Sam K.", "Definitely like coming here for the lunch buffet. I would give it another star if they had a buffet for dinner. The dinner is kind of expensive...BUT for LUNCH it's really good. The butter chicken is definitely my favorite. I can also destroy some naan and the rice. Honestly all the different flavors of chicken are really good.  Came with my vegetarian friend and he was crazy excited there were so many choices for him to eat too. The service was pretty good too. Some people might complain, but in my opinion, with any foreign restaurant, why do you expect good service? Great food, good service (when I've been there)."], ["Rod O.", "Impressive for a Buffet?  Impressive for any Indian Food! ! !  Mark W. told me about this place a year ago and my Bride and I finally got here for a Sunday Lunch Buffet, right at 12:00 (they let us in about 5 til) others were waiting too!Three Plates of Food + Plus!1st Visit Highlights : :Great CurriesGateway CurriesChickenLambGoatLentilsOnion ChutneyRice PuddingRod0 awards Winner :  \"Best Goat\"! \"Best Vindaloo\"! \"Best Rice Pudding\"!\"Most Original Lamb Dish\"!\"Best Indian  Lunch Buffet\"!  If this place moved to North Raleigh I would reach my Genetic Ceiling for Body-weight! I Have Never been a fan of Rice Pudding... I have never cared for it at all, until Now!W.s Mark W.   first told me about this placeRon W.   said he had not been in yearsBen W.   ate here the same week as my first visitJennabeth W.   is the Duchess with 6 check-insAndrew W.   also has 6 check-insTrey W. gave this place 5 starsNo W.s have reviews in the \"filtered\" \"file\"!You Know what a Gateway Curry is!!!"], ["Zubaer J.", "I am a little biased when it comes to Indian food; I'll admit that. Most are great because I love indian food but a few are amazing. This place really has some amazing appetizers and entrees. The chicken vindaloo is very well made while the raita of theirs is a little different compared to others. Their aloo tikki is also very good. I wouldn't say it's a \"special place\" to go for indian food but  you definitely can't and won't go wrong coming here for some lunch/dinner."], ["Terra W.", "Excellent food. Excellent service. Nuff said!"], ["Martin B.", "Good little indian restaurant that you could miss looking right at it in Pleasant Valley Promenade shopping center. With drink the buffet will be just over $20.00 and I very much enjoy their Indian saag. A little thing you man not know is that the chef has won some awards for food/ice art. He may have some of it when you stop in so look out for it. I think it is the best in that area of Raleigh NC."], ["Rob C.", "I have only tried takeout but really enjoyed what we had, quality was really good but a little pricey. One of the foods I miss most from England is Indian, I have lived in Raleigh, right around the corner from Kadhai, for nearly 5 years and wish I had found this place sooner!"], ["Andy S.", "I have been coming here for many months, as it's the closest Indian restaurant to my house. I'm always impressed by the quality of the vegetarian dishes (note: I'm a carnivore, but their veggie dishes are wonderful).  The quality of the lunch buffet is good, but I wish there was a bit more rotation on items, especially on the meat curries. The food is very good, wait staff is very polite and friendly, and it's a great place slightly off the beaten path."], ["Holly D.", "My favorite Indian place in the area!! Delicious food and caring and courteous staff!"], ["Ebony B.", "Decided to try this place out for takeout on a Wednesday evening. Ordered the naan, vegetable samosas, saag paneer and curry goat. I didn't  care for the food at all. The curry goat was too sweet and it was mostly sauce!  The samosas were heavily salted, and the saag paneer was extremely oily. The naan was good! It is hard to please my palate though. Maybe it is because of my NYC roots!"], ["Leah J.", "Great food. I really do mean great. Expect quick seating, quick drinks, quick food, however the end game is where they are lacking. Currently waiting about 15 min on takeout boxes and a check. It's definitely worth eating here, just not if you're in a rush."], ["T S.", "I have to say this place serves probably the best Indian food I've had so far. Great place and service"], ["Amanda K.", "Found this little gem using Yelp. Just out and about and was in the mood for Indian. This was the best Indian spot we've found in Raleigh. We had the Eggplant dish with an 8 for heat & the mushroom pea with a 5. they went very well together. we had leftovers to take home for dinner the next night. When we asked for a box, they already had fresh rice in there. Great food, great service. Would definitely recommend!"], ["Deb H.", "Went here today to celebrate a friends bday for the lunch buffet. Deli, delish, yum! thats what I have to say. We got there early (noon) bc of the reviews talking about limited seating, by the time we left, the place was packed, glad we got there when we did. I will be back."], ["Jackie T.", "I would have given 4 stars out of 5 if the prices were better. We got takeout. The food was good and we did have leftovers, but I have had similar quality food at other Indian restaurants (in Cary - maybe because there is so much competition) for a better price. The sauces were distinctly different - good thing. More naan for the price would have been appreciated. I will probably go back as it is closest  to home but will need to feel I can splurge."], ["Janara N.", "I've written about Kadhai before, but last night's visit deserves a writeup of its own. I was hungry, and in no mood for socialization. A friend had reminded me of Kadhai, and I conceived a craving for lamb. Book in hand, I showed up for a late dinner. I don't believe I've ever visited for dinner before. There was a good sized crowd in the restaurant, though it was not full. The bad: my drink order was not taken for quite some time. It seemed I was in between the two waitresses zones, in some limbo land of no-one-wants-a-one-top. Finally a young waitress I've never seen there before took my order with a rather surly air. This poor service continued through the night. It was lucky I was in no hurry, or it would have truly bothered me. Look, I know a little bit about the restaurant business. A one-top is not as profitable as a larger party, though nearly as much work. I get that. But that's no reason to provide poor service, especially to a regular. It was extra frustrating to me, because I am a habitually large tipper. I know what wait staff go through. In this case, though, I was moved to only tip 10% - a harsh judgement, by my lights.The good: the lamb korma was truly outstanding. I asked for it to be made hot, and it was. It was that perfect level of spice - warm enough to make one sweat a bit, but not so hot that you can't taste the flavors. Korma sauce includes almond slivers and raisins and it was amazing. Even the rice tasted special. I have no idea how that was accomplished, but I was not about to complain. I also ordered a garlic naan, but this was not the best example I've had. The naan itself was good, but somehow the garlic topping was kind of dry and tasteless. I'm a fan of their masala tea as well. It was the perfect ending to an excellent meal.All in all, it was just what I wanted: a quiet retreat with good lamb."], ["Chris D.", "The food is ALWAYS on point!! Butter Chicken never disappoints!! The service is always great also!! Easy to read menu!! My suggestion: Butter Chicken-spicy level 7 with a side of garlic naan!!! Soooo good!!"], ["Syed S.", "Nice place, food is good. I am from Pakistan and have good sense of Indian food. Little pricey compared to other place but staff is nice and friendly. Lunch buffet would be nice to get taste of everything which is 8.99 weekdays. Google might have hard time to find it but it is on the back side of Bed Bath and Beyond."], ["Richard P.", "Our favorite Indian restaurant in the Raleigh area so far.  We order take out from here at least once a month. Everything is good, and we love that we can kick up the spiciness on any of the dishes. The staff has always been friendly. They've even put together some off-menu requests for us. Just recently tried the lunch buffet. It's delicious and a great way to try a wide variety of dishes."], ["Shannon A.", "We got takeout and the lamb korma was absolutely delicious. However the rice pudding had a weird soapy taste :(."], ["Anna S.", "It was very good flavor, the \"very spicey\" wasn't as spicy as we anticipated,  but we understand that some people who say that are big wimps and don't know what they're asking for . We got take out on a Friday night,  took 10 min, and there were about 8 pieces of chicken in each serving which equaled a bit shy of a half of a chicken breast breast. We got chicken tikka masala and butter chicken ( a subtle sweet taste), and the chicken was mostly tender, both delicious with lots of curry for dipping the naan -- the naan was very good... If you get takeout, get home as quickly as possible so the naan isn't sitting in the foil otherwise it will get a bit rubbery... but that's being highly critical. This is the best Indian we have had in Raleigh so far (: next time we will dine in and I'll update this post. I'd give 5 stars if they gave 2x more chicken..."], ["Kathie S.", "The lamb/chicken pasanda is INSANELY good.  We order this dish for takeout at least twice a month and crave it in between.  Can't even explain how immensely flavorful and tasty this dish is.  I hate to admit that we haven't really tried much else on the menu (when you find something perfect, why try anything else?) but their mango lassi is also delicious.  I hope Kadhai sticks around for a long time because it is a staple in our household!"], ["Jennabeth W.", "We've found our go-to Raleigh Indian place! Finally! The Kadhai dishes are really yummy, with a sharp, sweet smell that is intoxicating. We had the Bindhi (with okra) and Paneer versions of the Kadhai, and both were fantastic. The service was friendly and quick. I can't wait to explore their menu further. Pointless but sort of amusing side-note: The menu covers are printed with map graphics, and you would expect them to be maps of India, but they're actually old Spanish-language maps of Texas. Too funny!"], ["Ben W.", "This was some really good food! I mean, it was surprisingly delicious. Walking in (early evening) you wouldn't expect this place to have the quality food that it does. I was a little shocked by the buffet, thinking that it would be serving buffet style foods and just bland confirming dishes that everyone would enjoy. Mind was blown though when the service was fast, and the food was even faster, all while tasting delicious! We had a lamb dish that was perfectly cooked, chicken kabobs, vegetarian lentils, and a cury chicken dish that blew my mind, and mouth away. Two orders of flat breads was sufficient for two people.When ordering, we ordered our dishes medium, and definitely should have said hot! It was a good amount of heat though, definitely bearable for people not quite acquainted to spicy foods.Don't plan on having a fancy dining experience, that's what I was expecting. It is however a very tasty, family styled restaurant that I will definitely be coming back to when in town when craving some Indian food."], ["Winston M.", "Been here about 4 times and have yet to taste anything bad. The two things you absolutely need to have are the Butter Chicken and the Lamb Korma. The Naan bread is delicious, and so is the rice."], ["Trey W.", "We tried Kadhai first by ordering takeout, and it was fantastic. My wife got the mixed grill, I got chicken tikka masala, and both were very good. Several varieties of naan are also always delicious. We've ordered takeout several times and also been to the lunch buffet a couple of times. We've enjoyed pretty much everything we've had there, and the wait staff is friendly. Great little spot that might be a little hidden because it's tucked back in a shopping center and you wouldn't really see it if you weren't looking for it. We lived nearby for 3 years before we even really knew it was there. Now we go pretty frequently."], ["Amanda A.", "When Royal India Express was at this location I went there a lot for the weekend lunch buffet.  Today I was in the area and decided to try Kadhai.About the same size buffet as when it was Royal India Express but not as good.Good:Many veggie optionsCleanBad:Service was terrible.  No one was friendly.  We were half way done before we got our water and with Indian you need something to drink right away!  We had to go to the counter to get our check.The desserts were the worse desserts I have ever had at an Indian place.  They were already put into little, plastic cups and sitting out.  The balls (sorry- no idea what they are really called) were cold and soggy, the rice putting was so think and sticky that I held the cup upside down and it did not move.  It was like glue.  The carrot dessert was cold and had a terrible taste and I have no idea with the 4th thing was but after 1 bite I had to spit it out.  I am a desserts person so this made me sad. The flavor of the food was just OK on most of what I tried but the fried food was way too oily and salty.I totally get that Indian buffets are pricy bit this one was really high especially for the limited selection and quality of food.We should have driven out to Royal India on Capital Blvd."], ["Chip M.", "I'm no Indian cuisine connoisseur, but the lunch I had at Kadhai was very good. Service was amiable, the restaurant was clean and the seating was well enough situated. The food was very good. I love Indian food, but am not a big fan of buffet. However, each dish I tried was unique and easily differentiated. The few times I have been to a buffet, most of the food (Chinese or southern) left an eery suspicion that it's all the same but in different colors or shapes. Kadhai was not that way at all, so three stars for that!"], ["Heather T.", "Love this place! The food is great and the service is always fantastic. We have been there for the lunch buffet, which is small but more than sufficient and dinner. I highly recommend this place."], ["Charles A.", "Attended the lunch-time buffet. It had a great selection of items, more than most lunch Indian Buffets I have been to. IMO the food was excellent, and the service was prompt (for what you need at a lunch buffet) and I hope to go back soon. A lot of vegetarian options were available, and a spectacular okra dish that I had to have seconds of. I am fond of Their desert choice, rice pudding, but this one was really great! One of my lunchmates though that maybe it had been made with rose water. I am not sure, but whatever it was it was a great twist!"], ["Troy D.", "I go here about once a week either for lunch buffet or takeout at night.  The food is great and fresh consistently.  The staff are friendly as well. Lamb and vegetarian dishes are great. Lamb korma, kadhai lamb, lamb kebabs, malai kofta, kadhai paneer are all great."], ["Adrian K.", "I had the chicken tikka marsala and it was good but too sweet for my taste.  It would've been perfect minus the sugar.  I'll go back for the lunch buffet to try a variety of their food."], ["Andrew W.", "Every time I go to Kadhai I'm half-expecting for it to be closed. From Glenwood Ave, you'd never know there was an Indian restaurant in the middle of the shopping plaza. My last time here was a Monday night, and we were literally the only ones eating dinner. Someone else finally did come through the doors for take-out  though.I'm far from an Indian food connoisseur, but I'm pretty happy with Kadhai. Zayka and Azitra both seem to have the same quality of food, and they're a little pricier. With the coupons we get in the mail, Kadhai gets most of our business.I am pretty sure this is more of a lunch place, but I've only eaten dinner here. I'm always very happy with their cream sauces, whether they are accompanied by paneer or chicken. The \"medium\" heat is just enough for me to get a slightly runny nose. They serve chapati with a sweet & spicy sauce soon after you sit down.Service has always been fine and the restaurant is decorated nice (unlike Zayka near Brier Creek, which is bare). This is one of the best Indian restaurants I've found along with Tamarind (Apex)."], ["Anne K.", "UPDATE: I have been back to Kadhai several times since I wrote this review and the food and service have been stellar.  They deserve the upgrade to 5 stars because they haven't ever failed me.  Try the Navrata Korma and the Malai Kofta; they are amazing!The original review follows:This is my current favorite Indian restaurant in the area.  I have eaten here five or six times now and I never been disappointed here.The food is rich and has the depth of flavor that you get from using authentic spices and from taking the time to prepare it properly.  As with all Indian restaurants, vegetarian options abound.  My favorite is the Malai kofta.  And be sure to treat yourself to some of the vegetable pakoras as an appetizer.The dining room is nice and not overcrowded.  There are cloth napkins and tablecloths, and the lighting is perfect for dinner.  You can take a date here if she (he) is an adventuresome eater or you can do like we do and bring along the whole family.If you want a real treat, stop by for the buffet on Sunday.  It was a real delight.--Anne K"], ["Errol S.", "Don't waste your time with the lunch buffet, all of the food was very mediocre or less. The worst part on the lunch buffet on the weekend is it costs $14.95 and it's not worth more than $6.99. I've been to more than half the Indian restaurants in the area and I've experienced some really good buffets as well as ordering off the menu and there is no reason to ever go back to this place."]], "Sukhadia's Indian Cuisine": [], "Royal India Restaurants": [["Sabrina W.", "Got carry-out from Royal India for the me and my husband about 2 weeks ago and we really enjoyed it. The Hubster got Chicken Biryani and I got Palak Paneer and Dal Makhani. We ordered roti and naan. The food was really good. Only downside was we asked for mild but everything had a bit of a kick to it.... and it was really expensive... $70 for 3 entrees.?? Oh well, it was good!"], ["Shruti D.", "This place is a classic for the Triangle. I still go here and feel like other places can't compare."], ["Mark H.", "After trying a few so-so Indian restaurants in Raleigh, I was pleasantly surprised by Royal India. It has a somewhat bland decor, but the food and service were anything but. The waiter asked if we wanted spicy, extra spicy, or extra-extra spicy. The extra spicy was powerful good! There's plenty of options on the menu, and we will definitely come back to try the buffet."], ["Sara T.", "Several friends and I had the lunch buffet here today. The food was fresh and warm. The total price I paid was $10.75 which did not include a drink. A couple of friends thought the chicken masala was a little spicy but I didn't find it spicy at all. To be fair I am used to spicy food.  The service was very good. Plates were picked up immediately and drinks served quickly. We would return as it was a good value and great service."], ["Kitty L.", "Very impressive. They've been there 23 years. Great service."], ["Cherie C.", "Went there for the first time today. Boyfriend and I went around 11:50 pm, and when we went in, there was a table of 6-7 people and only one waitress. We waited a little for our drinks to arrive. It was understandable though. While waiting for our drinks, we noticed there was an unknown black stain on our table paper. This place uses a large piece of white paper on top of their table cloths. We took it upon ourselves to move to the table next to us. & we saw various stains on chairs and booth. We tried to ignore that, and went ahead to the buffet bar. Got a bit of everything...they have 4 different chicken dishes: curry chicken, butter chicken, tandoori chicken and there's a chicken that's crispy. The rest is vegetarian.  I liked the \"crispy chicken\"- (don't know the exact name), the eggplants & potatoes, and the butter chicken is okay (very watery IMO). With the buffet, they gave us a basket of naan, I love naan but their naan aren't as fluffy and thick as I would like them to be. Although I think the ambiance and the food are better at Mantra, but this place is very close to work and boyfriend's house. Maybe we will go there again when we are in need of Indian fix and don't feel like driving to downtown.p.s almost forgot to mention- the guy who collected our dirty plates wore heavily strong cologne, too strong for food establishments. Pros: close, lunch buffet-$10 per person, optionsCons: decor, stains, cleanliness"], ["Joseph K.", "My wife and I tried this restaurant out on a Saturday night, and it was excellent.  While we are not food experts, we have tried most of the Indian restaurants in Raleigh and have been satisfied with all of them but not incredibly thrilled with any single one until now.  Both of our dishes were delicious and perfectly spiced.  I am pretty boring and order chicken tikka masala + aloo paratha anywhere I go - this was the best I've had in Raleigh.  My wife ordered what amounts to the vegetarian sampler which included dahl, palak paneer, and chickpea something.  The palak paneer was the best she had ever had and everything else was outstanding.  We haven't tried the buffet yet, but we look forward to it.It is important to note the quality of the ingredients used was very high.  I think the dining menu prices are a little higher than some of the other restaurants in the area.  You get what you pay for.  I have some intestinal issues and my wife is also sensitive to processed/lower quality foods, so we expect some physiological side effects the day after any Indian feast(we typically accept this aftermath as we love Indian food), but we both felt great!  It's hard to describe to people who don't know us, but this speaks volumes for their food and cooking standards.The last item I will bore any reader who has made it this far with is about the service.  The service here was excellent.  We were well taken care of, and the manager/owner came out to chat with us several times.  When he found out we were celebrating our 8th anniversary, he had complimentary desserts and chai tea brought out.  This is a quality establishment and you're missing out if you haven't tried it!  I'll try to update my review after we come to try the buffet."], ["Terry H.", "Royal India has to be the blue print for the worst restaurant EVER. Bad service would be a compliment in that you would have to recieve service to rate it. The plan was to try the buffet in order to sample multiple dishes. After looking at the empty restaurant and then the beaten buffet which I can only describe as heat lamp food in fancy pots we opted for the menu. We never have a problem with paying a price for good food. Royal India hits on all cylinders with poor food, low quality, small portions, not cooked through meat and all this for a premium price. So we have food, service, restaurant in general ALL sub-par and inedible."], ["Laura S.", "There was a time that I drove two hours to have dinner here. Now I live in Raleigh and the past couple of times I've gone I've been really disappointed with the service. The food has been fine, but the waitstaff seems like their Myers-Briggs would have sent them in a different direction than food service. When they had a booth at the International Festival, I was the only one there and still had to flag someone down, in spite of the fact they looked right at me.The staff has never been blatantly rude to me, but it's a very awkward service."], ["Jenna R.", "Best Indian food I've had stateside. Still haven't found anything as good as the Indian food in the UK, but this is the closest it gets here in Raleigh!"], ["Nicole J.", "I stopped by here during my lunch break at work. Definitely a good idea!The lunch buffet has so many great vegetarian options. The food is all tasty with good flavor. The buffet is $10, but I think it's worth it for the quality of the food. The service is very very friendly- several of the staff started conversations with me.  The restaurant is clean and the food is presented well. They have chaat, main dishes, fruits and desserts (which I need to try next time!)"], ["Danielle N.", "Great food! A bit over priced for what it is...So far I have favored this restaurant for authentic Indian food over any others! I like the restaurant too..great service and atmosphere....."], ["Kumar N.", "Today we went for lunch in Royal India because of two reasons: first we were in that area and second it had decent yelp reviews. Sadly we were really disappointed with the lunch buffet. The buffet had fair selections of veg. and non veg. food but the food was sub standard and tasted funny. Salad was stale, daal makhani had no taste at all and the curries were terrible. In dessert, carrot halwa had a funny taste of some kind of medicine. Rice pudding was good (that saved me from starving) I almost came back home without eating anything. I think cooking Indian food requires great deal of knowledge of spices and what the end result will taste like. I will give them 1/2 star for their cleanliness. Our server was good, he was warm and very welcoming. I would never go back to that restaurant again."], ["Prasad B.", "The owner/manager was too rude and it seemed as if he was trying to force us to have appetizers/desserts. Water was NEVER being refilled unless we walked up to the front desk asking for some water.While we were having our food, he randomly walks up to us and talks about how he would eat up 4 hot rotis (totally randomly). He was also mocking at how thin I was since i did not order any entreè (since the food wasn't that great). Totally overpriced food and too less quantity.While paying up, he insists that we give his restaurant great reviews. Height of desperateness. I would never ever go back there."], ["Diana E.", "Delicious chicken and garlic kulcha but downhill from there. chickpea dish was bland and the spinach paneer had a distinctly sour, disagreeable taste. I suspect the vegetable dishes were left over from the lunch buffet but I can't prove that. Either way it was an expensive yet unsatsfying experience. No way we'll return."], ["Roberto G.", "naan and butter chicken is the best ive had.  decor is unique, great atomosphere."], ["Saurabh G.", "My first less than 4 star review.This place used to be my favorite spot for Indian food in the Raleigh area. In fact, I drove close to an hour at times just to get lunch. Sadly, it no longer deserves that coveted status. The food is the same everyday! It doesn't matter if you go this weekend or the next, the lunch buffet would sport the same dishes. The last couple times it was cold, seemed thawed, and just sat there like a neglected kid. Dinner menu is fairly expansive, but fairly expensive, at the same time.The redeeming features include a decent alcohol selection, excellent location, wonderful decor (including pictures of random maharajahs, one with like 78 wives), and large capacity. The only negative is the quality of food, lately, and especially the lunch buffet. If they can fix this, they stand a very good chance to becoming my favorite Indian restaurant in Raleigh once again."], ["Hy D.", "I have only been here for the lunch buffet, and have really enjoyed the atmosphere, quality, and choices.  Staff was friendly and attentive."], ["Arron B.", "We eat there at lunch for the variety in the buffet. The food is always at the correct temperatures and very flavorful. The quality of the food has always be great, and we have been going there for more than 14 years on and off. The dinner menu is just as good and have great variety. We also get fresh from the oven naan which is an added plus to the meal. The owner is always present and supervising quality of the food put out on buffet. Great food!"], ["Adri T.", "Several things have changed at the RI buffet recently. Great new thing - they now bring freshly prepared hot naan out to your table! This naan is unbelievable, compared to what you used to find in the last bin closest to the front door. Full of flavor, hot off the griddle, and perfect to clean up your plate! Food on the buffet has gone back to being full of flavor. It seemed that in the past 6 months prior, that all items were being under seasoned. However, everything we tried on Sunday was full of flavor and spice! If you have not been to RI, or have not been in a while, give it a try again. You might be pleasantly surprised!"]], "Kababish Cafe": [["Nishant K.", "Absolutely amazing food. Ordered the chicken tikka masala, the egg biryani and the hariyali paneer tikka. It was hands down one of the best meals that I've had since moving back to Raleigh."], ["Janice C.", "Amazing food! Very authentic middle eastern food. I have eaten here now 4 times and it is extremely consistent. Delicious food and nice, nice people."], ["Sonam C.", "The service of kababish is too slow. This was a big turn off. I and my friends waited for 45 minutes for the food and when it was served, we realized they missed the appetizer. The dinner arrived at 10:00 pm (their closing time) and we were rushed to pay bill indirectly. I ordered haleem and kababish special nan. Haleem could have been at least mildly spicy. I know the customers are from all parts of world but they could let them choose the spice level and then make. I also had a portion of chicken kheema which was okay (again coz of the spice level)."], ["Chris M.", "Lovely Pakistan / India / Mediterranean fusion (the \"ish\" in kababish.).  The owners and servers were very sweet and helpful.  The onion Pakora is the best I've had.  goat biryani had a nice flavor.  Not hot spicy, but a slow burn.  Saag Paneer was very fresh and not at all runny like some I've had.  The portions were quite large.  I learned today that Gulab Jamun is made with cheese.  Who knew?  These had a nicer texture than the ones at most Indian buffets.  We'll be back and next time remember to bring our own wine."], ["Dennis M.", "Everything was DELICIOUS, and the staff was very nice! I took my daughter (vegetarian) and son (8 yr. old/picky eater) and there were lots of good choices for both of them. We tried the Malai Kofta, Malai Chicken, Chana Masala, and the Meat Sampler. BTW-the basmati rice is some of the best I've EVER had! We will be going back soon!"], ["Shafi S.", "Slow service, small portions , disappointed with entree's .. Only good thing was the tandoori .. I would go back for the tandoori."], ["Meredith B.", "Excellent farm to table food. Love the BYOB policy. The kinks are still being worked out on wait staff.  Once staff is trained this will be the go to spot. I am excited to go back again."], ["Nick M.", "Excellent food! Excellent service! Definitely try out the kebabs and falooda. The kadahi chicken and kadahi paneer have authentic flavors ( no heavy cream). Lamb biryani is their specialty so check that out."], ["Larry S.", "Stopped by on a whim and am glad I did. Amazingly fresh food, good service and great owners. The mint/cilantro dipping sauce with lentil flat bread was the best part of the meal. The hummus was fresh and flavorful, but the black olives served with it were rather flavorless. Tiki masala was great and served with perfectly prepared rice. There is limited outdoor seating, the atmosphere was relaxed and the staff was competent. Looking forward to going back."], ["P S.", "Excellent food and service! My mom and I went there today, and we know our Pakistani and Indian food. The food here is authentic, not overly oily (something with which most Pakistani and Indian restaurants/cooks have trouble), and perfectly balanced in terms of spices. The food was fresh -- from entrees to the chutneys. The service was great -- the owners were cheerful and quick to help answer any questions. And the food came quick. We ended up ordering a lot more food to go, because what we had at the restaurant was that good. The haleem, chicken kebabs and wraps were amazing, as was the chat. Try this place - you won't be disappointed. (Also, used the bathroom, and it was really clean -- kudos to the owners for maintaining it so well.)"], ["Russ K.", "Friendly service and delicious food, consistently. Been there a few times now and the quality and flavor are very good. We expect to be regular customers."], ["A P.", "Chef knows to cook the chicken for curries to perfection! Delicious food with fresh ingredients and down to earth owners. We were not in the mood for kebab, so I'll write another review on that we go for the kebabs. I definitely recommend this place."], ["Richa G.", "Excellent food! Fresh farm to table concept for Indian food. I had the vegetarian kadahi paneer and grilled vegetables and the seasoning was amazing!"], ["Sean R.", "I went in during their soft opening with a friend. We were seated immediately and the menu was explained to us (I've never had this style of food before). I got the Chicken Seekh Kabab and it was awesome! The owner, Sam, came around to check on us and couldn't have been nicer. I will be back!"], ["Sallie A.", "The flatbread (naan) with flaxseed and served to the table while we looked over the menu was super. It was accompanied by two dipping sauces --a spicy mint one, and a spicy tomato one. The menu is varied, and it was hard to choose.  I was going to select a kabob, but I ended up with a lamb burger (with avocado, cream cheese and more) and my husband chose the chicken burger. Both were nicely spiced, but \"gentle\".Co-owner Samreen Nawaz, or \"Sam,\" came to our table to see if everything was to our liking, and we had such a delightful chat.  Born in India, she grew up in Brooklyn (!) She explained that all the food is freshly prepared, \"farm-to-table\" style. Her husband Syed Yousuf appeared from the kitchen, to visit us briefly and check on our satisfaction with the meal.  We were served chai, and we had a wonderful dessert served in a tall glass dish.  I can't recall all that was in it, but I remember it had some rose syrup, and was white and pink in color."], ["Shelly E.", "We ate here during their soft opening and had a great meal! The owners are so friendly and welcoming. Our dinners were delicious and the naan bread and rice they served were spot on. The only slight critique I have is that our dishes were a tad too salty.  But we will be back. It was a delicious and fresh dining experience."]], "Garland": [["Binh W.", "Pork belly was awesome. Pork bowl was a winner. Chicken 65 was banging. Hair spray included in the men's restroom for u stylish gents. Very nice vibe, good service, great food. Would definitely come back."], ["Jerry C.", "I'm generally pretty wary of Asian fusion restaurants, as most of them tend to be akin to P.F. Chang's - fortunately Garland is better than that!Our first stop on our whirlwind NC tour, Garland, is set in an upscale bar, but the food they serve is pretty reasonably priced, especially for the portion size.For lunch, I ordered the Beef & Noodles - a really interesting dish; I thought it tasted like pad thai + Vietnamese rice vermicelli bowl (bun thit) + Korean bulgogi. True Asian fusion! It was refreshing to eat on a warmer Raleigh day, and I felt better about myself since it was served on top of a bunch of greens heh.My friends and I also split their Moroccan \"hummus\" with which the chickpeas were whole, not mashed/pureed like a typical hummus. Pretty tasty and different from most chickpea dishes I've had.Overall, a very solid introduction to our trip to NC. If I lived in Raleigh, I would definitely try their Indian (also Asian, don't you forget it!) influenced foods!"], ["Warren N.", "I was told that Garland was Asian fusion cuisine, so that's what I was expecting my first time dining here. I disagree with calling it Asian fusion style, and would lean much more to referring to it as having Indian style dishes. So, if you don't like Indian food, I wouldn't recommend Garland. Also, if you are a picky eater, don't bother dining here. We had one picky eater in our group, and I could tell she had no idea what to order. The menu is very small and there is a limited number of entrées listed. However, if you do like Indian food, definitely check this place out! The atmosphere is super laid back. It is a smaller restaurant downtown, so get here on the earlier side as seats will fill up. The staff was friendly and helpful with the menu. I think it would be good to go back with a group of friends and try a variety of the small plates which all sounded good. I tried the tandoor chicken. It was excellent! Such a fun dish with so many options of how to eat it. The naan bread was delicious. The chicken was crispy, super flavorful, and not too spicy. The peppers and onions were a great touch to add to the chicken. The yogurt sauce was delicious as well. I wished there was more of the cauliflower and carrots given with the dish, as I felt I only got one bite and it was all gone. I was not a fan of the mint sauce. The prices are a bit on the high side, but the food is high quality and very flavorful. Everyone else at the table loved their dishes too. I have to come back here to try the small plates and some of the fancy cocktails! This is a chill, but higher end, restaurant downtown. If you're looking for somewhere new and cool to try, I'd recommend it!"], ["Wood C.", "My girl and I ate there last Friday, 8/14..., our res was at 6:45pm.Vibe was modern, and chill...We opened with the Local Heirloom Tomato Plate, and her entree was the Tandoor Chicken, mine was the Pork Rice Bowl - each dish was simply awesome. She had a white wine with dinner, and I had the Magdalena (unique and tasty).Nice gesture - a 2nd glass of wine was forgotten, and our server comped it when we reminded her of it. All in all, service was very good.Do yourself a favor, and hit this place up ..."], ["Lindsay H.", "After initially being disappointed by Garland, I have revisited a few times and it has gotten better with each meal. After trying more things on the menu, I would definitely recommend Garland for a date night or a fun birthday dinner. The ambiance is cool and trendy, service is okay, but the food is really creative.Recommend:Pork Belly Rice Bowl - crunchy, sweet, spicy, tangy - there are so many flavors going on. A hearty portion and a delicious meal.Lamb Curry - so flavorful, not too spicy, very fillingCauliflower/Chicken 65 - I actually liked the cauliflower even better than the chicken. The sauce on this appetizer is unreal. Spicy and complex."], ["Sandy N.", "Dinner is on the pricey side of things, so take note. The Birds Nest appetizer was good but super crumbly from what I'm use to. Beautiful presentation though! If you go for the Lamb Curry, ask for extra whipped coconut cream. It's more salty as opposed to savory. Garland is a cool place to go if you and your friends want to share the price of meals though!"], ["Lauryn C.", "I guess Garland wins as far as review updates go for this lady. I feel like every time I come here it's for something different! I visited Garland for New Years for their 6 course sparkling wine dinner and it was amazing, not to mention one of the best deals in town for New Years. How can you beat all the delicious food (6 courses) with a sparkling wine pairing sooooo good!Now I wanted to update my review because I recently visited for lunch. I honestly didn't know Garland was open for lunch but now that I know it will be a regular spot for me. My friend and I ordered the tofu noodle bowl and pork bahn mi. I've had a few bahn mi's in my life and as far as the Triangle goes this has to be one of my faves. The tofu noodle bowl was also delicious I really enjoyed the crispy chickpea noodles.If you haven't checked out Garland for lunch yet you are missing out."], ["Lindsay S.", "Last night, I got a small group of folks together for dinner. I've been to Garland on two separate occasions before and really enjoyed the food. On both previous occasions, we were seated at the large table in the middle. This time, I was coming with an elderly gentleman and we all wanted to make sure we could hear each other since it was more of a dinner meeting so I called and asked for a reservation for 5 people in the back corner of the restaurant, in hopes it would not be as loud.Our reservation was ready on time and we decided to start off by ordering a few appetizers to share: Pakora, Bhel puri, and the chili cucumber salad. I'd had the Pakora previously and remembered it well. It's a \"bird's nest\" style appetizer collection of fritters of farmers market vegetables, spicy chickpea and rice batter, and served with tamarind and cilantro-mint chutney. I have enjoyed it each time I've had it. I'd never had the Bhel puri or chili cucumber salad. The Bhel Puri was a dry collection of puffed crunchy mix with diced potatoes, cucumbers, jicama, local greens, peanuts, and a few other flavorful items. The Chili Cucumber Salad was pretty simple: warm chili oil, Szechuan peppercorn, a rice wine vinaigrette, and of course the cucumber spears and some chilis thrown in for extra flavor. The Pakora and Chili Cucumber Salad were both Gluten Free items. None of them were very spicy at all.Next, we opted to order a some large plates to share. The Tandoor Chicken was served on a large platter. Though quite extensive, with Tandoori roti, chicken skin pappadum, summer squash and tomato braise, raita, and a few other items, all agreed that this dish seemed to lack flavor. My favorite item on the menu is the Pork Rice Bowl, which I've had on my two previous visits to Garland. It's quite flavorful with its variety of items: pork shoulder, crisp sticky brown rice, kimchi style pickles, chili sauce, fried local egg, and a special slaw. It's one of the cheaper items on the menu, at $15, and the best, in my opinion. The burst of flavors did not disappoint on this occasion either. Finally, we ordered a Lamb Curry and a Vegetable Curry as well.The service at Garland was great. Very attentive gentleman server took care of us. It was very ceremonial when small plates were distributed and someone even complied with our elder gentleman's request to wipe the table down mid-dinner when we made a mess. It certainly wasn't easy for the servers to distribute food, pick up and drop off plates, and refill waters, with us being far back in the corner, but they did it very well and delicately. Garland is beautiful, but the hard concrete floors with the low ceilings makes for an extremely loud echo and difficult acoustics to have conversation in. The art on the walls is amazing as is even the bathroom decor. Be sure to check out the flooring with pennies laid down like tile! (A waste in my opinion, but cool looking...) The air was also very chilly. My mother and I were quite cold in our sleeveless shirts, but even the gentleman with us in a sport jacket was very cold. Garland is the type of places that you're dying to go back to because the food is so good and you definitely get what you pay for in terms of food quality and service, but the atmosphere, which isn't incredibly peaceful, can dissuade you from returning or taking a group there. That Pork Rice Bowl gets me every time though... and the decor certainly makes the restaurant live up to its name of elegance."], ["Mollyann R.", "My boyfriend and I went here for dinner recently on a Friday night. We tried to make a reservation but we were told that the dining room was full but the bar area was first come first serve. I am never a fan of going out to eat on a busy night without a reservation but we decided to try out our luck.When we arrived the dining room was indeed packed with a few people waiting around. We weighed our options - wait for a bar seat or order something to go. The hostess knew that we were debating these options and she was extremely helpful in assisting us. She told us that she was about to seat a couple at a table and that we should grab their seats. I really felt like she went above and beyond for us. I was pleasantly surprised! She was a pro.We sat at the bar and got exceptional service from the bartender. My boyfriend ordered the pork rice bowl and I ordered the tofu rice bowl. Both were incredible dishes! For dessert, we ordered a confection trio. Delightful!We really enjoyed our overall experience, 5 star service, 5 star food, and 5 star ambiance. Loved it! Perfect for a date night or out with a group of friends. I will definitely be back."], ["Holly K.", "Holy bibimbap. Which they call a pork bowl here, this is the real deal.  My boyfriend an avid athlete with a big appetite and I shared the cauliflower appetizer and the pork bowl successfully. Literally conniving a reason to go back at this moment. The only thing they could do better is controlling smokers outside. As we ate outside someone sat down at one of the nearby restaurant tables and lit up. This was a situation for a manager to come handle as no one enjoys smoke wafting over their dinner."], ["Karine J.", "We picked Garland for two reasons, 1) I found it thanks to Yelp, 2) when I told my fiancée she said a coworker had suggested it as well. So here we were most determined to go there for dinner. We arrived and were welcomed by the sweetest host, Germaine (if I recall correctly). We got set up at the bar where complimentary glasses of Champagne were waiting for us to cheer for my birthday! All the bartenders were as kind as it gets making sure we had all we needed without being intrusive. Adam, one of the bartenders, told us about the club they have downstairs and the concert room upstairs. Our food was simply spectacular, I will add photos as soon as I'm done here. I had the noodles and beef broth which was awesome and very filling. My fiancée had the veg curry which was so delicious, I was a bit jealous though mine was still the bomb. Lol. Our grind had the lamb sausage which was so fresh it was a sin! After dinner we stepped outside to head to the downstairs club when Paul, the owner, came out to say hello and thank us for coming to dinner. Paul was, as you would expect by now, extremely nice and thankful that we had come. He shared with us the story of his establishment and was just a delight to chat with. Long story \"short\" we had an amazing time dining at Garland and the most fun dancing all night downstairs, where our host was then DJing!!! What an amazing team of people! Paul, we thank you for a memorable night and will have to come again next time we end up in Raleigh. I highly recommend this place Yelpers!!!"], ["Carol M.", "Lamb curry! Lamb curry!Yes, I got the lamb curry. It was really delicious. My friend is a huge fan of their tofu bibimbap (they call it a bowl I think but it's essentially the same thing). They list all their gluten-free items right on the menu too which is great. We got a 375ml bottle of cider to split between the two of us. Our waiter was super cool and kept it on ice for us and also poured it as we went. Legit wine service for our tiny cider bottle!They also had pavlova (an Aussie merengue dessert) as a special on the dessert menu that night. I'm so glad he recommended it because for the GF eaters this stuff is BOMB and they did a great job doing a single serving baking of this, but it's also plenty big enough to split between two people. Plus their bathroom floor is tiled with pennies and is absolutely beautiful. I'd definitely go back!"], ["Rose L.", "I finally tried out Garland and boy was it worth the wait. I've tried to visit Garland a handful of times without a reservation, and it's always been an extraordinary wait, my recommendation is make a reservation! Garland offers a variety of small plates as well as entrees and one of the best drink lists I've seen at a restaurant downtown. Not only do they list all their beers: drafts and bottles, but wines but the bottle or glass, cocktails AND a complete list of all their liquors as well. We decided to order two small plates and a large plate to share. Upon recommendation from our waitress, we ordered the Chicken 65 and the pakora to start. The food came out quick and I was immediately entranced by the flavors. The chicken 65 is a classic Indian dish marinaded in a turmeric yogurt sauce served with fresh curry leaves,  chiles, lime and cilantro. It's a little spicy but definitely a mouth full of flavor. The pakora reminded me of a play on sweet potato fries (don't make fun of me for my very 'American' descriptions) with Indian spices: cilantro and mint being the strongest to me. There were two sauces to dip the fritter/fries in although I though the dish was excellent sans sauces. For our main course, we enjoyed the pork rice bowl, which was unlike anything I've ever had before. After living in Asian for a year, I didn't think there were many things that could surprise me, but this did! It was a mix of all your flavors: sour, sweet, salty, savory and spicy/bitter. I loved the crisp sticky brown rice, which compliments the entire dish, along with the salty pork and sour kimchi pickles. The pickled slaw gave just the right about of sweetness while the chili sauce balanced the dish out with a little spice. The fried egg on top wound all the flavors together into a totally savory dish. The only downsides I see for Garland are the tiny space, tables can only hold two sampler plates at a time or one entree if you're sharing. While the wait staff does a good job at spacing things out, I still felt cramped and could hear the guests next to us entire conversations. In addition, entrees are pricy, running $14-21 a place, while the small plates run $6-14. Garland, while it's small, might actually be a better spot for drinks only or large (pre-reserved) groups where you're splitting things."], ["Andrew W.", "I never thought I could get so excited about cauliflower, until I met Garland's takeout window in 2013. Since then, they have earned their title as one of my favorite restaurants in downtown Raleigh right now. The Korean-Indian fusion is one of the most unique menus you can find, with no weak dishes. A lot of credit is due to the multi-talented Cheetie Kumar, Chef and guitarist (Birds of Avalon).More recently, they have opened their dining room for lunch. For someone that lives and works downtown, I'm very happy about this. So far, I've tried their banh mi sandwich and a delicious hot pot special with pork and tufu.Unlike some of the newer restaurants and shops in Raleigh, Garland has more unique decor that's modern, timeless, and also a little fun. Make sure to check out the frames on the back wall.Service is very solid. I actually watched a new server being trained, and then had the server the next time. He was awesome and checked in with us at all the right times.For the gluten-free folks, items are denoted on the menu. However, I noticed that the lunch menu only had a couple appetizer options. So, you may want to check the menu or opt for dinner if you have dietary needs."], ["Katie T.", "I snuck over here for lunch a couple of weeks ago with the boss. Upon entering the restaurant, I was immediately impressed: the decor is modern and tasteful. It's quite spacious (so deceptive from the outside) with a beautiful bar area and plenty of table seating (and it has a long bench - I love the long bench!)For my meal, I tried the Moroccan \"Hummus\" - stewed whole Moroccan chickpeas with popped Jasmine rice (amazing), tomatoes, and sesame (it also comes with crema but I withheld d/t diet) and it is served with these addicting tortilla strips. This would be a fantastic appetizer as well. My boss ordered the beef and noddle salad, and gave it thumbs up. Great service. Nice array of vegetarian/vegan options. The dinner menu looks outstanding and I will definitely be returning to try it out."], ["Elizabeth B.", "The cauliflower 65 was exquisitely flavorful. We had chicken tandoor as well that was beyond our expectations even though we already heard great things. Simply delicious and a must try for the downtown Raleigh area."], ["Casey K.", "Came here with a group of 5 girls on a Saturday night and had a blast. The food, atmosphere, and service were all great! We got an order of everything from the sharing plates menu and it was more than enough. Each dish had different flavors and was delish. The atmosphere was lively, but not too loud - definitely somewhere I would recommend!"], ["Trupti T.", "I really like this place, I have been a fan since the first time I went here.  This is the best mix of east and west I have seen.  The food is flavorful and still Asian at the same time.  It is one of the places to go in Raleigh, the bathroom here is awesome as well.  The ambiance here and the servers, all of it was good.  I have had good experiences both the times I have been here.  The food here is absolutely delicious.  This is definitely food done right and with flavor."], ["Rishika K.", "Absolutely loved the food! Everything was great! The only thing you guys need to work on is service time."], ["Andrew K.", "I'll say this about Garland - It defies expectations. If you've been to many Indian restaurants you know what to expect from an order of Tandoor Chicken. pretty much Chicken wings that are red from the spices used in cooking it. Frankly, it's usually the most boring plate at an Indian restaurant. But if you go to Garland you'll be utterly surprised, because it won't look or taste like normal Tandoori chicken. Instead the chicken will be moist (gross word, but good when it comes to chicken), and served with a variety of sides, that are supposed to be mixed in with a Raita (bread), and eaten like a kind of taco/sandwich. And it's great. My favorite Tandoori chicken anywhere. It makes me question the meaning of Tandoori chicken is it just the oven it's cooked in? I don't know. Similarly, when I think of Pakora's, I think of a kind of vegetable dumpling. Not so at Garland! At Garland it's a \"bird's nest\" (their words) of fried vegetable bits, held together by onions. My picky vegetarian wife didn't love it, but still, it was nice to have a different experience. One last example: the Hummus isn't like any hummus you've had before. Instead of mashed chickpeas mixed with fat and oil, it's more like whole chickpeas with spices. And instead of pita to dip into it, it's more like fritos. And it really works. I've been happy with every dish I've tried at Garland. The Chicken 65 is maybe a little expensive for an appetizer, but damn, it's good. The curry dishes are great, with very tasty ingredients, which pleases my picky vegetarian wife. I also enjoyed the two pork dishes, especially the Bo Ssam. But for me, my go-to dish at Garland is the Tandoori chicken. The ambiance is alright. I love the decorations on the back wall of the place, with interesting prints, I guess representing fusion of cultures and food. That's a plus. Being right underneath a rock and roll club though is a minus. Having a band playing while you eat is a little unsettling, my crazy brain gets worried about the number of people right over my head. It's also quite loud. Still by and large it's a pleasant, clean, place to eat with nice decor. Every time I've been there the service has been pretty darn good, some of the waiters and waitresses even remember my wife and I, which is always a nice touch. Also, the proprietor of the restaurant is always buzzing around helping in a support role. If you talk to him, he's totally enthusiastic about his restaurant, and doesn't seem like the normal rage-aholic type that I associate with restaurant managers. Not a big deal, but I appreciate that the establishment probably doesn't treat it's waiter's like breathing garbage. I would take people who enjoy Indian food to Garland, so they can eat something that surprises and probably pleases them. I wouldn't take older relatives to Garland, as it may just confuse them."]], "Sri Meenakshi Bhavan": [], "Biryani Maxx Indian Cuisine": [["Apurva G.", "Easily the best Biryani in triangle. Service was super fast as we were the first customer ,literally the first ever customer of this restaurant. We ordered chicken,goat and egg Biryani . They are by far the best Biryani I've eaten in triangle. Taste is very authentic."], ["Andrew Y.", "It must be the laziness in me that keeps me going back to this place for delivery; that or some weird form of Stockholm Syndrome, I'm still unsure.  For some reason, I have a selection of 3 places that are not Pizza which will deliver to my place, and one can have Chinese Delivery only so many times in a weeks span.  Back to Biryani Maxx, the food is just meh, and is only a step above store bought pre-packaged Indian fare, however the price of this place, and extended delivery time bumps the rating down to 1 star.  The first time I had this delivered, I waited an hour and a half, and when the guy was bringing it up to me, I watched as the delivery guy stumbled at the top of the stair well (B/C he was looking at his phone), saved his phone but dropped the bag.  \"I'm sorry\" he said as he sheepishly handed me the bag, but by that time, I was so hungry I would have eaten anything.  Upon inspecting the food the Chicken Tikka Masalla container cracked open and was a mess all over the inside of the bag.  The second and third time, a took just as long to deliver, and the Biryani had no Masala on the bottom, as well as the Curry was bland as heck.  I can't stress how frustrating the delivery time is; it's not too far from cooking by Crockpot.  When I want delivery, I don't want to plan an hour to an hour and a half in advance!  I only go back to these guys b/c almost no one will deliver to my place, and I'm so lazy that if I blink twice, I'm winded..."], ["Dev S.", "Honestly, found this place on Yelp. I loved the Chicken Dum Biryani, Samosa and the Chai Tea hear. It was my first time, so I cannot comment on other dishes. However, whatever I ate here was very delicious."], ["Meadow D.", "Delicious!! Very authentic and super delicious. Definitely not watered down. We had dinner for two with two entrees, a couple of rounds of beers, appetizers and walked out for under $40. Will come back again for certain."], ["Sree R.", "Went to this place for a dine in. Ordered goat biryani and cut mirchi. When you name it a biryani it has to be a biryani with all the flavors in it. Just spiced up rice with some meat you don't call that a biryani. Cut mirchi was even horrible and the worst thing he got it after I finished half of my biryani."], ["Nancy E.", "Excellent food! Spice level was just right-- fresh tasting ingredients and a super speedy delivery!"], ["Sriram R.", "Name says it all, best place for Biryani.. Best past is they also do home delivery very quick."], ["Karan A.", "Food was good. Appetizer was well cooked and delicious. Vegetable dum biryani was great with Salan. Surely can bump up the ambience but I guess it was part of the experience; definitely  will try it one more time"], ["Prashantg K.", "Good place. Biryani was decent. Veg biryani could be more flavorful. Veg Manchurian (not on the menu) reminded me of the street food flavor in india. Very nice and crispy. Overall a good experience, could be better with a friendlier staff"], ["Sai R.", "Had dinner here , there bread selection is neat and must try ! . Neat and clean place"], ["Anil S.", "We went to Biryani Maxx for dinner on a Saturday night.  Ambience: it is a very tiny place with not much of a seating arrangement inside.  You need to find your own place.  On the table you could see 1 or 2 flies around and it is disgusting. Food wise, we ordered Chicken Pepper fry as an appetizer and it was good with some good amount of spice and flavor.  The next we ordered Chicken Tikka masala. It was completely bland. The breads we ordered with that however were good.  The last we ordered is Hyderabadi Chicken dum biryani.  This is a total disappointment.  It didn't have any taste or masala as pointed out by few reviewers. Being a Biryani place, I was expecting this to be the best dish of all. I probably will not go there again."], ["Naveen N.", "The best Hyderabad DUM biryani in the city. Awesome taste spicy.  The good thing about them is they offer free delivery with in 5 miles. so those who live near by park west village they get advantage of this."], ["Rudy F.", "I came here with family for dinner on a Friday night. The service was awesome. I had the chilli paneer for an appetizer and it was by far the best I've ever had. It had the right amount of spicy and flavor, and was crispy too. I also had butter chicken which was really good as well. I have never had biryani before, but was willing to go into new territory and tried thr shrimp biryani. It was absolutely wonderful. The garlic naan was soft, warm, and tasty! My favorite part was the desert, I will never forget it. I'm sure going to come back here next time I'm in North Carolina. :)"], ["Charan L.", "Best tasting hyderabadi biriyani I had in the triangle."], ["Mahendran S.", "One of the best biryani I had in recent times in triangle area. Food is yummy  .Only ambience need to be update ."], ["Raghu K.", "Don't need to say much about the food. It's awesome like most people have said. My 5 stars is for them having online ordering through the yelp app. I just did that and it was super easy. It's crazy how few restaurants have that in the triangle area. I'd like to see more Chinese and Thai restaurants etc have this feature added for takeout at least. It'll be great to avoid all the miscommunication with the people who take orders on the phone who may or may not understand what I have to say. Great food and I consider this to be great service for having the option to order online!!!"], ["Aravind R.", "By far the best biryani place in Triangle Park. The biryani was not only flavourful but the meat in the biryani was super tender and juicy (fresh)!!!! Well we were the first customers to order an appetizer (Fish Varuval) in this restaurant which undoubtedly tasted awesome. And if you are a fan of spicy food, this is the place to be. Service is apt and cleanliness is greatly appreciated!!!!!!"], ["Deep M.", "I loved the biryani here. Its a real hyderabadi biryani :)"], ["Amarnath S.", "Best place in RTP area for chicken biryani... The taste is pretty consistent...I would recommend medium spicy ...we ordered spicy once and it was very hot but still very tasty!!!"], ["Sanniya N.", "The best biryani I ever had.the serving is copious so if you planning to starve the entire day to reward yourself with biryani this is the place to be.The ambience is average.But the only place that has home delivery in Cary probably.So donot want to go to kitchen tonight just give a call and have the most awesome biryani at the doorstep."]], "Azitra Authentic Indian Fare": [["Kate W.", "My brother had received an email about Azitra's 10th anniversary celebration so we decided to go.  Their menu was the same menu they had ten years ago in celebration.  The restaurant was beautiful and the staff welcoming.  We started with delicious garlic nan, papadum, and condiments.  The tomato onion relish and cilantro relish were a tad sweet but still tasty as was the raita. We also ordered a shrimp appetizer whose name I can't remember but it was amazing.  It was covered in green herbs and grilled and served with two sauces. I ordered Chicken Tikka Masala and my husband ordered Chicken Vindaloo (special request) as these are the dishes we use to compare restaurants and our favorites. My Chicken Tikka Masala was creamy and delicious.  The white meat chicken was moist which is tough with large chunks of white meat chicken. My husband's dish was also tasty tho he said it didn't have enough heat (he ordered hot but not Indian hot). I tasted my brother's Bhindi okra dish and that was amazing and smokey.  Sooooo good! I definitely enjoyed it all and the service was excellent as well.  Upscale Indian food,  which I appreciate!"], ["Shikhar V.", "Delicious food, have eaten Indian food all my life so not new to the cuisine . Ordered Palak paneer, paratha and roti. Palak paneer could have been more homogenous in texture but it tasted really good! Breads were very well made as well. They have a great service, I was running late from the airport and they were waiting for me until 10:30pm (which is when they close). They have a pretty neat ambience as well.Will visit again for sure!"], ["A. D.", "Very friendly service. we walked in on a weekday afternoon for lunch, while on a business trip to Raleigh. Ordered the Bhel chaat, which was really good. The veggie dish was ok (cant remember the name) and the naan was really thin, crispy and good."], ["Mark S.", "Went here last night during Triangle Restaurant Week and got the 3 course special. Started with this Chicken Tikka appetizer. Presentation was very nice and the chicken was good but the sauce was too sweet for my taste.Entree was this leg of lamb in a nice curry sauce. The lamb was extremely tender and well cooked. The sauce is amazing, I ate that up with white rice and also dipped my Naan in it as well. The only thing about the Naan was that it tasted a bit under-cooked and doughy. Dessert was thing mango thing but I don't really partake dessert so I gave it to a friend. But I had a good experience overall and might come back and try the regular menu.The waiters are all extremely attentive and helpful."], ["Jasleen K.", "Came here for dinner and was pleasantly surprised! We had the samosas and chaat as appetizers. The samosas were ok, nothing to write home about, but the chaat was very good. It has mango in it and I love fruit in my chaat. We had the paneer makhani and actually it came out dry, but the sauce was so good I asked for some on the side. For dessert we had the pista kulfi and I wouldn't recommend this again, it was actually my least favorite part of the meal and I thought it tasted very bad.Overall a good restaurant and I would def go there again!"], ["Beth A.", "Have been to Azitra many times before and it was always a five star restaurant.  Checking Yelp last weekend, saw that Azitra had fallen to 3.5 stars and wondered why.  Unfortunately, after ordering from there again, understood why.  The food was still excellent, but the amount of food was so small, especially for a $17 entree, that I will not be going back again.  I was still hungry after eating the entire peppercorn curry leaf chicken dinner.  And they only gave us the plum and mint sauce I had specifically mentioned, rather than all three dipping sauces, even though we ordered the $9 bread item.  I find them to act so cheaply when the prices they demand are so dear."], ["Marcus H.", "Best indian. Spicy and savory southern indian food, tho they do have some northern. Nice staff. I miss the cool crooked bowls, but maybe I don't refute the good china.:-)"], ["Dennys M.", "It is a very good place. I think the bill was too expensive for the amount of food we had, it should've been a lot cheaper OR have bigger portions. It is really good, but not the best Indian place ever, especially for the prices. The waiters and waitresses are gentle, nice and polite. It is a really good place, just too expensive for too little and an alright kinda place."], ["Jonathan H.", "Had one of pretty much everything. It was all great. Very consistent quality and experience."], ["Nili P.", "The decor is very nice when you walk in. When we got there, no one was there to greet us but then someone came a few minutes later. We decided to try this place for triangle restaurant week. We got the kale and avocado Chaat to start which was amazing. I would give that 4.5 stars by itself. But the food from there was kind of down hill. My husband got the kofta and I got old style Delhi chicken and both of the dishes were okay. Both of us agreed that we would not order the entrees again. Then the desserts came out and I got the key lime cake and I was super unimpressed. I took a bite and did not take another. The mango kulfi on the other hand was good and I don't usually like mango ice cream. The service was not great. It took us forever to get someone's attention about a mess up on our order. The host was not super friendly and everyone but one person who came up to us just seemed a little cold and in a hurry. I would give the service 1 star. Overall I doubt I will come back unless I am specifically craving the chaat. Otherwise I will go somewhere else for Indian food."], ["Savio F.", "Ok, 5 stars for sure!  Clean, up to date, professional service and most importantly quality food!Ordered the salad, lamb curry and chai.Salad was fresh cold and crunchy!Lamb was tender & full of flavors. Came with  naan and was exactly how I like it. Soft of kinda doughy  but yet crunchy like a good pizza crust.Chai was so good, I reordered another cup!Enjoy"], ["Rebecca M.", "I've eaten at Azitra several times over the last few years so I expected another positive experience for a Sunday lunch. On their website it both lists their lunch hours as well as the lunch menu with the hours lunch is served. (Monday through Friday and Sunday from 12-3pm.) We had all looked the website over before going there as we wanted to make sure there is something we'd all like.Anyway, after we were seated in the almost empty restaurant (now I know why), the menu and prices weren't what any of us had seen online. So I asked about the lunch menu and those were brought to us. azitra.us/images/menu/pd…Then after we ordered, we were told they were not serving lunch and would be getting the dinner item. We should have gotten up to leave then but we were in the mood for Indian.We were told the menus were a misprint. There was no comment about the website. Well, it is time for them to update both. I am not sure why we were given the lunch menu if we could not order from it.The dish I ordered from the lunch menu is not even on the dinner menu so I am not sure where they came up with the mysterious pricing for it. I will not return to an unethical restaurant again so the restaurant lost a few customers today because they would not honor the lunch menu that very clearly spelled out the lunch hours and prices.Thankfully there are other great Indian restaurants in the area for us to dine with better business practices."], ["Jay H.", "I feel like this place could have gotten 5 stars. Prior to eating the food though I was contemplating giving it 3 stars. The reason for it was the price. $17 for a lunch entrée, and it wasn't even the most expansive thing on there. I got the chicken massala, which came with a bowl of rice. It was about 6-8 cubes of chicken dunked in tomato based sauce. Like someone else said on here, it looked like an appetizer. He gave this place a 1 star so I know where he is coming from. For $17, you would expect a salad or some type of side dish. Also, the Nan is a separate charge ($3) according to the menu. We ordered the Nan but to our surprise, when we got the bill, they left it out. I feel that Indian places should include Nan anyway and thought it was ridiculous that they would charge extra on top of the $17 for the entree. The reason why this place is good is bc of the food. There is no way I can give it a bad review, even if the price is what it is for lunch. I guess this is why they can justify these prices. Also, yelp gives this place $$, but customers would have better expectations if it were $$$. Sure, we weren't planning on spending $50 for a normal lunch but can't say I regret. I'm a pretty big guy and I eat a lot. I can honestly say this filled me up. The waiters were attentive and nice. It wasn't busy there so that could be why but had a very nice experience overall. I think when I came last there was a lunch menu but o well. Overall very good. If the entrees were more in line with other places $13-$15 range, it would be a solid 5 stars. But then again Indian food is expensive in general and I can't really complain about the price a business charges. Definitely not a place I can afford to go on a daily basis but will be back again"], ["Lindsey L.", "My husband and I have been here twice and both times were Delicious! We loved it so much the first time that we decided to go back tonight for an early Valentine's date.  the chicken tikka masala is super tasty as are the samosas and cauliflower bites. You must also try the assorted breads!!!!! Regular, garlic and.... STUFFED naan!!!!We did however...almost leave right after arriving. The restaurant currently has an 80 sanitation score."], ["Jules P.", "I have been here for lunch and dinner. The wine menu is great, and in my opinion, the food can be phenomenal or mediocre, depending on how you order. I've enjoyed the seafood dishes, chicken briyani, and naan. I thought the paneer curry was underwhelming. The service ho-hum, especially considering that the prices are steep for both lunch and dinner. Don't come here for lunch if you have a meeting right after your meal. The service was better for dinner than lunch. Others have indicated that they like the decor, but I personally found it to be tacky. I'd suggest sitting at a booth if you have the option."], ["Shelby B.", "I'm not nearly as eloquent as my boyfriend at writing reviews but here are the straight facts.  Over the last 2 years that I've been going to Azitra the food, service and cocktails keep getting worse and worse.  So much so that last night we went with a friend to have drinks and snacks at the bar.  We ended up leaving after 15mins Gavin paid for cocktails we didn't drink and food that we didn't eat.  Why?  Let me tell you...the chicken on the kabob appetizer was RAW.  That's right...cold and pink middle on what's essentially a chicken nugget.  Not serving RAW CHICKEN is a kitchen basic.  Enough said on this specific topic.To add to the raw meat they like to serve (and not take off the bill), we are 0-4 in wines that we've tried to order.  They have a pretty large and decent wine menu...but if you no longer have the wine...do an inventory and update your menu!  That way we can order something you have instead of playing a back and forth guessing game with a completely inexperienced bartender.  No offense to the bartender guy (apologies I do not remember his name).  In addition to updating your wine menu I would suggest that you take a lesson on how to make martinis.  Your technic at chilling the glass and shaking was useless (as they were pretty much room temp)...your ratio of ingredients is way off (a vodka martini should not taste mainly of vermouth...and should NEVER have a lemon wedge placed on the side of the glass)...and in a cocktail that has prosecco...the prosecco needs to have bubbles and not be the very last bit of a bottle that's been open for who knows how long.  Please note that we were sitting at the bar and watching him make each of these drinks...these are all facts.Immediately after sending the raw chicken back, teaching the bartender how to peel the lemon rind and rub the essence on the rim of the martini glass...we asked for the check (which had all items ordered on it).  We paid the full check...actually to my disagreement as I would have asked for the items that we couldn't eat and the drinks we didn't drink to be remove.  On the way out the door I couldn't help myself and turned around to the bartender to let him know that we would not be returning...ever..."], ["Ashley W.", "I feel ashamed that I've lived here for the past year, and have not dropped in for a taste of Azitra's Tikki Masala. I dropped in for a work lunch with a couple of coworkers, and I was quite impressed with the interior design, table arrangements, AND the food. The table we got was cloaked in white linen, with blue fabric napkins, arranged utensils, water glasses, and four wooden chairs with blue, velvety cushions. The intimate dining area reminded me of an upscale, nautical restaurant, but with an abundance of copper hues, glowing \"sun\" lights, and dangling blue \"lanterns\" along the wall-lined booths.I ordered the Tikka Masala with lamb and chicken (combination $13), with naan, rice, and the soup of the day. The soup returned 5 minutes later. It was some sort of veggie bisque, but I found it to be a bit too thick -- as well as hard to eat with a normally-sized spoon. Our entrees were delivered 10 minutes later. My square plate was topped with a tastefully-lopsided bowl of creamy tomato-fenugreek sauce, with juicy slices of chicken & lamb, white rice, and puffy, butter-glazed naan. If I had not been in the company of others, I would have tipped my bowl directly in my mouth and DRANK the sauce. Even a coworker decided he wanted an extra side of the tikka masala sauce for his salmon dish... HahahaAll and all, this place is a great bang for your buck and a perfect spot for an intimate lunch with your boo. Quick service, friendly waiters, gorgeous interior, a lovely outdoor patio, and mouthwatering dishes that will have you coming back for more. Make sure you order extra naan because one basket will not be enough!"], ["Richard J.", "Yes this has a great selection of quality beverages at the bar. We decided to eat at the bar and talk to the bar tender. We ended up ordering 2 complete dinners tonight of menu.  Onion baji, chicken kerma and popadoms.  We throughly enjoyed our evening."], ["Mark B.", "I used to really enjoy going to Azitra.  Their food was quite tasty.  However, I was quite disturbed to see tonight that they had received a health department inspection rating of \"B\" with a score of 80 -- the lowest I have ever seen in my life.  What makes matters worse is that they had clearly removed the sign from the wall and tried to hide it behind the phone.  And since the screw was still in the wall and the sign was perfectly placed, it's clear that the sign didn't just fall off the wall.  I won't be returning anytime soon.  And it sounds like it's time for another health department visit to enforce their proper displaying of the inspection rating sign."], ["A N.", "Food quality and taste are good but pricey and quantity is less. i guess price is for the location. Will recommend it for formal as well as casual dining. Staff are very professional."], ["Andrea D.", "Overpriced and mediocre. The naan was more like focaccia than real naan. Dinner cost me 20 bucks and I drank water! The nicest thing I can say is that the decor is good."], ["Food L.", "I love this place as the taste is different.Food is good and tasty and i have been here for 6 times.Pros Good tasteDifferent varietiesQualityUser friendlyThey give you zeera rice  with curryAmbience is goodConsNo BuffetA bit pricey - but still its ok to taste good foodBut for sure try azithra to try good food."], ["J S.", "I usually do not prefer Indian restaurants due to shady service they provide and misguiding dish names and spice levels they cater. But this is first one I have seen the best upscale Indian restaurant with excellent taste and ambiance.Every time I will go to Raleigh - I am eating here - everyday.Must check this place out."], ["Prashant P.", "We visited Azitra after a long time. Probably after 10 years, and we were pleasantly shocked. While our distant memory was that of an upscale Indian restaurant with mediocre food, but great ambience, our recent visit had us very impressed with the food. I had the Chicken Hariyali Lazzatdar and it was great."], ["Matt M.", "I was finally able to take Ash to lunch during the week and we decided on Indian.  Azitra is wedged in a corner of Brier Creek and was surprisingly mellow during the lunch rush.  We were quickly sat down and brought menus.  The restaurant is a white table cloth-salad fork, higher dining atmosphere, but remains reasonable with their prices.  I ordered the Tikka Masala with lamb and a salad to start.  The salad was simple with a honey mustard dressing drizzled over the lettuce, cucumber, beet and cherry tomatoes.  The tikka masala was delicious and came with plenty of sauce for the rice and naan.  Normally, I am a clean plate eater, but I left with a to-go container that day.  The servers delivered good service and helped me fill up on all the naan I could dip.  They were kind enough to even ask if we needed more before bringing the bill!"], ["Morgan M.", "Ill keep going back here for the chicken tikka masala. It makes the place for me. The samosas are a little frufru, prefer traditional, but overall still tasty."], ["R G.", "Great food great service tryed their triangle week menu , will b back wth my wife n kidos as we all love Indian food"], ["Aditya T.", "One of the best Indian Restaurants in US, very nice interiors and very nicely maintained. The food was also also very high quality in presentation and taste."], ["Sanniya N.", "the ambience is good and probably it is the only reason why they charge so much .The food is an american adaptation of Indian food very mild on spices and not matching an Indian's expectations.If you are a hard core north Indian and had rogan josh kashmiri style then here it might taste more like rabri.I am someone who eats green chilllies as a side dish so if you are one like me you will be disappointed .Not really worth paying so much"], ["Mage L.", "I went to Azitra for the first time last Saturday evening.  It's an Indian restaurant in Brier Creek next to Fujisan.  The restaurant is at the end of a strip mall block, so the side is open for seating.  The seating area looked really nice, but unfortunately it's been in the high 90s all week so everyone wants to sit inside in the air conditioning. The interior was cool and dark, perfect for a hot evening.  The decor was very nice, my son loved the lighting.  We got a rounded booth which was great because the 3 of us could all sit together.We started with some paneer pakora and assorted naan for appetizers.  The naan also came with some raita which I used once the entrees came out.  The paneer pakora was decent, but I think the sauce was the best part of this dish.  The naan was good too, but I think in the future we'll just get the garlic naan.  The other 2 weren't as good.  We also each got a mango lassi.  The mango lassis here are very yogurty in flavor, not very sweet, which I think is good when going with the meal.  I don't like mango lassis that taste like fruit smoothies loaded up with sugar.I ordered the chicken tikka masala.  I usually prefer paneer, but they didn't offer that as a choice with masala sauce.  The chicken was good anyhow.  I had read other reviews indicating the dishes here were disappointingly bland, so I had ordered mine \"spicy\".  Well, I wasn't disappointed.  I drank all my lassi and needed all the raita to keep from burning up, it was great.  I also had more than enough leftovers for my next 2 meals.My husband got the lamb vindaloo, his favorite dish, also \"spicy\".  He was pretty impressed by how much it made him sweat.  He said it had a good flavor and the meat was good quality, but maybe next time he wouldn't get it quite so spicy.Overall I thought the food here was pretty good.  The service was excellent, I don't think our water glasses were even allowed to get halfway empty before they were filled back up again.  But since it was a bit pricier than other Indian restaurants in the area, I'm not sure if we'll be coming back too much.  The cost was $17 for each of the entrees, $9 for the 3 mango lassis, $9 for the naan and $7 for the paneer pakora.  It does have the convenience factor of being right off 540 near RTP and the airport, but if you've ever tried getting in and out of Brier Creek during rush hour, you know it's not so convenient all the time."], ["Suzanne C.", "While in town for business, this place was recommended.  the venue itself was lovely and the service was impeccable.  they had a solid wine selection which is often unusual in Indian restaurants in prior experience.  The food was very delicious...as a group of three, we shared a few apps--the Gobhi Manchurian was amazing! All in all, a great dining experience with a more polished Indian cuisine than I've normally had though don't get me wrong, I'll always love and remain true to the 6th Avenue restaurants in NYC BEFORE they 'gentrified' the street's cuisine."], ["Brian K.", "Best weekend Indian place with a great bartender and cozy, private candlelit outside dining area.  Spice level 4 does seem to be the most appropriate balance for heat to flavor ratio. Kind staff, delicious food, excellent drinks and a broad wine list. Try pairing a Pinot noir w some of the spicy dishes for a great Indian meal."], ["Matt B.", "One of the best Indian restaraunts I've eaten at on the east coast. They certainly don't hold back on the spice either. Ate at Azitra once a month for 7 months while working down here and am back in town regretting that the people with me likely won't go for Indian food!"], ["Deep P.", "The Dal Tadka, Bhindi Masala, Paneer Bhurji are to die for! I usually don't care about the ambiance of a restaurant, but even that is spot on and quite classy at Azitra."], ["Ashley P.", "Love their food, even the smell as you enter is fantastic and I have never been disappointed."], ["Julia W.", "This is the best Indian food I have had since relocating to the States. It was flavorful as if the tiny flavor molecules were playing a melody upon my tongue. I will be back anytime I am in the mood for great Indian food."], ["W L.", "One round of cosmos for our little group, and what can I say; it was a nice evening.Samosas, roti (the 'holy' vegetarian version of naan bread), and a beautiful gluten-free vegetarian dish called Kofta \"Anarkali.\" I ordered another to take home to a very appreciative husband."], ["Valarie G.", "A very nice upscale Indian restaurant with good food and good service.  The food took a while to come out, but it was quite impressive.  The flavors and portions were great and the staff was attentive."], ["Leah D.", "The best food in the triangle, if not the whole state. Everything I've eaten here is absolutely delicious. I recommend this place to everyone. A perfect date restaurant."], ["Mary B.", "This is my favorite Indian restaurant in Raleigh!   Everything has So much flavor and it's always just delicious and balanced perfectly. The food is plated beautifully and every bite is satisfying.   The ambiance is So cool and Romantic.  Love it!"], ["Bharadwaj R.", "It was the best Punjabi food we've had for a long time!! Every dish we ordered tasted very home-made and flavorful. The palak paneer and kofta anarkali was delicious and filling. The gulab jamun melted in our mouth!! The ambiance is very cozy and the service was fantastic. Little pricy but worth the cost. Upscale feel and dressing up well is recommended albeit you'll see people walk in with shorts & flip flops as well. A must go Indian restaurant."], ["Andrew W.", "Oh, Azitra. I want to like you. I'm sorry.I've been here for dinner about three times over the last couple years. It was one of the first Indian restaurants I tried in the Triangle.Service has always been great for me at Azitra, but the food is severely toned down and lacking flavor. I usually order \"medium\" at Indian restaurants, but it seems that even a \"hot\" here will get you a chicken curry with a spice-less pasta-like sauce. Even my favorites, chicken tikka masala and biryani struck out at the plate. Usually, biryani hits a solid double, and chicken tikka masala knocks a clutch 2-run homer. Fortunately, the Azitra garlic naan was nice and fluffy--it did a great job at soaking up sauce.Azitra is also a tad pricier than competition in the area (Zayka and Kadhai) and it has a more upscale feel inside. If you do look around, you'll notice a lack of Indians eating there. One of my Indian coworkers always told me that Azitra was \"too Americanized\".My love for Indian food (especially Northern) and the great location will probably bring me back to Azitra at some point. But, I've always walked away disappointed. At least I didn't walk away hungry--serving sizes are large."], ["Sharad B.", "This is the best North Indian place in raleigh hands down. You rarely find such ambiance at Indian places. The food lives up to your expectations. Its a bit expensive place for dinner but lunch is fairly priced. I did not like the biryani but there are other places for it like paradise in Morrisville. You must try tadka dal, methi chicken and coconut chicken soup. Must."], ["Sushant G.", "Two word summary - Wow & Yummy!!Last time we went to Azitra was about 2 years ago (2010).  What a difference in everything from back in 2010!!  Our first experience was nothing short of UNDERwhelming: service was below par and albeit the was good, the portions were too small.On w/ the review..My wife and I went on Friday evening.  The place was not too busy.  We were promptly greeted and seated by our waiter (Rajendra/Paul- name mentioned for my record so I can ask for him again).  Appetizers and main entrees (Paneer Pakoras, Daal Makhaani, Paalak Paneer & Baigab Bharta) were well timed & might I add..properly presented.  The portions were good size.  Our food was x-hot as ordered.  What was great is that even though food was x-hot/spicy, the taste did not get over shadowed w/ the spice ( something very common w/ Indian restaurants).  The service was excellent as well.  We were well taken care of and would definitely return.  Now we can add Azitra as one of our frequently visited Indian restaurants."], ["Jenessy A.", "This rating falls in a 4.5 and I'll tell you why. It is a very classy, upscale restaurant tucked in the corner of the shops in Brier Creek. Even the bathrooms were fancy! Because I was alone I made my way to the bar to be accompanied by another lone-star, and the bartender too. She greeted me with a smile and asked me for a drink. I asked her to recommend me a beer on tap. I ordered the Garlic Naan too. Now, I have to inform you that I now have the privilege of being allergic to tomatoes and peanuts. (Not so fun) So as I am looking through the menu I am slowly scratching off items. Who seemed to be the owner or part of the family owned walked over to the bar. I waved him down to recommend me something. I let him know I was a fan of curry dishes. He went ahead and made an order for me and I was quite excited. As I was ready to dig into my dish I realized there was a tomato! :( I patiently waited to tell him because it really wasn't a big deal but I just couldn't eat it. He repeatedly apologized and say he would immediately change it. He finally came back and personally delivered the new dish. He stated that what he made was not even on the menu and was made especially for me. He also apologized sincerely again and reassured me that there were no tomatoes or peanuts. And let me tell you, it was DELISH! Full of bold flavors and not a bit watered down after the small hassle. The serving was big enough for me to enjoy and take some to go. The prices are moderate but a great place for a nice dinner. Great bartender, awesome service and amazing food."], ["Ron W.", "Now what can I say but when it comes to Indian food I'm a hole in the wall sort of guy!  I spent many an evening in San Francisco's Tenderloin district chowing down good Indian-Pakistani food.  Azitra is NOT that kind of place.  It's a white tablecloth, wine glasses, bring somebody you'd like to impress place!  And there's nothing wrong with that, just set your expectations accordingly.  What I like most about Azitra is the service: fast, attentive and polite.  The food is decent but I think the heat and spices have been toned down for a suburban palate.  The samosas were good and not too greasy, the tikka masala I had was pretty mild and mellow.  So overall, a nice spot for a nice meal with your special someone.  What does bother me a bit is that while the food is good and service is great, I have a hard time with their prices.  I've gotten better food for half the money and it's just hard to get that out of my mind!  Azitra charges as much as any upscale restaurant for food that should just not cost that much.  But know what?  I still may be back sometime in the future for dinner..."], ["Kinjal P.", "Nice ambiance and pretty good food but a little rough on the wallet.  I am still trying to find my 'go to' Indian restaurant in the Triangle Area and unfortunately, Azitra is not it.  Don't get me wrong, we had a good time and we didn't leave hungry.  But, I was a little shocked by the prices.  For Indian food, I thought it was a bit on the higher end.  However, the food quality or quantity did not compensate for the price.Azitra is definitely the nicest looking Indian restaurant I have been in.  I won't lie, we thought we entered the wrong restaurant when we walked in.  We had a group of 10 on a Saturday evening at around 7:00 p.m. with no reservations.  However, we got seated in 10 minutes (super plus for us).  I think it might have been a slow night because it was raining something fierce outside.  The Paneer Makhani was the best dish.  Very beautifully presented and very tasty.  The Vegetable Korma was also good.  The naan portions were quite small compared to other restaurants and so was the raita.  $10 for a King Fisher Beer - the most expensive King Fischer I've ever seen.  The Tandoori Chicken was a disappointment.  High in price and very low in quantity.  And it didn't have that bright red color you often see on Tandoori chicken, which is fine because that probably meant they didn't go overboard on the food coloring.  However, it was very mild in flavor and that was the disappointing part.  On a positive note, the most beautifully presented Tandoori Chicken I've ever seen.So all in all, lots of glitz and glamor in the ambiance and food presentation.  But a little lacking in substance in relation to the price you pay.  2 Dishes, 2 naans, one raita and no drinks - $60."], ["Todd R.", "I recently moved to the area and discovered, to my delight, THE best Indian restaurant I've ever been in. I've had Indian in Asia, Canada, Australia, New Zealand, Fiji and now the US and no one comes close to the excellent cuisine at Azitra. The dining experience is second to none. I must have tried half a dozen items in the menu and not one has disappointed. New customers who are not into hot dishes should, however, ask the waiter first before ordering, as they might find a few items beyond what they can take. But I love the food here so much I dine in and take out maybe five times a week. Service is quick and friendly. The decor and ambience are classy and elegant. And the prices are unbelievably low considering the quality of the food. Whenever I have guests from out of town, the first restaurant I take them to is always Azitra."], ["Matt E.", "Azitra is a must-have dinner for me any time I am in the area. I absolutely love it.My go-to orders are: shahi paneer, lamb rogan josh, chicken kadhai, salmon makhani, and/or chana masala. And I *always* get a side of the peshwari naan (OMG SO GOOD) and raita. If you order any or all of those, I can guarantee you that you'll love your meal.The shahi paneer explodes with spice and a combination of rich buttery and savory tomato flavor. The lamb rogan josh is best served very spicy, as its sauce has a dark, smokey flavor. The chicken kadhai offers crisp veggies complementing tender chicken, all rubbed in a red peppery spice. The salmon makhani tends to leave you wanting a bit more meat, but the butter sauce makes the fish melt in your mouth. The chana masala is a simpler dish, but I've always appreciated the unique flavor they give through apt use of (what seems to be) Myrtle family spices.Finally, the peshwari naan is an absolute MUST as a side order. Cooked to perfection with a crusty outside and softer, chewy inside and filled with cherries, this naan and raita offer a wonderful counter to and reprieve from any hot dish you might order.The spice levels are good when you ask for medium. My fiancee doesn't like spicy food, and this is always fine for her. I, however, *love* spiciness and always get a side of pepper sauce when I go with her. If I go by myself, I order it hot or Indian hot, and I will tell you that the latter will definitely leave you sweating!So after all this, why only four stars? As others have mentioned, it is indeed a bit pricey. I'll first say that you can get out for pretty cheap if you only do a vegetarian dish and rice with water (under $15, including tip). But as the above shows, I always go all-out: three dishes, a few sides, and a mango lassi. I wish the meat dishes were $12-13 instead of $16-17, but I do feel that the portions are generous and the taste fantastic. We get out for around $70 with our generally-massive order, but we also always have enough for 2 meals worth of leftovers if we order that much. And the leftovers reheat incredibly well. For a nice dinner out, I'll take it!Others have noted inconsistency in their meals between visits. An important note here is that over the last year or so, Azitra underwent a change of its head chef. That's a pretty big deal. I can attest to the temporary differences and inconsistencies during this transition (even a slight drop in quality), but as of my last visit a few weeks ago, the quality has returned to excellent."], ["Eddie H.", "The food here is pretty good Indian cuisine. Not the best in the area, but definitely not the worst. I appreciate the family-style servings of rice and naan, and the dish you ordered comes out in a fancy bowl. They were able to put together about 6 tables for a huge group at lunch, but I was surprised at how few people were there at noon.The waitstaff is attentive and not overpowering, but the water they served tasted like it had been stored in a plastic jug for a week.I'll definitely go back if we need a fancy-ish group lunch spot, but I won't actively seek out Azitra on my own. Overall, good job!"], ["Sanju B.", "this is an excellent restaurant! the waiters and staff are superb, honest, and thorough!!! i would highly recommend this restaurant to anyone who enjoys good indian food along with honest service and excellent quality!"], ["Brendon F.", "Great food quality at Azitra. They are definitely worth the price. The crab masala is very tasty. Besides, their lunch specials with the South Indian curry option are also notable."], ["Becky B.", "I love Azitra! It's a must-visit when I come to the area!"], ["YL S.", "Great food but kind of slow service."], ["Marisa G.", "This place was awesome! I can't take much spice and they definitely tailored it to be mild; like ACTUALLY mild! The lamb rogan josh was great, the meat wasn't gamey at all and still tender enough to be tasty. The chicken tikka masala was also really great as a mild dish too and I loved the sauce! Everything we had was sopped up with naan and it was perfectly fluffy and hot and toasty! The service was so polite and high class, the patio was beautiful (although service takes some time), the food came out fast, and when we ordered a dessert that car with just two pieces for our party of 3 (gulab) our server came out with a dish with 3 pastries on them! It was such a kind gesture, I will definitely be back here!"], ["Terence S.", "Went to lunch... No lunch buffet as advertised. The staff? Rude."], ["Muj A.", "Being as I have Southeast Asian roots I tend to be critical, especially of upscale Indian food. It was very good, not authentic, but still very good. A bit oily for my taste and maybe not worth the price but worth checking out on special occasions (especially since there isn't much to chose from in terms of Indian around here)."], ["Sara S.", "Absolutely delicious! Food is amazing every time I go and service is always great. I recommend the crab masala and for a good cocktail the Bombay kiss!!!!"], ["Luis A.", "The food here was delicious. I'm used to Indian buffet such as Udupi but this was a treat. I think it would be better to go with a group of people since the plates are served family style though it was a great place for a date. It is a dressy place and the restaurant is very classy inside. Go for the lamb organ!! Wow was that tasty. Don't forget the garlic Naan bread."], ["Cara B.", "I've been to Azitra many times since they opened years ago  and always leave with the same feeling.  The food is decent, sometimes one dish stands out in your head as fabulous, but it's an otherwise forgettable meal.  Unfortunately, I've discovered that the dish that is fabulous changes from time to time, so the inconsistency can get a little frustrating.My most recent meal was exactly like that.I love the decor here.  It's contemporary in design but still recognizable as an indian restaurant.  The staff is always nice and friendly.  If you know you really like spicy indian food, I would stand your ground.  On a previous visit my family was talked down to a three by a waiter: it didn't cut it.  A four is spicy, but still slightly underwhelming (this is coming from a chili head, so beware!). Went with the family this time, so we ordered a number of dishes knowing we would take some of it home with us.  We had the peppercorn chicken curry, rogan josh, vegetable korma, and shahi Paneer makhanwala.  We also had muligatawny soup (awful, I'll never make that mistake again) and papad.  The true star of the meal was the paneer.  The sauce was complex, interesting, and the the paneer tasted fresh.  The peppercorn chicken and the vegetable korma are both dishes that we have been delighted with in the past, but they were just okay for this trip.  They send you home with everything in more earth friendly containers, so that is a plus. I've always debated the tackiness factor of bringing our own togo containers for indian...Oh! I wouldn't recommend ordering the rogan josh and the peppercorn curry together. Though the sauces are different, they are similar enough that having both doesn't add a lot of depth to your plate."]], "The Wild Cook's Indian Grill": [], "Laziz Biryani Corner": [["Drew D.", "When they first moved to this location they were struggling a bit (e.g. the LivingSocial issue, less than inspired lunches, confusing menu, and no buffet). But since the daily buffet has started they have improved greatly! The bread is now naan, complete with char marks. The rice is plentiful. The plates are still styrofoam and the utensils plastic, so be aware it's not fancy. The buffet has the typical Indian dishes like flavored rice, butter chicken, curry chicken, and chana masala. One time I went they had a perfectly prepared veggie samosa but another time I went they unfortunately didn't have it. On other days I've seen different items and on Fri/weekends I think the buffet is bigger. While I was eating (not too long) I saw them refresh several of the buffet items.  A few side chutneys are available and they are FRESH!  Even the spices in the main dishes were very fresh and flavorful.  It seems like they've been trying hard to improve and it's working!"], ["James B.", "This place defines diamond in the rough. You would never think that you can get freshly prepared Indian cuisine in the corner of the GO PACK BAZAAR. I love Indian food, but feel like spending $15 or more on it is a bit rich for weekly consumption. This place really does it for me, and with very courteous staff I will keep coming back!"], ["Caroline Z.", "Yelp has pointed me to many places I never would have found before, and Laziz is the perfect example. This mini-restaurant is located in the back of the GoPaks store on Hillsborough St across from NC State. They serve up a variety of vegetarian and chicken dishes, including the namesake biryanis. Arrive early to get the chef's pick thali combo. I've had a veggie biryani and the chicken tikka masala and both were great. When you're craving Indo-Pak food but don't want to pay $15 per entree, this is your place. Most plates are around $6-8."], ["Haynus S.", "Yeah, sure, the staff is friendly, they serve you lickity-split, and the portions are quite big.But this is some of THE MOST BLAND Indian (Indo-Pak, whatev) food I've ever had.  I've had boil-in-bag white rice with more flavor.  I know they're trying to cut down on expense and increase service by having huge batches of the daily special on hand, but just how much trouble is it to pull off Jim Dandee's portion and refire it with some extra seasoning?  It would be better than simply giving the side of spicy sauce.Also, the dumpster they use is maybe a couple hundred feet from the FRONT of the restaurant, and it stinks up the *entire parking lot*, especially in the high heat of a North Carolina summer.  I'm surprised there weren't buzzards circling or other carrion afoot waiting to feast off of so many chicken carcasses.Here's a joke:\"Gee, what's that stink?!\"\"Rancid ghee.\""], ["R D.", "Horrible food, cheap ambience. Deserves zero star. Never ever coming back. If they can mess up with Butter Chicken, they should try another profession."], ["Emily H.", "This restaurant, located in a grocery shop, reminds me of the Indian fast food restaurants located in shopping malls. Besides that, the food was not flavorful and the flavors that were there were a little off. On top of that, it's expensive. Will not be returning."], ["Kirby m.", "The people who run this place are super nice, and the food is the best Indian I've had in Raleigh thus far. Try the Aloo Paratha (sp?) at lunch time, it's my fav."], ["Jay Z.", "love it, good indian food with a decent price"], ["Monji D.", "Laziz has great Indian food with a very homemade feel to them.  They just got a new Tandoori oven too, so they now offer fresh naan among other tandoor dishes.  Great customer service every time I've gone there as well!"]], "Godavari Indian Restaurant": [["Saumya P.", "My husband and I shared the Afghani Chicken Kebab, a portion of Gongura Chicken, Naan, and Phulka.I was very happy with their phulka, and he was happy with the Naan.The Afghani chicken came sizzling, with onions and peppers. It was delicious, and I would definitely go there, just for more of their Tandoori dishes. It wasn't at all like the Afghani kebabs I have had in Delhi, but I guess this is an Andhra iteration, and I like it a lot.The Gongura chicken was not the best I have ever had- it was tasty, and spicy like we had requested, but it was terribly oily, and I'm getting a bit tired of that. Just like all the Andhra restaurants in the area the plate had a delicious but deadly oil slick thing going on.The service was good, their drinks seem a bit over priced, but the little we tried of their food was good and excellent, so I look forward to going back. Though next time I shall probably ask for recommendations for less greasy options."], ["Eri B.", "Godavari opened where Swad used to be. The staff is the same. The decor is the same. The menu, though it retained some of the original items, clearly changed recipes.We were super sad to see Swad gone, but figured that since everything was nearly the same, the food that we loved would still be there. We were mistaken.We ordered 4 Chicken Tikka Masala of varied spice levels, 2 plain naan, and 2 garlic naan. The Tikka Masala portions have changed from what they once were. One dish came with only 2 ounces of chicken (2 ounces of chicken for 13.99... seriously??) and 4 ounces of chopped onions and peppers. The other three dishes came with 3.5 ounces of chicken. Yes, we weighed each because the portions look NOTHING like they used to serve as Swad. The naan was very gummy, like it had been kneaded too long and developed too much gluten. It was not cooked evenly and burnt on the edges.We felt very let down by this experience as we used to order from this restaurant at least once a month. It was a great Indian restaurant. I doubt we will be back."], ["Yiwen T.", "This place was highly recommended by a Indian friend of mine who thought this was one of the most authentic Indian food in the area. I was glad that I decided to check it out!We came here in our gym clothes after working out on a Friday night and we definitely felt a little under-dressed due to the nice decor of the restaurant. The lighting was a little dim, which makes this place perfect date nights. There was so many dishes to choose from that it took us a while to make up our mind on what we want. I enjoyed all the food that we order and thought everything was great! The dishes were all very aromatic and flavorful. Although the meat pieces in the mutton biryani were tender, they were full of bones. One thing I did not appreciate was the spicy levels. The spiciness was not consistent for all the dishes. We got spicy biryani and medium spicy for the other two dishes. However, the biryani was the least spicy one in my opinion, while the other two were overwhelming. I was very happy with the overall experience. I would love to check the buffet soon so that I can try more of the other dishes being offered by this restaurants."], ["Amanda A.", "I went there thinking it was Saffron.  Didn't know it had changed.  Wish it hadn't.  Looked the same in there and it is starting to look a little run down.  A couple lights were out, tables had napkins shoved under the legs, scratches in the wall paint.  Just things that make me wonder how much care they put into the overall experience.  Service was just there.  They didn't talk or thank us for coming or anything.  Just walked around and filled the water and removed plates.  No smiles or made me feel welcome or appreciated. Buffet had a nice amount on it but no samosas, nothing spinach based, only one dessert, no rice pudding, no honey cheese dessert balls.  The dessert was some sort of flavorless pudding with a can of fruit mixed in.  YUCK! They were missing a lot of the things I expect to see on an Indian buffet.  Food wasn't impressive and it was overpriced.  Won't be going back."], ["Ranjay J.", "We decided to check this place out after realizing that it had taken over the former Swad restarant (which we really did not like-- they served a very sad generic buffet).It turns out to be the best South Indian buffet we've had in the Triangle!  They have a very wide variety of vegetarian and non-vegetarian dishes.  Vegetarians will be pleased because there is a clear separation of meat and veggie dishes, and the spread of vegetarian dishes here rivals that of Tower India, which is pretty much the best vegetarian South Indian buffet in the Triangle.Service is great, ambience is great, and we were really impressed that waiters were constantly checking on the buffet spread and quickly replacing any dish that was running out, so that everything was always piping hot and fresh.Recently when we visited for lunch, they had a live dosa (an Indian styled crepe) station where you could customize the type of dosa you wanted, and the chef would fry it up for you on the spot for you to eat with the buffet.  Neat touch and great way to promote the restaurant.  We can definitely see ourselves coming here many, many times in the future."], ["Katie S.", "Really wonderful and authentic food with lots of flavor!  The dishes are served family style, which makes it great for sharing.  It's great this way because you get to try an assortment of their yummy dishes rather than just one.Warning: they seem to have their own idea of spiciness levels.  My friends and I ordered \"medium\" spicy dishes (because ya know asians love spicy food) and we ended up with drippy noses and burning mouths!  Staff was nice and attentive, pretty decor, and the menu had plenty of options."], ["Ronk J.", "My review is for to go food and I had ordered malai kofta and two naans and my had requested to make the curry spicy for which the chef just added loads and loads of small chillies so.  The curry wasn't spicy and when I would  get chilli it would be hot so was disappointed.  One of the naan was burned and wasn't good at all.  Kind of weird that this restaurant has so many five star reviews in short time and that made me try but was not impressed. This restaurant seems to be good for south Indian food but the north Indian food is not that good.  Might try other items and see if it's worth 5 stars like other people have rated."], ["Nicole D.", "I was looking for some reasonably spicy food to clear out my head, and these guys fit the bill perfectly.  You know it's gonna be good when most of the (full) restaurant are Indian patrons.  We had the buffet, which didn't have a huge selection.  But everything was tasty, and I'm all for quality over quantity in a buffet.  The buffet wasn't so spicy I was sweating, but it was genuinely spicy.  So if you don't like spice, this is not the restaurant for you.  The buffet had four vegetable curries, four different chicken preparations, some chutneys, pakora, potato balls, four types of rice, naan, masala chai, and raita.  So like I said, not a large selection, but I had a bit of almost everything and I wanted seconds of them."], ["John S.", "This is an amazing, delicious South Indian buffet! There were lots of new items I've never tasted before or seen on any other Indian buffet, which was a nice treat! They have the best carrot halwa I've ever had. All the buffet items are really fresh tasting and just the right spice level (med to hot). They also have amazing spiced chicken wings that are very addicting. On our second trip, they had a dosa station out front where you could have a fresh dosa made to your liking, with lots of spices and chutneys to choose from. It doesn't get any better than this!"], ["Srikanth E.", "We came into this restaurant for dinner. The appetizers were really good and tasty. The entrees were really bad in taste and way too greasy. Biryani was the worst they had no taste at all. Desserts were also too sweet and not good whatsoever. Rasgola was too hard to even cut. Onto the service: the worst Service ever encountered. Starting with ordering the menu, the server had no clue what menu were, we had to explain what the menu/dish what it looks like to be. The waiter then switched the order (by mentioning the same name for both the dishes) and high when mentioned started arguing. Asked for water/straw, the waiter forgot and had to mention it 3 times. It was 9pm and when asked to order more food, the waiter started asking what time is it as we close at 9:45pm. Very very bad service."], ["Angelique A.", "This was my first experience with fancy indian dining and all went decently well, but it was hard to suck up the high prices. You are paying for atmosphere here instead of value or high food quality. We ordered the mutton biryani, lamb vindaloo and chicken chettanad. Everything was well cooked but our food was so so so spicy even though we asked for it to be medium. I think they cooked the pepper into the vindaloo and chettanad for too long and it was barely edible, and I'm a capsaicin badass usually! On the other had we asked for Indian spicy biryani and that was just meh in spicy...disappointing. Everything tasted pretty good, but I prefer the restaurants at Chatham square in Cary and Kabab and curry, which both give you more for the money with better service. I will say that the vindaloo was excellently flavored. Perhaps it's the north Raleigh location standard price, but I won't be returning unless Im in the area because I was not wowed. Four stars for providing decent south indian food in north Raleigh, but I'd only come here if I were trying to impress a date or be fancy. Sadly did not fulfill my foodie high hopes. However, I do have friends who rave about the chicken tikka and go there basically every week, so tikka addicts should give it a try and post their impressions!"], ["Brian K.", "We had delivery from Yelp tonight to try this new establishment and to our surprise it is the best Indian food we've had in the Triangle area.I've been to Bangalore so immediately resonated with some of the dishes on the menu and I promise you the chef here is the real deal.  The Chicken Chettinadu is literally identical to the curry's I had while in India and the tikka masala (girls favorite) was the best balance of sweet, smooth and bite we've tried yet.The vegetable dosa was point and the assortment of dipping sauces was generous.We are so very happy this place is in the hood. No comparison to the last place that was there - this is truly a new establishment and I'll go so far as to call it a neighborhood gem. Enjoy!"], ["Tulika C.", "I think place was okay....definitely lot more crowded and not really a kid friendly one. Food was fine .."], ["Joy Y.", "The food was pretty good, although I don't really like the setup of the buffet bars.  It's Sunday afternoon around 1:30, there were still lot of people and most of them were Indians, that shows you the authenticity of the taste. Wish the management could write a description or ingredients of each dish, It's hard for me to remember any of them in their indian names.  They set up an outdoor street food type of tent, right in front of their entrance, making samosa and indian style Crêpes, and it's included in the buffet.  However I think the restaurant should be a little more organized in explaining to customers about the setup between their indoor and outdoor stands, and managing the flow better in busy hours."], ["Sriram R.", "One of the best places for Authentic Indian Cuisine in Triangle area. Everything about this place is good. Manager at this place is very friendly."], ["Shelley B.", "I like the changes since I was there last (different ownership, I think). The buffet has been expanded. The food is a little different, but I was excited about trying some different things. I think the price is a little higher for this buffet than what we used to pay. Anyway, I'd recommend. :-) Note: The place was packed with Indian people, which I thought was a VERY good sign. It must be authentic."], ["Thiru T.", "Way overcrowded for weekend brunch. Love the food, but way overcrowded, and not the place to go to for a quiet weekend brunch/buffet. The buffet setup is also too small - too many people waiting on line to get to the buffet.I hope the management is listening and will get more staff and get the food replaced faster, and first in foremost get the table cleared.Disappointed by the service, loved the food."], ["Andy A.", "I really enjoy this place so far. I have only ordered take out, as I live about 30 seconds from it so it's been great. I never ate at Swad because the meat wasn't halal and the vegetarian dishes didn't really peak my interest too much. However, I really enjoy the menu here as there is a wide variety of both vegetarian and non-vegetarian food. The owners have verbally confirmed all meat is halal and there is a halal sticker on the front door for those who care. I eat meat but go through periods of vegetarianism and their non-meat options are great.  I read the reviews that the service can be slow if you eat inside, but for me this is now a standard take out place. I tried it the first time three nights ago and went back for seconds the following night and had to resist ordering again last night. . **Although this could have been a one time mistake, I would not give out your credit card info over the phone. The guy at the front was taking a phone order in front of me and asked for the customer's credit card with expiration date, 3 digit code, and pin for debit. He repeated all of the numbers out loud not once, not twice, but three times in front of me and whoever else was in the front waiting area. He also wrote all this down in plain view for everyone to see. I'm sure it was an honest mistake and I would never steal someone's credit card, but I realized my decision to only pay in cash was wise and will be standard practice for me.**I have ordered tandoori fish, chapati, and goat curry so far. They were both very tasty. I really enjoy a good burn but was careful to order \"medium\" spice on the curry to figure out what they consider to be more mild in heat. I found the \"medium\" level to be spicy enough.The only thing that kind of threw me off was the first time I ordered tandoor fish, it did not come with anything else. There was a good enough serving-4 filets-so I had leftover for the next day. I am more of a bread person than rice, so I always order a side of roti or something. However, for those expecting a starch know head of time the tandoor dishes may not come with it. Each time my order was correct but it does take them much longer than other restaurants to prepare. I'm generally okay with that, as properly cooked Indian food should not be ready in amazing speed. However, the second time I went to pick up I had already given them 45 minutes and I think they still had not really fixed it because I ended up waiting another 15 or so inside. I think that part of this is getting used to running the restaurant with online orders, so I will be forgiving. Honestly, I don't really care if the food is worth it and for me it was."], ["J D.", "Decent buffet, despite the Styrofoam bowls.  Spice level is nice, and the flavors are spot-on.  Only problems: naan that is like a cracker, food is quite greasy, and the food quality isn't very high.  Seems like lots of frozen vegetables are used - we all know what frozen carrots, peas and beans look like!  And I had to spit out the Okra- it was too fibrous.Despite the lack of attention to finishing details, it's a decent restaurant."], ["Kimberly N.", "This is my first yelp review. I created an account just so I could review this restaurant, that's how good it is. We ordered delivery tonight and the food was great! Best naan I've had in a long time, and the basmati was perfectly cooked and fluffy. All of our meals were flavorful and delicious. Lots of great choices and variety on the menu. The meals alone would merit a 5 star review, but the delivery service went above and beyond. We had ordered two mango lassis which weren't in our delivery bag. My son mentioned it to the delivery person and I just assumed we'd be credited for the drinks, but no. The driver went all the way back to the restaurant (15-20 minutes away) and came back to our house with 3 mango lassis! Great food and outstanding service. We'll definitely be ordering again soon!"]], "Aroma Indian Chinese Cuisine": [["Meghna M.", "Went here for dinner yesterday based on the reviews but it was nothing close to indo-Chinese food. Ordered crispy fried babycorn and the sauce was not evenly mixed. For entree ordered the triple Kung pao delight and just adding peanuts to tofu and paneer in red chilli sauce doesn't make it Kung pao in any way. No Kung pao sauce used at all. Ambience and service is decent. No issues there. But food was not what it claimed to be. Would not be visiting this place again even though it's just 0.3 miles away from home."], ["Cheryl R.", "My rating is only three stars due to price.   According to the website, Monday to Friday, the buffet is $8.99 for lunch.  Not a bad deal.  We ate here on Saturday and it was $12.99 for the same buffet.  The buffet included a soup, several entrees that included chicken, goat, fish and potato along with rice and noodles.  The white rice was very dry.  Since I had put it under a potato dish, there was no juice to soak into the rice and I didnt care for it.  The food on the buffet was fresh and tasted good, but I felt it was overpriced for a buffet with so few dishes.  During the week, if they serve the same thing, it would be a good deal, but why change the price for weekends?  Pet peeve...I dont think I would go back again."], ["Kavita M.", "If you like indo chinese than this is the place. I ordered vegetarian and loved it. Good service and excellent food."], ["Cake N.", "I tried Chili Paneer, Veg Hakka Noodles and Tom Yum Soup .. I am coming back for more Awesome place that serves great Indo Chinese food .. Vegetable Momos are also good and the sauce that comes with it is simply divine ... I am glad that I have a place that I will keep coming back"], ["Janet N.", "They should just focus on being an Indian restaurant and have specials or something. The Indian food we got there was really good! Chicken 65 as an app is a must. Their veggie Tom Yum is also very flavorful but their green curry wasn't the best. The chicken was slimy, yet, had a flour taste to it. The ingredients just didn't seem fresh and a bit bland. The rice was also dry but, to be honest, I am a rice nazi. If I'm craving Indian, I would rather hit up Chatham square. If I'm craving Thai, I would rather go to yum yum off of Harrison pkwy. It wasn't terrible but it wasn't amazing. Oh and the server left her iPad on our table and forgot to bring us waters and silverware. I guess the Indian family was more important to her than serving us. Much improvement needed."], ["Shruti D.", "We went here on a Friday night and thought we would check it out. The food was okay. We started off with crispy corn, which was not bad but not much taste to it either. While we are enjoying are apps, they asked if we could move so they could sit a larger family and take our table to make a larger table. Thought this was pretty unprofessional as we were eating. We never got the drink menu. After our meal, we got our check but we sat there enjoying the evening and talking. They came by, 4 times to grab the check. Didn't even say, take your time... sorry or anything. Just felt they just rushed us through the whole meal. Not the best in food, will rather go to another indo-chinese place."], ["Ashish S.", "I would rate this as the best Indian restaurant in Morrisville-Cary area. Their menu may not have as much variety as few other places in area but whatever they have stands out. We tried two starters and two entrees during our first visit here and that made sure we come back here again and again.Presentation, preparation, right blend of spices, nice ambience makes this the best.Special mention for our server, Liz. She made our dinner much more pleasant."], ["Aditya T.", "This used to be one of my fav restaurant but their food quality has deteriorated at such a steep pace that I don't think I would like to come again. It's supposed to be Indian Chinese and their buffet selection had one to two Chinese dishes and rest all basic Indian. The desert selection is just one option and that too burnt."], ["Amy H.", "I had been driving past this place a lot and suggested to my colleagues that we should try it for lunch since they had a buffet. When we arrived, i was surprised (and a little nervous) to see that it was practically empty. It was noon and there was one only other table with customers. I was equally disappointed that the buffet seemed small. However, upon closer inspection, there was a decent variety. I had the channa masala, the chicken 65 and a rice noodle dish w veggies. Everything was fresh and delicious!  The channa masala was spicy, but not overbearing. I would recommend coming here for lunch!"], ["Philip Y.", "I stopped in for lunch today; it was my first time visiting the restaurant.  The young woman who greeted me at the front was very friendly and also turned out to be my server.  She was polite, efficient, and conscientious.  I ordered the Lemon Chicken.While waiting for my order I had time to look around the restaurant, which is well- located opposite the Harrison Pointe Shopping Center at the corner of Maynard and Harrison.  It is in one of the newer structures directly off Maynard and has great parking and wonderful light on the inside.  Outside is a wonderful patio that would be enjoyable to dine on during the spring/summer/fall.  Parking is ample and easy.  In fact I was hopeful that the food would be really good because the location and ease to get in and park was very appealing.  I do not enjoy going to restaurants where I have to struggle to get in, park, and get out.The food arrived in beautiful white bowls, rice in one and the Lemon Chicken in the other.  It smelled divine!  I had water and sweet iced tea to drink, and was pleasantly surprised that the sweet tea was very good since it is more a staple of the South than of Indian/Chinese cuisine.  The dish itself was wonderful, quite flavorful and spiced accordingly based on the indications of the menu; I chose one with medium spice.  Based on the heat of this dish, I can imagine that the hotter dishes are truly hot.  This spicing was clearly authentic.I was lucky enough to meet the owner while dining, Gamer, and he was extremely friendly and wanted to be sure I was happy with my meal.  He informed me that the restaurant is new, and has only been open for 3 months.  Based on my experience I am hopeful and confident he could develop a thriving business based on the excellence of the food and the atmosphere and location.  I will certainly be bringing my clients to lunch here.  I am always looking for a \"go to\" restaurant and this will be one of them."], ["Bob H.", "I've eaten at Aroma four times and like it. Of the four three were for their Sunday buffet. My wife and I liked the buffet two of the three times. I also had dinner there with friends, which was very good. Aroma is a family run restaurant and focuses more on Indian cuisine more than Chinese. Their Indian tea is excellent, but served very hot, so let it cool down before taking a big drink! Overall, the service is very good and I like the food options. They have a unique option of tips on your bill so all you have to do is check off the one your prefer. You can also have your receipt e-mailed to you after you pay. I recommend Aroma."], ["Patrik P.", "Decent buffet. Nothing to get excited about.  Of the the 12 steamer pans 3 were rice based. Ordered the chili corn over fried and not even spicy. The chilis in vinegar were empty and did not look clean."], ["Amanda A.", "Sadly, today might have been my last day there.  The good news is this time we got bread with the buffet, the bad news is there was nothing on there that was really good.  I appreciate them changing it up to give us variety but I think they should keep a couple of the staple dishes.  My husband said today was his last day, too because the chicken is hard to chew at times.  He loves Cilantro because the meat is always nice, white chunks of chicken.  Also they don't put ice in the water so today we asked for it and still did not get it.  And no rice pudding :(  I even asked for some willing to pay extra for it but they did not have any.  So sad."], ["Rachel I.", "I was craving for Asian food so we decided to check this new place out. We had lamb momos, chicken masala and chilli and garlic fried fish. The lamb momos were nice and juicy, but if you don't like the smell of mutton better try the chicken momo. We wanted to order chicken tika but that wasn't on the menu, instead our server checked with the kitchen and made a special order of chicken masala and prata for us, both were delicious. The service was great and the ambiance was relaxing."], ["Sukirti S.", "Awesome food and a great alternative to bamboo garden. Both the appetizers and entrees was good. They were less oily when compared to other Chinese restaurants! They have a lot of veggie options.Service and quality of food is way better here. PS: The food here is really spicy! So make sure to opt for medium spicy level."], ["Thomas V.", "Yes ! Chef Rawat is back in style with his new venture . What a delight to the palate his slow cooked , Goat Ra Ra is! Combined with the whole wheat Rumalis and His signature Dal Makhni - it's an experience to be relished ! For those who prefer the Indo Chinese variety he has an outstanding choice there as well !"], ["Vivian J.", "Staff was really nice, but the good was terrible!We were craving indo-Chinese but this wasn't it. The vegetable momos were bitter and strange tasting. The lassi smelt stale. The chicken schezuan unappealing as well. The Thai green curry was good and rice was ok. And it was over priced. Not sure I would go back."], ["Jenn D.", "Another wonderful experience...the Hot & Sour soup is amazing on a cold and dreary day such as today.  You need to try it:)"], ["Jim F.", "I was excited to try Aroma but couldn't get passed their 78 sanitation score. Will try back again when it is a little higher."], ["Nancy A.", "Had dinner here last night. Amazing hot apps! We got chicken momos, chili garlic fish and the hot and sour soup-they could very easily have been the best we've had so far across the U.S.! The main course however failed to excite us as much. It was good but not as phenomenal as the starters. Our server was very courteous and offered helpful suggestions. Would definitely go back for the appetizers!!"], ["Pradyumna N.", "Great food. We came here for lunch. Although they don't have that many variety as other buffets offer, still the food that were there were all delicious and well spiced. I recommend aroma to everyone!"], ["Niket C.", "We recently went for the lunch buffet, and I will say this was one of the best spread I had recently. The quality & taste of food is really amazing. Most importantly the items in buffet were quite unique- lots of vegetarian options. The ambiance is nice and service was very prompt."], ["Bob C.", "Excellent preparation, impeccably fresh ingredients, perfectly seasoned. Can't ask for much more."], ["Jitesh D.", "First time in Raleigh. Had to pick a place for dinner. After reading reviews picked up Aroma. Worth the effort. Delicious food. Owner is the Chef. Service by Shawn was excellent. Overall an amazing experience."], ["Dharmesh T.", "Revised: Mr. Rawat reached out to me and personally asked me to give them another chance. We went by yesterday for the Xmas buffet. The food was excellent and the service was also good. Will definitely try it again.Old:The service was terrible. Did not have a chance to try the food. No attention given to customers, either seating them or taking orders. Avoid it until they hire more/better wait staff. Or consider takeout."], ["Barbara R.", "Went there for dinner with friends on a Wednesday night. We ordered all vegetarian entrees. They were fabulous. Vegetable Manchurian was awesome and so are the lentils.  Baby corn appetizers can recommended from another post. And I will have to agree!  Will go again."], ["Milin M.", "After a disastrous first outing at Aroma, we decided to revisit the place Sunday night in hope of some better service and food and to our pleasant surprise there was almost a 180 degree turn in events this time around. We were attended with a smile as soon as we arrived at the venue and our waitress greeted us with smile and was very helpful throughout the evening.  We ordered Hot & Sour Soup, Chicken 65, Chicken Lollipop, Chilli Paneer and Hakka Noodles and I must say everything we ordered was very delicious unlike last time and whole experience made our evening. Chef also sent us complimentary Desert.   As they say \"It's not how you start that's important, but how you finish!\"  They are on the right track now and I wish Aroma's owners all the very best for future"], ["Dale D.", "Accurate,  authentic, tasty Indian and Indo-Chinese fusion family cuisine. Lamb Korma is special type dish worthy of best status. Very neat and clean cozy environment."], ["Sayoni B.", "I keep giving this place one more try - and keep thinking they will get things right. There is SO much potential there. Just not sure if it will pull through.Heard about the buffet, thought we will give it a try. They have upped the buffet price to $9.99. 3 types of chicken iterms and some other forgettable items.Noodles were spicy - to a level where my lips went numb. My friend, who has a high tolerance for spicy food, could not finish it as well. Fried rice - zero flavor. Manchurian chicke - - underflavored. Chicken 65 - chicken seemed old...no flavor. just hot. The other items - happily skip!Disappointing Friday lunch. As we were checking out, we were asked how the food was. Mentioned the spiciness - said they would fix. ???Anyway, farewell Aroma. I will not be headed your way in a while."], ["Sam S.", "The food was dry but it tasted good. Not too heavy spices. Rice was fluffy and cooked. The staff were not very helpful. I asked if the food had and cooked tomatoes and onions, they told me no but it was full of it. It took a long time for the food to arrive but i guess that was indication of cook to order. Not enough seating and the available seats are next to each other which does not give much privacy. This was a problem for me specially they are located in half empty shopping center. If i want a sit down relaxing dinner for that price, i dont want to be included in the conversation next to me and i dont want people to listen to mine."], ["Mamatha A.", "Great choices on the menu and perfect cooking. Waitstaff was attentive. I got a nice glass of wine, water was filled regularly and dishes were cleared. We had a party of 8 and got 2 bowls of soup, 3 appetizers (chicken 65, dry chili chicken and dry cauliflower manchurian all tasty and nicely presented. For dinner, we ordered chicken tikka masala and shahi paneer for the children. We got chili garlic noodles with chicken - excellent  and amazingly done noodles, chili tofu, and chicken manchurian. We also got a bread basket and Roomali roti which was thin and well made. This was a great experience. It was good we went early because the place filled up by the time we were leaving at peak dinner time. All that including gratuity was about $20 per person and we had a little bit leftover to take home. It definitely has an enjoyable kick to it, so if you are sensitive to spice, ask for mild."], ["Liz W.", "It was delicious, spicy but not TOO spicy. I am just now writing this review. My family and I went on Christmas Eve, and apparently they had just waxed the floor, so everyone was sliding as they were trying to get to the buffet. It made for a very entertaining evening, and a very delicious one. I recommend this place to everyone."], ["Shilpi S.", "I just saw the hoarding driving by and mention of Indo Chinese interested me. I have been craving for Indian kind of Dumplings and we walked in found some on their menu. For starters we tried Veg Momos which were great and came with a nice tomato dip with a hint of spice I couldn't recognize but I loved it. Will definitely go back and try some Chicken momos and noodles. I am glad this place is at stone's throw distance from where I live!!"], ["Richi M.", "Food is good but the service is always bad. We have gone back several times expecting the service improved but it has remained always below average. Lack of servers and the manager taking order is super rude. Chef and his good food is the only savior of the place."], ["Shop E.", "Typical Indian restaurant - no one cares to see if guests can be seated. Attitude is more on the lines of - you are not welcome at my place. Asked the waiter how long it's going to take for us to be seated? as I saw a vacant table; he said - need to take an order !!! Seriously ??This is a problem with every Indian restaurant around the area. All they are bothered about is to make some money some how or the other.One good thing to say is the food is close to Indian standards."], ["Deepan S.", "This is a better alternative to the boring Bamboo Gardens to experience Indo Chinese in the triangle. Both the appetizers and the entree was pretty good. They have good veggie options too. The ambience was very nice with lot of natural light coming in."], ["Sharmila U.", "Goes under the guise of indo-Chinese to serve bland, tasteless food totally lacking in flavor and depth. No aesthetic appeal either. I had a fish appetizer; tasted like battered, fried frozen tilapia rolled in onions and tomato ketchup. On the waiters recommendation we ordered chicken manchurian. Indo Chinese chicken manchurian has deep fried well seasoned balls of minced chicken served in a fragrant sauce; this one was lumps of breast deep fried and served in a sauce that had no flavor whatsoever. The food took a long time coming. This will be our last visit here!!!"], ["Sharath K.", "Food is good but I think owner  should step up and hire more waiters  there is only one waiter who manage the whole restaurant ."], ["J U.", "Was trying to get a party of 10 in and for some odd reason we were being told to pay for a price fixed menu in order to get a table. If you don't take reservations that's all that needs to be conveyed. Finally we were told that we could get a table but only have it for an hour. Since when did anyone have a birthday party with ten people for only an hour!!!!  The food reviews are good so I'm interested in trying it out one day but the service even before we got to try it out was not par to what I expected. Lost business if you ask me. Hopefully after trying the spot out I'll have a better review!!!"], ["Suri K.", "I went back based on Mr. Rawat's recommendation to revisit.  It was a busy night at the restaurant, but we still got our food pretty quickly.  Tried Chicken momos & Chilli Garlic fish, both were excellent.  On the main course, tried Mongolian chicken..could've been little spicy..  but taste was excellent, with big portion.."]], "Udupi Cafe": [["Prakash G.", "Well, What a pleasant surprise to find Udupi Cafe here. I am from the same state Udupi is located, and grew up and continue to be a Foodie and Udupi definitely lives up to it's name. Authentic, delicious buffet or ale-carte from the menu."], ["Tom H.", "Wherever you find yourself living, it's important to have a few of the basics covered. You need a good doctor, a reliable mechanic, and - most importantly - a quality Indian buffet. When I moved to Cary back in 2002 I ran through the buffet circuit on the regular. That is, until I found myself at Udupi. Let's just say this place put a ring on it because I don't find myself stepping out to other Indian buffets all that often. In fact, for the last 13 years I have made a concerted effort to eat the lunch buffet once a week (sometimes twice). If I go an extended period without enjoying Udupi, I'm a pain in the ass to be around. Even now that I live in Raleigh, I make the 20 minute drive most weeks and am rarely less than satisfied.So, in an area with a multitude of Indian establishments, what makes Udupi so special? For me, it comes down to a few details. First is the freshness. Sometimes I've had to examine my fork because I was certain there was a little curry chef sitting on the end making eat tasty bite as the fork entered my mouth. Second is the quality. Ever notice how some buffets offer condiments like tamarind sauce and raita that are thin and watery? Not at Udupi. The stuff is thick and viscous and, if they're paying attention to these little details, you can be sure the rest of the food delivers. Third is because it's all vegetarian. While this might not be a selling point for a lot of people, it's huge for me because I know I can eat anything and everything. Plus, I've taken numerous meat eaters to Udupi and, to a person, they think it is hands down some of the best Indian food they've had. Also of note is the super-friendly staff, but, honestly, they could punch me in the nose every time I walk in the door and I'd still probably be coming back -  I just might not tip as much."], ["Sai K.", "We are from south India and were looking for authentic South Indian food. Last night we went to this place and ordered Mysore masala dosa and Mysore bonda. Dosa was really good but the potato curry and sambar were tasteless. No salt and it was bland. My husband ordered Mysore bonda. But to his surprise he got a masala vada. When asked, the waiter replied they don't have Mysore bonda so, they gave vada. We returned it as we were expecting Mysore bonda. I did not understand why they have it in their menu. The waiters were friendly. The 2 stars are for them."], ["Richard G.", "I can't speak for you, but everyone once in a while I get a huge craving for Indian food. I hopped on yelp and found this place. I saw a lot of good reviews and figured, I can't miss with this place. Little did I know how wrong I was....In fairness I never tried the food because I was so disgusted with the manner in which we were treated. As my wife, son and I were walking in an employee was holding the door open for what appeared to be an Indian family. After the family in front of us went through, the guy stood there and shut the door in my wife's face. There wasn't any doubt if he had saw us or not because we were directly behind the family going in. The fact he had held the door open for them and watched it shut on my wife and the walked off had me ticked to say the least. I waited until he came back and pointed right at him and let him know how rude he was with an elevated voice.We all left and as we were about to pull off, the owner came out and asked \"What happened?\". I told him and he said the guy was his family and didn't know American culture. It's not about culture jackass, it's about common sense and good manners. Both of these qualities are not to be found at this place. If the owner had apologized by trying to make it right, then I may have given a different review."], ["Saksham B.", "The south Indian food is quite authentic. Being a south indian vegetarian restaurant, the choices of possible dishes to make become limited, and in that they do a good job, but there's only so much you can do with that. And all their north indian/ punjabi cuisine dishes (like paneer makhani) were quite terrible. Service was a little awkward (it seemed the servers were not sure what's going on), and ambience could be better."], ["Sara W.", "I went there at 5pm so there was no buffet.  I ordered the Thali for $18.   The food was really spicy.  The staff is not very well trained in how to serve or present food.The Thali has 8 different curries.  They are all hot !  They don't give you Roti refills !  This is really bad.  After I ate some of the appetizers, it was so carb heavy, I practically went into a coma.  It put me right to sleep.  I could not eat anymore.They don't serve Raita !  They just give you plain yogurt which is a huge rip off.Please improve your food or you guys will quickly go down hill."], ["Vijay K.", "One of the worst ever restaurants I have ever been in North Carolina. No cleanliness and hygiene at all. Above all, the attitude of manager is further more disgusting. Haven't seen such a rude typical Indian mentality manager. For whomever in need of good Indian food, decent ambience, hygiene and courteous behavior from the restaurant staff - KEEP AWAY FROM THIS PLACE. There are several other good restaurants in Morrisville and Cary area which caters to the need and expectations of people. Would honestly never recommend this place to anyone!@ Manager: This is United States of America. This is not India. Keep away your horrible attitude and rude behavior back in your hometown in India. Don't ever try to display them in US. Learn manners and customer relationship first and let your team also know about your rules. Courtesy and manners - are more important than your food."], ["Andrew G.", "Best Indian vegetarian restaurant in the area. I actually visit the Raleigh area from Florida and eat lunch at Udupi each time I am in town, it became a sort of ritual. They offer a dosa included with the buffet. The weekend buffet, and especially on Saturdays, is probably more interesting than during the week. Of course, there are many other similar restaurants in the triangle area, so while it seems to be the best, it is rewarding to experiment and do your own research around."], ["Rod O.", "3.5 Yelp stars or a little moreRecommended by Bhim (in Charlotte) as THE Indian Restaurant for the Triangle turned out Good though Not my favorite even in the Vegetarian Indian in Triangle!  We checked out the Sunday Lunch BuffetDosa with Potato filling was surprisingly Spicy for a Dosa and my LIMITED Dosa Experience!  The Bread Part of the Dosa was Very Good and the Filling was good tooNoodles with Vegetables were Exceptional ! ! !Redder Orange colored Lentils  were better than the Yellow Lentil dishEveryone was avoiding the Pickled Lemon so I thought I should see what it is like.... I'm NOT a fan though glad I tasted it and it is a condiment, though I was eating it as a side Dish!Hot Noodle Pudding and Cold Noodle Pudding for Dessert had very Nice FlavorsSome of the Dishes were as Spicy as \"HOT\" as I want to Enjoy the upper reaches of \"Hot\" though I would NOT say any were even close to \"Indian HOT'' !  I was glad most of the dishes were milder in spiciness with plenty of Flavor!"], ["Iggy P.", "Generally speaking, Indian food is always delicious, but this Indian food is the best in the Triangle!   From the outside, the building appears to be nothing extraordinary, but the flavors of the food are like no other.  The chef is very talented and the food has the right proportions of salt and spices.   Highly recommend the thali to get a sample of many different dishes.Very friendly and accommodating service- this is a place I come back to regularly."], ["Aravind K.", "-too sad, my third visit and I was disappointed with the whole experience -vegetarian Dosa entrees around the table had a weird \"ghee\" smell and tasted bad-the veggie manchurian/fried rice was terrible-too $$$ for the substandard quality. I've been here twice before and was happy with the food, but this ruined it for me totally-music too loud and annoying-please change the stereotypical \"service\" at an indian restaurant"], ["Michael B.", "Came on a work lunch outing. Delicious delicious delicious. Everything was fresh and flavorful.. The rice and beetroot desserts were perfect. There were two or three different types of rice on the buffet (I had the coconut rice which was terrific). If you like spicy, they have the moint chutney as well. Service was marvelous and one of the best Indian restaurants I've been to."], ["Sudhir D.", "Best Indian food in the Triangle, bar none. Dosas were impeccable, uttapam was tasty, and the idli were fluffy and scrumptuous. The rest of the food was excellent as well; flavorful without being salty or oily (heavy). Well done, sirs."], ["Lauren R.", "This place has huge dosai!!!  Definitely traditional South Indian food.  We ordered an appetizer platter to share, and I got a dosai.  It was a huge amount of food--the outer lining of the dosai was perfectly crisp.  However, I felt that the fillings were only in the center--definitely didn't \"fill\" the interior of the surface area--maybe about 1/3 of the dosai \"shell\" didn't have any filling in it whatsoever (I don't know if this is normal, as I've never been to South India, but I feel that the portions were larger at other Triangle South Indian restaurants).  Everything was good--especially the sauces, which were all outstanding.We came on a Thursday night and there was only one other table full in the restaurant.  However, the service was awful--it was slow and there seemed to be communication problems with some of the staff members, which was a big surprise (and has never happened to be at other Triangle Indian restaurants).  (They also do not serve alcohol--at all, FYI).  Dinner definitely took almost 2 hours in a pretty empty restaurant."], ["Brad P.", "I can not say enough good things about the food but not so much the service.  The last time I ate at Udupi we got our appetizer and after 30 minutes maybe an hour we finally decided to leave.  We explained that we wanted to pay for what we had eaten and leave.  It took a good bit of discussion with our waiter(the owner) to explain we were leaving.  By the time we finally got him to agree to let us leave we had become the center of attention of the entire restaurant.  I was more than a little disappointed that he insisted on making such a scene.  Based on what other people who have eaten there have told me getting your food at dinner can be a challenge.  Atmosphere 3 - It is nice enough nothing that memorable either way.Service 1 - Service can be exceptionally slow.  I have only been for dinner but it may be better when they are running the buffet.  In general I have been consistently underwhelmed by the service.Cost 3 - The prices are okay.  I did not feel it was a bad value but it was definitely not a good value to me.Food 4 - I was pleased with the quality of the food.  There food is some of the best South Indian food in Wake county."], ["Christine A.", "Yum times a thousand. Whenever I have to go to Cary I make it a point to stop by (weirdly enough I keep finding reasons to go to Cary). Great vegetarian Indian food!"], ["R W.", "This was my first Indian food experience and it was wonderful. We went for the weekend lunch Buffett. It was easy to tell we didn't know what to do when walking in so one of the staff (owner possibly) was nice enough to show us around and what each dish was.  We really appreciated it. The food was very flavorful!   You know when you walk into an Indian restaurant and it's full of Indian customers it has to be good and authentic. :-)"], ["Ralph S.", "This is not just the best South Indian food available in the triangle, this may be the best restaurant ... Period"], ["Anila Y.", "A true taste of homemade food and a breath of fresh air after 3 days of eating out. I like that they offer a good selection of homestyle and restaurant style--you can get a simple bowl of rasam or even a sizzling plate of manchurian!!I knocked off a star because the food is really spicy, and the manchurian wasn't crispy.The service is slightly pushy, but also extremely friendly. The lunch buffet is really great in terms of variety and flavors. Their daal papdi and chaat spread is really good. They also offer a variety of homestyle subjis (such as cabbage!), the fun stuff like paneer, and also the comfort foods like idli and uthapam. And each lunch buffet purchase comes with a free masala dosa!The place is clean--there is even a faucet (that is not attached to the bathroom) which shows how authenticly Indian this place is!Overall, I was happy with the food, and definitely can't wait to come back when I miss good old home cooked Indian food."], ["Cloud R.", "There was a hair in the bean poryal curry, on a Saturday buffet we went for.Enough said - we are never going to this place again. There were also suspicious charges on the check and the dessert for the day was (once again) rice kheer. Tower offers a much better, cleaner and reasonably priced buffet than this shack and is also more authentic South-Indian, in flavors."], ["Deepthy P.", "Pure vegetarian restaurant with variety number of dishes on sat buffet. We would prefer to visit this place every time we go to cary.Little expensive but it is ruled out with the hospitality and tasty food"], ["Louis V.", "It's really hard for me to write a negative review for a place in which I believe the food is amazing. Udupi Cafe goes over-the-top in not only presentation, but also in portions and food quality. The challenges that I face is with the extremely large language barriers. On both occasions I've visited Udupi I received food that I did not order, yet simple inquired about. I also feel that they heavily push appetizers and I feel uncomfortable if I say no and only want an entree. Lastly, when I ask about certain foods containing allergies the waiters end up recommending food that contains the allergy - I even was served a dish with the allergen I asked not to have.I believe that the people at Udupi have a good heart and they do put love and attention into their food. For me, this is a living example that it doesn't matter how good your product is, if you can't communicate with your customer you will lose the sale. With more than one attempt, I cannot 'chance' this place anymore."], ["Shilpi S.", "We have only always tried Buffet and its a hit with me and my husband always. Perfect South Indian Flavors and price is decent for a good layout of food they have in buffet.The only disappointment is the place is not as clean as a restaurant should be. The decor or ambience dark, old and battered. Makes the place looks sad. The service is good and the staff and owner/manager come around and ask everyone on the food and to take further orders."], ["Shalini S.", "We walked to the restaurant an realized it was closed. Chandra very kindly let us in and offered hot idlis. Incredible service and a very great experience. Thank you!"], ["Liz O.", "I wish this was near my house... or do I? I would never lose weight! I went here when visiting a friend in Cary. I live in Boston, where there are many tasty non-vegetarian and vegetarian Indian restaurants that I have been to, so I did not have particularly high expectations. I WAS WRONG. We went on Sunday of Memorial Day weekend, and the place was full of little kids (so much kiddy noise, but not the restaurant's fault). We got the buffet, and there were these metal trays like old school lunch trays to put the food in. I loved everything - every single thing - on the buffet. I've never had beets or green beans at an Indian restaurant before, and my friend has never willingly eaten a green bean before, but both were delicious. Not only that, but sometimes, Indian dishes start to all taste the same after a while, especially on the buffet. No so here - each dish had its own symphony of flavors. Whole Indian eggplants, paneer, chickpeas, etc, all used smartly. Nothing particularly spicy. The waiter came over and I said, \"this is the best Indian food I've ever eaten\" Then I saw he was holding a plate of dosas. He said, \"Do you want these?\" I almost cried. Then I solemnly nodded my assent. The only thing I would have wanted is a few different desserts. There were three - carrot halwa and two vermicelli dishes that were pretty similar. I loved them all, but there are so many other fabulous Indian desserts I missed. Very good price, too! I can't wait to visit my friend again!"], ["Michelle G.", "Went here for lunch. I was worried because being the hungry a-hole I am, my pops and I arrived about 20 minutes before they closed up shop to prep for the dinner hours. They have a buffet during lunch (normally not a fan of a buffet, hence the 4 stars instead of 5)--both salad and hot grub--and the flavors of each dish was enticing, as one would hope of Southern Indian cuisine. Vegetarians will happily swoon over every option (there's no meat here). I loved the chana masala and generous use of chickpeas, cauliflower, potatoes, rice varieties and soup! Vegans, you'll find plenty here. However, beware of the yogurt used in certain recipes. Just ask someone who works there (coconut milk is great, isn't it?). Walking in so close to closing, I didn't expect friendly service. Quite the contrary; our waiter begged us to have dessert before they closed the buffet and brought me a mango lassi even though we graciously declined the offer. Interior is dark in an appealing way. Ethnic feel. Outdoor seating, yes, but not much. Cheers!"], ["E Alexander G.", "Just had a wonderful lunch at Udupi Cafe, taking advantage of the buffet. If you love South Indian food, then you are in for a treat. Idli (Idlly), Dal, onion pakora, and great Sambal are the stars. A nice dosa with potato and onion was brought as I was eating, a very nice surprise. Everything is vegetarian and spicy, so don't expect anything else and you will be well pleased!"], ["Madhava Krishna M.", "Being an Indian vegetarian family, we went to this restaurant last night. It was a Monday and it is unusual for this restaurant to be open. We had ordered all the basic south Indian food (Idli, Dosa, Ootappam and Vada). To our surprise, we could clearly make it that the chef was a part-timer or gone out of his/her mind. I had never tasted such a horrible food in my entire life. Pathetically, the sambar (soup) was just a mixture of hot water and some all purpose flour with some spices. A serving person (female) had swapped someone's food with mine and later requests me not to inform the manager there. Overall, I have decided not to visit this restaurant unless there is big rush hour. My point here is, that the restaurant people have taken me for a ride just because, it was a Monday and no Indian restaurant is open on a Monday. I have decided that I should not afford $75 for a four person family for this horrible food."], ["Leo J.", "Decent food. Service was awful. Then on the bill where they recommend estimated tips, their computerized calculations were nearly double what they should be. Either shoddy or outright crooked, either way watch out at bill paying time!"], ["Kathi C.", "This place is a \"MUST GO TO\" at least once every two weeks.  I cannot tell you my favorite foods, because I truly like each dish I've tried here.  I've been coming here about 4 years, and I simply think it's the absolute best Indian restaurant in the Triangle region.  I've tried several, and Udupi reigns supreme!  I will continue to come back as often as I can.  LOVE this place....and my waitstaff, Aldin (SP?) helps me figure out how to add which spice to which food.  Great place, give it a try and you cannot go wrong."], ["Taj S.", "Brunch menu has been slipping a little. Some days great selection and other days less than ok. Was a favorite, not anymore."], ["Vinod K.", "This is one of my favorite restaurant in this area. A full fledged  south indian vegetarian restaurant  for vegetarian lovers. Nice ambience and friendly staff. I wan't quite sure if i like this restaurant when i want to try vegetarian so i kept my expectations low but surprisingly i was overwhelmed by the taste of the food. Surely it will meet your expectations. Food is very fresh and delicious. I liked pretty much every item on the buffet menu.  Typical lunch buffet menu that you see in most indian restaurants. i like spinach pakoda,wada,spinach rice,daal makkani,panjabi alu curry etc. After long time i've tasted delicious south indian food."], ["Preethi V.", "I had been here few months back and found the food to be average. The sambar did not have any flavor and it was really bland. Left feeling disappointed. Few days back I though I would give it a try again to see if the food was any better but it was the same as I remembered. We had come here for lunch buffet and the food was really bland. The south Indian spread in the buffet was good. The north Indian spread was nothing to rave about. Overall an average place for Indian food."], ["Sarang J.", "Delicious South Indian food.  I've had South Indian food in India and I have to say this ranks right up there.  Personally I think it's better to go during dinner so you can get the freshest dosa they have instead of the ones made during the buffet.The staff and manager come around personally giving suggestions and quick service.  Overall I had a great experience and I will definitely be going back!"], ["Lesley B.", "I think my favorite food in the world is South Indian.  Vegetarian, spicy, lots of variety. And I just friggin' love anything made with idli batter - idlis, dosas, uttapam. YUM.  The lunch buffet is a dream, though prepare to take a nap afterward.  And the prices are low compared to most other Indian restaurants -- almost all meals under $10."], ["Jaymie M.", "We dropped in for dinner and loved it. We're both omnivores and as a few others mentioned, the meat actually wasn't missed at all. We started with an appetizer sampler that came out with chile and coconut chutney and two other sauces for the pakoras, samosas and vadas. Everything was fresh and piping hot. Great flavors.For our entrees we tried something a little different; a dosai. Like a lot of people, we're more familiar with northern Indian cuisine and some of the southern specialties are new. The Hyderabad Dosai arrived rolled up and hanging considerably off the plate on both sides looking like a crisp, toasted pillow. I had a few bites and my partner devoured the rest saying it hit the spot perfectly. Apparently, most of the other diners thought so, too, as I saw over a dozen served while we were there.I went with the more familiar Palak Paneer, an old stand by. Their version was amazing, creamy and perfect, I've never had better. This was pure comfort food with solidly packed paneer; great texture.On top of the great food, service was friendly and impeccable. Water refills came around constantly and the owner even dropped by some extra lemon rind pickles for me to take home with my leftovers! And with all of that we still spent under $30. Love it!"], ["Shreyas J.", "Authentic south indian food. Great for vegetarians. Its a pure veg restaurant (not very common in US) with lots of variety.Unfortunately, I did not have a good experience regarding service and cleanliness standards. Dosa came almost after finishing my lunch and it was not even hot. Empty food pots that took a very long time to replace. Sambhar and chutney spilled over the counter that no body seemed to care about. It was not even very crowded that day.I would understand if it is  one bad day. But it wasnt. I have been here a couple of times now (2013-2014) and its the same story every time. I hope they improve upon it because they do have tasty food."], ["Mage L.", "Udupi's location is ridiculously tough to find.  First I drove along Chatham thinking it would be right before Chatham Square.  I didn't see it along the way, so we drove all the way through the Chatham Square lot, trying to figure out where it was.  When we got to Maynard  we turned around and headed back towards downtown, still didn't see it.  Then on our final lap (we were just about to settle for another restaurant in Chatham Square) I took a chance and went down a little parking lot driveway at a Pizza restaurant and happened to find it.  Across the street is a used car lot if that helps the next person.We came in the evening, so there was no buffet.  We each ordered a mango lassi, and got the assorted appetizer platter for $7.99.  Included were a vegetable samosa, a vegetable cutlet, vada (lentil donut), mysore bonda (lentil dumpling) and pakora.  I think the pakora was the 2 fried green chilis.   The fried green chilis weren't as spicy as I would have thought, but they weren't as good as some of the other Indian appetizers I've had.  The lentil donut and dumpling were rather plain.  The samosa and vegetable cutlet were the best of the appetizers. For the entree I got the Jaipur paneer dosai and my husband got the butter masala dosai.  When they came out I was amazed by how huge they were, but in reality the \"pancake\" is mostly hollow.  There's just a small area in the middle where they filled it with paneer, peas, and the rest of the filling.  It was very, very good, but messy to eat and we weren't given nearly enough napkins.  I was also turned off when the waiter decided to fill my water glass with the end of the jug directly over my plate, dripping water on my nice, crispy dosai. My husband was very impressed with the size of his butter masala dosai.  It was so huge it went off the plate, and those were big plates.  Again only a small section in the middle was filled, but that's to be expected.The prices here were good for the dosai, only $7.49 for the butter masala and $8.99 for the Jaipur paneer.  But I thought that $3.50 a piece for the mango lassi was a bit much (they're always so small) and $7.99 for the appetizers was also high considering the prices of the entrees.  The food was all very good, and I will definitely be picking up some take-out dosai here in the future.  But I really didn't like the service, and I'd rather not eat in here again."], ["Lynn H.", "I'm glad I didn't listen to the negative reviews when I was looking for an Indian restaurant yesterday.  We went to the lunch buffet and everything was delicious.  This was truly the best South Indian food I have had - complex spicing, layers of flavor.  I will have to try the dinner menu which I'm sure is even better than the buffet. There is virtually no atmosphere so this is no place for a romantic meal.  They have crammed as many tables into a small space as possible which is why I'm giving it 4 stars rather than 5."], ["Srikanth S.", "I loved the south indian food like dose, vade and appetizers. The veg soup was a little too dull and the place was a little cramping. Still I would give a rating of 4 because of the food and definitely recommended place."]], "Blue Mango Indian Cuisine": [["Jesse S.", "Fantastic. I come here for lunch at least once a week. The lunch specials are unbeatable. Indian food is notoriously (relatively) expensive because of the complexity. But for $10 you can get delicious a meal that lasts me for two lunches with rice and naan. Very flavorful, highly recommended! I'm a big fan of the tikki masala. :)"], ["Trent A.", "Lots of msg.Ordered the tiki masala tastes bland and not spicy even at level four.Rice dry, crumbled, tasteless. The worse rice I've had at any Indian rest. Somoasa also dry very little flavor. All plate with three tiny servings.The naan was good.Trader joes frozen Indian food is way better."], ["Suresh B.", "Worst ever Indian food ..If someone really want to try some authentic Indian Cuisine,better avoid this place .Here they add chicken to peas pulov and they will call it as chicken biryani.And don't expect any spicy if you ask for spicy , the cook will add raw chili powder upon biryani and serve you ..Try at Biryani maxx in Cary they are the best in authentic Indian cuisine with taste and quality"], ["Hector S.", "Incredibly slow service, not very friendly staff and bland food. Truly a disappointing experience, for such a great looking place! The garlic naan was the only thing that was tasty."], ["Sue W.", "Nice romantic place  I sat by the bar and the waiter was very helpful and friendly.  The food in my opinion was good but not as good as some other indiian i had been too before.  I ordered the chicken curry.  Ordered it hot but it was mild for me."], ["Shelby B.", "Can't speak to the food, atmosphere, etc because i can't even get them to confirm a reservation.  I guess they're so good, so busy, so whatever that a patron wanting to book a dinner party for 25 people isn't something the manager or general manager are interested in doing. I've called and emailed no short of 10 times to try and book my holiday party to no avail.  Guess I'll take my business to 42nd St Oyster Bar."], ["Reggie S.", "I enjoy ethnic cuisine. Indian is one of our family favs. My daughter goes here with friends often and we thought let's take her to lunch. We arrived at noon on a Monday and we were THE ONLY folks there. Rather odd but we figured people will come. Our waiter had some suggested favorites and we had our own ideas as well. We ordered chili chicken as an appetizer, it never showed but the chef made it up to us with a sweet cake containing cherry, sugar, coconut & naan. (Pretty tasty even for on the house)The lunch menu had a goat biryani so I had to get it. The 3 spice was moderate (one sniffle on heat meter) in future I'll try a 4 spice (1-5, 5 being HOTTEST). Wife got the chicken tikka masala & daughter was talked into a chicken dish instead of the veggie dish she wanted. The naan was plentiful as was the bismati rice. The meals all came in bowls were trendy & high on one side. All meals were delicious and left us planning to return. For an Indian dining establishment they score HIGH for ambiance."], ["Bob C.", "Hadn't had Indian food in a while so wandered in while on a business trip. Not a huge menu but all your basic Indian delights. We had shrimp and vegetarian samosas for starters along with a limp draft Kingfisher. Food was very tasty. On to mains. I had the National Dish of Scotland (it's true!) Chicken Tikka Masala. Huge portions, about 2x what you typically get for the same price. Everything is spiced to order and my colleague and I both ordered 4 on their 1-5 scale. Very tasty but a little hot for my Irish American \"boil til gray\" heritage. I'd definitely go there again."], ["Michael M.", "excellent frozen custard... this is a must try place and i suggest getting the carolina concrete style."], ["Laura M.", "Amazing food and even better service!! Had such a great time here. Loved the family atmosphere amongst the staff :)"], ["Javier L.", "I seriously love this place. I think it's the reason why I took the job on Glenwood. Blue Mango over delivers during Lunch. The salad is a generous portion. By the time you get to your lunch, it's time for a doggie bag. Then you can relive the awesomeness the next day. Please visit this restaurant often. I want it to be here forever."], ["Chris A.", "Roaches in the women's bathroom.  Food was very bland with little spices. The curry almost seemed tomato based. Over priced.  Should have known when it was 70% empty on a Saturday night at 8 pm, that I should have eaten some where else."], ["Amanda D.", "Super good!!  Went with two girlfriends to dinner last week.  We had the chicken curry, vindaloo and the tiki masala.  Started out with the smosas for an appetizer (also the thin fried bread).. It was all fantastic.  Can't wait to go back.  I thought the food was fresh, reasonably priced and the wait staff was also helpful."], ["Denver V.", "Blue Mango makes me weak in the knees. The hostess is sweet and service is great.I highly recommend the regular naan and any of the vegetable dishes (spice level 5...if you dare!)The bar is funky simple and an enjoyable place to sit.We always enjoy a visit, even when we order to go and bring it home!"], ["Adam B.", "Very enjoyable Indian food in the heart of the Glenwood South district. There is (pay) garage parking immediately behind the restaurant if all the street spots are taken. The décor has a modern wood sort of high-end Pier One feel with pops of jewel tones, so it doesn't feel especially traditionally Indian, but no matter. The menu is pretty large so anyone should be able to find something to suit them. The spicy tomato soup is a winner, with some real heat behind it and some yogurt mixed in the give it some creaminess. Even with the considerable spiciness, the primary flavor is still the freshness of the tomatoes coming through. I also had the tandoori lamb with roasted vegetables and potatoes in an mango-ginger sauce. The dish was very successful, especially since the roasted bell peppers, carrots, zucchini and onion still had some crispness. Their garlic naan is just average--didn't get the rich garlic taste I've had at other local Indian places. The cocktails were well-made and the service was fine. It's upscale but still reasonably priced and the portions are substantial. I'd go back, as there were several other things on the menu that looked intriguing that I'd like to try."], ["Cartez B.", "Food was great and but service was horrible. The manager was taking shots while we waited 30 minutes to receive our drinks. The place had a nice section for drinks but didn't have several of the right liquors or wine in stock. When I ask y is the bartender taking shots and we have received our drinks, the waiter stated that was manager. I spoke with manager and he said he would make drinks right away but then came back and said they didn't have the liquor to make drink in stock. Very frustrating but the food tasted great after we receive it. The place needs new management. My waiter was very apologetic since he was new to the restaurant."], ["Stacy R.", "My friend and I have been meeting here for dinner around once a month and we love it. The garlic naan is delicious and the chicken tikka masala is always on point (spice level 4!) We did encounter some of the service issues when we first started going there but it has improved A LOT and we've been satisfied with the service. The chef always comes out to see us and bring us a little treat. He brought us peshawari naan and it was so warm and delicious. Last time it was blackberry ice cream with passion fruit. I know zero about \"genuine\" Indian food so if you're a serious connoisseur please don't use my review as your decision tool! I just know I love the place - the ambiance and the food!"], ["Shreyas J.", "It is one of the few fine dine-upscale Indian restaurants in the area.Great location and pleasant ambiance. Full bar with big screen TVs and some nice music in the background. Tables are not cramped in on each other so you get a good feel of privacy while eating and chatting. No room to complain about cleanliness or service. Unfortunately, the list of good things probably ends here.The food quality is going down day by day. For some reason, food service is extremely fast and many times food is not properly cooked, spices are not mixed well. Been here a couple of times now but the food experience did not improve. If you really crave for good indian food, you better ignore this place."], ["Rick D.", "Great atmosphere, chef and spices within our dishes. Chef even taught the wife how to make naan in the kitchen."], ["Ricardo C.", "We stopped in early last night to celebrate a belated anniversary supper. The food and service was still as good as it was expected. We were the only diners at 730 which was odd so Steve the bartender who although fatally hip and terminally cool took excellent care of us.  The last time we dined here we also arrived early but I had noted that by the time we had left the place was packed, that wasn't the case today. By the time we left at 930 there was only one other party there.We started with the chili paneer which is homemade cheese sautéed in a fresh tomato & chili glaze and it was amazing. We could have eaten four plates!Then we ordered another appetizer called  papad with house condiments which is  spiced crisp lentil wafers served with house tamarind & mint chutneys  and it was equally amazing. I wish I had some of those now for lunch!For our mains we had masaledar allo gobhi which is cauliflower & potatoes sautéed with spices and shakahari vyanjan  assorted vegetable entrees: kofta, chana masala & palak.Blue Mango has a 1 through 5 spice rating. We both like spice, me more than my bride but we both ordered a 3. The mains were so spicy that we simply couldn't enjoy it. Steve brought a cucumber yogurt sauce to try to allay the heat but even that didn't suffice. He did offer to have the meals remade, but that was only when we had had enough. Had he checked in on us after bringing the mains we may have taken him up on it. We still call this a favorite place and the food quality is still very high, we would recommend to order your spice a little lighter just to be sure and don't be afraid to speak up if its too hot"], ["Ruben L.", "A tastefully decorated restaurant serving very mediocre Indian food. It is not that the spice level has been toned down to cater to local taste buds, but rather that the spices in this kitchen don't seem to come together in those subtle and distinct flavors that form the essence of Indian cuisine. Easily forgettable."], ["Joe C.", "We went to the Blue Mango for our Anniversary dinner , the food was very good and the service was excellent."], ["Chip E.", "Food was pretty good.  The service was absolutely terrible from the moment I walked in to the time I left.  We joked around saying all of the waiters including bartenders, it must me their first day working.  Really bad service, really bad. I hope they fix it as the food was pretty good and the location is good."], ["Katie H.", "I've wanted to try Blue Mango for quite a while now, and on Saturday I got my wish!We went early to beat the weekend crowd. Maybe too early--there weren't more than 2 other occupied tables in the whole place. But who can complain about prime seating and plenty of attention from the servers?I had a perfect mango lassi and the lamb pasanda with a side of naan. As some other Yelpers have mentioned, their entrees are on the expensive side. But, this did end up being two meals for me--and the lamb and its sauce were both fantastic, and everything we ordered came out VERY promptly.I was very happy with the service. You can customize the level of spice on your dish. Mine was great (I'm a spice wimp and ordered a white-people 2); my boyfriend ordered a 4. When he got the 4 (a white-people 4, again), it wasn't quite as spicy as he'd have liked, and the server immediately took it back and ramped it up a notch. Later, the chef came out and asked us if we wanted more rice--it was about half empty. \"Just a little bit?\" he asked. We agreed. Our rice came back out fried with veggies and a spice--probably turmeric, but I'm notoriously bad at guessing those things--at no extra charge! I guess it pays to go when they're not busy.Although it's just a little too expensive for me to go all the time, I will absolutely be back to Blue Mango for more delicious food!"], ["Natasha K.", "The chef here makes the experience.  He came out more than once to make sure our family was comfortable.  He even made some custom dishes based on the concerns of some people at our table that are new to Indian cuisine.  We brought 3 young children and he put on quite the show for them to watch at the window to the kitchen.The food was also excellent.  Hot, authentic, and delicious.  Wine prices were reasonable, as well.The service, generally, was good.  We had a few hiccups, but it is because the server had only been working a few days.  The chef himself handled anything the server lacked and we had a great experience!"], ["K T.", "The chef is amazing! Fell in love with the shahi paneer and the pieces of ginger really make the dish. The garlic naan is delicious and you can see them making it, if you sit close to the kitchen. They also have sparking wine by the glass. Staff is always super friendly-- my favorite Indian place in downtown Raleigh!"], ["David B.", "Blue Mango was quite good.  The service is good, but not as good as they want you to think it is.  Our waiter had a certain pretentious quality to him, as did the server at the next table over.  This isn't fine dining.I ordered the Curry Chicken and my date got lamb.  They both were very good.  I wish that my Curry had a bit more heat, and I ordered it on the next to top heat level.  Usually when a place has so many levels, I'm perfect at one from the top and can still taste the food, but not here.One thing I really liked was the ability to see in the kitchen at eye level.  We saw the ingredients going into our food.  We also saw a hispanic fellow making our Naan bread.  I love when a place makes this fresh, and theirs was good, but not amazing.  Problem was, it was too thin, almost like tortillas.  I believe with proper training on thickness, this could be perfect.  Mantra has better Naan at this point.I believe you could compare this place to Mantra.  Both are good food, rather overpriced, and somewhat odd settings.  While this restaurant felt a bit more believable as an Indian restaurant, I don't need fancy fixtures.  Just great food.  That's the most important sustaining factor for a restaurant."], ["Kimberly A.", "If I could give no stars, I would. Worst service I have experienced in a long time. To be fair, it was Valentines Day and I get that they were very busy. However, I had called and specifically made a reservation for 7:30. They told me they had a table and took my reservation. When my date and I arrived, there was already at least six other couples and a crowd of people standing along the back wall looking confused. I tried to flag the hostess and tell her our reservation name, but before I could get a word out she told me \"10 minutes.\" She promptly fled the scene and continued ignoring the crowd of people waiting in the front. Finally, after repeated attempts to tell her we had a reservation, my date glanced at the reservation list to find we were not on it after all.  It appeared that they had been telling people they had a reservation just to get more couples in the door to make money. We took a seat at the bar, at which point we got the same service from the bartender. It took us forever to get our drinks, and about an hour just to get an appetizer. 8:30 comes around, we have not been seated, and we are beginning to doubt we ever will. The problem is not just that they were late getting us seated. I was willing to be patient. But the entire staff in the restaurant was rude and inattentive. When I finally addressed the issue with what I assume was the manager, he again told me \"15 minutes.\"  I really can not adequately describe how we were treated, and how it appeared everyone else waiting was treated as well.  What is really unfortunate is I have eaten here before and found the food to be pretty good. But with the horrible service, I will never be returning.  They do not deserve my business.  We left, walked down the street to the Rockford (a little hidden, it has a yellow door), and had a wonderful evening. Advice: don't go. I would suggest Mantra or really anywhere else."], ["Aisha H.", "Somehow I had the name of this place in my head and wanted to try it out. Made reservations via open table and had zero wait when we arrived (just how I like it!). It was a saturday night and oddly enough, it wasn't very crowded. The food is honestly not that bad, the salad seemed super fresh, and the food didn't seem as pre-prepared feeling as some other Indian restaurants. The service, however, wasn't that great. It wasn't particularly so bad that I can pinpoint any one thing that I didn't like, but it certainly did not make me feel like, as a diner, that I was all that important (especially considering the small crowd). Everything from filling the water glasses to setting the food on the table just seemed like an afterthought. We are very nice diners so we always say thank you, etc., as we go along, but we got zero response from our waiter. We still left a nice tip because that's the kind of people we are, but it honestly wasn't deserved."], ["Travis L.", "So far this is one of, if not my favorite Indian restaurant in Raleigh.  The atmosphere is trendy and dim lit, and the staff is very friendly.  I always get the Chili Paneer, which is one of the best paneer dishes I have ever had.  Not dry and spongy like some.  Chicken, lamb, breads, everything is great.  Glad it is close downtown, and only wish they would have a lunch buffet."], ["Liz W.", "I would really like to be able to give this place more than two stars. If I was writing this review purely based on the flavor of the food, or on the decor/ambiance of the restaurant, it would definitely be higher. But there were a few factors that are preventing me from doing that.So let's start off with the good stuff. First off, the decor. It's so colorful and fun! You can tell a lot of thought went into the design process. I loved the lighted colorblocked wall above the bar, and also the giant glass wall that opens up a view to the kitchen.Also, the food was delicious. We got the chicken jhalfrezi with a side of garlic naan for our main course. And for dessert, we got a sampler platter which had gulab jamen, some kind of fruit ice cream, and an apple dessert. The jhalfrazi was delicious and perfectly seasonsed, and the naan was perfect. Crispy, buttery and garlicky...I could've eaten a couple of baskets of just the bread by itself!So what's the problem? First off, the price-to-portion-size ratio is WAY off, in my opinion. I'm used to the portions at Indian restaurants being generous, and usually one entree is the perfect amount to split between two people. Upon seeing that the average price for a chicken entree was in the $17-$20 range, we asked the server if he thought we could split one between the two of us. He said yes, with the addition of the rice and a side of naan, it would be fine. When the food arrived, we were shocked at how little of it there was. It was served in a fairly large dish, but it was mostly full of sauce, and had very few chunks of chicken in it. The naan, which costs something around four dollars, was four small triangles in a tiny basket. And what's more, we were only brought one medium-sized dish of rice FOR THE TABLE. Our friends, who also ordered an entree to split, had to share the rice with us, and it was barely enough for four people. We all left hungry.In my opinion, a basic chicken entree with some spices thrown on it shouldn't cost $20 to begin with, but if it does I at least want it to be a decent-sized portion of food. Maybe I'm just not bourgeois enough to be able to appreciate spending a lot of money for a tiny amount of food. I mean unless it's at a super swanky place for a special occasion. But in my opinion, Blue Mango wasn't quite swanky enough to be able to pull that off.Then there was the issue of the service. I felt really bad for our server, because it seemed like he was trying, and he was genuinely sorry for the mistakes, but so many things went wrong with our meal. My husband ordered a drink, which never arrived. They brought us out the chicken tikka masala instead of the chicken jhalfrezi at first, and we had to wait for it to be fixed. Our friends ordered a dessert at the same time we did, but it never arrived, then they were still charged for it on the bill.Anyway, I think with a few tweaks Blue Mango could be great, but it isn't quite there yet."], ["Anna S.", "The food was good, but too hot. I asked for a 2 and got something like a 4 (they do spiciness on a 1 - 5 scale). I eat Indian food often, so I know how spicy it can get. Also, the prices are a bit steep for the quality and serving size.Update: The same thing happened to me on visit #2. You can bet I won't be returning!"], ["Koreanita X.", "I am starting to lose faith in these Yelp reviews. This was the worst indian food I've ever had. I gave it two stars because the chili chicken appetizer was good and well spiced and my apricot chicken was fair. My boyfriend's vindaloo lamb, however, was very bland and had only 3 pieces of lamb. The chef even came by our table to ask how everything was and we kindly said that the dish had pretty much no spice. He apologized and took it back - I think all he did was add more salt, heat it, and replate it.Since there are so many other better places, I will very unlikely be coming back here."], ["Tushar G.", "Food is not too good. Its below average. I ordered shahi paneer and it was full of tomatoes, had to pick them out of the curry. Ambience is good but they forgot about the food quality."], ["M S.", "Celebrated my birthday here and was treated like royalty! Our enlarged reservation change request was met by a sincere and very sweet receptionist. All of the food recommendations were delicious. This place is well suited for vegetarians with an entire menu section devoted to meatless and vegan entrees. The decor is modern and the kitchen cooks within view of all diners behind a bay window! We will definitely return soon!Great food , excellent service , awesome staff"], ["Nikki C.", "Great atmosphere, courteous wait staff, and excellent Indian cuisine!  If you like salmon, you will love their Tawa Macchi Masala!!!"], ["Ames E.", "Whatever their intentions, Blue Mango is not really doing it well. Marketed and priced as fine dining, this Indian cuisine was mostly \"meh\" as this 2-star rating implies. The space is sparkling and new--where all the details were thought through.  Sadly, the food lacks that thoughtfulness.  It was not only not presented well but just not that good. (Particularly given the price tag!)Be prepared to pay a lot and walk away wondering why you chose this restaurant over many others."], ["Angela L.", "Best chicken tikka ever! Excellent service, delicious naan, great drinks, and dessert was great. Great price and wonderful ambience."], ["Ben A.", "Went there yesterday with a friend who is a big time Indian food fan. He eats it all the time, and has been to India nearly 30 times. I being a Indian food newbie loved it, and so did my friend.The space is beautiful, sparkling and new. Subtle lighting, yet still a lot of color.Bit of a slow night, so the owner/chef cae over and chatted with us briefly. Very nice guy. Even gave us a small appetizer.We ordered a lot of food, and it was all delicious. Definitely going back."], ["Chris N.", "I've only recently gotten into Indian food, but I've now been to Blue Mango ten times in the past two months. It is some of the best food in Raleigh (of any variety). The atmosphere is fantastic, the staff gets to know you quickly, and I've not taken a friend or client there that has been disappointed. If you're not familiar with Indian food or are scared of the spice, the staff can help you through it.  And practically any dish can be made with no or lots of spice. I don't understand the reviews about small portions unless you're just a huge eater. Between the appetizers, the rice, the naan, and what Iconsider an appropriate portion, I've always left satisfied. One trick (at least this happened to me while eating at the bar - Brandon was bartender/server), yes, the have a 1 - 5 spice scale, but I order mine \"Indian hot.\". I like very spicy food, and this pushes my limits - a good thing. I tried Mantra the other night and was very disappointed. It was more expensive, they were understaffed, and the atmosphere isn't even in the same league. I won't be back there. Favorite Blue Mango dish: chicken vindaloo, Indian hot (or whatever Viki recommends - it's always good)."]], "Cilantro Indian Cafe": [], "Zayka Indian Cuisine": [["Shruti D.", "Food is good....We asked for medium spice and had none but the flavor was there. Our service was slow even though there was not many people in there. They have free apps from 5-7pm everyday."], ["Tricia A.", "This is some of the best Indian food in the Triangle for dinner. Try the Ginger Chicken, the Butter Chicken ... everything I have tried has been really good.Avoid the lunch buffet - it's not very good."], ["Andrew R.", "I dropped in for the lunch buffet on a Sunday.  It was 2:30 in the afternoon before my craving for Indian got the better of me and I headed over to try out this place.  Since they're only open till 3, I was catching the end of a buffet that had been out since 12 so I was a bit worried about quality. It was just me so ended up sitting at the bar, which was fine, they had the TV on CNN so I had something to keep me occupied.  In general the inside of this place is OK, it's nothing really special.Their food was quite good considering when I showed up, the Naan was very fresh but showed up when my plate was almost empty.  Now I've gone to plenty of Indian buffets around this area and they generally are about 9 bucks or less - they charged me 12.99 for the weekend buffet which was way over priced in my opinion. According to their site the week day buffet is 9.99, which again to me is over priced.Since the food was not horrible, I might go back, not a go-to place, however."], ["Lindsay S.", "Never one to shy away from trying a new kind of food or a new place last night I suddenly had the urge to venture to Zayka since someone had told me about it.  I've probably had Indian food once so I felt I was going somewhere where I could get a very authentic sophisticated taste.  I hoped I was right, especially since I was going all the way to the back of Brier Creek.  I was greeted and treated well from start to finish in my first foray into elegant, sophisticated, real Indian food.  The name \"Zayka\" means flavors. Zayka seeks to put their emphasis on sophistication and creativity in both their look and Indian cuisine and they do a good job.  The inside of the restaurant is contemporary with its booths and free standing tables, but the tables have glass tops with white table clothes and dark red cloth napkins.  The area around you has a royal look which provides comfort and calm.  The menu incorporates both traditional classic favorites and original new dishes that apply east-Asian flavors with a western twist.  The owners of Zayka want you to experience authentic Indian cuisines from the colorful and traditional land of India.  I know this to be true because the owner paid my table a visit on more than one occasion and told us about his \"side project\" and we were astounded that this was just his \"side project\" because it was a lot nicer than many restaurants that people focus their whole career on.  Their Indian food has taken the delicate art of blending spices and honed it quite well.  My friend got a lamb tandoori sizzler special, but I can't remember the name.  I got Chicken Tikka Masala which is barbecued cubes of chicken cooked with tomatoes, onions and yogurt.  They call it one of their all time favorites.  My other friend also got a chicken dish, but I don't recall the name of that one either.  We shared two orders of Naan, leavened white flour bread baked in a clay oven, with which to dip in our food.  The owner told us that the messier you get the better.  We tried, but eventually we resorted to our utensils because even the rice was wonderful and we wanted all of it.  We freely tried each other's dishes, and I can honestly say that couldn't taste a huge difference between the sauces of the three.  They were similar sauces and we all got \"medium\" spice though.  I want to go back and try more though.  I'm just not exposed to Indian food enough.  The chicken dishes were $16.95 each and my friend's lamb dish was $17.95.  Though it's a little pricey for me, the price was worth it for the quality we received.  I chose to try the Kingfisher Indian beer.  I got a 12 oz. glass and it tasted so good.  I don't even know how to describe it except that it was killer, such a pure good beery taste.  That doesn't even compare to the Flying Horse \"Old Monk\" beer that the owner convinced us to try since we were all about trying the \"real stuff.\"  It had 8% alcohol content and was in a huge bottle so big the 3 of us shared it.  I could certainly taste that 8% too!  To close out the night, we had to try a real Indian dessert.  After the owner described them to us we went with Gulab Jamun, which is made of reduced milk balls served in rose flavored sugar syrup and cardamom.  I'd never had anything like it!  It looked like a small plum that would be juicy once you punctured it, but instead it was soft and floury.  I'd never tasted anything like it.  This hot rich sweet sauce and a doughy mixture.  It was good though, that Gulab Jamun was.  Zayka, you were full of flavor in so many ways other than just the food..."], ["Hans B.", "This place never disappoints.  When I want comfort food this is where I go.  When I want fancy food this is where I go.  When I want spicy food this is where I go.  When I want a ton of food this is where I go for the weekday, or weekend, buffet.  Plus, the prices are great and the staff is so attentive, and friendly, that you can't go wrong."], ["Matrix M.", "Had dinner with colleagues. Having tried and disappointed by many Indian restaurants in NJ, I was not expecting much here but this was a pleasant surprise. The bread basket was very good. The mutton and okra dishes were excellent. The ambience is good though the music is a bit loud."], ["Kim A.", "I'm in walking distance of this restaurant and was excited to see the \"coming soon\" signs in late 2009.  But knowing sometimes a new restaurant needs to have a while to work out the kinks, I waited until mid-March to give dinner a try with a small group of friends (6 in our party).  I think I'll wait a couple more months before going back - there were quite a few \"kinks\" the night our group attended.  However, I will concur with the comment about the fresh naan - it was quite good, as were the other entrees that were available... and thus begins the \"kinky\" part of the night.Made a reservation for six - no problem, even for 7 pm on a Friday night.  There were probably only five other seated tables when we arrived.  The hostess seated our group and then when one person tried to order one of the speciality cocktails, we were informed the cocktails on the menu weren't available, just beer or wine (we could see bottles of liquor on the bar shelves, so why cocktails weren't available was a puzzle).  The menu is extensive and is hard to read in the low lighting (again, I concur with another comment here).  At least three from our group had to select alternate entrees or dessert because for some reason those menu items weren't available (perhaps a delivery was missed earlier in the week?  Don't know).  But the food we did eventually get was quite good.Maybe again, it was just our luck but we seemed to have several different wait staff taking orders and when the final bill arrived it wasn't correct.  However, to management's credit, they did work with us and apologized and  we got it all straight.  Service was a bit chaotic, somewhat slow, but never rude.I probably will go back, just to see if the kinks are worked out, eventually.   On a positive note, I hear that the lunch buffet does a great business, and one wouldn't experience many of the issues we encountered at dinner.  So if you enjoy flavorful Indian food, try the weekday lunch buffet."], ["Lauren R.", "Things we love about Zayka:- The naan was so fresh and awesome and amazing.- The curry was delish and perfectly seasoned.Things that weren't great.- The menus are RED with WHITE TEXT and the font is small. The lighting is bad. Do you want me to order or run to Walgreens for some reading glasses?- The food took forever to arrive.- The lamb tikka was a little dry.Interesting to note: my husband ordered a mango lassi and the serving size was HUGE. It was a ginormous drink.We would go back just for the naan. So good in my belly."], ["Aniket G.", "Very nice food. This is one of the best buffets I have had in the RTP area.  One down side is that they take lot of time to get you the Naan. That's annoying at times.Overall Great Indian food"], ["Chander G.", "Went to Zayka with my wife and daughter on a recent Friday evening.  This place is a new indian restaraunt in the Briar Creek area (near Earth Fare).  Here are my impressions:- They have a pretty decent sized menu, but it woefully overpriced.  Lots of vegetarian dishes for $14, much more than nearby Azitra or (not so nearby) Saffron.  Either way, they're the most expensive Indian restaurant in the area.Started out with the mixed appetizer platter.  Maybe we are spoiled because of the great indian nearby, but we were all disappointed with the food.  The chicken was dry and not very flavorful (Tandoori), the seekh kabob was dry (too long in the tandoor?) and the rest of it middle-of-the-road.We ordered the Paneer Makhni, it was very tomato-ey and tasted like they added sugar to it.  Not great by any stretch, and definitely not worth the $14 we paid or it.  We had an aloo (potato) dish as well, also in a tomato gravy.  It was not very exciting.There are lots of staff in the restaraunt (including one guy wearing jeans and a ball cap?!), but the service is pretty slow nonetheless.I think they'll do good with their $9.99 buffet (especially since nearby Azitra does not have one and there aren't any nearby alternatives), but I'd avoid the place for dinner."], ["Em D.", "So, admittedly this was my first foray into Indian food. I was, however, accompanied by my dear friend who happens to be Indian & knows the cuisine.My first visit was for dinner & we decided to order several dishes to share. First up, Samosa Chat. I have to say this vegetarian dish was my favorite of all we tasted - perfectly spiced and positively mouthwatering. The Chicken Tikka Masala was solid, great flavor and again perfectly spiced. Our last dish was the Vegetable Jalfrezi. It was good but tasted like stir-fried vegetables from the local Chinese take-out, without the Chinese take-out price. Yes, if you eat here for dinner, be prepared to pay. I should mention that the fresh naan alone is worth the price of admission. For dessert, we tried the Gulab Jamun... syrup-coated balls of milk with a hint of rose. Not my type of dessert personally, but good for what it was. In all it was a great, if pricey, meal.Earlier this week I returned to try the lunch buffet. For only $9.99, it's quite affordable (and popular with the RTP crowd, as evidenced by the many groups we saw file in). The buffet had a large variety of dishes available. I enjoyed the Chicken Tikka Masala again and tasted a couple of Dal dishes, both which were excellent. The only item I disliked was the Tandoori Chicken which was very dry. Gulab Jamun were available for those who wanted dessert (I passed), and each table was given a basket of fresh naan with the meal.Having arrived before most of the lunch rush, I'm not sure how frequently the buffet is refreshed, but everything was fully available when we went through the line. They do close in the middle of the day between lunch & dinner servings, so be sure to check their hours before showing up.Service was fine on both visits, not overly talkative but available when needed. I'll definitely be visiting Zayka again & recommend you do too, especially for lunch!"], ["Ethan R.", "As someone who only gets to eat Indian a couple times a year, I enjoyed the weekday buffet very much. Good variety & quality. I'll be back"], ["Anil S.", "Tried Zayka today.  The quality wasn't that great.  Chicken Tikka masala had chicken not properly marinated.  Fish curry probably was made with very old fish, so had a bad smell.  The tandoori chicken was very dry and tasteless.  Will not go again."], ["Sanjay G.", "Ok so they aren't quite children friendly. There is no separate children's menu. Secondly the bathrooms don't have a diaper changing station. That sucks as you have place your baby on the ground to change diaper. I wish there was some North Carolina law requiring bathrooms to be equipped with diaper station. Previous review:These guys were customer friendly when they opened new. We were 4 adults and 1 child (total 5), they have a policy of adding 18% gratuity when 6 or more people in the party. They still added a $12 gratuity. When asked.. the guy said sheepishly.. I can remove it. I asked to go ahead and remove it. Watch your checks.. these guys have entered the cheating territory now. I also asked for water and they didn't bring it and I asked again and then only I got it."], ["Farnoosh B.", "Meh, I've experienced better---  that says it all. I think many other Indian places have much better food and the pricing is a bit on the high side for the entrees here. They also do not have a liquor license; my friend tried to order a drink but to no avail. The chickpeas dish was so-so. I think the service is ok, the ambiance is eh, nothing special, the music was good and the overall restaurant was very quiet on a Friday night. I probably won't go back."], ["Rambo S.", "we've eaten here twice in one week. my husband and i are not quite sure why this place doesn't ALWAYS get rated 5 stars. it is HANDS DOWN THE.BEST.INDIAN.FOOD. we have EVER eaten in our lives. it has consistently been delicious. the GARLIC NAAN is to die for, as well. the wait staff is ultra-friendly. seriously, this place is undeniably the best Indian restaurant in the Raleigh area. can't WAIT to go back!!! p.s. the bathrooms are ultra-clean, as well. run, don't walk, to Zayka!"], ["V K.", "By far the better Indian restaurant in the Brier Creeks Mall/RTP area. Their lunch buffet has a good variety and the food is delicious. You won't go wrong with this place!"], ["Erin W.", "Pretty decent indian food. Buffet during lunch is always fresh & great for someone who can't make a decision. I haven't had a bad meal yet & like that they bring you naan bread. You don't have to special order the bread. A little pricy, but weekday lunch buffet is the best price."], ["Pebbles W.", "Excellent food! We always love their buffet as the include more dishes than just the standard Indian buffet fare. The food is well spiced and always delicious. Yum!!!"], ["Michael L.", "Good food. Service could be better. They were a little overwhelmed. Slow service on a slow night."]], "Around the World Market": [], "Tibetan Restaurant": [["Harsha Vardhan Reddy M.", "Very nice food. Don't miss the momo, hot and sour soup, fried rice.A Stop for all spice lovers."], ["Matt G.", "I'm very happy to be living in an area where I can find such unusual cuisines as Tibetan food. It is a bit like a diner inside. Nice and colorful and very spacious. The prices are cheap and you get a good amount of food for your money. But, we expected more flavor. I had the lamb rice, but wished it was more spicy. The momos are actually better next door and taste fresher. The pastry dish, like a samosa but shaped like a moon, pretty much had the same filling as the momos. The sauces tasted the same, I am not sure though if that was because I requested a sauce that did not have nuts in it. Not super satisfied with the favors, a bit bland, but willing to come back and try other dishes.Also would have been nice with some music playing in the background, instead of a game show playing on the tv in the corner..."], ["Dwayne S.", "Very good food. So happy they are open!Veg mom's and chicken lollipops are awesome."], ["Steve W.", "We stopped here for second dinner, so we just had the PAN FRIED MOMO (1/2 chicken and 1/2 lamb).  Not sure if they got our order wrong, or the chicken and lamb are indistinguishable; but nevertheless they were awesome.We will have to come back for first dinner to try some of the entrees."], ["Namit S.", "This was a real surprise! The restaurant is basically an Indo-Chinese cuisine. The service was excellent and really homely. We were a group of six people and we ordered a bunch of food and everything was really tasty. The Chilly Paneer was extremely soft and delicious. I definitely recommend it. We also had the fried veg momos which were awesome too. I also recommend the Chilly garlic fried rice, the chicken schezwan noodles and the Tom Yum soup.Definitely try this place if you like Indo Chinese. Even if you don't you'll still love the food here."], ["Nakul C.", "Very good service. Ordered veg momo, veg zidron noodles, chilli garlic noodles, spring rolls, schwezan potatoes and everything was just awesome. They gave Paneer chilli as complementary, which was extraordinary .I would recommend this restaurant anyday"], ["Sandy N.", "The Drums of Heaven aka Chicken Lollipops is all you need! Ask for some extra chili on the side for a savory, fragrant goodness you will never forget. If you go on some nights, the owner will even play a short ditty on his string instrument hung on the wall. The Mango Lassi is a bit thin, but has lots of flavor! The Jasha Khatsa and Zidron Chicken are great if you are on the hungrier side!"], ["Mack M.", "This restaurant is become my favorite place since 3 months..I tried almost all items from their menu..all the foods r very delicious..don't forget to try these items on appetizer chicken lollipop,chilly paneer dry,Szechuan potato and entree swechwan noodles..chilli garlic noodle,swechwan fry rice,chilli garlic fry rice,momo,chili chicken,swechwan chicken,sha baklap,chilli fried lamb etc..these I can recommended to try..I always try find something to complain but they never give me chance to complain..great service n unique decorations in the restaurant..absolutely keep going back!!!"], ["Ranjay J.", "We tried out this place recently as we mourned the death of our favourite restaurant next door, Himalayan Nepali Cuisine.The food here was really average at best.  Not bad, but not great either.  It's that limbo in the middle where you're full, can't really complain, but are not truly satisfied either.-The momos were decent, but we've had better at the old Himalayan Nepali-The Szechuan chicken was not bad.  Wasn't particularly spicy, but had a nice flavour.-Chilli paneer was decent too.  Very similar taste profile to the Szechuan chicken.-Spicy garlic fried rice was a disappointment.  It looked really appetizing, but was very bland.Don't really get the stellar reviews here...our experience was just 'meh' at best."], ["Shilpi S.", "Me and my husband we both love dumplings and this is the only place I can recommend in the area.  We drive far and wide do seek dumplings for dinner. But this place is our regular take out spot when we want to stay in and get some indo chinese goodness. We haven't tried anything else on the menu so I will not be able to vouch for it but the place looks popular during lunch hours and staff is very friendly is what i observed in whatever little time I spent getting a take out. Word of caution if you are ordering veg moms they are not your usual cabbage and carrots filling be ready to find potatoes inside. Its not bad but takes you by surprise. I would recommend chicken moms they are consistently good. All in all I am giving this place 3 stars only since I have tried one dish here and its consistently good."], ["Kelly M.", "Decided to try out some Tibetan/Himalayan food for takeout on a weeknight, so this is only about the food, not the restaurant/service. We ordered Zidron chicken (because of the pictures on yelp!), beef momos, \"Drums of Heaven\" (chicken lollipops), and chili garlic rice. Everything was really good! My favorites were the momos and the zidron chicken - chicken in a Szechwan sauce. We ordered everything medium spicy, and it was perfect. The spiciest thing was the sauce that came with the momos. Everything was fresh, delicious and fast - perfect for takeout."], ["Sushiblues S.", "What a great find!  Went with a group of 6 for a Friday night dinner and everyone seemed to really enjoy their selections!  We shared some plates as appetizers - the steamed lamb momos and the chili paneer were fantastic!  For dinner, I had the chili garlic noodles, which were out of this world! Full of great flavor and not greasy like other restaurants. I will definitely go back to try other selections!"], ["Pradyumna N.", "Absolutely delicious! Must go place for anyone who loves Nepalese or Tibetan dishes. I was amazed to realize how close the food tasted compared to Tibetan restaurants back in Nepal."], ["Charles G.", "I had been patiently waiting for this place to open, and it was worth it!  Everything I've tried on the menu has been fantastic, and I am eager to keep exploring the menu!  The owner and staff are very friendly, the service is prompt, and the restaurant is nice and relaxed.So far, I have had Pema's Tsawa, Tofu Delight, Momo, Shaptrak, Veggie Zidron Noodles, Tse Khala Nazom, and BUTTER TEA!  All of the above items were exceptional, and we really enjoyed them on our visits.  Definitely order the butter tea.  Even in this hot weather, it's delicious.  Also, the chef will gladly make your food as mild or spicy as you like.  Maybe next visit I'll take some pics, instead of devouring the food immediately."], ["Hema M.", "We ordered take out last week. The food was meh. The drums of heaven was delicious. That was about it. The paneer dish was mainly just gravy and the chilli lamb tasted like chilli veal."], ["Ajar S.", "Food is awesome here. The serving sizes are good and will fill you up. Everything that I ordered was perfect. Loved the MOMO and the sauce that comes with it."], ["Saumya P.", "My husband and I went here for a quick weekday dinner and I cannot wait to go back. We ordered a plate of veg momos, one dry chilli chicken, a portion of baclap, a Thai iced tea and a beer. The prices are reasonable; the portions are not as massive as in many other places but they seemed alright, and the quality of the food was very good. For a $1.50 that's about 3 times as much flatbread as one might get at an Indian restaurant, where most naans or paranthas cost around $3. I thought the prices on some things were very good. The chicken was spicy, and delicious. The filling in the momos was generous, and they were very well made.The service was great. I see people complaining here about the lack of ice in the water but it is not common in India for glasses to be filled to the brim with ice as in restaurants here. Water might be cold, or not, but people in restaurants would much much more likely be drinking cold water than ice water. I don't begrudge this restaurant for doing things the way that seems normal to them. The ambiance is lovely. There is just one tv, and this stayed off while we were there In so many other restaurants the screen to customer ratio is far too high for comfort. The music was pleasant, not too loud, and the decor was similarly understated. It looks like a nice family run joint with good authentic food, and we look forward to going back."], ["John S.", "My partner and I finally got to try the new Nepalese spot in Cary. The service here is very friendly, the restaurant has a nice homey atmosphere, and the prices are fair. We were seated quickly, and the food came out fast. All our dishes were good, but nothing really stood out as spectacular. If you like mild or medium heat, ask for spicy. The heat levels here are on the low side. Even our spicy dishes were more of a medium heat level. The lassi was also very watered down. This is a perfect spot for a quick lunch without much fuss. but if you're looking to be blown away, you may want to skip it."], ["Ani S.", "Loved their food again. We tried chichen zidron ( similar to schezuan lo mein) and it was superb!!"], ["Mingyue Z.", "I seriously doubt the 5stars reviews. I had the sliced beef dish for lunch. First of all the quantity of the food is small, and not flavorous. And I don't think the food is worth the money."], ["Mark H.", "Food is awesome.  Service was great. Strongly recommend you try the different dishes. I tried appetizer and main course.I will be back."], ["Anita H.", "More like 2.5 stars.Admittedly, I was a little nervous when I pulled up to the restaurant on a Saturday evening at 7pm and the parking lot was empty.  It's a new restaurant, after all.  There was only one couple dining, and they were finishing up.  Given the number of waitstaff and cooks coming out of the kitchen, I think they should have been more attentive, since we were the only ones in the place.Unlike the Himalayan Nepali Cuisine next door, there was nothing to munch on while perusing the menu.  The decor is rather sparse (they should get rid of the tattered white \"scarf\" on the entry door, to start with), and water is served without ice.  Seems like a no-frills sort of place.We ordered the Shokhok Ngoema (fried spicy potatoes) for a starter, and they were just OK.  I didn't find them very spicy, and they smelled better than they tasted.  For the amount that was on the plate, I thought the price was a little high ($4.95).  My friend had the Shaptrak (sliced beef and vegetables), and I ordered Jasha Khatsa (boneless chicken prepared with fresh herbs & chilli).  The beef in her dish I thought was kind of chewy, and didn't have much flavor.  Mine was a bit better, and had a nice slow burn to it.  Small portions, though, and hers was DEFINITELY not worth $10.95.Now I can say I've tried it, but I don't think we'll head back any time soon."], ["Colin C.", "My family and I wanted to try some new cuisine and found this place on Yelp. It's been a while, so I can't remember exactly what we had. I think we ordered Gyathuk with lamb, Shaptrak with Baklap, Goat Curry, and some other dishes. Everyone enjoyed their dishes. The restaurant feels very authentic and the wait staff was patient in trying to explain the various dishes to us in English. The price was reasonable too. Definitely a place that I will take my friends to who are visiting from out of town"], ["Thomas V.", "Thashi and her Husband hailing from Tibet originally but grown up in Arunachal Pradesh  bring an unique and authentic experience of the amazing Momos and Thukpa with a variety of Tibetan and indo chinese cuisine. More so the soothing and calm ambiance and experience is in itself a therapy of sorts !"], ["Jennifer M.", "A co-worker and I went for lunch recently and really enjoyed it. We love the Himalayan restaurant next door as well, but eating there is a process and we can't always be gone for a hour+ for lunch. The Tibetan restaurant was fantastic! We had the spicy chicken appetizer which was phenomenal, and even though it was hot we both had butter tea which was perfectly prepared. I had a vegetarian lunch plate. I wasn't overly excited about the potato momos, but that was my fault; I love the lamb and just wasn't thinking veggie would be potato. However that aside, they were delicious, soft and moist - perfectly made! The rest of my lunch sampler was amazing, and my friend devoured his plate (a meat dish). Everyone was so kind, and I loved the homey feel. For others that have rated the restaurant low, I think maybe your expectations for this type of food and environment are just not in line with what it is. The \"tattered white scarf on the door\" someone complained about- that's a Tibetan tradition of offering/welcome so I'm very happy to see it there. My only complaint was that the restaurant inside was VERY (uncomfortably) hot. If I had to guess, it was close to 80 F. We keep our thermostats around 75-77 so I don't expect a 66-degree place, but it was really warm, and the water is served room temp (which I usually would prefer, but we were melting!). That could have been a temporary issue though. The food is authentic and expertly prepared with all the love of a family restaurant, and just being in there makes me warm and fuzzy :)"], ["Vivek B.", "These guys have been open for about two weeks. They seem to be hard working people from  Tibet and Arunachal (a state in North East India) and are very polite. The menu is pretty diverse with a lot of ethnic Tibetan dishes. I ordered the Pema's Tsawa which was a bit sweet, but pretty good when hot. And then ordered the Veg. Gyathuk. The portions were very good and the gyathuk is a nice noodle soup with vegetables. One can ask for a spicy sauce on the side. I would recommend this place for anyone who wants to try a different cuisine which is not your typical american chinese affair. Extra star because these guys are good natured, hard working polite folks."], ["Kat S.", "This place is always good! Never had a bad thing. The mo mo soup and hot and sour soup are top notch, this is good authentic seeming food you can't find anywhere else, especially if you're vegetarian or vegan :)"], ["Ryan K.", "I visited the restaurant this evening for dinner, the food and service are great! I would definitely be back to try some other items. The beef Shapta and Chasha Khatsa are my favorites. The \"Drums of Heaven\" is a must try item here."], ["Harold D.", "I really wanted to like this place more but they are going to need to make some adjustments if they want to survive. The Tibetan Restaurant  occupies the space where Christine's resultant use to be in Chatham Square and some if the country touches still remain. I ordered the sampler meal, which may have been authentic but was not impressive. The meal conspired of noodle that were very similar to lo mien, Tibetan dumplings, buckwheat roll and a stew like dish. The first two items were fine and the stew passable but the roll was awful, it tasted like uncooked dough. The server was nice but couldn't answer questions about the menu very well. Also he was ringing up take out orders, greeting guests, doing the register so he was as attentive as he may have been. Other items in the menu looked interesting so I may give the place another try."], ["Ami J.", "Excellent!! We had been headed for a different place when we saw a big 'now open' and decided to try this place! Everyone was helpful and friendly as my husband and I had never eaten Tibetan food before! My husband got the Shaptak beef, spicy and I got the Sha Khala Nazom, chicken. I liked the Shaptak best but mine was also great!! It was a combo tray that came with a steamed bun, momo (like a dumpling) and a lo mein type noodle dish. My chicken was cooked with a special mushroom I can't name and potatoes and the mushrooms and potatoes had really soaked up the chicken flavor... So good!! I can't wait to try a different dish when we go again!"], ["Anuja S.", "Delicious food !!!!!  They have a variety of dishes. Lots of vegetarian options too. Excellent service and very hospitable people. I recommend it highly and a must try restaurant. What else does one need in an eatery ? Excellent food , excellent service , nice people. As some other reviewer mentioned it's a very homey feeling. I actually would give this place 7 stars !!!!!! Go eat there !!!!"], ["David G.", "Randomly found this place while trying to find Indian takeout in Cary on a Sunday afternoon.  Definitely glad I was able to find it and can't wait to come back.  They had just opened and the dining room was empty when I came in but everyone was incredibly nice going over all the dishes and giving suggestions.  Settled on some fried rice and Zidroj noodles and both were incredibly.  My partner thought the spring rolls were the best she'd ever had and the drumsbof heaven were delicious.  Portion sizes were good and we both have plenty left for another meal.  Can't wait to go back and try the momo."], ["Sonam C.", "Amazing food.  Always reminds me of Indian street Chinese. Have tried many things and all of em are amazing. Appetizers are my favorite and also chill garlic noodles."], ["Dinesh D.", "Very Nice. A treat for your tastebuds. Tried them for dinner twice. Recommend the drums of heaven, momos zidron chicken and chilli fish. Plan to try lunch in the near future."], ["Eileen S.", "Here's why we'll be back to the Tibetan Restaurant1. Excellent fresh food, prepared to order--handmade noodles!2. Attentive service3. Very nice people who took time to explain menu options4. Pleasant surroundings5. Lots of veg optionsWe had the veg momo, gyathuk ngoema, and veggie gyathuk.  That was a lot of food for two people but we couldn't leave any on our plates...still swooning over the momo and hot sauce (made in house!)."], ["Har M.", "After waiting for this restaurant to open for months, I finally got a chance to try it.  Service was good and, after telling them that I'm a cilantro hater, they came out of the kitchen to tell me that some of the items ordered couldn't be done without it (short version - mash cilantro with a fat and the soap taste goes away, so it worked out OK).  Cauliflower for the appetizer and the Sha Khala Nazom Chicken Combo as the main course.  To me, serving combos on trays don't make a good visual impression of the food.  Everything was simply OK.  Compared with a Himalayan restaurant I ate at in DC, the spices used here were very different than expected . . . meaning fewer of them and not so pronounced.  Thus nothing really stood out as having much of a flavor profile.  Possibly it's been as watered down and Americanized as much of the Indian and Chinese food around here.  All in all, good but nothing exceptional."], ["Nomad F.", "As authentic as you can get! If you know anything at all about traditional Tibetan foods, definitely give the tsamthuk and stews a try. They do have nice, fusion foods as well in case you are shy as a first timer. For first timers, definitely give momos, shabhaley, and any of the drinks a try."]], "Taj Mahal": [["Kristine F.", "Wow! These guys are absolutely fantastic with their stews.  Butter Chicken was tasty, creamy with little pieces of cubed chicken.  I asked for it medium and it was truly medium.  Be careful if you don't like it too spicy and ask for mild.  My hubby ordered chicken vindaloo and it was really good.  He wanted it med-hot and it was a little too hot for him.  I tasted it and it had such a good flavor but the burn did show up a minute later.  We also ordered mushroom curry to try something new and it was flavorful also like the other stews.  Each had a unique taste.  It feels like they cooked those stews a good long time to really blend flavors.  Definitely not a canned jar of sauce.  It tastes like they put the effort into it.  The rice was fluffy with nice tasty pieces of clove.  They give you ample rice too.   The onion bahi (appetizer) was a little limp for me, but the naan was spot on.    The restaurant itself was almost empty (7pm on Friday) but it seems like a perfectly fine take out place.  I hope this business sticks around because its going to be our go-to indian restaurant.  It wasn't too expensive: 3 \"main\" dishes, rice, appetizer & naan for approx $50.   I wish I could give it 4 1/2 stars."], ["Colton U.", "Definitely not Indian Food, it's more of a Americanized version of it. Didn't taste like the ethnic Indian food I love. The people and hostess look like they just got from the Waffle House. This food could possibly appeal to some groups but not me.The environment and business is empty most of the time, a little down as well.If you want true Indian go to Sitar or Tandoor, or one of those places."], ["Tanith T.", "While there were things to like about this place - the dishes with long-simmered sauces were quite good - the atmosphere and service leaves a lot to be desired. Indian breads and perfectly textured rice is usually a high point of the cuisine, but all of our starches ranged from clunky and unpleasantly heavy in texture to greasily margarine flavored with no other redeeming qualities. Not what I expected from an Indian restaurant. Not the worst Indian restaurant I've eaten in, and there are some good dishes on the menu that were well prepared. Also very far from the best. Portions and prices are reasonable. However I'm a big fan of tender, flaky paratha and naan bread, and this is not somewhere I can get a decent fix."], ["Jennifer B.", "Just a 2.75 for me.  I ordered the chicken tikka masala to go.  It was pricey and as soon as I took a bite, I thought to myself, this doesn't taste anything like the tikka masala I've had in the past.  I'm not claiming to be an expert, but I've been to many other restaurants recommended to me by my Indian friends, and again, not at all the masala I'm used to.  Now, did I find what I had to be bad?  No, just not what I expected.  Another odd thing was that there were onions and peppers in the sauce.  I've never had tikka masala with onion and peppers before.  Again, not bad, just different.  With all the wonderful places to eat out there, I think I'll skip Taj Mahal and try to find an Indian restaurant with tastes that I'm familiar with."], ["Janara N.", "First the positives: clean facility, polite service and a reasonably priced lunch special. And then meh: I don't know if these folks are from a different region of India than I'm usually around, but I didn't care for the way they spiced the dishes. It certainly wasn't bad food, I just didn't like it. A sign on the door says \"best Indian food in Raleigh\", but imho, that title goes to Kadhai the Indian Wok."], ["Rachel S.", "What an awesome lunch! I was pleasantly surprised to say the least. At first I was nervous to try it out, but it's really great and this is now my go-to spot for Indian in North Raleigh. For $7.99 you get a plate full of Indian food. I've been twice now so there's at least some consistency. The food is served on a traditional metal plate filled with basmati rice and tandoori chicken, butter chicken, and then two vegetable dishes - so far I've had saag paneer, a chickpea dish, a green bean dish, and another spinach dish. I believe the menu changes daily depending on what the chef is cooking. Everything I've had has been great! It's flavorful and filling and kind of the best deal ever. They also start you out with a basic salad too, and a small dessert even comes with it - I really liked the rice pudding. Just make sure you ask for the check as soon as you can to ensure a speedy lunch."], ["Sara K.", "So I came here for dinner with my father after arriving in Raleigh. I was very excited to eat at this Indian restaurant because we chose this one over another restaurant that was 20 minutes away from my hotel and this one was only 10. As soon as we entered the dimly lit restaurant we were not greeted by the hostess who seemed to not care enough to even stand or smile. The restaurant was cold and dark and there were no customers in sight. I told the hostess that they were going to be two of us and she told me to sit wherever I wanted. needless to say her customer service was horrible along with her knowledge of food and tastes available at the restaurant.  She has not tasted 95% of the food and has no practical knowledge of what the restaurant offers. She seemed annoyed at any request to find out more for mission about the food and/or her suggestions. When I asked about a certain soup she simply repeated the description on the menu, I further pursued and asked for more for info or if she could find out from the chef a better description, she rolled her eyes and sulked away returning with the same description as before. Extremely rude. She would only approach our table when she felt it convenient or finished playing her candy crush iphone game. You think in a rush wrong with foreign a half stars on yelp and about $20 per person to eat there, there would be some kind of enthusiasm or fondness for serving the community. I was extremely disappointed with the lack of motivation and attention given to the only two customers (my father and I). This hostess single-handedly destroyed the entire experience of the restaurant. The food was also a disappointment,  however if you'd like to be abused or put into a depression on a weekday night while in a new town you should go to Taj Mahal restaurant. If I could give a rating of zero I would. Sincerely, an unhappy customerPoor service, no enthusiasm or willing to seek out information, lack of practical knowledge of own products, poor lighting and no customer service, paper towels"], ["Amanda A.", "The first time we drove here from Knightdale it was closed, despite the hours being listed as open.  Because the Yelp reviews were so good we decided to give it another shot. I walked in and noticed not the usual smell of wonderful curry at most Indian restaurants, but the smell of incense (gives me a head ache).  One other person was there eating.  The guy who sat us was the guy who did everything and it looked like the only person working there.  The booths were so uncomfortable (hard, straight backs) and the place looked like it had a paint roller just slap paint on everything including the bathroom wall tiles!  The bathroom was not very clean and hot as hell!  So we sat there a few minutes waiting for a menu and the guy came over and basically said he would make us a lunch.  No discussion of what would be in it other than I said I did not eat meat.  It was all very odd.  He delivered us sad looking salads although we would have declined it if asked.Then our meals came.  I will start of by saying I love Indian food.  This meal was not good at all.  It was chickpeas in some mild, tomatoes sauce, spinach in a mild, sweet tomatoes sauce (those two dishes tasted more Italian than Indian and lentil in a baby poo green sauce that had a burnt flavor.  The rice was the only thing in the plate that tasted like Indian food and that was even lacking flavor. The naan was weird, too. I didn't like not being able to pick what I wanted the eat and I would have never picked the items I was served.  The flavor was off and lacking spice.  I did not get that wonderful burning feeling in my mouth that Indian food normally delivers.  The service (despite us being the only ones in there other than 1 guy who left shortly after we got there) was bad, too.  We ran out of drinks a few times. We also got no dessert and I was a bit surprised since it was \"kinda\" a buffet/weird deal I thought a bowl of rice pudding or honey balls would have been part of the meal, but to be honest I think they would have been bad, too.I honestly left hungry and disappointed."], ["Forbes-Webb W.", "Pretty good for the most part. We went at an odd time and the rice was a little dry. But, Good flavors on the two dishes we ordered. The Indian tea tasted great. Plenty of parking and a nice little place to dine."], ["Jeremy A.", "Went here for lunch on the recommendation from some co workers. This place is incredibleThe lunch special cant be beat and comes with tandoori chicken, curry spinach, butter chicken and naan bread. The offerings may change from day to day which I will be getting accustomed to because I plan to go here ALOT. The owner is real friendly and I believe might also be the cook. Ive had alot of indian food and this was some of the best, do yourself a favor and check them out."], ["Rod O.", "90% of 5 yelp stars!  This is a place I can see us visiting on a regular basis!  Everything we ate was Very Good or Better!  eBay Bride and I came here for our Anniversary Dinner and were impressed with the Service and all the Food!Onion Kulcha (think Onion stuffed Naan) !  Very Nice!  I did not want to stop eating it!  This was one of the Best Kulchas I have eaten! The Onions were Perfektly Done and the Bread was Delicious!  Delicious as leftovers reheated in a Toaster Oven!Lamb Samosas were Delicious, Perfekt with no sauce, and slightly enhanced with!Spice levels are Milder for Indian Food and with the chefs help we ordered exaktly as we enjoy! GATEWAY Curries !  Easy to LOVE !  You have been Warned!  What happens after this is on YOU!  Paneer Shahi Korma (Medium-Mild Spice Level) Even though both Entrees looked very similar they tasted VERY Different and Delicious!  This one had Dried Fruit and VegetablesButter Chicken (Medium Spice Level)  Great Flavors and Creamy!"], ["Adriana Y.", "We had a mom and daughters date last Sunday and we all craved Naan!! So we decided to give this place a try. we walked in around 4:30 pm and the place was a ghost town. We literally started back tracking our way out thinking that was not a good sign. As we were doing so the owner happily walked in ad greeted us. We decided to give it a try and Boy are we happy we did!  We ordered Butter chicken, Masala Chicken and half a tandoori chicken. Regular Naan and Garlic Naan. They all came with Basmati rice. The Tandoori chicken was fresh and juicy and wonderful flavor. The Butter chicken perfectly spiced and the sauce just delicious. we could have drank it! We later put the left over tandoori chicken in it! The owner was  hostess, cook and server.  We could hear him making our Naan. It took some time but we didn't mind. We talked and talked. After our wonderful meal we had some Chai. So tasty. All in all we would love come back!  It got alot busier and that made us happy. we hope they do well."], ["Irena J.", "I only ate here one time, and the atmosphere was very dark and uninviting overall.  The food was ok, but there was no lunch buffet.  We all ordered a special and there was only one server working, so the service was pretty slow.  The gulab jamons were good, but I don't think that I will be back, since there are a lot more apealing Indian Restaurant options in the area."], ["The Food M.", "OK, so this place may be dimly lit and owner may not be the most personable person in the world, but our waitress was and nice and sweet as she could be.  I came here for the food and was not let down great prices and high quality.  The butter chicken and lamb samosa was some of the best I have had.  Better than all the sufficiently lit upscale Indian restaurants I have eaten. The wife had a pepper dish also very pleasing."], ["Stephen G.", "Lunch special (all you can eat, NOT buffet) was great. We were a big group and kept the server hopping. She kept up, bringing hot, fresh samosas and naan. Nicely spiced sauces and butter chicken ahhh, yum! And none of that stuff you usually find on a buffet. You know the kind, the sauces with good stuff already picked out or the shoeleather tandoori.So pleased with our choice"], ["Steve P.", "I really loved the food. Spicy without being too hot. Very flavorful. All the chicken dishes I've had so far have been wonderful. Sometimes, there isn't enough staff. Was there once when one fellow was host, waiter & cook. He was great but that's too much for one person. Last time I was there there was a help wanted sign. So hopefully they will get some help. But it's still worth eating there. Very good food."], ["Jeff L.", "I think I have a new favorite lunch place!!  $7.95 for the lunch special. Includes two chicken, two vegetable dishes, rice and Naan bread and is all you a can eat.  Dessert included was just icing on the cake! I will be back with friends!"], ["Graham P.", "So, we bought some restaurant.com coupons for this place to use for take-out, because we have sworn to never subject ourselves to the horrible and rude Debby, the owner's wife.  Last night we called in an order and was told it would be 20 minutes.  We arrived 30 minutes later, had to wait another 20 minutes for the food and then the dance started. First, she insisted that the coupon was for dine-in only (nothing on the coupon says this), then she refused to process it because we had it on a web page and not in the app. My son foolishly accepted this, paid the full bill, plus tip) and left.  I pulled up the certificate on the app and he went back in for her to redo the check (paid on a cc). She made up some story that it was too complicated for her to refund and rebill, and something odd about having to call her cash register company to deal with the refund, which would take another 15-20 minutes, so we left. we returned home almost an hour after we left to two dishes that were so full of ghee they would make you gag, one containing old and chewy lamb, one containing stringy chicken and a biryani with dried out chicken.no wonder there is never anyone in there. I am going to trade in the other r.com coupons I bought for somewhere else."], ["Charlotte F.", "Best Indian place in Raleigh! My husband and I go there for dinner regularly, and it's our favorite place for a night out. It's a little hole in the wall, but totally worth finding. The owner and his wife are super nice people, and he's the chef, very talented. My favorite dish is the chicken curry (which they can make as mild or hot as you like.) I've tried many of the Indian restaurants in the Triangle, but always come back here. I recommend this place to all my friends!!"], ["Kerri K.", "I was craving Indian at nearly 9:30pm and saw that Taj Mahal stayed open until 10pm. Gave a quick call to place a takeout order and was given the usual 15 minute wait until my order was ready. Being unsure of the exact location, the lady on the phone politely gave directions. I took a short drive across town (~10 minutes) and was greeted immediately after entering the door.  After waiting approximately 10 additional minutes, my order was good to go. My order took a bit longer than the expected 15 minutes, but I didn't mind waiting at the bar area. The interior was quaint and cozy and was very clean. I ordered the sag paneer and malai kofta. Both dishes were prepared to my spiciness preference and came in huge portions! I have no doubt that my lunch will be Indian for the next 3 days. The paratha was one of the best I've had in the Triangle area. My only wish is that I would have found this gem sooner! I would not hesitate to visit again."]], "Kabab and Curry": [["Alien T.", "Mostly good for Non-vegetarians.Recently, I transformed. I started eating chicken after almost one and a half years. If I was still vegetarian (or Pescetarian), then this is not the place for me. They carry very limited options for vegetarians. Only one vegetable curry i.e. Baigan ka bartha was good. I did not try anything else in the vegetarian as the other items were very standard thing.As I transformed recently, no complains on the overall buffet experience. The chicken curry and butter chicken is great. Their butter naan was nice, and went well with the curries. My favorite is the Dal. I had Dal, like soup. I drank/ate by itself. The Dal was made perfectly, and that won my heart.Onion Pakoras are my second favorite. They have different chutney and the red chilly pickles was delicious.The veg biryani was good, and had enough spice in it.I am not a dessert person but I tried their dessert as I was on a mission to enjoy the Indian meal fully. The Gulab jamuns were awesome.I think I like this place. I will visit this place again for the lunch buffet."], ["Alicia X.", "I have been here three times, two lunch buffet and one dinner. Very satisfied with all the three trips. Not many choices for buffet. But super yummy! I guess not many people need 50 dishes for just lunch. The variety here is more than enough for me. Especially the buffet comes with complimentary Naan, which is always my love and usually cost $2~3.I had lamb and chicken momo for dinner last time. It was also pretty good. It was enough for a dinner and the lunch in the following day.Plus, it's so close to NCSU D H Hill library. Will definitely come back to fill up my stomach and take a break from study."], ["Ranjay J.", "Kabab and Curry is a fantastic authentic Indian restaurant that is really affordable.  My partner and I have dined in as well as gotten take-out from here.  We loved their chicken 65 and chilli chicken.   Their soups were also excellent!  We've tried 3 curries so far-- Rogan Josh, Balti (an Afghani curry), and Madras.  All of them were well prepared with generous portions of meat, although they were slightly oversalted.  We were also puzzled as to why there was quite a bit of salt in the Basmati rice.  This didn't really detract that much from our dining experience, though.  Their garlic naan is especially nice.  The best dish we've tried from Kabab and Curry has to be their lamb biryani.  It was perfect, and we were impressed by the amount of moist, juicy, lean chunks of lamb we got in our biryani!  The quality is definitely on par with our favourite Indian places in Cary and Morrisville, so this was a pleasant surprise for us.  We'll definitely be dining here again."], ["Trisha D.", "Excellent  food fantastic  service. We don't  wait to go back.keep it  up  your Service and food  quality"], ["Joy Y.", "We went there for lunch buffet, it's Saturday afternoon around 2pm, there were only two tables at the time, the restaurant isn't big, but well decorated, quiet and clean.  There were total 12 items on the bar, half of them were vegetarian and half of them were non-veg such as tikka masala chicken, chicken madras, biryani goat, chicken tandoori.  The food was perfectly cooked, we like every single of them, my favorite one was a dish mixed with cauliflower and broccoli, even meat lovers like us enjoyed it so much.  The server brought us garlic naan in the middle of our meal, it was fresh, hot, and delicious, it's a highlight!  The service was great, the waiters were attentive and friendly.  The price is reasonable too.  If this restaurant was on Glenwood around restaurant/bar area, it will be packed daily.  We are glad we found this gem, and will be back for sure."], ["Saksham B.", "I'm quite a regular here. They have lunch buffets, which are decent for the price point, but the choices can be a hit or miss. I always enjoy eating dinner here, especially their garlic naan and paneer dishes. Chaats are also good. Didn't like their saag at all. Service is good. Ambience is calm and quiet."], ["Charan M.", "Being a vegetarian Kabob and Curry gives a solid selection of veggie items. My favorite there is the sahi paneer. The best way to get the full experience is at a lunch buffet. This place is a little expensive especially on a college budget but easily one of the better Indian restaurants in the area."], ["Kelly M.", "Went for the lunch buffet on a Sunday and we were one of 4 tables at 12:30 pm. We had two different servers helping us and they were both incredibly attentive and polite! This place is fairly new, so I'm guessing they just aren't that popular yet. The place was clean, small and decorated nicely, although a little dark compared to the rest of Hillsborough St. on a sunny afternoon.We both are fairly inexperienced with indian food and tried everything on the buffet. They had a really nice selection and everything tasted fresh and flavorful. We were kind of surprised with how mild everything was - we were expecting much spicier food overall. They did have a nice selection of condiments to spice things up. The chicken tikka masala was my favorite hot dish and we were blown away by how hot, fresh and delicious the naan was - we both agreed that was the star!I wouldn't return on the weekend for $11.95, but maybe during the week when the buffet is $8.95 - that seems like a much more appropriate price. Overall I enjoyed it and left full, but wasn't super excited about this new addition to Hboro St."], ["E Alexander G.", "This evening was my third visit to Kabab and Curry, and it has quickly become one of my favorite restaurants in Raleigh. My previous two visits were enjoying the lunch buffet, and this evening the first time having their Rani Thali, which is like a buffet on a plate!The servings of individual vegetable dishes were superb, and the rice and Naan excellent. I opted for medium spice, which was perfect, and nice to have dessert of the day included... Just enough to tempt me into bringing an extra serving home with me to accompany my left overs. Their Masala Chai is also fantastic. Spiced to perfection, and not pre-sweetened so you can adjust easier to your individual taste. Service was pleasant and several people came by to check and make sure all was to my liking. Definitely recommended."], ["Lauren R.", "I dropped in for dinner one night, and the inside was nicer than I expected.  Nice, sit-down restaurant, white table cloths, etc.  I was surprised that around 10 on a Thursday night, the place was about half full--there were several large groups finishing up dinner (and most of them appeared to be Indian, always a good sign).I headed towards the back to place a takeout order--half tandoori chicken and Peshawari naan.  While I waited, the bartender gave me a glass of mango lassi, which was delicious--definitely the best part of my meal.  The tandoori chicken was good, and it came with a TON of white rice (way more than I could eat).  The Peshwari naan--a type of naan I'd never had before--was sweet and tasty.  Overall, the food was good, and the service was great.  My takeout order was close to $20, after tax and a small tip, and while the food was good, I think the buffet may be the better option value-wise.  I'm between three and four stars, but rounded up because of the friendly service (and excellent lassi)."], ["Athena L.", "This place is amazing.  I'm a vegetarian and the selection of options I could choose from was impressive.  In addition, everything on the menu that I sampled was delicious.  The service was outstanding and friendly.  Overall, a really great experience.  I can't wait to go back the next time I'm in town."], ["Elise W.", "The sign advertising Nepalese food piqued my interest when walking by. Figured I should pop in and see what culinary delights Kebab and Curry had to offer. The staff were beyond friendly making conversation and making sure the naan and drinks were constantly refilled. Since it was lunch time they had a buffet for about $12 a person. Rather good buffet with several chicken options, goat, and a few veggies. Really wish they had some Saag Paneer on the buffet and maybe a few more veggie options. Overall not a bad choice, wish they had a few more exotic options."], ["Patrick Z.", "First of all, I've had Indian food three times in my life - once at a Hare Krishna pay-what-you-want restaurant in Prague, a buffet in New Bern, NC, and now Kabab and Curry. What I'm saying is that I am in no way an expert on this kind of food.That said, this was fan-fucking-tastic. Admittedly, the service wasn't great (why I'm giving 4 stars instead of 5). Our waiter, who seemed like he may have been the boss, was not particularly friendly. It may have been because we told him we had a Groupon when we first sat down, I'm not sure. The rest of the staff was incredibly nice and helpful. The food, though...it was the best Indian food I've had yet. My wife also agreed and she's has way more Indian-food-eating experience than I do. So take that for what it's worth.I got the chicken tikka masala, which was awesome. Creamy, a little buttery (is that the word I'm looking for?), it was spiced perfectly (medium), and it had huge chunks for chicken. The rice was rice, but it was hot and it was good. The garlic naan...fantastic. And huge.My wife got the chana saag and loved it. She also got garlic naan and loved that as well.So yeah, we'll have to go back to do the buffet in order to get a better sense of the rest of their food, but what we had was amazing.As an aside, here's a kind of funny story: So they give you these thin, crispy pita-looking things. I don't know what they're called. They're basically the Indian restaurant equivalent of the free tortilla chips you get at a Mexican place. I thought that was the naan and I was super pissed when the waiter brought that out. That would've been an incredible waste of $8. The sauces they give you were great, so that helped my sour mood, but I was still pretty pissed.But then they brought out the real naan with our dinner and it was awesome. I was much happier."], ["Emily J.", "I got the food from Kabab and Curry delivered and was very pleased. Awesome Naan bread! Really yummy flavors and perfectly cooked rice. I would definitely order the Chicken Tikki Masala again, but definitely want to order one of the array of dishes they offer."], ["Ankur S.", "As an Indian and a foodie I approve of the taste and quality of food at this place.The food was well prepared and the good thing is that they had different levels of \"hot\" which I believe gives everyone options as per their choice.The only downside was that some of the recipes were not as authentic as you would like them to be but I wouldnt say thats a big downside."], ["Jasleen K.", "The food is good but the service sucks. It was twice that we found that the waiter did not add up the check properly and overcharged us. Also, he was reluctant to deduct that amount demanding us to give it off as tip. In another instance, he took 20-25 minutes to get us breads and the reason he gave was that he had forgotten to inform the kitchen. The 2 stars that I've given is only for food quality. But I am never going to that place again. Biryani house in Cary is better."], ["Ryan B.", "Absolutely fantastic lunch option right across the street from campus. Went with a few faculty colleagues and we all had the lunch buffet.  Despite everyone having a different appreciation for Indian food, as completely different palates and tastes, there was something for everyone.  The chicken dishes especially were so full of flavor, and the five different sauces really made for some good mixes between spicy and savory. Didn't have a chance to try the rice pudding, but will try that next time."], ["Anthony M.", "Wow.   A shocking jewel in the middle of nowhere, with fantastic food, avocado shakes, and excellent service and people.  You will not be able to discern this by looking at the external building.  Go inside and have a fantastic meal."], ["Ian M.", "This place has an excellent lunch buffet! It isn't too expensive, the food is great, the atmosphere was nice, and the service was nice as well! They had different types of traditional Indian chicken and sides, so it wasn't novel in any sense, but great if you are in the mood for Indian!"], ["Moe H.", "After spending a week in Boston for a conference and eating some of the finest Italian and Irish food, my wife and I were craving Indian.  We had eaten here once before so decided to come back tonight. Tandoori chicken came sizzling on a hot plate. It was delicious. We ordered lamb saag and naans. Again, were very pleased. Anyone looking for good Indian food, will find this, probably the best in the Triangle."], ["VC K.", "This review is about the starters only. My wife and I have had street food at a lot of different places in the city but I would have to say K & C's did not excite us much. We tried the Samosa chat which was average. The different ingredients were not broken/ crushed down well. They were large and bulky but the taste was alright. The other one we tried was Dahi Papdi chat which was far from decent. The taste was bland and the yogurt taste was overwhelming. They don't have as many options for appetizers that one would hope.They have a good ambience and we will go to try the entrées but not the appetizers again probably."], ["Atul M.", "Good food. The buffet was excellent, although there was not much variety in the menu. The food was tasty, fresh and authentic.This was my first time here and was surprised to see many people enjoying lunch there on a weekday.Would recommend for a visit"], ["A D.", "wow major improvement?! I dont know what happened, but suddenly the quality has gone way up. the owner is a fantastic person as well. this is super delicious i'm very happy right now!! not much else to say! the boti goat is really good if you ask for it hot spice level."], ["Angela C.", "My husband and I are huge fans of Indian food and make it a point to find the best Indian Cuisine at every duty location we find ourselves at, so when I found a Groupon for this particular restaurant I was thrilled. The yelp reviews were great and I couldn't wait. Upon arriving the restaurant was cute and the staff was more than friendly. We ordered appetizers, entrees and dessert as well as wine. We ordered the samosas dor an appetizer and they were delicious. With only a few bites left is when I found the hair neatly cooked into the folds of the pastry. I could actually lift up what was left of my samosa by the hair. I am not one to get overly excited at things like this so I just asked for another one which they immediately brought to the table. The entrees were next with enough fire and spice to bring tears to my husband's eyes. I have to admit though that they overdo it with the potatoes. Then came dessert. Oh my word I have never tasted anything as delicious as their rice pudding mixed with rose water. Maybe it was the way it cooled off my tongue that was engulfed in flames, but it was incredible. All in all a delicious meal. The bill came next and I noticed that they didn't charge me for the dessert ($2.99). I thought this was a gesture for the hair that had come with the appetizer and I was thoroughly pleased with that resolution. When they ran my credit card and brought it back I saw the adjustment of the dessert being added. They had swiped my card twice resulting in two separate charges and the funds were of course held for three days as \"pending\". This was not a big deal, but I was disappointed that they had not made any compensation for the hair after I thought that they had. Despite the hair and the issue with the credit card, I will return to this establishment. I can't wait to try their lunch buffet."], ["Raj Y.", "I moved to NC from NYC. I know my Indian food. I went for dinner. The ambience is pleasant. Staffs were welcoming. The menu has plenty of good item to choose from. I wanted to teste little bit of everything so went with Raja thali. Its had couple of curry, nan, starter pickle etc. To start the appetizer the tandoori chicken and chicken mali tikka was delicious. Have not had better Indian food in the area.  What blew me away was goat curry. Very well cooked very tender very delicious. Fantastic preparation great taste and perfect spice. I would give 5 start for that. I was visiting Raleigh. I am sure I am going there on my next trip and will certainly bring my friends along. Great job Keep it up."], ["Amanda A.", "My husband and I went there for the lunch buffet.  We both love Indian so were excited to try a new place.  Bad:Dark - for lunch time it would have been nice to have a little light.Bathroom was not clean and they had a bottle of toilet bowl cleaner sitting on the back of the toilet.Service was not good.  Staff was not friendly.  No greeting and no smiles.No one told us bread was coming but I assumed it should since there was none of the buffet.  After we were over half was through with our meal I asked for some and the lady said \"it is coming\" like I was bothering her.  When she brought the check she did not say she would be back to pick it up or to go pay somewhere.  Nothing.  No communication especially a \"thank you\".The labels on the food were only the names of the dishes and in Indian.  I could look at see what was in the dishes but it would have been nice to have a description.  At least let us know if the dish was vegetarian.No flavor.  Everything was really bland.  Nothing stood out or had kick to it.   It was just bla.The yogurt dip was like water.  The tamarind sauce was thick and sticky.  The colorless salad had more chunks of lemon in it than anything else.  For dessert they only had rice pudding and the only flavor notes in it were \"sweet\" and it was runny.  No honey balls and that should be expected at an Indian buffet.Not much of a selection and that would not have been much of an issue if the food was really good.Good:The price for the buffet was only $8.95 (weekday) so if you just want to fill up on food I guess it is worth it.  We won't be going back as it was really not good and the staff was not nice (especially the woman who looked downright miserable).This should go without saying and not their fault but the parking was terrible and I even got a parking ticket as I thought I finally found a spot.  Not their fault about the parking, but just be aware especially if you are driving there at lunchtime."], ["Stephanie T.", "I've got high hopes for Hillsborough Street even amongst all the boarded up city staples we are seeing there right now and the constant name changes on locations that just can't seem to stick.Kabab and Curry is located in Frazier's location so it's not the biggest restaurant ever, shotgun style with the bar in the back, pretty perfect layout for a lunch buffet really. That being said, if you have more than 6 in your party you should call them with a heads up (you should always do this, no matter what restaurant, but here definitely.)We went on day 10 of them being open for the $9 weekday lunch buffet that is served until 3:00. We left ab.so.lute.ly. STUFFED. The number of items on the buffet is very similar to that of Royal India on Capital Blvd, with about half being vegetable based and the others meat based. Items I recall being there were mattar masala, chaana masala, veggie pakoras, veggie korma, saag, chicken jalfrezi, butter chicken, coconut rice and plain rice, tandoori chicken, and of course all your condiments like mint, mango, onion, tamarind chutneys etc. Fresh super hot naan was brought to the table as well.All of the buffet items were very good, there was nothing there that seemed to stand out over the others. The tandoori chicken was cooked perfectly, not dried out and a generous size drumstick. There was a good spice presence in the items with none of them being overwhelming. Everything looks freshly prepared, not swimming in oils, and my only suggestion would to see about attempting to keep the dishes a bit warmer in temperature. Of course, this was the apocalyptic frigid snow day of 2014 and a sterno candle under the buffet dish can only do so much. Nothing was cold, maybe a stir here and there would be sufficient, alas they were busy.Their dinner menu looks wonderful and I am so excited to go back to get some Nepalese Momos after spending some quality time in that country a few years ago. There were just a couple little spotty service aspects but they have only been open a little over a week and for a snow day the place was bumping with more folks waiting at the door to be seated. I'll cut them a break, we left full and super happy, and it wasn't nearly as defeating as two inches of snow can be in North Carolina."], ["Candace C.", "Surprisingly, they don't have lunch buffet today. But they serve the lunch special @ $9 per set!"], ["Food L.", "worst food ever in raleigh.I travelled 30 miles from my place to try food at this restaurant only becos of good reviews and i dunno why people like this place.Im a food lover and i taste most of the food and when i went their and saw the menu in buffet the size of food varieties is ok and i see goat biryani without goat pieces in it.I told waiter to refill or add goat biryani with pieces and he said ok and at that time i was like 2 nd customer in Restaurant.@1pmAfter 30-40min of time also he didnt refill the goat less goat biryani and customers started coming and its like more 4 customers have been came.and the price is $11.95+ tax and i never expected taste less and no food at that price"], ["Hollyanne F.", "I had the good fortune of eating at Kabab and Curry twice during my week-long stay in Raleigh last week for work. I was somewhat skeptical, as it's located on a strip of Hillsborough Street right by NC State that would seem to cater to college tastes, but I was actually very, very pleasantly surprised. Both times I went during lunch and got the buffet, which is very reasonably priced at $8.99 on weekdays and $10.99 on Fridays and weekends. The buffet offers a plethora of options, including fresh salad with various vegetables and dressings, fresh-cut fruit, white rice, samosas, and several entree-like items, such as chicken tikka masala, daal, curry, aloo gobi, and more. I'm sure these items shift around a bit, but I was happy to see both meat and vegetarian options both times I went, with plenty to choose from. I sampled a bit of everything, and in particular loved the chicken tikka masala and the aloo gobi. The masala sauce was one of the best I've tried, and the chicken was perfectly cooked. They'll also ask if you want regular or garlic naan brought to your table - both are great, but you want the garlic. One of the best naans I have had - so fresh and hot, slightly crispy on the outside but soft inside, and the addition of garlic is fantastic. Wonderful service, too. For the price, you cannot beat the lunch buffet! So happy to have tried this out during my time in NC!"], ["Dorothy K.", "This place is delicious, in a great location, and is warm and inviting!We had the vegetable korma (SO good), mix tandoori, and the badami naan (slightly sweet, with almonds and seeds).  Oh, and I had a masala tea (this is actually chai tea with milk).  Everything was delicious.They did mess up our order a bit (forgot my tea, accidentally gave us normal naan instead of badami) but they corrected this quickly and with no fuss.  Service was really good. Will most definitely come back again!"], ["Emily M.", "The lunch buffet is only $9! How can you beat that!? By far the best Indian food around the University area. The atmosphere is clean, and the service is very friendly. The food is amazing. I highly recommend it."], ["Monica W.", "I am new to Raleigh, so this was my first time ordering from here. Best thing I've eaten in a long time! I ordered the Curry Chicken and Tomato Garlic Soup which were more soo good I didn't want to stop eating it. I asked one of the guys what was something people order the most and he recommended the Tikka Masala. So I ordered that as well and when I tell you DELICIOUS....please take my word. I haven't even finished my food and I had to stop and write a review. The staff is excellent as well. Highly recommend!!!!"], ["Michelle M.", "Dinner out with a Groupon turned out to be great! My husband and I shared the paneer pakoras, shahi paneer, and the badami kheer. Everything tasted great! We were a little disappointed with the serving size on the paneer pakoras--only six little bites. They made up for the small appetizer with the entree size. We split everything and both left very pleased. Kabob and Curry offered really good food and a clean, calm atmosphere. We will definitely be going back!"], ["Laurie M.", "Not a big fan of the lunch buffet - it is okay, but not where this place shines.  I am addicted to the Shiah Paneer and encourage anyone to try it.  Sometimes the cooks can over season (salt) the dumplings, but when we informed the waiter that the dumplings were too salty, he took them away and we were not charged for them.  I think it is reasonably priced for the quality of the product and the waiters (only male it seems when I go) are very attentive and polite."], ["Susan R.", "We love this place! To begin with, the staff is so friendly and they will do anything for you. The food is excellent and the menu has selections that go beyond the usual fare. Mangoes? Yum!  Keep up the good work, you guys are the best!"], ["Bruce D.", "Excellent cooking on the chicken; all the dishes were very tender and flavorful.  I'll leave the authenticity determination to my dinner guests (who love the place) but all was wonderful (scotch too) and if anything, a little too mild for my taste.  I'll be back next time I am in Raleigh."], ["Srivaths N.", "Extremely good is all I can say as I take some time off to make this post while eating a delish chicken and egg fried rick . I also tasted the items from my friends raja thali and it was awesomely done.With that said I give them 5 * and definitely will keep visiting them very often. Time to get back to my food now ."], ["Abhishek G.", "Nice little Indian restaurant which is always buzzing. If you are late, you might not get seated right away. We were here for lunch buffet and spread was decent. I liked all chicken dishes except biryaani. For ~$9, it is definitely the best Indian lunch option in the town."], ["Vikram R.", "This place is thebomb.com! Great variety and delicious. Also mon - thurs $9 lunch buffet is great and really well priced for what you get. I'm really glad that NC State has a great Indian restaurant"], ["Sam B.", "Very happy to have this on Hillsborough. Location can't be beat. I work from DH Hill Library from time to time and this is a great option for the university. The service is friendly and accommodating. I'm surprised to read that others have had problems. If there are issues, I would attribute them to being such a new place. Any new restaurant will have some things to figure out. But again, I haven't seen them in multiple visits.The food is very good with many interesting options that I haven't seen at other Indian restaurants. Tastes fresh and seems to be prepared with attention. So yeah, I'm happy to have it close by. It's definitely worth a chance."], ["BikashPoonam G.", "Really good food and good service. I would recommend this to everyone who likes Nepalese and Indian food."], ["Griffin C.", "Excellent restaurant with great atmosphere. I had the chicken tikka masala and it was wonderful- probably the best I've ever eaten. Could not recommend highly enough!"], ["Jodi E.", "Went to Kabab and Curry on a recommendation from a Meredith Prof. and very glad I did. The atmosphere is warm and inviting, the waitstaff was very attentive and when the waiter wasn't sure about ingredients, the manager came over to assist me with food selection (worth a whole star in my book). We ate the buffet, which wasn't huge, but had a nice variety of meat (goat, lamb, chicken) and vegetarian dishes. There was also a nice balance of mild and spicy.  I ate a delicious vindaloo, and a pretty spicy goat curry, which had a nice balance of spice and flavor. The price was reasonable for a lunch buffet. I will definitely go back."], ["Jillery Ellen S.", "I had a meetup here. The food was good and the service was right on too. We had a dinner here and not the buffet. It's nice to have an Indian place next to State. Thanks and great job!"], ["Anusha P.", "As someone who went to NCSU, I was pretty excited to know that there was a full fledged Indian restaurant on Hillsboroguh. I went here for a late afternoon snack with my friend. We ordered the Kabab & Curry platter and the Dahi Papri. The food was outrageously bland. The platter was a mix of pakoras, samosa's, chicken 65 and couple of kabobs, everything was a let down except for the chicken 65. The dahi papri was plain awful, the dahi was too thin and the papri tasted stale. Service was just average. I am definitely not going back to this place."], ["R B.", "I come here weekly for dinner or lunch. The good is excellent compared to any other Indian food you will get in Raleigh. The staff are not rude, just shy. They are new to restauranteering,  but they are improving. My inly complaint would be price, but indian food in Raleigh all seems to be steeply priced."], ["Mary L.", "Got the Palak Paneer and it was great. Great service, quickly done."], ["Katie W.", "I've eaten the lunch buffet here twice. Once because I was desperately looking for a reasonably priced Indian food place for a quick Friday lunch. I was very happy they had exactly what I was craving for a great price. I came back for my bday lunch and was again very happy. The server was friendly, however he asked my boyfriend what he wanted to drink and didn't ask me. But still didn't bring his. Same thing happened the next time and we were even sitting at the bar in front of the soda hoses. He just got distracted and forgot. The set up is crowded and ladling out the food is difficult bc the chaffing dishes are too high for the glass cover. Manageable tho and def worth it."], ["Melissa M.", "YYYYUUUUUMMMMM!!!!! First off, let me say I am extremely critical of Indian/Nepalese food because I have high standards after living in Nepal for a month. This was THE BEST food i've had since I was there. For one, MoMo's are nearly impossible to find outside of Nepal. These were spot on! I had the chicken & the vegetable - the veg were my favorite. I had a Rani Thalis (vegetarian) and it was amazing and MASSIVE!! He had the Lamb Vindaloo and loved it. He was warned it was very hot & while he likes his food CRAZY hot - he agreed it was hot! I ordered mine the regular spicy and it was very flavorful with a good kick but not too much by any means. If you like spicy food, \"hot\" is safe here! The staff was incredibly nice and everyone around us seemed to love their food too! The portions are generous. The Ras Malai is not made from powder, it's the real deal ... and it's delicious!! Very VERY impressed!!! It's right across the street from NC state and street parking is free on weekends & in the evenings. We drove 30 minutes to get there (because I saw online that they had MoMos) and we will be going back frequently."], ["Srikanth S.", "Kabab and Curry is the go-to Indian restaurant for me. Conveniently located being a student at NCSU, they serve tasty Indian food. I have dinner here 3x per week with 1-2 other people. Just to summarize:Service: attentive, prompt, polite. Every time.Ambiance: casual atmosphere equally appropriate for a nicer weekday lunch or drinks out on the weekend.Food: Price: Economical. I have a moderate appetite, and one curry dish w/side of naan is enough to share w/one other person.Location: very convenient from NC State. Free parking after 5 and on weekends on Hillsborough St."], ["Eightball L.", "Just to clear it up, 5 STARS FOR FOOD AND SERVICE! First time i had Indian food and I'm glad i came here since they had an assortment of dishes. DELISH considering i didn't know anything i was eating (meaning I'm not educated in Indian food besides curry). Nice little spot for something casual or nicer. Service wasn't exciting but the waiters were on standby for anything you needed. My only thing was that the overall experience was quiet. Maybe a little music or turn the Bollywood channel up. Also the bathroom was what turned me off about the place. A napkin dispenser, automatic air freshener would have given this place a 5 star. At least they had foaming soap. But still to satisfy my Indian I probably won't go anywhere else!! MUST TRY SPOT IN RALEIGH!"], ["Nisha N.", "It's so exciting to finally have an Indian restaurant open up right here on Hillsborough St.!  The food was so good that we couldn't resist going in two days in a row! Their lunch buffet is very reasonably priced and wasn't as large (read confusing) as some others I've been to. But more importantly, both times, every dish was delicious, carefully made and perfectly flavored. The pakodas were freshly made, and nothing was overly greasy. They had some really good channa-dal masala (not the same as channa masala) which is something I haven't seen any restaurants here offer. The naan at our table was soft and fresh, and not to forget, abundant. Service was eager and extremely enthusiastic, and while it was a tad slow to start with, it is completely forgivable given that they just opened. Their dinner menu looks promising, with kababs and momos up for the offering. The food at Kabab and Curry is authentic and tasty, and I have to go back for more!"], ["Nikki B.", "So while I had the opportunity to treat myself to cuisine that I like, I stumbled upon this new Indian/Nepalese restaurant on Hillsborough St (right across from NCSU). I ordered a vegetarian \"combo\" dish (called rani thali). It had 4 \"small\" portions of vegetarian dishes, raita, naan, rice, and a serving of a popular desert. The food was great. They asked what level of spice I wanted and when I said \"somewhere between mild and medium\", I was happy with the spiciness (they probably make it more mild for the lunch buffet to suit all tastes). The rani thali was more than one person can eat in one sitting. The staff was very nice and wanted to make sure I was enjoying my experience and my food, but we're polite and very unobtrusive. After just my first trip, I'm definitely going back. I'm gonna give it a try with some colleagues for the lunch buffet (which I think will do very well during the school year, given the location). Overall, I was very pleased."]]}