{"Brio Tuscan Grille": [], "Mia Francesca Trattoria": [["John A.", "Mia's has the best breakfast brunch in Raleigh. Hands down the best. There breakfast is cheaper than most restaurants as well. Overall 10 of 10. Been to big eds, flying saucer, Briggs, broken egg, Courtney's but the best is Mia's."], ["Tanya H.", "Been here twice with a large group. We received excellent service. Food is fresh and delicious. I enjoyed Insalata ala Francesca and Penne Arrabiata e Pancetta. I loved the spicy sauce on penne. Half price wine on Monday is an added bonus."], ["Russell V.", "Went for the Saturday brunch. They did not use fresh ingredients, the food tasted like it was prepackaged frozen food. The steak had that nasty day old grey color to it. Waitress was very kind and helpful."], ["Mari D.", "So much potential, but misses on so many levels. Lovely decor, attached to a premier hotel but it just doesn't hit the mark. First of all, I swear they make their own hours. Can't tell you how many times I've tried to have dinner here (I'm a very frequent guest at the Marriott) only to find them closed?!? Due to crazy reasons like rain! Really? Caesar salad with roasted peppers? Yuck. Meatballs have so much potential but they aren't cooked in sauce to absorb flavors and keep them moist. (Italian cooking 101) Desserts are boring, entrees are missing components that could really make them fabulous. The only reason I keep coming back is the bartenders. They really are fantastic."], ["John G.", "Horrific. Meatballs, not made in house. Truffle fires, not cut in house, arrived cold and unseasoned. Waitress asked how the fries were, I replied \"Cold and unseasoned\". Her reply \"I am sorry about that...\"Olive Garden quality with much higher prices. $15 glass of wine was really a $6 wine jacked up. Overall:Lousy serviceUnconcerned cooksLow quality ingredients."], ["Lonnie S.", "Went in for lasagna day that they advertised. Asked for a booth in the bar but they were all dirty so sat at the bar. Sign front said 1/2 price glasses of wine but bartender said he didnt know anything about that and had to ask someone. Was told by another server they were out of the lasagna that I wanted so I ordered a different one. When it came out it was not hot but never got a chance to tell server about it until much later when he finally came back to check on me. When I told him it was not hot he offered to get me another one. I said I was really wanted the other one the had advertised but since they were out got this one. He was surprised and said who told you we were out of that one? By that time I was finished with my glass of wine and over it anyway. Asked to get it to go. When my tab came and I paid in cash, he didnt give me all of my change. He said he did not have any chance and they just round it off. Since when do people just get to keep your money. I dont care if it is only a little bit of change. It is my money and I will give it to you if I want.. When I left, those dirty booths were still dirty but employees standing around talking to each other."], ["Michael M.", "After browsing several places, decided to come for brunch and let me tell you, food and service was amazing. Great attention to detail and the drinks were superb. Specifically the Grand Mimosa finished with grand Marnier and a sugar rim.  A must if you are in the raleigh area!"], ["Crissy J.", "Went on a Saturday night with my girlfriends.  Good atmosphere and the scallop risotto was excellent.  One of my two complaints would be the wine is WAY overpriced.   L'armangia Barbera is $7 per glass at our restaurant where i work and it is $12 there.  I know it's North Hills and all, but it kept me from drinking out of principal.  There is enough alcohol  markup as it is.   Secondly,  the server seemed a little sarcastic.   She certainly wasn't rude or anything, but I felt uncomfortable.  Overall good experience and it was great fun being with my friends.  It is not some place that would have at the forefront of my mind to visit again."], ["Shaun B.", "Started off rocky with no service for 10 minutes.  Notified the manager and they could not find the person who was supposed to be our server.  Another server took over - Ugo, from Capri, Italy.  He already had 5 tables, so I was skeptical. Service and food were both outstanding! Started off with the charcuterie and cheese (very nice), and had a pizza app, Quattro Stagione. Fooled by main courses, NY Strip - very tender, and the special, which was pork loin with mascarpone polenta, both delicious.  Free profiteroles for checking in on Yelp. Espresso macchiatos.  Very good meal.  Moderately busy for a Monday night.  Prices are in line with the quality of the food.  We will be back to this place."], ["Hailey O.", "The first time I went here,  I wasn't expecting too much but I was very pleasantly surprised! I really enjoyed the atmosphere but in my opinion the food is consistently good! I've since eaten here several times and haven't been disappointed. It's hard to find good Italian food in Raleigh!"], ["Briana B.", "I think this is a hidden brunch gem of Raleigh! I tried Mia Francesca's a couple weeks ago for brunch and can't wait to go back! I had the Benedict with the risotto balls and what a great twist on a traditional Benedict. My friend had the Egg Panini and I must say I think it was my favorite! The portions are large and filling. The place is large and can accommodate parties. It always better to be safe than sorry so I do recommend making a reservation."], ["Helen A.", "Here for lunch, the place is very nice. We waited a little to be seated, but once we sat, the service got better. I had the linguinei con succa. It was delicious . The lentils with warm spinach was a greater starter. I would try again in the evening with a little more staff on."], ["Andy W.", "The website says best pizza in Raleigh.  I would rather get a $5 pizza from Little Caesars.  Maybe I ordered the wrong thing...Nice restaurant with a friendly staff."], ["mary s.", "I went here with my family for Mother's Day and was not disappointed. The restaurant decor/architecture was wonderful and helped create a sophisticated but yet simple atmosphere. I especially loved the high/open ceiling design. It felt super classy!Since it was Mother's Day, the regular menu was not available, as there was a MD's buffet from 11-4pm. I had looked up the buffet menu online earlier that week, as my mother requested eating at a place that served beef/steaks (a difficult thing to do when looking at Mother's Day brunch buffets). I settled on Mia Francesca because of the mention of a charcuterie platter, prime rib, and salmon. The food didn't disappoint - which was especially good because of the steep $39 per head charge. There was a lot of food at the buffet, but the dishes that stood out to me the most were the shrimp cocktail, the charcuterie board, the prime rib, and the salmon. The shrimp they served was well cooked, with the shrimp meat being both very crisp and tender. The cocktail sauce was excellent (not sure if it's because I haven't had shrimp cocktails in a while, but oh myyy, the cocktail sauce was delicious), and both my dad and I probably consumed more of the shrimp cocktails than any other dish available. The charcuterie board had prosciutto, what I think was pancetta, and at least two types of salami. I'm not sure if it had more variety in terms of meats, but I did very much enjoy the meats they had. I feel that although the meats were good, they could have improved on the variety. Maybe they could have added some type of pate into the mix? The cheeses on the board were probably the most mediocre thing at the buffet that day. If I recall correctly, the cheese were mostly hard/semi-hard cheese that tasted,to me, mostly bland. There was the standard fare of sharp white cheddar, swiss, and what was probably colby. I did not enjoy the cheeses as much as I was hoping to; they didn't particularly complement the meats well, nor did they provide much deliciousness by themselves. I wish they had provided a better variety of cheese, maybe some brie, goat cheese, or pecorino... just something more noteworthy. The prime rib was cooked very well, medium-well to medium depending on the part your slice was cut from. It came with a creamy horseradish sauce that was very enjoyable. The salmon was also cooked very well - it was silky and not dried out in the least. The price might have been a little high in retrospect - the food was very, very delicious, but the buffet was maybe worth just a few dollars short of $39... maybe I would be thinking differently if they included Mimosa's or Bloody Mary's in the \"complimentary\" drinks selection."], ["Guy C.", "3 of 5 stars (average, fine dining).(see explanation of ratings below)Allow 50-70 minutes (no dessert).Average entrée price: $24.Allow about $40-$45 per person (one drink, no dessert, gratuity not included).Technically, this is fine dining, but it's a chain, and it has none of the class, elegance or creativity on the menu of it's next-door neighbor, Flights (for just one example).Pea pod salad is nice and simple: sugar snap peas, chopped tomatoes and sliced cucumber with a light lemon dressing.Halibut was overcooked and had way too much of the accompanying sundried tomatoes, basil, pinenuts, red bell peppers, & petite arugula salad (actually, we didn't even see the arugula).They charge too much for their wines and cocktails.About my ratings:Only fine dining establishments can garner five stars.  Until yelp realizes that a fast food joint cannot possibly be ranked equally with a $100 per person place, I need to draw the line somewhere.  If we were only talking about the quality and presentation of the food, it would be a different story.  But, as we know, yelp's rankings take into account the entire dining experience.Therefore, I divide restaurants into three categories (and I wish yelp would do the same):1) fast food and \"fast-casual\" (no table service).2) casual dining (table service, average entrée price: $10-$20).3) fine dining (linen napkins, no plastic cups, no TV's in dining room, average entrée priced at more than $20).Fine dining can earn a max of five stars.  Casual dining can earn a max of four stars.  Fast food can earn a max of three stars."], ["Patricia J.", "Held a business dinner in the reserved balcony seating. Waitstaff was good, although the requests I made for my side salad were ignored ( no tomatoes, light dressing). The calamari was a large appetizer, but much lacking in salt. I enjoyed the seasonal corn pizza with mushrooms and bacon. The dough was thin but soft. Overall it was a positive experience, although I found the restaurant hard to find in the sprawling North Hills shopping center. I look forward to trying a pasta dish the next time I come."], ["Whitney M.", "We went here for my sisters birthday dinner mainly because we both had gift certificates. I was a little skeptical because I have read previous reviews for Mia Francesca. The food was good but the service was a little slow and we were one of about four tables in the whole restaurant. To start we all ordered a round of drinks. My husband ordered Big Boss ($5), I ordered a glass of Pinot Grigio ($5), and my sister a sangria ($10). We ordered calamari and the meat and cheese tray for the table to share. The calamari was good, however we did have to add lemon and pepper to give it a bit more flavor ($9.50). I wasn't really a fan of the meat and cheese tray ($15). There were two kinds of meat, two cheeses, bread, fig jam and olives. The cheese was a Parmesan and a type of cheese that was like blue cheese. I didn't really like either cheese and I love cheese! Our waiter let us know that they just got a brand new menu. My husband and I ordered a cesar salad and then decided to split the Veal Cappellacci ($23). The salad was standard but our entree was out of this world! It was absolutely delicious and so glad we split it! It was a house made pasta filled with prosciutto, braised veal, pancetta, savoy cabbage,  tomatoes, and a fontina cream sauce. It was so good!! Our waiter told us that was his favorite meal and I can see why! My sister also got the same dish we did. My brother-in-law got the Linguine Del Mar ($22). It was pasta with sea scallops, gulf shrimp, cherry tomatoes, & basil. I had one of his shrimp and it was really good. Both my sister and brother-in-law took home leftovers. There dishes are definitely big enough to split! Lastly we had a check-in special through yelp for a free profiterole filled with pistachio ice cream and covered in chocolate sauce. It was okay. Glad it was free because I wouldn't order that again.So, overall dinner was very good but service was quite slow. Our waiter didn't bring our entrees out so I had to ask the lady that brought it out to get our waiter because we all needed refills. And then after we were all finished with our meals it took him quite some time to check on us which was strange since there was no one in the restaurant. In summary...good food, good drinks, slow service. We will be back though because the food was that good!"], ["Geof H.", "Visited Mia Francesca for a nice lunch with my wife and was very impressed.  We ordered from the Triangle Restaurant Week fixed price menu, so it was very reasonable.  Her bruschetta was particularly good.Really liked the decor in the dining room."], ["Kristin B.", "So glad we made reservations for a Saturday evening. We were celebrating an anniversary and had a wonderful experience. Attentive server, great selection of wine and an amazing meat and cheese plate appetizer. Definitely worth the $2 upgrade for the freshly made pasta, best I've ever had."], ["Richard H.", "Me and my coworkers are among the lucky ones who made a reservation in time for our company's Christmas Party. The service was great, the wine selection is phenomenal, the food was delicious...It's a must place to go if you are looking for quality food and quality service."]], "Piola": [], "Vic's Italian Restaurant & Pizzeria": [["Laurie V.", "Ordered a large pie (via Raleigh Take-out, because frankly we couldn't really decide what we wanted, and my favorite and I really just didn't want to get out of my comfy bed.) We had some special requests and Vic's nailed it.  Spot-on.  It was still piping hot when it was delivered.  We each had two (jumbo) slices, then crawled back into bed, and snuggled and kissed some more.  Vic's does a great job: fresh toppings, no grease dripping off the pizza, generous portions, and extremely flavorful.  Very authentic.  I had never tried it before now, and I wish I had!  Not much is better than a great pizza pie, except for maybe leftovers the next day....oh, and pizza-flavored kisses afterwards."], ["Andy K.", "Fist ever yelp gripe. Two slices of pizza with arugula and salami and a diet Pepsi. $17.62How on earth is that possible. Pizza was good but the price tag ruined it for me."], ["Kevin L.", "I went with Caity B., but we weren't alone--we were surrounded by my newfound Yelp family at a Yelp event! Good lord have I have had a hankering for quality and affordable pasta in the triangle for awhile, and we found it here. Vic's presented us with the perfect venue for both an intimate evening with an s.o., and an opportunity to mingle as much as you like with others there for the same reason as you: to celebrate fine food and Yelping. We had a grand time meeting others that evening, folks we hadn't met before but know we will see around town and who's reviews are worth following. How often does such a nice meeting occur on a normal dining occasion? In my experience, never. So, thanks for the lovely opportunity, Vic's!There's not much to add to what others have already written about the food, so I'll skip it. Suffice to say, we were well fed, appreciative of the diversity of plates and the hospitality of the restaurant staff for our event, and tipsy on our bottle of wine by the end of the eve. Unbeatable and one of our most memorable nights out in this town. We'll be back!"], ["Emily R.", "If you are looking for an affordable, authentic, old school Italian-American restaurant look no further than Vic's. The staff were actually speaking Italian! I got the Penne alla Michael (Penne pasta with chicken and mushrooms in pink cream sauce) lunch special, and it was a delicious. It was also a huge portion - for $8!! Service was excellent."], ["Michael B.", "Another Raleigh restaurant downtown that I should have come to sooner. On my day off, walked over to City Market, not even thinking of Italian, and they caught my eye. Nice, casual pizzeria ambiance with Italian music in the background and tasteful, down-to-earth decor. The food was great - I got the pasta + fagioli (bean and pasta tomato soup), garlic knots (thank goodness I only got three; I could have eaten thirty of those!) and grilled chicken with salad and balsamic. Plentiful portion of good food served. Passed on dessert. Can't wait to try their pizza!"], ["Lori R.", "I'm way overdue updating my review for this City Market Italian restaurant.  Have been here several times since my 2012 review, and every one of those times has been pleasant and very yummy.  Most recent was a family event with 19 people on a Saturday afternoon.  They could not have been more accommodating!  Flexible with table arrangements (we didn't know exactly how many nor if there would be a wheelchair)...they were ready for anything.From beginning to end service could not have been better and was much appreciated.As for the food, we were somewhat of a challenge as we had one who had to eat fast and leave, another who is allergic to garlic, a vegetarian...several of us requested the addition of anchovies and/or spicy...they accommodated all of us and never made anyone feel like we were a burden.Food and Service here continues to be great...do know it's an older restaurant, so the environment is a bit old school (hand-washing sign in women's room  for instance should really be replaced and/or cleaned).  If you're looking for an Italian restaurant in downtown Raleigh that is authentic, flexible (ASK them for what you want), welcoming and seriously delicious...this is it!   And if you've never had puttanesca before...this is the place to try it!"], ["Lauryn C.", "VIc's is one of the best lunch spots in downtown Raleigh. I've now had the opportunity to eat here a handful of times and I have to say this place is always putting out delicious homemade food for both lunch and dinner. If you want real Italian food in the Triangle Vic's is one of the most authentic Italian joints in town. Whether you are looking for pasta or pizza you won't be disappointed in the fresh food they are putting out here. I also really love their salads. For lunch they make some amazing grilled chicken on top of some greens. My favorite salad right now is the gorgonzola salad with chicken it's delicious. The staff has been here forever and they know what they are doing. You can get in and out of here in no time at lunch and I've had equally good service for dinner.Check out their website they host wine dinners every month and they are quite a deal.Vic's is a staple in downtown Raleigh and in City Market and one of the original locally owned restaurants in DTR. For a delicious Italian meal you don't want to miss Vic's!"], ["Stacy S.", "Let me start by saying the garlic knots look better than they taste. They are not yeast knots, they are pizza dough. Other than that I had their seafood special Snapper, clams, mussels, shrimp in an excellent tomato sauce. SUPERB! My wife had fettuccine Del Re, I tasted it and it was delicious also. I recommend the portobello mushroom appetizer, with fresh mozzarella cheese and roasted peppers and a delicious pesto garlic sauce. Bon' Appetit"], ["Susanne H.", "The caprese and the New Yorker pizza were amazing.  The service was good, and all the staff were very friendly.  The tables outside were full when we got there so we ended up having to sit inside, which was fine."], ["Rae W.", "I dined here for the first time through a Yelp event. It was a 4 course meal, with (3) penne pasta dishes and (1) gnocchi dish. I can't forget the delicious garlic knots that were served with the dishes as well.The restaurant is located in city market and is very quaint. It screams old italy and the interior makes you feel as if you were dining with the locals. The servers were extremely pleasant and the food was served quickly. They have a vast selection of wines including my favorite \"malbec\".The food is so delicious and full of flavors that burst in your mouth! I will definitely return to dine there again as this place is great for a date or group."], ["Ron W.", "Gosh, how can you go wrong with pizza and pasta at Vic's Italian Restaurant?  I had walked by this place MANY times but never had a sit-down experience in the restaurant itself.  And yeah, I had done takeout pizza but really needed to do the full meal.  Probably should have hit the Yelp event here a month or so back!Anyhow, finally had an excuse pre-Lionel Richie concert so it was time to eat at Vic's.  Great sidewalk seating underneath a canopy is fantastico on good weather evenings.  The menu is solidly Italian-American with the standard array of pizzas.  I order up a pizza as an appetizer along with a penne alla romana for my main.  A couple of glasses of wine (reasonably priced) keep us company along with a plate of garlic knots before our food arrives. The pizzas at Vic's are quite good if not NY thin-slice. More of a medium thickness Italian crust with some bite.  A nice tangy sauce along with a nice amount of cheese makes for a good pizza.  My pasta is a heaping portion of penne, spinach, sausage along with a smattering of tomato sauce.  Tasty and super filling, you get the usual large portions here.  Only downside was an excess of oil in the pasta, ouch. Service at Vic's was pretty leisurely.  On most nights I would be ok with it but given the concert, I had to wave down our wait-person to make sure we got out on time.  Prices at Vic's are reasonable for the portion and quality delivered here making it a safe choice for families and a quick bite.  Just don't expect anything wildly interesting on the menu, you'll be fine if you're all for Italian-American classics at Vic's!"], ["Cindy G.", "Perfect place for a romantic Italian dinner! We had samples of penne alla vodka, penne ortalano, gnocchi, penne arrabbiata. Yum! The gnocchi was total comfort food with thick, creamy sauce over soft potato dumplings. If you like a light tomato sauce, the ortalano is a perfect choice. The penne alla vodka had a great aroma and the sauce was clinging to the pasta! The sausage in the penne arrabbiata was seasoned just right for me: spicy and tender. The orange sorbet had a beautiful presentation. (See pics). Servers were attentive and friendly. I love the wall murals there. Very cozy. Look for drink specials."], ["Aaron B.", "I stopped into this quaint Italian joint during an arts and crafts fair downtown.  Looking at the menu I was surprised by the prices being as low as they were especially considering it was located downtown.  So I ordered the chicken parmesan and two slices of pizza.A very nice sized portion of chicken parmesan arrived, with the side garnish of pasta and sauce, along with two GIANT slices of pizza.  Wow.  I couldn't eat both slices along with the parmesan so I took one home and destroyed it later. This stuff was really good.  The service was decent and the prices were more than reasonable for the amount of food I received.  I will most definitely be back when I'm downtown looking for something to eat."], ["Tom H.", "The Best food in Raleigh! I really enjoyed the pizza."], ["Jess E.", "So. Good.We got a jalapeño pizza and cheese raviolis. The pizza was gooey and the sauce was seasoned well. The small was 14 inches for 9.99! The raviolis were clearly home made and the sauce was out of this world, creamy and sweet. The ravioli melted in my mouth! Our waiter was super attentive (he might have even been the owner, not sure). If you're in the area, this is a must on your itinerary!"], ["Uberprof C.", "Wonderful food and service.Best Italian food I've ever had, and I'm from Boston."], ["Michael M.", "excellent place for lunch, highly recomend the philly steak!"], ["Rebecca M.", "Old-fashioned traditional Italian.  Everything we ordered was delicious!  Loved the penne vodka.  Casual, not stuffy at all.  Would definitely go back."], ["Ryan S.", "I wish I could leave zero stars. The slices were decent enough, but this is definitely the first business I've ever been to (law not barring) where I was told I wasn't allowed to enjoy what I just purchased on the premises. I spent my money here and was very sternly told at least three times (without prompt or protest) that I wasn't allowed to eat there. If you enjoy snobbery and horrible attitudes, this is your place!!"], ["Cris W.", "Although once a huge fan, Vic has disappointed over and over again me and has free-falled in quality and service while their prices have shot up.They have lost the balance of ingredients. Their crust is too hard and their sauce is almost non-existent. Their staff particularly the owners, never seem to smile or be warm and inviting. They know they have a great location so they have become complacent and down right rude.But don't fret. I have found a new Superstar, Dominic's NY Pizzeria in North Raleigh in Poyner Village behind the Triangle Town Center Mall. See my reviews on Yelp, Trip Advisor and Google."], ["Virginia H.", "I got the opportunity to try Vic's for the first time at a recent yelp event. I now see what all the fuss is about! I sampled some of their cheese pizza and it was some of the best I've ever had. I know that sounds super lame and plain jane of me but the sauce was full of flavor and the crust was soft. It was a perfect cheese, sauce, crust ratio. We walked by the restaurant was we left the yelp event and it is so cute from the outside with a fabric overhang and cute tables outside.  We can't wait to go in and try some other things on their menu (or maybe just stick with the pizza)!"], ["Val P.", "The wait staff is nice but the management is terrible. We had a party of 5. Everyone ordered pastas with white or pink sauces except one person. After a forkful my friend mentioned his dish with the red sauce was bland and inedible.   The Manager refused to substitute it for something else saying \"Oh well. No one else complained today\".   Worst customer service ever! We will not return."], ["Rod O.", "Pizza gets the Bulk of the yelp stars here, and if we lived near this place I would come back!Pasta.... We got two Pasta Dishes, one was Good as in almost three stars the other was NOT!Noise!  This is a Fun Place, not quiet at allCity Market is Cool so this place could be kinda Romantic if the rest of the food was as good as the Pizza"], ["Joel D.", "This is a very quaint restaurant with a pleasant ambiance. Loved the patio, especially the lighting. We waited a little longer to be greeted by our server but once I mentioned the wait she was extremely attentive and timely. Not a lot of traditional appetizers or selection of beers. The rest of the menu had a good variety. The best part of the restaurant was the pizza. It was excellent and will reason I come back again. If your in the mood for good Italian food and great pizza, then this is the place to go."], ["KK W.", "I am at a loss as to how Vic's maintains a four star review.  A month ago we ate there, paid full price, and thought the food was OK but overpriced.  The pizza was good, two entrees were mediocre (avoid the chicken).   But tonight we cashed in a living social deal and we won't be back.  When we arrived they had rules--- you had to order off a certain menu which had very limited options, all pasta dishes, and if I wanted to share with my 6-year-old child, THEY WERE GOING TO CHARGE AN EXTRA $7.  They weren't going to provide any extra food, mind you, but that was their policy.  What?  OK, so we order a $6 kids meal and ordered off the special cheap menu.  Then we get our salads which were included in the meal.  THEY WERE, BAR NONE, THE SADDEST LITTLE WILTED TINY SALADS I HAVE EVER SEEN outside of a retirement home cafeteria.  My wife just looked at me like, is this some kind of joke?  I looked on the menu and the same salad was $4.95 a la carte.  I asked the waitress \"is this salad what you get if you pay $4.95?\"  She explained, \"no, you get a much bigger salad\".  So what is the deal for?  We also got mediocre wine with it but whatever.  The entrees were ok, a little salty.  My pasta was light on the sauce so I asked for extra, and they didn't mention that there's a charge.  Normally I wouldn't care, but when you cash in one of these deals at Vic's you immediately become painfully aware of how much they are pinching pennies so they can make money on these deals.  Then we were overcharged for what we did buy off menu, and I didn't realize it until we left because their checks are scribbled Sanskrit on an old-timey diner check.  We were overcharged maybe $2-$3.  Not a huge deal but still wrong.  Then they explained they rang up my check wrong and accidentally charged full price.  They said it was voided and I am still waiting for that to show up on my online statement.  I'm sure it will, but after a ho-hum entree, a sad, sad salad, and bad wine, what I wanted to do was just forget about Vic's but now I have an extra errand--- I have to make sure the charge actually gets voided---annoying.If Mr. Vic (or whatever his name is) would get up from his office (which is a table in the restaurant---I kid you not, he has his bookkeeping piled on a dining table in the dining room) and if he actually talked to the customers he would find out that the real money he lost on the Living Social deal was because we won't ever be back again.  If the goal of a Living Social deal is to get you in the restaurant to have a great experience so you'll come back, they failed miserably."], ["Michelle W.", "The best authentic Italian restaurant I've been to in a long time. Great food and phenomenal service!!"], ["Damon D.", "Just ate here a few minutes ago. Food was planned and terrible. Stromboli tasted like a hot pocket in the philly cheesesteak had 0 flavor. The waiter was good but the kitchen got our order wrong. At least they gave us the wrong stromboli to take home, but we ended up tossing it out the trash can around the corner. The waiter was nice but the food was awful."], ["Chris D.", "Small restaurant. Felt like it was family run.  Great food.  Pleasant service.  Will be back, saw a lot of people carying out pizza."], ["Bob S.", "The restaurant is charming and the service was great.......... the wine they suggested was very good..... but the food was just so so........ we had a salad and it was swimming in the dressing.....we had a lasagna and the noodles were limp and the meal ended up a big bowl of sauce and noodles..... I had a calzone and the sauce tasted as if it came out of a can....would not go back again"], ["Aaron W.", "Vic's saved our vacation. After dealing with mediocre food for the last few days, this place really hit the spot. Attentive staff, quaint atmosphere, and astoundingly good food. We will go out of our way to come back and eat here. Try the antipasti plate! It was the equal of the restaurants I have eaten at in NYC."], ["Julia A.", "First: Dog friendly patio. So dog friendly in fact, they offered to bring Dante a little bowl of water. Awesome!Second: The service was phenomenal (see: brought my dog a bowl of water) and they were quick. We were there during \"work\" lunch and it's nice to know that they do expedite service for those who actually have to go back to the office.The food was good. I went for a insalate di pomodori (tomato salad) and it was tasty. Just the right amount of balsamic and olive oil. Not overly drenched. It came with garlic knots. The garlic knots were ok. They weren't as garlicky as I like nor were they drenched in butter (which I also like but probably shouldn't .. too much). I also got two slices of pepperoni mushroom (my go-to combo) and it was pretty good. I could've used a little more salt but the crust was good as were the toppings.Overall a really good experience in a really cute area of town. And dog friendly!"], ["John C.", "Pizza was perfect and large.  It's the classy sausage that is sliced from a casing not ground. The wait staff was very attentive and they worked as a team so my wife and three little kids were never without.  I'd give 5 stars but it was super expensive.  Large pizza, garlic knots, and cannolis was $53.  I mean it was high quality so I'd go back, but maybe with just the wife to make the price more worth it."], ["Donnell P.", "Went here for lunch recently and the service was great. The servers are nice and food is always good and quick. This is a family owned restaurant, I love this place. Great location is City Market in Downtown Raleigh. I definitely be back soon!"], ["Jeff V.", "My wife and I stopped to eat at Vic's early Sat evening on Memorial weekend.  It was not crowded..very laid back.  My wife had eaten there a number of times over the years, and recommended that we go there for dinner.  We both ordered the Chicken Parmigiana.  It was terrible.  It was tasteless and was like cardboard.  We thought that either the chicken was old or the cook pounded it within an inch of its life.  We tried, for a good 10 minutes to flag down our waitress, with no luck.  Finally another waitress came by.  When we politely mentioned to the server that the chicken was not very good, her response was \"oh wow, I'll be sure to tell the chef\".  No apology or offer to make it right.  Needless to say, my wife was embarrassed that she had recommended that we eat there.  I assure you that we'll never go back."], ["Liz P.", "Fantastic, family owned, and authentic! They even make the mozzarella in house! I've been coming here for so long that when I walk in the door I'm treated like one of the family :-) I couldn't ask for more! Vic's also caters to my company at least 3 times a month. There is no order too big or too small and you can always count on them to be on time. If you haven't experienced the culinary perfection that is Vic's you're missing out on the best Italian food in the triangle!"], ["Becky F.", "Oh Vic's.  What can I say... its like a date that didn't work out so well but you want to give him another chance, because you have a feeling he's got something going on that maybe just didn't shine through on that first night.We (my real date and I) went here on the very last night of a Living Social Voucher Promotion.  So, this place was packed with Living Social procrastinators like us, which probably put Vic in a not so great mood to begin with.  I just had a vibe that they got stuck with a bunch of cheapies tonight.  I mean, it was booked solid on a Wednesday night and every table was there eating at a discount.  But the staff was reasonably polite to everyone.What I didn't care for is that we were greeted with Living Social 8x10 paper menus on the tables, in addition to the regular menus.  Yeah, I paid $23 for $46 worth of menu items but my choices were all very plain, definitely not $20 a plate meals.  I wasn't thrilled with the selections, I really would have rather had something from the menu that was $1 to max of $8 more.  I thought about wheeling and dealing with the waiter to ask if I could pay an additional couple of bucks to get something from the REAL menu, but I didn't think it would slide, plus I overheard another table try to vary from the Voucher, and they were told they could not.So all of that was the uncomfortable and awkward part of the date.  The good part was that the Caesar Salads were very good and fresh, and my Sweetie's Meat Lasagne was wonderful.  REALLY good.  My dish that I settled for was Spaghetti Puttanesca.  It was alright.  Probably just fine if you are a Puttanesca fan.  I longed for a garlic, pesto, or cream sauce, but had to stay within the limited choices on the menu.  I agree with those who say the garlic knots needed more butter and garlic.  I sprinkled them with salt which helped give them some flavor.  They were moist, but bland.  We were happy when our meals arrived so we could dip them in the marinara sauce.  3 stars because I couldn't order what I wanted.   I might have given 4 stars if I could've ordered something I really wanted.  I prefer vouchers that you can use on any menu item ($5 for $10 worth of food) and I would have much preferred that, because I would have left happier.  I'll never know if I would have loved that Linguine!Then the next awkward part of the date came... when it is time to say goodnight.  They tried to up-sell us on drink refills, coffee, desserts... but we said No.  Sorry to leave you hanging Vic!  But we were full and ready to go.  I'll be glad to give Vic another chance someday.  Maybe I can get what I wanted from the Menu, and we'll all be satisfied.  :-)"], ["Frank F.", "The best pizza in the Triangle bar none!  Mario and his family make you feel at home. Great service great food. You can't find a better Italian restaurant in the area."], ["Chris H.", "We went here with a Groupon.  Food was pretty good but you had limited choices with Groupon.  I would of preferred to pick anything on the menu and have the groupon cost deducted.  This was a very strange way to go about it.  Food was not good enough for us to go back, maybe if we could of tried more on the menu."], ["Blair B.", "Very attentive service and the manicotti was fantastic.  Possibly the best cappacino I've had outside of the N.End of Boston."], ["Cody O.", "Visited for lunch on a Saturday afternoon. The service was excellent, but the Stromboli was a little fishy - to say the least.  It was described on the menu as a \"footlong specialty,\" and so I expected it to be served in the traditional stromboli fashion (pizza, folded over on itself). I also was expecting something on my plate to measure 12-inches long, since it was advertised as a footlong specialty. When the stromboli arrived, it was a round 6-inch ball (see the picture that I have included with this review). When I cut into it, it was 90% air - literally. There was a very thin layer of ingredients at the bottom, but other than that, this entire thing was just a hollowed out ball of dough. Very strange, and not at all as described on the menu. I might visit again to try the pizza...but the stromboli needs major work - in both its description and ingredients."], ["Tia B.", "Best pizza we've had since living in the Raleigh area! We got the Meat Lover's pizza. The crust is sweet, there is the right amount by if sauce and the cheese is so good. Family owned for 20 years! Great service and they had a 98.5 sanitation score. Casual dining with excellent food! We will def be going back!"], ["Jonathan A.", "The service wasn't great and the food was worse.  I got the pollo piccata and the entree just wasn't up to par."], ["Stephanie J.", "Really liked this place. The service was prompt and on top of it. The food was delicious everyone loved what they ordered. More authentic than other places I have eaten at downtown. The price is also a good value. Definitely will return to this establishment again. Great casual dining."], ["Jenny L.", "No one has said anything about the Caesar Salad!  Absolutely THE BEST of any in the Triangle.  and to go with the salad I drive from Durham to get--fantastic NY style pizza.  Great LIttle Italy atmosphere to go with Little Italy food. Keep up the good work!"], ["Melissa D.", "Here's the deal.  Being an italian from NY that moved to Raleigh a year ago, decent italian food (unless my mom is making it) is hard to come by here.  Vic's is good. Their pizza is one of the better ones I've had in Raleigh and they know what's up when cooking certain italian dishes. The staff is nice. The few times I've been here they seem extremely frantic. Didn't get that. I would go back. It's entertaining."], ["Steven P.", "We picked this place off the internet at 9:10pm on Wednesday night on the basis of some good yelp reviews. We were not disappointed - great food, polite attentive service, awesome prices! $2.75 for a Michelob Ultra, come on!To all the Living Social moochers, you are the reason small businesses stop offering complete menus. You're happy to pay half price for the most expensive items on the menu - why not, you deserve it. You're totally oblivious to the fact that the restaurant only sees half of what you pay Living Social. So for a quarter of the list price you want nothing but the very best and leave no tip because you're SO UPSET with the terrible deal you got.  Of course, you vow that if you had to pay more you'd go to a more \"upscale\" place.   Yeah right!Keep up the good work, Vic's!"], ["David S.", "Nothing special, everything was edible but meh!"], ["mike p.", "Who ever said you cant get decent pizza in the south has never been here!!Stopped in based on Yelp reviews, I was pleasantly surprised.We took a detour off 95 to check out Raleigh, NC and after days of \"road food\" needed some pizza and pasta and this place fit the bill.We come from a part of NY where we have access to the best italian that NY and NJ have to offer and this place could hold its own and teach some places how to do it RIGHT. We had a small pie 14\" and a baked ziti it was all excellent pasta expertly and perfectly cooked with just enough sauce to coat the pasta (as it is done in the best italian restaurants) and a generous amount of ricotta cheese and motzerella baked to perfection. The pizza was a work of art the crust was crisp yet tender the sauce was great all cooked perfectly. This place would be a find in NYC but is a jewel in NC."], ["Ravonda W.", "I've always been a really big caesar salad fan and Vic's has one of the best!..add a slice of pepperoni and it's a great lunch..plus they're really quick so i can get in and out for my 1 hr lunch break...i've never had a bad meal from this place..and everyone is really nice!!"], ["Caroline J.", "I've been here a million times and never gotten something that wasn't absolutely out of this world delicious. Really authentic Italian and even most of the workers are Italian! Ha! My favorite is the pasta with clam sauce, but their meatballs are also to die for. Sorbet desert is just as beautiful as it is delicious and comes in a frozen orange peel, you want to lick it clean! Owner is super nice as well. Classy yet casual and great for date night. Very nice decor with \"christmas\" lights and hardwood floors. Charming."], ["Rick D.", "Stop in for lunch and get a tasty hot Stromboli. One of my favorite lunchtime go-tos."], ["Lauren H.", "This is one of our go-to places for occasions. It's a small restaurant in City Market downtown and it's a very cute, locally-owned spot. The servers here are extremely nice and friendly. I have only been here for dinner, so I'm not sure if it works the same way at lunch, but they bring you really good garlic knots when you first sit down at dinner. Last time, we didn't find them to be as good as usual, but it may have just been the day we were there as previously they have always been really good.This is one of the few places where Josh and I always order the same thing. Normally, we like to order two different things when we go out to eat so we can sample two things, but here we both want our own portions. I definitely recommend the chicken pasta with pink sauce if you decide to try Vic's. This is not the official name (I can't actually remember the real name), but they should know what you are talking about if you order it this way; look for the the chicken and mushroom pasta dish on the menu. The sauce is what really makes this so delicious and I always look forward to eating my left-overs for lunch the next day. Josh never has left-overs himself.They have a good selection of wine here and the prices are reasonable at dinner, but not reasonable enough for us to eat here regularly, so we always look forward to going here every once in awhile for whatever occasion we have. I think it is cheaper at lunch, so this might be a good option to try sometime too. One time when we go I would like to try the pizza, but I regretted it last time I branched out from the pasta and ordered chicken piccata (still good, but not as good as this pasta)!"], ["Victoria T.", "I went here for dinner last week with my family and we really enjoyed it! We sat outside and it was such a nice setting. The little shops were across the street and it was just nice and relaxing. I had a glass of house Pinot Grigio and we started with the calamari. I really like their marinara sauce. It's a bit thinner and more of a purée. Very tasty. I had the chicken parmigiana and it was great. My son loved it. His dad had the veal parmigiana and ate every bit of it. Quite an accomplishment considering the portions were HUGE. The meal also came with garlic knots. I liked them and my son filled up on them. It was commented they could have used more garlic and butter but I didn't think so. I guess a matter of opinion. Our service was fantastic. This was our first visit and we were glad we decided to come. We weren't able to stay for dessert as my son was ready to go home and when you're two years old you make the rules. I guess I'll just have to go back to try the dessert :)"], ["Steve B.", "We will be back again!  Pizza was great. Beautiful Italian murals. Reminds me of the old country!"], ["Amy L.", "I had a great lunch with coworkers here. Not only was the restaurant able to accommodate 8 during the lunch rush, everyone enjoyed their pizza and salads. Would definitely recommend!"], ["Mary B.", "I was served rancid chicken.  I'm sorry but that was just absolutely horrible.  The meat was bad.. very bad.. My friend ordered the same dish and we both couldn't/wouldn't eat it.  They took the plates back but I had lost my appetite.  It's the following day and I still haven't found my appetite.  I've never in my life put rotten meat in my mouth.  It haunts me.  The bread was good.  The mushroom appetizer was good.  My fiance's veal Parmesan was good.  But that chicken... Oh god the bad meat... It was tasted like the aroma of stinky feet and dirty booty.. I spit the bite I took into my napkin and it smelled like rot and fish.."], ["Malcolm R.", "The only thing that I order at Vic's is the Chicken Parmigina. The chicken breast is always cooked very well, and the pasta is left al-dente (just the way i like it!)I did have the pizza and it was a little too greasy for my taste.For the money, this is a great Italian restaurant. Their lunch prices are awesome! Highly recommend this place to all Yelpers!"], ["Steve T.", "Best pizza in downtown.  Not always consistent but it's great more times than it's not so great."], ["Margaret K.", "Had dinner with a close friend at Vic's.  Neither of us are from Raleigh, so it was a shot in the dark. And it was a bull's eye.Food is outstanding.  Wait staff is amazing.  Kelly was our server and she was, in a word, AMAZING! I would definitely return.  Surprisingly great food and service in an understated atmosphere!  Oh, and Kelly?  Best.  Wait.  Staff.  Ever."], ["Shana D.", "My favorite thing about Vic's is the staff. One day I ordered lunch to go, and while I waited I wandered into Epona & Oak next door. I spent a bit of time there, and so when my food was ready, the kind man who took my order walked over and delivered my food to me in the store! I felt like I was in a sit-com about being a cool person in a small city, like the Raleigh version of Friends. As an extra bonus, the food is DELICIOUS old-school Italian, at a reasonable price. Check it out or you're missing out!"]], "Amedeo's Italian Restaurant": [], "Stromboli's": [["Jonathon N.", "We dined, ordered a supreme pizza and it was awesome.  The staff is friendly and the pizza is always good"], ["Heather H.", "The food is not bad if you are actually served it.  Stromboli's:  It's like musical chairs but with pizza!"], ["Emily R.", "Admittedly, I've only been here once but the calzone I ordered was excellent. At first I was overwhelmed by its size, but it was stuffed with just the right amount of cheese, etc. I easily finished the whole thing, and I have to say it was better than the calzones at Randy's.Layout of the parking lot is a bit odd, but interior is really clean, and the staff is really nice. If I'm in the area again I will definitely stop by for another calzone."], ["Katie P.", "I've been hitting this place up for lunch for a few years now and it's great.I generally order one of the ever changing lunch pasta specials.  Sometimes you can get out of there with an order of pasta and a drink for $7 and some change.  I have tried a couple of the sandwiches and found them to be tasty and filling.  Strombolis used to offer wraps from time to time which I loved, but I haven't seen them on the menu the last several times I have gone in.I am not a fan of the pasta salad that comes as a side for the sandwiches so I always pay the upcharge for fries instead."], ["C C.", "Amazing! Best pizza I've had in a long time. Super thin like NY pizza should be. Staff is always excellent and super friendly."], ["Kiana J.", "Me and Hubby, found this place searching for something different in the area and we really enjoy it.  Nice fast casual dining or take out, I really enjoy the meatball parm and an antipasto salad on the side. I recommend if your looking for quick cheap eats."], ["Maikidi B.", "Some of the BEST Italian cuisine I've had since I moved out of NYC. Definitely recommended, and this place has a real old school Pizzeria atmosphere. Loved it!"], ["Ashely C.", "I live close to Stromboli's and love to take advantage of their $5 personal 8 inch pizza deal when I want some pizza or a quick takeout dinner.  I stick to basic pepperoni and it is good.  One time, I did venture out and get the spinach ravioli in Alfredo sauce.  It was okay.  Not the best pasta dish I've ever had but acceptable.  I'll stick to the personal pizza from here on out.The service is always excellent."], ["Kevin S.", "Had a basic pepperoni and cheese Stromboli.  Was surprisingly very good, excellent blend of cheeses, and the sauce was not overpowered by herbs.I would like to come back and sample some of their specialty pizzas!In addition, the store was extremely clean.  Good place!"], ["Richard S.", "I came in for the first time today at a recommendation from a close friend .  Ordered the Stromboli and have to say it was great!  Not a fancy place, just a good pizza joint to bring the family too.  I will spread the word to other Cardinal Gibbons family's .  Can't wait to try the pizza...."], ["Gregory H.", "Decided to do a stop here on a weekend to buy lunch for my office workerbees who were actually putting in time that particular weekend.  Not really an impressive visit to say the least.The food, eh... not so great - very acidic, somewhat bland, and a recipe for a bad case of heartburn for the rest of the day (yes, it was and it did).  I can't vouch for my co-workers meals, I just know mine had me downing Tums for the rest of the day.Service was okay, not particularly fast, but not especially slow either.  People were friendly enough so I can't fault the place for it's service.I'm just going to put this one on my list of \"Been there... tried it... no overwhelming desire to go back\""], ["Randy J.", "We placed an order here from Rex Hospital after being tired of eating Hospital food for several days. My wife had been the hospital. We called in for delivery they were very helpful. It took them about 45mins for the food to arrive. The food was above average we had the Chicken Alfredo along with garlic bread and cheese sticks. The Chicken Alfredo was ok, however the bread was bland and the cheese sticks were soggy. I would actually say the hospital food was better at Rex."], ["Adriana Y.", "Decent lunch specials. I love the pizza and salad combo. I recently ordered a white pizza for my daughter, very cheap on the ricotta and too much oil as well as bland. Good none the less, for a quick lunch."], ["Scott K.", "Food is better than expected!  I went here for the first time and got a italian grilled chicken wrap with pasta salad.  And they gave me a free basket of bread while i waited for my food.  I have been wanting to come here for a year.  Now that I have been here, I know to come back again.  I'm glad they spent more time and money on good food than making the place look like Italy.  They could play better music.  I could not tell if the music was italian or what.Food AStaff  BDecor CLocation B"], ["Joy T.", "Ridiculous delivery time. No one eating there at night why should it take one hour fifteen minutes to diver two sandwiches? They don't want to do well do they??"], ["Dave C.", "Ordered a pizza totally expecting a very generic, if not gross, pizza.Picked it up, brought it home, and... not bad at all.  Seriously.  The crust was then, crispy in the right spots, doughy in the right spots, and had a little flavor as well.The salad was definitely not high quality, but it also wasn't totally gross.The menu is huge, with as many specialty pizzas and toppings as Lilly's or Capital Creations.The product-to-price ratio is really good, they deliver, and they have tons of coupons and specials that make things simple.We ordered a specialty pie that was essentially a white-pizza with alfredo sauce--so I can't vouch for the quality of the red sauce and the degree to which they can produce a standard pie.I will definitely hit this place up again--totally solid if you're in the area."], ["Bradley P.", "Don't even bother with this place.I went to this place around holidays of 2007-2008. My family ordered a family meal of the lasagna. Waited about 20-35 minutes for it. Never got it. When they are super busy, you will be ignored.My family called a server over to ask about what is taking so long? After the lasagna was cooked, they left it alone. Completely forgot about it. It was served to us...and it was cold.My family asked about it being cold. The server took the pan of lasagna to re-heat it in the oven. Only the top of the lasagna was warm / hot.  The bottom of the lasagna was still cold.My family never went back. Ridiculous."], ["Brenda C.", "The first time I went to Stromboli's was on Thursday and I was back there on Saturday, so that speaks for itself about my satisfaction.Their antipasto salad was great. Like Kim R., I also surprisingly loved the fries. The Buffalo Chicken Pizza was good, I liked their pizza, but the crust is thin in like a flimsy way which I enjoyed though others that tried it with me did not. They have a wide selection of pastas which I hope to try. Their prices are very reasonable and the staff are friendly and funny too."], ["Leland D.", "I ordered here for the first time yesterday.  The guy taking my order didn't seem to know what was on his own menu.  I ordered a white pizza with prosciutto and he kept wanting to put Alfredo sauce on it (GROSS).  Once he took my order correctly he said it would be 30-45 minutes.   Seems reasonable. After an hour and 15 minutes my pizza finally arrives.   The delivery guy says they couldn't find my address.  It's 2013, ever hear of GPS?????   Ridiculous!!!!   The only saving grace was the pizza was great.  My advice to the management,  get a computer and mapquest addresses.  Someone that works there has a smartphone don't  they?  Hopefully?"], ["Letia J.", "That was no fried mozzarella! That was a cheesestick I could have gotten anywhere! #italianfail"]], "Brookside Market & Deli": [], "Tuscan Blu": [], "Gravy": [["Kurt W.", "If you are looking for quality Italian food, I don't recommend gravy. Very overpriced for what you get. Servings are small, and the quality of the food isn't authentic. This is an \"American-Italian\" Resturant. Save your money and get better Italian for a cheaper price!"], ["Jaimey H.", "Study group came here for dinner the day before the NC Bar exam because we wanted a place that was delicious and, most importantly, quiet!!The food and atmosphere did not disappoint.  Everything I tried was excellent.  I ended up having the lasagna and it was bubbly hot, with just the right amount of sauce and loads of meat.  I would definitely recommend this restaurant to anyone in the Wilmington St area in Raleigh.  I have no idea why this place is called Gravy, but this place definitely does Italian food right!"], ["Kristy A.", "I've been here several times, but haven't bothered to review yet.   This place  has really good Italian.  Recently, I have sampled the calamari, family gravy, the lasagna, and the bolognese.  The clear winner was the lasagna, with the bolognese close behind.   Both dishes were winners.   The family gravy has a bunch of different meats; which I like in theory, but wasn't a huge fan of with this execution.   The short rib piece was delicious, but tiny.   The two sausages were in a really thick casing, which made it hard to cut and chew.   The meatball was good.   I love the garlic knots they bring as well.  The calamari was good, with some banana peppers mixed in.  The service is usually good, though I feel for them sometimes as the tables are really close together.  Hard to move around if the place is full.   This most recent visit, the hostess was brand new and clearly lost...bless her heart.  The only other service issue I've had was with a dessert.  We ordered a slice of the lemon cake with semi-fredo.   The cake was crazy dry and unappealing, which the server didn't point out up front, but then did explain when we pointed it out.  She said that it was supposed to be that way, that most everyone hated it, and that the servers comped several per day.   She did comp ours, but we were left to wonder why they were still bothering to serve it.   Overall a good place though."], ["Mark W.", "I finally got a chance to check out Gravy and was not disappointed with the experience. They were full on tables, so my guest and I decided to sit at the full service bar. The server was very attentive and even offered to split all of our dishes for us. I started out with the arugula salad and the cheese board, followed by an order of Strozzapreti And Spicy Italian Sausage. The cheese board is a great starter, coming with an assortment of house-made cheese and cured meats. It's a little expensive for a starter, but easy to share between two people and well worth the price. The pasta has a solid taste profile with the combination of olives, sausage, and fresh mozzarella. I would definitely order both of these dishes again. All of the items we ordered were available gluten free, and the gluten free pasta was actually very good. I'm already looking forward to my next visit to Gravy and to trying more items from their menu."], ["Christine S.", "-Cuisine: Italian; Lots of locally sourced ingredients and scratch-made menu items (e.g., ravioli, ricotta, etc.)-Beverages: Full bar, respectable glass pour and bottle lists, beer, cocktails, and even local spirits-Recommendations: Risotto Balls, Gnocchi, Family Gravy, Eggplant Pie, -Atmosphere: Trendy Casual, Bustling-Service: Acceptable (6/10) I've never had remarkably good or bad service here; so, i's not one of the aspects of the meal I look forward to, like with many other of my favorite restaurants, but it's also not a deterrent -- more of a means to an end. Considering the power and expertise behind Empire Eats, though, it could be so much more while still suiting the fairly casual environment. -Notes: I've only enjoyed dinner (dine-in and takeout) and wine here thus far. The food is consistently good, with a few standouts (typically daily specials and house-made items like their ricotta); they've got some great bottles of wine on their list; I enjoy their front and back patio dining (the people-watching out front can be especially enjoyable if you're into that sort of thing); and they're open on Sunday, whereas Bella Monica, my favorite Italian restaurant in Raleigh, is not. They also frequently participate in Raleigh Restaurant Week. -Cons: The service is just acceptable, and, despite the fact that they use many locally sourced ingredients and make a number of delicious items from scratch, I don't feel like they're proactive enough about telling that story and building a reputation on that. That information is freely available on the menu and website, but hasn't been a service point most of the several times I've dined there. -Overall Rating: 7.5/10-Website: gravyraleigh.com"], ["Justin B.", "We tried to go here for lunch with a rather large group (10) and ended up walking out after 45 minutes. We arrived without reservations and when we walked in we noticed three high top tables with four chairs each open and a six seater booth. We asked the hostess if any of those tables had reservations as we were willing to split our group up and be served separately. The hostess then had to go and ask her manager if they could seat us and we were told there would be a twenty minute wait. We then were told they have a full service bar and we could sit there if we would like and we decided to do so.After being seated at the bar for twenty minutes and not having a single person acknowledge or speak to us nor bring us waters ( the bar did not have anyone behind it ) we then asked the hostess again when we could be served since we had been sitting for twenty minutes. She had to go ask her manager in which she came back and told us we would not be able to be served for at least twenty minutes. They did not seat anyone else after we sat at the bar and noticed that all 8-10 of the other tables that were in the restaurant did not have any food. It's clear that they can't handle a Friday afternoon rush nor can their kitchen and wait staff handle their restaurant when it is not even at full capacity. We will not be coming back and it's a shame as we absolutely love their food."], ["John H.", "Made a reservation to eat here the night before the first inaugural Rock 'n' Roll Raleigh Marathon race.  Walked in about 10min early and we were warmly greeted and seated right away.  I did notice that about 10min after we sat down, the place filled up rather quickly [my guess is that we all had the same reservation time - who would have thought everyone would be punctual that evening :)].Our server was super helpful... I think we all looked like out-of-towners so she spent some time with us looking at the menu and letting us know about the specials that night.  We ordered drinks and I ordered the table a plate of Risotto Balls since the previous yelp reviews had recommended it.  Luckily the app had a total of four balls (our party was a table of 4) so there was no fighting or having to split any.  They were melt in your mouth delicious and the marinara sauce they rested on was quite tasty as well.For my main entree, I ordered the Family Gravy.  In-house-made pasta, metall, house-made spicy sausage, sweet sausage, braised boneless beef short rib, Gravy, and house-made ricotta.  I was in heaven.  The portion seemed just about right [I was also pretty hungry from the drive and really needed to eat a good meal before the race the next morning].As far as the restaurant itself... I love the fact that it is in the heart of downtown.  We walked from our hotel so it was nice being part of the city and not crammed into a car (for once).  Clean dark-wood tables, the finished exposed brick wall with local art hanging on it made for some nice ambiance.  It is a small space tucked into an old building, but I think it adds to the charm of the restaurant with booths lining one wall and a bar on the other.  Limited outdoor seating (only two tables) but that's really just minor detail....I would definitely come back if I find myself in downtown Raleigh!"], ["Trupti T.", "One of the best dinners I have had in the Raleigh area.  The ambiance, food, service, and drinks were excellent.  It is just not some pasta and sauce place, like other Italian restaurants are. The food here actually has flavor and you can taste the ingredients, the feel of it is very modern Italian.  Nothing is too over done and every ingredient is happily dancing in the plate.  We ordered Ricotta Gnudi, they were like tiny fluffy pillows in pesto sauce with squash and zucchini. We also ordered the chicken cannelloni and it was absolutely delicious, the fennel in the chicken sausage gave it such a nice taste.  They have a small but good wine selection, the sangiovese was very good.  I can truly see why this place is always crowded (though Sunday seems to be slow days), but I would surely go back here to try more things.  So glad we decided to eat there!"], ["Melanie R.", "One of my favorite restaurants in Raleigh.  I've been frequenting this gem since it first opened.  The Eggplant Rollatini used to be my go-to prior to going GF and DF.  There are lots of GF alternatives on their menu and they are more than willing to accommodate!"], ["Cait H.", "We don't go out for Italian a lot, since I can make most of our favorites at home, but the January Triangle Restaurant Week deal was too good to resist!Our party of three supped like folks unworried about calories and enjoyed every bite. My very favorite items at Gravy are the \"Risotto Cakes\" which, in truth, aren't cakes at all, but some of the most delicious Arancini I've ever had. Crispy, fried balls of creamy, cheesy risotto - get into my mouth. A normal app size comes with 4, but I had no issue devouring these all on my own. My beau cried sad, lettucey tears into his Casear Salad while I delved into Fontina-flecked bliss (his salad was good, but who gets salad when you can have Arancini? Fool.) We also visited Gravy this past Mother's Day, and they delivered once again. If they ever have this special again - order the Balsamic Rib appetizer. We were expecting a couple of small short ribs, that we could easily split among our group of 4. FALSE. The ribs from the Flintstone's intro showed up at our table and they were divine. The balsamic was perfectly matched with the well-seasoned meat and all were satisfied.Other delights we enjoyed:LasagnaTagliatelle BologneseSausage and ShellsLamb RaguThe desserts at Gravy are also not to be missed. I'm not always wild about Tiramisu, but Gravy's version came in just the right portion size, was creamy, not too overwhelmed by espresso flavor, and I finished every bite. The Pana Cotta is also yum (on our first trip it was Vanilla Bean, on trip #2 it was made with seasonal fresh strawberries) and the Chocolate Torte is hard to beat.I need to go grab some elastic pants just remembering all these fantastic dishes."], ["Ian Maren C.", "Very nice brunch and not crowded like some of the other places.  In fact we thought it was closed when we approached it but they are open for brunch.  Inside has great decor, very clean and great staff.  Selection was great.  The coffee and donuts were amazing.  Everything we had was great.  Will be back."], ["Michael B.", "Alright - I like this place. Came for Sunday brunch and got the omelet. The mozzarella cheese was awesome, but what set this omelet apart was the savory mushrooms used in it. Also snuck a donut from a friend who ordered them for her daughter. Sticks and sweet but not overpowering. Nice little place in downtown Raleigh that I'm glad I stopped by - check it out."], ["Leslie P.", "My boyfriend and I went for the first time and loved it. We had some of the best calamari ever and their sauce is amazing. I had spaghetti and meatballs and have to say some of the best I've had. The waiter was also super nice and friendly!"], ["Sam Z.", "Gravy is one of my favorite restaurants. Small menu, but everything is good! My favorite is the gnocchi. It's a small restaurant with limited seating but they make all the dishes very well! I love taking new people here who are in town. Of all the Italian places in Raleigh this is my favorite"], ["Stacy M.", "I've lived in Raleigh for over a year now and always wanted to try this place. I'm so glad I did! The menu isn't overwhelming like most Italian restaurants and has something for everyone. There are more classic dishes with red sauces, but there are also more modern ones if you feel like trying something new. The prices were just right. My boyfriend and I both got cocktails, an appetizer, main courses, and a dessert and only had a $66.00 bill. Our waitress, Nikki, was super friendly and knew the menu well--which helped since we had no idea what to order. The risotto balls were to die for--a must-try. The only reason why I gave this four stars is because my boyfriend and I felt the host was a bit cold and not very welcoming. However, Nikki totally made up for it!  We will be coming back soon!"], ["Rachel D.", "I wasn't a fan of the flavor of the rissoto balls, I've had beter"], ["Jim A.", "I have been wanting to give Gravy another try because I loved the feel for the place and I felt that we might have just hit it on  a bad nightI am happy to say this time we visited when Gravy was firing on all cylinders.Taking advantage of the DRRW deal we met up with our fellow Yelpers and had reserved a table (thank you Lauren) downstairs in the wine cellar. I had no dined down here before. It was intimate and quite and offers a very different experience than the hustle/bustle upstairs. Initially there was a slight musty smell noticeable and the room was a little cooler than upstairs, which was fine by me.The waitstaff were very amicable as they had been before.But the food was right on the mark this time My wife and I both had the Rice Balls in a marinara sauce, followed by Eggplant Pie and Lasagna.Thin slicing the Eggplant makes all the difference in the texture and flavor of eggplant. so many times it is sliced thick and not cooked properly which leaves it with a tough consistency. This Eggplant was flavorful and delicate, an excellent dish. My Lasagna with meat filling was as good as any I've made (i judge all lasagna against mine). The Rice balls were very good, however I'd like to see more mozzarella cheese inside. But they were crispy on the outside and moist on the inside. The dessert, chocolate torte and panna cotta were opposites in flavor intensity. The torte deep and rich while the panna cotta was light and delicate, both excellent.My wife and had a great night with our first dining experience with our Yelp friends. We look forward to many more."], ["Laurie V.", "Oh, Gravy.  I wanted so much to fall in love with you. I wanted to kiss you and feel you on my palate and get the chills, as I tasted your goodness.  Alas, the chemistry was not there and it couldn't be forced......Let me start by saying what I *did* enjoy.  The oyster appetizer was tasty.  I enjoyed the fennel and the giant-sized capers and the breading and the pimento aioli.  Spot-on.  I enjoyed the ambiance.  And I enjoyed that they were open for dinner on a Sunday night, while so many other restaurants are not.  What I did *not* enjoy was the service.  I asked a question about the meatballs and the server responded with a curt \"I'm a vegetarian.\"  My friend and I couldn't help but chuckle.  We are by all means, tried and true carnivores, but we always seem to get vegetarian servers at restaurants that not only SERVE, but are respected for MEAT (i.e. we had this happen once at a steak house).Aside:  I respect and appreciate the choice to be vegetarian/vegan, whatever......but what I do *not * appreciate is that when you work in an industry/restaurant that serves meat (and GOOD meat), and cannot offer me suggestions or answers about the menu, about what OTHER people enjoy, about what the selling points are........  Or when you can not describe the food to make it sound like ANYTHING less than satiating, delicious, and satisfying.   In my book, you are not doing your job.This would not be dissimilar from me getting on a plane and telling a passenger \"I don't enjoy flying.\"At any rate, this was not the only issue here.  There were three of us.  Two women and one guy.  She devoted all of her attention to my guy friend.  All of it.  I was about to order another blackberry sangria (which was just fair, at best- there wasn't much fruit floating around in there, and that is my favorite part of sangria)......or I was going to ask her to suggest another cocktail.  But she walked away before I could do so.  She did, however, honor my friend's request for bread when he asked her.  I've worked in the service industry before.  I was taught to never \"drop off food\" and then walk away without asking a table if they needed anything else.  I needed something else.  My friends ordered wine.  They couldn't decide on a bottle.  Our server did nothing to help with the suggestion.  Whatsoever.  Seeing a theme here?  The entrees were solid, for the most part, which is the only reason this review gets three stars, as opposed to two.  My friend had the spaghetti and meatballs.  They had a special (which we wouldn't have even known about, had we not asked).  It was a meatball made of lamb/mint/yogurt.  It was DELICIOUS.  The best thing that I tasted tonight.   And we barely even knew that it was an option. I had the \"Family Gravy\".  Meh.  It was decent.  I wasn't crazy about the sausage in its casing.  But it wasn't bad.  The \"gravy\" was decent.  The meatball was good.  (It was *not* the special meatball.  I wish I would have had the choice to have tried that on my pasta instead of the traditional meatball!)My other friend ordered the carbonara dish. She said \"not bad, but could have used more sauce, flavor, etc.\".  I tasted it and it was alright.  And I agreed with her about \"needing more\".The server rattled off the dessert choices.  Again.  Guy orders dessert.  I was going to ask a question about one of the other desserts, but she was gone.  Like the wind.  Opportunity lost.I'm uncertain I would return.  Which is too bad, because I think the food and ambiance have some talking points.  Maybe we just needed a different server."], ["Sara F.", "Tried Gravy for the first time tonight and it was awesome!  We started with the risotto balls and garlic knots and the gravy was incredible.  My husband had the cannelloni and wiped his plate clean! I decided to go for the family gravy and all the meats (meatball, sausage and short rib were delish!) I'm drooling thinking about it.  We browsed the dessert menu but we were just too full.  We will definitely be back soon."], ["Laura C.", "FANTASTIC!  From start to finish it was perfect, including the service and cocktails.  Cannot wait to go back!"], ["Sarah B.", "I came to Gravy after a work related event. It was late and I was focused on having some good wine and perhaps some food. The wine was perfect and so I decided to order the Peach and Bacon salad. The salad was okay. Too much bread and not enough greens. Overall it was a solid meal."], ["Kristie T.", "Came here for the first time on Saturday with a 7 pm reservation for 4.  Didn't know it at the time but the table was down in the wine cellar, which would have been okay except for the fact that it is very sparsely decorated, had a moldy smell, was damp, and was warm.  I had a very hard time getting over the moldy smell and dampness, to the point where my asthma started kicking up.  It wasn't so horrible that I needed to leave immediately, but it made me uncomfortable for my meal and sort of set the tone for the night.I started with the Blackberry Sangria, which was quite tasty.  But it was small and served in a regular water glass.  Again, not a huge deal, but I would have preferred a wine glass or something over a regular water glass.  The risotto balls appetizer was pretty delicious.  It reminded me of fried mac 'n cheese balls, without all the salty cheese.  I highly recommend the risotto balls but was a little sad to see that there was no other dish with risotto.  I ended up with the Chicken Parmesan, which was fantastic.  The portion was large and the food was tasty.  The others in my group seemed to enjoy their food as well, but after sampling all their dishes I was glad I got the Chicken Parmesan.  I was really hoping there would be an Alfredo dish (or any other cream-based dish) but was sad to see there wasn't.Our waiter forgot to bring bread, was slow on refills (I never got one), and once we finally hunted down some salt and pepper from another waiter, the salt we received was a hardened block inside the shaker due to the dampness of the cellar.  My husband finally walked over to the break area and got another shaker himself but the salt was the same lump.  We also never received spoons for twirling our spaghetti.  Not sure if maybe it's not the \"upscale\" thing to do, or maybe our waiter was just bad in that aspect, but eating our food was made difficult with no bread, no salt, no refills, and no spoons (with Italian food!).On another note, why the name \"Gravy\"?  We noticed that a ton of meals specified that they were made with or topped with \"gravy\" which we thought was weird.  Upon asking we found out the \"gravy\" is tomato-based sauce, so essentially marinara.  Am I missing something?  Am I the only person in the world who immediately conjures up images of thick, brown, sausage-type liquid when thinking of \"gravy\"?Overall not a horrible meal, but not good enough to justify more than 3 stars in my mind.  I'd give it another shot on a weeknight to see if the issues we encounter perpetuate on a slow night, and I'd ask for a non-cellar table."], ["Jennifer H.", "To be fair, I only came here for brunch. I got the chilequile and it was good, but I've had better. I thought the portion was small for the price. It wasn't how I've normally had chilequile with chips piled up and lots of toppings, but it was 2 small tortillas with very little sauce making it dry. It was also in desperate need of salt, but from the looks of it, this is one of those restaurants that put salt on the table. If you're going to do that, you better make sure your food is properly seasoned."], ["Eve B.", "I got a couple of recommendations for this place, but I do not imagine that I'll be going back.For starters (literally), the fritto misto game out as a big fried glob. It was greasy and there four small shrimp and about four small pieces of calamari. It's certainly not worth 12 bucks. (The waiter was kind enough to take it off of our ticket.)  When we told the waiter about it, she suggested that it must have been the new batter and comes out that way. I didn't expect to have to pull the glob apart to get just for most of the crust to fall off. I've had tempura before, the fritto misto is much like it, and I've never had it served to me stuck together. The risotta balls were okay and perhaps the best thing that I'd eaten but still not as good as I expected. The garlic knots appear fluffy and moist, so I was surprised when mine were dry. To me, all of the food lacked flavor. The two things I liked the most were the wine (Stefano Massone \"Masera\" Gavi) and gravy itself (I had some on the side to dip my garlic knot).  Well, three, the noodles in my pasta were so fresh. He loves beer and tried that D9 Carolina. For him, it wasn't a hit but that's not something the restaurant can control. I thought the hostess were kind, so was the server, once we sat down our service was slow. I shared with the waiter that I was not very satisfied with any of the food I had and her response was \"Oh, I'm sorry you don't like it; I suggested things that people normally get and I haven't had everything, but I love the eggplant pie and suggested that to you too.\" I had the Tagliatelle Ala Bolognse  and he had the Family Gravy. He's very easy to please and even has was not satisfied with the food."], ["Jason A.", "If you're looking for real Italian food please do not go here. This place is an abomination."], ["Russell M.", "My wife and I finally made it here last weekend with another couple. I had been wanting to try this place for a while. I really liked it. Very good atmosphere. Friendly staff that seemed to care about the service, food, and experience. The prices and the portion size of the food I thought was just right. The starter garlic knots were really good. However, it would have been nice to have some olive oil or even some marinara sauce to dip them in. I decided to order the chicken cannelloni. It was really good. I really liked the pesto sauce. My wife had the gnocchi except that she substituted their gravy for the leek cream sauce. She didn't really like it that much, but I thought it was really good. The gnocchi were more on the rustic side I would say and keep of large. But I thought it had great flavor and I believe it would have been better in the original cream sauce as on the menu. The restaurant seemed fairly busy when we dined at 7:45pm on a Saturday night. We made reservations before and were seated promptly. We will definitely come back. Also, as other reviewers mentioned, the parking deck just past the restaurant on the same block makes it super convenient."], ["Dina D.", "In fairness, it's been a long time since I've eaten here, but I want to write about it.  I am Italian, so I'm a harsh critic of Italian restaurants.  And I also know how to make a pot of gravy.  I know what a pot of gravy tastes like if the garlic has been burned--it is not good.  When we ate here, I knew the garlic had been burned in the sauce.  If this should happen, you should throw it away--not serve it.  Also, as one reviewer noted, the eggplant parmesan is awful.  In general, one is hard pressed to find a decent Italian restaurant in the Triangle, but this one is particularly disappointing."], ["Joel B.", "We went here with a large group of hungry and thirsty people. We were served by an excellent staff who quickly took care of us, kept our drinks filled with many different concoctions (try the Rye martini-looking drink -- awesome!).We had the family style meal which included bread, appetizers, salads, two entrees (one veggie pasta and another marinara plus plenty of meats -- the sausages and meatballs were excellent but the short ribs were sweet perfection), and then desert (chocolate and cheesecake cakes).Luckily for the rest of the restaurant that we were placed in the \"basement\" room because I know our group got really loud. The basement was perfect for us and kept us contained and cozy. This downtown area is awesome. There must be 20 bars and many restaurants around a six block area. Will definitely come back for more!"], ["Brittany H.", "As new Raleigh residents- my husband and I have been having fun trying out new restaurants- we have enjoyed Gravy so much though that we have been at least 5 times that I can recall in the 5 months that we have lived here- it is just that good! It is the only restaurant where we have tried brunch, lunch and dinner too and it is delicious any time of day. The Calamari and Risotto Balls are literally life altering- order them- you won't be mad about it! The service is always amazing too! Can't wait to go back again!"], ["Blair B.", "Fantastic food.  However I do not recommend the basement for seating.  It might be good for a private party, but was not at all what I hoped for.  It was like my parent's basement, to be honest.  The food was excellent, no complaints there."], ["Paula E.", "I have only been to Gravy 2 times, but both times found the staff, restaurant itself, and menu inviting and warm. Fresh baked rolls that seemed right out of the oven. We bypassed the salads and wanted to get an appetizer but weren't hungry enough to justify it.Hubby enjoyed FAMILY GRAVY - $15.95Pennette pasta, meatball, house-made spicy sausage, house-made sweet sausage, braised boneless beef short rib, Gravy, house-made ricotta.His only complaint was that the red sauce was a little on the bland side.I enjoyed the SAUTÉED POTATO GNOCCHI - $13.95House-made gnocchi, truffle shallot cream, portobello mushrooms, chives.I also ordered a side of their homemade meatballs as well (3 meatballs were $3.95). No complaints with my meal (except who doesn't want more!). Flavorful and tender the way it should be.Again skipping dessert although tempted, we left happy and satisfied.I wouldn't hesitate to visit again and look forward to our next time!"], ["Gigi G.", "First time here....The only reason I am giving 4 stars is that the bartender, I think was named Crosby was great along with the food. The manager named Evan was a total Douche. He chewed her out for giving a sample of wine which I requested and may I say I bought 2 glasses after. He then chewed her out for several other things and did it right in the vicinity of our hearing. He is very unprofessional and not once talked to anyone knowing there was only four people in the entire place. On a positive note the Calamari and Risotto balls were fabulous!"], ["Joe P.", "One of Raleigh's best restaurants serves up a menu of Italian delicacies that will keep you coming back time and again. I eat here often when I'm in Raleigh on business, and have yet to be disappointed. The risotto balls, gnocchi and lasagna are all spectacular, the bar well-stocked with local craft beers and great wine, and the laid-back atmosphere great for either groups or business dinner. Just a block off Fayetteville Street and a short walk from the State Capitol complex, Gravy should be one of the restaurants every Raleigh visitor must try!"], ["Danielle C.", "This place rocks! I periodically order catering and carry out for and it is always on-time, hot, and delicious. The managers, chefs and staff are so helpful. I will be back soon :)"], ["Stan M.", "The Eggplant pie was just about perfect. Risotto balls are a safe-bet for an appetizer. The sauce there is very very good, to the point that I could probably just have a bowl of it with a few garlic knots and I'd be okay. My Sicilian grandmother's is about the only sauce that could beat it. It might be a bit on the pricey side for a normal lunch day but its definitely worth it to go in every couple weeks or so. The staff has always been competent and friendly. This isn't an amazing, blow you out of the water spot, but they execute very well and I always leave happy."], ["Sean H.", "Another of the many pleasant surprise among Raleigh restaurants.We walked by Gravy a number of times in our first year living here when going downtown, but were never quite sure what it was, or for whatever reason always forgot to look into it and check it out.  We came upon a gift card finally a few months ago which gave us the kick in the rear we needed to finally make a reservation and give it a try.  We loved it.  Super nice vibe and decor inside, the service was fantastic and some of the best I've had in the area, and everything we ordered was delicious.  Fried Risotto Balls:  Do it people.  Also had the beet salad, lamb ragu, and shrimp puttanesca, the latter of which was especially awesome and tasty.  This is a lot of home cooking styled Italian food, so you can expect to eat a lot of rich, tasty food that won't leave you hungry when you leave.  I have nothing bad to say at all.  I loved it, and as a lover of all food Italian, I can't wait to try more.  I'll try to save room for some of the desserts next time, but no promises."], ["Brandon P.", "I really like Gravy. I've gone there many times when in the mood for Italian and I've never been disappointed. The food is tasty but I don't think the menu has enough options. Other Italian restaurants in the area have more grilled chicken and veggie dishes. The service is good and it's a great atmosphere. It's also in a great location for after dinner drinks."], ["Marcy R.", "Average at best.  Downstairs cellar smelled moldy and damp.  Their \"gravy\" was very acidic,  lasagna was runny and no grated cheese offered had to ask."], ["Lauren C.", "My fiancee and I have this thing.  Whenever we are having a hard time deciding where to eat, we'll go somewhere we both hate.  Which is how we ended up at Gravy for lunch last week.I ordered the meatball sub and he ordered the lasagna, and while we waited, we speculated on what would be wrong with our meals.  \"The lasagna will be days old, and cold\", we joked.  The meatballs would be too dense and overly salty, I said.  Not much longer,  our entrees arrived and we were not only pleasantly surprised, but happy with our food!I didn't have any complaints and was very happy to have a meatball sub that hit the spot.  Next time we go to Gravy, it will be because we want to go back, not because neither of us want to.:)"], ["Kelly M.", "The atmosphere was nice, and the wine recommendation was yummy. Unfortunately the highlights ended there. 3 out of 4 of us did not like our entrees.  The NC hot pot was weak.  It consisted of 2 shrimp and 4 clams.  I never found a piece of fish in it.  After looking over the desert menu, we decided to have dessert elsewhere.  I really wanted to love it but left disappointed."]], "Vivace": [["Luanna Y.", "Took my family here when they were visiting from CA. We had a lovely meal which included:1. Beef carpaccio - raw, thinly sliced beef with capers. Light and refreshing way to start the meal. 2. Brussel sprouts - paired with tomatoes, balsamic vinegar, and light hints of some type of creamy sauce that added an extra dimension of flavor.3. Caprese salad - fresh cheese slices paired with basil and tomatoes. A classic.4. Ribeye steak - very large portion size, perfect for meat lovers, paired with earthy root vegetables in a gravy-like sauce. 5. Olive oil cake - paired with hints of orange and a side of mascarpone cheeseOverall, I'd give the food 4 stars. Honestly, I've had better Italian, but everything here was good to quite good. I'd say this restaurant would be a dependable place for a tasty, albeit not awe-inspiring, meal. But the service is truly absolutely outstanding! Polite, extremely attentive in the most unobtrusive way possible. Staff know the menu and gave wonderful wine pairing suggestions. Additionally, my dad is very picky in the type of pasta and sauce he likes to eat. The waiter was able to talk to the chef, and they created a dish specifically for my dad. That meant quite a lot to me, and propels them to 5 star status. Bravo!"], ["Kelsey T.", "Vivace is an excellent choice for dinner at North Hills! We went here on a Wednesday night and it was surprisingly busy, so I was glad we made reservations beforehand. It definitely felt more like a Friday night, with the bar bustling and a few big parties celebrating. So it had a really great atmosphere. If you want to eat outside, they also have a small patio with umbrellas.We ordered the Prosciutto San Danielle as our appetizer, which is prosciutto topped with some of their homemade cheese, grilled strawberries, and a drizzle of balsamic. It does sound like an odd combination to have meat, strawberries, and cheese all together in one bite, but the flavors complemented each other very well and it was a delicious dish. I've been here several times, and my favorite items on the menu are their pizzas. Don't get me wrong, the pasta and other dishes are great too, but the pizzas are big enough for 2 meals for me and they are a good deal. This time I ordered the Carne pizza, which had so much flavor. There were some hot peppers on it, so for those who can't handle heat, I suggest ordering one of the other pizzas. It is a thin crust, and I like that they don't put on too much sauce, because I get to taste more of the cheese.Vivace is a great option if you are looking for a place for a date night or a place to celebrate. They have great service and good food!"], ["Whitney K.", "In Italian, Vivace means liveliness and levity, so it's only fitting that the restaurant incorporates both those elements. The buoyant bar scene and vivacious dining area make for a popular favorite among those young, urban professionals who want to see and be seen out and about North Hills. The food delivers ultra fresh Italian favorites with a refreshing modern edge. The caprese salad gets an update with seasoned tomatoes, the brussels are loaded with prosciutto and a savory balsamic kick, and the the cheese plate will leave you dreaming about truffles. And that's just the shared plate menu! It's a perfect spot for apres works cocktails and apps with friends or coworkers, but because the scene is as satisfying as the menu, make sure to get there early or opt for a reservation if you want a guaranteed table."], ["Lauryn C.", "Vivace by far has one of the best atmospheres when it comes to the dining scene in Raleigh. I've been here several times and have always enjoyed my meal. I really like their pizzas and salads. I'm not a big pasta eater and enjoy that they have a lot of variety on the menu.Eating out on their patio is fantastic, now that the weather is warm this is the first place I think about when dining al fresco. The service is always superb and I feel well taken care of. I stopped in for lunch on the patio today and our server made sure we had everything we needed. I couldn't believe how fast our food came out this is a go to place for a quick lunch.I ordered the house salad with salmon. A very generous portion of fresh greens, tomatoes, red onions, ricotta salata and a light lemon dressing. The salmon was cooked perfectly and for $12 I think this was quite a deal.The bread they serve with hummus which is such a nice change from the usual butter. I recently tried their mushroom flatbread as well and it was really tasty. Vivace puts out some quality food in a great environment. Get outside and enjoy this nice weather on the patio before it gets to hot."], ["Rae W.", "I dined here with a friend for lunch and we both ordered the house salad with salmon. The salad was so delicious I scarfed it down without breathing. I can't believe how good it was. I am still thinking about that salad now. The salmon was seasoned well and the lemon vinaigrette didn't drown out the other ingredients on the salad.I know they have other things on their menu and I will try them at some point after I grow tired of the salad...:-)"], ["Rene D.", "Wow what a find!! Had some nice special spaghetti ( made was with pork Joel meat) yummy And the noodles were perfectly aldente ! Oh yea we ordered the roasted Brussels sprouts for appetizer. They are one of the best. We have had them somewhere else and they were equally as good!  Great food and bookmarked this place when we come back someday."], ["Lindsay H.", "I've been here a number of times because it always seems to be what I'm in the mood for - because it is absolutely delicious.The only reason it does not get 5 stars is because the service is inconsistent. Sometimes it's wonderful, and sometimes it's awful (especially if you sit outside). For appetizers, the mussels are amazing, and the Brussels sprouts, meatballs, caprese salad are all good as well. In the summer they had a chilled corn soup which was a favorite of mine.My go-to for dinner is the four cheese ravioli, and the risotto is great as well. They change their menu seasonally but it's always good - I've tried several different risotto variations, all of which were tasty and unique. Once my boyfriend got a 32 oz bone-in ribeye when we celebrating, and it was one of the best steaks either of us have ever had.Vivace is a great date spot or for dinner with a group of girls. A moderate twist on traditional Italian and the food is consistently tasty."], ["Alexa R.", "Have been to Vivace a few times now, it's always been pretty good but never great. Went tonight with my family and had an average experience. Their bread was really good, but the Italian hummus spread could have been better. We started with bruschetta which I must say was really good, but it was not bruschetta. It did not have the typical fresh ingredients, it was more like a pizza. For the main course I had the black linguine which came out pretty cold and a little too al dente. No one in my family raved about their meal, we all thought it was ok.I must add, something that put a big damper on the evening was how hot the restaurant was, we were dying. I will also add that there  are not too many affordable wines on the wine list. The menu also was a bit confusing due to all of the Italian writing. It should be more clear what each dish is and what comes with each meal.Pros are the atmosphere and we had good service. I would probably give 3.5 stars if I could but since I can't that's why I'm sticking to a 3. If it was a cheaper restaurant the quality of the food would be acceptable, but for the price, you expect more."], ["Elizabeth K.", "Oh, Vivace, what happened?I recently came back here for my friend's birthday dinner & 9 out of 12 of us did not enjoy our food. I tried the birthday girl's food (which she didn't even eat half of), and it was not good at all. It either lacked seasoning or I finally tried food that tasted bad in a restaurant. Unfortunately, I raved about this place.. Really confused, especially after I hyped it up saying how delicious and awesome Vivace was, I asked our server if the chef has changed. And indeed there has been a new chef within the year. Unfortunately I have to say that Vivace is no longer a favorite of mine..."], ["Leslie E.", "Great casual atmosphere with an upscale feel. The menu had a lot of varied food items and unique ingredients. Bring an Italian translator for some of the menu items, it's that authentic. We went on a Sunday evening and it was not crowded at all. It is not a noisy restaurant and it was easy to have a conversation. The waitstaff was professional and attentive and the open styled exhibition kitchen made it interesting to watch the chefs create your meals. I would definitely go to this restaurant again and I am looking forward to their new restaurant opening in Durham."], ["Lori R.", "A public service announcement:  Get thee to Vivace for Triangle Restaurant week!  Sis & I went Monday night, tried all six items on the special menu, and all were excellent!(see pics).We started with Pancetta and Caccio Ricotta Bruschetta.  Oh my!  Neither of us have had (nor still have) any idea of what caccio ricotta is, but there was wonderful creamy white stuff (sweeter and smoother than regular ricotta) on bread with pancetta and maybe a touch of honey?  Yum!  We also got the Caesar Salad which was a wonderful traditional caesar, but the cheese in it was two-ways...straight up good quality parmesan, with another cooked version that really added to it.  Off to a great start!  Meanwhile, we were sharing a nice light bottle of chardonnay.Onward to the \"Primi\" course:  We got one each of these two \"pastas\".  One was a SMOKED TOMATO AGNOLOTTI, lump crab, sweet pea and mint puree.  Just remembering this makes me weak in the knees.  Yes, that good.  Very rich.  Sumptuous.  sigh.  With it we also shared:  FENNEL GNOCCHI, swordfish confit, basil, meyer lemon crème fraiche.  I'm not a huge gnocchi fan, but this was beautifully done.  Light yet rich...very flavorful!We could have stopped here, but we still had the savory \"Secondi\" course.  Again we shared one of each:  GRILLED PORK CHOP, aglianico braised kale, blistered tomato and SALMON, semolina gnocchi, citrus brown butter vinaigrette, grilled asparagus.  Both dishes were cooked to perfection.  The pork chop was in a rich red wine sauce.  Salmon was light.  We each took some home, because we couldn't finish it all.Needless to say there was no room for dessert.  Three courses were just $30 for Triangle Restaurant Week...an amazing deal for the quality!  Especially loved that they were all savory.  I would much rather have an appetizer than a dessert.  Service was excellent, by the way.  We sat on the patio and it was a beautiful, memorable evening.Highly recommend this place for restaurant week, or everyday!"], ["Don N.", "Food and service was fantastic. Had the breakfast flatbread, it changed my breakfast life. Will definitely be back!"], ["Melissa W.", "I've never been disappointed in this place. I love that they have outdoor seating for warm Spring days such as this one. I also love that gnocchi is a staple on their dinner menu. Finally, I also love the excellent service I receive at each visit. Today I had the four cheese ravioli, which although filled me up, wasn't too much food. Their hummus and bread starter is yummy too!"], ["Rose L.", "I read an article that Vicace is moving to Durham and is taking over Pop's old location and knew I had to stop what I was doing and review the restaurant so that everyone will be as excited as I am that they're moving to Durham! I've been to the North Hills location twice and both times had a fantastic dining experience. Excellent food, fantastic cocktails and the service was superb. Vivace is not only great for a date night, but also is high on the list for a ladies night (cocktails on the patio or in the bar \"lounge\" area). They also have seating directly in front of the kitchen, so you can watch the chefs cook--I have a secret agenda of finding all the Triangle's open kitchens like this!Vivace is authentic Italian food, fresh pasta, wood fired pizzas and classy cocktails. They have a very well rounded menu but also have a three course meal that changes weekly with fresh and creative specials. I recommend either ordering a bottle of red wine for the table or trying a cocktail (they're creative and delicious). The first time I visited Vivace, we ordered a pizza which was cooked perfectly. The second time I couldn't say no to a special they were currently having with fresh, handmade ravioli stuffed with lamb. That is what truly made the experience top notch as it was by far the best ravioli I've had out. And to prove to you that I truly couldn't get enough I will also tell you that I shortly thereafter received a pasta maker (because of this experience) and have been practicing ever since! I can't recommend Vivace enough and am so very excited for their new Durham location, I will be waiting patiently for opening night!"], ["Arlene T.", "Yum, yum, yum! A day later and my mouth still salivates thinking of the delicious meal I had at Vivace! My girlfriend and I were overwhelmed with all the delicious food options that we decided to split two dishes--the pasta bolognese and the veal saltimbocca--both were amazing! Full of flavor and good size portions. This is my favorite Italian place in Raleigh yet! For desert we had the zepolli (deep fried donuts) which were also very tasty. We ordered a carafe of sangria for the table--good taste and not very strong (alcohol). The wonderful service complemented our delicious meal--very attentive and friendly server. Only noticeable room for improvement is the bread--it was plain, flavorless and not very exciting. Ambiance is perfect for date night or night out with girlfriends. Was very busy (Thursday night) so I would recommend making a reservation. I'll definitely visit Vivace soon!"], ["Amanda S.", "Elegant -- Welcoming -- Tasteful Weeks prior, knowing schedule would be tight, I phoned Vivace and booked a Valentine's Day evening dinner. Availability was already tight so I reserved 4PM but the hostess quickly assured me they had a list that if any cancellations came, they would alert me and offer me a time better suited in the window I requested. When we arrived, we were quickly seated at a table already ready for 2 people. Valentine's Day they had a specialty menu at $55 each. Prior to arriving, on the phone I communicated that I am gluten free and my girlfriend is a vegetarian. When the server introduced himself, he mentioned that and would be happy to walk step by step through each course outlining what I could eat and what was meat-less options. And he did! Our server went above and beyond what any ordinary or typical server does. He walked through, educated and brilliantly described each course and each meal, how the chef's were preparing the meal to ensure no cross-contamination. Each and every course was divine and a perfectly executed. I started with a soup that was pureed chickpeas and cauliflower (minus the tortellinis that were cooked separately) and was probably the most delicious soup I've ever tried. It was topped with bits of bacon and rosemary. Each and every meal was honestly perfect in size and portion as well without a long wait between. Just enough to continue to enjoy conversation and some wine. The last course was the cod fish and broccolini and they sweetly shaped the pieces of cod together to form a heart. All servers were quick to refill any beverages. It's not a large restaurant, really only encompassing one main room but they were able to put a large amount of tables ready for patrons. The server even went as much as realizing my girlfriend only ate plates that were modified and included no meat so he decreased the price of the set meal from $55 to $40. The server realized all dessert options weren't gluten free and offered decadent lemon sherbert. Sweetest part is it started snowing the second we walked outside -- perfectly large snowflakes hitting our noses with the moonlight to help shadow each one! To this day, my girlfriend and I still feel that the meal and service we experienced at Vivace was the best we've ever had, and it doesn't come easy saying that. Nestled in the corner of North Hills, it's easy to pass it as it's squeezed in with other independent vendor stores, but do yourself a favor. If you'd like a nice Italian meal that is presently superbly with an innovative and classy style, then Vivace is your place!"], ["Dan L.", "Excellent food just excellent.  I've tried several things on the menu and have always been delighted.   The restaurant has great ambiance and is also very livery and fun.  A must see in the north hills area."], ["Jacqueline J.", "I've been here several times with various companions (girls night, date night with my hubby, group of 4 friends) and the chef has always prepared delicious food.  I do agree with previous posts that the portions are small, which makes the price a bit too expensive for the amount of food you get.The wine list has some great selections for all types of palettes. The atmosphere is modern/contemporary, with beautiful and comfty outdoor seating. Definitely try their brussel sprouts and spaghetti!"], ["K H.", "Stopped in the bar for a quick drink (iced tea). While there i saw food that others were ordering and all looked good. Could not resist a bruschetta while there. Emily was my server. Did a great job! Timely with everything. Very knowledge and helpful.Bruschetta was great! Different than I have ever had before and very savory. I think it's a safe bet that this is not ricotta that you and I can buy at the local grocer.Il will certainly be back."], ["Grant C.", "First time was great really I joyed the pasta that I had. The restaurant was really nice and neat. The experience overall was good. And look forward to trying there outdoor seating"], ["Unhappy R.", "I would have rather gone to golden corral.  The spaghetti tasted like golden corrals.  Plain and simple.  Over cooked by chefs om cell phones.  The veal was also over cooked and tasteless.  Mushy pasta along with it.  Ten dollars a glass for wine thats ten dollars a bottle other places.  Come on Raleigh dont you have better to offer than this!!!!"], ["Emilie U.", "We had a great dinner the other night with friends who were visiting from out of town. The perfect place to spend a few hours drink a bottle or two, laugh and enjoy unique and delicious food! Can't wait to go back again soon! :-)"], ["Kelly M.", "Really enjoyed our early Sunday night dinner out on the patio. We skipped drinks, although they had some cocktails that looked really good. There were four of us dining and although they were crowded on the patio, the service was just fine. They brought bread and some type of garlic spread to the table, which was great to snack on. We went for the risotto on the margherita pizza and the risotto was the winner by FAR. The pizza wasn't bad, it just wasn't anything to write home about. Very little basil, bland mozzarella and way too much sauce for my taste. However, my future mother in law got the Bianco pizza which came with roasted spring veggies and aged balsamic - awesome!We'll definitely be back - probably for drinks and appetizers on the patio!"], ["Andrea T.", "I must first acknowledge to you dear reader that I am not a fan of italian, it must be very well done Italian for me to even enter. They brought out bread we were not crazy about so they substituted with crostini, don't hesitate to ask for the same. Then we had the brussel sprouts which were accompanied in a lemon cream sauce that really perked them up. Definitely would get the sprouts again. We also had the arancini, which were really good except the sauce they were served with was cold. Not sure if this was intentional, but they were flavorful enough to be eaten sans sauce. The sommelier was very patient, I don't know a lot about Italian wine, so it took us a bottle to get to one we liked. We went with a lovely Barbera. Then we shared a small plate of the carbonara. I love carbonara. This was good, but not outstanding. The desserts can definitely be passed up. I would come back, but for only small plates and drinks at the bar most likely."], ["Rebecca T.", "I am very picky when it comes to Italian cuisine and I was very impressed with my experience. The wait staff were all very polite and extremely knowledgeable. We had the Brussel sprouts, prosciutto San Danielle, and mussels to start. All fantastic. We followed with the arugula, kale, and beet salads. Again all phenomenal. We finished with the lamb shank, veal, and Bronzino. The veal being my favorite. Absolutely exquisite execution. The wine recommended by our server was perfectly paired with each of our dishes. This is hands down my favorite Italian restaurant in the Raleigh area. HIGHLY recommended! We will be back again very soon!!"], ["Brandon S.", "The food here is phenomenal. The only reason it doesn't get five stars is because the service did not match the quality of the food. The waitress might have been new or having an off night. Either scenario is completely understandable. It's a good thing the food more than made up for it. I will be back. Although, I hope to get better service."], ["Yeshanth J.", "I was here on a Thursday night and assumed that it wouldn't be crowded. I was proved wrong when I landed there. The place was so noisy inside and outside. We took a seat inside and the decor was pleasant. We had to shout to order. Most often, the waitress got it wrong. I had ordered for a beer and I had repeatedly remind the waitress about it. We had ordered Bruschetta and Brussel Sprouts. I wouldn't recommend Bruschetta. It is not like the regular one. I think the barbaque sauce spoils the taste.However, brussel sprouts were amazing ! I have never one like this before. For small plates, four cheese ravioli was ordinary but the gnocchi stood out be the better one. Goat cheese filling and the pork sauce made it taste good. For dessert, the lavender ice cream on pear was ordinary.On the whole, an ordinary experience which had its moments to impress but fell short."], ["Jami D.", "Amazing place!! The husband and I planned a short trip to Raleigh to celebrate our anniversary and we came here for a nice dinner. The atmosphere is great and our server was so delightful! We really felt so special dining here. I had the caprice salad and lamb shank for dinner, both would be highly recommended! My husband did the chefs special three course meal with a type of salmon antipasto dish, cod stuffed pasta primi and a rack of lamb secondi (I hope those are the correct terms). It was all delicious!! We are huge lamb fans and it was fabulous. The tiramisu made for a nice ending to the dinner. This is on the pricier side of dining for the two of us, but for a special occasion it turned out to be well worth every penny!! And some complimentary homemade limoncello brought the night to a good close. So please and we look forward to dining again :)"], ["Luke R.", "Don't do it. Just don't. One word to sum this place up: bland. Started with a heaping serving of muscles that barely tasted the part. Their meatballs were mediocre at best, salad was full of lettuce that shouldn't be served in a restaurant charging what they do and the main course of pasta in a bolognese sauce that failed to impress. Then came the cherry on top... The bill."], ["Randall L.", "Fantastic late afternoon surprise.  Our wait staff was knowledgeable and went out of the way to talk to the chef about allowing us to \"personalize\" our starter without us asking because he knew we were interested in trying a couple of different items.  His recommendations were spot on and the food was incredible.  Probably the best minestrone I have ever had; I really like the way chef uses local  ingredients to regionalize his recipes  The black garlic linquini with clams is excellent and the meat and cheese plate options are worth going back for.  The pear and ricotta tart is outstanding but next time I would definitely order coffee with it.  We will definitely return."], ["Kaushik G.", "We went to Vivace for dinner. The staff was very friendly, and the ambience a big plus. We liked the slowly revolving light fixtures.Our waiter, Martez was helpful in finding out if the dishes had certain ingredients. The food itself was good, though the portion size could have been more. Overall, our experience at this restaurant was a pleasant one."], ["Melissa C.", "Service was efficient and fast. I had the 4 cheese ravioli and sangria. The pasta was delicious. We had calamari which was a bit bland but the caprese salad was good. Entire experience was good. I recommend this restaurant and will return."], ["M L.", "Yum.  Any restuarant that can make brussel sprouts taste amazing is a place everyone should try!  The fig and prosciutto pizza was delicious. I am very discerning when it comes to good food, I usually end up unhappy and wishing I were back in Chicago so I could find good food. However, vivace was a great find and the food and stmosphere was very nice. The wait staff was amazing. Its a great plae to meet friends. Get there early as the outdoor seating fills up quickly.  I cant wait to go back again."], ["Brian G.", "We are big fans of Vivace -- it's always just an easy choice when we are North Hills and we were there during lunch time on Friday. It was a beautiful afternoon and sitting at the bar with the windows open was the way to go. We had a perfect view, had a couple nice cocktails and an easy lunch there. Both the wife and I got salads this time around.Bar tended was easy to talk to and we caught a little bit of the NCAA basketball that was going on as well -- they are not a sports watching venue though (they have a smallish TV) and the sound they can't play through there system which seems odd.The food is solid, the people are pleasant and you can't go wrong with the location right in North Hills. We love going by when we are down in Raleigh."], ["Linda F.", "Wonderful restaurant!  We were walking by and stopped for lunch on a recent visit.  It was so delicious, we returned for dinner that night!  We have NEVER done that before.  Our teenaged granddaughter was as thrilled as we.  Lovely people, nice atmosphere, and the FOOD is so special.  Some of our favorites were 4 cheese ravioli, veal saltimbocca, roasted beet salad, raviolettes, pizza, risotto.  If there were a direct flight, I'd be there for dinner."], ["Jewel R.", "I was looking up restaurants in the North Hills area to grab dinner with a friend. (I tend to use Yelp for that, quite honestly). I like change so I wanted to check out a place I hadn't been to before since I had already tried most of the other restaurants in the area - at least as far as the North Hills shopping centers are concerned. Vivace seemed like a good choice, and I really enjoyed their streamlined Italian menu from checking out their website.It was super busy when we went - which was to be expected since it was around 7pm on a Friday night. That was no big deal. I would rather it be busy than completely dead - then I know the food probably isn't worth it. After a couple of minutes of waiting at the bar, we were able to grab a seat there and decided to just order our food from the bar instead of waiting for a table (I actually kind of prefer sitting at the bar - closer to the alcohol, duh). I got the Parmesan Gnocchi which was PHENOMENAL. Seriously, it was so good that it was all I craved for the rest of the weekend. I had never tried gnocchi before, but with a friends recommendation I took the chance. The atmosphere was great as well. The bartender was so sweet and eager to throw in his two cents on what we should try as far as drinks go. I would definitely come back again and I am not someone who likes to hit up the same restaurant twice - unless there is something really, really special about it. Clearly that is the case with Vivace. I will also recommend it to any coworkers or friends who are dining in the North Raleigh area."], ["Peter H.", "Really neat atmosphere. Today the weather was warm and they had the doors and sliding windows open at the bar and tons of people sitting outside. The food was excellent drink selection was fast and our server was very attentive. Appetizers were around $11 each and entrées were $25-$30. I had veal scallopini which was excellent. I'll be back."], ["Chantoozie C.", "We were invited to dinner at vivace by a friend in the biz who lives locally. She Had been to vivace numerous times and raved about it, so being in the biz ourselves, we were excited to try it out. It is a stylish atmosphere with open kitchen, our server Kevin was sweet, but blatantly inexperienced. We were informed that he was a bar back and doing great as a server ! We had to ask a few times for more sparkling water (when we asked the server of the next table, a tall guy, he was obviously not happy with the request) also asked another server nearby and then our server and eventually, some 20 minutes later we got more sparkling water! the wine I initially ordered was not available and I was advised that for $50 more I could have a different vintage! Then after I tasted the wine the other two glasses at the table were poured and the server left mine empty! Food was warm when served and I could not eat my ravioli as it was way too spicy, To the point where it overpowered the whole dish. Quail was overcooked, fig pizza was good, carpaccio was good, needed a little salt, risotto had no seasoning and was oily. It just seemed one thing after another was not right and our friend was embarrassed for bringing us here. A female (manager??) came to the table and offered us free dessert which we declined, after our server Kevin had already offered us dessert. We weren't looking for anything free or comped, just good food and good service, which seemed to be \"on vacation' with the Labor Day weekend!"], ["Yvonne C.", "Came on a busy Friday night for the first time, and be warned, if you want to make a reservation make it well in advance. Upon arrival the restaurant was packed and bustling with activity! The interior is a bit small and won't fit very many parties (reservations) but also has a nice outdoor seating. Of course it was raining last night, but I imagine on a nice Sunday morning it would be beautiful. My party of 4 had to snag seats at the bar, which we did not mind. The bartender (didn't get his name) was great! Attentive and very willing to help, what more could you ask for? I enjoyed the agrodolce cocktail while my friends had their wines and beers. No complaints from any of us.We started the night with a delicious bowl of steamed mussels and some beef carpaccio. The mussels were excellent, tasty and not too dry with some very delicious wine sauce. Pro tip: dip your bread in that sauce and you will NOT regret it! The beef carpaccio was also delicious. I had never had this before, and the raw meat was a surprise but just yummy. My only complaint? It went away too fast.For the entree I ordered the risotto funghi, being a mushroom lover. The dish was definitely very good but not amazing. Somehow I forgot I'm not a risotto lover so I won't be ordering that again.  I found the appetizer portion to be filling and a good size. Another dish I sampled was the braised pork shoulder which I just loved. Meat was tender, great flavor and savory."], ["Donna S.", "Visited VIVACE during restaurant week. The meal was amazing from soup to nuts! Service was exceptional. The only reason I did not give it five stars is because I was seated at the worst table in the place (right next to that huge pillar) even though I made reservations two weeks in advance! What' said girl gotta do to get a decent table in this town?"], ["Joel R.", "Enjoyed (stretching the term here) a late brunch here at Vivace with the family. Hopes were high in our crew for this restaurant, but our meal turned out disappointing. The basic summary is that it took a while for us to be seated, food service was slow, and the brunch menu wasn't very good. Everyone here was nice, however.Salads came out first and were tasty. Most in our party went with pizzas for our main course and found them wanting. Perhaps best of the lot was my niece's margherita:  not usually good sign when the toppings are taking away from your product. Worst on the table was the sausage and egg pizza, ordered by yours truly. I actually left feeling a little ill.We had crossed the threshold from brunch to lunch hours by the time we had arrived. If we had gone with the latter, perhaps everything would have turned out for the best. Sweet atmosphere, though."], ["Sarah P.", "Sooo delicious and very fresh food great atmosphere. Make their own cured meats, cheeses and gelatos!!!"], ["Jennifer S.", "Hands down some of the best Italian food I have had. The bruschetta is a must and the pizzas are to die for! Will definitely be visiting this place frequently."], ["Hoops C.", "Overall there are better selections in the area Bar service for dinner  is sub par.. If your not a local good luck getting attention.Not pure Italian"], ["Brian S.", "Great staff, great food and great environment especially when the nice weather is here. The outside seating is perfect and not too loud. The manager Scott is always helpful and you can tell he cares about the experience."], ["Karla J.", "This was a nice Italian restaurant. Pretty average and surprisingly vacant during mother's day. I plan on returning since we visited during a fixed menu. Maybe their regular items are better."], ["Paul B.", "Save your money unless you want attitude.  Food is ok at best. alcohol is expensive. Only place I have been to where I had to whistle get the service people to stop talking to each other."], ["Briana B.", "I absolutely love this place! It is the perfect place in the perfect location for a romantic date night or dinner with friends. The decor is beautiful and the availability of outside seating makes it the perfect place for dinner when the weather is nice. I have tried a couple dishes here but favorites are the flatbread pizzas. I have tried each kind and you can't go wrong! The sangria is great as well and priced very reasonably. The white bean dip you get before your meal is a nice change from regular bread and butter."], ["CM P.", "First time there just a few days ago. it was OKAY place. Our server was very nice, my salmon was cook just right, and the pasta my husband ordered was good. the bruschetta was too fatten for me, I only had one slice of it. Soup was a bite salty for both of us. Server who brought out our dessert was not very nice, he just dropped the food on our table and left without saying anything. our dessert was poorly garnished. YOU EAT WITH YOUR EYES FIRST!It is a open kitchen restaurant, but the chefs there are not wearing hats, or gloves, and drinking cups were without lids on. By law all RTEF; started Oct. 2012 (READY TO EAT FOOD) needs to be handle with clean gloves. All chefs even the dishwashers need to wear hats or hair net. And all drinking cups should have lids on them."], ["Leilane V.", "Would not have found this place without the recommendation of a local!!! Fabulous vibe, food, service, ambiance - The Mussels remain my absolute favorite!!!Wine list impressive!!"], ["Ashley W.", "I'm updating my review from earlier in the year that a second time dining here was even better than the first.  Weather was nice this time around, so we were able to sit on the patio.  All the food I saw come out to other tables looked excellent.  I got a flatbread with roasted chicken, figs and garlic - innovative combination that was quite good!  My companion once again got a risotto, crab this time - also delicious!"], ["Fred B.", "This  Italian restaurant in the North Hills Shopping area of North Raleigh was described as hip in one review I read, and it is that. It has a very active (read LOUD) bar scene, but not in the \"meat market\" sense of that term - lots of older folks, suits, same sex groups, politicos, and 1 Episcopalian priest, in collar. In addition, the seating is close, the tables for two are small (more like 1 1/2), so romantic is not a word that comes to mind.BUT, the food is very good, and the wait staff even better - knowledgeable and attentive. The Calamari Fritti was among the best I've ever had - crispy and tender, no easy feat apparently. The Proscuitto Di Parma was excellent, though like cow bell, I needed more melon. My Alice had the Veal Saltimboca, which, while very good, is also very rich, and this version had more mushrooms than Fresh Market. I had, simply, the Spaghetti with meatballs, and it was also excellent, with a superb tomato sauce.I would go back, but only with a group who's conversation I was content with missing a fair portion of , beside a table I heard way too much of. Still, it is about the food."], ["Steve T.", "A wonderful find on our visit to Raleigh, NC. Recommended by the concierge at our hotel. We dined here 4 out of the 6 nights we were in Raleigh. We highly recommend it. Personable staff, very good food at reasonable prices."], ["Michael M.", "This restaurant is fantastic in every respect. Quality, price, service, atmosphere. The bar scene is vibrant, upscale and comfortable. Wine list is good. Appetizers are all less than $10.00 which is unusually low considering the quality and quantity of food. I will definitely go again."], ["Guy C.", "5 of 5 stars (excellent, fine dining).(see explanation of ratings below)Always one of our favorite places.  Nice patio, but tough to get a seat there.  Vibrant bar scene, too.We like sitting back at the kitchen bar (where you can see all the action).My wife claims they have the best calamari in town.  It's tossed with slivers of lemon and red pepper.I like their pizzas: thin and crisp, baked in a wood-fired oven.  They now serve five different varieties.They also have house-made \"cellos\".  You've probably had lemon-cello, but why not try strawberry or orange?This place is the jewel in the crown of owners Kevin and Stacey Jennings.  In 2009, they opened a 2nd Vivace in Charlotte and I hear rumors of a third somewhere in Florida.About my ratings:Only fine dining establishments can garner five stars.  Until yelp realizes that a fast food joint cannot possibly be ranked equally with a $100 per person place, I need to draw the line somewhere.  If we were only talking about the quality and presentation of the food, it would be a different story.  But, as we know, yelp's rankings take into account the entire dining experience.Therefore, I divide restaurants into three categories (and I wish yelp would do the same):1) fast food and \"fast-casual\" (no table service )2) casual and \"polished casual\" dining (table service)3) fine dining (linen napkins, no plastic cups, no TV's in dining room, typically more expensive than casual dining)Fine dining can earn a max of five stars.  Casual dining can earn a max of four stars.  Fast food can earn a max of three stars."], ["Shannon P.", "I was surprised to see that I've yet to review this gem of a place!  I've been here many times and have never been disappointed.  There really is something for everyone - even if you aren't in the mood for pasta...you'll find many other spectacular options .  As for the pasta - they make it all in house, so if you are wanting pasta, you're in the right place!  We went the week before Christmas to enjoy their annual \"Feast of the Fishes\".  According to our waiter, Italians feast on fish the week prior to Christmas instead of Lent.  This was a feast indeed!!....7 courses with wine pairings for $75/person.  The portions were HUGE.  I was expecting each course to be on the small side since there were 7 courses...each consisting of fish/seafood.  We had leftovers for 2 days!  Some of the highlights were: Seared ahi tuna with grilled fennel, chive oilSquid Ink linguini with crabRisotto Milanese with smoked shrimp & winter mushroomsThese were just a few of our favorites.  We'll definitely be doing this annually!  The regular menu was available during this event as well and you could dine at any time - no set 'start' time.  Everything here is always fantastic!  The warm, cozy ambiance can't be beat and I love seeing into the kitchen....feels like you're family."], ["Doug V.", "Was in town for business and looking for  a place nearby that was good and could get me in. All the other restaurants around had hour long wait titmes. I found Vivace tucked into the corner of this upscale strip mall. They were jammed but got us seating for two at the chefs counter. It was quite a show. Seeing them prep all of the dishes with such precision and care. The entrees were terrific. I had the pork and my colleague had the scallops. We were bith very happy. The wine selection was vast and good. Finished with the molten chocolate cake with hazelnut gelatto. Both were amazing. I would highly recommend Vivace!!!. Oh and Josh the waiter was greAT!"], ["Steven C.", "Love the Pizza and Calamari. Great service and atmosphere. I enjoy going to Vivace for after work drinks and appetizers."], ["Allen M.", "My girlfriend and I ate here for a date night. The food was simply amazing. She had the Slow Roasted Pork Tenderloin. I cannot explain in words how tasty this dish was. I had the Swordfish Diablo which was the special of the night. The Swordfish was cooked to perfection and I left nothing on my plate!Our waiter was by far one of the best waiters I have ever had. If you go, ask for John! His knowledge of the menu and pairings was astounding!!!!"], ["Bruce G.", "I have been to Vivace twice now, once just for drinks enabling me to check the infamous bar scene and recently to sit down and actually have a decent meal.  Vivace ...('I always want to pronounce it Versace after the dead designer guy')...,  is an upscale Itialian resto located in the North Hills area of Raleigh. The décor is exquisite with a large patio area and fountain in the middle. The inside is posh as well with modern lighting and tables, a large bar area, and dining table area separated.  The dining area is actually kind of small and dimly lit, but this can be seen as an asset for a romantic evening I suppose. Now for the aforementioned \"infamous scene\"; If you think 'Cougar Town' is just a t.v show you need to come here on a Thursday night in the Summer time like I did. The bar area and outside patio are crawling with these feisty creatures waiting to attack. I was also thinking that if there was ever going to be a 'real housewives of Raleigh' reality t.v show this would be the place for the producers to come to look for talent! California may have the Silicon Valley, but Vivace has the 'Silicone Valley'!!  O.K you get the point, I will stop now.A great ambiance, décor and cougars are one thing, but how is the food? I was kind of expecting this place to be all flash and no fire, but I was actually pleasantly surprised with my meal there.  I started with the Caprese salad which consisted of roasted tomatoes, fresh mozzarella and basil with a vinaigrette dressing. This salad was very light and delicious.  I highly recommend it to start a meal. I also shared a margherita  pizza with my friends and again was impressed. Hot and delicious pizza,  with excellent flavor, fresh ingredients and a tasty crust. What more can you ask for in a pizza?I will continue to come to Vivace for the food, ambiance, décor, social aspect and the cougar-ific ladies!"]], "Valentino's Food Truck": [], "Assaggio's": [["W L.", "Delicious and great service.  One of our child's favorite places.  Used to ask to go here after every dance class. Garlic rolls!  Lucky to have this around; I'm always surprised at what upper Glenwood furniture row is able to attract and keep.Go early on a Friday night - very popular, long waits, and noise."], ["Alexa L.", "I only got the pizza here so can't speak for the rest of the menu. We ordered a large size pizza and we wanted to split it half and half of two of their gourmet pizzas but we were told they couldn't do that (gourmet pizzas have to be ordered whole) So that was disappointing. So we ordered one whole large gourmet pizza--the mona lisa. I'm a huge lover of margherita style pizza and that's what i was expecting. But if I had to sum up this pizza in one word, it'd be TOMATOES. I'm used to tomatoes being diced up atop the pizza, but this was sliced tomatoes covering the pizza. And so the the tomato slice to mozzarella chunk ratio is like 5:1. I was disappointed. My friend got a cheese and pepperoni pizza and that was delicious. So I think it was just our choice. So i'm just throwing this out there: don't get the tomato pizza! (aka mona lisa)Service was great though, which is another reason why i'm giving this place high marks. We ordered a large pizza, but they accidentally prepared us a medium size, so we got that one free and they went ahead and made us a large to bring home. Very nice!"], ["Jami C.", "We decided to give this place a try after driving past it nearly everyday and the positive yelp reviews. We ordered on the phone a large NY Style Pepperoni and Mushroom with a side of garlic knots. (Only because of how much other Yelpers raved about it!) The order was said to be ready in 25 minutes. When we arrived to pick up it was piping hot and ready to go.  The garlic knots were fluffy and moist, you must give them a try! The 18 inch pizza was HUGE. The slices had the perfect amount of toppings and it wasn't as greasy as other ny style pizzas I've had in the area. We will definitely be coming back here to give more of their menu a try."], ["Tyler S.", "By far the best spaghetti I've had from a carry out restaurant! Assaggio's definitely gained a new customer!"], ["Mo' W.", "Never disappoints! This place has great pasta, always enough for leftovers! The pizza isn't greasy and it is served hot! Also, the tuxedo cake is my favorite!"], ["Chip R.", "Pasta dishes were delicious and I had leftovers (which almost never happens). With each pasta dish you get garlic knots and a side salad so for the price ($12-$15) this place is a steal."], ["Mandy H.", "Assagios has the BEST garlic knots!!  They come free with your entree.  I always get the gnocchi in a pink sauce- portions are so big and I am usually so stuffed with garlic knots that I have plenty to take Home.  Reasonable prices.  The bruschetta was good- a little too tomato-y for me- but the bread was great!  Our server Tom was exceptional and hope we sit in his section next time!"], ["Joshua S.", "This place is amazing lets just start with that. First the garlic knots taste heavenly they have such a wonderful taste and are coated with chunks of roasted garlic. The salads are fresh and are crisp with a variety of dressing options, but are good enough to eat with out any dressing at all. I had the penne alla vodka the pasta was perfectly cooked and the creamy tomato sauce added the perfect taste and texture to the dish. The portions are generous and you are glad they are knowing your lunch is going to be great the next day! If you are in the area this place is worth the stop so come in and try it."], ["Kelli H.", "Fist time here! Was a bit hesitant after ordering at the counter for lunch and not being seated but...WOW! Ordered off the dinner menu Chicken Parm with salad and garlic knots! Salad was fresh and plate chilled, garlic knots were awesome but the chicken Parm was the star of the show! Pasta was perfectly Al dente and sauce was  not overly sweet. The chicken was lightly breaded and cooked to perfection! I have lived in NC for most 9 years and this is the best Italian I have ever had. Waitress had many tables but knew how to handle everyone with ease! This is now my new go to Italian place. You MUST try!"], ["Christen S.", "I love that this place is so close to our home. Their Chicken Piccata is TO DIE FOR. It comes with a choice of pasta (usually linguini, spaghetti, or penne) and garlic knots and side salad! When my husband and I feel like having a hot date night in, we order Assagios to go. I must add that we have also ordered their pizza twice now and it beats all the other NY style pizzas we have tried in Raleigh."], ["Stephen E.", "Friendly staff and best kept secret in this area. Where else can you get two slices of pizza and a drink for $6? You can also substitute one of the slices of pizza for a salad. They have these specials at lunch until 4pm. Garlic knots are bangin!"], ["Viktoriya M.", "Interesting place. I'm not sure about the atmosphere, we didn't really feel cozy or relaxed. The food was pretty good except for the salad. It looked not fresh. Average place with average food. Good place for a quick stop."], ["Michaelyn J.", "The food is excellent.  I was on my way to Olive Garden and decided to stop here since I have my clothes dry cleaned next door. The waiter is nice and very  attentive. My food came out fast and delicious. The portions are great and similar to what Olive Garden has. Pricing is the same as well. Overall I am impressed if you are in the area and starving for Italian, then Assagios is the place. #SupportLocalRestaurants"], ["Richie H.", "It was our first visit and I was looking forward to it after reading the reviews. The server was very personable and took great care of us. The atmosphere is nice and cozy, but not at all pretentious. Then there's the food... I don't know how it could have been any better. I'm sort of picky when it comes to sauce and REALLY enjoyed the veal parmesan. My girlfriend had the chicken piccata and loved it. The portions are generous too. We WILL be back."], ["Aisha C.", "May have lost a loyal customer.... :(I literally oerder delivery from Assagios 3 to 4 times a month... sometimes more. I always order Lobster Ravioli and or Shrimp Alfredo Pasta. Today is Monday, I ordered the same meal (LobsterRav) Friday and received two completely different meals. Todays rav is hard, dry and unappetizing. I have to use a knife to cut them open so I can eat them. Usually I can use the side of my fork. When I opened the lid, all I saw was white, not a seasoning in site. I dumped some garlic powder and Mrs. Dash on it to try to stomach it.  I dont know if I will even finish this meal, I really dont want it. I'm so upset. This is my favorite restaurant. I don't even mind the 1 hour wait times even though I'm right next door. The food has always been worth it. Until today. I spoke with a manager and they've iffered me $5 off my next order.... I'm just not sure there will be a next order.Crisis Handled: Called and complained again. Manager remade my order and gave me a free slice of cheesecake. Thank you, sir. This remake is perfect."], ["Wei L.", "Was good. Those jumbo shrimps were huge. Oh man. Pretty good price with 2 sides. Gotthe shrimp fra diavolvo ($18). That dessert was $3.50. First time trying it. Was good. But I'm not much of a cream cheese person. Too much for me. Too much sauce in the shrimp fra diavolvo but thats just me. Maybe some people prefer a ton of sauce. Friendly waiter and host. Clean place. Was new to Raleigh and haven't had Italian in a long time. Pretty good salad with 1000 island sauce.. Interesting."], ["Emilie U.", "Baked ziti is the best I've ever had, and their garlic knots are AMAZING!!!!!! Great place to dine in or get take out!"], ["Jennifer H.", "A friend and I ordered delivery so I can't speak to the customer service or the atmosphere of the restaurant, but the food was amazing! The fried ravioli were delish-and the marinara dipping sauce was great. We ordered the Antonio-yum,yum, yum! The blend of toppings gave the pizza wonderful flavor! They were also very generous in the amount of toppings they put on the pizza. I am very much looking forward to checking them out again soon!"], ["Lori D.", "We went here today for an early dinner. Hubby had the lobster raviolis and I (boring I know) had the spaghetti with meat sauce. Hubby wanted to lick the bowl after he devoured his food. Mine was excellent as well. The pasta is fresh and the sauce was very tasty. We will definitely be back."], ["Suzanne C.", "I have never felt compelled to add a review to Yelp before but after ordering a pizza from Assaggio's  last night that was $44 before tip, I am flabbergasted. $3.00 per topping? I guess we should have read the menu more carefully but it seems at first glance that it will be reasonable but $3.00 each to add mushrooms and onions and banana peppers?? And a $3.00 delivery fee??? We are just baffled we could order a pizza that winds up at $44 before tip. The pizza was pretty good but it sure as hell wasn't worth $50 with tip. Never again."], ["Mi M.", "The opportunity to pay $8.50 for a tiny sandwich at lunchtime left a bad taste in my mouth. Don't be fooled by the implied option of a \"half\" or a \"full\" sub on the menu, we got one of each and they were both about 4 inches long, clearly cut off the end of the same baguette. Is this Cold War Russia? Is bread being rationed? Have you heard the country is having hard times? Be decent and give folks some value for their money."], ["Melanie D.", "This place is similar in style to any other Italian restaurant, particularly Raggazzi's and the like.  My family ordered some chicken dish and some pasta.  Very standard.  The lassagna was heavy on the cheese, with not a lot of meat.  Very heavy - I didn't even eat that much and it's sitting heavy in my stomach.It's half deli-style, half pizza parlor, half light-service sit-down restaurant.  They do a good job of separating the different parts.  The sit-down part does have a separated, softly lit portion, as opposed to the brightly lit deli section.One plus - it's not as salty as a lot of other Italian restaurants I've been to."], ["Allan H.", "I have been here several times and find the food always good and the service attentive. Their Eggplant Rollatini with Pasta is to die for. It is enough to share."]], "Piccola Italia Pizza & Restaurant": [], "Bella Monica": [["Elizabeth H.", "Nothing I can't make myself. Way over priced. No white sauce pastas...Service is great and they're very knowledgeable, but I asked for Alfredo once and they acted like they were above it and I was an inconvenience for even asking..."], ["C H.", "We discovered the restaurant by accident a few days ago and decided to try it for take out tonight. It is tucked away in a Harris Teeter shopping center. I was excited for the Copper River Salmon and thankful they could accommodate a dairy allergy. I think they seem pretty gluten-free friendly, too. We also got the brussels, mussels, and shrimp appetizers; the seasoning to the Shrimp Napoli was a favorite. Based on the wait on Saturday just picking up takeout, I'd highly recommend planning ahead with a reservation. The inside is small and they also had patio seating. Definitely worth returning to dine in house for the full experience."], ["Jeremy A.", "They are tucked inside a strip mall that its tough to find unless you know what youre looking for. Just keep an eye out for the building that says \"pizza\" on it. We got a pizza for takeout and I thought it was ok. Even though its called Neapolitan style I could tell it wasn't singed on a super hot coal fired oven or anything.I really think this place shines for their other dishes which seem pricey but ill be sure to go back and see if they are worth it. Parking Lot can get busy depending on if you go at peak time or not but you should always find a spot."], ["Rebecca B.", "Best Italian food I've ever had! We lived in Raleigh for a couple of months for my husbands job and found this gem!I still dream about their bread and pizza. So authentic and delicious! The servers are very nice and accommodating. We had our kids with us and they were very polite and quick so we could eat and get out of there!! If we're ever in Raleigh again this will definitely be a spot I hit up!"], ["Whitney S.", "The eggplant parm here is to die for.  Their sauces are incredible, very flavorful.  I also love their Caesar salad is incredible and unexpected.  The servers are attentive and efficient.  Great atmosphere, as well. Good for a small group or romantic date night.  I would suggest getting a reservation as you may have to wait a while if you don't."], ["Stan P.", "Very good food and service. We had both the lasagna dishes and were pleased with presentation, taste and size."], ["Rebecca D.", "This was my go to place for a great meal but  it isn't worth being on hold for five minutes to make a reservation and nobody picks and then trying again and being put on hold again. Sushi Thai here I come."], ["Greg O.", "Would have given it 3.5 stars but Yelp doesn't like the halves.  Finally got to try this place out of my list of pizza and Italian places to try.  Chicken was moist, bread was pretty good, and they give you a you-know-what load of pasta.  Got the baked ziti and it was loaded with cheese and piping hot, just didn't love the sauce.  But I'd definitely go back here and try the pizza to really know if I will continue to go back.  Service was fine, don't like to nitpick on service like others do, unless it really is that bad.  The downside was so many flies outside when eating.  Not the restaurant's fault I'm sure, but just something to be aware."], ["TravelPro P.", "I have been coming here for 9 years on pretty much a weekly basis when I am not traveling on business. I love both their GF and regular focaccia bread, it is really a nice touch and delicious drenched with olive oil and spices.I love their chicken parm sub, steak with asiago cheese sub, flatbreads, and the whole wheat penna pasta dish (I add feta). Often for lunch I will just get a house salad with shrimp and it is just right.The service on average is fantastic (they pretty much know my order by heart). They have had a few periods where the struggled with getting some experienced wait staff, hey but doesn't every restaurant, and they always get back on track. So if you maybe had some service issues in the past, give them another try. Although I have no gluten issues, I have a friend with celiac and she feels safe eating here, and they are diligent in avoiding cross-contamination. She is the one who turned me on the the GF bread, as I would have never thought to try it on my own. Give it a try sometime if you are feeling adventurous.They are a local mom & pop who takes pride in being a neighborhood restaurant, an I hope to be coming here another 9 years!"], ["Rachael L.", "I have been going to Bella Monica for years, the food has not changed, same menu and quality, however the service has gone down hill. First off , reservations are needed but you can't count on actually sitting at the time of your reservation or within 5 minutes of it. I have had to wait over 10 minutes to be seated for a reservation at least 3 times in a row now, worst wait time was 30 minutes. In the past they were very aware of this and came to you and apologized a number of times , gave you free appetizer, dessert but not anymore. The last experience we waited 30 minutes, had to go in and ask about our table ( no one updated us) and at that point were given a free drink. We sat down and had to ask for bread and the service was horribly slow, we had empty water glasses and very limited interaction with our server, who barely came around.I think Bella Monica has good food and that is what keeps people going back, the service is declined and it doesn't appear as if anyone is concerned about that.  If you want to go I would recommend going for lunch, dinner time seems to be a disaster, I don't think they can handle being that busy, whether it is the wait staff , the kitchen staff or a combination of both, they can't handle being busy ."], ["Carol B.", "I saw e yelp reviews and wanted a nice lunch. This was the perfect place. Unpretentious neighborhood restaurant . The meatballs were delicious and wonderful gravy tomato sauce . My friend had a Caesar salad with chicken . She said it was juicy and cooked perfectly.  The owner came over to check on us and I learned that it is family owned. They have been in business for 15 years and are always full for lunch and dinner. The meatballs are locally sourced organic beef and home make. The sauce is also make in house. You can see why they have been voted the best Italian local restaurant for many years. I love that you can sit out on the covered front patio   I will definitely will be back"], ["Katharine B.", "This is hands down my favorite pizzeria in Raleigh. I have been coming to Bella Monica to dine for 7 years and love my meal and experience every single time. I highly recommend making reservations because it is a small restaurant and fills up quickly, especially before a concert or PNC venue. Celebrating birthdays here is always a treat as well because they write your name on the sidewalk and surprise you with cannoli. The pizza is absolutely delicious and you can pick your toppings or order from the flatbread menu. The regular pasta entrees are also top-notch and the homemade gelato is even better. Indulge and buon appetito!"], ["B H.", "We loved another great dinner at Bella Monica tonight!  They have always catered to my wife's Gluten free needs. She loves the gluten free focaccia bread they have and the gluten free pesto and cheese ravioli! The gluten free menu for her is full of other great choices as well and of course desserts.The polenta was great as an appetizer tonight and the pumpkin ravioli was a great seasonal treat (not gluten free) for me.Thanks as always for a great anniversary dinner, staff was awesome down to the little heart confetti they sprinkled on our table!"], ["Kate T.", "I wish you could give half-stars. This would get 3.5. First of all, the restaurant is poorly labelled. So, I hope you're a hawk eye at reading dark letters on covered doorways. Second, the food was pretty good. I've had better Italian food at real Italian Bistros in America but, this one wasn't making any outrageous claims to fame. I wouldn't have a special occasion  dinner there, nor would I go out of my way to recommend it, especially at the price points! That said, the service was very pleasant, but a little slow. All servers and staff seemed quite friendly though so waiting wasn't a deal breaker. You could do worse (Enrigo's in Waverly Place) but you could do better (Daniel's in Apex)."], ["Lauryn C.", "I've always been a big fan of Bella Monica the food is consistently good and the service is always friendly. Being back in the neighborhood I love having this great restaurant so close by. What I love about Bella Monica:Great foodGreat serviceAwesome dessertsGood Italian food in the Triangle is hard to find this place is worth the wait.What I don't love about Bella Monica:It's always packed and there is always a waitIt's too smallThey charge a fortune for add on's to salads and pasta (chicken, shrimp, salmon $10)If I'm paying $12 for a salad I'm not paying another $10 for protein yikes that's a $22 salad a little steep if you ask me.My last trip I had the whole wheat pasta no chicken, but they still charged me $17.99 I think they should have taken a little off since I asked for no chicken. But the food was delicious the cannoli was to die for and I really enjoyed our friendly server and the manager who stopped by at least 3X to the table. They really do try to go out of their way to make you feel welcome here. And they do a good job making this a real neighborhood restaurant. I love their flatbread pizzas they are unique and super tasty. When they have it you should definitely try the olive oil gelato. I order take out from here as well and some other hit menu items for me are the garlic soup, and antipasto. If you are looking for some good homemade Italian food make a reservation and check out this little gem."], ["Monica H.", "Y'all, how does this place not have 5 stars? It is phenomenal. Also, the name is very good (though I may be prejudiced, as a fellow Monica).Olives on the bar for snacking, a huge wine selection, and the BEST garlic and cheese bread I've ever had in my whole life. I ordered the ziti, which was big enough for me to enjoy the next day as leftovers -- a very happy surprise! Be sure you make reservations for dinner -- I walked in at 5:45 on a Tuesday night looking for a table of two and had to sit at the bar! Still, no complaints -- they have hooks on the bar for your purse and backs on the chairs."], ["Kimberly D.", "Amazing!! I'm from CT and this is the best italian ive found!!! Reallll sausage on the pizza not crap! So impressed."], ["Melayna D.", "The whole wheat pasta tasted kinda weird. It was chewy and the veal Bolognese was very acidic. The salads also came with close to zero dressing. We were super excited for the chocolate cake but it was literally just a huge piece of chocolate fudge that was too heavy. There was a tiny bit of \"raspberry sauce\" drizzled on the plate."], ["Angela H.", "I feel like Bella Monica is one of North Raleigh's best kept secrets.  Since it's not downtown BM doesn't get the hype like other establishments on Fayetteville Street.  But I truly love this place..their mantra \"Live Love Eat\" is what this place is all about!! Not only do they have an excellent selection of wines but the olives are great finger foods to snack on while you're waiting for a table ..if you're like me and you don't always make a reservation so you can take in all a restaurant has to offer...The menu has your classic Italian dishes and their pizzas are ahh-mazing!  I recommend one of those if you're not super hungry and I also recommend a Caesar salad to start.  I have had b-day celebrations here and girls nights with plenty of vino and I always leave wanting to come back soon for more."], ["Jean K.", "Skip the focaccia bread and dive right into the appetizers or entrees. Definitely not a fan of the focaccia although it is quite tasty in the \"Italian toast\" served for brunch.I have always been warmly greeted at the door, even on our last visit for brunch when we stopped in after a sweaty gym workout. We asked to be seated in the back since we were sporting sweats and spandex but our host still made us feel like close family friends stopping in for a visit. Wonderful, warm, friendly service!The salmon is always wild-caught Alaskan, never farm-raised...thank you Bella Monica! You can add it to a salad and boom, you have a delicious, healthy, satisfying meal. Small bar area where you can sip a glass of wine and munch on a selection of oh-so-tasty mixed olives.Watch your step if you head to the restrooms which are located in the back of the restaurant. The smooth tiled flooring seems to masquerade as black ice, possibly depending on your shoe sole; if you wear a smooth leather outsole, don't say I didn't warn you especially if you're planning a special date night. For whatever reason, I've seen a few near face-plants in the dozen or so times I've been here. Might simply be coincidence, just sayin...Cozy, romantic dining but you better have a reservation if you come on a weekend night or you may find yourself waiting. It's been busy almost every time I've been here but I usually have a reservation and consequently there isn't much of a wait. You can use open table on Yelp. Very convenient. Great service, tasty food including wild Alaskan salmon, cozy, romantic ambiance.Kudos Bella Monica!"], ["Lauren R.", "I can't comment on their pasta or dinner service, but I've been for lunch because I work in the neighborhood and it's definitely one of the best lunch spots around.  Their lunch prices are very reasonable--it seems to turn more upscale for dinner.  Lunch for two will be around $30 with tax and tip.  It's always packed, so you need a reservation.  Even for a 1pm lunch on a random Wednesday.  Despite the crowds, Bella Monica retains the atmosphere of a friendly neighborhood Italian place with a regular clientele.  Probably because so many folks are regulars, it isn't well-labeled (I think the sign just says \"pizza\" up top, or something like that).On to the food--they bring you huge pieces of foccacia soaked in olive oil.  Delicious, but not good for any diet (I also recommend using a fork).  I normally order one of their specialty flatbread pizzas.  All are quite good.  Enough for two servings (especially if you've partaken in the foccacia and you serve the leftovers with a side salad).  I've also had a bite of one of their calzones, which are HUGE and super cheesy."], ["M B.", "The garlic soup was awesome. Very rich and flavorful. Chicken parm was very good. The stuffed shells were also good. The Cesar salad was nice, toasted Parmesan cheese, good croutons."], ["Chris M.", "Fantastic Italian Restaurant outside of the city. Loved the lasagna. Make reservations in advance."], ["Jordanna S.", "First and foremost, we had heard many great things about Bella Monica. We were honestly surprised by our experience, given how well the restaurant had been rated online; we found the positive remarks to be incredibly misleading for this local Italian joint. We had not been expecting what we got in the slightest (I'll go into details in a moment). For those who are reading these reviews and considering Bella Monica for your next dining experience, do not allow yourselves to be disillusioned and mislead. - We couldn't actually locate the place. As far as I could tell, there wasn't a visible sign for Bella Monica; we drove right past it and only happened to see the name on the door. (We should've kept driving.)-  Undeveloped flavors left us wanting more. - Salads completely masked by dressing. Chicken parm was drowned in sauce... And the sauce wasn't even that good. The eggplant we ordered was strange and undercooked; completely mangled. The manager claimed that they simply \"do it differently\" there: meaning, in a completely un-Italian style. All in all, the food was unsatisfactory. - We ended up sending said eggplant back. Our waitress handled it extremely well (she was a sweetheart, honestly, and this review in no way reflects on her service.) but the manager acted strangely. He fought with my grandmother on whether or not the eggplant was \"cooked\"; rather than acknowledging that the eggplant was undercooked, he gave the excuse I stated in my previous statement.Anyway, all in all, I would NOT recommend Bella Monica. 2/5 stars for food, 4/5 service, and 2/5 for management."], ["Emily G.", "Though this restaurant is a little pricy for my taste, it is entirely worth it. I suggest making a reservation because the wait for a walk in is about an hour if you are lucky; a testament to their delicious menu."], ["Sean A.", "It has been a long time since my first visit to Bella Monica, at least three or four years, and maybe I should have just left it at that.  This past visit was quite underwhelming for me.  The service is great, the atmosphere is ok and I did really enjoy the music (although it seemed like Alabama Shakes was the only thing on their playlist).  Our meal started with the homemade bread which was very good!  But then it was time for the main course.  I ordered a flatbread, the one with italian sausage and peppers to be exact.  Unfortunately, it was nothing like I expected.  Flatbreads (at least as I would expect them) are an a more crispy thin crust loaded with ingredients and flavor.  This flatbread was really just a smaller version of a pizza.  It also contained just four pieces of sausage which really wasn't enough for me.  Someone next to me ordered their sausage sandwich and it had a huge helping of sausage so truthfully I was a bit jealous.  The flavor was nothing to write home about either.  All in all this dish just fell flat (like the flatbread it wanted to be).  I will add it to my list of places to try again and maybe next time I will be able to give some more positive feedback."], ["Colleen S.", "The food is great. Had a birthday dinner there and it was wonderful. Make reservations as it gets busy fast. I also had them cater a party and everyone raved about the food."], ["Danny D.", "From the focaccia bread drizzled with olive oil and onions, to the gelato and Kahlua cheesecake, Bella Monica never disappoints. My favorite go-to is the Baked Ziti in the \"Mama's Cucina\" section of the menu. There really isn't a place like it. The design of the place is brilliant, the servers and managers customer service is top notch and really care that you have a good time while you're there. The best Italian restaurant in the country. Go. You won't be disappointed!!!!!!"], ["Sukirti S.", "After hearing good reviews from friends went there on my husband's birthday for dinner. Though the ambience was good,the place was was so crowded and noisy. The service was not that great as we expected. The waitress forgot to place the complementary bread on our table. We had to ask her for the bread. Had their polenta and sun dried tomatoes lasagna. I didn't like the polenta as the sauce which was drizzled on the top was overpowering. Lasagna was delicious! For dessert we ordered the flour less chocolate cake which was out of the world! Will definitely come back and expect a much better service!"], ["Hunter M.", "I arrived at Bella Monica with high expectations after stellar reviews from friends.  As I didn't expect the place to be packed on a Monday night, I failed to make reservations in advanced.  The hostess was very cordial and made sure we got a seat rather quickly.  Great first impression.  That was the highlight of the meal.  Our waiter was obviously new and was struggling a bit but that I totally understand and can forgive.  The food, however, was simply not good.  I think I could comfortably say that I have had better Italian food out of a Lean Cuisine box.  The food was flavorless and sad. There were three people in our party and the only food that was enjoyed was the Brussels sprout appetizer.  Maybe the meal was just a Monday night fluke but I won't be returning."], ["J B.", "Food was good. Was windy outside and waitress told us she could move all the outside tables in after a few minutes.  After 15 minutes she finally tells us the manager would not move anyone inside even in the 25mph winds. Also we never received the bread that other tables got multiples of...good food, but after feeling cheated I will not return.Also pretty pricey at $45 for a medium flat bread pizza and one small meatless pasta dish!"], ["Diana S.", "I have been to Bella Monica several times and loved it on every occasion. They have gluten-free options--not just two but quite a few items--and they're delicious. The wine list is amazing, the waitstaff is professional and knowledgeable, and the ambiance is romantic and just lovely. Highly recommend!"], ["Harleysydney C.", "Wow I just don't get the positive reviews.   Probably the worst Italian meal I've ever had.   The lasagna tasted like it was frozen for months and reheated and this does not make for a fresh taste.   I couldn't even fake liking it. Husband s gnocchi meal bland and boring.   Very disappointing since I kept hearing such raves about the place."], ["Ginger E.", "Awesome food! We felt like we were back in Italy!  Excellent service, this is a new favorite!"], ["Adrianna M.", "great food and good portion size. I'm from Philadelphia and the food was pretty comparable to an authentic family owned Italian restaurant there. Will definitely be ordering from again!"], ["Megan L.", "Wonderful atmosphere and outstanding food. I shared the order of Brussel Sprouts with a friend and had the Eggplant Rolatini as my entree and I would HIGHLY recommend both to anyone! By far one of the best Italian restaurants in the Triangle area!"], ["CM P.", "first time there this past Sat. we loved the eggplant special that day. two other dishes we ordered was okay. our waitress was not very helpful, we don't know her name because she never tell us. Never tell us about the special of the day until we asked. We didn't know we had choice of faccacia or ciabatta bread(no big deal) because she never tell us either. We pretty much ordered our meal from over hearing conversation from the table behind us."], ["Rob C.", "My wife and I absolutely love this place, everything we have tried has been awesome! The mussels are one of our favorites, the last time we went I found a new treat. I have never ordered veggie lasagna before but my mum did and I have to say I had some serious food envy, I will be ordering this next time!"], ["Jillery Ellen S.", "Fabulous pizza and salads. Friendly and great staff. Handsome friendly genuine owner guy. Can't go wrong here!!!"], ["Stephen F.", "Bella Monica has to be my favorite Italian restaurant in the area. The food is amazing and the atmosphere is stellar for all types of occasions for a small group or a date. Service is always superb; if I had to pick one negative, it would be that the restaurant should be larger so you don't always have to make a reservation (but I guess that's a good thing).  Definitely a local gem and go to restaurant when I want Italian. From their Caesar salad to lasagna to tiramisu (definitely the best I've ever tasted), I've ever had had anything I did not like."]], "Cafe Tiramisu": [["Dee L.", "Best Italian food! The chicken saltimbocca is the best I've ever had! Eggplant parm is amazing  too! I. From upstate NY and have missed authentic Italian and This restaurant has satisfied that! Denise"], ["Lauren M.", "Cafe Tiramisu is pretty average when compared to restaurants in the DC area, so perhaps I'm being a tough judge by not giving it a 4. My main qualm was that the veal tasted more like pork. Even my uncle had the same comment. The veal was tough and chewy, not tender and thin like it usually is at other places. I was impressed that they make their own spinach pasta in house; however, they overcooked it. If it had been al dente, I might have given 4 stars. The food just seemed more Americanized than what I'm used to when it comes to Italian cuisine. However, about half of my family enjoyed the meal and the other half said it was just eh, so overall no one hated it. My Italian grandfather was in the group of people who enjoyed the meal. But he likes to eat mushy food covered in sauce."], ["Emmanuel D.", "Cafe Tiramisu never disappoints."], ["Jerry W.", "Doesn't look like much from the outside but it's nice inside and the food is amazing."], ["Moe W.", "Have eaten here several times and we love it! Have always had good service, and fresh incredibly good food! One of our \"go to\" restaurants when we want to impress out of town guests"], ["Lauren R.", "Wow!  I echo all of the reviews that call this a \"hidden gem.\"  After so many superb reviews on Yelp for Cafe Tiramisu, I almost expected to be disappointed, but everything about Cafe Tiramisu lived up to the hype.Like just about every other upscale Italian restaurant in the Triangle, it's tucked into a strip mall--but you forget about that once you're inside.  The place is certainly tiny--room for about 40 in the dining room and maybe another ten at the bar.  Because of that, the bar has a lively dining scene--definitely casual and intimate.  The whole place was dimly lit, but inviting.  I believe that in nice weather there's additional seating on a patio.  I sat at the bar, and the bar service was a little iffy (although there was one bartender to serve drinks to the whole restaurant and wait on a couple of couples--so I don't blame the restaurant).  I could also tell that a lot of people there were regulars--especially at the bar--which is a good sign!I ordered a medium-bodied red and liked the bartender's choice (it was a nice pour--another benefit of sitting at the bar).  I was immediately enticed by the chicken special: grilled chicken baked with spinach, eggplant, prosciutto, provolone, and shrimp in a spicy tomato cream sauce and served with a side of house-made spinach linguine in a light alfredo sauce.  I ordered it, without checking on the price, and it ended up coming to $23, only a few dollars over most of their other entrees!  I was so impressed (I expected it to be around $30, given how some other area Italian restaurants price-gouge a bit with their specials).The meal started--even at the bar--with bread.  It was warm, crispy on the outside and soft in the center, and served with olive oil with herbs (I want to say crushed fresh basil) in it.  It was very tasty.  Then, my entree.  It was huge--there was a lot of chicken.  The tomato broth/sauce it was served in was wonderful.  The chicken was just a tad dry, but other than that the dish was great.  The real knockout winner of the night, however, was the fresh spinach linguine.  It is the best pasta I have tasted in my entire life (and yes, I've been to Italy and had Italian in New York).  I could tell it was homemade because it was unevenly shaped and because it just tasted fresh--so fresh that it almost melted in my mouth.  Also, the alfredo sauce was very, very light, so it didn't overpower the pasta at all (honestly, I could barely tell it was there).  I am normally not a fan of ordering pasta at restaurants because it's such a high-markup item, but just a plate of this pasta would definitely be worth it.And, I had the self restraint to save half of my entree so I could order the famous tiramisu for dessert.  I love tiramisu and I was definitely glad I ordered it (and it was definitely enough to share, so I took home half of that too).  It was really really creamy and mascarpone-y, and served with chocolate syrup on the plate that added more of the chocolate flavor to the dish.  Honestly--heavenly!A meal for two with two entrees, two glasses of wine, and sharing an appetizer and a dessert would come to about $100, including tax and tip.  From my experience, it's worth every penny."], ["Luis A.", "Loved it! I had the veal parm and the pasta and marinara sauce on top was amazing. I devoured this meal. We started with the stuffed clams which were a little spicy. I wasn't expecting that but again the plate was cleaned quickly. Added some lemondrops to go a long with that which hit the spot.My wife had the gnocchi which we both loved. It had really good flavors and the garlic was just right on it. I want to go back and try some of other other veal plates like the veal tortellini.The location can get a little loud inside though since it's small. Make sure you are entering through the correct door though. There is a pub right next to it and it can get a little confusing as to which door to go in through.The service was a little slow but that may be the pace there."], ["Lori R.", "Finally made it here, and finally got to use the Groupon I'd bought a long time ago.  Armed with $60 of credit that I'd paid $30 for, we ventured forth via the 6:30 reservation I made earlier this afternoon.  After a very tough work week, both of us were truly in need of a real meal.  And Cafe Tiramisu gave us not only a real meal, but a really GOOD real meal!   May I just say that I hope you appreciate the food porn, as this is not the easiest setting to get such?  This is a TINY (capacity 49) restaurant.  You need a reservation!  You also need to know you will be close to folks around you (husband got bumped badly repeatedly with a table sitting nearby), and you will have to squeeze by folks to get to a rest room.  That being said, you can also look at is as COZY.  So, I can now understand why there are only a couple food porn pics for this place so far, and why you should really appreciate the ones I am now posting.    Server:  Richard...awesome!  Friendly, knowledgeable, sense of humor...loved him!  Having perused the menu online before going, I had some idea of what I would be ordering, but Richard changed that by reciting daily specials.  We started with the special oyster appetizer:  fried oysters with a light lemon cream sauce.  It was 6 perfectly fried succulent oysters that were light and delicate with just a touch of sauce so they were rich, but not overly so.  Husband said he'd give them 6 stars.  Before that, the BREAD.  Seriously some of the best bread I've ever had.  So light, yet crusty and flaky.  How did they do that?  (I asked, you're welcome) Neomonde.  Ahhh, that makes perfect sense.  And the dipping oil was so fresh and flavorful.  It was green, yet didn't taste like basil.  Parsley?  If so, a very flavorful parsley.     We shared a Caeser salad next.  This would be our only mild disappointment of the night.  Kudos for them dividing it for us on separate plates, but while the lettuce was nice and green and cool, it was mostly devoid of flavor.  Very light dressing, croutons uninspiring and no detectable parmesan.  No biggee, just won't do that again here.  By the way, chardonnay lovers...Sonoma Cutrer for $8.95 a glass.  'nuff said.  For our mains, Husband went with the veal parmesan.  I opted for the special of the day (without asking how much...armed with Groupons one can be brave, ya know?):  it was a large shrimp baked in garlic special with spinach fettucine and a white clam sauce. Sold!  (price unknown, care to guess?)   Both entrees were very very good.  We would give them each 4-stars.  Husband thought his veal parmesan was excellent, but the pasta part just okay (he's used to mine, sorry Cafe Tiramisu...but I don't cook veal, so he could really appreciate that).  My meal was very good also...three giant shrimp, two of which were good, and one was outstanding, loved the homemade pasta cooked to perfect al dente, and the white clam sauce was perfect.  Clams were not in their shells, but that was a plus as they didn't get in the way, and were so TENDER (rare for clams)  and fresh-tasting.  It was the perfect amount of food.  Not too crazy big, yet filling.  We tried hard to be brave and not lick plates.  Dessert: Hearing the folks behind me talk about a dessert drink, I had to order one.  It was an espresso one, with vanilla liquor and all kinds of creamy rich delicious goodness.  Husband had the tiramisu which might just be his all time fave, and he's a tiramisu expert.  I tasted it and have to agree, it was excellent.  Atmosphere is very happy.  People are laughing, and having a good time.  You see great looking food on other tables, and the smells are amazing.  Small,  Intimate and very recommended.  Just make reservations or you won't get in, cause it is SMALL.   So, did you guess how much?  (neither did I)  Drumroll, please....  My special-I-don't-care-how-much-entree turned out to be $22.95.  Value for experience...INvaluable...and just what I needed after an especially tough week at work."], ["Monica M.", "Delish!!!! This place is a Hidden Gem for sure. So glad it was recommended to us.  We didn't order any appetizers bc I wanted dessert. The Mahi Mahi special was well balanced and such a fresh and light entree with spinach, sun dried tomatoes, pancetta and feta finished on top of fettuccine.  My husband had the shrimp and sausage penne Ofo.  A little on the spicy side with a creamy marinara sauce it was perfect and hearty.  We ordered the coconut cake and tiramisu for dessert and couldn't have been happier! The tiramisu is homemade and you can tell, perfect combinations of flavors and the mascarpone cream was divine!They also have half price wine on Wednesdays:)  We will definitely be back!!"], ["Jordan P.", "Best Italian food outside of NYC! The best Italian food in Raleigh! All of the Food is amazing! I won't go anywhere else now. I've been searching for good Italian and I've tried Bella Monica (terrible), gravy ( Horrific!) Plus they have half off wine Wednesday!"], ["David W.", "Saw this place on yelp and thought we would give it try. We were not disappointed. . The atmosphere  was awesome. Great  for a date night or family. My wife thought it was amazing but a little pricy. Our entrees  were about 17.00 a piece. Not that's not that cheap but considering that u can go to olive garden and easily drop about the same amount for frozen food and premade sauces. This place was amazing the food was homemade and very rich. We are going back this weekend."], ["Martie B.", "Excellent, friendly service. Amazing spinach fettuccine!  Willing to make to order chicken Alfredo that was not on the menu. Great little place"], ["Loesje T.", "A perfect gem.  If you were in Milan you couldn't have matched the 1. Superb Service 2. Delicious food 3. Comfortable ambiance and 4. Wonderful wine list.  And those are only four items, I could go on and on.  All this for a reasonable price with a restaurant that hasn't rested on their laurels.  It is a fine example of Northern Italian fare.  Fresh, local ingredients with flair and the portions were very ample.The Lobster bisque was perfect as was the veal piccata.  The gnocchi were homemade and (potato) not semolina.  There is a difference!I would give them 10 stars if I could.  We look forward to going back on a nice afternoon to enjoy the small, pretty patio.Thank goodness for Cafe Tiramisu.  Raleigh should be proud."], ["Gregory H.", "Notes to self: Make reservations several days in advance for the next time I want to bring my bride here.  When most people make a point of suggesting the place is small, believe them.  Don't wait until the day before my Groupon or Living Social deal expires to use it.We showed up 1/2 hour prior to our reservation time and they were actually ready for us.  We quickly ordered a 1/2 bottle of Sterling Cabernet and perused the menu for awhile before deciding on our meals.  The Italian style strip steak was really not much to write home about.  The green beans, however, were perfectly crisp and tasted like they were fresh out of the garden! I did sample my bride's Italian style stuffed chicken and I was wishing I'd ordered what SHE had!Service was also good, not perfect, but good, nonetheless."], ["Ben P.", "Two friends were visiting from out of state, and I've read that Cafe Tiramisu is a nice Italian place to eat, so we gave it a try.We ordered the Pollo Ripieno, Wild Mushroom Chicken and the Lasagna, all were great, along with the desserts we ordered.The service was also excellent, I'd recommend giving it a try, especially if you want nice homemade Italian food. We will certainly visit again!"], ["Diana X.", "Went here with a Groupon, pretty delicious but probably not worth the high price - good Italian food but nothing to rave about. We may have made the mistake of ordering too many veal dishes, because their veal chips & saltimbocca (pasta w/ veal, prosciutto & provolone) were nothing extraordinary and actually a bit bland (but that may be the case w/ most veal dishes). The saltimbocca did not seem to have genuine Italian prosciutto or provolone either, like I had in Cinelli's in Durham. Same case w/ the pork loin chop, which didn't contain much prosciutto inside. Average desserts as well.What was really the highlight of the dinner was their spinach linguine that came with the saltimbocca, which was ridiculously delicious. Great service as well, but otherwise not quite worth it. My boyfriend liked it though, so it may just be a matter of personal taste."], ["Melissa M.", "I've been here twice and was not impressed with either visit.The first visit was about six months ago.  My girlfriends and I sat out on the patio.  I ordered a salad and a lemon drink.  I do not remember the name, but it was on their little drink menu.  It was so sour that I could not drink it.  When it was time to order our entrees, I explained to the waitress that my large salad was enough for me to eat and that I was vegan.  All entrees at this restaurant are meat based.  I have had gastric bypass and don't order much food but the waitress seemed concerned and pressured me into ordering an entree.  She offered me a tofu dish that was not on the menu.  Tofu, if prepared and cooked correctly, can be wonderful.  The \"dish\" they served me was a block of tofu with grill marks on it.  It was disgusting.  The ceiling fan outside made the patio too cold and several guests complained, but the fan was apparently broken and could not be turned off.My second visit was just last weekend.   This time my girlfriends and I sat inside.  As someone who has had gastric bypass, I am super sensitive to alcohol and a single beverage is more than enough to get me inebriated.  I asked the waiter for \"something fruity\".  He brought me a large, green drink.  It was delicious.  I drank the whole thing on an empty stomach while waiting for my salad and did not even feel my face warm up.  There was no alcohol in it. That is very disappointing as the drink cost almost $9.  I ordered a salad that was supposed to feature walnuts and pecans.  There were three tiny pieces of nuts in the huge salad.  This time the waiter did not pressure me into ordering an entree when I said that the salad was enough food for me.  When it came time for desserts, I wanted to have a cup of coffee to sip on as my friends ate their sweets.  The waiter informed me that they do not keep soy or almond milk on hand.  This meant I had to sit there with nothing to eat or drink while my girlfriends ate their slices of cake."], ["Wolfgang K.", "Our friends had been talking about Café Tiramisu for quite a while and yesterday we finally went with them. Reservations are mandatory on a Saturday night - I called Friday and my choices were 6pm and after 9:30... so we picked 6pm.When we arrived it was obvious why reservations were hard to come by - this place is tiny. Maybe 12 tables (I didn't count though). There's a nice bar, too.We were seated promptly and dove into the menu - quite a good selection of Italian favorites. I ordered Carpaccio (always a must in a new Italian place for me) for my appetizer. It was good. Other folks on my table had the Lobster Bisque - very good - and a Salad. For the main course I got the Osso Buco which came highly recommended by our friends. It came with Spinach Fettucini and was good but for my taste needed just a little bit of salt added. Other folks had the Mahi Mahi special (good but the risotto that came with the fish was too rich for our friend's taste) and the Mussels (good, too, in a really good sauce).For dessert I got a Canneloni (about the usual) while our friends had the Tiramisu (highly recommended) and the Mango Sorbet (best part of our friend's meal according to her).The wine list is extensive with a really good selection throughout all price regions. Lots of affordable bottles of wine but also some available to splurge on if you so desire.Service was good - our waiter was attentive and always there when we needed him.Would I go back? Sure! Did it make my list of must eat at places? Not quite."], ["Jen C.", "We are fussy when it comes to good food and this place is consistently great. They have a mature, friendly staff; great wine; and amazing food. Everything we've had (which is most of the menu) is delicious but our favorites are chicken parm with the homemade spinach fettuccine alfredo and the lasagna. The alfredo lightly coats the fettuccine. Lasagna takes about 45 mins but is worth the wait. It's light and balanced with all the classic deliciousness of lasagna. It's not just a cheesy, heavy mess like you typically get. The fried oysters are great as well as the veggie ravioli for an appetizer. Desserts are equally impressive and I'm a cake snob. They are home made and beyond good, all of them. The tiramisu is the best I've had, coconut cake is awesome (and I am not a big coconut fan), and the nutella pie was decadently devine. We love this place and can't say enough good things about it!"], ["Renee D.", "We ended up trying out Cafe Tiramisu on a whim one night looking for dessert. Let's just say: la di dah. Make sure you dress up and get reservations. We ended up sitting at the bar as it wasn't a big deal and the food was decent.We ended up getting a few appetizers, (coffee for me!), and dessert.I had the Caprese salad and Chris ordered the Stuffed Clams. They were stuffed with pancetta, clam meat, spinach, and parmesean cheese. Something spicy too but it was pretty good.For dessert: you will not find a better homemade Tiramisu. My God. So light, so perfect. And large portion. Definitely enough to share. Chris got the Peanut Butter Pie though and that too was phenomenal.Don't plan on dropping under $50 for a dinner for two though. It's priced mid-range I'd say. Our bill was $35 not including the tip.The setting very intimate. Probably no more than 10 tables plus the bar. So definitely get your reservations. Well worth it though if you're looking for something romantic and Italian.Honestly though, I'd go to Carraba's every time because the quality and the flavor is kind of better. It's hard to mess up caprese salad though."]], "Roma Pizzeria & Italian Restaurant": [["Terri Z.", "Great food...great friendly atmosphere. Reminded me of authentic NJ pizza, which has been hard to find in NC. The owner and cook came out to our table and told us a joke. It is the very best atmosphere and Italian food in the city as far as I am concerned!"], ["Gary M.", "Mostly very good food and service. I had anti pasta salad and a side of Italian sausage. Both were good. The salad was too much lettuce and not enough meets and cheese. My wife had stuffed shells and Italian bread. She very much liked her meal. The service was good, maybe a bit slow. The parking is in back of the building."], ["Linda S.", "A simple mom and pop place with friendly and efficient service, good food and lots of it. The bread was fresh and soft with a nice crust. The cannoli was crispy and the filing was light and sweet.  The place seemed to be very family-friendly and did considerable takeout business while we were there."], ["Bob B.", "Had seen this place for years but never eaten there. Got back from vacation the other day and did a yelp search for Italian food, while not looking for chain or to spend much money. This place showed up and I remembered I haven't seen it. It is not much to look at and it kind of sits behind the gas station but a nice couple runs it and what I had was very very good. I will be going back here often as the price is very good for what you get and it appears all be made from scratch and fresh. My next purchase will probably be a pizza and this could be my new pizza place. I had stuff shells and gravy (sauce). The bread was very good and the salad was very fresh and I got it all for $11."], ["Austin S.", "I want to start this by saying I came here the other day and it was near closing. We were greeted at the door super rudely by some guy and we were really nice, left, and went to Little Caesars. We came again today because I really wanted to try it. I will say that the parking is a little weird and it's in the back for the most part. There are also bullet holes on the glass which I think adds some character. There are maybe 15 tables in the whole place and the people in there were super sweet and nice. They probably need to teach the younger guy some sweet to his salty. The mozzarella sticks were super yummy then I had spaghetti while my bestie had stuffed shells. Both were really good and the bread came out hot. I would definitely come back and try different things. Sauce was yummy, but now I want to try to pizza."], ["Rishabh J.", "Absolutely amazing food!!  Best Pizza and Baked Ziti I have ever had.  It's a little family owned place, nice ambience, very friendly staff, sit down, nice cozy place to have a date."], ["Robert P.", "Great food! Old school Italian fare with a classic family friendly eat in environment and great take away!"], ["Robin W.", "I've been getting pizza here for over 12 years. It is a nice mom and pop restaurant. The owners are from Italy. The gentleman who owns the place is always eager to tell jokes and his New York Style pizza is fabulous. If you are willing to wait 45 minutes to an hour, try his Sicilian pizza. Delicious!"]], "Casa Carbone Ristorante Italiano": [["Nina Q.", "I'm definitely a fan of Italian food due to all the free bread and carb-y pasta choices.  I've been to Casa Carbone once about a year ago and just remember it was really good so it seemed like a solid choice to satisfy an Italian craving.  We were greeted promptly at the door by several folks and seated almost immediately.  They have a nice selection of booths and tables and we were able to choose a booth.  The atmosphere reminds me of Peddler's right next door--very private and quiet.  The decor was likewise a little outdated (plastic/vinyl tablecloths, green-red patterned flower carpet and a drab wallpaper) but I have to say I was rather fond of it.  It made the place much more homey.  We ordered the beef braciole (thin slices of beef rolled with ground veal, herbs and spices, sauteed with wine, mushrooms, and marinara sauce), the Tortellini Alfredo, and a tossed garden salad (a bed of lettuce, slices of tomato, onion, and cucumber, with French dressing).  First the not-so-great: The salad. It was actually quite disappointing for a $4 bowl of salad.  It was some not-so-fresh lettuce bits with two slices of onion, two grape tomatoes, and one cucumber slice.  The most sorry looking salad I have ever seen.  The dressing is made in-house and was actually quite good, but super mayo-tasting.  Everything else:  The free bread was quite good and they gave us a large amount.  Our dinner entrees were also huge portions.  We ate probably about half of each.  The sauce in the braciole was actually a little bland (low salt) and very garlic-y.  It was actually refreshing to me to taste a sauce that wasn't overly salted so I enjoyed the taste.  The braciole was a little bland as well, but dipped in the sauce, everything tasted fine.  I choose for my beef braciole to come with pasta instead of a side salad, and it was just as I imagined.  The tortellini was delicious!  I loved the cheese sauce!  I'm usually not a fan of cheese sauces as they tend to be overwhelming, but this was perfect.  It was lighter than I expected and the tortellinis were perfect little doughy pieces of deliciousness.  All-in-all, Casa Carbone is an excellent option for Italian.  Excellent service, great food, and a cozy environment make for a solid dinner option."], ["Aaron B.", "This recent visit saw me bring a guest who had never been here before.The service and the food were an exact replica of my first visit here.  My guest was extremely impressed and expressed a desire to return soonish!  She was surprised when I mentioned how long Lora had been working here and got a chance to talk to Lora herself as to why the longevity and received some background information on the history of Casa Carbone.On the way out a server I had not seen previously stopped me.  He told me that he had just served a table of patrons who specifically mentioned my review as the motivation for checking out Casa Carbone.   Now that's an awesome Yelp interaction!  I wish I had a chance to find out who they were but they apparently had already left while my guest and I chatted post-meal.I love this place."], ["Leslie F.", "My husband and I love Casa Carbone!! This place is like stepping back in time with a traditional Italian menu. Everything we've had has been wonderful. Try the linguine with clams - I get the white and hubby gets the red-yum!!! Calzones and pizzas are great too - and the prices are super!!Enjoy!"], ["Leigh H.", "I was very excited to give Casa Carbone a try. I did not read the reviews beforehand but saw that it averaged four stars. I had high hopes.After my dinner there, I truly do not understand why it has four stars. I would never return.First, the decor. A couple of people have commented on how old and outdated the decor is. Yes, it is truly old and needs to be updated. The entire restaurant needs a make over. But I could live with outdated decor if the food was good.Before we get to the food, let's discuss service. I was with a group of six. We were seated promptly. However, we didn't see a server for at least five minutes. When I say we didn't see one I mean we didn't see anyone. No one was around for awhile.Our server did show up and was ok. He was able to answer questions about the food but was less helpful when it came to drink orders. He just didn't know very much about the wine and didn't offer to find someone who could be helpful. Food came out promptly and once it did he disappeared. There was someone who was coming around and refilling water, but once we got our entrees that person also disappeared. We were back to being all by ourselves.Now, the food. I had a Caesar salad and it was pretty bad. Another reviewer noted that the salads seemed pre-made. I'm going to agree with that. The salad was definitely not fresh. Lettuce was edible, and I'm gonna leave it at that. The Parmesan cheese on the salad was probably Kraft from a bottle or something similar.Next up I had the spaghetti with tomato sauce. What appealed to me about this dish was that the menu said the sauce had been simmering for hours. I checked this out with the waiter before ordering it, and he confirmed for me that this was one of THE dishes to order.I got plenty of spaghetti for my money (8.00). But in no way was there anything fresh about this meal. The pasta definitely came from a box, and the sauce came from a can. To be fair, the menu never claimed that anything was fresh just that the sauce had been simmering for hours. It was very bland.They do not put parm on the spaghetti. When I inquired about it, the waiter informed me there was a bottle of cheese on the table and that this was, \"not the Olive Garden.\" I guess the Olive Garden is a step up? Not sure what he meant by that except don't expect any freshly grated cheese in any format. I struggled with giving this one star or two because the food is technically edible. But since there is no way I would go back here I decided to give it one. I am not sure how this place manages to stay in business given the awful food and old decor."], ["Greg O.", "Finally got to try this place after reading and hearing reviews and doing my homework on the place.  I really was hoping to not be disappointed, and I wasn't.  The inside is a perfect Italian restaurant setting for me, no frills and very casual like I'm used to.  The waiter was very nice and helpful, even was able to get the chef to make my pasta, Sicilian style.  Started with the roasted red peppers and salami, was so good, just wish there was more.  The bread was perfect and I knew I'd be going to town on the bread, just normal Italian bead without all the herbs and oils and whatnot.  You just need plain italian bread to dip in their really good sauces and make pasta sandwiches.  I got the baked ziti which is one of my staples when trying a new Italian place to judge them on.  If this place was closer, I'd be there a heck of a lot more."], ["Adam F.", "First time here.  Place is very tired.  Looks like it has seen better days.  Food was not very good but I also know that Italian food is in the eye of the beholder.  I would not return."], ["Amy L.", "I lived near this hidden gem for three years and finally decided to give it a try. The restaurant is in an unassuming shopping center off Glenwood, but you'll be surprised how big the restaurant is when you walk in the door. It's a casual dining atmosphere, so you'll see people in everything ranging from workout gear to jeans and even dresses. You can expect warm, fresh bread and butter upon being seated. I had the fettuccine alfredo which was delicious, and a side of spinach with garlic and oil. I found the spinach a tad too garlic-y, so I didn't eat much of it. The plates are reasonably priced for Italian food, and the service was moderate. I hope to be back soon for some more delicious Italian fare!"], ["Thomas R.", "I had heard many great things about this place akin to it was seriously legit Italian.  Went here with my family for a special occasion and pretty much instantly fell in love.  I love the ambiance,  the reviews are right,  this is a throwback Italian restaurant and extremely cozy.  I had high hopes and they were definitely exceeded.  The service was friendly and top notch just like the food.  We started off with salads and calamari,  I just had the calamari but did try some of their house balsamic dressing,  yeah it rocked.  The calamari was perfect not chewy at all and the marinara was great.  We got a carbonara as a appetizer too for us all to try and it was pretty good.  If you like Fettuccine Alfredo or Carbonara you will love it.  For entree I had to get the Shrimp and Lump Crab in Lobster Sauce.  Apparently it's a Sunday special and it wasn't on the menu, but they still made it anyway even though it was a Saturday.  So delicious,  I've never had a cream sauce like this one, it was very rich and this dish had big shrimp and a ton of crabmeat (like I can't believe they put this much in here).  I tried someone's chicken parm and it was absolutely one of the best I have ever had.  The prices were extremely reasonable  (I'd say really cheap for what you get) the portions were huge, nobody finished their entrees.  I took a lasagna to go cause I had to try that!  I actually tried a bit when I got home cause it looked so good.  Excellent,  perfect lasagna,  the sauce was delicious and there was pretty much more meat then ricotta.  This place truly deserves a 4.5, way better than any chain Italian place I've ever been,  so definitely stop by sometime."], ["Amanda B.", "My husband and I live very close to this place, but only discovered it about a year ago. It is (by far) our favorite Italian joint. The restaurant itself could certainly use some updating, and I somewhat dislike how dark they keep it in there during dinner hours. The service is pretty hit or miss, but the food... Oh...my...goodness, the food! I have never had better sauces. I swear there is crack in it. the Eggplant Parm is the best I've ever had. The pizza is also fantastic. My husband LOVES both the meat and veggie lasagnas. The prices are very reasonable. Bottom line, if you're looking for luxury, you will not find it here. What you will find is the friendly owner/operator greeting you at the door and fantastic food at very fair prices. The nearby Bella Monica (that everyone seems to swear by) pales in comparison with their high priced (crappy)food and wine."], ["Lori R.", "I came here to update my review since I've been here several times, only to find out I've apparently never reviewed it before.    Four of us had a Sunday afternoon experience with excellent service and very good food.  The other reviews that talk about old-school are accurate.  You feel like you've stepped back in time when you walk in here.   We found the food to be executed well, and for a table of four we had our challenges for the chefs.  For just our table, they had to do angel hair pasta, linguine and ziti.  (all with different cooking times, I didn't envy them this challenge!) They had to do chicken parmigiana and do braciole with mushrooms and without.  Yet, all four meals came out piping hot and very tasty, and the pastas were perfectly cooked.  Impressive..  If you've ever made beef braciole before, you've pounded steak to very thin, added herbs, garlic and cheese, then rolled it up, found a way to seal it (toothpicks or the old-fashioned thread version)...browned it, and cooked it in sauce.  Well here you just have to order it and await someone else's work.  I can appreciate that work!  Highly recommend this dish!  Husband thought his chicken was good.  Not earth-shattering, but he liked it.  Certainly enough to get a couple meals out of it (all of us took leftovers home)  Bread was good, and they will bring you olive oil with spices if you ask, but butter is what comes out without asking.  My Dad and Stepmom rave over the bread they \"used to have\" here.  Apparently they used to make it themselves.     Husband & I also shared a caeser salad, which they were kind enough to split for us.     Wine prices are reasonable, and it's nice and quiet. They have plenty of room if you have a family or larger group, and it suited our purposes that they open at 4 on Sundays.   I might add that we found it funny that they were playing a Christmas Winter Wonderland song today (even though it's February, they're calling for the white stuff again this week, darn it!)...Anyway, we hope that's why they played that.  :)"], ["Betty A.", "Have eaten here regularlly for 56 years.  Always consistant in It's food.  It is a wonderful treasure for Raleigh folks."], ["Monami B.", "What I loved about this place, is that it is very Vegetarian friendly. You can choose most dishes and ask them to make it vegetarian. We started off with Lentil Soup (Zuppa Di Lenticchie) which was quite flavorful. For main course we had the Fettuccine Carbonara and  Manicotti without meat. The Carbonara was a little under seasoned however the Manicotti was delicious. Great service, will return again."], ["Meaghan G.", "My Grandma constantly asks me if I 'like the red sauce' when it comes to italian food.  As a Jewish grandma from Brooklyn, she likes to remind me she's a fan of pasta with oil and butter. I have a feeling if she tried this place, she'd expand her palate ASAP. I love this restaurant. the majority of dishes are red sauce based, and each one is prepared fresh and delicious.  I rarely order baked lasagna when I go out, but I was feeling a bit carnivorous one day and went for it.  I couldn't get enough. Awesome layers of pasta cheese and sauce layered and cooked to perfection in my own personal casserole bowl.  My hubby's a fan of the chicken parm which is totally big enough for 2, with a chicken Caesar salad that just really completes our experience. The place is massive on the inside and you can totally rent out sections for private parties.Be sure to call ahead on the weekend, but if you don't and your party is small, you should be seated no problem."], ["Chip N.", "I grew up near a \"little Italy\" outside Philly and this place brought back memories of \"Martini's\" in Devon where we ate regularly. Casa Carbone is a simple, multigenerational Italian restaurant with classic dishes with great red sauces, smiling service and good prices for families on a budget. Son had great cheese pizza, wife had wonderful baked ziti and I had beef braciole. Great hot bread with  olive oil & herbs along with house salads accompanied. Our waiter was out of the Godfather and was perfect. Atmosphere a bit dated, but definitely recommended for hearty comfort food with fresh ingredients and excellent red sauces. We will definitely be regulars now."], ["Rod O.", "2.5 stars or less, Overall!Possibly lessWalking to our table I imagined Restaurants I LOVED as a child with my Parents and Grandparents ... ... Seeing the food I thought I had found what I've been looking for....and Then...Baked Onion Soup was about what we expected once we saw and Tasted it!  ok, not quite A-ok, so ok best part about it was it was NOT overly salty as many are!  Think \"French Onion\" Soup and you have it!  France and Italy are close, even share a Border so I'm fine with that, or anything they want to do as long as it Tasted Great!Alfredo Sauce with Pasta and Shrimp was the Best part of the Meal and compared to most Alfredo Sauce in the Triangle this one is in the Running for a top spot!  The Pasta was almost certainly Boxed and just OK on both dishes, though not over-cooked!My Dishes came with what I'm guessing was probably a BAD Batch of Sauce???  Tasted Terrible!  Or Possibly Worse!Pasta and Meat Sauce  - the Meat Sauce was the Opposite of Good ! ! !  One VERY Strong flavor that at first I thought was an Herb used in abundance, an Herb I did NOT Recognize, my Bride said it was Awful and the flavor was close to Rancid Meat.  It was BAD! Less than 1 yelp starManicotti with the SAME Sauce!  Though we told our Waiter it was the SAUCE that was BAD on the First Dish, my next dish had the SAME Sauce and the Manicotti was stuffed with Ricotta though little or Nothing else, Very little extra flavor, like NOT even a little Garlic and a touch of Herbs would have been nice!  Less than 2 yelp stars"], ["Steven B.", "Food was nothing special.  I'm not a great Italian cook but felt like the food was no better than what I could make. Atmosphere is very dated with very uncomfortable booth seats. Will not be returning."], ["Rob C.", "Been a couple of times and food has been really good, carbonara was awesome last visit! My wife and daughter also loved it. It does get crazy busy so best to arrive early. Will be going back again soon!"], ["Amanda D.", "Visited tonight for the first time and already relish the thought of a second visit.  I tried the beef braciole and it was tasty.  I want to try the chicken Parmesan next.  The service was excellent and even though the side salad was simple, the house made homemade Ranch dressing was all it needed to make me happy.  Priced reasonably and close to home, will be back."], ["Amanda K.", "First visit, was recommended by a friend. We really enjoyed the vegetarian lasagna, along with the onion soup, lentil soup, and Caesar salad. Great service, excellent food! Will be back."], ["M B.", "Followed previous reviews and were not disappointed.Food was fantastic, prices were reasonable.  Service was excellent despite a full house with several large parties.  Will definitely visit again if in the area!"]], "Caffe Luna": [], "Frank's Pizza & Italian Restaurant": [["Chris B.", "I had some errands to run and ventured over to Franks to pick up a pie, the menu said call ahead for a sicilian so I gave them an hours notice and the pizza was great-5 stars. What knocked my review down to 4 stars was the nasty cheesesteak I decided to get at the last minute. It had orange cheese on it (think the individually wrapped kraft slices-uggh) and was not good."], ["Todd K.", "Floppy, greasy, and sliced Italian sausage. Just the way it oughta be."], ["Steve S.", "A wicked good pie.  It doesn't get much better than the pizza at Franks.  Not the best neighborhood, not the best looking place around, but the pizza SO makes it worth the trip.  We go at least twice a month for a Franks's special (5 toppings of your choice).  The folks that work there are nice, friendly, and make you feel at home on your first trip or your hundreth.  I wonder if the other things on the menu are as good as the pizza - maybe one day I'll try something else and find out - nah, nevermind...Absolutely the best Pizza in the Triangle!!"], ["Beth P.", "I first heard about this place from my neighbor.  She said it was a dive in the hood but was wicked good (my nieghbor is from Maine).  One night we were tossing back some beers and heard a grumble in our tummies.  We were about to dial the customary Papa Joe's when I heard a voice in the back of my head saying \"try something new\". I recalled my neighbor's advice and looked up Frank's Pizza and Italian Restaurant.  Five stars on Google maps!!!  Well, maybe my friend was right!  We ordered the Frank's special (large 5-topping pizza) with sausage, black olives, onion, mushroom and pepperoni.  Frank's doesn't deliver so we had to pick it up.  They said it'd be ready in 15 minutes.  Wow, that's wicked fast.  I walked in, and it was all nice and warm and cozy just like the Italian restuarants back in the 80's.  The lady behind the counter was so nice, she even gave me extra napkins to shield my hands against the piping hot pizza box.  It smelled so tempting all the way home it was all I could do to not stop the car and eat it on the spot.  My famished friends and I ate (almost) the enitre pizza.  I really liked how the pizza was not a perfect circle, which means they are hand-tossed which makes the pizza even more extra special.  The sausage was sliced long-ways which was AWESOME!  It was so good, I didn't even need ranch.  Me likey!2nd visit: My husband, and brother-in-law and I came here to dine-in one evening.  We loved the ambiance and feel of the place.  We like how it is old-school.  The waitress was super nice and was humored when we ordered 3 house salads, a large pizza and a calzone.  We almost ordered two calzones, but she talked us out of it saying they are quite large.  I would just like to say the the prices are very affordable and the quality surpasses many restuarants of higher price ranges.  The salads were fresh and crisp, though beware the olives have seeds in them.  Our pizza hit the spot once again and the calzone was as big as a football.  We def needed a box for leftovers.  I want to come back again and again, trying new things on the menu.  There was a table next to us that ordered subs and they looked delicious!"], ["Ron W.", "I've been eating at Franks for over 25 years. Simply the best New York style pizza and Stromboli in town."], ["Jane D.", "I really was looking forward to eating here seeing how great the ratings are, but if you want a sit down meal with good service DO NOT GO HERE! 1) there times for when you can eat there are wrong on the yelp page. They stop serving at 9pm! When me and my boyfriend came in at 9:20 on a Friday night, we walked in, thinking we would be given menus or seated but instead a very rude, poorly dressed women behind the counter said, \"what are you doing here\". I look at my boyfriend stunned, I could not believe coming into a dinning area, being well dress with pockets full of cash to be told in such a rude manner, what am I doing there. I obviously came to eat? This is a place were you serve food? So I said, \"we would like to eat here?\" she replied \"the dining room is closed\", then turned around started talking to a co-worker. I stood there, pretty upset, seeing how we drove 20 mins to eat there, and it was date night, after a few minutes she turned around and I asked \"why is the open sign on?\" , oh cause you can wait 30 mins and  still order pizza.... Which was not what I wanted to get at all,,,, then when my boyfriend tried to order what he wanted at the counter they requested him to call it in!!! When we were standing there watching people come pick up their pizza inside the restaurant. So I left at this point, I was very disappointed, I would recommend only getting food from here, \"if you are going to call it in\". Otherwise be welcome to some of the most atrociously rude service."], ["Candace T.", "I have been eating Franks pizza since I was a kid.  So many memories sitting around the kitchen table with the fam grubbing on a sliced meatball and onion Franks pizza.  There is nothing like it in Raleigh.  One thing I like about it is that it hasn't changed in 30 years..the pizza tastes the same delicious way and Frank still owns it and you can still find him in there slingin dough!  Go in and order a large sliced meatball and onion, you will be a customer for life!"], ["Evil W.", "I remember when this place first opened, and the food was exquisite back then. It's still great - twenty some odd years later. It's way over on the East side of town down the road from Wake Medical, so some people don't want to drive all the way over there, but do because it's excellent.If I had a dollar for every pizza and pitcher that I and my friends consumed at Franks, I'm pretty sure I could fix the economy. Go here!"], ["Andrew B.", "Great, New York style pizza. Hard to find, but once we were there it was well worth the trip!  Beyond the pizza, the Italian dressing is ridiculous - I know, weird thing to say about dressing. Just try it!"], ["Tara W.", "I'd love to tell you it's terrible so it doesn't get more crowded but it's amazing pizza every time. The service is great and the servers are very friendly.  THE best meatball pizza!!The parking lot can be a little sketchy but we've never had an issue."], ["Jett B.", "BEST pizza in Raleigh. I wish they were opened on Sunday and that they delivered, other than that I would not change a thing. The eggplant pizza is the besssst!!!"], ["Daniel H.", "I dined with a colleague and we had a great experience.  The pizza was great, server was VERY friendly!  She talked with us like she has known us for years.  I have been told this place is not in the best part of town but I love eating here!  We plan on bringing more people here in the future."], ["Shannon O.", "Good pizza. Good philly cheesesteaks. What more could you ask for? Well, the location isn't the best in the world, but let's just say we drive twenty minutes out of our way to eat there anyway. It's that good."], ["Keith E.", "This is an old fashioned pizza place. No frills, top notch pizza. Love it. Best traditional pizza in Raleigh."]], "Oak City Meatball Shoppe": []}