{"Shish Kabob": [], "Almadina Supermarket": [], "Sitti": [], "Petra Grill": [["Stephen E.", "I originally wanted go to Panera but decided I wanted to try something different that wasn't a chain. I was greeted pleasantly and I ordered the Greek salad with chicken and lentil soup. The food came out very fast and was delicious. Salad greens were fresh and dressed properly. The chicken was seasoned well and the soup was very tasty. I will definitely be returning soon with my partner."], ["Keith B.", "Haven't been here in a while and noticed it's under new management. Thats good because the food just went up another level. It was good before but even better now. A must try if you're in the area."], ["Brian T.", "This place is fantastic! Huge sandwiches, amazing homemade sides. Seriously I'm blown away. The owner is very friendly and extremely helpful. Please check this place out!!"], ["George H.", "I eat here regularly as the staff is great, the food is usually very good. They often give my wife and I free drinks as well. My only gripe would be that on several occasions they have been out of lamb and, for me, that is the main reason I indulge in such cuisine. Still, I enjoy dining here and will continue to do so."], ["Lindsay S.", "Have been here a few times.First, food is way overpriced for its quality and quantity. I was charged 11 for a measly pita with 3 canned grape leaves. The meat is always seasoned okay, but dry. Seems like it might be past it's prime. All sandwiches are skimpy and don't have enough sauce. The sides are mediocre compared to places like Neomonde or Taza. The grape leaves are soggy sand grainy as if the come from a can. Kind of like the McDonalds of Middle Eastern food minus the cheap price."], ["Mel J.", "Friendly service & good food.  I liked the lamb Gyro & Greek salad.  Good place for lunch, but they could do a little more for their dinner guests considering the price.  Decor is nice mix of Petra & Mediterranean pictures, etc."], ["Rod O.", "Gyro on the Vertical Grill, sliced super thinly then grilled with a little Olive Oil, the flavor was very nice, better than most, though not as good as a few of my favorites!Cucumber Yogurt Sauce is the excellent milder version of Tzatziki... I'm used to more Garlic in the versions I LOVE, though this one was EXCELLENT!!!Tabbouleh was good, not greatThe BEST Falafel I have tasted!!!The Baklava was Very Good!My girlfriend likes this thinner version of Pita Bread!The Service was Fantastic!  Allowing us to make some simple substitutions like Extra Pita instead of Rice : \"Of Course\"  Extra Yogurt Sauce and less Tabbouleh for the sides, \"of course\"... that is too smart!!!"], ["Travis H.", "Stopped on while I was getting car worked on at just tires.  A lot money, just a little food.  It was ok"], ["Josh P.", "Boring gyro. It's okay enough that I would probably go back, but I would never seek it out. The attached grocery mart detracts rather than adds, and the rude employees rather talk to each other in their native tongue than talk with their customers."], ["Ashley W.", "I've been here a few times since my last posting. The food is still pretty good (I'm in love with their fries) -- but beware of the pickles (they're super salty)!Here are the cons: -It takes around 10-15 min. to get your food -- so don't expect to get in and out if you're on the run. -Upon entering, you are not greeted by anyone behind the counter.-Understaffed-- the reason why it takes a while to be serviced / get your food.-One of the men behind the counter has repetitively hit on 2 of my friends in separate visits (single ladies beware).Edit:I was contacted by the owner about this review. He noted that it had been a while since I posted my review, and asked for me to come back and test the food and service. However, he did not apologize for the inappropriate behavior of the male employee. I do not wish to return to a place that harassed two of my friends -- I don't care if the service has improved, but you've lost us as future customers."], ["Steve M.", "I've visited Petra Grill several times, and have always enjoyed my food. The sandwiches are authentic and delicious. I haven't had the problems with dried-out meats that some other reviewers mentioned. I really like their fries--they come with a lemon pepper seasoning that's pretty solid.The store next door is great--Neomonde pitas, full butcher, specialty items, etc.I've never had a problem with the service. Also, I am a guy, so I can't speak to being hit on. The food takes a few minutes, but that's more because they make it to order than because they're slow. I usually take the opportunity to browse the store or head down to Total Wine.Shoot for the lunch specials--good value. Otherwise, not cheap, but not expensive, either."], ["Jeff C.", "Tasty very tastyGood varietyWill be back"], ["Adri T.", "We decided to check this place out since we received a coupon in a local mailer. Upon walking in we were quickly greeted and took our time to review the menu. I finally decided upon the Petra Kabob platter. Others in the group picked the beef shawarma and the hummus shawarma. The food came out relatively quickly and looked nicely presented on the plates. However, some of the meats seemed overcooked and were a bit dried out, but still had pretty good flavors. The hummus was very mild and seemed a bit grainy. We commented that it just needed some acidity. The pita bread was almost crunchy and was rather thin, which was a disappointment. However the tabouli and grape leaves were both tasty and fresh. The tahini sauce on the shawarma wraps was tasty and really added some good moisture to the wraps. The french fries were nicely fried and a golden brown, and everyone enjoyed them. And the best part of all of the dishes - the hot sauce - was a tasty addition to anything on the table. I would give it another shot, but would be a little more selective in what I order next time. We were the only people in the restaurant when we arrived, but it had gotten a little busier when we left. The quality may be a little more appealing when the traffic is heavier."], ["Shruti D.", "This place is good. Got the Falafel sandwich. Their bread is nice and thin. They have a grocery store next door, you can buy fresh bread and great meat from there."], ["Ishraq A.", "Petra Grill was recommended by family, and I absolutely loved it!The interior decorum was great, and the cooks/owner of both the market & restaurant were extremely hospitable. Great local place to run in and grab a quick shawarma, falafel etc.prices cant be beat, and the quality of the meat was superb!"], ["Mark W.", "My wife and I dropped in here for lunch after shoe shopping at SRI Warehouse. Instead of eating at Panera which is in the same shopping strip we decided to give Petra a try.We both had Falafel wraps. The yogurt and spices were balanced just right. The woman who waited on us was friendly. I loved the hot saucethat comes on the side. We bought some hot sauce to go! This concoction wasn't about the heat. There's a nice spiciness along with a medium heat that could compliment any dish."], ["KJ J.", "Disappointed vegetarian.  Don't go here to get those interesting looking hot vegetable dishes on their website. After going out of our way to taste those, the staff told us they didn't have them and seldom do even though they are still on their menu.  The only hot vegetarian choices are fries, falalfel, and a grilled cheese.  ANd the grilled cheese is not one of those great ones like Greek fiesta but only some American cheese melted on a pita. The guy acted surprised when I asked for Tzatziki sauce for it. So your cold vegetarian choices are the usual 1/2 dozen or so ordinary ones like hummus and grape leaves. There were a bunch of Middle Eastern people there so I guess the kebabs must be authentic but the things we had were similar to those we've had elsewhere. I prefer the more interesting choices at Neomonde."], ["Emily D.", "The food is good.  Their falafel is delicious, so is the chicken shwarma. Just keep in mind: if you like getting hit on by creepy guys until you get your food, this is DEFINITELY the place to go!"], ["Frank L.", "awesome schwarma"], ["Nathan W.", "It's ok, I like Solomon's better"]], "Neomonde Bakery & Deli": [], "Nur Mediterranean Deli & Market": [["Adam D.", "Best Gyro in Raleigh. You like Gyros? You like french fries? You like any place that keeps hot sauce on the table? You like fountain Pepsi with crushed ice? You like super friendly service? Then you love Nur! Nur makes way more than Gyros. They have burgers, subs, sandwiches, salads and more. They even have a little middle-eastern market. That said I get the Gyro every time. It's just so damn good! Their cucumber sauce is fantastic. The lamb is spicy. And they use big honkin fresh tomatos and fresh green lettuce. Really the best Gyro I've ever had and I LOVE Gyros! The staff is also super friendly and always greats you with a smile. I like the people at Nur a lot.Go to Nur at least once a month and get a Gyro. You wont be sorry."], ["Amy B.", "Yum.  Tasty fast and fresh gyros and other lunch type items (both middle eastern and american).  Order your food, then park it at the counter.  The 3 folks who work lunch (family members, I think) work together like a well-oiled machine.  If you've ever had a food service job in a busy place, you'll appreciate their hustle.In addition to the deli, there's a little grocery in the back with an olive bar and some basic items.  A good spot to check out if you're in the mission valley area."], ["Anna S.", "I like Nur a lot. The food is excellent, and I've bought a few hard to find groceries there as well. The people who work there are nice as well! Highly recommended."], ["David P.", "Get the labneh sammich!"], ["Brian W.", "I hadn't been to this place since way back when it was on Hillsborough next to the Wolf-Mart, but I remembered a particular gyro I had eaten at that location and so was eager to try them again.  Unfortunately, I had just eaten a lot of pizza... so I decided to skip the gyro and continue my quest for the best baklava in town.I got a big pistachio piece with a thick layer of honey-soaked dough at the bottom and tons of pistachios.  It was flaky, but not so loose that the flakes broke off and fluttered all about when I bit into it.  The level of sweetness was perfect - far too often baklava is overwhelmingly sweet, but this one was more nutty than syrupy.  So good.  And so cheap too.  Nur Deli will be my baklava of choice for the time-being."], ["Caroline Z.", "Nur is one of about five Arab groceries located within a few miles of one another near NC State.  There's a grill up front that serves Mediterranean food, though I haven't sampled that yet.  I tend to head to the back of the store, where there's a small grocery with a decent amount of spices, canned goods, frozen/refrigerated foods, and even Arabic movies and CDs.  They're the only place I know of in the area where I can get Armenian meat pies (lahm bi'ajeen), which taste pretty good for being frozen.  Prices are reasonable, so Nur is a nice complement to the other groceries nearby."], ["Luke S.", "Mediterranean and middle-eastern food often get lumped together here in America; maybe restaurant owners think most Americans don't care enough to separate non-European countries from one another (I'm still on the fence as to whether or not they'd be right). Nur Grocery and Deli seems to try hard to be both authentic and not; they have gyros and hummus and even an olive bar in the grocery part of the store alongside typical American food for the picky kid or oblivious patron (who would go to a place called Nur Grocery and Deli to get a hamburger?). I liked their gyro well enough but beyond proximity to the school, this place is not without peer. Neomonde is better by leaps and bounds and not all that much further away for the intrepid traveler. Worth a casual investigation."]], "Tarbouch": [["Lissy K.", "Delicious! My son and I went here after seeing the sign for a $4.99 lunch special. You can't beat that! We had gyros and the baklava. Perfect! We will definitely be back!"], ["Sanya A.", "Went there for lunch the other day and it was FANTASTIC! I ordered the chicken platter with a side of Baba Ghanoosh and Grape Leaves, both were delicious and come with a warm soft pita. The chicken was tender and JUICY and came on a bed of rice. I asked for hot sauce, so they brought me two kinds, one was a home-made pickled pepper sauce--AMAZING!! The service was great and place was super cute! Will absolutely be going again!!"], ["Ashley M.", "I really enjoyed my first visit to Tarbouch-- what a great find! I live right across the street from the shopping center where Tarbouch is located (Creedmoor Crossing), so I had seen this place several times. Yesterday, on a fine Thursday evening, I finally stopped in for my first visit. I wasn't sure if this was a quick, fast food style place or a sit down restaurant. It turns out it's a bit of both: you do order at the counter, but there is a nice selection of dining tables both inside and outside too. You can even order beer here. I ordered my food \"to go\", and it took roughly 5 minutes to complete my order. The man behind the counter recommended their kabobs as their specialty, which I will have to try next time. I was very specifically craving both hummus and tzatziki sauce, so I ordered the gyro platter. The gyro platter included deliciously herbed and spiced lamb and beef, served with greek salad, hummus, and tzatziki sauce. Perfect. :) The hummus was fresh, with perfect flavor, and the tzatziki sauce was the best I've had at any Mediterranean restaurant. I loved the pita bread that was served with the gyro platter, too! Everything was absolutely delicious. Another huge plus on this place: they have very reasonable prices and large portions. My order totalled $11 for a soft drink, gyro platter, and piece of pistachio baklava. I even had leftovers for a late night snacking session. I will be back! 4 stars for now until I try more menu options -- but very potentially a 5 star experience. :)"], ["Mary S.", "SIMPLY THE BEST IN RALEIGH. This has become our favorite go to place for lunch and dinner. The food quality is quite amazing- fresh, delicious AND AUTHENTIC!  With every single bite of anything you select from this menu, it just gets better.  I am going to have a hard time not eating here or ordering delivery everyday. Also, the owner is really just the nicest person you ever want to meet. He delivered food to our home after I had been traveling for work for a solid month, it honestly tasted as if he had prepared right here in our kitchen. Do yourself and your palate a favor, don't pass this place by."], ["Jason O.", "I yelped this place in a pinch while in the middle of a move, and its a great option for some healthy, mediterannean fast casual. Good greek salads and chicken, etc and its Mom and Pop run. Food is reasonably priced and made in a timely fashion."], ["Martin B.", "Wonderful place next to Harmony Farms. My wife and I like the way they make the Hummus and Baba Ghannouj and Stuffed Grape Leaves. Recommend you try it out."], ["Jillery Ellen S.", "It was good. Glad I experienced it but I would not go out of my way to eat there. I had chicken kabob, rice, cauliflower, and eggplant. If you're in the neighborhood I would try it."], ["Elizabeth K.", "This place was a great spontaneous find. The food is authentic, delicious, and inexpensive! The service is friendly and kind. The decor is very clean, simple, and visually appealing. I live so closeby, that I'll be coming here more often!"], ["Thomas M.", "5 stars ... not much else i can say.food is amazing, staff are extremely friendly and attentive ... i wish i could eat my 3 squares a day there."], ["Bryan S.", "Been here 3 times now and will keep coming back.  Had the gyro platter, salmon special and tandoori chicken special.  It's all been wonderful.   The cauliflower salad is to die for."], ["Karl S.", "Tabouch surprised me. I was not expecting the food to be this fresh, flavorful or plentiful. I ordered the lamb and beef gyro which came with a salad and hummus. The gyro cam deconstructed.. meaning that you have to assemble them yourself. I have noticed that this is how it is done in some of the better Mediterranean restaurants lately so I went with it. Everything was exceedingly fresh and delicious. The cost is equivalent if not less than the fast food place in the same shopping center but healthier and much tastier. The service was good. They were patient as we examined the menu and brought out our sides first as they were making our main entrees. Entrees arrived a couple of minutes later and were fresh and hot. Good job."], ["Bruce G.", "I gave Tarbouch a try for lunch recently. You order at the counter and then seat yourself at this establishment. I ordered the lamb sheesh kabob platter with my two sides being the green beans and baba ghannouj. With an iced tea the price came to about $13.50. My sides came out first, the green beans were delish; very well-seasoned and a generous portion for a side. The baba ghannouj was plentiful also and came with some bread. More of an appetizer than a side, so I am glad it came out well ahead of the kabobs. Others who came after me starting getting their orders, which made me worry, so I inquired about my lamb kabobs. The cook told me they were coming out soon, and they did. The lamb was very succulent, and tender. I don't eat lamb often but theirs was perfectly cooked and flavorful. They kabobs were served on top of a bed of rice and squash. It was great, but I couldn't quite finish it all. It was just a little but too much food for me for lunch. I think a Gyro might suffice next time! The service was very friendly and efficient. There was a little bit of a wait for the kabobs as I previously mentioned, but in the end, I was ok with that.Pro tip: This may be TMI, but the bathroom at Tarbouch is unisex and to conserve water they have one button on the loo to push after a \"number 1\" and another blue one to push after a \"number two\" with the note \"blue for two\". I thought this was funny and I will always remember Tarbouch as the \"blue for two\" place...as well as their great food of course!"], ["Rod O.", "Gyro Meat with Salads!  The Meat was Good or a little better than Good!  Better than many places!  Salads were Very Good and the Turkish Coffee was Magical!  If you think it may have cured me read on...Fattoush!  Fabulous!  Beautiful! Yummmmy!Tabbouleh - This is the Version I want with Tomatoes and Red Onion and though some will say it is not, not, I LOVE the notnot, some will scoff saying it should be made on the spot while the customer waits, I like the extra ingredients and the Hours for the Flavors and Lemon Juice to MAKE it!Tzatziki Sauce Makes the \"list\" though it could have used just a tad more Garlic it was Very Good and plenty and (not like the \"Good & Plenty\" candy - Better), Plentiful!  If you see my Photo, that is a regular sized plate with a so-called \"Side\" on it!Dessert in Three Parts :Pistachio Baklava - Thin Filo layers and Masses of Chopped Pistachios they also had the \"other\" (Greek) Version (looked Good too!).Namora - soaked in Honey...  This was my first one of these...Turkish Coffee One of the BEST I have EVER Consumed! Good enough to Cure Insanity or Cause it ! ! ! Be B, Be beep be b beeeep, b b b b b  beeeeeep!  Walking in to this place my Vocabulary was extremely limited, after the Turkish Coffee I was ready for bed, or a Padded Room!  My White Coat Escort (oddly enough in a Ford today) was Eluded once again!!!Picture this : : Even on a Rainy Day like Today all the Men are sitting at the Outside Tables with Sunglasses on!  That is a Dead Giveaway since it looks more like a Tornado than a Spring Shower."], ["Kendra B.", "Very excellent Mediterranean food. Loved the Chicken Sheesh Taouk Platter.  The chicken was flavorful and fresh. The eggplant was outstanding. We definitely will return. A little out-of-the-way but definitely worth it. Beef dishes are also outstanding."], ["Laura S.", "I go here often for take out. My favorite things: chicken shawarma wrap, fattoush salad, stuffed grape leaves. They bake fresh and delicious pitas. They make everything to order, so you may want to call in your order to avoid waiting too long in the cafe. Staff is always very nice and you can tell the food is made and served with great care."], ["Michael G.", "Great food and people. Come here often and never disappointed. Friendly service. Can't go wrong with their Gyros. The owner works very hard to make sure his customers are taken care of."], ["Kim M.", "I really really really wanted to try the food here especially since it is so close to home.  I ordered take-out but I wound up taking it home and not even eating it.  While I was ordering one of their staff was cleaning the glass on the buffet.  I am TOTALLY down with supporting a clean establishment.  However, I don't necessarily think you want to spray the glass cleaner on the glass while the food is sitting there.  If he had sprayed just the cloth and wiped the glass that would have made sense or just wait till they were done serving food in the evening.  I couldn't bring myself to eat the food when I got home because I was worried about ingesting residual chemicals.  I was really bummed out because I was looking forward to it since the food looked great.  Sometimes out if sight out of mind is a good thing!"], ["Scott K.", "Tarbouch is a locally owned restaurant serving Middle Eastern fare.  And good stuff at that.  On the menu is salads, sandwiches, wraps and stews.  On this visit I had the lamb & beef shawarma wrap with chickpea salad and a piece of baklava made fresh.  All was very good.  You order at the cash register and when it is ready they cook will bring it to your table.  And they do serve beer here.  There are indoor and a few outdoor tables.  On each table are cloth napkins and real silverware.Food BStaff ADecor CLocation CHealth Inspection Grade 95.0"], ["Jenessy A.", "So this place opened a little over a month to my knowledge. We were immediately greeted by who seems like the owner. Very friendly guy he is. He let us know about all the sides available and what our choices for plates were. He even let us try some stuff. It felt very warm and made me excited about the food. He took our order and even gave the baby a small dessert to keep her put till the food was ready. We sat and waited and not even 5 minutes later he brought over our sides following entrees. The food was freshly made and the flavors were incredible. I had the curry chicken which had a little zing to it, with a small side of the creamy beef since I couldn't decide (which was complimentary). Everything comes with a plate of rice by default. As my sides I had the eggplant salad which was pretty good (only recommend if you like eggplant) and the Baba Ghannouj which is an acquired taste but none the less great if you are open to new. He was happy that we were happy and was very attentive which you don't find enough. Definitely a place you should try out if you like Lebanese infused. Double thumbs up."], ["Marin J.", "Tarbouch has potential. The food seems fresh, the chef, and assistant are both warm and friendly. The cashier, she could be working at Mickey D's.The falafel with tahini, fresh but kinda lukewarm with watered down tahini.My friends salad was very good. I think the decor is suffering and makes you want to order take out, which a LOT of people did while we were eating.Tarbouch moved in to what was an eco crunchy little deli which didn't last very long. They just stepped into their shoes ugly decor and all. While I know it saves money, throwing up some disjointed pictures and tiny red fezzes does not, ambiance, make.  I think te we were eating.Improvements could be made to make the place a little more inviting. First off, while it was very, very very clean, you shouldn't smell Lysol first thing upon entry, before smelling the food.It is a great place to grab a healthy alternative in a neck of the woods where such a thing is often lacking."]], "Monapita Mediterranean Grill": [], "THe Knight Kaffee": [], "Taza Grill": [], "Zoës Kitchen": [["Cynthia H.", "Good food and service for price.  Neat and clean environment.  A go to spot for healthy and quick food.  My favorite is the braised white beans."], ["Rae W.", "This was my first time here and I didn't know they served Mediterranean food which is a favorite! I went after 1pm so it wasn't that busy and ordered the chicken kabob entree. It came with two skewers that had onion, green pepper, and tomatoes. It also had rice, Greek salad, and a few small pieces of pita. I ordered a side of cucumber sauce to go with the chicken. The food was fresh and tasted delicious. The place seemed clean however I took my food to go! I will definitely make another trip here!"], ["Rob W.", "Wonderfully delicious, healthy fast food. This place is a game changer in fast food. I love the salads and the chicken kabobs. I really enjoy dining here."], ["Lori R.", "Up until today (Friday), my only Zoes' experiences have been take-out salads that have been brought to me.  (all of which were excellent).    By my lonesome, looking for a quick (yet somewhat healthy) lunch, I thought of this location, and got really lucky with a spot right out front (didn't have to mess with the parking deck).  It is next to Harris Teeter at North Hills.  With no cravings to guide me, I fumbled with the menu because it all sounded great!  Did I want grilled chicken with veggies?  Or a nice salad?  Maybe the new quinoa one?  Instead I managed to order probably the most unhealthy thing on the menu...their pimiento cheese sandwich.  At least I got just half of a grilled one, with some Tomato Bisque (just $6.99 for a combo!)  You order at the counter, then get a drink (tea for me with fresh lemon), then sit down with a number.  Shortly they brought out my fabulous soup.  Wow-fresh!  Loved the cheese on it, and the fresh basil put it over the top.  Served with pita wedges.  Then came the very rich half pimiento cheese sandwich with lettuce and tomato.    This had so much cheese that I squeezed some off to save calories.  But it was so darn good that I ended up eating what I took off with the pita wedges from the soup...hah!  Bad me, but Italian Grandma in heaven would be proud that I didn't waste anything.  Service here, by the way...these guys were friendly and seemed to care very much! And you cannot beat the quality and quantity for the price!   Highly recommend for eat-in or take-out!Edited to add that it's CLEAN clean clean!"], ["Julie T.", "I absolutely love the food at this place which is why I continue to frequent it.  The food is very tasty and healthy but I will only give it three stars because I have had consistently bad bad service here with absolutely no apology and the only reason I continue to frequent it besides the good food is that it is so close to my house. There is another one that is located pretty close to NC State on Oberlin Road and it is fabulous. The service is excellent, the food is always consistently prepared and there are no problems there which is how I cannot understand why this one has so many problems. At this location I've gotten chicken with lots of gristle a few times; several very late orders, rude staff at cash register actively complaining about their job to me, and absolutely no apology ever. I even wrote a note to the corporate headquarters with no response which was really disappointing because I really like the food at this place and the other location is great. Tonight I waited 20 minutes for my order of takeout greek salad with chicken and steak kebabs. While I know it takes a little while to prepare the kebabs and I am not an impatient person it bothered me that the young man who brought me the wrong order first failed to mention that they must have forgotten my order and two other people who came in after me were done and left well before the time I got mine. Additionally I was the only person left in the store. Ugh!"], ["Jon B.", "I like beer. I don't go to Zoe's for the beer, but when we get dinner here it means we're taking it across the street where some good beer is about to be consumed. That gets me excited for Zoe's, but the food is definitely the other delicious half of the equation.Lately I've taken to getting the chicken kabobs. Two kabobs on their rice pilaf with a side salad is just the right amount of food. The tabouli salad is also a good option if you're looking for something a little lighter. The braised white beans, roasted vegetables, and chicken & orzo soup will make anything you get even better. Seriously, a plate of just the sides is a great meal.We haven't used their catering, but every time we come in they have an order waiting to go out the door so they must be doing something right on that end as well."], ["Chris S.", "The fast food that doesn't taste like fast food, Zoes Kitchen is one of my favorite places to sneak in for a quick, healthy, affordable bite when I don't have a lot of time. It's the rare opportunity to grab a tasty, yet non-greasy, health conscious meal and experience great service, clean tables and fresh food. I've yet to find anything here that isn't good. The salads are filling, the wraps are worthy and all the hummus and chicken dishes impress. It's a great place to bring a family, friends or even hit up solo."], ["Lauryn C.", "To be perfectly honest Zoe's is by far my favorite casual fast chain around. I know no matter which one I go to that the food is always consistent and the staff is helpful and friendly. I'm at the point now where I sort of order the same thing every time I go but every once in awhile I'll try something different.I love Zoe's because they give me yummy healthy food and they also don't mind when I stay around for a few hours pop a squat and work away. Today I munched on a grilled chicken and slaw pita with a side of fresh fruit. No slimy fruit cup here just a full serving of strawberries, red grapes, pineapple, and cantaloupe it hit the spot. I also love Zoe's slaw and this girl hates slaw. Slaw has always been disgusting to me mostly because I hate mayo but now i have discovered this delicious slaw that has no mayo and is mixed with green onions, feta, and a light vinaigrette.This location is conveniently located right in North Hills next to the Harris Teeter. You can find plenty of parking in the adjacent parking deck so it's an easy spot to grab something to eat for there or to go. Zoe's is great at catering and to go orders so pick up the phone and order away.  Today I was able to enjoy my lunch on the nice patio outside, perfect for people watching during the day. There area a lot of businesses nearby so you can see all kinds of folks in this shopping center. Zoe's is always on my list for a fast lunch or casual dinner!"], ["Eric H.", "Absolutely fresh and healthy Greek food served by friendly pleasant people. Seems to be a hit with the workout gym crowd, but they're missing out on amazing chocolate cake and chocolate chip cookies. And the price is very reasonable too. This place should be packed but it looks like they do a major takeout business."], ["Eva H.", "Had the chicken salad on a pita with a Greek salad. Very tasty.  Prices not bad. People very friendly. Fast and good service."], ["Harmony M.", "I used to go to this place all the time because it's not far from my house and it's on the same block as my church. My previous pastor and her family seemed to really love Zoe's, though honestly it could have been because it was so convenient, as they lived in the apartments above part-time.Anyway, I've tried a couple of different things -- the chicken salad, roasted veggies, and rice -- but the only thing I went consistently to get were those roasted vegetables. (The rest was not at all noteworthy to me, though I am certainly a chicken salad snob.)I don't even like most common vegetables (carrots, zucchini, etc.), but I eat every last piece of veg in this little bowl. It's a bit expensive ($10 for a tall plastic takeout thingy, same size as if you get a \"large\" at a Chinese takeout restaurant), but they're a nice treat.There is SO MUCH oil in those things though -- it drips and runs with it, and there's olive oil pooled at the bottom of whatever container you order it in -- so please DO NOT think that this is a healthy option for you. It's 190 calories and 17 GRAMS of saturated fat in a 5 OZ serving of vegetables... which is exceptionally tiny, that little cup."], ["Peter Y.", "Having lived in Europe, I generally try to avoid Mediterranean food in the US just because for the most part, it doesn't come close. However, seeing as how I was strapped for time and needed something quick, I decided to stop by Zoe's Kitchen on my way back to work.The interior pretty much mirrored your typical fast food places, with the cashier up front and tables throughout. Since this was my first time there, the cashier patiently explained the process as she waited for my order. I ended up going with their spinach roll-up with chicken and a side of coleslaw. The food came out pretty fast, but not at the expense of the quality. The spinach roll-ups were delicious; tasty enough on their own, but with the sauce, was absolutely out of this world. It was the perfect blend of savory and sweet.The coleslaw wasn't bad, but had a bit too much mayo. Otherwise, the meal was flawless.Thanks Zoe's, for restoring my faith in Mediterranean food in the US!"], ["Brittany G.", "Always good solid Mediterranean style food when i'm craving something healthy without breaking the bank! The restaurant is quick, clean and everyone who works there is very helpful if you have questions! They have a killer rewards program too so be sure to check that out!My favorite thing here actually is the potato salad, I don't eat mayo so I appreciate that theirs doesn't have any in it! It's very good! Another favorite is the greek salad. Everything i've had here was fresh, and well seasoned. Yum!"], ["Morgan H.", "The staff and the atmosphere of the restaurant are excellent. But the food is awful and not worth the price. It is very bland. The chicken is dry and the steak was slightly undercooked. The side of vegetables were burnt. The Greek salad dressing has no taste. When I informed the staff member of my concerns he listened and went to get a manager. I was not given a manager because the manager felt my concern was not good enough and inaccurate about the food quality. So the manager did not come out to speak with me about my concerns, he sent the staff member back to discuss my concerns. The manager told the staff member that I should put salt and pepper on the food if it was bland. Honestly if you are in the area I would not recommend this restaurant. If you are looking for good food there are many restaurants around it. One I would recommend is The Cowfish Sushi Burger Bar."], ["Aarti G.", "The people were friendly and the place was pretty crowded at lunch time, but the food was just okay.  My salad consisted of a bunch of greens but not many vegetables or toppings.  The dressing on the table just tasted like oil even after it was shaken which added no flavor to the greens.  My pimento cheese was a glob of cheese on bread.  Even though I asked for the sandwich to be grilled, it ended up just being greasy rather than warm.  Pita bread was served with all our meals, but there was no hummus.  There should be a hummus side option in addition to the appetizer.  I'm sure people would order it as a side.  Overall, I was not amazed by my experience here despite all the recommendations and would probably not come here again."], ["Matt W.", "Had the chicken pita. Feta was inside at the bottom, the carmel onions were at the bottom, and the lettuce was eh. So it was good, but not put toegther well. I could prob make same at home. Came with side of beans which I didnt eat. Oatmeal raisin cookie was good. Next time ill get quinoa bowl which alot of the other people got."], ["Tanya H.", "Food is fresh and delicious!! I'm addicted to the grilled chicken and slaw pita. The grilled chicken is moist and so flavorful! Greek salad is crisp and fresh. Zoe's branded dressing is awesome. Grilled chicken kabobs are delicious as well."], ["Kuanyu C.", "If you hang out at North Hills long enough, eventually you will end up at Zoes Kitchen; it's not on the popular side (with other restaurants and movie theater) of North Hills, but if you grocery shopping at Harris Teeter, or hang out for pints at World of Beer, this little sandwich bistro should be a lunch or early dinner spot.The color coordination resembles those frozen yogurt places that keep popping up in this town, with bright orange and yellow and mustard green. Interior design is easy on the eyes, and spacious enough to accommodate full-house lunch hour crowd. The patio is also big enough for 7-8 tables outside enjoying the sun when the weather allows.The foods resemble a trendy light lunch menu: pimento cheese sandwich, and Greek pita, and kabobs, and grilled chicken plate, and soups and hummus and side fruit cups. There are also gluten free selections should that be of use to you."], ["Kristy A.", "Zoe's is a delight all the way around - from the bright and cheerful decor to the smiling staff to the excellent Mediterranean food.   Their menu includes sandwiches, salads, pitas, kabobs, etc. and all of it is good.   My fave is the chicken kabobs with rice and Greek salad.  A healthy portion that I can pretend is actually healthy (it's not, by the way).   The good news is that if you want to actually be health conscious (instead of just pretending), they have a menu just for that.  The special menu includes several pared down options from their regular menu so you can have a hearty meal that doesn't completely derail your diet.  Just be sure to skip the Greek dressing, which is crazy packed with calories.  Another plus -- the take home dinners for four.  You could unpackage it and pass it off as your own.  I won't tell."], ["Jennifer H.", "Hands down, the BEST pimento cheese I have had in my life. The consistency is perfect. There is an ever so slight hint of heat (I don't do spicy) that makes it unique, without overwhelming the taste."]], "Babylon Restaurant": [], "Sassool": [], "Troy Mezze Lounge and Bar": [], "Kabobi": [], "Jasmin Mediterranean": [], "Jasmin Mediterranean Bistro": [], "Justin's Grill": []}