{"Flights Restaurant & Lounge": [], "Tropical Picken Chicken Raleigh": [], "Second Empire Restaurant And Tavern": [], "Iris": [], "Buku": [["Heather B.", "Have this place a first, long awaited, try for dinner with a friend last night. It was very fresh and the staff was exceptionally friendly, as well as professional. We started off with the Edamame, for an appetizer, which was very tasty and fulfilling; not too salty and it keeps you chewing. Then,  for the main course we split the Vietnamese Pho. The waiter encouraged us to get more, but we felt it was the perfect size to split. We both left full. The Vietnamese Pho was so yummy, particulate with the meat and mint in it. The condiments that they give you compliment the bowl very well, and I used it all since I like spicy.Would definition recommend giving this place a try, if you are looking for something alittle different and fresh. Seems like a good spot for a date night as well.I'm certainly be back to try more in the future."], ["Sandy N.", "Their menu changes a lot. I wasn't a fan of their Korean Beef or their inspired Vietnamese Noodle Salad. The server was great in letting me get something else when I found out the Noodle Salad was just noodles in a cold broth. The noodles were harder than I expected as well. The Filipino Halo-Halo is so worth it! Creamy, crunchy and yummy without being super sweet!"], ["Sara C.", "What originally drew me to Buku was seeing a photo of their seasonal arepa dish on Yelp. Even though, as I came to find out, that they do not have arepas anymore, they still have a lot other great food to choose from.Came here on a Sunday night. It was most likely emptier than usual since the North Carolina State Fair was in town. Wanting to balance out my dinner, I decided to get a Ginger Pear Salad and their Baja Crab Flautas.The salad was really good - a healthy amount of dressing and plenty of fresh toppings including pears, almonds, edamame and carrots. The flautas were also pretty good, but I expected more. It was pretty much crab and cream cheese - I expected a little more of something, but it was still tasty.If you're in Raleigh and find yourself with Asian food cravings, swing by Buku!"], ["Traci R.", "My best friend hosted her bridal shower at Buku this weekend. I can't say enough amazing things about this place!First, the staff was beyond amazing! So attentive of everything we needed from start-to-finish. To include hopping on a ladder to hang a sign for us. Once the shower began, our attendants were top notch. They set up a mimosa bar for us and made sure our glasses were filled at all times! (Speaking of mimosa bar, they had not only OJ and cranberry juice, but peach and strawberry puree!!)The menu was delicious and the food came out quickly. And to top it off, the space is very modern so it served as a great backdrop for the event. SO, if you have an event I HIGHLY suggest you have it at Buku! You will not be disappointed. And if you're just hungry, I also HIGHLY suggest you go to Buku!!"], ["Dia D.", "We went here for dinner on a night that they had a large private party in the bar. While the service was super friendly it was a little slow at times. We ordered 4 small plates and 1 large plate. The small plates (Chinese buns with pork belly, Thai green papaya salad, Filipino Lumpia, and Duck Larb) were all outstanding but the large plate (the samosa pot pie) was just ok. The small plates had lots of flavor, spiciness, and fresh taste. Their menu is changing to a fall menu in a few weeks. The ambiance inside was nice and it wasn't too loud."], ["Angelique A.", "FIVE STARS FOR CONCEPT,  DESSERT AND WINE.  The halo halo is a flavor explosion of taro ice cream, coconut, jackfruit, and tamarind. I can't say that it much resembles the dessert I had in manila, but it's so yummy that I don't care at all. Other members in our party got the tiramisu and German trifle and were very pleased as well. They also have great coffee and tea offerings so you can enjoy those instead of Food if you're not up for a meal. The service here has been superior each time I attended. I love that they have an eclectic mix of street food from all over the world and will be returning to try the meals. Note that it is brunch only on Sundays til 5 pm."], ["Jamie E.", "An awesome experience and mouth watering desserts deserve five stars, but Buku loses small points for super sweet sangria and chewy sushi. Still one of the best places in town. After falling in love with the chocolate soufflé during a quick stop at the bar, I pledged to come back to Buku. To honor this vow, the other night a friend and I dined on the beautiful outdoor patio.Our server, Steven, was friendly, attentive and knowledgable about the food. He immediately informed us of their drink special: white sangria. Naturally, we got a pitcher ($20). I enjoyed it thoroughly, though I will say it was a little too sweet, and I am a notorious fan of sweet wine. They also drained most of the fruit out and served it without ice. These are stylistic choices, and perfectly respectable ones at that. I just prefer a fruity, icy sangria personally. I ordered the Buku roll (no cucumber), and my friend ordered gazpacho. The sushi was tasy with lump crab and yellowfin tuna, but the thick seaweed was hard to bite into. I've had sushi with thinner nori, which I've found easier and more enjoyable to eat. The guzpacho, again, was a stylistic flavor-profile that is empirically good, but not for me. This cold green soup had a powerfully fresh flavor and was beautifully plated. Less the spoonful she gave me, my friend ate every drop. Finally, we got what we really came for: dessert. It was national dessert day, and I specially sought out Buku for the chocolate soufflé with almond ice cream that I've been obsessing over since my first visit. It was delicious, as per par. We also tried the tiramisu. Served in a tall glass flute, the layered coffee-flavored pastry looked beautiful. Steven brought out a Kahlua-honey infused sauce that he poured on top. I thought that brief interaction at the table brought the dessert presentation to the next level. Overall, the meal was still a little pricey, and the sushi wasn't my  favorite, which is why Buku didn't get the five stars from me. This will definitely become one of my go-tos though!"], ["Alexa L.", "Wow overrated much? I had high high hopes because hey, it's buku! Everyone's heard of this place and it's supposed to be asian fusion! and they serve ramen! and pho! and arepas! wow!Except i was not wowed in the least. We got the ramen and I made the dire mistake of ordering aforementioned arepas and i'm not sure what i was thinking when i did. I guess I expected something even somewhat similar to those at guasaca? But no, they literally handed me thick, bland, cornmeal arepas, plain. With a side of honey butter or something. So I was basically eating cornbread and butter. It was..anticlimactic to say the least. Buku y u do this to me?!?Oh and the ramen? Also bland and underwhelming. If you want decent ramen (by raleigh standards, not nyc/la ok?) go to sono.oh, at least this place looks nice."], ["Mark W.", "I've been to Buku several times and I've always enjoyed it. The atmosphere is great for date night and generally fits my mood for going downtown. The menu has a good selection of different types of food, so this is a great restaurant to bring groups to. I generally don't have dinner downtown very often, but Buku will remain in my list for when I do.  One of my visits was during Triangle Restaurant Week and I ordered a mix of dishes from the regular menu as well as one of the special 3-course meals. I probably wouldn't order off the special menu again, but the regular menu items were excellent as always. I really like the small plates best, and I would recommend ordering a bunch of small plates over ordering entrees here. My favorite items are the Jamaican Lamb Patties and the Filipino Lumpia. The empanadas, dumplings, and chaat are also good, but they are also easier to find at other restaurants in the Triangle area. Many of the items are naturally gluten free or vegetarian, so this is a great place for people with dietary restrictions.   Buku offers a diverse menu with great small plates, solid vegetarian and gluten free options, a classy atmosphere, and good service. I would definitely recommend Buku for dining downtown, and I'll certainly be back myself."], ["Janet N.", "A group of 16 of us came out to buku for my birthday dinner and it was delicious!! However, being the birthday girl, I never got to see the bill which I assume is pretty steep. If you're looking for a fancy restaurant that treats you like you're made of money, buku is the spot! The food I had was very flavorful and the birthday shot the restaurant gave me was AMAZING!! They were so organized and courteous about our large numbered reservation. I felt pretty stress free! Thanks for a great birthday, bu*ku!Ps. I gave 4 stars for the crappy ramen. So many complaints from my friends."], ["Chris T.", "Brunch. Best I've ever had. They have best in class traditional breakfast items like fantastic waffles and French toast, omelette bar, carving station, breads and muffins and they also have excellent other fair like fried chicken, assortments of salads, hummus and raita, and my favorite chipotle corn. I tasted most offerings and all were superb. Highly recommended."], ["Abbie G.", "When I first moved to the area my cousin absolutely raved about Buku and insisted we dine there.  She told me it was an asian fusion restaurant, so how could I say no?  I was not disappointed!We were seated on the patio, so I have no comment about the inside of the restaurant.  However, the patio was cozy enough, and I had the atmosphere of enjoying my food outside in a very nice city area.  Our server was very pleasant, prompt and kind.  She was descriptive about the menu items when we asked. Our drinks were delicious (mine was the sangria), our appetizers were hot and fresh, and my pho was among the best I had ever tasted! I can't wait to go back and try new items on the menu!"], ["Anila Y.", "Not quite sure what the hype is about this place. I guess my review might be biased because I am not a fan of places that do global cuisine! I am all for restaurants that specialize in one type of cuisine because I don't feel like it is possible to master all types of cuisine on one menu-- Buku just confirmed this hypothesis. We tried four very different items:1.  Colombian Arepas--don't bother with these. They were very bland and nothing compared to the amazing Arepas at Guasaca. It was just a thick slab of corn bread with a little jalapeno butter (not spicy at all) and onion jam. (The onion jam was very good though). But the bread was so thick, that you couldn't get the flavor of the butter or the jam.2.  Aloo Chana Chaat -- Was actually good, and quite authentic. If it had been spicy, this dish would have been great!3. Vegetable dumplings -- good I like that they were very crispy, but they also tasted like something I might pick up from Trader Joes and toss into the microwave if you know what i mean ;)4. Elote -- this dish salvaged the whole meal! I feel like I could eat this all the time! I definitely recommend this item! A great note to end on.We also had some dessert. They actually have a separate dessert chef, which was pretty apparent because the size of the desserts was bigger than the servings of the items we got! The desserts were definitely good, but there wasn't a global selection of desserts besides the Filipino Halo Halo. I wouldn't return to Buku simply because you get very little food for a very high price. The prices are justifiable for Downtown Raleigh, but I feel like at other places you would get much much more food. And then the desserts are very large and difficult to finish. Perhaps if they adjusted their portion sizes, it would be more worth it."], ["Leslie C.", "This restaurant has it going on! It's fantastic. Their Gluten Free menu was loaded with great goodies! I ended up getting a delicious soup with chicken, cilantro, coconut milk...I can't wait to go back and have it again! I also had the Hummus with veggies. Oh wow! Delicious! Best I've ever had!"], ["Jessica V.", "We REALLY wanted to love this place. As a world traveling foodie, I was excited about the concept of this restaurant. My first impression was that there's a disconnect between the upscale ambiance and the street food theme. There's nothing fancy about street food; simplicity, ingredients and sense of place is what makes it beautiful. BF had the samosa pot pie. Folks, a sheet of puff pastry set on top of a mound of lukewarm hash does not a pot pie make! The hash was dry, lacked flavor dimension and was not visually appealing. I had the bibimbap. The presentation was colorful and the ingredients were fresh. The barbecued beef was done perfectly. I would have been more impressed if it were better than the food truck version I had a few weeks ago in Asheville. Perhaps eating out of a takeout container with plastic utensils while sipping a local beer with my man at my side and our dog at our feet in the fresh autumn air is what lent to that culinary experience. Which serves to my point. The beauty of street food is not only the cuisine itself, but the place in which you enjoy it. While it is a noble goal to try to wrap that experience up in a restaurant, i'm just not sure it can be done successfully. Buku tries, but most with global street food experience would say that it's a miss."], ["Hannah P.", "I came here with a friend on a Friday night at around 7:30. The first thing I noticed was the patio seating, where everyone was wearing a button-down or dress of some sort. It would've been a 15 minute wait to sit outside, but since my friend and I were both starving, we decided to sit inside with no wait.Inside has fancy modern decorations with a nice glass waterfall backdrop (noted because my friend particularly liked this) and plenty of seating. There was a better mix of style from the people inside - meaning, some were dressed up, others weren't as much. It made us feel more comfortable and less awkward. (We didn't realize that Buku was on the fancier side. Though we should've known since tapas restaurants are usually more upscale than regular restaurants.)After being seated by a haughty hostess, our waiter greeted us. I wish I had gotten his name - he was so friendly, did a great job of carefully explaining the selection of dishes and drinks, and checked up on us enough times to make us feel cared for but not overwhelmed.We started off with two small plates: the Filipino lumpias and Jamaican lamb patties. The lumpias come as four sliced pieces. These were delicious, especially paired with the side sauce and bed of mango salad. The lamb patties come as two patties with pickled red cabbage placed on top. These were spicier than I expected and the edges were crisp - so good!For our main dishes, my friend got the special of the day (grouper with sesame seeds on a bed of rice) and I got the pork belly ramen. Our waiter raved about the grouper, but it was honestly pretty bland and flavorless. The ramen was also underwhelming: the noodles tasted and felt and looked way too starchy (they were stuck to each other!), the broth didn't have depth (tasted a lot like the Korean o-deng/tempura soup), and the sake-braised pork shoulder was a bit rough and actually kind of tasted like pulled pork. I will admit, though, that the pork belly pieces were pretty large and crispy, and had a good fat:meat ratio.I also want to mention that I got the new Hefeweizen that they had on tap. My waiter decided to add an orange slice to it and told me he's never tried that with a patron, but wanted to know my thoughts. I liked it, my partner didn't. I thought it was a sweet and welcoming gesture, but some people might not like that (#drinksnobs).Overall, the atmosphere was nice and the small plates were great; but the large plates and bowls were subpar, especially considering the high price of them. If anything, just come here for the drinks and small plates. Don't bother with the actual entrees."], ["Jennifer B.", "I'm going to echo the sentiment of most.  I went for the Buku Beer Dinner for Beer Week with 5 courses and 6 beer pairings.  For me, the highlight was the Larb Seasoned Chicharrones and the Lamb.  It was a really nicely organized event where the Brewery explained each beer and the Chef explained each course.  All in all, a fantastic event, great food and I highly recommend.  I can't wait to come back and try the regular menu."], ["Natacha S.", "Girls night out with my best friend visiting for the weekend and Buku was the highlight of our trip! We went on a Saturday night, without reservations, but luckily we still got seated after about 30 mins. While there was a bachelorette event in the bar section, we were able to order a  couple cocktails in the waiting area! My girlfriend and I each had their mule special, and it was delicious! For dinner, I chose their scallops plate served on couscous - I forget what exactly was in it, but the dish was amazing! The scallops were by far the best ones I've ever had ($24 plateThe service was great. The waitress was always around to fill up our waters and she was very polite and friendly :) The dining area is very big, and can accommodate large tables. The decor and the style is also very modern which I really liked. I do wish the menu wasn't so expensive. When we had first arrived, all we saw were beautiful women in high hills specially dressed for a night out so we thought \"this must be a fancy place!\" But turns out all those people were going to the private event in the bar section, and in the dining section everyone was dressed pretty casually. Personally, I would dress up for this restaurant considering the chic atmosphere and the price itself is a little \"dressed up\". It's definitely a great restaurant for an occasion or a date night out :) I plan on going back with my husband this time, in hopes to eat that delicious scallops plate again!"], ["Amber M.", "I want to give this place 3.5 stars, but I can't. It was....interesting? I wasn't really sure what to expect, but I was intrigued by the variety on the menu. The Chinese buns were super yummmmy, although you only got two. It would be perfect for a starter, if I wasn't starving like I was. I ended up getting the saki maki roll, I was craving sushi and it was okay. My mom got a duck adobo, I believe. That was delicious. Again, not a huge plate of food, probably the proper serving size to be honest, I'm just used to huge, over sized American portions.I don't think I would come back here super hungry like I was but the food was interesting not only with the menu options but the spice variety was great! It was different and I did enjoy it. Oh and Brent was our server, he was FABULOUSSSSS! Oh one more thing, I liked the dessert."], ["Nadia S.", "As many of my friends had told me, this place is a hit or miss.  The restaurant is beautiful and the ambiance is great...so are the crab flautas and the duck done 3 ways with coconut rice.  Everything else fell flat. The mussels came out cold. Not sure what to say about that. My friend's beer came out warm and flat.... The arepas were good but not amazing.  The bibimbap was alright, could have been so much better.  Our server was awkward and not very helpful.  We were told the small plates were tiny bites, but I thought they were pretty big portions- you def don't need to order 2-3 per person. I guess I'm used to small plates being like REALLY SMALL like in the big cities, so that was kinda nice.  Glad I finally tried this place out but prolly won't be back.  The hype was not real for me folks."], ["Katie T.", "For some reason, I had yet to visit BuKu, but it had been on my list for several years. Last week, my boss and i made a trip over for lunch during the work week. The enormous outdoor seating area is a huge plus. We had great service, and a very attentive waiter who went above and beyond to make sure our special requests were addressed. I ordered the hummus plate - an abundance of pita complemented the garlicky hummus. I also ordered the papaya salad with tofu (vegetarian). The tofu was cooked well - crispy and a little chewy. It's a bit pricier for a lunch compared to other spots, but it was high quality and a beautiful space for something a little fancier than the vendor down the street. Plus, the variety of the menu really lets you build your own meal out of small plates or splitting larger ones. Will definitely visit again!"], ["Donnell P.", "The best brunch in Raleigh. I love that it's a buffet brunch with all the fixings. Everything from waffles to omelets. The last time I was here with my Mom the buffet was $20 but I thought it was a good value since there was a good variety of items to choose from."], ["Penny P.", "I'm usually not a fan of fusion restaurants, but Buku was delicious! I went with my cousin and our boyfriends for a much needed get together. We ordered multiple plates and with that our server to it upon himself to bring out our plates according to the world regions. And that was a great idea! Really added to the experience!!Also, great cocktails!"], ["Matt G.", "All I can say about Buku is WOW!! Actually, there is a lot more I can say, so here goes: I wanted to find an elegant restaurant in Raleigh that would be good for celebrating an occasion, or for bringing friends from out of town. This will be the spot for that from now on! The restaurant is very big and clean and has just that kind of ambiance that I was looking for, a kind of place where you can spend a good few hours. The server was super-friendly, very accomodating to our requests and questions, and he even offered my wife a glass of sparkling wine for her birthday, and a glass of beer for myself! The entrees do sound delicious, but we went for about 7-8 of the small plates. It tasted so fresh, only prime ingredients. The Mexican corn on the cob dish was so yummy! I loved the crab floatas, and the green mango gazpacho was very innovative (but I do have to say I prefer the original recipe). The highlight of the night though was the dessert, the Filipino Halo Halo was out of this world, wow, never had anything like it , so many flavors and colors! Guava sauce, jack fruit, kiwi, papaya, and obviously the sweet potato ice cream with the beautiful purple color. We didn't want our dish to be done and kept scraping it for more! I would come back just for that. I do have to say we started off on a bad note with this establishment, when we waited to be seated, the hostess was very flat in her manner and not welcoming at all, and when we were seated at our table, she kind of tossed the menu at my wife, not cool! I would take a star off for that if the food wasn't so good. To summarize, I will be back! Merci buku!"], ["Kristen R.", "First, I absolutely love the ambiance of this restaurant! It's modern and fresh but also cozy and comfortable. Every time I've come here I've felt welcomed and at home while still feeling very classy like I would at an upscale restaurant. The service is always attentive, professional and fun. Servers are very interactive and know the menu well which is always helpful when you need guidance on what to order. First time here I ordered the pork belly ramen and my friend ordered the Scottish salmon. Both packed with flavor and fresh ingredients. Salmon perfectly cooked and seasoned. And both decent portions. Second time around I ordered the Colombian Arepas to start, which was unfortunately a huge let down. Good texture but really lacked any flavor at all. For my entree I got the vietnamese crepes with summer rolls. While everything was fresh and tasty, the shrimp (which made up most of the crepes) were ridiculously overcooked! I felt like I was eating chunks of rubber. It kind of ruined the whole dish for me. (Some friends ordered the samosa pot pie and buku hot pot which they both loved!)For dessert, we ordered the honey & kuhlua tiramisu and it was heavenly! Very big portion for a dessert which was nice.Overall, I really do like this place for a nice dinner every so often but unfortunately I think it's very overpriced for what it is. The food is good, but I don't think it's good enough for what you pay, which is why I can't give it 5 stars."], ["Rachael H.", "Of the restaurants in downtown Raleigh.  This just isn't a favorite of mine.  I went for my second visit (the last was actually a few years ago) last night to celebrate a friend's birthday.  Our server was fantastic and they had Bell's Hopslam on tap.  Those were probably our two highlights of the night.  For food, we decided to try two small plates and one large plate.  We ordered the Colombian Arepas and the Filipino Limpia as our two small plates.  The Limpia was also a positive note on the the evening.  I was thankful for pictures and reviews on here recommending it.  Food wise - it was the best thing we had all night.  I have never had Filipino food before.  To help someone else in my shoes, I would describe it as a cross between a pork dumpling and an egg roll.  The filling is very similar to a pork dumpling filling and then its appearance and outside is similar to an egg roll.  The green sauce and mango salad served with it were great.  I continued to drench each bit in the sauce and cover it with the strips of marinated mango.  If I went back, I would order this dish again.  Arepa wise - neither of us were two impressed.  I've decided that I'm just not an Arepa girl.  I think they are all generally a bit greasy (even the ones at Guasaca).  My husband loves Guasaca so he was looking forward to these.  They were just a bit plain.  They served the arepa standing alone.  We had to slice it down the middle and then spread either jalapeno butter or onion jam on it.  While both fillings were tasty, they were very modest - especially in comparison to Guasaca.  Even my Guasaca loving husband was disappointed.  We wouldn't order these again.  For our entree, we chose the Pork Belly Ramen.  We chose this on a recommendation from a friend.  Although it was visually a spectacular dish - the flavor profile just didn't hit it for us.  It was very savory, maybe even a bit umami.  We like a little more spice or sweetness. Great service and some good things here and there but, more misses and an expensive price tag will probably keep us from choosing this location over some of our other downtown favorites."], ["Wei T.", "Like it! The appetizers were good, duck confit main was great except for a little bit salty. Desserts were the highlight! Strongly recommend the sorbets combination, each flavor was so delicious!"], ["CF P.", "Amazing menu and even better service! Save room for the Chocolate Soufflé !!!  Morgan is the best server - cute and friendly, she keeps us coming back!! And the bar drinks are awesome!!! Unique and tasty!!"], ["Heidi H.", "Global street food....looked good, but hey, I'm from the Bay Area and I'm in Raleigh, NC - so hopeful but wary.  Our wariness was quickly quelled.  Starting with friendly staff and ending with a great wine flight offering of terrific Spanish wines, we were so happy with our food that we came back the next day to again catch another late lunch.  Huge plus that they are open straight from opening to closing, so catching a late lunch was not a problem.  On our two visits, we had Buku edamame (interesting with the addition of sesame oil), Ginger Pear Salad (excellent), Baja Crab Flautas (to die for if your ready for a little indulgence), Vegetable Dumplings (very good), Pork Belly Ramen (also very good), and the Buku Hot Pot (out of this world good).  The only disappointment was the Buku roll and it was still acceptable  (we were looking for more heat and better nori wrap).  I didn't try any of the East Indian offerings, only because the Bay Area has Vik's Chaat House - arguably the best Indian street food in the US.  It's not getting more than 4 stars only due to the sushi offering....eat here, you will love it!"], ["Em P.", "To begin, the edamame is impeccable! Smoky sea salt and sesame oil, generously tossed in sesame seeds... Forget it, so good! The steamed pork dumplings were great as well, but I have to get to the hot pot and the bibimbap! The hot pot was unreal, Tom Kai Gai-esque and had a sweet and spicy flavor from the red curry. Sooooo good! The bibimbap inspired me, seriously! Sesame carrots, bread and butter pickles, pickled radishes, hangar steak, gochujuong, soy marinated mushrooms, scallions and a fried egg.... It was just unbelievable! I would have loved a poached egg (or 7 poached eggs) more than a fried egg, but listen, no complaints here! We love this place"], ["Kevin M.", "I went this past Saturday night with my wife and sister in law. We didn't have reservations and didn't want to wait 2 hours so we sat in the bar area which we got a seat right away. The menu has small plates (appetizers) and are plates (meals). The Sangria was excellent and they had a local beer which also was amazing! We had appetizers and dinner and desert. This food was delivered fresh from the oven at the perfect temperature, was so delicious! The flavors were layered so well that you could not stop eating the food was that delicious! Our waitress was excellent even though they were extremely busy she made us feel like we were important and we never had to sit and wait for her. This was the best meal I have had in 40 some years and is a must for our favorite occasions to go to! I highly recommend reservations, and they have an outside patio that is also available."], ["Joel T.", "Lovely contemporary decor and great service. Our party sampled Edaname with spicy sauce, Asian Pear Salad, Vegetable Pieroggi, Potato Cake and Creme Brûlée, complemented by well suited wine.  All were tasty and nicely prepared. They got us in and out on time to make theatre start. Will go again."], ["Sam Z.", "Top 5 meal in raleigh. Dinner = amazing. We got a mix of small plates of 'street food' aka mostly dumplings, sushi and some entrees. There was nothing bad on the menu!But the real thing about Buku that blows me away is their Sunday brunch. It's only buffet which I usually don't like as much as a normal menu, but theirs is the best breakfast buffet I've ever had. They have some of their global street food for breakfast, along with salads, hummus, a Greek yogurt bar and normal brunch food like a waffle bar, omelette cooking station and meat station. I highly recommend this place for brunch and dinner."], ["Lauren E.", "Great location and very nice atmosphere. A little more sophisticated than places close by.  I sat at the bar and ordered the house special which was not something I would typically order. Hawaiian flank steak with coconut rice and some kind of crispy version of bok choy with mango salsa. Oh. My. Gawd. Soooo good!!! The bartender was very friendly and poured Good drinks. Will be back!!!"], ["Bobby P.", "What a great place in the heart of Downtown Raleigh!The hot pot was tasty and warming, the beer selection was perfect, and the service was very welcoming.I'll be back."], ["Anna W.", "We enjoyed the food, but there's plenty of other reviews about that. The ambiance was nice with a fun waterfall feature. I had my toddler with me, and he liked that.We didn't pick the restaurant that night, so I wouldn't have generally brought a toddler, and indeed they werent prepared for him. The waiter had a hard time understanding that we needed to get him his meal asap, but we got through that OK.Biggest surprise was my dusty plate. It had been sitting on the table when I arrived, so I assume it had perhaps been there all day and collected dust. Asked for a new plate, and it was dusty too! Between needing to pay attention to my child, not wanting to distract from the celebration we were attending, and being too impatient to wait for the waiter to come back, I just cleaned it off with my napkin and water and went on my way. Two dirty plates is enough to keep me from returning."], ["Geoff And Jenni G.", "Cocktails were excellent... food was great...  several large tables, so good for groups and not too noisy...Definitely would come back..."], ["Lisa W.", "I had Buku bookmarked for quite some time based on friend's suggestions and Yelp reviews. I finally made it this past Friday for lunch and after my first visit I am already planning my next. The space its self is beautiful, the décor, the lighting, and furnishings all tastefully done. It is one of the largest restaurants I have dined at in DT Raleigh and my husband and I chose to sit in the lounge area to enjoy the window view and some people watching. Service was perfect, it was during one of those \"snow days\" and after the lunch hour so we were free to enjoy ourselves and not feel rushed. Cocktails were superb - Strawbanero Sling- $9 and the Appalachian Slush- $8, well thought and mixed concoctions. For small plates we went with the Jamaican Lamb Patties- two for $10, Baja Crab Flautas- two for $9 and the Filipino Lumpia- two for $9. The Lumpia was the gold star winner with the cilantro chutney. If you love cilantro like I do then this item should be on your short list. The Lamb patties were a solid sliver. Not bad but I wouldn't get them again. In Jamaican dishes I am looking for that spice profile that these just didn't have and were quite bland considering the region they were trying to mimic. The pickled cabbage they were served with was a nice touch. The Baja Flautas were more like a spicy crab Rangoon. There was a balance between spicy and sweet with the mango-habanero salsa but I mostly just tasted the cream cheese and zero crab. I wouldn't get these again. I am a huge fan of small plates, getting to try a bunch of different plates without stuffing yourself is my ideal dinner. They have 20 or so small plates to choose from but they also have about 12 large dishes/meals if small plates aren't your thing. Overall I enjoyed my experience and look forward to trying more of their dishes in the near future."], ["Carol S.", "This rating is not entirely based upon food so keep that in mind.  Food wise I have no issue with Buku.  The menu offering is good as well as presentation.  My issue lies in an experience my husband and I had when trying to visit the restaurant one day... We had been to Buku previously for a late night bite and I had been with co-workers for lunch and enjoyed my meals.  But today we were out enjoying a nice walk out with our dog.  We were on our way back towards our condo and decide to have lunch out.  We pass by Buku and ask for a table outside  after a few back and forth communications with the hostess and what I presume is the manager they decide they cannot allow a dog on the patio.  I'm a dog lover but I also respect a business' right to not allow dogs so okay fine, we go home and have lunch.  The very next day and I do mean the very next day we are walking back by the restaurant and there is a lady eating outside with her dog.  She was not blind and the dog was not wearing a service dog vest.  I own a small and very well behaved dog, so much so that people often forget he's with me until I leave.  So my complaint is with the inconsistency of Buku's rules regarding dogs.  Either allow them or don't.  The lady with the dog was about the only business outside that day but rules are rules."], ["Rod O.", "Our First Real Meal here was during Triangle Restaurant Week...My Bride ordered from the regular Menu and I ordered from the Restaurant Week Menu!Hits :Winner \"Best Restaurant Week Menu Summer 2014\" RodO AwardsPresentation - Beautiful!  Artfully Displayed!  Enjoyable to shoot!Curry \"Panang\" (They Said)... We said something else...Still it was Good!Soft Shell CrabRed SlawFilipino Sausage Roll (my Description)Cilantro SauceMexican Corn on the CobbMissed : :Mango Chutney - tasted more like Orange Rind Marmalade, nice color Perogies were Poor!  NO POOR!!!  Sauce was Awful !  This twist was meant for something Asian, NOT Polish !Filipino Dessert  -  you may like if you Love Pineapple, wait, I LOVE Pineapple and did Not like this one...the cakes with it were better than the Dish as a Whole and the cakes were plenty PLAIN!Before this Dine, my Bride and I had Dessert and Appetizers here on Election Night and we were not so Impressed, thus the long gap between visits, I have visited a few other times before and after....From these experiences I was expecting to have to stretch yelp stars to get the review to 4 yelp stars... I'm NOT a fan and I doubt we will ever come back, still we were Impressed enough with the majority of the food that i believe they earned 4 yelp stars from me!Unimportant END Notes  : : :International? What that could mean and does mean... Street Food!  Cool sounding?Designer!  Definitely Designer and surprisingly well done on more than half of the Dishes we were served!One of the things that bugs me about the so-called  \"Celebrity\" Chef's is when they cook outside of their area of expertise and assume I'll like it because they are Famous and all of us are not (so they Assume)...Hey POPROCK LOVE : : : :The origin of my relationship with Buku was a recommendation from POPROCK LOVE who asked someone in Raleigh (probably Ron W.) about a place for me to take a Date...this was years ago when Buku was newly opened.  I finally finish my review."]], "Mandolin": [["Alexa R.", "Came here for brunch a few weeks ago and the highlight was the role we got at the beginning before the meal came out. The food that me and my family ordered was very average. The service wasn't that great either. Our server seemed a bit cocky and when we asked for an ingredient added to my sisters omelette he said our chef will not do that. I'm sorry, but I didn't find the food yummy or quality enough for the chef to have a too good attitude. My parents also went for dinner last week with some friends per invite. They said their food was terrible. Since my experience was average I am going to go with 3 stars. It's unfortunate bc I've heard good things and since it's basically down the street from my parents house it would have been nice to have a good brunch spot. Oh well!"], ["Amie K.", "Farm-to-table cuisine with a great summer selection. The pork ribs were delectable and the tile fish light and tasty. The cocktails were well balanced and the ambience was lovely.  Ashley, our waitress, was friendly and very knowledgeable about the menu. Will definitely add this to my list of favorite places in the Triangle."], ["Mark L.", "Pretentious6:30 pm on a Tuesday night and we showed up without a reservation, no wait but we were seated at the bar.  We came to celebrate our 37th wedding anniversary and let the bartender know.  The food was tasty, unique combinations and worth a try.  The atmosphere was a little harsh for celebrating, I prefer Morton's, they go out of their way to help with the celebration.  To be fair the bartender did give us a free dessert.  We did enjoy the meal, but the two desserts we tried weren't very good.d"], ["Jennifer B.", "I knew that leaving Charleston was going to be hard from a food perspective, but I felt like I was right back in the Holy City as soon as I pulled up to Mandolin.  The restaurant is situated in a nice neighborhood setting with valet parking, Amen!  The interior was tastefully industrial.  We were greeted by a friendly Hostess who immediately took us to our seats (I had made reservations earlier in the week).  We promptly ordered drinks, my friend got wine, and I tried a \"peach cobbler.\"  Now I don't know that it screamed peach cobbler, but was a good drink nonetheless.  Our waitress was very knowledgeable and friendly.  On to the first course, I selected the peaches with house made mozzarella, and my friend ordered the tuna crudo.  They were able to accommodate her gluten intolerance, which was much appreciated.  My peaches and mozz was delicious and beautifully presented, but somehow was lacking a little something.  I thought to myself, this dish would have been absolutely perfect had it been served with burrata as opposed to mozz.  Burrata is a fresh Italian cheese made from mozzarella and cream, and would have given a little more moisture to a somewhat dry dish.  The tuna crudo was delicious.  Dinner my friend selected the steak with sun chokes and I, the ribs.  Both were solid, but not blow your socks off good.  I'm happy to have such a lovely restaurant close by and will be back to try their fall creations."], ["Jill O.", "This was my first visit to Mandolin, and I recommend it as a \"special occasion\" place because it's in a pricey category of restaurants. Now, I didn't really have a special occasion to be celebrating, but sometimes I need to live a little.I had the Tilefish which was fresh, meaty, and perfectly seared and served with grilled okra, peaches, and succotash. This dish made me realize I need to appreciate the last few weeks of summer before Fall arrives. The French 75 cocktail was a good fit for my dish (fizzy, sour, lemony), and I would order it again.My husband had the hangar steak, and every ingredient was better than the next. Buttery mushrooms, oh yes.  His drink, the Royal Dub, was smoky with szechuan peppercorns, and that crushed ice I love so much from fancy cocktail bars. I had a lot of sips from his drink, because it was so different (if you ask him, too many sips).We liked the roll and cornbread that came with our meal, and the fresh flowers and/or herbs on each table, the entrance, and the restrooms were a nice touch.A lot of restaurants use the words \"local\" and \"seasonal,\" but it really felt true at Mandolin."], ["Stephen H.", "I've been wanting to visit this place and took my wife along with a few friends there last night for her birthday dinner. Got to say that the food was excellent. The open face BLT is with every piece of fresh tomato and bacon. The main course was oh so great. Everyone from the moment we entered the restaurant were friendly. I loved the feel and will be going back. Worth the visit for dinner. Parking is just bad."], ["Casey K.", "One of the best restaurants I have been to in a while! Loved the atmosphere and food was phenomenal. You could tell that everything was so fresh! My husband and I ended up both getting drinks, appetizers, an entrée, and sharing a dessert - which is WAY more food than we usually good, but it was just way too hard to pare down our choices! To drink I got the sangria, which was good - not great and my husband got the Garden's Bounty which was absolutely amazing! For appetizers we got the peach and mozzarella salad and the halloumi cheese salad, both of which were so fresh and had great flavors. For our entrees I got the striped bass, which was good, but the veggies underneath really stole the dish as they were phenomenal. My husband got the signature chicken and waffles which were melt in your mouth good and apparently a menu staple. For dessert we got the chocolate soufflé which was the perfect end to an amazing dinner - they bring it out right from the oven and pour in the hot fudge and add the crème fresh right at your table. We will definitely be back especially since the menu is always changing based on what is fresh - so there will always be new choices!"], ["Stephen W.", "Brunch, sort of Southern.I wanted to give this place at least a 3.  We went here last Sunday for brunch with a party of 10 and I really like the forward thinking decor, modern, not trendy.  The our waiter was pretentious initially and borderline rude until she was not so subtly advised that she needed to improve her level of service. Finally, the food...  First we had Beignets as a starter.  They were denser, smaller and generally not as appetizing as those that I have had in other restaurants all around the southeast.  Our group ordered several different breakfast entrees.  I ordered the shrimp and grits but I also sampled the Omelet Du Jour, and the biscuits and gravy.  The omelet du Jour which consisted of a pheasant confit which was pretty tasty but other than the limited amount of pheasant confit was fairly tame and not particularly well seasoned.  The home fries were over cooked and crunchy all the way through.  The shrimp and grits were perfection.  The fresh NC shrimp were excellent.  The grits were cooked well but a little too much cream for my tastes, especially as compared to those I have had in Charleston, SC, some think the mecca of shrimp and grits.  Finally, the rue over the grits formed a full layer over the grits, way too much gravy.  The biscuits and gravy were not good for only one reason.  The sausage used in the gravy was ITALIAN SAUSAGE!  Once you substitute fennel seed rich Italian sausage from sage heavy southern style sausage it ceases to be Southern, unless this is a dish popular in Southern Italy rather than the southern part of the United States.Like I said I wanted to really like this place.  If I open a restaurant one day I would want many of the same elements.  Clean, modern, straight forward, farm to table menu.But in Raleigh with a diverse clientele your wait staff has to bring their A-Game at all times and a rocky start such as nearly being offended when asked if the chef will substitute an ingredient, being short, resisting serving coffee before the entire party arrives also leaves a bad taste.  Many may be willing to tolerate this type of silly treatment but my group was and I were a little disappointing."], ["Charlotte W.", "We were at Mandolin for a private event and it was awesome. The food was just right and the service was commendable. Both Sean and Lizzy were quick to oversee that all was served at the correct temperature and all at once. Dessert was amazing. The cocktails were smooth and went down real nice. Keep up the good work."], ["Jamie W.", "Great service. Mimosa 's were ok, nothing great. Food was good, had the country breakfast, great biscuits!  Little pricey, 66$ for breakfast..would like to try dinner.. great place for a brunch date, cute place"], ["Richard K.", "We went to Mandolin last night for dinner.  This was the second time we've eaten there.  The food was good and they have an interesting menu.  I had the charcuterie for the appetizer.  It was a nice assortment of pickled things and cured meats.  My favorite part was the pickled tongue, which was great and something you normally don't find.  The bistro steak with braised fennel was very good and the buttermilk pie was also great and again, not something you find at a lot of restaurants.  The pie had a nice lemon flavor and was made with a tart crust rather than the standard pie crust, which was a nice variation.  My wife had the barbecued ribs, which were very good.  They provided a hot towel for her fingers, but the meat was falling off the bones so you could eat it with just your fork.My only criticisms would be taking up real estate on the menu with chicken and waffles.  It doesn't really fit the menu and seems like a too often repeated fad.  Also, the bartender didn't seem to know how to make a sazerac.  Service was great, fast and very friendly.  The price was very reasonable for the type of food and restaurant.  Definitely worth it if you want someplace for a special occasion."], ["Frank N.", "Once again my wife and I had an awesome meal at Mandolin.  We took my parents for the first time this past weekend and they loved it as well. My wife and I have been several times, but because the menu changes so often, it's like a new restaurant each time.  I went with the porkchop which is typically a staple and awesome, my mom went with the country fried steak, my Dad tried Chicken and waffles for the first time in his life, and my wife had the red drum.  All our entrees were cooked perfectly, and the wait staff was very attentive. We also ordered a couple chocolate souffles for dessert, which I highly recommend everyone try them, but make sure to order them when you order your meal as they take some time to prepare."], ["Brittany F.", "There's a lot of to love about this restaurant. It's a fresh take on southern cuisine and has solidified its place in the Triangle's fine dining scene. I loved the decor and service was phenomenal. The food was delicious, but fell short of a five star ranking at this level.  I'll break it down in pros vs cons:+ Great selection of wines by the glass and knowledgable staff+ DELICIOUS cornbread muffin and yeast roll. I'm not sure which I loved more.+ The menu was small but I thought there was a good variety to it. I'm pretty picky and there were still 2 or 3 dishes I had my eye on.+ Andrew ordered the special, a 16oz Ribeye, and cleaned his plate.+ My hangar steak was perfectly cooked+ Walking distance from our Five Points bungelow- The Panzanella salad was delicious, but the croutons were too crunchy to chew. I thought panzanella croutons usually were marinated beforehand? I'm thinking they forgot that step...- My veggies had a smoky quality to them, presumably from the wood fire oven, but it didn't fit well with the rest of the plate. The tomatoes were also not quite ripe.- Everything was a bit oversalted- We were a little surprised by the pricetag at the end of the meal...we knew it would be a nice night out, but expected it to be around $100. Instead with 2 drinks + 2 starters + 2 entrees, we ended up at around $140 with tip. Come prepared ;)Overall, we really enjoyed the night and will definitely be back. They have fun nights during the week including wine tastings, Beer & Chicken Nights and Burgers & Bourbon Nights. Looking forward to trying those out soon!"], ["Ben S.", "What a refreshing experience. Truly a delight, from start to finish. The best dining experiences are usually as much about the details and the subtleties as they are about the food, and Mandolin got it all right. An absolute pleasure. Just go - you will not be disappointed."], ["Amanda S.", "Classy -- Beautiful -- Extraordinary StyleThis restaurant went above and beyond my expectations. My girlfriend had made reservations at Mandolin weeks ago for my birthday celebration and I was blown away how everything was beginning with just walking in the front door. The decor is fabulous. A little modern, a little chic but very warm and inviting all at the same time. We were quickly seated and the set up of all the tables is cute and inviting. Our server wasn't ready immediately but two other servers came and introduced themselves, gave us water and bread, not long before our server came to our table and offered us drinks and told us the specials. I ordered the trigger fish with vegetable quinoa and pan seared avocado and my girlfriend ordered the chicken and dumplings. Both were fantastic meals. Since I have to be aware of gluten in my meals, it was definitely a question we asked the server. They didn't have a separate menu but he quickly could point out specifically how they prepare every dish which ones included gluten and which did not. I'd have to say about 50/50 on the options that I was able to order from on the menu that did not include gluten. We both ordered a glass of wine as well. Our server had great knowledge of various wines that would pair up nicely with our meals. Before we knew it, we had been there 3 hours and had just been talking away! We ordered a decaf and regular coffee which they brew specifically for you in a French Press (they use Larry's Beans coffee, FYI). Also, we ordered the lavender cheesecake that was phenomenal. We had some trepidation about ordering food that actually had pieces of lavender in it, but after one bite (and it looks like a scoop of vanilla ice cream) we were hooked! It was the most delicious and refreshing dessert we've had in a very long time. All in all, we were more than pleased with our service, the food options, presentation, decor, and ambiance. Our visit to Mandolin will definitely go down in the memory books for us and we've each spoken about our visit to various people and most definitely want to go back again soon! If you want a nice, calm visit to a nice restaurant where it's nice to actually dress up a little bit without going all out (financially), then Mandolin is the place for you!"], ["Lauren R.", "I have a new favorite restaurant in Raleigh.  I often find that local restaurants don't live up to the hype, but Mandolin certainly did!First, I loved the atmosphere.  The interior is modern, yet welcoming.  High ceilings, lots of light, light-colored wood, simple furnishings, but flowers on the tables.  The kitchen is somewhat open--there's at least a large open window in--but it's separated by an area for the waiters to group dishes, so the kitchen doesn't pour heat and sound into the restaurant.We ordered cocktails.  My boyfriend got a sazerac--which wasn't on the menu but they made for him without a problem (although the waitress had to check with the bartender); I had one of the cocktails from the specialty menu--the horn and suckle.  Made with laphroaig (a single malt whiskey) and mole bitters, it was sweetened with honeysuckle and came out to the perfect balance of alcohol and sweetness.My boyfriend started out with soup, which he liked, and I opted for the caesar salad.  I rarely order caesar salads, as I'm usually tempted by fancier menu items full of exotic fruits or colorful vegetables.  But, I'm really glad I ordered it this time because it was the best caesar salad I've ever had.  It was the right amount of dressing, but the house-made garlic croutons are really what stood out.  They were amazing--light and buttery and crispy.  I would go back just for the salad.Then our entrees came.  My boyfriend had the fish entree, which came with quinoa and had somewhat of a southwest twist (grilled avocado, some sort of tomatillo sauce, etc.).  It was quite good.  I had the chicken and dumplings, which I LOVED.  The drop biscuits on the dumplings were to die for, and the mixture itself was full of perfectly cooked chicken and vegetables.  It tasted like my grandmother's cooking, but with a slightly more sophisticated set of flavors.  The skillet was huge--and I had plenty for leftovers.Dessert was the only part of the meal that wasn't amazing.  And it was still good.  Once you look at the dessert menu, you'll see what I mean.  I think because the menu features upscale southern food, the chef wants to get really creative with the dessert menu.  I appreciate that--we ordered a lavender ricotta cheesecake with candied hibiscus (and that was one of the more traditional dessert options, other than the obligatory chocolate souffle).  The dessert was really creative and it tasted good--but there were too many different parts for my taste.  I appreciated it, but I can't say I would order it again.Finally, the restaurant featured great service.  The waitress was friendly and knowledgable without being overbearing.  And the price was right.  Our bill came to $95 before tax and tip--which wasn't bad at all for such a great meal--two cocktails, two appetizers, two entrees, and a dessert.  The whole meal was very good, and I am looking forward to returning, maybe for brunch next time?"], ["Kristy A.", "With all the four and five star reviews, I was sure I'd love it.  But...  Overall, Mandolin has some really good features and some so-so features.  We went early on a Wednesday night (and one of the first nice summery evenings in a while), so it wasn't busy at all.   It took a minute for the hostess to seat us - no problem, as it gave me a chance to check out the decor.   The decor reminds me of several places in Charleston.  Modern, but with rustic materials.  Reclaimed wood on the walls, rustic brick floor, etc.  Really impressive overall.  The service was good.  Fine dining quality and she took the extra step of offering a pickle dish to the non-bread eater in our group.   Everything was prompt, the specials were well described, no service issues overall.   So why only three stars?  The food.  I feel like they really fell down on the food.  We ordered two low country boils and the duck and dumplings.  Two of us had wine as well.   The wine was a meager pour...maybe 4 ounces?   The low country boil suffered the same stinginess, with maybe 5 small shrimp and a half dozen clams.   It's fine dining, so I don't expect a giant portion, but my companions left hungry.  The seafood broth was outstanding, but it didn't help the slightly al dente potatoes.  My duck was closer to adequately sized, but the broth was under-seasoned and there was so much of it that I felt like I was eating soup.  And it made the otherwise good gnocchi sort of soggy.  In the end, nothing was BAD, but none of us felt it was worth $28-$29 an entree.  I'd spend that money at the Stanbury before I'd rush back to Mandolin."], ["Bruno N.", "one of the best brunches in the triangle. food is fresh and they have a rotating menu. nice place!"], ["Ian Maren C.", "Excellent Brunch!! Went here based on reviews.  Busy but not overly/annoying busy.  Staff was great. Place was very clean, decor was great.  The coffee was very good and you could tell it was fresh brewed.  The food selection was great and the biscuits over fried chicken were outstanding!!! highly recommend for brunch.  Plus quality for price was outstanding."], ["Lauren G.", "I dont normally do yelp reviews but i recently visited mandolin yesterday. The first two courses were great but the dessert was fantastic!"]], "El Pollo Rico Restaurant": [["M T.", "If you want some reall pupusas or enchiladas or sopes or whatever i would really recommend this places. They literally make it out of scratch and it comes out tasting THEEE BOOMMBB!! Growing up with hispanic food made it hard for a restaurant to replace it but this place made it!!!! Lol."], ["Paul E.", "El Salvadorian food at its best as I guess from the flags on the wall. If you like Peruvian Chicken it's almost alike except for the green and white sauces they have Salsa. The ambience is not something to look forward to as tables and chairs in my sons school cafeteria is better. They have a row of refrigerators like in 7/11 filled with beer. A shelf of ingredients that they use covers the kitchen. Don't get me wrong the food is decent. But the ambience is not something to admire. Your better off getting a take out or invite all boys and drink here. As I ate I didn't see a single lady eating because this is not the kind of place to take one. I ordered their Chicken covered with shredded vegetables and Tostones or fried flattened plantain. They are courteous and accommodating."], ["Y I.", "I regret not coming here more often (only came two times) and now I'm moving to Florida ): I love their Baleadas and pupusas.It has a family atmosphere feel to it & it tastes as authentic as you can ever find"], ["Laurie V.", "My dining companion and I are always reluctant to review these spots that are so wonderful, because it's like having our own little well-kept secret!The pupusas......mmmmmmm.......they were so deliious, melt-in-your-mouth good.Everything there was just amazing.  It was clean.  Service was fast and friendly.  Everything was just great.  I loved it.  I've been to a lot of Central America, but never El Salvador......this makes me want to go.  They know how to do food.  Perfect flavors.  Love it.Love it.LOVE IT."], ["Josh P.", "Ordered steak and rib combo, but got the chicken and ribs. Language barriers were a huge issue and the place was quite loud too. Food was okay, but very dry."], ["Tanner H.", "We visited this restaurant because of the great Yelp reviews...and we were not disappointed.  The Latin cuisine was authentic and was the best tasting food we have had in a long time.My partner ordered the huevos rancheros, and I devoured the yuca fritas y chicharrones.  Amazing food and friendly staff.  Speaking as foodies, we highly recommend this restaurant.  Ignore the \"dive\" appearance of the exterior and give it a try."], ["Chris T.", "I knew this place was going to be one of those great hole in the walls the second I walked in the door. It was busy and every person in the place was latino except for me and my guest. Always a good sign when you want quality Mexican/Central american cuisine. The seating area is very simple and seats probably 30ish people. I ordered the steak tacos which were simply awesome. Served authentic style on two soft corn tortillas. The tortillas were really something special. They were soft and had been grilled a bit to bring out the flavor. Each was filled with a nice helping of chopped steak and pico de gallo. The dish was served with a most sticky rice and pinto beans. I'm something of a taco nut and these were the real deal. The best I've found so far in Raleigh. My guest ordered the chicken version and he enjoyed them as much as I enjoyed mine. They also have a large selection of beer and latino style ice cream bars and frozen fruit which I plan to enjoy in the future. If authentic tacos are your thing definitely check this out. 5 stars. I copied my google review here why type it out twice."], ["Meryl Z.", "Great pupusas. I liked the bean and cheese best. Also the salsa verde was delicious. We did carry out which was perfect, but looked like it could be a fun spot to enjoy some beers and watch soccer while you ate. I'm not a meat eater, and there were plenty of bean, cheese, and seafood options. But I imagine the beans may have had pork fat."], ["Steven C.", "Hole in the wall, it has the best papusas in town. What they call enchiladas are actually like crispy sopes, and better than any other sope I've had in town. Just about everything I've had here has been perfect. Service is pretty decent too. The jukebox can be deafening however."], ["Braden B.", "Amazing hole in the wall follow the numbers on the buildings to a mouth watering heaven"], ["Lander P.", "Best pupusas in town. I've tried several but these taste like they are from El Salvador. Great food good people."], ["S M.", "Great food.Hidden on the side if you are coming from the main road just loop all the way around.Definitely an authentic taste and flavor!"], ["Karla H.", "Best food I've had in the triangle for authentic Latin food. This rivals the pink taco truck back home. I can't say that in few days I've been here twice.I've been back so much, I need to just say that I see the same customers. This is a little known gem and needs the attention it deserves. soooo yummy!!!!THANK YOU!!!"], ["Joanna D.", "I've been back to El Pollo Rico twice in the last two days. Wow, their food is even better. Previously, their pupusas were somewhat lacking. They have stepped up their game and they are some seriously delicious eats. I had pork and cheese pupusas on both days. Today, I also had the plantanos fritos, sweet plantains, savory refried beans and crema. So friggin' good. My husband had the carne asada plate and really enjoyed it. The price is right and the food is satisfying. This place is still a winner."], ["Eucli B.", "A store/restaurant that offers a wide variety of Central American food and a good selection of beer. The portions are big and the prices are fair. The food is amazing. This place is a must if you're looking for some Latin food in the Raleigh area."], ["Brian M.", "If you want REAL Mexican food, this place is for you!  Tacos with fresh cilantro, lime and corn tortillas, NOT FRIED!!"], ["sean c.", "This place is AWESOME. Just down home authentic Mexican/Central American food. I was in Raleigh for the day and just stumbled across this place. I ate with three Mexican friends and they all LOVED it. I would recommend this place to anyone looking for authentic and delicious food. I signed up on yelp just to give this place a review."]], "Margaux's Restaurant": [["Laura H.", "Have been dining at Margauxs for many years and always wonderful!   I have visited with family and friends and also brought my group in for business (sometimes 40+ people) and Margauxs always does an outstanding job!   Food, service, atmosphere- all top notch!   One of my favorite restaurants in the Triangle!"], ["Jason G.", "I came here a few years ago while in town and forgot to write an awesome review.  i really loved this place.The company I was working for, did a new employee dinner here and it was awesome. Good 'ole southern charm and food.  Nice private dining room.Great ambiance, great drinks, great food.  If I ever get back to Raleigh, I will be coming back!"], ["Dina W.", "Whenever the menu offers something I can't cook myself, then that's what I order.  I had the duck!  Oh my.  The only other place I had had duck was in Budapest many years ago.  I remember I enjoying the flavor, but today's was even more amazing, and truly an unforgettable meal altogether.  The service was very welcoming and attentive from start to finish.  My partner ordered the antelope.  We both thought the duck won hands down.  Yes, it is pricey,  but when you have an all around wonderful experience like ours wS, it was well worth it."], ["Wayne G.", "On many levels, I liked this restaurant. Very comfortable, good drinks, and most of the food was very good. The tuna, however, was just not good. I tried to tolerate it, requesting some Ponzu sauce to disguise what appeared to be a weird, almost old flavor. That didn't do the trick. At the end of the meal, our server noted that I had eaten less than half of my dish. I told her that it had a funky flavor. I was disappointed that nobody else talked to me about this poor dish. I might go back, but the lack of responsiveness to a problem like this was very disappointing."], ["Kenyetta H.", "I went to this place during restaurant week last Thursday. The place is really nice. It had a great ambiance. The patio area was nice as well. I had the crabcake with potato salad. It was pretty good. For the entree, had the salmon on garlic potatoes. That was great. Lastly, for dessert, I had creme brûlée. It too was great. The service was amazing. Definitely knowledgable about the food. love to go to a restaurant and the servers tell me what they think is good or not good. I would definitely go back there again. Hopefully, the other food on the menu will be as good as what I ate."], ["Beth P.", "We went here for an anniversary dinner, and I guess we had higher expectations than we should have. The food ranged from pretty good (scallop appetizer) to pretty gross ( blackened triggerfish ). The \"specialty cocktail\" was also yucky. Too many artificial flavors came out. The wine list was on a ridiculously heavy metal slab (nitpicky, I know, but it' very difficult to peruse a wine list if you're having to curl it), and they didn't have anywhere near as many whites as reds. Guess what we wanted with our seafood dishes? A nice white. There were several sparkling white wines, which I guess they figured made up for it, but the only folks I know that go out and order sparkling are 21 year old girls.  The upper dining area is very \"sports bar\" feeling (could have something to do with all the TVs peeking over from the bar area), was very loud, and and we weren't very comfortable. We had a reservation, and really they probably gave us the worst table in the whole joint. We asked to move to the lower dining area, which they did, but put us right next to the service entrance, so that was no good either.Because we'd already complained about our seat, we felt uncomfortable complaining about the food. We'll just never go back again. Bad food, bad atmosphere, bad service...and I would say more like $$$ in terms of price. Totally not worth it."], ["Adam T.", "Delicious and innovative! This is our new regular spot. Try the prix fix menu Monday through Thursday. The steak and the scallops were both expertly prepared and delicious!"], ["Lori R.", "I've been to Margaux's a few times over the years.  (usually when someone else was paying).  In many respects, Margaux's was ahead of its time for Raleigh.  Am happy to report after a recent Monday night dinner, that Margaux's has also stood the test of time, well.   Our anniversary fell on a Monday night this year.  Seeing as we're the kind of folks to plan our wedding around days in Vegas where The Venetian had lower rates...then Margaux's on a Monday night was a perfect plan, because on Mondays they have their Prix Fixe 3-course menu for just $19.95 \"per personality\" all night.  (instead of an Early Bird special other nights of the week).  We had a wonderful meal...Our Server was excellent. She steered me to the right chardonnay for me (and it was the least expensive one)...bread and butter were very nice.     My first course was a crabcake with a mango salsa.  It was good.  Husband enjoyed his tangy artichoke dip with corn chips.  My entree was a scallop dish with rice and a cold shredded veggie salad.  I enjoyed it.  Husband had a great-looking steak with mashed taters and a rich sauce. He was especially pleased with the quality of the beef and how well it was cooked.  He declared it to be one of the best steaks he's had here in NC.  (he's a mid-west guy, so he's had some good beef)   As for dessert, we both changed our minds after hearing descriptions from our Server.  I went with the Tiramisu, which was light and very very sweet.  Husband did the Chocolate Pecan Tart, which was rich and good.    I would say Monday is a great day to check out Margaux's!"], ["Kathleen W.", "It's a good thing I don't live in North Carolina or I'd be here every week ... Wow.  Fred and I ordered a bunch of appetizers / starters and shared an entree ... they were kind enough to split our entree for us.  Even as a split entree, it was HUGE ... and amazing.to start:Roasted Prosciutto Wrapped Scallops over herbed pesto orzo pasta - the scallops were cooked perfectly.  There were only 2 scallops though ... I could have eaten half a dozen easily.  I actually didn't care much for the pesto orzo pasta that came with it ... it seemed to be a let down after the scallops. Margaux's Steakhouse Salad - this is a lot like the salad they serve at House of Prime Rib ... only better cause it has shrimp and bacon in it ... but any salad with bacon and shrimp is awesome.  Soup of the day was a clam chowder - this was probably the weakest of everything we ate that night.  The soup was tasty - but almost too watery for such a rich soup.  Generous portions of clams, but I like my chowders to be more viscous.For our entree:Triggerfish with veggies on a bed of mashed potatoes - Wow.  This was amazing!  the fish was super fresh, it came with a lot of sauce (i LOVE sauce) all on a bed of veggies over mashed potatoes.  Everything was seasoned and cooked just how I like it.  Service was excellent and if I didn't have to go back to about 2 more hours of work, I would have loved to check out the dessert menu - I'm sure it would not have disappointed me.  This will give me an excuse to go back next time I'm in town!"], ["Donna G.", "This is the best restaurant I've been to in Raleigh by far. I had a yellow fin tuna dish and my daughter has a rib dish, they were both outstanding. I wasn't sure  what wine to pair with it and when I asked for a suggestion, Steven knew just the one. The service was fantastic, the dessert incredible. I will definitely go back!!Donna"], ["Monalisa M.", "Tasty food, always packed, local-owned, and great selection. Tasty!- Mixed Grill of the Sea: Half of a 1.5# Maine Lobster, Grilled Tuna, Bacon Wrapped Scallop, Lemon Shrimp, Crabcake, Whipped Spuds & Farmer's Market Vegetable Medley- Panko Fried Tilapia with fries & remoulade- Apple Bread Pudding"], ["Val P.", "I so wanted my first and only visit to Margaux's to be worth 5 stars!!First, E & I had reservations but wasn't seated promptly. Not too much of a big deal. Had time to talk with E and take in the scene which I would describe as energetic  crowded and noisy. Seems like a great place to meet friends for drinks after work. TGIF anyone?!?!Second, the meal. EXCELLENT! I had the crab cake appetizer with slaw. Anyone who knows me well knows I have an aversion to cole slaw. I don't want to see it, smell it, say it or even have to imagine it. However, the dish was really good. Not a Maryland crab cake but it was a nice starter. My entree was the salmon with spinach and mashed potatoes. The entire entree was scrumptious. Perfect portions also.  At first I didn't pay attention to the bread basket but don't overlook the cornbread! It was the best cornbread I have had whilst in NC. Lastly, I had the banana pound cake for dessert. It was moist, not overly sweet and pretty good as well.Third, the bathroom. YUCK!!! No hot water! I let the water run for 5 minutes and it was ice cold. Then the hostess was in there picking at her acne and she didn't wash her hands until I stared her down. Just gross.  *did you know menus carry the most germs in restaturants...even more than the bathroom door knobs?* Lastly, our waiter Val...(yes he has my name..how odd...I know).  I hate to say it but  VAL WAS AWFUL!  At first I thought that he was just laid back but that \"laid back-ness\" turned into just plain unfriendliness.  For instance, when we were reviewing our menus we really couldn't decide.  We mentioned to Val we had trouble deciding. Not only did he neglect to tell us what the specials were for the night, but he clearly didn't want to make any recommendations or provide any assistance.  His only reply was, \"I will come back when I think you are ready\" and proceeded to leave us for 20 minutes!!!   It wouldn't take a 4 year old 20 minutes to read a menu.  And that is how the night started....Unfortunately, by the end of the night I could describe him as abrasive and snappy. The weird thing is I was able to ignore him most of the meal because I was having such a great food experience coupled with the conversation from E (who's always so enthralling). However, by dessert E was completely annoyed and distracted by Val's demeanor and attitude. When E asked Val if the dessert he chose had much dark chocolate because of his allergies, Val proceeded to tell E he wasn't sure because the dessert chef left for the night.  So E said \"Ok\" but proceed to clarify his statement by telling Val he could have white chocolate just not milk or dark chocolate - as if maybe giving him this information would actually humanize E to Val.  No such luck.  Val said \"Just don't get it then.\" grabbed the menus and scurried off.  It's funny because E has held several office parties at Margaux's and has had several business meeting there with clients and said he never received service that horrible there.  It was my first time at Margaux's and I would be hard pressed to ever return.Overall, I have to give Margaux's 2 stars based upon the overall experience."], ["Jim F.", "The food was very good, but the service was not.  When I spend $300 for 5 people I expect both great food and service.  The waitress had an attitude and level of service comparable to a poor waitress at a low-end diner.  For starters, she reached across my daughter's plate to slide my wife's water glass to her.  She spilled my son's drink in his lap and her response was not to apologize, but to say, \"They fill them so full and expect us to carry them... at least you get a good poor\".  Our seating was 7:15 and our food arrived to the table at 9:00.  The waitress was not to be seen through most of that time and when my wife asked the waitress what took so long, her response was that there were other large parties ahead of us.  Her response was curt and she did not apologize, nor did the manager come by to apologize.  It was my wife's birthday and when considering desert, my wife asked if they did anything special for birthdays.  The waitress said, \"we can put a candle in it\", again with an attitude.  The clincher for me was when I received the bill and found that a 20% gratuity was added and for a party of 5.  I typically tip greater than 20% for good service, but was only going to tip 15% because of the the poor service.  I was not pleased, so when the waitress came I said, \"Seriously?  20% automatically for 5 people\".  Her response was, \"Seriously!\".  I won't mention her by name, but I did notice that another person called her out by name in another post stating that she was working the bar and that the staff was arrogant and extremely impressed with themselves."], ["Adam H.", "If you want monster portions for monster prices, then this is your place. If you want creativity, nuance, and food that actually tastes like someone cares, go elsewhere.  We had the mixed grill of the sea, escargot, and calamari.  All bland, leaden fare that you might expect on a cruise ship in the mid-1980s. Raleigh's culinary profile has come a long way in the last few years thanks to Ashley C's restaurants and the like. But this place, on the other hand, feels like a time warp without a soul."], ["Kristjan K.", "Great food. Oysters, calimari to start. Grouper, tenderloin and angel-hair pasta perfectly done. Server was fun but wasn't sure of rums. Bartender was great. I recommend!!"], ["Critic X.", "I have been to Margaux's before and enjoyed it. I will point out just a few items that might make me less inclined to go there more regularly.1. The $49.95 prix fixe dinner, although three course, was a bit on the pricey side. Nicely presented, excellent selection but still somewhat high. Correct price point should have been closer to $35-40. Probably taking advantage of Valentine's Day.2. Despite reservations, we still had to wait about 30-45 minutes. That is stretching it a bit and indicates overbooking. That generally means maximizing revenue at the cost of diner's time which is not respected.3. Hygiene rating for a restaurant of this caliber was very low, in the low 90's.4. I suspect number 3 could be related to the fact that silverware is placed directly on tables which many past diners would have been collectively using. Has anyone ever heard of tablecloths or is it just an easy way to be cheap? Whether surfaces are regularly and properly wiped down is irrelevant as most people don't stick around to watch. It is about perception.The biggest problem with 'fine dining' today, is that restaurateurs base it strictly on price which diners and reviewers then too often blindly follow."], ["Jill D.", "First time - Just showed up on a busy night and sat at the bar for dinner, it was noisy but that what happens when a place is packed. The wait was long...but again very busy. I did not like my meal - but it was a bad choice maybe on my part. Well manager overheard me telling my husband I didn't care for it.....and he proceeded to go above and beyond to make it right! Very impressive.Second time- gave it another chance since the care taken to improve our 1st time...LOVED IT! Food and service was top notch.Third time - Long story, but ended up with a party of 8 during the holiday season with no where to accommodate us. Margaux's went out of their way to accommodate us and provide a fabulous meal! I would not recommend this a place to take children, however we had 6 adults and a 7 year old with us and they even made him special chicken nuggets and fries (not on the menu). Great time.Forth time- Brought a girlfriend from out of town and we were in food-wine heaven!Husband bummed he didn't get to go.Love this neighborhood atmosphere and will continue to go back. If you get a rude waiter like someone commented management, they will make it right (and I've only had top notch service there)  Oh....save room for the Creme Brulee.....did I say heaven?"], ["Jon K.", "We have been to this place several times and it has always been good. However we went on Jan 25 and was not really satified . I got the mix of sea which was good however the tuna had a very fishy taste more so than I have really ever tasted and I have tuna in general many times at my house and other restaurants. As for my wife she got one of the filets the one that comes with the potato Anna. She was eating it and I asked how it was and she said it had weird taste . I tasted it a small bite and it had a very strange taste I would describe as a pasty blah taste just kind of weird never had meat that had that taste. In addition she continued to eat thinking it was the way it was. However she got sick and throwing up all night so very strange."], ["Mark M.", "Please I'm begging you.  Take your money and spend it over at Saint-Jacques, a *real* French restaurant.  This place should be ashamed to call itself French.  Margaux's is an overpriced bar and grill, which should be obvious by the TV's on the main level.I had the fixed price menu on a Saturday.  I did enjoy the glass of California sparkling wine.  The crab cake with potato salad was OK.  Then I had a very tough sirloin steak that I was having trouble cutting with my steak knife.  Desert for me was a very small portion of pumpkin cheesecake which was underwhelming to say the least.  My partner had the creme brulee which was 100x better.I walked away with a bill close to $100 for two people and two glasses of wine.  I can't believe I paid so much for mediocre food.I had heard about this place so many times from a friend.  I expected good food and good service.  Service was OK but food was disappointing."], ["Marsha P.", "I LOVE this place. I love the atmosphere. The owner is A number one. He is involved and cares about his restaurant. The food is wonderful. I would highly recommend it. The prices are up there but worth it."]], "Mami Nora's": [], "Tasca Brava": [], "Vinos Finos Tapas and Wine Bar": [["Lacey K.", "Great food (tapas), great atmosphere, excellent wine!  I would definitely go back here!"], ["Gabrielle B.", "Best wine bar around. Tapas are phenomenal as well. You really just can't go wrong here. The potatoes and peppers are something I crave regularly. And the sangria is the best I've had anywhere. Great place to come with friends and family for a great atmosphere and a killer menu."], ["Holly L.", "Love this place! Excellent wine selection and a great atmosphere. This is a nice place for a date- small, intimate, and quiet. I've had a great experience each time I've been"], ["Giana N.", "This is one of my favorite spots in North Raleigh.   First, I really enjoy the atmosphere, which is cozy and friendly, never pretentious.  The service is always great, the owners and the staff are knowledgable, and the food is just fantastic. While there this past weekend, we enjoyed a really nice bottle of Valpolicella Ripasso wine -- wonderful from the minute it was opened -- and several small plates and a Salmon dish. We also had the tiramisu, and if you are a fan, it is a must have and worth every calorie.  I highly recommend Vinos Finos for a fun evening with friends or a relaxing date night."], ["Nathan M.", "Excellent food very fresh.  I had the pan-roasted chicken breast.  I am definitely going back!!!!"], ["James E.", "After reading the glowing reviews, stopped in on a Saturday night. The tapas and wine we had were fine. The bartender was also the server for the dining room, and did a good job of handling all. But the place was remarkably dead for a weekend-the restaurant biz is tough..."], ["Laurie C.", "Excellent service! Sat outside! Felt like I was in France. We ordered the deviled eggs, herb marinated grilled shrimp and crostini with Spanish goat cheese, arugula, roasted tomatoes and prosciutto. All excellent. If you like sauvignon blanc, get the Errazuriz. Fantastic!"], ["Trina L.", "We went there last night for dinner.....holy wow!  Everything was absolutely delicious!!! We started with the goat cheese & prosciutto crostini.  The bead was perfection, crust on the outside, light & chewy on the inside and the flavor was incredible.  We then split the charred Caesar salad....TO DIE FOR!!! then, lastly we had the skirt steak with chimichurri sauce and that my friends....is what I call... The bell of the ball!  I can't wait to go back very soon!!!  P.S.  Did I mention the amazing wine??? This place is a must!"], ["Pam M.", "Classy and intimate atmosphere.  They serve food and a great assortment of fine wines.  Our tapas were delicious, but quite small and expensive."], ["Irene R.", "Expected your typical, overpriced suburban wine place.  Instead, got VERY personalized service, a beautiful, calm ambiance, and the best menu in town.  Go here for lunch or dinner..you won't be disappointed, and you'll have great wine pairings to boot!"], ["Angelique A.", "We attended their 3 course Valentine's Day dinner and truly enjoyed it. The atmosphere was romantic and the halibut the best I'd ever eaten. Wish there was a Cary branch but we will be back when around the North Raleigh area."], ["Jennifer W.", "My husband and I wanted a quaint wine bar that reminded us of our European travels -- a place with tailored service, excellent small plates and more importantly beautiful wines. We found that and more here. The owner himself gave us impeccable service, the wine was exquisite and his wife, the chef, made us a memorable cheese and meat plate, skirt steak and grilled shrimp appetizer ... All to die for!!! We learned stories about the wine offerings and winery owners and operators -- it was truly an experience. The environment is perfect for couples and friends --Comfortable and enough upscale that you feel like getting a little dressed up, but not so swanky that you don't feel at home. I would recommend this wine bar to all of my friends and family and I will be back -- next time for dinner --Can't wait to try the pork Milanese! Yum!"], ["Madison N.", "Great selection of wine. Would recommend the variety of wine flights. Empanadas were tasty along with the prosciutto, arugula, roasted tomato crostinis. Wonderful place for a date night or girls night, especially on the outdoor patio on a cool summer evening."], ["Emily G.", "I had an amazing dinner here last night with some lady friends.  I arrived earlier than the rest of the group and was greeted immediately.  The bar tender was very friendly, and chatted with me some, then suggested a great glass of wine.After the group arrived, the service was attentive, but not hovering.The food was great (small servings, good for sharing).  Try the empanadas.This is a small restaurant, and I think that was one of the reasons that I liked it so much.  Their wines by the glass menu had some of the best descriptions on it.  I was able to pick and choose what I wanted, just based on the write up of each wine.I will definitely be back."], ["Christina G.", "LaFayette Village is growing  up -- and so is Vino Finos! Since my last visit, I was pleased to see they've expanded their food menu to offer more than just cheese and charcuterie; there's a diverse list of tapas available -- and a check-in offer for a $1 off! Sweet! Many of the scattered tables were taken, so we grabbed seats at the bar. We were immediately greeted by an awesome bartender, who helped make great recommendations, and was uber-friendly, chatting us up. Set the tone for our visit, along with dim lighting, and warm-toned yellow walls. Vinos Finos also has some courtyard seating.Enjoy the wine list, offering 3-oz or 6-oz pours. And a nice focus on Argentinian wines."], ["Will W.", "Enjoying the cheese plate, shrimp ceviche and great wine with my # 1 lady....Music is fun, food is great and wine is just what the doctor ordered. This place is a perfect date night!\""], ["Dave J.", "Very nice atmosphere, knowledgable staff, wonderful tapas and interesting selection of wine and wine \"flights.\" Find a wine you like and buy a bottle at retail price to take home. The place is fairly small and intimate with cozy lounge-like, tables and outside seating along the Lafayette Village common area."], ["Melba T.", "Stopped in at around 12:15 for a quick lunch/brunch on the way to a 1:00 appointment and was hoping for something \"ok\" but very happily surprised at a gourmet lunch for $15 and in under 30 minutes. I had the arugula salad with shrimp and goat cheese, hubby had the classic brunch (eggs, hash browns, sausage, bacon, toast) except NOTHING about the food was \"ordinary\". So fresh, so good !! The chef took such care that we vowed to return again even though we live on the opposite side of Wake County. I can't imagine that anything chef makes would be bad - was quite incredible. Stop by sometime - it's close to Ravenscroft off of Falls of the Neuse. Don't let the name fool you - they have a lot more than wine. Heck - in my opinion, forget the wine and just go for the food."], ["Mark B.", "Great wine selection. Food is good. Atmosphere is classy.I think my favorite part is the family that owns it- it is clear that they take so much pride in everything they do. I love supporting that.Also, did I mention the great wine selection?"], ["Erik B.", "Family owned - and what a wonderful family they are! If the personal attention and excellent service aren't enough to win you over, the wine selection, great tapas menu, and atmosphere certainly will!"]], "Poole's Downtown Diner": [], "Irregardless Cafe & Catering": [["Kait G.", "My new favorite! Everything was fresh, the corn in my tofu salad had just been cut off the cob, carrots crunchy, tofu warm. The menu had so many vegan options I had a hard time picking what I wanted. Finally I chose the Vegan Shepard's Pie, it was stuffed with veggies and a great turn on a classic dish. The asparagus on the side was crunchy and perfectly cooked so it wasn't soggy. The best was dessert, my vegan coco \"cheese\" cake. It was made with tofu and cashew cream. The tofu made me a little nervous, I'd never thought about it being in a dessert like this. It was so spectacular, it didn't last long on that plate! I would 100% recommend this for vegans/vegetarians. Great date spot for taking out a vegan for dinner!"], ["Mary-Kate I.", "I went to Irregardless on a double brunch date yesterday and could not justify the price for the product. The presentation was lovely but the home fries were over cooked, beyond crispy, just more fried exterior than actual potato and I didn't care to finish them. The crab cakes Benedict was delicious but THIN, both my boyfriend and I ordered this and were both left hungry when done. This is one of my favorite meals in general and almost always pay less and have more food. It ended up being over $16 after tax (entree alone) AND our waitress messed everyone's checks up at the end... The only reason I gave two stars was based on the taste alone but the overall experience was definitely one star. On a positive note, there was live music which was nice."], ["Kevin S.", "I went to IC this past weekend to celebrate my girlfriend's birthday. I've heard wonderful things about the place, and we tried it out.  When we first arrived at the café, we almost left. It's quite crowded; the tables were very closely placed next to each other. There was a table of four behind us that was so loud and rude we almost left. Also, I find live music to be irritating, so I wasn't thrilled when there were musicians playing.  (The musicians were good; playing mostly jazz standards).  Service is absolutely excellent. I don't care for restaurants where the servers hover over you and are \"in-your-face\". I also don't care for restaurants where they give you little glasses of water and then never show up when you are thirsty. (Can I have a pitcher?  Cause I'd rather pour it myself\".  Irregardless' service is perfect: the service is fast enough that you are always taken care of, but your privacy never feels violated.  I usually prefer take-out to eliminate servers.  Irregardless was perfect here.The two dishes we had were Shrimp and Grits, which was flawless, and the Seafood Linguini, which was excellent and had lots of well-crafted seafood.  All the seafood was of high quality, nothing was overcooked, too salty, etc.  We also enjoyed some crab dip (EXTREMELY tasty) and a flourless chocolate cake, which was quite good.  Overall, the service was excellent, the food was extremely good, the prices, eh ($15 cork fee????), but I have to give a few demerits for the loud atmosphere, which includes the congestion and the live music.  Give this place a try.  On payday."], ["Randy G.", "We were here from out of town, fortunately we made reservations several weeks ago knowing we would want Thanksgiving dinner. Absolutely the best Thanksgiving dinner I have eaten out. The service was speedy and courteous. My only issue was that we felt rushed due to the volume of business they were doing. The pumpkin pie was great as well. Should I ever be back in Raleigh I definitely will return."], ["Pritesh P.", "This place is awesome!  We decided to go to Irregardless for a Sunday Brunch. The house breakfast breads were great, the kids loved these.  For my main course, I ordered the Banana Walnut Pancakes...and it's a winner!  The fluffy pancakes were topped with sliced bananas, walnuts, and coconut.  Very delicious but I couldn't finish everything on my plate.  That said, the portions are plentiful.  Another friend ordered the Huevos Rancheros, which was also just as flavorful if you enjoy spicier dishes.With some live jazz music playing, mimosas on the table, excellent food, and great friends at the table.  This was a lot of fun!"], ["Harmony M.", "I got grilled salmon and it was like a dry-@#$ hockey puck. I forgot to ask them not to cook it too long as I usually do with seafood I'm ordering from new restaurants before I know what to expect. It was sorely needed in this case. They truly murdered it.The accompanying salad was pretty good, but needed more dressing. Service was acceptable at best. The jasmine rice was DELICIOUS, however: just the right texture and cooked perfectly. But not going back just to experience \"delicious rice.\""], ["Laurie V.", "I went here for the first time on Easter.  I had the chile relleno and it was a flavorful and delicious dish. I enjoyed it immensely. But then I had the frozen lemon custard/blueberry dessert, which left a lot to be desired.  It was way too sweet.  I'm not crazy about the ambiance. It doesn't feel really warm, nor cozy.  Maybe I would have felt better if we had been sitting at a booth, but I felt like our table was smack dab in the middle of everything and as it got more crowded, it got very loud.  It wasn't relaxing, nor comfortable, nor ambient.  The service was great- our server was friendly and sweet.  I felt kinda bad for our server, because the person I was there with wanted to stay and linger.  I had come in from working a red-eye that morning, and I really wanted to just go home and sleep.  I'm sure she wanted to turn that table, so  I finally had to be a little more aggressive and just tell the person I was there with that I was ready to leave.  I'm not sure this would be at the top of my list for a return visit, but if I were to go just based on the entree alone, I would say it deserves five stars.  Everything else brought it down a couple notches."], ["Emily G.", "Don't forget to check this place out if you live in the area, or are here visiting. Irregardless has live music all the time! The food is delicious, vegetarian friendly, but a little pricey. However if you come on your birthday or anniversary they will give you a complimentary bottle of wine, which is awesome. Definitely stop by, you won't be disappointed."], ["Shannon G.", "Spanakopita was great, and the chocolate cake was to die for! Waiter was very nice, love music, margaritas were great! Can't wait to go back!"], ["Melissa C.", "I really wanted to like Irregardless Cafe. My friend gave the food glowing reviews, so we chose to go here for a lunch date. I realize that the restaurant has been open a long time, but I didn't expect to be hit in the face with the smell of mildew upon entering. That turned me off a bit, but the place was really busy. Maybe the people who frequent here don't notice the smell? I already had in mind what I wanted to order after looking at the online menu. I chose the Open Face Sandwich. All of the ingredients sounded so good together...avocado, mushrooms, onions, tomato, egg omelet, cheese...all on handmade whole wheat bread. Unfortunately, the sandwich wasn't that good. It was a good size, and the ingredients seemed fresh,  but everything was really bland. I could only finish half of it, and honestly if I was still hungry I probably wouldn't have eaten it anyway. My friend and others around me seemed to be enjoying their food. Since it is a Raleigh institution, I will probably give it another try; but I will order something different."], ["Jamie W.", "Never ate there for a regular meal, but don't use them for catering a large event. They try to make you rent the platters, and dishes to serve the food choices in, think that's why you hire catering so they take care of that.  Was not impressed with the food, came out to bride and groom cold. Guests are not going to tell you food was bad at your own wedding, but they would be sure to mention how good it was, I don't recall one person saying the food was good. Also we were supposed to get lunch the day of wedding, had to call them at 1 because it wasn't there yet, and we were supposed to get a meal to go and at the end of the night, yup never got that. Disappointed big time"], ["Patti M.", "Perfect date night! Sat outside, and the weather was lovely. Ordered the vegan sex, which was amazingly, surprisingly good! The duck la orange and the ribeye were top-notch. I always love going to Irregardless. Don't forget to redeem your free bottle of wine for your anniversary or birthday!"], ["Lori R.", "It's interesting to me that the slogan here is \"Not a Trend.  An institution\".  Because I would define Irregardless as both.  They were so much a trend before trends were trends.  Especially where vegetarian/vegan is concerned.  It's hard to conceive when you look at Raleigh today, but some of us remember a time when the only pasta you could buy in town was spaghetti...and vegetarian (let alone vegan) was not only abnormal, but hippy-central.  And Irregardless was not afraid of that.  They led the pack.  Tahini?  Red tea?  Bean Sprouts?  Things like that were way beyond Raleigh-times when Irregardless served them up.    Today, this old building has been comfortably updated (note that at one point this building suffered a serious fire that closed it down for awhile...owners were kind enough to make sure their employees got paid even when they weren't working)  Personally, I've always felt extra fond of them for having that kind of integrity.  The other thing Irregardless has always been known for is an everyday changing menu depending on what was fresh at the Farmer's Market.  (again, way before their time where local and fresh is concerned).  Which meant the menu changed daily.  Now there are daily specials, but the fixed menu is full of wonderfully refined dishes.  We thoroughly enjoyed every one that we shared on a recent Friday night.  Three of us shared the Vidalia Onion Pizza appetizer (YUM!)...Sorry that the pic posted doesn't do this justice.  All of us LOVED it.  We also shared the Shepherd's Pie, Chile Relleno and the Cauliflower Trio.  All Vegetarian.  All so original and very very good.  Probably the biggest hit for all three of us was the relleno...bursting with flavor!   For dessert we shared Bourbon Pecan Pie and Grand Marnier Creme Brulee.  The only mild disappointment was a lack of Grand Marier flavor.  We couldn't detect any.  Tasted like a vanilla one to us. Certainly good, yet lacking in orange flavor.  The pie was amazing.   With reasonable prices and excellent service, I can highly recommend a meal here!  Oh, and ours came complete with live music...an extra perk!"], ["Bj G.", "Just want to say my birthday dinner tonight was as good as it gets!! Thank you Dillion for such Great service. You are the best. Thanks for  recommending a great wine  as well. We will be back. Bj PEACE!!!"], ["Dan M.", "I've wanted to come to eat here for many years as this is a venerable institution for 30+ years.We came for breakfast/ brunch and it was fantastic. The Florentine omelet with ricotta, parm, spinach, tomatoes, etc... was excellent. A few dabs of hot sauce were the perfect compliment to creamy ricotta; a wonderful counterpoint. Others enjoyed the crab cakes eggs benedict which provided a luxurious sauce (see egg yolks) over the top of perfectly seared crab cakes. Served with complimentary coffee, OJ and excellent service. A stellar spot to enjoy a Sunday morning."], ["Patty S.", "This was a really cool place, the band was a nice smooth jazz band. The beer was good, the food was good and plentiful. And it was well priced. Definitely recommend it for a chill night out with friends or partner, i went with my husband and we had a really good time. Good service and nice atmosphere."], ["Greg O.", "This place was just as tasty as I hear everyone speak about.  The atmosphere was what I expected, cozy but kinda hippyish.  I got a veg dish which was very fresh and flavorful.  Every plate I saw that came put looked great.  The menu isn't big, but that's kind of good in a way, making it easier to choose your meal."], ["Nisarg T.", "I love this place. Be it there crab cakes or their omelettes, one thing is definite that it will have a mouth-watering taste. The special open face sandwich is a delight and the Quinoa salad is amazing. Don't miss out on the Salmon with some fresh asparagus! This place has many options for the vegetarian folks as well as meat lovers."], ["Jim N.", "First visit was tonight with friends for dinner & the food was awesome, choices & flavor. We had chicken, salmon, fish cakes, seafood bisque, pizza & dessert. Outstanding food in every respect! A bit loud, but the place was busy. & the band was playing. Very nice evening & prices were very reasonable for quantity & flavor."], ["Ceyhun O.", "This restaurant is a nice part of downtown Raleigh. If you are looking for a healthy yet filling restaurant and don't mind to pay a bit more this is a good option for you .It does have live music and a bar as well . Make sure you have a reservation on the weekends! Enjoy"], ["Chinmay K.", "Good restaurant for Brunch and Lunch. Lunch portions can be small for few. Especially the entrée as no side is served with them (you get one side if you order a sandwich). Pretty good service. Pro Tip: Their parking lot is in from of the restaurant on W.Morgan St. Also couple of parking options on the adjacent Tryon Hill. Also call ahead and reserve a table as the place is crowded all the time."], ["Youness A.", "I love irregardless not only for its really good food, but mostly for the great atmosphere and awesome live music."], ["Joy K.", "I was here Nov 1st with friends. We made a reservation which I recommend cuz they were busy. The band was setting up which was exciting since I love live music. Patrick our server was attentive & had a great sense of humor, important with my group of friends. We started with the meditterean appetizer, it was really good. The pita was fresh & hot...my buddies said the calamari was amazing and they'd order it again.Sadly our dinners weren't as successful. I had the stuffed acorn squash. The bean & pineapple was cold and odd. My friend had the fish cakes which he said was really bad, mealy tasting and odd. Fortunately my other buddy had salmon which he really enjoyed. 1 out of 3, eh...I was really hoping to give them a 4-5 star rating because I love the work they do. Sadly the food was not good enough to warrant a higher rating. That being said, the atmosphere was great, service was above average & they're doing great work in the world at large. Worth another try for sure..."], ["A A.", "I really like Irregardless' farm to table concept. I had the fish cake sandwich which was delicious. The bun, however, would have been physically impossible to eat it was so big so I had it open faced. I had a bite of my friend's open faced egg sandwich and that was delicious! I've never steered wrong at Irregardless, other than the frittata which was my fault. I don't like my food to be swimming in cheese. I really enjoy their brunch!"], ["Stephanie K.", "It took me a long time to eat at Irregardless because I find their 'we're not just for vegetarians anymore' advertising off putting. I wish I'd continued to delay the experience. First off our server was terrific. When we said we were vegan she said she'd get a vegan employee to confirm what we could eat. We hoped to enjoy the tempura seitan, but for some reason they feel they have to use eggs. She offered instead the in battered seitan as an app. What we received was not seitan (which is made with gluten), but rather what I am sure is a Delight Soy chick'n patty. When a supposedly veg friendly restaurant doesn't know the difference between soy and gluten there just isn't much else to say."], ["Beth M.", "Brunch is fabulous here!  I absolutely loved the meal and the waitstaff was super friendly and helpful.  They had music on the Sunday when I was there, but it was very quietly being played and very enjoyable."], ["Samantha B.", "Not sure where to even start.  The mediocre food or the terrible service...service it is.Went for Sunday brunch yesterday in hopes of finding a new weekend brunch destination.  What a waste of money.  Took about 7 minutes for anyone to even approach our table and when the server did, he just dropped off waters and orange juice.  No introduction, name or even a simple \"how are you guys doing?\"  Immediately walked away and returned about 5 minutes later to take our order.  Yet again, no formal introduction, nor any introduction, or pretend interest in us at all.  He walked up and asked if we were ready to order (sorry for inconveniencing you???!!)Ordered our food, which arrived promptly.  What a disappointment, WOW.  For a $16 omelet, I was anticipating a decent serving, and well made...quite the opposite I received.  I ordered the Chophouse omelet, there was the most minuscule amount of meat in it, and my home fries side literally consisted of maybe 15 potato bites, and they were burned to a crisp.My friends ordered the Wrack Em Scramble and the Steak and Eggs, both of which also consisted of BURNT home fries.  The Wrack Em scramble included \"turkey bacon\" aka over cooked, literally fried slices of turkey. I've never tasted anything more ratchet.  So well done it crumbled dryly in our mouths, and tasted as if \"smoked\" seasoning had been poured on it.The Steak and Eggs, another $16 brunch platter, starred an expected portion of bland, poorly (if any at all seasoned) steak, which was ordered medium and was delivered well.  Not any hint of pink in the center...or anywhere...and again, another round of burnt home fries.Upon the 3 of is properly stacking plates for bussing (I am a server as well), he finally delivered the check.  And he FINALLY acknowledged us, asking if we needed anything else...no.  Except to leave.  He returned our change, belatedly, as we would expect based on our experience, and he did not even mention even a \"thank you\" or a \"have a good day,\" he walked away again immediately.All in all, we will never go back.  Over priced food in regards of quality, portion, and adequacy; and even more so...HORRIBLE service.  Upon receiving our bill, we FINALLY learned our server's name was Wes...thank you, Wes, for a miserable experience.  Since it was a hassle for you to wait on us, I will make it my un-hassling prerogative to let everyone know how terrible Irregardless has become recently. Save your money.  You can receive the same poor service elsewhere, for half the price."], ["Kuanyu C.", "I was just here last week because my friend's band was playing a gig, and being good friends, we gathered a crowd for moral support.First time I came was 2010 Triangle Restaurant Week, and I walked away truly in awe of the creativity and chefmanship. I enjoyed a set of three course vegan & vegetarian menu that I would otherwise overlooked on any menu:The appetizer started with something called *VEGAN SEX* which was a stacked \"salad\" layering sliced avocado, oranges, tabour and shallot/lime dressing. The bruschetta was OVERLOADED with roma tomatoes and roasted peppers and local sourced mozzarella and artichoke heart. Warm goat cheese (seared) salad with nice creamy herb dressing on a bed of local greens, and the taste was explosive.The main menu started with Portabella Polenta, with sautéed spinach and parsley pesto. I had a mixed grill with seared jumbo scallop and crab cake, and beef sirloin, with mash and vegetable du jour. Third dish was what I called a Chile Relleno, remixed, because it's stuffed with wild rice and ratatouille, drizzled with a nice sweet pepper balsamic reduction.The meal came to an exciting conclusion with a selection of raspberry key lie pie, giant layered slice of Tiramisu, and a nice chocolate pecan pie (coconut added.)The proprietor was really nice and easily-approached dude; after my friend's gig we were just sitting down with him, chatting and watching him finishing up his dinner.Another thing, be sure you make your reservation, because you will be in for a long wait otherwise.(P.S. Yes I know, this review is two years overdue; better late than never right?)"], ["Preston A.", "Excellent food and service! Very nice staff with people dedicated only to refilling your drinks! Right when you sit down you are greeted with a cold glass of orange juice, water, and coffee tea or milk a well as some home made breads. Live music is almost always being played with christmas music being played on guitar today. Great environment an quick service. And to top it all off the food was great! Get your check with a packet of flower seeds to take home an plant in your garden! BRAVO"], ["Yelp H.", "Went for dinner on Christmas day. Could not have been a better experience. It was packed, and now I know why. They had a special menu, with a little something for everyone. Every single thing - the bread, the appetizer, the entrees - was absolutely delicious. Service was excellent. The bartender even accommodated our request for a couple of sangrias, which was appreciated because they were so busy. We absolutely can't wait to go back!Do it...go!"], ["Naomi K.", "This place has been on my list for a long time, I just never got around to it. I finally found myself downtown in search of some food and looked it up. I like the large open space, the live jazz music and the friendly atmosphere. I tried the specials, watermelon gazpacho and the blackened shrimp and apple salad. It was both filling and delicious. The gazpacho had a good refreshing flavor to it. The shrimp was just the right amount of spicy and was packed with flavor. The salad was a good combination of goat cheese, crunchy walnuts and an orange vinaigrette. All the dishes were plated nicely with a good presentation. The cafe ran fairly smoothly for being so busy and popular. The space was the right amount for live music and the crowds they brought in even with the rain. It's lively, loud and interesting.The bar is pretty well stocked too, with a good variety of choices. I tried the basil grapefruit which was far more basil-like (liquid pesto?) and not so much tangy grapefruit but the drink was still mixed well and wasn't a skimpy mixed drink. They keep their pours decent, my friend ordered a gin and tonic and wasn't denied a good pour. Definitely will keep this place on the list."], ["Dhruv J.", "This is easily one of my favorite spots in Raleigh. Complete with great local music, awesome servers, and shrimp and grits that will make you rethink everything, I highly recommend it for a nice dinner in Raleigh, with some live dancing later on!"], ["Winston W.", "We had vegetarian pesto pizza, grilled salmon, Morgan Street chicken, Falafel wrap and Crème brûlée, they were all delicious! Ingredients were fresh and we could really taste the difference! Went during lunch hours and it was packed. Would go again for their evening music performances."], ["Hilary O.", "I love this hidden treasure off the beaten path in downtown Raleigh, NC.  They have a plethora of menu options - something for everybody. Specialize in Vegan, Vegetarian and Gluten Free items, but there are also delicious \"regular\" dishes as well. The Mahi and Paella are to-die-for. Very fresh and fair portion sizes. They often have live music most nights (jazzy bluesy so you can still hold a conversation). Great place for a date night out or just a night out with friends."], ["Kelsey C.", "Irregardless Cafe isn't a real word. And since the name of this place isn't even a word, it only makes sense that the words they use to name and describe the dishes aren't quite accurate either. When you serve something called the Cauliflower Trio, you're supposed to serve three kinds of cauliflower. But if there was any caramelized cauliflower it was indistinguishable from the roasted. And ummm...is there supposed to be a flavor in here?The eggplant on top was a delicious, however random.I would love to know who coined the term Lamb Lollipops. They're just lamb chops. And forgettable ones at that. You're also not supposed to lick them. It's only cute if it makes sense.Open-Faced Duck Ravioli? Seriously? The whole point of ravioli is that it's all eaten together.  The seared duck breast was delectable, but the \"ravioli pasta\" is just sheets of slightly overcooked pasta that more closely resembles the love child of wonton wrappers and lasagna. Meh...Between the disjointed duck and a \"deconstructed\" curry on the specials menu, I'm guessing the theme here is taking things apart. But cooking should be about putting things together. And though deconstruction may sound like a tempting theme, that's usually what happens after you swallow the food...And I can't help but feel like they were attempting to digest my food for me."], ["Chuck W.", "Food, atmosphere, and music were great as usual."], ["Elizabeth V.", "I live in San Diego and was passing through Raleigh to get to DC over the holidays.  I have a girlfriend who lives in Raleigh and I picked this place based on the reviews on yelp, made a reservation, and told her to meet me.  She brought her sister, I brought my mom.  I have nothing but positive, glowing, wowzers reviews for this place.  The food was delicious.  Their menu is quite eclectic for North Carolina as a whole.  I would expect to see this menu in Cali, but I was very, very, very pleasantly surprised to see it in Raleigh.  You know, where racism still thrives.  Anyway I digress.I ordered the goat cheese salad and the pizza appetizer as my meal.  I couldn't finish it, it was plenty of food at a $15 price point.  The pizza was a little greasy for me-- but remind yourself where I come from.  MOST pizza is oil based.  If you order it you will probably love it and go \"I don't know what that ho was talking about this is not greasy.\" My mom had a vegan dish.  Um, vegan?  In Raleigh?  Yes!  Have I mentioned this place is the tits?  I think it was the eggplant dish, she loves eggplant.  I tried it, it was amazing.My girlfriend had the veggie bean sliders.  Veggie burgers?  In Raleigh? (I'm sensing a theme here.)  They're mini burgers (sliders) with avocado, and an orange zesty sauce.  Tried those too, yum!  Come to think of it, this is probably why I couldn't finish my pizza :)We were seated in directly the middle of the restaurant on what looked like a dance floor, and to my right a live band was playing in the classic \"big band\" style.  Even though we were up in their grills, they were not too loud for us to talk to each other.  I mean it's not intimate eating, but the music is a nice lively level.I went to the restroom at some point during the meal and read all the framed newspaper clippings that are hanging on the wall in the hallway about the history of this restaurant.  Apparently the Irregardless has been a staple in Raleigh for at least 2 decades, survived a fire, survived a brief switch to an internet cafe in the '00s, and is now back serving fusion cuisine and live music 7 days a week.  I was so thrilled to see this place ride the wave of change and recession, and still see it packed and going strong.After about 2 hours, we were winding down anyway, the manager came over to check on us, find out how everything was, and see if we could be moved to a booth off to the side of the parquet floor we were on.  Why?  They were opening it up for dancing.  Dancing to live big band/swing-style music.  Can you say soulmates? This is my spot.  I almost wished I lived in Raleigh so I could make brave first-date boys take me here.  Have you met me?  Liz was born to dance."], ["Shawn H.", "This atmosphere here is very nice and offers live music for your dining. The staff was attentive and the food was delicious. I had the Steak Au Poivre and would recommend this to anyone.who loves steak. The folks I went with all commented on the food being very good. The menu items are a little pricey but worth the time to check this spot out."], ["Michael H.", "Have you ever been to one of those restaurants built into a two or three start hotel? Think of your run-of-the-mill Holiday Inn, with the obligatory restaurant that serves bland food for the everyman. A safe, staid menu that has all of the creativity of the frozen food section of your local grocery.Boring hotel restaurant, meet the Irregardless Cafe. You two have a lot in common.There's a lovefest of hype surround the Irregardless, and I really don't get it. Maybe it's the aging hippies who fondly remember this place from their days of free love and peace protests--who were there in abundance last night, complete with their ungroomed hair, loose fitting clothing and comfortable footwear. The crowd isn't the brain trust from neighboring NCSU, nor is this the up-and-coming hipsters from RTP or downtown Raleigh. The word \"retread\" comes to mind.But back to the Irregardless. It's in a strange spot and you will be doing some hunting for parking. The atmosphere inside is a combination of new-age artsy and cheap hotel events room, complete with the \"rack 'em and stack 'em\" chairs that are neither attractive to look at nor comfortable to sit in.We were there during Triangle Restaurant Week, and it seemed appropriate to try something from the special menu; after all, this is a time for restaurants to show their best and shine, right? Again, for a restaurant that gets such vaunted press, this was a really boring menu. We both ordered the white bean soup to start. She ordered the salmon entree and I ordered the spare ribs. She picked the flourless chocolate cake for dessert, while I opted for he creme brulee.The soup was the best part of the meal--but as you'll see, that's a fairly low bar to rise to. Both of our entrees were bland. And I'm not talking \"I should have ordered the hot spicy curry instead of the medium spicy curry;\" instead, I'm talking, \"seriously? I paid how much for this?\" The salmon, completely unadorned save a scattering of pepper, was carelessly tossed on a bed of similarly bland rice with some mash potatoes on the side. The spare ribs sat aside a few vegetables that were quickly sauteed in a bit of oil, and the same stale mashed potatoes.She commented that the rice and potatoes tasted like they had been cooked en masse earlier in the day and left under heat lamps (or worse yet, nuked). My spare ribs were identical to what I might get at K&W Cafeteria or Golden Corral. And that's not to say that they were bad; but they were nowhere near the caliber I expect for $30 per plate.We were in a party of six, and our table had seven seats. The owner of the restaurant came by during our meal to ask us how we were enjoying it. Drink in hand, he felt no compunction about sitting himself down and holding forth about how the restaurant got its name (although none of us had asked). There's nothing wrong with the owner coming by to see how things are, and participating in a bit of light banter if invited to. But the campy charm of holding forth and chattering as much as he did was inconsistent with the kind of dining experience that the Irregardless aspires to.The other problem was the noise. The aging hippies are a loud crowd. The live band was also competing with the din of noise, and the result was a lot of \"WHAT WAS THAT?\" and \"CAN YOU REPEAT THAT?\" I *hate* dining experiences where I have to strain just to hear what our small party was talking about, but that seems to be part and parcel with the Irregardless experience.So: irregardless of the Irregardless's storied history and longevity in the area, I simply cannot recommend this restaurant. It would be a stretch at half the price they're charging, and it doesn't even begin to compete with restaurants like Vin Rouge in Durham."], ["Trish X.", "Perfect spot for a cozy dinner for two.  My boyfriend and I really enjoyed the atmosphere, the food and the live music.  Our waitress was well informed about the menu and very attentive.  We both agreed that we will return very soon."]], "Stanbury": [["Tiam L.", "Made a reservation for a Saturday evening. It wasn't super packed, but the tables were slowly filling. Thanks to Yelpers on tips for parking! I was able to know ahead of time arrive around 5pm to get great parking: several spaces directly in front of the restaurant.My server was excellent! She gave me great suggestions and was very attentive throughout the meal. She made it much easier to decide on what to order.I would definitely come back here to entertain clients or a special someone."], ["Meredith V.", "We had planned on going somewhere else for dinner but it was closed for a private event, so we trekked up to Stanbury and hoped for a table. It is definitely out of the way and away from other restaurants on the main drag but don't let that deter you; this is a hip, excellent foodie restaurant. We arrived around 8:45 on Saturday night and there were no tables so we sat at the bar, which was fine because it was a nice bar. I started out with something that had tequila and rosemary and a fresh rosemary sprig. Nice touch. We ordered a couple small plates: beef tartare & the grilled romaine. Great choices! While I have had better, more flavorful beef tartare, it was surrounded in a couple different sauces that really took the flavors of the beef to the next level. I've never seen a beef tartare served with sauces or with a rye, which was an interesting choice, but it really was a great starter plate. The grilled romaine may not sound like much, but if you haven't tried something like this, you're missing out. The char on the lettuce combined with the large, soft croutons and the house-made cesar dressing created amazing flavor profiles in my mouth! Do not miss the grilled romaine!We both ordered the ribeye, which I typically hate to do, but we both wanted steaks, what can I say? I ordered it M, my bf ordered it MR. Go with MR, for sure. Ribeyes are my go-to at nice places and this ribeye did not disappoint. It had a nice sear to it and it had this tasty pesto-like sauce on it that, I think was Mexican-based, but oddly it paired very nicely with the ribeye. The mushrooms were marinated in something excellent, they also paired great with the steak and the potatoes were crispy and brown. One of the top 5 steaks of my life. We paired the steaks with a bottle of red (Grenache), at the recommendation of the bartender, and it went very well. Also, for having such an amazing, upscale menu, it was surprisingly low-key inside. Not stuffy at all. Great music. Chill staff. Dim-lighting. Rustic ambiance. AMAZING food. I am going on record as saying this meal at Stanbury was one of the top 3 best meals of my LIFE."], ["Jennifer J.", "Great service, accurate recommendations, amazing food, interesting ambiance -- what's not to love? Because we didn't have a reservation, my friend and I were seated at the bar, where we shared small plates of fresh oysters, Roasted Marrow, NC Tuna Crudo (seasonal), and Crispy Pig Head. All of the dishes were incredibly rich and flavorful, salty but not overly so. Trying the roasted marrow was an experience--the marrow is used like a butter spread on whole grain toast then topped w cooked argula, onions, and capers. My favorite dish was by far the crispy pig head, which had a crispy, breaded outer layer with mustard cream and pork inside. Get a reservation ahead of time, and if you have a long wait to be seated, make sure to visit Escazu, the artisan chocolate shop next door."], ["Mikkel M.", "Stanbury was excellent! I've heard good things and I don't know why I assumed it was an upscale fancy place but it's not really. It's just nice enough to be a good weekend meal with friends but just casual enough to feel like you can go during the week and sit at the bar and feel comfy.We got there and it was packed on a Friday night but the hostess was so sweet and said she thought a couple was going to finish their drinks at the bar soon - did we want her to save the seats for us when they paid and left? Yes! She told us a waitress would take our drink order in the meantime. Perfect. We ordered...and the table was ready for us shortly after. When we sat the cocktails were delivered!We ordered the pickled salmon starter with beets (I don't love pickled salmon, I have realized but I imagine if you do, this was a great dish - I do love beets and they were spot on!), and the fried oyster dish (GET IT!) and shared a main dish of fresh tagliatelle, which was delicious. It was fun to sit at the end of the bar closest to the kitchen too, and watch the cooks make things. They know what they're doing.Ambiance, service, price, flavors: all A+. Can't wait to go back! Great for a date or evening out with friends, but probably best for parties of 1-4."], ["Jerica L.", "Absolutely delicious. Flavorful unique dishes! It was quite a treat dining at this restaurant. The menu had a nice variety of small plates and large plates to choose from. Their cocktails are creative and tasty as well. We will definitely be back many more times!"], ["Jami C.", "Ambiance: hipster vibe, dim lighting, rustic, classy.Food: innovative, creative, and special. You MUST try the crispy pig head. If you like bacon, you will love this. Pinkie swear.Service: Couldn't have been better. Her presence wasn't too overbearing, she was kind, and gave some great recommendations."], ["Christina G.", "My husband unabashedly gnawed on our appetizer attempting to extract the last remaining bits of bone marrow. It was that good. Marrow seems to be the new pork belly... I've seen it trending on Instagram feeds and featured on a few local menus lately (including Death & Taxes and Primal). This was our first introduction, and it's safe to say we're fans. The marrow is quite rich, spoons out and spreads like butter over toasted bread. They give you two bones here, which means we each had a 'bone to pick' AND both of our dogs were able to enjoy the spoils afterward; thanks, Stanbury, for the literal doggie bag!Our other app, the ink octopus, was so incredible I don't have words to describe it. The surprising flavors and textures of both starters left us a wee bit disappointed with the entree we opted to split: a fish prepared Thai-style with rich coconut milk and jasmine rice. It was still tasty (featuring bright flavors and flakey fish), just not as standout or original as everything else we had. My cocktail was a light seasonal selection, subtle and refreshing. Place was packed and a little loud, but service (except for the hostess, a surprising anomaly) remained friendly and prompt. It's a fun off-beat space, a bit small & bustling, with oddities like Yoda decorations lurking about. Our check arrived with two squares of neighboring Escazu chocolate -- a super-cool (and tasty!) gesture to their neighbor. With the frequently updated seasonal selections ensuring a menu that remains full of surprises, this is one restaurant to put on heavy rotation."], ["Susy G.", "Loved everything we tried!  This was our first time and we will definitely be going back.  Even if it means driving 15 miles from Wake Forest...Excellent cheese plate, followed by the grilled romaine salad and finally the crispy pig face!  Enjoyed the causal atmosphere and great service"], ["AR B.", "Taking the advice of The New York Times, I took my mother here to share one of the finest restaurants in the Raleigh Durham area. Each dish is made to surprise you, comfort you, even challenge you about your assumptions of food combinations. I was extremely impressed with my grilled romaine dish as well as my roasted oyster mushrooms. The waiter was extremely professional filling mywater glass as if he were the fountain himself! The decor was warm yet eclectic including everything from an NC State Diploma to a deer's head. I was very happy with the experience here and would highly recommend you give Stanbury a try!"], ["Lindsay H.", "Each time we go there I am more and more impressed by Stanbury. Seemingly everything at Stanbury is delicious!We went for my birthday dinner last night and feasted on three small plates before our large plates. The swordfish crudo was my favorite - perfectly seared over a bed of seaweed salad. The bone marrow is always a good choice - it is totally unlike anything else in Raleigh (plus they let you take the bones home for your dogs!) The crispy pig head was indescribable how different and delicious it was - served with lentils, a mustard sauce, and an egg, it was something unique and was absolutely delicious. For our large plates we had the steak and the scallops. My mouth is watering just thinking about the scallops - served with Brussels sprouts and a delicious butter and sweet citrus sauce. We also had some of the best wine I've had in Raleigh - the 2012 Chaillot Syrah. So smooth! They also brought a taste of champagne at the end of our meal for my birthday.The service is great - our waitress was attentive but not hovering, helpful and knowledgeable, relaxed and nice. Don't forget to call and make a reservation about 3 weeks in advance! Stanbury is innovative and consistently turning out must-try dishes in Raleigh!"], ["Austen H.", "This place was fantastic! The service was very attentive and the food was all phenomenal. We had the pig face and the arinchini and they were both delicious and good portions for small plates.  The drinks were very good as well. I had a local beer and my wife had a cocktail that was very well done. The chocolate peanut butter cake dessert was also very tasty."], ["Jennifer M.", "Wow!  What an experience!   First time trying a few foods happened here.  Bone Marrow was probably the most unique.   Tasted good with sides.  Octopus ceviche was good but very different from a traditional ceviche.  May not order that again. Clams were buttery. Salmon was so fabulous. We had a few more dishes. Clearly well thought out dishes and created with intention. Great place and want to go back to try more. Make reservations far in advance.  Side bar: some of the best chocolate is sold next door.  Go there after for a second desert."], ["Tanith T.", "Adventurous to the point of edgy, fun, and above all, very tasty.  Stanbury has some solid chef talent in the kitchen as well as a great bartender and mixologist in the house. They source top quality, fresh and local ingredients, and they aren't afraid to use yummy offal. I love adventure eating, so that was the original draw for me. That and they're right next door to Escazu, which is a holy shrine to all that is great and good in artisanal chocolate. I got hooked when I wandered over in a chocolate endorphin daze and read the menu. Crispy pig's head, sweetbreads and bone marrow? You got me right there.Not every single dish has been a hit for me. A few were either small for the price point or inconsistent on the portions - I got one nearly empty marrow bone while my dining companions got much more generous portions of the same dish - and I didn't quite get the flavor and texture combinations in others. But overall I expect and generally receive excellence from everything I order here. This is some good food, well executed.Stanbury replaces the late, lamented Market by Chad McIntyre, which had a similar fresh, local ingredient ethos and modern pan-Asian to upscale Southern flavors. It is a worthy successor, which is saying quite a lot.  The space is a bit small and can be crowded and noisy. In warmer weather, outdoor seating is a good bet. The open kitchen is a plus, though, and if you sit where you can watch the chefs working, it can be quite an entertaining and educational show. Do recommend."], ["Ashley Elizabeth H.", "They were ill equipped and the chef line was at best, mediocre. Coughing in his arm, dropping food on the floor. I just wouldn't come here. Texting while cooking is a thing apparently? I did not know. I do not rate places but I can l tell you this place is poorly advertised as amazing. If you're looking for a fast food version of McDonald's then come here. Oysters served without any sauce or lemon and was told this is  \"French style\" - lived on the riviera for a year and never once saw this. Final notes : hipsters don't equal chefs."], ["William T.", "Delicious food and solid drinks. Recommend getting a few small plates to share. The food is local and trends to be on the heavier side. Their oyster options are always on point. Try the cocktails!"], ["Terri R.", "Awesome! 5 small plates & 1 large plate & dessert  everything  was  delicious. Finally enjoyed  a great cocktail,  celery gin & tonic. Can't  wait to go back."], ["Latef X.", "Had high hopes for this place since it makes all the top lists in Raleigh, but wow, probably the worst dinner I've had in a long time -- maybe ever? Which was really sad because I brought my friend here for his birthday. :(I will eat anything edible, and I rarely complain at a restaurant, but every dish here was so salty to the point where it was almost inedible. I think the worst was the charred broccoli. Every bite was a giant salt ocean and the chili sauce just seemed like they spooned it straight out of the sambal olek jar -- which made it even saltier. I tried like 3 pieces to make sure it wasn't just one piece. Nope. Whole dish was a salt mine. Soooooo bad!!!Steak was overcooked but still decent. Salad on the steak was inedible cuz it was so oversalted. Fries were pretty good but again, oversalted.The bread that you pay for is good. But they again hella over salted the butter. Had to scrape like half off.Their old fashioned wasn't that great either considering we're so close to bourbon country. The ambiance here is pretty nice though. They had the most lovely flowers on their outside patio area too. And the server was attentive and she tried to make up for the bad meal by taking an item off the bill."], ["Ela G.", "Oh my god, thank you stanbury! Having just moved from Chicago, it feels good to know I still have some digging to do to find the great restaurant spots like the stanbury. Why? Because well, you won't just stumble across this place! It's well hidden and perhaps so good it's worth keeping a secret;) Everything we had was great. Highlights include the tuna crudo, charred green beans, Bavette steak, and house made pasta. Yum! Cocktails are great, cool open kitchen with hipster chefs and servers. Will definitely be back!"], ["Bon V.", "Great space. Great service. Meh food. Some highlights but too many heavy handed missteps. Chef needs a lighter hand. Better options for your hard earned $$ in the Triangle. Wanted to love the place but just didn't happen for me. That said, I should probably give em a second try in the fall. Full review at bonvagrant.com/#/stanbury"], ["Katie B.", "Great spot. I took some out of town guests from Boston here and they loved it. We enjoyed the atmosphere, the cool, hip decor, our server was attentive and the food was excellent. Everything was prepared with such grace and detail. Furthermore, everything we tasted (we got a bunch of small plates to share) had great flavor.I would definitely come back."], ["Holly K.", "I was never going to review this hoping to keep it my little secret. I can see now that ship has sailed. This is hands-down the best place to eat in Raleigh. Make a reservation or come prepared to wait. Possibly bring a chair. Sit at the bar if you can! The bartenders are always fun to watch."], ["Kelsey C.", "I knew I could get good southern cooking in Raleigh, but in recent years, I had feared the fine dining was falling behind. Sure, there are plenty of great southern staples, and standard meats and seafood dishes are solid, but I needed something new, something that pushes the envelope.At first, I wasn't impressed. The Grilled Quail was smothered in BBQ, and it wasn't the good kind of smothered. And I wasn't a fan of the Steak Tartare - the vinaigrette made it taste like it was tossed in ketchup. The sweet butternut squash Crostini with whipped ricotta is an amazing bite of autumn, and the House Made Tagliatelle entree is a winning combination of squash, kale, and pistachio pesto, but I felt like they were playing it safe.The Seared Scallops were another safe option, but they were some of the best seared scallops I've ever had.Fortunately, Stanbury does push the envelope a little. I didn't think I'd ever see Crispy Pig Head being welcome in a city where people told me I was \"exotic\", and the Braised Pig Cheeks had a great tender texture, well-balanced with tart kimchi on crispy, bitter brussel sprouts and soft, chewy mushrooms.I love visiting home, but I need a pretty stiff drink to deal with my family. The Maple Leaf, a burly bourbon, smoothed by maple syrup and frothy egg whites will take the edge off of just about anything, and I imagine the rest of the drinks will too. The desserts are as amazing as the rest of the meal, which is an accomplishment in itself - I feel like most places excel at one or the other, never both. The Apple Tart has a flaky crust and a cinnamon-y, fruity finish. The S'Mores dessert features chocolate between dense cookie-crackers and a marshmallow charred to the max, a campfire favorite with a modern, new-age spin, an amazing end to an amazing meal."], ["Richard K.", "We love Stanbury and always find something unique on the menu to try. Beef marrow on their amazing bread was a treat. The grilled Caesar salad is terrific. Reservations are a must however we sometimes sneak in at 6pm and eat at the bar."], ["Kevin G.", "Ate here on a Wednesday night with my wife and had a great time. We didn't have reservations but we were able to get a table. It was pretty busy and service was slow (we saw two impatient patrons walk out). We first ordered trophy beer and a cab for drinks and then ceviche and the soft shell crab for appetizers. Both dishes were fairly small but packed with flavors. I only got a bite of the ceviche but my wife seemed to really enjoy it. The soft shell crab had a creamy white sauce that went well with the kale. We then ordered a cheese plate and the pigs head. The blue cheese was great, didn't care too much for the NC cheese though. Bolted bread was a great plus! The pigs head was super tasty with a nice mustard flavor. It was pretty heavy but definitely a great choice for an appetizer that will fill you up. We ordered the peach cake for dessert. It was interesting but I felt the bacon ice cream slightly overpowered everything.Overall, an exciting and interesting place for dinner. Our small meal went past $100 so be prepared for that. Also, make reservations or go on an off day. We'll definitely go back for a small meal or on a special occasion!"], ["Jose B.", "Place was unbelievable. Had the lamb tongue,pig head, Beef tartare, pork chop, scallops and the tagliatelle. All were on point. They have it all figured out. Great job. We were in town for a conference and we are so glad we went. Hip atmosphere."], ["Andrew W.", "Eat here, you must. (/Yoda voice)Stanbury is still the most hyped restaurant in Raleigh, and deservedly so. You can actually call to make reservations, but don't be surprised if they are booked a week or two in advance.The restaurant is led by Chef Drew Maykuth, who cooked for four years at one of my favorite restaurants in Asheville, The Admiral. Stanbury's menu has some of the most unique items in Raleigh; You'll find roasted marrow, crispy pig head, and maybe tongue or sweetbreads. Like The Admiral, there's also a lot of seafood. Oysters are a must-do (unless you're allergic to shellfish).I recommend sharing a few small plates and a large plate. The menu rotates frequently based on the seasonal ingredients. They also have some of the best cocktails in Raleigh, and that menu rotates regularly too.In the winter, the place can get a little smoky since they cook with an open kitchen. In the summer, they open up a garage door to their outdoor seating. If you venture outside, don't miss the stencil of Yoda."], ["Laurie V.", "How can I give it anything less than Five Stars?  Everything from the service to the food to the ambiance was top notch.The decor is simple, yet has a clear-cut theme.  There are framed croched art pieces.  There is taxidermy.  There are red booths.  There are owls.  It kind of reminds you of a trip to your Great Aunt and Uncle's basement in 1979.  All we need to add is a jukebox playing Blondie and maybe a flashing neon \"Bob's Billiards\" sign.  The Server was really cool, very knowledgeable about the menu, and extremely accomodating.  The food runner happened to the owner of Escazu Chocolates next door, so she made us a special hot chocolate, since Escazu was closed by the time we had finished eating.  Way to go above and beyond!Now let me talk about the foooooood.  Oh my.  The food.We shared six small plates:Green Beans-  better than any I've had.  Al dente.  Served with smoked blue fish and crispy shallots.  Smoky and hearty flavor.Steak Tartare- Served with these crab chips that sizzle when they touch your tongue.  That was the most satisfying tactile experience.  So deliciously satiating. Fried Oysters- served with sriracha mayo.  Yum.Crispy Pig head- I was getting full at this point, but still yumShort rib- kimchi brussel sprouts and some other delicious stuff mixed in.  Very full.  Took home the leftovers Roasted marrow-  Bone marrow is my favorite thing in the world.  I wish I hadn't been so full.  But I took some of that home too and guess what?  Just as good the next day!We of course did dessert. (Why is there always room for dessert?) S'mores made with homemade graham crackers.  Pumpkin ice cream.  Just....yum.Drinks were good too.  I had the \"Madison Cocktail\": brandy, fernet, angostura, simple.  It was good, but very bitter.  I don't normally like sweet drinks, but my dining companion took it to the bartender and asked him to add a little more simple syrup.  He didn't seem to mind a bit and it did make it a little better.He had the German Roulette: rye, jagermeister, campari, cocchi rosso.  I liked his better. This place is so awesome.  I can't wait to come again."], ["Nichole B.", "Absolutely awesome employees; we made several new friends. Outstanding selection of whiskeys and wines. Carnivore's dream; limited fare for vegetarians but go anyway for the oyster mushrooms. My carnivore friends recommend the raw oysters and pig's head; I really thought they were going to transcend based on how much they enjoyed the food. Casual and hip ambiance; we hung out until closing because the vibe was so good. Seems to be in the middle-of-nowhere so just follow the GPS."], ["Andre B.", "First of all, they kind of have a strange reservation policy. I called and left a message as instructed. I did receive a call back the next day saying that they were all full for Saturday but based on my requested time, I should get a table based on their first come first served availability. The wife and I had spent the better part of the day in Pinehurst for the US Open and we were borderline hangry. The second strange thing is not knowing Raleigh too well, I had no clue this restaurant was basically in a neighborhood surrounded by houses and apartments. iPhone GPS tells us that we had arrived and we are in somebody's front yard. I double check the address and figure that it's just a few buildings down the road. I was anticipating problems parking on the street but it was a breeze. So we walk in and we are informed that the wait is 30 minutes or so. Looking at the restaurant, that seemed about right, so we decided to wait it out. We had no other plans and there were no nearby restaurants to walk into. We ordered some cocktails from the bar and went to sit on their patio waiting area. I had the Kentucky Handshake which had some minty flavored alcohol called fernet in it. It took some time to get used to as I am not a fan of minty things, but all in all a solid bourbon drink. The wife chose the Louisiana Purchase which was made with brandy and also delicious. We hung out on the patio for maybe 10-15 minutes before a table opened up on said patio. It may have been longer, but time may have flown by as we enjoyed the atmosphere on the cozy patio.As previously stated, we were borderline hangry, so we got 3 small plates to start, the smoked blue fish pate, king salmon crudo and the pig head. The smoked fish pate was first and while it was tasty, the presentation was a little strange for us. The pate itself was drier and grainier than I would have anticipated based on other fish pate experiences. The other strange thing with the dish was that the accompanying bread was heated up. Again, it was tasty and good, but I may venture to other options on the small plates next time. The king salmon crudo was fresh, vibrant and a solid dish. As with most crudo dishes, I wish there was more, but the quality was there. I alone ate the pig head, as the wife has been off pork for a while. The flavor was good, if slightly under seasoned on this occasion, but the perfect duck egg on top made up for it.For mains, oh yeah we kept eating, the wife took the awesome scallops and I got the even more awesome ribeye. We didn't taste any of the other entrees, but I firmly believe that we chose the 2 best ones. The wife's scallops came with some fresh asparagus, farro and best sauce that I can remember paired with scallops. My steak was cooked to perfection and came with smashed smoked fingerling potatoes and grilled broccoli rabe. I was getting stuffed, but I was determined to eat every last bite of that steak.While we looked at the dessert menu, we both decided that a liquid dessert would be more suited. As we are creatures of bourbon, we noticed that the dessert menu had some top shelf, fancy bourbons and proceeded to order a few of those. When I got the bill, I noticed that one of the bourbons was not right on the bill. Our server confirmed that the bill was correct, and that he had misunderstood our order, but he did get us a little taste of bourbon that we originally wanted to try. All in all, it was a perfect end to the evening and with the great atmosphere, service and food, we shall be returning as often as possible.I wish that I had The Stanbury in my neighborhood or a similar restaurant. I can only dream unfortunately."], ["Bo T.", "Most innovative and inspired food in the triangle area. Truly farm to table ingredients prepared perfectly."], ["Dennis K.", "My wife and I celebrated our anniversary here the other evening. Fantastic fusion of flavors in everything we ordered. Wait staff was wonderful and attentive without being pushy, which I really like. We plan to go here on a rather regular basis as the menu is always changing."], ["Kelly G.", "I dined here on a Wednesday evening with a group of coworkers. We shared a bunch of small plates, and everyone was impressed. We had the Grilled Romaine, Fried Oysters, Cheese Selection, Green Beans, Ahi Tuna, Roasted Peppers, and Fried Green Tomatoes. Stanbury changes it's menu according to season and availability, so some of these items may not always be on the menu. The fried oysters were the best I have had. The flavor was excellent with just the right amount of breading and they were cooked perfectly. The cheese selection featured figs freshly-picked from the tree next to the building and drizzled with a compote. The blue cheese was not overly salty as some blues can be. I am not usually a fan of peppers, but I ate the majority of these! The open-fire roasted flavor was divine. The fried green tomatoes were the best I have had. There was flavor, not too much breading, and they were just tender enough. Delicious. I can't say enough about this place! Two things to note: it is a little pricey (but well worth it), and I have tried to get a table here last-minute with no luck, so I recommend making a reservation."], ["Lavinia N.", "Stanbury is touted by many as \"the best restaurant in Raleigh.\" While I am not totally sure about that particular designation, it is damn good. I was with 2 other gals, and we split everything. We had:Pig HeadTartareOysters on Half ShellFried OystersGrilled RomaineBone MarrowRibeyeAll dishes were solid, tasty, well-presented, and devoured. I just didn't feel like it was anything I'd never had before. Others have called it \"adventurous,\" but to me the experience didn't feel \"adventurous,\" per se. It DID feel very sturdy, confident, and dependable. I should say upfront that I have eaten at several restaurants with similar menus. So that is just MY experience. If you have never tried pigs head and marrow and that sort of thing, try it here first. They do it right.So, for me, if I want something \"edgy,\" exciting, and innovative... I may not go to Stanbury. BUT when I want tasty, reliable, consistent, American continental-type fare, Stanbury will be my first choice!"], ["Anil O.", "Excellent! I couldn't get in on Monday but managed to get a spot at the bar on Wednesday.The roasted bone marrow with the parsley, red onion, caper side and toast was so unique and tasty. The pasta very fresh, al dente and with a light, colorful sauce and fresh, flavorful tomatoes topped off with a parmesan mountain. To top it all off a different twist on creme brulee, with a hint of rose water, topped with beet yogurt and a piece of crunchy kadaifi (kadayif). Need to go back for more."], ["Sherri H.", "100th review for Stanbury woohoo! Love this place! Delicious small plates & cocktails, cute comfy atmosphere, good tunes. I love coming to Raleigh, add Stanbury to the list of reasons why."], ["Kortney C.", "I had Stanbury for the first time last night and it was absolutely amazing. I was incredibly impressed by the menu. We had bone marrow, pigs head, tartare, and goat tongue. I am not usually a fan of tartare but they did it perfectly. The drinks were delicious. The ambiance was relaxing and we had a great conversation with our server. I would definitely recommend Stanbury should you ever be in the Raleigh area."], ["Sam Z.", "Wow wow wow! This meal was amazing. I had heard great things about this restaurant, so tried it for the first time when my family was in town. When i first walked in, I was struck by how casual it was. With how people described it, i thought it would be really fancy inside, but it was casual and welcoming - it reminded me of a barbecue place. The food though was anything but casual. We split about 5 small plates and 2 entrees between 3 of us. They offer lots of small plates and only about 3-4 entrees. The small plates were delicious, Everything from the grilled romaine (sounds boring but is not at all) to the pig head was delicious. My favorite was the pig head appetizer. The beef tar tar was good too. The entrees we tried were their fish and pork The pork dish was out of this world.We had room for dessert as well and got chocolate and an apple dessert. I am picky about my desserts but both blew me away! They also offer some interesting cocktails that were strong but good. All the recommendations were spot on - this restaurant did not disappoint. The service was also great and they could tell you a lot about the dishes.  It is not cheap but isn't too expensive either. I'd recommend coming with a few people and be prepared to share so you can try as many dishes as possible."], ["Pamela H.", "We were a party of three approximately fifteen minutes early for our reservation and we had to stand awkwardly near the bar while a table was cleared. The bartenders did a fantastic job of ignoring us completely even after eye contact was made. Our table was literally just inside the front door. It was 17 or 18 degrees fahrenheit out and the door was opened frequently. I'm a pretty warm-natured person, so I was not personally uncomfortable, but it was a terrible seating location for someone who booked a reservation well in advance. (- 1 star)Once we were seated, the experience was five stars, all the way. Our server, Mark, was outstanding; I never touched the wine bottle nor did my water glass reach empty. He thoroughly explained every item we had questions about. We ordered an entree of tagliatelle with pistachio pesto, roasted cauliflower, beef tartare, crispy pig head, a toad in the hole, and roasted marrow. Everything was amazing. The only thing I didn't care for was the crispy pig head and that's all me. I'm not a big fan of heavily smoked food and the meat was very, very smoky. The blend of flavors and textures on the plate were great and would have been considered exceptional by someone who enjoys strong smoky flavor in their meat more.The marrow was exquisite. There's really no other word for it. Every single bite was like putting heaven in my mouth. This was by far my favorite dish.We shared a dessert of chocolate malt creme brulee and the groans of pleasure were downright indecent.Three people, six plates, one beer, one bottle of wine, and one dessert, $120 before tip. Not bad at all for the quality of the ingredients and preparation.I will definitely be back. I will make a reservation and try not to be too early, and I will ask to not be too near the front door, but I will definitely be back."], ["Alicia K.", "Super not kid friendly restaurant. If Michelin star restaurants can offer high chairs, I see no reason why this restaurant can't. I'm from Singapore and if DB Bistro by Daniel Boulud and Bread St Kitchen by Gordon Ramsay can welcome babies, why can't Stanbury? It's not fine dining, neither is the restaurant too posh or in an exquisite setting that warrants basically turning families with young children away. If that's the case you should put a big sign on your front door saying no babies. This restaurant serves tapas style dishes, and the setting is casual. So it just seems like they are trying to be fancier than what it really is. We sat to try and finish our meal despite the guy at the front telling us they don't provide high chairs, in hindsight we should have just left. Servers were not friendly or understanding about our situation with our 7month old baby rolling around in the booth, they simply ignored her presence, served our food without any kind of interaction of sorts like how a normal friendly server should be. Overall it was an unpleasant experience. The food was good, not great. Masked by presentation, the beef tartare was heavy handedly seasoned with a lot of Indian inspired spices that overwhelmed the beef itself. The crispy pig head was a patty of shredded pork. Smoked duck was tough. Bone marrow was good but I've had better. The food at this restaurant had pretty looking plates but I think a true foodie would agree with me that it's not that amazing when you see past the presentation. I was really excited to try this restaurant out from all the reviews I saw here on Yelp . Left pretty disappointed."], ["Kyle A.", "Really good small plates, small funky atmksphere, great drinks and really friendly people. Had the swordfish crudo which was perfect, the cauliflower dish was a pleasant surprise lots of flavor and served with a great creamy sauce, not too much. The lamb was sooo tender and has a flavor unlike anything I have ever had. The schezuan peppercorn really dominates your palet and lingers for a while but the flavor is really good never the less."]], "Calavera Empanadas And Tequila": [], "MachuPicchu Peruvian Cuisine": [["Harleysydney C.", "My god was this fantastic.  I've always been a fan of good food made with fresh ingredients, perfectly seasoned and obviously made with love.  This fits the bill and then some.We got the appetizer sampler because none of us ever had eaten Peruvian food before, and it was perfect, have us a taste of a bunch of things.  Then we got four dinners (there were five of us) and shared everything, and we were all stuffed and happy!I can't wait to come back to try everything else in that menu!!Every single thing was delicious.  Make sure you get yucca fries!"], ["Binni R.", "This place is delicious. Not only is the food amazing, the customer service is excellent.The chefs make every dish with quality.We've visited a couple of times and every time has been a pleasant experience.What we ordered:Tamalito VerdePicante De CamaronesLomo SaltadoQuinoa Almodine Ice CreamDefinitely make reservations. Great for a special dinner date."], ["alley s.", "My husband and I went here for lunch while on vacation.  We were greeted by a very friendly waiter and seated immediately. Having never had Peruvian food before we were inquisitive about the menu. The waiter was knowledgable about the ingredients taste and portion size. We ordered the ceviche sampler, and the appetizer sampler. We were going to order the tacu tacu also but he suggested we may want to hold off as that portions were large! He was right. The ceviche was interesting, three types and all were extremely fresh. The shrimp were huge and the fish was portioned well.  The sampler of six items was a good taste of different types of Peruvian food. It was extremely flavorful. I don't know what it should have tasted like as I've never experienced authentic Peruvian food, but we were not disappointed. If we lived closer we would frequent this place but it deserves a chance and a was a great place to explore Peruvian food. My only comment would be to lessen up on the onions they are abundant on everything. Sadly we were too full for dessert, but the service and food were fabulous!"], ["Jorge T.", "It is def. the best peruvian food in town. Try el pescado a lo macho! Tell them Jorge Tipiana Realtor with Coldwell banker HPW sent you. :)"], ["Rae W.", "My family and I decided to try this spot for lunch and we had an excellent experience. I called ahead to make a reservation since the dining space fills up quickly. My father and I ordered the pescada with tomatoes and onions. I forgot what my mom ordered but everyone enjoyed their food.The chef came out several times to talk with us and checkin to make sure we enjoyed the good. Service overall was great! We also had the yucca appetizer and the sauces on all of the good prepared was amazing!I'm definitely going back!"], ["Allen K.", "This place is a gem! Tucked away in an unassuming strip mall next to a beauty supply store the only hint that this place might be special is the sign on the door advising reservations. This is definitely true and not hype. The patrons just kept rolling in. The dishes are subtle with a very layered tasting experience that makes use of all parts of the palate. Once again too full for desert. Great value"], ["B S.", "Interesting experience. Very small place in a strip mall, but inside white tablecloths and higher end prices. They recommend reservations. They only take credit card (no cash). They close at 8:45pm. Atmosphere was very quiet. Overall service was great. Food was unique and beautifully presented.  I liked what we got (the Jalea for 2) and wouldn't mind trying other entrees. Nice place for a date night. Not good for groups."], ["Jenny Y.", "We had a reservation on a beautiful Saturday evening. We walked into the restaurant nestled into a strip mall and were seated promptly. The dining room is small and cozy. The decorations look a bit cheap and sparse, but that's not why we're here is it? The server greeted us quickly and warmly. She was forthcoming with recommendations and such a warm character. Based on her recommendations and having read the reviews, we ordered:Trio of Ceviche: Beautiful, excellent serving size. Enough for about 3-4 big bites per ceviche. I personally thought this was a bit too strong and would've done well to been better balanced. The acidity was pretty good, but it was also very heavily salted.The only one not suffering from this was the shrimp ceviche, which was by far my favorite and I would love to order again.Lomo Saltado with Tacu Tacu: The meat was seasoned well and tender enough. It melt in your mouth, it had good chew. But it suited the dish fine. The flavor was on point. The tacu tacu was truly gigantic and honestly way too big and filling. It was really delicious for the first few bites, but quickly became a bit too much. I honestly think rice is better to soak up the sauces.Picante de Camarones: The sauce on this was AMAZING. We dipped the fries from the Lomo Saltado and ate a lot of the tacu tacu  in this sauce. Highly recommended. Rice Pudding: This was awesome. It was not too sweet, and just enough cinnamon. Truly well done rice pudding.Finally, i will note that our server got 2 orders wrong, and forgot things multiple times. We thought she was wonderfully friendly and she was happy to correct the mistakes she made, but I did want to note how many there were."], ["MariaTeresa L.", "THE WORSE PERUVIAN RESTAURANT, THE WORSE PERUVIAN EXPERIENCE I HAVE EVER HAD! I am from Peru, born in Trujillo and Lived in my country for 21 years.. Ever since I moved to the US, I have had the opportunity to live in a few different States and cities across the US and have also visited lots of other beautiful cities as well their restaurants. With that being said, it pains me to say that this restaurant has been The Worse  Peruvian Food restaurant out of all of the many other Peruvian Restaurants I have ever tried in the US before and I mean from WI to DC to VA to PA to FL to CA and NC... The only reason why I went to this restaurant tonight is because of the great reviews and I thought it would be delicious! Boy was I wrong!!!! I should have stuck with my fav Peruvian restaurant in Chapel Hill \"Mi Peru\" that is really a great restaurant and they really try to imitate the flavors the best the can. This MachuPicchu restaurant was awful! Huancaina sauce is not made with cilantro or huacatay leaves!! The sauce was green and the American waitress who has never been in my country wanted to school me!!!! SERIOUSLY?!!! The CEVICHE WAS DISGUSTING! People, trust Me, how can you screw Peruvian ceviche! Its one of out staples!!! My husband who is an American, tried it and couldn't believe it either!! Tasted like they used lime juice that comes already squeezed in those container shaped like a lime! The aji de gallina, one of my hubby's favorite, had the same \"green Huancaina sauce\" in it... SO WRONG!!! The Tamalito Verde was as bad as everything else... I was looking forward to it... Even the sweet potatoe and peruvian corn that came with the ceviche were gross... The worse part is that I brought my some of my American family with Me cause I wanted them to try some amazing food and this restaurant ruined it for Me... I heard that \"The Chefs\" were Peruvian too!!! What's wrong with them then? The stupid excuse I always get is... We have to tweak it for the American people... FLASH NEWS \"CHEFS\" NO YOU DONT!!! This people want to have the Peruvian experience!!! Our food is not spicy... Its flavorful and you can add the spice to it if you want! Americans need to be educated and learn what Peruvian food is all about... The flavors are amazing! This people eat Indian, Thai, Korean, Mexican food already!!! Peru is the Number 1 culinary destination in the world again this year! I recommend you rethink your crappy recipes because the FOOD SUCKED SO BAD!!!!! Shame on You people!!! NEVER GOING BACK ! I have a stomach ache thanks to the crap you fed me and terrible service btw!!!"], ["Alex Q.", "After reading some of the reviews my wife and I decided to try this place - she is of Peruvian dissent and ever since moving to the Triangle, we have been trying hard to find a good Peruvian spot that isn't Mami Nora's.  Machu Pichu claims to be authentic - sadly, it was far from it. For an appetizer, we ordered Papa a la Huancaina and for our entrées, I had the Secó de Res which is a Peruvian style beef stew and my wife had Pescado a la Chorrillana - a spicy and flavorful fish fry. Being that these dishes are staples of Peruvian culture and food, it was a very good way to gauge this place because if they screw these up, then the rest of them can't be very good.Well, they were screwed up alright. The Papa a la Huancaina comes with a yellow sauce that is usually thick, spicy and tastes cheesy. Instead what we received was a brown sauce that you normally find in a chicken dish - totally off target. Then the entrées came out - I was willing to let the appetizer slide if the entrées were at least decent - not even close. My wife's dish is supposed to be crispy on both sides and it wasn't - in fact, the bottom of the fish had not been cooked all the way. I'm surprised she didn't get sick.  For my dish, the meat was tough - it is supposed to be tender.Then came the ultimate insult - my mother-in-law prides herself on homemade hot sauce - we know what it supposed to look like and taste like.  So we asked our server if they had any and he replied yes - the rocotto - a spicy red pepper sauce. He went on to tell me that I was going to love it since it was a homemade recipe and they made it fresh every day.  I don't know what I was thinking when I got excited when I heard rocotto was available.  The rest of the \"authentic\" food was far from it so I should've known better than to expect that this would be. When the server brought it to us, we looked at it, waited until he walked away, looked at each other, shook our heads and started to laugh.  What he had actually brought us was nothing more than what you are supposed to use as the base to a homemade sauce - it comes in a jar - nothing homemade about that.  I wasn't mad at the server though, I'm pretty sure this is what the owners had told him.The sad part about this whole experience is that our service was impeccable.  It's really a shame because I would have given this place a five star review has the food been good.  In fact, the only thing stopping me from giving this place a one star rating is the fact that the service was so great - so I decided to give it two stars. Otherwise, I have a real problem with a place that claims to be authentic but is far from it while charging top dollar for it. After eating here, I would guess that people that have given this place a good review probably don't know what true, authentic Peruvian food is. I believe you'd be better served by going to Mami Nora's in Raleigh (which is ok - not great) and having any of their dishes. You'll spend about half the money if not less."], ["Danielle H.", "Hubby and I were looking for something quick and delicious and ran across this restaurant! New to Raleigh we were excited to experience cuisine outside of the typical southern food one would come to expect! The service was great, we were seated right away and our server was very attentive. The servings are large! I didn't get a picture of food this time but it was very flavorful! I wanted to give this restaurant the props it deserves!! It threw me off a bit that it was in a strip mall - and the decor was kind of Bare- however the food speaks for itself. So authentic and fresh! The cook clearly prides herself on a great meal! Bravo to my strip mall dining experience! #hancockhelping we will be back and want to try something new!"], ["Ranjay J.", "We had this restaurant on our to-go list for awhile, and we finally did it....it was definitely a different experience.  We would go back just for the Ceviche and the desserts (we had a Tiramisu and a rice pudding-ish dish) which were truly superb.We had a calamari appetizer as well, which was really good.  The dipping sauce was a mustard-based relish which was yummy, and the calamari itself was moist and juicy, and not dry and rubbery like at most places..so two thumbs up!The entrees, however, are probably an acquired taste.  The presentation was stellar and you can tell that the chef took pride in serving up every dish we had.  We had a pork entree, which seemed to be a pounded out pork cutlet with rice and beans.  The pork itself was not very flavorful and was lacking seasoning, and also had a slightly sour aftertaste.  We couldn't tell if that was how Peruivan pork was supposed to be or if it was stale meat.  We also had some sort of tomato and cream-based spicy stew with shrimp, which my partner really enjoyed.  I, however, kept getting a strange aftertaste with every bite that was really off-putting, but that probably could've been just me.So all in all it was a mixed bag for us.  Wonderful appetizers and desserts, but confusing entrees.  But, like I said, we will certainly be back just for the Ceviche and desserts!"], ["Bebba Q.", "I take great pride in my countries amazing cuisine. Its the thing that makes me most proud. With that said, this restaurant fell so short from what my beautiful country is known for. First, the appetizers: papa la hauncaina is a great starter as long as your not lactose intolerant. There's a few ways of making it, all of which still taste amazing.  Machu-pichu's version was bitter, not at all cheesy, and stale; as a matter a fact, it's the wrong sauce all together. For my entrée, i took the risk of ordering pescado ala chorillana, boy was i let down. One thing that has always been common, is when any fish dish is made, it will never taste \"fishy\" - I hate \"fishy\"!!!!! This dish is suppose to be pan fried lightly breaded fish in a soy sauce, lemony sauce that has sautéed onions and tomato, still perfectly crisp and a deep fried half potato. Just thinking about makes my mouth water. Their version didn't pull through. The fish was under cooked, the onions and tomatoes were soggy, and worst of all it was fishy tasting. I was in utter disbelief!!!Sad part is - the service was phenomenal! Had the food been good, this place would've definitely received 5 stars from me. Don't call yourself authentic when you are not even close! Stay away from here!"], ["Michelle F.", "Food is really good: loved the pisco, the fried yuca, and the lomo saltado. Only issue was when we complained of the fish dish: the chef came to talk to us that the dish was fine (although smelling like charcoal). He said he would bring another dish, which never happened. The waiter was really nice, although wasn't able to change the dish"], ["Phillip B.", "This place only gets 2 stars for the service...do yourself a favor, read the one star reviews from other Peruvians before you waste your money here.  This place is both far away from Peru in mileage and taste!"], ["Anu K.", "I went with a couple of my friends for dinner on a Thursday evening. The place has lot of options for seafood and some for beef and chicken. We had a few seafood and beef dishes. They tasted really good, especially the spicy ones. Will go again sometime."], ["Hardev G.", "Great restaurant, fantastic food, very authentic, and the nicest owners and staff.  Had a wonderful experience there."], ["Shawn D.", "The saltado was super yummy as was the home made ice cream. I'll come back over and over."], ["Christina L.", "FIrst off, it can be difficult to find this place, particularly at night. It's a small place located in the corner of a large plaza. The directions on their website are helpful. Tons of parking available in the lot. Came here on a weekday night and there were hardly any people, yet a bunch of tables said \"reserved\" (never saw these tables filled, and I stayed until closing). Small place but great decor - love that the napkin is rolled up like a volcano with a flame emitting, adds a nice fancy touch to the place. Staff is super nice and helpful. The chef even came out to chat and shared his background.Chicha Morada ($2.25) - \"The National Peruvian refreshment,\" a healthy beverage made from Andean purple corn, fresh fruits, and spices. Purple corn is believed to lower cholesterol and fight obesity due to the 6% Anthocyanin, a powerful antioxidant. Amazing drink - thicker than typical juice from the grocery store, but easy to drink the whole thing in a matter of seconds because it's SO DELICIOUS! Looks like dark cranberry/plum juice, tastes mildly sweet and addicting. Definitely recommend - yum!Before your meal arrives, you'll receive a tiny container of complimentary kernels. They're large and look like they've been roasted, but they're dry. Didn't care much for these.Jalea ($18.95) - a medley of lightly battered, deep fried fish and shellfish, served hot in a bed of lettuce, fried yuccas (similar to cactus plant, starchy and tastes similar to potato), and topped with a sauce made of diced onions, diced tomatoes, and chopped cilantro with lime juice and spices. Apparently there's a \"large\" version \"for 2\" available for $25.95, but I must warn all of you out there: the regular size is GIGANTIC!!! I was entirely shocked when I realized the entire mountain was all mine. Still, I managed to finish it all - I don't believe in wasting excellent food! It's beautiful, refreshing, and filling. The lime is VERY strong though, too much citrus. Almost like a healthy salad supreme, minus the deep fried fish, calamari, shrimp.....   Mazamorra Morada ($6) - Peruvian purple pudding-like dessert, made with purple corn drink, fresh fruits, and spices, thickened. Sprinkled with cinnamon, contains no dairy products. This is definitely different. Not a big fan of the chunks of fruits mixed with the thick pudding, but the rest of this healthy dessert was good.TL;DR Everything at this place tastes incredibly refreshing!"], ["Kendra S.", "I ate here tonight for the second time and once again, everything was phenomenal! The owners (and chefs) are extremely nice and the food is delicious! I can't wait to keep trying new things off the menu!"]], "Midtown Grille": [["Chris O.", "I've been to this place a few times and have had excellent experiences. The food is always satisfactory and employees offer great service. The most recent lunch was in their private room which was nice because our group could talk without interruption and the service seeemed to be perfect, literally! I had their french dip and the sandwich was excellent, I could not finish the sandwhich because the salad was so delishious I cleared the plate. I would recommend stopping by if you are in the neighborhood!Cheers, O"], ["Dave J.", "This is one of our favorite places for date night away from the kids. The food is wonderful and the servers are very pleasant and knowledgable. Last time there I had the Iceberge Wedge and the Bronzed Diver Scallops, both were delicious. My wife had the soup of the day (a corn bisque) and the special (pork chop & cheese grits) and enjoyed both. We'll be back."], ["Janet A.", "I was excited when I saw the groupon offer for this restaurant a few months ago, because I have been  here several times and the food is always amazing.  I went there last night and was not disappointed.  We did not have reservations (and they are booked solid because the groupon is about to expire) so we sat at the bar.  Phil took great care of us, he is a wonderful bartender with tons of knowledge and great suggestions.  John was there too, we normally ask for him to wait on us, so if you go in, make sure you ask for him.  he is the best of the best when it comes to service, you will not be disappointed.  The food on this visit was everything we have come to expect from this great restaurant.  Thoughtful, delicious, full of flavor and perfectly prepared and presented.  I do want to make a comment about something that I have noticed from reading recent posts and an observation that has become painfully obvious recently about groupon diners.  I feel like there is such a high (and unrealistic) expectation people have when using these discount offers.  It is really sad to me that there are so many recent negative posts from groupon users that are dragging the score down for Midtown on yelp.  Then when you read the comments, it's things like \"bread wasn't delivered fast enough\", or \"we had to wait 15 minutes for our appetizer\", or \"portion size was too small\", or \"restaurant was too expensive\".  I feel like the caliber of the clientele using the groupon offer is far outclassed by what this great restaurant has to offer.  This is a fine dining restaurant that is getting tons of accolades and local press.  They take great pride in what they offer and it just seems like the typical groupon diner doesn't appreciate the efforts Midtown is making to market themselves during the notoriously slow months of the summer, and the great offer that they have provided to all of us with this half off discount.  The people who are complaining so loudly and vocally should stay put at the Applebee's and Red Lobster's and TK Tripp's and leave the great dining establishments to those of us who can appreciate a well thought out dish or great presentation of a great product, and not worry about how many ounces will show up on our plate or if we get free bread and salad with the meal.  I just hope next year when it is slow again Chef Scott James doesn't re-consider if he wants to do the groupon again, because for many of us it is the perfect excuse to plan a great dinner out, and I would hate for a few vocal people to ruin it for the rest of us."], ["L P.", "A couple years back and I would have rated this place 5 stars, however something has changed and along with that is the quality we used to enjoy.  Each time we ordered the New York Strip and it melted in your mouth,  most recently the strips were quite fatty and aren't cooked like they used to.  It's sad as this was our go to place when we wanted a perfectly grilled NY Strip.  Service has all but once been top notch.  Ambiance is excellent.  Definitely plan on making reservations."], ["Nick P.", "We went to dinner here because of Groupon, and saved $30 on a $118 meal for 3. It's near the North Hills mall, on Six Forks Road in Raleigh, a really nice shopping/loft-living area, it's decor is simple, and has a nice ambience for dinner. The food is expensive, so we'll be eating take out for a little while, hahaha, but at least we had the groupon. The food is definitely worth the price, and the service is beyond amazing. Everyone is super friendly and knows the menu well, and the menu....oh my god, I almost died. We got the scallops, mahi mahi, fried oysters, and mushroom bruschette. I don't normally like mushrooms, but I loved the bruschette, and everything else was to die for, as well. The only downside is the back room, which is separated by a glass wall, and the table faces outward, so it's awkward for people facing the back to stare at the group sitting there."], ["Johnny B.", "Checked this place out because it had good reviews on Yelp. The modern strip mall atmosphere sort of dampens the mood, but the servers were friendly and the food was good. I thought it was odd that I was still hungry after lunch - maybe they could up their portions a bit."], ["Shannon P.", "3.5 stars really....We opted to come here during Triangle Restaurant Week during the week - Wednesday night.  I've never been here before, but thought it would be a good place to take a friend that was in town a) because of the great reviews and b) it's a week night - how busy could they be?....So when we arrived the hostess was very pleasant.  She'd even paid special attention to my request to sit outside on opentable.com - I usually indicate this, but it's hardly ever recognized and many restaurants won't reserve outdoor tables.  I was pleasantly surprised when the hostess said ' we've been holding that outdoor table just for you'.  Off to a great start!The outdoor patio was full once we took our seats and it appeared as though there were 2 waitresses for 10 tables.  As a former waitress, I'm generally very forgiving if I'm not spoken to immediately - I know how busy it can get....however, we sat there for more than 15 minutes before anyone even said hello to us.  What I'm assuming was our waitress seemed busy with the 4 top beside us...yes a 4 top, not a 10 top....so thankfully the other waitress leaned over and asked us if anyone had greeted us yet, as she'd noticed we'd been there a while.  When we said 'no' she apologized and took our drink orders.  She was very pleasant and I was hoping she'd take our table over for the night - thankfully she did.  I'm just starting to relax and enjoy myself when I realize it's been more than 20 minutes since we placed our drink orders and they still weren't there!!  I'm forgiving, but more forgiving if you just GIVE ME MY WINE!  We're nearing 45 minutes since we sat down before I got my wine.  The waitress was apologetic and said the bartender was 'backed up' and that she'd go ahead and pour it herself and give me a 'generous' pour....she did infact pour it herself but it was an average pour.  At this point, we'd already munched through and appetizer and our salads...with my water.  I was really wanting to pair the salad with the wine I chose.  I'm more than a little frustrated at this point.  Thankfully the meal was terrific - we opted to order off the menu instead of the restaurant week menu.  We shared the grilled romaine salad and I had the mushroom pasta which was delicious!  The hubby got the swordfish which came with several large shrimp as well.  It too, was delcious.  Our friend also enjoyed her short ribs.  Subsquent glasses of wine came out in a timely fashion so all was well from that point forward.  We decided to end the evening by sharing the beignets....honestly they were terrible!  The menu states to allow 15 extra minutes for the preparation and we were okay with that.  5 minutes later the waitress comes out to tell us that it would be more like 30 minutes as the kitchen had already turned off the fryer....it was not closing time yet, but nearing it - 9pm perhaps?  I thought this was a little ridiculous.  We went ahead and waited as we were still enjoying our wine.  I'm used to beignets being nice and fluffy - these were the texture of hushpuppies...very hard and crispy - you needed a knife to eat them.  Maybe we should've passed given the fryer needing to be restarted?...Our waitress was very nice and the food was great, we just experienced a few frustrating events one after the other.  I'm anxious to give it another try - maybe this was just an 'off' night."], ["Sean W.", "We enjoyed this great contemporary eatery with some great friends. This is a thoroughly modern look and feel, 115 Midtown maintains a warm, intimate atmosphere through soft lighting, rich mahogany woodwork and comfortably spaced tables. The menu is full of variety and is eclectic.We were able to visit during Raleigh Restaurant Week and the selections available were top-notch. I ordered the grilled heart of romaine with an olive tapenade baguette as an appetizer. The dressing was not too creamy and a mix between Italian and Caesar, really quite pleasing. For an entree, I ordered the medium rare Cab Hangar Steak with cashew rice, and spicy hot house sliced cucumbers.The steak was cooked perfectly and the combination of flavors seemed to really work well together.The service was good, a bit slow, but an overall very enjoyable experience."], ["Gregg G.", "I had to go back through my reviews on yelp because I really thought I had reviewed this place already. (Maybe I posted a review elsewhere????) I just booked a reservation on opentable  for a different restaurant and noticed that this was listed there- no review from me there either- and figured it would be lucky to get 2 stars. I am shocked to see it get 4. Really, there is no accounting for mediocre taste. My wife and I met one day for lunch a few months ago in the Spring of 2012, so this is a delayed review, and to our dismay we learned that bonefish grill in the same strip center is closed for lunch, so we wandered around. Panera? No. Want something more special. Starbucks? No. Same reason and packed. Mid-town Grill. We looked the menu over.  Empty and available and seemed pleasant and not a chain so why not because you never know what a non-chain could surprise you with. It was actually so empty that it gave us pause as sometimes places are empty while nearby places are overflowing for a very good reason.It was overall pretty disappointing to ME (see last paragraph). The service was....I wouldn't say 'Bad' ... so much as it seemed like the owners had no idea how to run a restaurant or train their servers...I would say it was very haphazard...the server seemed to have no idea what they had to offer, what was available, what wasn't, what order to bring food to us in, when to refill a drink and it wasn't that she was lazy, overwhelmed or anything. She was doing her best, she just seemed completely untrained but also as if this was not her first day on the job. When we walked in it was dead (more on that later). We felt depressed a place could be so empty except for us and two little old ladies. The server was just untrained and seemed to have no direction.Moving along, the food was very forgettable. All I can recall is that the entree had strips of roasted red peppers and that sold me. When it came and I tasted them, I almost laughed. They weren't LIKE the tasteless red pepper strips i had once purchased at BJ's wholesale club. They WERE the tasteless red pepper stripsfrom BJ's wholesale club. Lacked texture and flavor and the cook made zero attempt to add anything to them, other than that they were totally forgettable.I looked around to see I was one of two males after about a half hour and just figured this is one of those places the ladies who go to lunch go to. And then to my amazement, as the lunch hour wore on, this place began to fill...and fill... and fill... Business people, all kinds of people. Look, in all sincerity,in this rotten economy, if a solo (non-chain) restaurant can make a profit, I really don't care if my review goes unheeded, more power to them. People seem to like it, but it isn't a place I would think of returning to. It wasn't bad, it's just not worth a 2nd trip to me. But if they are profitable, God bless 'em. The bottom line to me is that the food was unimaginative and lacking flavor and texture and the service was a bit lacking, but I certainly have had much worse on both counts."], ["Jameka A.", "Great service each time I go.  The food is great as well"], ["mimi c.", "Things are looking up in the Triangle as far as food goes. My husband, sister-in-law and I tried this place after buying the Groupon awhile back. Between the three of us, we ordered chickpea dusted fried oysters, the flank steak with asparagus, pork tenderloin with cheddar polenta and lamb shank with cous cous. everything was really delicious and perfectly made with care. The flank steak was a little on the salty side, but otherwise, an impressive meal. I would definitely consider this a \"go to\" place for a special night out or somewhere to take guests who come to town."], ["Hy D.", "I enjoyed the decor and the bar tender and staff were friendly and attentive.  The food options were somewhat limited.  Overall, the meal was OK, but pricey."], ["Kristen F.", "Went to this restaurant for the third time as an anniversary dinner.  We had bacon-wrapped scallops for appetizers, followed by a field greens salad.  Hubby had espresso and ancho chili-rubbed steak; I had short rib.  (We skipped dessert because we were too full.)  We spent 6 days eating our way through Napa Valley recently and we agreed that this meal was as good as any meal we had there.  In particular, I had short rib at Thomas Keller's Bouchon, and Midtown's dish was significantly better!  Truly!  The first time we visited this restaurant, which I believe had a different chef at that time, it was just decent.  The past two visits have been outstanding.  Treat yourself and visit this restaurant soon!"], ["David W.", "Run away!!! Service is awful. Drinks were left empty, our bar order took forever to arrive, I'm typing this as I've already been waiting 30 minutes for my check. As an added bonus, it is also overpriced. Walk around the corner to BoneFish and save yourself the money and frustration of this experience"], ["Cheryl C.", "I'd definately rate this as good as it gets.  My husband  and I went here for a our  anniversary.  They were more than accomodating to us with table choice and champagne.  this was unexpected but very welcome.  We ordered more food than we usually get, but the portions were  reasonable and we were able to eat it all.  Everything was wonderful.  the Iceberg wedge was fine as one of the two appetizers,and  the special, a foie gras, was beyond description in the taste it was so good.  then the main dishes - Scottish Salmon filet and Roasted Duck Breast were brought out and we shared them both - we had to,  they were both so delicious with very complex tastes and textures.  We somehow had room  to squeeze in a chocolate torte for dessert - we shared it - and enjoyed that very much.  The intimacy of the dining room  was fine - but not overly  intimate , as we were seated in the back room near a table with a large  number of diners who were out for a business meal.  the food was so good, this did not bother us.  If you like you can eat outside, but you will be sitting next to a parking lot. Prices were healthy, but the food  is so good it is worth it for a special occasion."], ["James S.", "Saturday Evening, June 23 from 7 to 8:30pm.  Excellent food. Good service though we would have liked to have the meal move along a little faster. But then excellent food takes time to prepare.  The the noise level was VERY VERY high. People talking very loudly to be heard over other people talking very loudly. Then at 8pm a (good but) loud band added to the noise level.  This is no place for a romantic dinner or a dinner to get to know your companions---at least on a busy night. Yes, the food was excellent and I will return when a special dinner is needed at a time when the restaurant is not likely to be noisy/busy."], ["Jonathan F.", "The duck sliders are love on a bun!"], ["Ethan R.", "The food, from a menu reflecting regional seasonally available stock, was excellent. Just so the service, which was attentive yet not hovering. My wife & I will definitely return."], ["Dave K.", "Just a quick note to say my wife and I eat here every so often and it is expenseive but worth it. The service is great, the food superior to anything in the area by far, and a relaxed and enjoyable setting. One of our favs."], ["Heather K.", "Amazing!  My husband took me here as a surprise for our anniversary and what a wonderful surprise it was!  We were thoroughly impressed with the food, the service, and the restaurant!  Our server was very knowledgeable about the menu and each special that was offered that night.  She made great suggestions for our choices, we loved that she was able to answer questions without having to go check in the kitchen for our answers.  Our food was prepared quickly and the presentation was beautiful for each dish. Our server was very attentive, but not too attentive either, she gave us our space; but when we needed something, she was nearby!  The other staff was very friendly not only to each other but to all of the customers, even if they weren't waiting on them, they seemed to know the 'regulars' and would stop by to speak to them but were not intrusive either.  The ambience was great, it is a simply beautiful restaurant that is tastefully decorated.  I would recommend it to anyone who is looking for a great meal for a special occasion."]], "Latin Quarters": [["G. P.", "2-days later and I'm still thinking about my meal at Latin Quarters. Hay comida es tan bueno! Best meal since I've gotten back from Miami."], ["Tony U.", "$9 for a shot sized drink.Food was Average for a high price.I have had better from many places.Very disappointed, atmosphere was very bad as well and some 2 year old was shouting the karaoke mic?Go somewhere else if you want above average food."], ["Adrienne D.", "Went out to eat here for the first time tonight. The decor is nothing too fancy but nice inside. They had a reception of some sort on one half of the restaurant, which we actually enjoyed because they had a great Spanish band. The service was timely, and our server was very friendly. We asked his opinion on some of the menu items and he was honest about what he liked and what was popular. We had an appetizer that was dried plantains with ceviche on top! It was delicious and a good portion size! My friend had a tamale dish and I had Arroz con pollo. Both were beautifully presented and huge portions! The Arroz con pollo was enough for me to have at least 4 meals!! They were both also very tasty! During our meal a nice gentleman (who must have been either the owner or manager) came by to check on us. He then came by at the end of the meal to make sure we enjoyed everything. What we found to be most amazing was that he actually asked if we had any feedback or suggestions....it showed they really want you to leave happy and are open to customers opinions. I've never had anyone do that...and I worked in the service industry for over 10 years! I will absolutely return!"], ["Ronny B.", "My wife and I went back in the spring and were not just disappointed, but enraged.  It was a week night and all customers were crowded over in a single section, and the noise level was terrible due to the live/karaoke singer.  My pork chop was burned to a crisp, less than a third of it was chewable at all.  Wife's beans and rice were very average, and were the highlight of the meal.  The waiter was inattentive and unconcerned about it, and appeared very inexperienced, like maybe he was one of the waitresses' boyfriend who just happened to be there.  In fact there seemed to be no real adults about on this particular night.  It took two reminders just to get a beer.  When we were finally served, the entree came out first, and was cold.  The empenadas came out later and were hot.  I asked the waiter if he knew the order in which a meal was supposed to be served and he blamed the kitchen.  This may have been part of the problem, as there was no food being served for a long time, then a lot all at once, but our waiter and other staff seemed to be doing a lot of aimless wandering about.  I did not send the appetizer back because that was the only thing that was edible.  Did I mention that it took forever to get attention/service/drinks/food/water?  The sole reason that I did not make a scene and walk was that I was there on a Groupon and so was already invested.  I had a rather firm conversation with the waiter when it came time to pay up, but did not stiff him by any means, as I have worked in enough bars and restaurants myself to know that he was not the entire problem.  No one would admit to being the manager.  I certainly have not been back and, in order to avoid getting caught up in any similar situation, I have not bought a Groupon since, nor will I.  I used to travel a lot in my work and am an experienced diner, and this was without doubt the worst experience I ever had in a restaurant."], ["Erica S.", "So, LQ is definitely sub par. I wasn't expecting it to be like Marmalade in San Juan, but for a mid-priced establishment it was disappointing. The friendly staff is their saving grace. In a fair review, upon being seated I was directed to a dirty booth that had not been cleaned. So she promptly directed me to another. I ordered the empanadas for a starter. They are good, decent even, but then I cut into one only to find a bone ... about an inch long. Thank goodness I eat with a knife and fork. A child could easily choke on something like that.Meanwhile, my entree came out and the servings are large ... but the chicken tasted like rubber and it was not seasoned... very bland. The rice was good, and the plantains were decent. The staff has clearly not been trained, given the server removed none of the plates from my table. Instead they were allowed to pile up. Finally I ordered dessert. Big mistake. The portion is huge, but it is very heavy in terms of consistency. I prefer a light and fluffy tres leches. This was not the case. Unfortunately, the food is sub par and it did not feel like a clean establishment. Will not return."], ["E S.", "Great service, great food. Not quite \"comida de la casa\" but close enough. -The food is well seasoned but not over-powering so it will appeal to the masses.-The service is among the friendliest and most professional I have ever experienced.-Nice atmosphere."], ["Samster A.", "Finally got to try this place after stalking it on Yelp for months.  I love the decor, reminds me of my old apt in Miami.  The food was great!  I got the pernil with white rice and beans and my bf got the chuletas.  Definitely coming back for the music and passion fruit juice."], ["Ian Maren C.", "So we went here after a craving for empanadas. We had recently been in Argentina and were just craving them.  Place has nice decor, large bar, and a huge dance floor for bands and dance nights.  If you get there before 10 you can get in free for events otherwise there is a cover charge.We got the empanadas beef that were just delicious and very fresh!  They gave complimentary plantains with some dip that was delicious.  We then got a dish and I can't recall the name :(  It was good nothing bad but don't think I would order again.  But if I had to eat it I wouldn't complain.  I think its just a personnel preference.  We got Caipirinhas one regular and one with strawberry. They also made them with splenda for us and they were amazing plus a great price.  The service was excellent.  The server was super nice, very friendly and informative.  Place wasn't too crowded but I am gonna guess if its like South America everyone comes for a later dinner.  Looking forward to going back again.Food is made fresh and too order so be patient."], ["Fonda S.", "Chose Latin Quarters with friends because of a coupon. What a delicious adventure;"], ["Steve P.", "We went for lunch on a Sunday to give Latin Quarter a try. We didn't know there was mainly a buffet on Sunday lunch. When we first got there, we were told by the host that it was buffet only but they had their best dishes out on the buffet. I thought I'd give it a try even though I am not a great fan of buffets. My friend looked at the buffet then begged to order off the menu. I wish I did the same. However, I tried his chicken & it wasn't much better than what I got off the buffet for less money. He got a lime marinated chicken that was pounded very thin & grilled with onions. It had a nice flavor but I thought it was cooked a little too much leaving it a bit dry. I got a variety of things off the buffet. Unfortunately, they weren't labeled so I'm not sure what to call most of the dishes. There was a sausage that tasted like a typical smoked sausage. There was a bland potato dish that I tried 1 bite of & threw away. The fried bananas were good. The pulled pork was seasoned well but was loaded with large chunks of fat which I left on the plate. There were fried fish pieces that were a little over cooked & dry. There were chicken tenders that were pounded flat & crispy but were cooked in the same oil as the fish & tasted of fish. There were 3 types of rice. The one I tried had a few shrimp in it but the shrimp were over cooked and hard. The rice was pretty bland. I tried the red beans, which were very soupy, and not very flavorful. This wasn't a very good dining experience. I usually try to go a few times to a restaurant before writing a review, but this is going to be a single visit restaurant."], ["Stephalie C.", "I really enjoyed this place .. I've always refused to spend money on Spanish food because my grandmother has the best cooking but this place is worth it !! super flavorful !! will stop by again"], ["Allyson S.", "I want to give another kudos to Latin Quarters. Since I posted my first review two weeks ago, we've been back three more times. Each time we have tried different menu items, and have enjoyed the authenticity of their cuisine, Puerto Rican, specifically. These owners go out of their way to make you a satisfied customer. On our first return trip following my review, the owner Julio came out to our table and spent several minutes talking to me and my husband, expressing his gratitude for our business. And at the end of our meal he treated us to desert and took a percentage off our bill. He didn't have to do that, but he did because he cares about his patrons and is a smart businessman. Do not go to Latin Quarters with the expectation of having your food prepared as Americans would prepare it, and then complain when it's different. It's ethnic cuisine, it's supposed to be different. Enjoy it for what it is - bursting with flavors that most of us cannot mimic in our own kitchens.And no, I don't know the owners, and there was no incentive to write this follow-up. I just appreciate what they're doing in their kitchen, and want people to understand that what they are creating at LQ is very specific to their culture, and is not meant to resemble ours. So go and enjoy!"], ["Julio V.", "Been here twice and had two meals that reminded me quite a bit of my mom's cooking. Very authentic Puerto Rican fare and the drinks were marvelous. It's difficult to do Puerto Rican food well consistently and I've not been disappointed yet. Definitely will return and I plan on trying everything on the menu. It's quickly become one of my favorite spots."], ["Charles M.", "We sampled across the menu; steak, chicken & pork based on our waitress' recommendations. It was GREAT.  Good food, good drinks, good music, good service.  Nice way to spend an evening."], ["Carolina R.", "Had dinner at this place a couple nights ago and was disappointed, mainly because I grew up in South America and have high standards for food from my area. It says on Yelp that it has Argentinean food but I only saw one Argentinean item on the menu (the choripan). I tried to get morcilla but they didn't even know what that was. The Drinks: The mojitos were expensive and weak. The Food: As an appetizer, we ordered the ceviche with the tostones. That was probably the only dish I liked. It was a bit expensive ($11) but the portion was generous and fresh. We shared the mofongo with fried pork. The mofongo was alright but the pork chop was tough and dry. For a Latin American/Caribbean place, they should really know how to cook meat!The Service: The server was polite but a terrible communicator. For example, we asked for the mofongo with the fried pork, but instead of fried pork morsels, he brought a pork chop. We ordered a side of chicharron, which he should know are pork rinds, but instead he brought another pork chop. He told us that is how they make chicharron at Latin Quarters. The side pork chop cost 8 dollars, and we felt bad about sending it back, so we paid for it and took it home. Conclusion: If you are Latino or Caribbean, you will know this place is not the real deal. I was surprised to find out that the owner is actually puerto rican. Tips: if you order the mofongo, that's a dish to share. The ceviche with the tostones is actually quite large for an appetizer. Don't get the mojito unless you're a light weight. Ask that they cook the meet medium or medium rare if you order beef."], ["Jose V.", "The food was incredible, the atmosphere was comfortable, drinks were great and just an overall great vibe, a great chill spot!!!"], ["Holly R.", "Moving to NC from NY and finding an authentic PR restaurant was exciting. Trying the food and being reminded of my husbands families cooking was priceless! The whole family loved each dish we tried and we will definitely become regulars here. The atmosphere was exciting, would love to back for one of their live band/salsa nights! Great food, good service, worth the money!"], ["Mike M.", "Came here because of a Living Social coupon.  To the point... I think the insides have been under renovation since the roughly 2 years ago we last went.  We were virtually the only customers there.  The fries were very good.  The steak in the sandwich could not be cut with human teeth while in a sandwich- we both had to pull the steak out of our sandwiches and eat it separately,  The server was courteous and a waitress not waiting on us was very kindly sociable.  Our server tried to be very upscale- acting, meanwhile the friendly one who was working on processing a check right beside our table called over to someone else asking her if she knew how to do a certain type of transaction, almost standing over us.  The amount of salt in the food had me up in the middle of the night, however many restaurants do the same.  The quality and quantity and value were just as the 2 star descriptions says.... Meh, I've experienced better.  Doubt I would go there without a coupon in hand, but there was no disrespect shown on account of the coupon, as you occasionally will read is the case with restaurants."], ["Tina G.", "Everything we ate tonight was excellent. Definetely coming back for sure. The pork chop was hugh and very tasty, the Ceveche was extremly fresh, and the steak beans and rice were prepared to perfection. The atmosphere was very casual. The service was fast and the waitress was very friendly. Can't wait to come back."], ["Massimiliano C.", "First of all, I know puerto rican food pretty good, I travel to Puerto Rico often and I'm from Panama. Let me start with the mofongo. This is a difficult dish to acomplish, is like what Pizza is for Italians. It was good, not dry, moist. Big portion. I ordered with pernil and it was also very good. El pastelon, I didn't like it much, but everybody has a different taste. The alcapurria was good too. Last, the tres leches, I was probably expecting something a little bit different. Take in consideration, this dessert is at the base of a long time dispute between different countries saying is their tipical dessert. That means different versions. Service was very good. My only critic is the place. Maybe just a quick makeover to the tables, chairs and ambiance will make it a 5 star. And the smell of cleaning products was overwhelming. Overall good and I will be back."]], "Rancho Grande": [["Mary A.", "Simply awesome food. This place is as good as it gets if you're looking for great Mexican food. The tacos are the main attraction, in my humble opinion. Great sopes too. Simple, clean, and true flavors. :)"], ["Josh W.", "My favorite Mexican place in Cary. Go on the weekends and try the soup on a cold night!"], ["Jordan C.", "Best tacos in Cary and possibly the cheapest. That's just the start as the rest of the menu is great too!"], ["Geoff G.", "Definitely one of my favorite taquerias in cary/raleigh. The goat is outstanding, as is the lengua and cabeza. Believe it or not the reconstituted pork skin tacos were REALLY good here. They always have ceviche but the weekend is the time to go for more options. I rather prefer the ceviche de pulpo. Too, be sure and try the whole fried tilapia. Almost as good as at Los Comales!You're definitely not going to want to take a prom date here. But I took my brother and his family from out of town over the weekend and they loved it. The fixin's bar has a lot to offer and the hot sauces are VERY good. Salsa picante is fresh and just spicy enough.Pupusas, gorditas, tamales are all delicious here; but be forewarned that the tamales are cooked bone-in (read my dental review from earlier; it happens). Great tortas as well.Not a big fan of their horchata, and I love horchata.Finally, the family that runs this place could NOT be nicer. Even if it's your first time in an authentic taqueria, don't be timid; the couple speaks enough english to walk you through the menu and get you where you need to be: delicious town!"], ["Justin P.", "At some Mexican restaurants, I get a burrito and at other places I will get enchiladas. However Rancho Grande is where I get my taco fix. There are many different options and combinations of tacos to choose from, but I always get the steak tacos or in Spanish, Asada. I am able to get 2 of 3 tacos because an individual taco isn't too expensive. It's like $1.50 for each. When they give you your taco, it is just plain. However you can go to the salsa bar and add some tomatoes or lime to your taco. I eat my taco plain and I still think it tastes great! The steak was tender, juicy, and well seasoned. It was a perfect taco. I also love drinking their Horchata. Horchata is a rice drink that is very sweet with a hint of cinnamon. They make their Horchata extra sweet. Although on the outside, Rancho Grande doesn't look like a restaurant, the inside is a great place to get some tacos!"], ["Amy B.", "Yum!  Great food at a great price.  Friendly service, and a very very clean kitchen.  I always have had a good experience here.  Love this place!"]], "Oakwood Café": []}