{"Sushi Nine": [], "Sushi Blues Cafe": [], "Shaba Shabu": [["Erin N.", "Went here months ago with my boyfriend. It was a great place! Lots of options for lunch and dinner. The miso soup was awesome!! The interior decoration was they classy and very sleek looking I enjoyed it. The wait staff was friendly and attentive. I don't remember what I ordered all I remember was that it was really good and I definitely will/would go back if i'm in the area."], ["Leigh H.", "Still a one star review. I want to update this with some additional information. In my initial review, I had an issue with the way the sushi (BOGO) was billed. To quote my earlier review:\"Came with a large party (10ish or so). Was told by the server that all the sushi would go on one tab but that they could easily split things up for us to pay individually. Ok. I order sushi as does one other person. The sushi is BYGO free. Standard.My rolls were 8.90 and 12.90. The other person's rolls were 6.90 each. Now, when I ordered I assumed I was paying for my 12.90 roll but my 8.90 was the free one. Nope. Not the case.They put all the sushi on one bill and then drop the cheapest. What this means is it's not about you and what you order but about how your group as a whole orders. I took the bill up front and asked to speak with a manager. I explained what our server told us. Manager basically says that the policy is the policy because it's the policy. And apparently justifies this by saying everyone else in town does it this way too.\"I recently went to a different sushi restaurant with a part of 12. They also had BOGO sushi. Remembering my experience here, I asked our server how the BOGO would be done. I tried to explain how it had been billed at Shaba Shabu, and asked if this was how they did it. He said no. He explained that the sushi I ordered would be on my bill and my bill alone. So, when I ordered two rolls (each was about 15.00). My second roll was free regardless of what others at the table ordered.So this statement from the Shaba Shabu manager that everyone in town bills the way they do - questionable at best. Maybe some other places do - but not everyone."], ["Arvid Y.", "I came here for a post-exam lunch. Shaba Shabu is a great place for lunch. They have daily $5.99 lunch specials and also buy one get one free sushi rolls (range from $7-17). I ended up getting the Diablo and Fish Lover Rolls. They were both good, but not great. Fish quality seemed decent and portion sizes were good. The sushi also came out quickly, which was another plus They have about 50 different types of rolls to choose from. While variety is good, choosing from 50 can also be a little difficult. Oh well, first world problems.Another plus is their draft beer selection. Visiting North Carolina for a few days, it was nice to try some local beers on draft. They also have nightly drink specials.Overall, Shaba Shabu is a solid sushi option. The interior decor is also nice and modern. Of course it's a Japanese-Thai fusion restaurant, so don't expect the most authentic Japanese fare. A lot of the rolls are pretty \"Americanized\", but I am not hating on that. I'm sure there's something for everyone.*3.5 stars*"], ["Suzanne B.", "I have been going there for 3 years. The food is high quality. The restaurant is very clean including the bathrooms. Last night when my girlfriend tipped over her ice tea the wait staff came over immediately and cleaned it up with a mop. The dinner prices are affordable."], ["Rodney M.", "Now one of my favorite places to eat. The owners and employees go above a beyond every time we visit. I love the vegan options and they even make special dishes just for us when we request them (we asked about brown rice and they added it to the menu). The cocktails are some of the best in town and the atmosphere is so refreshing. We go at least once a week. I'm so glad Shaba Shabu is here in Raleigh. I am a fan."], ["VA W.", "Lets seek for the good stuff first:Interior, nice and posh.Atmosphere is good. Front door greeter is good.Food, Whoa, I had the worst stomach/digestive issues following lunch here. Maybe my expectations were too high as I had no breakfast that morning and came with a hunger. I had the $15 three course lunch meal which consisted of salad, veggie and seafood mini rolls and a rice a tofu dish. Maybe the fish was not fresh but following lunch like 10 minutes later I was in the bathroom. My tofu was white in the middle and not fried all the way through... I would not recommend."], ["Joy Y.", "The three stars are for interiors, atmosphere, and service.  Haven't tried their thai dishes, but the sushi we ordered were not good, I would say below the average, the rice was hard and fell apart, the soft shell crab inside of our spider roll was cold and soggy, not crispy at all.  The appetizer we had was seafood roll, $6.90 for three finger-thick rolls was pricey, I would not recommend."], ["Gregory H.", "Where to take my bride for our 15 year wedding anniversary and it has to be somewhere close to where our daughter has gone for a swim outing...  After looking over numerous reviews, I decided not to set my expectations too high and just see what dinner brought.The 3 course dinner option for $20 was/is a great value!  Salad or soup, appetizer and main course.  It can get a little spendy when one adds drinks/dessert.She loves Thai, I love Sushi.  This worked out great!  The sushi was fresh and the wasabi was smokin'! The appetizers (like I knew what they were) were great.Ambiance is cool, agriculture themed in the dining area we were in.  Service was attentive, making sure our waters were kept filled and inquiring for more drinks as our wine/beer showed itself as empty.Dessert was also worth writing about.  Tempura cheesecake - mmmmm!  Great dinner at a great value!  Looking forward to doing it again."], ["Anthony P.", "Catching up on reviews. This was for a visit in September '14I was very excited to find a restaurant that offered shabu shabu in the area. It's one of the things I really miss from the Bay Area, CA. Unfortunately, this place did not meet my expectations.Value$25 for the cheapest meat option (NY Steak). My friend and I opted to try the kobe style beef for $37. You get one small platter of meat and some veggies. I get that this area doesn't have many places that serve this kind of stuff, but I'm used to paying $18-20 for a bigger portion. $37 puts you in the range of AYCE places in CA. QualityThe beef was ok. Not as marbled as you would expect from a kobe style beef. Dipping sauces were good. ServiceNothing outstanding to call out. My pot was not heating up very fast, and the waitress misunderstood me when I tried to tell her and turned the heat down. Discovered 10 minutes later when I was trying to cook beef in warm water. Misc.The pot doesn't look like it was sitting on an induction style stove. Might have been the reason for the heating issues.  The other thing is that the cooking pot was so far in front of us that we both had to stand up in order to reach into the pot...a minor issue but was very weird. The one thing that I really enjoyed was the banana tempura a la mode. Can't really go wrong with a fried banana topped with green tea ice cream. I might eventually go back to try the sushi, but it's hard to justify when there are so many other restaurants in the area to check out."], ["MJ A.", "I'm reading these other reviews and think it's first important to start by stating the obvious: There are two types of sushi restaurants.  There's the ultra-authentic and expensive restaurant with a Japanese owner/chef who's gone through years of training and has 20 years experience in the art, with a menu that would intimidate the standard American palate.... and then there's the run of the mill sushi restaurant that has gone through the typical Americanization of the menu to appeal to the masses. You can't rate these two restaurant classes together because they are clearly in different leagues and even differ in what is typically offered on the menu. With that said, Shaba Shabu caters to an audience of the latter and in all honesty, hit the spot on two different occasions. The restaurant is just across the street from the Courtyard, so it's easy access for those of you who stay at the hotel. Tuesday night I decided to try their pad thai for take out. While the dish was average, their prawns were as fresh as they come--so kudos there.  Thursday night I decided to dine in and try their sushi.  I ordered a Hamachi nigiri, Okinawa roll, and Tar-Heel roll. Everything was delicious on various levels: fish was fresh, tempura fried perfectly, and rice was seasoned well. Coming from California I wasn't expecting to be impressed by the meal, but can say that this was one of the better sushi restaurants I have had while traveling on road. The beer selection on tap has a ways to go, but you can at least get an average IPA with your rolls. Also, the service at the front desk and bar were exceptional."], ["Laura G.", "I do not know why it has taken us 10 years to visit this restaurant. I think of all the lost sushi opportunities we could have had. But alas, we now know what a wonderful restaurant this is. Let me start with the drink special on the night we went. You got a bottle of champagne and  a carafe of orange juice to make mimosas at your table for $15. What a deal. Then we both had the three course dinner for $20 and shared a killer piece of coconut cake for dessert. A wonderful meal of delicious food and great service."], ["Johanna S.", "Shaba shabu is one of my fav restaurants. They have amazing sushi, thailandese dishes, and spectacular deserts. I love the pineapple fried rice, and the Kobe beef has always been cooked and served deliciously not mentioning the beautiful presentation. Some of the friends that I have brought to this restaurant have  the same opinion. Keep it up Shaba Shabu!!"], ["Tricia A.", "This used to be our favorite restaurant but that is not the case anymore. I don't even know where to start we were brought sushi where the salmon appeared to be cooked, the waitress had to ask me how to make a sakitini (the signature drink) and the service was just so-so. The thai basil recipe has changed and tasted like soy sauce from a frozen meal. $59 down the drain. I am so shocked at how badly it has declined that I really don't know what else to write. There was nothing positive about the experience and it pains me to write that. Needless to say we do not plan to return. :-("], ["Jinju K.", "I came here for Valentine's Day and I was highly impressed. We made a reservation for 6PM and was seated as soon as we walked in. We got the 4-course Valentine's Day dinner for 2 deal, which came with an appetizer, first course, second course, and dessert. The total was $55 for two people. Because of the great price, I expected it to have small portions, but it was definitely more than I expected. I ordered the salad with ginger dressing for the appetizer. For the first course, I ordered the Thai appetizer sampler. This plate had a total of 3 types of appetizers (2 of each) with a variety of sauces for each one. I loved the presentation of it! It was very simple and cute. For the main course, I ordered Chicken Pad Thai. I'm a huge fan of Pad Thai and I was not disappointed with the taste! For the dessert, I had the Cheesecake Panko Tempura for dessert, which was very delicious! The tempura crust balanced the cheesecake very well. Despite it being a busy night, the service was great! Our waitress attended us very well and explained the menu really well, too. The only thing I disliked was how dark the eating area was. I would definitely recommended this restaurant! I am looking forward to going back again."], ["Thomas M.", "Ordered take out.  Miso soup, good, seaweed salad, good, bogo rolls, spicy tuna and eel, poor.  Bogo gets you two rolls that are both made with half of the main ingredient, mostly rice and they are small.  No deal here.  Could not taste any eel as it was almost non existent.  Spicy tuna was with just chilli powder.  No creativity here.  I was disappointed.  Not likely to return."], ["T. W.", "Came here for the first time with my hubby for lunch today.  Food was prepared perfectly and beautifully displayed. Will definitely return."], ["Heather M.", "The moment we sat down, we were surprised by a furry dog the people sitting behind us brought in.Is that even okay??!Anyhow, we told them we were going to do shabu shabu and a couple sushi rolls.I guess our first server was new because she had seated us in the non-shabu shabu area. After we got seated and were sipping our drinks were we notified to move to the shabu shabu area..... *facepalm*...so we moved. The place we were moved to was dead empty, yet we were seated at the table with a dirty rag. What?!Our second server was extremely slow.We got the ny and seafood shabu for 2 as well as the rainbow roll and the salmon crunch roll.I wanted to get the mahi crunch roll but apparently they ran out. Our rolls were tiny AND they came out sloppily made/falling apart.Cooking the shabu shabu was flustering because we couldn't reach the hot pot- they are stationed at the very end of the tables. My dad got annoyed trying to reach the hot pot so he just got up, stood right by it and ate standing up haha.Our server rarely came which bothers me more than usual because it was such a slow evening. Oh but when she did come, it was to give us our bill.Food was a-okay. Service was horrid. Experience was no bueno. Was it worth the pricey bill? We know the answer to that question."], ["Kelsi B.", "I was in Raleigh for work and this place was right across the street from my hotel. I also saw from other trusty yelpers that they had BOGO sushi so knew I just had to try it out, however I was left very disappointed.I guess I probably should have expected mediocre sushi for a BOGO deal (and I had takeout), but the quality was even below that. I tried the Okinawa roll and Spicy Tuna roll. Both were wrapped very poorly and fell apart in my hands. All I could taste in the Spicy Tuna roll was the spicy sauce, no taste of tuna whatsoever. The Okinawa roll said it there was shrimp tempura inside, however mine was cold. It was so weird, I've never had cold shrimp tempura before and I don't think I ever want to again. The bartender was nice, however the couple next to me waited far too long for him to take their drink order. You could also hear him arguing with a server very loudly which was not pleasant to witness. All in all, Shaba Shabu leaves a whole lot to be desired."], ["Fred B.", "I have to say, it was so good, I went there on two separate nights.  My first night, I arrived late and was starving from travel.  Felt like some sushi (Hey, I get to expense it!!!) so sat at the sushi bar.  I was the only one in the room, but I enjoyed the quiet.  Turns out they have a BOGO menu!! I ended up getting 4 rolls for the price of two, which put my tummy and my wallet at ease.  The freshness and quality of the rolls was solid, and I was on board immediately.  I definitely recommend the Shabu roll for sure.  The next night I came with coworkers and gave the Thai a try.. WOW!!!  Their Red Curry was outstanding!!  I was hoping for leftovers, but I couldn't stop shoveling it in.   As for the place itself, very clean, and broken into 3 areas that I could see.  My first night was the Sushi bar side, with Islands to sit at , or high tables.  The middle and other sections were restaurant style seating with roomy comfortable booths.   The wait stafff is very accommodating, even if you're a table full of smart alleks!!!  Our waitress looked a LOT like Jodie Foster and one of our guys just couldn't let it go.. ha!!.   I know I have more training down there, and if I end up at the same hotel, there is a lot of menu that I have yet to explore.  Need to get down there soon!!!"], ["Anne O.", "A very nice place... in the middle of a strip mall. Great fusion of Japanese and Thai. We've been to both countries and they do a good job. I got the Japanese lunch menu, and my husband the Thai, so we both got a bite of everything. Yes, we'd go back."], ["Ted J.", "I generally agree with the saying \"if you don't have anything nice to say don't say anything\". So I'll start with the nice: The people I went with are awesome. And they were funny and the rest of our evening was a blast. Now, as far as Shaba Shabu goes...wow. This was a train wreck from start to finish. We were seated at 7:15pm and ordered drinks. Which promptly arrived. Just kidding, we didn't get them until 8:20pm after our 3rd lap wandering through the restaurant looking for someone to help us. We were repeatedly told it was just \"one of those crazy-busy nights\".  The other parties who came in after us, ate and were leaving as our drinks were being poured, you ask? Apparently they were there on a different night. It was definitely not nearly as crazy for them. So by 8:45pm everyone was feeling pretty lose from the first half of their cocktails when dinner arrived. Sure it was cold and by now no one had any recollection of what they ordered, but as I mentioned it was one of those crazy-busy nights. I think we can all agree that on a night like that having someone (mostly) cook a meal and bring it to your table is going above and beyond. Minutes later we are presented with our bill. Purely a coincidence that this is the only remotelyefficient part of the process. After all the waiting and the mistakes and the fact that I felt like I was filming Taken 4 with Liam Neeson as a tried to hunt down someone to find our drinks, you can't imagine how relieved I was that our bill was correct! And nothing had been adjusted to make up for the disaster of an evening. When I thanked our waiter for his billing accuracy and then insisted to thank his manager they went above and beyond by offering to remove...wait for it...and entire round of drinks from our bill. Hello?!? It's not my birthday!! I felt like I was holding one of those giant fake checks and confetti was falling all around me. This was my lucky day. So we couldn't not speak to the manager who was only now freed up enough from his busy night to come to the table and ask what the problem was. I reminded him we had met 90 mins earlier when I was wandering through the kitchen looking for our drinks. It was good to see him again. We told him he could keep the bills as souvenir of our wonderful evening together but he insisted otherwise. The wise man that he is he didn't want us to leave without imparting a life lesson on us: \"I'm sorry things don't always go your way\". Those words stuck with me to this day, all these 3 days later. \"I'm sorry things don't always go your way\". So true. So. True."], ["Nancy Y.", "I've been to Shaba Shabu several times over the last few years, and the business model has changed quite a bit since my first time. Several years ago (~2007), the restaurant was split between traditional dining and Japanese hot pot (shabu shabu). I had the shabu shabu back then and loved it. Tasty, clean broth and fresh ingredients.As of late, the restaurant has remodeled and become much more loungey with a contemporary feel. I've come for after work drinks and appetizers and again for a sit-down dinner. My experience has been very different for these two occasions. I really enjoyed coming here for cocktails. My friend and I sat at the lounge bar and got drink recommendations from the bartender. I tried a few concoctions, and while the ingredients didn't include fresh-squeezed juices, they were still tasty and refreshing. We got appetizers with our drinks - gyoza and tuna tartare. While the portions were small for the price, we really liked what we got. (3 stars)Dinner was another story. I think the Japanese and Thai foods are not authentic at all. I got the phad kee mao. The dish was drowning in this dark sauce that masked the flavor more than enhanced it. It just should not have been. Was the portion size awesome? Yes. Was the service good? Yes. Would I rather have had Sawasdee? Yes. Of my party of three, we had 1 thumbs up and 2 thumbs down. (2 stars)This is a review of averages. I really enjoyed casual bites here, but probably won't be back to try the rest of their dinner menu. (2.5 stars)"], ["Hannah K.", "They have everything here! They've got sushi, shabu shabu, and thai food! I had a friend who was driving through and was in desperate need of some kind of Asian - I suggested this place and a couple others and they were more than excited to try Shaba Shabu! We were all going to order shabu so we sat at the bar. The broth - it comes flavored already - it's not like the traditional Japanese shabu where you cook all your veggies and meats in water - which I didn't mind! You get a variety of vegetables but for $25 I would expect a little more vegetables to be completely honest. I know I shouldn't hold it to the standards of LA, but I could easily pay $16 and have received double the meat and twice the vegetables and you get a choice of broths and a sauce bar! But keeping in mind that it's Raleigh I would probably come back if I was craving Shabu Shabu and didn't feel like making it at home. If you like shabu then I would definitely go here for it - I thought the broth was tasty and the service was great - which is why I'm giving it 4 stars!  I didn't get to try their sushi or thai food but I'll willing to go back and try!"], ["Josh P.", "Had some decent sashimi and nigiri here, but the prices were a little high. The Thai iced tea is a really small portion. Service feels a little slow and the wait staff seemed confused about who had what table and which customer ordered what. However, the entree dishes win me over. The soft shell crab curry is delicious and my wife's pad see eew looked amazing."], ["Laura C.", "We made reservation at 8 but arrived 20 minutes early and we only waited about 5-10 minutes. Staff super friendly and professional. We ordered bogo rolls for appetizer took a really long time, but waiter kept water filled and was good about checking in. Rolls were very good especially the shabu roll! My sons and I had the fish they had mahi and I had sea bass . All delicious. We shared a piece of choc cake that they comped us for the long wait for apps and entrees, it too was very good. We were there over an hour and a half but weren't in a big hurry so it was fine. Great food, nice atmosphere!"], ["Whitney H.", "I had my first meal at ShabaShabu in the fall of 2005 and it has been one of my favorite restaurants ever since. The sushi is fantastic (especially the wolfpack and phat rolls) as is the Thai food (though normally I stick with the Japanese fare). Servers have always been very attentive, and I've never had a bad word to say. Recently they've added a buy one - get one sushi option and have a great specials, such as the couples option (one bottle of wine, 2 entrees, a dessert for under $50). I highly recommend checking out this great spot!"], ["Rod O.", "This place is Totally Beautiful !  Simple, Modern Interior!  Minimally Decor!  Someone did a Great Job Designing this!  Bar looks Great with Big Screens in case you want to watch what is going on somewhere else? I Guess????  Ambiance is NOT factored into my Overall yelp star rating of most Restaurants including this one! Steel Chopsticks!  Very Easy to use - Incredibly Efficient!  Cool Idea!  WATCH your teeth!!!  Using these once in a while would be ok for me... You can use you own Judgement on that and tell your Dentist \"Rod0 warned me\"!  If I were a Kleptomaniac I would have left here with none less than TWO Pairs and I would have wanted 10 (pairs)!Red Curry for me and Pad See Eww for my Date (the Bride).  We ordered her dish spice level 1 and mine 2... As in many Thai Restaurants, two is more spicy than many Americans want, it was perfect for me, my Wife could not eat much of hers so I ate almost all of Both.... Red Curry with Chicken and Extra Thai Basil, Minus all vegetables... This was a Nicely Flavored Curry and what I would expect, the Spice level was perfect for me.Pad See Eww was way too Spicy for my Wife and WAY too Sweet for Both of us!  So What, except the Flavor was so poor, about 2 yelp stars and that is LOW enough, though they could have left off the Sauces Decorating the plate, these did make the Dish slightly better looking though the Sauces did not add anything good to the flavor, they did the OPPOSITE!  I have only eaten Pad See Eww in two or three other places so maybe it is supposed to taste like that???  I'm basing my Overall Star rating on the Red Curry and Not both dishes nor how Great I think the place looks!Green Tea Ice Cream... this version is the VERY Strong Tea Flavor and Not Overly sweet!"], ["Shruti D.", "Always my favorite! Why not do the bogo take out for sushi or their weekly dinner specials are really good! I love coming to this place. One of my old favorite thai/sushi places. Being a , it's always boring getting sushi from other places. I mean, how many times and I going to eat rice and avacdo? Shaba shabu has a small veggie sushi menu! They are all fun... spicy roll, sweet potato roll, cyber roll, kale roll and so on! To top it off, it's bogo! What a great deal! Thai --- basil fried rice and kee ma gao are all my favorite!!!"], ["Rebecca B.", "I go to Raleigh about once a year for work and always make sure to stop here for dinner one night! The vegetarian sushi is great and the staff are very friendly. Love the Kale Roll! I got the arugula salad roll this time too which was also very good."], ["Jay R.", "A must stop on way back from Atlanta.Always great food and service.Walking distance from Hampton Inn which gives you 10% off bill."], ["Tammy P.", "Good place to have sushi and beers! The Only thing I don't like is that they close early on the weekend ( 10 pm )"], ["E K.", "I love it. I love the bogo rolls even though I never go to bogo places, and their Thai is legit."], ["Santana D.", "This is the first place I had pad see ew, and it was the first time I knew true love.  this place has a smokey rich romantic atmosphere especially at night that makes the whole experience just a delight.  I love to take people here who are new to town or people who just enjoy a nice finer dining experience without needing to take out a mortgage.   Shaba Shabu also has a sushi bar as well as separate Japanese style sitting rooms which is perfect for private gathers or birthdays!"], ["Y I.", "Beautiful Atmosphere :) I enjoyed the food very much as well as the BOGO rolls! I seriously love their sushi so delicious & I feel so fancy being here haha"], ["Tony T.", "We ate here during the U.S. Open at Pinehurst.  We had sushi the first night and came back to have Thai food the next night.  The food was great and the staff was very friendly and attentive.  Gotta try the coconut cake for desert."], ["Justin H.", "Excellent food!- My wife had the Pad See Ew, an entree i will definitely come back for. My chicken red curry was just enough heat and not too coconut- milky.  The server was friendly, timely and not afraid to make recommendations. I ALWAYS ask for recommendations & 9 out of 10 waitrons have problems with that question. The place is clean, tastefully decorated and had the best beer list for a Thai place"], ["Candy J.", "Staff was incompetent, never visiting our table after we got our food. We were visiting Raleigh so wouldn't be back anyway, but save your money and hit The Cowfish!!! Waaaaayyyyyy better bang for your buck and better quality food."], ["Margarita P.", "Food is excellent and portions are great. The menu is a bit confusing, but they followed my complex order perfectly. On Easter they were open and only with 2 people working; but worked very hard and were very friendly. Will come again."], ["Becky F.", "I saw the good Yelp Reviews and the sign out front boasting \"$5.99 Daily Specials!  BOGO Sushi!\"  and thought it would be a fairly inexpensive stop for lunch.  That was misleading!!I went in by myself through the finger-printed glass doors to a pretty fancy place.  I was faced with a Hostess Station that was empty.  Rather than standing there awkwardly I stepped around and saw a dining room on the left, and a more casual area on the right.  I took a seat at the Sushi bar, still a little confused about the seating situation.  I went back out to the Hostess Station and found a Waitress sprinting by to ask if I seat myself or wait to be seated.  She looked concerned that I was a customer on the loose.  I showed her that I wanted to sit at the Sushi Bar and she agreed I could sit there and gave me a menu.I sat for about 10 minutes before anyone came back, and it was her, still very rushed and apologetic for the wait, but with a glass of water.  I'm sort of glad she waited so long though, because I had a really hard time with the menu.They have ONE Daily Special per day, and today's was Cashew Chicken.  Ugh, I can make that at home, probably for less money.  So I went back to the BOGO Sushi Menu, because I really didn't want to spend $20 for lunch.  However, the BOGO Menu selection had just a few rolls at $6-something each, the rest were $10 - $14 each.  I didn't want just a plain roll, I wanted to see what the Chefs could do here.  However, one $10 roll was almost identical to the next $10 roll (i.e., one has shrimp, the other has crab).  So you pretty much have to pay for the higher priced roll if you want a variety in your 2 sushi rolls.The Food... really good!  The Sushi Chefs know what they are doing.The Service... slow and a bit frantic.  It was painfully obvious that none of the servers, or even the chefs, were happy to be there. The Ambiance... a little cold.The Cleanliness... Not good.As for the cleanliness the condensation from the sushi bar display dripped down onto the bar, and the utensils have all seen better days.  I walked to the restrooms only to step in some majorly sticky substance on the floor with my right shoe.  My rubber soled sandal squeeked loudly the rest of the way to the Restrooms.  Kindof embarrassing, and really annoying.  On the way back the left sandal got it, so at least now I was walking with a loud squeek with BOTH steps.The sushi was really good, but the sushi filling of \"tempura crumbs\" was a common theme and is new to me.  Maybe I'm just old fashioned.  Yes it gives each sushi bite a good crunch, but to me is a cheap, fatty, filler.  Give me fish, rice, veggies and avocado in my rolls please!It took forever to pay my bill, and the sushi chef kindly went to find my waitress for me so I could pay.  Then when I gave her my credit card it felt like forever for her to come back.After standing at my chair signing off on my $15 lunch bill, I tried to take a step forward and realized both feet were glued to the floor.  Funny.  Fortunately I broke free, made it through the finger-printy glass doors, and onto the sidewalk where I gladly could wear the stickiness off my sandals.  :-)"], ["Keith A.", "Pleasantly surprised I really did not know what to expect here. The BOGO deal is great and you cannot go wrong. Loved the metal chopsticks. The Volcano Roll was truly interesting and tasty."]], "The Cowfish Sushi Burger Bar": [["Lauren G.", "First off, it's a place to take picky eaters. The menu is large with a variety of different foods. Second, the choices of sides with the burgers is great! I've tried the bacon coleslaw, fried pickles, and the cucumber salad. They were each great and worth getting again. Every person that I have taken here has loved it. I've ordered the fried calamari and it is so good!! I like that you can get a burger and switch out the meat. I always order the \"heavenly veggie\" burger and switch out the veggie patty for meat. (I know, sounds like it defeats the purpose but it is good!)The layout of the restaurant is weird, almost a maze. It can also get loud in there. The decor is funky and I love the fish tank. My biggest complaint with the restaurant is the wait time. I've even gone during a \"slow time\" and I had to wait 20 minutes for a table to be cleaned off. There were other tables open and I was told by the hostess that those tables were for \"larger\" parties (we were a 2 person party). The host/hostess staff aren't always pleasant. The servers are great though. I had a server yesterday named Emmett and he was on point, made jokes, and seemed to really enjoy his job. More than a couple of times I've made the decision not go to because of the wait time. I've only called once and they said they didn't take reservations."], ["Alice F.", "We came back to cowfish tonight, and our experience confirmed that our last visit was a one time disappointment. We ordered two burgers, the boss, and the tropical storm. Everything was great but we were too excited to take pictures before everything was devoured. We also had the apple pie wontons and the fresh berry tall cake. Portions were huge but we still enjoyed every bite. Our server was attentive with excellent service."], ["Daniel H.", "First of all, any establishment that sells a combination of sushi AND burgers together on the menu is off my books, period.  It was extremely noisy since the place was at full capacity. I knew I wasn't eating so I sat at the bar and ordered a drink, which had to be returned not once but twice to be remade (with very specific instructions).  Still, the drink was awful, but I did appreciate the bartender for the effort/service.  I also found the fish tank located in the middle of the bar extremely annoying......"], ["Kimberly Y.", "I really wanted to like Cowfish, but everything else didn't quite make up for the food and wow, that wait time. The service is super nice and patient, and they're willing to explain everything to you. The place is definitely unique in decoration -- cool and hilarious art along the walls, but the fish tank wasn't amusing for long.That being said, I found the food to be mediocre. Maybe my expectations were too high from all I've heard about the place? Anyway, I ordered the Cowfish bento box. I have to admit the burger meat was good, but the slider was ye small. My California rolls were average at best, and the edamame and Thai cucumber salad were very mediocre. My fries tasted like they were cooked two hours ago, which is strange considering I came on a Saturday night -- what I'd imagine to be one of their busiest times. My friend ordered the \"Ultimate\" bento box and admitted that it was only all right (and he was the one who insisted we go!). Would've tried the other faves like crab rangoon if we hadn't been so stuffed by the end, haha.I'm just not sure Cowfish merits a 1-hour wait. Next time maybe I'll come back at an odd hour next time, ready to explore one of those humongous fusion burgers!"], ["PJ S.", "Cowfish sets out and does exactly what it aims for, to meld the two worlds of Burgers and Sushi, and does it well.The upbeat atmosphere paired well with the nouveau food, and resulted in a very good meal. Our waiter was extremely helpful and knowledgeable with the menu, answering any questions that we had for our first time there. Now you can get better sushi or better burgers at other restaurants in the Raleigh area, but there is no place that offers this unique fusion.For our appetizer, we tried the Crab Rangoon Dip which was incredible, and Dave's Filet Roll (Burgushi topped with Filet Mignon), their burger sushi. It was fairly good, and the Filet Mignon was cooked superb. For my meal I ate the Jalapeño Popper Show-Stopper Burger, which was awesome, but not mind-blasting. It had a great kick for heat-lovers. Also the truffle fries were forgettable for me. I also had a chance to try the What's Shakin' Tuna Bacon Sandwich, which was very interesting and tasted great, but fell a little flat in concept.I ate here on a Saturday lunch and was seated immediately, however I have heard that wait times can be very long here, and they do not offer reservations or call-aheads.I would definitely eat here again, with piqued interest for their delicious and imaginative food."], ["Stephen W.", "The food here is fantastic - never had a bad experience here. However, if you are going during prime time, be prepared to wait. This place is popular for a reason - my wife and k brought cards last time and that made the hour long wait go by quicker. Sushi is good. Burgers are AWESOME. Atmosphere is incredible. Do yourself a favor and check this place out if you can."], ["Mike B.", "Somewhat odd combination of sushi and burgers, but it works. Had the colossal onion rings for an appetizer and they were great.  You're expecting a mountain of rings (colossal, right), but our plate had 5 on it. But they are so large and thick that they really are filling. I had the thundering herd bison burger,  which was one of the top 5 burgers I've ever eaten. My wife had the Dion's OMG sushi roll, and loved it. Daughter had the make your own sushi roll..also loved it. Sharon did a great job with our service, prices are on the higher end, and the restaurant is very nice. We sat in the covered patio area, which seemed a little loud. This is definitely a place you want to try."], ["Laura S.", "Cowfish is always a great place for date night. Love the fried pickles and burgers. I tried the burger as sushi and really was not a fan. Fiance' loves their regular sushi. Service is prompt and friendly. Make sure to make reservation or go late."], ["Anne M.", "Hostess's are rude and put a longer time on your pager then they tell you. As well as allowing parties of there friends go before other, thought it was first come first serve. Then fail to inform you the bar is opening seating.After our 1 hour and 50 minute wait we were seated. I did complain because it was 30 minutes longer then we were told. The manger stopped and talked to us because of the issue. We received a free appetizer, so the crab Rangoon dip was okay. More cream cheese then crab but the wontons and sauce were nice. We ordered the volcanic roll and the deliverance roll. The volcanic, was fresh with cucumber and jalapeños inside then the spice tuna on top. Just enough spice but not over powering. Then the deliverance, a southern comfort play on sushi, the pork was tender with just enough barbecue sauce, the coleslaw gives it a little tang, and the nice crunch with the shoestrings on top. Very delicious. Overall the entrees were honesty wonderful. Service went from poor to decent. Maybe I can just order to go from here for now on."], ["Rae W.", "I took another opportunity to dine here with a friend and my experience was definitely much better than the first. We ordered the vegetable sushi, bento box, and tall cake. Everything was delicious and I'm glad I  gave it another try."], ["James S.", "Cowfish is a unique restaurant.  I went in skeptical and came out transformed.  It has a wide variety of food, the decor is fun for the whole family, and the staff is very friendly.  I was impressed with my meal (Korean Chicken Burger).  Delicious and filling.  A great restaurant to return to."], ["Casey K.", "Have been here twice now and really enjoyed it! I have tried 5 different rolls (all fish) and they have all been good! The sushi rolls I have tried are: double salmon roll (good), Dion's OMG roll (fantastic!), Miss Moffits Roll (good), North Hills Roll (awesome), and The Boss (good). People I have been with have gotten the sandwiches, salads or non-fish rolls and also enjoyed their meals. Nice, relaxed atmosphere - great option for a good meal without having to go somewhere fancy and spend a lot of money!"], ["Suhana A.", "I was in town for work. My coworkers and I went there for lunch on a weekday. It was pretty busy for weekday. The concept is pretty cool- they have sushi in form of burger. They do have normal sushi and normal burgers :) But I decided to try their concept of burgushi. I think I got 7S from the menu. I really enjoyed it. It was super filling!"], ["Courtney B.", "Burgers AND Sushi!??!!? What a great combination! I actually don't eat sushi but ALL of my friends do so I am always the odd man out. But having these amazing options for us meat lovers is exactly what I have been looking for. Atmosphere is very casual and inviting and service was good. The menu was very extensive but a little bit pricey. I tried the BBQushi (pulled pork sushi). And it was to die for! Covered with coleslaw and crispy onions straws...I think I like sushi now :)I can't wait to visit Raleigh again in the future and go back to try other menu items. I am a little bummed there isn't one closer! But I give this unique idea of a restaurant 5 stars!"], ["Adam D.", "Fun atmosphere, great food, very interesting fusion combinations. Service was great. This place screams fun, and doesn't take itself too seriously. They have a \"how to speak redneck\" translation tape playing in the bathroom.To top it all off, they bent over backward to accommodate my daughter's food allergies. The kitchen manager gave us a complimentary Tuna Nachos appetizer (highly recommend) to thank us for trying them out. And the employees seem like they genuinely their jobs.I highly recommend the Cowfish Sushi Burger Bar."], ["Mike B.", "Cowfish is probably my favorite restaurant in the area. Their food is incredible and their service is equally impressive. I have never had a bad waiter there and I have eaten here at least a dozen times. For appetizers, it has to be the lobster egg rolls or crab Rangoon dip. Both are unique and very tasty. For my meal, I almost always get sushi although the Burgushi I tried has always been very good. My favorite sushi rolls are either the firecracker roll, the boss, or the tropical storm. I could go on and on about this place but let me just simply say, if you haven't tried it yet, you better soon!"], ["Cat L.", "My girlfriends and I had dinner here a few nights ago. The place was packed for a weeknight & the parking is miserable while the construction goes on. I realize that's not Cowfish's doing. The burgushi box was a hot choice within our table. The sushi options and the slider adds nice diversity to a rather ordinarily order. The pimento cheese & bacon sandwich was great and the bison burger was amazing. The fried pickles were the center of discussion and the table as we passed around continuously. Cowfish is always a huge success for us and we appreciate their constant hospitality. The decor and audio recording in the bathroom make it quite an eccentric place to relax & dine."], ["Heather M.", "Americanized sushi restaurant best sums it up.A mountain of parmesan truffle fries for an appetizer and then sushi+sashimi for our entrees? You get the best of both worlds~The ambience is modern and hip. We went at 4:45 and by the time it hit 5:15, there was a crowd.Service was very professional. Our server was a bit hovering but I'd rather have that than an absent server.The only miss was the Parmesan truffle fries. They were more like bacon-cheese fries... And the fries themselves were not crispy, but stale... They weren't even hot!!My favorite part of my experience here was that I could build my own sushi roll and add whatever I wanted, yay! (If it doesn't taste good, you only have yourself to blame right? Haha)I really wanted to try one of their milkshakes for dessert but I was absolutely full by the end of the meal- maybe next time!It's a pretty pricey place but overall they add a nice twist to the Asian fusion concept!"], ["Jamie E.", "Note: the Yelp profile indicates that Cowfish closes at 10 p.m. on Saturdays, but I was there until 11:30 p.m. tonight, and the website has Sat. hours listed until 12 a.m.I've dined at Cowfish twice now, and the service has never been so bad or so amazing that it warrants comment. The  concept, however, makes it one of my favorite spots in Raleigh. First of all, sushi and burgers...why wasn't this a big deal my entire life? Cowfish has everything from combo boxes featuring sliders and sushi, to \"burgushi\" rolled with a variety of meats, to create-your-own options. My first time there, I tried one of the combo boxes. The slider was simple but tasty, and the spicy tuna roll was pretty classic. The sweet potato fries were absolutely perfect - soft, crispy and sweet. My second time there, I had the miss muffet sushi roll (tuna, tempura, avocado, sesame seeds and eel sauce). Not only was it delicious, but it came in nine hefty pieces. Tucked in a back corner in the North Hills, Cowfish's ambiance is very trendy, complete with a small aquarium, bizarre artwork and an eclectic playlist of upbeat tunes. The indoor/outdoor seating and cornhole (so you can play while you wait for a table) make Cowfish a great summer spot.I would highly recommend Cowfish for anyone looking for variety (the menu is huge) and a laid-back, young vibe. For the sushi connoisseur, however, it might not wow."], ["Beth Q.", "Hands down one of my favorite sushi restaurants. I've been here quite a few times and everytime it's wonderful! Service is always great as well. My most recent visit We got shrimp appetizer, truffle fries & deliverance roll(my absolute fave) to start- all are so delicious. I ordered a burger instead of my usual sushi. I got the Hunka Hunka burger single with sweet potato fries, it was heavenly! It's a must try!! My boyfriend and I ate based 2 hrs away from this place and will make the commute just to have Cowfish.. Yes.. It's THAT GOOD!"]], "Sushi Tsune": [["AJ H.", "actually authentic japanese food, excellent service, welcoming kind and genuine staff. the atmosphere is cozy and comfortable and welcoming. there is an optional area to eat while sitting on floor pillows. VERY fresh ingredients - im surprised to find such a great place in Raleigh!"], ["D H.", "Another review... After years of dining at Sushi Tsune, I have to say I'm still a huge fan!  A few of my favorites are the Nabeyaki udon, miso soup, sushi, tempura veggies, firecracker roll, volcano roll and so much more!  All served fresh & top quality!  Great place and authentic!  Love!!"], ["Jillery Ellen S.", "Excellent sushi. Authentic stuff. Great service. A hidden gem!!!!"], ["Kim D.", "Everything was so fresh and the staff was all so helpful and nice. I had the best California roll I've ever had there.  I will definitely be going back."], ["Paige K.", "Beware the ChirashiI had the Chirashi last night, which included Tuna, Red Snapper, Octopus, Egg, Imitation Crab, and Mackeral.  The fish tasted OK but did not look all that fresh.Four hours after dinner I had major stomach cramps and got diarrhea.  The only other food I ate was the fried chicken appetizer.  The stomach issues did not end with last night. Continued to have diarrhea this morning and will never go back to Sushi Tsune.  I have been there once before for lunch and did notice that the sushi, which came as part of a lunch bento, wasn't the best quality.  I gave it a second chance last night and was punished with bad sushi.  Do not order the raw fish here unless you have a stomach of steel.36hr EDIT: I experienced Nausea, Headaches, and Dizziness for 24hrs after the meal. I'm finally feeling better, a day and a half after this meal from Sushi Tsune."], ["Andrew M.", "Whether you want sushi, a noodle dish or something in between, Sushi Tsune is a great spot for Japanese food. I recently had their cold noodle dish with udon and was surprised at how much I loved it--I typically don't like cold dishes for dinner but was feeling adventurous. If you need a dish to start with during your first visit, get the udon soup at the bottom of the last page. It's enormous so bring an empty belly or to-go container because they don't have any."], ["Tiffany B.", "Best udon soup I've had, hell one of THE best soups I've ever had to this day! I love the atmosphere and attention to detail. You can really tell the owners care. The sushi was good, but I definitely will be coming back for the soup :)"], ["Parag K.", "I'd give this zero stars if it was just service, but they do have really good Sushi and my girlfriends a big fan (of their food). Even as a total Sushi noob, I can appreciate that they do have tasty, fresh and plump rolls that compare quite favorably with other nearby sushi options.Why the two stars you ask, one word : service.  It was always so-so, for some reason the head-waitress seemed to dislike us (gf and me) despite being regular customers (once a week) and tipping well. Often other tables seated with/after us got their rolls before we got our Miso soup (as part of their $8.95 2 rolls + soup special). I never quite understood why, but I put up with it (and left healthy tips in light of the Sushi we enjoyed) and the Chef behind the bar was always nice to us.On our last visit there, we didn't get out soup at all and finally had to ask for it. The waitress in the meanwhile is giving me the stink-eye all the time from across the room, and I have no idea what's going on. Finally soup arrives, and half way through girl-friend finds a hair in hers. We call over the head-waitress, and explain the situation. She just stares at us for a bit, then grudgingly agrees to replace and follows it up with this little exchange :Waitress (about to leave) : By the way, I didn't want to say anything but you guys didn't leave a tip last time.We : Flabbergasted. Me : No I definitely left a tip, I have never in my life not left a tipWaitress : (taken aback by how sure we are) umm ..maybe you forgot?Me : NOWaitress : (still continues) you sat at that table over there (points to wrong table we never sat at) and ordered a custom roll [fictional-roll-we-never-ate]GF : NO. We never sat there and we always order off the regular menu!Waitress : (still clings on to some hope) maybe I got my tables mixed up but I think it was you guysWe : Sorry, not us!{She leaves and returns with new bowl of soup}Waitress : (mumbling) not sure how the hair got in there. If it happens again then you can complain to my boss. {Leaves us finally. No apologies for the hair or the random public accusation WTF!}We shared a quiet and uncomfortable meal, at some point the waitress seemed to realize her mistake (probably post some discussions with her \"boss\" : whoever that is) and tried to terribly overcompensate by repeatedly asking us if we wanted soy-sauce/extra-chopsticks/ginger/wasabi. But at no point did she apologize. We left in an uncomfortable silence and getting a box for most of our dinner. The accusation in response to finding hair in the soup was just bizarre and a terrible way to treat a customer., the lack of an apology was even worse. It left an incredibly sour taste, while we love the Sushi here we'll be taking our business elsewhere from here on. P.S : 1. Went home and checked my credit card statement : on our previous visit we had left a slightly above 20% tip as was our norm here.2. In hindsight I get the feeling that our tardy service on past visits was also linked to some sort of (fictional) tipping issue this person had with us. Or our 20% tips were too low for her to muster up the quality of service she was offering everyone else around us. Just.Not.Done!"], ["Ch T.", "[dog-unfriendly - no outdoor seating]the sushi here is really great. We randomly stopped here after a movie, and it is pretty much now my favorite sushi place. the rolls were really just amazing. The ginger dressing on the salad was the best I've ever had. The service was good, their prices are fair, and the atmosphere was incredibly welcoming and cute. Oh, and one of their attention to details that I really appreciated - they give you an extra small napkin along with the large cloth one at the table setting, so you don't have to lift your napkin off your lap after every piece of sushi to wipe the edges of your mouth. Maybe not everyone cares about this, but I do, and I really liked that they put that much thought into their guests' experience."], ["Aisha H.", "Tried this place out last weekend and it was pretty decent. Seems like a small mom and pop restaurant and both people at the front were very attentive when we were there. We were the only people in the restaurant and it was very quiet so we were able to enjoy each other's company. The food comes in bento boxes and I can readily admit I did not know exactly what all was in my box; however, nothing was particularly bad or distasteful. The salmon had a little \"too salmony\" taste to it but otherwise, things were fine and enjoyable. I'm not sure that I would rush back here to eat the food again but I may venture back in a pinch."], ["Travis W.", "Amazing! Hidden gem! Absolutely loved the sushi! Very quaint, staff was super friendly!"], ["Anna B.", "Without a doubt the best place for cozy, real Japanese food in Raleigh. Sushi Tsune reminds me of the places my mom and I would visit when hanging out with relatives in Japan. The service is consistent. The food is always awesome. The atmosphere is just right, and gathering friends on the tatami mat is so much fun. Been going here for years. It's hard to beat."], ["Megan W.", "I think 45 mins and counting is too long to wait for raw fish, especially for a to-go order."], ["Jane Y.", "I decided to try this out after my coworkers raved about their bento box lunches and boy am I glad I did.The lunch portions are generous and the sushi is fresh. I got the sushi appetizer, which was only $5.50. It gave me a few pieces of California roll and nigiri!I, then got their nabeyaki udon, which was delicious. The shrimp tempura was lightly fried - just the way I like it. The flavor of the soup wasn't overly salty - so I actually sipped it. The udon had a great chew to it, which was just perfect.My coworker got the maki lunch special, but felt that all the rolls all tasted the same. =/I'd come back again and try more of their appetizers - they have a great variety of all different types of little plates that's definitely worth another visit here.Also, the service was great. The waitress was VERY nice and attentive. The thing to note is that they do not have soup to go containers, so come with a big appetite or bring your own soup container."], ["Bob K.", "I ordered curry rice with pork and the curry sauce wasn't hot, but pretty good. My son order a chicken bowl which was ok and my wife said her tonkatsu was a bit dry. Since we are from CA., we hit a lot of Japanese restaurants back home and considering there aren't a lot in NC., it was okay. At least the owner is Japanese and the waitress was from Taiwan and she was nice."], ["Ha N.", "i would say this was my first love for sushi in the area. I've definitely moved on since then to other places for rolls and sashimi, but the one thing that would bring me back to this place is the udon. I think this is the best place for udon as the noodles are always perfectly cooked, the dish always served hot, and the flavor always good. The Nabeyaki Udon is always my favorite and I always add ample chili powder to spice it up to my spicy level. Another thing I do like from this place is the ginger dressing that they serve with their salads. I'm not a big fan of iceberg lettuce, as you can tell from my other reviews, I don't mind the salad quite as much before of the dressing. I don't know if they make their own dressing, but I assumed so, and i commend them for making what is probably the best dressing I've had in the area. This label, of course, is subjective to my own tastes, but I would find most other places too salty or maybe a little bland or too tart. Food aside, I think the service is superb. For a while, my girlfriend and I pretty much \"lived\" in Raleigh, and this would be out weekly dinner place, so we were definitely regulars. They would recognize us and occasionally give us some free salads or sometimes free mochi dessert. The sushi chef (the old guy) would modify the sushi to our taste. For instance, we got the firecracker roll once and he had been noticing that we like a lot of wasabi (we also asked for it to be extra spicy that day) and he definitely made the firecracker roll super spicy, which I loved. It was a slow night and he also watched us to take notice of our reactions to the sauce. He's a fun guy and i'm always a little sad to not see him when I go."], ["Chris F.", "Their sushi is pretty good. I was elated to discover that they have katsudon, something a lot of Japanese restaurants don't have. I especially like to sit at the bar and chat with the owner. He's very friendly and willing to educate, but at the same time he lets you enjoy your food. It's a quiet, small restaurant, which makes it a nice place for a date or catching up with an old friend."], ["Nastia S.", "Great service! Sushi is good and price is very very reasonable.I had their Shrimp+Sushi Box Special for dinner and could barely finish.SO MUCH FOOD! It came with miso and salad, too!My friends had to help me to finish all the tempura shrimp and veggies!Great place for a casual dinner with friends in quiet friendly environment. Next time I go there I will definitely ask to be seated in a traditional way - on the floor."], ["Christy R.", "I'll start with the positive. Despite being squeezed between a BP and an Arby's 10-foot high imposing neon sign, Sushi Tsune is a surprisingly pleasant place to enjoy a meal. Warm, bright, intimate, simple. Very Japanese.Service was a 4 out of 5. Salad was fresh and ginger dressing was delicious.Cons: 1. Sushi rolls left something to be desired. Too much rice, a little skimpy on fish, few imaginative options (I like simple, but these were very basic), and no low-sodium soy sauce (I've become accustomed to this, and the regular is just too salty). If I go back, I'd try a sushi meal instead of the rolls. 2. My fiance got the tempura and teriyaki beef. It was just okay. Not a $20 entree. 3. No draft beer.My personal rating would probably be 2 stars--I have experienced better, and overall, it just wasn't worth the price. However, if you like an authentic atmosphere, don't have budgetary constraints, enjoy nigiri, and don't mind real soy sauce, this place might be for you."], ["Kyu J.", "Good day to you.  I hope you're enjoying your search for a great authentic Japanese restaurant.  I'd like to invite you to come this way.... yes...just over here.  You'll be delighted, I promise!  I had come from a larger place very substantial in the Japanese population, and therefore substantial in a variety of excellent Japanese restaurants - some more focused on eclectic style with various yakitori and sake, some quiet box restaurants with servers speaking broken English, and some traditional upscale settings with seating on the floor.  Upon coming to Raleigh, my search for excellent Japanese restaurants was a long and mostly disappointing one.  Months ago I finally stepped through the doors of Sushi Tsune.  The atmosphere was lovely - a perfect peaceful Japanese setting, just like what I had experienced before.  I also spied a special of Japanese Curry on the menu.... This is a lovely treat that I had ordered many-a-time for lunches at a very large Japanese market / food court / shop in my previous home.  If you have not tried it, I would strongly suggest you do so. Japanese curry is sweet and dreamy.  Their other food is delicious, as well - rolls, nigiri, soba, don, ton-katsu, etc.  Just this last visit we asked about the items with no description.  Apparently they have options to cater to very American tastes (rolls with cream cheese, anyone?) and options to cater to their Japanese guests, which will not be liked much by westerners (hence no description)....  WELL, we decided to try one.  It was chunks of salmon with gooey ground radish sauce.  Weird, but very good, if you desire to be experimental!  :) The only sad thing to me is their limited sake selection.  They have great sake that is expensive, or meh sake that is cheap. We generally go for hot sake, since it is cheap and the heat dilutes strong meh flavors.  ;)Lastly, I adore the staff!  They are all very sweet, very helpful and very personable.  It is always a delightful experience for me and makes me feel like it's my little Japanese home away from home."], ["Natalie G.", "This place is not good.  I didn't like how they had no lists with descriptions of the special rolls.  It was hard to make a decision with only a waitress reciting the descriptions of the rolls to you when there are 12 or so rolls.  I sat with an empty water glass for about 20 minutes, and I wouldn't rate this very high.  Don't waste your time.  I wanted this to be a good dive sushi place, not the case."], ["Austin M.", "By far the worst sushi I have ever had!"], ["Arthur B.", "This is my fav sushi resturant. I have been going here to 10 years. The food is fresh and love the salad and soup."], ["Tony B.", "Best Japanese food in the area!  If you are looking for fusion or American-Japanese style of cooking/sushi then you need to go somewhere else. Very authentic and atmosphere reminds me of a little restaurant I ate at in Nagoya, Japan."], ["Charlotte F.", "This is my go-to sushi place when I don't feel like trying something new. It's very conveniently located on Hillsborough Street, and the prices are very reasonable. The sushi itself is a bit hit-or-miss, but will always be made by the Japanese chef (Tsune-san, I assume), which gives it an authentic vibe. I love their non-sushi entrees though, especially the udon and the katsu. The service is always great, and I've never had to wait to get a table there. I always recommend Sushi-Tsune to friends who want an affordable Japanese dinner!"], ["Scott T.", "This place is not very good.  The service was decent, but the sushi was very sub par.   Not sure how this became the top rated sushi place in Raleigh."], ["Luke S.", "Nestled between scenic Arby's and a gas station, Sushi Tsune presents a modest exterior. One could easily mistake it for a Panda-Express like bastardization of cultural food, but that is far from the case. When I went, women in kimonos beckoned us to remove our shoes and ushered us to our place of seating on a tatami mat. This is not mandatory; as it turns out the last table left that evening was the 'authentic' one, lucky us. Uncomfortable though it was for my monstrous western feet (at first) it was a fun experience. I went up to the bar to try my hand at conversational Japanese and learned a lot. Namely that two years of college Japanese has made me as fluent as a developmentally disabled Japanese 5-year old, but the sushi chef was very patient (they....talk so.... fast!). The sushi was excellent and the decor more so. It's a bit pricey (for me, which i guess makes it moderately priced) but an experience not to be discounted."]], "Buku": [["Paul E.", "Ordered a Cab to drink like it doesn't have  the Oakey taste. Ordered Baja crab Flautas and Chaat for Apeti. Very flavorful nice presentation mango and crab never tasted soon good 2 of my fav flav with that hot taste. For the main we got Argentinian Rib and Duck Adobo. The rib was soft with a pink just the way I like it. Has those vegetable and cheese grilled apparently it's called Tempey a protein meat substitute. The adobo was cooked 3 ways with duck egg, meat fried and cooked in soy sauce all on coconut rice and the atchara cleaned the palette....very good a must try. Server was very knowledgeable of the ingredients which is always a good sign in a restaurant. For dessert a Cap and halo halo not ur usual combination of dessert but a good taste on a fav dessert. I  don't think much of the guava syrup though but you don't really need it. A must try place if your at down town catching a Broadway or concerto."], ["Michael B.", "I took a friend here for his birthday brunch, not knowing anything about this place. The buffet was superb and eclectic - the waffle station had six different types of syrup (apples, blueberries, strawberries, salted caramel, Nutella, and something else I can't remember) and nots and chocolate chips, and yes, it was scrumptious. Of course, plenty of fruit, eggs, sausage, bacon, ham, pastries, and such were there as well...along with chicken dumplings with hoisin sauce, truffled kale, and grits. Basically a giant smorgasbord of breakfast foods, and all were delicious. (Also was an omelet station but I was full by the time I got around to it.) I'd love to try the \"street food\" that they normally serve if it's as good as the brunch was."], ["Claire A.", "Excellent service, reasonably priced, great atmosphere and the food is really good! I ate there 3 times last week while at the IBMA conference as did many of my colleagues. It was an easy walk from the Marriott and Raleigh Convention Center. We never needed a reservation and were quickly seated and served."], ["Sanjay G.", "Very nice ambiance. Creative dishes. Truly global street food just as they claim. I like the creativity. It is a bit on pricey side but well worth the experience. The glass wall with waterfall is amazing center piece of attractions. The bathroom were quite modest for this level of establishment, but not bad. I tried Samosa Pot Pie. I really liked it - it felt healthy and filling enough for one adult meal."], ["Gregg Z.", "Bought a Groupon for this restaurant& wax c pleased w both the atmosphere and the menu selections!"], ["Rachel B.", "The BEST brunch buffet. I was so full afterwards! I wanted to try everything, and I enjoyed exploring all the different cuisines. I have also been there for dinner, which is quite good as well. But for $19.95, all you can eat brunch with global flavors, can't be beat! I especially loved the conchinita arepa and the viet cucumber salad, and of course fried chicken and buttermilk biscuits and grits for breakfast (southern foods too)."], ["David T.", "Global street food - If thats the case I want to live on this street.I think this is now my favorite restaurant in Raleigh.Cool decor, wonderful service, awesome food.Vegetable dumplings - deliciousFilipino lumpia - ground pork spring roll with mango salad and cilantro chutney - very goodCochininta arepa - deliciousChilean sea bass with plantain crust, mango relish and wostershire based sauce - unbelievably goodSalmon - very goodHanoi style fried snapper with forbidden rice - goodSweet potato ice cream with Sugar Palm, coconut, and other interesting fruits. Unusual but very good.Tall glass tiramisu with a poured in sauce - deliciousApple tart with ice cream - good"], ["Amanda F.", "This place is so yummy, creative, diverse, surprising and a delight to your tastebuds. I originally was searching for a good sushi restaurant but once we perused the menu, realized it was much more than that! Our cocktails were interesting but delightfully tasty. My second drink was the Mumbai one which had such a different taste than you would expect in a cocktail but after a few sips I realized how delicious it was. Our edamame had this addicting spicy sauce that we ordered on the side that gave it just enough fabulous pizzazz. The naan bread. Yum. Need I say more. My husband's dish was the samosa pot pie. Holy cow was it incredible! Delicious Indian spices mixed with a small amount of sweetness from the apples. His words \"that was man's food right there\". I got the spicy tuna sushi roll. Delicious flavors melted in my mouth with each bite. We don't usually order dessert when we go out but we couldn't pass up on the halo halo! So scrumptious and different for a dessert! Hands down recommend this place!"], ["Jarrod S.", "Pros: Chic modern ambiance, some tasty platesCons: Plates are hit or miss (ya dats just tapas I know) ExpensiveWhile not technially a tapas bar (because it is not Spanish themed) this place offers many small plates in the tradition of tapas. I think that's the best thing to say about it, as such it seems that even more than tapas their selections are hit or miss since they don't fully specialize in anything. It's an instance where if I knew going in what was good and what wasn't this place would probably be worth it. However, like most tapas places you're rolling the dice on \"small plates\" that can often run 10-15$ a pop."], ["Jennifer C.", "DE-LI-CIOUS!Had a lunch meeting at Buku last weekend and I am kicking myself (not literally, but maybe I should) for walking by this place so many times because I thought it looked expensive and stuffy. First of all, they accommodated a group of 12+ on a Saturday, put us in a great room with a big table away from other diners and gave us a fantastic server. Second, Buku has quite a large gluten free menu (see picture I posted or see here bukuraleigh.com/buku/men…) - seriously, there isn't much on the menu that isn't gluten free to be honest, so I didn't feel like I was being short-changed. Nothing stinks worse than having to be at a restaurant and only being able to eat a salad while everyone else enjoys delicious meals. That being said, I ordered a salad (Sicilian Radicchio and Endive Salad) which was so flavorful and delicious, but I also ordered Empanadas because they make a gluten free version! It was so light and crispy and practically melted in my mouth. You get two with your order and it comes with a heap of yummy guacamole on top. Honestly I wanted to order two more when I was finished because they were just THAT good. I have been dreaming about them (and raving to friends) since I put the last bite in my mouth. Buku serves brunch on Sunday, has a large outdoor seating area, and a large drink and dessert menu. I can't wait to go back, don't walk by Buku!"], ["Jennifer W.", "Second time here and the food is delicious! The Ramen is my favorite as the broth is very good!!! Definitely will come more often!!! You also need to try the Tiramisu there, it is very special!!!"], ["Michelle M.", "Ah, the bourgeois tapas dinner spot of Raleigh! Food was delicious, wine menu was  varied, and ambience hit the spot. Service not so great, it was either hit or miss with the serving ladies and hostesses.Expect a short wait if you have a party of moe than two. Although the restaurant is huge, it fills up quick so make a reservation.We started with their raw selection of appetizers (ordered a sea bass tirade to and the pacifico roll). The fish was splendid, the roll was not out of this world (don't come to a Latin themed restaurant to eat sushi-lesson learned). Their arepa with cochino (pulled pork) definitely hit the spot. This is more of a fusion restaurant though so don't expect authentic cuisine, but a good mix of flavors. Lastly, we had the Steak Frites and we did not regret it. I will take truffle drizzled fries on any day, and the steak was cooked quite nicely too. Definitely try out their red Sangria! A full sized carafe for only $20, definitely bang for your buck here."], ["Beverly F.", "My hubby and I were wandering around for some late night eats and ended up here after remembering that a friend had posted about this place on FB. We arrived 30 mins before closing and were graciously seated. Chad or Chet (?)waited on us. Our food came out almost promptly and was hot and deelish. This was our first foray into WORLD FOOD...and we will be back."], ["Nicole E.", "Of course I started with the Red Hat Mojito (cause I love mojitos and I love open source). The appetizers (the veggie dumplings specifically) were awesome - we had a bunch to share for our group.  My dinner of plaintain encrusted fish was fresh, delicious and way too big! I only ate 1/2 so that I had room for dessert.  The apple tart I ordered was also amazing and too big.  So the lesson I learned here was that the food was amazing, the staff attentive and next time I should share everything with someone else."], ["Jean H.", "This is by far the best restaurant in Raleigh I have never had a bad meal or bad serviceAubri  was pout waitress she was excellentShe had allot of tables and attended each one with a smile and checked in everyoneI asked if I could just get the vegetable spring rolls that were not in the menu as a side and she got them for me they were amazing with a peanut sauce that I could drink it was so goodThank u buku for always being a perfect restaurant choice chef  Ramsey could never find anything wrong with Russ place"], ["Dona S.", "One of my friends and I went to Buku last night and it was really nice.  The Donnie the waitress was amazing.  She was great with suggestions and they pairing of food.  They have the most amazing buku edamame.  It has chili sauce and cashews I am never going to want it the plane way.  Then we had the tuna tataki roll WOW was it good and we followed this with the Aloo Chana Chaat the flavors were great.  We finished off with the creme brulees trio vanilla/chocalate/ginger I don't eat chocalate but the vanilla and ginger oh so good and I don't normally care for creme brulees.Of course we started off with a nice beverage Rosemary Neno suggested by Donnie another great suggestion.  Go there ask for Donnie and enjoy you evening of flavors.  You will not be disappointed I promise."], ["Nick K.", "Complimentary valet is a nice touch and the ambience is good. Four of us went and loved every item. A little pricey for the amount of food but it was still a good experience. Waiter was really good and the co-owner was nice too. Bigger portions would have given it 5 stars"], ["Jeff F.", "Buku is wonderful, you will not find a selection of different styles of food anywhere, and the best part is it doesn't matter what you order, it will be awesome!  It's a bit pricey, I will admit that, but I guess you get what you pay for.  They also have the best brunch buffet I've ever had in NC.  Seriously, if you haven't tried it, get your butt there this weekend!"], ["Elizabeth K.", "The first time I came here with a couple of girlfriends, we shared small plates. The food wasn't that great and the service was horrendous.The second time, I went with coworkers; we had some drinks and snacked on a few things. Food was pretty tasty and the service was friendly.Fast forward to today, I came with about 12 other people for a birthday. Service was AMAZING (thanks to Justin), and the food got significantly better. Heck yes to improving experiences here at Buku. I really can't say enough about how great the service has gotten, even from others besides Justin. Everyone's food came out together smoothly and we were all happy. Buku does not get a perfect 5 stars because the hostesses aren't that kind, and I honestly think their food is just a bit overpriced for what it is. Their large plate options can go up to $30. I'm not much of a stickler when it comes to quality food; I enjoy spending any amount if the food is phenomenal and worth it. But I wasn't satisfied here. Trendy place downtown with global cuisine (lots of options to choose from: small plates, large plates, and even sushi) and complimentary parking."], ["Sarah S.", "A group of friends and I wondered in on a Thursday evening without a reservation. Lucky for us they had room for the 8 of us. I want to start off by saying that we such a wonderful and memorable dining experience. Our sweet Michael was outstanding. He knew exactly how to handle a bunch of girls celebrating. He was the most accommodating, fun, knowledgable server I have had in some time. You could tell it wasn't his first rodeo, and for that we are thankful. The food was exceptional. I ordered the ginger pear salad that was recommended by Michael. It was delicious. It had all my favorite elements. Sweet, savory, & crunchy.For my entree I had the Filipino Duck Abodo. It was delightful. The combination of the tender duck breast over coconut rice and a fried duck egg....oh my heaven. What a treat it was to dine and be so well taken care of."]], "Waraji Japanese Restaurant": [], "Mura": [["A R.", "I hosted a private party at my home for my husband's 40th birthday. The caterer had recommended I use Mura for the sushi station I was requesting. Mura absolutely BLEW US away with not only the quality they provided for our party but the beautifully impressive display they made! We had been to the restaurant years ago when they first opened and wasn't extremely impressed. This party regained us as a customer! All of our guests were so impressed as well. We all agreed Mura is the place to go for top notch sushi and sashimi! Can't thank and praise them enough! Going there this weekend! :)"], ["Robb E.", "Went there Friday with my wife and once again it was absolutely perfect. By far the best sushi in Raleigh."], ["Tracy V.", "Food and service were good. Ordered fried calamari and seaweed salad for appetizers - both were delicious.My bf had a bento box (wish the server would have mentioned it already included seaweed salad - but meh it wasnt a big deal).I ordered the grilled salmon which wasn't bad but nothing great to really point out.Our tab was around $90 before tip for the both of us.2 appetizers, 2 entrees, 2 drinks, 1 dessert. Overall, we enjoyed our experience and will be back again."], ["Peter Y.", "Mura is awesome!Great atmosphere with a spacious interior and plenty of seating, including the traditional low tables where you need to take off your shoes and sit cross-legged. The high ceilings and low hanging lights also add a touch of modernity to the restaurant.Our waiter had an extensive knowledge of the menu and was able to rattle off recommendations like there's no tomorrow. We went with the sashimi combo based on his recommendation, and then ordered a few rolls each.We tried 4 of their specialty rolls, the Mura, Piano, Volcano and Hurricane.My favorites were the Volcano (the diced tuna mix on top was SOO GOOOD) and the Hurricane (the shoestring potatoes were an awesome addition).The Piano was pretty good, while the Mura was just ok. The daikon and nori wrap didn't really mix well with the rest of the heavy protein. The sashimi plate was amazing. You can tell how fresh everything is just by the \"healthy color\" of each piece. I'm not normally a fan of sashimi, but loved theirs!!With a great atmosphere and service, and good food to boot, Mura should definitely be your next dining destination!"], ["Sean L.", "The food was excellent but the service left alot to be desired.  The wasabi was excellent .  Be prepared to wait..alot"], ["Michael H.", "Great sushi roll options for GF.  Good appetizer options for GF as well.  Ask what they are willing to sub out especially on appetizers.  Most of the subs are just leave off ponzu sauce and I'll go with GF soy sauce for that app.  The desert was a flourless torte but better than most other restaurants this one was not overly dense and was light and enjoyable.  Best part was Paul Bomar was there doing a jazz live music event so that made for great ambiance.  Very enjoyable meal, though a bit pricy.   Definitely a place to come for special occasions just not one I can afford more often."], ["Chris R.", "Food gets a 4, service gets a 2. I was at the sushi bar on a Monday night and it took almost 10 minutes for the server to take my drink order. The next beer I almost had to wait as long. I don't mind waiting, but to be ignored is another thing."], ["Allie F.", "I have ordered twice from Mura. Once was to go and the second time I dined in. I wasn't really impressed with their sushi but the calamari was wonderful. The service was also great both times. I'm mainly giving three stars because of the sushi, but the atmosphere is great for big groups and it is in a great location. I would give it another try for something else on the menu."], ["Paige H.", "Fabulous and fabulous service! I go here a the time, such a gem among the sushi restaurants in Raleigh!!"], ["Alisa H.", "Ive had better.  Sushi chefs were cutting sushi rolls through plastic wrap. Is that why im  having stomach pains right now? Veg tempura was over done,  not fluffy.   Next!"], ["Rob S.", "I stopped in for a dinner while travelling to the area on business.  The bartender Rob was very friendly and great service in general.  They had a great selection of fresh fish.  Everything was very good and they even had fresh wasabi which many sushi restaurants don't do.  I'll definitely be back next time I'm in town."], ["Aline S.", "Mura never disappoints this is always my 1st choice for sushi everything is fresh the staff are super friendly and patient.. The ambience is lovely and clean"], ["good food lover P.", "I don't know why it's taken me so long to write a review for Mura! I didn't like sushi (never had it and didn't like the thoughts of raw fish!) until about 10 years ago.  Until I found you can get some of the rolls with tempura fried seafood and came to love raw tuna. Soon thereafter we started going to Mura. I love Mura SO much, it has ruined other sushi places for me.  I've been to a couple of other high rated places while on vacation and they don't ever match up to Mura. We've taken company to Mura and some of those who hadn't tried sushi before were converts. My two favorite rolls are the super shrimp crunch and the screaming \"o\".  My husband's go to rolls are the hurricane and the piano. We also like the snapdragon.  Cocktails and wine all yummy. The only downside, it's pricey and can be a little slow. But, the presentation of the food is outstanding and perfection is not cheap or quick.  The wait staff all proficient and generally personable. Management checks in and are responsive to any comments.The thing I appreciate most about Mura is that they are consistent. Of the ? 30 times I've been there over the years, I have never had a bad meal.  Highly recommend."], ["Bil M.", "Had a lunch special here. It included several different types of sushi, none of which I liked."], ["Gary M.", "Excellent sushi. Huge, creative, fresh. Visiting Raleigh twice this month. Been there four times!"], ["Chip N.", "We always have a great time at Mura and last night was no exception. We managed to get squeezed in for a 6:45 reservation Friday even though they were busy. Hostess quickly took wife and I to corner table where Matt and other wait staff gave excellent service. As a past head waiter / bar tender I really appreciate good service and Mura has never disappointed us.Meal included calamari tempura with excellent sweet mustard sauce, edamame and Asahi beer. Garden and avocado / Asian pear salads with unique house dressing were beautiful as well as delicious. She enjoyed filet (a little too rare at first but then cooked to perfection) with truffle mashed potatoes and fried brussel sprouts. I had sesame crusted yellow fin tuna rare with wasabi cream noodles with red peppers with subtle spice and ginger sauce to dip tuna. Yum!Biggest problem we had was we ate too much because the fare was so delicious. Mura also has a popular martini bar as well. Convenient underground parking too."], ["Tara L.", "Mura was exactly what I needed after a long day of work and travel. I was staying next door at The Renaissance Hotel, so the restaurant was just a few paces away and provided me with my last stop of the day.If you're a fan of specialty rolls, dripping with ooey gooey sauces and loaded with all kinds of unexpected goodies, then you will have plenty of options here. And martinis. There are plenty of martinits and sushi here for you.I arrived just before close on a Monday night, so I was one of the only folks in the joint. Luckily, the service didn't suffer at all even though the atmosphere was a bit stagnant.The interior is cute and has a loungey vibe. There are are special tables in semi-private rooms where you can enjoy floor seating for a taste of the traditional amidst the trendiness.The sushi itself is good as well! I'm not always a fan of speciality rolls since they tend to be a bit heavy for my taste, but the Sin City Roll was fantastic; spicy tuna, cream cheese and avocado inside and topped with yellowfin tuna avocado, masago, black tobiko, eel sauce and spicy mayo.  Heavy, a bit. Delicious, oh yes."], ["Paul S.", "We decided on Mura after reading all of the excellent reviews, unfortunately it didn't meet our expectations based on those reviews.We went for an early lunch on a Saturday.  The decor and ambiance is nice and the restaurant is clean.  The Service overall was acceptable but our server did disappear on a couple of occasions when we needed assistance.I lived on the West coast for a considerable amount of time and as a result became accustomed to excellent sushi restaurants.  Having said that, the few dishes I tried at Mura were basic and didn't leave a lasting impression. We started with the miso soup which was very good, it had good flavor, I would have preferred more tofu but that's a personal preference.  Next was the appetizer, Yellowtail Carpaccio, this was a definite miss.  The dish was very simple and lacked presentation.  The Yellowtail seemed fresh enough but lacked in taste which was masked by the heavy use of ponzu.  We ordered special rolls for our main, I should mention that many of the rolls have either fried or seared components.  One of our rolls was topped with tuna but the tuna had been seared which wasn't indicated on the menu.  The rolls were acceptable but again lacked anything special that would separate them from a store-bought option, they were also rolled fairly loose and had a tendency to fall apart.I think your mileage will vary at Mura based upon your selection and sushi preferences.  I'm sure that they have some excellent dishes but we missed them on our visit."], ["Clarissa K.", "The Decor is splendid, almost boarder line over the top but then again, it is near the Renaissance Hotel *which is the reason why i ended up eating here.*I treated myself to lunch, it was pretty dead for 1 PM and on a Friday but i was seated and had a friend join me.We both got the bento box, with the Sin city sushi and some Miso Soup. the Miso tasted so off! i can't describe the flavor i tasted. I had to add soy sauce to get it down. The sushi was good. The bento though..A travesty. I got the tiniest dollop of sea weed salad and the ragoons were so soft...and not good soft, not even a bit of crunch. The price was kind of eye opening.I want to give this place a second try though, because i believe that all places have slow/off days.It's just not a good thing."], ["Ela G.", "Service was nice but the food was sub par. Since when does tepanyaki come with boring under done steamed vegetables and burned broccoli? we also ordered the bento box with filet mignon. The steak arrived nearly raw. The seaweed salad was coated in mayo. The wasabi relish was off putting. The sushi was fine. The tempura arrived cold. The shrimp firecracker was inedible, with a mystery mush that I later was told included scallops, shrimp and cream cheese. The fried rice was served under my raw filet, mushy, tepid, and tasted like garlic flavoring not authentic fried rice. The Manager tried to make things right which we appreciate but with such positive reviews I expected a more positive food quality experience. Meh."]], "Carolina Sushi & Roll": [], "Hibachi 88": [], "Sono": [["Dipti M.", "This is a nice place in Raleigh downtown with red interiors. I had the two vegetarian sushi rolls available on their menu. It was good but I felt it could have been better. I would also appreciate if they included more veggie options. The green tea mochi was good & I enjoyed it.Our waiter was very helpful in guiding us through the menu. However they brought the third course out while my husband was half way through his second course. That dint come across well. There is definitely room for improvement here."], ["Sofya K.", "Really fresh, interesting menu. The sashimi was great. One of the best order of scallops, with the chef taking the time to beautifully arrange. The service is a little bit on the slower side, but the waiter was super-nice."], ["Wood C.", "I've eaten here once before, and thought is was meh, but Susan had not, and wanted to try it. Note, that we haven't had anything better than Waraji in the Raleigh area, but we needed to give Waraji a break.We sat at the sushi bar and opened with miso soup, edamame, a glass of wine and Sapporo, on draft. She got the VIP roll, and I got the Hamachi Jalapeno roll, and the nigiri's ordered were snapper, big eye, salmon, and scallop.Simply, the quality of food was okay, portions were a tad skimpy, and pricing was on the high side. Ambiance was cold and dark, but the service was really good. Also, we both thought that their rice was good.Nonetheless, good rice and service will not get us to come back to Sono."], ["Rebecca F.", "So far, the BEST rolls I've found in the area! They aren't perfect yet, but they're getting better...I'm just not a fan of the fake crab in rolls really. I just wish instead of that maybe soft-shell crab or some tempura shrimp could make an appearance...but, despite that, still the best rolls we've found in the area! It'd be fun to explore more of their roll menu now that I know they have such potential!The nigiri salmon I had was of great quality too. There was a bit more vinegar in the rice than I prefer, but it was still very well done...well, not cooked well done, but made well ;)My husband works near Sono, and has chosen this as his go-to sushi spot now too. It definitely has potential...probably near to, or really as good as it gets in this area though! I'm still spoiled and missing the sushi scene of the Pacific Northwest I think!"], ["Karmilla C.", "Give a FIVE! Everything we ordered just so Perfect!!!!!! The stone BBQ beef, the spicy miso Ramen, and the KFC.... So full !!!!!!!! Have to come back soon :))"], ["Yeshanth J.", "We had come here to celebrate my birthday and it was a pleasant experience. I opted for the 4 course for $25 dollar Monday special. For appetizer, I had Tuna and Bread Crumb. I felt the dish was bit too raw. I like raw sushi(s) so I didn't have a problem. The next course was a sushi roll which was just nice. It was followed by Shoyu Ramen. I am not a fan of poached egg so I had to scoop it out.The third course arrived before I got done with my second. I didn't pay much heed to it. The last and final course was a red bean mochi ice-cream which was a best of the lot. Well presented. In my opinion, the 4 course meal was bit too much to digest all of them at one go.Service was courteous and our waiter was very helpful in letting us know what each dish contains and the way it is cooked. Not many know that. On one occasion when he didn't know, he didn't make it up but instead took to the kitchen to ask the chef.Bottomline: Good restaurant with limited vegetarian options, good service and decent ambience"], ["Amanda P.", "We went to Sono for Triangle Restaurant Week, and had the set menu.  I was really pleased to see that there was a vegan option for each course.  Not many places had any veg options for restaurant week.  We were a little disappointed that the actual menu was different from what was listed on the restaurant week website, but we decided to try it anyway.I'm still thinking about the seaweed salad that I had for the first course.  I'm struggling to describe this, because I've never had anything like it.  I was also pretty sure I wouldn't like it, which shows what I know, because I would gladly eat it all day.  I don't even know what was in it exactly.  It is mysterious and I love it.We had vegan sushi for the next course, which was the ratatouille roll (a traditional-style sushi roll, except instead of fish it has only veggies, seaweed, avocado, and rice) and inari (thin pockets of fried tofu filled with sushi rice).  I am generally not a sushi fan, except for inari, because it's really just tofu and rice, which is always okay with me.  However, I thought the ratatouille roll was good.  The seaweed flavor is still a little fishy for me, even though it doesn't have any fish in it.  I thought this was good as far as sushi goes.For the third course, we had General Tso's tofu.  This wasn't like other General Tso's tofu we've had; it was silken tempura tofu that came with tempura kale (or some other leafy green that looked a lot like kale).  The kale-like veggie was much too oily for me, but I gave it to my husband, who loved it.  The tofu was good but could have used a little more sauce.  Props to them, though, for being able to deep fry something as delicate as silken tofu--that takes some skill.I liked this place well enough, and I thought that the skill of the kitchen staff was easily apparent and warranted the price we paid.  I also liked the decor, which seems to have elicited mixed reactions from other reviewers.  However, the third course definitely fell a little short for me, and while I'd be happy eating just seaweed salad, I'd like to see more veg options on the regular menu."], ["Nancy T.", "I've been to Sono a handful of times and I always walk away fully satisfied.  This last time I went, my girlfriends and I made a special trip for their ramen noodle bowls and I was impressed!  Though the noodles are not made in-house, they are not the dried kind and the SOUP STOCK is what set it apart from other places.  I got the spicy miso ramen which uses the tonkatsu soup stock mixed with red miso paste and hot chili oil - it was deliciously spicy, the kind that makes your lips tingle and go slightly numb.  My friend got the tonkatsu and I stole a spoonful and the FLAVOUR blew me away.  It was full and creamy and savory - it was absolutely delicious.  The tonkatsu came with straight ramen noodles and I opted for the spicy miso ramen b/c it came with the curly ramen that has a little more of a chewy texture - I was totally a fan.  The first two times I came here was for their sushi and though I cannot recall the details to write here, I definitely remembered enjoying it - especially with their \"real\" wasabi (not the green processed stuff that we're all accustomed to seeing).  Good job Sono - you've made another fan, and I think I'll make it a point to come more often now.  :)"], ["Jennifer W.", "I would like to say that they did get us into the restaurant during Animazement and Memorial Weekend this year.  There was only 4 of us this year.  Everyone at my table ordered Sushi except for me.  I ordered Japanese Ramen.  The sushi was delicious and definitely the best I've tasted for Raleigh.  As for the Ramen, I think Sono just does not like me.  I ordered the ramen and I asked them to put the spices on the side.  They must have dumped a cup of hot spices into my soup because it was not edible.  I asked the waiter to take it back to the kitchen and he refused.  So while the sushi was delicious, we will not be returning next year, memorial day weekend to have any food at Sono.  I think we will go to a different restaurant where they don't dump a cup of hot chili powder into your ramen soup.  As a result, of the ramen noodle soup, Sono only gets upgraded to a 3 star."], ["Alex S.", "Literally the best food I've had in my life! Ramon, ishiyaki steak, all the sushi, everything was amazing!"], ["John H.", "Saturday, August 22, 2015. Temperature into the low 90s, at the high. Day turns to night, night turns to sushi, sushi turns to sake, sake enters my belly. Courtney, our waitress, very on top of her game although Corbin ALMOST ran out of wasabi relish(that stuff was ). That being said, stunning service. Rewinding a bit, it's restaurant week in Raleigh! \"Could you imagine how awesome high school would've been with these chairs?\" -Anna exclaimed. Speaking of the chairs, wow. Went to the bathroom, water flowed from the faucet in a unique manner, almost waterfall style, very cool. Btw food was really awesome I highly recommend this place for sushi, sake sake sake oi oi oi!"], ["Kathryn D.", "Wishing Yelp had half stars. I would give Sono 3.5 if I could. I've been here a few times for lunch and am torn.Pros:-Sushi is amazing! Presentation is nice, and it tastes delicious. The rolls are actually pretty big. I have never left hungry.-Great location, just a short walk from my office.-Nice atmosphere. You can get away with dressing up or dressing down.Cons:-Slow service. I've only been here during lunch, so maybe it's better at night when there are more servers? I'm not sure, but if you come here for lunch, plan to take the full hour.-Kind of expensive. No BOGO sushi like many other restaurants in the area. The lunch special is $14 and includes a large roll, salad and soup. Obviously, it's not difficult to find a cheaper option."], ["Andrew A.", "Sashimi was thick and delicious. Japanese curry was alright, and the screaming o (specialty roll) was good. Overall a good experience."], ["Stan U.", "Had an absolutely wonderful experience with some of the best service I've ever gotten! This was my first time at Sono but it won't be my last. My waitress was named Courtney and she was honestly one of the best servers I've ever had in my life. On top of being very friendly and attentive, she made stellar recommendations. I told her I loved Nigiri and was looking for a more traditional type of roll that wasn't smothered in sauce, and she recommended a chef's special rainbow roll. It was literally exactly what I was hoping for, so that was great. I also asked for a good white wine to go with it, and she recommended a Chardonnay (I am kicking myself for forgetting the name of it) because it would bring out the flavor of the fish without overpowering it, and that it wasn't overly acidic but finished smooth... And she was absolutely spot on! It was a great compliment to my sushi. The food came quickly and we always had everything we needed. The dining room has a nice atmosphere- nothing that will knock your socks off, but definitely a nice place. My only small criticism would be that their prices are slightly higher than you might expect. Not a big deal considering the quality of the food, but they are listed as  only being $$ here when they could easily be $$$. Nothing wrong with that, just something to be aware of. Overall, had an absolute top-notch experience with great food and service was on-point. Would highly recommend, and will definitely be back."], ["Jackie J.", "Best sushi in triangle area. Really fresh fish. Uni and scallops are the best. Just a little bit small therefore pricy."], ["JW C.", "By far and away, Sono is one of my favorite restaurants and places to be in downtown Raleigh. From the freshness and quality of the food, to the pleasantness and professionalism of the staff and service, my experience has always been exceptional. Even when I'm just there to grab a drink or two, the lively environment never fails to entertain.Last night, I had the pleasure of trying two of their newest highly-anticipated offerings: the TONKATSU RAMEN and KOREAN FRIED CHICKEN WINGS. Just thinking about these two dishes makes me drool with my eyes rolled back. The broth of the ramen has a richness in flavor that rivals world-renown establishments, such as Ippudo, while the noodles were on point in al dente wellness. Although it's a given that a good bowl of ramen should be judged primarily by its broth and noodles, what really put it over the top for me was the complexity of the rest of the ingredients. The black mushrooms, the bamboo chutes, the chasu pork, all provide their own depth of savoriness, while absorbing the broth to create a symphonic stroke of culinary genius in one bowl.As if my taste buds weren't already singing, the Korean Fried Chicken wings were a perfect compliment to the ramen, and took me back to my glory days living in Seoul. Crispy on the outside and juicy on the inside is what defines a great wing, but Sono kicks it up a notch with a garlic soy glaze that's a signature Korean kickback.Whether you're looking for traditional sushi or tasty rolls, the sushi chefs there will deliver. My personal favorite is the chirashi, which is basically a choice mix of fresh sashimi over rice. When I'm in roll-mode, my go-to favorites are the Twisted Mango and the Dragon. ...and this is what makes Sono special to me. The majority of sushi restaurants these days lean towards a more modern identity that focuses on specialty rolls. I'm not knocking this at all, but Sono is one of the few, if not only, that is creative enough to appeal to this new age palatte profile, while staying tried and true to traditional sushi. Compliments to the executive staff and ownership for embracing the new, while paying homage to the past. This is why Sono is the most popular Japanese restaurant in town."], ["Arshree C.", "They know what they're doing here. Ramen is delicious and they made the best Spider Roll I've ever had. Great vibe, decor and service. Not too loud so you can actually have a conversation."], ["Marissa S.", "The sushi here is good. Prices, not so much, and the service can be spotty. Angry Tuna Roll is very good and the Gyoza is wonderful. Just cringe a bit when the bill for the both is $22.  Having said that, there's not really a better choice for a sushi place in downtown Raleigh, so with this being the only option, it's not bad."], ["Paris E.", "My boyfriend took me to Sono for my birthday in 2014, our first experience was OUTSTANDING, the food was delicious and unforgettable. Well we returned almost a year later and when we arrived the menu was unrecognizable, talk about disappointed. I asked for the Potato Bisque soup that I can't get my mind off to this day and they no longer carry it, I nearly had a heart attack. I wish I could personally speak to a chef that could teach me how to cook it at home bc I can't find the recipe anywhere. 2 stars bc the changed the menu, I wish they would've kept it the same."], ["Tara C.", "I went here with my husband and a large group of our friends on a Saturday night.  We had a reservation and were seated right away.  Service was on the slow side, but that's understandable for a group of over a dozen people.  I would describe the atmosphere as trendy, but not pretentious.  Be aware that both drinks and food are on the pricey side, which is typical for downtown Raleigh.In terms of food, my husband and I ordered one of the ramen dishes, firecracker shrimp, the tuna ecstacy roll and the surf and turf roll. The ramen was absolutely fantastic, as was the surf and turf roll.  We don't usually order cooked rolls, but I'm really glad we did this time.  If I were to go back I would order the surf and turf again; that's how good it was. As for the ramen, my husband couldn't name a time when he had had better.  However, our other items were lackluster. The firecracker shrimp appetizer left a lot to be desired; it was pretty bland and we were both disappointed with it.  And the tuna ecstacy roll, while very fresh, lacked any sort of \"wow\" factor.Bottom line, give Sono a try.  And when you do, definitely order the ramen. Though their menu items are very much \"hit\"or \"miss,\" overall I enjoyed the experience and would go back again if I were in the area and in the mood for sushi."]], "Haru Sushi Japanese Restaurant": [["Jon L.", "Haru has been and continues to be my go to spot for sushi in Raleigh. We bring the family at least 2x per month, and always leave happy. And on occasion, we do takeout and the sushi travels well.In addition, they do a nice job on the hibachi items as well."], ["Anil O.", "Most reviewers seem to claim this is the best sushi in Raleigh. Travelling to Raleigh frequently for business, I am hoping this is not the case and I will find better options. I had the Sushi/Sashimi Chef's choice and was not impressed at all by the freshness of most of the fish, the rice or overall taste. Chef's choice of roll was something with asparagus and crab, not something I would have ordered."], ["Melissa W.", "I'm not a big sushi eater unless I can find some veggie rolls, which if you're like me, that is hard to find. This place had several to choose from however, which made me super happy! First I had the spring rolls - so fresh and amazing. Then I tried the buddah roll, which is avacado and honey roasted nuts, and the cucumber roll. Both were incredibly delish! My husband had the sushimi and was very pleased as well with the exception of them cutting him short on 18 pieces. He asked to substitute the shrimp with more fish but they didn't bring more and then blamed it on thick cuts of fish. That part was disappointing but overall our experience and food were were worth it. With the comfortable size (fits 40 at most),  quaint ambiance, and great food, we'll definitely be back!"], ["Alan M.", "They have changed their name, but it's same owner this was my first time and I tried the Scary Jerry roll, this is best sushi I have eaten. They use higher quality fish even the ginger is first quality. This is not a buy one get one free sushi restaurant but my one roll had 8 pieces it was all I could eat and it was $12.95. The owner trained in Japan for 2 years and has been in business at this location for 16 years. My wife and I will not be in a hurry to return to a buy one get one again we will definitely return here."], ["Brittany F.", "Now operating under the name \"Hako,\" this awesome sushi joint is the real deal - inventive rolls, fresh fish and affordable prices. Flying under the hotspot radar, its a hole in the wall with a fantastic and personable staff. It's like a Raleigh standard that has yet to be discovered by the masses. They start the dinner service with hot steamed towels (love it!). We ordered the clear hot soup, which was a rich mushroomy broth. Favorite rolls included the Buddha, honey salted peanuts and avocado - say what?!! - and Kamikaze, spicy tuna, yellowtail and salmon with a spicy mayo drizzle. They also have reward cards - spend $20 to get a stamp on your card. After the card has been filled, you get $20 off your next meal!Overall a terrific meal and possibly a new favorite sushi spot. Can't wait to go back!"], ["Clark W.", "Sushi - Terrible with a capital \"T\"; it's amazing that I have not contracted salmonella from the current outbreak in 9 other statesHibachi - a step up from the mall version, the food court version not Kanki's.Atmosphere - dated; ambiance - none; brand cohesion - confused.Service - inexcusably horrid.Don't waste your time or your money as my recent experience was so exaggeratedly horribly that it is worthy of an SNL skit at the very least."], ["Lizzie P.", "I really love this place! You always know what to expect when you walk in.  The wait staff is very friendly and attentive, and the food is good.I have tried the sushi and the hibachi.  I truly love them both, and I always have a hard time deciding which \"direction\" I should go in.  The hibachi is served piping hot, with meat and vegetables and it is served with the yum yum sauce that everybody loves.  The sushi is always very fresh, and I feel GREAT after eating it.  We normally start with a ginger salad as well, and it never disappoints."], ["Joy S.", "I always enjoy the sushi at Haru and wanted to give kudos to the staff from my last experience. The server was exceptionally nice and helped me make the right decision on how many rolls to order. I paid in cash and said to keep the change but she clarified when she realized I may have put down an extra $20 (which I had). Whenever I get sushi in Raleigh this is where I go!"], ["Chelia S.", "I went in on a Friday night and the place was a lot more empty than I expected. There was actually only one other table of people dining in. First of all, it's extremely small. With there being no one there, it had a cozy feel to it though. Even though it was tiny inside, the style of the restaurant was nice.I sat at the bar and had crab Rangoon as an appetizer and ginger chicken as my entree. The crab Rangoon was very fresh and really really good. The ginger chicken was good as well, served with rice and vegetables. They gave a LOT of food. My brothers ordered sushi platters and because it was a hibachi grill, they made these humongous sushi platters right in front of us. The chefs were very nice and checked on us a coupled of times. The waitress seemed a little hasty, but she got the job done nevertheless.I would recommend and return here..."], ["Quinton M.", "Haru has some of the freshest fish in Raleigh and often gets in the most unusual fish available in downtown. I would give them a 5 star, but the environment isn't up to the same standard as the food. The staff are super friendly and really want you to leave happy, but often they are understaffed so the wait can be unreasonably long. The sashimi is always great, the steamed shumai is some of the best I have had and the custom rolls are interesting. My wife and I also appreciate that they don't focus on fried rolls (if I wanted fried, I'd be eating at Bojangles or Beasleys). The \"Amazing Roll\" with eel and toro is a particular standout. Also the kampachi and fatty yellowtail are usually excellent sashimi choices.Pro Tip: If you are ordering for takeout (which I recommend) add 10-20 minutes for however much time they say it will take - trust me, you won't be early."], ["Will C.", "A purely service-related review here, but miserable enough to share as well as keep me and my group from ever returning.  Our server was incredibly rude from the start, complete with eye-rolling reluctance and neglect that was provoked by nothing but \"Please\" and \"Thank you\" from the table.  She delivered the hibachi dishes while both were still spattering scalding grease, despite which we patiently accepted.  Not having refilled my water during the whole meal, she proceeded to shush me when I asked politely.  This was probably my fault, as she was ON THE PHONE when she came by the table that time.  Finally, after the meal was over and we hadn't received any paper insult hats or discovered the hidden cameras, she proceeded to insult US by telling us she would never wait on us again if we were to return.  Don't worry, we ain't."], ["Chrisy T.", "Freedom Roll is probably top 3- of my favorite all time rolls! Chefs choice-Sashimi was amazing!"], ["Karthi N.", "Have been numerous times and feel this (next to Waraji) is the best place for Sushi in Raleigh.  Consistently very good to great food.  Have unique menu items like the fatty tuna, lobster, etc. that you won't find at other places.Biggest issue is slow service and that seems to have been better the last few times we went.  What kills me are the negative reviews on the food because that is far and away better than most places I've been to in the Triangle.  I can understand the bad reviews on service, however and hope that they continue to work on this."], ["Cal W.", "This place is by far the freshest and most consistently delicious sushi I've found in Raleigh.  I go here regularly for lunch and dinner, and the sushi is, without exception, excellent.   A caveat to this review is that I am giving only the sushi 5 stars.  At times, the service is somewhat slow on a busy night, but the high quality sushi does not change.  I always order the Kamikaze roll and salmon roll."], ["Snacks P.", "As many reviewers have said before. I hope too many people don't find out about this place, although the chefs and owners deserve it. Haru has the best sushi in town. They don't have buy one get one deals for a reason. And frankly, their sushi rolls are sizeable no matter how simple or complex you get them so you won't leave hungry. The quality of the fish here is the best I've come across. And the salmon sashimi simply butter."], ["Leigh A.", "I hesitate to write a review because I clearly disagree with the glorious reviews of this place, but how can somewhere with multiple 5-star ratings be empty at 7:30 pm? As one reviewer puts it, it's not a \"fancy, chic, upscale restaurant\", but is being the exact opposite something to be applauded? I don't care if a place isn't fancy or chic, I care about taste and this was gross - especially the tuna. However, my father liked it and ordered more, so perhaps I have entirely different preferences when it comes to sushi than a man that dips his rolls in spicy mayo instead of soy and uses chopsticks like a knife and fork to cut sushi pieces before he eats it.Down to the cheap straws in wrappers that were handed to us with the end of the straw and wrapper mysteriously cut off (how is that sanitary?), this place was a bust."], ["Laura B.", "I'll be honest, if you're looking for a fancy, chic, upscale restaurant, Haru may not be the right sushi place for you. It doesn't have the aesthetic that say, Sono, has. But, what Haru lacks in presentation, it makes up for in the quality of dishes offered. I've never had a bad roll here. I even tried the baby octopus one time and found it to be delightful! It was well cooked, so it wasn't too chewy, and that sweet brown sauce that it comes drizzled in is just to die for! If you just want to have a casual, laid back sushi dinner, and you don't want to run the risk of disappointing or unimaginative selection or sub par rolls, then Haru is just the hole-in-the-wall sushi place for you!"], ["Zoe Z.", "I was amused when a heavily loaded plate of suchi came in front of me. One of my male colleagues couldn't finish his too... That being said, fair price for a large food size! But the suchi itself are not as carefully prepared. The rice wrap very loosely around asparagus and the cucumber slices stuck out etc. They don't taste fresh either. Won't consider this a place to drive over for lunch."], ["Kathleen E.", "I hesitate to write a review, because I don't want more people to fall in love with Haru!  Before I first visited Haru, I was frustrated with the sushi scene in Raleigh - it's hard to find sushi restaurants that do it right.  Haru is not a big place, nor is it particularly fancy, but the food is excellent!  Like other reviewers have said, the service is somewhat slow, but it's always worth the wait. The sushi is not buy one, get one like many other places, but for a reason.  The quality of fish that you're getting is far beyond most other places in the area."], ["Roncel M.", "Located in a strip mall, this quaint little sushi var provided a cozy and warm atmosphere. It was empty with the exception of one couple sitting at a table. i sat at the counter\\bar watching the chefs prepare my meal. The staff was very polite and tentative. I sampled the Crab Rangoon which was unexpectedly warm and fresh. My sushi platter was prepared neatly and very cold. I like cold sushi. The food was delicious and full of flavor.Overall a great experience. (12/29/12)"], ["Gina B.", "Finally made it out to Haru after all these years. Ok, I think they have only been open for 2 yrs, but that is way too long in my estimation. Haru doesn't have much in the way of ambience, but the sushi was pretty good for the money. They don't offer any buy 1; get 1. Of course, you often sacrifice the size of the slice when that is offered.We thought the restaurant smelled rather fishy, but the sushi was fresh. Also, the ladies bathroom door wasn't lock, so knock first before you walk in on someone like several people did."], ["Norma G.", "Haru Sushi is my go to sushi place. I actually drive by Waraji to get here. It is cozy, service is fast and efficient, and the fish is fresh and cold (the way it should be). My favorite items are the spicy seafood soup (a meal in itself), and the amazing roll. Plain sashimi is great too. They have a loyalty card that gets stamped each time you spend over $20. After 10 stamps you get $20 off. It is worth the drive. Plus, if you need dessert you can walk over to the french pastry shop. Love it!"], ["CC K.", "We eat here often, almost once a week.  We always receive friendly, great service, and the food is fresh and varied.  My partner loves the sushi variety and quality, and I always enjoy the sushi dinner, letting the chef choose since I have trouble making decisions from the variety.  Its interior is like a jewel box.  When they have king mackerel, order it, sushi or sashimi....."], ["Mary elizabeth W.", "Fist isn't as fresh as it used to be.  On my last two visits while most of my order was fresh there were a couple of pieces that tasted past their prime."], ["Dave J.", "Took the family to Haru on Saturday night and the place was busy but not so busy that we had to wait in line. Here's what we had and how we liked it. I'm not usually a fan of tempura but I decided to have the tempura scallops and it was great with big juicy scallops, brocoli and sweet potato all given the tempura treatment. My youngest son had the hibatchi shrimp and loved it. My wife and one son had sushi rolls and said they liked them, but not as much as our usual sushi place. So, I've giving three stars. This is an A-OK place and we'll be back."], ["Darrin P.", "Wish I had something nice to say about this place but when your server would rather spend his time in the kitchen goofing off than bringing us our drinks and taking our order it makes it very hard find anything nice to say.  After waiting 30 mins for him to bring us our drinks, we just got up and left. Sorry but I'm not on a server's schedule.  I don't mind a wait if the place is busy but there was hardly anyone in the place. No excuse in treating customers like that.  Don't waste your time or money at this place. Wish I could give 0 stars."], ["Lindsay S.", "Had a nice lunch here last week.  It is definitely a little hole in the wall, but the experience was pretty good.  Glenwood Village, on the corner of Oberlin and Glenwood, has all these random little places that are certainly better than they appear.  It has pretty standard decor and not much for ambiance, but the staff is all super friendly and quite attentive.  I noticed that their menu, in its entirety has quite an array of choices so much that it seemed overwhelming.  Their bar is small, but appears to be well-stocked with lots of beers and wines.  The sushi chefs appeared pretty into what they were doing as well.  I thought, for lunch, it was a tad pricey for me considering lunch specials are supposed to be well \"specials\" and a deal.  My choice was the Sushi Combo: Crunchy Spicy Salmon Roll, California Roll, Avocado Roll for $9.95.  That price isn't so bad, but the avocado wasn't awesome and the other rolls were kind of standard.  My friend got the Sushi and Sashimi Lunch Special which was Chef's choice of sushi & sashimi for $12.95.  Each order also came with Miso soup.  Overall, I'd say quite enjoyable, but not out of this world."], ["Ha N.", "I haven't had the rolls here, but from my first impression of the rolls section of the menu, I don't think this would be the place to get rolls. One of my friends that was there with me got some rolls and was underwhelmed. I, however, saw the selection of sashimi and nigiri and I was ecstatic. Whenever I go out to eat sushi, I always look for sea urchin, sweet/blue shrimp and my first (sashimi) love, hamachi. Those things were great here. It was fresh-tasting and served at the right temperature. I don't know if I can stress enough how much I hate warm/room-temp sushi at other places. I suggest that you go here for sashimi, not rolls. The service was great and the waiter that we got seemed very knowledgeable about the sashimi options as he answered all our questions promptly and in detail. We also brought our own wasabi and he was very intrigued, which sparked a conversation about his preferred wasabi, etc...Maybe we came in when they were a little slow, but the service made the experience a lot better for me. It was a little pricey, though, and is not a place that I would frequent because I'm a semi-broke college student. But, when I'm craving some good sashimi, this is one of the places I consider going to."], ["Sasha N.", "I've only eaten here once, but it was a good enough experience to make it my new #1 sushi spot in Raleigh. Very generous and thick cuts on the sashimi, and the sushi was also excellent. Miso was a little over salted but rich and satisfying. We had the sushi combo and the chirashi don and both were satisfying in portions and everything was very fresh. My only complaint here would be presentation. I really love how chirashi comes in a bowl on top of rice, and here they placed it beside a sculpted mound of rice. Not a big deal really, but...    I didn't try the rolls out so no comments on that. This was definitely a japanese run establishment, maybe even family run - a cute and intimate hole in the wall in the mall beside harris teeter. Well worth a try and so much more cozy than the yuppie bar scene of Sono. Better sushi too."], ["Amanda H.", "Wow - did I eat at the same place as my fellow Yelpers? A professed sushi fiend, I'm always down to try a new purveyor of all things raw. So we roll into Haru for lunch and are one of only two groups in the place. I should have known something was up when my hot tea wreaked oddly of something decidedly... not tea-y. Got the feeling I might've just paid a buck seventy five for dishwater?? Next came my roll, and I use that term loosely - not the most expert job there, it was sort of falling apart and - SURPRISE! - not what I ordered. My Crazy Spicy Salmon roll featured imitation crab meat. Not a lick of salmon in that puppy (believe me, I checked). So as not to be totally negative, I did like the ginger dressing here. And that's all I have to say about that."], ["KK W.", "I wish this place was downtown in a flashy building, then it might get more business.  But this place is all about the sushi.  No frills, good food.  I was reminded of this the other night when we ordered four rolls (totaling just $29), and they were all HUGE and delicious.  I have been increasingly disappointed with the other sushi places and their small rolls.  I recently went to both Sushi Blues and Shaba Shabu, and complained that their roll sizes have decreased, perhaps because of the prevalence of half priced rolls.  both places denied it but if you want to get your money's worth and get some great, delicious sushi, go to Haru."], ["Sam C.", "Went there for dinner, and waited 2 hours and got NOTHING!!!!!!!!! This place obviously has no management and should be closed. Never go HERE ever unless you like terrible service and no food."], ["Kia H.", "I give this restaurant 3 stars because the food was very good, but the customer service was so-so. Our waiter started as semi -interested in us at best. He later warmed up and I was able to explain to him what my food allergies are and asked if he could check to see if what I ordered was safe for me. He agreed, advised that I was safe and advised that none of the ingredient in question was in the dish.Meal time: My fiance never recieved appetizer and about 2 - 3 hrs later, I experienced the worst allergic reaction than I had in years. Wish the waiter was more knowledgeable or cared enough to get the correct information. Next time, it could be someone's life. Not mine though, not going back."], ["Jenny S.", "I lived literally across the street from Haru for several years and it is one of my favorite spots for sushi in the area. I have never had a bad experience there. Everything is so good, from the octopus salad, to the Amazing roll (totally lives up to its name). I tend to stick with the sushi rather than other entrees so I cannot give reviews for that. It's not super cheap, but definitely comparable to other sushi restaurants in the area, and cheaper than some. I like that they serve beer and sake, and it is very reasonably priced also. I've ordered to-go food several times and they have never screwed up my order. Not once. Hugely impressive to me since I know a lot of places half-ass to-go food since most to-go customers don't tip (I do, but I've worked in the industry too long). I love that it's so small and cozy (tucked right next to Glenwood Grille). There is plenty of parking, also a plus. It's quiet enough to really enjoy conversation with your friends or a date. The staff is friendly and I like that you can sit at the bar and watch them actually prepare your rolls if you like, or even ask for recommendations. Long story short: 5 stars, because I've never been disappointed. Every time I take a Haru virgin to eat there, they end up wanting to go back, and that's really the best recommendation I can imagine."], ["Xamul V.", "Oh man, I don't know where to start.  Everything was off.  The rice was off, the fish was off, and the whole atmosphere was off.First off (pun intended), the rice was way off.  We must have gotten the previous day's rice or something because it was the wrong consistency and it just fell apart.  You almost had to eat the sushi with a spoon.  Good sushi rice should hold it's form and it's texture should be solid but smooth.Secondly, the fish was way off.  The tuna neither looked fresh nor smelled fresh.  We actually returned it after taking a bite out of it.  Of course, the waitress glared at us and completely denied it's non-freshness, but that's beside the point.  The salmon was the same.  It was actually lukewarm.  Maybe their bar fridge was broken?  Either way, we didn't feel comfortable eating some of the fish.The atmosphere reminded me of a take-out Chinese restaurant.  The sushi chefs were conversing loudly with one another and there was practically no ambiance.The only positive I could gather from the whole experience was that I didn't suffer food poisoning.I'd usually like to give restaurants second chances, but I think I'll pass on this one."], ["Ron W.", "Tucked away in Glenwood Village (next to Harris Teeter), Haru dishes out pretty decent Japanese food.  The space is small and cozy with a sushi bar in back.  I'm not a big sushi fan and ordered up some salmon hibachi instead.  Nothing much to brag about, but tasty.  My lunch-mates gave mixed reviews on the sushi.  Overall it's an ok spot if you're in that area of Glenwood: too far away from S. Glenwood for Sushi Blues and not close enough to Crabtree Valley for Kanki's.  Haru will satisfy your hunger but it probably won't blow away your tastebuds!"], ["Joy I.", "I have enjoyed several dinners here.  The service is professional, prompt, and unobtrusive.  The food is always fresh and delicious.  Ssshh... Don't tell everyone.  It might get too crowded!"], ["Alejandro F.", "I thought this was a great place. I went with my parents and we had a good experience. Initially, we started with what we always start at a sushi restaurant, a vegetable tempura appetizer, which we accompanied with our respective drinks, green tea, Japanese beer, and sake. So far, everything good. For our main course we got a sushi & sashimi combination and a couple of rolls, a rainbow and an orange dragon roll. I have to say I liked the sushi, the rice had a good taste and consistency and so did the fish, which is very important to me. Compared to other places I've been in Raleigh, this is probably on of the best, but also one of the priciest ones. Additionally, I have to say that although the service was not the fastest, it was good, plus time goes by fast when you are enjoying the conversations you're having. One thing is for sure, we came out full."], ["Sara D.", "Loved this place. Found it by accident when searching for cupcake shops with my boyfriend...the cupcake shop was closed so we decided to get sushi instead. I ended up getting chicken teriyaki which was delicious - sauce was not too thick and very delicious. He got a couple sushi rolls (don't remember which ones) and said everything was good and tasted really fresh. Service was good and the atmosphere was quiet and quaint. Good date spot. I will probably go back if I'm back on that side of Raleigh."], ["Asher S.", "I want to like Haru, but their rolls always come with too much tempura flakes, making me feel like I'm eating a french fry roll instead of say, a special california roll.  Their nigiri is quite flavorful, though their sushi rice has never impressed me.  The service is usually very good.Also, if my memory serves me, they have a \"ponzu scheme\", as my friend named it.  Check out my reviews of Mura and Sushi-Thai Raleigh if you want to know about Ponzu Schemes.Another note is that if you don't know the area, it's hard to find.  Try to print out a map and arrive early if you can."], ["Jeff S.", "I enjoy sushi and find myself at a sushi bar at least 2-3 times a month. This was my first experience at Haru. Unfortunately, our server was not pleasant. She almost made me feel as though it was an inconvenience that we had come in. Sushi was good and reasonably priced. The patrons at the bar seemed to enjoy the sushi chefs more. If there is a next time we will sit there."], ["Trey B.", "This is a really good sushi spot.  They have excellent sushi, great service and they are very friendly.  I am not sure that it is the best sushi in town but pretty darn close.  This place is not for everybody.  It is more of an old school sushi place. It's the kind of place that you go and actually have a good conversation with people.  There are no TV's and the music is very soft.  The bottom line is that it is a great sushi spot to take friends that you actually enjoy talking too.  Otherwise go to a place with lots of TV's and loud music."], ["Melodie S.", "Hooray-rolls! A friend recommended we pop in kinda late last night for dinner. So glad we did. Nice spot, very clean and comfortable surroundings. Sushi came out quickly and exactly as ordered. I am a huge sushi snob, if I can write a review of a sushi joint without some sort of condescending remark, they have to be doing something right. Will be back."], ["Sara B.", "This is my very favorite sushi joint in Raleigh and it is a hole in the wall and a gem of a little spot. I have NEVER ever ever ever (and i've been here a bunch) had a bad sushi experience here. Ever. The sushi is extremely fresh, the chefs are nice, the rolls are unbelievable, especially the Amazing Roll-which is truly amazing-which you can order with Toro and it is simply melt in your mouth delish. They have a decent wine list-love the Charles Krug Sauvignon Blanc :) The waitstaff can be a bit strapped since there aren't that many servers but they work hard and are attentive. I can say that I have never eaten anything other than sushi so I can't speak to the other menu items-other than the seaweed salad which is great! I have also never been for lunch. But if you haven't been here yet for dinner you might want to go however the beauty of this place is that it isn't well known and is kind of tucked away so you never have to wait for a table ;)"], ["Michael C.", "Ok - I finally got to eat at Haru, after living 2 blocks away for just about a year. I have to say, I'm sorry I waited this long. Coming from LA, the land of sushi joints on every block, I have high sushi standards. And in LA, cheap yet GOOD sushi is readily available. Not so much in Raleigh. However, Haru comes close to fitting the bill. We shared 2 of the more \"deluxe\" rolls - the Rainbow and the Phoenix. The fish was fresh and delicious, with that wonderful melt-in-your-mouth quality I look for at a good sushi joint. We also shared quite a few (six, maybe) regular rolls (dynamite, spider, etc). Again - very fresh and delicious fish, and not too much unnecessary sauces. We also each had 2 hand rolls. Delicious! The sushi and rolls were served very nicely on 2 very large plates - very appetizing. Oh, and we also ordered dumplings as an appetizer. Yeah, it was a lot of food for two. :) But we hadn't had sushi in 6 months! Total was just over $80, which also included a large Kirin beer. While not \"cheap,\" it was definitely more than reasonable for the quality and the quantity of sushi served. That being said, service was quite slow, but VERY friendly. We will definitely be returning as regulars, and not simply because it's down the street. Excellent!"], ["Curtis O.", "Haru serves up some of the tastiest sushi that I've had in Raleigh in my five years living here.  The staff is friendly, service excellent, and sushi quality seems to be consistent.  I often sit at the bar, and the sushi chefs are happy to discuss their best offerings that day and make recommendations.  Overall, I would definitely recommend this place for a good sushi dinner."]], "Sushi O Bistro and Sushi Bar": [["Alec J.", "I love the healthy competition between Sushi O & Sushi Blues right across the street.  However, Sushi O always wins my vote.  Not only is the food better, in my opinion, but the service and speed is always better as well.  Sushi Blues is often times packed, whereas Sushi O almost never has a wait time and service is prompt.  I would personally recommend the Deep Ocean & the Volcano.  I'm sure by now you are already aware that the sushi is BOGO.  ;)"], ["Becky F.", "Really pretty place, neat atmosphere, but the Sushi was just so-so.  This is one of those BOGO Sushi places that load their sushi with rice, with very little fish and veggies inside.  I really prefer melt in your mouth high quality sushi rolls over picking rice off the roll to get down to some flavor and texture.  Other than that though, the service was good and the atmosphere was cool but as the rating says, \"meh, I've experienced better.\""], ["Brittany B.", "I give this restaurant five stars because the service was good and sushi AMAZING every time I've gone. I love sushi and it's the best I've had (besides Kanki). It's always buy one, get one free and not too expensive. The bagel roll and tigress roll are my favorites! The atmosphere is nice and relaxing too."], ["Renee S.", "It's the little things in life that make you smile. And tonight... BOTH low sodium soy AND regular soy sauce on every table at Sushi O; a real (and rare) treat in North Carolina where salt (sodium) and pork are king. Off to a good start Sushi O. Sushi O is in a small(ish) downtown space and was pretty packed at 8Pm(ish) on Saturday night. There isn't a real waiting space inside the restaurant so I'd recommend calling ahead. We didn't because we randomly chose Sushi O given its Glenwood location (and my increasing hunger) and my dim view of nearby local favorite Sushi Blues. We sat at the sushi bar with our bartender serving as both bartender and server somewhat. The space is quite small - it felt a bit claustrophobic and chaotic with servers and patrons alike trying to move around in the cramped space. My coat got knocked off my chair a couple of times by servers and when leaving I felt a bit like a rat in a maze, doing the awkward \"you first. No, after you.\" dance with anyone else that was up and about as well. We ordered three rolls and of course their names escape me now but one was a spicy tuna roll with tempura, another had scallops with crab on top with spicy mayo and masago, and the third and also the most unique was yellow and flat. All were pretty tasty, not spectacular, but colorfully innovatory and a little on the pricey side- whatever, I ended up stuffed. I was happily surprised or appalled - not sure which yet, that the menu was diverse and had a few Vietnamese and other Asian dishes. I'd like to come back and try the pho. I was eyeing it at another table and it looked yummy so I will definitely try it. I'll let you know.But for now I agree with Jane Y, 3.5 to 3.75 stars."], ["Esther L.", "I was looking for good, cheap sushi on a recent trip, and Sushi O fit the bill. I sat on the patio and took advantage of the everyday 2-for-1 special, sampling the nigiri. My discounted choices were salmon and white tuna, and then I ordered an extra yellowtail nigiri to top it off. I was disappointed to learn from the server that yellowtail was on the list of options exempt from 2-for-1, as the menu didn't include the information. The fish was fresh and had a sweetness to it that I appreciated. The rice, on the other hand, was a bit warmer than I prefer, and it may have been overseasoned. The flavor of the rice distracted from the fish, at times. I appreciated the abundance of carrot-ginger dressing on the house salad, as I often have to stretch the dollop to make it last for the whole dish, at other restaurants.The service was attentive--perhaps overly so for a nearby table, as they were asked frequently if they were ready to order. Water refills were plentiful, and the server was friendly. I felt comfortable dining and catching up on work on the patio."], ["Gilles S.", "Terrible place. I ordered Hibachi chicken, which was served rather cold. Telling my waiter he replied with \"sorry\". I asked for brown rice and received white, when they brought the brown, it was cold. Telling them that, they brought out white rice. Can they not get an order straight? Girlfriend ordered sushi which was alright, but definitely not a place you should visit- unless mediocre is your type of dining experience."], ["Nikki C.", "Great atmosphere and very delightful service staff.  I arrived 15 minutes before closing time and they were still very very nice.  The sushi was a little on the fishy side even for sushi (I ordered Crunch Tuna and California Roll).  My Appletini was filled to the brim :-)  and who wouldn't like that! lol"], ["RJ H.", "I think under normal circumstances, Sushi O might perform a little better.  So I'm going to give them another try.  We went in during Snowmageddon 2014 so I'll give them a pass on the slow service since it was one of the few restaurants actually open on Thursday night and it was pretty busy.  The Tom Yum soup was really good; probably one of the better versions I've had; the cup-sized portion was pretty huge and definitely a good value for $5.95.  The Japanese onion soup was decent; light delicate onion flavor in an opaque broth with a single slice of mushroom...  The sushi rolls, however, were fairly disappointing.  We tried The O, The Mermaid, The Tigress, and the Super.  It's a good thing these rolls are BOGO, because if not, there's no way I'd ever go back with prices from $13.95-$16.95.  The rolls are small for their price and compared to other sushi restaurants.  They were also pretty poorly constructed.  Most of our rolls fell apart upon picking them up.  I probably used my bare hands more than my chopsticks to accommodate their loose construction.  In terms of flavor, The O was pretty disappointing; the Mermaid, Super, and Tigress were good, but not anything very special.  Overall, meh...  Hopefully it'll be better next time."], ["Chris C.", "Fantastic!  My buddy and I were cruising sunday night looking for a spot to grab a bite.  Most things were closed, but Sushi O was open.  We walked in, were seated promptly by a lovely young lady.  Hannah took great care of us at the bar, the Sushi chef's behind the bar were great, and the drinks were fantastic.  Best thing... the sushi.  I've been to many sushi bars that claim great stuff, Sushi O lives up to it.  I own a restaurant, and I hope that the quality of my staff and food, is always as well done as Sushi O's.  Well done people.  Well done. Chris"], ["Matt M.", "I went to this place all the time with my girlfriend while I lived in Raleigh.  As a college student on a budget.  The 4-6:30 bogo special was awesome and their sushi is so much better than Sushi Blues... which everyone seems to think is the shit for some reason.  I wouldn't call myself an expert on the finer qualities of sushi, but I have tried sushi at some great places in San Francisco and New York.  Anyways Sushi O is my go-to place for sushi in Raleigh.  The rice is good quality, fish is fresh, and its fucking delicious.  They also have a creative drink menu and a great atmosphere."], ["Barbara C.", "First, we went to another Sushi place before settling on Sushi O. Our intention was to dine at Sushi O but during our walk we encountered Sushi Blues and wanted to give them a try. We never even got asked for drink orders - read my review for details. Sushi O however, we had prompt and accurate service with a good salad, good miso soup, great presentation and quality of sushi, and very affordable prices. Overall, exceeded expectations and made for a pleasant meal! Seating and tables were also comfortable and clean. Outside bistro was cute though we ate inside. We WILL visit again!"], ["Richard G.", "Nice people, food is good and not over priced. For what it cost, it is the best sushi experience you can have in Raleigh unless you want to pay much more."], ["Jane Y.", "3.5!!!!!We went on a Saturday night and it was PACKED.We got sat at that corner \"i hate you so much\" table - but the service was attentive despite the full house and chaos.We got three rolls, the Mt Fuji, Mermaid and T.S. I must say, all were pretty good and creative. The fish tasted fresh enough*, the huge 10 piece roll took over the whole diagonal length of the square plate (review Pythagorean theorem). One thing that was different, was they used asparagus instead of cucumbers for two of the rolls. It was tasty.A lot of the rolls on the menu, however were either shrimp tempura or deep fried. This is NOT your japanese mama's house. This is a \"I'm not japanese, but I'm trying to seem culturally aware by liking sushi\" house. I think the three we ordered were the few non-fried ones. It was also a little heavy on the rice, which is a bummer.*Fresh Enough: not the freshest fish from the sea, but good enough so you won't be in the bathroom the whole night and next morning."], ["Meghan B.", "I have enjoyed lunch at Sushi O on several occasions. Up until a couple of weeks ago, they offered 25% off at lunch. Now they do BOGO sushi. Be aware that they don't let you have a 'to go' box with the BOGO sushi. However, the waitress was really nice and let me do it since I didn't know. The sushi, I have to say, is slightly better than average. I say that because the rice is the correct temperature and nicely flavored. However, on one occasion when I had tuna nigri the fish looked like it had been cut with a chainsaw. That may have just been a fluke since other times the fish has been nicely cut, if a little too thick. I particularly enjoyed the spicy tuna roll.  And if you want to know, I prefer the term 'sushi nerd' to 'sushi snob.' :) The service has been great. My water is always kept topped off, but they do not impose too much. It's a pet peeve of mine to have a waiter constantly checking in. The best servers know how to read body language to know when you need something and the wait staff at Sushi O is quite adept at that. There is usually street parking on Glenwood Ave. Just don't come too late since there are several restaurants in the area that all serve lunch."], ["Alyson T.", "A great restaurant set in an intimate atmosphere.  The food is delicious with a lot of unique sushi rolls on the menu. I recommend this place to all of my clients!"], ["Kyle B.", "Helpful staff. Free validated parking behind the place in the deck nxt to oyster bar"], ["Chris P.", "What a great surprise!  Sushi is a passion for me, and discovering this wonderful new place was quite by accident.  I was downtown most of the afternoon for business, and I had a meeting next door at Tobacco Road later that evening.  I was starving, and the sushi bars that I ordinarily visit are in N. Raleigh.  So, when I pulled up on S. Glenwood forty five minutes early for my meeting, I spotted this new Sushi Bar right beside Tobacco Road. The atmosphere was warm and intimate, and the Bar area was lovely.  Although I like rolls on occasion, I really enjoy Sashimi the most.   It's also impossible to hide anything when there's nothing more than you and the fish!  So, I ordered my favorites along with hot green tea and hot Saki.  Everything was excellent!  Fish was fresh and delicious, great service, lovely presentation, and to top it off, all of their sushi/sashimi is half price from 5:00 PM to 6:30 PM.  Loved it, recommend it highly!!"], ["Bridgette R.", "This place could easily be called Sushi Oh No! I bought a living social coupon as I am always in search of a yummy Asian restaurant.  My 3 year old and I decided to eat there before we hit the museums downtown.  I had my eye on one of their soup.  I will be glad to take some responsibility for ordering something other than sushi at a place called SUSHI O but hey, their menu had a lot more so. . .anyway, before I ordered the shrimp tempura and I politely asked the waitress if she could make some substitutions for my little one.  She cheerily agreed. I asked what vegetables come with it.  \"Sweet Potato, carrots, mushrooms, onion and green bell pepper\".  I asked to omit onions and green peppers and add more sweet potato.  She put the order in and eventually returned to take our order.  I ordered the squid salad as an appetizer from the sushi bar and the spicy noodle soup.  According to the description it was a rice noodle served in a delicious spicy chicken broth, served with napa, onion, scallion, calamari, shrimp, mussels and scallop. Mmm.  The waitress warned me that it was REALLY SPICY.  I replied, \"As it should be\".  We smiled and off she went to put our order in.  More time passes - I realize this was not going to be a fast lunch and settled in as my daughter busied herself looking out the huge plate glass window at the passing cars.  Finally the tempura comes. She plops it on the table and says, \"Oh yeah, there is broccoli and zucchini too, I hope that is okay\".  REALLY?  I guess she forgot it was for my 3 year old.  I asked, \"And the shrimp is. . .\"  \"Oh, Oh (that is where the O in Sushi O comes from) umm, I'll go get those\".  There was no mushrooms and one carrot but thankfully there were 3 pieces of sweet potato so it was not a total loss.  She happily munched on the sweet potato (her favorite) and when the shrimp came out it WAS VERY DELICIOUS.  Best tempura shrimp I've had in awhile, in fact.  I waited, waited, waited and here comes the soup.  Wait, where is my squid salad? \"Oh, Oh (see?  what did I tell you?) ummm, let me check on that.  She walks to the right of us and goes out of sight at the sushi bar.  Within 2 minutes she shows up with my squid salad that I wished I had for an appetizer.  \"They were behind on their tickets\".  I look around and see one couple in the restaurant who are finishing their meal.   Outside there are two tables (of two people each) and they have their order already. . .Okay. There was plenty of squid - it was a tad dry and not anything worth describing.  The soup - - oh my goodness but the broth was beautifully bright red and peppery!  It was a great temperature.  Hot but not boiling and perfectly seasoned with garlic.  The baby bok choy was tender crisp, as it should be.  I ate my 3 small shrimp - which were sweet and firm - they know their shrimp!  I ate my 2 green mussels and my 3 pieces of squid (what?  that's the cheapest item - I was expecting way more than that in a $10 bowl of soup), lots of nappa, plenty of scallions but NO SCALLOP.  Really?  Not even one piece?  Augh.  I know it's last on the list so I did not expect more than two pieces but COME ON.  Sigh.  At least I will have my lovely rice noodles. I dig into the broth and out comes UDON. Yup, my least favorite noodle - the sticky, fat, wheat noodle.  I motion to the waitress and point out the mistake.  She looks at it and says, \"Oh, Oh (that's getting old) so do you want me to take it back or something?\".  Sigh. \"Well, I'm actually running out of time with my 3 year old.  I'll just eat around it, but you might want to let the cook know about the mistake.\"  I show her the menu and she says.  (Come on say it with me) \"Oh, oh, I never noticed that on the menu before\".  She runs back to the kitchen and I kid you not, here is the quote word for word.  She looks into my eyes and says, \"Those are RICE udon noodles\".  REALLY? REALLY?  I am half Korean. I am 44. I have eaten more varieties of noodles than anyone really should.  I know what a rice noodle is.  I definitely know what an UDON noodle is.  I was no longer feeling cordial.  I looked at her and confidently said.  THIS IS NOT A RICE NOODLE.  You should change your menu.  After all, people have gluten allergies for crying out loud.  So I finished the broth and left the noodles, paid my $20 check after the coupon and saw the 18% tip she's allowed.  She better be glad because I would have left her a much smaller amount.  Maybe their sushi is tops, I don't know and I won't ever know because I won't go back.  I don't like restaurants who lie to their customers and I have no patience for inept waitresses who do not write down orders.  I also did not like the long wait when there were so few customers in there.  You've been warned.  (PS  There are rice Udon noodles available out there but it's usually made 1/2 wheat and 1/2 brown rice- I don't know a 100% rice noodle in existence)."], ["Hilary M.", "I've tried this place twice, most recently on Friday night.  I want to like it but the sushi has been on the disappointing side!  It has a nice sushi bar, with decent drink specials.  The sushi looks pretty but the taste isn't anything great in my opinion.  I had the Wasabi roll last and that has been the best so far!!  The Alaskan I had left a lot to be desired, not much taste.   The service is decent."], ["Scott M.", "Good sushi for the price, best buy one get one in town."]], "Orchid Japanese Restaurant": [["Rhoda G.", "I was craving some Japanese for lunch and found this place on Yelp. When we got there around 1 pm, I was surprised to find All You Can Eat (AYCE) buffet. We paid close to $17 per person and I think it's worth it. You can make your own sushi with the listed ingredients (at least 2 rolls every time you order) and offer nigiri and another rolls. I wasn't really fan of the fried sushi rolls. Also on the AYCE menu, you can get appetizers, udon, and dessert. Surprisingly the service was really fast. They bring it to you once something is ready, not all at once. After 2 rounds, I was definitely stuffed and ended my meal with some green tea ice cream. Overall, the quality of the sushi was great. It wasn't the prettiest looking sushi but that's fine with me. Just as long it tastes good!"], ["Sasha G.", "Went here for the first time with high expectations. Ordered a variety of food from the appetizers to sushi and sashimi. The staff was very friendly. For $25 AYCE vs. spending $25 on an Asian meal elsewhere - I would select the $25 elsewhere. You are likely to get better quality food somewhere else without the all you can eat and probably eat the same amount."], ["Marielle T.", "My family and I went for dinner and we all 3 opted for the buffet- I read way too many yelp reviews and heard too many good things from people- so couldn't resist! $25 a person is definitely reasonable!Overall experience: 5/5 stars.Detailed rating while it's fresh on my mind... Literally.. Just got home.. (out of 5 stars):::Service: 5/5 starsGreeted immediately & Smiles all around from the minute we came in! Such sweet girls, I think summer was our servers name! Very attentive! No rolls left behind or forgotten! Always someone walking around or at the ready to come to our table! Encouraged to take our time and enjoy!Also- very fast! From the sushi chefs to the appetizers coming from the kitchen to the scoops of red bean ice cream that we could not keep ourselves from getting additional servings of! Options/menu selection: 5 starsLots to choose from! Their dinner buffet menu had at least 12 or so specialties, a build your own section** ((my dream come true)), sashimi section, a sushi/nigiri section.  Then there was also the kitchen menu that had over 20 or so items including miso, salad, tempura, skewers, sesame chicken, spring rolls, etc.  If anyone complains about the portions they're crazy or need to work on a new healthy lifestyle change..!  Sushi rolls were the norm portion about 6 pieces per roll.  The appetizers came out on smaller plates which I loved!  Not too much to where you feel bad that you waste it but just enough for a good portion to share and get a little taste- and hell if it's not enough, order a second helping!!!  Rather not waste a huge buffet family sized portion!What you do to order is write what you would like to order on these dry erase style menus. we marked by a tally.. And the server would make your dreams come true. Simple! Sushi quality: 4/5 starsDad knows sushi, I let him do the honors of rating this piece of the review.  (He took the first bite of sushi and did his: grumble, grumble hmm it's good!) which is A+ for dad to do! (He's not easily excitable at all.. Trust me it's a good sign)!Ambiance: 4.5 starsI like that there was a large entry way & that everyone in the restaurant could somewhat see the sushi chefs at work! Quaint is a word I would use! & what you'd expect from a strip mall restaurant.Dessert 4/5 stars:included in the buffet price, chocolate, strawberry, vanilla, red bean, & green tea ice cream.  We tried the red bean & green tea- winner: red bean! Both were nice and refreshing in a little 1/2 cup serving (which like I said, I prefer so I don't feel obligated to eat or waste if too much!) they got second helpings... I stole a few bites.. Just a few..Just stop reading, have a positive mindset and don't dwell on the fact that there is a definite negative connotation when you hear sushi and buffet in the same sentence and just trust me- go try it!!!"], ["Jonathan G.", "This is my favorite sushi place in Raleigh, maybe my favorite place period. The sushi is high quality, house special rolls are inventive, and the hot appetizers are fantastic. Lots of high notes - best ginger dressing in town, seaweed salad as good as any, piping hot crispy gyozo better than any I've paid $9 for at other sushi places, shumai is amazing, pepper tuna roll is creative and has well developed layers of flavor, and the king kong roll is the best fried roll in town (no soggy batter here). I can even create my own roll - fried shrimp, cream cheese, and jalapeños. (we call it the Jonathan roll)All you can eat usually means luke warm and uninteresting, but at Orchid, my food, as much as I want, is made fresh as I order it. We just agreed on one low price up front. Honestly, I often compare other sushi places to here as a standard - if its more than $25, no matter how good, I could have gone to Orchid instead (even though its 25 minutes from home).I'm not sure why I've never written a review for Orchid before, as I recommend it to everyone and have been more times than I can remember. I finally decided to write one today, no because I went there, but because I had a contrasting poor experience at another asian restaurant across town. The details aren't important (in another review) but someone suggested that perhaps it was a cultural thing and they just didn't know they made people feel unwelcome. This made me think about my favorite thing about my times at Orchid - I always feel welcome, and am always greeted with a smile like I'm family. My waitress remembers me by first name, knows what I drink, and loves to play with my kids. There's never a moment she's not smiling, and I always feel appreciated. Great food, warm, inviting service, and a good deal. Keep it going my friends."], ["Tiffany C.", "This ALL YOU CAN EAT sushi buffet costs $24.95 per person at dinner, but you can surely eat much more than that money's worth of food. It's not the typical buffet where you hand-pick sushi from a serving line. Instead, you indicate the quantity of each sushi/food option you want on paper, and a server comes take your order. Their menu is pretty extensive, and the beauty of AYCE is that you can try as much variety to your heart's content. Ordering ensures that your food be fresh, but the caveat is the possibly long wait time. In my experience, we ordered a large quantity of food (at least 60 sashimis & 40 sushi rolls), and it took 15-20 minutes for our first sushi to come out. Hearsay says that this is longer than normal, and that the service is usually pretty efficient. Our sushi rolls came out on a large platter. The plating was not anything impressive, but the presentation did not look sloppy either. Our sashimis came out on another plate: Our order of 60 salmon and tuna sashimis may sound like a hefty meal, but each piece was about half the size of an average sashimi slice. I am unsure whether these halved slices were due to our whopping order or whether that is just how it is done here at Orchid. Either way, if you are hungry for more, just place another order. Just make sure you finish everything on your table lest you be charged for uneaten food... Our sushi roll pieces were also small, but you can say that they were comfortably bite-sized. Each unagi roll was like a slightly enlarged tater tot. They could have cut larger slices of eel because the proportion of rice to fish was a bit high. My favorite of the night was the Rainbow Roll - sushi with crabmeat, avocado, and cucumber topped with salmon, tuna and white fish. As a devotee of the dear avocado, I was very pleased with the avacadoes in my sushi. They were bright yellow and green in color and creamy and smooth in taste. Texture was rich, mildly sweet, and each slice melted delicately in my mouth. Aside from the specialty rolls, the menu also offers options for simple sushi rolls: if you want nothing more but rice and your perfect avacado, just order the \"avacado roll.\" There is even an option to create your own sushi roll out of 2-3 sushi items: shrimp tempura, cucumber, crab meat, eel, shrimp, etc. There is also plenty of appetizers and cooked food options in case you are not feeling the raw fish. Stir-fried noodle, spicy shrimp, and steak are some to name a few. Dinner was satisfactory, but the dessert was not. As a table of green tea ice cream enthusiasts, we were quite disappointed with the green tea ice cream here. There was an overwhelming taste of milk, sugar, and cream that drowned out the authentic green tea flavor. Rumor has it though that the tea flavor was more accentuated in the past. The red bean ice cream was not better - it tasted more like vanilla ice cream to me than anything else. Overall, Orchid is not a bad place to go for some casual sushi, so if you are in the mood, grab some friends and check this place out!"], ["Susan P.", "Service: Attentive and friendly. The appetizers come quick, but the sushi takes a while, like we were there an hour and a half for 2 rounds of sushi awhile.  We were careful how we ordered the first round because anything you don't eat ends up added to the bill.Food:  The appetizers are small and flavor was lacking on a lot of them.  Whatever shrimp will be the same popcorn like fried shrimp with a different sauce.  Calamari is more tempura than squid.  The sashimi is really small, but you can order lots of it.  Most of it was good.  When the menu say 5-8 pieces per sushi roll, expect 5.  I almost never dip rolls in soy sauce or add wasabi, but I had to do both here to give some of the rolls any flavor.  If it's not a spicy roll, expect a bland rice roll.  The spicy ones were just ok.  Even the ice cream seemed a bit skimped on when the strawberry was just vanilla with strawberry syrup."], ["Mo Y.", "After visiting this place a couple of times for lunch I can give a fair assessment of my experiences here. The concept is great but the execution is horrible.  The service is slow and the waiters spent more time telling us not to waste food than actually bringing us food. Absolutely rude and annoying! The wait to receive the rolls ordered was extremely long both visits. Not recommended,  save your time and money. They should focus on serving not insulting guests."], ["Amanda M.", "Don't go. Very little actual fish and tons of rice. The staff were very nice but it just isn't good."], ["Maggie L.", "Mmm. Very good all you can eat. I went for my birthday with friends who liked Asian food/sushi and friends who were kind of scared to try raw fish. All of us ended up having a really good time. The all you can eat menu includes everything from specialty sushi rolls, to create-your-own rolls, to steak, to dumplings, ice cream, noodles, you name it! Large variety and everything is made to order and very fast. No wait when we went on a weekend for dinner! Decent pricing--about $25 per person for the all you can eat. Check it out!"], ["Sean A.", "Gotta love the all you can eat. Comes with a drink and you can order sushi, sashimi, etc. 16.99 lunch on weekdays and I believe 18.99 for dinner weekdays. Not sure about weekends"], ["Jon O.", "I went here for the all you can eat lunch sushi buffet and it was pretty decent for what it was. The sushi rolls themselves are fired out fairly quickly after you place your order and while they are not all done up with fancy decorations or a lot of flare they are well enough made for the price you pay. The menu also has a great selection for a sushi buffet. The only other comparison I have is a place in Charlotte that is seriously lacking when compared to Orchid here. They also have no qualms about bringing out whatever or however much you would like from the buffet menu. Also, 5 different types of ice cream. That alone will make me want to go back here to try some more items out."], ["Rudy F.", "The sushi here is pretty good. I went here for lunch and had the AYCE. The sushi was of good quality. I particularly liked the build your own sushi! The appetizers were good too, although I've had better shrimp tempura. The lunch buffet included a drink which was nice. The decor was nice and quiet, and not obnoxious. The staff was friendly and the service was good. If you are going to order the deep fried sushi make sure you have enough food because it takes a lot of time to prepare. Unfortunately they did not have all the flavors of ice cream, so we had to settle for red bean. Overall it was a good experience! :)"], ["Cassandra C.", "We come from a city that boasts a lot of all-you-can-eat sushi, so we were pretty pleased to finally find a place in the Triangle that does it. It's usually a pretty decent deal and it's fun - you get to try lots of different things typically for a lower price than if you ordered them all off the menu. We went on a Wednesday evening around 5pm as we were in the area that afternoon. When we came in there was only one other table filled, but by the time we left it was quite busy. The dinner AYCE is $25.95 pp and includes soft drinks or tea. We got started by ordering sweet potato tempura (my fave!), shrimp tempura, and gyoza. The tempura was good, not too oily and very hot. The gyoza were average, nothing special. We then moved on to the sushi menu - my husband ordered tuna and tamago nigiri (both were good, average size). They offer lots of different sushi rolls - regular one-ingredient rolls, specialty rolls, and make your own rolls, where you can select two or three ingredients to roll together. In our experience, the make your own were MUCH better than the special rolls. Of the special rolls, we ordered the Hawaiian roll which was topped with a lot of coconut sauce, Pepper Tuna roll topped with a lot of sriracha, and a Honey Bee roll topped with lots of honey-mustard (I think) sauce. The special rolls were all drenched in their respective sauces which was not to our tastes, but seems to be very common in the Triangle. The make your own rolls came out sometimes topped with eel sauce and sometimes bare. All rolls were inside out (i.e., rice on the outside rather than seaweed) which was a bit surprising but didn't affect the taste. We didn't find the rolls were mostly rice as other reviews indicate. All ingredients tasted fresh, especially the fish. After we ate way too much sushi, we ordered shrimp shumai (not very good, and greasy) and another order of sweet potato tempura which was very different from our first order - dripping with grease and not as tasty. We finished our meal with green tea and my husband had a scoop of green tea ice cream (included in the AYCE), which he said was pretty good. With tax and tip our total was around $64, which is a little expensive for a regular outing but it was for a birthday so not bad for a special occasion. I probably wouldn't go again, but the sushi was on par with other sushi options in the Triangle and the novelty of it is fun once in a while."], ["Grace W.", "I love sushi. I often have strange cravings, and feel the need to dive into a sushi boat head first and solely consume the entire thing. But there's one issue with my dream. Sushi is hella expensive! That's why I love this place. You pay a set price (about $16 for lunch, and $25 for dinner) and can literally consume a sushi boat (minus the boat, mind you). The food is of great quality and arrives at your table relatively quickly. The atmosphere is very casual, and the restaurant is pretty tiny, allowing it to feel intimate. The only thing I wasn't such a fan of was the service. Our waitress was more concerned with making sure we knew not to waste any food than with taking our order. She actually got into a bit of an argument with the patrons across from us! All in all, great quality sushi for a reasonable price, although the service might not be top notch. I would recommend to all sushi lovers!"], ["Dallas A.", "Best sushi deal I know of: $16 dollars to eat all you want at lunch, no buffets involved. You order from a menu and they'll keep bringing them out until you've achieved sushi bliss. :)Sushi is excellent, service is top notch. Decor is muted and quiet, which is a welcome break from flashy neon 'Hibachi' joints with poor food. Makes the sushi pop even more."], ["Chuck N.", "We ate so much salmon that they started halving our pieces and counting them as one, and they did this twice!  By the end of our meal, our served salmon was still defrosting!The menu is plentiful and the rolls are delicious and infinite as long as your stomach can keep up!  I didn't expect quality AYCE sushi in Raleigh, I was wrong, Orchid is great!"], ["Nancy T.", "All you can eat made to order sushi and sashimi including any appetizers, non-alcoholic drinks and dessert for less than $30 is such a great deal. I liked the customized sushi rolls that I could create to order. The ambiance is very nice and they were able to accommodate a party of 12 ppl very easily. The service was fast and I like how they don't waste paper and use the re-usable laminated order cards with erasable marker. The sashimi was melt in your mouth delish (I ordered quite a bit of this) and liked the variety of apps like the udon noodles, tempura sweet potatoes, ribeye steak and shrimp sides. Never used the lights on the table - they could prob do away with those but interesting concept. Bonus- Red bean ice cream takes me back to childhood :)"], ["Christopher H.", "No one to greet at door, had to wait. Green tea was so bad it made me sick to my stomach. Miso soup was decent. Sushi rice was bland and overlooked. Sushi rolls and specialty rolls were undersized for the price."], ["Char D.", "horriable. i throw out twice after i ate the spicy tuna and spicy salmon rolls (5:30am and 8:30 am). my boyfriend also keep going to the restroom after that. Their rolls are more  spicy than other sushi bar. I think they just want to cover the bad smell of the UNfresh fish. i will Never Never never never come back again. ｉam sosososooso angry and i need to see the doctor！ｉ feel so sick and angry！ therefore i register an yelp account to share this unhappy experimence！ how dare they give expired food to costumer ! (I took a rest for one day already and i still cant focus on my homework because my headache. I must see the doctor omg )"], ["Sharon H.", "Best part about this restaurant was how ridiculously fast the food came out! We got some BOGO rolls and drunken noodles. The rolls were good- not the best I've had but the roll with mango and the one with jalepeno were delicious. The drunken noodles had a strong basil taste to them, but overall, it was really good. It comes with both chicken and shrimp. Servers were courteous and we had a great experience at Orchid!"], ["Mage L.", "I had heard Orchid was All You Can Eat sushi for $24.  This was intriguing, but then I found out that they had lunch AYCE for only $14.  I really couldn't pass this up, so my husband and I arranged to meet for lunch on Friday.Upon being seated, we were given two sheets of paper and a pencil, and we were told to fill in the quantity for each selection. We were also informed they had a regular menu that was priced per dish, but it was basically the same items that were on the AYCE menu. My husband was checking for tonkatsu, since it's his favorite Japanese dish, but unfortunately they didn't have it.  I checked the menu prior, and I figured there would be enough other cooked food he could probably find something he would eat.I picked out a tuna nigiri, inarizushi (tofu skin with rice inside), the peanut and avocado rolls, and the spicy yellowtail rolls.  I also got the miso soup as an appetizer, some edamame to share, a seaweed salad, and some red bean ice cream for dessert.  My husband picked out an order of spring rolls, gyoza, the steak teriyaki, and green tea ice cream.We were given some extra ordering sheets and were told that if we wanted more food at any time, to just fill out the sheet and press the light and the waiter would come to fill our order.  I don't have a whole lot of time for lunch though, so we just decided what we ordered should be enough.The edamame came out first, and it was typical edamame.  It was warm and salted, and it tasted just like edamame normally does.  The soup came out a bit later, and it was a bit sparse for miso soup, lacking in tofu and seaweed.  But it wasn't bad.  The salad came out as a garden salad, not the seaweed salad I had ordered, but my husband ate it and said it was good.  I didn't want to bother ordering the seaweed salad again since I had probably already ordered more than enough to fill our appetites. The spring rolls were a bit doughy but still good, and the gyoza was quite tasty, exactly what I wanted the gyoza to taste like.  All the food ended up coming fairly quickly, except for the ice cream.  My sushi came out in a nice, large platter, nicely organized.  The avocado peanut rolls looked as weird as they tasted, yet I ate them all.  There's something oddly good about them.  The tuna and tofu nigiri were pretty good.  The spicy yellowtail roll ended up looking and tasting something like shredded yellowtail, mixed in with chili mayo.  I was a bit disappointed they didn't have full yellowtail nigiri, but I found out later they offer additional rolls and nigiri in the dinner meal.  I guess that's why they charge $24 for dinner and only $14 for lunch.My husband's steak teriyaki was a really small portion.  I guess the benefit is you have enough room to try everything they offer there.  It was good, but not really enough for a full meal size.  But at least we ordered enough other food, it wasn't as if my husband could possibly walk away from the meal hungry.It took a while for the ice cream and bill to come out.  I guess they were surprised we weren't ordering more food.  But I really liked the ice cream, it had small chunks of real red bean in it.  My husband's green tea wasn't as good to me, but he said he liked it better.$14 would be more than I usually spend at lunch, but I thought the quality and quantity of food was decent enough that it was worth it.  I wouldn't mind coming back again for the dinner $24 AYCE, since the dinner menu would include the yellowtail nigiri that I love so much.  The trick will be trying to get my husband to come back, since they don't have tonkatsu like they do at Yuri."], ["Derek R.", "The best all you can eat sushi place I've ever had. They do have a limited selection to choose from, but I always leave full. The appetizers are great as well, especially the spicy shrimp, calamari, and steak. Top it off with ice cream and you're good to go!"], ["Julia H.", "I'd been craving sushi for a few days when a review of Orchid popped up, and then I knew that settling myself down for some serious eating was in my near future!The spouse and I stopped by on a Tuesday for a late lunch, and Orchid did not disappoint at all. We decided on the all-you-can-eat option for the variety, and started with the seaweed salad. Wow, what a portion! I almost regretted ordering it because that alone could do as a lunch for me -- fortunately, I'd skipped breakfast. We moved on to the shrimp tempura roll (delicious, with crispy cucumber to complement the crispy shrimp), eel and avocado roll (eel was tender and not bony at all), mixed vegetable roll (with carrot, avocado and. . .lettuce?), peanut avocado roll (not a peanut sauce like I thought, but with whole roasted peanuts!) and -- my favourite of favourites -- sweet potato tempura roll! So. Good. We finished off with the deliciously astringent green tea ice cream and richly luscious red bean ice cream.I'd wanted to try the udon, but there was a bit of a language barrier with the waitress and I was unable to get across that what I wanted to know was if the *broth* for the udon was made with meat, not what meats I could choose to come with it. I did find out that the vegetable dumplings contain shrimp, so vegetarians take note. *Note -- the dumplings are now shrimp-free, and are delicious!*The decor was spare, with a colour scheme verging on cold, but not to the point of blandness; not exactly romantic yet neither cheap-looking. Service was very good, with the mix of attentiveness and know-when-to-let-them-eat that I find preferable, and there were plenty of choices for everyone from vegans to hardcore meat addicts with options for every level of appetite. The price was right for a nice lunch, and the extended dinner menu looks to be a good value for the cost as well. We're already planning to go back and give that a whirl, too, once my appetite has recovered!"], ["Eric S.", "Great service, the staff are extremely polite and friendly, the food is wonderful, always made to order. They have wonder presentation too, which is a plus. The decor is limited, but still nice, atmosphere is calm on slow nights and lively on the busy nights, I would recommend this place to anyone that's ready to try REAL sushi and sashimi in Raleigh."], ["Kelly P.", "This place is actually really nice for an all-u-can-eatThe food was really fresh and things came out accordingly .... We didn't have to wait toooo long for sushi ( you know how that can get)YOu guys must try their secrete menu: stir-fried eggnoodle!!! (don't tell them I told you) hahahaha.... Chao Fun is also delicious but not part of all-u-can-eat. their steak kabobs were soooo good I still think about it... oh and try the coconut shrimp (yummm)"], ["Terri T.", "Party of four, 3 had the buffet, one ordered off the menu, all left happy. The miso soup was delicately flavored, like it's supposed to be, it was very good. The pork dumplings were tasty but just a tad greasy, room for improvement there. The tempura shrimp and calamari were just about perfect. The sesame chicken alone is worth the trip. We shared several rolls. I created one with cream cheese, crab meat, and jalapeno and it was good! A sushi jalapeno popper! The Hawaiian roll and the volcano roll stand out as particularly good. The udon noodles were really nice, I can see myself getting that as a take out order on a cold winter day. Also had the red bean ice cream.. yum! The only thing that would have made it better is if the red bean ice cream was mochi ice cream. The wait staff was friendly and very helpful. I love the way they do the buffet. You don't go up to a table and get the food, you order it freshly made from the wait staff and when you're ready for more, you press on a little light at your table and they are there in a flash to take your order. Well thought out. I am by no means a sushi expert, and I won't pretend to be. I thought this was good fresh food at a reasonable price, done in a very clever way. Looking around the restaurant there seemed to be a number of people who felt the same way. It's a nice place to spend an evening with friends."], ["Sean H.", "I've been here twice now, and each time I am really surprised by how great the selection, quality, and especially the value is here.  But I don't use the word value in the negative sense that it might make one think:  This is really, really good sushi.  Made to order, tons of variety, really fun and inventive rolls, lots of appetizers and great starters (the gyoza here are especially great).  Just a really good restaurant, that with or without the great buffet deal, I'd be coming to regularly.  The fact I can stuff my face (responsibly so without wasting of course) just makes it all that much sweeter.  Really good stuff."], ["Shauna G.", "This place is great! I've never been to a sushi buffet where you could get fish without the rice! Not sure how they make money but we'll be back!"], ["Mark W.", "I've been to Orchid four times now, with a different group of people each time. Everyone I have gone with has enjoyed the experience of AYCE sushi. Generally AYCE restaurants only appeal to me for variety because I don't enjoy stuffing myself, but Orchid has a nicely varied menu available to select from.The appetizer menu has some good choices, but I wouldn't recommend the miso soup. The soup almost feels like instant; normally miso soup will cloud up in a very distinct pattern if you let it sit for a few minutes, but my soup just seemed to separate. On the other hand, the salmon teriyaki appetizer and the tempura (try requesting vegetables!) are great. I love being able to order small plates of each appetizer that I find interesting without racking up a huge bill.The sushi and sashimi section of the menu also has good variety, but they do tend to stick with more common ingredients. I haven't personally noticed much of a difference between the quality of common sushi around the triangle, and the quality at Orchid has been fine for me. Strangely enough, you can order sashimi for both Inari and Tamago, but I definitely still prefer the sushi version for these. The rainbow roll comes topped with three different kinds of fish (two pieces of sushi per type of fish) and is fun to order for a table. The owners and wait staff are friendly and attentive, and I'm sure I'll be back to Orchid again."], ["Nathan H.", "Got takeout. The service was good and the sushi (spicy tuna roll, spicy girl roll, King Kong roll) was average. The King Kong roll was the best of the three. The other two, while flavorful, were a little too slimy. So far the best sushi places I've found in Raleigh are Haru and Mura."], ["James G.", "I've been twice so far, and am impressed.Excellent food and service! The all-you-can-eat sushi menu is extensive, well priced, and a good deal!The fish is fresh and delicious, and the chef's special rolls are well seasoned.The staff is courteous and professional. Great service."], ["Amanda R.", "I'm in love. Pure, unfiltered, sushi love.A few months ago I bought the Living Social deal for this restaurant. When I logged on this morning I saw today was the last day to use it. So, off to the car I ran to enjoy this restaurant once and for all for an impromptu lunch outing.I had $30 to spend. I was on a quest. I sat down for their Lunch Buffet (which, is not actually a buffet at all!) at $13.95 a person. I was given options of sushi rolls, individual pieces, soups, salads, appetizers, noodle dishes, ice cream and more. I was a little blown away at first.So first things first, I ordered glass of Pinot Grigo (to help work up to my $30 and wino facade) and looked at my choices. Upon deciding I got to press this SWEET touch light to let the waitress know I was ready. Aside from the food and service, this touch light impressed me the most. Really. How smart!I received a ton of food. A TON OF FOOD. I was able to try and taste various items of the menu and was pleased with everything. Their spicy tuna and spicy salmon rolls are delicious! And, for those of you spice freaks like myself, you should know that they are not entirely spicy - yet still tasty!My waitress came back and asked what else I wanted. \"Are you serious? I'm stuffed!\" But let it be known, when they say \"All You Can Eat\" they mean just that: All You Can Eat!My total was only around $20 at this point so I ordered a few rolls to take home to snack on later and that completed my transaction.This was by far one of the most filling lunch specials I've found in the area. When you decide to go make sure you go with ample time and your thanksgiving stretchy pants."], ["Susan Z.", "$24 for all-you-can-eat (AYCE) to-order sushi buffet!  Our group of six rolled in like John Wayne, hellbent on testing Orchid's AYCE limits.  The decor was aesthetically pleasing, very minimalistic & airy.  A couple of peeps noticed the paintings were not straight & thought the lights were a tad too bright.  I personally thought the lights were fine and was too short to notice the paintings.We were all impressed with the quality & quantity of food.  The service was great, our waters were regularly filled, they made vegetable tempura (not on the menu) by request.  The salmon, tuna, eel, and tofu skin sashimi/sushi (nigiri) was great.  I also enjoyed the squid.  Veggie tempura was a hit. The dragon specialty roll was delicious.  Their seaweed salad was also refreshing.  Those who tried the teriyaki said that the beef was better than the chicken, but that both were good.  There are 3 types of ice cream for dessert:  matcha green tea, red bean, and vanilla.  I liked the green tea best.All in all, I was very impressed.  The quality of the sashimi & sushi here is on par with most sushi restaurants in the triangle (Shiki, Sushi Blues, Sushi Love).  The $24/person seems steep at first glance, but I'd pay almost that for most BOGO sushi  places for dinner without getting 1/2 of the food.I will for sure be visiting & HIGHLY recommend Orchid."], ["Stephanie F.", "I don't know if I can stress this enough, but seriously, Zee is the man! Anyway, moving onto other more pressing matters:The green tea? AwesomeThe miso soup? DelishThe sushi? So fresh and yummyThe rolls? Specialty and regular, very good!The beef teriyaki skewers? So goodBut the salmon teriyaki is a never changing part of the order every time!And don't forget to save room for ice cream ;)And all of that for lunch at only $13.95/person?? Yes, please!Thank you so much Zee and everyone else who works at orchid!!! Love u guys!"], ["Jane Y.", "Ok, I know people are dying for reviews on this place, so here goes mine.On a Sunday night, it was pretty empty. Probably because people are trying to kill each other at the mall on the last Sunday before Xmas. We sat at the sushi bar, because I always like to see what other people ordered. I'm nosy. Our waitress was really nice. She was a total chinese mum who talked to us softly and smiled A LOT. We ordered the hot green tea that she had never failed to refill. The green tea was also japanese matcha (not powdered), which I love!! The seaweed salad was on a bed of julienne cucumbers, your typical flavour - Yummy. The gyoza was chinese style pan fried, and plump with pork. The gyoza dipping sauce was sweet/sour soy sauce, YUMMMM. We got the shrimp udon, which was stir-fryed with veggies (asparagus, carrot, zucchini) and big shrimp. NOT your dinky baby shrimp. It was also de-veined, which I've found some chinese restaurants not doing = PLUS. It wasn't oily or sticky. The teriyaki Salmon was placed on a bed of steamed veggies and a scoop of rice. The salmon had that amazing grilled \"crust\", that gave it that smoky flavour. It was glazed with delicious teriyaki sauce, not too sweet or salty. Really good.These \"entrees\" were brought out in small portioned, which I really love because they don't force you to gorge yourself one single entree. This gives you room to try a lot of different stuff!We got a bunch of sashimi, which were really fresh. The white tuna was delicious!!! The squid was sweet. We must have ended up getting 30+ pieces. So awesome.We also got the spider roll, and two other fancy rolls.I think the rolls are of equivalent to sushi love - Size and Quality.  The roll with the mango sauce was very good. The mango sauce is actually mango puree. =DI've never been to a made to order sushi buffet before, and I have really enjoyed their food. But make sure you come in with a HUGE appetite because the pricing is a little stiff. You basically end up paying $30/pp (incl tax and tip). They also have a non-buffet menu that is basically the same thing as the buffet menu, but might be a better choice for people with smaller appetites.I can't afford this as a regular, but definitely a special *binge* event place. =)"], ["Kaitlyn M.", "The value here is amazing and the sushi is everything you could hope for.  Now, I'm saying that because anytime my boyfriend and I walk into a BOGO sushi restaurant we end up spending $50 at least anyway.  But for $24 a person to order ANYTHING you want, including the gyoza and the seaweed salad and dessert, now we don't go anywhere else.  The service is incredibly friendly and speedy, and everything I've ordered here is delicious and well-prepared."], ["Thu D.", "I love this place! I eat here everytime I'm in Raleigh. The sushi is fresh and the price is worth the endless amounts of appetizers, sushi, and other entree you can order. The staff is nice and thr atmosphere is pretty laid back"], ["Gregory H.", "What can I say here that anyone else hasn't already said?  Susan Z points out the $24 all you can eat sushi made to order buffet concept (closer to $30 after tax and tip).  Hot Green tea that rarely got close to the bottom of the cup, awesome spicy tuna rolls, fresh and tasty sashimi pieces.  This place was a terrific hit for myself, my little girl and a good friend from church for an after church lunch while the ladies went to hang out with each other in Wake Forest.  Oh, and thanks to Living Social, this was not as expensive as it could have been.No sneeze guards here, just fresh made right out of the prep area sushi."], ["CM P.", "not as good as before, all sushi we order were poorly made; the rice were all loosely rolled,  they all taste okay. someone told me they have new owner now? new chefs too?"], ["A D.", "I went there once. Its not that much to choose from. I wasn't impressed. Nice concept. But when i order the same thing twice i felt a little uncomfortable that they didn't want me to order more."]], "Kome Asian Cuisine": [["Jocelyn Y.", "Super worth it if you come for ayce sushi at lunch. I want to say it's about $10 and comes with soup and an appetizer. Not worth it for dinner when it's $20 unless you can eat a lot. They do bogo sushi anyway and I'd just get that. I don't know how many rolls we got but I made sure I got my money's worth and was dead after. Like I couldn't move and just wanted to curl up in a ball and sleep. They do charge extra if you have leftovers but they've never charged me for not eating all that extra rice. I'll be back for lunch!"], ["Anastasia B.", "We went for AYCE sushi lunch. Just because you can, doesn't mean you should."], ["Pamela R.", "Really like Kome.  I was going to another Asian establishment that I was not too keen on then switched to Kome.  Love their General Tso's Chicken and Hibachi Chicken with some sort of special sauce  that is out of control delicious.  I am eying their sushi next."], ["Crystal J.", "I am updating the review because I finally went to try the sushi bar here. I don't live near here. I only work near here, so I usually only get take-out for lunch. HOWEVER, the \"all you can eat sushi\" signs finally lured me in. So, w/ the all you can eat sushi special you get an app and a soup and all the sushi you want from a designated list of sushi rolls. There were a good amount of rolls to choose from- I'd say about 20-25? If you want something that is not on the list, you can just order rolls separately. They are BOGO. I did not want any soup, so the waiter allowed me to order 2 apps- I ordered the gyoza and the crab Rangoon- pretty standard and delish. On to the rolls! Each roll was about 6 pieces. I'm not sure if you order BOGO rolls if there will be more pieces. I ordered the Raleigh Roll, Crunchy Roll, Philadelphia Roll and the Chicken Tempura roll. All this food only set me back $10.95. I believe it's 19.95 for dinner. All were delish, really. I was surprised! I thought value sushi  would be blah, but it's just as good as the places I go to downtown.  I might even be inclined to make the trek from where I live in N Raleigh to eat here for dinner w/ family and friends. Since this was my first time \"dining-in\" I can now comment on service.  There were about 9 other tables seated and only 1 waiter! But he did well, he was very efficient and I never felt neglected. I heard him describing dishes to other guests, so he knows his stuff! And a closing note- I still love the Mongolian beef! I've since tried the general tsao and chicken and broccoli and they were pretty standard/good. However, I just love how everything tastes fresh!"], ["Juliette M.", "No. Just no. Was hopeful since it's so close, but it was awful. Presentation was sloppy, and food tasted like dirt. Made me sick to think about-we got sushi. Ginger salad was a pile of iceberg with tons of water in the bowl. Not good."], ["Shelley K.", "We were VERY disappointed with the food and service. I ordered the Rainbow Roll and a Spring Mountain Roll. They were cut unevenly, small in portion, and the flavor was off. The Spring Mountain Roll was so smothered in sauces, I couldn't taste the shrimp.   This was served with about a half teaspoon of wasabi. My husband ordered the monk green curry. The broccoli was so salty it was inedible. Neither were worth the effort of taking leftovers home. The service was terrible. We had to get up and search for the waitress three times - once to get chopsticks, once to get my salad, and the third to get the bill. All in all it was so bad, I warned people coming in not to eat there. This is a shame because they used to be pretty good."], ["William G.", "The service was good, but the fish used in the sushi was not fresh. The Tuna was dark in color, i love sushi, but not like this. I liked the people, but I can't come back."], ["Blake M.", "For cheap Chinese takeout, this stuff is pretty good. I ordered the sesame tofu and vegetable spring rolls. The tofu was delicious, sweet, nutty, with a bit of garlic. The spring rolls were just okay, maybe a little tough. Next time I would order a side of steamed broccoli. But overall for the cost, it was very tasty.  I'll be back."], ["Regina O.", "All you can eat sushi for $20 or a good looking Chinese menu.  Clean and good service. I was super happy to stuff my face with sushi for such a price. The rest of the sushi menu is all buy one get one free.  It's not like the best of sushi but it's fresh and rolled to order. Kills my craving at a good price"], ["Gary H.", "First time at Kome tonight. Restaurant has nice decor and was clean. Hostess / waitress was very nice. I opted for The Chinese menu. The Won Ton Soup was delicious. Three large won tons. Sesame Chicken was also delicious. Very large serving with broccoli. Too much for one person to eat. Overall this was a good experience. I will definitely go again."], ["Alex P.", "The food is fantastic!  I have been there a few times now and have had the same great experience every time. I work nearby and all my coworkers feel the same way. Excellent Asian fusion cuisine including Chinese favorites, sushi and Thai."], ["Tim P.", "Chill little spot, good sushi and bogo everyday. The Chinese is good too. The lady there is always so nice every time we go, which is pretty often. Check it out"], ["Amanda B.", "Very good and a lot of variety. Classic Chinese, hibachi & sushi. I've only been here for lunch. Very reasonable priced lunch specials. The beef in garlic sauce is very good. Just the right amount of kick and the vegetables are very fresh. I got the lunch combo, wonton soup and my check was $8. Can't beat it for a fresh & healthy lunch. I hope this place will be able to stick around.Update...love the sushi. Kind of expensive even though they have BOGO. I go there for lunch w/ my co-workers. We are now addicted b/c of the sushi."], ["Katrice M.", "So like some of the other reviewers stated, this restaurant used to be Jumbo China but management decided to take a new spin on things. They seem to be going for something a little more upscale. My husband got General Tso's chicken and I got hibachi chicken. We shared and overall it was pretty good. The hibachi chicken had a bit of this sweet flavored sauce on it, and I wasn't a fan of that, my husband loved it though. It wasn't bad, and it definitely was not mind blowing. I probably won't be going again. I just don't think this place is worth the money. The service wasn't all that great either."], ["June M.", "We ordered food from here and never got it.It took 1.5 hours and it never showed up. We were at the hospital and thought it might be a good change from hospital. We'll never know....Don't order from here if you are hungry!!!!!!!"], ["Kelly H.", "I went here on a whim since I love sushi and this place was close to where I worked. I noticed they had BOGO sushi so I was down. When I arrived during lunch the place was pretty empty. I was able to get a drink and two rolls for under $10. When I opened my lunch I noticed the rolls were pretty sloppy looking. First bite however and I was in love. I got the shrimp tempura roll and it was absolutely delicious. The pieces weren't too big which I loved because you could actually eat them in a bite. I might even be so bold as to say this is some of the best sushi I have ever had. I will definitely be going back."], ["Rena S.", "The food was excellent and the sushi was good for the price. We have gone a few times and always have a great meal with great service, but there usually are not a lot of other patrons. Hope this place catches on. I think the location (next to walmart) may not be beneficial. But I say this place is definitely worth a try."], ["Patty S.", "We got a recommendation from Yelp and tried this restaurant.  Everything was delicious.  My husband had spicy chicken and I ate sushi. We were both pleased."], ["Erin Z.", "This restaurant is a hidden gem. Great food, great presentation and excellent staff. In town for the week looking to grab a bite, now I'm looking forward to coming back to get more of this! And the lunch special is amazing! All you can eat sushi, plus appetizer and soup. It can't be beat!"], ["Caroline S.", "I got take-out from this place for dinner and I will definitely go back. I originally ordered the chicken with eggplant in garlic sauce with but after placing my order online, I received a phone call letting me know they were out of eggplant so I got chicken with broccoli, carrots, and mushrooms in garlic sauce instead. The first thing I thought when I pulled my food out on the bag was, \"Holy crap, that's a lot of food.\" It was easily enough for 3 meals. The veggies were very fresh and perfectly cooked and the chicken was very tender. I'm hoping to try the chicken and eggplant in the future. I highly recommend this place."]], "Kai Sushi and Sake Bar": [], "Sushi-Thai Restaurant": [["A. K.", "Yummy! Have to say how consistently great the food is here. The sushi is some of the best and freshest around. Not to mention they have a buy one roll get one free that runs every day for dine in or take out. Also the Pad Thai is pretty good and the massaman curry is out of this world."], ["Beth G.", "I mean...it wasn't bad. The service was fast and the waitress was maybe a little overly attentive when I first sat down. The salad was good, and came out quickly after ordered. We ordered three different nigiri (salmon, white tuna and yellowtail) which were all tasty and seemed fresh but the rice was a bit sweet for my taste. As for the sushi, we got two rolls both of which we ate. The chef special roll was my favorite of the two the eel sauce was thin. Like watery thin. But had good flavor. I don't know that I'll go back, but I certainly didn't hate it and don't feel sick after eating it."], ["Santana D.", "I have never once been disappointed with sushi Thais quality and price.  Looks can be deceiving considering this location is in a strip mall but it has been a go to for Alex and I since we started dating.  And can see it being a favorite forevermore"], ["Lisa W.", "Always on the hunt for a good sushi spot I dined here with my husband on a Wednesday afternoon. I'm a self-proclaimed sushi snob but I wouldn't consider myself a purist and try to keep an open mind when it comes to BOGO sushi. From my experience here in the Triangle there is a clear difference between BOGO establishments and full price sushi joints as far as quality, freshness, and taste. With that said I'm willing to sacrifice a little for a good deal but not so much so that I don't enjoy my meal. I was hoping Sushi-Thai would be that sweet spot where you get some decent sushi at a good price but that wasn't the case. The sushi here was very Meh for me. Not bad but nothing I would want to eat again regardless of a good deal. I can get better BOGO sushi elsewhere and the same could be said for the Pad Thai we ordered. On a positive note the service was outstanding and this place seems very popular for lunch. I think if you were in the area and wanted an inexpensive lunch Sushi-Thai might do the trick."], ["Thomas R.", "I stopped by one day because of the yelp reviews saying the sushi was good and what's this?  They have Thai food too. I was blown away by the sushi and pretty much instantly fell in love with this place.  Now I'd say it's one of my favorite sushi places and their Thai food is pretty solid too.  They have BOGO sushi and comparing to other BOGO places their salmon and tuna are of noticeably higher quality,  really some of the tastiest I've had, and the Eel is done very well here too.  I'm still in disbelief about how cheap and delicious the sushi is here.  Especially because you get half priced apps on Saturdays and Sundays, including Sushi apps (which are awesome, the sake express is so good!).  My favorite rolls here are the Fashion Roll and the Sunset Roll,  but I haven't been disappointed with any I've had so far.      The Thai food I've had here, the Red Curry, Tiger Tear Salad, and the Ginger BBQ Chicken were tasty and very well done in comparison to other Thai places in the area.  Really everything I've had off the menu has been amazing and I love how everything looks on the inside, the service is always great, what's not to love?  This place is truly a hidden gem in a plain strip mall off Lake Boone Trail, I would be in here at least once a week if I lived closer nearby."], ["Heather M.", "Don't let the exterior fool you, this restaurant has a cute interior with some good-looking sushi rolls to offer as well!Each sushi roll was not only pretty on the eyes, but very tasty as well. We ordered 4 rolls- the white level, chef special, flaming salmon, and yummy yummy roll. What I loved about this place was that each roll had their own unique flavor!The only con about their rolls was that each roll had a hefty amount of rice stuck on them.The menu also had a nice description of each roll alongside pictures which made it so much easier to choose what to get.Great place to take advantage of their BOGO deal!Our server was great- he always got everything we needed and made sure we left completely satisfied.Side  note, this place looks to be very group friendly.From what I observed, it seems like most of their customers come for sushi.I'll be back to explore more off their lengthy sushi menu~"], ["Lori R.", "So it's been awhile since I've been back here, due to an unfortunate experience with a whacked out waitress, but I'm happy to report that this Thursday lunch with a friend was back to normal.  Service was not only not wacky this time, but was indeed very good.  As for the food, my Thai Basil Chicken was good as always, but in no way spicy, despite being asked how I wanted it (hot, but not the most extreme, which they call Thai hot).  Oddly enough, the dish looked like it SHOULD have been spicy, but it wasn't at all.  It was, however, very light and flavorful.  As was the small salad that comes out first with the fresh ginger dressing that I so love.   My friend loves her curries, and chose the red one.  She was quite happy with it.  Prices are very reasonable.  My lunch with an unsweetened iced tea was just $11 before tip."], ["Mark C.", "UPDATE: Back for lunch and once again am impresses with the quality and size of the rolls.   My server should have known the menu better as she had to ask about a couple of things and defiantly doesn't know her sushi.   She even placed an incorrect order but since I was seated at the bar the chef quickly made it right.   I'm glad I came back!Excellent sushi with generous portions.   I'm glad i didn't know most of the rolls were buy one get one free or I might have ordered even more.   Bookmarked this one for future trips to RDU."], ["Leigh H.", "Sushi Thai is our go-to spot for BOGO sushi! Their Thai dishes are great too (cashew chicken, ginger chicken, and pad Thai). I haven't had a sushi roll I didn't like, and for the price, it can't be beat!"], ["Cassie B.", "My love affair with Sushi Thai began in college during a first date. There was this guy, Aaron, from my volleyball class (he has great calves and a nice smile).  After flirting (how one flirts during a volleyball match is beyond me but somehow we managed to express mutual interest between lobs) for weeks he finally asked me out. He knew I wanted to try sushi and suggested Sushi Thai. The date was going great. The ambiance was perfect for a first date. Low lights, quiet atmosphere, and delicious sushi...all of a sudden Aaron leapt from the table mid-bite and ran off. Was his Thai food too hot? Did I have food in my teeth?  Was it something I said?  None of the above. I watched in awe as my date performed the Heimlich on some woman who was choking near the back of the restaurant. The sushi is so good, I cannot blame her for taking huge bites.  Once she was abLe to dislodge the food, she left the restaurant and Aaron came sauntering back. He sat down, swabbed his forehead, and says, \"Oh, didn't I tell you?  I'm a lifeguard.\"  Near death experiences, delicious sushi, and movie magic first dates all at the Sushi Thai. But do remember when you go - chew throughly."], ["Lauryn C.", "I've been coming to Sushi-Thai for years. Now that I'm back in Raleigh this is my go to BOGO sushi restaurant. I get take out here at least once a week and I'm never disappointed for the price you really can't go wrong. They always serve you fresh rolls with plenty of fish, they are not filled with rice like some other BOGO places in town.They always have great drink specials as well, 1/2 price sake night, 1/2 price wines, and 1/2 price beers throughout the week. Check their website for their daily specials. I've heard good things about their Thai food as well but have never ordered of the Thai menu. I'm assuming they are owned by the same folks as the Cary Sushi Thai however I don't believe the quality of food is as good as the Cary restaurant which is why I've given them 4 stars instead of 5.I really enjoy their spicy tuna roll here it's not like any I've ever had. Instead of chopped up tuna mixed with spicy mayo it's a real piece of tuna with a slightly spicy chili sauce I believe, whatever it is it's addicting.You can always get a seat here no matter what night of the week it is. Which is why I frequent here often. Take out is BOGO to and you can't beat a healthy sushi meal for less them $15. The staff is always friendly whether I'm dining in or taking out. They can accommodate big groups as well which is great. After reading some of the reviews on the Thai food I'm looking forward to checking it out on my next visit.It's so nice to have a BOGO place that has a lot of rolls to choose from that aren't fried. And their ginger dressing here is the real deal not any of that creamy Americanized dressing that a lot of sushi restaurants are serving these days.Though it's not my favorite sushi joint in the area - it's on the top of my list when it comes to BOGO and take out!"], ["Shane W.", "Have been happy eating there. Good grade sushi with hot sake. Wonderful. Always greeted with a smile."], ["Kristin J.", "excellent sushi, great miso. everything was fresh and prepared quickly and beautifully. great service, will return when im in raleigh"], ["Samantha K.", "I've been to Sushi-Thai a few times with coworkers and went recently with my wife. Sushi-Thai does not disappoint. Even if you're not a sushi fan, there are a lot of options for you there. I'm pretty much addicted to their hibachi chicken and their tempura veggies (both equally delicious!). My coworkers love their BOGO sushi and often get the 'boat' of sushi (if you order a lot of sushi there, you will know what I mean!). I will definitely be back!"], ["Trupti T.", "First of all the restaurant closes at 10, and I understand you close the doors at 10:00 and don't take any more people in the restaurant.  But we were sitting in there and they were turning the lights off at 10:15, we were finishing as fast as we could to get out of there.  The server was rushing and always in a hurry, overall it was not a relaxing expeirience.  The food was medicore as well, nothing to brag about.  Many good places in the area for Thai and Sushi, this one lacked both service and flavor."], ["Michael B.", "Ordered from the Thai menu - was very pleased with the flavor of my meal. Ordered fresh spring rolls which came with a peanut dipping sauce (not overly sweet which was great). Loved the spicy basil tofu which was not oily but fresh. Wish it had been spicier, but I did not specify so will be sure to when I return. Finished the meal with a Thai iced tea which always hits the spot. Awesome place - definitely will be back."], ["Ronnie Y.", "Guilty of champagne taste and a beer budget???  Need your sushi dollars to stretch a little further without sacrificing quality?  Then Sushi Tai may very well be the answer to your sushi purse stings... Sushi Tai has very good sushi at a very good price.  The ingredients are always fresh and they do not skimp by using fish salad mixtures, in lieu of full cuts of fish... Dining alone, no problem, cozy up to the sushi bar for a refreshing beverage and your favorite rolls... I did say rolls, because everyday is buy one roll, get one free... Sushi Tai honors the BOGO deals whether you are dining in or taking your order to go . The presentation is beautiful, the staff is friendly and the atmosphere compliments the menu.  We are regulars"], ["Barbara W.", "Love this place!  Always very friendly and fast service.  Every day, sushi is buy one get one free. Don't mix this one with Sushi-Thai in Cary (also very good, but no BOGO).  We go here a lot, especially on Thurs when saki is 1/2 price.  May not be the most fashionable place in the world or the best quality sushi but, for the price, it can't be beat."], ["Robert B.", "Sad as of this date to find out that they say they cannot prepare any of their Thai dishes gluten free.  I'm gluten intolerant and have found several Thai options in the Raleigh area that are prepared gluten free.   I loved their food before I found out about my problem with gluten.  I'm sad to have to strike them from my list.   If you're able to tolerate gluten -- great place.   If not, don't bother."], ["Amy L.", "A big fan of BOGO sushi in the Triangle, I can't believe I hadn't been to Sushi Thai sooner. The sushi menu is comparable to other Triangle favorites (Tasu, Sushi Nine), but the rest of the hibachi and thai menu is even more expansive. I was thrilled to see so many options at reasonable prices.I ordered the Florida and Tuna Special rolls. They were fresh and delicious. Our waitress was  quick and courteous. I look forward to returning soon!"]], "Tenko Japan": [["Jen D.", "I've had takeout from Tenko so many times, and I have never been disappointed. Food is always fresh and fast, and consistently delicious. I normally get the hibachi shrimp and scallops, and my boyfriend gets the chicken and shrimp. We've also had the spring rolls. They are a little inconsistent with charging for extra sauces, but I don't mind paying for it."], ["Andre A.", "I only had the miso soup and the sushi. Neither was good. There are basic standards for sushi and this didn't meet basic standard."], ["Katharine D.", "Take out hibachi? It's as good as it sounds!! Seriously- quick and nearly as good as a sit down hibachi place but at a fraction of the price. The teriyaki chicken were o.k, slightly dry, but the shrimp were fantastic. The fried rice and sauteed veggie were A+ as well. I only wish they wouldn't give you the shrimp sauce automatically... I have no self restraint when it comes to that stuff. Nom nom nom."], ["Lauryn C.", "For fast Japanese food it's not bad it's just not that good either. I was looking for something healthy, quick, and cheap and thought since this place is close by why not give them a shot. I didn't try any of the hibachi items and that seems to be what is the most popular here. They have a great selection to order from on their menu and the prices are really decent.They have a couple of sushi rolls on the menu and that was what I was in the mood for even though I was a little hesitant. I ordered the salmon and avocado roll it was small but tasted fresh and made to order. Unlike sushi sitting out in the grocery store for $5 I would definitely order this roll again if I was on the run. I also ordered a ginger salad for $3 this was a huge portion and their ginger dressing is pretty good not that creamy generic version. The salad looked a little old though and was pre-made but was ok.I dined in they brought me my food but there was no silverware or soy sauce - you have to go get that stuff yourself. I don't think you should request tips if you are a self serve restaurant. Again if you are looking for something quick and don't want the usual fast food options or subs then this is a decent option in the area."], ["Jennifer C.", "I have been a frequent visitor through the years.  The food is always good.  The last couple of times I have been there, the food has been good as always, but the restaurant has not been up to the cleanliness I have come to expect due having been there so much.  As for food, the hibachi is always cooked appropriately and the selection is strong.  I love that they offer free wifi and limited outdoor seating.  All in all, I would recommend.  Would only ask that owners take a closer look at the presentation of the restaurant."], ["Becky D.", "First time here. The express bowl portion is mostly rice. Orderedthe steak bowl and the meat flavor was lacking.  The miso soup is bland. God forbid if you request an adjustment to the sushi for dietary concerns - they won't accommodate you. There is no soy sauce on the tables; you have to open packets! I will NEVER come back. Stay away!"], ["Jessica T.", "Tenko has great, cheap hibachi and teriyaki stir fry. I think this is the best quality Japanese food at this price point in Raleigh. If you're trying to lower the sodium content, they will cook your food without soy sauce upon request, and the chicken still comes out juicy! They've recently started charging for extra sauce, so don't get crazy with it."], ["Russ S.", "Crab? Real fresh water blue crab in a budget Japanese takeout? Respect. Oh, and also, not a bad steak and shrimp dish."], ["Michelle G.", "Food is fantastic and reasonable in price. Great staff and food is prepared fresh and quick."], ["Trey W.", "Good, solid quick hibachi spot. I have been many times and not been disappointed. If you're dining in, you may well have to ask them for shrimp sauce and ginger sauce - they usually don't include it unless you ask. Very reasonable prices also."], ["Lauren B.", "Let's be real, Japanese express is never as good as the real thing..but Tenko Japan is pretty close! It's definitely the best I've had in Raleigh. The prices are great, they're fast, and their white sauce is delicious. I just bought a house close by and I've already been twice. Hibachi chicken is my favorite so far. It's kind of my guilty pleasure."], ["Mike A.", "This place is the best for fast hibachi! We order from here regularly and have never been disappointed. Great amount of food for the price and the food is always on point!"], ["Paige R.", "I love Tenko, it will always hold a special place in my heart. This is some of the best quick service Japanese in the area. I absolutely love their rice, the meat is usually very tasty, and the vegetables are great! (You get broccoli, zucchini, onions, and mushrooms). The staff is very friendly as well. And they have a little candy dish that has really good candies."], ["April H.", "I don't get to come here too often, but it's always great when I do. I've gotten better hibachi here than at kanki down the road- and I love the fried rice here. A shrimp or scallop bowl will do me for a meal and the prices are fair for the amount of meat and veggies you get."], ["Brandon W.", "Great for take out or a quick meal.   Very fast, consistent, good!"], ["Natalie C.", "Pretty good for an inexpensive Japanese food. The place was packed so I knew I picked a good place. I didn't try the sushi (cheap sushi does not sound like a good idea) but the chicken hibachi was great. It was a little bland but it came with sauce. All in all- it was a great experience. I would definitely recommend it for lunch."], ["Joah P.", "If you like slow bland overcooked food, this place is perfect. Fried dumplings were inedible. Unfortunately, I ate the rest and it was terrible."], [".. ..", "I got the hibachi chicken entree and the chicken was pretty dry but ok flavor. The 4 star review however is because of the rice and vegetables. They were so flavorful and delicious and the fried rice was the best I've had from a cheap hibachi place. The price is great and the white sauce containers are huge so I don't mind paying the extra .35 to have 2 because that's all I really need (and I use a lot of white sauce). Will go back for sure! Just might try the steak or shrimp next time."], ["Tom B.", "Great in and out Japanese food!- consistent quality- fair price- excellent customer service"], ["Lauren R.", "Can't comment on their hibachi, but their sushi wasn't that good--or that cheap.  I've seen much better sushi lunch specials (here, two small sushi rolls runs you $7-9, about the same than some sushi lunch specials with twice as much food).  The rolls are 6 pieces per unit--about the size of standard grocery store rolls and smaller than what you get at specialty sushi restaurants.Although they do make the sushi fresh (I waited as mine was being made), the quality of the fish isn't that good (the spicy tuna wasn't actual pieces of tuna, it was some kind of thick paste).  The california roll didn't really stick together that well.  It serves me right for trying the sushi at a fast-casual hibachi place.On the plus side, they were really nice and it came out fast.  But, in the take out bag they didn't include shopsticks or soy sauce!  I was a little surprised.  I may go back to try their hibachi and update my review since I work nearby.The inside was plain, and there was some nice seating outside (but like everywhere else in suburban Raleigh, the nice patio overlooks the parking lot)."], ["J W.", "By far,  THE best food in the area around OLD RALEIGH shopping center.   We love the chicken bowls.  But honestly,  everything they offer is tasty.  Prices are very reasonable.  Service is fast."]], "Tokyo House": [["Casey W.", "Since I've moved out here from San Francisco I have been on the lookout for good sushi.  I've tried several places but Toyko House is by far my favorite Japanese Restaurant.  They have very fresh, excellent tasting rolls.  My favorite is the Scary Jerry Special Roll.  Love it!  They are a bit pricey, and not hugely creative, but you definitely get what you pay for.  Its well worth it! Its hard to match west coast cuisine and they do a great job!  They have a large area for groups where you can even sit at the floor in traditional style.  The seating is comfortable, the atmosphere is typical for a small Japanese restaurant and they have a good sized sushi bar. The staff is friendly and accommodating.  You have to check it out!"], ["C M.", "All I really have to say is that I ordered the Hibachi RIBEYE Steak and Scallops. I got bay scallops, mixed vegetables, and BEEF STEW MEAT.  I didn't eat it, but my boyfriend said to take it with us and he would have it for lunch. Normally Oriental food is better the next day, but not in this case. The sushi wasn't anything special either."], ["Christina W.", "This place is wonderful. Great, fresh sushi. Pleasing everytime and we've been coming here for 2 years. Great prices too"], ["Jeff N.", "Walked in this evening at about 6:30 and the place was near empty. We asked to sit at the sushi bar and were promptly seated by the hostess. We are Mura regulars and had been driving right by this place for several years to eat at Mura. I am a big fan of their Sushi Bar Salad! However, because of the yelp reviews, we finally decided to give Tokyo House a try. I started asking the chef at the sushi bar questions about their salads because I wanted to find out if they had a similar salad to mura's. The guy actually told me to read his menu before I started asking questions! I was ready to get up and walk out to head down the street to Mura's (they know customer service), but my wife really wanted to give the place a shot. I had read their menu online before we got to Tokyo House, and told the guy that, hence my original question. He came back a minute or two later and asked me what kind of salad I was looking for, and then recommended the sunomono seafood salad. That was a smart thing to do as the salad was indeed very good. From that point on, things just continued to get better. My wife and I ordered two rolls a piece and all four rolls were absolutely delicious. The presentation was excellent, the time it took to get our rolls was very good, and the young lady taking care of our drinks was fantastic. The bigger surprise came when we got our check. Our dinner with two salads, two drinks, and four rolls was less than $55 AFTER tax was rolled in! The same meal at Mura's would have run another $25 dollars easy! So you know what we did with the extra cash? We went to see 2016. And by the way, that is a fantastic, must see! Date night was an absolute success thanks to Tokyo House and my wife's good sense to giving them a chance to shine. We will be back."], ["Kelly C.", "Wonderful and affordable sushi, this is our staple sushi place. Celebration roll and Minwoo roll are outstanding. Service is always good and it's always fresh. We go here frequently."], ["Brit B.", "I think Tokyo house may just be the best sushi place in town.  Huge, thick cut pieces of sashimi and very reasonably priced.  The Escolar, one of my faves, is usually one of the more expensive on the list,  but at TH, it's priced right there with salmon and yellow-tail.  If you like rolls order the Minwoo (comes with LOTS of Escolar on the outside) or the California roll.  David makes the thickest Cali roll I have ever seen with 3 kinds of fish on the outside."], ["Bryce K.", "Making customers wait for over an hour for sushi is a great way to make people think your food tastes awesome.My wife and I went here because of the Groupon.   It was pretty full that night so instead of waiting, we elected to take our shoes off and sit on the floor at the low tables in the other room.  Sitting on the floor (on very scuzzy and flat pillows) was fun until about the first 60 minutes of waiting for our 5 roll sushi order (two California, two spider, and a shrimp tempura) to come out.  The waitress was very nice about the wait and even threw some free edamame at us to keep us happy (very high marks for the waitress).  If were not so famished, we would have given the sushi a grade of 'just OK'.  The prices are fair, as most rolls are under $7. If you don't live in Six Forks or have a Groupon, you will probably pass 3 sushi places in the price range that you will be just as happy with, so no need to go out of your way."], ["Pamela M.", "Love this place & have never had a bad experience. The food is great, the prices are reasonable, & the staff is great. My favorites are the golden crunchy rolls. I would rather they serve Coke products though."], ["Chris P.", "This place is one of my favorite Sushi Bars in Raleigh.  Everything is fresh and tasty, they have excellent specialty rolls and a good variety of nigiri and sashimi offerings.  Service is usually very good, but on the weekends it does get busy.  One of my favorite things about this place, aside from the great food is the Tatami room.  If you want to have a party a group of friends for a meal, or an intimate meal with your gf/wife,  the Tatami room is highly recommended.  You will, however, need to call in advance to reserve the Tatami room.  The decor is a bit dated, but very clean.  The sushi chef's are also excellent."], ["Petite M.", "I have been a Tokyo House customer for many years. The food is excellent. I am an avid sushi and sushimi eater. I come from the Chapel Hill/Cary  area  to eat here (I frequently stay in CH or Cary when I'm in the area for business)  . Contrary to some of the other reviews I've read; I've never found this place to be dirty or crawling with insects of any type. The restaurant sits in a plaza and is a nice surprise. The fish is some of the best compared to the others in the area. The sushi chefs' are always pleasant and friendly. I frequently travel to the area for business from CA. whenever I travel I always try to find a good sushi bar; I've yet to find any place that serves as fresh. I love the Niguro (tuna) sashimi and soft shell crab. I always take visitors and fellow associates who come to town. When my family travels with me they always request this place over others, I consider this place the top place in the Triangle area - we have tried them all in Durham, Chapel Hill and Raleigh. I can't count the number of times we've been there. If you're in a big rush and not wiling to sit - do not go to a sushi bar. Service does change hands, but the chefs are consistant. HIGHLY RECOMMENDED can't wait to return, it's always relaxing and delicious."], ["Kevin P.", "Best sushi I've found in Raleigh. Great choices, great prep, good atmosphere. Not overly pretentious , good prices. I haven't tried every sushi place in Raleigh, but after having gone to 7 or 8, this is the winner so far. (and try the dynamite bowl!)"], ["Glenn R.", "Fantastic atmosphere, great sushi and tempura.  They have private rooms with \"floor tables\" for groups over 5.  My kids love the place.  Great service and energy."], ["Sabrina S.", "I have been looking for a sushi joint where I can get sushi on my way home from work. Somewhere you can pop in wearing workout clothes etc. for a quick dinner,  get some quality sushi.  THIS IS THE PLACE! Service was very friendly, the sushi bar itself was a nice size. but a  little brightly lit, but the booths were cozy.  The Tuna Maguri and Salmon were both FRESH, had great stridations/color, not  at all fishy,  and was cut well.  The Hawaii roll was beautifully prepared, and had tons of fish and blue crab.  Even the spider roll for 5.98, was an awesome, large hand rolled maki, with huge softshell crab claws in two pcs.  The basic spicy tuna roll was loaded with tuna, and it was really good and cold. The only weird thing was that  when we ordered calamari, they brought us tempura octopus tentacles, we thought they were crab legs at first glance, but they were definetly octopus.  They turned out to be tender and flavorful served that way, and we didn't mind, but did feel a little perplexed at the \"swtichery\"!  I would definetly go back because the sushi was actually really fresh and good for a strip mall place, and there wasn't a wait on a Saturday night at 8:30."], ["pete a.", "Food for the price is good"]], "Ajisai Japanese Fusion": [["Marie B.", "In town for work and found Ajisai on Yelp. Called in take out and the service for even the 5 minutes I was in there was great. Can't beat the sushi either!"], ["Kristen R.", "I'm always looking out for good sushi in the area and after reading such good reviews, I had to try it out. First off, I really love the decor! The ambiance is fresh, modern and clean. The music is a bit loud, but tasteful. I had the free appetizer yelp offer and we got the haru maki (spring rolls) along with the rock shrimp. The spring rolls were mushy and not incredibly flavorful, but the shrimp made up for it- perfectly crispy and a little spicy. We noticed after finishing it that the bowl it came in was cracked all down the side with a chunk of glass missing! (Honestly not sure how we didn't notice it until after...I'm surprised no one in the kitchen saw it?) Yikes. Anyways, we got the Ajisai roll and the angry dragon roll. Both were delicious! Very unique flavors, I loved the basil oil on the dragon roll. Unexpected, but very yummy! As for the service, our waiter was not very attentive, but nice. We never waited too long for anything and the food came out promptly, even on a busy night, so not really complaining on that. Overall, I enjoyed my experience here and will definitely be back!"], ["Lauryn C.", "Wow I'm in love. This is some of the best sushi I have ever had in the Triangle. Ajisai have been on my radar for awhile with all their amazing reviews. A great location in Cameron Village with an awesome patio. They have done a great job decorating the place it's casual but still has a little of that upscale feel.Check in on your Yelp app for some free edamame. Of course this is what we started with and there are no complaints here it was fresh and delicious. We decided on 3 rolls the, Tomo, Pink Lady, and Manhattan. They were all good I really have a hard time picking a favorite, but I have to say the Pink Lady was the most unique. I've never had a sushi roll made out of black rice before I loved it. It was topped with a red wine pear so good. I also enjoyed the other rolls and the jalapeno citrus sauce that came with the Manhattan. These were big rolls and I probably over ordered but my friend and I finished every bite. Did I mention we also ordered two orders of sashimi? Yeah well that happened too and no regrets the salmon sashimi was the freshest I've ever had here in Raleigh. I had the opportunity to speak with Joy who is one of the managers of the restaurant she just moved here from Brooklyn and I was thrilled to find out the backround on this place. There is another sushi restaurant they own in Manhattan and they ship all their fish in fresh from NY sometimes even twice a day if they have to.I was so happy with my meal and all of the sushi was spectacular. I can't wait to check out some of their other menu items. We also shared a bottle of Malbec the wine prices are really great here you can find plenty of choices between $22-$30.They offer a discount to students as well which is awesome. I really enjoyed the staff and they were super friendly but I do think they need to train the waiters on the menu a little better. Considering they just opened I'm sure they will work out some of the serving kinks here soon.Big thank you for the awesome birthday cake it was so kind of them to bring it out. It also was super delicious you can't go wrong with a fried cheesecake - tempura fried I might add oh my so good!Come check out this locally owned addition to the Raleigh restaurant scene. You will not be disappointed."], ["Jenny C.", "I got the box B bento box of salmon sushi. Very tasty and filling. The avocado and eel maki roll was super tasty and I love that they put eel sauce on the side of rice. It seems small but DONT BE FOOLED because this is delicious. Also used the free appetizer for the spring rolls. Hot and fresh!"], ["Alice F.", "Amazing service and really good sushi!! Server was incredibly attentive. Sushi fresh and flavorful. Beautiful and nice decor as well. Good for a date night or a casual meal."], ["Derek S.", "straight solid // take-out service was exceptional // best hot & sour soup i've had to date // Manhattan roll was the headliner"], ["Heather M.", "Check in here and you'll get a free order of haru maki or edamame, your pick!It's a cute & tiny sushi restaurant in Cameron village.The restaurant is clean and well decorated. They had special rolls with descriptions that sounded pretty unique, but no killer combos or deals to choose from.I got the Godzilla roll which I imagined would be a huge impressive roll- come on, its named the Godzilla roll!!! Welp, they fooled me. Only 5 pieces. It had a tasty flavor combination, but five measly pieces? That's five bites.We also got the tuna/salmon lover. Again, small pieces- and also a bit chewy.However, presentation was stunning! Sigh, if only appearance satisfied the tummy...Service was quick because it was pretty empty. I give this place a solid 'good'- nothing exceptional."], ["Haolong Y.", "Absolutely first choice in Cameron Village! Love it! Running by a friendly Chinese woman and the atmosphere is excellent!"], ["Ed H.", "Excellent! Awesome lunch deals, and delicious sushi and curry.Highly recommend this if you're ever in Raleigh.Love the free Appetizer for Yelp users!!"], ["Austin S.", "Brief: Excellent food. Poor service. Hope it is a one time thing, will try again because the food was that good.Details: Made reservations for 2 at 8:00 PM on a Friday. Arrived promptly at 8 and was surprised at how small the restaurant was. Felt more like a quick sushi bar for lunch type atmosphere than Friday night date night. If you're looking for that kind of ambiance you're better off with Sono or Mura. Back to the service - I could see an empty 4 top (which we were eventually seated at) but was told by the hostess if would be a 15-20 minute wait unless we wanted to sit out side. My wife preferred indoors, so we opted against. Irritated with the open table despite our reservations I asked the hostess what the point of making reservations was if there weren't tables ready for such occasions. She stared at me blankly until the manager stepped over and intervened. She asked us to wait outside at a table while she got a table ready for us inside.I should have prefaced with the fact that it was obvious as soon as we walked in that the service staff was overwhelmed and sinking quickly.Our waiter was actually quite good, but again we could tell he was anxious and visibly had a hurried look about him all evening. We ordered ordered 2 starters, an entree and two sushi rolls. During the wait for starters the hostess tried to bring us another tables check then took it to two other tables before finding the right one. We watched a family get served in at least five minute intervals. And overhead a party of at least 8 complaining about 3 sushi rolls they had yet to receive an hour after everyone else's food had been served at the table. We were fortunate enough to avoid these blunders. Closest we came was having the started brought out separately, my rolls were a few minutes ahead of my wife's entree and we almost didn't get her salad/my soup (came out after we mentioned it to server as he brought our mains). Not perfect, but tolerable.The food was really quite good, the sushi was on par with several of the other Raleigh staples. Would have been a 5 star review if the ambiance were a little better (even just dimming the bright lights a little) and there wasn't such an overwhelmingly nervous/anxois/irritated atmosphere. Firm believer in second chances, so I will try them again and hope this was just an off night for the team."], ["Blake L.", "First time trying Ajisai, was very impressed with the Thai noodles & chicken dish. Sushi was also delicious and I noticed they had great lunch specials. Checked-in for the free appetizer although they only let you pick from two of the cheapest ones. I thought this was America?! Cost them the coveted 5th star but we'll be back :D"], ["Anna V.", "This place has the best lunch special! $12 for three full size sushi rolls (none of that 4 pieces bull) and soup/salad. Definitely the best lunch special in the area that I've found! I tried going to Mura in North Hills for their lunch special but it cost me $15 for only two small rolls and no soup or salad....Now I make the drive to Ajisai."], ["Cynthia P.", "The food was really good...Loved the Deep Fried Volcano roll!!! Staff very attentive."], ["Michael T.", "Travel all over the country, always looking for a great sushi spot, found it here in Raleigh!Try the Sweet Heart roll, outstanding!  All of the fish was fresh, service was outstanding, make sure to ask for the owner Polly, constantly making sure customers are happy!Great experience!"], ["Abby L.", "Really pleased with this place. Delicious and affordable sushi offerings at a reasonable prices, especially at lunch. I've been twice and tried three different rolls each time. All were amazing. My friend got a non-sushi teriyaki chicken and was very pleased. Nice outdoor seating. Pleasant staff. Hope this places stays around for a while."], ["Lindsay H.", "Not the worst and not the best sushi I've ever had.Ajisai has a great lunch deal of two sushi rolls, a salad, and miso soup for around $10. However, their other signature rolls are very overpriced. There are places in Raleigh that offer better rolls at better prices. I would be willing to eat there and see if that makes a difference, but overall, I think there are better places."], ["Carrie L.", "This place has great sushi prices - my boyfriend and I get it to go quite often, and the two of us always think it's great. My only qualm with this place is that their tuna sashimi doesn't always taste great - makes me wonder about the quality. But otherwise, this place is a good, reliable, affordable option for sushi."], ["Viktoriya M.", "So we came just for an appetizer and quickly were tempted to try their special Ajisai roll. I'm a sushi prof and let me tell you this roll was beyond my expectancy. I'm not sure about other items but this one was a bomb. Edamame was great and overall experience left us with a feeling of coming back. Oh and yes, purple color is a great great designer touch. Looks sharp!"], ["Rachel A.", "Japanese food is one of my favorite cuisines, and Ajisai is near my house, so from time to time I will pick it up. For the most part, its not too bad, but it is also nothing to write home about. Their salad with ginger dressing has a touch too much ginger in my opinion, as with their shrimp sauce. It's not a place that I would rave about or really recommend to someone even, but its also not somewhere that I think is terrible or should go out of business. Generally, its just a lack luster Japanese restaurant, that will sort of satisfy a craving."], ["Anil O.", "I didn't think the fish was fresh, tasted spongy and the rice wasn't good either. I will try it again to see why this restaurant is getting so many good reviews but so far I am not impressed with sushi in Raleigh."]]}