{"Sawasdee Thai Restaurant & Bar": [["Gina B.", "Fellow Yelper, Ron, recommended Sawasdee when they opened and that was like a million years ago I think. Seriously though, I'm not sure what took me so long to check the place out, other than I'm not generally over on Glenwood Ave that often.We were itching for a mix of sushi and hibachi and their menu was just the ticket. It's ridiculously extensive. To the point, Chef Robert Irvine would give them a strong talking to about food costs, but hey I appreciated the variety.We ordered soup, salad, a sample boat, and hibachi steak to split. While service was crickets..... slow, the food was delish! I couldn't complain about a thing. Everything was very tasty. The wicker seats were extremely uncomfortable though. Even my 6'6\" boyfriend looked like a midget in them. I stole a cushion from another chair just to try to get my head above the table. They need to be tossed in the trashed and the whole place needs a refreshing up in my opinion. The ambience doesn't do the food justice.Now it's not gourmet and I wouldn't go running to take your date there tomorrow, but it's solid faire I would go back to."], ["Jessie R.", "The four stars is just for the food. The food is absolutely amazing. From sushi to ramen. Everything tasted great. However if I can give stars for service, I would give it a ONE star. No one smiles or greats you. They just take your food and drops it off. Then they go back in the kitchen for a long stints of time. I waited for my check one time for 15 mins. There were only three other guests there. Every time I come here, I think I'm bothering someone. From carry out to dine in, they don't care. Good thing to food is great."], ["Lina M.", "Pad Thai chicken is good. I've had better but I get it every restaurants has their own recipe and way of cooking and Yaa I like it it wasnt on point but still good and didn't have to wait long. Their restroom is dirty and smells so bad I almost threw up."], ["Mikey B.", "Super good place. I like their pad thai, their sushi and I just recently had their ramen bowls which were so good. I always go for lunch, which it's great for, but it's a little too pricey to enjoy their food on the regular."], ["Joe B.", "I've been to this place a couple of times, and with my most recent visit, I was fully ready to give this place 4 stars. HOWEVER. I didn't anticipate this place being just as good as the other location on Capital Blvd.The food was really great quality. Upon my most recent visit here, I got the Spicy Tonkatsu Ramen, and my friend got the Pad Thai. I've had some amazing ramen in a couple of places around the world, and I'd have to say it definitely was a solid bowl of ramen. The Pad Thai was pretty flavorful, and the noodles weren't bland or undercooked (like I've had at some places). The Thai curry here is an excellent choice as well.Decor is quite nice, as it has a pretty chill, decorative tone. The service here is excellent, as well. I definitely plan on coming back. I feel like I'll start having dreams about that ramen."], ["Nancy T.", "They have good thai food for sure, but in comparison they definitely skimp on the portions. In recent months I discovered their ramen! The soup base of the tonkatsu is totally on point - full flavored and bold, definitely what ramen noodle soup should be for tonkatsu. My only complaint again is that it's a small bowl, with very little veggies and only one thin slice of pork that comes with it. You can add meat and veggies and things like that for an extra $1 or $2 so it adds up in price to be similar to the more expensive bowls of ramen at places like Sono or Buku. Their standard bowl starts right around $10. Another deduction is that their wait staff makes you do just that....wait. they are rarely a full house when I've gone and maybe only have 3 or 4 tables but man, they are super slow. I've been to better Thai places for sure so this isn't my f irst choice but at least their tasty food keeps me coming randomly."], ["Julia Z.", "It's a pretty delayed review...but this place is pretty good for Thai food. They recently added Japanese ramen, and they are pretty good, the portion is smaller than Sono, but also a buck cheaper if I remember correctly."], ["Melissa W.", "Nice place for a date night. I tried the Thai iced tea (delicious). We sat on the back side of restaurant, the chairs are actually really comfy and I felt like vip back there. It was like a private area. Staff were great. We were warned it was busy because of 3 big parties, but our food didn't take long to come at all. I got pad Thai, my husband got pho. Food was really good, staff was great, and I enjoyed the atmosphere. If my husband and I go again, we will probably ask to sit in the back section. I recommend trying this place."], ["Meaghan G.", "So I've been here a few times now and have yet to be disappointed.  Their Pad See Ew and Pad Thai are on point.  Some of their apps are on the smaller side but their soups do not disappoint as they are filled with fresh veggies and flavor.  I've eaten here a few times on my own and some with the hubs and regardless I have been treated with great service.  They do not rush you and there have been several times we've ordered food for last minute pick up with no complaints. Maybe if the outside looked a bit more welcoming they would be more packed, but regardless of the lack of curb appeal I keep coming back for more!"], ["Brie B.", "Thank god for lunch time! I've been here for curry. However, Today I decided to try the pad Thai. Maybe I'm used to the bold flavor in red curry?The pad Thai fell a little short today. It also had way too much egg and some wired white cabbage thing.  I will ask for it spicy next time. Other than that the food here is good. The red curry is awesome and spicy! I really like the bamboo in the curry. I must have been a panda in a last life. The rice is cooked well. If you're in the area try it during lunch time. The entrees are 7-9 dollars. My favorite Thai place is further from my house.  This restaurant is good for a quick fix. Please note that I only get take out. I can not comment on the service. However , I've never had to wait too long. They are very punctual."], ["Katharine D.", "I've dined in once and gotten take out on two occasions. The only negative I've experienced is not receiving enough rice on a take out order. Other than that- I am a fan! The staff are courteous, food is prepared in a timely manner, portions are more than satisfactory, and food flavors are delicious. They make very satisfying currys and noodle dishes. The ingredients seem top notch. FYI- When they say spicy- they mean spicy! I got a medium spice on the evil jungle noodles and had to break out the milk to mollify my mouth. A medium of a green curry dish wasn't quite as spicy (but still spicy). It's good stuff and fairly priced. Sawasdee is my go-to Thai restaurant in this area! Very satisfying!"], ["Carl K.", "Sushi was okay. Thai was better. They are a thai restaurant and should just stick with that.  They also need more staff."], ["Wood C.", "My girl and I have eaten here many times (as we live about 5mins away). The food is pretty good, and the service has been just above average.Unfortunately, this past Sat (9/26), service was freakin' horrendous. You really have to screw the pooch for me to say something like that. While I haven't been impressed by their service, there was nothing about it that detracted from overall past dining experiences. This night, it took 20mins for me to get a glass of wine, and we were constantly ignored by our primary server. Note, another server brought my wine over (only after we got her attention) because our primary server was always on the other side of the room.Nonetheless, I'm giving 4 stars because, normally, service is decent, and the food has always been good.I'm hoping our next experience includes much better service ..."], ["Heather M.", "I was thinking about giving this place 3 stars but the service was horrid.First off, we literally had to call for our waiter EVERY time we needed our drinks to be refilled.He was so sassy whenever he came to us, as if he was doing us a favor out of the goodness of his heart or something -_-It would have been one thing if they were super busy. Nope, it was just me (and my date) and another table of two at the restaurant.ALSO, every time we had to call on our server to fill up our drinks, he was busy either on his phone or chit chatting with his coworkers. I don't mind a server doing this if he/she has done the job (I've been a server before so I understand), but make sure our drinks are half full at the very least.Food was decent- they're not too generous with their portions.I got the pad nam prik paw with shrimp- although the sauce was absolutely delicious, they only gave me ~6 pieces of shrimp, boo hoo.The pad thai here is pretty good but on the drier side. Personally, I think Thai Villa has better pad thai...We also got the fried calamari and the spring rolls as our appetizers. The spring rolls had a weird smell and the sauce it came with didn't really compliment them...Oh but the fried calamari was yummy, especially with their sweet and sour sauce- but who comes to a thai place solely for fried calamari... hahaPlace was clean, food wasn't bad but I don't plan on coming back here.I will satisfy my thai craving elsewhere!!!!"], ["Jennifer B.", "Did not give 5 stars ONLY because Miso soup was so salty it was difficult to eat, wasted 1/2 bowl. Sushi was fresh & wonderful tasting! I have only found sushi this fresh in Fuquay-Varina at Kumo. Squid salad is served on a bed of lettuce, so ask for without if you don't like that way."], ["Julia H.", "Originally, I was trying to order take-out Ramen from here, but when I called they informed me that they don't do take-out for their ramen. So I decided just to come in to eat it.I went here by myself last week and sat at the bar. They were pretty busy and the hostess was a little frazzled so I sat myself. She made time to come over, greet me, and send a waiter for my drink order. The waiter was quite and efficient, but probably a little new because he didn't seem to know what I was asking for when I ordered.Although I originally came for Ramen, I ended up getting the tom yum noodle soup. Oh man. It was so good. I almost cried (probably out of exhaustion) because it was just exactly what I wanted. The lemongrass flavor was so delicate and balanced with the spice in the chili pepper. I would eat this over and over again. I also really liked the noodles in it as it made it a very hearty and satisfying meal. The waitstaff promptly brought my check when I asked with the to-go Thai Tea (not the best one I've ever had), but decent."], ["Raleigh Spicy Food M.", "This is the second time that we've had a Meetup here and by far the food is what brings up back. The service, although they are extremely nice and take good care of us, they can be slow. The food is always good and when they ask for a heat scale of 1-5 and you say 6 and then add some pepper oil to it the heat scale is pretty high! I've gotten the red and the green  curry and they haven't disappointed yet!"], ["Christine S.", "I give this place a 3-star because of the seasoning on the food. I went for lunch today with two of my girl friends. We ordered the Spicy Eggplant, Panang Curry and Pad Thai with basil! Everything was too salty for my liking, but the flavors were tasty. I like the Spicy Eggplant the best, but the dish did not have enough eggplant. Considering that eggplant is the main ingredient, there was about 5/6 pieces and the rest was veggies and chicken. I would've loved to see more eggplant since it's NOT even a lunch special portion. The Panang curry had coconut milk, not my favorite. overall, the service was good and the server was friendly. Pretty spacious location, good for family dinners.Worth a visit, only if you crave Thai and there no other place in the area... And if you really must satiate your craving for that food... Then go here."], ["Ash H.", "I placed a to go order and when I arrived to pick up the food, no one was by the hostess stand, soon a lady came to check me out, she seemed very rush and not friendly at all. When I notice there's no utensils, I asked her for some plastic fork and spoons and she literally threw them in the bag and walked away. I have never experienced such rude service. I ordered spicy crab fried rice and got regular crab fried rice, it taste plain but surprisingly they use real crab instead of imitation crab. Coconut soup is too thick.The pad see ew noodles had way too much vegetables and only a couple pieces of tofu, it lacks of flavor and Definitely not authentic. Over all, food is not bad but not great neitherService is horrible!The food is way over priced! Sorry to say I will not return!"], ["Monica W.", "Over the course of the years I have dined several times.  I love the Thai food and enjoy the experience for the most part.... but there is stops. Recently, last week a friend and I went in for dinner.  It was about 6pm on a Wednesday and the place was empty, there might have been 2 other parties in the entire place.  It was unkept, dirty seats and tables, stuff scattered around the bar area (where there was no bartender) with squeaky/wobbly booths and tables.  I ordered a glass of wine where there was clearly a lipstick stain from the previous use that had not been cleaned properly.  The server looked at it and didn't even say anything?  Our food came out fairly quickly and tasted delicious!  There are plenty of options for any person on the menu. The portions are more than enough to take home another meal.  I have been to the other location and had better experiences.  I just hope this place can clean up a little bit and survive because they truly have great food."], ["Holly D.", "I am surprised Sawasdee doesn't get at least 4 stars. We dined in the restaurant one night and our server recommended a regional curry that is not served at any other restaurant in the area. It was topped with a pile of fried onions. It was SO delicious. Possibly the best curry I have had. It is not listed on the online menu, but ask about it in the restaurant.  Our other dishes were also done perfectly.  We returned for takeout the next week. both experiences were flawless."], ["Andrew W.", "I'm mad at myself for leaving this on the \"to try\" list forever. On a Monday night around 8:45pm, barely anyone was in the restaurant. They supposedly close at 9:30pm on weeknights, but that's around the time we left and the neon \"Open\" sign was still on. A couple regulars walked in right before we left, and the waitress knew their orders without having to ask.I'm a big guy (35\" waist, 6'6\" tall) and didn't find any problems with the booth we were in. Maybe they gave us a bigger booth since we were two of four patrons at the time. By the way, the other two seemed to be enjoying one of the many alcoholic options Sawasdee has to offer. I'd normally go with a Thai iced tea, but it was a little too late in the evening for that.We started with a couple of spring rolls with sweet chili sauce. The sauce was very light, almost too light, but definitely added something. For entrees, we both went with noodles. Going with Ron's recommendation, I had some very tasty, but not so spicy, drunken noodles. My girlfriend went with the traditional Pad Thai (which was amazingly her first time ever having Pad Thai). Her portion was very large, which left me with lunch the next day. My portion was a little smaller, but definitely more than enough food. if you want spicy noodles, you're definitely going to have to ask them to bring them up a level or two.The only strange thing was when it came time to pay our bill was 12 cents shy of $30. We had a coupon from a mailer to save $5 on $30 and the waitress said we had to order something else (that's pretty extreme enforcement of the coupon in my opinion!). They were out of banana rolls, so I just got some coconut ice cream to go ($3). It was fine, but I'd rather have a cone across the street from Fresh!Anyway, that won't deter me from coming back. I'll definitely be eating here at least once a month due to its proximity to my house. The location isn't the greatest (it's a little bit of a maze to get there), but I overhead that they are very busy on the weekend. So, it looks like people are finding this place and coming back... and with good reason!"], ["Ben W.", "The Cashew Chicken was delicious. Asked for it extra spicy and they delivered. Springs rolls tasted very fresh and were hand rolled right when we ordered them. I was a little disappointed in the atmosphere. I was looking for something more...fancy and upscale. It was a Tuesday however, so that's definitely a factor in the number of patrons Overall a very delicious restaurant for some Thai food!"], ["D S.", "I'm a sucker for Thai, so it gets above average rating from my bias. My favorite is Yum Woon Sen - for some reason missing from many Thai menus but not theirs!  Here for late lunch, place was empty, food prepared well, and their curry on the Salmon dish was excellent.  Will be back to try it again."], ["Nadine S.", "I have been here several times and the food is delicious.   I especially recommend the spicy fried rice.  I get it almost every time.  The service could be quicker given that it's usually not too busy, but the food makes up for it."], ["Shira A.", "My family's favorite Thai and one of our go-to restaurants for an evening out.   Kids love the pad Thai, and my husband usually orders one of the curries (Panang curry is delicious!).  I usually get the whole fried fish with the spicy sweet ginger sauce.  Makes my nose run and is amazing!  The last time we were there, I had a Thai mojito that was yummy (traditional mojito made with Thai basil). I liked it so much, I made it at home a few days later.Great value, convenient location, and consistently great food.  The atmosphere is nice, but not too fancy.  So glad to have found this restaurant!"], ["Ron W.", "It's always a challenge doing sequels when the original is so darn good.  Sometimes it works out well, like the movies Godfather and Godfather II.  Other times the sequel is not nearly as successful, think the Matrix and Matrix Reloaded.  Thankfully, Sawasdee Thai II doesn't disappoint, it delivers everything the original does, plus a bit more!  (Fellow Yelper David S. will hopefully have a review soon for this place :) What was some of the best Thai food in the Triangle now has expanded to two locations.  You can go to the cozy original on Capital Boulevard or go a bit more upscale on Glenwood.  Sawasdee II's new space is more traditional with lots of woods and nice leather chairs.  Although they've kept the signature yellow wall, the decor is more subdued and the location is way bigger.  They're still working on the place but it looks great right now.  Outside of some tight booths (seriously, you may not be able to get yourself out after a large meal), seating space has at least doubled.  They've also got a long u-shaped bar and what looks to be a party/private room.  Plenty of room to grow into and it all feels comfortable.  The food is just as tasty as before, I ordered some spring rolls and chicken pad thai.  Portions were largish and the pad thai was well done: just the right amount of sweetness, large pieces of chicken with the peanuts and bean sprouts on the side.  Service was VERY good and attentive, thanks to a great waiter.  I'll be back soon but for now I'm moving my five star rating over to this new location.  I think you'll find it's the same great thai food in a nicer, more spacious environ.  It's always a pleasant surprise when the sequel lives up to or outdoes the original and I'm glad to say that Sawasdee Thai has pulled it off!"], ["Jeff S.", "Great Thai food!And they have a good Pho! Seriously, they can make a good Vietnamese soup.My wife and I like to stop by here for lunch. $8 gets you an appetizer and meal from the lunch menu.The curry and noodle dishes are all really good.I still have a warm place in my heart reserved for Thai Villa off of Buck Jones, but if I had to recommend a Thai restaurant, this would probably be the one."], ["Perry H.", "Luckily my wife got the hankering for some Thai food Saturday night and a quick Yelp search popped-up Sawasdee.  I've never been a fan of the strip mall restaurant but please don't let the location get you down.  This spot is tremendous and I can't wait to return (I might actually do so tonight - just writing this review is making my mouth water.)   For a Saturday night the place wasn't too busy.  We were seated at front, in almost a cafe-like setting, with oversized comfy chairs (almost too big and cushy to wrestle-up to the table.)  Even still we ordered and promptly received our appetizers.  The pork dumplings were very good but the tom kah was superb.  I actually had to keep myself from turning up the cup to get every last drop.  Sadly,  I think my spoon left one tiny drop in there...For dinner I had the Amber House Curry with shrimp which was out of this world.  Served in a bowl with an ample amount of shrimp the curry had the perfect medium heat with just a zip of lime.  Perfection.  It was served with a side of rice which was in the shape of a fish...how cute.  My wife had the pad thai chicken which was good, not the best I've had.  I would probably rate it 4 stars if I had this dish but my curry put it over the top.  Definitely can't wait to get back and try this spot again.  I hear the one on Capital is very good as well, just smaller/more intimate.  Great service, good fresh, all natural food, with ample portion size.  Love it!"], ["Karthik N.", "I have known people who rave that Sawasdee is sensational and brilliant. I frankly don't see it. Full disclaimer: I'm vegetarian, and maybe they do something special on their meats or fish. I mean, don't get me wrong, their food is good. I may even have rated them 3.5 if I could and if not for the hype. It's just pretty commonplace - not that different from any other good Thai restaurant. Nothing memorable!"], ["Nathaniel W.", "Some of the best Thai in Raleigh and not afraid to turn up the heat! I had the chicken pad Thai and red curry, both were up to snuff with what I expect. Clean and professional atmosphere."], ["MsJenita M.", "Very flavorful and good service.  Pad Prik Shrimp tasted like Mongolian beef which I already love.  The serving was suitable and not heavy."], ["Carter C.", "I just want to stuff more and more of their food -in-my-mouf'Sawasdee seems to be kind of the poster child for local hidden deliciousness.  Both locations are in old, run-down shopping centers.  The kind of places that used to be occupied by large chain stores like Best Buy and Kmart, but are now home to bargain bin stores like.....\"Bargain Ben's\"  (you see what I did thar?  you see?) This location is slightly better placed than the Capital one, but it's still not the greatest for incidental patronage.  Similar to their capital location, the interior gives me the impression that it was put together by one of the worlds most talented, and most frugal, interior designers.  There's just something about the decor that whispers it's age and pre-use, from behind a deceptive veil created by elements that come within a hair's breadth of matching perfectly. Despite all of this, I give this place 5 stars, because their food is downright delicious, every freaking time we go.  Not just delicious.  It's a kind of addicting deliciousness. We go and we just want more.  Their dishes are FULL of flavor.  The Tom Kha soup is wonderful and warm and creamy with a twangy flavor.  The Pineapple Curry is sweet and spicy, and awesome.  The Chicken Satay is a fun, nummy appetizer to get, and one that will probably even make your kids happy.My personal favorite is the Drunken Noodles with Chicken.  I don't think I've ever had a dish like it anywhere else.  I'm not quite as adventurous as my girlfriend Leslie C, and the Drunken Noodles were the perfect gateway dish to Sawasdee's menu.  It's got a lot of familiar elements in it, but a flavor like no other.  If you're not usually into the more \"authentic\" Thai dishes, this is a great one to try.After many regular tests, I can tell you with confidence that the food is consistently awesome.  Don't let the outside fool you, this is a gem you have to try!"], ["Geralynn O.", "3 stars...Not because the food wasn't good. I actually thought the food was great, which happened to be the panang shrimp curry. I am giving 3 stars because the amount of food that was given was not even worth the expensive price I paid. I ordered my food to go and the quart-size container that holds the curry wasn't even filled halfway. I'd say the amount that was in the container was maybe 1.5 cups (?). And this was the dinner portion. I paid almost $20 for that! Not cool. I could've driven down the road and bought about $10's worth of McDoubles just to get full (not that I even eat THAT much to get full). I'm just saying that they should have given me the amount of food for the price they made me pay...which beat my debit card with a baseball bat. I sat at home eating my panang curry while thinking of other take-outs that seriously could've filled me up for less than what I paid at Sawasdee."], ["Renee S.", "In a delusional world I said playfully to the restaurant, \"We've been talking about you. All good things, I promise.\" I typically have all my marbles and don't routinely talk to inanimate objects, so this didn't technically happen, but when Groupon offered $25 for $12 I jumped on it, and somehow I had a $10 Groupon credit, so I got $25 at Sawasdee for $2. Score! I'm taking my girls to dinner! Sawasdee suffers from a slightly ugly location in a nondescript strip mall with Starbucks, Marshalls, Ross, and a few other big box dandies. Exterior musings aside, the interior is warm with opposing but complimentary (quite Yin and Yang, eh?) Asian modern decor. The spacious dining room had many tables with contemporary red leather dining chairs but in one corner they have a little restaurant retreat of sorts with plush, lightly colored banana leaf furniture. \"Oh can we sit there?\" I squealed with delight pointing to the plush banana leaf settee, table, and chair configuration. Happily seated in our banana leaf retreat, we ordered two orders of fresh spring rolls, one veggie with tofu and the other with shrimp. For entrees Liz ordered one very spicy Pad Thai that had lots of fresh veggies. Cassie ordered my new Thai go to, Drunken Noodles with pork - they didn't have the usual drunken noodles flavor - the spicing and flavoring was similar to that of the Pad Thai. I ordered the Bangkok Noodles with chicken which were disappointingly reminiscent of a soup with a few noodles drowned in the bottom of the bowl. \"Where are the noodles?\" were my exact words as I pushed around the bits of chicken and veggies in an opaque curry broth. I felt Sawasdee was average for presentation, flavor, and service. Nothing to set it apart, no real 'wow' factor - It just wasn't amazing, but it was far from terrible as well. I would be willing to try some of my other Thai favorites like Spicy Basil. Every decent dish deserves a second chance..."], ["Sarah S.", "Food is alright, but too expensive for what it is. Wouldnt recommend this place to anything thats looking for quality thai food"], ["Chelle R.", "Recommended to me by the front desk staff at the Crabtree Valley Marriott.  Good choice.  Good food.  I took my food to go because I was tired from my drive. But upon my next visit to Raleigh, NC I plan on returning cause the Pad Thai was on point."], ["Gregory C.", "Acceptably prepared asian cuisine with acceptable service.  I visited Sawasdee Thai Restaurant And Bar with my son and a friend about 7:30 pm on August 14, 2012.  It was a Tuesday evening.  I was seated quickly.  The others in my party were already there.  The Garlic chicken was recommended to me by one.  It was a simple dish of stir fried chicken and broccoli in garlic sauce.  The plate was garnished with tomatoes and cucumber. The temperature was fine; as was the portion size.  It tasted fine.  That said, nothing distinguished it from similar dishes I have had elsewhere.  I had a draft beer to drink.  It too was fine. The interior decor was similar to that of other traditional asian restaurants; muted dark earth tones.  My associates enjoyed their dishes.My bottom line?  The dining experience was acceptable.  Would I eat there again? Probably not on my own; unless invited.  It is not near where I work or live and they have a LOT of competition in the Raleigh metro area."], ["Leslie C.", "This review is of the location on Glenwood Avenue.I really like the decor in here, mostly because of the inlaid wooden sun shaped engraving in the ceiling and the cool wicker chairs on the one side of the restaurant that make the place seem so inviting.My fave dish here (so far) is the spicy eggplant (with tofu.)  It's highly addictive and oh, so good!The Tom Kha soup was incredibly flavorful and the hot pot made for great leftovers the next day.I am a definite fan of this place and will be coming back often."], ["Lindsay S.", "I love this place.  It's my go-to for Thai food whenever I crave it.  I pretty much equate Thai Food with Sawasdee and am very rarely disappointed in the least bit.  It doesn't hurt that it's only a mile from my apartment!  It is a lovely dimly lit dining area with wooden booths, elegant tables with soft red leather chairs, and even has a landing with wicker chairs and tables up against the window.  I've never had really bad service there and the staff is always friendly and attentive making you feel like you're one of the most important patrons they have.  When I go there I love to get the Fried Spring Rolls as an appetizer.  They are always so amazingly delicious and they have this sweet sauce that comes with them which is perfect for dipping.  My favorite dishes there are Pad Thai and Drunken Noodles (Pad Kee Maw).  I try to alternate between them because I could eat them both and be happy.  I've loved Pad Thai since I was a kid and am used to it being kind of spicy, but Sawasdee's Pad Thai is actually a little sweet.  I'm not sure what makes it sweet, but it's made of stir-fried rice noodles with bean sprouts, eggs, chives, chicken, and ground peanuts with a lime on the side.  My other favorite dish, the drunken noodle, is spicy and oh so delightful with its nice surprising kick aftertaste.  The spicy rice noodles are stir-fried with a house chili paste, eggs, chicken and basil leaves.  Sometimes I can't help but keep eating them even when I'm already full.  They're just sooooo good!!!  Don't deprive yourself of Thai goodness.  Those dishes, plus the lovely decor will never disappoint you.  The service could use a little \"pick me up\" which is another reason I only give it 4 stars.  One of my gripes is that I love to have water with lemon and I always get a lime because they don't seem to have lemons!  It's close enough to perfection even without my lemon though.  I've taken friends, boyfriends, and parents there and they all have loved it!!!  Since I've gotten my coworkers to try it we often get takeout for lunch as well.  I'm sold on Sawasdee Thai!"]], "Shaba Shabu": [["Treasure G.", "Great sushi BOGO free deal especially for take out. The front counter staff were really friendly and the restaurant environment is nice, I wouldn't mind going on a date there with my husband next time!"], ["Cindy G.", "Great location off Wake Forest Rd., this restaurant has great ambience. I loved the Asian theme here with the furniture. Comfortable seating and no wait time on a Sunday afternoon. Lunch specials are less than six dollars. I ordered green tea and the carafe it was in kept it hot throughout the meal. Servings were typical lunch size. Food was seasoned very well and came out hot. Server was attentive and friendly. Will definitely come back here again."], ["Jessica J.", "We ate lunch here. We are the $5.99 lunch specials and had the BOGO sushi. It was so very good. We will definitely return. We had Pad Thai Shrimp, Geisha roll and Tsunami roll. Very good!"], ["Aarti G.", "While the ambiance, decor, and service are great, the food, unfortunately, does not even come close.My table ordered the eel roll, bagel roll, and 3 lunch specials (Pad Woonsen Chicken).  I knew the sushi was going to taste awful right when I saw it.  It was discolored and the fish didn't look fresh at all.  It tasted like it had been taken out of a plastic bag and de-thawed.  There was nothing fresh at all about it.  The sushi was super chewy and did not sit well in my stomach.  The ginger was good but who can really mess up cut ginger.The Pad Woonsen Chicken had no color to it except for the raw carrot thrown on the side.  and had absolutely no flavor.  I had to douse my whole dish in Siracha for it to have any flavor or spice.  Usually thai restaurants have their own sauces, but this one did not. I could have cooked something at home and used the same amount of Siracha to make it taste the same.  The dish was not even warm when it was served.  I was basically eat cold noodles and rice that did not have any flavor.I will never come back to this restaurant and eat lousy food again."], ["Sepi T.", "We were satisfied with every thing that we ordered; soup, salad, main food, coconut cake as desert, and hot saki. The waitress and waiter were polite and helpful. The atmosphere was beautiful and clean too."], ["Bill B.", "I ordered the Gyoza as an appetizer but was very bland, no flavor.   The entree was the Beef Yakiniku (sic).  It was okay, not great, not bad.  I am in Raleigh on business but if I was a local I would not go back."], ["Lissy K.", "I don't understand all the good reviews. I stopped in here because I was so hungry i was feeling light-headed. You would think anything would taste good when you are that hungry. That was not the case with this place at all.First impressions walking in: Seating was confusing. I sort of stood around the front wondering if I was supposed to seat myself or wait to be seated. No one came so I reluctantly searched around for a table and sat down. Finally someone came out and asked if I was by myself. I said yes. Then they proceeded to tell me that people dining alone need to sit in the other section. So I went over there and waited some more. Most of the tables were open and there were dirty plates on almost all of them. Seemed kind of dirty in there.  I chose the least dirty table. Probably wouldn't have stayed but I was so so hungry. Eventually a guy came out with a menu and said \"sorry, didn't know you were here\". Ordering: I asked the waitress if the lunch special was good or if she recommends the sushi.  She said \" we are known for our sushi so I would get that\". This made me excited for sushi, so I ordered a couple rolls.  I ordered a shrimp tempura roll and a spider roll. Pretty common rolls figured they were a safe bet. The order came out fairly quickly. The rolls weren't bad, I ate them because I was so hungry, but they were FAR from great. Would've rated this one star, but I tacked on an extra star, because at least they had BOGO sushi and the location being so close to Trader Joes is great! I would have been sorely disappointed had I had to pay full price. Since it was BOGO, I didn't mind as much, but I won't be back either."], ["Tessa L.", "Came for the restaurant week menu and loved it!! Great service, our waitress was super helpful and friendly."], ["Brad n.", "The atmosphere and service are wonderful. Love the music. Had NY shabu shabu. Nice to see for the price it came with a good portion of vegetables and rice to help fill you. Also they have good selection of beers on tap to choose from. In regards to the meal it was good, and happy with it. Had there been more meat our broth with more of a zing would have scored higher."], ["D R.", "I've only been here once, but I'll be back. The atmosphere is quite a bit different than I expected.  It's much larger with more tables than it looks like from outside. It has a modern, clean and chic feel to it. Stopped by for a quick lunch.  I was in the mood for some soup. The Miso soup hit the spot and was served in a pretty cool, boat type dish.  The Thursday lunch special looked good, so Beef and Basil it was.  It was tasty, but being someone who loves basil, I was a touch disappointed to not see any actual basil leaves on the dish. Other than that, the presentation was excellent. They obviously care about their food. I'll come back with friends."], ["Loisann T.", "Awesome sushi! The staff was very friendly and attentive! The bartender was amazing! He let us try to the sake before we ordered! The menu was big and had a lot of options! Will for sure be coming back!"], ["Moe W.", "I must admit to being extremely disappointed - the service was slow, the food was cold - - our server was new to the job, and although we were prepared to make allowances for her inexperience, we didn't need to as we never saw her - one person in our party had sushi, which looked fresh (and since it was not cooked was served at the right temperature) so maybe ordering anything but sushi isn't a good move. We won't go back, with all the excellent restaurants in the area no need to waste our money on something this mediocre."], ["Allen H.", "Decently priced. Large portions for Pad Thai, very good. By One Get One Free option for sushi takes off the lowest priced item ordered. Sushi is average. Nothing to write home about."], ["Renee O.", "We had miso, yummy roll, rainbow roll and fried cheesecake. Overall the meal was good.  The soup arrived luke warm but the sushi made up for it.  We splurged on cheesecake and it was tasty.  I think if they changed the serving dishes and had removed the soup from our check after we told the server it would have been better."], ["Kristy A.", "Would be 4.5 stars if not for one of my biggest restaurant peeves - the BOGO fine print.   Now I realize that this is fairly common for sushi places, but that doesn't make it any less annoying.  You know what I am talking about  -- the no separate checks policy on BOGO.  Ugh.  This place is across the street from my workplace.  I really like the food and would probably eat here with colleagues all the time, except that I absolutely despise having to coordinate my paying/ordering with others.  Especially in the middle of my stressful work day.  I don't want to do the math and I want to order what I want without having to worry about evening the bill.  You are losing business people...and for what?   A few bucks off some BOGO?   Because of this policy, I go once every two months by myself instead of twice a week with others -- how's that savings looking now?"], ["Ken C.", "BOGO rolls with takeout is the best perk! The staff has always been friendly and extremely helpful. The menu has plenty of options, and almost everything on it has been really good."], ["Ricky K.", "Nice place...food is very good and spicy...cocktails are a little over priced..all overall great experience!!!"], ["Puk B.", "Good food.. The shabu broth is excellent. You cannot miss the coconut cake!!! It's really yummy..."], ["Kim M.", "I absolutely love to have sushi here! The ambiance is lovely and the staff is super friendly and attentive.  The mixed drinks are always on point; the French Martini is divine. BOGO sushi is a concept I am loving in the Triangle.  Their rolls are well crafted and delicious. As someone who loves details the metal chopsticks was a brilliant design choice.  Great place for a date or to hang out with friends."], ["Renee J.", "Oh how I wish i could comment on the food....but I never got a chance to order.  Went on my lunch hour.....wasnt very crowded.  Very nice spot.   The waiter came to ask my drink order then disappeared.  I sat there for 25 mins and he never reappeared!    So sad because I was soooo excited to eat here."]], "Tasu Asian Bistro Sushi & Bar": [], "Shanghai Express": [], "Thai Villa": [["Shammy J.", "How this place doesn't have 5 stars is beyond me. Let me tell you about this place... I've been going here for the past 14 years, hell I go here for my birthday each year. The food is by far the best Thai food I've had in the states at the price range of $10-20/dish. They get all their produce fresh from the Grand Asia Market down the street and you can taste the quality. BEST dishes to get:1. Thai Villa Noodles - Excellent flat noodles with a delicious sauce and veggies. 2. Pad Thai - I have yet to find a restaurant that has a better pad thai. The noodles always come out perfect and have that sweet savory element.3. Pad Prik Sod - Similar to Kapow but I prefer it as the brown suace is excellent.4. Red Curry - HUGE quantity. I could drink this like a soup.5. Panang Curry - Similar to Red curry (also coconut based) but excellent nonethelessThose 6 are the best dishes I've ever had and I do not venture too far from those 6. While I'm sure there are plenty of other good dishes, those six are by far the best of their kind I've ever had. Prices are excellent $10-15 and I usually get 3 dishes for a group of 4. Service can be iffy but at the end of the day as long as you get your food in a timely manner (which you do), the most important factor is the quality of the food and it's definitely superior to other thai restaurants."], ["Steve W.", "We have been coming here for many years, and it never disappoints.  Great food at great prices, and spiced to your liking.Our go to dishes are;THAI VILLA NOODLES: a Thai version of drunken noodles with your choice if meat (wide rice noodles, bell peppers, basil, and egg)PAD THAI: Thin rice noodles with chicken or shrimp, bean sprouts, crusted peanuts, tofu, scallions, and eggKAPOW: your choice of meat with bell pepper and basil in a savory brown sauce.If you like it really spicy, they will accommodate beyond extra spicy.  Ask for 4 or 5 pepper."], ["Edward W.", "Nothing special. I ordered mussels and tom kha khai soup. Soup was over salty and the mussels were average. Ambiance isn't great either. The server was nice but the owner of the place deals with payment and seemed a bit pushy. Pricy for what you get.Don't think I'll be eating here again."], ["Ayanna J.", "Really good food, I'm happy I came here on my visit to NC. When I go back I'd definitely go back."], ["Joe B.", "Huge fan of Thai Villa. I can honestly say that this is probably one of the better Thai places in the Triangle Area. I love Thai curry, and this place does not disappoint. The Green Curry here is among my top choices, but I also love the other classic dishes, such as Pad Thai, Pad See Ew, Panang Curry, etc. They can also customize to any spicy level you prefer.The service level here is also really great. The whole staff is great and personable. I love the decor as well. There are a lot of interesting decorations, all with a very distinctive Thai flair. Definitely a great spot for some kicking Thai food!"], ["P C.", "Still consistant and a good place to get your thai food fix.  Reasonable prices good food friendly staff.Very few other restaurants have lasted 20 years, like Thai villa"], ["Heather M.", "Tried and true Thai food~I struggle to venture out to different Thai restaurants because I have yet to find one that offers tastier Thai food than Thai villa in the raleigh area.I generally get take out simply because the ambience isn't fancy or anything like that.It's a family-owned business and they're super friendly. If you're a regular, they'll know who you are, what you order, and even stop by your table to make sure you're enjoying your meal :)The thing that I love about their food is that most of their dishes don't taste like the typical Thai food you'd get at any restaurant. Of all that I've tried, their Thai villa noodles are my absolute favorite. I mean, it has their name in it so I should've known it was going to be a flawless dish.Their pad Thai is also very tasty.The spicy fried rice was surprisingly good- take note, they don't put in a lot of veggies in their fried rice (but I'm not into my greens so this is a plus for me hehe)The pad see ew is pretty ordinary in my opinion- it tastes like pad see ew you can get at any Thai restaurant.Their spring rolls are huge (each roll has too much stuffing in my opinion)Their portions are huge. It's a great spot to get a casual meal or a yummy meal to-go!Warning: if you do takeout, you may have a difficult time going home because your car will smell like delicious Thai food for the entire ride. Guaranteed or your money back (just kidding)"], ["Gisa D.", "Lunch:Appetizer: 6. FRESH BASIL ROLLS (2 Rolls/Order) 3.95 Noodles, basil, lettuce, bean sprout and carrots Shrimp 4.95 wrapped in rice paper served with sweet chili peanutsauceWe ordered the shrimp basil rolls. One major issue with the    roll that would prevent me from ordering it again. 1. It was all iceberg lettuce, with two pieces of baby shrimp and no basil. They need to reevaluate the balance of ingredients in the roll. Definitely not worth a repeat order. No issues with the peanut sauce.Lunch:Pad woo sen with shrimp - Nice portion size with good amount of vegetables. Vegetable green curry - Store bought packaged fried tofu. This restaurant is located near a large Asian market and I would expect them to be able to substitute steamed tofu. Also, the baby corn and mushrooms were canned and not fresh. Overall cheap at 7.95 but not very fresh or healthy considering the Asian market is next door. Mild spicy is more like medium or hot."], ["Rebecca F.", "My husband took a bite and said, \"the spice here is no joke!\" His dish (pad woon sen) is 2 stars, and he drinking lots of water to combat the heat. The Thai fried rice (also 2 stars) packed a punch!! If you like heat, definitely give this spot a try!I really appreciated that apart from the heat, the food was also flavored really well. You can really taste a lot of the different spices, especially that basil. We tried several dishes and while my toddler-aged daughter loved the pad see ew, I haven't yet found something here that I just love. But, it's definitely good enough that I'm game to go back and try different dishes on the menu!Thanks to fellow yelpers, we tried that taro dessert too. It was a surprise to see the presentation tbh, but the flavors were really good - lots of coconut and the sticky rice wasn't overly sweet like many tend to be. I'd even order this again: a tasty treat! Bonus: their Thai Iced Tea has a really nice tea flavor and wasn't overpowered with cream, a good amount of tea in the ratio! The Thai iced coffee was more bitter than most I've had, but still really good. We'll be back!"], ["Emmanuel O.", "Nice and cozy, got there right before they closed, so I did not get the full experience. I had to do a take out, the ladies upfront were really nice and friendly. Would definitely go back!"], ["Mark E.", "Pad Thai with chicken was absolutely spoiled."], ["Rob D.", "First time visiting and I was not impressed. I had the Panang Curry and it was ok.  The heat was good but not as flavorful as I have had in the past at other Thai Restaurants."], ["James P.", "This restaurant is located in Asian district. Easy to access and lots of parking. I got my usual green curry, papaya salad and Thai tea. Thai tea is made in the restaurant what is a big plus. Papaya salad was fresh and full of flavor, same thing with the green curry. I will come back again."], ["Chali S.", "We ordered takeout and got the Thai Villa noodles, red curry and Thai fried rice. The noodles were pretty good. However the curry was not good and very watery. I've had significantly better curry that's slightly thicker and has better flavor. The fried rice was horrible. I had a couple bites and couldn't continue to eat. It didn't even taste like fried rice wait had this awful tangy flavor. Seems like this place is missing some of that awesome flavor that good Thai food has. Considering the price point I'll be on the lookout for another go-to Thai place."], ["Caroline J.", "I've always seen this place, but never tried. Since my boyfriend loves the shop next door (Stuff N' Such) we decided to just go over after browsing. We started off with the Satay and the chicken skewers were so tender and moist. I loved loved loved the cucumber thing that came with it. For my entree I got the pad thai and my bf got the um...I think the massaman curry. They were all very good. If you don't like sweet foods, this place is probably not for you."], ["Vikas A.", "We are big Thai food fans and always try to explore new Thai restaurants. We were in the neighborhood for shopping and were very hungry. Yelp showed this nearby and nicely reviewed restaurant and we decided to give it a shot. We ordered fried calamari, Pad Thai and Peanut Noodles. All three dishes were smelling bad as soon as they were put on the table. It felt as if it was from oil used numerous times for many other dishes. Pad Thai tasted burned and I could see over cooked stuff in it. Ground peanuts were black in color so you can imagine. We forced ourselves to eat some as we were very hungry. Paid for the whole thing but NO TIP. I'd not recommend this place and I'm sure you can find better Thai restaurant in the triangle area."], ["Brad P.", "Well, I can only assume one thing based on the other review of Thai Villa.  Either I went on a very bad night, I happened to pick thw two items they do really bad, or the good reviews are old and the food quality has dropped off.  We ordered five things, of the five items we ordered one was pretty good, two were marginal, one sucked, and the other item was so bad we ended up not paying for it.The Tom Ka soup was alright.  My only issue was it consisted of a so so broth with a handful of cooked chicken tossed in.  I am accustomed to Tom Ka having more in it, like cilantro, mushrooms, lemon grass, etc.  The spring rolls were well prepared but I found the horse radish/wasabi flavor a bit off-putting.  The Thai Samosa weren't too bad but they had an uncooked flour taste to it that was off-putting.  The Red Curry was borderline uneatable.  It consisted of a copious amount of watery broth with a can of LaChoy bamboo shoots and some cooked beef.  I ordered the dish Thai hot and it was far from it.  The broth just did not have very much taste at all.  The Spicy Eggplant was absolutely uneatable.  Wow was it terrible.  Again it was a watery poorly spice glob.  To the owners credit they did take that one off the bill.Atmosphere 4 - It is a nice small well-appointed restaurant.  The decor is not going to get a Michelin star but for what it is it is nice.Service 4 - I had no complaints about the service.  It was friendly and attentive.  I was pleased that they took the Spicy Egg Plant that did have two bites taken out of it off the bill with very little push back.Cost/Value 2 - Given the poor quality of the food I felt the prices were a bit high. Food 1 - Easily the worst Red Curry Beef and Spicy Egg Plant I have every eaten in North Carolina.  The Tom Ka soup was certainly In my to five worst  I have ever had, including the can of Tom Ka I bought at the Asian Grocery one time.I hope for their sake I just happened along on a bad night.  My concern is that the things I found wrong with the food reek of the kind of corner cutting and food stretching done at a place that is having financial troubles."], ["Cla D.", "I've been coming here on & off to get Thai food fix. All my visits were very good - be it an eat in or to pick up something to go. Love their Tom Yum soup/ Papaya salad/ Panang curry. They ask the spicy level that you would want in your food and it always comes out right. Service is always excellent! Never a disappointing visit."], ["Jeff S.", "My wife and I have been eating here for about 10 years. See gets the Pad See Ew and I get the Thai Villa Noodles, 3 peppers.The trick for me is to ask for the noodles to be lightly fried, or to be made in less grease.They do great takeout - since we have had kids, going in for dinner isn't as convenient as it used to be :)I've had all of the curries, and liked them all as well.There's no alcohol here, and the interior is a little warn. But, the place is ran by a great Thai family, and the food and service are very consistent."], ["Christine A.", "First time here, we were a little concerned since it was quite empty... but the food was great. We had the Red Curry, Panang and Chicken Larb. All if it was great. Highly recommend.The restaurant is very casual."], ["Ines P.", "My go to spot for Thai food! Chicken Pad Thai, Pad See Ew and kao pad - all delicious... Consistently! Love!!"], ["Joanna E.", "We moved to VA a few years ago and miss Thai Villa. Each time I come to the Raleigh area, I make it a point to stop in for lunch. The chicken red curry and the pad thai dishes are both excellent."], ["Shilpi S.", "Its almost a hidden little joint in a fairly big shopping area on Buck Jones road. I believe its proximity to Grand Asian Market keeps the place busy. I have only been here once but loved the quick service as we were really starving after all the grocery shopping.We started with coconut water which did not taste like preservative and was sweet and refreshing. I ordered a panang curry and my husband went for Chicken Red curry noodles. Both the dishes were delicious specially panang curry which was by far the best I have ever had. It came with lots of veggies and all the flavors were perfectly balanced. The portion sizes were really huge we both had to carry doggie bags. Plus is quick service and decent prices. Perfect for lunch!!"], ["Kirsten S.", "We came in yesterday (on a Tuesday evening) and I was hopeful, after switching areas, that I might be able to find a new place to get good Thai food. I was not disappointed at all. The building is not the prettiest thing ever, but the service was great and my pad see ew was excellent. My mother had the pad thai and she liked it, though she thought she might have preferred something a more savory than sweet - she didn't have much knowledge of what sort of Thai food she would enjoy so I recommended something for her.I will definitely be going back!"], ["Mike M.", "Typical excellent little Thai place - hidden away in a modest location quietly serving great authentic dishes. Pad Thai is great. I normally don't have dessert but I cannot pass up the mango and sticky rice. It is to die for. I love this place, it is a go-to lunch spot for me. Never disappoints."], ["Young B.", "Terrible service... Yeah the food is good, but I've had better. The service was so bad that I would never go back. When we walked in, he didn't greet us, but right away asked if we were getting food for here or to go. He ended up being our server and surely enough, he forgot what we asked for twice and served everyone else before us."], ["Michael B.", "A tasty little Thai joint off of Buck Jones. I got the green curry tofu, started off with basil spring rolls (with the peanut sauce - amazing) and ended with the coconut ice cream. Loved my dinner. Minor gripe is the seating (back of the seat too far away form table) but liked the service and decor otherwise. Awesome restaurant and hope to come again."], ["Amanda W.", "Hands down the best Thai food I have ever had! Of course my favorite are the Thai Villa noodles! Also try any of there curry dishes, and the Pad See Ew is crazy good! And let's not forget the coconut soup, and the fact they have chili paste on the table for all you spice lovers out there!"], ["Cecilia P.", "Thai Villa is my favorite thai place to go to! The service there is awesome and everyone is so friendly. Also, the food there tastes really good and I totally recommend this place for Thai food. If you want something spicy, order the Pad Thai and if you don't want something spicy or trying Thai Villa for the first time order the Pad See Eew."], ["Angelique A.", "I'm pretty certain I'd request Thai Villa's taro dessert custard as a part of my last meal. Their menu is extensive, they are open late, and conveniently located right across the parking lot from Grand Asia so you can pop in before doing your shopping. My only advice would be to branch out from what you normally get because everything is good, and to make sure you understand the meaning of \"thai hot\" before ordering it!"], ["Sue W.", "I love their pad thai here.  It is so yummy.  I've been to many Thai restaurants in the triangle area, but in my opinion Thai villa has the best pad thai and pad see ew.  It has the smokey flavor into it."], ["Dawn P.", "This place has the best Thai food in town! Each meal is full of flavor and is aesthetically pleasing. Love the chicken massaman and the Thai steak (NUM SIAM)! My husband loves the Thai villa noodles. The service has been exceptional the two times we've gone. We will be returning to this great eatery."], ["Andy J.", "The place is nice and quiet. The service was good.  We ordered Pad See Ew and Massaman Curry. Unfortunately none of them tasted right. Pad See Ew was missing the wok charred flavor. Massaman Curry was the worst. It was very watery and only come with chicken,  potatoes and peanuts."], ["Shannon A.", "Very good, but dine in instead of getting take out. Thai Villa Noodles never disappoint. The dish called The Abyss was not that great. Too little seafood for the money and the sauce was just water. The coconut ice cream is delicious but when you get it to go they don't put the peanuts on it like they do in restaurant. The Panaang Curry didn't have half the sauce the did when you dine in. Overall for the money we felt like we didn't get a good value."], ["Becky F.", "I went here today for lunch with my son, after perusing the amazing foods and atmosphere at Grand Asia Market.  That worked up our appetites!  We both had Thai Iced Tea while we waited for our food and were commenting on how we felt a bit chilly inside the restaurant while it was pretty hot outside.  Well that changed immediately upon the first bites of our dishes when they arrived!Matthew ordered the Pad Prik Sod (with 3 chili heat!) and I had the Thai Villa Noodles that was designated as 2 chili's, but they kindly toned it down to 1 chili heat for me.  It only took a moment before we were both panting!  (Note, I do not claim to be macho when it comes to spicy food, but I do enjoy some heat.)  The flavors were great in both of our dishes.  We ordered Spring Rolls too which I must say were not my favorite.  They were pretty large and cabbage-y, and I prefer a narrower roll with more delicate fillings.  The Service was Excellent, they obviously take pride in their restaurant and there were plenty of customers in and out who came in as groups and as regulars.  That is a good sign of a favorite local place.  We were very pleased!!"], ["Louis V.", "When I first walked in I was a little disappointed with the decor. Inside felt run down and I couldn't help but notice that a fresh coat of paint could go along way. Also the uneven picture frames was killing my OCD. I so badly wanted to go around and straighten them all out. The service was lackluster. Hardly any communication at all, not even a greeting. From the other side of the restaurant the lady yelled \"how many\" and I promptly replied \"1\". She pointed at a table and I was greeted with a me menu and a request for \"drink?\"  After she took my order I did not see her again. Instead a younger man kept up on my service, refreshing my water and eventually giving me my check. In retrospect, the food was delicious. My order of Pangan Jae was delivered in a timely fashion. The portion was decent in size, and the taste was great. Seasoned well, ok heat (would have liked it hotter as I asked for Thai hot), and overall a yummy lunch. I wish the service was better or the place looked better. Either one of those would have given this place a fourth star. I'll visit again in the future just to just the service again, maybe my review will change, but for now it's a three."], ["Christina M.", "The food was wonderful until a roach crawed across my table. Since I've eaten here only once, I don't know if that is normal there but I will not be back.  They were surprised when I showed them the dead bug and gave me 20% off my meal."], ["Zach M.", "This place is great, they even accept bitcoin! Love the Thai tea and very nice people"], ["Nikhil V.", "Don't forget to order coconut ice cream ;)"], ["Gwen N.", "I LOVE spicy food...and this place makes it nice and hot! First time I came, they recommended \"7 peppers\" for my entree and that was a pretty good level of heat. The next time I came, I went all the way, \"10 peppers\"! Absolutely awesome!Now for the actual food, I usually order the Thai Villa Noodles, which kinda tastes like Drunken Noodles. It tastes great! The only other entree I've tried is the Ka Pow and I like that as well. The only thing I can really complain about is the Thai Iced Tea. I'm not a fan. I don't usually like it when it's already pre-mixed with the cream. I think it tastes better when they're kept separate until the moment you're ready to drink it, but that's just me.Decent prices, good service, and fast take out. I'll definitely be coming back here soon."]], "Thaiphoon Bistro": [], "Tom Yum Thai": [["G M.", "My experiences at Tom Yum Thai have been mixed. I have gotten take-out here several times now so this review is my overall impression for the past year or so. First, the staff and owner has always been friendly and accommodating on making changes to standard dishes- no complaints there - excellent! Second, the seating and facility is nicely laid out with larger windows and high ceilings making the dining area bright, open and inviting.   It is a nice place to have a relaxing meal. Third, the location is convenient and easy to find.  Areas for improvement are below:  1) Price - some of the dishes, especially the appetizers are overpriced.  Come on, Fresh Spring Rolls clocked in at $7.25 and these were not what I was expecting for a fresh spring roll.  These were not wrapped in the translucent rice paper and they had also been sliced up into 1/2\" strips which made them impossible to pick up, dip and eat without making a mess and crumbling in your hands.  I finally just gave up on the dipping part and used the fork.  I've never had \"fresh spring rolls\" served like that.The main entries also seem to clock in slightly on the \"high\" side for Thai in this area.  Not unreasonable but just enough high to catch my attention.  2) Taste - Is OK but not exceptional - at least not the dishes I have tried.   While the \"Wild Curry with Tofu\" was OK, it did not knock my sock off.  As others have said, many items are bland or toned down.  Maybe it because they are accommodating local tastes.   To be fair I have not asked for \"extra spicy\" so maybe that's key or \"native Thai..\" My impression of the food was that it was well prepared, just more toned down than I like.   Enjoy."], ["David W.", "Absolutely delicious Thai food.   Great service.   Good portions.  Amongst the best thai I have ever had."], ["Britt Z.", "Tom Yum Thai is my favorite Thai restaurant that I've tried thus far.  The restaurant is  clean and the staff is pleasant.   I often get the spring rolls, tom kha soup, and the pad thai with chicken.  The spring rolls are your standard roll, but the stars are the soup and main dish.  The Tom Kha soup is so delicious that when I swallow each sip, I feel like it gives my stomach a nice warm hug.    I've also joked that the pad thai must be sprinkled with crack because I find myself craving it time and time again!    The portions of the pad thai are enough for 2-3 meals, so you absolutely get your money's worth!If anyone is a thai lover or has never tried it, this is definitely the restaurant you want to visit!"], ["Kimberly P.", "Absolutely delicious!! The best Thai food I've had locally. My dad spent a lot of time in Thailand - he said this was one of the best Thai restaurants he's ever been to. We will be back again!"], ["Martin G.", "Great portions.  Good flavors and food.  Good service.  Repeat often."], ["Ashley F.", "Super cute inside and out! It was a perfect date night and an easy way to introduce my boyfriend to Thai food. I am gluten free and the owner had tons of options for me to try. I am very sensitive to gluten and did not get sick! The curry had good flavor and we will be sure to be back. Yum!"], ["Mike L.", "Great food. Great service. The price is a little high, but you get enough food for two meals. Definitely worth a try."], ["Tanya R.", "I was passing through town on business, and randomly stopped here.  Wow!  What a great surprise!  This is a bit more upscale Thai food than I am used to-it is definitely not your neighborhood hole in the wall.  It is a big more expensive, but worth every dollar.  The plate presentation and table set up is more fine dining-beautiful!   I think this would be a great date place.  The service is very friendly and they never let my drink get empty.  I had some dumplings for an appetizer, and the drunken noodles.  Amazing!  I will try to come here again.  FYI-They DO NOT TAKE AMERICAN EXPRESS."], ["Diane N.", "What a wonderful gem! The food was delicious and the manager, Pat, was very friendly! We will definitely be back when we're in town!"], ["Suellen T.", "Delicious indeed! I had the Tom Kha Soup with shrimp - flavors so, soooo subtle.  I added Cilantro which just put it over the top as YUMMY!   Then enjoyed the Honey Duck Salad, also very tasty, but I needed 'duck sauce' as I prefer sweet over spicy. My DH had Tiger Tears beef salad, which was tasty & then the Sweet & Sour Chicken = OK, as it was more tomatoey than expected.  My BFF had Pad Thai which she rates as FOUR STARS!.  Just had to take home the duck noodle soup - which I'll savor for tomorrow.  Service was also excellent, very attentive and eager to please. Will look forward to going back on next visit to my BFF in NC."], ["Melissa C.", "Delicious! It's hard to find a place that can give me the level of spice I crave along with flavor to make you do a happy dance. I will be back and you best believe I'm recommending it to others.  Also, my bf's food (he isn't a fan of spice) was equally as fantastic."], ["Susan M.", "I give it 5 stars as I think Tom Yum has the best,most authentic Thai food in Cary & nearby areas. Spicy hot if you want it, not if you don't- they always ask. Food is not only good but beautifully presented. The restaurant itself sits by itself; outside it may not convey the serene setting inside. One of the few restaurants where quet conversation is possible."], ["C K.", "We frequent Tom's every few weeks for a group lunch.  I LOVE Thai food and I have to say after trying several different ones in the triangle, Tom Yum is the BEST.  The lunch special is a great price for a salad/soup, entrée and drink for only $6.95.  The service is always friendly and for the most part attentive; at times they can get busy like any place but the only thing that we haven't been happy with is getting our dishes out at different times but other than that it is great.  The food has a great flavor to it and if you like spice it totally has the heat to it that I love about Thai food.  Beware though because medium is pretty spicy. Check it out if you want quality Thai!"], ["Michael H.", "This place is amazing! You get your food quickly, the staff is friendly, and the food is out of this world. 5 stars! The Thai basil chicken especially is delicious if you need a recommendation. Also, if you have food allergies like me, the menu shows what is in each dish and they speak English well so you can ask to have certain things removed. Go eat at Tom Yum!"], ["Donna B.", "Remember the Raleigh Arctic Blast of late January/early February 2010?  Well, one week I worked from home all week because it was too cold to get out and go to the office.  At the end of that week, I had a doctor's appointment in Cary and HAD to get out. On the way back home, the \"oh-my-gosh-I'm-actually-outside\" set in and I decided to try Tom Yum for lunch.  I placed a to-go order and worked on my CrackBerry while waiting.  I got the Pad Thai, spring rolls and a drink, which came to $18.  A bit pricey for lunch, I think -- that's what I'd expect Thai to cost for dinner.  The Pad Thai's serving size was a bit disappointing but boy was it good.  Of course, my eyes were dilated from my doctor's appointment so who knows -- it could have been bigger than I thought! The service was quick -- I only got through a couple emails before the hostess brought my bag.  I'll visit this place again.  I hope the dinner portions are larger."], ["Erin M.", "My husband and I love this place!   We have been on several occasions and once brought a group.  The service is always great no matter the size of the party.  I don't think we've ever visited and the owner hasn't stopped by the table.  He is so sweet and wants to make sure you're happy.   No matter what we always get a salad with the spicy garlic dressing (we love the dressing so much we've even bought a container to go!) and the chicken Tom Kah soup.  So yummy.  My husband has tried several of the curry dishes and has loved them all, especially the red."], ["Beth M.", "I don't even like Thai food often, but this place is fantastic.  Good, friendly service, fantastic coconut ice cream made in house, and really good pad Thai. Also great chive dumplings.  One of my friends, who is a Thai food aficionado, says it's one of the best places around."], ["Wallace S.", "I would go 4.5/5 stars if possible. The \"Tiger's Tear\" beef was tasty but the beef was a bit more well done than I would have prefered. However, the \"Duck Basil\" entree (i.e., not the soup) was AMAZING! Probably one of the best things I've ever eaten. At $19.95 it's not cheap but I think it's worth it and large enough to share. Service was also very good too!"], ["Jesse S.", "This is a great Thai restaurant. I first came here two years ago and have been coming back ever since. The service is extremely friendly, and the restaurant is a relaxing place to have a nice conversation. The food is great. The chef and staff will answer questions, so it's not as hard to be adventurous and try things you haven't had before.If you haven't had Thai food before, let this restaurant be your first time!"], ["Jessica K.", "I really, really like Tom Yum Thai.  They have a very extensive menu, and I try to get something different every time I go there.  The restaurant itself is always very clean and the waitstaff is extremely nice and helpful.  The food is seriously, seriously great.  But the wine list?  PHENOMINAL.  Short, sweet, to the point, and perfect.  Seriously, with such an extensive menu and short wine list, you might think that's just not right and something's up.  But they pair perfectly with EVERYTHING that I have ordered.  Absolutely delicious.There is something for everyone.  Any dietary restrictions or questions you might have can be accommodated and answered.  I seriously cannot say enough good about it."]], "Tokyo House": [["Beth G.", "I go to Tokyo house maybe 2x/week. For real. That's how much I love their sushi. The service is exceptional, the assortment of rolls and freshness of fish is too notch. The reason for 4 instead of 5 stars is this (well, there's no option for 1/2 stars cause 4 1/2 is what I would give):  sometimes my rolls fall apart as I'm eating them. Not a huge deal, I just eat it anyway. Honestly it's currently my favorite spot for sushi.I was asked what my favorite roll is...well that's a tough one. I think the holy moly is my favorite. I love anything with scallops, which is what makes that one so good."], ["Tim B.", "I travel quite a bit.  I like to try new places and Japanese food is a favorite as I've actually been to Japan and I liked it. I was on Yelp trying to decide which one to go to and selected Tokyo House because it had decent above average reviews but even more important the owner was responding to negative reviews. I thought that took real pride of ownership, showed passion for his customers so I went. Started out good. Sushi selection was good. Decor and cleanliness seemed nice. Menu items were authentic as you get here stateside. I ordered the tempura shrimp roll and the tempura vegetable roll. They looked interesting. Tempura shrimp was a little on the bland side. The vegetable roll was awesome. Great flavor. So I'm happy. Thinking of ordering one more. A roach falls out of the ceiling on the guy at the end of the bar. Not good. Ok I think. I'm from Florida. These things are everywhere. I convince myself it's just one. No big deal. The queasiness in my stomach settles. I order a vegetable tempura. I'm just not sure my stomach can take anything weird but I'm still a tad hungry. I'm trying hard to convince myself not to run screaming.Then..,A freaking giant spider, I just glimpsed it, crawls up the wall on the side. A kid starts screaming, a bug a bug!  It was not little. It was silver dollar size. Yep silver dollar. I just got a glimpse. Not sure what that thing was but I thought spider when I saw it and it was big. Holy crap. I had ordered a vegetable tempura. I couldn't finish. My stomach was in knots. Not happy. Uncomfortable. I just wanted out. Figured the owner would apologize. Maybe take something off the bill for a meal and an evening ruined. Nope. No apology. Nothing off the bill. Nada. Here's your bill and get out. Disappointed and grossed out and will not be returning on subsequent business trips. Fair warning folks."], ["Crystal J.", "I'd like to start by saying that the sushi was tasty and reasonably priced. With that said, there are a lot of places in the triangle where I can get good sushi. I am surprised everyone commented on the \"great service.\" When we first arrived, I had high hopes b/c of the yelp reviews. So when we had to wait ten minutes for the hostess to seat us, I brushed it off. I noticed there were only two waiters, but there was also only 3 tables full, so I think the wait was a little excessive. Once we sat, we waited another 15 minutes for someone to take our order. The food didn't take so long to come out, but by the time it finally got there I was starving after smelling all the delicious smells. Too bad, my pork yakisoba only smelled good. There was almost no flavor. I had to douse it with soy sauce. Also, no one ever refilled our drinks. We were so happy to FINALLY get the check and go home.While the sushi was good, this restaurant is not in my neighborhood, and I don't see any reason why I would make a special trip here again."], ["Eli P.", "Food was pretty good. The three meat hibachi entree didn't really work together but the rice was great. The rice would have worked better without the beef. Server didn't seem genuinely enthused to serve us but she didn't do anything wrong. Overall good time had by all."], ["M A.", "I stopped in to pick up the \"Tom Special\". It is absolutely delicious and I love to sit at the sushi bar to watch them make it. Nothing less than five star service!!!!"], ["Tori V.", "Omg, sooo good. We had 4 rolls and they were all delicious! The best two were Golden Crunchy and Volcano, wish we had 2 of both of those."], ["Angie P.", "First experience & perhaps my last. I based my \"try out\" on previous reviews, so I had high hopes. A Friday night, I called at 6 PM for a take out order. The young lady took my order, name & phone number. She told me it would be 25 minutes & she'd call me when it was ready. I had gone to nearby Home Depot & didn't realize the time til I looked at my phone. It was 6:40 & no phone call. I called the restaurant & the girl said they had tried to call & got a message that \"this wasn't my phone number.\" I was puzzled, because I wasn't having issues with my phone & it never rung. I told her I was on my way to get my food.When I got there, it was sitting on a back table behind the register - I can only imagine how long it had been sitting there. I asked the lady what happened & she repeated the same story, as she's pointing to the receipt with my correct phone number.  I paid for my food & left - $28.50 for shrimp & steak hibachi & a firecracker roll.When I got home (five minutes away), I opened the bags. The lettuce on the salad looked sad, much like some of the bagged salads you get at the grocery store. The sushi looked good, but the asparagus in it was very overpowering, even with dipping in soy sauce. The fried rice was very odd tasting & basically tasted just like brown/white rice. The steak, shrimp, broccoli, onion, zucchini, & mushrooms were all together swimming in sauce. The shrimp had a very fishy/right out the ocean taste. The steak was actually pretty good, although a few pieces weren't very good. The onions were more like onion \"petals.\"I know all Asian restaurants are different & prepare things different ways; however, I wasn't pleased with the taste of anything I got. Prices are high, but you do get a lot of food. They have an extensive lunch & dinner menu.Parking can be an issue since they're located in a shopping center."], ["Howard H.", "I'm really surprised this place has so many positive reviews. We went on a Saturday night at 7. Tables were empty, while the sushi bar was packed. That got me thinking right away that maybe this place is good for sushi only. We ordered chicken wings and beef negimaki for appetizers. Beef negimaki was cold and the meat was rubbery. Chicken wings were super tough and inedible. Very poor quality meat. I was hoping the meal would be saved by the sushi we ordered as our main course. I like sushi and have eaten at a bunch of local spots. This place is not good. Sushi was not fresh at all. I ordered sashimi yellowtail and some tuna as well as some specialty rolls. Either they serve different sushi at the sushi bar or those people have no clue what good sushi is. It was fishy and rubbery. We won't be back."], ["Jeremy A.", "Had a great chirashi lunch here the service was pretty quick for the lunch hour and the price was right. The place is in a shopping center so there is plenty of parking and they have an extremely large menu that includes sushi and japanese dishes for lunch. I will definitely be coming back again to try some of the rolls on the menu. I also need to check out the thai dishes a co worker got the pad thai so I think the pad see eww is next for me."], ["Shelley K.", "Very friendly service. Quick to the table. Absolutely delish!  Seafood ramen is filled with mussels, shrimp, scallops, bok choy, cabbage, in a hearty full flavored broth. Chicken tonkatsu was crisp and moist. The sauce was perfect and authentic."], ["Denise B.", "Quite simply the best place for my kind of sushi ( read into that not real sushi)! I can not ever get past the Tom's Special roll ..love sitting atop the sushi bar watching the chefs do their thing.  All the chefs are friendly and even though working hard, take the time to chat with customers.  Lots of regulars here..hidden gem in a strip mall...heck it's been there over 11 years and I found it 5 years ago..."], ["Scott B.", "Interesting menu. Not completely Japanese. They offer some Thai dishes as well. Sushi rolls were generous with healthy portions of fish. Ramen Miso with pork was very good. As well as the Green Curry my wife had. Best of all we showed up 15 minutes before the closing of lunch and they didn't rush us."], ["T W.", "I was expecting extraordinary and it was just ok. Sat at the bar and the conversation with the gentleman making the sushi was great. Service was ok. Food was ok. I'm still on the hunt for a sushi location outside of Cowfish, which is my favorite."], ["Jane B.", "Oh my gosh what a great meal! It's sushi-Thai, two of my favorites, so friends and I did a mix-and-match sort of meal. There was a firecracker roll that lived up to its name and included an asparagus \"wick\", flavorful chicken and pork gyoza, tasty ginger dressing on a basic tossed salad, a delicious house ramen with chewy noodles, and green curry shrimp heavy on spice and light on lemongrass. Absolutely delicious, all of it, and very fresh. I understand it can get crowded at lunch but was pleasantly quiet the night we went. Service was friendly and fast, with no grumbling about eveyone wanting extra plates and bowls and spoons for sharing everything. Just wonderful. Already planning the next trip."], ["Vince A.", "Awesome service!!! I came in at 2 p.m. 30 minutes before the closed for lunch and received excellent service! The food was amazing!!!"], ["Susy G.", "5 STARS!!  Need I say more...love this place!  Thanks David for the very best sushi in town"], ["Jeff L.", "Among the BEST SUSHI we have had anywhere int he world, and we have enjoyed sushi at 4am in a little stall next to the TSUKIJI fish market in Tokyo.  It does not get any fresher than Tokyo House.  We love this place and would go every day if we had time!"], ["Joshua B.", "Tokyo house has the most amazing food! I could eat it every night! Sushi is always fresh and tasty,  and they also have a wide variety of other dishes to choose from as well. They have a great sake selection and everything is very well priced.  Hands down my favorite restaurant in Raleigh!"], ["Laura G.", "We have taken out from Tokyo House twice. Each time our order has been prepared without error, on time, the sushi is fresh tasting and delicious. The assortment of sushi in the sushi deluxe is also great and the pieces of sushi are just the right size. The salad and soup that accompanies the meal are tasty. They do not skimp on ginger or wasabi. They wave and smile when you enter and leave, which makes me wave and smile too. I will continue to get my take out from here."], ["John D.", "We've been back four times since my last review, and I feel an update is in order.During the last two visits (nov 2013 and yesterday) we had very good experiences. There is no longer a fishy smell when entering the restaurant, which is a great sign for sushi lovers who appreciate fresh fish.Dining with my parents and wife, we spanned the spectrum of sushi, katsu, yakisoba, ramen, and vegetarian dishes. Everything was great; no complaints here.I will recommend this restaurant yet again."], ["Gregory H.", "Sorry Tokyo House, your building needs some serious pest control.  I had flashbacks to living in Houston where the only thing bigger than the bugs were the belt buckles.Up until those bugs literally came crawling out of the woodwork, I was enjoying a tuna roll and some very tasty Penang Curry (a first for me to try Penang Curry).  The service was very good, always prompt. While the food was impressive, the place just left that \"icky\" and creepy impression on me."], ["Jennifer S.", "Great, great, great sushi! Decent prices &  friendly staff :)They will even bring you ice cream for your birthday."], ["Dina D.", "Tokyo House is still one of my favorites.  I usually get sushi but their other offerings are delicious as well!"], ["Christine G.", "I'm really sort of torn as to how many stars this place deserves. Based on my meal alone, I probably would have given it fewer stars. However, as a whole, I think this place deserves the four stars. Let me explain.We decided to try this place earlier this evening, since we were planning on going to the Whole Foods up the street afterwards. We got there around 5:15, and as a result had no wait. We were seated immediately, and the waitress was attentive and helpful without being overbearing. My fiance tried a new sake that he liked; I got hot tea and water. I liked the fact that I got my own teapot for the tea.Fiance ordered sushi; his order came out first. He got a variety of fish, said it was fresh and tasty. I ordered the Tokyo House Clay Pot dish, with tofu and veggies. I will say, it was a lot of food. It was flavorful, although a bit salty, and I couldn't finish it. Brought it home for the fiance to finish. Here's my issue--I cannot prove it, but I suspect that the clay pot dish I had has a TON of salt in it, or possibly even MSG. I'm having some side effects that could be attributed to MSG overconsumption. I don't know if that's truly the issue, and I do realize some Japanese food has MSG in it. However, I haven't been feeling very well since we got home. I'm sure it will pass, but I personally would be hesitant to return to this place (since I don't like sushi at all) purely based on this experience. If you love sushi, I don't see why you wouldn't like this place. If you avoid sushi like I do, choose your meal with a bit of caution if you're sensitive to high levels of sodium. I would return to this place, but most likely choose something else off the menu. I had no complaints about the service, our wait times, or anything else...until I started feeling unwell. That's my cautionary tale."], ["Charlotte B.", "We love this place for lunch. My husband and I regularly meet here for lunch during the week. The food is fantastic, the service is great and the staff are friendly. Where else can you get a soup or salad, a plate of healthy food and a drink for under ten bucks? We recommend giving it a try."], ["Laura S.", "I like Tokyo House because it feels like \"your neighborhood sushi place\" with regulars, good food and good service. It has a casual feel with tables, booths, a sushi bar and  traditional Japanese seating.It has some very muzaky music, but that doesn't keep me from going back."], ["Justin S.", "Tokyo House is my go-to laid back sushi place when I'm looking for quick, fresh sushi at reasonable prices.  It's a relaxing, neighborhood vibe.  When dining alone, I pull up a chair at the sushi bar and watch David and the rest of the sushi chefs go to work.  I've tried a number of the specialty rolls, with Minwoo and Scary Jerry being a couple of the standouts.  I often get an order of the Hamachi (yellowtail) sushi, which is always fresh.  The seaweed salad is delicious and I always enjoy their miso soup"], ["Melissa A.", "I love the sushi here-it's the only place I get it from.  The atmosphere is very casual and comfortable.  The prices are reasonable.The sushi is delicious and the pieces are very large."], ["Jennifer B.", "I LOVE this place! It has been around for a while and I frequented here as a teenager. My parents still live nearby and I stop in whenever I am home. The sushi here is really freaking good. I only have experienced the sushi here not the \"land\" plates. The seaweed salad here is also really good as is the miso soup. The service is excellent and the decor very relaxing. This place is awesome and you should go. Now."], ["Kevin M.", "It pains me to say this, because I have been coming to see David (one of the sushi chefs) for many years, back when he first started at Wariji. The food here is simply terrible.  The taste is not that bad overall to a typical american who knows nothing of Japanese food.  However, if very you are very familiar Japanese food then you would be better to look elsewhere.  The recipes are all off and you can tell they are being cooked by someone who is Chinese. Plus, it's very pricy for what you are getting. The sushi is fairly decent, I would say its above average (when David makes it), but the fish quality is not up to the same level as a place like Wariji. To be perfectly honest I wish David was still back there so I could get my favorite fish from my favorite sushi chef. I have gone to Tokyo house now 5 times and each time the food was disappointing."], ["Jeff F.", "I hate to write a bad review when everyone else has given good reviews, but seriously this place is not good!  Maybe it was a bad night, maybe we got a bad waitress, I don't know but I would never go back.  The service was seriously lacking, she brought out our soup and salad, and didn't give us any utensils or even napkins!  We had to ask and then she didn't bring out enough, and the one fork she brought had a dried chunk of food on it!  The food was okay, but everything had an off flavor, I really wasn't impressed, especially for the cost of the food.  I wish I would have tried the sushi instead, but we all ordered entrees, so maybe that was our mistake."], ["Jessi F.", "I love this place and continue to eat here regularly but they are certinaly not perfect. Food is great, service is okay at best.I would not eat here if you are in a hurry. Almost every single time I eat here I have to wait an extremely long time for everything and the whole meal takes well over an hour. Last night, we waited 45 minutes for our sushi after ordering. We are often stuck in a corner where we easily forgotten I think. As a result, I try and sit at the sushi bar (can't forget me there!) and I believe their lunch service is better than dinner but I've never been.However, I keep coming back! The food is delicious!! All of the sushi is wonderful. The ginger dressing on the salad is fabulous. The Thai Chicken Lettuce Wraps are super delicious as well. I am also a big fan of the punch cards. You get a square filled for each $25 you spend there and after 10 squares you get $25 off your meal! So go and enjoy but don't go if you want a quick meal!"], ["Jane Y.", "I've been here twice.Once, was a LONG TIME AGO and it was average. Since then, I think they got a new partnership with someone so there are new items on the menu.The chirashi was SUPER DELICIOUS. SOOO MUCH FISH AND SEAWEED AND AWESOMNESS. Not much rice, it was just perfect. just the perfect chirashi I've had yet.The minwoo roll was also really good and creative. It was huge!!! very generous.I know this review is short, but seriously, give this place a shot! Get the chirashi!!"], ["S J.", "I've only gotten takeout so can't comment on the restaurant itself, but the sushi is the best I've had in Raleigh.  Sashimi that melts in your mouth, and Chef's special rolls that are to die for.Recently we've been getting the Sushi and Sashimi for 2 which is a nice selection and can easily feed 4."], ["Nene K.", "This update is for the Minwoo roll specifically fyi.I decided to try this roll after all the positive reviews on Yelp about it. I ordered on Valentine's Day when the place was slammed, but I eventually got my food.I found the Minwoo roll to be a little too heavy! There was too much going on at one time, too many flavors for one sushi roll. I prefer simpler flavors. Nonetheless, for what it is and for its uniqueness, I still give it 4 stars. It was also incredibly filling, but expectedly so for a roll that's nearly $13!Verdict: Tokyo House is one of the best places in Raleigh to get sushi. I still prefer their nigiri sushi over the Minwoo roll, however."], ["A D.", "I wasn't impress. Waitress was kinda rude. First time there I don't want to go back. Sushi was not that fresh."], ["Michael E.", "So here's where David wound up.  I first met David when he was working at Waraji.  Great sushi chef and always fun to chat with.  I had heard through the underground sushi vine that he was here and wanted to show him some love, so here's where we wound up.  I had originally thought to order an entrée and not tie up a sushi bar seat, but walking in and seeing the expanse of the sushi bar, and also being misunderstood when I said hi to David, one of the waitresses sat us at the sushi bar.  Brit and I wanted some sushi and this is one of the few places that serves Ika butter.  Ika butter is broiled squid in a dark butter sauce.  The flavor is unbelievable.  Squeeze some lemon over it add some Schichimi or (seven flavor chili pepper) on top and you're good to go. I ordered some gyoza with some sushi rice.  The gyoza were quite flavorful, pan fried to have just the right amount of crunch without being overly so.  The pork was well seasoned and it worked well with the sauce and my side of sushi rice.We ordered green tea and our server came out with two full cups and a tea pot.  Fresh green tea leaves were in an infuser bowl in the top of the pot.  They also have free tea pot refills so I was stoked.  We ordered a bottle of the Sho Chiku Premium Ginjo to start the dinner off well.  Smooth with a subtly sweet flavor.  On to the star of the evening...Sushi.   David appears to be the primary sushi chef here and he has one assistant who seemed to be focused on putting the rolls together incorporating the fish that David cut.  We ordered sashimi white tuna (escolar), salmon, yellow tail and tuna.  We also ordered a Rainbow roll, Scary Jerry, spicy tuna and a Minwoo roll.Brit loves her white tuna so she saved a couple of the sashimi slices for dessert.  If you like Toro this is as good if not better.  It's also called butter fish, because of how it melts on your tongue.  All the fish was fresh and flavorful.  The pieces weren't too thick and weren't too thin.  You can't beat the price point on the sashimi here either.  30%-50% cheaper than other more notable restaurants i.e. Mura, Sono and Waraji.  The rolls that we ordered were also very well put together and had plenty of fish.  The Rainbow roll is standard in all sushi restaurants.  This one had white tuna, salmon, eel and yellow tail on the outside and was utterly delectable.  The Minwoo roll is a mixture of spicy tuna,  salmon and yellow tail, avocado and tempura bits on the inside. while on the outside is a layer of white tuna and avocado which he crisps up and then layers on a couple different types of roe.  Wow what a flavor and texture combination this was.  Crunchy, sweet, salty and smooth.  The Scary Jerry is a  concoction that's been around for a few years and all I can says is you have to try it to fully appreciate it. This is one of those rolls that has a pile of more things placed on top.  The roll is the crunchy roll with scallops.  So tempura bits with scallop and smelt with a shrimp exterior.  Then dolloped on top of each roll slice is  a mix of spicy yellow tail, tuna and salmon with a small slice of avocado to help turn down the heat.  I highly recommend the Karatamba sake that we ordered three bottles of after the Sho Chiku.  It had a wonderful nose, sweet but not overly so and if you can describe a filtered sake as being thick on the tongue it was.  It had an almost caramel (think bourbon) taste while being \"ricey\" and smooth and had a clear finish.  Service was on point with us not wanting for anything the entire night.  No empty tea glasses, or pot for that matter nor any issues with getting our plates cleared or our sake bottles replaced.  What a great sushi, scratch that, what a great overall experience.  We'll definitely be back."], ["Daisy J.", "I never imagined a place like this would exist until I step foot in there for the first time. I've been going to Waraji for sushi. I Never order rolls, I'm in it for nigiris.  As much as I need fresh nigiri, I'm very critical of traditional Japanese home cooking.  Items from the kitchen are important to me to judge this restaurants authenticity.  I must said I'm extremely satisfied and pleasantly surprised that katsu don, nabeyaki udon are absolutely perfect. These are basic items in every Japanese house hold. Sushi is also held to the freshest standard.  I must come back and I will soon!"], ["Abby L.", "Only been once, but I had a really good experience. We sat at the large sushi bar. The guys working there and the regular floor wait staff were very friendly. What I noticed most was the number of regulars who came in and how everyone on the staff recognized them - by far the cutest being the little girl (with her mom) who'd just started 6th grade AND gotten braces this week. She was clearly a regular, too. And the people there knew her, made her feel welcome. I'm a downtowner, and I don't usually like traveling so far out, but I'd totally go again. I ordered two rolls. The Honeymoon roll is \"Eel, cucumber & Japanese min leaves roll w. sweet eel sauce.\" Very tasty, kind of unusual... not amazing, but definitely good. These are fairly small in size. I loved the mint. The AMAZING OMG roll I got was the Minwoo Roll - \"mixture of spicy tuna, salmon and yellowtail, avocado and tempura bits with torched white tuna and avocado outside, finished up with fish roe and special sauce.\" I would make a special trip back just for this one. Really pretty to look at, but a delicious flavor explosion. I ordered well! My friend Pamela got the Golden Crunchy Rolls, and they were good, but Minwoo is my friend!"], ["Sue P.", "This is our go to Sushi restaurant.  Must haves here are :Dynamite Bowl (appetizer)Gozilla RollNY RollTheir main section offers regular seating and  off to right side of the restaurant, are curtained  off rooms you can sit on the floor in Indian style.  From what I understand, these rooms must be booked/reserved well in advance.   What I'm not a fan of here is their dessert.  I've had better fried bananas and fried ice cream elsewhere.   However, anytime momma needs her Sushi fix - Tokyo House is the way to go."]], "Red Pepper Asian": [["Heather B.", "I'm skeptical of many restaurants - especially little ones stuck in strip malls(??). I read the Yelp comments on this one and I was NOT disappointed. I had the wonton soup-best ever. The broth wasn't just run of the mill- it and the wontons were superb (this over wonton soup?). I opted for the basil chicken dish - BEST DECISION !! Not only the best Thai meal - but really best meal in a long while.My friend, who is very well traveled in these regions, loved every bite as well.I will return- no doubt!I strongly recommend this little restaurant !"], ["Amy H.", "A really good Chinese restaurant in East Raleigh Considering that much of this area is filled with walmarts, chain restaurants and general sketchiness, I was shocked to find this place. Don't be deterred by the strip mall location-it's actually really cute inside and the food is awesome.Confession: I'm not generally a big fan of Chinese food (well, the Americanized Chinese food anyway. I'm sure Chinese food in China probably doesn't taste like what I'm used to). For years, I wouldn't eat it at all. That changed after discovering Restaurants that have both an American menu and a 'traditional' menu. Red Pepper is one such place. I got the ma po tofu (a dish that's hard to find at many Chinese restaurants here). It was delicious and had a slight spicy kick (though not super hot so you don't necessarily need to avoid this dish if you're not a spicy food fan). At ten bucks for a huge serving, the price was right too. If you're not a fan of the typical American Chinese fare with tons of grease and sickly sweet sauces, give this place a try instead!"], ["Jeremy A.", "I stopped in and got an order of the Chens chicken to go. It was closely comparable to general Tsaos chicken for me though and wasnt spicy or anything out of the ordinary. Its worth mentioning that their online ordering system is flawless though, it worked really well. Plenty of parking since its a strip mall and the prices were nothing crazy. Ill be going back again to try more stuff."], ["Scratchie S.", "I'm disappointed in this place after my second visit. First visit, at lunchtime, I had Kung Pao chicken. I asked for it extra-spicy and it was good. Standard American Chinese version with a little extra spice. But my wife wasn't blown away by her dish at that meal. Last night, visited again and was excited about trying more of their menu. My take: Fried Calamari appetizer: good, but kind of bland. Easy to overpower with soy sauce or duck sauce, too... with just the right dash of seasoning, it was very good, but it was very bland the way it came out of the kitchen. Fried dumplings: OK. Again, very bland. They get points for not using a super-thick wrapper, but lose points for the lack of distinctive flavor. Finally, I ordered off the \"traditional\" menu (or whatever they call it) for my entree, and was very disappointed. I got the beef with chilies, and it was just a mess. Way too many scallions, IMO, and the scallions, onions and peppers were diced into ridiculously small pieces. With all these different flavors, the dish still didn't have any predominating flavor and it just tasted like a bunch of stuff thrown together. I liked it less and less as the meal progressed, and neither finished it nor took home the leftovers (this is, I should mention, completely unprecedented for me when it comes to Chinese food). Maybe I need to try the Malaysian or Thai food, but I honestly don't know how soon I'll be back here. My quest for good Chinese food on the East/Southeast side of Raleigh will, unfortunately, have to continue..."], ["Lori R.", "Sunday night and Husband actually uttered the words that he was hankering for Asian (not a common occurrence)...so I went with it, fast!  Searched \"best Asian\" here and was drawn right into reviews and pics from this place.  Off we went, unsure of where exactly.  Let me clarify:It's at the corner of New Hope and New Bern Avenue.  From the Beltline (New Bern Ave exit), it's less than a mile heading away from town, on the left in a strip center that has Carly C's and Hamrick's.  It is indeed small and when we arrived around 5:30 we got one of the last two open two-tops.  And there were people waiting for take-outs.  The whole time we were there, people were coming in for take-outs.  (understandably so!)No alcohol options.  Get over it.  I had to.  Unsweetened tea for me.  Diet Pepsi for Husband. Menu is full of pics that are quite helpful and drool-worthy. So is their website! TIP: the \"traditional\" menu that others have spoken about was not on the back of both our menus.  It does exist...Husband had it, and I was thrilled to find what I had seen Ron W post a pic of:  Malay Sambal Shrimp.  Husband opted for Hunan Beef.   We both wanted to try the Spring Rolls...one for me, two for Husband. Spring Rolls were served after several minutes, piping hot, with clean squeeze bottles of spicy mustard and sweet sauce.  Menu mentioned ground beef in them, but there wasn't any spotted. Didn't matter as the veggies were good and the wrapper was crisp.Entrees  arrived shortly after we finished the rolls and were as yummy-looking as they tasted. (see pics)  Both were served with bowls of rice.  Shrimp dish had red bell peppers, onions, lots of string beans and good-size plentiful perfectly cooked shrimp.  Very slight spicy kick. Husband was quite happy with his beef dish that was full of mushrooms, which he loved.  Also had broccoli and carrots. I traded a shrimp for a floret and it was a fair trade. Prices...very reasonable for the quality, quantity and expertise!  My shrimp dish was $12.95.  Husband's beef dish just $9.95.  Spring rolls $1.25 each and drinks $1.75 each.  A little over $30 before tip.  So worth every penny!Service just right, and even the fortune cookies were crisp and tasty.I will add that everything else we saw come out of the kitchen looked incredible, and everyone dining seemed quite happy.  And yes, you have to ask for chopsticks if you want them.  Loved that they don't waste them needlessly."], ["Michael B.", "My typical reaction normally would have been \"Ah, a restaurant in a crappy shopping center in a lackluster semi-industrial area of Raleigh - so what?\" But I would have been dead wrong.Red Pepper Asian does not disappoint - the interior was attractive and intimate, and the service was prompt and courteous. My food was excellent. Had a vegetable spring roll along with Kung Pao shrimp. Both were great (wish the kung pao had been a bit spicier but the peanut sauce was delicious). There also is an authentic Chinese menu on the back that I want to come back and try. Sadly, all the way over in East Raleigh, but if you're in the area, this could easily be the go-to spot for Chinese. Well done!"], ["Lorie P.", "Our favorite local Chinese place. We eat in and do carry out a few times a month and we are never disapponted. Love their hot and sour soup, pot stickers and we are big fans of their spicy entrees."], ["Blake M.", "For a while after moving to north east raleigh my fiancé and I frequented a different Chinese takeout place, mostly because it's cheaper. But the old adage, you get what you pay for, is definitely true. We eventually switched over to Red Pepper for our takeout needs and we won't be going back to the old place. They have many more vegetarian options than many similar restaurants, the crispy eggplant, sesame tofu, and curry tofu being our favorites. They are a little stingy with the soy sauce and duck sauce, so ask for extra if that's important to you. It's close to our house, the prices are reasonable, and the food is always ready within 15-20 minutes after ordering. We'll keep coming back."], ["Ranjay J.", "I always get lost coming to Red Pepper (it is located in a weird shady looking strip mall), but the food is worth it!  Everything my partner and I have tried is delicious!The trick is to order the Chef's specialties, which are authentic Malaysian/Singaporean/Asian food, instead of ordering from the Americanized menu (which is really poor in my opinion).The paper-wrapped chicken, Singapore rice noodles, Chow fun and Pad see ew are our favourites.  Only minus is that the food is slightly greasy."], ["LaShawn L.", "I tried this place for the first time tonight. I have to give them 5 stars. The inside was really nice and comfortable. I ordered take out and my food was fresh, still hot when I got home and really good. I am happy that they are in my neighborhood. I know I am not right for saying this, but I REALLY hope they stay and put Wang's Kitchen out. love, love, love this place."], ["Michael G.", "After a couple of very disappointing visits, I barely can give this restaurant 2 stars.  I feel obligated to rate it though, as the highly inflated ratings are totally not deserved at all from my perspective.  I definitely expect so much more from a restaurant of this type.   Even though it is hard to get great Chinese and Asian food in the area, this place seems to fall way short of other places we prefer in the Triangle.  It seems as if they are more concerned about collecting money here while delivering small portions, mediocre food, and service, instead of putting any love, passion, and care into their food and service.We ordered multiple dishes, most that came out greasy, loaded with salt and/or msg, and left me and my wife feeling kind of crumby afterwards.  The soup was almost exclusively broth with very little else in it, and nothing we ordered was memorable enough to want to come back.The service was also forgetful and mediocre at best...  It's a definite pass for me..."], ["Brian P.", "What a great little place!  Local and not a chain- the best Thai food I've had. Service was fast- the chef prepared the meals very quickly. The food was full of flavor and very authentic. My wife had the pad Thai chicken and I had the curry chicken. Very clean and nice decor. Definitely a place I will visit again."], ["Ron W.", "Interesting remake of what used to be Fortune Palace, the owners have opened up a new spot in E. Raleigh called Red Pepper Asian!  Located in a very quiet strip plaza, Red Pepper has a nice menu of Chinese and Thai dishes with Malaysian mixed in.  I order up paper-wrapped chicken, Singapore rice noodles and Sambal shrimp and string beans.  The interior is comfortable and casual, it takes 15 minutes for my food and it's excellent. Tender, flavorful chicken, slightly curried rice noodles and spicy, shrimp with a bit of heat.  Overall I found all my dishes pretty authentic and well-done.  If I lived in the area I'd certainly come back but due to its location, Red Pepper will be a once in a while treat.   But if you're looking for interesting and spicy ethnic eats in E. Raleigh, stop on by..."], ["Tyesha G.", "So glad that we've found this little hidden treasure. We have not had really good Asian food since we moved here from NY.  This restaurant has excellent service and very tasty food. It is also a nice quaint family friendly restaurant!"], ["Reiko H.", "Red Pepper Asian is my go to place for Chinese food.  Everything is freshly prepared, and taste wonderful.  This is not your $5.99 combo special type of place.  A bit more expensive than a Wang's Kitchen, but worth the price.  Try Red Pepper Asian; you will like it."], ["Jin Y.", "I only recently found out the owner of this place used to own Fortune Palace, my favorite authentic Chinese restaurant in the Triangle Area.  Red Pepper has some very authentic dishes I love. Beef with Chili pepper, 3 cup chicken or squid. The place is small but cozy. Authentic dishes are on the last page on the menu."], ["Kim B.", "Well FIN-AL-LY! An Asian restaurant to brag about.  I went here on the review of Lori R. (waving emphatically..thank you Lori!) because every since I moved here from the NY/NJ area I have just not found an Asian fast food restaurant that I love.  Red Pepper Asian is  a very nice suprise because it doesn't look like much on the outside.  I do not go into this shopping center much because there is literally no store in there that I would frequent so for me, Red Pepper is is like hiding back in the cut but it is not what we used to call in my hood - a hole in the wall.   Once you walk in you are like...okay then peeps, I see you with the simple, yet quaint decor and the ambiance with the low lights and all. What??? Holla!  It felt like date night!  It is a very small spot but I like that a lot because sometimes you go to a restaurant and there are so many people and often it's loud between people talking and overhead music that I think these places forget you want to reeeeeeellllaaaxxxxx!  Me and Sgt Major Husband (yup i have one of those) can often feel like..dang, why didn't I just stay home and eat in peace.  So if you want relaxation and you want to turn down and not be turned up....check it out.Okay yeah what about the food right?  The food was great.  We had calimari which was a little different than what I was used too but it was great - crunchy which is important.  who don't like to crunch okay?  I had the triple delight...the portion was great but what impressed me..what the size of the shrimp.  It's been so long since i have seen a real jumbo shrimp...I was beginning to think they were going extinct or somenthing.  My husband said \"wow\" and trust me he that translates to, \"wow, honey that really looks good, I am going to grabbing a few of those off your plate.\"  Sgt Major Husband had House Pan Fried Noodles which was also very good.  And the interesting thing about that is..he had shrimp on his plate too, but somehow eating some of mine made his dish taste better.  funny how that works.Oh and this is the ultimate cherry on top for me....The unsweetened ice tea with lemon.  Yesssssssssssssss hon-tey. I am an unsweet ice team snob.  It cannot have that bitter bite on the end of a sip and it just CANNOT be watered down.  There is an art to this here thing - trust me! How you gonna be cooking in the South and you can't make ice tea properly.  No stop bragging about your crap - learn to make tea, lemonade and Arnold Palmers and THEN...I am impressed.  Their tea was perfection!  So not sure where you are living your life in the Triangle, but I personally don't let distance stop me from a great dining experience so check this one out.  Guys...don't take your Golddigger to this joint okay..she won't appreciate it.  Better yet how about you just dump her altogether, keep your coin in your pocket and get you a nice girl who likes and adventure and who will go with you to the neighborhood joint.  We call that \"An around the way girl\".....but she digresses...as usual. Red Pepper Asian....that's what's up."], ["Paul E.", "I was passing by corporation drive and wanted to check out the mall for food. It's on the same side as the car wash on the opposite side of New Bern. The name was catchy something I'd think of and the front had Asian dishes placed. It's a nice place with modern decor and 10tables for 4pax. The lady came with the lunch menu and it was around more than 10pictures with description. I chose Thai Basil Chicken with a choice of beef. It came with soup or spring roll and the soup had choices which I chose Wanton and it was flavorful with 1 wanton it also was served with crispy appetizer. A choice of white or fried rice which I chose fried very tasty. The chicken just had enough heat to eventually make me sweat. The basil tasted fresh and just the right amount of sauce. Total with water and tip $9. Service is super fast. I'd come back to taste the others in the menu."], ["Rod O.", "Wonton Soup was nice and MildMongolian Beef was VERY Good one of the BEST I have tasted!Egg Plant with Beef was pretty GoodService was Excellent, easy to make substitutions on my Dish!28 Seats Inside and Right now none Outside.  Nice Looking Cozy space!"], ["Susan P.", "Service:  Just the basics.  Order taking, food delivery to the table, and the check.  Nice enough.Food:  Crab rangoons and steamed buns (potstickers) were ok.  The main dishes were pretty bland.  Husband's kung pao chicken was bland with hot sauce, not that tasty flavorful spicy hot you get other places.  I can't even remember what I had, something with chicken, shrimp and \"beef\".  It didn't have the taste or texture of good beef.  There was so much salty sauce the crunchy noodles got soggy quick and the sliminess that remained wasn't good.Atmosphere:  It's in a strip mall where there are more \"for lease\" signs than store fronts.  Inside isn't very attractive either.  Don't stay, get takeout."], ["Josh P.", "I tried the beef chow fun, which didn't have the traditional fermented black beans, but tasted good. I also tried the sesame tofu, which looked overcooked, but tasted perfect. Also had some wonton soup, which was quite good. Overall, a very good dinner that I will have to try again. It's a bad location, but has a pleasant look and friendly waitresses. The music was a little odd in that it was the same song on a loop, but it was a mild enough song that didn't bother us."], ["M M.", "Great Asian takeout option for east Raleigh. I've gotten the takeout here a few times, and each time it has been great. Love the Thai basil with tofu, and the red curry. Friendly staff, never a problem with order accuracy or timeliness. The restaurant is very nice inside as well, but I haven't dined in to date."], ["Scee J.", "Ok if I really want some Asian food. Conveniently located right off 64 between jersey mikes and Hamricks. Take out is pretty quick and accurate. I do like that they have lunch specials on Saturday too."], ["Anne K.", "We just got back from Red Pepper and we had a great meal.  My husband enjoyed his Kung Pao Beef but says he wanted it to be a bit spicier.  Our friend had General Chen's Chicken and he says it was quite good.  I had Pan Fried Noodles - which were served on a very generous plate.  I also tried the spring rolls and they tasted fresh and yummy but were just a touch on the oily side.The service was fast and friendly and I suppose the biggest testament to the quality of the food was that all of us (even my 5-year-old son) polished off our entire plate of food.  There were no leftovers at all.  The prices were also reasonable, so no complaints there.For me, the best part is that Red Pepper Asian is less than five minutes from my house.  I'll definitely be back!--AnneK"], ["Ben F.", "This is the best Asian restaurant in Raleigh.  The hot and sour soup is a favorite start, the egg rolls are to die for, and dont miss any of the amazing entrees, my favorite is the orange chicken. Keep up the good work Red Pepper!"], ["Margaret M.", "While I haven't yet returned to the restaurant, I have discovered the owners used to own Fortune Palace which was my favorite Chinese restaurant ever. I had upgraded to 4 stores solely based on that because I have missed that restaurant."], ["Joshua W.", "I don't normally write reviews.  But on a business trip to Raleigh, my co-worker and I decided to get some Asian food and this was on the yelp list as a good place after lots of reviews.  After eating here, we will be doing something I've never done outside of hotel restaurants...we will be eating here again tomorrow.  The food was FANTASTIC!  It is easily in the top three asian restaurants I have ever eaten at (and I've been to more than a few in a few different states).  Great job to the staff and I look forward to lunch tomorrow as well."], ["Tai R.", "Pricey, but best chinese food in Raleigh. Authentic, clean restaurant,  great customer service. The thai basil beef is AMAZING! My family also loves the general chen's chicken."], ["Maxine W.", "Ever since we moved to Raleigh 7 years ago, we've been searching for some good Asian food and because we couldn't find any, we stopped eating it. ..until we came across this place!!! Simply the best we've found in the area.  The food was fresh and very good. The service was good and  our server was very helpful. The place is clean and cozy.  Definately worth the visit. This is our spot from here on."], ["Rachel T.", "Got the beef chow mien and it was delicious! Should give this place a try. Service was very nice. Also they have a 100 rating."], ["Justin P.", "Remember 2 years ago when there was this amazing place in Raleigh called Fortune Palace? Well the owners of that restaurant has now opened up a new restaurant and this is it! Because we are friends with the owners, we know that they opened up a new restaurant because everything is working and it's a lot smaller. This place is in the middle of nowhere and that's what makes the place so glorious. It's in the the middle of some run down strip mall that has maybe 4 different stores throughout the entire strip mall. Let's call it a hidden gem. The food here is just spectacular. Although it isn't \"Chinese\", the calamari is definitely their most popular, and their best appetizer. The table next to me ordered 3 orders of it! That just proves how much people like it. With a condensed menu, there are various noodle, rice, vegetable, chicken and seafood options. And that's only a little bit of the menu. They also have a bunch of different Malaysian curries, which I think are very tasty. We ordered beef wide rice noodles and it was delicious. We also ordered a shrimp and green bean dish that had a very unique black pepper sauce that was absolutely outstanding. Just as a precaution, some of the food can be pretty spicy, so if that is something you don't enjoy, then you might want to ask your server. Speaking of service everyone there is so friendly. They can start up a conversation with anyone! It is also quick and attentive. Even if this place is not really in your area, I would highly recommend going out of your way and give this place a shot!"], ["Brandon P.", "I've been looking for decent restaurants for lunch on this side of town and I'm happy to have found this gem.  I ordered the Gen Cho chicken, with wonton soup.  The soup was served in generous portion and had good flavor.  Loved the broth.  The entree was cooked perfectly.  It had just the right amount of breading on the chicken to produce a crunchy texture, yet the chicken was tender and juicy inside.  The sauce, despite being described as \"hot\" on the menu, was fairly mild, but still delicious.  The service was polite and expeditious.  I spent less than 7 bucks for a great lunch.  I will definitely return."], ["Matt R.", "Found this place accidentally but I'm glad I did. The szechuan green beans were great! It's places like this - great food, good price, simple dining - which I'll want to come back to."], ["J K.", "Great quality food and service. One of the best in Raleigh. Take out is just as fantastic and always timely. Try the pork dumplings app, pan fried...awesome! Great lunch specials, Singapore noodles and any shrimp menu item is a must try."], ["James W.", "Red Pepper just opened and it has become my favorite Chinese/Thai place in East Raleigh. It's the kind of place that, were you to move to a new city or neighborhood, you'd go to the local Chinese place and think, \"It just isn't the same as Red Pepper.\" The staff gave great service and were quick too, and the Pad Thai was spot on. Even if you don't live in East Raleigh it is worth making the trip over here."], ["Phalon L.", "This place is yummy!!! I must admit, I was skeptical because the location is in a strip mail. My guest and I arrived at lunch and when we walked in, I was surprised . The inside is small, quiet, and cosy.  We were looking over the menu and I was disappointed. The lunch menu is very small, but we asked the waitress for a full menu and that was a game changer. We order the spring rolls, soup, and three other dishes from the menu. They were all amazing!!! Can't wait to get back to this place!"], ["Kendra B.", "This restaurant serves typical Asian food, but all of it is very fresh, and not over-processed or over seasoned. Staff is kind and respectful, decor is warm and bright. Prices are very reasonable. We could eat here  every day!"], ["John K.", "The food was tasty, the serving sizes and prices reasonable, and the service was friendly. They had items for both vegetarians and meat-lovers but were willing to accomodate special requests. Definitely a cut above your typical Chinese take-out but a bit more casual than P.F. Changs, for example.  We will definitely be going back when want something quick and tasty!"], ["Quynh N.", "I love the food here!! Our family comes here once and awhile and they never disappointed. We always get the famous calamari, chicken wings for appetizer; Mongolian beef, beef chow fun, house pan fried noodles. They are all very good. I'm never afraid to try new food here because they always deliver. The restaurant is small and it's located in a very small and kind of old shopping center, but quality of their food and service is more important to me."], ["T Mac G.", "I ate here for the 1st time tonight, and it was very good. I ordered the  Combo Lo Mein(chick,shrimp&beef) it had nice big slices of tender meat. Really nice staff and close to home. I'll definitely be back!!"], ["John S.", "Fresh fast and tasty!  We ordered Kung Pow Chicken and Beef and Broccoli All the veggies were fresh, the meat was tender. My hot and sour soup was just right and the crab rangoon actually tasted like cream cheese and crab.Glad I found this place on Yelp and I'll be back!"], ["Just Being T.", "Awesome food. I have not good chinese since I lived in DC and also when I visited San Francisco. I ordered the basic shrimp fried rice and shrimp lo mein just to see if they would pass the test. When I visit again I will venture out to the rest of the menu :)"], ["Jillery Ellen S.", "Small groups best.  6 or less:-)Great Chow Fun. Smokey rice noodles and fabulous flavor!!!"], ["Jenna P.", "Wow! The food tasted so fresh and the service was excellent. Very clean restaurant as well. Will be back."], ["Julie L.", "My family and I have gotten takeout many times - all delicious, but traditional American style Chinese. Decided to go out on a limb and try the Red Curry Chicken since I was craving Thai and OMG, so glad I did!!! So excited I have found a curry dish that rivals Basil's based in Charlotte. If you've been afraid to check out the Thai options, don't be -- it's got some serious heat, but I'm sure they'd tone it down of that's your preference. Best part - only $12 and can easily get 2-3 meals out of one order. Highly recommended!!!"], ["Kelly F.", "Their pan fried dumplings are just super!!  Having had take out several times - haven't had a bad dish yet.   Love the beef chow fun and the spicy Thai noodle with chicken (sorry, I can't remember the name!!).   Don't let the strip mall stop you from trying this place."], ["Brad K.", "I have always been on a quest for outstanding beef chow fun... they made it!"], ["Sunny A.", "Absolutely the best Asian food I've had.  Clean place, very friendly and above all greatly prepared food that hits the your palates in the perfect place. The place from outside may not seem like much, by it makes up for it with grate tasting food."], ["Rashida S.", "Great service and even better food! I'm so excited to find delicious Asian Cuisine without breaking the bank. I was particularly impressed with the Mongolian Beef. Also, my toddler and I enjoyed the Szechwan String beans. They also have spectacular lunch specials!"], ["Austin S.", "This isn't your typical strip mall, quick Chinese take out.The staff is very nice and the food... wow. The food is delicious. I prefer their pad thai over many of the Thai restaurants I've tried around town.I'm so glad this place opened up and is so close to my house. Will certainly be coming back here."], ["Marc S.", "This place is a diamond in the ruff. The food is wonderful, fresh, and the service is fast. It's not a very big place so seating is limited. I go for lunch most of the time and don't have any problem getting a seat."], ["William O.", "Ordered Calamari, Pan Fried Noodles, String Beans and Fish w/ Sweet and Sour Sauce.  All tasted great.  So glad Fortune Palace owners are back in business!  Small dining area. 4 1/2 stars."], ["Marie K.", "Great food and great service. Our favorite is their calamari, singaporean noodles, and wushi spareribs. A visit is not complete without these three items :)"], ["Ron W.", "When Fortune Palace closed several years ago I set out to find an Asian restaurant that had food and service (especially delivery) that was as good as theirs.  I found that it's just wasn't available in the area.    Now that the owner and chef are back in the form of Red Pepper Asian I am a happy man.  They have all my favorites and I'm told they will make some traditional dishes if you ask for it. The hot and sour soup is especially tasty.  I will definitely be making  regular visits."]], "Thai House": [["Megan O.", "We had ordered take out and one of the meals was left out. So we called and returned to the restaurant to pick up the food. The owner was so generous and apologized multiple times. She even threw in some extra spring rolls for the inconvenience. Such great customer service and delicious food!!!"], ["Doug K.", "Came to Thai House due to the good reviews and location but I have to say I'm underwhelmed. It's nice inside and the staff is friendly and quick despite being shorthanded, but the food was pretty average.  All prepared well but just bland. I started with the Tom Kha Gai and found it thin and lacking in the flavors you'd expect: kaffir lime, lemongrass, galangal, ginger, and coconut. Even punching up the lime and pepper would have helped. Moved on to the Basil Duck as it was recommended by Yelpers. Again, pretty bland. No heat, so little flavor that it was more like average Cantonese than Thai. A shame as it was prepared well but for $20, should have been much better. Maybe the cook had an off night so I'm giving benefit of the doubt and 3 stars instead of two."], ["Amy H.", "It was hard for me to decide between a three star and four star review for this place because thai house isn't consistent in their quality. When it's good, it's excellent. On some days though, the quality is significantly lower than what it is on the best days. It's better than a lot of Thai options in this area even on it's weaker days but that's not necessarily saying much.the panang curry is my go to dish and it tends to be good even on Thai House's less than stellar days. The curry is rich, complex and they will actually make it spicy (many places here skimp on the spice). I get it with tofu which also helps with the sometimes hit or miss nature of this place. Ordering meat dishes is a little bit more of a gamble. This isnt a huge issue for me when it comes to entrees because I actually prefer tofu with curry but one of my favorite thai appetizers (the num tok) has steak in it. Sometimes this appetizer is delicious, sometimes the meat is tough, poor quality and over cooked. I don't order it often now since I never know what I'm going to get.Similarly, service is hit or miss as well. The owners are very nice, friendly people so I feel bad saying that but it's true. There gave been times I've come here with a big group and still been served efficiently but there are times I've come by myself and had to wait around an excessively long time while the waitstaff chats. You just never know.Part of me feels like I should've gone with  4 stars because I actually am a regular here, despite my criticisms but inconsistent meat quality is kind of a big deal. Also, the last few times I went here weren't the best so sadly, it's possible that the decline in quality could continue though I certainly hope not.Basically, i do recommend you give this place a try, especially if you like vegetarian entrees but be careful about ordering meat dishes and don't go if you're in a hurry!"], ["Sherry H.", "Dropped in this spot today for a quick late lunch break while shopping in the area. Very clean and the staff was friendly and helpful. Was in the mood for soup so I got the Tom Kah Talay (Shrimp) and Thai Sticky Rice with Mango. Both were exceptionally good. I also got the Thai Spicy Basil Chicken and a side of fried rice to go. The fried rice might be the best I've ever eaten. The Spicy Basil Chicken was ok but not stellar, or spicy, although the waitress did give me some spicy chili paste to spice it up myself. Overall it was a good experience and I will prolly go back when in the area just for the fried rice and sticky rice. Plus, I'm new to this part of NC and have yet to find a Thai place I love."], ["Diane D.", "We've stopped in here for lunch a few times and the food is pretty tasty.  The service is friendly and efficient so you can get in and out fairly fast.Portions are on the smaller side but I like that - no need to take a to-go bag or eat until I'm stuffed.Tip:  If you like it spicy be sure to tell them because the standard order is not spicy at all."], ["Nadia K.", "Two of my friends and I were looking for some good Thai food while in town. After all the great yelp reviews we decided to come here. We started with the house sampler app and everything was very mediocre. Then came our entrees, I ordered the roasted duck salad and my duck was incredibly dry and lacking in flavor. Parts of my duck were warm and the other parts were cold, which led me to believe that they re-heated it in the microwave. It was one of the most depressing salads I ever had. The portions of all of our entrees were really small and I'm not even a big eater! We are pretty floored by all the great reviews, but then again we've been spoiled by eating some of best Thai food in Thailand and in L.A.My friends ordered the pad see ew and panang curry and after they took a few bites, we looked at each other in agreement that this is not even remotely what Thai food should be like. My friend said that his panang curry tasted like watered down coconut milk with just a hint of panang paste.Not only were we let down by the food, the service needed some serious overhaul. Our water cups were never once re-fill and napkins requested were not brought over until the end of our meal. There were only 2 tables besides ours, it wasn't like they were swamped with patrons. There were other incompetency the waitress did that put a damper into our meal, but I'm not even going to bother continuing on this sham establishment."], ["Mimi N.", "That one lady who's always there is pretty funny and nice. I like to come here for the pineapple fried rice and the seafood tom yum. It's not the best pineapple fried rice, but it's decent enough that I go there for it."], ["Keith E.", "A colleague of mine told me at work yesterday that \"by the way, Thai House is the best Thai restaurant in the entire triangle.\" Since my wife and I both love Thai, I read up on it and after seeing so many others give good reviews too, my wife and I had to check it out ASAP so went their last night around 8:30 pm. It was medium busy but we were waited on and seated quickly. The staff was superb, very young, polite, and pleasant. We loved our food and give it 5 stars. The decor was lovely too, very clean yet more Thai folksy then trying to have a highfalutin look. Summer rolls to die for, delicious yum nua, red curry chicken soup to die for, and Thai basil duck (our waitress' favorite and her recommendation that we took) that was off the charts. I have been staying away from fried Thai but my wife ordered (fried) spring rolls and they were both a) not greasy at all, and b) the best tasting I have had. They slice them at an angle and expose wonderful greens and are accompanied by a delicious sauce that is easy to spoon over them.We'll be going back soon and regularly."], ["Rod O.", "3 yelp stars from one LunchKnowing very little about this place, like other Thai Restaurants I feel like I'm taking a Chance... How do I know what this place will do well!!!  A Thailander once told me to get the BEST Thai Dishes you will have to go a LOT of Different Restaurants!  That seems True in most cities! ! !  Asking wait staff is sometimes helpful!Peanut Salad Dressing was pretty good, tasted house-made!Thai Basil with Beef  (3 yelp stars) was about what I excepted or a little better!  Basil Beef is (when done right) probably my favorite Thai Dishes!  This one had some VERY Good Points:*  Spice Level was Perfeckt  (the Peppers looked like Thai Chillis though I do not think they were)*  Vegetables were niceWhy this Dish only made 3 stars:*  Beef was better than some though NOT near Great*  Sauce was better than some though no where near what I hoped (seemed    too thick)?*  Thai Basil was present, though NOT plentiful!  If I had brought my Chinese Grandmother (from Taiwan) she would have counted the leaves in the dish and it would have been an EASY Count! (maybe five leaves)!  Still More Basil would NOT have made this Dish, because the Beef and Sauce were the Main letdowns! Sweet Staff!  Three Ladies took VERY Good Care of me!Nice looking place!  I was expecting a HITW and this was a BIG Surprise!"], ["Lauryn C.", "My first visit to Thai House and I liked it but there are definitely some other places in town that I prefer. I stopped by for lunch they sat me at a table next to the AC vent which I have to say even enjoy the food. The staff is friendly and they place seems very authentic. I could tell they had a lot of regulars at the place. I ordered the Massaman Curry the flavor was really good it could have used a little more spice even though I ordered it spicy, and instead of cashews they used peanuts. I was thrilled that they had avocado in the curry a few more slices would have been nice but I love avocado in my curry. I also had a Thai iced tea no complaints there.The lunch came with a salad and was just under $12 with tax. I'm curious how their dinner menu holds up, if I'm on this side of town I would definitely give them another shot. I saw a lot of pad Thai dishes being served it seems like a popular item here.  Overall average Thai food for a decent price."], ["John C.", "Popped in fi lunch today and the experience was off the charts. The chef came out to the table after overhearing our discussion of Thai Basil or Red Curry Noodle Soup. She recommended the Red Curry and it was excellent. Crisp flavor with a hint of lime and nice heat.The entire staff was personable and helpful. I'll be back!!"], ["Lori R.", "It has been awhile since I've been here because my last experience here was less than stellar, but today's lunch was perfectly a-ok.  My friend loves a good curry and I love spicy basil dishes, so we were in luck today because the chicken spicy basil was on special as well as a green curry chicken dish.  Both came with a choice of soup or salad.  We each chose salad, which was lettuce, cucumber and tomato in a small bowl with a pretty good peanut dressing.  My friend enjoyed her curry dish...she likes pretty much anything with coconut milk in it and was pleased with her dish.  Mine was pretty good. The chicken was perfectly cooked thin slices of white meat, and the heat at 3-stars was a good heat without being painful.  The veggies were a mix for me. I love onion, which is a good thing, because there was a lot of it, and a good portion of it was barely cooked.  The red bell pepper strips were somewhat mushy and a few bites tasted like they might have been bad spots.  Not pleasant.  And there was something about the rice that didn't seem quite right to me.  Almost Minute rice like in taste and texture.  (or what I remember of Minute rice...haven't had it since I was a kid).  Even the sauce, although it had a good flavor, had a slightly unusual texture from what I'm used to in this kind of Thai dish.    Service was charming, and nice and quick. I would not hesitate to go back again for lunch, if in the area, but wouldn't go out of my way to go there."], ["B D.", "Tortured at the Thai House....Sunday was a rainy day, and I found myself craving chicken Pad Thai. I visit Yelp for some info on my local options. I had heard Sawasdee was good, but Thai House was closer, and after all, it had 4 stars! What could go wrong? 92 reviews and 4 stars, it has to be good, right?Wrong. Very, very wrong.The exterior was charming enough, with unlit Christmas lights dangling loosely from the front edge of the roof. I entered to a tastefully appointed dining area, and was greeted by a young hostess/waitress, obviously Thai, with only a rudimentary grasp of the English language. This excited me, for it spoke of authenticity, and I eagerly awaited a delicious and spicy thai experience.As I was seated, however, a problem become very apparent: the music. It was so damned loud. Let me begin by stating that they have a very well-equipped sound system. It is unfortunate, then, that they had it turned up to 11, and blasting Eminem rap music followed by other modern pop music at full blast the entire time I was there.So nerve-jangling. I wondered if they could really be so tone-deaf as to subject the customers to this, and as I contemplated saying something, a brave table of four people, four heroes, really, requested that very thing. The waiter (a male Thai fellow, the only other waitstaff in the restaurant, which unfortunately meant that my waitress had to double up on hostess and takeout duties in addition to waiting my table. one can imagine the level of service I received.) obediently turned the damned music down.No sooner had he turned it down, then an elderly Thai lady whom I can only assume was either ownership or management emerges from a cleverly hidden door to an office right by the speaker and the front door. She looks around, cocks her head to the side, and then rushes to ramp up the volume of the music again. The following comical scene, faithful to the events that occurred:(Male Thai Waiter, rushing towards the front desk): \"No! No! The customer requested it. It's too loud for them!\"(Elderly Thai manager, with a confused and angry look on her face) \"WHAT!?! But can no hear! Too low! They no like music?!\"She was magnanimous enough to turn it down to half thje deafening level of before, while shaking her head in a puzzled and angry manner. I mean, how DARE the customers think they have a right to comfort, how DARE they think they're right. It's not as if THEY are the reason the business can exist in the first place. Obviously the lady never heard the phrase \"customer service\". What a joke.And as an aside, if you're going to be in the Thai restaurant business, please, PLEASE, just play the generic Thai karaoke muzak that no one understands but everyone can easily and pleasantly ignore. NO ONE wants to listen to Eminem, Maroon 5, Whitney Houston (I know I know, it was the unholy mixture of 90's soft pop and early to mid2000's radio hits) and other tripe at club-level volume.Enough about the music/service. What about the FOOD????NOW, onto the Food:First I noted just how freaking expensive their dinner items are. $12.99 for a plate of Chicken Pad Thai?!?!?!?!?!?!?!This must be amazing food, I thought to myself. Surely it must be mind-blowing at the cost for what amounts, really, to Thai street food.Well I must assure you, it was, by FAR, the worst Pad Thai I have ever had at a restaurant.Now, this is not to say that it was blatantly OFFENSIVE in taste and texture, but rather, that it had NO TASTE....none whatsoever. Instead of a spicy mélange of Eastern flavors and aromas, I was greeted with a steaming platter of sweet, mushy, sticky noodles, with some limp, flavorless chicken bits and bean sprouts laid on top, and a wedge of lime.The plate was an enormous amount for one person, but still, $12.99??And I must repeat, it had ZERO heat. None. It lacked any flavor. I have had frozen chicken pad-thai from the supermarket that blows this restaurant's excuse for pad thai out of the water. They could have at least offered some Sriracha or chili sauce, anything to provide some flavor to this dish.I took two bites, decided enough was enough with this restaurant, and waited for my server to appear so that I could request my check, pay it, and then go get some sushi.Oh yeah, that's right, she's also the hostess, and the take-out girl. Silly me. The restaurant had maybe 5 tables. I do not understand why she chose to bus mine. I was her ONLY table. The Male Thai Waiter could've easily added me to his roster, what with the restaurant being so sparsely packed. But no, they chose the most awkward arrangement whatsoever. She got a stream of take-out people coming in (which I just don't understand. What is wrong with you, my fellow peoples of Raleigh? Have you no taste buds? We can do better than this.) I was never asked how it tasted, offered more water, just barked at in clipped English by the hostess after I finally flagged her down for my check. Pure Torture."], ["KK W.", "After my first few visits here I was delighted to write a positive review on yelp. I will say that after a few more visits, my opinion of the food has not changed: the food is very good. I tend to order the same things every time I come but it is always consistently good. However the service has gotten worse and worse. I tend to come during lunch, so people during other hours may have different opinions. Their lunch is always packed, but the servers are always overwhelmed. I always tend to get the same server, A woman who is so overwhelmed during the lunch hour that it stresses me out. I don't receive drink refills, I don't get asked how my meal was, and there's barely enough time for her to drop off the check. Most times I tried to pay the check upfront so I don't have to wait the extra 5 to 10 minutes for her to return with the paid receipt.  However after today's experience, this will be my last visit in a a while. The waitress took five minutes to come and take my order. Then when my food finally came it was all cold. My appetizer came out at the same time as my entrée, and both were cold. I ate the entrée because I was very hungry, but I couldn't ask for a new appetizer because I never was able to get her attention again. No refill either. I will give her credit, when I asked her to take it off my bill she didn't argue with me. But overall it's just such a negative experience. Maybe it's because years ago I was a server so when I see a server overstressed it bothers me more than it should. But this restaurant needs to help their servers: either hire more people or do things to help them during the busy lunch shift because this isn't working"], ["Janet A.", "I must have gone on a bad night considering the number of positive reviews for this place. Traveling on my way back from FL, we stopped at NC for the night.  We searched for the closest Thai place near our hotel and this was the spot. It wasn't a busy night considering there was one other couple besides us. For appetizers we ordered dumplings and for our main course, three orders of Spicy Basil Chicken. The dumplings were so small and only 5. The dumplings were nothing to write home about - there was no taste. Which is odd because dumplings are supposed to be full of delicious flavors but was just meat. I didn't even taste a hint of ginger. As for the main order - what arrived was a large plate of sauce, lots of greens bean, very little chicken and a very small bowl of rice.  Our order was over $60 and yet we were still hungry afterwards.  Super disappointed with dinner."], ["Becca B.", "No good :( the pad thai is not good all all. And the sauce that came with the summer rolls literally taste like licorice."], ["Lizzie L.", "Loved the tofu red curry and fried sweet potatoes! Almost gave 4 stars because we didn't get cutlery with our to-go order (and we were on the road with no supplies), but the curry was so good that we just had to give 5 stars!"], ["Hannah K.", "I've now had 5 different items from Thai house and I have yet to be disappointed! The first time I tried it, it was take out and I got the Pad See Ew and it did not disappoint! I'm a lover of Thai food so I was really skeptical about the Thai food here in Raleigh but it did not disappoint! I also got an order of summer rolls, I think the price is a bit steep for just 2 rolls and they're pretty skinny. I could probably make a good 15 rolls for like $15 dollars worth of ingredients and it would be much fuller - so minus .5 star :(On my second visit I decided to try the Satay, Pad Kee Mao, and the fried cheesecake. I have to say again, that the satay for the price I was paying was not worth the quantity and I feel like it wasn't marinated that well - minus .5 star. But the peanut sauce that it came with was really good. The Pad Kee Mao did NOT disappoint. I hate it when restaurants load it up with tons of broccoli but they didn't do that here and I really enjoyed the gravy sauce! If you're feeling up for a little something sweet at the end of your meal, I suggest getting the fried cheesecake! It's SO GOOD - the only addition I would add to it is probably some ice cream! So I would say appetizers aren't their strongest point, but their main dishes are great!This girl will definitely be coming back for her Thai fix!!"], ["Daniel S.", "Good thai food, with a quiet and unassuming atmosphere.  This place is very close to home, and we'd eat here or get takeout at least once a week if the meals were a couple bucks cheaper - as is, it's a once a month treat for us."], ["Keisha L.", "The pad Thai is so delicious! Especially 3 star spicy. Really adds a kick! It establishment is really nice on the inside and the service is always prompt."]], "Sushi Thai Cary": [["Parita S.", "My friends raved about this place and I finally tried it a few weeks ago. Amazing! This gem is hidden away in Cary in a strip mall. I had the drunken noodles with tofu and requested it to be spicy. The noodles were great! Though I wanted more spice and they brought some spicy chili sauce for me on the side. My friend had a coconut shrimp soup as her appetizer which she said was rich in flavor but lacked the spice she wanted. So she used some spicy chili sauce of mine, too. Her sushi looked fresh and she said it was really tasty. We were both satisfied, and plan on returning soon!"], ["Ben W.", "Nestled safely between Big Lots, an urgent care, and a quick oil change place is Sushi Thai. Not to ever be confused with Sushi AND Thai located in Raleigh. Ever. No, seriously don't go to the other place which is not affiliated with the wonderful Sushi Thai. You wouldn't think that the Big Lots plaza would hold a great restaurant but you would be wrong. Sushi Thai has some of the best sushi in the triangle. I have eaten most everything on the menu and I have yet to find a bad dish. The duck, chicken fried rice, spicy noodles, and every sushi roll they make are all favorites. Is the place busy Thursday through Saturday? Yes. There is little to no lobby (2 chairs and that's it) so you will frequently find people crammed in or near the door on those days. I can recommend reservations on those nights. The only weak area I can find is the dessert menu. That said I have never found an Asian restaurant with killer desserts so I subtract no stars for that. Besides, Goodberry's is just down the street next to the Hibernian and that's where you are going anyway."], ["Brett M.", "Went here on a Sunday at 7pm and it was packed with to-go orders moving out non stop. Always a good sign to see a busy sushi restaurant. Ordered a J-6 and J-7. Both great. Kitchen was a bit slow because of the volume of people but our waitress did a great gob of sneaking in our appetizers etc when she could. Overall the fish was very fresh and tasty. An amazing value to have chicken, 9 sashimi, 3 sushi, and 6pc tuna roll + miso soup for under $20. Had to take half of the chicken home, we were stuffed."], ["Hema M.", "The good and service was great here. Definitely a place to try! We had ordered sushi and it was delicious."], ["Katie C.", "I visited Sushi Thai for lunch with a friend and was very pleasantly surprised. I had the Phoenix roll and it was one of the best sushi rolls I've found lately and definitely the best in the area."], ["James E.", "Nice greeting at the door. Place is cute and staff seems to take pride in cleanliness. Server prompt, personable, knowledgeable about menu. Some decent wine options. Everything is great-except the food was a little disappointing. Sashimi wasn't especially fresh fresh looking, rolls weren't tight. Noodle dish wasn't anything that couldn't be replicated at home. Would recommend as a good service experience, but am still on the hunt for a great sushi tasting experience in the Triangle."], ["Lauryn C.", "Sushi Thai in Cary is still by far one of my favorite places to grab sushi in the Triangle. I've been coming here for over 15 years and I have to say the quality has never changed the fish is always fresh and the pieces are way larger then other sushi restaurants in town.It's sad to say that I've never ordered anything but sushi here besides some of the appetizers like pork gyoza which is also amazing. You are not going to find BOGO here but what you are going to find is fresh Toro when in season and some darn good sashimi.This place hasn't changed one bit in 15 years and to be honest because they've done such a good job with the food I guess they don't really need to update much. However to bring in a new crowd it might help. The staff here is fabulous, they are well trained and extremely friendly. Some of my favorite rolls to get here are the spicy sushi roll (trust me it's not what you are use to in the other sushi joints around town) it's way better!! The Mary roll is delicious as well as the shrimp crunch roll, and spider roll. ( I use to have a roll here named after me back in the day that's how often I use to eat here - it's very similar to the shrimp crunch roll:)If you are looking for fresh fish this is your place I recommend sitting at the sushi bar and getting the whole experience these guys are awesome!A little update on the interior and this joint is all set"], ["Toni S.", "Great sushi! This place is always packed yet still very quick with take out orders! The hostess is so friendly and is always smiling. Ive tried salmon skin rolls at Sushi Iwa and Sushi Nine, but the salmon skin roll here at Sushi Thai is, by far, the best!!"], ["Bon V.", "My favorite place for sushi in the Triangle. Bento box on their lunch menu is the best value around. Get read for a food coma! Full review at bonvagrant.com/#/new-pag…"], ["Digitus M.", ".. with a wait staff memory that goes back months,  since I'm an occasional visitor from NYC, the food echos this consistently with occasional tasty appetizer adds. The icy tower of fish from the Sashimi Mori is a great presentation with generous helpings. Efficient service with a busy but not boisterous crowd with th availability of solid Japanese with great other options make this a evening preference."], ["Todd Y.", "This place is the cats meow!!!!We got there at around 5:30 on a Saturday and the place was mostly empty, which was great because by the time we left at around 7 the line was out the door.. Get there early!!!!We started off with a rainbow roll and it was extremely fresh!!! No fishy smell or taste at all, telling me how fresh the seafood is. The roll was extremely generous and tastyGot a small sake and it was good.. Didn't hit you hard like some sakes do..Dinner, my first time to all Thai places I get the pad Thai and talking to our waiter, who was fantastic, he was like, if you like it hot... Start hot and add to make it Thai hot.. Easy to make hotter, can't undo if it is too hot.. I could have done the Thai hot, but the hot was just perfect..8 decent shrimp and the pad Thai all mixed together which I prefer.. I hate just getting a bite of noodles or shoots..Best pad Thai in the triangle!!!Wife got a ginger meal and the ginger sauce they use was amazing.. Pretty sure I could just order a soup bowl full of it.Decor is your typical sushi joint... Very nice.. Definitely will be back"], ["Greg O.", "Finally tried this place and it did not disappoint.  It was packed and the wait staff explained the sushi would take a while, so that was not a surprise.  The fried tofu appetizers wer very hot and crisp, with a great dipping sauce.  All of the sushi rolls were very fresh and all had a great taste.  Got the mixed veggie dinner with steamed rice.  The veggies were some of the best veggies I've gotten at a Thai place, so fresh and crunchy.  I want to go back and try more rolls but went with the basic ones to get a feel for it there."], ["Rebecca F.", "We have been searching for a great sushi place, and unfortunately our search continues despite Sushi Thai Cary. Usually when a place mixes a few different cuisines we don't set our hopes too high, but we are just itching to find a good sushi spot still! (We recently moved from the Seattle area where sushi is abundant and we had several go-to sushi spots!)Anyhow, the sushi was better than some other places we've tried, but, for us, it would still be settling somewhat if we stopped our search here. The Thai food, though, did seem pretty good! We ordered a few noodle dishes in addition to a few rolls and those were something we could go back for.Overall, this spot is somewhat forgettable which is both positive and negative. It didn't stick out as a spot we never want to go to again, but it's not one we're going to crave any time soon.Also, note to those with small children, there is a sign inside that says to keep kids under control and to clean up after them...so, good for those without little ones perhaps? Kind of a turn off for those of us with little ones though (not that we let ours run wild in restaurants...some parents may, but many/most try their bests!)."], ["Gary R.", "Don't be put off by the generic strip mall location or the presence of the large Big Lots. Oh no. This is some legit food!! My wife wasn't overly hungry and only wanted to go out for something light. I, however, was more up for Indian or Thai food and doing a Yelp search, found Sushi Thai. A perfect blend for our dinner out! The sushi idea hit her hot button and I was able to get a full meal that suited my taste. And it SO met that challenge! I was a little skeptical at first - how could it be good at both sushi AND Thai? But one bite and I found out how. Yum.We started with the steamed dumplings and they were done to near perfection. My wife got an assortment of sushi and an eel maki roll (which she raved about!)  I went with what I always like to test Thai restaurants on - Pork Spicy Thai Basil. Theirs was superb! The flavors were all there and stood out the way I had hoped. The spice level, ordered Thai hot, was just a little less than I had wished for but I find that typical of most places who don't really want to give you Thai hot thinking you won't be able to eat it. I can. And I did - the heat was really good. Everything was incredibly tasty!The interior is well done and belies the bland exterior. The service was attentive without being annoying. Our water glasses never got below half full.I would highly recommend this place - for either Thai or sushi."], ["Christine W.", "Not a fan of Sushi or Thai but this place deserves a five star because I actually loved it!The menu was huge!  So many choices.  I really don't like that many choices because it is so hard to decide.  Not being familiar with this type of food it makes it more difficult.  The only sushi I usually order is an American version and that is usually California roll.  This place had so many unusual choices.  I ordered the soft shell crab sushi, lemongrass soup, dumplings and coconut ice cream which was homemade.My daughter and her friend always eat there and I was dreading it to tell you the truth.But, it was a wonderful surprise.  It was packed with patrons and after tasting the food I know why.  Our waiter was sweet but a little slow.  Perhaps he was an apprentice.  But, very accommodating when we asked for something.  I can't speak for what my daughter and her friend had but, I can say that my food was excellent.  No where have I ever seen soft shell crab sushi.  It was great with the little crab legs sticking out of the sushi.  I had lemon grass soup for the first time.  This too was a great choice.  It was called Tom Yum Soup.  They split an order of Kha Soup which I did not care for myself.  The soft shelled sushi was great.  The dumplings were nothing special.  Steamed.  The same as any other place that serves this type of food.For dessert I had the coconut ice cream.  Creamy and coconutty!  Highly recommend!Worth the trip!  Don't be put off by the restaurant location in a strip mall.  Not the typical chinese, thai, sushi strip store restaurant which are a dime a dozen.  Hope to return when in Fuquay - Varina.Be sure to order the lemongrass soup!"], ["Jeremy A.", "We stopped in on a Saturday afternoon right before their switch over to dinner . There was a good amount of people in here for this time of day and we were seated promptly. The pad thai we got was good and id definitely order it again but i might not go with the sushi rolls next time. I felt like they were overpriced for their size and my spicy scallop roll with nothing else came in at $10 which I thought was a bit much since it was so average. After later reviewing the menu I feel like if I returned id go for a boat because they seem to be the best deal in regards to what you get for your money. They also don't have a lunch menu just lunch prices that were still a bit more steep then expected. We spent $65 for lunch which to me was nuts for this place. Service was friendly and the boat they have built into the sushi bar makes for some pretty awesome decor."], ["Ines P.", "Returned to see if the service and food would redeem themselves..... AFTER ONE HOUR TEN MINUTES we got our less than stellar food. They served us after everyone else.. We saw people come and go.. They blamed the delay on tempura. Out of 4 people, 2 ate their meals. Hubby ordered boat, with chefs choice on roll.  8 pieces of sushi and 8pieces of raw fish on the side ....WHAT? Bill was over 100, 2 are now making plans for dinner after this dinner. No comp from restaurant- nothing."], ["Laura G.", "We arrived at lunchtime and boy was this restaurant busy. This was our first time here, so we didn't know what to expect. We got seated quickly at a comfortable booth in this pretty and well lighted restaurant. We both ordered the combination sushi lunch, one with fish tempura, and one with chicken teriyaki. I also got a tom yum soup with shrimp, this soup was so good. I would have been happy with a huge bowl of this as my meal. But anyway on to the sushi. It was so fresh tasting and the rice was perfectly prepared. Mine came with chicken teriyaki, I think the pieces were too large, and I would have liked a small dish of rice. My friend seemed happy with the tempura, she gobbled it up. I will certainly return to this restaurant but would get the soup and maybe a sushi only meal. Great service too from the wait staff."], ["Becca T.", "Tonight I ordered take out from this place to try it out after hearing so many good things. It was a disappointment for the money I spent.  I ordered the Japanese stir fry and the shrimp dumplings. The Japanese stir fry was alright, but it was something I could easily make at home along with a simple salad and a scoop of rice. My friend and I both ate only one of the dumplings before tossing them.  It was steamed well, but you could taste how old the shrimp was. It wasn't worth eating in our opinion.  So for about $20 bucks I got old shrimp dumplings and a simple stir fry.  Maybe it would have been better if I had ordered the sushi of a different dish, but I think I have wasted enough money there."], ["Michael B.", "This is a deceptively nice place. One might think an Asian fusion restaurant (they serve Japanese and Thai food) in a dated shopping center with a Big Lots would not be great, but you would be wrong.My order was excellent and spot on. The spring rolls were crisp and flavorful, and the thai basil tofu was just the right combination of spicy and sweet (minty sweet, not sugary sweet). The interior is beautiful and chopsticks are served by default. Love love this place and will definitely return, maybe try the Japanese side of the menu."], ["Julie R.", "My husband and I visited this restaurant for an early evening date night.  We tried the Mary roll, dragon roll, spicy tuna roll, and vegetable roll.  They were all excellent, but the dragon roll was our favorite.  The service was speedy and attentive.  We will definitely be coming back."], ["Morgan F.", "This place was horrible. The service was terrible, my drink menu almost taken away when I ordered water and had to ask for it back, after getting a glass of wine we waited 20 minutes to put in our order and then the menu was snatched up quickly. The only reason I'm giving this one star is the Tom Yum soup was very good. We got 4 rolls and shrimp shumai, all of which was disgusting. I thought the sushi was the worst I've ever had. Literally, never going back"], ["Lisa W.", "I don't know if some of the reviewers on here have just never had great sushi or what but was completely unimpressed by this place. The sushi wasn't terrible .... didn't go home with food poisoning or anything drastic but was not compelled to go back again. While the ingredients were fresh, they didn't seem top notch either. I had a Philly roll and the salmon was of so so quality (I'm from the Pacific Northwest and know great salmon) and the sweet dragon roll (at 14.95!) wasn't anything to rush back for either. Both rolls were fairly large in diameter, sliced thin and weren't rolled well so fell apart easily while trying to eat them ... not a great trait for good sushi. The rolls were huge and while some may think that's a great thing, I'd rather have a smaller roll that is really fabulous quality/taste ... and 15$ for a roll is really getting up there but would gladly pay it for superior sushi - which this was not. When I go out for sushi I want that close my eyes, OMG kinda moment when I put the first bite in my mouth ... the kind of taste that days later you're still thinking about and can't wait to go back to again. For that, I'll have to go elsewhere"], ["Nataliya H.", "This has been our favorite restaurant in the past few years. However, after last night's visit, it's not anymore. Overall the food quality has declined over the past year and the food is now WAY overpriced. I would not recommend this restaurant."], ["Beth L.", "Always excellent and innovative dishes. The service is gracious and top-notch. We enjoyed the dynamite (baked scallops) appetizer, and then I ordered the JC-6 combination  (sushi, sashimi and tempura) while my husband ordered spider rolls and a lobster roll. Delish! And also large portions. We could've split my combination box. Highly recommended! (Note, they are not affiliated with the much less savory Sushi-Thai Raleigh.)"], ["Mike H.", "Some of the most attentive wait staff around. We love the Raleigh Lake Boone location but the service here is much better. Beautifully made sushi at reasonable prices. Get the deep fried bagel roll as an app!"], ["Bill S.", "Our go to Thai spot in Cary.  All of the curries are excellent and properly made.  If you tell them Thai hot, it's authentic.  Pad Seu and Pad Thai are excellent.  Restaurant is always clean and the service is excellent.  There is one other place in Cary, which I have reviewed, but the cooking is inconsistent.  Here, it's always the same, always good, all the time."], ["Mark G.", "Tried to eat here but they closed at 230.  We arrived at 224 and the close sign was on.  Plenty of other places to get sushi.  Very disappointed"], ["Ron W.", "How can you go wrong with options?  Sushi or Thai, either one is good on it's own so two should be better, right?  Well yes and no, in my book!  While Sushi-Thai does an acceptable job with its Thai, it's still a step behind the best places in the Triangle but that's just part of the deal. I stopped in for a quick lunch this week and sat at the sushi bar.  Sushi-Thai was busy for their lunch service but they know how to run the place here.  My service was spot-on and it only took 10 minutes for my steaming plate of pad kee mao to come out.  Tasty but a bit under-spicy and over-cooked, it was a decent version and a generous portion but not the best I've had around here. So yes, choices are good but not amazingly good when the choices are just ok.  I have yet to try the Japanese side of things at Sushi-Thai so maybe they fare better there but until then, it's three stars for some solid Asian eats.  But nice job, Sushi-Thai, I know you're popular and that counts for a lot..."], ["Jessy H.", "We came here on Tuesday night around 6:00 ish. The place wasn't busy. I have ordered take out sushi several times from here and wasn't that happy as I think sushi is never that good as take out from anywhere but I was extremely happy with everything we got tonight. We got miso soup a regular at any Japanese place we go too. That was good, we also got calamari which wasn't my favorite, I like Italian better but still good. We also ordered the lobster bomb to share and it was out of this world! It's worth every penny! I loved the decor and sushi bar boat. The staff were great and I will be going again. It may be my new favorite sushi place!"], ["Brett L.", "The food won't 'wow' you, but it is good.  It is what it is, decent sushi.It's not a must-come-back place, but it served it's purpose.  I'd eat there again if I were in the neighborhood.  Good ambiance.Recommendation:  Don't go out of your way, but check it out if you're looking for somewhere new to try."], ["Marielle T.", "Definitely a neighborhood favorite for most!   Hate the location, really wish it had outdoor seating and wasn't next to a big lots.. ick.. but the inside was clean and inviting, normal style for a strip mall place, but hey let's get down to sushi!!Went today for lunch and was seated right away, service was excellent, efficient, and prompt.  waters always filled, requests done immediately, correct order came out in record time!I got lunch combination #3 (like a bento box), this comes with sashimi, 3 pieces of nigiri, and 8 pcs of california roll, an orange sliced up and 2 pieces of a fried roll with eel sauce for $12, yum!!!!  sashimi and nigiri were actually SO FRESH.  I loved it.  So were the rolls, the avocado in the roll actually melted in my mouth it was so good- so did the salmon sashimi (my favorite).  Will definitely be going back for this killer deal!One comment though (I'm hoping the restaurant sees this): the eel sauce was SUPER thick.  Normally this is a good sign and this type always tastes significantly better, I hate thin and watery eel sauce, but this was like syrup.  The eel sauce I got with the meal seemed ok but the to go eel sauce I received to bring home had either sat for a while and the sugar made it more dense or something.. it was not appetizing. Maybe don't prep the eel sauce and put it in a fresh to go container.Overall amazing for a run down strip mall location in a random location in Cary!!"], ["Michelle G.", "How have I not reviewed Sushi Thai?! Look, I've been coming here since I discovered my love for sashimi. I know people who drive from other locations in the Triangle to eat here. Big fan of the Dragon Roll, sashimi, and thai plates (all of the curries are...ugh, so good; especially if you are OK with a couple slabs of tuna/salmon/yellowail as an appetizer!). The restaurant interior is welcoming--although located in a lackluster street mall--and normally pretty crowded. I have yet to find a place better than Sushi Thai in the Triangle (price vs. quality of fish, rolls, etc.)."], ["Susan F.", "Do NOT confuse this place this Sushi-Thai on Wycliff/Lake Boone; they are NOT connected.If you want wonderful fresh delicate sushi THIS is the place you want to go. My friend introduced me to them a few years ago at lunch and the freshness of their sushi melts in your mouth.My husband and I celebrated my birthday there on Saturday and he tried the Pad Thai which was good and the medium spice had a real bite to it."], ["Adam M.", "In the area for work and this place hit the spot. The chicken cashew dish was great, will not be my last visit!"], ["Jennifer C.", "We have been long time fans of Sushi Thai and they never disappoint.  This is a true family owned restaurant and the menu is full of Japanese, Thai and Sushi.  I love the Red Curry Chicken, Chicken Paradise and the Tom Kha soup is the best around.  Very good!"], ["Bill T.", "For many years I've celebrated my birthdays here as we really like the owners  (Sam and Nita)  - The service is top-notch but not formal nor overbearing.- The Thai and sushi are both fantastic; the food is always seasonal, fresh and flavorful. You can order it hot, mild or whatever you prefer. - Wine is available by the carafe or bottle. -  Don't let the fact that it's located in a strip mall throw you off;  the interior of the restaurant is very nice; beautiful woodwork. Everything is in bristol condition (clean!) - Reservations recommended as it's no longer Cary's best kept secret. - Great place for a date night or a family meal. The staff go out of their way to make sure you enjoy a delicious lunch or dinner.   - Lunch menu is available during the day time. - Extra TLC is given to their elderly clients with mobility challenges (I've taken my 80 year old in-laws here multiple times and they were treated like VIP clients."], ["Jatin B.", "Here goes our mine and my wife's experience at this place: We went in sat at the sofas as asked by us.. So all good until then. As soon as we sat and given the menus, we were asked for drinks. I was like We just opened it please give us sometime. After which we settled with an ice tea and a beer. We ordered edamame, veggie sushi rolls and veggi pad thai.. The server was courteous enough to ask that we don't eat meat as we ordered everything veggie so we said yes, no meat and fish sauce please but it was server's or ours mistake to find out that pad thai does have eggs!!! Which is fine, we both eat eggs but I just myself hate the eggie smell in noodles. We requested to take the dish away and please give us without eggs. The server went to ask her manager and they said no just because it was written in the menu that it does have eggs. So we asked them to put the charge away and give us something else. They didn't consider at all and we had to throw away that dish. To fill our hungry tummies we ordered another order of same veggie sushi rolls and finished our dinner at a disappointing note. In a service Industry, customer satisfaction is top most priority but for this restaurant. It's not. Even though the food was ok, we're never going to this restaurant again just because of the unprofessional behavior. 2 stars is what i'd give. No go guys!"], ["Robert B.", "Sushi Thai is our go to place for sushi, Thai and Chinese.  The business takes take out serious,  Everything is packed tightly and always warm when we get home."], ["Jane Y.", "This place is good for a fast and cheap healthy lunch. Their lunch prices start at $7 for entree and soup/salad. I have been here for lunch and dinner. The sushi is nothing to rave about, typical rolls/sashimi choices with typical portions. The rice was not amazing, but not bad. I feel the same way about their Thai options.I have nothing to complain about this place, but also nothing to rave about, everything was satisfactory. Again, good lunch options and prices. They also do Saturday lunch specials, which is rare in Cary."]], "Bangkok Thai": [], "Dalat Oriental Restaurant": [], "Champa Thai & Sushi Restaurant": [], "Sawasdee Thai Restaurant": [["M S.", "GOOD.This is likely the best Sawasdee if you're wondering.The service here isn't the best, but it's better than the Chapel Hill location, also they never run out of tofu.I love love love their tofu. The food is fresh, there are veggie options and avoid the greasy pad thai. I love how the rice comes in the shape of a crown or heart--adorable!The waiter would barely walk over to us and I had to crane my head when she asked if we needed anything. Come on now...do you want a nice tip? I want to give a big fat tip!Inside it's fun, divey and comfortable, it's a very small restaurant and I would not bring a big party of guests here.They need to hire more staff, when we were eating there on a Sunday there was one waitress in the entire restaurant.They are next door to a nice Asian food store!"], ["Chelsea M.", "So, I will preface this with, I did not order thai food this time. I went here for the new ramen bar. The ramen here was delicious and quite filling.There are options for those of us who don't eat meat. The noodles were soft but firm, which is important.  If you are looking g for a great place to get ramen, this is it. The restaurant was very clean and rather intimate.  This is really not a place to take children."], ["Lori R.", "Okay, I've been here a lot lately for lunch.  Twice this week alone.  I gotta say, I'm becoming even more and more of a fan with each visit.  Most everything at lunch is just $7.99.  Three different items each day are on special so that something else comes with it.  Salad with their great peanut dressing is one choice.  Not sure of the others, as that is my preference.I have a friend that always gets one of their curry dishes and is always happy with it.  After watching my Mom do Gouy Tiew this week, and having already had my go-to Pad Kra Praw, I found myself back to try it myself.  This is a bowl of spicy scrumptious giant noodles with the most succulent tomato sauce and minced chicken with chopped onions and basil.  YUM!  I tell you, nothing better on a cold day that a hot bowl/dish of Thai goodness, and this place has been delivering some awesome ones lately!"], ["Rudy F.", "Went here based on the reviews. This place gives smallish portions for a highish price which is why u took off two stars. Despite this the food was decent as well as the service. Don't get the satay chicken its expensive, small and not very good. :("], ["John S.", "This place is tops! My partner and I go here often when we need a Thai food fix. Our go-tos are the Pad Thai Woon Sen and the Drunken Noodles. We also like the Fish Cakes and Steamed Dumplings. The Steamed Dumplings are especially nice...almost like an extra large Shumai with a yummy balls of fresh ground meat in the center. The Satay is not that great, so I would suggest skipping that dish. And for dessert, the Kanom Tuay (Sweet Coconut Pudding) is an absolute must! It's like a sweet rice gluten custard with a layer of coconut cream on top. It's a nice simple flavor and is very addicting. I will say it's quite a small serving, so I wouldn't suggest sharing."], ["Ranjay J.", "My partner and I have been here several times for dinner and we've never been disappointed.  The food here is definitely very authentic and well prepared.The appetizers are really good!  The shrimp cakes, fish cakes, and chicken satay are what we usually get.For entrees, the Drunken noodles and Pad Thai Woon Sen are our go-tos.  The flavour in them is incredible!  We also like the Crab fried rice, which tastes very fresh and light, and has nice chunks of real crab (not crabsticks)!They have a warm coconut pudding which is our favourite dessert there.  The staff are also very friendly and the service is fast.  Definitely check this place out if you love Thai food!"], ["D H.", "I love small hidden gems.  Outside appearance can't judge everything.  Great food and quant environment inside.  Ask for extra chili sauce to be brought out to you so that you can make it spicier!  Egg rolls and dipping sauce was excellent!  Many options to choose from, we had red curry chicken and a special crazy fire noodles (yum)... Plus Larb Chicken for appetizers!  Will be back!"], ["Scee J.", "I'm giving this place two stars because the food is actually pretty good. However for the amount of food you get, its not worth the trip or cost of the food. I will not eat here again because there are better places where I feel that I can get a good value. I've eaten here about five times over the past eight years and today I really realized it's just not worth it. I sat in traffic on capital Blvd and when I returned to work I found out that there was not much in the to-go tray. They left it up to me to pour the sauce on (I don't know if that was a good or bad idea). The point is, if you're hungry, you might want to stay away from this place or pay for overpriced food to get full. I want to like this place but I'll just say no for now. Maybe the Glenwood location is better?"], ["Felix L.", "Very mixed reviews from fellow yelps yet we decided to check it out.Price is very reasonable unlike some mentioned of the pricy concerns.Lunch special was under $10.00 with choices of side dishes.Green curry and pat-thai tofu were our choices. Curry was so watery and lacking to cover ver-portikned rice and lacking the flavor. Pat-thai was nothing but soy sauce and very salty. Make the story short: I ended up throwing up twice within 30 min. Please avoid this place unless you are stranded and about to die with hunger"], ["Larry G.", "Last Friday night, I ended up eating Thai and conversed with my wife about our upcoming NY trip for Thanksgiving.  Since I have to work from our NYC office while she has off, I get to spend time in the city and see old friends while she spends an entire day in Long Island solo with the in-laws.  If the tables were turned I don't know if I can get through that kind of ordeal.  This wasn't the last Friday night that Katy Perry had in mind.She told me about her reservations and complaints in verbal and non-verbal form (playing Bubble Witch on the IPhone and ignoring my feeble attempts at humor for example), so I entered a place in my mind that was far away from the conversation and focused on the food.  Women can sap a lot of energy from the table, but they are beautiful flowers overall and I wanted to focus on the instant gratification of pad see ew.The great taste of the pad see ew overpowered the complaints about the in-laws.  That says something.  Yummy, fluffy noodles for a reasonable price that dare I say it, are in-line quality-wise with the best the Triangle has to offer and that list includes the consensus favorite Thaiphoon.  My main complaint with Thaiphoon is that the parking situation is annoying and you are in the eye of the Bojangles bro zone, so for folks who want a quieter night out this is the go to.  Don't get me wrong, seeing a frat boy with a red Bojangles star temporarily (maybe permanent?) tattooed on his right breast has its moments, but it is usually reserved for Saturday mornings in the NC State parking lot.Pad thai and the shrimp egg rolls were both eggcellent (you see the pun), with the pad thai as the overall winner of the bunch.  Also worth mentioning that the chairs are insanely comfortable and great for taking naps if you lean back far enough."], ["Amanda P.", "Great Thai food, but a little on the pricey side.  You do get what you pay for, though.  The portions are really big and probably could be split between two people if you're not very hungry.The vegetarian menu includes tofu versions of some of the noodle and curry dishes from the larger menu.  I had the vegetarian panang curry, which was very good.  It came with rice that had been formed into a shape--I think it was a crown, but I'm not sure.   We considered ordering an appetizer, but given the size of the portions, I'm glad we didn't.  I'm sure it would have tasted good, but we didn't need more food.The restaurant is also very cute, even though it's a small place.  They really like colorful furniture here--we sat at a multicolored table, and the patio has tables, chairs, and umbrellas in a rainbow of different colors.  I thought it was pretty and cheerful.I don't know what's up with the toilet sign, which appeared to be a picture of a stick figure man looking over the wall of the women's room (?).  If they were going for humor, they failed--it was creepy and not funny."], ["P C.", "Very good thai food, cozy atmosphere, reasonable prices!"], ["Jeremy A.", "This place has some awesome lunch specials during the week and their evening menu is rather reasonable as well. The drunken noodles seem to be their speciality and they are really awesome. They actually reminded me of pad see ew noodles and I would get them again. One think of note also was the chicken was extremely tender, most dishes you get with chicken it gets dried out a bit. One thing to note is their idea of spicy didn't hurt me that much and it seems the level is determined by how many their red chilies they stir fry with your dish and not an actual seasoning or sauce. They have some unique thai dishes along with the standard staples you would come to expect. We were in and out of there pretty fast during the lunch hour and our waitress was great. Ill be back for sure as its my favorite thai place in the triangle so far."], ["Ari P.", "this place isn't much of a scene (which I like but I know some people look for hipness as a part of their experience) but the food is very good! I like it better than any other Thai options in the triangle. the staff is friendly and my good experiences there have always been consistent."], ["Latef X.", "Had the Veggie Pad Thai for takeout. It was okay, and they are generous with the amount of veggies they throw in. The flavor is sweeter and more tamarindy than what I'm used to. It didn't taste super greasy though which I liked.Food comes out super fast and the lady was really nice. Mom and pop family business. Their dinner menu is actually pretty pricey for thai food -- it's like NYC/SF prices."], ["Iim S.", "I'm been coming to Sawasdee for years, and went over for lunch with my wife yesterday.  The first thing we noticed was a sign on the door that said \"No coupons accepted\".  Previously I've used Groupons, so I wasn't sure what that was about (maybe change in ownership?).We both ordered our meals, and noted that in both cases the food was overcooked.  Typically the server provides a spice tray, and when I asked for it, my server walked away and came back with a jar of red pepper, not the typical spice tray.The whole time the waitress served us she had a long face like she was having a bad day, so she didn't add anything special to the event.Sad to say, but considering how many good Thai restaurants there are in Raleigh, I'd be hard pressed to come back to Sawasdee after this experience."], ["KK W.", "Got takeout-- the chicken drunken noodle.  It was delicious!"], ["Justin C.", "Had the spicy crispy catfish for lunchJust fantastic will be back for sure. We turned of capital blvd on a whim just starving for lunch. The lunch menu is varied not just chicken 3 ways which was nice. When the food arrived it was beautiful and so tasty . I had the fish and it was delicate and wonderful. FAB"], ["Travis M.", "I had the Pangang curry and it was good.  The place was dead and I was only checked on by the waitress once.  I had to used other table's napkins.  This place would have received 4 out of 5 stars if they waited their tables."], ["Ana B.", "Thai cusine does not mean over powdering spices. Their dishes almost hurt my stomach. Overall food is too saulty and too sweet. Peanut sauce was watery, very sweet. Thai tea taste bland. If this is the best Thai place like other Yelpers saying, I will hold on to my crave for Thai until I travel other cities."], ["Matt T.", "Try somewhere else. We were excited to try Sawadee because my wife had never tried Pad Thai and they have an extensive gluten free menu. Firstly the place is a bit dumpy, but that was ok since somtimes the dump places are the best. The gluten free spring rolls are raw salad wrapped in rice paper and the gluten free pad thai with tofu was slimey and over powered with ginger. My wife couldn't eat it because it was so bad. When we sent it back they didn't want to take it off the bill. Then they offered 70 percent off. I had to tell them no, she didnt eat 30 percent of it, take it off before they would refund it. Who does that? The wait staff was slow and unattentive as well. We wont be back. Ever."], ["Pamela H.", "We were picking up takeout to eat with friends and Sawasdee was recommended to me. I was feeding four people and I wanted to do a variety. I ordered Pinky in the Blanket and Ka Nom Jeep for appetizers and  Pineapple Chicken Curry, Beef Massaman, and Evil Jungle Noodles w/ fried tofu for shared entrees. Everything was really very good; perfectly seasoned and just hot enough. My sole critique is that the chunks of meat and veg were just a little too large, making them difficult to eat without a fork and knife to cut them.The consensus was that the Pineapple Chicken was ah-mazing. I would not hesitate to eat or order from here again."], ["Jill H.", "Such. Good. Food! If you like Thai food, this is a great place. I have had a bunch of dishes from here:- Drunken Noodles. They are fantastic. Next time I may ask for them to be a little hotter.-Pad Prik Kra Paw. Great flavor and perfect amount of heat. -Panang Curry. Perfect blend of curry and other flavors.-Fresh Spring Rolls with Shrimp. SO GOOD. This restaurant actually puts herbs and decent sized shrimp in theirs. If you eat in, you get your rice in various shapes. Prices are a bit high but the food is so good, I will pay it."], ["Anthony G.", "This place used to be the best Thai place but as a city grows places that were once fabu are now taboo. Went here for lunch which I now avoid b/c Capitol Blvd is like Afghanistan but I missed Sawasdee and I stopped in on my back from someplace nearby and ordered the tofu and it was sad. The serving size was miniscule and it was almost $8 (When did Thai food become almost $20 for dinner?) The tofu looked like old sponges and the sauce was watery.  Let's just say that I make better Thai food at home than most places. I remember way back when Thai food was inexpensive and good and it still is in some cities but not here. I recommend another Thai place although I may have gone on an off day but really tofu being cheap the could've given a little more because I certainly paid a little more."], ["Joseph B.", "As good as it gets!  My partner got the 1/2 Duck and I got the Tamarind Tilapia (whole fish).  Yum!  Give it a try!"], ["Allie M.", "Delish! Good quality ingredients and great flavor! Plenty of options on the menu.  Cute decor."], ["Crystal T.", "My friend introduced me to this resteraunt since I'm new to the area. I'm happy she did because it's a cozy place with fresh food at a great price."], ["Monica B.", "We ordered the chicken satay, it was pretty good, we also had the volcano tom kha which was amazing, I got the spicy fried rice it's not really spicy I would say it's a 4 out of 10 but the have extra spicy and make me cry spicy. My fiancé got the tofu fried rice and the tofu wasn't fresh. The food is good but not great, I think I'm going to give their seafood main dishes a try next time"], ["Beth B.", "this is the best thai i've found so far in raleigh.  i would say their drunken noodles and pad thai are above average.  my favorite thing there would definitely be the tom kha soup with shrimp.  it's a little pricey, but definitely worth it.  the service is always great and everyone who works there is very nice and friendly, although the food does take slightly longer than normal to cook.  i do wish they had more of a drink selection, it's very limited to only a few beers and wine.  they have a great bar space available, but it's always closed for some reason..."], ["Laura G.", "We went last night because I had a Groupon and the food was excellent. We had the shrimp rolls for appetizer, they were fresh, large and tasty. The peanut sauce was as delicious as I had remembered it. I had the pad thai and hubby had a seafood curry dish. I asked for some hot sauce and got a nice dish of three sauces with some hot pepper flakes, I loved this presentation and being able to make the dish my own. It was so good and hubby's dish was good too, however I thought his plating was awkward. His rice came in the shape of a crown and the plate was very small. Then the main dish came in a kidney shaped bowl, it wasn't big enough to put all the rice in, it was just not right. I am not taking a star off for this, I am taking a star off for the service. We came in around 7:30 on Saturday night and when we arrived many of the tables were occupied. But when we were brought our food, the restaurant had pretty much cleared out, except for two other tables. We were never checked back again to see if we wanted water refills, another beer,  and we had to go to the register to get our check. It was like they forgot about us. Sawasdee we have been coming to you for years, but we are not like an old shoe that is left under the sofa. There are so many Thai restaurants that we have to choose from, you'll need to step up your service next time to keep us coming back again and again."], ["Kevin F.", "Went here again and had the same experience. One thing you definitely have to check out is the restroom sign. I've never seen one like it."], ["Nancy Y.", "I was on the elevator talking to a coworker about going to Sawasdee and this lady (who I'd never seen or spoken to before in my life) piped up: \"best Thai food in the area.\"  I couldn't agree more.The most stressful part about my dining experience is figuring out what to order.  I want to try EVERYTHING on the menu, but have learned by trial and error that I can only consume 'so much,' before I start having regrets. Most recently, I tried the pineapple (red) curry and LOVED it.  The tangy sweetness of the pineapple complimented the sweet spiciness of the red curry perfectly. I like the way Sawasdee cuts their chicken - larger slabs that are big enough to give you some bite, but thin enough to really soak in the flavors of the sauce.Great portion size.  Authentic.  Excellent service.  Win."], ["Adrian S.", "Great Thai food! The best in raleigh by far. I always end up with the panang curry, really good! We also get the Pad Thai regularly. Highly recommended!"], ["Erika Josephine W.", "I love this place! I would give 5 stars if the prices were better. I moved to Raleigh from CA in 2012 and in CA you can get great Thai food for under $10. Pad Thai is about $8 or $9 in CA here at Sawasdee it's about $13. I just feel like its too expensive. Overall, the food itself and customer service is superb. My boyfriend and I were going once a week for awhile and have tried numerous dishes. My favorite is the red curry noodles but in all honesty I've liked every dish I've had! I definitely recommend this place!"], ["Anna T.", "Summer rolls were really beautiful and healthy but it all was downhill from there. Overpriced mediocre food with slow service. Chicken was overcooked and cold, pad see ew had fish sauce flavor (not in a good way), all condiments were bland. My dining partner thought it was dirty. Music was way too loud. Not a pleasant experience or satisfying meal."], ["Cindy G.", "Came here with another couple on a Friday night. It is a small casual restaurant and the Decor is very pretty. We were seated right away. The server was attentive. There is a variety of food and a degree of spice but they accommodated me to make something mild. The vegetable dish was great, lots of veggies and done just right. Great spot to go as just a couple as they have tables with big comfy chairs."], ["Emily L.", "This food is PURE HEAVEN. Very fresh ingredients, cute, bright decor in Capital blvd location, very chill/relaxing atmosphere. Had the Tamarind duck, Royal duck Curry, Pad Kring = all AMAZING. Best Thai place in Raleigh!!!"], ["Stacy T.", "Friday Night, late and totally bug bitten, I head over for some TLC from Sawasdee. As mentioned by other reviewers, the decor is a little eccentric and somewhat shabby, but hey, it is the food that matters. Tom Kha $4.45 (1 cup with chicken): The coconut soup was very rich and creamy, which I liked. It had a few small pieces of tomato in the dish. The tomatoes had a slightly off texture and taste about them. The soup also had 2 pieces of mushroom and small bits of chicken. It could have been much improved if it were served with more veggies like broccoli or more mushrooms. The soup didn't have as many herbs or spices as I am used to from other places. Pad Thai with Chicken $12.99: The chicken was pleasantly moist. The entree had huge pieces of chicken scattered throughout the dish. The noodles were slippery and wet. The dish is not as sweet as I have had at most places, so it didn't meet my expectations. However, if you enjoy a less sweet dish, this may be for you. I thought it was a little expensive for a Thai dish, normally I would expect it this dish to be around $9.95. Fried Soft Shell Crab Special $17.99: A disappointing dish. The special only came with 1 crab that was cut into fours and mounted onto a vegetable medley. The crab was cooked well but was drowned in a sweet and sour sauce. I do not recommend this dish. All in all, it was an okay experience. Staff was very friendly, decor was somewhat shabby, the food was a little overpriced, but tasted okay. I will probably explore other Thai restaurants before returning to this one."], ["Liz B.", "My favorite Thai restaurant in the Triangle for the past decade.  I much prefer the Capital Blvd (original) location to the Glenwood one, with its bright colors, slightly cramped tables, and funky decor, as well as the better food.  The soups are flavorful and bright.  The curries are creamy, perfectly spiced (with enough heat for me, no small feat), with wonderful chunks of green beans, peppers, and meat (I usually go with chicken).  They serve their rice in cute shapes like teddy bears and butterflies.  And their custard-with-sticky-rice dessert is to die for.  The service is friendly and attentive.  I get the warm fuzzies in abundance whenever I stop by.I was a regular back in the mid-00's when I was a student, but haven't made it back very often since returning to NC a little over a year ago.  However I went once last year and found the food just as good as I remembered.  I recently tried Thai House Cuisine which is also very good, but my heart lies with Sawasdee."], ["Troy B.", "Great service and excellent food love this place! The Décor is nice and the staff is always friendly. The make you cry spice level is great if you like really spicy food"], ["Laura S.", "Amazing, amazing, amazing Thai food. Super nice wait staff - they aim to please. Quirky atmosphere that I enjoy.I can't say enough good things about this place. Everything is superlative. I've never had a bad meal here."], ["Lindsay W.", "For years, I thought Seattle had the best thai food in the U.S. but after eating at Sawasdee while in Raleigh for Christmas... I'm just not so sure.The chicken satay appetizer was one of the best I've tasted - their peanut sauce has some wonderful flavor and a kick of spice which was just perfect. The chicken skewers were very juicy, but grilled with the exterior just slightly crispy. My boyfriend got the Drunken Noodles, and I got the Pra Ram Long Song (also known as Swimming Raja/Rama). Both dishes were excellent. Better than any thai food I've had in Nashville, and definitely on par with the Thai food in Seattle.Sewasdee is located in a little strip mall, quite frankly just judging from it's surroundings I was prepared to be disappointed. However atmoshpere inside is fantastic, the restaurant is kept very clean, has great decor, a full bar, and even a private dining area for parties. I will DEFINITELY be back."], ["Ali B.", "My benchmark (the dish you order at every restaurant for comparison purposes) for Thai food is Red Curry Chicken. I had heard great things on yelp and decided to give it a go myself. I'll walk through this review in the way that I determined the star rating I gave it, starting with 5 stars:I absolutely loved the Red Curry Chicken, probably the best I have had since being in DC and definitely the best I have had in Raleigh so far (other place I have tried are Thaiphoon Bistro and Tom Yum Thai). Still at 5 stars, loved it!I also ordered the Fresh Vegetarian Spring Rolls which were ok but lacking compared to other places I have had them before. They were primarily lettuce which was a bit brown in certain spots, had an unusually thick rice paper wrapper, and only had one leaf of Thai Basil which in my opinion really ties fresh spring rolls together and makes them what they are. -1/2 star, these were not the most remarkable.Ambiance was quite unusual, a somewhat older establishment. Doesn't have the cleanest feel but that may have been because it was crowded and we were sat in the very back small room next to the curtain covering the bathroom access. No unusual odors but ambiance is important to me when I go out to eat and this one really was lacking. -1/2 star.I would definitely go back but probably sometime when it is less crowded so I can get a table toward the front and I wouldn't order the fresh spring rolls again."], ["Yuna C.", "Nothing special.  I have had Thai food all over the country and this was actually my least favorite.  Their definition of \"make me cry\" spicy was not spicy at all.  We started off with the Tom yum soup and it was mediocre.  There were two pieces of shrimp and large chunks of tomatoes.  Rather than having a clear spicy broth, it was a red broth with lots of spices.  Then I order the red curry since many of the other yelpers enjoyed it so much.  Again, the curry was not spicy and I had to ask for Thai chili or hot sauce.  They did not even have the Thai chili so I just added the hot sauce to my meal.  The chicken and veggies in the curry were cut up so large that it was inconvenient to eat.  I has to cut everything up before I could even eat it.  Way too much work for curry I would say. I should be able to just pour the curry over my rice and enjoy it but in this was not the case.  We tried to order the mango sticky rice and she said \"we ran out of it already\".  I was so excited to have found a Thai place with good yelp reviews but overall I left very disappointed.  Oh well now I will have to search for another one."], ["Corry C.", "Thanks to you local Yelpers for this great suggestion. Today was my first venture in Thai food and I'm hooked, I may go back tomorrow! Had Pad Thai with chicken and shrimp at the \"Make You Cry\" level. It was a delicious, eye tearing adventure. The waitress was warm and friendly and took time to explain some of her and her husband's favorite dishes to this first Thai timer. Lime in the ice tea was a nice touch and matched nicely with the the lime on the dish. Till tomorrow!"], ["Chutikan H.", "Great Thai food and has good quality!"], ["Adri T.", "Visited Sawasdee based on Yelp ratings.  Found the location to be warm and inviting.  Although small, there is a nice coziness to the restaurant.  Some tables up front are paired with upholstered furniture like you would have in your living room, very comfortable indeed.  It was pretty busy for a Wednesday night, and we were shown to a glittery booth in the back of the restaurant.  The tables are all nicely decorated in true Thai restaurant fashion, with bright colors and high gloss. A waitress came to get our drink order right away.  We ordered iced tea and water.  She quickly brought the drinks and asked if we were ready to order.  We needed a few more minutes, but she soon returned when she saw we were ready.  We ordered:Fried Spring Rolls - Light and crispy - served with a sweet dipping sauce.Tom Kha Soup Volcano - Large order of creamy coconut soup with tangy bits of lemongrass, lime leaf, and mushrooms - plus it's really neat-o to eat your soup from a flaming volcano!Larb Gai - Chicken salad with strong flavors of citrus and lemongrass, with a hint of spice - delightfully refreshing!Drunken noodles with Seafood - Delightfully flavorful noodle dish with large shrimp, fresh mussels, calamari, and lots of rich flavors!All food was full of flavor and freshly prepared.  Another yelper had previously commented that the food tasted a bit sweet, and I do have to comment that the dipping sauce for the spring rolls, the drunken noodles, and the larb gai, all had a sweet aftertaste.  Interesting to note.It's a great little find, and definately worth checking out!"], ["Ami O.", "This is the only Thai restaurant worth eating at in the Triangle area, in my opinion. And it's not just because my experiences elsewhere were terrible (although they were), Sawasdee is very, very good."], ["Lance W.", "A friend and I went here to use a groupon.  I had heard plenty of sawasdee before, and i have to say it lives up the hype!!  the staff were super attentive and seated us immediately. even though we showed up almost before the kitchen closed, they were patient.We tried some excellent lettuce cup shooters that were filled with coconut, chile, and shrimp as an appetizer, and i had the \"evil jungle noodles\" (what's up with that name?!) which were good and spicy.  But my friend got the sweet end of the deal.  I don't quite remember the name, but it was a filet of salmon that was flash fried and topped with a medley of onions and cilantro in a fish sauce and lime concoction.  It was simply amazing!I will easily be back here in the future!"], ["Julia H.", "Don't let the small space or strip mall location fool you -- the bland exterior hides some of the tastiest Thai food in Raleigh! The lunch menu offers both daily specials and lunch-sized portions of most of the items available on the evening menu, always with plenty of vegetarian option that aren't short on taste or variety. For an evening meal, what Sawasdee lacks in stately elegance is more than made up for by the vast array of subtly flavoured dishes from spicy red curry to delicate pad Thai and a number of choices in between for every palate from adventurous to timid. I've never had a meal here I didn't enjoy, and I hope the same goes for you!"], ["Raquel M.", "I was so excited to try Sawasdee based on reviews, however I was extremely disappointed with my experience. While the wait time wasn't terrible, my Poor Man's Noodles had the distinct smell and taste of spoiled food.  Initially, I thought I was just unfamiliar with the scent of the sauce used in the dish but my taste buds confirmed my initial suspicion. I had to throw the dish out after a few bites. I have never in my life had this experience with takeout and hope never to have this experience again."], ["Levi Q.", "I've been to Sawasdee twice (Glenwood location), both on dates and each time I was very satisfied with the freshness and taste of the food.  I got tofu with red curry each time.Just as pleasing was the fact that FINALLY a restaurant in the Raleigh area offers some KICK to their food.  I ordered the \"make you cry\" level of spice after being consistently disappointed everywhere else I requested a moderate amount, and I had to go to the bathroom to clean myself up before I was done eating.I agree with another review regarding the tofu, in that I am very picky about tofu and Sawasdee does it very well.Sawasdee was also far from having a wait on the Tuesday and Thursday nights I went.  It's almost a pity it's not busier, but I will never complain for not having to wait for excellent food.By far the best Thai I've had in years compared to the ones I've had in Charlotte and Charlottesville (VA)."], ["Lashona M.", "Great place to dine if you want to be somewhere for quiet time. The food is usually a little more spicy than the one located on Glenwood Ave though but the food is still flavorful. I always get the spring rolls, and switch up my meals by getting either the tofu eggplant dish or tofu cashew nuts dish.  I'm very picky about tofu and it has to be cooked a certain way but both Sawasdee locations cook it exceptionally well!The atmosphere is moderate and small but it is still nice!  I usually drop in on this one if I happen to be shopping off of Capital Blvd."], ["Chris M.", "I love the food at this restaurant; however, if you have been here before, they have changed the way they serve their food and the quantity.  I usually get Red Curry Chicken.  They used to serve the chicken in a bowl with a generous amount of the famous coconut milk curry sauce.  Rice was served on plate in the form of a bear, fish, or some else.  This is how it is served in Thailand.  Now they give you a plate with a couple of scoops of rice with the curry sauce and chicken on the plate to the side in a much smaller portion.  I'm not sure if this is due to rising costs, but I would suggest to the owners to raise the price $.50 or buck before changing the portion of the meal; It wasn't enough to fill me up.  If you are looking for an alternative to Sawasdee, you may want to try the Thai Cafe in Wake Forest.  They have generous portions and the food is the same quality as Sawasdee.12/10/2013 UpdateI revisited Sawasdee last week with a friend.   I ordered my regular, Red Curry Chicken.  On a positive note, they have returned to serving that particular meal in a bowl with the rice on a plate in the form of some sort of object, for me it was a tree.  The cocoanut milk curry sauce was NOT good.  It was watered down and not flavorful as the sauce should be.  I didn't see any of the original employees from the good ol' days.  I can only guess that the quality left with them.  What a shame, it used to be the best Thai restaurant in Raleigh."], ["Jenny S.", "Sawasdee is a fantastic little spot right off of Capital Blvd. It's not the biggest dining room out there, so on busier nights, you may have to wait for a table, but the wait's never long. From what I hear everything here is fantastic. Everyone I've ever been with has raved about their food. I always swear I'm going to try something new, but I get suckered into my old favorites 90% of the time- the Tom Yum soup, the Drunken Noodles (2 stars not 3, I'm a baby), the red curry. I do want to be adventurous, it's just that when you find something that's so perfectly done, it's hard to pass up the chance to have it when you get the chance! I love the colorful decor. It's dim enough to be relaxing and a romantic date spot, but colorful and cheerful enough to provide a really fun and authentic atmosphere. The only thing I knocked a star off is for the bathrooms. They are in the back, hardly separated from the BOH, and kind of dingy. Plus, as a female, any restaurant with less than 3 toilets means you're occasionally gonna have to wait, so I don't recommend waiting until you're desperate, haha. A couple of years back, when my kids were younger, a friend told me this place wasn't \"kid-friendly\". I've since realised that she meant that a) a lot of people in this place aren't going to appreciate anything but very well-behaved children infringing on their dining space, and b) if you've got a picky eater, you're SOL because they don't do a \"kids menu\" or \"chicken fingers\". However, if you've got well-behaved kids who appreciate a little spice, or if you're ordering takeaway, I still recommend it for kids. My 7-yr-old loves the drunken noodles and usually mooches so much that I'm soon going to have to start ordering him his own adult-sized meal!"], ["Richard H.", "The best Thai food around. I take there our employees for lunch often."], ["ed f.", "We typically get take-out at the Glenwood location. The flavors are always fantastic. The tom-ka soup is great, as are all the main chicken dishes we've tried. I had the spicy fried rice last time, and the pad kra paw chicken noodles the time before. Both were great. My g/f loves the pineapple curry. The prices seem a bit high, but i did have leftovers, so that helps ease the wallet pain."], ["Kevin P.", "Everyone and everything deserves a second chance. I had been here before to pick up some pad thai and chicken curry to-go when the place first opened . Maybe it was because the place was new, or maybe the food had lost it's mojo by the time it got home, but I wasn't impressed. However, this time around it was definitely good stuff. I had a house salad and the Red Curry with shrimp. I'm predisposed to loving Thai curry dishes, so of course, I liked it. For me, what set it apart was the thickness of the curry. Some can be too watered down, but this had a nice thickness. Perhaps the waitress thought I was cute, because the rice came out in the shape of a heart. (Do they do this for everyone?). The house salad was OK at best, but really, who goes to a Thai restaurant for the house salad? So, the decor is nice, staff is friendly, and there is a good sized bar area if you need to get warmed up before dinner. It's worth going if you are in the area."], ["Sarah H.", "I called into Sawasdee the other evening for take-out and was disappointed by the experience. I think most of this has to do with the fact that I've only been here for lunch before and the lunch specials are pretty bangin' for the portions. On Saturday, I ordered my normal drunken noodles and heaven beef and for $20 ended up with smaller portions than I normally get for lunch. The heaven beef was literally half the amount and the drunken noodles were comparative to the lunch portion but about $6 more. In the future, I'll remember to stick to their lunch specials."], ["Sam J.", "Just OK. Nothing really wrong with the food. Not amazing either though. Service was slow considering there were only 2 other patrons at the time.  Entrees were a buck or two overpriced for small portions. I didn't get to have pad thai leftovers for breakfast. Decor is funky cool."]], "Champa Thai Cafe": [["Lori P.", "This place was absolutely horrible!  Do not go here at any cost.  I ordered pad thai and it smelled like wet dog.  I tasted it and it TASTED like wet dog.  It was repulsive.  I almost vomited.  My friend also ordered the same thing and hers was gross too.  We sent them back and they refused to serve us anything else.  Stay away."]], "Ni Asian Kitchen": [], "Sushi-Thai Restaurant": [], "Lemongrass Thai Restaurant": [["Shoni F.", "I'm no Thai aficionado, but I eat it regularly and we make a point to find Thai restaurants when traveling.  In North Raleigh, Lemongrass is one of the better Thai spots, particularly in terms of value and quality.  We've been monthly patrons for about two years.  For less than $10 (lunch), you get an appetizer, a drink, and a generous entree.  My favorite dishes are Pad Thai, Chicken Yellow Curry, Pad See Ew, and Pineapple Fried Rice.  My husband leans toward the super-spicy side, so he's a fan of Kee Mao (thai spicy). It is a sinus-clearing experience for him... which means I would probably have to drink a quart of milk with it.  In my experience, the ladies room at this restaurant is clean.  Call me anal, but this is a huge deal-maker (or deal-breaker if dirty) for me.*Sigh* If only Lemongrass had more consistent customer service, they would win the elusive fifth star.  Sometimes the waitresses are a bit aloof, though the waiter who works there is quite friendly and attentive. As a side note, we are people of color and do not feel we've ever been discriminated against at Lemongrass.  Not to discount Lotus B's experience in any way, we simply don't feel we've been treated differently than other patrons.  At the same time, we've never sat outside and we usually go during times when it's not terribly busy (on weekends).  My first time being there on a weekday was actually yesterday with friends.  It was packed and they needed a third person to help wait tables.  As others said, the ambiance is so-so.  It's basic, clean, and small.  When it's all said and done, I recommend Lemongrass."], ["Chris H.", "The food was great.   We started with a salad with some wonderful ginger dressing.  My husband had the Yellow Curry Chicken and loved it.   I had a new Spicy Chicken dish that was very good and very spicy.   My only complaint is that service was slow.   Very busy place with really good food but need to work on the service."], ["Brent L.", "Really, really good Thai food.  We showed up for lunch on a Sunday around noon and it was pretty much empty, but by the time we were paying our check every table in the place was full.  This overwhelmed the waitstaff a little I think, but it still wasn't too bad.The food was great.  Mine had the perfect amount of spice and the noodles were perfect.  Egg roll was good too.  No complaints about the food at all.  Been looking for a good Thai spot in North Raleigh, might have just found it.Really good lunch specials too.  $9 gets you an egg roll, entree and drink.  Worth checking out if you're a Thai fan."], ["Harmony M.", "I've never had to write a review about this subject before, but it was so overt that my experience can be explained in no other way. This is honestly quite surprising, as most other reviews are so glowing. The food was good, yes, but not \"ragingly spectacular,\" as other reviews may lead one to believe. I've had better in Raleigh. My concern is not with the food, however, but with the overtly discriminatory treatment I received here. As a person of color, I was treated differently than EVERYONE else at surrounding tables. I was asked if I was ready to order every 60 seconds (literally) for the first several minutes after arriving. After ordering my beverage, I went immediately to the restroom to wash my hands. Upon returning, the waitress was asking again for my order when she clearly saw I'd just returned. (I was literally sitting and picking up the menu.) After about three short minutes of perusal, once I did state that I was \"ready to order, please,\" she emitted a deep, shoulder-heaving sigh, flashed an \"I don't want to do this\" smile to a Caucasian couple, abruptly dropped the smile before turning to me, then dismissively took my order.Things got worse as the evening continued. My waitress told me they'd \"run out\" of the exact things I saw another table (a Caucasian couple) receive. Following this, she hid inside for the duration. The waitresses preferred to shout from the door to my outside table instead of coming tableside as for everyone else. My drink was never refilled once. Not one time was I asked if I needed ANYTHING once my meal arrived ... except a box. I was obviously still eating and stated that I did not need one, thank you. Even still, a few moments later, I was given it anyway -- along with the check -- while I was still clearly fork-to-mouth eating. (They didn't close for an hour and a half yet, so it was not that I was lagging.) I did request things, but never received them because the waitstaff all conveniently disappeared, or hurried away after checking on other tables while I sat unattended the entire time. One waitress only finally returned once she saw that I'd readied the bill. I was dressed with class, clean and neat, and am very mild-mannered/low-key by nature. I was courteous the entire time, even after realizing what was occurring. My point in saying this is that it was not my demeanor or behavior that spawned this treatment. As well, there were only four to six restaurant tables occupied -- including the inner and outdoor tables -- though there were three servers. So this level of service obviously did not occur because they were at all busy.If you're a Black american, I strongly recommend avoiding this restaurant. The racist treatment I received was amazingly disheartening, sad, and ignorant."], ["Sowmya R.", "This place definitely is among the top authentic Thai food restaurants.I had the usual flat rice noodles with chicken and vegetables and it was delicious... My husband ordered one of the Thai curry's and that was very nice too.Portions are huge. Great value.Ambiance is nothing extraordinary but the good food and great price more than makes up for it."], ["Barbara G.", "I have ate at Lemongrass several times before but each time it seems to get worse, both the food and the service.  My soup was mostly broth, literally one small piece of chicken and several huge chunks of undercooked onions. The broth did have a good flavor. The most disappointing thing was when I asked for crunchy noodles for my soup and the waiter said there would be a charge. WHAT! That's like charging for crackers, or ketchup for fries! Thats crazy and I refuse to pay for a condiment. My daughters salad was mostly iceberg lettuce with a few shreds of carrot. The ginger dressing was good. My sweet & sour chicken was terrible. So overly sweet I could not eat it. The sweet & sour sauce tasted like a huge bottle of ketchup mixed with a lot of sugar. Not good. More pineapple, peppers and onions than chicken. My daughters pad thai was good except for the shrimp which were so overcooked they were like rubber. Won't be coming back, mostly because of the charge for condiments.  Hope those few pennies are worth losing a customer Lemongrass!"], ["Amy B.", "Went there the other day with my brother for the first time- I was so excited to have such a highly recommended Thai restaurant near the house. Unfortunately I have a very mixed review. Brother had shrimp dumpling app and a bowl of soup and enjoyed. I ordered fresh spring roll which was good but when I asked for more classically served Hoision sauce (at least in every Thai restaurant I've been to in the States), I was given a blank stare. And here's the problem: the service. My brother ordered a glass of water and some tea. He was never served the water. I ordered a soda and was never offered a refill. I ordered the pad thai and am picky- I asked for the tofu, bean sprouts and scallions to be removed but I did want to add chicken (so I wanted chicken and shrimp). I agreed to pay more. The waitress went to get paper to write it down. My order had exactly 3 shrimp, which cost $5 btw, and tofu and a random sprinkle of scallions which I was able to move off. Pad Thai itself was ok but I was surprised that waitress didn't pick up on error. I would have brought it up to her except no one ever asked us how the food was or if we needed anything. Eventually they realized we hadn't been eating for a while and gave us a box and the check.Oh, and I won't order take out either from this place- man entered by himself and one waitress mistakenly thought he was there to pick up a to go order. He said no, he wanted to sit and order so she sat him at table next to us and she set to go order on the table with him to write down his order. And walked away leaving someone else's food with him. While we were waiting for them to still notice we needed boxes, we watched her continue to bring him drink and spring rolls all while leaving someone else's order on a stranger's table. I don't know why he didn't say anything, but I don't want to get food from them if they are that careless- it was still there when we left! Maybe this is a fluke- people seem to love it but we weren't there in the middle of lunch rush, they had adequate nbr of staff, it just doesn't make sense."], ["Cha Cha P.", "I had Thai for lunch and for dinner today, with the Lemongrass being my place of choice for lunch.When my husband and I ordered our food three star hot, our server looked at us like maybe we just didn't understand it would be hot.  We assured her we liked hot.  Let me tell you, if you like hot, order it three star hot there.  I will admit a tear managed to escape from one of my eyes when I was about halfway through my chicken red curry.  By the time I finished the last bamboo shoot in my dish, my lips felt like they were the size of a lifeboat .  I have to admit, I left some broth.  I just couldn't hang.  Man, was that good!  And hot!Loved it!"], ["S J.", "I love this place - they offer a nice selection of classic thai dishes and are consistently good.  A little pricier than other thai restaurants in north raleigh, but a little better, too.  The chicken green curry is a favorite, as is the salmon in basil sauce if you like it on the hotter side.Side note: my first time hosting \"dinner club\", I wussed out on cooking and got takeout from Lemongrass, if that's any indication of how much I like them. :)"], ["Robert W.", "Not much to say.  Good, clean, quick - everything I'm looking for in a great lunch spot."], ["M R.", "We had dinner here for the first time last week and I had high expectations for the place due to the reviews.  The food was AWFUL.  We ordered several entrees (we were a group of 9) to share and most of them had shrimp, and the shrimp in every single entree was overcooked!   The calamari appetizer was a joke, it was 90% breading, and the \"calamari\" enclosed in the overly-thick breading was as thin as a noodle (no exaggeration!)!  I actually thought that it really was just calamari-flavored noodle!  The entrees were mediocre at best and the service was average."], ["Angela S.", "Tasty little Thai restaurant tucked into a small shopping center of Litchford Road. It's great for lunch. They give you an appetizer, soup/salad, and entree from something like $7-$10 (depending on the entree, I think). They also have a frequent diner's card (get so many meals, get the 10th free or something like that), and are listed on restaurant.com (so you can get a certificate good for $10 at lemongrass and only pay like $2 for it, or something like that). Their pad thai is pretty tasty, and some of their curries are really great. My sister usually eats 2 entrees when she comes here as she's a very active athlete (and a bit of a glutton--don't tell her I said that though). My brother generally hates Thai food, but even he likes their yellow curry.  I recommend! It's my favorite Thai place in Raleigh, and has been since La Vie on Capitol closed a few years ago. :( But anyway. Give it a shot! :)"], ["Florio O.", "The waiters are very friendly. The food is very good. We always have very good meals here. The good quality of the dishes is very consistent."], ["S Q.", "Small quiet unassuming place with great tasting food. We were in fact a little surprised as first time diners as the dishes were little pricier. We ordered egg rolls, red curry with tofu, and an extra side of rice. The quantity of curry was enough for two people... it was just a perfect meal. A little greasy, but very tasty - this place is really close to where we live, somehow never had a chance to go in earlier, though we got so many coupons by mail. So, next time you find coupons or discounts, use them! :-) They mostly cater to take aways than dine-ins. And their dishes are already spicy, so if you really aren't in the market for mind blowing hot... just go with their regular offering. Also the server mentioned that they were soon opening their second restaurant on Six forks/ Strickland. I give a big thumbs up to that!"], ["Joseph D.", "Lemongrass is right around the corner from our house.  We wanted to try something new, and my wife thought she wasn't a fan of Thai food until we came here.  She tried the Pineapple Fried Rice.  It was really good and a great first intro to Thai food.  It's not spicy, but still has a sweet thai flavor.  The curry's here are also very good.  I got the Chicken Green Curry which comes pretty spicy, but you have the option to kick it up 1-3 notches.  The waitress will confirm with you if you really want to kick it up said notches - because it's REALLY SPICY, so be careful.  Also, try the Thai Ice Tea, and the Pumpkin Custard. It's fantastic.$35 for 2, and we were stuffed!   This place is a new North Raleigh Favorite."], ["Juliette M.", "Went here because of a citipass coupon. It was very small and completely understaffed. One server for the entire restaurant. We didn't get a table for at least 10 minutes because she didn't have time to clear off the mess on the 10+ open tables. The yelp page says its kid friendly-it's not at all...as for food, I got my son sweet and sour chicken. It was very weird/flat, not fried, chicken with doctored up ketchup all over it. He wouldn't eat it. I got a soup-watery with huge onions, and a salad of mostly iceberg lettuce. The peanut dressing was ok. I'll never go back..."], ["Adam R.", "Wow, a lot has changed at lemongrass.  It's been a while since I have eaten here but tonight was bad enough for me to never try again.  Their Tom Yum Soup was good in flavor but lacked the punch in freshness it once did.  What happened to the hand full of onion and red pepper.  Where in the heck did the the chicken go.  After finishing one large (mostly broth) soup I continued onto the Beef Panang Curry.  I don't even know where to begin with this one.  The quality of beef was worse than Stank-em Brand Beef you buy in a grocery store freezer.  The curry its self was very gritty and just lacked flavor.  So farewell lemongrass.  It was a good run while it lasted."], ["Dede H.", "Great Thai food.  Best in Raleigh.  Service excellent and friendly.  Try the Thai ice tea , pad Thai and green curry chicken."], ["Cecilia C.", "The Red curry chicken is the best in town and pad thai is also good but only 3 shrinp on the lunch portion. Not too impresed with the green curry chicken. It is good food reasonably priced, I just rather pay more for dinner portion and be happy. There are some restaurants that don't need to invest a million dollars to be popular and stay in business and this is one of them. I will keep going back and try other entrees."], ["Krystal T.", "I love this place. I moved out of NC about 2 years ago and have yet to find a Thai restaurant that I love more than this one. It is a very modest restaurant with great authentic Thai flavors. The lunch prices are great for what you get! My favorite dish is the Green Curry Chicken... I just love it. Be careful when you tell them to spice it up...it has quite the kick to it. My mom usally gets the Kee Mao noodles which is delish as well (and spicy!) The portions are generous and I recommend that new comers try something new and remove themselves from the comfort zone that is Pad Thai. A funny story about this place.... I was in town over a holiday weekend and my mom and I were craving Thai food big time around 8p.m. They were \"open\" according to their posted hours- however, no one was answering the phone (the voicemail message on the phone is adorable by the way... it sounds like some little Thai child speaking)...well we didn't leave a voice mail after calling 10 times... however, they did call us back the next day to see if everything was okay!"]], "Bida Manda": [["Elease B.", "INCREDIBLE!!!  All the raves are TRUE!  And yes, you DO need a reservation --- even on a Monday night!  Who knew?!!  I got the pork belly soup because of all of the reviews I read about it and I can truly say it changed my LIFE :)) I will forever be in love with this dish and crave it until the next time...!  The service was excellent. Drinks right on POINT!  Everything was quite pricey - should have more than two $$ in description."], ["Melissa L.", "I came here for a friend's birthday party on a Saturday night and was really impressed. The atmosphere is gorgeous (who is their interior decorator?!) and the food is sublime. Out of our large group of about 10, almost half the people ordered the Crispy Pork Belly Soup -- the dish came with quite a reputation. I didn't order it since I'm not a fan of coconut broth, but found it really tasty. It has a rich, creamy flavor, probably from both coconut and pork belly. It's also a bit spicy and laden with cilantro floating blissfully through the noodles -- I've been told these are two \"good\" attributes in food... I thought about getting the Pad Thai (my usual go-to dish) but opted for the Saffron Crepe because it sounded interesting. I'm glad I took the risk because it was amazing! I got the version with Sauteed Shrimp and Bacon so it really couldn't go that wrong. It was like a savory pancake/omelette folded in half, with the shrimp and bacon \"stuffed\" inside. It came with some sweet/vinegary sauce (with the consistency of water) -- I poured it little by little on the crepe as I ate it, to avoid the sogginess I'd read about in other reviews. Everyone who tried it at the table seemed equally impressed. I would definitely go back just for that dish alone.The dishes here seem to be a bit uneven. I heard the Pad Thai is pretty ordinary. We also ordered the Fresh Summer Rolls as an appetizer and found them to be just okay. But all in all, Bida Manda is a very solid addition to the Raleigh dining scene."], ["Meaghan M.", "I've been trying to come here for months, but only recently was able to go. The fact that I had to make reservations 2 weeks in advance for a 7:00PM Wednesday time gave me high expectations for the quality of Bida Manda. I was not disappointed.My meal here was quite possibly one of the best meals I've had in quite some time. My friends and I ordered the Crispy Spring Rolls (with pork) to start, and they were fantastic -- especially with the dipping sauce. I chose the Crispy Pork Belly Soup as my meal, mostly because it's what I've heard most about from friends who have come here previously. I'm not normally a fan of coconut, but the coconut curry broth mixed with various veggies, pork, peanuts, and cilantro created such a depth of flavor in the soup that I couldn't believe.Unfortunately I didn't order one of Bida Manda's signature cocktails, so I can't comment on those -- but their beer prices are in line with what I'd expect to pay out (average of $5/pint). I was able to order a Fullsteam Cackalacky for only $3, so, bonus points there.Our waiter was very attentive and extremely knowledgeable not only about the menu, but about the food itself. He gave me an excellent suggestion to put 1-2 eggs in my leftover soup the next morning since the dish is typically served prior to lunch -- delicious!The ambiance is lively and beautiful. I can't wait to go back again."], ["Julia Z.", "3.5 star for food, bump it up to 4 with the nice ambiance. The place is cute, I like the decor, china, tiny bamboo box for sticky rice(which I like a lot, it's like eating a dessert rice), and staff are nice. The kitchen is not the fastest, usually you'd expect a little wait on food, but in a nice sit down place it's okay. But here comes the con: I really tried to like this place and I don't mind going here for lunch, but food just doesn't taste that great. I do have to admit, I am extra critical about my Asian food. You have to win my taste buds to get me to put down a 4 stars, although in this case I bumped it up because I appreciate an Asian restaurant downtown among other western food, being different and refreshing.The food is always on the saltier end. The lacking of the clear crispy flavor profile is what's missing here. I want to say most of the dishes here share a common undertone, which is not always great--because there's Thai food, there's Vietnamese food, and there's Chinese food on the menu. They DON'T all taste the same. I hope the next time I return, they come up with something amazing."], ["Kim W.", "Wow! I was truly blown away by Bida Manda! I have been hearing such great things about this restaurant since I moved to the area and was finally able to try it out last night.Even on a Thursday night every table was taken so a reservation is a must! The service was top notch - the hostess asked us if we were celebrating any special occasion and went above and beyond explaining the menu since it was our first time dining there. Our waitress was incredibly friendly and knowledgeable about the menu. I loved the bamboo backdrop, fun wallpaper, and dim lighting - perfect ambience for a girls night out or romantic date.I tried the Picaflor cocktail - it was so refreshing and a great accompaniment to the food that was to come. We started off with two appetizers - the crispy lettuce wraps and the veggie spring rolls. Both were tasty but the texture of the lettuce wraps was truly unique. Now onto the entrees - we wanted to try a few different things so ordered the sweet chili salmon & the chicken curry (which the chef split into two separate bowls for us). The salmon was perfectly cooked and seasoned, the chicken curry just spicy enough (took most of it home because had way too much food)! I can't wait to dine again at Bida Manda and try some of the other menu stand-outs like the Papaya Salad, Pork Belly Soup, & Ginger Pork Ribs."], ["Jay P.", "We were visiting friends in Clayton NC and they decided we needed to give this restaurant a try.We had reservations, which we were told were hard to get, so we were seated straight away. The hostess was extremely friendly and took the time to answer our many questions and to also make a few drinks and menu recommendations. Drinks were ordered and all were fabulous. We ordered the Crispy Spring Rolls and the Chicken wings for appetizers and both were great. We really liked the side sauces included to both dishes, as they helped to embellish the tastes!For our entrees, I had the Green Papaya Salad, which was not really a salad, but much more. Mine came with slices of perfectly prepared Glazed Duck and it was possibly the best food on the table. My wife went for the Pad Thai, which she said was good but not quite spicy enough.Our friends had the Basil Stir-Fry and the Crispy Pork Belly Soup, both looked yummy, but were gone so fast that I did not get to taste them.We did not have dessert but our friends vowed to try it soon.The stay with our friends was wonderful, the food at this restaurant was great, so our over-all experience was very positive.Great work!"], ["Brittany G.", "The soup. Trust me, get the soup. So good. Came to Bida Manda for a work meeting and experienced great service, a very cool atmosphere and the best soup I have ever had (the Crispy Pork Belly soup!). For the price the portion was HUGE, so much so that I still had 3/4 of the bowl when I had to bow out. The veggies were fresh and the spice level wasn't too bad for a weakling like me. The only (tiny) gripe I had was the actual pork belly in the soup was pretty hard and surprised me when I bit down on it. It kind of reminded me of fat back rather than actual pork belly. I know the dish states 'crispy pork belly' but it was more like crunchy. But despite this the soup, and Bida Manda as a whole, was still pretty amazing!"], ["Reggie S.", "So i gotta say all the hype for this resturant MIGHT have been worth it. My dinner club had a TWO (2) MONTH wait. Let that soak in. Did it marinate? Now this is in Raleigh, NC, NOT NYC or SFO. With that said, i thoroughly enjoyed the appetizers and the PORK BELLY SOUP! You might be thinking, who has soup for dinner, and pays $20 for it? After having it, i'd pay that for lunch!! There were so many layers of complexity to this dish but it all went together, the bean sprouts, red cabbage, red curry, coconut and pork belly as well as little bits of pork & rice noodles were phenominal. Out of the 6 of us, 5 got the soup. 1 got the ribs which looked really good, but didnt trump the soup. Hands down, best soup i've ever had. Wish a to go portion would last, but the reheat would do it no justice. Dessert menu wasn't appetizing. Bida Manda, for the food, 5 stars. Decor, 3.5. But yes, i'd recommend a visit if you dont have to wait 2 months."], ["Caesar E.", "This restaurant deserves the 4.5 star rating.  The service is great, the food is amazing, and the ambience is very good.  The Green Papaya Salad with Chillean Sea Bass was perfectly prepared.  The Pork Sausage app was tasty and the Shrimp chips are yummy.  Make sure you make a reservation because the place full even on week days.  Enjoy!"], ["Jami C.", "I can't get enough of this place. Everything about it is to die for: the ambiance, the service, the menu, the drinks, the lighting, the desserts and the specials. I have only been here twice and it has quickly become one of my favorite downtown Raleigh hotspots to grab a bite to eat.Menu recommendations: Spring rolls and the papaya salad."], ["Amy H.", "Best restaurant in Raleigh and we're very privileged to have it. Lao restaurants are rare and most are on the west coast. A friend if mine in DC recently told me that they just got their first also restaurant so we've beaten a lot of much larger cities with this one. Now, I've never been to Laos so I can't make a comment on the food's authenticity but I can say it's absolutely delicious.The food on the menu is similar to this food in many ways. They offer curries, larb and papaya salad, for example. However, they also offer dishes I've never seen before (Lao sausage, the oft mentioned pork belly soup) and I feel like the spices are slightly different than this spices (both the larb and the papaya salad are spicier and better than what I've had at most thai restaurants). The papaya salad with dill trout is my go to dish. The combination of dill plus spicy pepper is unexpected and amazingly complex. The beef larb is amazing too. despite the upscale atmosphere, Bida Manda is actually a really good value. Yeah it's more expensive for dinner than standard take out thai but the portions are large and the quality is top notch. For lunch, this place is a steal. They have almost all of the same items for lunch as they do dinner just in slightly smaller portions and most of the lunch entrees are under 10 dollars!Since this place is so great, you do typically have to make reservations for dinner, even on week nights. Make them in advance too or you'll be eating at 10 o clock at night! If you do wind up having to take an off peak hour dinner reservation though, I can assure you the food is worth the wait!"], ["Kate C.", "I love Bida Manda. I can't believe I haven't already written a review.  Just go.  Trust me.  Order anything, and be happy.  Everything on the menu is great.  My favorites are the rice lettuce wrap appetizer and pork belly soup or papaya salad entree (it's not really a salad, but instead a protein of your choice, sticky rice and papaya salad).  Great drinks too.  And double points for good house wine.  Love the feel of the restaurant.  Service is always top notch.  Have been here at least a dozen times, and always left happy and full.  Great date night, girls night, or heck even taken my parents and they love it too."], ["Anthony G.", "I wish BM had a yearly food pass that I could use daily to feed my heart and soul. I've been coming to this magnificent epicurean heaven for almost 5 years now and I come for lunch yearly on my birthday. I love this food because it's not only crazy tasty but local and fresh. The spring rolls are crispy and filled with divinity. I love the Papaya Salad with any of the marvelous items it comes with, I've had it with just about everything except a man, which it does not come with. But who needs a man when you have a Bida MAN-da! Come and enjoy this sometimes loud but always happy love from Laos!"], ["Michael S.", "The food is absolutely stellar. There were so many very good options on the menu it was almost difficult to choose what to eat.The pork spring rolls were fantastic, and the sweet Thai chili salmon was one of the best dishes I've had in years. Their atmosphere is fun, yet quaint... and the service was excellent."], ["Asad Ullah N.", "I've been here a couple of times, and this is a rare gen in Raleigh. The food is absolutely spot-on phenomenal, and never disappoint. I've had their Papaya Salad, their Baked Whole Red Snapper, their Sweet Chilli Salmon and their Pad Thai in the past. All of them have been absolutely delicious. But what I had this time round was what prompted me to write this review: Manda's Herb SaladOMG, where do I begin? The most silky fragrant salad I've ever tasted (and I'm currently counting my calories, so I've had a lot of salads). The waiter recommended the Papaya Salad, but I wanted to have something different, so I went with this. Everything about this dish was just perfect. Dressing was served on the side, which I liked since I wouldnt have liked a lot of dressing on this salad anyway. The herbs provided a refreshing and light taste to the salad, the spring rolls were yummy, as was the crusty eggplant. The lettuce, though simple iceberg, was elevated when paired with the vermicelli noodles and the fish sauce and peanut dressing. All in all, 10/10.Please dont anger the food gods by not eating here if passing through Raleigh. Please don't."], ["Aida L.", "BEST Raleigh restaurantWhite people spicy? NO!Lao food like Thai foodVery fantastic food and amazing bar service. The bartender who doubled as our waitress was one of the best waitresses I've come across at a place that is by no means Michelin rated. (Although it totally should be just considering the food.)Get the coconut curry chicken wings, the pork belly noodles, and the sweet purple sticky rice with coconut milk. Wow everything was so flavorful and absolutely amazing. They were booked solid the entire weekend and we were only able to get in because we sat at the bar."], ["Justin H.", "Love it! Keeping with the other reviews here - Bida is great! As the reviews show, everyone else agrees with me so you definitely need a reservation several days out. I booked a Friday night reservation over a week in advance and they only had 9pm available!My wife and I came here for the first time on her birthday. This was also the night of the St. Patrick's Day parade ON THE SAME STREET! For that reason, parking and wading through all the drunks took awhile but once inside, it was peaceful and nice. As I said above, our reservation was for 9pm and I called every day to see if someone canceled an earlier reservation. Finally, the day of, we got a 730pm spot!Wait staff was attentive and super friendly. We took our time ordering and really enjoyed it.Drinks - best way to kick off dinner! I had the Marlon - it's pretty manly! They make strong drinks here so if you're ready for some hair on your chest, this is it. I'm a beer lover so I also had the Brewer's Old Fashioned and it was ok. Also will put hair on your chest!Appetizer - Had the crispy rice lettuce wrap at the recommendation of the waiter and it was glorious! Absolutely recommend!Entree - Settled on the Basil Stir Fry. It was good but by the end I was sweating. I'm ok with a little heat but this escalated quickly. Wife had the beef larb which was really good. If I came back I'd get that or the Pad Thai.Overall, definitely would come back again, just try something different. It earned 5 stars because the environment and staff more than made up for the couple of things I'd change about my order."], ["Stephanie H.", "Bida Manda, you have won me over.  My husband and I came Saturday for my birthday dinner which was super exciting because this has been bookmarked for a year as one of my top spots to check out.  We arrived at 7:30 for our reservation (which is a must - this place was packed from the minute we came in until the minute we left) and were seated immediately.  Our waiter arrived shortly after we were seated to bring water and take our drink orders.  I had the pear cocktail (I can't think of the name) which I thought was delicious.  Not too boozy, not too sweet - the perfect balance of alcohol and house made pear syrup, quite refreshing!  My husband and I settled on the crispy rice wraps as an appetizer and enjoyed sipping our drinks and the shrimp chips that were brought out prior to the appetizer.Onto the food - first, the shrimp chips were amazing.  Cilantro on top which set off the crunch and flavor nicely.  The lettuce wraps were amazing, I could've just eaten the filling alone with the peanut sauce, that's how amazing they tasted.  The lettuce gave a nice crunch and of course held the filling together well.  DEFINITELY need to try these if you're at Bida.  I ordered the beef larb as my entree which was also amazing.  The sticky rice, beef, and skewered veggies were so perfect together.  The portion was great - not huge, but with the shrimp chips and appetizer, I had to bring about 1/3 of my dinner home.  During dinner, I ordered a thai tea which was amazing and with the homemade coconut milk, was probably the best thai tea I've ever had.Overall summary:*ease of scoring a reservation prior to 9pm - tricky.  Plan ahead.*service - excellent.  Casey was an amazing server who took care of us and gave perfect recommendations.*ambiance - romantic, hip, somewhere between casual and dressy, but not snooty*food - YES.  Just yes.  Bursting with flavor, fresh ingredients, very well executed*drinks - they don't skimp on the alcohol, so be prepared.  Not overly boozy, but not primarily syrup either.  Unique cocktails that are delicious.*will we return? absolutely!"], ["Sarah W.", "So damn good.  Everything.  One of those places you could ask the waiter to \"suprise me\" when you order and not be disappointed"], ["Patrick F.", "Went there for lunch the other day.  Food was delicious.  Had the papaya salad and ginger beef.  I would have given it 5 stars, but the portions were small.  Plan to try dinner one night soon!  Would recommend!"], ["Jim O.", "Everything about this dinner was a fantastic experience. Our waitress Beth was absolutely terrific. She had an exceptional knowledge of the menu and provided many excellent recommendations.  The cocktails were in the inventfully designed and very tasty. We ordered a wide selection of appetizers and found one to be better than the next. I decided on the whole red snapper and it was exquisite. This was my first time in this restaurant and in fact my first time in Raleigh or even North Carolina but if travels take me back this way I will absolutely return."], ["Solange C.", "Fabulous food. Excellent mix of herbs and spices with a delicate touch. The best chicken coconut soup I've ever had--authentic, rich Ripken stock as the base, the Anaheim stuffed peppers freshly flavored with some gorgeous spice/herb I dont know what, the green papaya salad already mentioned in other reviews, to die for.The bar service is great. The drinks taste good--but beware, they put cheap vodka in expensive bottles and call it premium. I had 3 different vodkas straight up--they all tasted the same and were terrible. DONT PAY FOR THE UPCHARGE FOR PREMIUM LIQUOR!"], ["Jonathan G.", "The food was good and the vibe was great. It is great seeing more and more places like this pop up and excel in downtown Raleigh. We started off with two appetizers, the Crispy Rice Lettuce Wraps and the Spring Rolls with ground pork then shared the Cashew Ginger Chicken and Sweet Chili Salmon. We both preferred the spring rolls as and the salmon. The lettuce wraps were good but we have both had far better and the ginger chicken tasted like something you can find at most decent Chinese restaurants. The salmon on the other hand was some of the best we have had in the triangle! We skipped on dessert  in favor of a few cocktails; we tried the Picaflor and the recommended wine they had on special. The wine was good and fairly priced however the specialty cocktail was meh..."], ["Farah K.", "There is nothing bad I can say about this place. It is one of my favorites in Raleigh!! The beef larb (minus all the extra things that go in it) and the papaya salad are absolutely delicious. There is so much flavor and spice. Their trio dessert is always a good way to the end the meal so that you can try a little of everything! The palate cleanser at the end is also such a nice touch. The ambiance is so trendy and perfect for a date or a girls night out!"], ["George F.", "We finally tried this place for lunch today. Wow! What quality for the price!The menu is filled with authentic but approachable dishes. We started with the fresh spring roll with shrimp. They slice and serve it to look like sushi which looks great but can be a little more awkward to pick up. Very tasty though.I had the Pad Thai which was awesome. Great flavors. My wife and son had a couple of chicken based dishes that they loved. And my youngest, who isn't very adventurous at times, had the chicken wing app with coconut curry sauce. She loved them.The atmosphere and service were great to but I'd have put up with just about anything for that food. What a meal. We'll be back!"], ["Janni J.", "I am a part of a dinner club, each month we try a restaurant we haven't tried in search of the best food in Raleigh. This month was Bida Manda. We've been anticipating this one for 2 months so our bar and expectations were raised high. We started with the lettuce wraps and summer rolls. Both were very good! I'd recommend them to anyone. We usually ask the server for a recommendation because they're usually pretty accurate. He just kept saying, \"Get the soup.\" We would ask about other items, which looked incredible as they passed our table but clearly the soup was the star. I'll jump to it, the Crispy Pork Belly Soup was SO RIDICULOUS.  The only thing I could think of while I was eating it was, \"I am so happy.\" So my take-away from Bida Manda was GET THE SOUP! Just get it. Seriously, get it."], ["Grace L.", "Definitely one of the best \"eats\"in Raleigh. The pork belly noodle soup was amazing.  And the green papaya salad with duck was delicious. My colleague and I ordered 6 different dishes and enjoyed everything. Will definitely stop by the next time I am in Raleigh!! I can't stop thinking about  last night!"], ["Corey H.", "Sit at the bar, let them make your drink to their desire and snack on the lettuce wraps."], ["Lindsay H.", "Bida Manda is a great place for either a date or a group dinner. Also good for cocktails and appetizers at the bar.I highly recommend the crispy pork belly soup. I've gotten it several times I've eaten there and it is just unbelievable. Plus, it is a massive portion and you will have plenty to take home for lunch the next day. We also enjoyed the pork spring rolls and the caramelized ginger pork ribs. The sweet chili salmon and green papaya salad with duck were also incredible. Definitely want to come back and try their pad Thai.Overall, would highly recommend Bida Manda especially if you like Asian food or like to try new things - it's not average by any means."], ["Aaks L.", "Third time visiting this place, and now I know for sure this place rocks!Made reservations on yelp (people who constantly complain this place is \"too full\", make a reservation!) and were seated promptly on arrival. Different servers everytime, all of them not only very attentive but also make recommendations on everything (appetizers, drinks, entrees, how spicy to order, etc) because they've tried almost everything on the menu. For me, that's a big plus!I recommend the following (in given order): Crispy Pork Belly Soup, Green Papaya Salad, Caramelized Ginger Pork Ribs, Beef Larb, Amphone's Chicken Curry and Pumpkin Curry.Drinks menu changes often and has lot of great options. Their Fall 2014 cocktail menu has my new fav - bourbon with grapefruit - a twist to a bourbon based cocktail.Love the citrusy cleanse they give towards the end. Much needed!"], ["Drew  R.", "Delicious!!! Went here for a date night with the Fiancee, it was amazing. The food was wonderful. We started with some apps. The crispy rice lettuce wraps are outstanding. I had a special that was a whole fish that I loved, and we shared a dessert that was the best sticky rice (one of my favorites) I have ever had! Btw, make a reservation or you will be waiting a long time, but what do you expect if it is a great restaurant in downtown Raleigh."], ["Camey S.", "Coming from DC where I love trying new cuisine and can appreciate a wonderfully whimsical experience with my meal, I visited Raleigh and came across this place, naturally I was interested in trying Laotian and dragging my bestie out to downtown Raleigh. With a steal of a deal with their price point being $$ and great reviews on yelp to start, I had a good feeling about this place. && Bida Manda was truly amazing. We didn't have reservations because we decided spur of the moment, lucky for us they had some bar seating available, but I'd definitely recommend getting one to ensure you can eat here. To start out they bring you some shrimp chips with are nice to snack on and still light.Start with the crispy lettuce wraps, use the sauce and be careful of the Thai chilies. They are flavorful, have a great crunchy texture with the sweet sauce and crisp lettuce, the perfect way to start your meal here. For entrees, if you're just starting out with Asian fusion, I'd recommend the stir-fry cashew ginger chicken, it tastes delicious but is still safe. I got the caramelized ginger pork ribs which were absolutely scrumptious. They were fall of the bone, saucy, and filling! You pretty much get a whole rack of ribs, a generous amount of rice, grilled asparagus and yummy boiled egg that's flavored with the ginger sauce. So good! If you want a nice cocktail to round out your meal, don't be afraid to ask for a recommendation! I told them I liked mojitos, but wanted something seasonal, I got a refreshing blackberry and lime drink and loved it! My friend was so glad that I made her come here, we left thoroughly pleased, bellies satisfied and knowing we'd be back! Check it out !"], ["Jennifer S.", "Best Asian food I've ever had!  We live in Mebane, so it's an hour drive for us to Raleigh.   My husband tried this place once with a friend and raved about it, so on our way home from the beach today, I figured we could stop for a late lunch.I got the Shrimp Pad Thai and my husband got the Cashew Ginger Chicken.  We also tried the spring rolls, wings and chicken fried rice (our kids got the wings and fried rice).   The chicken fried rice was the best that I ever had (my 4 year old wasn't a fan of it, but this isn't really a place for kids).  The spring rolls were amazing (we got the pork ones).  Even my 10 year old liked the spring rolls.    I was shocked at how reasonably priced the menu was for lunch.   I wish we didn't live so far away...I'll definitely make the trip again for this food though.  It's well worth the hour drive!"], ["Jennifer M.", "Had a business meeting here and ordered the cashew chicken.  Service was prompt and attentive, portions were just right and the espresso shot at the end made the experience that more special. Everything was spot on and the owner was visible the entire time- checking on guests, giving a hand when needed, excellent experience."], ["Courtney H.", "Amazing food, reasonable pricing. Love the ambience; highly suggest a reservation in advance because it is very popular!!! I had the saffron crepe and it was amazing!!! The husband had the pad Thai which was also great! It was not spicy (hot spicy) at all, which is good if you're not a spicy food lover. It was very flavorful. Highly recommend for a romantic night out!"], ["Samson R.", "My mind is blown right now. Like head seriously hurting from the explosions that this food just put my mouth through. Crispy rice lettuce wraps, ginger braised ribs, and papaya salad with Chilean Sea Bass... Amazing!"], ["A C.", "This place is nice. Casually upscale. I sat at the bar and was helped by their nice staff. I ordered the pork belly soup and the honey bourbon old fashioned. While you wait they give you shrimp chips. I have an irrational love for them. They don't taste like shrimp. Or really anything but I love em. The pork belly soup was very nice. It's like a laksa or a light coconut curry soup if you don't know what that is. At first I wished there was more pork belly but there's actually a few hidden pieces in the soup that are a nice surprise. I also got dessert. I wanted the purple sticky rice with mangos but they apparently don't serve it with mango anymore. So I got the trio instead. I enjoyed the creme brûlée, custard then apricot in that order. I also didn't finish it as I just wanted to taste them and asked to have them boxed. They accidentally threw it out so they made me new ones. I can get used to this southern hospitality y'all!Last thing - the bartender recognized someone from what seems her personal life (meaning not just a regular to the place) and she goes \"hey what're you doing here!\" Guy:\"I'm having dinner with my mom. What're you doing here??\"  Um...weird question clearly she's working!  Which was her response as well. Haha"], ["Stephanie B.", "Finally got to check this place out for date night. Had an 8:00 reservation, weren't seated until 8:20. Got drinks (the Alpine '76 was delicious) and ordered the crab cakes pretty immediately upon sitting down. At 8:45, we ordered entrees. Crab cakes came out in a timely manner, and while really good with the panang sauce, they were SO small - silver dollar small. Two of them. Well, glad we had massive dishes coming. Maybe..... At 9:15 we had no entrees yet. We got a lot of \"I promise they'll be out soon!\" from our pretty attentive server. We tried the ol' someone-use-the-bathroom trick three times. It finally worked and we got our meals. I ordered the pork belly soup, which was a ginormous bowl of perfectly spiced rice noodles and red onion and some ground beef, but verrrrry disappointingly little pork belly,  four bites to be exact. It was a very expensive bowl of really good coconut broth. Seriously, don't get me wrong, I LOVED the dish- but won't ever pay $17 for it again. Husband got the ginger pork ribs which he really enjoyed, but the rice was nothing special and the asparagus was very undercooked. All in all, glad we went, food was pretty good, but will we rush back? Probably not."], ["Richard M.", "Was in town for business, found this little gem. Came 5 min before lunch and there was already a queue. Great service and great food. Couldn't fault anything!"], ["Kimberly L.", "I'm not going to lie.  With all the raving reviews, I had extremely high hopes for Bida Manda, which might explain why I was so incredibly disappointed. I came in during restaurant week, but I wasn't absolutely ravenous, so I settled for the papaya salad on the original menu.  What I normally love about papaya salad is the complexity in flavor--the fishiness in the sauce balanced out by the sourness of the citrus, the sweetness of palm sugar, and the spice.  The papaya also needs to be extremely fresh, crunchy, and crisp as the salad is a playful party of flavors as well as textures. Coming from Southern California and a Southeast Asian background, I have pretty high expectations for papaya salad, simply because I've had my fair share of the dish.  I honestly believe that you could judge the quality of a Southeast Asian restaurant by the quality of their papaya salad--that may be a slight exaggeration brinking on ridiculousness, but it's something I truly believe in.  Some of my favorite restaurants in Los Angeles for Thai and Laotian food produce some of the best papaya salads, and Bida Manda just didn't compare.  The papaya salad fell extremely flat, the portion rather small, and the dish was simply one dimensional.  Had the price point been lower, I may have been less disappointed and slightly more satisfied, but the quality of the dish didn't come close to reflecting what you pay.  The same could be said about the \"pho\" dish.  The dish lacked the complexity and layers of flavor that I usually love in Southeast Asian cuisine.  It was extremely frustrating.  I wanted to love Bida Manda--I truly did, but it just wasn't for me; however, I could see the appeal.  If you have high standards for Southeast Asian food, however, I'd recommend that you find another restaurant."], ["Eric M.", "One of my favorite places in Raleigh. Fresh, delicious, and not your average Thai spot. I love everything I've ever had here."], ["Britnie J.", "Since I'm moving to Raleigh in a few weeks I had to check out the food scene. I  Looked up Raleigh's number one restaurant and Bida Manda came up and boy am I glad it did!  They squeezed us in for a reservation at 10:30 on Friday night.  I've never had Laotian food but I've been Thailand and love Thai food.  It's very comparable to that.  The service and food were beyond great.  We ordered the pork belly soup, ribs, and soft shell crabs.  When they say try the pork belly soup, you try the pork belly soup!! It was damn delicious.  The man I assume is the owner was so friendly.  He checked on us a few times. He was hugging everyone that came in the door.  You could tell he truly cares about his business and customers.  I can't wait to take my out of town guests here to blow their mind!!"], ["Christina C.", "My FAVORITE restaurant in North Carolina!! I can't say enough good things about this place...I have never had a bad experience! The food is absolutely amazing. If you like Thai food, you'll love Laotian food too! And for those that aren't as adventurous...there are simpler entrees on the menu too like fish or ribs. I love the green papaya salad!! I usually get it with chicken. Medium spicy is very spicy to me and I love spicy foods...so beware if you go above that. I've also tried the curry which is another of my favorites! Even the appetizer shrimp chips are delicious and something different which I love. The service has always been on point...very friendly staff. The owners (brother/sister team) are often in the restaurant making sure everything is going well with the customers. And I have to say something about the decor...so adorable! I love the wood and paintings of Laos. I appreciate the small details like fresh flowers on the tables and vintage-y plates/napkins. Also for you gluten free folks...There are gluten free options marked on the menu!! I have never gotten sick here (Celiac) and I've been about 4 times. Plenty of gf options too so you can feel included. They even brought me gf dessert when I came for my birthday! Seriously...my favorite place! :-)"], ["Andre B.", "Bida Manda definitely came with some high expectations based on the online reviews. Also, the fact that we could only get a late reservation proves that it's a popular place. We were quickly seated and the service was good to great for the most part. Our server was very knowledgeable with the menu from top to bottom and made great suggestions for us.We wanted  a quick appetizer of panang crab cakes along with our drinks. Our server warned us that the crab cakes were on the smaller side and they were, but also definitely tasty with a small amount of pickle carrots/veggie mixture as a garnish. For drinks, the wife went with the standard piña colada, and I went with the bitter goodness of the crom. The drinks were good, but I'm definitely not a piña colada guy.On to the food, everything looked good on the menu, but I was pretty dead set on getting the larb from the get go. I went with the duck and duck parts options. Laos spicy please and yes it was but nothing crazy spicy like I'm going to feel it the next day spicy. Depending, I might do double Laos spicy next time. Anyway, the wife got one of their best sellers, the green papaya salad. She got the one with the trout. I tried a little bit of it and the trout was very well cooked. She really enjoyed her dish and at a medium spicy level.Onto dessert, which was a continuation of great food. The wife got a purple rice with a coconut cream type of dessert. She loved it, but having tasted it, like the piña colada, it's clearly not my jam. My trio of pumpkin creme brûlée, apricot cake and well I'm not sure what the third one was but they were all good. I particularly like the apricot one.All in all a great meal, I'm giving it a 4 star for now but will return at my next convenience and it will very likely be bumped to a 5 star."], ["Anil O.", "Great ambiance, perfect service and delicious food. I sat at the bar and enjoyed watching the bartenders prepare interesting cocktails too. Started with the salad with a peanut vinaigrette and had the Shrimp Pad Thai. Very good sauce, not too overwhelming and perfectly cooked shrimp. Always a good indication of a good Thai restaurant in my opinion. I am sure I will be back."], ["Holly K.", "I received the best customer service here of anywhere in Raleigh so please understand they have that on lock, however I found my food very unpalatable. It was some type of curry cauliflower combination and had not been with a group of people I would have sent it back."], ["Ana N.", "Awesome wine selection and food. We went during restaurant week and had a great experience. I wish they were a little less expensive but it was still worth it. The service was amazing."], ["Alex A.", "It feels like you're sitting in a Laotian family dining room. The experience is remarkable from start to finish. While all the staff is cream of the crop, having Cliff as your waiter elevates your experience to 5star quality. He can literally sell you on anything the menu offers...The crispy lettuce wraps are an absolute must. If you aren't completely famished, I recommend family style, which is very doable there."], ["Connie W.", "I've only ever heard positive things about Bida Manda and there's a reason why. I've come here a few times and have tried the papaya salad with duck, pork belly soup, crispy lettuce app (MUST HAVE), and the caipirinha, a Brazilian drink that tastes like fresh squeezed limeade. All of it has been delicious! The papaya salad compares to the papaya salad I've had in Thailand. Decor and atmosphere is wonderful for a nice dinner with friends or a date night. You can tell that a lot of thought was put into the concept of the restaurant from the menus to the bathroom decor. The reason why I'm giving it 4 stars is because its near impossible to get a reservation during normal dinner hours on weekends. We had to book our reservation at 5:00pm on a weekend because there were no later times available... but when we got there, we noticed many open tables up until about 6:30. We wondered if they had blocked off later times and opened reservations at earlier times to fill up tables. Nonetheless, its worth coming back to again and again!"], ["Jamie W.", "Had a reservation for 8, got seated right on time. Place is VERY busy would Def make a reservation, also a bit loud. Would rec the pork spring rolls and crab cakes, the spring roll sauce was delicious!They bring out some type of rice chips while you wait, eat them! They don't look good, but they are!I had the chicken pad Thai , amazing g, and you get alot of it, two hungry people could share itHusband had ginger cashew chicken, was ok, wouldn't order it ahain, pretty plain, and watery.Service would be our complaint, our original waitress never checked on our satisfaction, or ro replenish our drinks."], ["Jeremy A.", "Ive been to Bida Manda a few times now and its still tops in the city for me due to the awesome food and dining experience they provide here. The Duck Larb is what I would recommend as its what I have gotten both times I have visited. If you go for Lao spice its pretty damn hot so just be warned. The pork belly soup is incredible here and I would have confidence ordering anything on the menu. Service is always great and definitely get a reservation even if you think youre going on a weeknight and wont need one. Thats what we did the second time we went and ended up waiting for like 30 min on a tuesday. Parking is usually available on the street right in front or you can park in the garage across the street from Marbles."], ["David C.", "We went for lunch and were seated very quickly. The waiter took our drink orders fast and he recommended the pork belly soup. It sounded just odd enough so I went for it. It was so good!  The pork belly was crispy and crunchy and the serving size was huge. It's a little spicy but just enough for good flavor. We also got vegetarian Pad Thai. It was flavorful and filling. We got the summer wraps and they are good but the peanut sauce they serve with it is fantastic. Like good enough to drink good. After the really good lunch we asked for the check and they brought 2 small shot glasses of Laotian coffee that were out of this world!Lots of good choices for vegetarians and carnivores alike!"], ["Danielle H.", "In the midst of our relocation Bida Manda was the first raleigh dining experience my husband and I had and it was a great one! From the ambiance to the drinks to the food and the cute little after dinner cocktail shot they provide - it was superb. The decor won me over as I am quite the ambiance type of gal! But stellar food accompanied by great ambiance is a home run in my book! We had the spring rolls for appetizers, my personal request of Gin, lemonade and violet for cocktail and pork belly soup! It was a rainy night and therefore probably drove home the  comfort the soup brought my belly! All in all this has to be one of my favorites restaurants across the nation. #hancockhelping we will be back for sure!"], ["DY H.", "Three of us went on a Friday evening although we were not able to get a reservation. We were told that the wait would be 1.5 hrs, but it really was less than 1 hr. The place is right across from Moore Square, so it's in a primo spot. We were able to walk around downtown while we were waiting, so the time went by quickly.The dining room is not large, but there was plenty of room between tables. The lighting was a bit dark, so I am a bit embarrassed that I had to use the flashlight on my phone to read the menu. Otherwise, the atmosphere was friendly and casual. It also looked like quite a few of the tables were celebrating birthdays.We ordered the crispy lettuce wraps as an appetizer. This is a vegetarian dish that was quite tasty. The lettuce leaves were shaped perfectly to hold the mildly seasoned vegetable mixture. We were also served a basket of shrimp chips -- one my childhood favorite snacks! I also ordered a cocktail -- like a tropical margarita. It was not strong at all... a bit on the watery side.For our main course, we ordered 2 kinds of larb (duck and beef)-- meat cooked with a spicy citrus marinade, and a papaya salad with grilled Chilean Sea Bass. We asked for medium spiciness, which according to our waiter was spicier than standard \"medium spicy\". The papaya salad with the fish was delicious! The fish was perfectly cooked and seasoned. It was my favorite dish of the bunch. Both of the larb dishes were also tasty, but the \"medium\" spiciness was quite a bit more spicy than what we expected... even with the waiter's warning! i can eat pretty spicy food, and this was even a bit much for me. The fish/papaya salad were not as spicy. We were able to get a glass of milk and a glass of coconut milk/soda water combo to help cut the spice, as we had to wimp out. For desert, they brought us a dessert plate, because yes, we were celebrating a birthday too! It had 3 desserts -- coconut custard, creme brulee, and a tamarind cobbler. They were all very good!The service was okay -- not excellent/not terrible. I think our waiter must have been new-ish. He had difficulty describing the specials for the evening, although he was right to recommend the sea bass (which I typically don't order because of fishing sustainability). It was a moment of weakness. But a tasty one."], ["Allie J.", "I have never had a bad experience here. The servers are knowledgeable and friendly. The drinks are creative and tasty. Oh and the food is amazing. Admittedly I haven't tried as much of the menu as I would like because once I tried the papaya salad I was hooked. It's the perfect blend of crunch with a juicy sweetness and spice to your liking and a flavorful protein. It's a struggle every time I go to order something else when I know how delicious the papaya salad is :)"], ["Paul W.", "A nice-looking downtown restaurant.Service was prompt and okay. We tried five entrees from the duck to ribs to chicken pad Thai. Nothing special. Maybe it's among the better options in Raleigh, but I don't think this place would thrive in a bigger city given food quality. Mediocre."], ["Vida D.", "The food at this restaurant is amazing! The decor and ambience are fabulous!Unfortunately, it's dinner availability and seating policies are tricky. You must make a reservation ahead of time--this INCLUDES seating at the bar. If not, expect about a 90 minute wait."], ["Harrison H.", "I love coming here, it's a great atmosphere for a date night or just catching up with a friend! The servers are all so nice and very helpful. I have not tasted anything here that I have not loved. Like the pork belly soup!! (Its to die for!) The specialty cocktails are all really good too if you are of the legal drinking age.I could write a lengthy review for this place but it would just be wasting your time, you need to try it for yourself! I promise you will love anything you order!"], ["Annie G.", "So glad we took Yelp! and our friend's suggestions and checked out Bida Manda! You know you are in for an experience just walking into this place! The decor is gorgeous and the place is pretty small so it can feel somewhat intimate. For apps:Crab cakes- they were okay, full of crab meat and had some curry but were lacking a bit and could have used a sauce.Crispy lettuce wraps- my favorite part of the night! Soooo amazing and nothing you expect! The spicy sauce was great and the texture was were it was at!! These are a MUST!Homemade sausage special- Wow! These were so fresh and delicious and full of  chopped herbs! Quite spectacular!For our entrees:Green mango salad with pork neck- Very delicious, but I got medium spicy and it wasn't spicy AT ALL! The waitress said that sometimes the peppers are hotter on some days and that is true so she brought me some chili oil and chili paste and that took it to a whole new level! The pork neck was cooked perfectly and very tender. The serve it with sticky rice that you are suppose to smoosh into the shape of a disk and scoop up green papaya with. I decided on a fork since I was all dressed up.Pork belly soup- My husband was deciding between this and the pho and said he made the right choice. It was a huge portion and extremely flavorful! It has a coconut milk base as compared to the clear broth of pho. My husband said he would probably never try the pho there now because he tried this soup. He tends to stick with something he loves... like me I guess :)After our meal we got served a digestif of lime and strawberry that was very refreshing.Can't wait to go back and try some other disheds like the larb!"], ["Sarah M.", "I was craving Pho and this was the only place that came up in my search. I was not disappointed! Amazing Pho! I love that with Pho,  I can control the flavors I want with basil, lime and different sauces. But the key to good Pho is a good beef and a good broth. Bida M does it right and this will be my new go-to."]]}