{"Bamboo 7 Asian Cuisine": [["Chris D.", "(7/5/13) Well well well Bamboo 7 is actually full of people. I guess that July 5th is a popular evening for Chinese food. Anyway I ordered fried tofu, pork fried dumplings,  an egg roll and white corn bisque. I'm having moo shu beef as my main course. Gingerale is the drink of choice since lemonade isn't offered anymore. I really appreciate Anna's flair for presentation both in having the Moo Shu Beef made for me & also rolling it up into egg roll skins. As always it was a very flavorful & enjoyable meal."], ["Anthony C.", "This Chinese place is so so so clean I love it. The food has a very very fresh taste. The attention is beyond awesome must try it out."], ["Megan A.", "This place had good reviews so we tried it , it got busy but u could hear the phone ring every five seconds so I cod see this being a take out only place . I love Chinese and this place was not good it was edible and that's all .. We will not be back"], ["Camden H.", "This our favorite delivery place, but they have a nice restaurant too. Very small but nice ambience. They are courteous, even when calling in an order near closing. They always get the order right and are fast. Large portion sizes with plenty of meat and veggies. We ordered for 4 the other night and got a free 2-liter, which was unexpected but nice. They pay attention to detail and add little touches like cucumber with shrimp sauce on the side when you order crab rangoon. Pad Thai is excellent. Fried rice has flavor. Fried veggie spring rolls are small but are perfectly crispy. Order plenty-you will want more! Crab rangoon is the best I've ever had. Prices may be a little higher than other delivery places, but the food definitely tastes better than most Chinese/Thai takeout. So glad we found this place!"], ["Michael S.", "Small place. Very rarely is there anyone in the dining room. But quick takeout. Very hot and fresh."], ["Chris L.", "I'm sure there are good entrees at this place, but when I look for Chinese food, I'm looking for a good deal on the lunch combos.  In this area, I feel like Bamboo 7 totally fails.  All you get is a small portion of whatever dish you have chosen and some rice with soy sauce.  To call it fried rice is an insult to fried rice.  Give me some veggies and egg in the rice at the very least!  No egg roll or spring roll included either, had to order these separate and pay extra."], ["Howling Mad Murdock M.", "Love this place.  Good food, service and atmosphere.  After a few visits, they know your order before you place it, which is cool.  The owner is really nice, and the staff is very attentive.  Highly recommned this place.  Nice little hidden gem in Ballantyne."], ["Jonathan T.", "I love this place!  I eat here often when I'm looking to get some Asian takeout.  The staff is always friendly and eager to help!The chicken fried rice and General Tso's chicken are favorites of mine.  Their lunch specials are cheap and tasty.  Two of my lunch favorites are the egg drop soup and the wonton soup.  Both are very cheap ($1.50 and $1.95, I think) and just down right good.I've had the Pad Thai here as well.  It's good but a little sweet for me sometimes.  I like my Pad Thai a little spicer, but it's still pretty good.  I give them a solid 4 stars for the entrees that I've had so far!"], ["Matt F.", "Best Chinese/Thai takeout in Ballantyne.  The owner, Anna, is always extremely friendly, will soon know you by name, and can tell you what your order is before you've even placed it!  We are lucky to have Bamboo 7 in walking distance because you can't beat the menu, the prices, and most importantly, the quality and flavor profiles.  Everything is super fresh!   It even offers a nice, intimate setting for dining-in and a more elegant menu of House Specialties that go well above and beyond typical Chinese takeout items.  We love this place."], ["Mila M.", "Hands down this is the BEST food. Everything was cooked perfectly, and their sauces are to die for. Portions are big and they don't skimp on any meat in their dishes. Their appetizers are amazing. And when we ordered a big takeout order they offered a free two-liter of soda. Definitely going back on a regular basis."], ["Jim B.", "this place is legit. I got the sesame chicken and it came with tons of chicken and fried rice. the place was clean and very quite. No doubt that i will be going back."], ["J B.", "Great service. Great for families.  Wonderful food."], ["C L.", "This is probably one of the better Asian restaurants in the area (and I've been to quite a few).  They offer a nice variety of Chinese, Vietnamese, and Japanese dishes.  They also have a good lunch menu at very reasonable prices for their quality, which is above-average compared to others in the area.  The restaurant is nice and clean so it's a nice place to dine in.  They also offer takeout and delivery, and at those prices, there's no reason to ever order from those fast food takeouts."], ["Jason L.", "Great food at great prices and yes they do deliver.  I just wish they would bring down the minimum order for delivery from $15 to $10.  Sometimes I just don't want that much food for lunch."]], "Baoding": [["Bill R.", "My wife and I had lunch at Baoding today, since we were in the Southpark area. We've eaten at Baoding before, but it has been a while. We've been in the habit of going to JoJo's for Chinese, but on our last visit to JoJo's there were a couple of disappointing changes to the lunch menu. (We are retired so tend to eat out at lunch more often than dinner).The setting at Baoding seems a little more upscale than JoJo's. Definitely more of a date spot. The staff was very pleasant, although quite busy. We both got the combination lunch with shrimp, beef and chicken. For sides, my wife got a spring roll and brown rice; I got the brown rice and fried won-tons. We both thought the food was very good and cooked just right, although it could have been hotter when it was served. I finished about half my meal. With two diet cokes the tab came to $22.xx after tax but before tip.I still think PF Chang's probably has the best Chinese food in Charlotte, although it is definitely overpriced, and the noise level is too high for me. Still, Baoding was a very enjoyable meal."], ["Christian R.", "Solid food.  Great for take out as they are very fast. Kind of expensive but good quality. Try the pork or chicken streamed dumplings."], ["Stephen C.", "Great food, fast service for a business lunch"], ["Jay H.", "This is the first restaurant I ate at in Charlotte 15 yrs ago. My new friends took me here and I've been going back since. I get the \"Shredded Szechuan Beef\" almost every time. It's a dinner item, but you can order it at lunch. The spring rolls are great as well as the fried crab stuffed wonton appetizer- my new favorite. I often have a business lunch here (reasonably priced lunch specials) and my wife and kids like it as well."], ["kat t.", "THE BEST Chinese in Charlotte.  Hands down.  Great service.  If you are thinking of going to PF Chang's...keep moving down the street to Sharon Corners.  Shopping center is difficult to get in and out of but it is worth it."], ["Bridget L.", "Took the family last night because many neighbors had suggested it for a meal. OK food, not too exceptional. Nice ambiance and service level was acceptable. Nothing about this restaurant made think \"I am glad I came here tonight\" Expensive food with medium taste profile. Not to return, I am afraid. We tried a sampling of spring role, velvet corn and chicken soup, fried crab won-tons, Asian beef & chicken, ginger shrimp, and pineapple chicken fried rice. 8 shrimp for $15+. Really enjoyed the Asian beef & chicken - good flavor. Crab won-tons tasted like only cream cheese and no crab. Velvet corn and chicken soup was tasty but needed lots of pepper."], ["Justine C.", "Since moving away from San Francisco my husband and I have kind of given up on getting good Chinese food, unless we are in NYC. We don't particularly mind though, and when one of us gets a craving we'll ask the other \"want to get some bad Chinese food?\". Sort of like how the movie Blue Lagoon is so awful it's loops around again and becomes enjoyable.Baoding is not bad. It doesn't make your heart race either. Prices are pretty spendy for what you get. We had soup for appetizers: Hot & Sour and Velvet Corn. Both were very ordinary but fine. For entrees we had Tangerine Beef, which could have been spicier. Also had Sauteed String Beans, which were nothing to write home about, just a big 'ole plate of beans.The service is where they set themselves apart. We were seated immediately on a busy Friday night. The atmosphere is comfy and dark with lots of booths for some privacy. Drink and food orders were taken promptly and food arrived swiftly.We had our normally darling toddler daughter with us who became An. Absolute. Nightmare. When she became too distracting to the other diners we asked for our food to be wrapped and the staff quickly got us sorted -- but not before our daughter smeared food on the wall mirror by our booth. Great, just great.Husband removed the kid from the premises as I tried to settle the bill and clean up the mess. The staff were gracious and complimentary of our kid, despite her behavior, and brushed it off when we tried to apologize. If we eat here again it will be as take-out!"], ["James W.", "We received the BEST service in all the restaurants I've been to in Charlotte, and I'm from here. My fiancé and I had the specials going on for that night and they were both very delicious and more than enough. This is now our favorite Asian restaurant."], ["Melanie E.", "I really like the inside of this restaurant & it's comfortable & cozy.  The food is consistent, but there are several things we like on the dinner menu that aren't on the lunch menu & that's a little frustrating because - well - because it's Chinese Food for pete's sake!  I will say that sometimes the waitstaff has been downright rude, but not always.  We walked out a few years ago when one guy just was a jerk, but we've gone back this year and the service is ok, but I still notice how the waiters are quick to either ignore you or give you a curt, slangy answer (nope - yeah - what).  It's just the men though, so maybe it's just a cultural thing?  I don't know.  In Southpark it's the only choice I know of."], ["Jean C.", "Delicious Chinese food!  I had the Trio of shrimp, scallops & chicken and all food was very fresh and wasn't salty like other Chinese restaurants.  The servers were very  polite and this was a wonderful experience and will definitely go back!"], ["Pourina R.", "After much anticipation, I finally made it out to Baoding...for lunch.I had the chef's special: Szechuan shrimp, chicken and beef with brown rice. It wasn't horrible, but it was bland. Very bland. I expected spicy as the description stated, but its about as spicy as a spicy chicken from Wendys. The baby corn in the dish tastes like it was just taken out of it's soaking liquid (or can) and thrown right in without being drained. It tasted very watery and has not absorbed any flavor from the gravy (and yes I know the corn won't absorb much flavor at all).Since this restaurant is highly praised, I just going to have to come back another time. Maybe for dinner and I'll just hope they won't disappoint me then too.  On the plus side though, my fortune says, \"You will inherit money and jewelry.\" Wait a second, hmm.... inherit? That isn't necessarily a good thing is it?"], ["Nazima M.", "Since half stars arent part of the rating system, I'll add that imaginary 1/2 in the written review :)  So, the usual drill:  In the area, lunchtime, we decide on Asian, look across to see Baoding, settled.They have attractive decor and I particularly liked the overhead drapery in royal purple.......elegant touch.  It was lunchtime so a lot of tables were occupied.  The menu was limiting in my opinion, they had 4 seafood choices, 4 chicken choices, 4 pork, 4 beef, and a couple apps and maybe 4 soups.  Perhaps the dinner menu is different and has more variety?I ordered the Firecracker Shrimp (xx spicy) and my lunch buddy ordered Garlic Shrimp and we decided to sample the Singaporean Noodles.  Entrees come with a choice of 2 crab rangoons or a spring roll.  Both dishes turned out to be delicious, not quite my spice level although I requested it, but still tasty.  They didnt skimp at all with the shrimp but they did with the vegetables and rice.  The mound of rice was so tiny, I barely got 5 bites out of it.  I would NOT suggest the noodles at all, they tasted funny and purfumey, left a horrible aftertaste.  The service was okay as the server seemed frighteningly bored --- probably preferred a day of golf instead :)I would eat here again, if Im in the area."], ["Rachel B.", "Tucked away behind Harpers, Baoding has a dark, modern decor which is inimate enough for two but accomodates a larger group as well with being too loud.People who mention the greatservice are not joking - our waiter was on top of our glasses and needs the entire meal.I ordered Spicy Pineapple Shrimp an asked that it be made extra spicy. What I got wasn't spicy enough for my tastes but it was absolutely delicious.My friend got a chicken dish that was recommends by the waiter which was spicy and served in an adorable pot right there on our table. Heavy in lemongrass, he was also disapointed in the spicyness.They would have gotten five stars had the dishes been extra spicy like we requested but I undrstand that most people don't like big heat :) next time I'll emphasize very very spicy an see what they can do with it."], ["Don P.", "Found myself alone for lunch and remembered the sign outside while visiting 'Moe's'.  Asian grill $5.99. Can't be good, right? WRONG!!!  This was EXCELLENT!  They had 4 or 5 choices of lunch choices and the flounder was excellent!  That and a diet coke was less than $9!  And again, did I say EXCELLENT???   Go, give it a lunch try..... You will see for yourself!  Oh, and the staff was almost too attentive, and extremely courteous.  Can't wait to take my office buddies."], ["Mackie R.", "We were in the area shopping and ended up eating lunch at Baoding.  The food and service was excellent.  The price was reasonable."], ["Tee M.", "I ordered the dumplings and pineapple fried rice.I've never had fried rice that was so white-It lacked flavor. The dumplings were just okay. I don't think I will come back here for Chinese food."], ["Lee Ann D.", "I have been here a few times to just pick up dinner a long time ago and it has always been great. This time we decided we would go in for lunch and it was still really good!! We did a little buffet style and tried a little bit of everything! We had the House Lo Mein, Beef and Broccoli, Fried Green Beans,  and a Cucumber salad. It was all really great! The service was great and it was not that pricey"], ["Steve B.", "I am embarrassed that I don't try more items when I eat here, but I come in specifically to get the chicken fried rice. It is nothing like usual Chinese restaurant fare as it is not soaked in soy sauce, and the chicken isn't the cubes from a can. All in all, everything seems to be freshly prepared in their kitchen. The spring rolls are made here and delicious, and the scallion pancakes are another favorite appetizer.The waitstaff has been here for years and are very good.  Anyone that walks past your table will fill your glass or take your empty plate.The atmosphere is very nice.  It seems that you have two choices in Chinese restaurants--corporate Chinese like PF Chang's, or red and gold with paper lanterns.  Baoding has it's own look, and the music is not some kind of bad kung-fu movie sound track, they play a variety of normal choices.When I want Chinese, this is the place for me."], ["Hello S.", "Good for kids?  NO!  They don't have high chairs...it was a disaster!!!!!"], ["Eric K.", "When I'm in the mood for Chinese food, I usually want Jo Jo China Bistro (Baoding's sister restaurant); however, we had a coupon for Baoding, it's closer to home, and it's in SouthPark, so how bad could it be?  For being in an old strip mall (where the small Barnes & Noble used to be) that needs some refreshening, we were pleasantly surprised that the interior of Baoding was very upscale in appearance and nicely themed and decorated.  Better yet, the pricing was reasonable compared to other SouthPark restaurants.  I decided to try an entree I had never had before -- Three Glass Chicken.  I'm not sure of the meaning behind its name, and I'm not crazy for dark meat chicken as the dish contained, but the abundance of flavors (garlic, ginger, chili peppers, basil, cilantro, wine, sesame oil, and soy sauce) it offered sounded delicious and too good to pass up.  I wasn't disappointed.  The dish was very tasty, despite the more greasy dark meat.  The service was so-so, but we didn't let that impede our visit.  We enjoyed Baoding, and it can be great for either casual dining or on a date, but Jo Jo is still my preferred Chinese restaurant."]], "Hunan Park": [], "China Palace": [["Hossein A.", "I became a fan of this place gradually... now I go there almost twice a week! The food is just delicious. I didn't like the food for the first time, but I tried again and now couldn't let it go anymore..."], ["Herbert W.", "I have been to many Chinese places here in clt. This lpace has the best shrimp fried rice and chicken wangs. period, point blank. Now I cant comment on anything else they serve as I only get the above mentioned food. in fact, thats all I have ever eaten from a Chinese place is that.A+ all the way!"], ["Joseph L.", "Your kidding me right? This place is so nasty .. And the food? The what? They take the \" C\" out of China... First this place smelled? Not sure if it was urine or cat p**** HUh.... then I get the order . When I treid to explain it was hard for them to understand that HEY I did not order this What do you not understand ? I order (translate)   number 6 not 11 I know for some people that is hard to understand .                 If this simple one person order gives you problems then maybe you should try something else ? Walmart greeter? Or maybe one of those people that gives out the free sample at stores? On second thought maybe not.... that is to much to understand .. 1) Open box  2) Place on plate  3) Put in microwave 4) hit 'On \" for 3 minutes .        There are to many places that have much better food  like well... Any where else...."], ["Jennifer G.", "I don't understand some of these reviews. This place does deliver, the staff is always professional and pleasant, and the food is good. It's just that simple. I definitely recommend this place!"], ["Annie M.", "A good solid place for some take out, but it's even nice enough to dine in.  This restaurant has a few tables and booths  and I have never had an issue finding a table or getting quick service. Not really greasy Chinese food either. Last night my friend and I ordered the Curry Chicken and Chicken and Broccoli no complaints! The hot and sour soup was a great start and of course our food was ready in \"ten minutes\". If you're in the university area, this is your best bet for classic, quick and cheap Chinese dinning!"], ["Darryl T.", "The service was slow, the greeters and the cashier was not that friendly. The food was okay."], ["S. A.", "Ordered the vegetable and rice lunch special.The vegetables were overcooked and the rice tasted a day or two old.Perhaps it was an off day. Still, I'll take my $$ elsewhere."], ["Mike L.", "I have been here a couple times with my girlfriend and we have always been satisfied with the quality of the food here.  We had some Lo Mein the last time we both went there and it was really yummy.  The service was a little slow the second time we went and it was really slow in the restaurant itself, so I did not understand what the issue was with that, but otherwise this is a pretty good Chinese joint which is reasonably priced compared to some other places close by.  Awesome spot for lunch, which is when I would recommend going the most."], ["Michael N.", "Excellent food & good prices!!"], ["Michael M.", "Man this is my favorite chinese place in the queen city by far."], ["Ricky M.", "Great place, although they DO NOT DELIVER!"], ["John M.", "I bought a veg fried rice, w tofu and eggs for take-out (med spicy)The food was good, and good tasting, veggies were cooked well. The serving size was generous  I think this is good for take-out, not sure if I would \"enjoy\" eating there. The interior is clean but drab.No fortune cookie... that was weird (or maybe they forgot)."], ["Terrence P.", "I ordered the general tsos(all time fav) and the sesame chicken for lunch. I wanted to try both and see which would come out in top. The fried rice had no taste and was dried out....I might has well have been chewing on the box. The chicken was terrible. It was stringy and had no taste. The sauce was nowhere to be found. I love Chinese food and I couldn't even finish the food. I am not a fan of this place. I tried to reheat it the next day and it looked like it had been in the fridge for over a week. Never again."], ["Levi T.", "Best shrimp fried rice ever. Prices are normal but the food is above avg. I try to make it here 2 times a month."], ["David B.", "I have eaten here many times.  I always get the general tso's chicken extra spicy.  I will sometimes get the chicken fried rice.  Both of which are great.  There is one server that I have seen and he is able to serve all the tables in a timely manner.  The food comes out fast and hot.  If you call to order when they say 10 minutes, they mean 10 minutes.  Overall best chinese place I have found in the University area."], ["Lance F.", "The best Chinese food in the university area.  Get the chicken fried rice."], ["Jasmine R.", "Yummy food! We ordered takeout - was quick and affordable way to free 5 people with lots of leftovers."], ["Richard H.", "We were visiting UNC Charlotte and felt like Chinese Food and this place was nearby. Very surprised, We ordered 3 main courses and everything was fantastic and so, so reasonable. I had soup and the wife and kids had egg rolls and springs rolls and everyone agreed the food was great."], ["Arianna K.", "Everything was hot, delivered fast and delicious, definitely will be going back."]], "Ho Ho Cherry House": [["Nancy O.", "I love this place!! It's the only place I order my Chinese takeout from. I've tried a few different things....lo mein, fried rice, egg and spring rolls and typical chicken dishes. But my all time favorite and consistent go to is their sesame chicken! It is delicious!!! Also really loved their egg rolls. I definitely will be ordering again...this review comes after my 3rd order."], ["Michael B.", "Delivery has gone downhill. Waited 1:45 for delivery (less than 2 miles) on a Monday night before the dinner rush. Food was lukewarm at best by the time it arrived. Food is decent for takeout, I like being able to get a dinner combo plate versus the entree portion."], ["Abby L.", "The food is \"ok\".  I wouldn't pick this as a favorite \"go to place\".  There is nothing wrong with it, it's just nothing anything special.  Crab rangoons are pretty good.  Service is good, quick.  Clean environment."], ["Nikki W.", "Is it the best? No way. Is it the worst? Heck no. I think A-OK is a spot on description of the Cherry House.Most important thing: you can place orders online. I really hate to order over the phone, so this is a big win for me. They also deliver.This place is just a few blocks from my house, so it's a super convenient location for me. I usually just grab some take out, but I finally had my first dine in experience Sunday night.Starving after watching the Denver-Oakland shellacking, we voted on Chinese and decided to head here. I always get soup and one of the combinations. This go round I went Hot & Sour Soup and Sha Cha Shrimp combo with brown rice and an egg roll. Huge portions. My roommate doesn't like this place, but when I brought the leftovers home... she was a big fan. She was shocked when I told her it was from Cherry House. Maybe she's just been ordering wrong? My other friend always goes curry when she does Chinese. She ordered the Curry Chicken combination here and didn't like it. I'm not the biggest curry fan, so I'll let her be the judge on that one.For me, spicy mustard is a must for egg rolls. I got a side and whoa did it pack a punch. I loved it, but it may be too spicy for some so be warned. Soda is by the can, so if you down your drink... you'll have to buy another one. If you're getting take out and do need a soda (one larger than a can), there is a Friendly Mart across the street.There are better places around, but this hits the spot if you live in the Elizabeth area."], ["Randall B.", "Food was 35 mins late. Everything was not in my order on delivery. Mongolian beef was filled with all onions (for filler). Never again. Nothing but excuses from this place when called to ask."], ["John S.", "This place has really fallen off. Oredered delivery and couldn't have screwed up the order more. This twice in a row. Used to be good pretty terrible now"], ["Melissa F.", "Plus: They deliver.Plus: The delivery guy is super nice.Con: The delivery guy has to call me a few times to find my place.Plus: You can do online orders.Con: They can't get the online orders right. Plus: They have brown rice.Con: It's hit or miss whether or not they can read the order correctly to get you the brown rice.Plus: The prices are good.Con: The food is laden with salt and MSG. I even asked for low salt, low sugar, and low MSG. (See 2nd \"Con\".)Plus: The delivery guy was super nice when I told him that I had specified the order for later and I wasn't home yet. Con: They reheated the same food they'd made earlier for me. Rice and the veggies I got were no problem. But I was also delivered some super soggy crab rangoon. Plus: They actually deliver to my place! I live in a mostly dead-zone when it comes to deliveries.Con: I really don't think I'll be ordering from them again."], ["Noel L.", "Love me some Cherry House on Tuesday nights after work.  Its super cheap, flavorful, and the place is clean.  The people who work there are really nice too.My favorite dishes are the steamed Dumplings, the Shun Lee Chicken, Vegetable LoMein, Mongolian Beef, and the Hot and Sour Soup.  I hear the Cherry House Chicken is great too."], ["Bridget B.", "food was very good for the price!  your typical Chinese take-out place.  Portion sizes were good.  Would go back for sure!"], ["Kris K.", "Love this place. Old school Americanized Chinese Food. But with fresh veggies and the food is always delivered Hot and Fresh."], ["Kenny R.", "Same thing, different day.  I always get it to go.  Lunch special this week was spicy garlic chicken for 4.20.  Not that spicy and only somewhat garlicy.  I would complain about too much onions and not enough chicken, but at that price I should be scared of a lot of chicken."], ["Kelly M.", "Ordered some food from here to go one evening, not the best but not the worst either. I was more pleased with some items rather than others. We ordered the veggie lo mein which was pretty good and I enjoyed it. The vegetable fried rice was ok but all around pretty bland I thought. We ordered their veggie rolls which were just terrible. The flavor was awful and the wrap was so soft and had no crunch, I couldn't even finish eating one of them. We also ordered the sesame tofu which was honestly the best part of the entire meal and pretty impressive. It tasted just like ordering sesame chicken only tofu instead. I would def. eat some things from here again but I wouldn't jump at the chance either."], ["Dan C.", "Man, I really want this place to be good... but it's not.  A shame - it's so convenient to get delivery (especially when it snowed, hah).  Quintessential Chinese take-out isn't all that great in the first place, but Cherry House's dishes don't even measure up to that standard.Probably the most annoying thing about the beef, chicken, or shrimp entrees is the abundance of vegetables.  Don't get me wrong - I love my greens, but there just isn't much in the way of protein.  Having ordered a variety of entrees, each of them just go overkill with the veggies.  You feel cheated - the dishes should be along the lines of \"snow peas, carrots, and a sampling of shrimp.\"  And to make matters worse, despite the diversity of dishes available, there's about three flavor profiles available:  (1) salty; (2) sweet; and (3) sweet and salty. Hot and Sour Soup - They're doing it wrong.  The viscosity is off, and it's neither hot nor sour, really.  When my sister visited and tried this place, she said everything from there tastes like broom handle.  I've never had the pleasure of trying broom handle (and I don't know how she would know...) but I take it that it's no filet.For me, the coup de grace was hair in my food the last two times I ordered!  Supremely unpleasant and tossed it out immediately.  You want to believe it was an accident the first time, but when it happens twice in a row... it's no accident.  Something's busted with the people, product, or process.dmo out."], ["Ken H.", "Best steamed dumplings EVERRRRR (in excited Oprah voice)! Ho Ho Cherry House is a reliable neighborhood Chinese restaurant that does primarily takeout/delivery business. Service is generally very quick and friendly. The menu is pretty long and features standard fare. The dumplings are always perfectly steamed and they usually throw in a couple more than the count says on the menu. Some of the fried foods can be a little on the oily side. Online ordering is definitely a bonus! P.S. They have coupons on the Clipper app sometimes, though the app is not user friendly."], ["J. Scott W.", "I lived in Houston for nearly 20 years, and ate Chinese food all over that city, whose Asian population is among the most vibrant in the U.S.  Since I moved up here, I've eaten at just about every hole-in-the-wall Chinese takeout and \"Asian bistro\" around.  I thought I was past the point of having my doors blown off by a dish, but the Cherry Special Chicken here did it from the first bite.I ordered it expecting something akin to sweet and sour chicken with a cherry twist.  Sweet and sour isn't my favorite (My young sons, of course, love it) but I had to give this a try.  What a revelation!  Yes, there's the sweet-tartness of cherry, but there's also a spice kick that put sweat on my brow (I requested it extra-spicy) and a panoply of other spice notes throughout.Oh, and the hot and sour soup is actually spicy and brilliantly sour.  I order this almost everywhere I go, even though it's usually \"meh\" at best.  I could eat it every day.  And the sweet and sour chicken my sons got?  Yeah, it was good.  But let's face it, if you can't get THAT right, you'd better close up shop.The service was very friendly and attentive, and the entrees didn't come out until we'd finished our soup.  I'm already looking forward to my leftovers for lunch tomorrow ..."], ["Theresa B.", "Bought a voucher on LivingSocial and decided to dine here and I'm so glad I did!! I will definitely eat from here again. The food was fresh and delicious & the service was awesome. The prices and quality of food is well worth it. Great spot for inexpensive vittles."], ["Barone B.", "Awesome meal everytime. Great service.  Delivery driver is super cool everytime and the food is always spot. Try to find that at you local Chinese take out. Thanks cherry house you rock and for those who are in doubt ,cook it yourself if you can do better and let the cherry rock on."], ["Olivier D.", "I ordered for delivery. Blazing fast. I was told about 45 minutes and they were at my door in 20. The food was good. Nothing special, like any other Chinese take Out place. I find it very hard to review these types of take-out places as I feel they all cook from the same ingrediënten list. Anyways, if you are looking for descent quick Chinese take out with a bubbly delivery guy, this is the place to be :)"], ["Ande T.", "Food was meh. Nothing to write home about and pretty expensive."], ["Abbey W.", "Ate here on Christmas Eve as a new family tradition and was happy with the decision. I ordered the veggie dish with white rice. The veggies were great but I prefer sticky rice so didn't enjoy the rice as much. This is our new go to for nearby Chinese."], ["reid c.", "HOHO CHERRY HOUSE, not to be confused with a brothel, offers average food at cheap prices. Fast delivery and friendly staff. No matter what protein you pick it pretty much tastes the same."], ["David A.", "Cherry House is good for two things: quick and inexpensive Chinese food. Don't expect to be blown aware by culinary complexity or innovative dishes and presentations here. But, hey, they carry most of the westernized classics.US CULTURE TIP ON THE USAGE OF THE TERM \"CHOW MEIN\":I learned from my experience here that there is a difference in the US between East and West coast conceptions of chow mein. On the West coast (where I was raised), chow mein refers to the steamed soft noodles and \"Hong Kong style\" refers to the crispy style fired noodles. However, here on the East coast, \"chow mein\" is assumed to be the crispy Hong Kong style, while \"lo mein\" refers to the soft steamed style. Who knew?At Cherry House, however, chow mein seems to refer to a bunch of fried rectangular morsels of friedness. I think they are the ones that you find in soup sometimes. In any case, I was a little let down.That said, in a fix it is a perfectly viable option. The lunch combinations are a fantastic option at $6-$8 for main dishes with fried rice and egg roll, spring roll, or crab rangoon. A filling lunch for two coming in at under $13? I've had worse."], ["Faith D.", "Pretty cheap, pretty good. They offer delivery in a certain areas (so call to verify). Delivery was non-stop the night I went in and a few dining in.The space was small and the restaurant smelled of their seafood dishes. The service was good and fast."], ["Bill M.", "I was actually pleasantly surprise by my visit to the Cherry House. After reading the reviews here, which are very mixed, I figured what the hell. Can't be worse than what happened to Hong Kong Chinese (read my previous review for that story).When I first walked in I was surprised by the cleanliness, and how well put together the interior looked, nicely decorated without going over the top. My wife and I were greeted at the counter and took a minute to look over the menu.I went with one of their \"house specials\" the spicy tangerine chicken, ordered with white rice, and an egg roll for $7. Not bad at all. The wife went with good ol' beef lo-mein. Everything was really good, seemed fresh, and had great flavor. This is slowly becoming one of my fav take out Chinese places around. Ho Ho Cherry House has my vote!"], ["Shauna C.", "What happened to this place? I ordered my usual extra crispy sesame chicken and mushy yuckyness with  bland yet sweet syrupy sauce is what I received. I was given no choice between fried rice and white rice and they automatically assumed I wanted the large portion when I actually would have wanted the small if I knew I had the option ( I just thought the prices went up...and truthfully there was no difference in size and it use to be $6.95 now its $10.95!). I have gone to other restaurants and ordered $10 worth of Chinese take-out and received an egg roll and soup too- not the case here...although before it use to be- new management ?..or are they just getting cheap? The usually amazing   crab rangoon wasn't hot enough (temp-wise) and I was totally disappointed.They also forgot to give me my chop sticks which may be a small thing but I specifically asked for them. The literally gave us a full pint of duck sauce though so perhaps they should think of scaling down there and throwing in a veggie egg roll like they use to.  They use to have 5 stars from me but this last time wasn't even worth a single star in my opinion so  I'll meet somewhere in the middle and give them a 2.5 ...I really am not sure if I would return if the quality has gone that downhill...search is back on for good take-out Americanized Chinese food in Charlotte"], ["Ashley C.", "Great food here. They are fast and give you a good portion of food. The general tso chicken is awesome!"], ["Melissa H.", "This is my favorite Chinese restaurant. They have great food, they are super fast and friendly. I usually pick up my food but the few times I had it deiilvered it arrive pretty quick and the food was still steaming hot. I really love you can get lunch prices up till 4pm, that works out great for me. If I could change anything I would offer a combination plate were you can get 2 different entrees on one plate. But I guess that's why they have buffets but Cherry House has such better food!!"], ["Christina N.", "My new favorite Chinese food spot! Just moved in down the street and had a great first experience! Ordered delivery and they arrived within 10 minutes. The delivery guy was super sweet and called when he arrived. Great service! And of course, the food was super delicious!"], ["Mike G.", "I've only ordered take out lunch from here, but it has yet to disappoint me....weekly specials are key @ $5 with tax included. I always receive my food correctly, and piping hot. The lunch portions are enough to feed at least two. The lo mein could probably serve three. Interior isn't much to look at, but the food makes up for lack of appearance. Staff always seem friendly."], ["Nick C.", "Good cheap Chinese food. Close to home, so it's a winner with me. Always friendly, pretty consistent quality."], ["Victoria S.", "My boyfriend and I have been to Ho Ho Cherry House a couple times because its right up the street from our house. On a recent visit to pick up our order, I happened to notice there was a coupon in their to go menu I had picked up.  The coupon was spend 15, get 5 off. I asked the MANAGER, \"hey, can we please use this coupon?\"  The manager said, \"did you just pick that up off my counter?\" Playfully I said, \"umm, noooo\" thinking there was no way he was going to deny us the coupon.. (remember, talking to the manager, not a teenager in the front.)  He then proceeded to tell us that no we couldn't use the coupon, and we would have to take the coupon home, cut it, and use it on our next visit. I said I couldn't believe that, and that if there was some sort of parameter of that sense it should be clearly stated on the to-go menu. When he finally refused, I said under my breath, \"guess we'll be going down the street to 88 Bistro.\" to which he had the nerve to reply, \"yeah, I heard that place is great, have you been?\" What a jackass. If directly disrespecting your customers is how you run your business, then I will be happy to support your competitor."], ["Paul H.", "Friendly staff, good food and you can order through Living Social.  Large menu selection too.  Usually do carry out but it has a dining area too."], ["Angela C.", "This was my go to Chinese place in Charlotte.  As others have said, it's quick and inexpensive.  And don't forget tasty!!"], ["Michael K.", "Good food. Friendly staff. Good prices.  I love the Chicken and Broc.  Generals Chicken is good but not great. This is a staple in my diet since I live so close!!"], ["Danielle B.", "I don't generally like to review restaurants that I've only eaten at once since that hardly seems fair to me, and I will be up front, I have only eaten here once, but I'm not in a terrible hurry to repeat since I've found better Chinese which is closer to my house.We went here on my roommate's request. He had the Chicken and Broccoli (He ALWAYS has the chicken and broccoli!) and seemed to enjoy. We split an order of crab rangoon and it was pretty decent too. It wasn't exactly complex in flavor, but it's tough to screw up crab and cream cheese deep fried in wontons. I had a General Tso's combination and I can best describe my impression as underwhelmed. The chicken was a little to crunchy/chewy for my taste and the sauce was not as spicy as a like my general tso's but I suppose these are both excusable if they happen to be your taste. What was not excusable, and really what is prompting me to write this review, was the egg roll. The only reason I was craving Chinese so badly was because I wanted an egg roll. You know how boiled cabbage can be kind of odiferous? Well imagine a wonton wrapper which contained nothing (no egg, no pork, no nothing) but cabbage that smelled, not mildly, of parade route (anyone who has ever marched behind mounted cavalry knows what I mean). I was very disappointed.It should be said that the service was good and, as I said before, I have only eaten here once. You can pay your money and take your chances on the fact that I was there on an off night or that they will be more to your liking. I will be getting my Chinese food elsewhere."], ["Don W.", "Delivery was excellent,  and arrived piping hot. When I ordered and it was stated delivery would be at least 40 minutes I had my reservations. But the food was well worth the wait."], ["Kevin A.", "This is my staple, take out Chinese place.   I have been eating here since way before the ownership change and have enjoyed almost every moment of it.   I typically order one of the same three things every time I get in the mood for Chinese take out:  General Tsao, Chicken and Broccoli, or Triple Delight.    I LOVE their General Tsao, it is spicy but not overly and I think the sauce is the perfect amount of thickness.    I tend to go for noodles instead of rice, but do enjoy their steamed or fried rice.The girl on the phone knows me (by my phone number) and usually asks me which of my staple three entrees I preferred that night.  That alone adds a brownie point.The food is prepared quick and steaming hot - I typically let it sit on my counter for 10-15 minutes before even attempting to eat the steaming goodness.I recommend this place as a quick take out spot if you are in the mood for delicious, fresh and fast Chinese (americanized) food."], ["Ashley S.", "Good, cheap, quick. Yum!"], ["Kristin F.", "So, I ordered Cherry House because it is the only Chinese place that delivers to my apartment complex and my boyfriend insisted we eat Chinese food for the opening ceremonies of the Olympics.  Yep, he's a big dork.  I couldn't decide what I wanted so I went with my standard veggie lo mein while the bf ventured out and had the Cherry Special Chicken.  We also got the standard egg rolls and crab rangoon.Well, the lo mein, first of all, was not lo mein at all.  It was actually chow mein and that did not really work for me since I prefer the wide, flat noodle usually found in lo mein dishes.  It was fairly bland and the veggies were scarce.   I mean, c'mon, it's veggie lo mein!  Give me something here!  The crab rangoon filling was nothing short of disgusting....it tasted like either ricotta cheese or curdled, mealy cream cheese.  Yuck!The Cherry Special Chicken, however, was pretty darn tasty.  I ended up sharing with the bf because his food was way better than mine.  The sauce was a sweet/spicy combo and the chicken was tender and perfectly fried (i.e. not too greasy).  The only downside:  the cherries were of the marischino variety and tasted just like what you would expect: like they came from the bottom of a Shirley Temple.  Overly sweet and not so appetizing.  A mixed review all in all.....maybe if I branched out and tried something different, but I think next time, I will just go pick it up from somewhere else."], ["Joy S.", "While Cherry House might not have the most exquisite Chinese food ever, it's solid and cheap. It's one of my favorite buffets. They have a great deal for their takeout lunch buffet...it's around $4, and they give you the takeout box. You fill it up as much as you can! As long as you can close the box, it's the same price. I've stuffed one of those boxes so full that I ate leftovers for a week!Sometimes the lo mein is a little dry or other items look like they might have that not-so-fresh feeling...but I can forgive a lack of culinary perfection for the fabulous prices."]], "Hong Kong BBQ": [["Norra T.", "This is definitely a hole in the wall place. I was actually picking up banh mi sandwiches and saw this place. The duck and pork were prepared as well as the places I go to in ATL. I will definitely be stopping by this place again when I'm in the area."], ["Janet L.", "Missing Hong Kong BBQ... found this on Yelp and was excited to try it.But, the BBQ pork was extremely dry... was disappointed. However, the service was good and they had the ginger/green onion sauce which is a plus as most places either wouldn't have it or would charge you extra for it."], ["Brian A.", "This is as authentic as you're going to get.I'll be straight up when I say that places like this can make me nervous.  The mall itself is sketchy...and it's in a sketchy part of town.  I make it this way every few weeks for some bánh mì at Le's, but came on a day that Le's was closed.  Dim sum?...or the place with ducks hanging in the window?  We opted for the ducks in the window and chose Hong Kong BBQ.When you enter Hong Kong BBQ...you can tell there's going to be a communication issue.  There is literally...not a single thing resembling \"American\" in this restaurant.  I knew I was going to like this place.  I did my best not to look back at the kitchen.  We all know what that is going to look like...and I'd rather play dumb.  Dangit!  I looked.The service was quick and the food was great!  We were even entertained with Chinese soccer on their small TV.I'd recommend coming here if you're an adventurous person...otherwise...you'll never make it as far as the door...much less the table."], ["Will H.", "A diamond in the rough... I get off the highway just to grab lunch from here. Remind me of the authentic Chinese take outs in NYC"], ["Sam J.", "Apparently HONG KONG BBQ ASIA restaurant has learned the importance of proper sanitation in food preparation and storage - a big ATTABOY and plus two stars. While they're not quite there yet, Gordon Ramsay would be proud of their constant improvement. If they ever reach a mid-90's grade A, their business would skyrocket due to being next door to Le's Sandwiches.public.cdpehs.com/NCENVP…Inspection:    3/04/2015 - 88.5   Grade: BInspection:  12/02/2014 - 88.5   Grade: BInspection:   7/20/2014 - 87.5   Grade: BInspection:   3/20/2014 - 88.0   Grade: BInspection: 11/22/2013 - 87.0   Grade: BInspection:   7/30/2013 - 86.5   Grade: BInspection:   1/03/2013 - 81.5   Grade: BInspection:   7/23/2012 - 79.0   Grade: CInspection:   2/24/2012 - 77.5   Grade: CInspection: 10/25/2011 - 77.0   Grade: CInspection:   3/29/2011 - 74.0   Grade: CInspection:   1/06/2011 - 85.5   Grade: BYum. Yum. Crispy duck. Enjoy."], ["Anita C.", "Pretty run of the mill mom & pop shop, roast pork & bbq pork is sold at $9 a lb. and what can I say the bbq is pretty on par with what I can get in Boston both crispy and flavorful respectfully. Great to know I can find some comfort food in Charlotte."], ["James R.", "It helps to have someone understand the language while in the Hong Kong BBQ, but they do have english menus that you can use on the counter.  It is pretty cheap for some good food.  Just ignore the pig hanging from the ceiling if you find that gross and also ignore the food rating as I survived my visit and I am sure you will yours.  Just make sure to wipe down your silverware when you get them.Personally I really liked the BBQ pork which you can see hanging with all the meat in little strips; which, they cut up and serve with rice is really good."], ["Mary M.", "Get the one dollar bbq pork bun. Have them heat it up for you."]], "Golden Taipei": [["K. R.", "Location: Shopping center with plenty of parkingDay: Sunday @3pmTake outNot crowdedAtmosphere: booths, tables, bar and TVs Ordered egg roll, shrimp lo mein and chicken wingsI had to wait @10 minutes.  They were cleaning up from the Sunday buffet that they offer.  The food was very hot and fresh.  The BEST lo mein I have tasted in awhile ( it actually had veggies in it as well.  Chicken and egg roll fried well.Hard to find a good and reasonable Chinese location for take out in the area.I will return."], ["Justin P.", "Ordered delivery and it came on time, and the food was great for the most part.  Not too greasy like most Chinese food, but avoid the sushi rolls.  The tuna roll was one of the most disgusting sushi rolls we've ever tasted.Stick to the standard Chinese fare, and you won't be disappointed."], ["Maya P.", "Sushi was fresh and delicious when I came to do a to go order for lunch. The place was very busy with other professional types and the staff definitely caters to that. They realize you only have a certain amount of time and get your food to you quickly. My order only took about 10-15 minutes and the to go waitress apologized (no need, but I appreciate great customer service) and gave me a free sweet tea to go. I got a shrimp tempura roll, Alaskan roll, and crab rangoon. The sushi came with wonton soup and wontons. It was a ton of food for less than $14 and I was able to save some for dinner (score!). This place is less than a mile from my office so I'll certainly be back on days when I \"forget\" my lunch. Next time I'll have to sit in and try their buffet. They also have a 1/2 off sushi deal on Monday and Tuesday but it is eat in only."], ["Lady Y.", "Have been coming here for 3 years. Have never had anything that wasn't fresh and delicious. I travel here for business and it is my go to place."], ["Shon A.", "This place & food is OK. I've been here for lunch & you get more for a cheaper price. Nothing to brag on just like any Chinese Restaurant & I think the dinner portion is not worth the OVER PRICE they charge."], ["Devin P.", "Loved the orange chicken. Yummy flavor and nice garnishes. Awesome Monday and Tuesday half price sushi special."], ["Lindsey D.", "First positive I should mention is that they were able to work off the menu! They did not offer fried tofu on the menu and were still able to serve me Sesame Tofu. The dining room and bar were totally empty at 3pm on a Saturday aside from a table of high school kids. After my experience, I have no idea why. The food was seriously delicious, the prices were more than fair, and our waitress was great.Weird note: the decor is neat and what you would expect of an independent chinese restaurant striving for a cool look. But they had a case of cell phone cases for sale behind the register Hahahaha what the heck?"], ["Tameka G.", "Pretty good Chinese food my love and I usually order to go here when are eating a late dinner. My typical order is the veggie fried rice with spring rolls while his is the vegtable lo mein with spring rolls."], ["Hania A.", "Excellent Chinese food and even better sushi!   We decided to try their 1/2 off Sushi on Mon & Tues, and we have been coming here at least once a week ever since.  The Sushi was surprisingly fresh.  Edamame is great as well. And I get the steamed shrimp with vegetables and brown rice to go...AMAZING!  And lastly you can't go wrong with their shrimp or vegetable egg roll, DELISH!"], ["Kenny R.", "I've been nice in the past and given this place 3 stars, knowing that I might eat there again.  I don't have that problem anymore.  This place is disgusting.  Much better sushi at the Harris Teeter next door, and I'm not even sure if the chicken in the \"habachi\" was actually chicken.I've been to half priced sushi on Monday's and Tuesday's that were pretty bad, but I just blamed it on old sushi.  For me to come in on a Saturday lunch and get pale (not torro) looking tuna is just not acceptable.  With the sushi lunch, you get 5 pieces of sushi and tuna rolls.  The tuna in both was barely edible.  3 of the 5 pieces of fish were fishy mackerel or yellowtail.  Just stuff they were trying to get rid of.  The one piece of salmon I got wasn't half bad.My date ordered the teriyaki chicken lunch.  This wasn't chicken.  It was weird, pale, and kind of gelatinous.  The teriyaki sauce was mostly high fructose corn syrup.  Even my dog looked at me kind of funny when we tried to feed it to her.  Yes, thats where the food went.Even the little fried pieces of wonton with duck sauce were stale.  These guys need to figure out if they are a Chinese place, a sushi place, or a Japanese place and just do one thing right.  I'm kind of surprised with the rating and that they are even still in business."], ["Gabrielle D.", "The sushi is so good !! I went there when it was half off when u dined in and I would highly recommend it. The server could have paid us more attention but she was dealing with a complicated customer that it was okay ."], ["Julian M.", "We eat there on a regular basis.  Good food and friendly staff."], ["Anthony J.", "I experienced a flurry of sugar and cartilage in terms of the food, though the wait staff was great."], ["Scott W.", "This place has been my favorite Chinese place in CLT for years. Great fresh food,  sushi, even a bar. Reasonable lunch specials.  I highly recommend!"], ["Maggie P.", "It's a really good place for a quick lunch with good price. It's close to my work. I come her almost whenever I don't have a lunch bag. So much better than any fast food in the area. You actually get to have a real meal. for lunch. They are a little heavy on sauce. But simply tell them so, they will fix it."], ["Sheena G.", "This is the only descent sushi place in the Concord area that I've tried, and I've tried almost all of them! Fish is fresh and there is some variety to the rolls. I always get the Harris Sashimi, Wasabi roll and Phoenix roll. The service is friendly and fast. I always do takeout but the atmosphere is nice and cozy there. It is a bit pricey, but I keep going back because it is the only place with fresh fish around."], ["Louis M.", "This is a very good Chinese restaurant in a small strip mall on West W.T. Harris. The food here is very good, with almost all of the items fresh made, not frozen or canned.When you sit down you're greeted with a bowl of fried noodles and duck sauce which is very nice to munch on while you wait.The won ton soup is excellent with fresh made won tons, and an excellent broth. The crab rangoon are fresh prepared as well.The sushi here is outstanding. We have never gotten a bad piece, and the presentation is suitably authentic and ornate. They will gladly honor special requests. There is a selection of rolls and pieces available for half price on Mondays and Tuesdays. Service is quick and attentive. The waitstaff is knowledgeable, and makes helpful suggestions. Portions are large. The spicy dishes are relatively tame, but they will adjust the heat according to your liking. Overall, and excellent establishment, and very good for a date night movie combo at the nearby Northlake Mall theater."], ["Chris R.", "Great little place for a date meal on a budget or a quick tasty lunch.I have been here three times now and they continue to impress me each and Every time. I came twice for lunch and got two separate lunch combos and must say they are your typical Chinese chicken dishes, but they do not smoother the chicken in a soup of sauces.KILLER DATE IDEA!!!! Monday and Tuesday half price sushi rolls and none of them are over 3.50. Did this one night and gf and I got out with out meal two soups, four rolls and an egg roll for 15-16 bucks plus tip. Awesome cheap deal for a lazy Monday or Tuesday when work or school had you beat down.Will also allow you to have large parties in the back room as well."], ["Joe D.", "Nice atmosphere, great blend of Chinese and Japanese food. Love their General Tso's Chicken, best around!"], ["Kieran M.", "I love ordering from here. It is definitely one of our favorite Chinese restaurants in the Charlotte area. They have a wide variety of Asian food, and all if it is fresh and tasty. The prices are good and the people there are always friendly. Definitely a staple for Chinese food."], ["Alexa B.", "Just went there for the first time.  Service was fast and food was delicious. . Deffinatly coming back"], ["John K.", "I've been coming here since the day it opened, and it's always been fantastic.  The owner, Tony, has several restaurants in China, and he knows what he's doing.  I know a lot of Chinese people that come here to get their authentic fix.Eat here, it won't disappoint."], ["Eddy L.", "One of the better Chinese restaurants in the UNC area. Sunday buffet and dailey drink specials. 1/2 price rolls on Mondays."], ["Jason B.", "The place was hot as hell so i ate my dish sweating. The wonton soup was decent. I ordered chicken with garlic sauce. Half of the dish was cold and the other half was hot. Prob wont return."], ["Bill S.", "My wife and I eat here often.  It is a great little date night place to go that is close to home for us. The people recognize us when we come in and greet us with smiles. The food is great as are the quantities given,  we usually end up taking some home.  They also have the 22 oz sapporo cans for a decent price.  Try the steamed dumplings and the curry chicken dish with noodles.  For some it might be a little bit pricey but I think it is worth it."], ["Daryl I.", "Some of the best Asian food I've ever eaten in the Queen City. Would recommend if you like this kind of ccuisine."], ["Thomas T.", "Excellent, truly excellent food.The chicken and broccoli is made with diced chicken thigh meat and the MaPo tofu is made with shredded pork.  No short cuts/pre-made frozen meats. Simple things like pork fried rice and wonton soup are outstanding.  And you can order anything SUPER SPICY HOT. Sushi is great too, but I go for the dishes that remind me of Chinatown."], ["Alexandra D.", "Great place! Super friendly wait staff. You can make any dish with white meat (for a small up-charge) if you want. Also, half-price  sushi on Monday and Tuesdays. Great sushi and a great deal!"], ["Jim F.", "Had dinner here last night. Went for the Chinese dishes rather than my usual sushi. Had a seafood entrée with lobster, scallops, and shrimp along with the usual Chinese style veggies in a brown sauce.  It was really great. And plenty of it too. The veggies were very fresh and cooked just right which to me is very key for Chinese food. Loved it."], ["Xiao L.", "Very good Chinese restaurant! There is a Chinese food menu for Chinese people, recommend 水煮鱼片 and 清炒长瓜。"], ["Iris A.", "This used to be my favorite Chinese place but things have changed, the prices have gone up and you get less for your money. They have changed ingredients and don't expect you to notice. The egg rolls that they put n their luch special is not the same egg roll that they have for dinner....they are cheaper and taste horrible."], ["Sam C.", "This is probably the best Chinese food we have found in the University area. It's pretty inexpensive, everything is always good, the service is fast and it's in a convenient location. They have half price sushi some days and a pretty cheap Sunday buffet. Their online ordering system is awesome. You can customize your meals and pay in the store when you pick it up. It is ready in no time."], ["Tim H.", "I frequent this establishment about once a week. Excellent food and service. Delivery minimum is high though ($20+$3 fuel fee) so you're just better off picking it up."], ["Ben M.", "Had the buffet on Sunday for $8.  Limited selection,  terrible sushi selection,  but overall decent for the price."], ["Demetria M.", "I'm not sure what it is with me and chinese food.........we have a an on again off again relationship.  I can go years without eating it and then I'll have a taste for it and it will make me very ill.  I am very leery of the meat being served in these places so I tend to stick to the shrimp fried rice or veggie rice.  I suppose it could be me but I doubt I'll be returning.....I suppose the sushi may be good but I'm afraid to try  it."], ["Jose V.", "After trying a few Chinese cuisine, I find myself coming to this establishment for my Tso fixin'... Wish they deliver though, that's my only gripe...Food - check...Price - check...Convenience - room for improvement..."], ["Don K.", "Broccoli beef... the sauce was more like a gravy and the service was not very attentive."], ["Alfreda D.", "I used to LOVE this place. I used to live around the corner and my friend and I liked to frequent this place often. When I was back in town on business, I definitely added it to my list of places to re-visit and it did not disappoint. I was completely exhausted after a busy day and I hadn't eaten all day either. Thankfully they had drink specials and if I recall correctly my Michelob Ulta was only $2 (maybe $3) and it was served in a chilled beer mug. Perfect! It was just what I needed. My food came out quickly... it was tasty and plentiful. I probably shouldn't have cleared my plate but hey, I did, and I enjoyed it. I even topped it off with another beer. I can't remember how much my bill was but it was inexpensive, which is why I used to love coming to this place so much. Oh and it's never packed. There were only about 4 tables seated while I was there and I remember always being able to be seated immediately and takeout was ready in minutes."], ["Brian W.", "Excellent and fresh sushi, great service and free wifi."], ["Laura M.", "This is absolutely my favorite Chinese restaurant in Charlotte. The food is consistently good (I've tried everything on the menu) and the waitstaff is fabulous. Your glass will never get completely empty, and they are talkative and cheerful. The lunch specials Monday-Saturday are a deal, with generous proportions. The dinner meals are even larger for not that much more. The wait time for the food is very short. I've never had to wait more than 5-7 minutes for my meal to arrive. The sushi is always fresh. I don't get why people bash on the decor; it is tasteful and nice looking for a little restaurant that is beside a grocery store.Give this place a try, you will not be dissatisfied."], ["Adam H.", "I come here for lunch frequently (several times a month) and have found there's a lot to like about Golden Taipei. First of all, the food is consistently good. It's probably not the best Chinese you'll ever eat, but its high quality and well prepared. The preparation is typically very fast- like under 5 minutes from order to table. The service at lunch is also great- my glass is never less than half full and the servers are friendly.My favorites here are the Sa-Cha scallops and the Bento boxes. If you order a chicken dish, you can also ask for all white meat for an additional 50 cents. Overall the prices are very reasonable.  And there's usually a lunch special with soup/salad and entree for like $5 or so.You won't be blown away by this place but you'll have a good meal here. All in all I believe its good food at a good value."], ["Rachel M.", "I frequent this place since it is on my way home. Sushi takes 10 mins! The sushi is solid and the people there are really nice. It's not my favorite sushi in Charlotte, but it is the best in this area.  Try the Summer Roll. Salmon, avocado, eel sauce... Delish"], ["Shanell T.", "I visit this restaurant frequently, as it is the closest Asian restaurant to my residence. Aside from the convenient location, I enjoy this place because of its good food. Their Chinese dishes are tasty and their sushi is fresh. This is not the place to go for a gourmet meal, but it is a step above your average Asian carryout. The restaurant is clean and well kept. Staff are friendly and inviting. This place is consistent in their service and taste. Highly recommended for dining in or carryout."], ["April W.", "I had a taste for some sushi and the hubbs and I decided to give this place another whirl!  This time; however, we went the take-out route and I was not disappointed!! Our food was steaming hot, fresh, and tasty!  The sushi was, once again, right on point and we got extra fortune cookies!! Win!I can honestly say this is my new favorite Chinese food restaurant! It's super convenient, the staff is very friendly, and it's economical (especially when hubby decides he wants shrimp AND beef in his fried rice).Check it out if you're passing by (better yet, invite me along)!"], ["Daniel M.", "Food is very good, not outstanding.GoodCheapChinese"], ["Hungry C.", "The sushi yet fresh was not prepared right. The rolls where just to big per piece insted of a 6 piece with huge almost unbite size pieces he should just make it 8 sushi is meant to be eaten in 1 bite. The tuna was good i just have had better nothing stood out at all. And the people greeting you are doing anything but that not a place id go out of my way to eat"], ["Steve K.", "Delicious. Friendly staff an generous portions."], ["Brian D.", "This is the best Chinese food I have had in North Carolina.  I used to work about a mile from them and literally have eaten here 35+ times.  My job has moved back to uptown and i still don't mind driving 20 minutes one way to eat at this place.  This place is so good, I filled out this information and added their business onto yelp!The inside is very nice and high end looking for a family run Chinese restaurant. I have no problem bringing a nice dinner date here.  Its also very clean and doesn't have that oily smell many do.  Be sure to check out their Sunday lunch buffet to gorge self for $7 or try their hot pepper chicken, eggplant with chicken(its a special from time to time - its not on the menu but they'll make it for you), or just about anything.  I'm moving to san francisco in a couple months where there are over 750 chinese restaurants according to google and i'm worried I won't find one as good as this place!  Make the trip to north charlotte. I promise you won't be disappointed."], ["Megan C.", "I have gone to the same Chinese place since I was a small child so I was looking for something a little different just to try. My boyfriend and I had a coupon so we decided to give Golden Taipei a try. The decor in the restaurant definitely turned me off as well as the lack of traffic in and out. There were only two or three other groups of people eating at lunch time on a Saturday if that tells you anything. We ordered our food, I got sesame chicken. I could have gotten the same stuff at any food court in any mall. Overall, I was not impressed. I didn't feel like it was anything special."], ["Chris H.", "I enjoy going this restaurant on a regular basis. I've only ever eaten off their sushi menu so that's what I'm reviewing. The fish is always fresh and tasty. The waitstaff are very personable and attentive. I always sit at the sushi bar and frequently treated to grattis items. Their sushi menu isn't as extensive as some but they'll make anything you ask. One of the servers knows my taste and has the chef make non menu items she knows I'll like. Give it a try sometime and I think you'll be pleasantly surprised."], ["K. M.", "I can appreciate the cheap Sunday buffet.  Wait staff was awesome and kept telling me \"not to rush, take my time\" when I thanked them for filling my water... I didn't have the heart to tell them that I wasn't rushing at all."], ["Tom V.", "Very typical Chinese food. Although the decore and tableside presentation were nice I felt the food was nothing to write home about. I have eaten here several times hoping to find a dish that was really good, but to no avail. It's not bad by any means, just nothing memorable or craveable."], ["Lily K.", "My favorite Asian food place!!  We have spent the last 2 Christmas days here and we get take out at least a few times a month and I am always pleased with the food, service, and presentation.  There's something to be said for a good menu, relaxing atmosphere, and clean preparation."]], "Best Wok": [], "Persuasian Restaurant": [["Marcie C.", "Fantastically renovated spot with a new name and owner. Great for take out or dine in. Probably the best Chinese food in a casual, authentic atmosphere. If you live nearby, stop in or grab take out on your way home. You won't be disappointed with the food or service. The Chef in the kitchen knows what he is doing."], ["Jacob W.", "My first visit was just okay. I've driven by Persuasian multiple times until I came across Persuasian on yelp then finally decided to give it a try. We ordered the salt and pepper shrimp and crab rangoons as appetizers, they fell short for me. Salt and pepper shrimp wasn't crispy and not seasoned well enough. Crab rangoons tasted typical, no wow factor. For the entree we ordered sesame chicken and chicken Singapore noodles. I actually enjoyed my friends sesame chicken. The portion was more than enough and the sauce was delicious! As for the Singapore noodles, it was rather bland, definitely needed more curry. Besides the food, the decor is welcoming, the service was good and attentive. I would probably give it another shot and order different items off the menu."], ["John G.", "Great variety of Asian food, absolutely love the Pho and Seaweed Salad! AwesomeNeighborhood restaurant with a great atmosphere and extremely nice employees. Nice weeknight takeout spots well, affordable and quick."], ["Ryan M.", "Persuasion was fast, friendly! We were to go but everything went very smoothly. Food was hot and was ready in 10 minutes on a weekday night.The average: One thing I'd say is that the summer rolls were a bit plain. Very fresh with a touch of basil to differentiate, but without shrimp or seasonings they were all texture. The included peanut sauce didn't mesh with them, IMO. I'd also like their fried rice to be a little more exciting/better as I know day old rice is the best but this may have been a day and a half or maybe two. Very few veggies/egg.The good: Our main courses, MuShu and a veggie stir fry, were delicious. The MuShu in particular was probably the best I've had in Charlotte though I'll admit I haven't tried a huge gamut. They included enough pancakes (thank god!) and the flavor was excellent even without the plum sauce.The veggie stir fry was a bit plainer but honestly we also got the plainest sauce that wasn't my first choice. I think their other options would have fit the bill just right. Veggies were fresh and delicious."], ["Niki B.", "Was craving Chinese for lunch and saw this place on yelp - decided to check it out and glad I did!Really tasty food with some Vietnamese dishes as well. Had the spicy thai pork and chicken lettuce wraps and they were awesome! Steamed pork dumplings and pork fried rice also delicious, and the Szechuan dumplings were the perfect amount of spice - everything was super yummy.Great and fast service so perfect for lunch - will def be back!"], ["Maria S.", "Hi.  I give 3.5, but don't know how! Nice lunch-  we tried steamed dumplings. Tasty but when I asked if they were homemade, the wait person said. \" no \"... One of my pet peeves since we can all buy dumplings these days from Costco, HT, Trader Joe's etc. My friend and I shared shrimp with garlic sauce... Nice flavor overall, but shrimp had that frozen/ peel- n-eat taste and texture... Watery and bland, rather than rich and chewy.  This shrimp problem is way to common in our Queen City.   We also shared chicken with black bean sauce . Sauce was tangy and good - broccoli  was fresh and crunchy. The chicken was thinly sliced but texture/ taste not great. I like good chicken such as Ashley Farms' so maybe this is just typical chicken from mass- produced factory. I haven't bought a Purdue type product in years. Our taste buds adapt. Well I hope I will like this more in future! I'll try again... Brown rice was good...  So was  egg roll. Cute looking place with books on shelves!"], ["Gia D.", "Very new to Pho so I don't have anything to compare it to but I was at this restaurant twice this week. Yes! I like it a lot. The seaweed salad, well I could eat some all day. I like the healthy and light flavor of the pho. I have yet to try many other dishes but so far so good. The service is really good. Always attentive and polite. I will be going again probably very soon."], ["Emily H.", "Went for take out. Wasn't expecting such a nice atmosphere. But it was great. The food didn't disappoint. It was quick and inexpensive. I will definitely come back and recommend it to my friends as well."], ["Marianne H.", "First time visiting for dinner on Sunday.  Very good chicken wings, have a lite Chinese flavoring that permeates to the meat with a crispy outside.  Awesome veggy rolls too.  Main course we tried the chicken, veggie saute with fried rice, the sauce was tasty and veggies crisp and fresh.  The fried rice was litely flavored- not heavily oily or filled with peas and carrots,  actually a nice compliment to the chicken and veggies.  The other dish was beef and broccoli in a spicy black bean sauce, and spicy it was!! The broccoli was crisp and fresh and sauce was nicely captured in the veggies- not soupy or overly cloing the flavor of the meat and veggies.  We had this served with brown rice which was very well cooked, again the flavor was allowed to peak through.  Very nice dinner all around, good food, nice cozy atmosphere and friendly staff."], ["Damon H.", "I have to say that this place has the BEST PHO's which is a Vietnamese soup. If you haven't tried this place put it on your list to come try it out you won't regret it!"], ["May L.", "Growing up eating pho for most of my life I was weary of trying it here. To my surprise it was excellent! I love the pho! I've eaten here many times and tried something new each time.  The black bean sauce is great. I like it with beef or shrimp personally. And the chef is kind as to leave out the bell peppers for me and put in extra broccoli. The bar has an excellent selection of wines. I enjoy both red and white and at $6-7 a glass, you can't beat that. The service is great, the price won't hurt your wallet, the atmosphere is relaxed and casual and I haven't had anything on the menu that I don't like. This is definitely a place to try. This is my new favorite spot to go to."], ["Kate T.", "So, seeing the great reviews on Persuasian, and knowing the location is only a few minutes away, I was so excited to check it out. After two recent visits I wasn't as impressed as others, sorry. First visit was an early dinner so I just had the shrimp fried rice. Sadly, nothing to run back for. The rice was good, veggies okay, but I felt the shrimp was probabaly frozen. I wanted to give them another shot for an entree so went this past Thursday and ordered the vegetable egg roll, wonton soup and chicken with mixed veggies. The egg roll, one of the most bland egg rolls I have ever had. It was cabbage only with an overwhelming flavor of pepper and served with an absolutely extreme mustard sauce, ugh. Spit it out and passed on that one. The wonton soup had a good broth, however I felt it needed a little more flavor. And, the wontons, there was no pork inside, just raw wontons, another ugh! The chicken and veggies was good, finally a Chinese restaurant that serves fresh chicken. The veggies were good, but the brown sauce was a little greasy, and the bottom of my plate reflected that. Overall, things were good, but I did have higher hopes and wished  for a great place in Dilworth as we are very limited now."], ["Adrienne M.", "New to the neighb so we decided to try it for take out. As we waited for our food we had a glass of sake and chatted with the owner, Chi. We have tried the shrimp fried rice and pork curry noodles and were blown away by both the flavor and quality! Fresh and not greasy!"], ["Linda C.", "This restaurant is right near work so we brought home dinner the other night and it was delicious. Kung pao chicken and general tso's chicken both spicy and fantastic.  Soups are great, and the steamed dumplings are really yummy.  Prices are reasonable and worth it.  They have a great mix of options to choose from.  A hidden gem."], ["Rose S.", "This place is fantastic.  The couple of times I've been it has only had the fans going & no AC.  it does not make for an enjoyable experience.  The Fried Rice, spring rolls & Lo Mein have been excellent."], ["Tom D.", "I am so glad Dilworth finally has a decent Chinese spot.  This is a great mix of fresh modern but yet still typical Americanized Chinese food. Well worth an in store visit as well as take out."], ["Dee B.", "Staff is great. Service is fine.  We moved from Northern Virginia/DC and we have yet to find Chinese food in Charlotte that is \"traditional\". everything here is Americanized and the food even here at Persuasian was super sweet.  the hot and sour soup was good.  the sauces seemed to be loaded with molasses. a lot of over sweet flavors. the garden rolls bland. the sauces with the garden rolls  non descript. we are very picky vegetarian eaters and look for a lot of oomph and flavor in our veggies and tofu.  We do not like sweet, but more savory chinese flavors.."], ["David C.", "This place has solid pan-Asian offerings with fresh ingredients. Persuasian is now our \"go to\" Asian restaurant. They are consistently good in there execution of the food which seems to be the thing that trips up many places. The staff is attentive and friendly, the wine selection in very good and the beer selection is solid."], ["William W.", "Just went for first time. Planning to go to Zen (which we love) but thought of trying something new and closer.  So glad we did and imagine our surprise to find this is from the same owner as Zen!  Same good food (just the Asian side of menu) and great service in a smaller and more casual atmosphere.  Happy to have in neighborhood."], ["Bekah C.", "Persuasion is a hidden gem.  Chi has great food suggestions and his dad can whip up some amazing authentic pho.  I've suggested Persuasion to many friends and all have had wonderful experiences.  The food itself is delicious but, the people make it great.  Stop in for a bite, you will not be disappointed."]], "Ginbu 401": [["Katy M.", "Delicious sushi - we usually get take-out. Love the \"fire island\" roll and \"salmon dream\" roll! Everything tastes very fresh. Great sushi at a decent price.Remember to grab a take-out menu - it includes coupons!"], ["Christy And John C.", "Finding a reasonably priced sushi place in Charlotte with good quality fish is hard.Ginbu has mastered this!  Their sushi is priced well and they give you a yellow to-go menu that has coupons that you can use for your next visit.  They almost always have a Living Social, Groupon, or Yelp deal.  The best thing about Ginbu is that they deliver for a $1.00 fee plus tip.  Atmosphere:  The service inside the restaurant can be slow at times, but this doesn't take away from the quality and taste of their food.  We almost always order to-go or delivery because they are accurate and you can use the coupons on these two options.Order:   We have had almost everything on the menu.  Our sushi favorites are: Cherry Blossom Roll (This is to die for), Spicy Tuna, Avocado Roll, Fire Island Roll.  Both of their soups wonton and egg drop are excellent along with their chicken fried rice.  Final Thoughts:  We eat here almost once a week and always get take out or delivery."], ["Jennifer L.", "My cousin and I bought a groupon to eat here.  WELL WORTH IT.When I'm in Charlotte I'll come back1. We ordered a lot of sushi. It was fresh and came out surprisingly fast2. I had iced tea- they refilled it plenty3. We both ordered miso soup- this was some good miso- it had some nice extra mushrooms or something in it.Definitely coming back.  Excellent service."], ["Lori L.", "Service is slow but I can't really blame the server. There were literally 3 servers in the whole restaurant. I got the Lo mein noodles. Good with a smoky flavor. My fiancé got smoke salmon sushi and he said it didn't taste right. He took the salmon out and it was literally black. He stopped a worker that was walking by and asked if it was fresh and she responded by saying yes it was and that the reason why it was that color was because it was smoked. I have never seen smoked salmon look like that before."], ["Abby L.", "I always get carry out here and it is very good.  The service is pretty quick.  Everything I've ever gotten was good. I will be coming back."], ["Keri C.", "As much as I really enjoyed my sushi roll and my service... My entree was just sad. I ordered chicken teriyaki and when it had arrived to the table i was instantly disheartened. The chicken that was supposed to be fresh (you would hope) and made to order, was indeed hard, dry and cracked when you folded it or cut it. I would compare it to a wood chip or a match. I had brought this to my servers attention and he got me started some steak teriyaki instead which was nice of him and very considerate. By the time my remake was arriving to the table, my lunch break was about to be over and I was unable to eat it anyways. Moral of the story: the server was great, the sushi was yummy, the chicken based products... I don't recommend."], ["Suzanne S.", "Worth the trip give it a try and it will amaze your tired old tastebuds. Lunch special is a great deal too!!"], ["Kenny R.", "I came in for lunch and what a great deal.  2 rolls and soup or salad for $7.99.  With only a small up charge for more extravagant rolls.My visit was pretty straight forward as listed above, so this review will not take long.  I didn't even look at the other parts of the menu, I just wanted sushi.  I came in, was seated quickly and the service was great.  The sushi wasn't over the top amazing, but there's only so much you can do with basic rolls.  It was certainly worth the price.I would assume there is a wait at peak times as this place is pretty small."], ["Ken H.", "The service has gotten a little less friendly lately, and there was a half dead fly in my ginger salad - not a good sign. My friend mentioned that the toilet paper dispenser in the bathroom was broken, and the waitress' response was. \"Oh yeah, it's always like that.\" No one thanked us for coming in as we walked out, even though there were 4 people working at the front counter. Maybe it was just the Sunday night crew, but would think again before choosing Ginbu next time."], ["Lea L.", "Used the Yelp deal, and two lunch entrees and a sushi roll later we spent about $16 including tip, what a value. I am toying between a 3 and 4 star review but will give this place the benefit of the doubt until I try more dishes. The inside is nothing special, a little on the dumpier side with outlet faces dangling out of the ceiling and bugs buzzing around.I ordered the chicken pad thai ($7.25) and a roll of the fire island (tuna, avocado in tempura style, served /sriracha, masago and scallion $8.25). The service was extremely fast, helpful and attentive.As I expected, the pad thai was a little sweeter than a traditional thai pad thai and didn't have the peanut sauce based taste. Regardless, it was pretty good and I between the shared sushi and noodles I had plenty of leftovers.The sushi was decent, was looking for a little more heat from the sriracha as the server indicated the roll should have a little kick to it. Could have used a little more tuna, but overall I was impressed.Another bonus for this place... they deliver! Minimum is $15 and I believe radius is within 3 miles. Ginbu just might have become my new Sunday night recovery go-to."], ["Kelly K.", "Ginbu is a neighborhood place for me that I like to walk to. It's really a 3.5 IMHO BUT the food is decent and I love taking my daughter there. She loves ordering the LoMein and the seaweed salad. Everything is reasonably priced and there is always a Groupon/Deal. Can't really go wrong. Ambiance is not good, restaurant is small, things go fast. Service is just - ok.  This isn't a big date or hang out place, but a good meal. I've tried a bunch of the sushi and other menu items and it's always good. Recommend!"], ["Amanda H.", "I've been to Ginbu twice before and never really had a problem but this past Saturday when my friends and I decided to go for lunch is a whole different story.. I always order the pineapple chicken fried rice because I know I can't go wrong with that so that's the only thing worth giving two stars for. Sushi was okay (if that).. Presentation is plain (no effort at all put into it) and def didn't taste fresh. You can get better sushi at Harris Teeter.The meat in the beef teriyaki was mushy and had strange texture to it.. My friend had to ask if they could cook it some more but came back out the same. As for service.. Our server wasn't very attentive. Seeing as there was only two other tables, we could've used a little more attention. Now for the lady at the register when we were paying for our bills.. We were NOT pleased with the attitude we were given. Our friend sent back a full plate of food because her chicken was dry and it just wasn't good so she did not feel obligated to have to pay ANYTHING for something she barely took one bite out of. So after that friend refused to pay for that (she did pay for the other item she ordered), this lady decides to catch an attitude while my sister pays, slams the register and doesn't even ask if everything was okay or greet us out the door. I'm sorry but if you have one bad experience with one person in the party, don't take it out on the others. We did nothing wrong and I feel that it was absolutely disrespectful and rude for us to be treated like that. What a shame. After this experience at Ginbu, I'm not sure if I would come back unless I'm forced to."], ["Sheralyn F.", "The sushi was great! However the main entree (schezchun) left something to be desired ... Next time I'll stick with the sushi."], ["Brittany H.", "I will be forever and always a loyal customer of Ginbu. Those crab wontons are in a league of their own!"], ["Abby A.", "Consistently good, fresh food. They will steam anything you want and keep the sauce on the side (handy for a diet) and their sushi is decent."], ["Christi K.", "Ginbu is a quaint spot off Providence. The interior is small but nicely decorated. They offer sushi and Chinese dishes. On this visit, we only ordered sushi rolls. Out of the four rolls that we ordered, none were particularly memorable. The fish was fresh but all the rolls were plain. We usually enjoy more innovative/inventive rolls and combinations. If I happen to be close by and in the mood for sushi, I'd stop again but it won't be a go-to spot."], ["Stacey R.", "Volcano roll delivery. This is NOT satisfactory. Why spend extra $$ to deliver when you get this?!!"], ["Michelle S.", "Walked in on a Thursday around 7pm and it wasn't busy.  So I was worried but let me say this is such a hidden gem.Started out with some crab rangoons and pot stickers. Both were awesome. Oh ya and some asian beers. Tried the Laughing Buddha or something like that for the first time ever. Tasted like Michalob Ultra if anything. For our entrees I ordered my Pad Thai and my boyfriend got a spocy general Taos chicken. He couldnt stop raving about his dish so I had to try a little. It was very spicy which is why he loved it. My phai Thai was a little on the sweet side for me but I tend to like spicy as well.The service was great, and the prices were unbelievably reasonable. Can't wait to head back and try their sushi."], ["Brooke M.", "Fantastic sushi and reasonably priced! It is no secret to our family and friends that this hidden gem on Providence Road is our favorite sushi joint in Charlotte. If you want the best sushi in a nice setting, look no further. The ingredients are always fresh and the flavors are authentic and super tasty. Hands down, Ginbu is fabulous for their lunch deals or dinner out. They always have specials running as well. If you're looking for the best sushi in Charlotte, Ginbu is it!"], ["Debi M.", "Great food, everything was so fresh and fast service and very friendly.  We are going back again today."]], "Wan Fu": [], "Jade Dragon": [["Ryan C.", "Super good Chinese food!!! It's not cliche like most places, it's calming, there's great artwork, and it's nice and cozy! The fried rice was great, plus the rest of the food.The waitress was awesome and attentive, and she was nice. The food came out fast. I'm sure takeout would be great. They need sizzling rice soup though, a Chinese favorite of mine."], ["Justin T.", "We are always treated well at Jade...good service, good food, good environment.Now how about delivering to Piper Glen since Rea Road is finished?  Please???  :-)"], ["Whitney W.", "Food was bland and dry...if didn't order take out and have to be back to work I would of took it back. Both my coworker and I ordered and had the same reaction"], ["Maureen B.", "The Chinese food at this place is amazing.  The restaurant itself is nice, too - there is a decent amount of room for seating and it's very pretty and peaceful inside.I ordered the hot & sour soup and the general tso's chicken,  They were so good!  The soup was one of the best hot & sour soups I've ever had and the chicken was perfect - a little spice but not too much.  The rice was cooked perfectly - not dried out at all, which is what I usually get at most Chinese food places.  The amount of food that came out was very generous and everything just tasted great.  The waitress was very nice.  I will definitely be going here for my Chinese food fix from now on!"], ["Becky C.", "We enjoyed the atmosphere. The service was friendly and fast. But best of all was the incredible food.  It was a great value.  Can't wait to go back!"], ["Meagan B.", "Take out service was fine. Prices seemed decent. Literally THE blandest food I have ever had. I couldn't eat almost any of it. Really disappointed. I had the sesame chicken and vegetable lo mein. Sesame chicken was extremely mushy with barely any sauce. Lo mein was Yellow- not browned and again no sauce or seasoning whatsoever."], ["Fred F.", "I have to say that I was pleasantly surprised to eat at a decent Chinese restaurant in Charlotte for the first time, ever. As someone who comes from an Asian background and having lived in Los Angeles, I've had plenty of good Chinese food before, but sadly none in the past few years in Charlotte. We finally stumbled upon Jade Dragon after reading the encouraging reviews on Yelp. Equally rare is that JD scored a 95% sanitation rating, which is stellar for an Asian restaurant! I have to say that our meal was good (3 cups chicken and basil tofu were tasty; walnut shrimp was decent)-- food here will never compare to the best stuff in LA, but it's more than passable and hits the spot. Jade Dragon is easily the best Chinese food in Charlotte. We'll be glad to be back soon!"], ["Forrest P.", "Chicken and vegetables plate was pretty bland.  Hot & sour soup was also very bland.  They do not have sriracha sauce.  General chicken was good though."], ["Tramela M.", "This is the best Chinese I have found in Charlotte. I am a huge fan if Chinese food and it have taken me some time to find the right one that makes my taste buds sing! We dine in on 4/28 and the service was excellent. My husband order the egg foo young with brown rice and I ordered the honey chicken with brown rice and a side of veggie fried rice. When I tell you that everything was so fresh and delicious! The Jade dragon will be our number one choice for Chinese food in Charlotte forever!"], ["Mitch K.", "A rare five-star rating,  Our now favorite Chinese restaurant in the Charlotte area.Very wonderful food.  They do it right and have some twists to their Cantonese style cooking that we love.  One of those is the \"Szechuan spicy won ton.\"  These are soft won tons in a spicy brown gravy, warm but not hot.  The sauce is of the peanut variety and the won ton dough is \"slimy\" in texture, but they are DELICIOUOS. It is not on the menu so ask for it, in fact, if you are heading there, call ahead to insure that they will set aside an order or two for you.My wife and I fought over the final one and ended up making a second order which we laughed through as we slurped them down.  So yummy will go there today for lunch.Their won ton soup is PERFECT, being golden yellow, flavorful and not greasy or infused with soya sauce.  Marvelous with those soft delicate won tons.  Do wish that they would have a larger order and one with vegetables.  Will have to ask for the \"wor won ton\" type of soup.I find that the portions are fair, but not generous.  Rice is a measured bowl and the servings are OK for two people, but far short of what you get at other places.  You might find that where you order two mains you might want an appetizer or a third main.And don't expect spicy. Cantonese food is generally not spicy, so please ask if they will juice it up if you like more zip to their dishes.  Some dishes they will and others, no.  Chef's call.It was no surprise to me when I found out that the chef of this family-owned restaurant is the former chef of Wan Fu in Charlotte.  This is another reason to know who is in the kitchen.  It makes a lot of difference.Jade Dragon is located in Quail Hollow, off of Rea Road in South Charlotte.  It is in a Harris Teeter shopping center which also contains more of our favorites, like Brooklyn Pizza, The Lodge and Mai Japanese Restaurant.It is a great restaurant."], ["Amy M.", "Just tried this place for the first time tonight. Portions and variety are normal and this place has such great reviews, I figured it would be excellent. I'm not kidding when I say every single one of our meals were horrible. Shrimp lo mein was flavorless noodles. General tsos barely had any sauce and there were bones and cartilage in it! The beef and broccoli-bland and undercooked.  The meat was definitely a shade of pink inside. My shrimp and vegetables in spicy brown garlic sauce came with tails still on the shrimp which was not only gross but annoying and again flavorless. Tasted like salty water.  This was the worst Chinese we've ever had and we eat out all the time. I never post on yelp, but I felt I should for how disappointing this was. $42.00 and everyone was upset. Don't waste your time or money. 18 Asian is where we will continue to order from. Excellent food."], ["Arissa M.", "I saw the rating on yelp before I came in. This place is so great. I had the sweet and sour chicken lunch platter and my mom had the chicken and vegetables platter. The food was nice and hot, the portions were just right. I enjoyed this food so much. Check this place out if you get a chance."], ["Elliott P.", "Great place for a nice and quiet meal. The quality of food is amazing and easily one of the best, if not the best, Chinese places in Charlotte. Pretty large selection of food for meat eaters and vegetarians. Good serving sizes, good prices, and good service. Highly recommended!"], ["Emily C.", "I've ordered take out twice, and both meals were delicious.  The staff was very courteous, and food came out quickly.  The egg rolls were my favorite part.  I will be ordering again!"], ["Elizabeth F.", "Great food, love the delivery.  Really helpful, nice staff.  Our favorite Chinese in Charlotte!"], ["Paula H.", "Best Chinese ever!  Delicious fresh food and lovely presentation. Very reasonable prices and great service."], ["Ron O.", "We were visiting Charlotte and noticed the great reviews for this place.  Every word is true!  The entire experience was wonderful.  We were seated immediately at a four top.  The dining area is absolutely spotless and tastefully decorated, none of the cheap, gaudy prints or furniture here.  They offer a small selection of respectable beers for $3.75, a real bargain and departure from other experiences we had in the area.  We ordered the pan-fried dumplings app, sesame chicken, and General Tso's chicken, both as combination plates.  We agree, best ever, and with hot, crunchy egg rolls too.  Food arrived quickly, very hot, and perfect in every respect.  Sorry, but we advised the owner to raise prices!"], ["Carolyn L.", "This place is so good!Everything we got was sooo fresh tasting and well-seasoned that I am day dreaming about eating the leftovers for lunch right now!We started with the spring rolls and wonton egg drop soup, both of which were delightful!  For the main dishes we got basil tofu, Singapore noodles and eggplant tofu. I was really impressed by all, but especially the Singapore noodles, which were not greasy or dry and expertly seasoned. The shrimp in them were not over cooked or rubbery at all. So surprised by the quality of the food from a Chinese takeout/delivery place!"], ["Troy L.", "I love this place. . I always get the sweet and sour chicken and it's always fresh. Order is always ready by the time I get there.  Very nice customer service!!"], ["George R.", "Inconsistency is the curse of small restaurants like this one. We've eaten here a couple more times and while it's generally pretty good it wasn't as good as our first visit. Last time they gave me a mountain of Singapore fried rice, there was a lot of shrimp in it, but the dish was dry, the shrimp overcooked and it was so spicy that I stopped being able to taste the food half way through it. Also tried the Hunan beef for lunch, it's only like $7. The veggies were crisp, the beef was well done but still  reasonably fresh - unlike at the typical Chinese - but the sauce tasted boring. Honestly, I can't remember what Hunan is expected to taste like.It's still much better than the neighborhood take out joints."]], "Soho Bistro": [["Trey A.", "Finally a place I can find good Chinese food. I've been looking for a consistently decent Chinese joint in Charlotte and I believe I have found it. I ordered the shrimp and broccoli w/white rice to-go and it was great. Better than other places around the area"], ["Anthony I.", "Went here for my One of my Anniversary meals and we loved it.  They let us sample wines before we bought a bottle.  The restaurant staff was really friendly and made you feel like you've been here several times.  They really love to conversation and get to know you.  The food was pretty good for Asian cuisine in the south.  I'm form the north and I'm very particular about my Asian cuisine.  I recommend the Tower platter and the calamari for Apps.  I chose to have the General Tao as an entree which was fresh and had a lot of flavor.  It was basically a premium version of General Tso that you would get from any neighborhood Chinese restaurant.  I would def come again when I'm in Charlotte."], ["Amelia B.", "In the past, I LOVED Soho Bistro.. unfortunately, I got sick recently from eating there, and my boyfriend did too, the same night.  I decided that it was probably unrelated, so I ordered again. When I got the food it was cold and I was so disappointed. They used to be my go-to! If you're looking to drop a few pounds from being so sick that you can't keep anything in your stomach, then this might be the perfect place for you! Otherwise, I don't think I'll order from there again."], ["S C.", "I am always a bit cautious when it comes to ordering Chinese food because its always  either really good or really bad. Soho made my good list! I did not dine in however I had my food delivered. My food was hot on delivery, came at a reasonable time and most of all the tangerine chicken was amazing! I will be ordering from Soho the next time I am in the area. My only complaint is that the online menu didn't offer tangerine chicken to do the online order. It would be nice if they incorporated the full menu online to order from."], ["Sue L.", "This place needs consistency.Ordered delivery on 2 nights and while the first night's order was a big success (spicy ramen and mapo tofu), the second night was unbelievably terrible. My colleague ordered curry noodles and it had NO taste/salt in it whatsoever, and their $5.95 dessert cakes are small pieces of store-bought cakes that were horribly overcharged."], ["Jeff S.", "Looking for a place to eat uptown before a show that is fast and hast decent food?  Well you may want to check out Soho Bistro.This restaurant is located in the Hearst Tower but the entrance is on College Street across from the Holiday Inn and Merts.  The place has nice decor, the seating is a little uncomfortable though.  Chairs are the right height but the tables seemed low.The menu has plenty of selections for meat eaters and vegetarians.  There are like 40 (exageration) types of soup and several appetizers.  Portions are huge!On a visit before a concert at Spirit Square, I had the Chicken with Garlic Sauce with brown rice.  The presentation was outstanding with a carrot in ribbon form displayed on my plate for color.  The chicken dish had peppers and other veggies is a light brown sauce.  Unfortunately, this was supposed to be a spicy dish.  Why is it so hard for Chinese restaurants to do spicy?  On a scale of 1 to five on spice, this was about a 1/2.   Flavor was ok, I just wanted heat!  Prices are great for what you get and the staff is super friendly here.  Our waiter had to ask twice on what I ordered and still missed the brown rice. But he was great at refilling water glasses."], ["Yilin Z.", "Excellent foods! Wonderful people! Great location! Reasonable price! Good environment!"], ["Kumar R.", "This is located in the heart of downtown. Food is average and service is not bad. Will be busy during peak lunch hours from 11:30 to 1:30 PM. But take out is very fast. I have been going here for past 7 years and one thing that sucks big time is the two Cantonese women who manages this place.  They have no idea what is a good service in a restaurant means. They are rude. Literally rude. Half the time you don't understand what they speak in English. No in this restaurant are polite. They serve food as if they are serving people in homeless place. And they never treat you as patrons by the way. Am I eating and dining there ? \"No\". I am try taking out? \"Yes\"Location : 4/5Ambience: 3/5Service: 2/5Food: 2.5/5"], ["Ramón Y.", "The atmosphere was nice in the restaurant.  We had a very tentative waiter all the way until it was time for the check.  He never came back to the table after dropping off the check.  I wonder if he was telling us that the food was free because it was just OK?  Well, when the gal at the front saw me looking around she finally came by to get the check.  Then we ordered a to go lunch which took forever.  Come to find out it was already sitting at the front waiting.  I caught the same girls eyes which is when she finally motioned that the food was there already.  Really? You couldn't come over to the table to tell us?  I can see why she wouldn't hand the to go food to us before we paid but at least tell me it is there already.The food was just OK.  Considering I live in California where we have a lot of true Asian restaurants.  I ordered the noodle soup with egg noodles and the noodles they used were the  fat noodles rather than the thin egg noodles which is what you would normally see in a true Asian restaurant.  It had a good flavor but fat noodles do not do anything for me.  Then I thought, let me try their house fried rice. I normally judge the Chinese Restaurant by the presentation of their house fried rice.  Have you ever ordered a regular fried rice from a Chinese restaurant?  Normally the regular fried rice they just in a frying pan add some soy sauce and that's it.  This was they also added some meat, shrimp and bean sprouts.  I wonder if I should give them my recipe for Yang Chow Fried Rice?  The house fried rice flavor was just OK and I would not call it anything better.  Just OK food is exactly what it is.  There you have it."], ["m c.", "I just called  our delivery order in after ringing MANY local establishments that do not deliver. Their customer service is friendly and quick"], ["Lamarr B.", "This is what an authentic Chinese restaurant is. I discovered this bistro in Uptown on a walk back in 2013, not a week after I got food poisoning from another Chinese restaurant two blocks away from this location. The price is extremely reasonable, the food is excellent and the customer service is top-notch, with a beautiful touch of Chinese characteristics."], ["Christa C.", "I've been going to this place for a few years now, and every time I go it loses another star and another chance. It used to be the best place to get Chinese food but recently it has gotten really gross. Today was the last straw. I got the Steamed Chicken Dumplings and a order of Edamame to go. The dumplings had no taste other than salt,  the dough was so think and chewy I didn't eat my last two. The worst part were the soy beans. Half of them rotten, no salt, no seasonings, just plan nasty and I tossed about half of the order. Come on guys I know you can do better!"], ["Maddie M.", "First pointer: Although the address says N. Tryon, the entrance to this place is on College St (back side of Hearst Tower) so you can decide where to park. We parked at Church and 5th thinking it was just around the corner but then had to walk two blocks which wasn't a pleasant walk on our way back from dinner when it got chilly and rainy.Ambiance: Intimate. Soft lighting and pleasant music. We went at a time when the restaurant wasn't crowded. Only 4 tables were occupied, but I believe this place must be packed for lunch.Service was courteous and our food arrived in reasonable time. Our server kept our glasses full.We ordered the Summer Roll and Hot and Sour Soup. The Summer Rolls were as good as any others (they all taste the same) but the veggies were fresh. The Hot and Sour soup was good (we split it). For the entree we had the Mongolian chicken, which was mind blowing. It had just the right amount of spice, hot enough to open up my blocked sinuses, but not overly spicy. The flavors perfectly melded. The portions were large enough. Me and my boyfriend left the place with full tummies and some leftover Mongolian chicken."], ["Bill H.", "Varied menu from what you usually encounter in an Asian diner. Food was good and portions were the right size."], ["Amber M.", "Lunch time!  A few co-workers and I ventured over to Soho last week for lunch.  So close to my former work space, and CROWDED if you go right at noon.  The tables seem to turn fast, but I'd recommend going before or after the lunch rush.  We had to wait a good 10 minutes for a table that could hold a group of 4 people.  We had two more peeps, but we needed to take what we could get.  After being seated, a bigger table opened up and asked if we could move so all 6 of us could sit together.  They kindly said we could!Ordered the garlic shrimp dish and it was so good!  Food came out about 10 to 15 minutes after ordering! Prices are decent for the portion size.  Small interior and cramped tables.  Wouldn't recommend for parties over 4 if you are going at lunch."], ["Ellen C.", "We had lunch here during a rather unbusy Saturday.  Most places in this area seem to only serve dinner on Saturday so this was one the few seemingly vegan-friendly Saturday lunch spots.Sad to say, my entree was a little bland. It was a tofu, vegetables, and wide rice noodles entree.  It surely looked spectacular with the varied vibrant colors and large portion size, but it failed to delivery on tastiness!  No bother, I drowned the sucker in chile sauce and soy sauce until it was more edible. The tofu spring rolls appetizer suffered from a similar tastelessness.  At least service was prompt and everything was salvageable with a little doctoring up.  I suspect that the omnivore dishes may be more palatable as my companion didn't seem bothered, but she is polite gal, so who knows!  The large portion size did permit me to chow down again later, which is always appreciated when I am about to possibly spend all night throwing back drinks, with little or no vegan options immediately available.  I don't know, I'm willing to gander Soho Bistro is probably not too bad for most diners, but it just didn't do it for me!"], ["Sasha R.", "I give this place 5 stars for the extraordinary service. They make repeat customers feel like cherished friends. The sesame tofu is the best I've had in Charlotte. Breaded and super crispy... Yum!"], ["Sarah F.", "In a lunch rush? You can count on Soho to delivery hot, plentiful edibles in the time it takes some people to get through a long drive-through line. Husband and I met up for lunch just a couple minutes after noon. By 12:30, we'd dined and had the check in hand.Service is prompt, and polite/friendly in a rushed kind of way - they know how to get people in and out, on the double. We were checked on by three different servers, plus one more at the end of our meal after we'd finished eating and the plates had been cleared, who wanted to make sure someone had taken our order!Husband likes the sweet & sour chicken, which always looks well prepared, though I've never tried it since it's not a favorite of mine. This time I went for the Thai Curry Shrimp ($6.99). The curry sauce tasted more in line with flavors I'd expect from Indian food - sweet and heavy on the turmeric - and like it maaay have had its origins in a bottle or package of some kind, but it was still good, and pleasantly, mildly spiced. There were large chunks of vegetables in the mix, and they are not stingy with the shrimp. The brown rice was good and chewy, and spring rolls served piping hot and crispy, straight from the fryer.It may not be the most authentic international cuisine you'll ever eat, but when pressed for time and watching your budget, Soho is as great as anything you could want.One last thing - be care with the address! While the city may put it on Tryon, the entrance is actually on College. I spent several minutes walking up and down Tryon between 5th and 6th, looking to no avail before finally calling Husband, who directed me down to the next street."], ["Todd B.", "This is a great spot. I've been going here for years. The staff there has treated me like family since day one. Every time I go in they call me by name and make me feel special. The food is fantastic too! Go check out this spot."], ["Kate T.", "So, we decided to enjoy Soho today, during the lunch rush, ugh! The place was very crowded, but as others mentioned the service is definitely quick, a little too quick.  We all chose different entrees, which included rice, white, brown, or fried, and a spring roll. I ordered the Chicken & Shrimp with vegetables, and fried rice. The spring roll was a little disappointing, no real filler.  As for the veggies and chicken, delish, but skimpy on the baby shrimp, will pass on that option next time. And, unfortunately I was given brown rice, or maybe it was fried, if so, not great, and on the colder side. Overall, it is a quick lunch, with good prices, but nothing stood out in my mind."], ["Martin H.", "It is my opinion there are no good Chinese restaurants Uptown, and Soho Bistro continues to prove me right.I have been here two or three times now, and I tend to order the more \"authentic,\" or less popular items such as the beef noodle soup, Japanese ramen, and they have both let me down.Also, whenever I come here for dinner I am literally the only customer in the dining area. I think that Soho Bistro must really be only a lunch place."], ["Holly M.", "The service was good and the food came out very soon after we ordered. The menu is extensive and has many different options of Thai and Chinese dishes. The menu offers anything from soup to noodle dishes to stir fry. I ordered their spicy soup with shrimp and it was very good and actually spicy and had a lot of veggies in it. The restaurant itself is but small but went during the week and it wasn't crowded at all! I would definitely eat here again and it's very close to the arena!"], ["Dan C.", "I was teetering between 3 stars and 4 stars, but went with 4 stars!Came here during lunch hour with co-workers to grab a birthday lunch - nothing super-fancy, but something solid.  I appreciated it since no one likes to go eat lunch wif me *sniffle* (They all pack their own lunches or don't eat - \"Lunch is for wimps!).  But yesterday, I had lunch buddies, yay!We all had the lunch special which came out in a timely manner and the place was poppin'.  It was a birthday, so I asked the manager/server if they had anything special for birfdays, she said No.  I said, okay, makes sense - who comes here for birthday lunch.  I ordered a chocolake cake though anyways.  Lunch was solid, maybe a little on the sweet side.  I had the chicken/shrimp/mixed vegetables and the sauce was a little sweet.  General Tsao's chicken (?) was also a little sweet my buddy said.  Oh yeah, AVOID the innocuous looking mustard bottle.  It's not your average mustard sauce that comes in the little packets from Chinese restaurants.  This one was sinus-clearing, eyes-water, fire-breathing. Yeah, it was so hot.At the end, they brought out the cake.  Low and behold, it had a witto candle on top which the manager/owner had to keep from blowing out with the wine glass (damn, asian people are smart!).  It was a nice way to end the impromptu birfday lunch.Will I go here again?  Prob after I've dated a GF for a few months. It's a dimly lit, quaint comfortable Chinese food spot - like a solid 8th dinner date or a 4-year-been-with-the-ball-&-chain(wifey)-and-we-need-to-pretend-we-still-have-romantic-dates place. dmo out."], ["Jo S.", "Pretty good overall. I ordered a spring roll and an egg roll - both were a little bland (and greasy) for my taste. The steamed veggies were perfectly cooked - a combination of broccoli , zucchini, carrots, sugar peas, and napa cabbage. (Heavy on the broccoli.) The white rice that came with my steamed veggies was also perfectly cooked. I also tried the teriyaki chicken skewers - the flavor was excellent, as was the quality of the chicken (lean breast meat) - unfortunately it was a tad dry. I enjoyed it by adding an excess of dipping sauce :) I would try this restaurant again if I'm in the mood for Chinese food.  *On a side note, be aware that your delivery may not arrive when you request - my delivery came 25 min PRIOR to my requested time... just as I was getting out of the shower- yikes :)"], ["Clint M.", "Excellent food and excellent service. Wait staff is always very attentive, constantly refilling drinks, etc. Lunch rush does make for a bit of a wait, but there are only so many tables. Highly recommended."], ["Ben T.", "Probably one of the best affordable ethnic places to eat in uptown, I think this kicks Basil's butt any day. I usually come here for a dinner date, it is usually quiet.Oh and did I mention the best fried egg rolls I've had. Ever. Fresh crispy crunch, worth having at least once a month if diet is not a question for you."], ["Justin D.", "***BE WARNED! THE ADDRESS IS TRYON STREET BUT IT'S ACTUALLY ON COLLEGE STREET. YOU CANNOT GET HERE FROM TRYON***Four years after leaving south Charlotte I finally find a Chinese place with reasonable enough prices and good enough food to rival Taipei South!Everything I've tried at this place is fantastic! Several months back I brought my mom in here for a lunch break while showing her around town and now every time she comes to visit and lunch or dinner time rolls around she wants to go to Soho. It's only the large number of other great restaurants in the area that keeps us from eating here every time. The egg rolls are perfectly crispy without being greasy. If you order something with shrimp you actually get a decent amount of shrimp. This alone is enough to make Soho stand out among all the other Chinese restaurants in the same price range and even some that are considerably more expensive."], ["Annie W.", "This would have to be the best Chinese food I've had in Charlotte, which isn't saying a whole ton, but it was solid. Not busy at all on a Wednesday night. Service was quick enough. Located at the backside of the building, so not really on N Tryon St. Had the Shrimp and Chive Dumpling appetizer and definitely satisfies any craving for leek I've had, but definitely too oily. Had the Spicy Thai Curry with Tofu and it was flavorful and wonderfully spicy! Also tried the Garlic Shrimp and Scallop dish, which was also nicely flavored. Felt weird eating Chinese food with a fork, so I asked for a pair of chopsticks, but the chopsticks were crap, you know the kind that break apart at a strange place and taste like chemically treated wood. Bah! Overall a good place to soothe my major Chinese food cravings!"], ["Jenni P.", "I've been a regular visitor of Soho practically since they opened, which is probably close to 10 years ago at this point.In all of my travels around the world, Soho's chinese food is just about at the top of the charts.  They use fresh ingredients, have a fantastic staff, and will alter any dish to your likings.  They have an extensive vegetarian menu, and also will make the standard meat dishes vegetarian.Ownership and staff is top-notch. It's not your run of the mill chinese place with generic sauces and formerly-frozen veggies.  Everything is fresh and wonderful."], ["Elizabeth A.", "Came here for the first time on 1/20/2012 with friends. Atmosphere isn't overly fancy like some places downtown, but definitely way nicer than your average take out Chinese.Ordered sesame tofu since it's my old faithful at any Chinese restaurant... and boy was I impressed!  Definitely the best sesame tofu I've had since \"House\" on Independence closed down. Tofu was a perfect amount of chewy and crispy and not overly sauced. Steamed white rice was delish and spring rolls were definitely superior than any other I've had, but I couldn't put my finger on exactly why.Vegetarian friendly.The only down to this restaurant, like any business in downtown Charlotte, is that you have to park in a deck or meter on the street (if you can find one). I know for sure that Hearst Tower parking tickets can be validated by Soho so that parking is free!"], ["Sallio H.", "If you haven't had the eggplant dish, you're missing out. I was craving some non-green veggies and it totally hit the spot. I wiped the whole plate clean. One disappointing thing to note is that the eggrolls are horrible. :( How can you mess that up at a chinese restaurant? The filling seemed to be made out of leftover scraps (tiny bitty pieces of ground meat (or not meat? i couldn't even tell), and barely any cabbage). It did not taste good at all no matter how much duck sauce I poured to cover the weird taste."], ["Kathy C.", "I was staying at the Holiday Inn for a business trip and this place was within walking distance.  For convenience, I actually had food from Soho twice during my short trip.  They were A-OK... is the best I can describe it.  Is the food hot and fresh, yes.  Is it very yummy... eh, not really.  I've tried a duck dish, a kung pao chicken dish, wonton soup, fried rice.  Nothing was bad, but nothing wow'd me either.  So, given the location and price point, I'd go back again."], ["Rachel B.", "Me, the fine newcomer Elizabeth A. and Heather X., went here on a rainy Friday at 330pm and I left wanting to come back the next day.They still were serving lunch at 330 which ROCKED for moi, who is a chronic late luncher since my job lets me sleep in a bit :) Parking in the Hearst Tower lot is the best idea since they validate your ticket, so be sure to bring it in with you!A smaller place than I expected, there's a great, mellow vibe here. The lights that hang over the tables are beautifully warm with medium colored wood and soft white bulbs inside frosted glass. While empty when we arrived, I can definitely see this place being crowded at lunchtime between 1130-130 so heads up on that! Calling it in seemed to be a pretty good option and one that was utilized alot while we were there!Starting off with crab ragoons and asian fresh rolls, we shared and IMO the crab ragoons really shone about and beyond. The fresh rolls were good, but I wasn't a fan of the sauce they came with (reminded me of an Indian fig sort of thick sauce) and the duck sauce wasn't meshing well with it either.I ordered the General Tofu and while I feel like I'm piggy-backing onto Elizabeth's review, it was true that the tofu was PERFECT. I mean, HOLYYYY MOTHER THIS IS PERFECT. From the fry (not overly but not soggy under), to the sauce (I asked for it extra spicy, and they delivered!), to the picking of your own veggie (I choose brocoli which came out not mushy, not stiff but the almost unreachable middle ground) and the delish spring roll (something is added to this that is not in most - no clue what but it makes it hearty but still light).The service was attentive, kind and accommodating, the space was intimate yet casual and the food was stellar. That's a WIN WIN WIN in my book! Enjoy!"], ["Andrew P.", "This restaurant has been open for over 10 years,  and the food and staff has been great and very consistent.  My favorite is the Tangerine Chicken,  and my wife loves their Honey Walnut Shrimp. I've never been disappointed with my food."], ["Mark C.", "When I use to work in Uptown Charlotte, I would typically eat here almost once a week.  It is rather small restaurant, and always has a line around Noon, but it's worth checking out.  Typically, I order the Tangerine Chicken with white rice and egg roll (substitute from spring roll); the wait time varies 5-10 minutes from order to table.  The portions are good compared to price and I never had any issues.  There is outside seating available, but its on the street and it can be pretty loud.  Overall, worth checking out if in the area and have a hankering for good Chinese food; if you go during the Lunch rush, try to go early or late."], ["John T.", "Visited Charlotte during my vacation and must say this is one of the nicest more friendly people I met during my road trip and the service at this restaurant was par to none.  My server was very polite and helpful.  My comment to her after passing the menu right back to her was \"Suprise Me\".   What she started me off with perfectly stuffed fresh spring rolls.  I have had rolls from many asian restaurants, but non had this much shrimp inside.  Being use to other places that slice the shrimp and put less than half at times in the roll.  These were filled very nice and had great flavor.   She kept my tea glass full, which might I add I did not use any sugar.  It was fresh and tasted right.   My entree came out and it was pepper beef I think.  Crispy beef.  Great flavor, done so well with great seasoning and the rice was tender and nice.   I thoroughly enjoyed this visit to this business.  Stop in and enjoy."], ["Johnny M.", "I just moved here to Charlotte from NorCal and one of my favorite foods to eat back in Cali was Chinese food.  So I was excited to find this place.  I have to say it does NOT compare to Chinese back at home. I ordered potstickers (called dumplings here) and the skin was too thick and there was barely any meat inside.  Not a good first impression. I wanted chow mein so I ordered the House Lo Mein...too salty.  They put too much oyster sauce or soy sauce.  This also made the noodles squirmy.  I ordered broccoli on the side and at least that was good.  I hope there are better Chinese food spots out here.  Since this place was in Uptown I hope this isnt the best they got...3 stars because their service was good"], ["Travis W.", "Typical, quick in and quick out style Chinese food joint.  I've only had the lunch here and each time I've been pleased.  Portion sizes are a bit large and they keep the drinks coming.  Avoid getting a soda here, they tend to be flat.  I think they just buy 2 liters probably.  Service is always quick, almost too quick, they love to push the check to the table ASAP.  I understand that though because this place does get pretty packed during lunch."], ["Kimberly F.", "WOW! Very good food!!!!! The wait staff was very friendly and quick!  I always love the sharing family style of chinese restaurants!  You must go here!!! AWESOME PLACE!!!!!  And the person who suggested the donuts!!! THANK YOU!!!! THEY WERE AMAZING!!!!"], ["Erin R.", "We stayed at the Holiday Inn Center City for a trip and happened to visit Soho Bistro for dinner on a rainy evening. The restaurant is clean, well laid out and appealing. The staff was exceptionally friendly and our waiter was a young man who was very eager to please. Unfortunately, the food was sub-par. The egg roll and scallion pancakes were hot and tasty, but our entrees were disappointing. I ordered honey walnut chicken and was served honey walnut shrimp. This wouldn't have been a big deal, but I have a shellfish allergy. They corrected the error, but when the chicken was served, it was burned and it was clear that the veggie garnishes were transferred from one plate to the other. My dinner companion ordered noodles which he described as tasting like watered down spaghetti with weak curry sauce. I can't stress how nice the people were, but the food portion could use a visit from Kitchen Nightmares."]], "Panda's Den": [["Christine W.", "They have really really great and authentic rice wiz stewed pork. The flavor is almost the same in Taiwan! And price is really reasonable with such a big bowl. You should open one in the university campus hh"], ["Mike S.", "Hello friends, This place was (only because I moved across town) one out my two favorite spots to go to. It seems before you finish placing your order the food is coming out of the kitchen. This was the main reason I was a fan of Pandas Den (PD). The portions are pretty big. The wings WERE big as well but my last visit...well not so much. They wouldn't dare let you drink be 1sip away from full. On my last visit, the corner booth was Rank!!!Go enjoy,TTFN"], ["Cynthia Allie L.", "I love going to this place they have really good authiec Chinese and Taiwanese food. There food are good and really big portions. The sever are really nice and the manger there is super nice and awesome. They staff treat you really well. I try to come here often as I can:"], ["Yingying C.", "I need to give it a high rating because it can count as the best Chinese restaurant in Charlotte University area.   The owner is always very nice and humorous, and service come check you and add water very often!Good food to go: Pork Rice Combo, Three Cup Chicken, Onion oil Cake, Vegan Chicken, Ants Tree, Soup......So many"], ["Tieren S.", "I must say the service is top notch. Never have I experienced such superb service at a Chinese take away restaurant. Smiles, attentiveness, greetings... These are a few of my favorite things when it comes to good service. Now as for the food. Apparently, you don't have to be at Burger King to have it your way. I wanted broccoli, snow peas, and and another veggie in garlic sauce... I got it. No: \"That's going to be extra cost\" or \"We can't do that\". I got what I want. It was good too. Nothing to run screaming in the streets over but good. The tea was aight and I tried a rib... \"Just one rib\" It was good. I may actually dine in one day. Did I tell you how good the service is?"], ["Rena H.", "Pork rice is nice! Friendly services, and fast! Fried chicken (Taiwan style) is a great try, crispy and good authentic Taiwan taste."], ["Theresa C.", "The best Chinese place in Charlotte! Been coming here for years, family owned and quick service! Always refill drinks before you even notice you're low. The moo shu chicken is delish!"], ["Xiao L.", "Pork Bento is great, hardly to find a good Chinese restaurant near the university area, it is only 10 minutes drive from my home so it is convenient. Recommend: Wt Harris Blvd meets traffic jams every afternoon, be prepared to wait on the road at least one hour if you go to Panda Den's after 5pm! Go early if you can!"], ["Ed B.", "Always excellent service, whether eating in or stopping in for take out. Love the hot and sour soup and the house special lo mein"], ["Kenny R.", "A step above the rest in Charlotte area cheap/fast Chinese food.YELP TO THE RESCUE!!!  As I'm driving way down Harris Blvd one day around lunch time, I get a hankering for my weakness.  Cheap Chinese lunch.  As soon as I whip out my yelp app, not only do I see a well rated place close by, but a place that is well rated by no other than Chad E!  Oh, I was excited.Chinese restaurants near the not so nice side of town are always hit or miss, and this one was almost perfectly spot on.  I went ahead and read some other reviews to get an idea of what I may want.  One yelper said that hey loved the hot and sour soup and the Hunan beef so much he had bribed the owner for the recipe, so I gave it a shot.My waiter, was soooooo fast.  Almost stalky, but not in a bad way since it was lunch time.  I drink a lot of water and I don't think it was ever less than half full.  The soup came quickly.  The first couple bites were great, rich, and perfect with the crunch of the noodles I put in.  Although, It did get a little overly salty towards the end.My Hunan beef came shortly after.  Beautifully thick looking sauce and a nice portion sized per $.  I took my first bite hoping for the best and it was soooooo close.  Amazing flavor for a quick cheap spot, but yet again over salted and that was pretty much the story of the meal.  Even the eggroll tasted overly salty.  That is the only reason this place didn't get 5 stars in my book.Maybe I was off kilter, maybe my taste buds were overly sensitive, that did come to mind once the eggroll wrapper tasted so briny.  I guess I'll have to back and find out.  Anybody want to join?  They have a lunch for 2 special, 3 things off the menu, to rices, and 2 eggrolls for less than $14.I'll be back!"], ["Bill A.", "I had dinner there this evening . The food was excellent and very beautiful. My wife had general Tsao's Shrimp  and I had Shrimp Curry which was wonderful. Bravo 2 the chef"], ["Mandi P.", "I almost feel sad to write a bad review but this place used to be my favorite Chinese restaurant of all time up until recently. Recently the inside of the restaurant smells bad and the last time I went a roach fell from the ceiling onto my fiancé's plate!!! It was traumatizing and we have not been back since that day (last fall). I used to love this place but it is just not what it used to be. If anyone from the restaurant is reading this, please work on the sanitation so life long customers will return for the food we love so much."], ["Joe S.", "There are not too many places I would fly across the country for, but this is one of them. I am a former resident of Charlotte, NC and my wife and I would come here for some of the best chinese food! Now we fly out from Utah at least twice a year to indulge! There has not been one thing on the menu that has not been absolutely INCREDIBLE! The service is spectacular! We have always been met with a greeting and special ordered items are never declined. Make sure you try the sweet tea. For a chinese place, they have southern style sweet tea down right!!!"], ["Christian D.", "Pretty solid Chinese.. Just didn't like the sweet and sour chicken.. But that was because it was already in the sauce.. But the rice, perfect! Still yet to find my go to Chinese place here in Charlotte that is a good substitute for my Boston, MA Chinese, but this place is very solid. I'll be back for sure..."], ["Basshector J.", "The wonton soup here is DYNAMITE. It says $5.50 for two on the menu. I intended on only one serving and figured it was too late. My server brought back one bowl and I pointed out it had said 2 person for 5.50. I asked if I could only pay half and they gave me the bowl for only $1.35! Really great deal. That could be a meal in itself. If you don't eat pork, do not get this. It says it's a mixture of beef, chicken, and shrimp...I can assure you, it is pork. I'm sure a bunch of people who don't eat pork have accidentally ordered this...and well, enjoyed the HELL out of it. Because it's good.My boyfriend, Iglesias, and I got the General Tso's (dear people, it is not pronounced General Toe-so's) to split. To me, General Tso's tastes the same no matter where you go. Mall food court or sit down Chinese- the same. There were some plump, tender pieces of breast meat that were good. Otherwise there's always dark meat and what seems like fried connective tissue in the mix.All in all, I will be coming back for the wonton soup."], ["Ashley H.", "I absolutely love this place! Truly, I do! I have frequented Pandas Den quite a few times, and each time there is always stellar service, the food is up to par, fresh and excellent! Strangely, I always get my waiter as a young man named Nestor!! He is awesome! So sweet, always attentive to my cuisine needs and just overall a pleasure! A true gem to the restaurant! I love the fact that I am a vegetarian and they have options for me!!! That's fantastic because us non-meat eaters eat Chinese too!! They have tofu with veggies and I promise I've never seen veggies so fresh!!! Absolutely love this place! The owner or manager (not sure which one he is) always asks about my dining experience; they are all so excellent as well as the food! Great choice; Top choice!"], ["Christopher M.", "I have avoided trying this place for three years now and that has been three years too long.  Panda's Den is actually a charming little Chinese place if you can believe it!  What made me avoid it to begin with was the area it is located in.  That said, I am learning that despite the area being a bit old and rough in places, East Charlotte has lots of little culinary gems if you just give it a chance.Panda's Den itself is very clean inside and prompt with their service.  The people dining there seemed normal when I was there ( a real plus!) and the wait staff was suited for the venue.  The dining area is simple and hints at welcoming atmosphere.  I would bring my family here if we wanted a quick bite.The menu is probably like you would expect: lo main, general Tao, etc..  I actually think the food was great! I would put it in the top five Chinese places in Charlotte - that I have been to.   To enjoy this place, I would not go in expecting grandeur and opulence or even an interesting atmosphere.  If you are food minded, you are half way there but don't get hung up thinking that they will cook the same style of Chinese food you loved in college.  Just enjoy it for what it is: a big step up from a decent \"to go\" Chinese place."], ["Randy W.", "Quick lunch, good-size portions and fast service ... that's Panda's Den.One of the best lunch bargains in town. The sesame chicken is first rate, soups are good and the fried noodles at your table are addictive. I like the white rice over the fried rice - if you're making a choice.Your glass will never be empty. The service is always fast. Maybe too much, but I'll take that over not enough.Worth a visit at the intersection of Harris and N. Sharon Amity."], ["Eddie G.", "I stopped going to the Panda about twelve months back.  It seemed that after Bob retired that the service and quality had decreased.  Today I decided to give them another try and by Georgio, I think they have the touch back.  My two favorites have always been the Hot and Sour Soup (the best in all of Charlotte - I even tried to buy the recipe!) and the Hunan Beef.  So that is what I ordered for lunch today - my two most favorite Pandas Den dishes.  Service was very good today.  The food was heavenly.  The atmosphere was quite (my favorite sound in any restaurant).  I found myself sitting and drinking hot tea for some time after my meal.  It was a good experience.  I will definitely start going more often and using them for meetings and gatherings again."], ["Taylor C.", "This is my favorite Chinese restaurant so far! The food, prices, portion, and service is amazing. My favorite thing to get there is definitely the orange chicken(you should try it). This place has a very chill and welcoming atmosphere, so it is a great restaurant for the family."]], "China Wing": [["Corbin B.", "BOOM!   You are missing out if you dont try this place.  No frills. No froo froo atmosphere.  Just really good Korean BBQ. I have been trying to get here for a while and was finally able to sucker a friend into going.  It is a little pricey for the portions but still damn good Korean.  I will be back most definately."], ["Debra W.", "I quickly learned that the Korean food scene is pretty non-existent in the Charlotte area. I have actually put off writing this review with hopes of coming back but that hasn't happened.I ordered jap chae and bulgogi. The food is good but pricey. I paid $30 for two dishes and was surprised at how small my containers were. The bulgogi was tender but not the super thin cuts of meat I was anticipating. It was more chunky but still tasty. The jap chae noodles were on the very soft side. I am very familiar with sweet potato noodles and I just felt that they were not cooked fresh, had been sitting for a while and warmed up with fresh veggies on my order. I could be wrong and maybe they just over boiled them but I wasn't impressed.I have wanted to go back just to try their bibimbap but just haven't yet. If I get a hankering for Korean and I am going to spend as much I spent, I rather go to the Asian market and make everything my self."], ["Brandon B.", "This place is def.an example of not judging a book by its cover. Its kinda in the hood...a converted Long John Silvers that serves Chinese and Korean foods(interesting concept). Its the kind of place that I would normally drive right past but saw that received good reviews and I didn't want to pay $15 for Chinese in the Southpark area near my office. The lunch special is $5.99 with a free sweet tea. Good deal. I ordered chicken and broccoli with rice. The portion size was smaller than normal Chinese food portion sizes but it was also lunch time. The food was good. The chicken was good quality, not overly sauced, and the broccoli was crisp.The service was good as well. The cashier(maybe owner) talked with me while my order was prepared so that was nice. I will definitely be back to try some of the Korean specialities on the menu."], ["Donovan C.", "Best Korean food around. Generally they only offer two side dishes with the entree. Kim Cher and preserved turnips.Today I had the Summer Bim Bim Bap with Spicy Pork."], ["Carmen C.", "Alright. This is MY spot! Just moved from NY and couldn't find a dope Chinese spot. Here it is! Kind of sketchy at first but do not judge from the outside! Very friendly environment once you're inside. I only eat beef and broccoli and I'm picky with different restaurants. I don't like my beef to taste raw and chewy and they perfect it for me (after ordering it well done) The portions are huge! I'm currently here for the second time waiting for my order."], ["Tram T.", "They have changed the price of the menu. It is more expensive. I have eaten a not-big plate with normal rice and chicken with 7.99. You had better spend a little bit more money to get a lunch buffet instead of choosing this place. (If you want to fill your stomach) And there are no lunch specials anymore. So disappointed :("], ["AJ M.", "I had pretty good authentic bibimbap at a place called China Wing, even though owned by Koreans. Yep - that's the South for you. However, it is easier to find and more of a dining room feel than PePeRo, despite the Wendy's(?) layout that I presume was in that location before.The service was great and the food was good. A bit pricey for the ambience but you pay for authentic food. I'm sure people do come here for the cheaper Chinese food which I'll come back to try along with the other Korean dishes, like the wings."], ["Maisee L.", "- I've driven past this place a few times but was hesitant to stop in to give it a try. The outside looked a little run down so it seemed a bit sketchy to me. The inside could use a little renovating as well as putting the AC on. When we got inside it was quiet and lacked decor. The Korean food here is good, even tho the actual restaurant is deceiving. I must say the bibimbap is better than any other I have tried in the Charlotte area. The bulgogi on the other hand, was good, just average. One thing I would recommend is to not go on your lunch break. With only 1 person serving the whole place and what seems like only 1 person making the entrees in the back, you're time does get very tight unless you call ahead. Overall don't judge a book by its cover. What seems to be not appealing on the outside (& inside ) has pretty tasty food."], ["Esther L.", "food taste just as good as my mother's so far from what I have tasted.  price is reasonable,  other korean restaurants Ive been to are priced higher.  I can't believe charlotte has only 2 korean restaurants to eat at!!"], ["Daniel B.", "I had much higher expectations for here but have to admit that it is one of the few places I can get Korean in Charlotte. What worries me however is that I visited for the first time as I was coming off of a smoothie cleanse. At that point I'm afraid anything would have satisfied my hunger.We ordered the Korean-style wings, an order of beef bulgogi and pork dumplings. The wings were meaty and I will say I was a fan of the sauce. However, at just over $1/wing I can't help but feel kind of ripped off. The bulgogi was one of those things that I was happy to see as I typically only get to indulge in it in New York or DC/Northern VA. I'd say it was \"good\". It was almost \"very good\" but for some reason I kept getting a very \"gamey\" flavor from it. Other than that it was a generous portion and the rest of the flavors hit the spot for what I'd consider decent bulgogi. That brings us to the dumplings. These I would most certainly pass on! If they weren't from a bag of frozen dumplings from an Asian market then I have serious worries for the cook given that my first attempt at making homemade pork dumplings was light years ahead of what I got out of the dumplings here. Like I said, I can't help but think they were just frozen dumplings and for that I would avoid. I know this can sometimes be difficult when dumplings (otherwise a delicious nugget of goodness) are on the menu.Service was great! We were in for lunch and although it was just us and another table the server were very attentive and didn't make us feel rushed. Food was prepared and served quickly as well.I feel like I might be stretching a bit at three stars but given the limited options for Korean in Charlotte I needed to give them the benefit of the doubt. However, I am making it my self-proclaimed mission to seek out and consume some of the other delicious Korean delicacies that do exist in Charlotte (although a little further from Center City than I'd like). Depending on the experiences elsewhere I will be sure to update my review accordingly."], ["Samantha S.", "Came here for quick Korean food.  Ordered the beef bulgogi.  I ate the whole dish by myself!  Don't judge before trying the food!"], ["Bernadette C.", "I have been desperate to find a Korean restaurant since moving to Charlotte only to find that a place called \"China Wing\" five minutes from my house was it.  The place lacks decor, but I wasn't there for that anyway.  Grabbed some bibimbap and kimchi jiggae for lunch ($12-$13 each) and was pleasantly surprised that they were pretty good.  The service was great - waitress really attentive.  I would have given 4 stars if the side dishes were better.  The picked radish wasn't the taste I was hoping for and the others were just a little more bland than I'm used to.  Nevertheless, I will be back and will probably be ordering their lunch special while working at home during the weekdays.  $5.99 with free sweet tea!"], ["Mari J.", "You know why I'm here...I came for the wings. While I haven't tried much else on the menu besides the gyro and the philly, I must say the wings are finger licking good. I've never been disappointed with them. I tried their fried rice once, but it's nothing to rave about. My only complaint is the long wait time, but I guess that's the price you pay when your food is made fresh."], ["John W.", "Delicious! Amazing Korean quisine. Great vegetarian options as well.  Would give 5 stars but decor and style is severely lacking.  Hostess/waitress is VERY knowledgeable about the dishes and options available (not to mention beautiful, which has no bearing on her job of course)."], ["Jin N.", "I'm in Charlotte often for work and this is my go to place for good Korean. Happy to have found it. An unassuming place with a non-Korean restaurant name but has good Korean options, also delicious. Often I stare at the menu wanting to order more than a dish but well, my stomach capacity is limited. I don't give many reviews, one because I'm rather new to yelp but two, I typically review when it's a place that made my day(s) better and this is one ;)"], ["Tony M.", "Good food and a drive thru too. All kinds of food from asian specialties to wings...hmmmmm"], ["Kenny R.", "This \"Chinese\" restaurant serves cheese steaks and looks like an old Captain D's.Its not bad, its just not that good.  Especially for the price.  If you want me to enjoy mediocre Chinese for lunch it better not be much more than $5.  Plenty of other options out there."], ["Christie N.", "This is my second time being here. Today I had tried their lunch special for 5.99 which includes ice tea, choice of fries or fried rice and main entree. I have to say I'm kinda bummed about the portion size. It's like a kids portion. The fried chicken is alright, a bit dry and the rice isn't something to remember. I would give it another go since their menu is extensive. They include American finger foods, basic American Chinese food and Korean food. Their kimchi is alright, it is a bit fermented but it's still good if you go with the flow. I just wish the portion size was little bit more for the price I pay on the Korean menu. Then again I might be asking too much since this is Charlotte, where authentic Korean is very sacred."], ["Rena H.", "Korean food was good, better than most of the Thai & Chinese places in the area. Orders house special rice & wings & Korean bibimbap (mix rice with beef and veges). All tasted good."], ["Joe S.", "Pretty spot on Korean food!  Hey if you guys at China wing read this please open up a proper Korean restaurant in Charlotte.  There are almost no Korean options in Charlotte !!  Good value excellent food."], ["Karen L.", "Driving up to China Wing was a little confusing.  I desperately was looking for some delicious Korean food (being 1/2 Korean) during my biz trip to Charlotte and found this little gem named, oddly enough, China Wing.This is a family owned business that serves delicious and authentic Korean dishes as well as Chinese and some Greek food.  Unusual combination, but if you have picky eaters in your group then know there are other options to choose from.  During my frequent travels to the city, I've enjoyed eating at China Wing at least 5 times.  I've gotten to know the waitress and have brought colleagues to the restaurant to eat.  Again, I'm glad the menu had options for picky eaters.  The dolsot bibimbap is delish.  The spicy pork is yummo.  The kimchi is right on.  My mother would probably be more critical as she is an amazing Korean cook, but I will certainly return for future meals. Always great, friendly, and personal service.  The prices are very affordable for Korean cuisine in Charlotte.  Don't let the building fool you.  Try it then decide for yourself.Cheers!"], ["Sarah L.", "Excellent meal, and fabulous service!  The young lady that served us took time to explain the menu and each dish to help us Korean novices select our meals.  We shared several dishes and we thrilled with each.  The decor was outdated, similar to an outdated fast food restaurant, but the food made up for ambiance.  Will definitely be back!"], ["Randy P.", "Went here last week for the first time.  It was delicious so we came back this week to try more.  This time we had the wings and bulgogi, both of which were fantastic.  The proprietor remembered us and made a recommendation for our next visit which will probably be soon."], ["B D.", "Add this to your list of places to try. Food is fresh and exciting and very flavorful. It was so good I had to eat lunch here 2 days in row!"], ["Eddie Y.", "The korean food was very flavorful.  It would compare very favorably to restaurants in LA.  The only drawback is that they do not give a wide selection of side dishes (banchan) to  accompany your meal.  The service is wonderful.  The lady is a Jackie-of-all trades, and is very attentive to whatever you may need."], ["Dan C.", "For those Charlotte transplants from other big cities like LA or NYC, this is definitely one of the places to go for some solid authentic Korean-Chinese dishes like jajangmyeon, jampong, and bibimbap.  These are the three dishes that I've had from here over the course of a few months.  I can't wait to try them all!I wanted to give this place 5 stars, climb atop a nearby mountain and shout out how their place is awesome... but man, they give you side dishes of kimchi and radish.  Both were waaaaaaay to fermented to the point that the radish side was a little yellowed and tasted bitter from being old.  Keep the radish fresher at least!Kinda lazy on an early Friday evening before going out, so I'm not gonna break down dishes and stuff and what I thought.  People that have had Korean food from Koreatown in LA or NY or wherever would consider their food to be legit.It appears the place is owned by Koreans, so much props to my peeps for making good Korean food.  The dude who was there was about my age and a pretty cool dude.  Friendly.  Oh yeah, they have all this other stuff on the menu too like wings and stuff, but I have no clue if it's good.  Go for the Korean! dmo out."], ["Fleece P.", "If you are looking for homemade, authentic Korean cuisine, this quaint spot has it! The owners are very kind, the decor isn't fancy but who cares, the food is delicious. Always take friends who want Korean here."], ["Jorge T.", "The market forces them to have less bonchon selection, but grateful they are here.(Dolsot bibimbap - pictured)"], ["Faith D.", "Nice variety sure to please anyone in your party. They have chicken wings, gyros, seafood, Chinese entrees, and Korean dishes.Great lunch specials for $5.55, including a drink...but not their Korean menu. We went for the Korean (ask for the special menu)...and we were not disappointed. I stuck with a traditional Korean favorite, Bibimbop. It was delicious! Swirl all the ingredients together and add some of their red pepper paste (which is really thick) and you've got yourself a hearty and scrumptious meal! Between my husband and I, we both agreed that the best part is the rice that cooked to the bottom of the hot pot...crunchy! By the way, I think it's genius to have it in a clay hot pot, every bite is just as hot as the first. Highlights of this restaurant: 1. Like in many Latino establishments, they play novelas..here, they play Korean dating shows and Korean music.2. If you are up to trying something new, no worries, they have a photo of every item on their menu. Point to order!3. The booths are pulled away from the walls. Might not be a big deal to you, but it warranted a lunchtime conversation.4. Friendly service!Go support a local business and try something new and exciting!"], ["Tae-Sun K.", "After reading all the great reviews including the endorsements from my K-Town peeps, I went out on a limb and ordered jajangmyun and Korean fried chicken. Oh no. You guys really let me down. First, it wasn't authentic . . . which I suppose it doesn't have to be, but the recipe and delivery was also poor. I'll give this place another try because quite frankly if you want Korean in Charlotte, your choices are this limited."], ["Edwin S.", "Horrible food, worse service.  Nasty, you can see nasty in the kitchen.  Not good Korean.  GO TO ANYWHERE ELSE!!!"], ["Javier M.", "There doesn't seem to be that many Korean places in Charlotte... I know of maybe 4 or so, and driving up to China Wing you'd never really guess this has some of awesome Korean fare. From the outside it looks like yet another crappy, MSG-ridden, over-sauced American-Chinese hell hole. Even when you walk inside, you're still not totally sold you walked into the right place... Boy, are YOU wrong for thinking that! I've been here twice and both times I've been very impressed by their Korean food. I don't know how their Chinese or American dishes are since I never get them, but the Korean dishes are great!This time I had the Dolsot Bibimbap and it was very well serviced. The cute cashier asked me if I'd ever had it before, to which I lied and said no. She gave me a very nice and friendly lesson on the dish, the name and what it means all while practically prepping it for me and serving it. She stirred my pot (no pun intended) and suggested how to eat it and what not. Very nice.Before my Bibimbap arrived they bring out a bowl of shredded chicken soup, some kimchi and this sweet pickled radish with sugar which was out of this world.So, all in all, it was a great visit, great food, great service and great info.But let's knock off a couple stars.One because I've had better Korean food and because when you first walk in, you can get a little confused between the Chinese and Korean and hamburger signs on the wall.The second star was lost (and I'm being nice here as I usually knock off two stars for this sin) because they serve you unfiltered water. I HATE IT when a restaurant serves me unfiltered water. It's disgusting and unclean and it can ruin your meal. I only took a sip and thought about sending it back. But figured the girl had been nice enough and the food was good enough that I could do without."], ["Rhonda S.", "First Time eating here. First time eating Koren. The young lady who waited on us was very helpful and polite. She helped us with the menu and got us to order some very yummy dishes. Before we were done we had a table full of delicious food. We will be going back here often!!"], ["Kiki P.", "Very nice and friendly staff. The owners are Korean and take pride in this restaurant. Make sure to try the dol sot Bibimbap. Delicious."], ["Joseph P.", "Food was decent for what it is. Generous portions,friendly counter guy.Place probably would fail a health inspection thou.Never going back!"], ["Brittany N.", "Love their crab ragoons!!!!! Everything is made hot and fresh!  And super friendly employees!"], ["Mike A.", "Another great South Blvd. ethnic restaurant.  Had the Jae Yuk Bok Um.  It was great.  Flavorful and spicy.  They were very friendly and happy to recommend and explain items.  My son ate the buffalo wings with fries and they were excellent also."], ["Dan K.", "This place is a Korean run restaurant.  Don't know why they decided to call it China Wing.  Only if you look at the sign do you realize it's a Chinese/Korean restaurant.  The food here isn't spectacular, but it is still decent Korean food.  They have a $4.95 lunch special, but that only applies to Chinese food.  The nice part is, they serve the elusive Korean-Chinese fare, that you can't find at Korean or Chinese only restaurants.  JJa jang myun, ggampoongi, omul rice, tangsuyok to name a few.The prices are a tad high, but it's still worth a visit."], ["Teresa C.", "Our favorite Korean restaurant in Charlotte! The Bi Bim Bap and Bulgogi is so delicious. Very friendly service also.Don't be fooled by the name \"China Wing\". When you go in, ask for Korean menu."], ["Amy F.", "I was extremely excited to finally visit China Wing, which to my knowledge is the closest place to me where Korean food is served.China Wing looks like it used to be a Long John Silver or similar fast food joint. In order to make it the Korean owners serve a variety of American fast food in addition to the full Korean menu. You want the Korean menu, which has detailed descriptions of the dishes and photographs of most of the options, making it less intimidating for first-timers.I was pleased with everything we ordered including the delicious Korean seafood and scallion pancake, the noodle dish japchae, the BBQ pork and the bi bimbap, a personal favorite. One disappointment was that the selection of banchan or panchan - tiny dishes, often pickled served with the meal - was limited to just 2: tasty kimchi and pickled radish. At other places (of course I'm comparing to Atlanta) you get at least 4-5 different options or possibly more. Still, I can't complain since the main dishes and the banchan we were given were delicious and definitely hit the spot and satisfied my craving for Korean food. I look forward to returning to China Wing and to visiting the other Korean restaurants in the area. I also look forward to visiting my favorite Korean spots back in Atlanta when we visit! Where have you had Korean cuisine in Charlotte? Super G Mart and Cho Wan Garden are on my list."]], "Taipei Express": [["Stephie N.", "Food is awesome. Service is always right on time when we pick it up! The vegetables seem very fresh and the flavor is authentic. They also give you good portion sizes and plenty of rice!"], ["Claudia F.", "It can be tough to find good Chinese food that is flavorful and not too greasy. This is it. The food was ready very quickly and everything seemed quite fresh. I had chicken lo mein, which was tasty and not drowning in oil. It had good amounts of fresh veggies with it as well. The beef and broccoli is excellent as well, although they could have used a bit more sauce. Overall, it's a good basic Chinese take-out restaurant that holds me over until I can get the really good stuff in San Francisco."], ["Shane L.", "This is my go-to lunch spot here in Charlotte. Small parking lot in the front, but there is a larger adjacent lot to park. Having tried nearly everything on the lunch menu, I can definitely recommend the Sacha scallops, General Tso's tofu, and scallion chicken. For $6-7, you get a large portions with white or fried rice and an egg roll. Generally, the veggies are crisp and fresh. Chicken dishes are made from white meat. The sauces complement the meats and veggies well."], ["Will H.", "For my wife and I, this is our go to Chinese restaurant in town. They are a model of efficiency and consistency, even of the food blends in with pretty much every other Chinese take-out you've ever had.So the secret deal here is their vegetable soup- just a buck fifty and you get a huge contained stuffed with fresh veggies and plenty of tofu.  Even if you don't like tofu, take it our and enjoy the extra hot broth with the veggies.  Always a good starter.  Everything else here is pretty much what you know of Americanized Chinese take-out: choose your protein, choose your sauce, and let the good times roll in mediocrity.  Nothing too spicy, nothing overly flavorful, but the brown sauce is what it is and it is always what you've tasted before, so at least there are no surprises thereYou'll notice most of their business is take out, though they do have a small dine in seating area you can use as well. Downgrade on the parking lot: is very tiny and can be dicey getting out of because it's directly on Providence. Still, a good go-to when you need food quick and don't want to both making these things yourself."], ["Shannon M.", "Let's be clear. This is my favorite take out Chinese in America. I have to eat here whenever I'm in Charlotte. I don't know what is special about their food but it just tastes better than an other Chinese food. It is the measuring stick by which I judge all other Chinese food places. I almost always order the Chicken Fried Rice because it's amazing but I've tried plenty of their other dishes and have never been disappointed. I highly recommend the Crab Rangoons. They're crispy on the outside and soft and gooey in the center with the most amazing flavor. The dipping sauce they give you with them is stellar too."], ["Savannah B.", "I ordered on my home from work one day without really checking reviews so I hoped it wasn't terrible. I was very pleasantly surprised. It took about 8 minutes to get there any my food was ready in that time. I got beef and broccoli and general Tso's chicken. Both were very good! The best General Tso's chicken I have ever had! Staff was friendly and wasn't that expensive for the location...  9.35 for both."], ["Matt W.", "Our go to Chinese restaurant in the city. Great food, great service and super fast. Our favorite dishes are the ginger chicken, beef and broccoli and garlic chicken. Also they have top notch egg rolls. We've tried most everything on the menu and it's almost all outstanding. Each dish with its own unique flavor. The only \"downside\" is the fried rice...just a little too bland for my liking. Most of their business is take out though they do have a small seating area you can eat in at. The parking lot is very tiny and can be dicey getting out of because it's right on Providence. The owners are always working and very friendly. Great staff overall who always have smiles on their faces."], ["Star B.", "This is my go to chinese restaurant! I love the spicy mixed vegetables and the sweet and sour chicken. ITS REALLY CHICKEN TOO! lolcleanfriendly servicethe cooks in the back are weird, they stare!"], ["Patricia M.", "Likes: Do not be fooled by the restaurant front or the name containing \"express\" - it is NOT fast food chinese. I had wrongly assumed that this would be chinese food like you would get from the mall but that is NOT the case! (I think fast food chinese is disgusting) This is high quality chinese food that you would get at any nice, sit-down chinese restaurant but designed primarily for takeout. You can dine inside but it is casual and with counter service. The food is great - my favorite is the steamed dumplings and spicy sa cha chicken. It is an open, very clean kitchen that you can see. Service is fast and they have never once messed up my take out order. Gripes: If you use soy sauce, be sure to ask for extra because no matter how much you order they just give you one packet unles you ask for more."], ["Stephen B.", "Fantastic cheap Chinese food!Really dug the shrimp and broccoli with fried rice. they gave rather sizable portions too--I.e. Have enough leftovers for a whole other meal.Still need to try the egg rolls but great first impression."], ["Ryan R.", "It is absolutely appalling that one of clearly the best Asian cuisines in Charlotte will not get rid of those styrofoam plates and plastic forks at least for the customers who choose to dine in!!! Other than that the food is EXCELLENT!!! When they get rid of the Styrofoam plates and plastic forks I will gladly give them give 5 stars."], ["Alissa H.", "Chinese take out ... Out of 5 places I've tried here ... I would definitely entertain another trip there. The lunch prices are great. I tried the pepper steak and onions lunch combo ( I chose fried rice and the egg roll). The egg roll was so yummy and crispy, not greasy at all :). The fried rice was okay...  But with some duck sauce made it better. My bf got the dinner special sesame chicken with fried rice. He enjoyed the chicken, but had the same thoughts about the rice. Also ordered egg drop soup and the crab rangoons ... And rangoons were deliicous... Would definitely get them again."], ["B N.", "Having just moved to the area, I encountered this place via a recommendation and they ARE great! The food is super tasty, super fresh and very reasonably priced. I try a new dish every time I am there and have yet to eat a bad meal. I am so happy I have found this place!"], ["Jimmy L.", "Whaaaat the heck!? All of there meat is shredded into a shape that's no longer recognizable...no wait, that's only half the time. That's pretty much the story with this place, half the time it's decent, half the time it's the worst Chinese food I've ever had. I've had it--I will not eat here again."], ["Rod O.", "Hunan Chicken close to 4 stars (I said close)!  Quality is a little better than most \"FAST\" food Chinese!Fried Rice ok, almost 3 starsDude running this place is great, very polite and they are fast!  Small Dinning Room 28 seats!  Bigger than I thought, I did not remember any Tables, though I bet they have always been there!Outside two tables (6 seats)... No Shade, nor protection from Elements, though it would be a little work for a car to Run over you on this side (hardy-a-Patio) Tiny Parking lot 6 slots in front (Providence Road) hard to get in and out if you are going the wrong way at busy traffic times...  A few spots for Parking in the back though I do NOT recommend it!!! If you or your car slip (quite a slope) you could be in a Lot of trouble!  THINK before you Park! ! !  Forget Parking in the Lot beside Taipei unless you want to get TOWED ! ! !I think they are pretty serious about it!  Side Lot is Supposed to be ok to park  on Sunday, because all the businesses for that lot are Closed on Sunday!  Better Check!  You do NOT want to be Towed (I'm Guessing)!"], ["Martin H.", "Taipei, Taiwan, is my hometown, so it's a shame that I drove past Taipei Express several times and never dropped in until now.I ordered the Kung Pao chicken, and I must say to my surprise, it tasted amazing, if not better than P.F. Chang's! Definitely not your typical \"carryout Chinese food\". The size of the portions are very generous, and I could only eat half of the plate, which meant great leftovers.The staff was really nice, and I noticed that the dining space was very well maintained. The restaurant was very clean with comfortable seating areas unlike other Chinese restaurants. It's definitely worth ones time to stop by."], ["Mar N.", "This is definitely our go-to Chinese restaurant since moving to MP. We like the crispy scallion chicken, fried rice and low main. The soups were great too! We will definitely keep going back."], ["Josue M.", "It seems like this place is always the lunch option for me and my coworker. The staff is very friendly and welcoming and the food is excellent."], ["Kate T.", "It was okay. The server at the counter was more concerned with the call-in orders, which I guess is more common at this location due to the small amount of tables, but disappointing. It took me over 5 minutes to place my order. After being seated, with no one else there, I retrieved my order and was satisfied, but not impressed. The meal was very greasy & the rice and egg roll were so over-cooked. Won't bother again."], ["Brendon T.", "Might be the best value in Charlotte.  For about $8 you get your choice of Chinese dish, rice, egg-roll and a fountain drink.  Pretty decent bargain.The food is good, not fantastic let's face it.  I'd recommend the General's Chicken, Sesame Chicken, and the Pork w Garlic Sauce.  I'd also stay away from the Sweet and Sour stuff - they mix it in for you, so you can't control the sauce to meat ration - bleh.It's not the best Chinese food I've eaten, but then again, I've eaten a bunch of meals in China.  I would however come back and will continue to frequent the place."], ["Mark E.", "OK, OK... I'm giving a Chinese takeout a 4 but pay attention why...1. Very fast and efficient service... when the belly begs for food they are ready!2. The food is pretty darn good... the string beans are fresh and perfectly cooked, the tofu nicely browned (NOT mushy), sauces are AOK but just that.3. I wouldn't go there to eat in their lil' eating area but it says EXPRESS on the sign!!! 4. The real reason for a \"4\"? I'll be back there every time I want quick Chinese... there!"], ["Faith D.", "Pretty good and pretty fast! They give good portions and enough for left-overs. The space is pretty small, but you can dine-in. When I was there they stayed very busy and it seemed like a lot of people order-to-go. If you want the chili in oil, you will have to ask. I enjoyed the veggie lo mein and would be happy to go try more.The parking directly in front of the building is limited. I think there is more parking next door (another shopping area). The woman who took my order seemed friendly and the staff was concentrating on making order after order. They seem to have a good groove going!"], ["T S.", "Taipai is incredibly fast and definitely a worthy contender for our future takeout orders. We ordered the orange chicken and the general chicken. Both were listed as spicy on the menu, but we added chili pepper sauce and pepper to amp up the hotness. We agree with the other reviewers and would say this is a step up from standard takeout. Is it the best we've ever had? Not quite, but quite tasty."], ["Jason L.", "If your kid brother threw on a chef's hat to play \"Chinese Restaurant\" for a day, this is what it would be like.  The fried rice looks and tastes like regular rice with a splash of soy sauce and a package of frozen vegetables mixed in.  The stuffing in the spring rolls is unidentifiable.  The potstickers are a bready glob.  The sweet and sour chicken and sesame chicken are both dry and chewy.  I can't imagine any of the more complicated dishes being better since the simple ones fell flat.  Which is why this restaurant gets a \"No!\""], ["La R.", "The best Chinese takeout I've ever had. Consistently fresh, cooked to perfection, flavorful takeaway. Great service, never messed up an order...that's that."], ["Chad E.", "I want to say that I've been to Taipei Express before, but I think I would have remembered it.  Maybe I just thought about going.  Whatever the case, their sanitation score has dropped slightly - they are now at 97.5!  Naturally, they can take classes, so it might be slightly lower than that in reality.  But the place is clean.  It's actually really nice looking.  They even have a cool motion-activated water dispenser.  I don't know if that affects the food or not, but it's pretty neat.The food is handed to you in a to-go clamshell, even if you ask for it to stay.  But that's not a big deal.  The real problem is that it's hot.  Not spicy hot, but hot from the grill.  It's probably better than not being hot, but it's just burning!  I had to sit and wait for ten minutes just to let it cool enough to be able to eat the stuff.I'll also agree with others who said that the food was fairly indistinguishable.  Nothing much to it, really.  Not bad, not good.  Just there.  And lots and lots of sauce, which can mask just about anything - good or bad.  That, coupled with the hotness, was not necessarily a good thing.  It could go either way.  At least I scored two fortunes in my cookie."], ["Jillian B.", "I eat at this restaurant at least twice a week.This is the best asian fast food restaurant in town.  I love everything that I order there.  I am picky and like to leave out certain vegetables or change the sauce or alter the spiciness.  I have been able to do so and pleased with the outcome every single time.  In the hundred or so times I have been to Taipei Express (no joke) I have never had a bad experience. I wish there was room for them to expand and build an addition, but there isn't.  Also, parking is hard to come by.  I always park in the next door lot, even though it says office parking only.  To date I've never been towed.  Also, little know secret, there is parking directly behind the building...but only about four extra spaces.  All in all, I am in love with Taipei Express.  MMM!"], ["Vinnie I.", "When I first moved to Charlotte two years ago, I didn't really know where to get good Chinese, and with some great Indian and Thai that I had found, I was able to satisfy my spicy Asian jones.But then I was introduced to Taipei Express by some friends with more CLT experience, and really, I haven't found a better quick dine-in/carry-out place better. I mean Fortune Cookie was OK because it's cheaper, but paying a little extra really pays off at TE.They give you huge portions, enough for a dinner and a following lunch. The appetizers and soups are all outstanding. Any kind of the chicken specialties are winners, but what really impresses me is any dish with shrimp or scallops on the spicy side. They give you a lot  of tasty pieces, and I also love the option of getting brown rice on the side instead.Their dinners will cost just about $8-10, and if you're sharing, even less. That makes their heaping lunch specials super awesome.I like the Taiwanese-Northern Chinese style of cuisine, and this comes through. Only thing is, it's got a really small dining area and an even smaller parking lot out front. So it's best for a lunch run from the office or a quick grab of a big meal on the way home from work."], ["Yelp Gir L.", "I've been eating at Taipei Express for years, and they are consistantly stellar.  You can't help but notice how shiny and clean the kitchen is when you walk in- sparkly stainless steel from floor to ceiling.  A row of men in while aprons tossing food in & out of pans...fire flashing up, big woks spinning around... but that's not even the stellar part...  the truly stellar part is that in all those years, ordering at least once or twice a month, they have never ever gotten my order wrong...  not one time.  These people have an attention to detail that is to be admired.  We discuss it everytime we order from there.  You can eat in there dining area, but it's small and the seating is not at all made to linger in, so we think it best to call ahead and take it home.  The food comes in these fantastic black plastic containers that do not spill or leak.  I really appreciate their thoughfulness in provinding above average to-go containers.  It's a huge portion of piping hot chinesey goodness, no matter what you order!  The rice comes seperate, white or brown.  Their egg rolls are yummy as are the crab rangoons.  They're only a dollar or so more than fast food, and it's usually enough to allow for left overs  :-)  It's not flashy, and there are no koi ponds or paper lanterns, but it's solid, reliable, enjoyable chinese food."], ["Amy R.", "Charlotte isn't really known for its stellar ethnic food, but Taipei Express is good, solid Chinese food - nothing spectacular but a good meal for takeout or a quick lunch. I like Taipei Express's pork fried rice and Mongolian beef. For takeout, you can call ahead, but even if you go in and order, your food will be ready quickly."], ["Josh H.", "Taipei Express is the best takeout Chinese restaurant in Charlotte. They are very fast, friendly and cheap! Lunch specials run between $5-7 and are generous proportions while dinners are between $7-9 and could feed two. As for the food quality, this is my favorite Chinese food around. The crab rangoon is almost sweet enough to be a desert. If you come often enough you will likely see me sneaking out with some take out."], ["R.E. F.", "Taipei Express, if anyone isn't aware, is owned by the same family that owns Taipei South down on Park Road as well as House of Taipei in Huntersville. This is also the same family that got their start as the Great Wall of China over in the University area until they changed their name. To make a long story short, my family has been frequenting these restaurants ever since I was 8 years old. To this day, I have NEVER found a chinese restaurant that makes a better Sacha Chicken or Egg Roll. I love the Taipei restaurants. I love them!"], ["Dana M.", "AWful. Worst food I have had in a long time. Every part of it was terrible. Two apps and two entrees, all really bad."], ["Jonathan P.", "I thought Taipei express was pretty damn good.  The shrimp in the Shrimp Lo Mien were plump and nicely browned, and there were plenty in my order.  The Sesame Chicken was juicy and the sauce was sweet and tangy.  I did not eat too much of the browned rice, but the chicken wings were crunchy, salty, meaty and tasty, especially with a splash of mustard and duck sauce.  The dumplings were massive, the biggest I've ever seen.  They were a little doughy, but the pork inside was nicely seasoned, and the sauce was delicious.  The orders were large as well.  I ate my fill last night, and still had enough Lo Mien left to have a nice sized lunch today.  For the money I'd say Taipei Express is a great deal, true its not gourmet, but it is good... the portions are large and the prices are reasonable.  I have to disagree with Jason L. on this one and give Taipei Express a thumbs up, try it for yourself, and let us know what you think."], ["Tré Y.", "If you're looking for good Chinese food, it really doesn't get any better than this.  I get disappointed if I even think about ordering my Chicken w/ Broccoli from anywhere else.  As an avid fan of spicy food, it's tough to find any place in town that will satisfy my craving for heat.  If you tell Taipei Express to make it \"very spicy\", they actually make it very spicy!  Imagine that!  The place itself is relatively small, with very little parking.  The perfect take-out place--but if you're looking for a formal dining experience, this ain't it."], ["Jerry T.", "i love this place, its my go to on sunday for chilling out on the couch before work on monday.  crispy scallion chicken extra extra hot with brown rice is my favorite.  pork fried dumplings are also really good and so are the spring rolls.  very consistent, very fast, and they have an extremely nice staff."], ["Kristin F.", "Gross...that's pretty much all I have to say about it.  The lo mein was actually chow mein, which seems to have become a trend for Charlotte Chinese food.  The egg roll was dry and I had no clue what was actually inside it.  They use styrofoam plates and plastic utensils, so definitely not enviro friendly.  It may be cheap, but there is a reason for that."], ["Kristen M.", "we got food poisoning here - egg drop soup.  in addition to being contaminated, the food was poorly prepared and tasted terrible.  i am amazed that some people reviewed this place favorably."]], "Beijing Chinese Cuisine": [["Paris S.", "For the nearly two years that my wife and I have been in Charlotte, we have been searching for excellent Chinese cuisine, with little positive results. We have finally found it in Beijing Chinese Cuisine.My wife ordered the Shrimp with Lobster Sauce and I had the General Tso's chicken - unimaginative, I know, but it's my first time and I wanted to scale this with something with which I was already familiar. This was literally one of the best General Tso chicken dishes I had ever had -- every morsel was cooked to perfection. My wife's Shrimp with Lobster Sauce was just as excellent. She ate every bit, and this is from someone who normally carries half of her meal home for later. Yes, it was that good.Our waitress was friendly and attentive. The place is small, but neat, just outside of Uptown Charlotte on South Blvd. We were seated near the window so we had the added amenity of seeing the uptown traffic and the people walking by. A large-screen TV was tuned to a kids' movie, which was somewhat distracting, but not badly so.We are definitely planning a return visit to Beijing Chinese within the very near future.This experience was worth the 12-mile drive from south Charlotte."], ["Faith D.", "I'm always looking for a new Chinese restaurant. My husband and I were cruising down South Boulevard and saw grand opening streamers flying in the parking lot of Bei Jing Chinese so we thought we'd try it out.The atmosphere is open and moderately, yet nicely decorated. I'm sure that being a new restaurant they are still working on making it a more warm space. Depending on the time you go, the windows are not shaded so you'll get the sun right in your face. In addition, as we were eating there was just something out of place. It hit me! There was no ambiance music; however, they do have a tv on the wall. The food was good, not greasy or oily. The vegetables were fresh! The portion size was good. Service was friendly. They offer take-out and it seemed like that was the popular choice the night we went. It's a nice little addition in South End!"], ["Peggy C.", "I wanted to like this place, considering there is a severe shortage of cheap Chinese place near my work. My coworker and I came here the other week for a quick to-go order. I had the tofu with veggies lunch combo ($5.95). The brown gravy was so thick I couldn't even get it to spread over the rice.  Someone went a little heavy handed with the corn starch. It tasted ok for how bad it looked.  I love the tofu, the portion was ok, the best part of the lunch was probably the spring roll.  I seriously hope the gravy problem was a one time thing, yet it will be a while before I go back to find out.  The sad part is the gentleman who greeted us and took our order was super nice and said he wanted to see us back..."], ["Phyl B.", "Driven by here a million times and had no desire to stop in. A friend told me they went here and loved it, so I gave it a try. I get grossed out easily if places are dirty. However, you walk in here and it is so impeccably clean. It seems to be a nice family owned business. The service is fantastic. The hot tea is freshly made with herbs and steeped...Delicious. Only $1.75 and they bring a nice little pot enough to share. The prices are incredible. $8.95 got me a Sa Cha Chicken with fried rice, soup, and egg roll. This is \"old school\" nothing fancy. No fancy pricing! They even have coupons out! My new favorite place. Also, a perk I enjoy....On these freezing cold nights you can easily park right at the door!!!! Looks like they do a lot of take out."], ["Rod O.", "When in a Chinese Restaurant for the first time I would like to know about Hunan!  When a \"Hunan\" sauce has black beans, it is usually a GOOD Sign!  If it has Bok Choy, Mmmm I do not need any more persuasion...  Asking about this one, my Waitress offered (without me asking) \"this one has Black Beans\"!  Hunan Beef Please!The Beef was good, I do not know how they cooked it, I'm guessing a lot, though it was not over cooked, it was a preparation I have little experience with.  I got them to leave out the vegetables I do not like (broccoli and snow peas) and yeas it had Bok Choy... The vegetables were Very CRISP, unlike so many places, these were perfectly cooked!  The flavor of the Hunan Sauce was very good, not great, though it beats most places for this dish! The service was very good!  My Waitress asked How i liked everything and I told her I did and she said \"but will you come back?\" I said \"probably not\"... Only because I would rather have Vietnamese, Thai or Korean (in that order) if it is Asian themed food!For Chinese I'm giving them 4.45 stars because they are better than almost all Chinese places I have eaten!  Of  course I enjoy Vietnamese, Thai and Korean more, though I do not believe it is fair to compare!  For the price this place gets close to 5 yelp stars for Lunch!"], ["Jane F.", "First and foremost, they get points simply for being open 7 days a week until a reasonable hour. What is up with places closing at 6 on Sundays? Who's done eating by 6? Sometimes I haven't even had breakfast by 6.I am a huge fan of their Dinner Specials. You get an egg roll, soup, an entree, and a fortune cookie for under $10. Mine usually lasts me at least 2 days- that is, if I don't end up eating the leftovers the same night. (How do you distinguish between eating leftovers, and just taking a breather? How much time needs to pass between meals?)I also, as a general hater of restaurant websites, find their website pleasantly well-organized and informative. Hours, location, menu, types of payment, tasty pictures of food, and printable coupons. Winning. They do deliver, but since I can see their building from my front door, I pick up. It's about a 7-minute walk and they always have my food ready to go by the time I get there. The only down side is I can't eat my egg drop soup on my 7-minute walk back home."], ["Carolyn L.", "Typical Chinese fast food joint. I ordered the usual chicken and broccoli lunch plate with fried rice. It's comes with an egg roll. Since I hate Chinese egg roll. It's nothing like our egg rolls I tend to try to get the soup instead. But here, you can't substitute the egg roll out with soup which is a bummer. Customer service is great and effective. They're tentative and fast. Perfect place to grab a quick bite during lunch.,"], ["Mike M.", "When I'm not in South Park, I'm usually in south end or uptown. My friends and I saw Beijing while driving down South blvd one day and thought to give it a try. We went in for lunch and had a good experience...so we came back a number of times. Now it's time for me to give them props :)The restaurant is very clean and well lit. When we've gone there (usually at lunch time it isn't super busy) and we've gotten great service. Very attentive. They seem to get a ton of business from takeout orders. I give a lot of credit to the servers because from what I've seen they're responsible for guests dining in and dealing with phone/takeout orders. Not easy to do. In any event the service has always been great.The food...To be honest I can't really speak on their selection. I haven't really perused the menu too much. The lunch specials have been too appealing to look beyond them. I've tried a couple of things on the lunch specials menu and they have yet to disappoint. Not only were they good entrees, but the portions are big and they come with choice of Rice, choice of soup and an egg roll. I know that it's not uncommon for Chinese restaurants to have lunch specials which include those things, but it's always nice to get value for your $$$. Good food + good portions + sides for a low price = great deal. Now to be fair, the food doesn't blow me away. It's good, and it's better than mall food court asian food in terms of quality of ingredients and taste, but doesn't necessarily stand out compared to other traditional sit-down Chinese places that I've tried. But I've always had a good overall dining experience there and the food is always meets my expectations. It never disappoints. If I could I'd give it a 3.5 I've done carry out from them as well. No complaints there either. I fully expect to eat there again."], ["Rachel B.", "Open till 11pm on the weekend - you go, Beijing!We stumbled upon this little Dilworth place after me growing up passing it by (Dilworth Elementary Grad '95!!!).The decor is boring, seating is limited and parking is odd (behind the building!), but the service and food were quick and spot on! General tso tofu from here was not only huge in portion but big on flavor. And finally, a place that hears \"Very Spicy\" when I say \"Extra Spicy!\".Will definitely be coming back here for my late night Chinese fixes!"], ["Leanne C.", "\"If you're going to get Chinese, NEVER trust anywhere with a name like Bei Jing. C'mon, it's basic sense.\"That was what my friend said after I described the terrible take out I was given. I didn't think I'd have to inspect the food before taking it out. If I had been dining in and had been served this? I would have sent it back and complained- a lot.I got the Tofu w. vegetable. The tofu was sort of just added to the sauce (not prepared with it) and the vegetables added were literally the \"peas and carrots\" you'd find in the frozen section of a grocery store. Cubed carrots and strange textured peas. The sauce even had a strange texture to it. And then the duck sauce that was added to the bag was expired. Awful x 2. I definitely recommend looking elsewhere."], ["Martin H.", "This place is your standard American Chinese cuisine. Honestly, nothing too special about any of it. I must note, however, that the spring rolls are not too shabby."], ["Mike B.", "I was so hopeful when taking a job a couple of years ago and also living very close to this place and have visited this restaurant about 8 times in the 2 years. Disappointed each and every time. I love egg fu young and the first time I got it was decent for a fast food style chinese restaurant. The next 2 times was terrible. Burned on the outside, dry on the inside and the gravy had the consistency of peanut butter. Sweet and sour pork is just ok, more breading than pork, sesame chicken was bland and overcooked. My last visit on 1/28 was perhaps the most disappointing of all. I walked in to order take out. I ordered sweet and sour pork and vegetable lomein. Got my order and got home to find vegetable fried rice instead. First let me say they do not seem to use regular rice, it's more like instant rice in all their dishes. I have never gotten anything with actual fresh vegetables, the have to be either frozen out of a bag or come from a can. The only difference in the vegetable fried rice is they add some soggy broccoli and and those little corn cobs out of a can. Otherwise it was simply a big pile of fried rice. The only thing consistent about this place is that the portions are large and it's cheap if that's your thing. To me cheap and quantity is still a waste of money if it is not good. I will not go back and it's a shame because it is convenient to me. Instead I'll pay a little more and get fresh Chinese/Asian food from one of the Asian fusion places in Uptown."], ["Tiffany N.", "Move over Panda Express-I've finally found my go to place for Chinese carry out! After many failed attempts with Chinese take our in Charlotte, I visited Bei Jing for take out and will be paying them more visits in the future. Not only do they have a huge menu with standard items plus some I've never heard of but they also offer lunch specials every day (dine in or to go). Another thing I like is they offer dinner specials that won't clear out your wallet and with that you get the entree, fried rice, eggroll AND your choice of soup. And the entree comes in a snazzy, durable container that will bring me more use in the future. I got the sesame chicken dinner and loved that it came with fresh veggies (I am using the plural loosely as it was only two pieces of broccoli but don't mind because it was so green and fresh and not drowning in sauce). The egg roll was a mini eggroll but really, after all that food, I don't need an eggroll on steroids. The hot and sour soup was standard but it seemed spicier than other places and left my nostrils clear and pleased. The dinner portion was huge which left half for me to enjoy later. The cherry on the sundae was my fortune, I usually get a crappy, transparent fortune and for once, got something that actually made a little sense.An array of menu items+ generous portions +tasty food+ quick service = a happy, full me."], ["Shauna C.", "Due to location (convenience factor) I decided to check out Beijing instead of my usual fave Ho Ho Cherry House.I ordered the Sesame chicken (extra crispy) and was pleasantly surprised that for 8 and change you receive a generous portion of chicken, fried rice, egg roll, choice of soup - I went won-ton, and even a little steamed broccoli. Ho ho cherry house doesn't offer soup or broccoli- so I was really pleased.My order took only 10 minutes - and it tasted cook-to-order. I really enjoyed their egg-roll's - definitely better than Ho-Ho's.They use more than just cabbage which is key. The rice was tasty- and the soup was awesome! I actually gave some to the girls that I was babysitting and lets say Ive never seen a 4 year old  down won-ton soup broth versus the chocolate ice cream in front of her! Where they fell off the wagon was the crispiness factor. Unfortunately, that is kind of my main test for Chinese and the chicken just wasn't crispy at all. I would hate to see what it would be like if I didn't order extra crispy- it would have been mush! I also didn't care for the sauce as much as Ho-Ho's.The sides were all cooked so well- and you can't beat the price or the location so I think id try it again and really stress the EXTRA crispy part!"], ["Jamie K.", "On the one hand, the service is always friendly and helpful, and the portions are generous. On the other hand... well, the food is a mixed bag. Vegetables are usually crisp and flavorful, but the preparation of the meat and seafood leaves a good deal to be desired. Their salt-and-pepper shrimp is far greasier than it should be. Their chicken, too, suffers. Every time I go it's a little too overcooked and bland.So if you go, I would recommend sticking with vegetarian fare. They do a decent job with that."], ["Salman C.", "Good food for a good priceGuess its hard to mess up General Tsos Chicken, but you can't beat the price for the amount you get. I haven't dined in as of yet (decent size sit down with not much to look at), and don't plan to anytime soon. 4/5 since the ambience is just ok"], ["Nicole W.", "When the fridge is bare and we're not in the mood for pizza, hubs and I typically scan the Chinese restaurant menus. Since we're just around the corner from Beijing, we thought we'd give it a solid, college try. We looked up their website (beijingcharlotte.com) and were pleasantly surprised that their menu was available online. We scanned through and ordered the Crab Rangoon, General Tso's Chicken, Shrimp Fried Rice and Beef w/Mixed Vegetables. What can I say, our fridge was reeeaaallly bare, we wanted leftovers! I wish their website offered dish descriptions of each item. It would be helpful to know what exactly composes Schezwuan Beef. Hubs went to pick it up, as they do not have delivery service as of yet. A local food review mentioned that they were hoping to add that service in the near future. While I didn't pick up the food, hubs said that the place was decent inside. Nothing crazy, but a comfortable spot to stop for some quick food. Our food was ready in ten minutes - nice! Once our Chinese feast was brought home I tasted each dish. The General Tso's was my favorite of all the dishes. It's not the healthiest menu item, but the chicken had a well-spiced sauce on it and it wasn't heavily breaded. I could have handled more heat, though. The shrimp fried rice was just ok, I was expecting more veggies and egg within the dish. It was mostly shrimp, fried rice and chopped onions. The crab rangoon was quite tasty but the beef with mixed vegetables was fairly bland. I don't want to write off this place just yet, as their dishes were prepared fresh and none were greasy at all. I think I'll try a few new items next time and maybe ask for a bit more heat in my dish."], ["Hailey H.", "Hungry for chinese food mid afternoon on a Sunday, the proximity of Beijing to my house made it rocket to the top of my list. After looking at the menu, we realized we could still get the lunch special (which comes with eggroll) and decided to order some appetizers. Super pumped it would be ready in under 15 minutes, but everything kinda dwindled after that.We both got a chicken & veg dish (moo goo gai pan and chow mein), but since the only starch in either was fried rice, the only difference between ours was the vegetable selection. Yes, the sauce tasted exactly the same, like thickened water with a touch of chicken flavour. We also ordered the steamed dumplings, which were good but the top to the sauce wasn't put on all the way so we were forced to eat them dripping in pure soy and sodium. We also ordered a salad with ginger dressing (I know, I know, from a chinese restaurant) but the \"dressing\" was so thick it was just like eating shredded marinated ginger on lettuce. You win some, you lose some. And the eggrolls were HT freezer section material, definitely could go without next time.I know we didn't chose heavily fried and sauced items that usually can't be messed up, but a good Chinese restaurant knows how to infuse flavors into even its lighter dishes, and that wasn't the case here."], ["Nancy E.", "I was in the mood for some Chinese food but only a small portion so elected to try out the Fried Wonton appetizer. It was very good. The portion was perfect. I actually ate it for my lunch. It was hot outside so I didn't want anything that would make me feel too full in the heat. It was perfect. I like the flavor. They were very crunchy and the filling wasn't too spicy. I did see that they offer luncheon specials which are very reasonably priced. I will have to come back when I have more time. It was a small but very clean place and the service was excellent."], ["Justin H.", "Love this place.  Very cheap and very delicious.  For just $6.95 you can get just about any kind of classic Chinese entree imaginable with an egg roll and rice.  For that price, I wasn't expecting much. But I was pleasently surprised and have ventured back several times since my first time there.  Everyone remembers their first time.  Great spot for a quick, cheap and tasy lunch for all you peeps in the South End and Downtown.I recommend General Tso's Chicken... I know, I know.... BORING.  But it is absolutley delictable here."]], "Lai Lai Express": [], "Dim Sum Chinese Restaurant": [["Shane L.", "Went here with a large group after church. Having been spoiled by good Dim Sum in Atlanta and New York, I was looking for something comparable here in CLT. Needless to say, the food here matched up favorably. We ordered a bunch of traditional Dim Sum fare including chicken feet, garlic pork ribs (very delicious!), this deep fried eggplant dish, and some other deep fried morsels with ground pork filling. We even ordered fried pork intestines. For those of you who are adventurous, the intestines are worth a try. The outside is crispy with a soft and chewy interior. Beware though, there is an aftertaste...it is pig intestines after all.Overall, good experience. The food was flavorful, and the selection was great. I will definitely be back for brunch."], ["Brooke E.", "It was a Sunday evening in Plaza Midwood and I found myself hungry with a taste for Asian cuisine. I turned to Yelp to find the highest rated spot and Dim Sum seemed to be the best option. I called my order in and figured the food would be great based off the very thick accent on the other side of the phone. My meal consisted of basic Chinese-American fare which I figured would be a safe bet for takeout. I got back to the friend's apartment I was visiting to find that there were no utensils in the bag with our food (none were on display at the Dim Sum restaurant counter either.) The friend I was visiting had just moved in that day and had no accessible utensils, causing me to leave AGAIN to run to the nearest store and pickup forks. When I finally got to eat my dinner, I was severely disappointed. The sesame chicken was okay- the flavor was adequate but the meat tasted cheap and the sauce appeared to be cut with water. The thin, diluted sauce pooled at the bottom of the bowl making the undersides of the chicken soggy. I tried to ignore the fact that the sauce had been contaminated since, after all, it appeared to just be water.Then I tried the fried rice. My biggest regret in life is that I swallowed the bite off my fork rather than spit it back out. Knowing that the rice was being processed by my body severely grossed me out for the rest of the night. I couldn't decide what would be worse- digesting the rice or the taste of throwing it back up.Enough about how the rice made me feel and more about the reasoning why: It tasted like it had been soaked in a marinade of water and half decayed cigarette butts. There were no vegetables mixed with the rice and the texture itself seemed as if it had been through a continuous cycle of sitting out, getting microwaved and then set back out again. over and over. When I went to throw out the entire container after my first bite, my friend protested and offered that he would eat whatever I did not wish to finish. Some background on this particular friend of mine: He will literally eat anything. My friend took a forkful of the rice and had the same immediate repulsion that I myself had endured. His exclamations reasserted my claim of the cigarette taste that clung to the underside of the throat in a heavy aftertaste that entices one to get sick out of some evolutionary reflex.Maybe the actual Dim Sum cuisine is fine if dining in. Maybe the kitchen doubles as a smoking lounge. Whatever it may be, I regret the overpriced $20 I spent to not be able to actually eat my dinner."], ["Vladimir P.", "I knew the food would at least be alright when I walked in: my group and I were the only non-Asian table there. That is always a good sign for ethnic restaurants. The beginning of the dim sum came out quickly, but as the restaurant got more full, it started taking a while (tip: don't be greedy, hire more people). The food certainly tasted good, but was nothing Earth-shattering. I cannot see how some of these reviewers on Yelp come here and order anything but Dim Sum. Why come here when all you want is Americanized Chinese? Jeeze...I would come back. Why three stars? The food is just not that memorable. It was tasty, but nothing new."], ["Hang H.", "Good service. Decent food for small towns. Overall experience was okay. However lobster ginger scallion for $62 was a bit pricey for this place. I would recommend if you haven't tried them dim sum to give it a go."], ["Denise K.", "Alright so this doesn't actually deserve 4/5 stars but let's be real, there aren't many dim sum options around Charlotte and compared to the other places, I think this one is the best. If you have had dim sum in NY or Cali, please don't compare it to dim sum here because it's not on the same level; however, it's not bad! They have your regular dim sum options that are reasonably priced. Their tea is pretty pricey though and we were charged about $6 for chrysanthemum tea. All in all, come try this place out! Service is authentic- lol, but it's worth a shot."], ["E M.", "We had lunch here today.  It's certainly not like Dim Sum in Los Angeles but had a few tasty nibbles. The pork and shrimp shu mai (sp).  The potstickers were too doughy but the filling was good.  The duck had crispy skin and was ok. Nothing earth shattering. The Char Shu bao was ok but seemed like they may have been frozen. But the flavor was good. We had to try the chicken feet ... Um... Not sure why anyone would want to eat these and trying them did not change my mind. The service was good. I would go back to try some of the other Chinese dishes just to give it a try."], ["Kayla B.", "Been looking for a great Dim Sum place for a while and ran across this place which isn't too far from my place. I can't remember the name of the dish that I had, but it was delicious. My fiance and I went out on a limb and tried some shark fin dumplings and squid. While I'm quite familiar with shark anyway, being Caribbean, the squid kind of surprised me. For some reason I wasn't expecting it to be served cold, but it was still good. The texture kind of threw me off a little bit, as it has a slight \"crunch,\" but I still enjoyed it! I can't wait to come back to take part in the actual dim sum menu to see how good the options are!"], ["Linda K.", "Came here to celebrate my sisters birthday and we ordered about 4 ppls serving of food so we tried a variety. It was good. The duck noodle soup was good and the domain was average. I have nothing bad to say about this place. When I wen the service was good too."], ["Brendon T.", "Authentic Dim Sum in Charlotte.  Definitely not the best neighborhood, nor is the restaurant the cleanest place in the city, but where else can you find an authentic Dim Sum experience in the Queen city?Recently went through a renovation (summer '14) and naturally jacked the prices up on their food.  You'll be looking at a lunch bill around $10 if you want to sample a few Dim Sum offerings and are drinking flat water.  Unfortunately, because of this, the value is rather marginal on their offering - it was a mistake in my book.That said, however, the food itself is tasty and the experience of Dim Sum is unlike your traditional run-of-the-mill offerings around Charlotte, so it's worth a shot.  I'd definitely recommend the leak dumplings, the sticky pork buns, and plenty of that hot/oil/sauce they keep on the table - I eat that stuff straight."], ["Stephanie I.", "Food was great! Ended up having a lot of food to take home. The carts going around make you just want to grab and grab food. The only reason I gave it 4 stars is because when we went to go pay, the lady at the register looked at us, with no smile or any type of happiness and said \"type ISNT included\""], ["Cliff H.", "I'm giving this place five stars because it is a legit dim sum restaurant in Charlotte. It's legit because it has chicken feet in black bean sauce and because they roll out the dim sum on carts, it can be very busy on Sunday afternoon but it slows down around 1:30. They have some excellent dumplings as well as park spareribs, shrimp stuffed eggplant, lotus rice, etc. No atmosphere. It's a Chinese restaurant."], ["Johnny V.", "We came in 40 minutes to their posted closing time and was given the hmm should we sit em or not look and thankfully they showed us to a table. The food is definitely not spectacular and hygiene in kitchen is probably non existent but you have to forget about that if you want to enjoy some dim sum on a random evening. Food was good but even better with the killer hot chilli oil they have on the table. Dont come here for the service- our waitress gave a rude \"hhmph!\" when we asked for a to go box. But when youre craving Chinese and you wanna feel sleepy beepy from MSG come here! (Feels so wrong but so good)"], ["Sunny S.", "We ordered 6 small dishes. Chicken feet and shrimp dumpling are great! The pork bun is good too. They don't serve dessert like tart on weekdays. Overall good."], ["Lee V.", "I didn't love it. I was really hoping to and wanting to but I'm not happy and satisfied with today's meal. We ordered the dim sum items for lunch. 10 dim sum items, an order of steamed rice, hot and sour soup, 4 drinks, and a lunch plate of sesame chicken plus 20% gratuity that was automatically added in for three adults, a 4 and 5 year old, and a baby in a high chair cost us $73. That's an absurd amount for just lunch considering we ordered just one of each dim sum to try. Some had two pieces, some had three, very few had four pieces. The flavors were good but when I'm paying $3.50 per dim sum dish, I'm expecting to be \"wowed\" and I was left feeling more like \"ehh.\" Prices were too high for what we got and paid for."], ["Annie A.", "One of the most authentic Chinese Dim Sums I've been to in Charlotte. The leek dumplings, chicken feet, and steamed rice noodles w/shrimp tastes the same like I remembered it 10 years ago. Food is bit pricey but compared to other places it's good. It's really busy on weekends"], ["Casey D.", "Had dim sum for the first time here. It was okay.  I would try it again."], ["Kunthea S.", "This place is over priced and do not trust the prices on yelp because they don't match up with what they actually charge you when you pick up your food. Food doesn't have much flavor and the place from the outside look kinda sketchy."], ["carlo c.", "Best duck in town I been here many times and always duck is perfect. Special fried rice and the stuff eggplant simple the best this by far the best Chinese restaurant in Charlotte"], ["Shannon H.", "Friendly staff, fantastic food. Don't let the outside fool you - this place is great!"], ["J T.", "Still one of the best dim sum place in my view. I've had plenty of dim sum in other cities before and most were alright. The servers here by far are always nicer than most place.  It's not stellar service but trust me, most Asian restaurants have horrible service and takes forever to bring small requests such as hot chili oil or just a water! Be prepared to come early on Sunday morning if you don't want to wait for a table since that's when they are busiest. They do serve dim sum during the weekdays but it's as ordered."]], "Taipei South": [["Anish T.", "If you are into American Chinese food, then Taipei South is probably the best place in Charlotte for that. Not only are you guaranteed to enjoy your food, you are guaranteed to be satisfied / hardly able to finish it all! Why, you ask? WELL:1) All dinner combos come with a hearty entree, a big mound of rice, and a side item.2) The combos cost anywhere from $7-10 bucks: affordable!3) Customizable entrees: choose the sauce and the veggies!I personally went with a spicy black bean sauce, and elected chinese eggplant as my vegetable of choice, served alongside the trio of beef, pork, and shrimp. It was delicious and I will definitely come back and try out different combinations!"], ["Sporadic W.", "Decent food.. there was too much sauce, but the vegetables were fresh.  The tofu was interesting- crisply, fried on the outside and soft on the inside.  Items are priced nicely, the food was ready when I got there and the staff was really nice.  I ordered take-out and paid for it, but ended up eating it there.. which they were cool with.  I would definitely go again for eat-in and/or take-out."], ["Ryan D.", "This is definitely the best Chinese food in Charlotte and may be the best overall restaurant in town. Very inexpensive but quality Chinese food. I've had almost everything on the menu and loved it all. Your food will be out in 3 minutes and you will not be disappointed."], ["Crista P.", "Not authentic Chinese by any means, but definitely a great place for a decent, inexpensive meal. The huge, satisfying portions will run about $7-10 and they come with white or fried rice & a veggie roll, egg roll, or chicken wings! I have tried quite a few things over the years from veggie lo mein, steamed vegetables, and veggies & tofu in garlic sauce, but my favorite will always be the sesame tofu. There aren't any vegetables in it, but I add some for $1 extra. I also tried the steamed vegetable dumplings once. They were pretty good, & HUGE, but a weird seafoam green color, which was kind of off-putting. On my last visit, I tried the general tofu but it wasn't spicy at all so I just ate the dried chili peppers that were in the sauce. Some things seem like a good idea at the time but eventually you will find out it was actually a pretty shitty idea..BF's go-to order is the general scallops with white rice & chicken wings. Both of our meals run about $20 including the tip which is a STEAL. For some reason, we usually end up here on Sundays and this place is packed! The ladies who work here are very sweet, but because it's so busy, they may be a little short with you, which I don't really mind, I'm not here to make friends. Service is quick & our drinks are constantly being refilled. If you like modestly priced, dinosaur-sized portions of non-crappy Americanized Chinese food, this is the place to be!"], ["LA T.", "Good food for an excellent price. Fast and fresh. Dine-in or take-out.  Easy parking. Try it!!!!"], ["Becky T.", "Just stopped in for my daughter's 15th birthday.  It is her birthday meal of choice year after year. Perhaps because she has been eating it since before she was born? Still consistently delicious, hot, fresh & fast.Love any and all of their spiced brown sauces. The biggest problem can be which to choose.We will definitely keep coming back!"], ["Samantha T.", "The food is very tasty and very reasonably priced. Unfortunately, the service has always been rude! I hate to say it, but for the entire experience there is one Chinese restaurant in particular in the area that blows this place out of the water!"], ["Julian C.", "We eat here at least twice a week. You can't beat the low prices and good quality of food. I generally don't like Chinese....I prefer Thai but their food is so flavorful. I love the chicken with garlic sauce with chicken wings. I know it sounds crazy but the wings are good."], ["Isaac D.", "I was a loyal customer for many years, until one day the beef started to taste funny. Then I got food poisoning. Never Again."], ["John H.", "Best Chinese food I've had in nc since moving from NYC. I can at least eat it without saying omg I just wasted money"], ["Matt S.", "Food: So completely, totally meh. Pre-cooked meats, steamed vegetable, and poured over the top sauces.  Meh.Decor: Moderatly interesting Asian art with a few too many happy Buddhas.Service: Confused but trying to be helpful."], ["larry s.", "have loved all the House of Taipei's that have been in Charlotte since I moved here in '92. Food is always good, as far as some of the complaints about the service; c'mon this is a Chinese restaurant. Most of these folks speak no English or very little, and they are usually busy running around like mad so they don't stop by every 5 min's asking if everything is OK , which is fine by me, I don't come to a Chinese or ethnic restaurant for the banter w/the staff:)Also one biggie for me; the prices have hardly changed in the last 5-6 years at the one I go to on park Rd. The New Tze chicken has been $5.95 as long as i can remember, a big plus since everywhere else you go prices have in a lot of cases almost doubled"], ["Justin D.", "This place is a testament to the power of word-of-mouth. So much so that by writing this review I feel like just one more voice added to a cacophony of praise for this place. I've been familiar with Taipei South for about 8 years now and I've never once seen or heard any advertisement for the place anywhere. It's just not needed. Even with the terrible location the place thrives.And for good reason. The food is always good and plentiful (best eggrolls in town). The service is always quick. The staff is back to fill your drink while it's still half full. And all this for the price of a fast food meal.I left that part of town about 3 years ago but still go back probably once a month. I just haven't been able to find a Chinese restaurant in center city that lives up to it. They're all either not as good, more expensive or both. The only conceivable complaint I can see being made of this place is that the wait staff can be a bit terse and may make some feel rushed. I choose to interpret this as fast service as they do everything quickly but never make me feel pressed to leave if I linger in conversation after the bill has been paid. I think they just know that nearly all their customers are regulars and figure they know what they want almost as soon as they sit down."], ["Mark L.", "A fellow passenger on us air recommended this restaruant, and after 2 visits,  its a good recommendation.  This is probably the best chinese food I have had in town, however I am only giving 3 stars because of the way they serve the food.I think most people would experience chinese food as served family style.  In otherwords you may order a dish, but its pretty much a free for all when it gets to the table.  Thats how it works in my family anyway (disclaimer, I am not chinese)If you haven't been here, its kind of hidden at the farthest north part of the parking lot."], ["Jackie C.", "First of all, This review is only base on lunch time because I've never been there at dinner, HOWEVER this place been open for a LOOOOONG time as far as chinese restaurant goes in that area, this place is PACKED for lunch almost ALL the time in the weekdays but the service is incredibly fast and the food comes out quick too so the wait is usually minimal or none at all.  their lunch special is only around $6-$7 so very reasonable and its always delicious i've been there for probably over 30 times for lunch and i've never had a dish i dont like,  their meat, their sauces is very flavorful! if ur in the area and have a thing for some good ole chinese food for lunch, give this place a shot! u wont be disapointed!"], ["Ryan N.", "This place is a good value for the amount of food you get. I love their hot and sour soup. I highly recommend it as a lunch spot but it wouldn't be the first on my list for dinner."], ["Kristi H.", "This is my go to Chinese place in Charlotte. The night I moved here I went with my parents, my mom is really picky about Chinese, and raved about it for a week after. I went again a few weeks later and ordered something different and again everything was amazing! Their hours are a little weird so make sure you look them up before heading over. My fav is the black pepper chicken. The chicken is perfectly cooked, seared not boiled like most Chinese and the veggies are perfectly tender with just the right amount if bite."], ["Tony B.", "My favorite Chinese restaurant in Charlotte. We've been going here for over 10 years - the scallion chicken is my favorite. The food is always very good and very reasonably priced. I'm puzzled by others' comments on the service - We've always had good service."], ["Zia T.", "Had lunch here today and had the best Orange Chicken I have ever had. It was crispy and perfectly seasoned! Orange chicken, rice and an egg roll was $6.95! I don't typically go here - it's a little out of my way but today reminded me to go back! Service was great!Taipea South is located in the Food Lion strip shopping center behind Burger King and across the street from Lowes (Johnson Road near Highway 51)."], ["Brady H.", "I haven't ate here - but wanted to ask a question. I popped in to check out the menu since I was really excited to find a restaurant with the word \"Taipei\" in the name. However, none of the dishes looked Taiwanese. The menu is typical Americanized Chinese food. Maybe there is a secret menu?Can anyone who is familiar with Taiwanese food and not just standard Americanized Chinese food comment?thanks!"]]}