{"The Capital Grille": [["Julie A.", "Myself and my wife are regulars for a reason. We have yet to be disappointed with both the quality of the service and food.Their food is only eclipsed by their staff. They have some of the best in Charlotte. We are almost always greeted by name when we walk in, and our favorite waiter George knows our order before we do. Their lunch prices are great. A bone in dry aged steak cooked to perfection in the 20$ range is well worth twice as much. Definitely go for a great lunch or dinner. Ask for George if he is available. You go in a customer and leave a friend with an incredible meal."], ["Jenelle K.", "\"I'm in the mood for a juicy steak!\" are words that I rarely utter but  my experience at Capital Grille literally had me eating my words. On this night, my friends and I took advantage of The Capital Grille's Charlotte Restaurant Week menu that consisted of three courses. For my starter, I went with the Wedge salad topped with applewood smoked bacon and blue cheese. The salad was simply delicious and dressed perfectly with the right amount of dressing. For the second course, I chose the porcini rubbed tenderloin. This is the part where I drool... that steak, man that steak! That piece of meat was prepared and seasoned to perfection; it was hands down the best steak that I've ever had! This marvelous piece of heaven was served with green beans and mashed potatoes. And now for the grand finale: chocolate espresso cake (close your mouth) lol. This dessert was simply marvelous. The coffee and chocolate complimented each other making each bite better than the last. The texture of the cake was a hybrid between a mousse and a cake...very creamy. I can't end this review  without mentioning the impeccable service. We were seated nearly 20 minutes later than our reservation, but upon being seated, we were greeted and served with a smile for the remainder of our dining experience. Eating my words never tasted so good!"], ["Dennis T.", "I went for lunch with some colleagues and had the tuna. It was a bit overcooked and clearly not fresh. The ball of rice was also okay. The green beans were steamed fine. My colleague's ribeye sandwich was apparently pretty good but why go here when youre not on business?"], ["Sheritta R.", "My husband and I ate at the capital grill tonight for the very first time it was outstanding. I started out with a capital cosmopolitan and he had the adult only Arnold Palmer,  then I had the lobster crab cakes it was to die for. For dinner I had the  porcini Rubbed Bone-In Ribeye with the grilled asparagus and the lobster mac and cheese OMG is all I can say, the steak was so tender and juicy, he had the Wagyu Cheeseburger with Fried Egg and Crisp Onions and truffle Parmesan fries. The serves was absolutely  wonderful  our waiter name was David he was always there he never missed a beat this whole experience was absolutely great. We had a ball for the food was GREAT!!!!!!"], ["Nikki W.", "I have to move this over to my 5-star club.Every experience I have here is just amazing. I love to sit at the bar. Paul is just a tremendous bartender and all around great guy. He takes such good care of us every time we come in for drinks or food.My must get app: the calamari. With the peppers, it doesn't need any kind of sauce. Holy.Item I'm currently obsessing over: the Chilled Seared Sushi Grade Tuna. I always get steak when I come here (I mean duh, why wouldn't you?), but I've recently become addicted to this. Absolutely delicious. I go with the bar menu version. Smaller portion than the entree. I pour the wasabi oil over all of it... then take alternate dipping pieces in the other two. Money.End every meal here with a shot of Sambucca. Trust me on that one."], ["Giannabrie F.", "Had a dinner date with my best friend here during restaurant week.  I've never been to Capital Grille so I was excited to try it out.  I have only heard good things so I can't say that I wasn't a little disappointed with a few things...I thought it would be safe to try a place like CG for Restaurant week because it is truly a chance to get more bang for your buck.  However, I am pretty sure everything switched once we said we were there for Queens Feast.  The server had been so polite and accomidating up until the point of our decision to order from the Queen's Feast.  After that moment I don't think we saw him the rest of the night, not even to bring us our food.  Seriously!  You may think I am kidding but I'm not!He brought us bread with literally only 2 small rolls in the basket.  We had bread envy because we could see all the other tables with with bountiful bread baskets!  We figured it was because there was only two of us but the other tables only had two people as well but they had way more!  Well, we ended up asking for more bread and he never brought it.  We asked the other gentleman that was supposed to be assisting with our table as well and he brought it about 15 minutes later.  Our glasses of water were empty the majority of our time there.We both ordered Filet Mignon which was very tasty.  It was warm, not hot when it came out but still very tender and nicely flavored.  We both ordered it medium rare and it was cooked perfectly.  Two sides came with our meal and I think they were supposed to be family style but they were really what you would see if they were served on an individual plate.  The mashed potatoes were sticky/gummy and lukewarm.  They were served in the smallest family style portion I have ever seen.  Unless it was a small family of ants, I would say we got screwed on the potatoes.  The string beans were cold and hard (undercooked) and inedible.  Didn't touch them.The desserts were decent.  The flourless chocolate cake was so rich it was unbearable.  It was the dark bitter chocolate flavor that just wasn't very good.  The small bite of cheesecake was good though.  Just....small.Overall, I would say this experience was subpar, especially for the reputation of the restaurant.  Why does service and quality AND quantity have to suffer because it is restaurant week?  They did all seem overly busy so I understand that everything isn't going to be perfect but we didn't even see our waiter the rest of the evening until he flung our check at us.  I guess I would say it was just overall disappointing.  The steak saved the day.  That was some darn good steak.Not in a hurry to come back....other competitors have won my heart."], ["Brittany K.", "I have been here twice now so I think I am able to give a good overview. Ironically, both times I had George as a waiter (a nice asian gentleman)...he is HILARIOUS, and a great waiter. So shout out to him.Pros:Everyone is super friendly, accommodating, etc.PARMESAN TRUFFLE FRIESGreat wine by the glass selectionfast serviceSuper nice waitersroom for improvement:I ordered my steak Med Rare and it was most certainly rare. VERY rare. (I know some people don't know what Med Rare, or Med, etc really means, but I do.)Wedge salad= waste of money. Not really good, bulky to cut/eat.Overall, I will def come back, especially because it's super convenient for my client. I would expect a steak place to cook a steak to my requested temperature and if I had more time I would have probably sent it back to be cooked more."], ["Eric M.", "I took my family here for Charlotte's Restaurant Week the other night to celebrate my dad's birthday. There were 5 of us. Let me just say, it was incredible. I've done the Restaurant Week thing before on numerous occasions and, it's very easy to come across servers and restaurants that are focused on getting you in and out as quickly as possible. This was absolutely not the case here.Being that it was Restaurant Week, there was a set menu for us to choose from. Unfortunately, there was not a vegetarian option (my fiancee is vegetarian), however the server spoke with the chef and they were able to come up with an incredible vegetarian pasta that she loved. The server was very conscious to avoid any soups that had a meat broth as well. In addition, at no point were any of our water glasses ever empty, every interaction with the server was met with a smile, and what's more important, we never felt rushed. The server found out that it was my dad's birthday, and brought him a cheesecake with a candle for dessert (complementary). As for the food, I can say that this was without a doubt the best steak I've ever had. The filet was so tender and cooked perfectly! For some perspective, I've eaten at Ruth's Chris, Del Friscos, and several other high-end steakhouses in addition to working at a very high-end country club. Capital Grille blew all of them out of the water. I truly can't say enough about our experience. My dad said that it was the best birthday he'd had in a very long time, and attributed it to his experience at Capital Grille. If you are looking for a great place to eat, with great service, I can't recommend this place enough."], ["Koli D.", "We sat in the bar when we came I because we had just left a Hornets Game, didn't feel dressy enough the sit in the dinning area. But it was Delicious! Great wine selection, fabulous customer service and down to earth bar tenders, very accommodating."], ["Candyce B.", "This place was definitely worth the wait! I met some girlfriends for Restaurant Week. It's always super busy bit with our early evening reservations we didn't feel rushed through our meal at all. The service and wine selections were phenomenal. Our glasses were always full, we didn't ever have to ask for anything and  our waitress offered excellent wine pairing selections with our dinner. For my meal I ordered the Caesar salad, filet cooked medium well and creme brûlée cheesecake for dessert. The salad was just average. Nothing really special but the steak and cheesecake were absolutely fantastic. The steak was cooked perfectly and so tender!!! I enjoyed every single bite. And the creme brûlée topping in the cheesecake was a nice spin on such a classic dessert. I'd absolutely go again."], ["Joe P.", "For my money, there is no steakhouse as consistently outstanding as The Capital Grille. Whether I'm in Atlanta, D.C., or Charlotte, their steaks are always cooked to perfection, their service always world class, and their wine selection second-to-none.My wife and I recently dined at the Charlotte location during the Queen's Feast Restaurant Week, and for the absurdly low price of $30 a person, each enjoyed a delicious 8-oz filet, two sides and a dessert. As luck would have it, our local Restaurant Week happened to coincide with the Capital Grille's Generous Pour event, so we each enjoyed glasses of four different red wines for just $25 each. When the bill finally arrived, we couldn't believe what an incredible deal we just had!I could go on about why The Capital Grille is far and away my favorite restaurant, but you'll have to experience it yourself to understand. There's no better place to celebrate a special occasion, take a client for a business lunch, or just enjoy a fantastic steak."], ["Corey Tess T.", "Dropped in for lunch at an odd hour between lunch and dinner. The place was empty so we had the best server to ourselves and a great table.This is one of those places where even for lunch, you are going to drop a dime to eat or drink the awesomeness. I started with a cup of the clam chowder, then had the sliders along with the homemade grapefruit soda. YUM!The french onion soup is really good too. My friend had that.Everything was awesome. Normally this sort of place is too \"stuffy\" for my style - but I have to admit, the experience is always perfection. Our server brought us over a little amuse bouche' as well - the squash soup - so yummy - it tastes like the season."], ["Kevin S.", "Upscale but...My wife and I celebrated our 35th anniversary last night at The Capital Grille.The food was excellent. We had both the lobster crab cakes and shrimp cocktail for appetizers. Very delicious. Just the right spice and temperature. For our main course my wife had the salmon and I had the night's special steak. My wife enjoyed her salmon but did have to add salt which I found a bit unusual since she rarely does that. My steak was cooked to perfection and our sides of Sam's mashed potatoes and asparagus were also prepared to our liking.I can find nothing but great things to say about the quality of food.The only thing keeping me from giving me The Capital Grille five stars is the service. It struck us as being rude when we were at the reception station and the host told one of the wait staff to \"go sit these two\". Not really what I was expecting from a place such as this. Our waiter was \"Ok\". Nothing special. He was semi-attentive but as we were having our first sips of our after dinner drinks he brought us the check. Really? Do you want us to leave or do you want us to sit and spend some more money.? It was Halloween and its not like the place was slammed full. Call me picky but if I am dropping $250 for dinner then I would expect that the service equal my expectations.I do want to give The Capital Grille a big Thank You for going the extra step of setting up our table for our anniversary. My wife was thrilled. Thank you!"], ["Aleaha R.", "We visited during restaurant week and one thing to note is the service was outstanding. She was awesome, attentive, helpful and don't find service like this much. Overall the food was good. We got salads to start, nothing special what you would expect for a Caesar salad. The filet was good but could have been a little more tender. I find many steak restaurants have an issue cooking to med-well. It was good just not great. The side were really good, we got potatoes, beans and man & cheese. The mac & cheese is to die for...awesome!! Desserts were good, the chocolate flourless cake was great but super rich. Overall good experience."], ["Andrew A.", "Had never been to Charlotte, NC before or to this restaurant but all I have to say is Wow!  Amazing meal as I had the Filet Minon and it was one of the best meals I have ever eaten.  As and added bonus the waiter pointed out that the DT Suh from the Miami Dolphins was at the next table over and when he got done I went and asked for his autograph and he was very nice and gave it to me.  This place was incredible from the moment we walked in to the moment we left.  It is on the very expensive side but well worth every dime we paid.  I would recommend this place to anyone visiting who wants an upscale atmosphere and a great top notch dinner."], ["Apache T.", "Just to let everyone know the capital grille is doing a steak & salad special. They have three different options of salads and steaks to choose from. I got the spinach salad with fire roasted tomato and house mozzarella. I forgot was how my steak was prepared but I got it cooked medium. I paired it with a grapefruit buck cocktail because it was the lunch hour after all. One of the many reasons why I'll keep coming back is the older Caucasian lady that works there. She's so upbeat and has the best customer service skills."], ["Manila H.", "One thing I love about this place..  is David. He's an awesome server and make sure to look after  your needs. Foodwise.. They  have the best steaks. I love their creamy clam chowder... The ambiance  is so relaxing. Very quiet."], ["Katie C.", "I'm not so sure why everyone is so in love with capital grille. I've had the filet & the lamb here and to be honest, I was not blown away. I personally really like my steak charred, so maybe I can be biased when it comes to reviewing their steaks. The lamb was a dissapointment to me completely. I did not enjoy how it was cooked, or how it was seasoned. I felt like the entrees were sub par. The Au gratin potatoes wer DELISH though. The Sam's mashed potatoes are probably the best mashed potatoes i've had at any steak house here."], ["David M.", "Don't always need reservations. Have walked in a few times without reservations. The wine menu is great and the pineapple martini is delicious. The kitchen is very accommodating to allergies. The ribeye is amazing and I also always enjoy a seafood dish such as the salmon."], ["Dorothy B.", "Nice late-dinner last night after the Laugh for a Cure. Since it was late (almost ten) we opted for an entree only and no other accompaniments.I went with the Scallops and Mushroom Risotto and my friend had the Chilean Sea Bass. The Scallops were really good - and with five on the plate it was the perfect size entree. Some of the best scallops I have ever had. The Sea Bass was interesting, as it was served in a beef based mushroom consumme broth.That was a little different and would have been better in a bed of something else (like the risotto or maybe some spinach).  We will be back!"]], "Lumiere French Kitchen": [["David L.", "They have the most professional service in Charlotte and their food equals or exceeds the finest restaurants in Charlotte. The staff is able to suggest perfect pairings of wine with your entrees. They serve french press coffee that is excellent. Nothing more to say except; there is a new sheriff in town and it's called Lumiere. Take your special person here and they will  know they are treasured by you.3/8/15 They recently added a Tuesday classic French special: for $25 dollars you get a glass of wine and the special entree. There is not a better deal in Charlotte. I have tried it three times and I would be there every week but my bathroom scale vetoed it.6/8/15 Last week I tried their wine tasting and it is a great deal at $15. You had a selection of four French wines, two white and two red all from Burgundy, plus they served the best  prosciutto I have had in Charlotte. Over the past year I have eaten there quite a bit and I never had anything but a wonderful meal. I would suggest to those reviewers that did not have an A+ experience that they give it another try. As to the price, this level of food in NYC would easily be triple the price; we are lucky to get such value in Charlotte."], ["Maxine S.", "Fabulous dinner. We had the 3 course Tasting Menu which was wonderful & a culinary bargain at $45.00. Service was excellent & great atmosphere. An incredible addition to the Charlotte Food Scene! Our dinner was so delicious & presented beautifully. Lots of little extras too. We can't wait to go back!"], ["Carrie O.", "FINALLY Charlotte. Amazing food, beautiful presentation, great service and good wine! Everything we ate was delicious! And, 50x better than Liberty!"]], "Lebowski's Neighborhood Grill": [["E C.", "Had the spinach salad with addition of Haddock fried strips with honey dijon.  Spinach looked and tasted fresh.  The raw onions are included as are dried cranberries.  It was big enough for me to share.  You get 3 strips and the batter is very tasty.  Will definitely go back and would order this again."], ["Tyler H.", "My first visit was today.No wait, we sat at a comfy corner table on the patio. Multiple servers were making sure we never went thirsty. The food was as good as I expected. I was going to try the tacos but was lured in last second by the wings slider and fries. Still excited about going back. If the tacos are kicking ass and the service is comparable 5 stars it is."], ["Rachel S.", "Great neighborhood restaurant and bar!  The food is good and the service incredibly friendly. Nice selection of interesting and local beers. The fish and chips are the best in Charlotte!"], ["Jeff S.", "I had a Dealsaver coupon that was about to expire at the end of the month and I have lived near this place for several years and it's about time I checked it out.I sat at the bar and this was one of the best bar experiences I've ever had.  The bartender explained the draft beer selection and their specials on Carolina Craft brews.  Yay!  4 of the locals were represented including Triple C.  :)  Anyway, i had seen the pictures of the food on Yelp and pretty much decided on what I was ordering from those - Fried Pickles and Beef on Weck.  The pickles were advertised as the \"Best on the Blvd\" and that's probably true.  I don't know of any other places on East Blvd that even serve them.  But the slices were big and they were decent.  I like Alexander Michael's better though.   The Beef on Weck was amazing.  The weck itself was the best sandwich bread I have ever tasted.   I ordered the garlic fries with it and they were tasty with a subtle garlic flavor.   As for the venue, it's not very big and I can see this as a great neighborhood bar.  Service really shines here too.  This place is definitely worth coming back to!"], ["Jon L.", "This is my favorite place to eat and drink while in Charlotte.    Always good food and great service. Wings are better than most elsewhere. Fish and chips is also excellent.   Great beer selection as well."], ["Sascha S.", "We were at Lebowski's a few months back for a few beers and we were impressed with the sincerity of the bartender, so now we live in Charlotte and we had to go back for food and we were not disappointed.Wings with sweet honey chili sauce were nice and crispy, needed no Blue Cheese or any other sauce.PLT sandwich (Pimiento, Lettuce and Cheese) was great.I had the burger with Pimiento and onion rings, it was phenomenal, as were the garlic fries. My only concern was that it seemed that the bathroom walls and ads behind the urinal hadn't been cleaned in a long time, they looked very dusty.Overall, I will be back often!"], ["Nikki W.", "I really like this place! I don't know why I don't stop by more. First time I headed over my friend and I sat on the patio and sipped on beers. Not a huge beer menu but think I've been spoiled by the places with 40 or so beers on tap. You can always take your chances with a 'mystery beer', which is really just whatever random beer they pull and charge you $2 for haha. Last time I headed over was for lunch. Parking in the back can get tight and can be a challenge getting out as well so be prepared. But anywho, ended up getting a half-priced deal so headed over to meet a friend. I order the buffalo chicken wrap and my friend opted for the French dip and we both had side salads - it was all very delicious! Gotta say, I was happily surprised... I underestimated the quality of food at Lebowski's. And the service was prompt and friendly as well. A great spot in Dilworth to chill out at night and a speedy place to go for lunch as well - props to Lebowski's."], ["Kevin L.", "First... Let me just clear it up and say... the BEST Buffalo Wings in Charlotte, NC.This is a great place to go for dinner, lunch, a quick bite, for bar setting, and for us... football.  This is owned by Buffalo NY natives and keeps true to the tradition of Buffalo.  I don't now of a better Beef on Weck in NC than at Lebowski's.  We were lucky last season when our Chicago Bears played a ton of 4pm games after the Bills.  If you are a Bills fan, there is no better place to be on a Sunday.  We also would recommend the Veggie Pita (which we get in a wrap vs the pita) and the burgers.  Monday is 2 burgers for $10 and 1/2 off wine.  Killer deal.  I believe Wednesday is 1/2 off wings.  Salads are also very good.  Becoming one of our very favorite bars in Charlotte."], ["Elizabeth A.", "The more I come to Lebowski's the more I love it!  I been here at least 6 times in the past few months, both for lunch and dinner. Especially since they've been having Living Social coupons like crazy... man I love a good deal. My boyfriend and I can't get over how a little dive bar like this has such outstanding quality food! As much as I still love the veggie burger and garlic fries here, I've totally fallen in love with their SALADS! My favorites? The Spinach (Organic baby spinach, feta cheese, red onion and dried cranberries) and The Mission Bay (Garden greens, tomato, roasted corn & black bean salsa, sliced avocado). I order both of these with a vegan patty on top and the CREAMY CILANTRO LIME dressing... best dressing ever! My boyfriend is not a vegetarian like me, but doesn't eat as much meat as the average omnivore, he usually orders a veggie burger instead of a hamburger. But he's totally fallen in love with the quality of the Certified Angus Beef Burger here at Lebowski's. This past Friday we came here with a Living Social coupon, so we wanted to try out an appetizer and we were particularly jonesin' for nachos, but the Niagara Street Nachos are the only ones on the menu and are centered around grilled chicken.  But no worries, I simply asked our waitress if they could make a vegetarian nacho plate... and MAN OH MAN the chef brought on an epic order I couldn't believe. Tri-color tortilla chips with queso, shredded cheddar, grilled spinach, zucchini, peppers, tomatoes, mushrooms and a side of salsa. WHAT? This blew my mind."], ["Kacey B.", "Cool place, tasty food and obviously delicious white Russians! Prices were good. Place isn't big but it didn't feel crowded. Friendly folks there. My cousin said their wings are the best!"], ["Eddie Q.", "Went here with my wife of Friday and I was blown away by their wings, food is great, turkey slider I recomend. Definitely  going back soon."], ["Bob H.", "The Best Buffalo Wings In Charlotte Period."], ["Sean O.", "Being a Buffalo native, I love Lebowski's! The food is good and well priced and the atmosphere is awesome. One of my favorite movies is the Big Lebowski!"], ["Chris V.", "Got a taste of Triple C Brewing \"The Dude Imbibes\" tonight at Lebowski's. I love that I can come to Lebowski's and get access to special local brews!  Lebowski's also offers sweet potato tots with a creamy, sweet dipping sauce...mmmm!"], ["Maggie K.", "My husband'a favorite place to eat. Great bar food, fast and friendly service, and easy on the wallet. They always have a great selection of draft beers and rotate the taps often."], ["Trey S.", "...As some of you may know, I took a short hiatus from writing reviews.  This break was due to some negative feedback I had received from restaurant owners, but mostly because I was busy with work...ANYWAYS, after much prodding (thanks Ben!) I'm BACK, and I'm back to close out 2013 with a slew of the best reviews from around the QC. What brought me back, you ask?  Simply put, THE DUDE, and the wings they serve up at Lebowski's...Two buddies of mine had been encouraging me to give Lebowski's a try.  I was told Wednesday was the place to go because of their half-priced wing special on Wednesdays.  As I had this past Wednesday off from work, I decided this would be my virgin foray to Lebowski's.  Parking:  There is plenty of parking located behind Lebowski's.  I am not sure of the relationship between JJ's and Lebowski's, but you could also probably park on the JJ's side of the building as well.  No parking issues at all, which is always a plus.Ambiance:  The first thing I noticed upon entering Lebowski's is the darkness.  Though I went there around lunch time this past Wednesday, the place felt dark and somewhat dreary to be honest.  One would think that with such connections to the Big Lebowski, it would be a bit more lively inside.  Service:  We were greeted by the one person that was working the entire bar.  She told my friend and I, we could seat ourselves where ever we wanted.  Our drink and food orders were taken fairly promptly.  Though our server probably had three to four other tables, her service was still very much on point.  Our drinks were refilled promptly, when we asked for an extra ranch, one was brought directly to us.Food:  As I stated above, I came here on Wednesday, looking to sample the wings I had heard so much about.  So of course, I ordered a batch of 10 goldrush wings which did not disappoint.  The wings had that rare combination of being well-cooked yet still tender.  The meat on the bones was very tender, and fell off the bone with with every bite.  The wings were PERFECTLY sauced.  There's nothing worse than a dry wing!  The ranch was thick and cold, just as it should be.  My friend ordered the buffalo-style wings and was also satisfied with wings. I've only been to Lebowski's once and I've only had one thing on the menu.  Nevertheless, the wings, and service were excellent and I'll be back."], ["Basshector J.", "I enjoy this bar. I can get a manhattan for $11, which is reasonable. And the industry nachos with the gorgonzola and buffalo chicken breast...So dericious. I like this tiny bar."], ["Marky M.", "Went to lebowskis for Dyngus Day for some polish beer ,cabbage ,polish sausage and pierogies . Okay so this is what I got a piece of toast, tasteless cabbage , bratwurst and some factory processed pierogies. Awful it is very sad to say that the owner is a buffalo native related to this dish.On another note  The service was good"], ["Laurie K.", "I don't know why I've never written a review expressing our love for this restaurant!  We've been coming here since they opened, and, although we don't go out to eat very often, this is our go-to place for special events when we want to have a good time, eat good food, get great service and relax.  I usually get a fish plate, or the chicken wings, which are some of the BEST in Charlotte!  The Burgers are of course delicious, and the plates are plentiful.  They have a good selection of draft beers and a full bar with a variety of signature drinks.  It's just a great place all the way around and we hope it sticks around for a long time."], ["Kelly K.", "Great Neighborhood spot!  The chili is my favorite along with the great sandwiches.  Also, the Time magazine cover mirror in the ladies bathroom is hilarious.  The Dude Abides!"]], "Nolen Kitchen": [], "JackBeagles": [["Linda S.", "Get the mac and cheese. I do not see how anyone could not like coming to this place. It is amazing. Prob the best food you will find after 2 am when the bars close. Very chill and very good. That's really all you need."], ["Sam L.", "A great spot for lunch or late night munchies!Classic mac is some of the best mac and cheese you'll find!"], ["Hopefawn L.", "In the last year, my fiance' and I have had the chance to try a lot of different restaurants in Charlotte.  For a comfortable, low key, well priced meal, I can't go wrong here. It's a fun spot in NoDa with a little stage for live music.  I simply adore the food here. From their burgers and cheese-steak sandwiches to their specialty mac n cheese it's all a win. And they have daily food and drink specials.The only thing I'd change is I'd prefer my Guinness on tap than the bottles."], ["Jorge P.", "One of the best places to not only grab a bite but enjoy live music as well as excellent service from their staff, specially managers Alexz & Mike!"], ["Nick H.", "An incredible gastropub with a huge patio in the rear just perfect for outdoor summer fun. Mean burgers!!!  Excellent Mac and cheese, and a nice draft list, not too big not too small.   You will not be disappointed.... Enjoy"], ["Kristine K.", "Definitely a \"hidden gem\" in Charlotte!  I've walked by this place many times on my way to other restaurants in NoDa, but never stopped in until today (from the outside, it just looks like a dive bar).  My husband and I had lunch here this afternoon, and WOW-everything was really AMAZING!  The Mac n' cheese is by far the best I've had in Charlotte.  I highly recommend the Jack Mac!!  The Hawaiian chicken wrap and boneless wings are also delicious.  Can't wait to come back!"], ["Kate S.", "Friendly service, good food, reasonable prices... What more can a girl ask for in a casual bar in NoDa? What? Amazing Mac 'n' Cheese you say? Why, yes! They have that too!I'll certainly be back. The bartenders and kitchen staff (who you can see because of the open-kitchen floor plan) are extremely jovial and friendly. Everyone on the wait staff was smiling and joking around. It seems like a place where everyone is accepted for who they are. I really enjoyed it."], ["Meera M.", "We're out of towners in for a late bite. Food was delicious and the bar was as expected. I definitely recommend the Widowmaker (seriously yum) and the black and blue mac n cheese might almost be TOO blue. definitely for a Blu cheese lover. Staff was prompt and friendly!"], ["Bruce K.", "Definitely a place to drink. And sadly, I came on a day that I didn't want to drink. My brother and I came upon this place hearing good things about it. I, wasn't hungry (surprised?) but my brother was so he got a meal and told me to order some appetizers. We ordered the mac n cheese and the buried treasure which was covered in beef, cheese, on top of waffle fries. They were delicious. The mac n cheese wasn't bad but the only problem I had was it was a little on the salty side. Though, I didn't have a good beer to wash it down so that's probably why it's a little salty. If you have some alcohol with that I bet it would taste awesome.The service. Not bad. When we went in there it was during late afternoon so it was sort of dead. But, that doesn't matter when the waiter was nice and offered her favorites on the menu that made our decision for what to get. All in all, I would come here to drink and eat. But I want to emphasize, next time I'm definitely going to get a beer with my food."], ["Connie L.", "we needed a late night drunk meal and ended up here. the burger was okay but nothing special.. the burger came with a HUGE pickle :]"], ["Mike H.", "Looking for a bar with good food, good drinks, a friendly staff, and nice people? Well normally I would tell you to keep dreaming because no bar has all of things at once right? That's what I used to say before I went to JackBeagles!I first discovered this place a couple of years ago while hanging out in NoDa shortly after moving to Charlotte.  Since then I've been back several times.  The staff is always friendly, it's like they actually enjoy their jobs and want to be there.  I can't say that I've ever had a bad experience here with any of them over the years.  I was pleasantly surprised by how friendly the other patrons are and how inviting the atmosphere is at a whole.  One of the  few bars I've come to where you can really just sit down and feel free talk to anyone. Just about everyone seems to be having a good time enjoying their food/drinks and very social.  I've met all kinds of people here.  If you come during evening hours they usually have some good music playing in the background as well.But enough about the people, let's talk about the food.  First I have to get into the Mac n Cheese because this is the dish that's going to keep most coming back.  JackBeagles has hands down some of the best Mac n Cheese I've ever eaten (and I've eaten a lot of mac n cheese).  They have several different styles but if it's your first time then I recommend starting with the signature Jack's Mac.  Prepare to be blown away.  On your subsequent visits (because you'll probably come back), feel free to try the other flavors as they're all amazing.  My other favorite is the Mexi-Mac.If you need something more then you have to try one of their hot dogs.  Trust me all you need is 1.  These things pack a delicious wallop.  For the bravest souls I have to suggest the Buried Treasure Fries.  These aren't your traditional cheese fries.  Once you order them and see all the things topped onto them, you'll realize why they're called \"buried treasure\" fries.   You might want to share these with your date as it's quite a bit for one person to handle.I can't recommend this place enough.  If you're only in Charlotte for a short amount of time and want to experience a good bar atmosphere and at the same time grab a delicious meal, head to JackBeagles.  Good thing I don't live in this part of town or else they'd have all my money haha."], ["Katherine C.", "The energy of this Charlotte restaurant makes you feel like you are in a city. It is a narrow restaurant. There is exposed bricks. It has a good energy that I feel like a lot of Charlotte restaurants are missing.The outdoor area is fantastic and it looks like they keep adding more to it. There is usually good music.The food- there is a solid breakfast/brunch crowd. It gets busy. The lunch/dinner menu is good. The hamburgers are juicy and cooked to order. The best thing is the Mac and cheese. There is a Mexi Mac type that is especially incredible. This place feels like a diner. It has a good, low key vibe. Go."], ["Rachel S.", "Jack Beagles serves a great brunch and a mean Bloody Mary. My running group eats there every Saturday; they accommodate a bunch of sweaty, thirsty runners with no complaints. The only downside is that service can be a bit slow. I love their skinny puppy omelette and their breakfast taters are out of this world!"], ["Charlene ..", "I ordered a French toast. Not only was it undercooked but it tasted mediocre. I could taste the runny eggs in the French toast. It was disgusting. I even told the waiter it was undercooked and he did nothing about it. No discount, nothing.It was also served with packets of pancake syrup, which is not impressive. I am very disappointed and I will never come back here. What a waste of money."], ["Paul W.", "Ate here 2 different times now. I'd give this restaurant a higher rating if they'd iron out a few details. A big one for me is that they serve instant sweet tea, not brewed. Huge difference in flavor guys!! I love me a good glass of sweet tea with my meal. Also, when asked for my biscuit to eat my gravy with, it was literally hard as stone. No kidding. I showed it to the waitress, and she did bring out 2 fresh ones. But, it was a joke at our table. Food was ok... Potatoes/home fries needed more seasoning. Bottom line, I'll be back. But, not for a while to see if they got real tea to serve to their customers."], ["Tim H.", "JackBeagles has some of my favorite food. They are the only place to my knowledge in Charlotte that makes authentic philly cheese steaks, with whiz. You don't have to order it this way, but why wouldn't you? They have a bunch of other awesome food too. Drink selection is good and staff is awesome, especially Alex. She is very accommodation and cheerful. Outside seating is covered and internet jukebox is ready to play. The bar set up is great, but if you're looking to sit at a table, outside is probably best. Inside deist have very many tables for groups.I took one star off because on the weekends at night it fills up with a lot of douchey (for lack of a better word) people. They have live music a lot on weekends, but 9.5 times out of ten, it's not very good. They do get lucky and get a good band every once in a while though. The best time to go is lunch or breakfast. Both menus are phenomenal. Full bar for brunch with games on the TVs outside when weather permits."], ["Carina H.", "10 stars.  The best food in Charlotte.  Every one of their macs is mind blowing.  Fire grilled burgers.  Nice music scene.  Love jack beagless!!"], ["Kaili H.", "My husband and I come here almost every Thursday night for beer and hot dogs - which are delicious and cheap! You can get a hot dog, with variety of toppings (I usually get mine grilled with sauerkraut and spicy mustard), for just $2.50, add a side, like fries or coleslaw, for $1. Best deal EVER! Beers on tap are local and are changed frequently. Addition: The macaroni and cheese is to die for.The music is like a box of chocolates, you never know what you're going to get. I've heard Prince, Smashing Pumpkins, TLC, it's all over, but usually themed for the night, i.e. the night I heard TLC was mid-late 90s hits. Sometimes it's 70s funk, or 80s rock.... Aaaand it's awesome. You get the picture. Our favorite bartender is Kristin or \"Bunny.\" She's attentive, efficient, and super sweet and pleasant. There isn't much seating, so if you're a group of 5 or more, good luck with grabbing a table inside. I think they have live music out back and more seating, but smoking's  allowed (it's outdoors).To sum it up: Jack Beagle's is a hipster dive bar, with good music, decent beer selection, and low prices. It's completely unpretentious and is, what I think, the jewel of NoDa."], ["Christopher A.", "So as a regular here I was terribly disappointed in my visit tonight. I placed a to go order and was told 15 min. I didn't get there until 20 min after I called. Upon arrival, I could tell the place was busy. The food is always amazing here but sometimes the service is less than acceptable. Tonight I was shocked. Not only did I stand and wait 10 min until someone acknowledged me, I saw them give my to go order to someone else! The server and bartender seemed uninterested and were rude to me when I made them aware. The daytime staff are amazing most of the time. Tonight...they were off."], ["T H.", "I love this place....great food, good edge to the atmosphere, and plenty of good beer selections. I especially liked the knowledge of the lunch time manager with my beer selection and how accommodating he was. NoDa needs more managers like this."], ["Peter M.", "Was in the mood to try their SOS.  It's basically a southern version of a classic served on Texas toast and topped with sausage gravy,  plus they substitute the original chipped beef for chopped meat and onions.   Think of it as a Philly grinder smothered with sausage gravy.   For an extra $3 they'll put a couple fried eggs on it,  too.  Overall,  the meal was tasty and filling;  however, not really a monster do-over.   This sandwich wasn't unique enough for me to return to a bar that's just waking up and decided to cook breakfast."], ["Mike H.", "The whole NoDa area is very hipsteresque.   Not really my cup of tea.But after seeing JackBeagles here on yelp and getting equally good reviews from the locals we decided to check it out.Draft beer selection is a little on the small side, but all 8 taps are craft brews.Music playing has a 90s atmosphere to it.   When is the last time you heard New Kids On The Block?!I had the bird pig hoagie special.   Chunks of chicken, bacon and BBQ sauce on a toasted hoagie bun.The Mac n cheese was pretty good too!"], ["Robert F A.", "Nicely crowded early evening dinner/bar scene. The dinner salad with chicken was large and delicious.  The kitchen here is always spot on. Nice selection of draft and bottled beer. Attentive and friendly staff. Great spot in NoDa."], ["Abby A.", "They have a great patio!! Weekend brunch is super affordable, too. $ 'mosas and $4.99 b banana pancakes!"], ["Stephen A.", "Quirky hipster bar/restaurant with a great staff and wonderful menu. Had breakfast here. Ended up ordering \"Shit On  Shingle\" which was awesome. Great country cookin at a friendly place in a cool hood."], ["Chris C.", "This place didn't stand out. It wasn't bad either though. I rolled in here needing some food late after a concert. It took a lengthy amount of time to be taken care of. Aside from sitting down and waiting for nearly 15 minutes for the waiter to acknowledge us her service was ok. They were missing the most famous local craft brew which was disappointing. The food was average pub food. I wouldn't go in here expecting wow but it should meet most standards."], ["Asha R.", "Sat out in the back patio here. I loved the low key vibe of this place and how easy to was to grab a seat. I had a ripper (hot dog) with slaw and spicy mustard, and a cup of the jack Mac. Hot dog was tasty and delivered my meat fix. I was a bit disappointed by the Mac n cheese though. It was more \"liquid-y\" than my preference and clearly had not been baked. It was good and I ate it all, but reviews would have me believe it was the best in town. Definitely not the case.  Service was pleasant but very slow, especially for a quiet night.If I lived in the area I could see coming by here on a whim for a drink and a bite. But as it stands I do not live nearby, and there wasn't anything in particular that would make it a destination for me so I will likely not be back."], ["Allison B.", "Came here on a Sunday morning at 10 am, sat down and ordered quickly. (The Shit on a Shingle and an order of eggs with sausage) The inside was busy--but not slammed by any means, and we watched as couples sat down next to us and received their orders within 10-15 minutes. 20 minutes pass... Still no word. Then 30 minutes.... Our waitress comes up to us and says she \"doesn't know what happened\" but it \"shouldn't be more than a few minutes.\" Now we are going on 45 minutes, all of the surrounding tables/bar stools have eaten and already left and have been reseated. Our waitress comes up again and gives a pretty insincere apology, saying to us \"it should be coming soon, but I don't know if you want to wait any longer or just leave.\" Since we waited so long, we figured we would give it a few more minutes. Yet another 10 minutes passed... So, hungry and frustrated and without a sincere apology or explanation, we walked out. Not proud of walking out, but an hour of waiting is inexcusable. Guess customer service wasn't a priority this day."], ["Jonathan B.", "I really liked this place. Nice variety on the burger menu and the Mac and cheese is really good.  The service was wonderful and I liked the atmosphere. Nice selection of bottle/can beer as well as plenty of great choices on tap.  Prices can't be beat.Definitely check it out."], ["Krystal B.", "Good food, decent beers, nice people, dog friendly. Groovy when there's live music too. Actually, GREAT burgers. And the burgers are antibiotic free, vegie fed cow. Bonus!"], ["Nikki W.", "There is a menu section devoted to different types of adult mac n cheeses. Do I even need to say anything else? Jack Beagles is a super cool neighborhood bar in the heart of NoDa. Low key atmosphere. Friendly staff. Great prices. Killer tunes. Unique beer selection. Nice patio area. They serve food late night and offer a fantastic breakfast menu on the weekends.The wings are tremendous. Wednesday is half price wing night and $1 off whiskey. If you're with friends... I recommend hot garlic parmesan. Outstanding. Skip these if you're on a date. Well, unless your sidekick also wants them. Then I guess you can follow the rule of the couple who eats garlic together stays together.Jacks also serves a mean hot dog. Be sure to get jalapeno relish on it. And don't forget an order of fries. Think thin wedges of heavenly potato goodness. You can also get these buried treasure style... loaded with a laundry list of toppings.This is a must visit place if you are ever in the NoDa area"], ["Liz K.", "Great food, inexpensive, and fun atmosphere.  On one occasion, I took a somewhat large group there last minute and they were very accommodating."], ["Casey D.", "Ultimate hot dog spot! I've had a couple deluxe rippers and the pork tacos here and they're all crazy good! I'm usually not a big hot dog fan but it was hard not to try an island dog when the opportunity presents itself. Plus Bird songs Mexi Cali on tap puts this spot over the top for me!"], ["Stem E.", "Went for lunch, at about 12:30 on Saturday with the wife, so I thought. We were handed breakfast menus. Breakfast? At 1230? Yup! Asked for lunch menu. Was told can't get lunch til 1:30. That was weird. Had \"breakfast\". Wife had omelette with taters and I had SOS w/ taters. Food was okay. Wouldn't go back for breakfast. Probably won't go back for lunch due to the inconvenience. Really need to make lunch earlier."], ["Vanessa I.", "As long as the doors are open we will keep coming back! Drinks can be pricy if not ordered from the drink specials. The BEST food! Bleu cheese and bacon mac and cheese? Yes please! The fried mushrooms are so good and served with horseradish sauce. Cheesesteak, hummus, beer! It's win/win!"], ["Kamilah V.", "In reply to the owner, on my previous review:I think you misunderstood me a bit. I was asked to stand outside and finish my hot dog, and then I could come in. I was not asked to leave for being intoxicated. When I came in, as I was told I would be allowed to, he asked for ID which I provided. I then made a joke, and was pushed out the door despite the fact that I was not resisting or denying leaving whatsoever. He just said \"Then you can get out again\" and pushed me. I don't think that's fair or professional. After the owner of another business who witnessed the whole thing reasoned with him, he then told me I could come inside. If I'd been in the wrong, I don't think this would have been his ultimate decision."], ["Rabab M.", "Great service and interiors. Absolutely delicious beer with the crunchiest mushroom fries. There, I said it!"], ["Laura F.", "I really like this bar. It's a bar with good bar music and good bar food. Their fried mushrooms are delicious portabello slices with a great breading and yummy horseradish sauce. Go for the bigger dog- ripper style, you won't regret it. Finally, the Mac and cheese is amazing. Totally amazing. The back bar is a great space, dog friendly- though the music may be too loud, depending on your dog's noise sensitivity."], ["Joseph H.", "Best drunk food ever.  The boneless wings are amazing, burgers and Mac and cheese!.  Good music, the best place in noda to get some late night eats."], ["Valerie S.", "Just had lunch with two teenagers and everyone loved their food.  Double bacon burger was a huge hit especially the yummy bun.  Another had wings...buffalo style.  And I of course had my usual pulled pork tacos which were fresh and had great textures.  We all had the Mac and cheese.....fantastic way to warm up on a cold afternoon!"]], "French Quarter": [], "McNinch House Restaurant": [], "Rock Bottom Restaurant & Brewery": [["Tony M.", "I love Rock Bottom Brewery!!! I would go to 2 of them in San Diego & La Jolla... Awesome!!! The Charlotte One is even better & Bacon Mac & Cheese is why!!! #Culinary Greatness!!!"], ["Timo E.", "We had the following items and they were great!!!Artichoke crab dipMac and chickenBlack bean quesadilla w/chickenChicken tendersKids \"build your own Sundae\" dessert"], ["Maya P.", "The food and beer selection here is great. Not my favorite local beers but they definitely hit the spot. It's usually pretty crowded but the wait time isn't bad if you're flexible about sitting outside. I'll be back to try more of their foods. I will say skip the macaroni and cheese - it's mostly grease and breadcrumbs."], ["Peggy C.", "Lately this has been Sunday football watching spot for my friends and I. We normally occupy one of the long bar table in front of 4 TVs (3 more on the other side) for hours. With that being said, there are hits & misses but overall I am a fan of being a fan at Rock Bottom.Service is typically of acceptable quality. They can be a little slow in checking in, or filling water, but on the other hand we are there for a long time. Food is actually pretty good. They also have game day specials on wings and nachos etc. Half nachos ($6) is good portion, but is without meat, which you can add for $2. They offer their own brew for beer (in case you don't know). They have beer special for Sundays as well. I can safely say that you can't go bad with ordering anything. I had a lobster & shrimp enchiladas and that was good.Park is free, they validate for the garage under the restaurant. Be careful, my 1st time visit this season ended up charging me money to get out of the garage because the validation barcode was unclear (good news is I got my money back after contacting the parking garage office with proof of my validation via cell phone pic)The only disappointing thing for our football watching days is: BY GOSH, stay on top of the game scheduling. We all know there are a new round of games kicking off at 4pm, so get the remotes ready and change over the moment 1pm game is over. PLEASE managers on duty??"], ["Teresa G.", "Horrible food and service. My husband and I ran in to get out of the rain. My cocktail had spoiled mint. Our steak tacos were delivered cold and falling apart from the runners failure to deliver them on time. Our server was no where to be found from the time she placed our order until giving us our check. This place is over priced and not worth your time."], ["Shanna E.", "We absolutely LOVE the food here. However we had family in town and brought them here and the service was terrible. It's embarrassing the service was so bad after we have been talking this establishment up for so long. The food took forever but was delicious once we received it. The server was Ami and had zero desire to be there and really wasn't in the mood for our party of eight."], ["Drew B.", "Had a large gathering here last night between two different companies. Staff blocked off the area and put signs up indicating it was a private party. Food was warm and drink service was great. Seemed like there was always a server ready to refill drinks. In fact, they had several servers assigned to our group, which was great. Music wasn't super loud and lights dimmed as night hit.  Good experience, no complaints"], ["Kim W.", "I had a good experience.  I came with family and everyone enjoyed their meal.  I can't say it was spectacular, or that it's a must whenever I visit the area, but overall a good meal.  Oh and they'll validate your parking so thats a plus."], ["Jason M.", "Stopped in before the Panthers Sunday night game. Sat at the bar with my buddy.  It was not busy.  The bar was dirty and no one made an effort to clean the space where we were sitting.  Gross.  Bartenders were terrible and not attentive.  Waited 10 minutes before someone asked if we needed something. Unacceptable. The beer was decent, but once we finished we waited a while with empty glasses before finally having to ask for another. Do the bartenders here not work on tips?  Because that's how you get stiffed. Only plus is the beer was $3 and they validate parking."], ["Michael N.", "Rockbottom? What can I say. Hmmm. Don't throw rotten vegetables at me please. Okay, I'll say it: it felt like an upscale Applebee's.  Everyone was helpful and friendly; we didn't even mind the 20 minute wait (at  5:30 PM?). Did not care for their IPA. I love beer and only drank maybe half - tasted more like a Lager to me. Wife's soup was barely warm but she said the flavor was good. My Santa Fe Ranch Chicken Salad was just okay. Some of the lettuce was a bit limp and slimy. I did like the deep fried Jalapeno rings on top. Our waiter was really good but smelled heavily of cigarettes.  Our glasses never went empty and he even packed up our leftovers and bagged them. I think trying to run a good brewery and restaurant at the same time is a tricky operation. Sometimes one may suffer to highlight the other, or both may be slightly diminished as the operational  focus is spread thin. A-OK but not great. Go at least once and decide for yourself."], ["David M.", "Not edible. Came in for a quick bite to eat on a Sunday for lunch. Server was not knowledgeable about the beer menu and was hard to flag down for anything. The chicken was flavorless and tough. The fries were cold and mushy. Will not come back here."], ["Sarah L.", "First Yelp post ever...service was so bad I felt inclined to do it. Fiancé ordered bison burger and ended up getting a 2am with egg, etc. I had garden salad which was good however my Mac n'Chicken had absolutely no roasted chicken in it whatsoever. Apparently it's supposed to be \"loaded\" with roasted chicken. Informed manager and he brought us what we initially ordered but the Mac and cheese with roasted chicken was swimming in grease and oil. Fiancé ended up with a bison burger that looked like a slider on a regular sized bun. Bun was also cold like just out of the refrigerator. Sent that back too. Manager apologized and offered us another beer, we asked for the meal to be comped. When server asked us how our final meal was once my fiancé got a normal sized burger I asked if there was supposed to be that much grease in the Mac and cheese and all she said with a shrug of the shoulders was, \"I think so.\" Unacceptable. When she came back with the check she ran off with the Mac and cheese not even asking if I wanted it boxed. Food was comped but drinks still on check. After waiting 10 minutes we had to bring the check in to pay; fiancé ended up asking for the manager to let him know what happened after he brought us the corrected meals. The first thing out of his mouth was \"it's her.\" He was asked by the manager not to post anything on Yelp but I promised nothing. Let's hope the manager can move this place in to a more professional establishment."], ["Gia D.", "Rock middle more like.... We went here a few weeks ago... Food was overpriced and meh. The server was sooo schmooze-y that it was unbearable...nice enough I guess, but who you kidding kid? We know you hate this job. Anyone who doesn't hate serving is on drugs, but I digress. I went here a few years ago when I was just vacationing here and felt that it was just as than non-noteworthy then. I won't be going back now. Just too much money to spend on mediocre food."], ["Lanna S.", "Okay food nothing special. Brushetta chicken dry and not much flavor.  Beer was good!"], ["Hope M.", "This is a really nice place! They have a nice variety of food and cocktails. My man always wants the bacon Mac n cheese and I enjoy the Cajun pasta. So many good things about Rock Bottom. Try them out!"], ["Jeremy C.", "The beer sampler was great. All of them were great craft beers. Wait staff had some good recommendations. I had the fish and chips, and they were very good. Would recommend if your looking for a restaurant downtown."], ["Olivia H.", "By far my favorite restaurant to eat at in all of Charlotte! I refuse to try anything other than their fish tacos! Everyone that I have visited the restaurant with raves about their burgers but the fish tacos are by far the best I have ever had! The beer that is brewed within the restaurant/brewery is also delicious and I make sure to get the beer sampler every time I go so that I do not have to pick just one. The atmosphere is also a huge highlight. Part of the restaurant is a laid back, sports bar type of restaurant while the other half has a swanky feel to it. You can definitely go in jeans and a t-shirt or dressed up for a night on the town and be comfortable. The bathrooms are always cleaned and are regularly checked and the service has never been poor. Sometimes, I consider driving the 2 hours just to go! Make sure to check out this place next time you are in Charlotte!"], ["Kember R.", "If they had half stars I would give it! The service at this place was awful! It wasn't busy at all and our waitress barely came by to check and fill drinks. After waiting forever for food it came out cold no I'm sorry freezing cold! Went to get ketchup bottle it was empty so went to grab the next bottle and it was empty too. Had to try and find a manager all the staff just looked at me stupid like they didn't have one. Finally Got a  manager over and she took the plate to the back and warmed it up and brought same plate back. No apologies! It's insane to be a place in downtown Charlotte and charge way too much for cold food!!!! This place is awful! So here we sit cold food and no refills!  I couldn't even finish my meal I was so upset with how bad this place is."], ["Corey Tess T.", "Beer - Many choices and micro-brews (I dont drink beer, but if you do, there is lots here)Salads - MehBurgers - GoodWine - MehCoffee - MehSoup - So/soTex-Mexish dishes - were actually okStuffed bell peppers - actually quite goodThis isn't my kind of place, but we stop in for lunch now and then because it's downstairs from where we work. When you walk by outside, the smell of the brewing is so strong!I say A-OK, because it's not my style, but it is a good micro-brewery with burgers, fries etc. The stuff you expect. Lots of seating and service is A-Ok. They have a nice patio as well."], ["Kelly M.", "Came here for lunch on Memorial Day. They have an outside seating area that is covered which was a huge plus and it is located really close to 7th Street Market. I tried a flight of their beers and they were decent but nothing special. I would recommend the red ale or the double IPA. We had their nachos to start which were ok, it is a huge serving that comes with salsa to dip. I had the veggie tacos which were good, they had a crunchy shell covered with a soft tortilla which I actually enjoyed. It came with a side of rice and beans. I really liked the black beans but there was something about the rice that had a bad after taste. My husband ordered the veggie burger and fries. I tried the fries and I liked them but didn't try his burger. He said it was good but again nothing special."], ["Linda S.", "Love this place. You get to experience the city without spending a thousand dollars. Lol  it is very clean and great food. You can sit indoor or outdoor. They validate your parking so you don't have to pay."], ["Dana D.", "Went for a late night dinner. They catered to my  low sodium needs. My salad was amazing! My captions were all happy with their food!"], ["Rick S.", "This place was one of those that kept impressing me. I had the chicken stuffed peppers-awesome, Kathy had a personal pizza-awesome, Tori had bacon mac and cheese-again awesome. To drink a had the 6  sample flight of micro beers-good to see 3/4 full juice glasses and not just a shot glass amount like so places. Kathy had a margarita also very good. To finish we had toffee cheese cake in a mason jar-killer and coffee. The waitstaff was good, bathroom clean, good room temp and loved seeing the vats for making their own micro beer."], ["Matt M.", "Food is good, beer is amazing! Highly recommend stopping in if you're in the neighborhood."], ["Charles B.", "_The Music on Fridays is great!  Had the appetizer tostada, two small ones but the perfect size for me. The corn tortilla was tough in the middle otherwise great.  Service was a little slow. .. They were busy."], ["Candyce B.", "I met a couple of girlfriends here for dinner and drinks on Friday evening. Parking was easy because the restaurant is attracted to a parking garage and...yes! They do validate parking. We started in the bar area, which was pretty crowded. We were hoping to grab a table but quickly found out they take reservations at those tables so we were moved to the main dining area once everyone arrived. The bartenders were awesome! With so many beers on tap, I had no clue which to try first! So she let me sample some of her favorites and I found that the Kolsch was a winner!! It was light and refreshing and a perfect compliment to our appetizers. We ordered the Brewery chicken nachos and Southwest egg rolls, both were delicious! The nachos come with an entire dish of freshly made salsa and the they load you up on the toppings: cheese, sour cream,black beans, chicken, onions, jalapeños and guacamole. The egg rolls are deep fried and stuffed with chicken, beans, red peppers, zucchini, tomatoes, corn and pepper jack cheese! Yum. For dinner I went with the Southwest Turkey burger. The turkey burger is mixed with peppers and onions which adds a really nice flavor to the meat! They then top it with lettuce tomato, avocado mayo, fried peppers, sliced avocado and pepper jack cheese. I really enjoyed it! The fries weren't my favorite...they were shoe string cut and a bit too crunchy but at least they came out hot! All in all, I'd definitely return and recommend a visit to anyone!"], ["Brian G.", "Amazing habanero shrimp appetizer, awesome Southwest egg rolls, and the fish tacos were amazing. Next time I am Charlotte I will stop here.Did I mention the beer was pretty darned good too"], ["Brian B.", "What can I say? This is by far my favorite place in Charlotte. Period. I have been going to RB for over 12 years and still love it every time. The Artichoke and Crab dip is the best thing on the menu and the IPA is just outrageous. The staff is very friendly and the front and back patio is just plain awesome. I love this place and will continue to frequent indefinitely. High Recommendation!"], ["Robin T.", "I have eaten here several times & always find it disappointing. Tried a variety of foods & none have been particularly good."], ["Benjamin M.", "Ok another one with as many check-ins I have for this place that should be my review. If this was Boston than Rock Bottom would be my Cheers. What can I say about this place. Lets start with drinks.The beer is made in house. I love the beer the current brew master has been doing a great job. I look forward to tapping part of the new brews he has made. The Bartends are freaking awesome and very cute(always a plus at a bar). They are super friendly and makes the best drinks in the world.  Food is awesome. I love the apps and whatever season menu item they come up with. This summer they had a luau with a pig roast. I was great. My favorite item off the menu is the steak cooked texas fire style. Trust me when you smell it you will want it. The salad are really great especially if you are on a diet. So to sum it up great drinks, great food, awesome and cute staff. Why are you not there now?"], ["Abbey W.", "Service was great but food wasn't anything special. A little pricey. We will try a new place next time."], ["Hook Em' V.", "Well let's start off with the front door. Very nice staff. Hello and greetings all around. Wait staff on the ball. Ok now that Jalapeño Burger I had. If you want hot this is it. Dang it was good. The wife took one bite and started to cry. NOW THAT IS A BURGER. Now the wife had the Markers Mark burger but they didn't cook it medium like she asked. She says she's had better. Well I am raving on the Jalapeño Burger. Will be going back. Oh yea get the beer flight. 5  6oz glasses of good beer types and the price of one 16oz beer. Well ok close to that price. Can not wait to go back. Will have a Zantac before I go."], ["Bruce K.", "Oh man oh man! Another review, and this time from the well known Rock Bottom in downtown Charlotte. I came here with a friend who wanted some of their beer as well as their food. And sadly, I wasn't impressed. Inside though they completely changed the outlay of the dining area from the last time I came here, which was about 2 years ago... They added ramps as well as new things to look at and admire, such as the glass between booths and some paintings. But, overall it's all the same with the looks and what not.I had two things from the menu: Fish Tacos (RB Taco) and the Southwestern Chili.Now, the good first. Southwestern Chili. It was awesome, I felt like it was very good and chunky. However, I wish the portion was just a wee bit bigger just because it was so tasty!Another plus was the service. My friend ordered a steak and it was a little overcooked, the waiter completely understood and took it back to get another steak cooked medium rare. It was fast and I believe even the manager came up to fix the problem. They offered a soup or whatever, but my friend declined (I was wondering why he didn't get me another chili!)Now the bad. Eating the Fish Tacos was like grabbing a handful of seasoned salt and then eating it. Every single bite was just a burst of not just salt, but just sodium with a little heat kicked in, but that was probably from the amount of salt and it made it seem spicier. After drinking water, it was still stuck in my mouth. Kick back the salt Rock Bottom and pull out that flavor of the fish! After all, it is a fish taco.Overall, not bad, food is average. Service is pretty good though. Next time though, I'm sticking away from those tacos."], ["Chris C.", "We came on a Thursday and ordered the beer sampler and Southwest egg rolls. - Happy hour extended! Great Waitress! It ended at 630 but she was kind enough to let it slide. - Egg rolls taste more like a flauta. - Sample 6 beers. 3rd one is too hoppy. 1st and last are the best. good deal for $7. - Lots of TVs. Big party friendly.- Just like SD and SJ."], ["Joseph B.", "Had a wonderful experience. My wife got the steak and it came out over done and not very good. We told the waitress and she took care of it with out a second thought. She got my wife a new steak, which was cooked perfect, and a free side. She also took the steak off our bill without us even mentioning anything about it. This was perfect customer service and we will defiantly go back! Also, I had the pepperoni pizza and it was wonderful!"], ["Whitney B.", "Would have given 5 stars for the food, but the air seemed to be broken and the service was extremely slow. Half the time our drinks were empty. Our appetizer didn't come out until our food did... So what was the point in an app??? If you can stand sweating the whole time and being thirsty then come eat here because the food is amazing."], ["Jake B.", "Went last night with in-laws for mother in laws bday.We always have loved the place and it is our go to place when we have something to celebrate and even when we don't.  Walked right in, we're seated, server was pleasant. Mentioned it was for mother in laws birthday and she was nice about it.Ordered drinks and an appetizer. ..This is where things went slightly pear shaped. Server came back and told us the appetizer was delayed. No big beal, things happen. Food comes and as always, was completely wonderful. Chicken fried chicken for three of us and my wife had the sizzling peppers. More pear shaped, waitress was no where to be found for 20 minutes. Wife was out of beer and spicy food minus drink.....she waited. Finally I got up and had to get another server to get a refill. She started with \"I am not your server....\" but said she would take care of it. To her credit she did. Manager comes over, very nice, apologized for the appetizer and days she will cover it. Server shows up and is rather standoffish. Not rude per se but moody. Not sure if it was my stunt with the beer or the manager but either way not our fault. More waiting for desert, more drinks, something and then the server does show up with the bill no questions asked, not a thing.The rating is not for the appetizer,  like I said things happen. It was not for the lack of drinks, it was for the apathy. At least come by and check on us, tell us the app is coming, but the server seemed to say, \"the app screwed my tip so why try\". If the place was hopping I would get it, but it was early afternoon. Anyway long story short: great food, apathetic service, use to be a go to place even with the hour drive but we may be finding another one."], ["Kim M.", "We went for lunch on Sunday Afternoon.  We sat there for ten minutes and nobody acknowledged us or came to our table.  A waitress passed our table two times and chose not to make eye contact with us.  Servers congregated at the hostess stand.  We walked out and still nobody noticed.  This used to be my favorite place uptown.  Really disappointed."], ["John C.", "Visited Rock Bottom at about 4:45 on a Saturday.  Was surprised at how busy they were but we were still able to be seated quickly in a large comfortable booth overlooking the street.I started with the Summer Honey Ale.  Meh.  I think I was expecting a bit more of a sweet/honey flavor.  I wish I had tried one of their other beers.  It comes in a large glass (I think bigger than a typical pint serving).I had the stuffed poblano peppers.  I was curious (dubious?) so I asked my server.  She said that the filling is awesome and that the bites with the peppers had a kick.  She was spot on.  I really enjoyed the cheesey, chicken-y, chorizo-y filing.  The rice around the peppers was good too and it definitely seemed like a hearty portion.  Eventually, with sweat running down the side of my face, I scraped the remaining filling out of the second pepper and just ate it.  I enjoyed my pepper bites but was ready to stop the heat.Our group shared some of the ice cream sandwiches.  Childish?  Yes.  Tasty?  Surely.  The plate comes with three ice cream sandwiches made with chocolate chip cookies, some strawberries, and a bowl of chocolate sauce.  My only wish was that the cookies were a bit softer.  In texture and look, they were over done with just lent additional difficulty to eating the messy treat.Our server was very good and took excellent care of us."], ["Ashley S.", "Their beers are really good, I just wish the food was that great too. I ordered the bacon chicken mac and cheese, which instantly got my mouth watering just thinking about it. I ate a little bit, but I didn't want to finish it. Way too much pepper or spices, and I could hardly taste the cheese. It would be better if they didn't label it as a mac and cheese, because it didn't taste like that at all to me. It came with a slice of french bread on the side, but it was plain. No butter on it or any on the side. Kinda weird.My sister raved about her hazelnut crusted chicken, but I wasn't too impressed by that either. I ended up just drinking my dinner, which is just fine by me! :)"]], "Zebra Restaurant": [["Marty H.", "5 STARS. This restaurant is as good as it gets. My entire dining experience there was incredible. Professional wait staff, fantastic wine list and a perfectly executed menu. Thank you to all of the good people @ Zebra. CHEERS."], ["Travis W.", "Gotta say, probably the most creative dishes that you will find in Charlotte and a presentation to match.  I was a bit hesitant at first to even try this place as I just imagined in my head nothing but ultra small gourmet plates.  I was way off base, I ordered a lamb tenderloin dish and was very pleased with portion size and the taste was phenomenal.  I was here with my love and it was indeed a romantic setting.  Service is top notch too and they will do whatever to make sure you are taken care of from the moment you walk in till you are ready to leave.  The only drawback I have was the decor.  Low ceilings, cheap tables and chairs and the location of the seating is too close to other diners.  That was a real bummer for me but overall I would certainly go back."], ["Karen W.", "Crap on your Groupon customers.  Tried to redeem before it expired and was turned away because \"we have 100 people coming in and only 4 servers\". Classy.   Mayberry lives!"], ["Josh J.", "The wife and I love Zebra -- sure, it isn't the sort of place you'd go every month given the cost, but we've been very pleased with the experience the three times we've gone. Part of it is that we have an emotional connection -- when we returned from the vacation where we got engaged, Zebra was where we chose to go to celebrate. I've only had one dish there - the Lamb Diablo - a dish so good I find myself awaking in the night, licking my lips thinking about it. Zebra will continue to be a favorite -- a once-in-a-while restaurant for when we're feeling in the mood for a special night out."], ["Dan K.", "Went here during \"restaurant week\" where their normal prix fix menu ($44) was $30.  They don't really seem to advertise this, you have to kind of know that this is what you want.  At first they didn't even give us a fixed price menu, and then when they did, they didn't mention the $30 promotion.  But, we were able to get it.Overall the food was pretty great.   The service was also excellent.  To start, the fresh bread was basically neverending, although most of us stopped filling up on it.  Good bread though.  Then we were brought some red pepper bisque served in a small cup as a pre app.From the menu, I ordered the foie gras black truffle soup, the lamb \"diablo\", and the vanilla bean creme brulee.The soup was pretty outstanding.  I didn't taste the duck liver too much but it was my first time having truffle, but I'm sure it was a very small amount.  The soup was velvety and very tasty.The lamb melted in my mouth like butter.  I ordered medium rare and it came out perfectly.The creme brulee was glazed on top just the right amount and it was a healthy portion.  All in all, this place is probably a tad over my usual budget, but I could definitely go here for special occassions and enjoy a good meal."], ["Dorian B.", "Very good - Dined in November"], ["Romin B.", "You're definitely going to have to fork over some money for this place, but luckily I had a groupon that took the sting off a bit.  And of course it helps that the food was for the most part very good and quite interesting.  My waiter was attentive and very thorough when asked for suggestions.  He almost gave his opinion on every single dish on the menu (maybe a tad much).  I tried the mussels on his suggestion, as well as the scallops because not only do I really like scallops, but they came with a few shavings of truffles, something I've always wanted to try.  The mussels were excellent and generous in size, although my one gripe was that they were $2 more on the bill than they had been listed on the menu.  They were swimming in some yummy sauce and my waiter thankfully kept offering me extra bread to soak it all up.  This was one of the only places that I didn't have to keep asking for bread; the servers would bring me more once they saw I had finished my previous piece.  The scallops were also good; not out of this world, but still tasty and well-cooked.  I wasn't quite overwhelmed by my first black truffle experience.  The flavor was somewhat mild and there were only 2 shavings.  I would've preferred a couple more, along with maybe another scallop (it only came with 2).I took the waiters suggestion again for my entree and went with the lamb diablo, and I'm very happy I did.  May have been the best lamb I've ever had.  It had a delicious mustard crust and was perfectly tender.  The accompaniments weren't particularly special, but there was plenty of delicious lamb on the plate that I didn't mind.  As for dessert, I couldn't make up my mind, so I decided on the sampler.  It came with a chocolate pecan tart, creme brulee, lemon curd, and almond torte.  I didn't particularly enjoy the torte, but everything else was pretty good, my favorite definitely being the chocolate.  All in all, I had a good experience and a very satisfying meal.  If I win the lottery, I may become a regular, but until then, we'll save this one for super special occasions."], ["chris s.", "Zebra is a decent place if your up for the spend. 2 - people will set you back around $120 if you have wine.The food:I had the Lamb and it was great... My wife had a risotto dish which she said was equally delicious. Desert was pretty amazing (chocolate covered chocolate).The Service:Our waiter was fantastic. Seriously.The reason I didn't give this place a 5 star rating is because our treatment by the Hostess. I guess we didn't look wealthy enough for her to consider being nice to that night because she was being very condescending with us. Zebra, if you are reading... Fire that woman and get someone who makes guests feel welcome.Fortunately though once seated we were treated like royalty and the food was excellent so it was easy enough to forget. Just be prepared to be judged before being seated."], ["Lance K.", "Heck ya amazing!!!! really really good food and wait staff ubber nice.... great find passing though.... Had a 4 course fix prix, which was literally 4 full course for a small price...."], ["Melissa C.", "This is the go-to place to celebrate special events for my husband and I. We have dined here numerous times and each time exceeds our expectations a bit more! Chef Alexander is very accomidating, I have a gluten allergy and he is willing to make changes to accomidate my allergy for any dish. I love that I can eat here and have no worries about will I be sick tomorrow?!  The menu changes seasonally and there are always daily specials, which I highly reccommend. Several times we have dined at Zebra and the fish special is something that the Chef has caught himself on the coast. We have tried numerous appetizers but I always gravitate toward the mussels with kaffir lime, my husband loves the charcuterie plate. As far as entrees, we have had sea badd, shark, waygu beef, lamb, and scallops, all dishes have been cooked and seasoned to perfection. We never miss a chance to split a creme brulee, and Zebra's is fabulous. The souffle is excellent according to my husband, and don't miss the salted caramel ice cream if it is featured.The wine list is extensive, the staff is very knowledgeable about pairings. Although I am yet to attend one, Zebra offers a wine tasting on Fridays and seems to be very popular as we have arrived near the end of the tastings.The service is top notch and not over bearing. Zebra is truley a gem within the Queen City and should not be missed!"], ["Claire S.", "Took mom there for dinner yesterday. Great experience. Very good food. And the waiter is super nice. I got the groupon but still ended up paying over 60 but its definitely worth it. Accidentally ordered the bottled Italian spring water. Thought its free. lol~~~ Why would it be? Love the bottle so asked waiter if I can take it home. Answer is YES. May use it as vase in the future.We skipped the appetizer but got the mushroom soup. Totally loved it. Like the texture. Creamy but not too much. Light and tasty.Entree for mom is Main lobster. Very fresh. Food amount is decent.  I had the lamp. Made this decision because quite a few yelper said great thing about this dish. Totally enjoyed it. Very tender.  Melt in my mouth. We took waiter's suggestion and ordered the chocolate souffle. Maybe Im not a souffle person. Not a big fan of it. But the table next to us cleaned the whole thing up. So my opinion may not be that helpful.Overall, great dinning experience. Will go back if they offer another groupon deal some day."], ["Mindy V.", "Excellent upscale inventive menu!!!   The scallops were great and their fish is just mouthwatering.  Definitely expensive but when your craving really flavorful refined, well made food in a formal atmosphere this will make your happy.  THe service is impeccable but very stiff- not exactly friendly but technically excellent.  I brought my kids at an early seating - it was ok but I did feel a little uncomfortable having kids at such a formal restaurant."], ["Leon V.", "I've been back twice for their three course meal. I just love the steak! The steak from the angel hair basket isn't as tender or flavorful as this. It's perfectly seasoned with mustard and some other ingredients. It's served with goat cheese mashed potatoes which are also heavenly. Everything goes so well with the sauce. It is truely an amazing dish.I'm still not so sure about their appitizers and desserts though. I enjoy the taste of fried foie gras but their appitizer is served as is. The souflee is amazing and chocolate tartes are very delicious but over powered my steak. Maybe next time I'll order just the steak, two of them.I went on a Monday and they had only a handful of tables avaliable. The server told me every Monday and Thursday (I believe) most of the restaurant is booked by companies. I suggest to come on other days.The meal was only $25! That's a great deal."], ["D. A.", "I cannot believe all of the rave reviews on this site, or Zebra's place on the shortlist of restaurants to visit in Charlotte. My experience there was incredibly disappointing. First off, when you walk in, you have the dark, tacky decor that's very dated and over-done. Huge wine list, of course, Napa big red focus, with many decent bottles around $40-$50, although the choices seem a bit standard to me; mostly big, predictable names. Their selections for by the glass were overpriced and disappointing ($8 glasses of Salmon Creek and Korbel?! Really?!). Then there's the food...I got two very small tenderloin sliders and pommes frites for $17 at lunch. The fries were decent, but came with standard ketchup (tasted like bottle ketchup, but came on its own plate with a spoon); at these prices, and for a French joint, I'd expect bearnaise or a good house-made mayo or aioli. The sliders were not good. Small, squishy bland white roll, a few strands of micro arugula (too few to provide any flavor or texture), and a hefty amount of a bland mayonnaise-y sauce. All squish; no crunch, texture, or discerning flavor, other than some pepper on the meat. That, with an $8 bottle of Pellegrino, and my check for lunch for one, with tip, was over $30. I'd say stay away, but I did only try lunch, not an entree, and only once, which is why I give two stars instead of one. Seeing the prices for dinner though, I think I'll stay away. The bottom of the menu advertised that they \"support\" local, sustainable, and organic sourcing, but no mention was made in the dish descriptions of which ingredients or how many, and no farm names, dairies, or advertised local sources. Service, however, was very good."], ["Jen C.", "Order the grand tasting menu just for this chef's highly pleasing version of Thomas Keller's salmon cornet with crème fraîche. You can't go wrong with the hearty truffled mushroom foie gras soup. Pick the tournedos of beef tenderloin over the salmon, which normally would be my favorite. The pistachio dacquoise torte is an ideal end."], ["Kit M.", "Zebra Restaurant & Wine BarWell, I've been here 3 times. Here's a brief summary of each visit.Visit #1 I had been given a Gift Certificate to use (thank goodness because I would have been ultra bummed to spend my own money this time!) and went with a girlfriend for brunch. First impression: It was cold. It was the dead of winter, ice outside and they sat us, in an empty restaurant, by the glass door. Bad form.Our waiter was a super chatty guy who kept nudging his way into our conversation. At one point I had asked my friend where Purdue is and before she could answer he, who had been sweeping around a table next to ours, chimed in. Strike two.Our breakfast came out and it was ok, not impressive though. The potato cake I got was most likely made the day before and reheated, the bacon was cold and they were out of all but one kind of bread for toast. The eggs were cooked nicely but the grits were too heavy.  Not terrible but also, not great.Take two (a few days later, actually):I went with my husband for our wedding anniversary lunch. It was nice, quiet but there were customers around and this time we sat in the main dining room where it was nice and warm. I ordered the Parmesan Crusted Chicken with angel hair pasta and red pepper coulis. Oh. My. Gosh. I practically licked the plate. Seriously, it was that good. The chicken was perfectly cooked, moist, crunchy on the outside.. the pasta had a nice bite and was tossed in a lovely cream sauce and the pepper coulis was fresh and bright. I LOVED it. I tried my husband's dish, which I can't even remember now.. and it was good, but nothing like mine.For dessert I had creme brulee which was also lovely. By the time we finished eating I had forgotten it was our Anniversary and that I had disliked the breakfast I had there previously.Third: I went with a friend for dinner and it was just perfect. The room temperature was adequate, the wine was smooth, the filet was at the perfect temperature. It was a great meal. I think, perhaps, Zebra is a little pricey for it's quality but it's in a rich area so it's to be expected. Don't go unless you can afford to spend some real money. Make a reservation for dinner, for lunch it wouldn't be necessary unless it's the weekend. I don't recommend bringing kids there, but it would be good for groups. In fact, when we were there the first time there was a baby shower in the main room. I DO recommend this place. It's worth the trip, at least I'm 85% sure it is."], ["Lea P.", "We had a wonderful dinner at Zebra a few months ago. I agree with another yelper post that the location could be better, but they've done a great job making the space feel intimate and elegant. And the food is - is - well, it's just delicious! - and beautiful to look at as well. We don't do a lot of fine-dining in town, so I guess I can't compare it to loads of places in Charlotte. But it was one of the best dining experiences we've had anywhere, so kudos Zebra! this will be our go-to place for special occasions, methinks..."], ["Mel B.", "Do not expect any hospitality from Jim Alexander if you are booking a private party here.  I booked the Serengeti room a little over a month in advance and was told by Jim himself that I would have great service and the best food.  It is important to me when I am booking a private party that I have a completely enclosed space so people can hear the speaker and see the presentation.  I paid my $150 deposit, worked out the menu and was ready for my evening.  The day of the event I stopped by the restaurant early to set up the projector and was told I had been moved into a different room that was not enclosed.  I wanted to know why I hadn't been contacted in advance and what had happened since that was not what I agreed to.  The manager, Michael Stauss wasn't sure what happened and went to get the owner, Jim.  Jim finally came out and said I was now in this room and that they would do what they could to make it right for me.  When I told him I still wanted the room I had booked, he stated with anger that I was NOT getting that room.  No explanation.  I told him I was confused on why nobody had contacted and wanted to know what the reason was for getting moved.   He then threw up his hands, said he couldn't deal with me and stormed from the room.  Since my guests were due to arrive in just a few hours, I had no choice but to deal with the current situation although he had completely rattled my nerves and upset me.  I was not pleased by the room situation during the event, it was still loud from the people singing happy birthday in the other room and although I was told people would be routed through the kitchen to get to the the main dining hall, they came through our room instead.  One man walked all the way through the room confused on where to go.  Other than the room situation, Michael did everything he could to make the situation better including sending me home with a bottle of wine and taking some of the extra fees off of my bill.  The staff was nice and professional and the food was very good.  One of my guests said it was the best salmon he ever had.  Still, after the event, I was emotionally drained that I had been treated so rudely by Jim.  Although the food was great, because of my experience with Jim, I would never have another event here.  At the very least, it is the responsibility of the restaurant to uphold their agreement with you."], ["Elle G.", "I pretty surprised at some of the mediocre reviews.  I had a very pleasant dining experience at Zebra.  Yes, it is pretty pricey, but it is a nice place to go to for a special occasion or a romantic date night.  The food was one of the best I've had in Charlotte so far and the service was top notch.  Perhaps the restaurant, like most, has its good and bad moments. Luckily, I dined during a good one."], ["Kristi S.", "We went to Zebra tonight for dinner; had the lobster bisque, raspberry salad, lobster, angel hair basket, and chocolate souffle. We also had wine. Overall, we were very impressed with the food quality, portion size and service. This restaurant is pricey, our total with tax and tip was near 200.  But the food was delicious; I would definitely return for a special occasion meal."]], "Amelie's French Bakery and Café": [], "Georges Brasserie": [["Katy W.", "Wow! What a wonderful experience. First time visiting and I have to say everything we ordered was delicious.  The best oysters I've ever had were on my honeymoon in British Columbia and they had West Coast oysters here that were very similar and brought back great memories for me and my husband! Food and service would have warranted a 5 star review alone, but to top it all off, we received our bill and it was $0! One of the owners decided to comp our meal because we were celebrating my birthday and my husband was celebrating veteran's day. That is above and beyond great customer service! Thank you for an amazing evening :)"], ["Bianka M.", "DateNight done right on a nice weather night. We've tried Georges several times and it's the best visit when we are on a Date and trying to focus on just us (no children with us or any friends with us).The mussels are amazing the fiery mussels are our FAV. We tend to enjoy the chef special ( one or two of them ) as they are typically items that are local and not common on the menu and they tend to pack plenty of seasonal flavor plus my hubby and I like to try each other food to expand our taste of what a restaurant has to offer.We usually have a seamlessly smooth visit to this place with the exception of one occasion which happened during restaurant week. As you know the menu is pre-fix 3 courses which is standard. The menu stated \" no substitutions\" and we understood that however I don't take it as a substitution if I ask to have my salad WITHOUT the pork. Call me crazy but simply removing an item isn't substitution I didn't ask that it be replaced with something else I ask to not have it added as we don't eat pork. We were given the run around and told we couldn't do that. I had to go all the way to the point of speaking with a manager. The pork was then removed and we completed our dinner DateNight. This incident is why I had to remove a star as it should never be that hard to not ingest something you don't eat ."], ["Fabiana F.", "I have only been to Georges Brasserie for happy hour so I can't comment on their full menu or service but as far as happy hour goes, It's always a happy hour indeed. We have tried the mussels with chorizo, the steak with pommes frites, their oysters and the crispy Brussels leaves with a fantastic balsamic drizzle. Everything has tasted so great each time we order it and for the fact that each dish is either $1, $5, or $7, it is a lot of food. The mussels are some of my favorite, it is a huge bowl of mussels with a great broth, tons of chorizo, and their bread is fantastic. The steak is enough for two to share, cooked well and with delicious pommes frites. If you only get one thing off my list, the crispy brussels leaves is where it is at. They are cooked perfectly and the balsamic drizzle is 'lick the plate' delicious. We actually got a second order because we each wanted our own, that's how good they were. The oyster deal is pretty great too considering their usual cost and they also have a few drink specials, though we usually just get wine. All in all, I really like GB for Happy Hour and have actually wanted to come for a full dinner (review to follow).  The service is always great near the bar, the food comes out quickly, and we leave happy. If you're looking for a good happy hour, add GB to your list!"], ["Dan C.", "Update time- Giorgio, ur killin me.  I'm trying to check out all of the Charlotte restaurants, but I'm drawn back to you, time and time again...Of my frequent visits here, one night was particularly memorable.  I recall it was a Thursday night because they have martini specials for hh.  Fact: As verified by the FDA, it's a good time-all the time-when you're having mussels and martinis.  Hell, it's even fun to say 'mussels and martinis.'Met up with a foxy lady, it wasn't a date, but I got to first base, and second... and third...  and home.  That's if drinking is baseball.  Oof, four martinis.  The four varieties served up were all perfectly chilled and tasted great.  Even the berry martini - manly, I know.  We ordered a little bit of everything - Heavenly fiery mussels.  Transcendent oysters from the sea.  Flavorful, yet light scallops.  Rich lobster atop velvet-y gnocchi.  Flawless filet.  Recall us laughing amidst chats, but frankly, all I could think was, \"Why did we sit so far from the kitchen?!\"  Sitting closer would have meant quicker service - practicing restraint was tough already, but the struggle is real when you eye the server walking over with those amazing entrees.  Next time I take this chick here, we're gonna indulge in this lemon poundcake something-or-other-goodness.  There's not enough characters here to describe it, but the varying decadent textures awakens the sweet side of your palate.  A picture will have to tide y'all over for now (in the background!).dmo out."], ["Michelle D.", "This is a MUST DO for brunch.  I love this place and it's staff.  I discovered this place promptly after I moved above them. I have had the oysters (yum), Mussels (OMG), Frites....BRUNCH, and on and on and on.  All delicious.   Jeff is THE best manager and I think..no I am sure he has a lot to do with the success of this establishment."], ["Michael N.", "My first experience at Georges Brasserie came down to this simple mathematic equation.$25 Brunch Bar + all you can eat Oysters on the half shell +$12 bottomless Mimosas = extreme happiness and gluttony!Picture yourself, Sunday morning, seated across from you friends. Shades on, fresh coffee and hot Beignets served on a fresh, white snap tablecloth. The patio oozes European flair. Slicked back hair waiters twirl platters of Oysters and Mignonette, followed by Grilled Shrimp daydreaming on Gruyere Polenta. Carafes of high grade Mimosas magically refill themselves. Now Chilled Shrimp dance the Cancan around eggs and prime rib as they push perfectly Carmalized Crème Brulees closer and closer to tempt you. Georges Brasserie truly is brunch Fantasia! Tout est merveilleux!!!"], ["Paul C.", "Short review - After coming to George's many times since I've been in Charlotte, I FINALLY had their burger! Oh MY! OK so it's not cheap at $16....BUT it is worth EVERY PENNY!Why? First they grind their own meat. Guessing chuck, brisket and sirloin? Just a guess....but it was super juicy and flavorful. You can get it however doneness you wish....But to me, it was their BUN which made this incredible! Had to be Brioche, and it was UBER soft and buttery. You've read my reviews which have panned places for having crappy buns or them being made out of depleted uranium! Not here folks!Now the burger normally comes with blue cheese. Well, that's not my fave, so they gladly substituted Gruyere and I was a very happy camper!Of course, NO visit to George's is ever complete without getting their crispy Brussels Sprout leaves with Balsamic Glaze....I claim that it is quite possibly THE BEST APPETIZER in Charlotte! No kidding. Brussels Sprouts??? YUPPER!Always great atmosphere, service and of course the food is why I keep coming back to George's!"], ["Jennifer L.", "Enjoyed the great weather today by dining outside for lunch. All of the elements in the Scottish Salmon complemented each other very well."], ["Marco F.", "I came here for restaurant week on Tuesday night. It was my first time ever coming to George's and boy was this place impressive. Start to finish, this place was 6 Stars! The decor was elegant - the service was top notch - and there food was remarkable. I started the night with their \"spicy mule\" cocktail & it was fantastic. I later switched to wine: they have a good selection. I had the pork belly appetizer, and there's no need to get into detail on that lol....it's PORK BELLY! I then had the braised short rib and OMG it was phenomenal. The beef was unbelievably tender and if I had a spoon at the table, I probably wood have just spoon fed myself. ughhh...It hurts to even think about how amazing it was. Wrapped the night up with their crème brulee and a double espresso.Of all the places I've been to in Charlotte, George's is definitely up there! I would recommend them to anyone and everyone looking for a good dining experience. I cant wait to come back again and try some other things that caught my eye on the menu...yea I see you, fiery mussels!"], ["Marshal C.", "Woah!  Hold the line.  This place makes you feel so awesome!!  The ambience is very Hollywood-ish with dark corners and occasional live bands, mood lighting near the bar, and a waitstaff that are the best, bar none.  I had a New Year's Eve reservation for myself and 4 friends.  The waitstaff were super professional and friendly.  The manager stopped what she was doing to come take a photo of our table so that we could all be in a photo together.  The seafood is by far the best I have had in Charlotte (and I'm from the East Coast, so I know great seafood when I see it).  The NYE menu was a fixed 4 course meal, and it was out of this world.  The scallops were seasoned to perfection and not over cooked.  My salad had goat's cheese and arugula that was well-washed and flavorful.  I had a peanut butter and chocolate tower for dessert that was finger licking good!  When we were leaving, the waitress who served us ran out of the restaurant to ask if we would like a group photo in their red carpet that lead up to the entrance.  That was so unexpected and awesome.   We will now have those memories for a long time.  I would recommend this place a million times over!!  But, make a reservation ahead of time!!!!  Be sure to try their raw bar!!  Happy Eating!!"], ["Michael N.", "I found George's for Restaurant week and had no previous knowledge of it.  I wanted to come in to the experience completely blind.   I was surprised at how good the food was, and how well portioned the plates were.    It was a Thursday, so I kicked off the night with a $5 girly martini (a guy sometimes just wants to have a pretty drink) .   Here is where we found out about the $1 Oyster bar during happy hour, which I will definitely be coming back to experience. Dinner consisted of 3 Courses, which accompaniment of great bread and butter. 1st course was the pork belly. I came into it excepting a small sliver of meat. This was not the case, I received large square hunk of awesomely tender and juicy belly, with tangy drizzled sauce.  A+The main course, I ventured out the normal and got the crusty salmon with really tasty Black Rice. It was great for the variety, but I would say if you want the standard preferred experience of a main meal, try the short ribs.Desert was a crème brulee, and one of the best that I have had in recent memory. My counterparts got the chocolate mousse and there was a ton of it, all of it fluffy and smooth.The only thing that was a slight knock was the time it took to get the food, but I wouldn't ding them a star for it, because of restaurant week and dealing with the influx of people.   Also, allowed us to have some friendly table banter.Go here for a good French food experience.  Maybe valet your car to, if you don't want to deal with the maze of parking decks and doors."], ["Emma K.", "Our recent meal at George's during restaurant week was absolutely amazing.  I had never been before, but now can't wait to go back during my next visit to Charlotte.We were able to snag an early dinner reservation despite being restaurant week, and were seated right away after taking advantage of the free valet parking.  My parents and grandmother took advantage of the $1 oysters as a pre-appetizer.  We all opted for the mixed green salad to being with which came with lardon (aka amazing bacon).  I couldn't resist the Chevre & Mushroom ravioli, and it was absolutely amazing.  As in top 5 or 10 dishes I've ever eaten amazing.  As in horrified when my mother asked the waitress to take away her unfinished plate of ravioli without offering me the rest.Anyway, we all got the Pecan Bread Pudding for dessert that despite not being super warm, was delicious as well.  They had a special bottle of wine for ~$32 that my dad and I shared and was very good.Service was excellent despite the restaurant being pretty busy by the time we were done with our meal.  George's will definitely top my list of go-to places the next time I'm in town!"], ["M T.", "SUNDAY BRUNCH REVIEW ONLY.I enjoyed the food. I like the concept of the brunch entrees that you order at the table and it comes out in small portions so you get the chance to try out the actual buffet. My boyfriend and I love the shrimp and grits. The grits is so creamy and the shrimps are actually really big. The sauce on top comes off a little too sweet for our liking but that doesn't stop us from ordering 4 more plates. $12 bottomless mimosas, can't beat that. No complaints there. Services wise.. Not so great. We were seated by the host and then ignored for the next 10 minutes. None of the servers came by but they all seem to notice we were sitting there. And keep in mind, it wasn't all that busy. Two servers finally came by and  asked for our drinks. Server brought out my boyfriend's drink order and then completely forgets about mine. The rest of our party arrives and none of the servers came by the take our orders. When we finally ordered, the server forgot the last half of our orders after he brought out our first half. And the two servers that were introduced to us, rarely checked up on us.Ever had that \"damnit\" moment where you leave a hefty tip for the server and walked out thinking why the hell you tipped that much because they didn't really deserve it. No? Just me? Okay.."], ["David S.", "Georges is one of those places your going to take you significant other or an important business client to dinner.I had the Cassoulet. Pork and duck confit pieces.This is fine dining at its best and probably a great place to impress your date."], ["A J.", "A small group of friends and I headed out for brunch this past Sunday and George's was a place everyone wanted to try. Upon arrival things started going bad. We had to wait for the hostess to seat us (the manager came by and asked if we had been helped, we said no and he went to fetch the hostess versus helping us). We were seated and left. No menus, no explanation of the menus, Buffett or most important cocktails. We just waited and waited until I instructed everyone to get up and head for the Buffett. One person in our party was stopped and asked where we were going. Duh, to serve ourselves since no one offered to help us. We returned from the Buffett and still no water or menus were left for us. We finally got water from the hostess but still no waiter. By the time the aloof waiter came over we were eating and very thirsty. He took our drink orders but still did not offer any information about the Buffett, what was included or the cocktails. Overall the food was good (French toast and bacon were amazing, the duck, egg and cheese thing was bad) but the lack of service was stomach turning. We will not be back."], ["Johnny V.", "Loved brunch here last Saturday. Indulged in some oysters and a fish ceviche as appetizer. Delivered on a 3 tiered platter with all the accouterment - oysters were so fresh and yummy.  I love raw bar food so the ceviche was right up my alley- citrus notes, plump but delicate fish chunks..washed it down with a blood mary on steroids (monster sized shrimp, celery, a bunch of other stuff) rimmed with spicy salt served in what looked like a carafe ::drool:: As a nice touch the bartender brought over shots on the house when he heard it was my sisters bachelorette brunch. Had eggs florentine and beignets as the finisher. Best way to start the Saturday- buzzing with a big belly. Mightve had the big belly before i came but nonetheless food was bomb."], ["Johnny H.", "My wife and I love French food, but it took us a while to try this place. It's now our favorite French restaurant in Charlotte. We started off with some $1 oysters (happy hour special) and some Onion soup. The soup actually used the lion crocks that you see in Paris, and it had just the right amount of wine in the broth. It was among the best we've ever tried. My main course was a bison bourginon. I've never had braised bison, but this dish will make me want to make it at home. The meat was tender and flavorful. The pearl onions were caramelized, yet retained a soft and satisfying crunch. My only concern was that it was undersalted, but this was an easy fix with a twist of the salt grinder. My wife had the chicken, which is a half-bird cooked all-at-once (rather than partially cooked and reheated). It was juicy, well-seasoned, and served with mashed potatoes and a truffle sauce.  We skipped out on dessert because we had our fill. The ambiance was perfect, with cafe-style tables outside, a mid-20th century Parisian decor inside, and Yves Montand playing softly over the speakers. Our server was friendly, genuine, and transparent when it came to describing the dishes. She made us feel welcome, comfortable, and appreciated. The rest of the staff were warm and inviting as well.Overall, we loved Georges Brasserie and plan to come here several times a year from now on."], ["Sharke M.", "Excellent food and ambience, the lamb stew soup, the lentil burger is well seasoned and by far the best veggie burger I had, the mixed beat salad with touch of goad cheese was perfect portion and taste. Love this place. Chef, you should be proud of yourself !Lindsay, provided amazing service, thank you"], ["Bob B.", "I LOVE French-inspired Brasserie's - but this really was a let down, particularly in terms of service - and followed by lackluster interior design.Stopped for a Happy Hour and was looking forward to some appetizers, but the indifferent bartender made me question why I'd want to stay, and the tepid greeting form the hostesses set the stage.  My buddy and I had 3 drinks each, but ordered no food.The interior just fell flat design-wise.  Cheap, minimalist and uninspired.  Maybe I'm comparing the execution to Stephen Starr's Parc on Philadelphia's Rittenhouse Square, and that might not be fair - because that is sort of the Gold Standard for the concept.  But, c'mon guys, warm this place up a little.  Give it some gravitas.  I want the owner's to look at Petite Chou in Indianapolis as a example of a great crowd-pleasing menu for breakfast/lunch/dinner/deserts with a rather minimalist interior/exterior (hint: not expensive - but damn, it works here and it could inspire Charlotte). I would not go back, not did I think it was worth visiting - except for a nice location."], ["Brennon H.", "I came here for brunch because we had a gift card. Brunch is a buffet along with tapas you can also order. We had salad, salmon, prime rib, shellfish, bacon, eggs, hash browns - you name it! Also had some delicious desserts! Service was great and the atmosphere was nice too."], ["Melanie E.", "The staff was super friendly and welcoming which is always a plus.The bar area is expansive and well-decorated.  The dining room looked nice as well, but we sat at the bar.We enjoyed our meals, but it wasn't mind-blowing.  Everything needed a bit more seasoning."], ["Jason L.", "We were looking for a restaurant close to our hotel to unwind and have a nice dinner after the Panthers game.   Luckily we found Georges.  It was walking distance from the hotel. The hostess was friendly and sat us on their outdoor patio. The patio has a smooth level of ambiance.  Our table had a nice view of the fountain in the middle of the plaza.  I immediately started to enjoy myself.  Our waitress was prompt and helpful answering all of our questions and making recommendations.The drinks arrived quickly which is always a good start to my ideal dining experience.   Although they had an excellent and varied selection including what looked to be an outstanding raw bar, I decided to order the NY Strip Au Poivre with brandy-peppercorn sauce and french fries.Although my steak came out closer to Medium than the medium- rare I ordered it was a good cut, flavorful and juicy. The sauce complimented the steak well.  The shoestring french fries came out hot and crispy which almost never happens .I can't say enough good things about the service.  All staff encountered was very professional and the service was seamless.I'm looking forward to coming back and trying something from the raw bar next time."], ["Christine G.", "I don't consider Charlotte to be an epicenter of culinary delights but this place is decent enough if you're looking for a brunch spot with quaint ambiance and delightful scenery.  Located in the Piedmont section inside a hybrid shopping area/apartment complex, this place offers outdoor seating and pleasant people-watching.  Our waiter, Adam, was quite attentive, possessed a witty, dry humor that I thoroughly enjoyed, and even offered us a table although we had shown up 15 minutes prior to opening time.  Note: the place opens at 11a on Sundays but liquor is served starting at 12p due to local law.  We ordered a round of oysters to start but they were not served with the usual condiments I expect: horseradish, lemon, hot sauce.  We couldn't find the waiter in time so I just gobbled them down.My main dish was a special of the day: sausage and steak in a skillet with poached eggs over polenta.  Edible but the steak and sausage were overcooked and I found the overall taste factor to be a 5/10.  Akin to what you can order at a NYC diner.  My brother's girlfriend ordered a quiche with a bacon crust and THAT was scrumpdiddlyumptious.  Without the bacon crust, not sure the dish would have been as delicious.  Bacon does make everything taste better, doesn't it?To round off my meal, I ordered the \"George's Bloody Mary.\"  Supposedly THE bloody mary of all bloody marys.  I never order this drink, ever.  I probably should not have let this be my first go at it.  It was served in a HUGE glass but something served in such a quantity should match its size in flavor.  I found it to be a bit watered down.  I did enjoy the two shrimp and pickled green beans served with it and, surprise (!), the horseradish I had been longing for with my oysters.Overall, upscale diner-quality breakfast, with slightly higher upscale prices."], ["Joseph P.", "Just finished a big family brunch here and the food was delicious and the service was perfect. Started with the beignets and they were honestly the best I've had. I had the French toast, light fluffy and had perfect amount of caramel sauce. Didn't lay on me at all. Everyone in my party (9 others) loved their dishes, eggs Benedict, eggs Florentines, mushroom omelets, croque madams, etc.Everything came together, and fast considering there were ten of us. We all split desserts: pistachio creme brûlée and a fruit crepe. Super fresh and the creme brûlée was perfectly done and very unique. Will be coming back again very soon."], ["Gia D.", "Love it! Sunday brunch and Tuesday Bottomless mussels are my favorite days to visit this amazing restaurant. The service is always on point. Our last server Mark was super nice and on top of things. Incredible food + amazing service= happiness."], ["Haeyon L.", "I came here for dinner with my parents and my boyfriend, and it was definitely one of the most memorable meals I have had in Charlotte.  I loved the atmosphere - very classy.  All of the food we got was delicious.  And most importantly,  our server was extremely patient with my dad, who can't speak english well but wanted to order two entrees instead of just one.  Much appreciated! For meals, I got the Butcher Cut with Bleu Cheese Mornay.  It was amazing.  I think what made the meal was the bleu cheese honestly.  It won me over from the first bite, and I don't even like blue cheese!  It was a little salty, but because it was on the side (I can't remember if it came like that or if I asked for it this way), I could adjust to my own tastes.  Still, the meat was tender and juicy at medium rare, and it was pre-cut. PRE-CUT.  And I thought I had a two thumbs up meal until I tasted my boyfriends' dish - the NC Mountain Trout Amandine.  This was definitely what made the night memorable.  Even though I had just one bite, it was enough to make me want to go back for more.  It was so soft and didn't have a lot of the 'fishy' taste to it. It was like love on a plate.  If you have a chance to try this dish, DEFINITELY get it.  I'm not too big of a fish person, but this one totally had me hooked (Ha. Lame pun). My dad had the Pasta Forrestierre with a NY Strip cut on top of it (his special order that took 20 minutes to explain), and my mom had the Pan Seared Scallops.  I didn't try either but they both said they were delicious!  I'll take their word for it. Also, try the creme brulee for desert!  It's not too sweet but not lacking in that area either."], ["Lambros I.", "Amazingly delicious and super tasty.  I had just landed in CLT from NYC.  My friend and I went in to talk business and to our suprise it was happy hour b/w 3-7pm.  They have a HH menu with $3, $5, & $7 items and on Thurs $5 martinis!!!  Absolute heaven :)  Everything was fresh, hot, well plated, and just simply awesome.  The decor is beautiful, welcoming and very relaxing.  More of a date and/or celebration place than business meeting but sitting at the bar was peaceful.  We ordered: Steak Tartar - coursely chopped, lightly seasoned, garnished with spring greens, very nice, big fan.Country Pate - OMG amazing!  Homemade pork pate with nuts and other yummy ingredients. Garnished w/ pickled mustard seeds, cornichons and toasted baguettes.Cheese plate - cant remember exact ones but there was a combo of soft, mild, and hard. Good size portions, and excellent! Brussel leaves - they were crispy and the balsamic vin added flavor. But way way too salty.  I love salt but chef got too happy on sprinkling sea salt everywhere.Mussels in white sauce - holy moly, is this the best sauce ever or what?!  Bursting of full flavors and of course butter butter butter. Love it!  I asked for more bread just to keep dipping.  I would have ordered a 2nd dish if I was not so stuffed.  The portion is huge and well worth it, regular price or HH.Martinis - perfect, delicious, cool and refreshing.  Nice heavy pour on the alcohol, Bravo!Service was great.  Pretty attentive and definitely friendly. Total $45 with tip $60!  Best HH place Ive ever ever been to. Will definitely do dinner when I return.  Keep it up boys!"], ["Michael W.", "Took my girlfriend here for our anniversary, because of many glowing recommendations from friends. After being seated promptly, we waited about 10 minutes to be acknowledged by a server, and given water and menus. After this, the server was attentive enough. We started with the cheese tray, which was good and all, but was only 3 little slices of cheese. For $12 I expected a bit more quantity.She had the NY strip au poivre (her favorite), and I had the flatiron steak. Hers was undercooked, and the brandy/cream sauce tasted more like turkey gravy than anything else. She's had this dish in Paris, and I've made it several times at home, and George's sauce wasn't even close. My flatiron steak was pretty good, but a little undercooked. The frites were nice and crunchy, but way too much salt. For the price, there are MUCH better restaurants in Charlotte. We won't be back to this one."], ["Mary C.", "I am a HUGE fan of George's.  The fiery mussels and house bread are amazing.  Sometimes, I get that alone as my meal.  I'm also a big fan of the lobster gnocchi appetizer, the supple pan-seared scallops, served with sweet corn and saffron puree, fava beans, smoked tomato, and thyme beurre blanc and the NY Strip Au Poivre with brandy peppercorn sauce, served with a petite ceramic pot of truffle pommes frites. I've also heard great things about the goat cheese and caramelized onion tart, but I've yet to try it."], ["S E.", "Took my wife to brunch Sunday at Georges, where we also enjoyed our last Anniversary dinner at.  They just added a buffet brunch to go with their regular brunch menu. It's not a huge spread but what they have is high quality.The buffet included: crispy applewood smoked bacon (cooked perfectly), French toast, hash browns, pork sausage, omelet bar, vegetables, already made salads, carved prime rib, peel-and-eat JUMBO shrimp, clams, pastries/deserts.At no additional charge, the buffet also includes the ability to order anything off the limited normal Sunday Brunch menu and it was made to order and brought to our table: hot powder-sugar Beignets (with warm seedless raspberry coulis you can spread on to make your own awesome jelly donuts), Crepe Suzette, Shrimp & Grits, Croque-Monsieur, Eggs Florentine, Eggs Benedict, and freshly shucked oysters on the half-shell!Our oysters were from an inlet on the coast of NC.  I can tell you they were the best oysters we've had in a really long time.  They were cold, delicate and had a slight citrusy flavor to them.  We were getting 6 at a time, and yes, reordered several times.We dressed up nicely but folks wore everything from t-shirts (which we felt is underdressed) to suit and tie (which I wore and felt overdressed).The entire buffet experience is just $25 per person including tax, but not including beverages, plus a really good tip since you do keep the waitress busy when you order menu items."], ["Jamea S.", "Great atmosphere, great food! We had a late reservation but the staff did not rush our party. Our waiter, Robert was full of good energy, and laughs! We enjoyed every minute being here!"], ["Jocelyn M.", "Their brunch is amazing! If you're not a fan of a buffet style meal - fine. Order off their menu. The staff and service are AMAZING!!!"], ["Kelly P.", "Very average French- nothing that made me sit up in excitement.   My friend often holds vendor meals here, our service was lackluster at best.   We had to prompt after ridiculous wait for check- reason is bar was understaffed so our server was also bartender.   We made our reservations specifying special event.  Disappointing so much potential."], ["DeAnne M.", "Me and my friends enjoyed brunch at George's Brasserie in Charlotte, NC.  We started with oysters and then ordered eggs Oscar, along with a plate of French toast.  Of course, we all enjoyed bottomless mimosas.  Our waitress Brittain was super.  She kept our glasses full and was very attentive.  The atmosphere was quiet and comfortable.  Most everybody was dressed in their Sunday best, but I believe nice jeans would be fine.  I enjoyed being able to talk without speaking loudly.Sunday brunch starts at noon, and you might want yo make reservations for groups larger than four people."], ["David A.", "Good service, nice selection of traditional french and American fusion options. The duck was tender and moist"], ["Sarah E.", "Brunch was absolutely amazing. Best brunch in Charlotte."], ["Kenyell O.", "My wife and had a HORRIBLE first experience here and will not be back. When we arrived, we sat towards the front of the bar area because they said that a group reservation will be taking place in the back of the bar area. The waitor took our appetizer order that took several minutes to come out for such a small plate. Then we never saw him again. We had to stop another waiter to ask for dinner menus...never came back. And then a lady came by and asked us if we were doing ok and we said absolutely not! We asked for our check and left to get dinner at another restaurant. My wife was so upset that she called them back the next day to speak to management and tell them of our horrible experience. Service was so bad that they asked if there was something they could offer us to make us want to come back but it was so bad that we declined. FYI, my wife was a waitress for years and is has worked in the retail industry for ages now and knows the importance of good  customer service. This was absolutely not it!!!"], ["Joe M.", "What a gem! Pulling up we found free valet parking, walking in to the restaurant gave you a European bistro feel, lanterns and lights strung outside. Our table outside was ready on arrival. The wait staff was prompt and personable. The wine list was sizable. Fresh and simple menu and great dessert! Will be back for sure"], ["Tracee W.", "Warm considerate friendly staff, I just arrived in Charlotte and already feel like part of the family.  A special request was accommodated, ensuring I will be a loyal customer for ever."], ["Victoria A.", "I was down in Charlotte and found this restaurant on yelp. The atmosphere is very nice. The service at the bar was great. I had the mussels. They were very good. Warm bread was brought out with the mussels.  They have a great cocktail list as well. I will be back for a full meal so I can give a better rating on the food. Overall very nice restaurant with a sophisticated feel!"]], "Soul Gastrolounge": [], "Draught": [["HK M.", "What a wonderful place to hang-out after work! We ordered pork wings, beer, Pita chips and Margharita flat bread amongst other things. My friend ordered a shrimp and she was really happy with how it was prepared. I am a vegetarian so I stuck to Pita Chips, they were deep friend but soggy :( Our server was a beautiful girl with a lot of patience and courtesy."], ["Bridget B.", "Oh Draught...I WANT to like you.  I really do.  But each time I give you another try I wonder why I went back...a place so confused by its identity that even the serving staff wears shirts with the phonetic spelling displayed across the front so patrons can get it right.This place has the making of what would be a cool place to brunch, or grab drinks to watch the game but each time I'm left disappointed and feeling shortchanged.A few weeks ago, some girlfriends and I decided to try this place for Sunday brunch.  I was the first to arrive and walked into an empty bar with a group of female servers surrounding the hostess stand, likely meeting before the shift began.  Not knowing they had not opened for business yet, I walk in expecting to be sat.  Instead, they all stared at me, whispering to each other when finally, perhaps the hostess, asked me what I was doing there.  I said I came for brunch and she then told me they were not open and to wait outside.  I obliged and went outside.  Being a nice day, we asked to sit on the patio once we were allowed to be sat.  We were guided to a soaking wet table/chairs so asked for a cloth to wipe them dry.  The server got a cloth from the bar and let us do it for ourselves.  Once we were finally sitting, the server brought us their limited gameday menu (I'm assuming this is their menu every Sunday in the fall) and it consisted of Nachos, Chicken Wings, and a few other items that don't sound too appetizing for brunch.  Based on the experience at that point, we ended up apologizing and leaving to go somewhere else.I decided to try this place again this weekend to watch the Clemson Game.  The setup for the game was awesome- TVs and screens everywhere!  The service and food, however, was not.  Our server was very unfamiliar with what was behind the bar and on tap.  We ordered the wings- how can you mess up wings?  Personally, I'm a fan of crispy wings.  These were exactly the opposite.  The only way I can thing to describe them is they seemed like they were boiled and sauce was put on them still wet.  Not good.  Our table even joked that the sauce tasted better off our fingers than it did on the wings themselves.  The plus side- the blue cheese was really good."], ["Steve N.", "At least the beer was good despite a relatively limited selection.We arrived Friday night at 9:30ish and the place was half full. I would have expected no problems with service and food quality but I was mistaken.Our waitress was barely present. When she was she barely listened to our request. She did however ask if we wanted to \"Tap out on those nachos\" AND if I was going to \"crush\" the rest of my taco.The food was mediocre. The pulled pork on the nachos was cold and my duck tacos were flavorless.I'm sure there are better options and I will be looking for them the next time I visit Charlotte."], ["Jon B.", "Draught is a great place to come and hang out with friends. Over the summer, they did an awesome brunch menu on Sundays, but now that football season is back, they will no longer be doing Sunday brunch.-- Chicken & waffles is an awesome choice. There are pieces of bacon cooked into the waffle which is then topped with hand breaded and friend chicken breast. Served with a bourbon glaze syrup. -- The Salmon & dill Benedict is an awesome meal if you're looking to switch up your typical brunch routine ... just the right amount of lemon & dill to make it fresh yet delicious.-- The house nachos are MUST for your appetizer selection. Topped with beer cheese, tender pulled pork, pico, BBQ sauce, and jalpenos ... YUM. -- The smoked bacon Cesar melt is a great sandwich, staked with a generously sized piece of tender chicken. -- if you're looking for a light meal, 100% recommend the blueberry walnut salad. For some extra umph, top it with a piece of nice seared salmon and don't look back."], ["Kristy A.", "Went here for another soccer game. Had the mahi mahi tacos. They were spicy and delectable. I wish the pieces of mango were bigger, but I was certainly satisfied with this choice. My soccer loving friends were disappointed in the lack of intensity from the crowd and believed others were not true soccer fans, but here for happy hour and just supporting USA. Apparently in real soccer fan bars, people are obnoxious and you have to stand up most of the time. I'll take this level of enthusiasm as it seemed people were into it.... Just didn't know all of the soccer chants or give the game their undivided attention. Additionally, there were mule drink specials for $5 and they weren't stingy with the booze. The raspberry mule proved to be a great choice.The parking here needs to be extended, as I was cursed out (called a b*tch and everything) over a space. Just lets you know how stressed she was over the parking situation."], ["Jenny B.", "Draught is a great place for brunch, lunch, happy hour and pre gaming before a football or baseball game. Here's the breakdown: BRUNCH:$15 champagne bottles with mimosa bar?! Yes please!! Surprisingly Draught is packed for Sunday brunch so make your reservation ahead of time. They have a special brunch menu that includes chicken n waffles, salmon benedict and shrimp n grits. However Sunday brunch will not be held during football season. Salt. LUNCHI've been here multiple times for lunch. Sometimes service is slow, but the food never disappoints. I recommend the blueberry spinach salad with goat cheese and salmon. Yum! HAPPY HOURTitos Tuesdays features $5 Moscow Mules. On Mondays they have half of wings and $3 select drafts! Wine Wednesdays also feature half off bottles. Their appetizers are also great. I recommend the pretzel with beer cheese. PREGAMEDraught is becoming the new hot spot for all pre gaming and tailgating. During panthers games they usually close the parking lot and have beer carts out. They also have DJs come-making this place poppin before and after games."], ["Thomas K.", "Great food and fun times at MSU games. But tonight a bouncer who said he needed to \"let the heat out\" by opening the front door, when it is freezing outside, causing everyone in the downstairs bar to be uncomfortable and miserable, was so incredibly rude and dismissive when multiple people complained. We all asked that the door be closed. He refused, saying people were complaining about the heat. Not true. No one, and we asked, complained about heat. The bar was a great temperature until the bouncer decided to prop the door open against everyone's wishes. We asked to speak to the manager and when the bouncer dismissed us again we met and spoke to his boss. This employee door shut for us. But it was so unnecessary to have to go through the annoyance and discomfort. Makes me reconsider ever coming back if the comfort of the patrons isn't a top priority."], ["Matthew D.", "So I went here for two reasons, one it was a good walk from the hotel and two for the reviews on yelp!! Which did not steer me wrong, although I probably could of used a taxi back after I gorged on some stellar pub food with a twist. I have never seen a French dip with duck confit, and I will tell you it was absolutely amazing.  I had a really hard time decking on a few different things, which gives me an excuse to go back. Really cool looking industrial building, outdoor seating if you choose. The bar staff is super friendly and helped me pick what I wanted when I said I was deciding between two things she pushed the duck French dip.Every night is a different special and hey 10%off with a check in yelp!!"], ["Rodrigo T.", "Host was really cool, we were seated right away...Service was a letdown. 20 minutes of sitting and no \"hello, I'm such and such, can i get you a something to drink?\" It's hard cause when you're 15 minutes into waiting, you get that awkward, \"Are we gonna get service at all?\" moment. At the 20 minute mark, we got up. I went straight to the host and told her, \"We were sitting for 20 minutes, not a glass of water, no hi or hellos and I'm sorry but we are leaving.\"I was really excited to eat there too cause their menu was really enticing. We tried to go last night but their kitchen was already closed. Today it was well open and they even had a DJ playing good tunes in their stunning harvest/industrial dining area setting.I'm sorry the employees truly dropped the ball on this one. When people come and sit in a restaurant, USUALLY they're ready to eat and more than likely really HANGRY.If a patron didn't get to experience your cuisine, how will they be able to rate the experience.Sorry, I'll never be back. I took my money down the street at that Tavern that was named after the street it's on. Where we were seated, greeted, ordered our drinks then food came afterwards, all in that order."], ["Meleah S.", "I have eaten here twice and I can summarize how I feel about it in two words: it's aiiiiiiiight. The first time, we shared wings and the pretzel. Both were decent. Not terrible. Not great. (For those keeping track, VBGB still has the best pretzel in Charlotte!)Recently we were here for drinks and got hungry. I was craving Cracker Barrel (pancakes for the win!) but the ridiculous storm outside caused us to just stay at Draught. I got the Caesar melt (since they don't have wraps - boooooo!) with fries. Both were good but not great. My boyfriend got the meatloaf with mashed potatoes and greens. I tasted his and was not a fan. In conclusion, this place isn't the worst. It also isn't the best. I would eat there again if I was already there but certainly wouldn't make a special trip there for anything."], ["Jeff S.", "I met here with my dinner group for our monthly dinner.  The first things I've noticed is all the changes from the previous tenant in this building.  Gone are the dark green walls and clutter above the bar and replaced with lighter walls, reclaimed wood, hard wood floors, and large TVs on the walls. The space behind the bar was also expanded to cover much of the open space to below to create additional restaurant floor space. Knowing what kind of work this place needed, the owners of Draught really put in a lot of work and money in to this restaurant.They have a good draught beer selection and wine selection as well as a full bar but I was not drinking tonight so I could only notice the selections. Next time, I'll try the beer.The menu consists of an eclectic mix of burgers, salads, apps, entrees and a few flatbread pizzas. I'd describe it more as Gourmet comfort food but the prices and portions were decent.Service was great here even though our server disappeared for a time between our drink order and our dinner order but she apologized for it and was great with everything afterwards.  So why just 3 stars? Well the first two entrees I selected were unavailable.  They were out of scallops and did not have a pasta dish.  My 3rd option was salmon with a hoison sauce.  The sauce overwhelmed the salmon so I would suggest cutting back on that.Still, I would like to come back here and give them another try. I see potential here. And I do want to try the beer."], ["Nancy N.", "Spelled Draught = Pronounced Draft... all clear? Me neither, but it's okay!Draught is one of my favorite bars in Charlotte. They have quite a list of NC brewed beers and a yummy menu to complement. I love the Korean BBQ Wraps! The House Nachos with pulled pork and house-made chips are also delish. Don't bother with the Hoisin-Glazed Scallops, there are several other yummy items on the menu (like the Pub Burger!) Overall the food, atmosphere and overall vibe are pretty awesome! I've been here on a regular night and also during a Michigan State game (I.e when Draught bleeds green) and it's always an amazing time. They even have a projector downstairs to house these infamous Michigan State games (this is a Michigan State bar btw) and of course, Panthers games!"], ["Marco F.", "After hearing lots of good things about this I made it a point to give this place a shot. Came here one Sunday night to grab a bite to eat and watch some football. TVs, cold beer, good food & football. What more can someone as for, right? I had the nachos which were fantastic -- came with pulled pork, tons of cheese -- and they use crinkle cut potato chips which seemed homemade. I also had the pub burger which was solid...not out of this world but pretty good. Service was great as our server constantly checked in and kept the cold beer coming.This place is right next to the BOA stadium and I can totally see it doing well on game days. Overall, I have no complaints about this place. I would recommend it to ANYONE looking for a good bite to eat."], ["Jim B.", "Went to watch a college football game. Sat at bar for really long time with promise they would put game on. Bartender said he would but never did. I asked for manager never came.  I went to the manager and she said sorry she won't put it on. Was not served again.  I was very polite but she did not care. We packer fans travel in huge bunches. I am sure all who see this review will avoid this unwelcoming place. BTW food sucked anyway"], ["Molly D.", "Decent food for sure and granted, I knew a Monday night football game would be busy but...and here we go: don't advertise the HELL out of your amazing $3 draft and 1/2 price wing special on Monday if you're not going to honor it on a Monfay when the Panthers play!! I felt suckered in and then on top of not honoring the specials, the beers are $6 for a plastic cup draft!! WTF that is sick and totally ridiculous. The wings were amazing for sure but we didn't know they weren't 1/2 price until after we ordered and ate them...shifty! Especially since the dang Monday night special was still even on display right outside the bathrooms! Then, they got busy and couldn't handle it at all...went back for a second order of wings...45 minutes later, no wings so I had to stalk my server and tell her to just take them off and get me a check...that was 10 mins ago, still waiting on the check ...ugh"], ["Brian F.", "Draught feels like a rough draft. It has a lot of potential but missed the mark on several points.  Situated in the shadows of the Panthers stadium and offering a nice view of uptown from the patio, Draught caters to a lot of the uptown bankers after work as well as some of the locals.It appears to be an old textile mill with wooden floors and brick interiors and exteriors.  The menu advertises \"house made pasta\" made in someone else's house (Pasta and Provisions) however they were out of it.  My wife ordered a salmon burger but they were out of that.  She opted for a veggie burger instead and I got a regular burger.  It was decent but at $12 it was a little overpriced.  They have a decent amount of beers on tap, but not as much as I expected with a name like Draught.  Our waitress was okay but we had to ask for napkins.  My wife asked for may for her veggie burger since there was no sauce on it.  She waited a little bit for the mayo and then the waitress did not bring anything to use to put it on the bun.  I went to use the restroom and the men's room on the main floor was closed.  They directed me to one in the basement where there is another bar and more tables.Our experience would have been a lot better if not for the points mentioned above.  I have a feeling they never have the pasta, but when a place is out of the first two of three things you want to order, you have to wonder how the place is being operated.  If the management can't order the product that's on the menu, can they really operate the place well?  The waitress did give us a 20% off card to use next time.  We'll use it and hopefully I can come back and add a star to this review."], ["Kristen M.", "Feels like home! Great food, Great drinks & Great people!!This place has become one of my favorite sports bars in town. It's close to the city, but not downtown. They have a ton of brand new tvs on every inch of the walls and are able to change the sound for the area you are seated in. I am a bit bias, as it houses the Michigan State Alumni Club of Charlotte - Go Green! They even have some Michigan brews on tap too. This place is also the official game watch for Clemson and Miami. Best Tip about this place: there is a back entrance on the lower side to the downstairs bar, plus it has a HUGE projector screen downstairs too!!"], ["Tim F.", "I was visiting Charlotte for a job functions and yelped this nice little spot. Great view of the stadium and awesome service. The bartender was probably the best one I had in two months. I got some wings and they were crispy and flavorful just like I expected. My only concern/drawback is that the fries just weren't that good. They were the old fashioned kind and they may have been fresh but those are just so hard to tell about. Overall I was very pleased with my food and so was my friend. I thought that the bartender was awesome and his service really made it for me."], ["Steven J.", "Food and service was great. Love the staff and the beer selection. Will be returning every chance i get."], ["John H.", "I really try not to hype myself too much about a place before trying it myself to give them a fair shot, but after much anticipation, I finally got to try Draught (pronounced Dra:ft)!!It was a Thursday evening and we got there before the Thursday Night Football crowd.  No wait for a table, and our waitress let us pa ruse the menu before deciding on Pimento Cheese Fritters and the 3rd Ward Special:  Smoked Duck French Dip sandwich and fries.  The place had me at \"Pimento Cheese\" but when you fry it up into awesome bites, it just makes it that much better!  The smoked duck french dip was so delicious that it was pretty much gone in 60 seconds.There is a rather large parking area for being that close to uptown and the space is super nice.  I like the use of wood and modern/clean lines.  There are tv's galore for watching games/sports and a good selection of local beers on tap.  I can see this place being a great place to meet up and tailgate before a Panthers game and/or even a Knights baseball game."], ["Mike M.", "This joint has a BANG'IN 5 Star menu that hits on all cylinders every time. They stole the head chef from some swanky uptown spot and he made this artwork of a menu and maintains it on a daily basis. If you want a magnificent meal or just a succulent snack (app) with a plethora of beers/drinks to choose from, I highly advise you to get you hungry, stylish ass into this front door here, it's the place to be on the Queen-Cityz South-side. Oh and as a bonus you can tell (Tara or Ryan who both rock) or anyone at the bar really, that the Guy Fieri look-a-like dude from the stadium enlightened you and there might just be something in it for ya.... ((BOOM!!))~Stay hungry my friends"], ["Stacy H.", "Stopped by Draught for a Cufflinks and Cocktail event during the week. The upstairs section was pretty busy but our event was held downstairs. There was a small bar and tables and what looked like maybe a space for a musician/band. I ordered one of the drinks that were on special and had their lemon pepper wings. The wings and drink were pretty good. I think they might have been slightly overwhelmed with the size of the crowd but I thought it was a pretty neat place. I would like to go back for dinner one day and a drink .  I also checked in with my Yelp App and received 20% off my bill ! Yay  There is parking lot right beside the bar, but there is also parking further up the street."], ["Nicole F.", "This place is in walking distance from where I work so from time to time I'll suggest to go there for lunch meetings. However after this past weeks lunch I won't be suggesting this anymore. Their service is way too slow. The place wasn't even half full and it took over a half hour to get 2 burgers and a salad. Not to mention the place is way over priced for what you are getting. $12 for a salad from a bar is ridiculous. I give it two stars because the food has been tasty, just over priced for a bar."], ["Lauren N.", "What's not to love here? Bloody Mary and Mimosa bar complete with a DJ for Sunday funday...weekly egg rolls and Dr. Pepper flavored wings washed down with a Tito's Vodka on tap. Need I say more?"], ["Funk D.", "Stopped in at draught on a gorgeous early April, midweek afternoon about 1:30p.  Sat just inside the open garage doors.  My bride of 36 years, our daughter #2 and I...visiting daughter #1 who was hard at work preparing for a Charlotte Knights home opener.The place was ours for the taking! An easy, relaxed day that this triad hadn't had in some time.  We enjoyed the Korean Bulgogi Lettuce wraps with jullianned carrots, cucumbers and pickled red onions and the house avocado salsa with chips (actually fresh house made, deep fried potato chips, not tortilla chips).  Throw in some local brew pulls and our afternoon was complete.Our first thought was what a fun place for the locals! Good food, good conversation, maybe some good live music if that was in the offing.  The only down side we saw was we would not be around for a second try.If you are in the Queen City, we recommend a visit"], ["Anthony R.", "Food was amazing.  The french dip with duck was the best and the pork wings were great. Staff was amazing"], ["Amber M.", "I work about a mile from here and have driven by many times but decided to stop in for lunch today.  I checked in using the Yelp app and there was a deal for 20% off the meal.  When I presented it to the waiter he said he was sure they had stopped honoring that deal but he gave it to us anyway, which was great.  Thanks Ryan!  I liked the atmosphere of the place, small but not crowded feeling.  Very industrial decor & the hardwoods & wood tables look great.  I wish I hadn't been on a work lunch because they have a great beer selection! Being it was mine & my coworkers first time here, the waiter (Ryan) was great at suggesting items from the menu.  We ordered the fried pimento cheese fritters for an app...oh so amazing!  I got the fried green tomato blt and my coworker ordered the steak sandwich.  Both items were great! We will definitely be back and have other coworkers in tow.  I've also heard great things about their Sunday brunch, hopefully I can check that out someday."], ["Angelica S.", "I've been twice to this place so far and I've enjoyed it a lot. Pretty good beer selection, wine is pretty good but a bit pricey for the selection but Wednesdays are half off bottles of wine so go that day if you are a big wine drinker. They have good drink specials through the week especially $3 draughts on Mondays. The food has been great! I had the duck pot pie... to die for. The pimento cheese balls with the spicy sweet honey sauce.. very addicting. I enjoy the egg rolls of the week; I've had the southwestern and the shrimp and grits. My SO got the meatloaf and although I found it to be tasty he wasn't too impressed. It's pretty a standard meatloaf despite the varying \"fancy\" meats in it with typical sides.I like the feel and atmosphere inside. They have garage doors that open and a patio that looks like it will be a nice hangout when it warms up a bit. I will definitely return."], ["Michael H.", "My wife and I visited recently on a Thursday night. We were big fans. I never went here when it was Hartigans, so I can't do a before and after, but I can say the after is very nice. The look is very cool, the service was friendly and the food was good. I had the salmon burger and sweet potato fries, which were good (although the burger wasn't quite as good as it sounded to me). The wife had a salad that she really liked (although it was fairly small considering it was about $13 - $15 after adding a piece a salmon). We'll definitely be going here regularly."], ["Heather A.", "Meh, I've experienced better. The cinnamon rolls looked better then they tasted. Are cinnamon rolls supposed to be hard and crunchy??!? Our waitress was slow on the service and pretty sure it took her 10 mins to refill our coffees. And then I took a bite into the biscuits and gravy and unfortunately, they were plain with no flavor. :( The biscuits were flat and not fluffy. In fact, all the food we got was not hot at all. The only plus side to this place is the cool environment and they have a DJ that plays music during Sunday brunch. That's all folks"], ["James M.", "They had me at 20 NC draft selections! Great rustic decor, friendly staff.I was in town for work and found this place on Yelp. Just a few blocks from my hotel, so decided to give it a try. Solid nachos, and some other decent selections - not just straight from the freezer crap. I had the 'kitchen sink' meatloaf, which was great. Beef, pork and duck combined & served with garlic mashed potatoes and collard greens. Came back my second night and had the nachos, along with the duck tacos and some more great draft selections. There was free live music that night which was cool. Venue was spacious, clean, no complaints."], ["Amanda G.", "The location of this place is great! Close to Panther Stadium. We had the pork wings and regular fried chicken wings and they were both awesome. I enjoyed the food and location but for some reason just wasn't amazing for a 5/5. So I'd give it a 4/5!"], ["Ryan R.", "Great place for brunch, Bloody Mary bar is fantastic! I also recommend the chicken and waffles and the cinnamon rolls as a dessert"], ["Kevin B.", "This place has really stepped it's game up. After going through growing pains, overall this place is really hit it's stride. Great food, great beers, and awesome ambiance."], ["Brian B.", "I REALLY like this place. The atmosphere is great and the crowd is usually full of young professional types. It's a good spot for football and I like the outside seating. It's also conveniently in my neighborhood, and right beside Bank of America stadium. The food has always been delicious. I assumed they'd have typical bar food but it's so much better. They have scallops, deviled eggs and some other interesting selections. I usually go with the French Dip (third ward special) which they make with duck and Gruyere. I've also had the Korean lettuce wraps. They were very good but I felt it didn't come with enough food to warrant the higher price...which is rare for me because normally I want portions to be smaller! The chicken Caesar salad was delicious too I do wish they had more local beers."], ["Patrick V.", "Very disappointed with this place....great ambience and very pose spot...but that is all that is good. Sat at our table for 20 minutes watching servers and staff help other tables without anyone greeting us or taking our drink order. We ended up leaving and expressing to the host bout why we were leaving. She ended up just apologizing and going back to her business. Would I go back there.....heck no! Would I recommend it to anyone...heck no! Did I just write a bad review.....heck yeah! ^_^"], ["Megan A.", "hidden gem. secret pathway by the panthers stadium connects to the third ward. good place to sit outside and bring the pup.the food wasn't great though - can't recommend the duck pizza or nachos.id like it better if there wasn't a clemson flag outside."], ["Chelsea K.", "I had very high hopes for this place, as its the new 'home' of the Charlotte MSU Spartan's group.  We showed up early Saturday evening with friends and were asked by a bouncer if we were here for Michigan State.  He told us the MSU game watch was downstairs, but they would ONLY be showing that game there. Since our friends were interested in other games, the bouncer advised us to have a seat in the main dining room, as they were going to have a bunch of games on. We were greeted, promptly seated, and brought beers from their fairly large draft list. The interior was decorated in a cool way - kind of industrial, with lots of wooden beams. The waitress was nice, but quickly became busy - can't blame her; it was game day! Our plan was to stick around for some football, have some drinks and maybe get some food. That plan, however, was quickly derailed. After maybe about an hour, every TV was changed to  the Miami game. At first we thought it was a malfunction, because the picture quality was so terrible. In fact, we realized that they were actually streaming this game from someone's computer - you could even see a cursor hovering in the corner. We asked the waitress if she could get someone to change a couple of the TVs in the area to one of the other 6 games that were going on at the time. She agreed and hurried off, only to return with bad news. She advised us that the front half of the bar was designated for Miami and that the back half had other games on.... but there were no available seats in that area. To make matters worse, a group of rather obnoxious Miami fans were sat next to us. Part of the experience of going out for a football game is getting there early, staking out the best view in the house, and settling in for some beer and wings. What's the point of getting a table if they are going to change EVERY screen to a different game? Draught succeeded in alienating me and my friends. I can't rate them on their food, because we didn't want to stay to watch a poor feed of a came none of us were interested in. Better luck next time, Draught."], ["Leslie F.", "We have been here a few times to watch football. The bartenders are great! The beer list is decent and they have good wine & cocktails. The food has been good. We live close by and would love for this to be our go to spot but the menu is limited and way too much duck!Cheers!"], ["Anthony C.", "Overpriced and lacks quality service.  My wife spent 2 hours in the restaurant during a college football gamewatch and not once did any of the 3 servers ask her if she wanted a drink.  $12 for a burger and fries, c'mon man. It was worth, at best, $8. $35 for our bar tab and that was 2 draft beers and 3 cans.  That averages $7 a beer, really?  It is another prime example of a hipster (eff hipsters, nobody likes you) bar where regular joes are overlooked and underappreciated.  We have money too, a*******.  Cheerwine BBQ tastes like garbage, can't taste the Cheerwine at all and at over $1 a wing, you'd think maybe they would invest some of that money into an actual cook to develop a real BBQ sauce - not to mention a french dip made out of duck confit?  WHAAAAT the WHAAAT?  Terrible, don't waste your time or your money."]], "Bentley's on 27": [["Peterson L.", "Came here for dinner and it was great. Even though we didn't get seated immediately, we waited shortly while we had a good time having drinks by the window with a great view. Once we were seated we actually had to waiters who were good at suggesting different meals since it was our first time. I had the bourbon filet mignon and the twined baked potatoes. The steak was perfectly cooked and I think the baked potatoes was the best I've ever had in my life lol...yea a little dramatic but it was that good. She had the steak and asparagus. She loved it. We had a great time!"], ["Lisa C.", "We had the best dining experience last weekend at Bentley's. This restaurant exceeded my high expectations with the outstanding service and phenomenal food not to mention the spectacular view!  Our night started with a call to the restaurant to hold our table while we found transportation into the city. I had never realized how much we depend on Uber until their platform was down and we were scrambling to find a plan B! Bentley's was very accommodating and was happy to hold our table. Thankfully we weren't more than 10 minutes after our reservation time.The hostess led us to a booth by the window with a great view of Charlotte. I could see South Park from my seat and the boyfriend could see the Knights game. We started with water and reviewed the drink menu. I loved that the booths at this restaurant were set a couple feet away from the windows and from other booths. The wait staff was able to slip in almost unnoticed to refill glasses and clear plates the whole night. We started the night with the Bentley's Oysters which were floated with Rose Champagne and topped with crème fresh and White Sturgeon caviar. These were the best oysters I have ever had. So decadent, so delicious!  For our main we decided on the Chateaubriand Bouquetiere, which was a wait but completely worth it! The tableside preparation was a great touch that added to the presentation of the meal. The sauce the server poured over the meat after he flambéed it was amazing.This is one of the few restaurants in Charlotte that maintains exceptional standards which enhance the special event experience of dining here. This restaurant has shot to the top of my list of splurge night out dining. PS the cocktails were reasonably priced, my Bentley's Martini (pineapple inflused vodka as the base) was only $12. For an opportunity to take in such an amazing view in a classy atmosphere I will probably be back for a cocktail fairly soon."], ["Abby L.", "This restaurant is beautiful.  It is a hidden gem that no one knows is up high in a gorgeous building.  I love to come here. I love the food and service. Always make me feel special."], ["Inchang Moses S.", "I am now convinced that this is the best restaurant for fine dining in Charlotte. The food, the decor, the ambience, the service all deserve thumbs up.We got to sit on the opposite side from where we sat last time. I loved the view over Charlotte including the Bank of America Corporate Center and the Hearst Tower on one end and the BB&T Ball Park at another corner. We actually got to see the game from our table. Yes, we think we got the best seat in the house. Early birds do catch the worm.The same person who waited on us last time was one of the three that night. They were all professional and knowledgeable. I always look for, not just manners and confidence, but intellect. Outstanding hall staff know when to interrupt and even make out what you murmur even if it's not clear - and get it right! At least two of the three were super last Saturday night. They recommended the tuna/crab/filet trio for appetizer, which was great, and always had my champagne glass full. But they never came over when we didn't need them after my wife told them that it was our anniversary.And the food - We had the tuna/crab/filet trio for starter, bourbon filet and shrimp for entree, and got the creme brulee on the house. All amazing. Even my wife, who's not a big steak fan, was awed by my bourbon filet mignon. Her shrimp was great as well. We also ordered a bottle of Moet Chandon after our cocktails were done. We loved it.I'm sure there are many more foodies and Yelp elites who have experience more restaurants in Charlotte than me; and I do not doubt that some will disagree. But I really vote for Bentley's as the best fine dining restaurant here in Charlotte after going around for 3 years now. It could be my preference. I do like places with a great view, excellent food, and it can't be too loud. The famous steakhouses here are mostly on the first floor, the other one on top of another building is too loud. Yeah, I like this place."], ["Michael L.", "You're gonna spend a bunch of money for the best view in Charlotte with excellent food and service.  It's really just that simple.  I'm guessing you're reading this review (and others) because you haven't been here yet.  If you're looking for the answer to a perfect date night, birthday, anniversary, business meeting or... Maybe you just HAPPEN to be one of those people that actually enjoys an awesome experience... Bentley's on 27 hits the mark."], ["David S.", "Hit and miss. Some items were excellent. Others (eg veal) were not. Waitress was not. At over $700 for four we expected great to excellent in all aspects. Has the feel of a previously excellent place on the decline."], ["Judy R.", "3.5 stars. Caveat can be found in the food section below.I was here for a company group dinner last night and would have to say that I was a nice experience.Ambiance: being on the penthouse level of downtown Charlotte, this restaurant has (I think) a 360 degrees view of the city. Just magnificent and romantic.Service: along with the top prices you pay here, the services is TOP NOTCH, which I would say that I'm quite impressed with the wait staff. Just very professional and very polite which positively contributed to my overall experience.Food:  I would have given this restaurant 5 stars if I my meat would have been done right. Let's break it down:Apps: shrimp cocktail was fantastic. The shrimps were humongous and my colleague really liked them. I did not try them myself.Tuna carpaccio: I thought this was pretty good.Escargot: omg so delicious on the tiny toast!  Very nicely seasoned with garlic and herbs. I really have enjoyed this dish.Fried calamari: OOOMMMGGG! Best fried calamari EVER! You have not lived until you've tried this calamari! Well if you're a calamari person. I called this fried calamari steaks! Lol. Cut into thick slices and delicately breaded and seasoned, they were fried to a perfect consistency. The slices of sliced calamari were perfectly cooked, juicy and melt-in-your-mouth tender. Just absolutely amazing! the aioli was just phenomenal!Side salad: standard salad but the balsamic dressing was way to acidic for my taste.Entree:Bourbon filet mignon: I didn't eat this but my colleague told me that this was very good. Mixed grille: I was a little disappointed with this dish... The mixed grill included 3 different meats: lamb, bison, and filet. The lamb was fantastic! The filet was a little too salty and over cooked (medium instead of medium rare) and the bison hanger steak was cooked correctly but lacked flavor. I was surprised how lean the bison hanger steak was, and I thought it lacked flavor. The red wine reduction was too salty.  The bamboo rice was very good.Bananas fosters saves the day!For dessert, I shared a bananas foster with my colleague and we were all pining for more!!! It was a show and a desert because they prepared it table side and we can smell the caramelizing sugar while the waiter prepared it. I would have licked the bowl if I was alone! LolOverall, very good restaurant and had the prices to match it. However next time I will  order fish instead of the steaks."], ["James D.", "We were lukewarmly \"welcomed\" by an older lady with blonde hair. A smile would have been nice. I was a little surprised someone with such a cold manner would be allowed to be a hostess. The young girl with dark hair that appeared to be in training was a bit friendlier but it seemed the older lady was training her to not smile or greet guests warmly when they walk in. After that, everything went great, especially the awesome service from Ray. Ray's friendliness made up for the cold, aloof greeting. The food was spectacular. My friend raved about the steak. I would definitely return."], ["Dan B.", "In Charlotte with wife to meet our daughter who had to take the second part of a three part Optometry national board exam. After she completed the exam decided we needed to celebrate so I checked the reviews and off we went to Bentleys on 27. We arrived a little early so we had a cocktail in the bar. When your 27 floors up you can see for miles! After a short time we were seated. The dinning room is very nice. Elegant table setting, service was fast and consistent. Now I have to point out that we were the only table in the entire section. If possible request a table by the window. The view is great! My daughter ordered the filet and shrimp which looked wonderful, and it went well with her champagne. Wife had a salad from appetizer menu. Sorry but I don't recall what type it was but she did say it was delicious! I had the dover sole over vegetables with what tasted like a lemon sause and absolutely loved it! We all enjoyed the experience at Bentleys on 27 and would recommend it to friends and family should they find themselves in Charlotte. We are here for four mites and may go here for dinner again. It's a little pricey but very elegant with wonderful culinary fair!"], ["Victoria P.", "Both food and view were perfect ! Customer service was not bad but could've been better and a little more attentive. Seemed like our host was assisting a table beside us the whole time and would walk right past our table. We'll probably go back because the food was great and hopefully have better customer service. Would recommend to people but definitely not 5 stars in my book."], ["Matthew E.", "Attended a seat dinner with large event party. Set menu with a choice of 3 entries. The service was great, very classy. The food was also very goo. I had the salmon which was a hair overdone but considering we had a huge group you expect that. The sauce and side made up for it. Dessert was also very good, creme Brule. Good for groups, not sure what the regular restaurant has to offer."], ["Katie S.", "Hands down the best restaurant in Charlotte. The classic French cuisine, service, beautiful views and ambiance is impeccable - worth every penny. The atmosphere is relaxing and romantic, perfect for a special occasion. The owner and wait-staff are extremely professional, friendly and welcoming. Highly recommend the Oysters Bentley, French Onion Soup and Filet Mignon - although I am quite sure everything on the menu is incredible. Bentley's on 27 is a true Charlotte gem."], ["Jason R.", "Amazing! Excellent food and service. Everyone there was great. Loved it!"], ["Tony Y.", "We ate here on the first night of a work management trip to Charlotte. Super fancy steak house on the 27th floor. Amazing view with floor to ceiling windows. The atmosphere was inviting and fancy. The service was top notch, everything you expect for a high end establishment like this. The french onion soup was good, salad was ok, the filet mignon was the star of the show. Super tender and flavorful, just an amazing cut of meat. The cheesecake was amazing as well. A great meal from beginning to end and you will pay a pretty penny for it, I dont usually eat at places this nice except on super special occasions or like this instance where my company took care of the tab."], ["Scott P.", "I took my wife here as a surprise for her birthday and we came away a little disenchanted. It began with a Reservation that was made online a little over a week before our dinner. After reading all of the reviews about the view, I requested a table by the window and that a bottle of her favorite wine be table side when we arrived. I received a confirmation in less than 5 mins.When we arrived, the hostess escorted us to our table. This would be my first disappointment of the evening. She put us in a table as far away from the windows as possible. I noticed this was the only empty table and to top it off the blinds were down ( they did open them as the sun began to set but we had to get up and walk over to the window to enjoy any part of the view) so I tried to hide my dissatisfaction and move on. There was also no bottle of wine waiting for us either, but they did bring it right after our waters were poured.We both ordered our meals and 2 of the window tables opened up. I walked up to the hostess and told her that we would like to move to one of the tables by the window that just opened up. She told me that she could not re-seat us as it was not fair to the other guests??? I told her that my reservation clearly asked to be seated there and she told me that there was no guarantee on where you would be seated. So, why wasn't this stated anywhere in the website or even mentioned in the confirmation? Why couldn't the hostess have told us when we arrived that the table I requested wasn't available and given us the option to wait or take what they had? I went back to my table and explained to my wife what was going on. She said that what appeared to be the Manager was making his rounds through the other tables and that I should talk to him. So I decided to wait until he got to us. In the meantime, now there were 4 tables unused by the window and it was quite obvious that they had no further reservations for the evening.As we waited for our food, we finished our glasses of wine, water and the piece of bread that was brought. Now, when you are paying $50 for a $9.99 bottle of wine, and over $50 per plate, I would expect to NEVER have to ask for more wine, water or bread, yet, that is exactly what I had to do. The wait staff was very attentive once we engaged them, but really? Why do we have to point out these things? This place prices itself to the extreme high on the fine dining map yet can't get the little things right.When the food arrived it actually looked good and was prepared perfectly. I had the Bentley Ribeye and my wife had the Mixed Grill. The food was quite enjoyable. For Dessert we ordered the Bananas Foster. This was prepared table side and it was delicious.We never saw the Manager (my guess is the Private Party they were attend to in the other room had his attention) so I could not voice my dissatisfaction with their seating policy and as we got up to leave and there was STILL 4 empty tables at the windows that no one was ever seated in, I became more angry then I was when we arrived. The view and the seating were the main reason that I chose this particular restaurant as well as giving my wife a great dining experience. The food was good but it didn't make up for the other things that this place lacked and the total disregard they had for regular people that come there to drop well over $200 on a meal AND an experience. Save your money - you get treated better, and spend less money at the Melting Pot, The Capital Grille, Ruth's Chris or probably any other place in the City. This is one place that we won't ever patronize again."], ["MJ M.", "Our company worked with the owners and staff at Bentley's on 27 to host a 100+ dinner event. From the very beginning (months before the dinner) to after the event, we received the top quality service. The owners and staff were accommodating, friendly, helpful, flexible, and truly a joy to work with.The food and drinks - FANTASTIC! Everything was delicious. If I get back to Charlotte, I will definitely be having dinner here again. A perfect place for a special occasion!"], ["Jim B.", "This place is amazing.  It has scrumptious food and a great atmosphere (i.e. Views of the city).  It's expensive, but worth it for that special occasion.  If you want to go, but can't afford the price- go during lunch and get a hamburger.  They're less than $15 and out of this world."], ["Shoni S.", "Celebrating my birthday we chose Bentley's - awesome choice! Bentley's is very impressive! It wasn't crowded at all (we dined on a Monday evening around 6:30pm). The wait staff is very attentive & welcoming.We ordered drinks that were perfectly balanced and the kick came a little later. I had the Bently Martini (2) & my husband had a Pink Lemonade cocktail but I don't remember the name. Both delish!For an appetizer we started off with the crab cake. While small...it was mouth watering. I actually closed my eyes to savor the moment, ha! Definitely more crab than cake, seasoned & cooked to perfection. We both ordered the Filet Oscar served with whipped potatoes and asparagus. Beautiful presentation and so filling! We both were unable to finish oir entrees & I didn't have to eat a single thing else for the rest of the evening. After finishing up with our entrees then came the surprise surprise! For my birthday they brought out the most delicious Creme Brulee. I don't even like custards and puddings but THIS...wow! As stuffed as I was...I couldn't resist.Bentley's gave us a great 1st time experience with amazing views of Charlotte! Service was prompt, food was delicious & the setting was perfect! Definitely recommend."], ["Drew K.", "Absolutely delightful food!!! But the view is outstanding!!! Ask for a table near the windows when you make a reservation. The filet mignon for 2 is finished table side, definitely a great option for dates. The staff are amazing and Mr. Bentley is always around if you have a problem. One of my top favorites in Charlotte!!"], ["Jane A.", "Just okay. My family and I stopped here the Saturday after Thanksgiving for dinner on the way from Georgia back to New Jersey. It wasn't as crowded as we expected it to be on a Saturday night.The waiters were just okay. I found that one spoke too loud for the environment and interrupted conversation. The other continually put food and drinks down in front of the wrong people. The only plus was that the water glasses was always full.The drinks from the bar seemed fine. Everyone else at the table seemed to enjoy their food. My entire order was a strike out. Malbec by the glass was awful. French Onion soup was just okay. Nothing special. I then had the peppered steak with mashed potatoes and green beans. The steak was bland and fatty. The potatoes were bland and less than creamy. The green beans were well seasoned or marinated.My dad ordered the calamari for an appetizer. Warning: It can feed three to four people, which they fail to state on the menu or out loud when its ordered. The only redeeming quality to the calamari is that the pieces are huge and fresh. The restaurant was also out of tuna tartar. A crab cake was ordered, as well as the adult mac and cheese. The adult mac and cheese has truffle and lobster in it, but is way too rich for one person to finish by themselves. The crab cake comes over couscous in some sort of creamy pesto sauce which was okay, according to those who had it.The lamb chop is delicious, as is the bison steak. The bourbon filet is just okay, but if you're into bourbon then it may be right up your alley.I certainly will not be back based on my personal experience."], ["Nic Yongwan J.", "A-ok placeView n atmosphere is perfect but they can do better for there food...It is just ok food.....we order lamp n shrimp something....it is nothing amazing about it....even dessert was just bland.....possible out of bag...."], ["Maurice M.", "From the outstanding responsiveness of the staff to the wonderful dishes  prepared by the chef.... Wonderful meal overall. We had a group of 25+ and all were impressed."], ["Eddie G.", "(Disclaimer, I haven't had the chance to eat here, and the reason is why I'm giving it a crappy review.)I wanted to take my wife  for a nice meal at a fancy place for New Year's Eve.  Lots of people suggested Bentley's.I called to make a reservation last Tuesday December 18th.  The person who answered informed me that they had a special menu that I needed to look at BEFORE making a reservation.  I said great, and I gave her my emailed.  Never received anything.  Called two days later to see if I could make a reservation again.  I told the woman that answered that I had called already to try and make a reservation. I literally spelled out my email this time.  She mentioned something about me having to look over the email and review the cancellation policy before making a reservation.  Since I still wanted to eat there, I told her I would wait for the email and call her back the minute I reviewed it.It's been a week now.  No emails."], ["Steve G.", "LOVED IT! My wife and I went here for dinner on our 25th anniversary and it was amazing!  The food was cooked to perfection, wait staff very attentive but gave us space and the view..... WOW!  We loved everything about the place and most certainly will be back again and again!  Oh, and they even provided us with a complimentary dessert complete with a candle for celebrating our anniversary!  Excellent touch!"], ["Rina S.", "Valentine's dinner was amazing and the Chef did a great job making a alternative vegetarian option. Not an enormous amount of food so you don't feel like you are over stuff and rolling out of there. Fresh, light and tasty. Wait staff was on point. Great wine list. Intimate setting. Perfect romantic sight with a great view."], ["Carol K.", "Great view. (insert sounds of crickets chirping here) But that's about it. Bentley's really didn't impress me the other night. When we got there- the hostess asked us to take a seat in the bar as our table wasn't ready. Okay. So we sit in the stylish bar in front of the fireplace and a woman comes over to take our drink order. At that point the hostess came and got us for the table and the server basically never got us our drinks. In most fine dining restaurants- once the drink order is taken, it doesn't matter if you drink them in the bar or the restaurant; they take them to where you are. But not the case here. So we never got that first drink. That was the first service mis step of the night. The rest of the service errors were due to the server who we had (or didn't have, as the case may be, as this guy was missing in action for most of our VERY long dinner). We were celebrating a birthday and had asked for a window table for this occasion. We were seated in the perfect table- right on the edge of the window looking out over downtown Charlotte. This was off to be a great night. Or so I thought. Our server came over with a couple of bottles of champagne to tempt us but we were in the wine and cocktail mood so we passed on the champagne. Maybe that was our mistake as this guy didn't come back to our table to get our drink order for at least 15 minutes. No drinks. No bread refresh. No fresh ground pepper (other tables had it) No service. Where is all this \"southern hospitality\" that my friends down here talk to me about? Not at Bentley's on this Thursday night, that's for sure. We placed our order. Too bad for me that they didn't have Grouper on this night although it was printed on the menu (my fav) but had instead substituted Mahi Mahi in for it. No thanks. I went with surf and turf with a filet and crab along with a salad to start. My friend ordered escargot to start and this same server tried to talk him out of it saying it would take 20 minutes to prepare. \" Hey!\", thought I. \"The man wants snails . . .give him snails!\" Don't try to talk him out of it. So the rest of our appetizers came up with the snails and were quite good. There might have been a pacing problem in the kitchen as our entrees then took forever to come out. And when they did, other than the sides coming out piece meal, the food was pretty good- although there was gravy over my filet when I had ordered it with Bearnaise sauce. Also-there were only 2 melted butters brought out to the table- when clearly 3 of us were having lobster or crab. At this point- our dinner was going on the 2.5 hour point and we were meeting others and had to go. However- we knew there was a special birthday dessert coming out but again . . .it was taking forever. When it finally came out, we had a forkful and then practically ran out of the door. Dinner for 4 ran about $400 which would have been reasonable for a fine dining restaurant, had we gotten a fine dining experience. An off night? I don't know. This server really blew it. And at that price? I am sure there are better choices in Charlotte."], ["Jason C.", "Great atmosphere. I highly recommend this place for lunch. The daily special is highly recommended, but if you're looking for a salad, the Chicken Caesar is great. Ask for a whole wheat roll as opposed to white bread."], ["Niurys A.", "Very few places deserve 5 stars,but this is it. On a recent visit to Charlotte my soon to be in laws wanted to take us out to celebrate my Prince's birthday.The most special place, overlooking the city on the 27th floor. We saw places we didn't know were there, from the beautiful dining room.Their service is outstanding and though  their menu is not huge it is full of delicious choices that they do very well.. Every one ordered a soup or salad except me ( I had to wear my dress out of the place later) The servings were generous and everything was delicious (The  Clam Chowder was very good I was told by the master soup eater) We had 2 bottles of Merlot for our table which were reasonably priced for a place like this and a couple of cocktails that were well balanced in alcohol vs mix.The birthday boy ordered the Dover Sole, which they de-bone tableside. Their French Table service was outstanding, as with the Caesar's Salad done tableside.The Salmon I had was perfectly prepared with just the right amount of blistering on the outside and a tender flesh on the inside. The Crabcake Mama had was perfectly shaped considering what little filler they used and delicious as well.We ended with a Creme Brulee we shared and 4 chocolate Martinis which were delish and make me want one now. They have a  wine list,  a specialty drink menu, and a dessert menu as well as a Dinner menu.Not at all cheap but well worth it!"], ["Michael B.", "Lat night I had dinner at Bentleys,  delicious food, and a nice presentation.  View was amazing and aperance of resturant was a bit dated, but the view made up for it.  The service was good, as she came at the right time, and left us alone when we were talking.  Spent about 350 for two people including a nice wine, impressive wine list.My complaint is that when we left a little after nine, there were people in the bar area right off the dining room in shorts and flip flops.  You cant be a 5 star resturant with the prices you demand and not enforce a dress code.There were several couples celebrating an anniversary or special occasion and they were really dressed up, so I can imagine what they thought when they walked by the guys in shorts.Shame on the young lady at the front door that allowed them in, dressed that way.Step it up Bentleys, your not a sports bar !!!!!"], ["Valeria B.", "Great service, awesome view, and really really good food. For drinks, the bartender recommended the house martini (mango and pineapple martini) and it was delicious! for starters I had the clam chowder (more like a bisque) and it was fantastic. I split the Chateaubriand bouquetiere with my dad ad our entree and it was cooked medium rare to perfection."], ["Brett G.", "The blinds are down and you cannot even see the city aka parking lots. It is high up but the owner will not allow the blinds to be raised therefore you have to view the city between 2 inch slots. Has such great potential!  Windows are tall, drinks are good, food is yummy. They are hiding the beautiful city skyline with the blinds.  OPEN THE BLINDS Just check it out for yourself"], ["Tae-Sun K.", "Went here on date-night, and the place was oh so romantic. I give the food 3-stars, but the ambiance deserves a star all on its own. What can I say, I like my food messy and ethnic. Bentley's food is pretty and rich. We ordered the crabcake for appetizers, I ordered the Taste of Hawaii, which was fresh sea bass that night, and my man ordered a steak. The presentation was lovely, and the service was superb. Think Anthony Hopkins in Remains of the Day. We had the best view in the house in my opinion, facing the city skyline. We got there at 8 p.m. and by the middle of our dinner, we saw the sun set."], ["Julia M.", "For Native Charlotteans and those who have been in Charlotte long enough to remember The Fish Market across from Southpark, the owner of Bentley's used to work there. In any case, Bentley's on 27 offers a wonderful dining experience with a great view. We started with the Oysters Bentley (yum) and Tuna carpiccio. We had stuffed shrimp and halibut dishes for our entree. Both of which were beautifully executed! Our wine selection was Far Niente (an excellent wine for those who don't care for overly buttery/ too-heavily-oaked Chardonnay). Instead of dessert, we opted to have Port and Cognac after dinner... ahh... the good life! However, as we were there for a birthday celebration, we did end up njoying a birthday sweet after all! Throughout the evening, our server was very attentive, entertaining, and was a true professional - which sadly, in this day & age is no longer a given (even at this level of restaurant). Since this place is a splurger, we haven't been back yet, but will certainly go again for another special occasion!"], ["Patrick B.", "Surprised my parents for their anniversary. Bentley's did it right. From the maitre d to the managers and sever, these people do it right. From beginning to end. Appetizers, entrees and dessert... WOW! The view from the restaurant is more than enough to keep you coming back. You definitely pay for what you get. Do yourself a favor, save your pennies and go to bentley's even if it is for a drink and dessert."], ["Pourina R.", "One undeniable fact about Bentley's is of course, the the grand view and ambiance. If you get seated next to the window (and please ask for a window seat), you won' t be disappointed. They will seat next to each other to be romanced by Uptown's mesmorizing skyline. When we get to the food and service though, slightly unimpressive.The Valentines day experience had the prefix dinner and a classy lounge band singing some classic slow dance tunes that all age groups would appreciate. When we get down to food and service, I can't really say I was courted ever so eloquently. While the food and service was A-okay, truth be told, they really aren't up to par in comparison to the prime real estate."], ["Joshua C.", "Great staff, judgement free environment! Treated me like a rock star!! I would eat here everyday if I could.  Food is worth every penny."], ["David C.", "Food and service were great,but i made valentines reservations over a week in advance and got sat behind a beam/wall and was disappointed that me and my wife's view  were obstructed,felt like i was in the cheap seats,when we spent the same if not more than others with better seats.other tables were open so don't think it was overbooked."], ["Jessica M.", "Was just here for a wedding, and oh my, was it fun!  What a cool spot for an event!  The food was really great (those shrimp... were HUGE!).  Dinner was heavy hors d'oeurves with a carving station and luckily, we chose a spot right by the shrimp/brie/delicious table.  The view... SPECTACULAR!  And the decor meshed really well with what my friend chose for her theme (although, she IS a wedding planner, so maybe that was on purpose :P)The only reason it didn't get 5 stars is that there was that the waiters kept walking in between our conversation (although, we may have been standing in not such a good spot, but whatever.)  And the dance floor was a little tiny.  Otherwise, though, SPECTACULAR....and way out of my price range, normally, so don't expect an updated review until I win the lottery."], ["Linda K.", "Wow! Bentley's was spot on tonight! This was my second visit and this time I was really impressed. We took family for a special occasion dinner and were really hoping the service and food would be as good as the view. Everything was perfect! They knew we were expecting a table with a view and they delivered. The service was amazing and the food the same. We each had something different and all four dishes were prepared perfectly.  We will be back!"], ["John R.", "This place is very expensive for dinner, but the lunches are very reasonable.  I used to come here for lunch - an extra $3 gets you a lot more than what a sandwich somewhere else will get you."]], "The Fig Tree Restaurant": [["Elle P.", "Can't think of one thing to complain about at our amazing dinner at the Fig Tree last night.  We were celebrating my birthday, and from start to finish, they made it so special!First and foremost, the bottles of wine are so reasonably priced, which was a nice surprise.We started with escargot.  Delicious, and very rich in a gorgonzola cream sauce.  It was just enough.  Be sure to get extra bread for that sauce!We then had our salads.  Both good, nothing to write home about, but solid.I then had the grouper with lobster tail over saffron risotto. It was unbelievable.  Extremely rich but oh so amazing.  The perfect birthday dinner.  My husband had filet mignon, and the meat was so tender you could cut it with a fork.  Both entrees were five star, for sure.We capped off our meal with the biegnets.  We subbed out the coffee gelato for buttermilk gelato and my god, they were unbelievable.  I would go back just for dessert!All in all, service, food, and ambiance were outstanding.  We WILL be back for sure!"], ["Belle D.", "I really like The Fig Tree, I just don't loooove it. Food - My husband and I ordered an apple dish for an appetizer. He was reluctant but I figured it cannot be bad! It was actually good and refreshing to eat. Definitely a great starter before the main show. I ordered the scallop dish in a bed of beluga lentils. They did a great job with the temp of the seafood. It was perfect for me (I do not like them undercooked). I find the lentils very interesting and it complemented the dish. My husband had the lamb and he really loved it.Price - Definitely a pricey place, but you get your money's worth for a $$$ restaurant. Place - Very cozy decor, home feel, but nice restaurant setting. In some areas, I feel it is a little too small or cramped (especially upstairs).  I saw people parked next door where it said do not park..Special - The waiter and staff was kind to personalize your birthday or anniversary on the dessert plate. It makes the occasion/dinner special! Service - Our waiter was nice and attentive. It did take awhile to get our check though.. But ah well. Although our experience at The Fig Tree was good. That's one checked off on places to go have dinner dates in Charlotte. I was just not blown away with the place and venue. I tend to prefer the more modern, upscale restaurant for that price. If you are more of a comfy and homey feel, this place is for you."], ["Katherine C.", "Sometimes you want a nicer meal. Fig Tree is one of my favorite choices in Charlotte. It is a beautiful old home. The service is impeccable. The food is delicious. It is cozy. Not pretentious. We love their cheese plate. The scallops are cooked perfectly. I highly recommend going here."], ["Colby B.", "My fiancé and I went to Fig Tree for dinner the night we got engaged, it was our first time. We have heard so many great things about the restaurant, I, glad we could finally go!We ordered the lobster hush puppies with a black bean purée for a starter, I had the filet and she had the lobster tail served over grouper and saffron risotto with a lobster blanc sauce - AHHHMAZING! We ordered a killer bottle of wine too. Our server was absolutely amazing, very personable but also gave us our space as it was a special night. I wish I could remember his name! We finished off our meal with the beignets, which were to die for!!!!! We can't wait to go back and indulge for our anniversary, this is the best restaurant in Charlotte in our books!"], ["Casey S.", "If it wasn't for the service I would give the food 3 stars. Not sure if I just had too high of expectations but like a previous reviewer said I thought the best part of the meal was my salad. I got the Elk and it was great to try something different. My issue is the sides cabbage and some weird lentil did not compliment the Elk at all. Would of loved some type of potatoes or risotto cake."], ["Kelly K.", "Great date night restaurant. I loved coming here and experiencing the full spectrum of their menu: wine, appetizers, meal and dessert. The atmosphere, service, and food all deserve 5 stars. If you are looking for nice restaurant to have dinner or special place to celebrate, make a reservation @ Fig Tree."], ["Shad C.", "The food is inspired.  I would give them a five star on food.The service and environment were less so for us.The waiter just seemed unengaged.  Normally you expect very friendly and engaged wait staff at a restaurant where it is easy to spend $60-100 a person.We went for our anniversary, it was noted on the reservation, we were put in a room close to the door with a very loud group of people.  None of the staff said a word about a special evening.The place is marked as being dressy and romantic.  A lot of people were there in jeans and polos even on a Saturday night.The food was wonderful and we will go back for it but I will not put it on my places to go for a special occasion.Definitely a place for foodies but not somewhere to have a romantic dinner or quiet conversation."], ["Christine S.", "Amazing food,  excellent service, and quiet atmosphere. One of our favorites so far in Charlotte!  Our waiter David was perfect and his recommendation of the chef special fish that night was spot on."], ["Robert P.", "We wanted to go somewhere special Saturday night and read good things about this place on Yelp. It is a charming old house and the staff is very attentive. They have patio seating available.  We really had  a great time.  My only criticism is the meals are a little pricey for what you get.  The salads were nothing special, I had pasta and my girlfriend had the duck. Her duck was delicious,  my pasta, good."], ["Ava K.", "Cute place with good food. We had the foie gras & escargots to start, which were delicious. Then we had the lamb tenderloin, ny strip, grouper, & veal chop. Finished it up with red velvet cake. Everything was delicious & the service was awesome. Great place for a special occasion."], ["Michele S.", "Outstanding Easy elegance. Great dinner, loved the quail appetizer, wine selection, and wow the Banana Upside Down Cake was out of this world!!!"], ["Lauren Y.", "Fantastic food, top notch service. Pricey but everything we had was excellent (chicken entree, lamb entree, excellent house salads, and beignets for dessert). Such a classy atmosphere too. Highly recommend."], ["Brittany D.", "What a wonderful experience. I was brought here on my birthday and I couldn't be happier. Our server was phenomenal and because I have such a terrible memory, I believe it was Jay or Jason? He took us on the tour through the menu and truly made us feel welcomed and appreciated. The food was also excellent! We had duck and red snapper. Excellent excellent excellent! We will be back!"], ["Caroline K.", "The food was delicious and a great place for an intimate dinner with close friends. Nothing crazy mind glowingly delicious, but I highly recommend if you haven't been. Great for family or in-laws when they come to town."], ["Chrissy M.", "We went to Fig Tree for our anniversary. They did a wonderful job of making it special and pacing the meal so you can enjoy it thoroughly. We were impressed when our appetizer arrived and we were not quite ready to order our entree... The waitress took our menus out of the way so we could enjoy it and then brought them back when we were through. We sat outside on the porch which I highly recommend. It was a very warm day but cooled off (not a ton of sun) by about 7pm. If you plan to arrive by 6 on a week night it will be empty (we were literally the first people there). It gets busier later which adds to the ambience. The feel is quaint and romantic. Our waitress recommended the scallops which my husband ordered and I wish I had, too. I never order scallops and always worry they won't be filling but there were 7 medium sized scallops and they were delicious. The salad was wonderful, too fantastic dressing) and I highly recommend adding the goat cheese. I was pleased with my trout as well. Their wine list is extensive with bottles ranging from $30-$2000. We thoroughly enjoyed our bottle of Walt Blue Jay Pinot Noir.I would give it 5 stars if the feel was a little more up to date (it was a little outdated IMO) but overall our experience was very enjoyable and I would definitely go back."], ["Michael M.", "well prepared and delicious. We we're seated in essentially a private room upstairs. Great date spot."], ["Delon F.", "Not sure where to begin with this restaurant because everything about it was exceptional. The service, the ambiance and especially the food was five star quality. This is a special occasion restaurant for sure and you will not be disappointed when you dine here. My wife and I came here for our anniversary. We had the scallops to start and they were delicious. Even the garden salad was top notch. I highly recommend the veal chops, with shrimp and potatoes. The set up for this meal was perfect. My wife had the swordfish which was the special for the night and she thought it was divine. This is a beautiful restaurant in Charlotte and a must dine for anyone looking for a wonderful night out"], ["Kristin P.", "Great for a special occasion! Amazing wine list and deliciously crafted plates!! Must make a reservation and sitting on the patio is lovely. Restaurant is in a house-turned-restaurant, so it has a fancy but homey feel. I definitely recommend this place to anyone visiting Charlotte!"], ["Carl S.", "So went back to Fig Tree this past weekend, and was inspired to write an update to my last review. We sat upstairs, which had a much better decor/ambiance, and the service was exceptional. The food was great (we had the escargot, lobster/halibut, filet, elk, and Ostrich Carpaccio), and they hit the nail on the head with the various flavors/sauces. We will be returning again for sure."], ["Joshua R.", "A cheese plate featuring 100% water buffalo cheese, elk chops, and the cayenne pepper triple chocolate cheese made for one of the best and most unique Charlotte meals I have ever had. My only criticism, however minor, is the music: \"It's Beginning to Look a lot like Christmas\" and \"Rudolph the Red Nosed Reindeer\" played on a loop can get absolutely maddening through the course of a one hour dinner service. That should not deter you though as The Fig Tree is now in my Charlotte Top 3."], ["Lemuria C.", "My friend took me for my birthday and we both thoroughly enjoyed it. We started with the yellow fin tuna as an appetizer. I had the lamb chops and he had the veal. The lamb was seasoned and cooked perfectly. They serve it with an Israeli Couscous that is delicious and a great accompaniment to the lamb.  Everything was delicious!! And I highly recommend the Beignets for dessert! I felt like I had been temporarily transported to N'awlins!!!The restaurant is in an old house, which gives the place lots of charm and character. They also have a nice wine list and the staff are very friendly and attentive. This is one of the best places in Charlotte to celebrate a special occasion. The ambiance, the food and the service are all excellent. It's one of my favorite dinning experiences in town."], ["Drew K.", "The food is absolutely excellent here. The service is some of the best in the city!! My only complaint is that the lighting is poor in some of the first floor rooms and the tables are a little close together. Ask for a table on the second floor."], ["Nabeel N.", "Great dining experience. I can see this place, with its outdoor patio seating, being a  very romantic dining spot. I however was with 4 other coworkers and had a great dinner. The octopus and cheese appetizer platters were delicious with a local NC cheese being featured. They did have an extensive wine selection - we ended up with a Pinot Noir (not my choice) to pair our main courses. The soup of the day was cauliflower and blue cheese, which was very yummy to the last drop. I ordered the lamb chops and it ended up being the only reason I gave this place 4 out of 5 stars. It was over cooked!The wait staff was excellent. Definitely a place to hit in Charlotte. Make sure to bring a date though ;)"], ["Todd G.", "Great place for a date night or diner party.  I've tried the elk chop and filet mignon.  Both are great."], ["Caroline R.", "Fine dining restaurant feel. My husband and I both ordered the veal. It was...pretty good. Out waiter was awful though. Took forever!!! Thought from the reviews that this place would be great but frankly, I probably won't return."], ["Kristin F.", "Finally, we're finding places in Charlotte we love. It's official- I love Fig Tree. It's very quaint (a cute house) and the service is top-notch. While they were very busy, it's organized as such where you don't feel you're in a crowded restaurant or too close to the other tables. Very intimate setting, little fireplace, lovely bar, beautiful stairway leading to the restrooms upstairs.Make a reservation- we did. We arrived early and were seated at promptly 8:45, our reservation time. Our server was very sweet and knowledgeable, explaining the menu and some of the signature dishes. The bread was divine and went perfectly with the escargot appetizer we ordered, accompanied with mushrooms and a gorgonzola/ garlic sauce. He encouraged us to dip our bread in the sauce, which we did- and oh boy. Heaven in your mouth.I ordered the ahi special (he said it was one of the finest cuts he had seen in a very, very long time) and it was also delicious. It came with a risotto and everything was cooked to perfection.I really love The Fig Tree and am excited to find such a charming spot in Charlotte."], ["Lucinda L.", "As a native Charlottean, I have no idea how I've never been to The Fig Tree. Now that I'm an \"Elizabethan\" I made it a priority to visit. I am impressed. The house is so interesting. I love the bar. The service was first class. The environment is intimate if you want it to be.  All the food was as described on the menu, good quality-lots of flavor. I will absolutely return to The Fig Tree."], ["Jill C.", "Fig Tree was fabulous.  I had the house salad, lobster and grouper.  My husband had the filet.  The wine recommendations were wonderful and I can't say enough about the pear martini!  The portions were substantial and the service, excellent.  The only thing that I would change, is to have some restrooms downstairs, so we can bring our elderly parents for a wonderful, modern and amazing dinner."], ["Paul C.", "Went here for our 11th Wedding Anniversary, and found the house to be very cozy and elegant. I thought I was underdressed in slacks and a Polo shirt until some guys showed up with Jeans by the bar area.Anyway, the food. Started off with a mixed cheese platter, which had a nice selection from Blue, aged sheep, Goat and cream with candied walnuts. Went very well with the nice rosemary bread they served.For appetizers, I had the soup special which was a dark meat roasted chicken and bean soup. Very earthy and flavorful. My wife had the simple garden salad, with spinach and shaved parmesan reggiano. My wife had the NY Strip special, with crab meat and a creamy horseradish. Cooked perfectly and tender. I had the Veal Chop, which was AWESOME! The quality of this meat was very top notch. I mean, when you can snarf down the FAT on a chop you KNOW IT'S GOOD! Melt in your mouth. I even exhibited heathen behavior by gnawing on the Veal Chop Bone....it was that good. Hey they didn't kick me out so there! :-)For dessert we had their famous beignets. They served a generous portion of 4 of these succulent pillows of flavor, coated with Madagascar Cinnamon sugar and some creme anglaise, and some coffee gelato. Very heavenly!Oh, and although I brought in a special bottle of wine from my personal cellar ($20 corkage fee), they do have an excellent wine list, and as others have noted, pretty reasonably priced for the most part. We started off with a Brut French Champagne which was only $7/glass. Not bad for a real FRENCH Champagne.Service was excellent, food was served hot, they were attentive without being annoying. So all in all, this is a top notch place!"], ["Justin M.", "What a food experience!  \"I feel bad for whoever didn't order the Elk\" is what my wife said after her first few bites.  Overall, it was a great experience from the wait staff, the hostesses, the apps to the desserts --- I use my NJ/NY pallet experiences as a benchmark and this Charlotte dining experience is in my top #5!  Our dishes:Raw Oysters- different twist, but good (caveat - we're used to traditional cocktail sauce and fresh horseradish)Carpaccio- deliciously excellent!Octopus- very good; the addition of olives produced a higher salt content than I would have liked, but the various other textures made it very tasty and enjoyableElk Chop- ***** 5 STARS!! My first elk experience and it was fantastic.  The compilation of a flavors including a mustard glaze, marinated shredded cabbage, and horseradish infused gnocchi-esque creation was to die for... Seriously, last meal worthy!Beignets- These just put us in the euphoric state of \"life's worth the stresses as long as we can afford to eat like this\" mood ;)Sugar, fried dough, coffee ice cream over aBed of cinnamon and a lovely dipping sauce.  Topped it off with a French pressed coffee and 10-yr Tawny port.The End.To the Chef/Owner: Bravo!Pros- everything above plus a friendly server, Jennifer, that made it that much better.Cons- ......"], ["Leslie T.", "The food, wine and service are top-notch.You cannot go wrong at The Fig Tree.  It is pricey, but one of those places where the service, food and wine list deserve it.  Great for a romantic evening or dinner with friends.  Or even a stop for a glass of wine on the way home.  Life is short, get the cheese plate..."], ["Melissa D.", "This restaurant is absolutely amazing!! Both the food and the ambience were A++. Immediately after we left I told my husband this was where I wanted to go for our next special occasion. I had lamb chops which were amazing. I tried the dishes the other three people in our party ordered and they were amazing as well! LOVE IT!! Sooo excited to go back!"], ["Curtis S.", "We were sitting at home last week trying to figure out where in the world we could celebrate our 200th Queen City Restaurant Review when all of the sudden... The Fig Tree Restaurant popped into our heads. The Fig Tree has been on our must-hit list for a very long time and an obvious pick for our 200th review.The Fig Tree is located in a 1913 bungalow in Charlotte's Elizabeth neighborhood just minutes from our house. I made reservations online a week prior and left a note requesting our table be somewhere in the house with decent lighting. When we arrived we were seated quickly and at a table at the front of the house with amazing natural light just as the sun was setting.We kicked off the night with a Fig tart with taleggio and prosciutto over a red wine reduction.  It seemed largely inappropriate to order any appetizer not featuring figs while at the Fig Tree Restaurant and without a doubt it was the right decision. The deliciously flaky crust was obviously home made and came topped with a melty and salty cheese that balanced out perfectly with the sweet figs. The red wine reduction added a a great touch of sweetness and fruity tannins to compliment the figs.The Sweet corn chowder with prosciutto come out next and despite being delicious... may have been a little underwhelming also. For the most part it just tasted like a big bowl of fancy cream corn. Im definitely not a chowder expert but if I could offer one suggestion it would be to add some herb crusted roasted potato cubes.I (Ella) got the Grilled New Zealand Elk Chop over smashed finger link potatoes with Smoked Bacon-Braised Purple Cabbage and Boursin Dijon Sauce. It doesn't happen often but I was really excited to see something on a menu that I have never had before. I was expecting it to be gamey kind of like a bigger version of venison, but I was pleasantly surprised by its subtle flavor and tender texture. The dish originally came  with a horseradish spaetzle which went well with the other side items, but I don't particularly like horseradish so I went with the mashed potatoes instead. The mashed potatoes matched nicely with the smokey cabbage and delicious dijon sauce. I really enjoyed everything about this dish and cant wait to try elk again.I (Curtis) got the Grilled Filet Mignon topped with Stilton Cheese and Mushroom Duxelles over a Sweet Corn Polenta Cake with a Veal Demi-Glace and a side of Asparagus. Filet Mignon always leaves me wanting more... more flavor, more meat, more anything. The Stilton cheese was delicious but was countered by the lack luster and not-so-sweet corn polenta cake. The high points to the filet mignon were the euphoric aroma, the plate composition, and the filet was cooked to a perfect medium rare.I (Ella) was very impressed with the dessert menu at Fig Tree. As a pastry chef myself, I get really bored with the same old dessert options that I see on every dessert menu. Luckily for me the desserts on this menu were complex and full of interesting flavors and garnishes. The Dark Chocolate Mousse and Chocolate Glacage over Coffee Crémeux and Almond Shortbread with Coffee Gelato caught my eye for dessert. The chocolate mousse was deliciously light with a dark chocolate bitterness that matched perfectly with the coffee flavors in the cremeux and the gelato. The almonds added a much needed crunch to a very soft dish and the pulled sugar garnish seemed like a halo topping a perfect dessert.Despite some light redicule from my pastry chef partner... I (Curtis) went with the only classic on the menu, the S'mores Cheesecake. Unknown to me the S'mores cheesecake was nothing like the original classic I have come to love over the years, it was way better! It was smaller than normal but the small size packed a very large flavor. The graham cracker base came topped with a very dense cheesecake cube, a micro pond of dark chocolate, several hand made torched marshmallows, and a very adorable chocolate swirly thing. The whole dessert was amazing and a must have for anyone visiting the Fig Tree.The Fig Tree Restaurant lived up to our expectations and despite not falling in love with the Filet Mignon we cant wait to go back. The app was delicious, the entrees were unique, and the desserts were more than memorable."], ["Paul P.", "Great restaurant with an awesome wine list that's reasonably priced.  VERY friendly service with delicious food.  I had the Foie Gras, Caesar salad (perfect portion), Elk and a cheese plate.  Every course was awesome and was perfectly paired with a delicious bottle of Nickel & Nickel cab.  Did I mention they have an extensive wine list (not so big for Italian)?Will definitely go back when in Charlotte and will most likely have the same exact meal (but the lamb, veal and Rib eye were on my target list too)."], ["Lily W.", "Tonight is our 3rd year anniversary and the atmosphere was prefect for our occasion.  The food and service was awesome!  We ordered escargot and fois gras for appetizer, the fois gras was fantastic!  We ordered the elk chop and veal chop!  The veal chop was tender and the elk chop presentation could have been better!  This place is definitely a romantic place and very pricey!"], ["Mark D.", "Food is complex, unpretentious and beautifully executed.  Ambiance is warm and relaxing.  Wine list is deep and has tremendous values - they do not mark up prices the same as most restaurants.  Service is seamless.  Cannot recommend this place enough!"], ["Reid A.", "I love the uniqueness, yet classic approach to this restaurant.  It is set in a beautiful, historic house.  It is a great place for a date.  The dishes were approachable, without feeling pretentious.  The foie gras I had was my first experience and it was awesome.  We had great service - all around, one of the best restaurants in Charlotte."], ["Stephanie T.", "I \"like\" a lot of places, but there are few that I love.  I am happy to say that The Fig Tree is one restaurant that I love!Yes, it's pricy, but worth it for a special occasion.  The food is superior to anything else I've had in Charlotte.  It's not gimmicky or trendy, it's straight forward delicious cuisine with a touch of flair!I did a blog post about my NYE meal which you can read here: theladyolive.com/2014/01…It had been a couple of years since I was lucky enough to be wined and dined at The Fig Tree and I was so excited! The food and service are top notch.One of my favorite appetizers in the apple beggar's purse: flaky pastry filled with gorgonzola and served with apples.  My favorite sweet and salty combination.I've never had anything I didn't love.  The filet I ordered was cooked and seasoned absolutely perfectly.  The wine lists is huge! Definitely a good place to take your wino friends."], ["Jeremy F.", "Got the Elk Chop!  Never had that or seem it on the menu!  The food was great, the wine list is massive!  If you don't go your are stupid!"], ["neal k.", "I couldn't think of one reason to not go back again.  We don't live in Charlotte and love trying new restaurants but we are definitely going back to this one on our next trip. I had the grouper with lobster, their signature dish. It was served on a bed of risotto and peas. The lobster was cooked perfectly and not just doused in the yummy buttery sauce. The roasted garlic puree that came with the bread was delicious as well. The house salad had a beautiful presentation and a simple herb vinaigrette.  Our waiter Devon made the experience even richer, as if that was possible.  He knew everything about every dish and the wines they served. He had professional yet affable demeanor. It showed that the restaurant really puts a lot of hard work in the food they serve and the staff they keep. Strongly recommend this place."]], "Cafe Monte": [["Kevin K.", "I knew I came to the right place with the crowd flowing in on a rainy Saturday afternoon. We were lucky enough to beat most of the crowd and immediately started off with the beignets. Light, flaky, warm - perfect snack as I debate the many options on the menu. I ended up going with the short rib sandwich - the nasty weather left me wanting something warm and rich. This sandwich delivered; tender short rib bathing in provolone alongside sautéd mushrooms and onions with a garlic aioli, topped with arugula to cut through some of that richness. Others at my table ordered the tuna melt, chicken salad, and BLT. All received top compliments.  Service exceeded my expectations, especially for the lunch hours. Our server knew the menu down to each ingredient and made great recommendations. I am looking forward to trying the rest of the menu."], ["Faith D.", "One of my greatest joys in life is eating and trying new restaurants. I'm not sure why it took me so long to get to Cafe Monte, but I finally did and stopped here twice in one week. It's a great atmosphere for Sunday brunch (off the menu) or to meet a colleague over coffee in South Park. The environment is nice, the service is attentive and friendly, and the coffee and food is great! The decor is very French and adorable. Although many people are dressed well because of the neighborhood it's in, I also saw couples that were out for their morning walk or stroll around the neighborhood stop in wearing more casual wear; a place to stop in no matter what you are wearing.They have a cute, casual bar area to grab coffee and a croissant, little cafe tables outside, or a large dining area with booth seating lining the walls or full tables. Great for small and large parties alike. I ordered the Benedict Monte and it was very good. I could only eat half due to its richness in flavor, but that is French food for you. Unless you like that much rich taste, I would recommend ordering a couple items and sharing with your partner to give your taste buds a bit of variety."], ["Vanessa E.", "We were gifted a groupon to Cafe Monte. Ambiance was ideal, no strident music or harsh lighting. Bakery case promised future delights.Grateful for a concise menu, hate to read a book to choose my meal.The warm baguette with butter was so delicious it did not last on the table. Waiter graciously offered another one.Chose beef bourguinon, meat was seasoned well and so tender, only needed a fork to enjoy. Au jus was beefy and could have used some extra bread to 'sop up'. Baby onions were sweet and mushrooms were finely sliced.  Winning dish!!!!My dining companion  chose the roast chicken. Sadly, the herb seasoning did not infuse the meat. Without a sauce, there was nothing to say.Macarons were nuggets of artistry. Enjoyed tremendously. Minus one star since service was polite but we felt 'tolerated',  there was no attempt at engaging in conversation or inquiry about special ocassion. Another table merited a long and involved conversation. A lovely place to enjoy when you tire of the chain restaurant scene."], ["Hania A.", "The croissant and omelet were amazing!  I got the smoked salmon, crab, lobster, tomato, and chives omelet with egg whites and it was very fresh and delicious.  It comes with a choice of bread (I got a croissant...best choice!), fruit, and potatoes.  My husband got the French toast, which I might get that next time because it was so good.  Coffee is awesome too.  I think we will definitely be back soon!"], ["Hashani S.", "2.5  stars We came here for lunch one day after purchasing their LivingSocial deal. Cafe Monte is a cute little eatery with yummy sweet treats and some pretty serious savory eats. It was pretty packed for a weekday. I love how they have incorporated smoked salmon into multiple dishes, yum! We sat down right away, I already knew I wanted the lobster crepes or the salmon Benedict. I ended up going with the lobster while the bf ordered the pepper and sausage pizza. The server was a little pushy on trying to get us to purchase drinks, sides and dessert. She wasn't really my cup of tea as it was very obvious she wasn't interested in LivingSocial customers. Our food took a while to bring out and it was so hard to wait, we were starving. Finally we got our food, my boyfriend thought the pizza looked really weird with the peppers and sausage bunched in the middle instead of evenly distributed throughout. There was also no sauce! Me no likey. My crepes tasted really good but I was not particularly happy about the little bits of lobster shell hidden in my dish. I had to be careful not to crack a crown on a potential piece of shell. I ate my meal since I figured I would have to wait an eternity to get a new dish but had let the waitress know. She wasn't too apologetic nor did she try to find a solution to my problem. I told her to let the chef know to be more careful preparing the shelled seafood from now on. Hopefully my next experience is better. Beware of the lobster crepes!"], ["Bianka M.", "We' We' Cafe Monte'This place is amazing from the service to the ambiance to the food. The only reason I didn't provide them with 5stars is because it's ridiculous to charge $5 for a scoop of ice cream to accommodate a dish that is served hot and typically with ice cream in the perfect world (bread pudding).We visited Cafe Monte for the first time during Queens Fest after riding past on a regular while visiting Whole Food. We were impressed with the staff upon arriving for our reservation and how nice they were and how quickly we were seated even though we were early.The 3 course meal plus a glass of wine went as follows:Salads: I had a tasty arugula salad with grilled peaches atop and my husband had a duck salad that he devoured Main course: I had the scallop risotto and my hubby had the sword fish both were extremely tasty. Dessert: we both had the bread pudding which was amazing and even better with the ice cream that cost $5 for one scoop to share (Really).The wine was tasty as well we were given the house Pinot Grigio and Pinot Noir .Overall we will give them another try and not order ice cream unless it's included with the dessert (-;"], ["Lisa C.", "Enter this bustling corner restaurant decorated in the theme of a French bistro and you will immediately be greeted by the lively music and friendly staff. If you are dining on a weekend you will most likely also be greeted a rather noisy establishment. The ambiance is usually mellow during the week if you are looking for a casual atmosphere. If you are ordering wine I strongly recommend the La Posta Malbec. Why strongly? I don't like Malbec and my boyfriend doesn't like Malbec but one sip of my sister's glass was enough for us both to order our own glass. Ever since the first time we ordered the four cheese fondue we decided to keep it as a staple item for our visits. The cheese has a delicious sharp undertone and the fondue is full of more cheese than will be absorbed by the bread they bring with it. They never seem to bring enough bread with it but we save the tableside bread they bring with dinner service to gluttonously leave no bite of cheese behind.My previous favorite was the seared scallops over mushroom risotto but has since been replaced by the Beef Short Rib Bourguignonne which was phenomenal with a hearty cut of beef so tender no knife was needed. I will definitely be ordering this again!This restaurant was close to a 5 star review but unfortunately on our last visit the beignets that I had absolutely raved over during a brunch visit came out as a burnt dessert. Hopefully on our next visit I will be able to update my review after a perfect dinner service."], ["Candyce B.", "Tres Bien! Hopefully that's right....I'm brushing off my high school French classes....so forgive me in advance. I'd had this place on my radar for a while. And since I finally had a few days off I decided to give them a try. I'm sooooo glad I did! The atmosphere is adorable. I loved the decorations and flowers on the tables, it truly makes you feel a bit fancy. I stopped in for lunch and started with a bellini. That thing was delightful. It packed just the right amount of flavor and liquor and I could have helped myself to a few more. For my meal I went with a classic the croque-monsiuer. It's basically a ham and cheese sandwich on steroids....because it's got so much extra goodness!  There's crispy bread, it's stuffed with ham and cheese and then topped and baked with guyere cheese on top....OMG....seriously I can't tell you how good this sandwich was. I enjoyed every bite! It comes with a side of fries, they weren't my personal favorite a little too \"crispy\" (burnt) but if cooked a little less they'd probably have tasted a little better. But they certainly didn't take anything away from how tasty that damn sandwich was! I figured why not go all the way out and splurge on dessert....so I ordered the beignets. And I did not regret my decision at all. They were by far some of the best I've ever had. My goodness. Basically it was hot sugary goodness in a basket....trust me you will want to give these a try. They are absolutely worth it. I'm ready to go back, I want to try their brunch and other sandwiches and entrees....and I will make it a point to get the beignets EVERY time I'm here."], ["D.J. K.", "This is such a cute brunch spot! I was craving some french toast and Cafe Monte was the closest place with decent ratings. I of course got the brioche french toast with a side of bacon. The french toast itself had 4 very huge and fluffy slices of brioche bread. It was airy and buttery and toasted just enough to get the crust hard, but soft in the middle. Very good for a simple french toast. I also got their coffee and it was delicious. It was a bit strong black, but with a little bit of milk it was perfect. I've noticed most of the customers are older ladies and I think the ambiance caters to that. Would love to come back and try an actual french dish."], ["Bruce K.", "First time here with both my wife *and* my daughter. Smiles and enjoyment all around!Yes, Sunday brunch on a sunny day is going to be busy and we were waiting for every one of the twenty minutes that the hostess said it would be. No fault there.We started off with a plate of beignets, which had the required heavy dusting of powdered sugar and also a small pot of strawberry jam for dipping/scraping. Very hot and very tasty. A nice starter while you look over the menu.For mains, we each went with omelets or the crabcake benedict. Each was a good portion with plenty of filling and lots of hollandaise on the benedict. The hashbrown potato casserole was very yummt and the omelets also came with a small bowl of fresh fruit - blackberries and blueberries and such. Nice.Very good coffee. Cappuccino was very good.Service was good, ambiance was great and the food was very good.We'll be back to Cafe Monte for sure."], ["Kay F.", "Cafe Monte did not disappoint!!!!  I bought a couple of $15 Groupons for breakfast and decided to give them a try.  This is a gem of a restaurant on Fairview.  Forget the Groupons - I will be back monthly for this delectable treat. The music in the background adds the right ambience.  The patio seating is the best.  The French bakery meals remind me of home - New Orleans.  I highly recommend them.  The customer service is by far the best in Charlotte. I had the fruit de mer omelette with smoked salmon, crab, lobster, scallions and tomato.  It also comes with seasonal fruit, Toast with butter and jam, and a potato cake.  I was so excited I even ordered the wild mushroom, goat cheese and arugula pizza to have for lunch later."], ["Caroline M.", "I loved this place! Our waiter Xavier was so nice! If you dont want to spend too much money on wine you can order the bottle of the day for 24 $ and ours was excellent! We had the escargots (delicious, especially if you love garlic). We also had the moules et frites, a must have, specially with their bread! Finally a creme brulee... To die for!"], ["Amy G.", "We had a perfect Sunday brunch from start to finish!  I made the reservations via OpenTable on Saturday night for a 10am Sunday brunch, we woke up earlier than expected and hungry.  It was super easy to update my reservation to 9am using the app.We arrived just before 9am and were warmly welcomed by the hostess.  We were seated right away and our waiter brought us waters.  My husband ordered Benedict Monte and I got Crab Cake Benedict.  I don't like runny eggs so I asked for mine to poached medium-hard.  As surprising as is may be, it is rare for a restaurant to get my eggs right, but Cafe Monte poached them PERFECTLY.  I almost couldn't believe it.  My meal was absolutely divine.  And the small bite of my husband's was very good as well.  We completed the meal with a Nutella crepe and fresh strawberries. One word: YUM!  All the staff we encountered were pleasant, friendly, and helpful.  Our waiter was attentive without being annoying.  Our entire experience was fantastic.  We will be back."], ["Jason L.", "The excellent service was my favorite part of the dining experience.  We had a slight issue with extra charges not being explained when we swapped side dishes, but it was only a matter of a few bucks.The steak fritte was very tasty but the french fries were insane!"], ["Kerri W.", "All I can say is this restaurant is amazing and totally impressive every time I go! Hubby and I went for dinner last night. It was a lovely evening, so we got to sit outside on the patio. Our waiter, Shane, was very attentive and personable!I got the Risotto special that had rich, perfectly seared scallops and lots of fresh vegetables! It was so creamy and savory, I loved every bite! And luckily I brought home leftovers for another enjoyable meal!My husband had the monkfish special which was over potatoes and vegetables. He really liked it as well! Staff is wonderful and the menu is amazing! We are definitely going back and we don't eat out that much!"], ["Jillian H.", "Café MonteBeautiful indoors and out, also beautiful food! I've been here twice before, and I have never been disappointed.Hospitality is not abundant here though. The hostess had no smile and seemed very bored or in a funk (coming from a hostess, you are the very first impression to a guest, so make a good one).Service was also a little slow, but he apologized and did his job. There was no extra conversation, or small talk. He just brought us drinks, food, and the check! I can't really complain about that, it's all servers really need to do, but a little talking and personality would be nice!Overall, great food and atmosphere! I got the open face vegetarian, and it was delicious, as were the fries that came along with it. My dad got the baby spinach salad, very light and tasty! We had the vanilla and pistachio macaroons and those are just so cute and sweet! Love it!"], ["Jennifer H.", "My daughter and I love this place for lunch.  It is so cute.  She loves the nutella crepe and I, the tuna melt.  We both order the pomme frites.  They are the shoestring style that are thing and crispy.  We have also been here for dinner on several occasions and Cafe Monte excels in that are also.  I haven't had anything yet that I didn't like.  Service is always excellent."], ["Mitch K.", "Frustrating and great experience all in one!Sunday.  Probably the worst morning to go out for a meal.  Mob scenes are common and waiting times are long.  We were told 45 minutes, but we wanted to try a meal here so waited.  Come on a weekday other then prime time lunch to avoid the wait.Very European/French in decor.  Nice, cosy, romantic.  Nice bar, plenty of tables and bustling wait staff.Very excellent menu so we started out with an order of beignets (3) and strong, rich care Francais to have time to study the menu.  In a bit ordered a french onion soup and two croques, which are open faced ham and cheese broiled sandwiches found in just about every French or Belgian restaurant.Croque monsieur is just the ham and cheese, the croque madame is with a fried egg on top and a croque Provencal is with sliced tomato on top.  Potatoes were served on the side.We waited a long time.  A really long time.  We asked Daniel J. our server if there was a problem with our order and he came back telling us \"soon.\"  More waiting until the kitchen manager came out to inform us that the kitchen had missed the order, that it was being prepared right now and that there would be no charge at all for our entire order!Well...it came, was excellently done and we were very pleased with the outcome.  So nice to see how a professional restaurant handles mistakes.  They were absolutely professional.That aside, Cafe Monte is a nice place for a lunch or dinner, a date (super place for a first date!) or just to come in for a pastry, cafe &/or drink.Give it a shot."], ["Kieran M.", "Cafe Monte was a good French lunch spot. The prices are a little inflated for the product, but we had a really nice lunch. The Monte Cristo's were not exactly what I had in Paris, but just as good. We may be back here in the next year, but will not seek it out for a lunch spot. Perhaps we will return to try the desserts :)"], ["Sheryl O.", "Wow! What a great experience. Sat outside for Sunday breakfast/brunch, Jennifer was our waitress and she was delightful:) Amazing food. Omellete, toast, quiche, crepes, lattes, americanos...all of it. Nice atmosphere too. We will be coming back!"], ["Stephen C.", "Service was very good      space is quite nice   location is good   food is below average or average at best     frozen potatoes for brunch   terrible coffee    blah blah crab cakes   Really won't go again   Shame    it had promise      was quite busy but that shall pass    to survive needs to step up a lot on all counts    Shame as I like the idea    Best of luck to the owner whom I guess does not eat there for brunch at least and  not drink coffee  SC"], ["Anji N.", "This is still one my favorite places in Charlotte. The food is always delicious and the staff is exceptional. If the beef wellington is on special- definitely try it."], ["Lindsay A.", "This place is awesome. I've always had good food there and the service is always friendly and attentive. I've gone for dinner and brunch and they've both been fabulous. One of my favorite entrees is the chicken and mushroom crepe. It's just delicious and creamy and full of flavor. I had a delicious cappuccino and eggs Benedict for brunch which was also delicious. The restaurant is a little unassuming from the outside, but the inside it adorable, with great big pictures of Europe and a cafe feel. Definitely would recommend to anyone!"], ["Adam W.", "A very traditional French atmosphere and menu. The sandwiches are outstanding but my favorite entree has to be the mussels and make sure you get extra bread to mop up he rest! One of my favorite places to eat in Charlotte!"], ["Anna T.", "Had a great experience here for brunch. They don't advertise it but do have a gluten free menu (that has a lot of options) and it's clear their staff has been trained. The food was delicious-only reason I'm rating 4 stars instead of 5 is because of the prices and a very slow server"], ["Sandy B.", "Gotta love Café Monte, gotta love MONTE (he's so cute). A charming French Bistro, very polite, friendly and professional servers, a lovely atmosphere. Such a nice selection on the menu. Great for weekend brunch, lunch & dinner. The short ribs are sublime as is the Trout Almondine. Salmon is also fab. Love the brunch omelets as well! Qui Qui!!! Oh, and that soft, lovely French music. . . ."], ["Alyssa V.", "I hate to be writing this review after reading many of the other reviews on here and having high expectations for a delicious brunch. Cafe Monte has been on my list of brunch spots for a while and I was really looking forward to a nice meal.My fiancé arrived a little after 10 am on a Sunday. We were fully prepared to have to wait for a table so we put our name in and were told it would be about 20 to 25 minutes. We were offered a spot at the smaller bar/ railing where we could order but it was so tight it didn't seem like a comfortable place to eat so we agreed to just have coffee there. About 15 minutes later we had yet to be served or even approached by a server. Spots opened up at the main bar so we moved there with the hope of finally getting some coffee. Service was still quite slow and many others were served before us. We were holding out for our table so we only ordered coffee and refills were few and far between.After about 45 minutes of waiting for a table we were too hungry to wait anymore and decided to put in our order at the bar. Over an hour after we arrived we were told our table was finally ready but elected to stay at the bar. We ordered the monte Benedict and the fruit de Mar omelet. We were both very disappointed with the lack of flavor and seemingly poor quality of the ingredients. My fiancé stated that his omelet could have come from Denny's. The potato cakes on the side of each dish lacked flavor and the hollandaise sauce on the Benedict was flavorless and arrived to me already congealed. Overall the service and quality of food were both extremely poor. The food was also quite expensive for brunch and there are too many great brunch spots in Charlotte to waste money on bad food."], ["Donna B.", "Just enjoyed an amazing meal.  Excellent service!  Our waiter, Jay, suggested the Duck Confit Salad and Escargot appetizers which both were excellent.  The specials, Beef Wellington and pan fried Grouper equally delicious!  Wonderful atmosphere.  We will be back for more!"], ["Courtney L.", "This used to be my favorite brunch spot (mainly for their Eggs Benedict), but after the last three times I've ordered EB here I'm strongly considering looking somewhere else now. The main issue I've been constantly having is that they over-poach their eggs; the yolk is not runny whatsoever- it'll be of a gelatinous state. Even when I've requested that they be undercooked they'll still come out overdone. Also, their hollandaise sauce has started lacking the vibrant flavor it used to have; now it's close to being bland. The newest issue I experienced today is that they no longer serve a nice, thick slice of Canadian bacon on it... instead they have replaced it with two paper-thin slices of deli-style ham (per side). For around $14 I expect the better quality that they used to serve, not the poor excuse of an Eggs Bene they are now trying to pass off."], ["Mark O.", "Great Ambience! Great good. Service can be slow at times, but everything else makes up for it."], ["Gina P.", "When I walked in, I noticed how warm and inviting the atmosphere was. I checked out the fresh desserts, and my mouth salivated.The menu offered an array of fresh French dishes, including escargot, duck, and crepes. Brian and I split the lobster and crab cakes, along with the mussels and frites (french fries).Our meals were decadent, fresh, and flavorful. The service was superb. The price was extremely modest for the quality of food we received. The portions were generous, and our experience was wonderful.Would I recommend Cafe Monte? Absolutely. If you are in the area, check it out. Bon Appetit!Read more about my experience here: ginapacelli.com/2015/04/…"], ["Leslie M.", "Love this place. The crab cake sandwich and lobster and crab crepe are awesome. My husband loved the herb chicken.  It's a bit pricey but well worth it!"], ["Johnny B.", "I visited with a friend of mine for dinner. We had the Escargot, Risotto and Beef Short Rib Bourguignonne. The escargot were delicious, fragrant with garlic and butter. The risotto was filled with flavor. The short rib itself was a little underwhelming, It lacked seasoning, in contrast to the vegetables that accompanied it, which were sublime. Regardless the best part of the night was our waiter, Jay. He was radiant and always available with suggestions and wit. I would definitely recommend that you give this restaurant a try."], ["Carter O.", "Delightfully surprised as I am not a fan of French cuisine but my wife brought me here and I'll be returning!! Good was great, coffee superb and atmosphere is peaceful. Delightful jewel in the crown of SouthPark!"], ["Inchang Moses S.", "Love this place! It doesn't advertise much and it's not on the side of the road with huge signs. So it took us a while to notice the place, but now that we love the place, my wife and I think that it's actually nice that not 'everybody' knows this place.It's a really wonderful, pretty looking place with an awesome team of people who knows what service is. They know what they have and they know how to make what they have sound delicious. Most importantly, they were patient with us asking if we could get pictures or what the menu was.And the food... I had the Duck Confit. It was great! I usually like the taste but dislike the aftertaste or the flavor some duck dish have. In this case, it was a hit. Out of the ball park! And how about the salmon my wife ordered. It was also delicious. Our drinks were fabulous as well.Lastly, we were lucky and got to hear the wonderful band play some jazz music too. I felt like I was back in Europe. So if you like that kind of atmosphere, and if you like duck and seafood, go check it out. I promise, it won't disappoint."], ["Marcio P.", "This restaurant is tucked in Phillips Place,  next to the Whole Foods, and located on the corner of the building and looks small from the outside, but is spacious on the back.  We went for dinner,  around 8:00, and the place was busy but not packed. The prices are on the expensive side but not terribly expensive. It is a great place for a date or double date. It was supposed to be jazz night but I have not noticed live band, but heard jazz music pumping from the . We started with cheese fondue which was great, not too sour and without aftertaste that grocery store bought fondue leaves.  The bread that accompanies the fondue was superb, wished we could take home some.  We ordered for our plat principal the shrimp risotto and the trout Amandine, both were flavorful and great. I was eyeing the crepes but decided for the trout,  and it didn't disappoint me; I will try the crepes next time. As dessert we ordered the beignettes and came 6 BIG pieces,  enough for 3 to eat. With wine glasses and coffee our bill came out $78, which was worth it, but hoped it would be a little less than that. Definitely returning in the near future for another meal!"], ["Corey Tess T.", "Ooo la laMy two favorite places in Charlotte are French inspired..  Cafe Monte and George's Brasserie. Cafe Monte is great for coffee, pastries, breakfast, lunch and dinner.Quiche Lorraine is awesome. I love that it comes with a small side salad. The perfect low carb meal.The coffee is strong enough for me and that is saying something.I do adore the pastries, but I can't always have them. Booo on calories and sugar.Recently a friend and I popped in for coffee and breakfast while we sat and used the free WiFi to shop for vacation packages...  we still have no found the right vacation, but we did enjoy the meal.You have to try:The quicheThe charcuterieThe crepesThe MacaroonsThey outdoor patio is very cute on sunny days.. very peaceful on weekends because the parking lot is less active."], ["Marie J.", "Great atmosphere but food is not very flavorful. I had a salmon croissant with a side salad and fruit tart for dessert. The fruit tart was not sweet at all and the croissant was loaded with cucumbers, just didn't work on the sandwich. It is also very expensive for the lackluster quality of food. Two meals and a kids meal with two desserts were over $60 after tip and we drank water! If I needed to grab a quick coffee and muffin I'd probably stop in but being the Whole Foods is right next door and offers better tasting food, I doubt I'll be back."], ["Alex M.", "Amazing coffee, lovely staff. Great place to spend a rainy afternoon inside, or sunny day outside on the beautiful patio surrounded by palm trees. Like a mini getaway in the city."], ["Madi B.", "First timer at Cafe Monte for Sunday Brunch and it was amazing. We made a reservation for 12:30, restaurant was very busy. Very bright and light atmosphere, nice French decor. Nice outdoor seating area. Wait staff is awesome, our waiter Frankie was wonderful! Okay on to the food. We started with the beignets, if you don't know what those are they are fried dough balls with powdered sugar and Cafe Monte's beignets were the best I've ever had! Lightly friend and soft on the inside, you can either get three or five to an order. For the entrée my mother got the quiche florentine and a side salad, the quiche was very cheesy but not overly so, and was delicious. My father ordered the quiche lorraine with a side of French fries, both were delicious! I ordered the beef short rib sandwich, which comes on a warm baguette with beef, provolone cheese, and arugula. It was hands down the best sandwich I have ever had! Portions were very generous, prices are very fair, service was very attentive and kind, five stars!!!"]], "Blue Restaurant & Bar": [["Nicole B.", "Came here about 4:30pm looking for a happy hour and some appetizers at the bar. There were people at the bar so of course we sat down at the bar.   Someone could have told us when we first walked in they were not serving food yet.  So we left and then came back because of all the great reviews.  Sat at the bar again and shared some appetizers.  All 3 over prices and all 3 just okay.   Living close to MD i guess it as a mistake on my part to think the crab cake would be anything medicore but saw it was crab and lobster so we gave it shot.   And still disappointed.  This is what we had-Provence style lobster and crab cakes finished with basil oil and a citrus beurre blanc. Provence style lobster and crab cakes finished with basil oil and a citrus beurre blanc. and their were 2 the size of quarters.   Pop and they were down the hatch!   And they were 13.00!  1 star.Next Arrancini-Risotto balls stuffed with pancetta, onions and motz with tomato sauce.  These were bigger and their were 3.   These get 2 stars.  Then last we had the jumbo diver scallops.  Again-2 for 12.95.  And they were just okay.  2 stars.   Lemondrop martini was great!  And serivce was a little slow for an empty bar.   something tells me there is better seafood out there in Charlotte."], ["Swaz F.", "We went here for New Year Eve. This was our second time at Blue and it was just as good as the first time. Impeccable service. Energetic and Chic Ambiance. The Lemon Drop Martini was so good that I had two and I have been known to send it back to the bar if it is not made right.My Butternut Squash was rich, perfectly spices with the right amount of creamy taste. My Pan Roasted Grouper was cooked just right and very fresh but I wasn't overly crazy about how it was spiced. We capped the night by sharing a piece of Chocolate cake and it was delicious.."], ["Adam R.", "Restaurant Week is a double-edged sword.  Restaurants either go all out, trying to impress you enough that you'll come back, or they just kind of schlep through it... and in that case, one must wonder why they even bother participating?Blue definitely falls into the going-all-out category.  I had been there once before for a non-Restaurant-Week meal, and I remember being impressed more by the ambiance than the food.  It's not that the food wasn't good: it just didn't stick in my memory like the swanky interior and live jazz did.When we returned for restaurant week, things were more equalized.  The interior remained swanky, and the jazz remained live, but I certainly remember the food this time.  Instead of making diners choose from a different menu, Blue merely marked certain regular offerings as eligible for RW.  Everything we ordered was delicious, especially the Scottish salmon.  To wash it all down, they make a mean martini.  Mmm mmm.  When you add in a fantastic waitress, what else can you ask for?The only bit that keeps Blue from getting 5 stars is that we had to wait, even though we had a reservation.  I understand with was Restaurant Week and all, so even that is just a minor blip."], ["Shauna C.", "Very RUDE management- we had to wait over an HOUR to get our car out of valet while we watched people leave left and right...we mentioned this to several people - we were offered many excuses to find out in the end that they completely misplaced our CAR! I would have been satisfied if they had offered us a drink- our table spent over $200 on our dinner- we didn't even get an apology...I wrote a letter and everything!The waitstaff was friendly- the meal was ok - nothing special considering Charlotte has plenty of great restaurants . Restaurants have a lot to do with relationships- and they killed mine with this one.  Bottom line the food wasn't THAT good to warrant my return..."], ["Carol K.", "I must have been in a good mood (translated to champagne haze) as every place I went to on this snowy night in Charlotte seemed more fun than the last.  But know we only drank here and didn't eat.Oh well- it's my review and my night and I was having a blast! We stopped in here to grab a drink (or two or three) to listen to some music after dinner at a nearby restaurant. We sat at the bar and immediately found ourselves in the middle of a Catholic high school reunion complete with the football jock, the crazy girls and some pretty bad chocolate cake that the bartender set down in front of us. Fun is where you make it- so we stayed to listen to the band play (my only wish is that the stage area had been a few steps further away) but the band was quite good and we enjoyed the range of music. The place has a contemporary feel with the restaurant on one side and the bar area over to the right. Several drinks later and it was either join into the catholic school reunion or push on to the next place. So push on we did- but not before thinking that this place was OK and might even be better than that on a night where squealing women were not reliving their high school fantasies!"], ["Laura T.", "Dining out is like dating. You can go out once and have no desire to ever go out again. Or you can fall in love and find reason to be back daily. Although I found the menu to offer a nice variety, and the food was well presented, I can't say I was overly blown away by my dinner experience. While Lamar was extremely knowledgeable, and selected a nice wine within our price range, I wasn't particularly tickled by the overall meal. Kind of like a good looking guy that dresses well and says the right things, but is just... blah. My filet was cooked to perfection, and the bite sized nibbles of my friends meals proved to be tasty. The hummus platter offered a nice variety, and Lamar immediately replenished the warm pita bread upon seeing our empty basket. Everything was done properly, up to expectation, with no hassle or complaint to give, yet I walked away with a very average feel. Just like the guy that you have so much in common with, your mom likes, your friends approve, but you're really not that into him. I think there are better fish out in the sea for me than Blue."], ["Brandí M.", "We went to Blue with several friends for Restaurant Week and ordered a couple bottles of wine and the RW menu.  Everyone at the table ordered the Flatbread as an appetizer which was wonderful and flavorful.  I ordered the calamari which was good, but nothing extraordinary. I preferred the flatbread.  Entree was delicious--- I ordered the short ribs and they were absolutely amazing. Everyone else ordered the bison which in my opinion was somewhat blan and again, ordinary.  The short ribs were phenomenal!!!  Dessert was good- not grand. Overall, a nice experience for RW but probably not a frequent one.  Our server, Fergas, was awesome. He was Irish born with a delightful accent and great wine recommendations.  Five stars for service!!!"], ["Merle A.", "Wonderful!  The service and food were spot on.  Try the scallops appetizer and save room for dessert."], ["Ashley V.", "At the LAST min on a Saturday night 6 of us needed a table for dining downtown. Through Open table we were able to get a reservation in 15 min to blue. The table all started off with a beverage my husband and I shared a bottle of meiomi pinot noir which was so good ( one of our friends suggested it). We also had crab cakes, scallops, and a cheese plate for appetizers- all great! I had the wild boar for dinner it was also served with the pork short ribs, I would have preferred if I could have just gotten more of the wild boar, a very tender meat that resembles more of a beef than pork. For dessert we had creme brule, which pretty much no one can mess that up and also a blueberry port that was outstanding! We went well over our budget and be aware that a party of 6 is already charged gratuity. You can eat here for around $35 per person if you want to but you can quickly start adding things up with drinks and other add ons. The wait staff was very helpful and the live music was good when they were playing, it seems the band that night decided they would play 2 songs then go on a 15 min break. Overall a good place to check out."], ["Brad H.", "Possibly one of the best restaurants in the world.  No joke.As someone who travels extensively and entertains clients regularly, I have been blessed with the opportunity to eat at some of the best restaurants in the country.   Blue is the best of the best.The service is top notch.  The servers know the food and the wines and invariably make excellent recommendations.The food is the best I have had anywhere.  Specifically the scallop appetizer, and the gorgonzola filet.  My wife and I go here as often as our budget allows (which, sadly,  is not that often...) and order two of each... every time.Chef Briggs is a mastermind.  We are lucky to have him in Charlotte."], ["Jessica K.", "This might be my new favorite date spot in charlotte. We went on a Wednesday night and as expected, we didn't need reservations. The decor was on point, dimly lit (dark enough to be inviting, and bright enough to read the menu). Our server was very knowledgeable and had wonderful suggestions for wines, appetizers, salads, cheeses and entrees. For the appetizer, try the arrancini (breadcrumb coated risotto balls filled with mozzerella and panccetta and fried) and the scallops are apparently incredible.The cheese selection is in my opinion the best part of the menu, but my beef tenderloin ala blue was the clear winner of the night. I want to go back again just writing this review! My date tried the Pork Milanese with Heirloom Tomatoes, which was very tasty, but very rich. It defintely won points for creativity, but not for eatability (if that makes sense). He ended up not being able to eat most of it, but luckly for him, I was able to share my steak and risotto"], ["Faith D.", "I can definitely see why this place gets busy after 6pm. After a hard day of work, Blue will make all stress take a back seat. I really liked the use of the space and the different seating areas. They created a nice atmosphere and colorful mini floor tiles.The hostess and servers were very welcoming and friendly throughout the entire experience. The wine and appetizers were great! I didn't stay for dinner, but one day I will be back (with some cash to burn)."], ["Mel C.", "We went to Blue for restaurant week and expected great things. We love downtown and this is one of the only restaurants we haven't visited. First I want to say that customer service was fantastic. We had a great waiter who took his time and never rushed us. He gave us wonderful ideas and we would visit again for this alone. However; we were disappointed in the meal itself. For the price you pay we were expecting some bold flavors. I got the chicken expecting it to be seasoned wonderfully. I didn't finish my meal because it was bland. Presentation was beautiful, but I'm not sure I would spend the money we did for the lack of seasoning we got."], ["Kenyell O.", "My wife and I came for an appetizer after a show around 9:30 pm. The ambience with the live music is nice. We sat in the bar area and ordered a pepperoni pizza and arrancini as appetizers. Food was decent but service was pretty shoddy. The small plates they gave us with the silverware literally had crumbs from another meal on it. Hadn't been touched. Smh."], ["Monyk H.", "I took my husband to Blue last week to celebrate his birthday and we both loved it!  The waiter we had was very helpful and proceeded to give us a list of his favorite menu items as soon as we sat down.  His input deemed extremely useful since my husband loved the dish he recommended.We decided to order the cheese platter and were very pleased with it.  Although the cheese that the waiter described as \"stinky cheese\" was pretty mild, it was still pretty flavorful.  The lamb shank that I ordered was cooked perfectly. In fact, it was so perfect that the meat was falling off the bone!  As a disclaimer, I will start by saying that I don't eat pork (I know, I know) but the pork shoulder that my husband ordered was phenomenal!  The risotto that comes with the dish was also fantastic.  It was simple yet very flavorful.The only complaint that I have about this restaurant is its dessert.  We ordered the cake di chocolate and were terribly disappointed by it.  This chocolate cake just falls short.  If you decide to try a dessert at this restaurant, I would definitely recommend that you try something else (especially is you love chocolate)."], ["Chris K.", "If someone rates this less than a 4 then they probably should not be grading a fine dining restaurant.  Blue has an excellent atmosphere that is light and whimsical.  It is formal but not what I would call over the the top.  Do dress nice though!Staff is obviously experienced and they know how to describe a meal properly.  They are also very friendly and make you feel at home.  The variety of food was the ONLY thing keeping me from rating a 5.  Granted, everything sounded very nice and when it came out it was the absolute best quality of that dish that one could expect BUT nothing was out of the box. If you are looking for dishes done the right way with a clean taste and not too much doctoring up, then come to Blue.   Great for a date, business meeting......just not the place you want to go if your pallet is feeling extremely adventurous!"], ["Amber M.", "Went during restuarant week so I'm not sure if the portion that I got was the normal size.  So that's why I give it three stars.  Pros:  Automosphere was nice, and our waitress was amazing, hostess was attentative and made me and my husband feel like we were something fierce...LOL!  Me liked dat!  Bartender was friendly and had great service.  Calamari was great and dessert was awesome.  (loved the wine)Cons: Main course was super salty.  I had the Grouper.  I watched one of the main managers attempt to be elegant and classy with a neighboring tables' wine.  He proceeded to uncork the wine, poured a taste for the head guy to sniff wiff and taste, and then the main manager proceeded to take a wiff of the bottle himself.  I gagged a little.  I've never seen the waiter sniff the bottle of wine that he is pouring.  His nose got a little close to the opening and it just made me gag.  Anywho, not saying that this made it a bad place, but just seeing that kinda made me...well...gag.  Jazz was ok.  More like elevator music.  So..that' is all.  :)"], ["Stephanie T.", "Blue.  Your Friday night just got a lot more exciting! The restaurant was busy, but not jam packed on an impromptu Friday night dinner date.  While we weren't dressed to the nines, they were ok with letting us in!  There is a lot to choose from on the menu, but the way it is divided makes it much more navigable. It is divided into appetizers, mid courses, salads, cheese courses, entrees, and specials.  We began with the Tega Hills bibb lettuce salad with warm duck confit, as well as the Moroccan Kefta meatballs.  The salad was scrumptious.  It was really working that whole sweet and salty thing.  Meatballs were not my pick, but WOW they were good.  Served with a charmoula sauce which is heavy on the garlic, parsley and cumin, in a very good way.Per our waitress' recommendation (who was GREAT by the way), I had the pan seared Australian sea bass.  It was served on top of a diced butternut squash with ginger brown butter.  It was light  yet decadent at the same time.  Our waitress gave great recommendations and was totally enthusiastic about the menu.  I love it when people get as excited about food as me. We really enjoyed our experience and would be back in a flash."], ["Cain P.", "Great place and great atmosphere! I ordered the wild boar dish and it was amazing. So fresh and not gamey at all. I am an avid hunter so I was interested to see their take on this dish. I was very delightfully surprised. I had a great experience there and can not wait for my next excuse to go back. Make sure you call ahead because it gets very busy and it is worth it! They have great live music and the service was great."], ["Kate J.", "Had a great dinner at Blue last week.  A friend wanted to take me out, and picked the place.  The night began with complimentary valet- always a plus in uptown.  We had a reservation and were seated in a comfy booth on Friday night.  We began with the flat bread appetizer- nothing out of the ordinary,  but tasty nonetheless!  Then the bread arrived- the cranberry wheat is delicious.  My entree was the beef tenderloin.  Very good.  My friend went out of the box with the Wild Boar.  I tasted it- first time that I ever had it...it was interesting- but delicious!  I tried 2 of the martinis off the list- both were well mixed.  If you want a nice night out, check out Blue.  There was a soloist playing and it is a nice, intimate date spot."]], "Dandelion Market": [], "Terra": [["Chris A.", "Eat here!!!So I've been to the bar a few times before tonight and the food is always first-class. The service is always great. I always want to come back.We came to Terra tonight to avoid restaurant week and celebrate a birthday. We sat at the 4-top in the bar area. We were sooo looked after. Amazing service. The food was amazing - really amazing. Just the specials were unreal .....Eat here!!"], ["S W.", "Had high hopes but our experience didn't match other reviewers. One in our party ordered the Osso Buco which was tough and chewy instead of the expected fall-off-the-bone tender. To the management's credit, the bad dish was taken away and a different entree was offered. Neither appeared on the bill. Alas, the replacement dish (Veal Saltimbocca) was rather tasteless and one of the two pieces of veal was raw in the center. We guessed that the meat was frozen and, in the rush to get the replacement out, wasn't cooked properly.The Duck Confit was overcooked, but the flavor was excellent.  The fish was well cooked but the dish was under-seasoned and bland. Service was excellent. The first bad plate was handled gracefully and with class. We didn't mention the quality of the replacement. Overall, we wouldn't be in a hurry to go back to Terra."], ["Bryce D.", "I had a great experience. unique cuisine, and great service!"], ["Kevin K.", "Great neighborhood gem with an intimate atmosphere. Everything we ordered was perfect and the specials were fantastic. The scallops were my favorite along with the mushroom fricassee side. The chef greeted us at the door and also checked on us after the meal; great guy with a passion for the food. Service matched the caliber of the food; very knowledgeable servers that have been at Terra for yearsThis is the place to impress your friends and family."], ["Max G.", "Incredibly poor customer service. Made a reservation 3-4 months ahead of time for Valentine's Day. Called about a month later to confirm the reservation. Confirmed. No issues. Called February 10 again to confirm. No reservation. Wait, what now? Apparently our reservation had been lost. At this point every restaurant worth going to is full so it's too late to get an alternate reservation.When I was finally able to get in touch with the management (after 3 phone calls and 1 email) I was told that they were sorry, but there was nothing they could do. I was also told that \"several other people\" had called with this same issue. No attempt was made to reconcile the situation. Not squeezing us in that night, not even such a small gesture as a complimentary app should we choose to come another night. A heartfelt apology wasn't even issued. It was literally the words, \"Sorry, there's nothing I can do.\"At this point I was frustrated. I asked what the gentleman's name was and for his position at the restaurant. \"Why?\" he asked. I told him I wanted to speak with his superior. He answered, \"I am the superior. I'm the owner,\" (still no name given). I asked if he had ever run a restaurant before (in a calm and non-confrontational manner). He literally said, \"That's none of your business.\" Not, \"I'd prefer not to give out that information,\" nor, \"I'm sorry, but I would prefer not to say.\" No. \"That's none of your business.\" And so I asked if his restaurant was in the habit of not making amends when they messed up and ruined people's plans. Admittedly, I did sound snarky, but I wasn't being belligerent. He said, \"It's your word against mine.\" That is verbatim, folks. \"It's your word against mine.\" I laughed (because if I didn't I would shout), and wished him, \"Good luck.\" He replied, \"Good luck,\" as well and hung up.Unfortunately, he's not wrong. He has no incentive whatsoever to make this situation right. It IS my word against his. However, if I EVER spoke to a guest in such a disrespectful manner at the hotel where I used to work I would be fired faster than I could blink. I'm astounded by the lack of customer service knowledge displayed by this owner (if he was indeed the owner; remember, no name was given). Its my word against his. I can only hope that the word of a potential customer is worth more to you, reader, than it was to Terra. EDIT: Perhaps it would be beneficial for this restaurant to not only take reservations over the phone as their website says. Then there would at least be some sort of record so that problems could be more effectively addressed."], ["LD E.", "We were looking for a new place to try for our anniversary. My husband took to Yelp to see what area eateries were earning some high marks and he found Terra.  It's next to a Starbucks tucked away and it's very intimate--we liked that. I think perhaps the ambiance inside could use some warming up--that's the only reason I took off a star. It's not the most inviting place on the inside, but they use very clean linens (that's kind of a pet peeve of mine--I hate paper), so there are definitely points for that.A very friendly gentleman greeted us at the door and seemed genuinely happy we were there. The service was the best I think we've had just about anywhere--before we even thought to ask for something, it was quickly in place (water, fresh napkins and knives, etc.). Our server was friendly, professional, and knowledgeable about the menu. They run a very tight ship--each course was served at the very moment when you began hoping for it to show up.We had salad, apps, entrees, and dessert. I had the Caesar salad. It was slightly warmed with just the right number of anchovies. My husband loved the pear salad, as well. He had escargot (they are very hard to find anymore) and I had the fresh mozzarella and prosciutto. My husband at first thought there was a bit too much pesto on the escargot, but he said it was delicious. The prosciutto was the best I've had since leaving NY--paper think, just salty enough, and buttery.For the entrees, I had the grouper on ravioli with what I think was a Pernod sauce and my husband had the scallops. The portions are not large but with so many courses, we didn't feel cheated. The grouper was a bit overcooked but still tender. The scallops were cooked to perfection and the ravioli must have had truffle or some other mushroom in the filling. They were absolutely incredible. For dessert, we shared a chocolate gelato sundae with fresh fruit and homemade whipped cream.We put great stock in fine service and enjoy it when the staff and chef or owner appreciates that we enjoyed the meal. The same man who greeted us saw us out, shook our hands, and asked us to return. This is the kind of personal touch you want from a small, neighborhood restaurant. The food is simply prepared, fresh, and delicious. We will be back!"], ["Victoria S.", "Fantastic fresh, simply prepared food with an emphasis on local ingredients. Paired with friendly, professional service, Terra is a great place for both a special occasion or just a lovely evening out. Owner is often there and is incredibly kind and generous. Great wine selection also."], ["Bob B.", "(4.1) - An initmate little French (and some Italian) locale tucked away next to a Starbuck's off Providence road in Charlotte, quite authentic with a French owner. The wine list was well curated..we found a nice Loire Valley Cabernet Franc (unbeatable at that price point), and also finished off the meal with a lovely Sauternes. The black grouper (caught fresh from the Atlantic) was the star of the show. The duck confit was good, but the leg was a little on the small side and the brussel sprouts paired with it were not really a match made \"au Paradis\" - that was the only blemish. The apple tart dessert was delivered warm and delectably delightful."], ["Robin C.", "When we arrived at Terra, we were warmly greeted by a  happy, smiling man.  Not sure if he was the owner, manager or chef, but it was as if he was welcoming us into his own home.  And what a lovely, cozy place it is.  The lighting was perfect, and French cafe music played in the background. Our server offered us samples of the wines by glass.  We settled on the montepulciano, which was a bit like a Cabernet Sauvignon.  We were given an amuse-bouche, which was a smoked fish spread on a crostini.  I don't typically eat fish, and It tasted a little fishy to me, so my husband devoured both of our servings.  We were served bread with olive oil and balsamic vinegar.  Very enjoyable, and the server spontaneously brought extra bread.We both ordered the scallops served atop spinach and cheese ravioli.  The presentation was beautiful.  Rare for me to order seafood, but these scallops were perfectly seared and seasoned.  The ravioli needed a bit of salt.  I did note that this restaurant is not too proud to have  salt and pepper shakers on the table.  An appreciated touch.The happy, smiling man who greeted us checked on us to see how we were enjoying our evening.  We were all smiles.  What a charming place."], ["Kern T.", "The Bottom Line: Of the finest meals that I have ever had in Charlotte. I can't even bring myself to hold the broken cappuccino machine against them.We were a party of four that included a meat lovers, a part-time vegetarian and someone who only eats chicken.... Not an easy crowd to please but every course, irrespective of what we ate, was perfection. Quality, flavor, portion size, service - superb.Um, yes, I'll be back."], ["Lindsay A.", "This restaurant is phenomenal. The food was excellent. We had the mussels for an appetizer, I had the fish special with spinach and mushroom ravioli, and finished the an apple tart for dessert. It is a tiny restaurant and a little loud, but the food was top notch and so was the service."], ["William W.", "Went back recently for dinner. I've been a few times before and always wonder why I don't come more often.  Service is always great, the location and decor are intimate without feeling cramped and the food is excellent.  Feels like you are in a European Bistro.  Had the mussels and burrata to start --both always great.  Then I had the veal.  Everyone got something different and nobody was disappointed except I think everyone wanted what everyone else had-- good problem to have.  Highly recommend."], ["Fred F.", "We were privileged to have dinner here to celebrate an important milestone. The food was excellent, the service above average, and all at a great price thanks to a coupon from Living Social. We had the mussels+fries appetizer, both were excellent. Main courses were scallops with spinach ravioli, and veal scallopini. Everything was delicious; our server did a great job. The air conditioning was not working very well but it was otherwise a great evening."], ["Andy K.", "We go here regularly.  Food is always awesome as is the service even if you sit at the bar!  I would have to say the duck and scallops are the best but you really can't go wrong with anything on the menu."], ["Jeachel T.", "I came here for a friends birthday, and off the top, I love a place that knows what they do right! I mean this place doesn't even open until 5pm! So dinner is all they serve... I looked at the menu a head of time cause I am a picky eater, I first ordered the Terra Cesar salad, I must say, the most amazing Cesar I have ever had!! I also order the NY strip streak, it was the biggest NY strip I have ever seen, and it was cooked perfect!! Medium rare how I love it! The service was amazing! My water never got more then half way! The only thing, this may just me being a nag but they have chef special daily which is great, but I wish the waiter would have remembered it or at least wrote it down cause he lost me when he was stumbling to remember the specials... But other then that it was great and the atmosphere was nice quiet and warm!"], ["Elisabeth B.", "Yes this place is beside a Starbucks in that crappy parking lot where no one can figure out where the out is. But, you should ride your bike to get there, or walk or skip. Actually, I recommend biking or skipping because Terra's food is rich and succulent and you will be glad for the exercise after. My dining  partner and I decided to share four appetizers to get the full Terra experience. Our meal began with complimentary bruschetta which was the freshest bruschetta I have ever tasted. I can not even put my finger on what made it so amazing but I wanted ten more. The bread was crusty and fairly standard. I had a great dirty martini with blue cheese stuffed olives (sigh) and my dining partner was recommended a glass of wine which surprising was only $9 when the check came. Not bad for such a ritzy place. We split: Duo de Canard \"Traiteur\" - $12 Duck Pâté and smoked duck breast, served with a truffle honey emulsion. Very smoky and decadent. The smokey flavor of the duck breast was a bit much for me but he loved it. We also shared:     L'Assiette de Charcuterie et de Fromage - $18 Selection of meat and cheese plateLarge and varied- some soft, others semi-soft. Olives, pickles- etc.    Ravioles de Veau au Beurre de Truffe - $12 Homemade veal raviolis, served with a truffle cream sauce.Dramatically increased my waistline. So rich. So creamy. So well done.    Petites Merguez Grillees au Couscous Israelien, à la Menthe Fraiche - $12 Grilled lamb sausages served on bed of Israeli couscous with fresh mintThis wasn't my favorite but my friend cleaned this plate.This was an ample amount for two people to share and be able to sample their unique menu.What an amazing special occasion place. White glove/napkin service 5/5 there. or if you are well-off I would eat here weekly."], ["Martin P.", "This was my first time visiting Terra and was impressed with the service.  The owner was very cordial and the wait staff went out of their way to make us comfortable.  The lamb shank was really good and was reasonably priced.  The restaurant is fairly small so it may be best to go back when its not a holiday."], ["Giannabrie F.", "I am so glad I was told about this place.  It does not get the \"hype\" it deserves but I am sure some of the regulars/locals are happy about that.  It had almost an old world feel inside.  I couldn't quite place the atmosphere....was it old school Charleston?  New Orleans?  Or Europe?  It was quaint, classy and intimate.  The people around me were in bow ties, suits and dresses.  Most of my fellow diners were 50 years old or older.  One of the prior reviews said it felt like going to a rich relatives home for dinner and that was very well stated...I agree.The food was phenomenal.  You know when you are eating things that you normally wouldn't eat but you are really enjoying them that someone has done something extremely well!  That was my experience at Terra.  I was eating fish, veal raviolis, heirloom tomatoes, etc.  Everything I ate was absolutely unreal.  My husband and I absolutely CLEARED our plates.  I don't think we even left any residue.  The desserts we chose were the chocolate mousse and the salted carmel pastry puff...both were scrumptious.  Everything is just so well done.  The flavors are perfect but the quality of food was what truly impressed me.  Everything was fresh and the presentation was done to perfection.  It was truly a culinary dream!  I would go back again and again.  It has a unique feel that I don't think I have seen anywhere else in Charlotte.  Hats off to chef and owner...well done!!!"], ["Shauna C.", "I visited Terra Saturday for dinner and overall I was  impressed though they still have some work to do to earn that 5th star. Food- A complementary seafood salad amuse-bouche started the meal off on a highpoint. It was light, fresh, and extremely tasty. Next we moved on to some  french bread which I found to be disappointingly dry though the olive oil and balsamic were high quality.  The Ravioles de Veau au Beurre de Truffe (homemade veal ravioli with cream sauce) was outstanding! By far some of the best homemade pasta I have ever eaten, the flavors were both delicate and complex. I may purchase two of these as my meal next time! Our main course was the filet and  it  wasn't as memorable unfortunately. The filet had a reduction with cherries in it ( though it didn't mention this on the menu) but the flavor was too sweet for my taste. I opted for garlic mashed potatoes which were very creamy but lacked salt (coming from someone who is a known under-salter this says a lot). The dessert was the main reason for a non-five star review (since the ravioli absolutely earned 5 stars) we had salted caramel ice cream with puffed pastry and apples. It sounds mouthwatering but honestly the caramel was either burned or their was a liquor that wasn't cooked off...I couldn't even eat it though I will say my boyfriend did. Service was excellent - friendly and knowledgeable.  Wine list - only bottle prices are listed, if you drink by the glass you have no idea what you're going to end up with...which was my case. Atmosphere- As others have said it was a bit stark. They need to dim the lights, play some soft music (they were playing something you might find at Azteca) and perhaps make it a little more cozy. I will return for the ravioli because it was THAT good!"], ["Jim A.", "Dining here is a life experience. Thierry and his staff deliver outstanding personable service and quality food. I researched for an appropriate place to celebrate my Daughter's graduation and I kept coming back to Terra.  The Menu is not extensive but the selections are impressive and diverse.I started with the Escargots de Bourgogne, followed by the Lamb Osso Bucco and then finished with the Apple Tart topped with homemade ice cream. I complimented my meal with a nero d'avola. They have a good selection of by-the-glass wines. The Pan Seared Scallops over Risotto, the Duck Confit and Grilled Lamb Sausage were all equally delicious. We did a lot of sharing because it was all too good to keep to ourselves.The waitstaff was available if we needed them, but did not interupt our meal and we were never rushed, which I appreciate.  Chef Owner Thierry Garconnet spent time greeting us and ensuring we were satisfied. He even came over to us as we were leaving to thank us. This type of personal service is rare and welcome.I walked away feeling very good and very satisfied by our experience at Terra. I will definitely be back.Interestingly, I noticed that as intimate as it is, the place was filled with regulars. The staff and owner seemed to know many of them by name. I think it says a lot about a place that has such a devoted following."]], "Fleming's Prime Steakhouse & Wine Bar": []}