{"Akropolis Cafe At Arboretum": [], "Zeitouni Grill": [["Jaymin P.", "One of the best falafel I had tried. Accompanying tabbouleh was really good and fresh too. Why not 5 starts ? Because Pita served was cold. However Upon request they heated in microwave and accomodated us. Babaghanoj had smoky flavor but very close to taste coming out of can. Would pass on that one next time. Overall great stop for quick lunch , go again for falafel"], ["Sydney H.", "Seriously awesome! Being Lebanese it's hard to find good authentic tasting food. This is one of the few that has it!"], ["Josam R.", "It's really tasty.... And I'm glad this place is here. Hummus is great and marinated chicken is fantastic. The only downside is Friday nights - we've been a few times and they've run out of hummus!!! A mediterranean place without hummus is disappointing - but the babbaghanoush is solid and the falafels are also very good. Grape leaves are a little soggy compared to what we loved in little Greece in NYC, but trust me, this place has won our hearts and we hope they stay for a very long time. Excellent baklava for dessert too!!!"], ["Biorunup J.", "Every thing here is like fresh food and smells like authentic Mediterranean food.i have tried shawarma,falafel and Chicken sandwich rap, all are Yummy.Price also reasonable.The last is Baklava sweet. Don't forget too."], ["Dawn M.", "Everything was fresh and delicious. We had several different items and they all were as good or better than what we had in the Middle East!"], ["Joe L.", "The only thing that taste like what it is was the ... Tomatoes....... Everything else tasteless ......don't waste your time and your $$ ... Go somewhere else!"], ["Dawn F.", "Went today for a quick lunch. Everything about this place was awesome! My girlfriend and I were unsure what to get and the guy at the register was very helpful. It had been some time since I had a good gyro so I went with that. I've never had stuffed leaves so I decided to try a side of those. The guy at the register recommended their chicken sandwich, which my friend got along with the side of eggplant. Everything was so fresh and delicious! Looking forward to going again to try something different."], ["Christina J.", "We split two platters (Mixed and Mezza) and the Zataar flatbread, so we could try more things. Things we would get again: ANY of the meats (all cooked perfectly and so flavorful!), the potato harra, the fatoush salad, the hummus, and the tabbouleh. I would skip the Zataar, the Babba Ghanouj and the Falafels. Also, we tried all four types of baklava, and I felt they were all somewhat dry, and butter was an extremely prominent flavor, but the long rolled ones were the best imo. All said and done, we would definitely come back."], ["Catherine R.", "I just wanted to take the time to say how amazing this place is! With the food and superb customer service is what keeps me coming back time after time. All the staff members always have a smile on their face and you can tell they enjoy what they do. My favorite dish here is the chicken gyro platter I always pair it with the outstanding hummus and the fatoush salad. I can't forget my favorite side dish! The potato harra OMG!! If you love Mediterranean food you will love this place!"], ["Beth B.", "Today, was the first day I have ever been refused service! I took my 18 month old daughter to one of our favorite places to have lunch.  We have been here countless times and have always ordered the same thing - chicken kids meal minus the fries and drink but with a side of tabbouleh. Today I was told no we can't do that! I explained we always order the same thing every time was told, No! The manager looked right at me and said NO, then hung his head down and wouldn't look at me. He didn't offer any solution! He could of said well I am sorry but we can do that but we can... Or we can but its going to cost a little more, just a flat at No we can't to that! I waited for a solution, but he was unresponsive. Total lack of customer service and no healthy options for children! Only fries as a side for kids - I am sure in Lebanon they don't just give fries to kids.  Restaurants should offer healthy options or substitutions for kids not just unhealthy fries. To be blunt parsley, tomato, onions, mint &  bulgar is not pricey! My 18 month old loves tabbouleh, kibbeh, falafel, & hummus.  After we were refused service we went over to the Kabob Grill in Ballantyne and they gladly served my 18 month old chicken and tabbouleh,  (subbing the fries) no questions asked. The server even commented how well she ate. Needless to say we will not be returning to the restaurant due to the extremely RUDE service and lack of management skills.  I recommend you check out the Kabob Grill in Ballantyne or Dilworth. There is also a wonderful Arabic restaurant in Matthews Kabab the owner is from Beirut and is very customer service orientated."], ["Rob J.", "Awesome experience. Maybe the best falafel I've ever tasted. Highly recommended the Mezza so you can try it all."], ["John C.", "Our family favorite Mediterranean Rest. You cannot go wrong with the entire menu. The Gyro meat is so moist and tasty. Their dolma  (stuffed grape leaves) is very good."], ["Brian A.", "The best falafel and hummus I've had outside of Turkey (the country that is)!I'd love to expound on all the wonderful flavors and how their decore is this or that...but simply...the food is great and exactly what it should taste like.If you care about the ambiance and whether it's worth a 40 minute drive or not, defer to the other reviews.  The falafel sandwich alone gets five stars from me.I do know this:  If I'm in the area, I'd be hard-pressed to choose another location for lunch."], ["Carol R.", "Very good. Great choice and the Lebanese beer was a plus. I never take the time to rate anything but the food compelled me."], ["Victoria W.", "This is definitely the best middle eastern place in Charlotte. It is very fast, the service is excellent, they make great use of seating in this restaurant and best of all, TRULY AUTHENTIC. My falafel wrap was served warm in a foil, inside it is filled with hearty falafel, veggies and amazing tahini sauce. The stuffed grape leaves I ordered were just perfect, not too sour, just the right amount of oil and very great stuffing that makes me want to call this place a home. Overall this place is great because:1. Committed family business2. passion for great authentic middle eastern food3. very quick service4. friendly and knows how to do business right!5. Fair prices for amazing food!This place resembles everything that embodies a restaurant with a sound business model, bravo!"], ["Brian E.", "I haven't tasted the food yet but being on hold for 10 minutes and walking in and seeing no one in line and the phone lying down isn't a good start.  Then giving me a side order rather appetizer order of grape leaves didn't help.  Well then rather than up charging the price difference I was charged for another side.  Food may be great but don't need heartburn before the meal."], ["Kelli S.", "Um...YUM! Haven't had a gyro in years and I never remember them tasting sooo gooood! Cant wait to try other things on the menu.  I will be back!"], ["Margaret B.", "This little place next to Earth Fare in Ballantyne holds hidden treasures, specifically the best baba ghanouj (smoky eggplant dip) and other freshly made Lebanese food. I came during the lunch rush, but was able to get a high top table without trouble. There was a line to order, but never longer than a few people. Longer was the wait for the food - 10 to 15 minutes. It's not fast food but well worth the wait for such high quality food. Service was given with a smile and quite efficient. The baba ghanouj was smoky, creamy, with tender pieces of eggplant and wonderful notes of herbs, lemon, and olive oil. Personally I favor Greek pita bread over Lebanese, but it was a great vehicle for this delicious dip. The chicken gyros sandwich was perfectly prepared, tender and juicy chicken, with a fabulously fresh tzaziki (yogurt and garlic sauce), and just amazing. I swear I was licking my fingers! (One advantage to eating alone.). I'm seriously considering ordering more to take home for dinner!!"], ["Nicole T.", "Have eaten here twice now for lunch.  Both times had the lamb gyro - which is pretty good.  It's not too big, so perfect size for lunch.  The taziki sauce is a touch on the sour side for my liking, however, the ingredients are fresh and the staff is very friendly and prompt.  The hummus and pita was disappointing.  Paid for extra pita as 4 triangles are never enough!  However, they don't toast or warm the pita when served with hummus.  (The gyro pita IS warmed/toasted)  This ruined it for me.  Can't even tell you if the hummus was good as they lost me on the cold pita.  Eager to go back as the kabobs and salad look awesome!"], ["David T.", "Really good food but service can be aggravatingly slow especially on weeknights when they have less staff.  I would probably go more often if service was more organized."], ["Norry H.", "This place cooks to your order (even the Lebanese coffee1) and you will have to wait for 10 minutes or longer but I assure you, you will definitely feel it's worth the wait. My favorite here is shish Tawooq Platter with two sides (Tabbouleh & Babba Ghanouj). The skewered chicken is so flavorful, Tabbouleh is so fresh and babba ghanouj so delicious! It's a wonderful and perfect meal!"], ["Scott C.", "My wife and I went there for the first time in Friday night. The food was inexpensive and very good. Not the best ambiance, but we didn't mind"], ["Claudia S.", "Great food! Everything I have had tasted great and fresh. Reasonable prices for a great quality!"], ["R L.", "Great Lebanese food was the last thing I expected to find in Charlotte but Zeitouni is definitely a gem. Their food is always fresh, and their chicken kabobs are grilled to perfection, lightly charred on the outside and moist in the middle. Their Gyros are the best I've ever had. They come fully loaded with pieces of shaved beef and lamb,  diced tomatoes and the greatest tasting tzatziki sauce to ever cover this middle eastern taco. Everything  seems to be made in house, hence the freshness. Therefore, depending on how busy they are; expect to wait anywhere from 10 to 20 min to get your food. It's worth the wait. The food quality and flavors here blow Zoe's kitchen out of the water any day."], ["JJ G.", "I had been asking the Mr if we could come here for quite a while. During a foray into the adjacent Dippin Dots, I saw people filing into this joint and thought it was worth a yelpy lookup. It has deservedly acquired four and a half stars from the yelp community and here's why:* Education: They take the time to explain the meat/entree offerings in a way that doesn't demean, but offers insight into which you might prefer. You can also see the skewers of meat right in front of you in a visually *enticing* cooler. They also have detailed explanations of all those tongue-twisting Mediterranean food descriptors, e.g. shawarma, fatoush, tabbouleh...* Variety: Please note that vegetarians can actually grow both fat and happy here. From a simple hummus to lumps of perfectly crispy falafel or perhaps baba ganoush, eat your fill. As I didn't sample the meat options (we all know why), I had to depend on the Mr's refined palate, which suggests that the chicken skewers are the way to go. They also serve Lebanese beer and wine. Cheers!* Atmosphere: It's Mediterranean quick-casual. FINALLY. You don't have to go somewhere promising Friday night belly dancing in order to partake in this savory, fresh fare. I, whose belly will remain shirted, am delighted about the atmosphere. Nothing at all fancy here. Simple plates, self-serve soda/tea fountain, friendly staff (who recognized us when we returned only two days after our initial visit).* Food: Delicious. An excellent choice for a Ballantyne-area lunch or quick dinner that won't leave you feeling bloated and ready for a nap. Great value as well. I'll probably not order falafel anywhere else, because my poor, spoiled taste buds would likely revolt.All in all, this spot is definitely worth a visit. If you live in the area, it's an added bonus. No frills, just great Mediterranean food. Enjoy!"], ["Mark W.", "So, I'm from Detroit originally.  Among other things, Detroit is home to more people of Middle Eastern descent than perhaps anywhere else in North America.  As a result, Detroit also a wide array of great Middle Eastern restaurants.So one could imagine how disappointing it was to land in Charlotte 5 years ago only to find there weren't any really good Middle Eastern restaurants.  (Or if there were, they certainly weren't anywhere near me.)I had the opportunity to try Zeitouni last week.  Would have loved for this to be more of a sit-down, waiter service place where I could comfortably stay for a while in a booth and have rounds of food brought to me.  But no big deal.  Ordering at the counter was easy and the staff was friendly.  The food is prepared right in front of your eyes so you can see that it is made to order and fresh.  My meal took maybe 10 minutes and was hot, fresh and...DELICIOUS!I ordered a falafel sandwich combo that included a drink and a side of hummus.  In addition I ordered a greek salad.  The falafel was cooked to perfection. Not mushy or overdone.  Simply perfect.  And the tanhini was applied judiciously, adding some nice nutty flavor to the dish without dripping all over my hands.  The hummus was rich and creamy (perhaps not as much garlic as I like), but just so FRESH.  And the salad was great.  An abundance of crumbled feta cheese and a really wonderful dressing on top of fresh lettuce and green pepper.  I will definitely be back."], ["Bob F.", "Everything here is fantastic. The menu is diverse, reasonably priced, and down right tasty. My parents hail from the Middle East and this is authentic. My Lebanese grandmother would have loved this place. Their hummus is excellent, the grilled kabobs delightful, by my personal favorite is the falafel. Perfectly crispy on the outside and moist on the inside with fresh toppings. I highly recommend you try this little gem."], ["Craig L.", "I was looking forward to trying this place but was disappointed. I ordered a Gyro and it was 90% lettuce.  Maybe next time I'll try a platter but not in a hurry to go back"], ["Sam A.", "Great restaurant, super good food. Very friendly service, this place is as clean as it gets and their sanitation grade is 99.5 I really don't think it can get any higher. Keep  up the great taste Zeitouni!!!!!!!!"], ["George R.", "After driving way out of my way to try this \"restaurant\" I was disappointed to find instead a lunch counter located in a generic store-front space of a generic strip mall with a wide open, panoramic view on two whole walls of ... the freaking parking lot! To boot it was a rainy day which made the locale even more depressing. This place doesn't even have the charm of a dive because like much of Charlotte it's all brand spanking new. The choices on the menu were limited, we ordered a few of our usual. The food was very good, as good as can expected for this type of place. I thought the prices were maybe a little high (for the venue) but not too bad. The service was unexpectedly slow but very friendly, we weren't in a hurry anyway. I'm deducting one star for the fast food cafeteria dining experience. My constructive criticism of the day : get some window treatment, such as cafe curtains. Neither the view of the parking lot nor of the counter are much fun."], ["Chintan S.", "Food is awesome. They have lots of choice. I love their falafel and Baklava. I suggest to try baklava."], ["Michael T.", "If there was a way to put a zero I would. I ordered felafel and a drink. 25 minutes later after several other customers after me got their orders I am still waiting. I finally asked for a refund. Was told it would be ready in 3 more minutes. I make my own felafel a lot. It doesn't take 30 minutes. The worst part is that they were totally indifferent. No apology, very unprofessional. Was my first visit there and definitely my last."], ["Howard K.", "Unpretentious Mediterranean food that is simply great."], ["Karina S.", "Great place , healthy food, chicken was awesome .  The reviews are right on point .  Awesome restaurant for a quick and super good light meal."], ["Cat R.", "My husband has been jonesing for Zeitouni ever since he started reading the reviews here on Yelp. We went a couple of weeks ago on a weeknight, and I have to say, I'm impressed.Having traveled to Italy and Greece, we are not strangers to Mediterranean food. Still, it was refreshing to have one of the young men in the restaurant meet our eyes as soon as we walked in, and ask if we'd like an explanation of their menu. He took us over to the case and showed us their kabobs, as well as their sides. He explained how we could order the different combinations, and then left us to confer amongst ourselves.We each ordered a platter. I ordered the chicken kabobs, my husband ordered the trio of kabobs. We ordered different sides in order to sample them all: hummus for me, babba ghanouj for my husband.We sat down to wait at a table, and after a few minutes they brought out our orders. Interestingly, our kabobs came with the wrong sides on the plates, but frankly this wasn't an issue since we were just doing a big old taste test of everything we could get.An older gentleman (perhaps the owner?) came by to present me with a garlic aioli sort of dip for the chicken. It was DELICIOUS and so garlicky! We asked for more, and asked what they called it. \"Chicken sauce,\" he said, with a laugh as he gave away the secret recipe of garlic and fresh mayonnaise. I don't care how simple it was, I loved it.The food was fresh and delicious. The staff was smiling and friendly. I couldn't ask for more from a restaurant. Well - maybe if it was sit down service with menus, but I won't dock them for that. Zeitouni is what it is - a counter service restaurant. Their food shines beyond \"counter service\" which implies almost a fast food style. Zeitouni is not \"fast food\" in my opinion. It's delicious, flavorful and fresh, designed to be savored. So it's a bit of a disconnect, but I forgive them for that because well, if you taste this food, you'd forgive just about anything else.My recommendation for dining at Zeitouni is that you call ahead and order delicious meals to enjoy in your home. If you're looking for a tasty and fresh lunch, or out for a quick dinner, it's an okay place ambiance-wise, in which to enjoy it, but the fast food feel might turn you off for a date night out. Regardless of how you enjoy their food, it is amazingly delicious food that is meant to be enjoyed. We'll be back again and again, but likely with a carryout bag to savor in our home. Zeitouni's food, and it's staff are elevated far beyond the atmosphere you'll find when you walk in."], ["Travis W.", "Nestled in a strip mall you might overlook this place.  I had the chance to stop in yesterday to try it out and I wasn't dissapointed (completely).  Upon walking in I got the sense this place is popular based on the number of people in line and waiting for food.That was probably the biggest drawback, the wait.  But the chicken I added to my greek salad needed time to cook I suppose so that was ok.  They did mess up my buddy's order so that wasn't exactly a good thing though.  My salad was great, fresh and cheaply priced in my opinion.If you're coming in here for the atmosphere or the interior feel, you may, no you will be dissapointed.  I took my order to go."], ["Julia M.", "I love good middle eastern food. I have only eaten here once, and found the food to be very good on that visit.  This is a casual place where you walk up to the register and place your order. Then you take a seat and they bring your food to your table. I ordered a vegetarian platter with hummus, potatoes harra, falafel, and salad. Everything was spot-on. I thought it was a good value for the money. Looking forward to my next visit."], ["Carol Z.", "Amazing food. You have to try this place. The falafel platter was cooked to perfection. The chicken shawarma was full of flavor.  For dessert, the baklava is not overly sweet."], ["Kylie C.", "Great food! I'd rather drive all the way to ballantyne to get Greek food here than eat at Zoe's kitchen down the street. It's very fresh!"], ["Rod O.", "OPEN Kitchen!  Consistently Good Food and Always Great Service!One of the things I LOVE most about this place is they have always allowed a simple substitution!  Listen yelpers:  Do you really want rice with that!???  No! ! !  Get something GOOD!  Potatoes Hara is my suggestion or maybe you could have an original thought, NO don't do that, copy me, PLEASE Copy Me and ask nicely : \"would you please substitute the Rice for Potatoes Hara\"?  You will not have to drop my name... They know me as Matt (not Super Drew, just Matt and not Just Matt... Matt... Matt who likes Hat (s)K!I have eaten almost everything on the menu and I have eaten almost all of it twice.  Wraps are Good, Kabobs are BETTER!!! Fattoush was A-OK better than many!Tabouleh has been prepared to order each time.  I have heard that it is better (proper) to have it this way, as opposed to pre-made.All the Desserts are Good or Better... get the Baklava! Lebanese Coffee, they say (like Turkish Coffee with Cardamom).  So it is Better than \"Turkish Coffee\", because I like the Cardamom (Might make a List about it)... Since this is MY review I do not need to say \"it is my opinion\" this is MY Review!   It takes me about 6 hours to drink one serving (you get TWO) and I can not spell anythij for the rest of the day... My Doctor said it is common, though not as common, which is a GREAT way to say Rod0, you are a weirdo, hmmm, ok, I'll take that as a compliment!"], ["Nycole C.", "After hearing all of the amazing reviews I finally tried this place. I wasn't surprised that it was good. It was awesome! I am a huge fan of Mediterranean and middle eastern food and Zeitouni has to be my favorite. We had the gyro and shawarma and both were fantastic!! The gyro was the best ever!!! The staff are very friendly as well and always have smiles on their faces! I love this place and I am so happy that it so close to my house :)"], ["L. T.", "Yummy, yummy, yummy!  The shawarma was delicious, and the baba ghanoush was simple and satisfying.  We were originally supposed to go to another restaurant in the same area, but we saw Zeitouni and thought, \"Ooh, that looks good!\"  And it was, my friend!  The people were very friendly, and came by twice to see if we were enjoying the food.  It's a little restaurant with BIG taste!Can't wait to try the falafel.  I haven't had a good falafel since we left Raleigh!"], ["Genea S.", "Most delicious Mediterranean food in Charlotte. No ambiance, so perhaps not the best place for \"date night\" but everything is flavorful. I love eating the vegetarian mezza platter, even though I'm not a vegetarian. Truly it's more of a take out or lunch with colleagues ambiance but The food is DELISH"], ["Mindy H.", "Good Mediterranean food.  Hummus was excellent.  Chicken Kabob was full of flavor.  Gyro tasted incredible.   Small restaurant with not a lot of seating but well worth checking out and when you are in the mood for middle eastern food - this is a solid choice.   Will definitely check out the grape leaves and Hanna the next visit."], ["Muhammad A.", "I can't bring myself to give Zeitouni 5 stars... I've lived in bigger cities and have simply had better Middle Eastern food.  With that said, I eat lunch here 1-2 times a week and I've been told I'm their most regular customer.You just can't get better food for this price, not in Ballantyne.  Consider the fact that Chick-fil-A and other fast food costs about the same.  Not only that, but this place is pretty healthy which is another reason why I eat here so frequently.  Most of the food is grilled and made of quality meats and ingredients.  Favorite Lunch Items:1.  Kefta Sandwich2.  Chicken Gyro Sandwich3,  Shish Kabab SandwichI typically go for hummus with meditterean meals but Zeitouni's is nothing special.  The hand-made french fries, however, are pretty awesome.Recommendation:  Make a \"real gyro\", which I have yet to find in Charlotte.  I'm a huge fan when this is done right and the only way is to use a vertical rotisserie -which I understand is an issue considering Charlotte's stringent sanitary ratings.  I just hate it when places use frozen meat, which I'll admit you don't do with any other items.  This is what holds me back from rating Zeitouni 5 stars.  Honestly, as a business decision I don't know that I would considering how popular the restaurant already is and the previously mentioned sanitary issue."], ["Kristina H.", "Oh, hello there some-of-the-best-food-I've-ever-had. I've not had very much experience with Mediterranean food, but I'm pretty sure this is as good as it gets. My boyfriend found the place (major props to him!) and we both had the Shish Tawooq; a platter with rice, two skewers of chicken and your choice of two sides. I had hummus and tabbouleh. It was $10, took maybe 10 minutes, and it was amazing. I can't wait to go back and try something new!"], ["Ginger A.", "The kabob was absolutely delish!!!  Very impressed with the food quality.  I had chicken kabob, basmati rice and baba gonoush... Along with some grape leaves.  I definitely recommend this spot if you love middle eastern cuisine."], ["Chad E.", "After reading other reviews on Zeitouni, we made a special trip to check out the place. In fact, it was on my list for quite a while since it isn't in my typical neck of the woods.Upon entering, the owner (I think?) greeted us warmly, which is always a good sign. After a somewhat reasonable wait, the food was brought to the table, and it was a solid offering, but I can't say that we'll be making a trip out of our way again. It isn't that it was bad, exactly - it just wasn't worth the drive.Had the service of all employees (there were three, I think) been as friendly as the owner, it would have been better. Had the food been as good as the owner was friendly, it would have been better. As it was, it was just decent."], ["C R.", "Quick, delicious, and fairly authentic middle eastern food. It's a good quick spot for lunch!"], ["Fareeda S.", "Great, authentic arabic food.  We got the shwarma & mixed platter.  Both were super good.  Friendly service & the waitress explained each thing on the menu (even though we are pretty familiar with arabic food). :-)Will definitely be coming here more frequently."], ["Michael a.", "Very good Mediterranean fare. Very flavorful and authentic. A small family run spot that clearly cares about quality. Worth a stop."], ["Lester Z.", "I've been eating here since March 2013 until December 2013. This place is soooo good! Yummy food and they remember my name. :DI've been eating at their place everyday. :)Food is fresh. Salads are great. Service is awesome. Everyone I talk to, I tell them about this place and that they should go. :)"], ["John C.", "Great prices and great execution. A solo friendly cook/server/owner? was taking care of all the guest and to go orders. Impressive. The decor could use a face lift and the color on the menus was less appealing, but that didn't matter compared to the taste of the food."], ["Nicole V.", "Very authentic and family operated! Some of the best Mediterranean I've ever had! Highly recommend a visit!"], ["Michelle B.", "I stopped in after work, around 6pm on a Friday. I was worried after hearing about how busy it always is, but I was able to go right up to the counter and order. I decided on the falafel platter which included a choice of hummus or babba ghanouj and a choice of a salad with olives and feta, fatoush or tabbouleh. The hummus was perfect. It comes with 3 pita diamonds and when that runs out, the falafel is pretty tasty dipped in it. The tahini sauce on top of the falafal tasted really great and helped keep them moist. Overall, it was the best falafal I've found in Charlotte. They wear their Yelp best of sticker, well!!"], ["John H.", "Absolutely fantastic falafel. That is the whole reason to come here. I would even put it ahead of La Shish Kabob. Very affordable and so good. Highly recommended. Tabouleh and Shawarma are good too. Service isn't always great. Don't expect a smile from certain people. However, the owner is incredibly nice. Easy parking. Music can be a little annoying. Not great atmosphere either. Better for take out."], ["Claudine S.", "Yum, yum, yummy! What a gem this place is. I haven't been to the establishment yet, but this review is for the take out. My parental units dined in and called to ask if I'd like some grub - hell yah! I had the Shish Tawoowq platter with a side of babba ghanouj. The rice was incredibly fluffy and full of flavor, the chicken was perfectly grilled and tender and the babba was delish, wait it was Delish - with a capital D! They were able to get the bitterness out of the eggplant and it was extra creamy. The portion was huge, I was able to have left overs for lunch - there is a bargain in its self. Places like this is allowing me to have faith in the flavors of the QC -- we may never have an authentic Mexican restaurant, but here my friends you will find the real deal."], ["Tracey W.", "Very good, very fresh, very clean, very friendly.  But take note - this is just a lunch counter-type place.My first impression of Zeitouni is a good one, they have a good basis of food.  Now, they need to work on the atmosphere just a bit.I could eat there often; it looks like a great variety of more healthy and more indulgent items; it would be hard to get 'fatigue'.I wasn't hungry enough to sample a platter, so I only had the falafel appetizer. Their recipe is excellent, and the item was nicely presented with some pita, tomato and sauce.  My lunch mate offered a stuffed grape leaf to me as well.  The dolmas are warm here, which was not expected and the filling is creamy and soft (a little mushy for my liking). Everything was well-seasoned.I will definitely go back and try more at this no-frills eatery."], ["Jennifer C.", "My husband and i have been eating here since it opened. The food is excellent and has remained consistently excellent. It's our standby for fast, wonderful, healthy food. Our favorite is the vegetarian platter-- excellent falafel and taboulleh.The family that owns and runs it is wonderful, too."], ["Chow N.", "Tired of BBQ while in NC?  How about some kebabs, falafel, hummus, and stir fried potatoes?The chicken kebabs are really tender and moist here.  Served over a bed of rice, a choice of salad, and another side for the platter.  Saw another table had the gyro with fries.  Looked really good.Only regret is not ordering the Lebanese beer to go with the grub."]], "Kabob Grill": [["Lisa I.", "Our family came to visit from the Middle East and we were looking forward to having a wonderful meal and wonderful service.Unfortunately, the red head Russian waitress provided very poor customer service...service without a smile....just saying...even McDonald's always provided service with a smile.To be honest, the Hummus and the Coke were the best things on the table.The Pita bread was horrible...like it was purchased from Harris Teeter.Our guests and our kids left hungry...and our kids had 3 plates from the kids meal...Never going back and will let our family and friends think twice about this place...seriously..."], ["Ramya M.", "Every city has a solid, reasonably priced middle eastern food place. Kabob grill is this place for Charlotte. The people who work here are wonderful, the food is delicious, the ambiance is great, and it won't break your wallet. The standard falafel bar that all middle eastern places must meet to be acceptable is met and then some. Bonus points for halloumi cheese and Turkish coffee. Kabob grill is never a regret"], ["JJ G.", "When I'm hungry for Mediterranean food in the Dilworth area, Kabob Grill is on my list. With super fresh ingredients and delicious vegetarian fare, it's definitely an easy choice for the Mr and me.I usually order the vegetarian combo, which includes items such as tabbouleh, hummus, falafel, potato harra, Omar's salad, or a plethora of other choices.The Mr goes with the Chicken Shawarma Wrap and devours it so quickly I can't even get a good look at it!So why only 3 stars?The hummus is pretty boring. The prices are inflated for dinner. For reference, at Kabob Grill, a vegetarian plate and chicken shawarma wrap cost us $24 for takeout before a tip; no drinks or extras included. I have had similar meals that cost significantly less at other Mediterranean restaurants.I know it's a mainstay, and I appreciate its convenience to our home. But I wish there were a little more love put into some of the dishes...and that they didn't charge so much."], ["Jessi J.", "This was my first time here and I was very happy with my food! I had the chicken kabobs with a side of hummus and falafel. All great! The service on the other hand was very minimalistic. The waitresses did their jobs but there were no smiles and they stood away from the table speaking very quietly. A bit awkward really. Other than that, the food was great and when it comes down to it, as long as the food is good and the service isn't terribly rude and un equipped then I will most likely return."], ["Kimberly W.", "Halloumi halloumi halloumi!  I go here whenever I am craving halloumi - one of the few places in Charlotte to find it.  It is a great quick lunch spot, but not a place I would go for dinner.  A tiny bit pricy and service is basic, but I can deal with that for halloumi."], ["Eric T.", "This little hole-in-the-wall has exceptional food. Perfect for a date. I bet I've eaten here a half-dozen times and the quality has always been consistent. Not ideal for bigger parties, as there are only a few tables that seat more than four. In fact, most of the tables are for two, but you can get away with squeezing a third person in there if you like to cozy up with your dinner guests. Outside of the food, I like it because it's quiet. In fact, I've never seen more than a few tables occupied with any visit. It almost makes me wonder how they stay in business (possibly take-out). I hope they do, 'cause I'd sure miss their food."], ["Maddie M.", "I tend to judge a Mediterranean restaurant by their shawarma and falafel, since these are pretty standard and easy to make right (or hard to mess up, if you prefer that phrase). I've been to this place three times, all three times I haven't been impressed. Their shawarma doesn't have a very good flavor, and the falafel sandwich is too dry. I understand that falafel is dry in nature, but it shouldn't be this dry. Btw, the shawarma is dry too, but it seemed better after the falafel. The gyro wrap was alright, but still nothing great.I would consider driving to La Shish Kabob or even Zeitoni all the way in Ballantyne before I go to this place again."], ["Blum, L.", "I love Kabob Grill and could eat their food at least once a week. Yes, you may be paying a few extra dollars, but it is worth it! I rather pay a little extra for the best tabouli hummus, falafel, and baba ghanoush in town. I have eaten at other Mediterranean places in Charlotte and their food is not nearly as fresh or tasty. Yes, I have to admit the service can be spotty, and that is why I am only giving it four stars and not five, but this food is worth it!!!!!!"], ["Hazem I.", "The lamb kabob was cooked perfectly. Tabooleh and falafel were fantastic. Finished off with knafeh. Must try!"], ["Stephanie M.", "I met a fellow yelper at Kabob Grill last night for supper and dessert (of course!) and it was a great meal from start to finish.  We started with Lentil and Vegetable Soup followed by Baba Ghannouj Dip and Potato Harra - all of which were very good in their own right.  Both soups were served with pita chips and we used some in soup and some to scoop out the Baba Ghannouj Dip (Grilled eggplant, tahini sauce, garlic, parsley and olive oil)...yummy!  For entree I had the chicken kabob with a side of Potato Harra and Omar's Salad (Lettuce, tomato, onion, cucumber, green pepper, sweet corn, parsley, dry mint, lemon juice and olive oil) - VERY good!  He ordered the lamb kabob with a side of Tabbouleh (Cracked wheat, parsley, tomato, onion, lemon juice, olive oil and dry mint) and and Omar's Salad as well.  I sampled it all and the only thing I really didn't care for was the pickled veggies that came with the meal...but I happily shared them with my fellow yelper who was a fan!  I sampled his lamb kabob (my first time eating lamb) and I have to say it reminded me of beef, but was very well seasoned and very tasty!For dessert we had Baklava that was made with pistachio nuts...OH my so yummy! and a very delicious concoction of mango, passionfruit and raspberry sorbet (or gelato, hmmm I'm not sure) but it was presented in a layered ball covered in white chocolate and drzzled with dark...very good!!Our service was excellent and our waitress never let our glasses get empty and was happy to offer information about the restaurant, it's owners and explanation of the dishes we were unfamiliar with.I would certainly return here and try something else (or maybe stick with what I got this time...excellent choices)...Great little place nestled in a strip mall, attractive decor but not fussy and a great little gem in amongst Kennilworth Commons!  I'll be back!"], ["Lindsey M.", "The only negative about this place is the wait staff, they seem to be new and not well trained, the food makes up for this. The food is great, it's fresh and there are so many flavors. The chicken kabob with garlic spread (you have to request the garlic spread it is not on the menu) this combination is delicious. There humus is good. The cheese platter starter is really good also, it's a salty cheese meant to be eaten with the pitas. The lamb and beef are also great, the meats are tender and not dry. Try the Lebanese coffee to finish your meal it is wonderful, it has cardamom in it and have them add a little sugar as it is very strong (the cups are tiny) with baklava for desert."], ["Erin B.", "I cannot believe I have never eaten here before! The kids and I were starving for some food and we finally agreed to order a hodge podge from Kabob Grill and take it home. Everything we ordered was delicious. The girls wanted grilled chicken over a salad and they were easily accommodated with a child-sized portion. My husband and I ordered specials - he got a wrap, I got something tomato-ey and layered. I can't wait to go back and try out some more options!"], ["Benjamin G.", "Dilworth-centric, easily reached on bike, dine in or takeout, and full spread of Mediterranean favorites. We decided to try out this location after loving the location in Stonecrest. Happy to say it delivers just the same...and the same is damn good.Went with a menagerie of menu items: Potato Harra (one of my all-time favorites), Hommos and pita, falafel, tabbouleh, and a shawarma gyro. Decided to grab all of these to-go.Goodness. There was nothing left once we were done eating. The hommos is sooooo creamy. Not a speck of grittiness to be found. The falafel is crispy and herby and works great on its own or in a pita as a gyro. The tabbouleh isn't my favorite, but the addition of bulgur wheat is nice. The shawarma is my favorite. Great size for a meal and love the pickles that they serve alongside and inside of the wrap. I'd love to know if they make them in-house. Happy to report it's just as good as Stonecrest and we're happy to have it close to home!"], ["Ashley C.", "They have a good service. I ordered a cheese dessert that i didn't like, they gave it to me for free and also let me pick another dessert for free. maybe it's because i came here by myself and they're so friendly :)"], ["Nick K.", "I lived in the Middle East for a little while; this is the real deal. My tip is to actually go. It's name and appearance from the outside are deceiving. It's an incredible restaurant with great service and better food. Vegetarian platter is amazing. So is the fried cheese ap."], ["Cindi O.", "My husband and I were craving shawarma, and I had heard that this place was good, so we gave it a try. Big mistake. We started with the hummus. It was good, but the pita bread came wrapped in plastic baggies and was terribly dry. It ruined the appetizer, IMO.Husband ordered the chicken pita wrap. Hardly any chicken on it and it came with no sides. I ordered the mixed grill plate. The meats were pretty good, but the kafka was bone dry and my sides were awful. I had the potato harra and it was so overly lemony that it was uneatable. The baba ganosh was also gross. The service was good, which is the only reason I'm giving them 2 stars. Otherwise, it would just have gotten 1 star. I won't be back."], ["Jeff D.", "Great portion size. Great flavor. Understood our gluten free issues. Vegetarian platter filled me up - 6'10\" 225 lbs"], ["Sarah E.", "I have driven by this place tons of times and today I finally tried them out. The restaurant is a small space with about 8-10 table inside and probably seats about 10 at the bar. The service was very attentive and pleasant. I ordered the falafel wrap with fries. The falafel had the perfect amount of moisture and the sauce was good as well. The fries were a little soggy but I wasn't there for the fries. I would recommend eating here and getting the falafel wrap (if you are into that kind of thing). I do wish I would have tried the Turkish coffee."], ["Jacob H.", "We ordered from makeafoodiecall.com, and the food we got was excellent. We ordered a vegetarian assortment and a kabob assortment pair of entrées, with rice as the side. It was a delicious assortment, and truly more food than we could eat, just the two of us. Based on the food, we would have them again, either delivery or eat-in."], ["Diana M.", "This place is great. I work at Dilworth Coffee (next door) and my co-workers and I often get lunch here. Their hummus is SO creamy and delicious! It's definitely one of the best I've ever had. As a vegetarian, I am partial to the falafel wrap: it's always crunchy, fresh and flavorful. They're very generous with their portions, and the prices are more than fair. A great place for a quick, authentic Middle-Eastern style lunch.PS: You've GOT to try \"Omar's Salad\"! So much flavor!!! It has lettuce, tomato, onion, cucumber, green pepper, sweet corn, parsley, dry mint, lemon juice and olive oil... a-maz-ing!"]], "Ilios Noche": [["Linda W.", "So disappointed we chose to take our daughter here tonight to celebrate her birthday. After an hour an a half of watching the two women next to us allow their screaming children to run around and misbehave while they drank wine, I finally said something to the manager. He responded by saying that anyone was welcome in their restaurant. We eat here quite often and I was surprised by his response. I had always thought this was an upscale restaurant. The wait staff is usually impeccably trained but tonight the waitress was new and didn't even know the specials. The food is always good though."], ["Alanna M.", "I dined here with some friends this past weekend.  I have Celiac and one of my friends is 7 months pregnant, so needless to say we had some dietary restrictions.  Not only did they offer a gluten free menu, but our charming waiter was just as accommodating as he was entertaining.  I ended up ordering scallops and potatoes.  My only complaint is that there weren't more of each!  For dessert I had a decadent pistachio chocolate torte.  I already look forward to going back!"], ["Chris A.", "Excellent service over several visits and several different wait staff members.  Great appetizers, drinks and desserts.  This is becoming a \"go to\" spot for us.  Get reservations as it will be close to capacity."], ["Tracy T.", "We had a TERRIBLE mix-up with the too young hostesses in charge of seating (Immediately forgotten after checking in, then told we had never claimed our 7:00 pm reservation).  But Ilios Noche made everything right!We appreciated the sincere apology from the Manager and received top-notch service from our waiter Juan.  The Valentine's menu choices were absolutely delicious (I had the short rib stuffed ravioli appetizer with baby lima beans and Parmesan, my husband devoured the whole lobster with Greek seasonings) as well as the tried and true standards (grilled octopus and sea scallops on cauliflower mash with artichokes and dried cherries). There are so many yummy items that appeal to diners of all ages, you simply must go back again and again to try them all!  I absolutely love their traditional Mediterrean favors with a fun, urban twist!"], ["Anthony H.", "My first visit here with the family for Father's Day and while others in my family enjoyed their meals, I on the other hand had a different experience.  I am not here to knock Ilios Noche, I just didn't have a great experience with my meal.  I ordered the Atlantic Salmon and requested the dish done with a slight sear on the outside.  When the food finally came, the portion was the size of my iPhone, not the best sight I've ever seen but hey it is what it is.When I tasted the salmon it was definitely crunchy and overcooked.  Also, the taste profile of the dish was not to my liking and needless I wasn't pleased. I've read other reviews and there seems to be a consensus on the quality, decor and waitstaff.  So I'll check this off as my bad, however I don't see myself returning for a mediocre experience."], ["Andre B.", "I want to say that Ilios Noche has been open the whole time that I have lived in Charlotte, 9 years and counting. It took me 9 years to make it here and boy am I kicking myself. Head and shoulders, their tzatziki is the best that I've had since moving from Montreal. The perfect combo of garlic, dill and cucumber is on display here and that is just with the dip appetizer.For my main, I chose the veal chop which came with sautéed mushrooms and included a side. I can't begin to tell you how much I like mushrooms, so as my side I got more mushrooms. Other people at the table were drooling over my entree, so I guess that I made a good choice. I didn't try any other entrees, but the salmon, tuna and pasta entrees represented at the table look tasty as well.I will certainly be returning to Ilios Noche with the wife soon."], ["Joel H.", "Great modern twist on classic Greek.  Everything was yummy.  We'll be back."], ["P M.", "We went to Ilios Noche over the weekend and had a great time.The restaurant was busy with lots of laughter in the air.My daughter and her boyfriend were going their on a satty hawkins date (she's 15).My wife and I also went separate to grab a bite at the bar and pay for their meal.We had made reservations for them and they were seated promptly.They had a Great time and were treated like gold..Thanks you so much Ilios Noche.Sometimes teen at nice restaurant dont really get the deserved service.There was a full bar so my wife and I ordered some wine to enjoy in the seating area.We put our name in and were told the wait could be up to 2 hrs...it is what it is at nice restaurants on a Sat. night.I asked for the manager \"Patrick\" to let him know we would be taking care of my daughters bill.He laughed and thought the whole thing was cute.To our delight he was able to get us seated fairly quickly and NOT next to my daughters table.The whole experience was perfect...my daughter and her boyfriend had a Great time...we had a Great meal with first class sevice...AND once again I appreciate that Ilios and the team helped to accommodate our family...What a Rock Star of a manager!!We will certainly be back and would reccomend this restaurant to anyone.The atmosphere is wonderful and the food terriffic.I will say that the thing that put us over the Top was the way the staff made us feel like REAL Guests!Thanks again."], ["Hannah S.", "A little pricey with drinks and all included, but well worth it! On a friday night, they had an awesome band, great service and even better food."], ["Donna L.", "Recently moved back to Charlotte after 6 years away, and our return to Ilios Noche was such a welcome surprise.  We didn't expect it to be even better than we remembered.  Friday night, 6:15 and the place was packed.  Great energy, and our waitress Marie hooked us up.  I wanted to order the spaghetti but she wisely led me in another direction and I was so grateful.  Everything was expertly prepared, the wine complemented the meal, and the  advice from Marie made the evening."], ["France S.", "This review was submitted by my Mother! -I left myself signed in on her iPad. LOLAfter seven years living in Charlotte and always looking for a place that cooks what they say is their specialty, again, the same problem that I've encountered in many other restaurants here in Charlotte, Ilios Noche lived to my personal observation, neither Greek nor Italian, from the appetizer Saganaki, -C, salad $7.50 very small and underdressed, then the entrees came, preparation and visual failed miserably, my husband ordered Moussaka, it was served cold, what a mess, the only thing Greek in that dish was the spelling, I made the mistake in ordering the Greek style pork ribs, wow, the seasoning was so minimal, no enough salt and pepper and a few oregano leaves, it should have been marinated in lemon, olive oil, plenty of garlic and oregano with grated Roma tomatoes and grilled and smothered with in their juice, served on a bed of rice/potatoes and roasted vegetables, no that thing they served me, the portion was enormous, who eat that much meat. I took it home, I have a dog that loves meat and not as informed in world cuisine.  In our way home I stopped in a store for while and when I got back to car the smell was so bad that I thought not even my dog was going to eat it, I was wrong, he is a dog and he ate it, I guess that was the only complimentary critique of this meal, and what I don't understand is, why don't they have salt and pepper shakers on the table, believe me, it may help, then, have their chefs travel, all expenses paid, to Greece for cooking lessons, and then, maybe then, they will deserve to get paid for what they are serving, just saying.....one star for ambience."], ["Kellie K.", "I hadn't been to Ilios Noche since they renovated, but my fella and I decided to go for Sunday brunch.  Their Facebook page, Open Table reservations and Google search page all said they opened at 11:00 a.m. on Sunday, but their website and the brunch menu on their website said 10:00 a.m.  We got there at 10 a.m. on Sunday, and the hours on the outside of the restaurant said they opened at 11:00.  We called from the parking lot to ask what time they really opened, and it took the girl who answered a few minutes to confirm that they did, in fact, open at 10:00.  No wonder we were the only people in there!  Besides that bit of confusion, the breakfast was great.  I loved the new decor; it looks completely different!  The reds, oranges and browns/grays made it feel much cozier than before.  We both got the Ilios breakfast, but I got scrambled eggs and bacon whereas fella got over-well eggs and grilled sausage.  The sausage was almost like a brat - thick and a little spicy.  He loved it, but it was just a smidgen spicy for me for breakfast (but I'm a wimp).  He also loved the fresh-squeezed orange juice.  Talk about going above and beyond!  The breakfast potatoes were out of this world with onions, peppers and garlic.  The panzino toast was uneventful; some jam would've helped, but it was pretty bland on its own.Ilios Noche is a little out of the way for us, but after we got home I read that another location is opening in Quail Corners this spring, which will be much closer to us.  I (and my stomach) can't wait!"], ["Neekosum N.", "Very nice food. Very good service. Excellent experience. Lamb chops and braised lamb are really good. Wine and appetizers are good."], ["Paul C.", "This is a nice Italian/greek sort of place. The decor is nicely done without being over done and the food and service are great. I had a grilled chicken sandwich and mom and sis had salads along with a sort if spinach thinger wraped in filo dough. Sis is mostly vegan and she was happy with it and eats there quite a bit. I'm a confirmed carnivore and I liked it too. So it'll probably do for everyone. It was a little on the expensive side but not outrageous and the food and service were worth it."], ["Matt B.", "Nope. Overpriced and moderate food quality. I've been to Ilios often over the past 7 years, on the last year or so the food quality has declined and prices are up. Service is usually quite good, but staff has lately been light on busy nights and a lot of new faces. The owners focus may be drifting a bit. There are better options close by like 131 Main..."], ["Seema A.", "Great food. Not impressed with Management staff.We walked in around 6p on a Sat. night. Even the hottest uptown restaurants keep a few tables for walk ins. The manager had a bit of an attitude because we were a walk in over the weekend. Get over yourself. This isnt NYC. This is freaking Ballentyne!!The place was packed and we sat at the bar. All the food was pretty good - more tapas style. Meatballs were OK, not great. I did get introduced to a lovely Malbac called Llama from the super friendly bartender.I do like the romantic dim lighting atmosphere here, but the manager turned me off enough to lead me to explore other Mediterranean/greek places to find my fav."], ["Alan W.", "Awesome place awesome food awesome music, what a great place since they expanded. A must place for a night out on Friday or Saturday."], ["Rose S.", "We came late afternoon for a late lunch.  It was fairly empty.  Had a gyro & really enjoyed it.  The fries were golden & crispy."], ["Joe D.", "I know people who like this place, in fact a few of my close friends think this is their favorite place. Me - no. It's not that great. I had a flat bread type pizza for lunch that was covered in some greens - I mean COVERED ! haha. Now I didn't think much of it until I got about half way through - I started thinking to myself - \"Self, is this any better than the flat bread pizza I had the other day at Chili's?\" Well - sadly the answer was \"No self. No self it is not.\"So if you can't do better than Chili's why am I going here? This was the second visit. The other time was not any better. Some people like it though - so you might just be 'one of THOSE' people. haha"], ["Zed N.", "I wish Yelp would allow for multiple ratings on different categories. The food is good, nothing to invite out of town guests but it's a solid 3.5. The service is great. The staff there are consistently friendly and appearance is professional. I'd rate them very high, a solid 4 or higher. I have an issue with management. We've dined here seven times, mostly lunches but a couple of dinners. One three occasions I've actually witnessed management berating their staff, using expletives and gestures that drew much attention from customers. Later I found out that it was the manager and the owner on another occasion. Perhaps in Greece (owner) or France (manager) you can get away with that type of belligerent behavior but this is America. Not only that, it's the South!  Watch your back."]], "Greco Fresh Grille": [["Jessica R.", "We visited because we had a coupon from the entertainment book. This restaurant did not disappoint. The oregano and lemon fries were so good and worth the calorie splurge. The lamb for the gyros was tender, juicy, and perfectly spiced. To top it all off the employees were super nice and the food came out fast. So glad we had the coupon and tried it. We will definitely be back!"], ["AJ K.", "The atmosphere is awesome! Owners and workers are super friendly. The food was awesome! Definitely going for the traditional gyro next time! Get the lemon fries"], ["Denise D.", "This is our go to restaurant after church every Sunday!  We are addicted to their home made baklava ... The best I've ever had!!  And the shrimp pita is my favorite, take it outside and enjoy the gorgeous weather!  The staff is super friendly also!"], ["Mike S.", "The best Greek food in the area. Excellent!!! I had the gyro and it was extremely well put together. If they dropped the price $1 or $2 I would be here literally every day for it."], ["Giannabrie F.", "3 words....Lemon.Rosemary.Hummus.  GAME CHANGER!  Best hummus I have had in Charlotte.  I don't know how or why but this hummus is on point!!!  They could be adding gasoline for all I know and I wouldn't even care.  The consistency is perfect, the flavor mixture is spot on, the pita bread served with it is warm and fresh.  Yummm...what a treat.  They offer other flavors of hummus as well including Chipolte and traditional.  I'm sure they are great.  The greek salad was very good and the dessert we ordered was phenomenal!!  I don't know the real greek word and I am too lazy to look it up but it was some type of custard in a phyllo dough, baked, warm and ridiculously good.  It was big enough to share but I could have housed the whole thing on my own with no problem.  The place is not much to look at and the Blakeney location is sandwiched inbetween Brixx and Cold Stone so it gets a bit lost and a bit crazy on the weekends.  They can't really seat more than a table of 4 inside but they have a small outdoor patio.  Word on the street is they have another location...I think they said Stallings?  Somewhere out there.  Anyway, love them.  Far from where I live but worth the trip.  I need to try a few more things but this may be my go-to for Greek moving forward."], ["Sara Ann B.", "Love this place! (I personally like it more than Showmars) their lemon-oregano fries are on point and I always get their chicken pita! It's so good that I never really branch out and try something new there :)"], ["Jen L.", "Our favorite restaurant in Charlotte!Amazing and inexpensive! The chicken is so good and delicious. Great gyros. You can't go wrong or over order."], ["Johnny H.", "This place has the best gyro I've had in Charlotte, and one of the best I've had anywhere. The food is consistently good, obviously fresh, and the owners are very friendly. The prices are great, too. My wife and I make at least a couple trips a month."], ["Ellen O.", "I'm so surprised I haven't reviewed Greco Fresh Grille yet!  It's a favorite spot for quick, fresh food. My favorite is the the Lahano Salata with Grilled Chicken. It's shredded cabbage with arugula and green onions tossed with a yummy lemon dressing.  My description probably didn't give it justice but it's so good and it's nothing like coleslaw. I do recommend adding a protein, either the chicken or shrimp to elevate it to a meal.  It also comes with pita bread on the side.My hubby usually gets the shrimp pita - it's so good!  The best part of his pita that you can make it a combo and get lemon & oregano fries!  It's an expectation for him to share his fries with me. I admit that I tend to order the same thing but I will venture out one day and order the lamb burger, it sounds so good. The service is always very friendly and attentive - especially with the quick service format.  You order at the register,  they give you a number and they'll bring your food to you.  Try it, I'm sure you'll like it."], ["Maegen A.", "Unbelievable fries....maybe the best I have ever had!!!!! Chicken and Veggie Gyro incredible. Not sure what they do to the chicken but it is so flavorful. The Greek salad is also delicious!!!!"], ["Candyce B.", "I'm so glad I bookmarked this place to try! I really could kick myself for not trying this place sooner! Greco's is awesome! It's a cool spot hidden in the back of the Blakeney shopping center with awesome food and super friendly employees. Sure, parking is a bit of pain but once you find a spot you are totally in for a treat! When I walked in there was Greek music playing and the aroma smelled simply delicious! There were two super friendly employees behind the counter and they definitely made my visit amazing!I decided to try the chicken breast gyro and lemon and oregano fries. Holy Moly!!! The chicken was so tender and well seasoned! The pita bread was so fresh and mixed with that tzatzaki sauce....yum yum yum! There was nothing about this gyro that I didn't like! And those fries were freaking killer!! The tartness of the lemon and freshness and flavor from the oregano...two words: Simply delicious! I couldn't stop eating them!!! I only wish I had more...I enjoyed the entire experience! My food was hot, the portion sizes were huge! And the best part of the visit, was that the employees came by and asked if my food was delicious or if I needed anything else!I can't wait to come back and try something else on the menu! This is by far some of the best Greek food in Charlotte! Totally a must try!!!"], ["Becky T.", "Greco Fresh Grille is a tiny shop tucked in Blakeney between Five Guys and Brixx. The parking can be a chore but well worth it even if you have to walk a little distance.Hands down the best for a gyro sandwich. The lamb is fresh. The flavor and texture far exceeds the normal pre-frozen strips you get at other places. The pita is soft and chewy and the homemade tzatziki sauce is delicious. I often order the Greek salad and ask to have lamb meat added. The salad is light and the dressing is a perfect compliment. I only wish the salad itself was a little bigger.Of course no meal here is complete without the fries. Lemon-oregano is my favorite. I eat way too many and savor every bite. Citrus, salt, herbs...mmmm!The owner is wonderful and greets his patrons, cooks, busses tables, and mingles with the guests. He is invested in his business and customer service. The personal touch adds to a terrific lunch.This is our go to Greek!"], ["Rebekah H.", "First time here and the food was amazing. The falafel, spinach pie triangle, and their famous lemon- oregano fries were delicious. This is definitely my new Greek restaurant to go to."], ["K H.", "Came here by chance, loved it! The owner and staff are so nice....It is rare to see such happy employees. The food is outstanding and I don't know why anyone would choose the pizza place next door over this!Highly recommend the seasoned, handcut fries!"], ["Chris S.", "Amazing everything.  I have never been disappointed or left feeling hungry.  Great food, nice staff, always a pleasure. Also....REALLY Good food."], ["Annika Jo L.", "Greco Fresh Grille is great. We always walked by and considered trying it out but never did until a friend told me they serve the best gyros she's ever had. Great recommendation! We love this place now. I always order a gyro, either chicken or falafel. The chicken is delicious, very simply prepared with tzatziki, tomato, lettuce and red onions, but still flavorful. The falafel is good, too. Sometimes a bit under-seasoned, but still good. My husband prefers the burger. It's seasoned well and you can add American, mozzarella or feta cheese. They have seasoned french fries, too. We like them all: lemon-oregano, cumin and garlic and, plain with sea salt. Their hummus is delicious too. The flavors change weekly, my favorite is probably the rosemary hummus. The restaurant itself is small but comfortable. It's in a great location within Blakeney. The staff is awesome. They're so nice and you can tell they take pride in what they do. Gréco Fresh Grille is a great, quick Mediterranean restaurant."], ["Anna D.", "One of our favorite places in Ballantyne. Kid friendly, fast service and delicious food. My favorite by far are the Stuffed Grape Leaves \"Dolmades\". The Cumin Fries are always a hit on our table also."], ["Olympia L.", "Absolutely the best Gyro you can get around! Coming from New Jersey, I've tried many Greek places in the NY/NJ area. Never have I tried a place as authentic and as delicious as Greco Fresh Grille! Employees are friendly, place looks great, and food is the best! I had the lamb gyro, Greek fries, lemon rosemary hummus, and peasant salad. All fantastic choices! Highly recommend!"], ["Amy C.", "YUM!  Fresh is indeed the word for this place, what a delightful stop for a quick dinner.  The owner asked if it was my first time, how I had heard about them, etc. and I told him that I had seen some glowing reviews on Yelp and had to try it out for myself.  He laughed and said when the Yelpers like you, you're in good and when they don't it's not good.  :)  Such a charmer, excellent first impression, but I had to try the food.As the other reviews have stated, Greco Fresh Grille is located at Blakeney along the restaurant row portion on the far end.  Parking - meh.  Directly in front of the restaurant is 15 minute parking, so swing on past that towards Bath and Body and Wells Fargo and you should have some luck.  At 5:30 on a Monday, I was a little ahead of the dinner rush, but as I was finishing, folks started to pour in.  I am glad I got there early, as I got a chance to speak with the owner.  The food:Grilled chicken gyro:  well seasoned white meat served on a warm pita with tzatziki (totally had to look that up) sauce, thinly sliced onions and tomatoes.  Delish!  It tasted bright and fresh, very good.  The fries:  I ordered the lemon with oregano fries (the owner said if you are getting fries to go, the plain or garlic/cumin is suggested as the lemon that is tossed with the fries can make them a tad soggy if you aren't going to eat them soon).  I liked them - different, tasty.  But he was kind enough to send over a sample of the garlic/cumin fries and they were AWESOME.  I like crispy (burned) fries, and these were perfect.  Lightly seasoned and such a tasty change from plain old salt.  Quite good!As Ben stated, they have the Pepsi (sigh), but they do have Cheerwine - YAY!Awesome Greek music playing, but not loud or obtrusive at all.  If I had any friends to eat with, we could have easily carried on a conversation.  There is a TV that was on the Cooking channel when I was in with subtitles.  Friendly tip - your breath is going to be WHEEEEYEW from all of the deliciousness, so I wouldn't do this for a first date (or third, *wink*) or before a trip to your dentist (unless you hate your dentist), but any other time would be fabulous.Great little spot, the owner and his staff are incredible and definitely made a great impression.  Come for the friendliness, stay for the food, I can't wait to go back and try some more food."], ["wen t.", "The best place for gyro.I am so addicted to the veggie gyro. I wish this place is next to the place I work. I would go at least three time a week. Everything is great at this place."], ["Shavera G.", "Cool, quick and good eat! The lemon parsley fries are a must have. The shrimp pita was fresh and delish! The tzatziki sauce was a little much...may ask for little next time. Greek salad was just that...nothing more and nothing less. Local fav!"], ["Cat R.", "Another update on Greco Fresh Grille as they've been open now for about six months. We stopped by last Saturday around 3PM and the place was hopping. Great to see they're doing such a brisk business.They've added a few new items to their decor, and a few new specials to their menu. Pastitsio was listed as a special with the description of \"Greek Lasagne\" - sounded good but I was there for the gyro and fries. The food was great, but I wish they'd offer a combo with side items other than fries. Perhaps some hummus or a small greek salad. It's so easy to go there and get a gyro and fries, and then leave feeling like you've eaten something as heavy as 5 Guys next door.The owner is there every time I visit, and he stopped by to check on how things were going. This is still a winner of a place to me. It's exactly what I'd hoped for when they opened."], ["Eric B.", "I'll go ahead and reiterate what everyone has already said, this place is fantastic. There isn't anything I can even think of to nitpick, their ingredients are fresh, consistent, and certainly filling. The gyros are awesome, the lamb is juicy and well seasoned, the tzatziki is creamy, and the onions are nice and crisp. The baklava is fresh and flaky as well. As good as their sandwiches are, the fries are even better. Probably top five I've ever had, and some of the best seasoned. I've ordered a couple orders of their fries in different flavors for parties and it's always a crowd-pleaser. In a neighborhood full of choices to eat, this is one of favorites in Blakeney/Stonecrest area."], ["Steve A.", "They do an unbelievable job here . Can't belie it took me 2 years to give it a try. All the reviews are spot on. Traditional Gyro, cumin garlic fries,, make you wanna slap your momma!  Great job guys keep it up.  Owner is awesome and make sure you are satisfied and happy."], ["Stephanie G.", "I have been eating at Greco regularly for 3 years now and have been delighted during each visit.My kids loooove their chicken skewers with the tasting Greek seasoning. (They beg me to take them there).You can't leave without indulging in the lemon oregano fries. I dare to say they are the best fries in the state! Only get one order for the table though; as the portion is ample and you WILL clean your plate.The tzatiki is so creamy and light...I always get extras.Mmmmmm, I am hungry remembering the lamb burger on pita; wow...I call that happiness on a plate.Greek salad and shrimp pita are just some of my other favorites.Oh, I almost forgot the prices are so reasonable for the quality and if you want extra tzatiki, they don't nickel and dime you; they happily give you more with a smile.And they are family owned; very nice people.Gotta go; I need me some Greco love."], ["Ruchi M.", "Being from new york, I have tried greek food at several places. I didn't quite like the food at Greco as it came across as not authentic at all. The chicken in the gyro was very dry and hard to chew. The hummus that came along with the meal was cold, stale, dry and not tasteful at all. I can say garlic hummus that is store bought could taste better. Overall, My experience was not great. Greco needs to step up their game!!!"], ["Jacob S.", "Love their baklava. The queen makes it. The owner and his daughter are very nice people too--they run the joint."], ["George R.", "The food has sadly Americanized, too much success too soon?I've been back a few times  - not as often as I'd like because 22 miles is a long round trip for a Gyro - the fun has been going down but today, finally was just a big disappointing. They no longer offer the delicious Melitzonasalata, I was told because locals are not interested. Galaktompureko sorry no we don't have any, I didn't see any spinach pie ... it's pretty much down to people lining up for Gyro and \"Greek\" fries. Even the gyro (which is still good) is not what it used to be - more grease, less flavor ... is that pressed lamb meat? Not the same.I brought home the Lahano salad, which turned out to be nothing but shredded cabbage with a tiny bit of Arugula, essentially $7 for a plate of slaw. Studying the menu after the fact I see I was supposed to spend an  additional $3-$4 for chicken or some other protein on top, Greek salad? I think not.  If enough people notice maybe the owners will raise their standards but I won't be holding my breath."], ["Benjamin G.", "Finally ventured into this little Blakeney gem. My wife had been before and had great things to say so, needless to say, we were long overdue. Resting amongst more attractive and simple options for suburban folk, I'm happy to say Greco Fresh Grille is local-biz lover's haven. Small, shotgun setup on the inside and a handful of tables out back. The outdoor seating is great, but goes quite fast if it's a nice day. Get at it quick! Always nice to see filled tables at an off hour. Telltale sign this place is doing something right. Friendly service behind the counter. Welcoming and helpful. Here's our order: Got cups for water. They have pepsi products. (No hard feelings. I'm just a coke guy through and through. I'll make an exception for Cheerwine, however. Viva NC)Spinach Pie. To the Greek-savvy, Spanakopita. Amazing. The phyllo is perfectly crispy, flaky and crunches/dissolves with each bite. The spinach filling is savory and not too rich and creamy. Comes with 6 pieces, so perfect for a table of two. If you're sharing with more than two, you'll have to fight for more than one piece! I'd get this every time. My wife got the veggie gyro. Great mix of roasted red peppers, cucumber, red onion and great tzatziki. I'm a fan. The pita is thick and chewy, but not offensively so. I'd be hard pressed to shove a few pieces of the spinach pie in this bad boy! Loved all of the textures and flavors. Not overpowering and a great veggie option. I got the lamp gyro. Voted best in the QC by the Observer. I say rightfully so. Generous helping of lamb, balanced well with fresh veggies and, yet again, a nice slather of that great tzatziki. Each bite was great and I was only disappointed once it was gone. Prices are very reasonable. We ate for $20 and were happily full!Parking can be an issue, as there aren't many spaces directly in front of the shop. Not uncommon for Blakeney spots. I'd park over near the Starbucks. Can't wait to head back and stuff my face with more Greek food. Opa!Cheers."], ["Peter S.", "I love this place. The chicken gyro is amazing and extremely well priced. The Greek family that owns the place are so nice and welcoming. You feel like you are eating at their place."], ["Amanda V.", "My husband , daughter and I were at AT&T yesterday and awfully hungry. We searched yelp of course to see what was available food wise and saw this place and it wasn't long ago we were craving some gyros with lamb.   This Place Is A Bit Small . It felt cramped with it not busy I would not want to experience it busy. We ordered 3 traditional gyros garlic cumin french fries, and lemon oregano french fries. Service was quick. We were sitting outside. And we were amazed at how phenom this food was.   The tzatziki sauce tasted identical to my homemade one. Everything was prepared in the least messy way.  And the French fries were out of this world like we've never tasted before.   We bragged about this food the entire way home and we are looking forward to going back soon"], ["Andre B.", "Considering that the wife and I live close by and love Greek food, it was shocking that it took so long for us to try this place.  I ordered a lamb burger and the wife had a lamb gyro.  The wife decided that we split the lahano salata, which is a traditional Greek salad made with cabbage, fennel, green onions and dill, if I am not mistaken.  All the food was authentic and the chef/cook came out and talked to us to see how everything was.  It was nice to try something a little different than the usual Greek food.  The service was great all around and we ordered baklava to go.I can't wait to return and explore more of the menu next time."], ["Bill K.", "We love going there for their Gyros and also the Lamb Burgers... don't miss the fries... without a doubt the best in all of Charlotte.."], ["Brian F.", "I was somewhat saving this for my 200th review as I wanted it to be a write-up about something good.  Greco's Fresh Grill in the Blakeney area near Rea Rd and Ardrey Kell Roads is one of the best places in the area to go for fresh, quick, and reasonably priced, mostly authentic Greek food.  It is counter service.  Peruse the menu above the grills and sneezeguards, then order what you'd like and they'll bring it to your table. Lamb gyros, chicken gyros, vegetarian stuffed grape leaves, lemon oregano fries, etc..  I have had the chicken gyro, the plain hummus, and the lemon oregano fries.  The gyro is delicious; they do not skimp on the chicken, and there is a lot of seasoning and oil on it.  Do NOT remove it from the foil lest you would like oil dripping all over you.  The hummus is probably the best I have had around here.  It's very fresh and there are no fillers in it.  The menu states \"If it's harder to pronounce than a Greek last name, then you shouldn't be eating it.\".  The lemon oregano fries are decent.  They are not necessarily my flavor preference, but they are good for what they are.The people working, from the Greek cooks/owners, to the teenage girls usually running the register, are all very friendly.  So if you want a good, fresh gyro at a fair price in south Charlotte, Greco's is the place to go."], ["Megan B.", "Very good and reasonably priced.  Love the gyros and the different fries.  My boyfriend is Greek and he gives it a thumbs up too.  We've been coming here since it opened.  I believe the man who opened it came here from NJ.  He and his family are very nice and friendly."], ["Sree N.", "Authentic Greek restaurant! Very friendly staff and consistently good food.Definitely one of the best fast-food like greek restaurants in the Charlotte area. Been there three times so far and loved it every single time.They have outside seating as well."], ["Susan D.", "While visiting Charlotte, NC  today we stopped at Greco Fresh Grille. Oh my goodness! The BEST Traditional Gyro I have had.  Flavorful, tender, juicy and the greatest Tzatziki sauce. Family owned. And I must say, a great friendly family they are. We must go back before our trip ends."], ["Romin B.", "Really solid spot for casual Greek in Blakeney.  I've tried both the chicken and lamb gyros, and both are quite yummy.  I appreciate having the option for whole wheat pita, even with the 25 cent upcharge.  Have tried both types of fries, lemon oregano and garlic cumin, and while they're sure to make any fry lover happy, I didn't find them particularly spectacular.  I prefer to opt for their hummus, with an interesting rotation of flavors, having tried the chipotle hummus which was good.  Prices are very reasonable, with pitas going for $6, with an extra $3 to make it a combo with fries or hummus and a drink.  Highly recommend for a quick lunch if you find yourself in the area."], ["Kate T.", "The chicken gyro was awesome! The chicken is seasoned to perfection, with thinly sliced onions, tomatoes, tzatziki on a warm gyro! I chose a side salad which was just as great, lettuce, tomatoes, olives, feta, onions & an amazing homemade dressing! Love it!!!"], ["Frank S.", "Fast food atmosphere - but quite possible one of the BEST Greek Gyros in all of South Charlotte. The owner is authentic Greek descandant and they were playing Greek radio (Pandora) while we ate. Very authentic, and large, generous portions of sliced meat."]], "Ilios Noche Quail Co": [["Adam F.", "It's hard to give a place five stars after one meal. This is one of those places. I can't wait to go back and try other menu items. Highlights: Food was the star of the night. Service and ambience a close second. Waiting to head to the Charlotte Film Festival on a cold and rainy night, I stumbled upon this place on Yelp & decided to give it a go. I was quickly seated on a Friday night at 8p. The menu overwhelms the mind a bit, as it has many traditional Mediterranean centerpieces, a good amount of seafood choices, and a handful of other entrees and sides (such as pizza and lasagna).I began with the falafel appetizer, and it did not disappoint. 4 perfectly fried balls of goodness, swimming in a shallow pool of some of the best tzatziki sauce I've ingested. I lived in the LA area for 10 years, and this was one of the top 3 falafels I've ever experienced.As for the entree, I asked my waiter, Daniel, his recommendation, and without hesitation, he suggested the Lamb 'Youvetsi Me Manestra'. It is described as \"slow braised lamb shank, tomato shallot orzo, mizithra cheese.\" Wow. Just, wow. It was very close to a perfect dish. The lamb was tender and fell apart as the mizithra cheese slowly melted into each bite, adding another layer of flavor. Spices were mixed in well, and the perfectly cooked orzo complimented each bite . It was a good sized portion, but I had to finish it. It was one of those meals you didn't want to end.Do yourself a favor and give Ilios Noche a try. Date night, anniversary, or just after a long week of work, this is the kind of restaurant that deserves to be celebrated."], ["Kia T.", "I came here for brunch and I wasn't impressed by their brunch menu. It lacks depth and creative choices for brunch options. There were three fritattas and some omelet options and of course waffles and pancakes. I was just searching for something more creative.  It was a little heavier on the lunch side than brunch. I got the chicken and waffle sandwich. I had issues with it and had to send it back. I'm not one for sending food back unless it's just wrong. The chicken wasn't well seasoned and desperately needed some salt.  The waffles were rock hard, you could Crack a tooth on them. I was with a large party and 3 of us hard waffles and we sent them all back. Both times my sandwich didn't have the honey&hot sauce and ligonberry jam on it as described on the menu. When I asked about the jam, no one seemed to know or realized that the jam was supposed to be on the sandwich. And I never did get the honey & hot sauce combo. The Greek fries were great. I actually paired them with their homemade tzatziki sauce, which I was charged $1 extra for a small ramekin of. If I come back here, I will try dinner and not brunch. Maybe their dinner dishes are winners. Fingers crossed!"], ["Gideon R.", "Ilios Noche has a great menu! I start with the Musclun Salad, which has candied walnuts and blue cheese. Their falafel is out of this world. I always think about getting a second order. I also like to have the broccolini. I enjoy sitting outside and listening to the music. Ilios Noche is my 'go to' restaurant for a healthy, relaxing meal!"], ["Nina P.", "Brunch on Sunday absolutely delicious! The spinach pie to start was warm and tasty! The lamb burger was so good! Really fresh, tons of flavor! Defiantly would recommend this place! Next time we're in town we will come back, so much more on the menu to try!"], ["Kristen M.", "OMG!! All Around Superb!!I had never heard of this place before, but had received a coupon for a free appetizer and went for brunch. The service was excellent, our waitress Anna G was on top of everything! She brought our drinks right at noon (Sunday), continuously checked on us and made us feel very comfortable. The manager stopped over a few times too to see how everything was going and was pleasantly friendly. The food was delicious and came out pipping hot! The app we got was the Zucchini and Eggplant Chips - SO SCRUMPTIOUS!! The poached eggs were cooked to perfection and the drinks were splendid!Best tip about this place: Large portions!! for everything, even the sides that come with the entrees are huge portions."], ["Marshal C.", "Absolutely shocked!   This place, for a strip mall, is so AWESOME!   Let me tell you about my experience.  We made a reso on Open Table for 7:30p.  We were seated at 7:25p.  The decor is very classy and yet has a rugged cabin feel to it.  It is very cozy!   The food was great.  I tried the pork ribs, and they were good but not as good as I would have imagined.  The slaw and flash fried potatoes that came with the ribs were OUT OF THIS WORLD amazing.  The taste of four appetizer was WOAH, drop your iPhone AMAZING. There was smoked eggplant dip, Greek cucumber dip, hummus, and a tomato based dip with EXCELLENT pita bread.  The waitstaff were VERY knowledgeable about every aspect of the menu.  There were a lot of managers zipping around making sure the guests were well taken care of.  We asked for custom drinks that were not even on the menu, and they were made by the bartender to PERFECTION. The melon vodka martini we asked for was SO fresh.  The bathroom was super clean and well kept.  Seating options are numerous and the almost every space was occupied by happy people enjoying their Greek food.  I would definitely come here again.  Be aware that parking can be difficult, but that was the only issue I could find with my entire experience!!  Happy eating."], ["Meck G.", "It's been about three weeks, but I do remember the food was great.  I had a lamb burger with goat cheese that was awesome."], ["Marco F.", "We came here the other night for dinner and boy was I impressed by this place. Start to finish this place is 5 STARS..!!! The entire experience was absolutely PHENOMENAL..!! By the time I arrived my buddy Paul had a dip platter waiting - hummus, tsatziki, eggplant & roasted pepper. It came with a bunch of pita bread -- All 4 were delicious.I then ordered the pork belly sandwich.... I repeat, PORK BELLY sandwich...!!!! As many of you know, the belly is the pigs greatest culinary gift. It came served on pita bread and came with red onion, tomato, lettuce & tsatziki. I can't even put to words how delicious this sandwich was. It was just AMAZING...!!Allyson had the moussaka. It was enough for Paul and I to sample and she had plenty left to take home. I've had moussaka at Greek restaurants all over the country and this is one of the BEST I've ever had. We ate outside on the patio and as the night went on, it got a little chilly. Our server came over and as soon as we mentioned it was getting cold he turned on two heat lamps for us right away -- He was extremely attentive. In fact, the service provided by the entire staff there was beyond anything I could have possible expected or asked for. I can't wait to go back...I'm sure that the only problem for me will be deciding on what to order.This place is truly a hidden gem in the far corner of a strip mall. I HIGHLY recommend ilios noche quail co..!! Don't underestimate it.. Give this place a try next time you are in the area!"], ["Phil L.", "This place is a great dinner spot for south Charlotte without driving towards the city. They have quite a large menu with choices from traditional Greek dishes to other dishes with Greek touches (pizzas, pastas). I had one of the pasta dishes which tasted great and everyone else in my group wanted to try. The decor of the place is very stylish. Rustic but very classy and updated. Think Restoration Hardware. Great setting to have cocktails, which were very well made also.The one tough part is parking. The lot fills up very quickly at dinner time and we had to park by Harris Teeter. Consider making a reservation for peak times- the waiting area was quite crowded but we didn't have to wait having made one."], ["Charles M.", "My dad and I went here one night and one of the best Mediterranean places I have ever been to. All the ingredients were so fresh and prepared wonderfully. I am definitely looking forward to my next visit here. A little pricey but the quality is on par with the price.We started with the Roasted Red Pepper 'Htipiti': barrel-aged feta, chili pepper, arbequina olive oil. Awesome spread to begin the meal.Then we split the LAMB 'Youvetsi Me Manestra' slow braised lamb shank,tomato shallot orzo, mizithra cheese. And the PAN ROASTED CORVINA greek risotto cake, grilled ratatouille vegetables, aged balsamic. Hard to say which one was better both blasting with flavor the lamb was so tender and the corvina was moist.Next time you're in the mood for some Mediterranean can't go wrong here."], ["Arlean Z.", "OMG!!! An amazing food experience!! Phillip was our waiter with great suggestions. We had the fried calamari as appetizer, the signature lamb dish and risotto Parmesan. The ambiance, service and food 5 stars. Definitely a must for fine dining."], ["Armando A.", "This is our new goto, Friday night, hard day at work, need a good meal and a drink place. Food is great and our waitress Ariana (I'm sorry if I'm way off) was amazing. I'm sure she would have been even better if my 6 month son wouldn't stop flirting with her. Almost every waiter took the time out to stop and play with him which actually gives us time to eat. That alone makes it well worth it. I'm a sucker for customer service and this place has it."], ["Noel L.", "What a swanky little place for a strip mall.  Really cool decor....rustic and modern.  The cocktails were pretty good....and they had a nice bar area.  The food was EXCELLENT!  I had the Grecian Pork Ribs with Greek Potatoes and Slaw.   It was delicious.  The Ribs were served piping hot and perhaps the most \"fall off the bone\" that I've ever had.  What really upstaged the ribs were the Greek potatoes ...they were delish.   The Lukomades (for dessert) were incredibly fresh and tasteful!  Nice way to close out the meal.The place was hopping and had a fine wait staff.   One head waiter...with several people including management rolling by the table to check in and make drop offs from the bar...etc.   They really took care of us without interrupting the flow of conversation at the table.I would definitely recommend."], ["Bruce K.", "Yummy times ten. Great meal, great service!I booked on Open Table and arrived to find that the place was barely a quarter filled. Nice. We were immediately seated at a table towards the back, near the very filled wine racks. Sadly, my wife and I aren't wine drinkers but if you are then you'll be pleased. I chose a Catawba draft instead.The taste of four starter is the way to begin here. Scoops of hummus, tzatziki sauce, red pepper and eggplant with a nice serving of slices whole wheat pitas. Probably too much for two to start with because there was a lot there and we were \"uh, what?\" when our main courses arrived.My wife chose the lobster ravioli. A very large portion with plenty to bring home, especially after we filled up on the starter. Tasty, creamy, seafoody (is \"seafoody\" a word?) and easy to eat. Delish.I had the quarter chicken which was served with potatoes and other veggies. A very big portion, there was a lot of flavor and texture in here, with the perfectly al dente potatoes.Dessert? Well, I guess we can try. We split a piece of baclava which came topped with some sort of (lightly peach-flavored) ice cream/yogurt. Delish.STUFFED with a delicious meal. We'll be back."], ["Jo S.", "We had reservation at this place. When we got inside, the hostess tried to seat us at a table near the door, it was cold outside so we asked for another table since the restaurant was half empty. The decor is generic-upscale wanna be, there's nothing ethnic or cute about it.We love Greek and Mediterranean food in general. We were very interested in this place and their take on that type of food. I'd say after dinning at this place that we enjoyed their appetizers more than their regular entrees. Their menu is too much of a mix of things, tries to please too much: pizza, pasta, some Greek dishes.For appetizers we got the fried zucchini and eggplant chips (they were very good) w. cucumber yogurt and the meatballs (they're just OK). For entrees we chose their pork chops (read good things about them) which were big, too much meat, dry, kind of bland, I couldn't sense the lemon flavor or coriander (they were supposed to have). Their fries were good. The coleslaw with olives (not the most Greek idea for a dish in the world) came later, way after they brought the pork chops with the Greek Fries. If I pay around $20 for an entree, I want all the components  that are listed in the menu to be brought in the same time (it's just coleslaw). The service wasn't that great, they don't bring the coleslaw when they're supposed to, but then they keep coming to your table to rush you to finish the food with a typical question:\" Still working on it?\" - I'm eating, not \"working\".  Overall, this place doesn't have flavor in their food as well as in their decor. The food lacks the Mediterranean flavors and the place lacks the Mediterranean fun!"], ["Rachael B.", "My boyfriend and I went here for dinner tonight and we were not disappointed.  Our server was Phillip and he was absolutely phenomenal, very knowledgable and friendly.  We ordered the humus, olives, chicken souvlaki, caesar salad, and the fennel and grape salad with lamb.  All of the food was cooked and seasoned perfectly.  I was extremely happy to find out the founders are CIA alumni as well, it's always amazing to see what our alumni can do!!"], ["Rick T.", "Really good lamb burger, didn't like the bits of red onion in the meat though. The lamb sandwich was good but not as the burger. Will try the ribs and other items when I return. Nice lunch spot !"], ["Mitch K.", "I think they have pretty good Greek food, not out-of-this-world good, but decent and some dishes are excellent.The octopus appetizer was excellent and ditto the dolmaties.  If you are a novice to Greek food, do the four starter/dip plate that is a selection of humus, egg plant, peppers along with pita bread.  You can get regular or whole wheat pitas.Crazy lasagna is unique and very delicious.  My friend had a big salad and it looked fantastic and he said it was one of the best he ever had.Menu is Mediterranean and covers quite a variety of dishes. Portions are generous.Hard to comment of describe other than to say that the service is great, selections many, prices reasonable and everything is savory.  Treat yourself to a selection of appetizers and you will have a great experience and learn something about Greek food.Good place."], ["Tina T.", "Excellent! Food is superb, different, eclectic. I had the Crazy Lasagne...the only thing crazy about it was  how crazy delicious it was! I love the atmosphere at the Quail Corners location...very pretty outdoor patio seating. To top it off...excellent, friendly service. So happy that this great place is just a quick walk for me!"], ["Nathan M.", "2 stars for thinking they know how to do chicken and waffles for brunch. The chicken and waffle is merely a vessel for the three sauces it comes with, which for a fried chicken lover is very disappointing. Step 1 brine chicken, step 2 add seasoning to the flour...easy"]], "Nefelie's": [], "The Mad Greek": [], "Mr Geero": [], "Zoës Kitchen": [["Shannon H.", "This is a kinda Greek place that serves a nice selection of somewhat healthy foods. I wished they had actually called the dishes their real Greeks names (ie: gyros, souvlaki) but they have to appeal to Southerners who aren't always up for weird words. (gyros = yeee roes).Anyways, we had the hummus and salad plate which was very good. The chicken roll ups were nice and warm with a definite Greek flavor, the shrimp kebabs were entirely too spicy, though. My 11 year old loves spicy so he ordered these knowing it would be a little hot. They were scorching hot. I wish they would've noticed that a kid was ordering this and said something. The \"pick 2\" that my 16 year old got was less successful. He opted for the cookie side dish -other choices were salad, fruit, dessert or hummus which is a nice selection - but his sandwich was TINY and the cookie didn't round out the meal much by making it full-size. Go for a bigger side dish unless you aren't that hungry! My one complaint was the pita. It's very good here, warm little triangular pieces served with the meal and with the hummus, but they don't give you enough! There was easily a half cup of hummus on my salad plate but only 4 triangles which was probably the size of a small pita or even half of a larger one. I asked for more when I went inside (we ate on the patio which was nice) and the girl there seemed baffled. They should be throwing this stuff around left and right because it is dirt cheap, calls out for hummus and a drink and really makes for a well-rounded looking meal. So, I said we had too much hummus left and needed more pita. She brought out...4 triangles. We actually laughed because these things are about the size of one Doritos chip. Oh, well. It was tasty, at least!The bill came to $35 for 2 meals,1 half sandwich and cookie and 1 hummus and salad plate. Not expensive but not cheap. Healthy and fresh and nicely different. Good for kids, too!"], ["Sarah M.", "I love Zoe's! The food is great and the service is very friendly. The protein plate never disappoints!"], ["Gus S.", "I come here about once a week. The chicken kebobs are great, and the roll-ups (steak, chicken, or spinach) are terrific. Most items on the menu are lower-cal, so this is a great place for those who are counting calories."], ["Amanda G.", "Great healthy and fresh food. I love the salmon kabobs with roasted veggies and humus."], ["Ryan B.", "Without a doubt, the friendliest service around. The people who work here are young, professional and very socialble. Btw food is great too."], ["Jeanne F.", "I have had Zoe's cater for several business lunches and the food is always a rave review by guests.  Much better than Jason's  Deli, and healthier choices too."], ["Winston C.", "It's a healthy, simple and unique menu.  Food is fresh and prices are reasonable."]], "Mr G's": [], "Showmars": [], "Showmars Restaurant": [], "Akropolis Kafe": [["Lori L.", "Not sure why but every time I come here, the place is usually empty. I usually get the chicken pita sandwich. Chicken is juicy and flavorful. Their tzatki sauce is amazing!!! My fiancé usually gets a platter. Fries are good and crispy but obviously previous frozen. Staff is nice and restaurant is clean. This is honestly a hidden gem. I don't get why more people aren't here."], ["Radoslav B.", "Small place. Looks like Family place with around 10-12 tables. No hostess order on front and choose a table to sit. Before food to arrive I guess the owner cane and asked me to move to a smaller table. During whole time only 3 table where busy.   Ordered a Gyro plate it came with fries salad gyro on side two small pieces pita bread and tzatziki sauce and salad dressing. Gyro was good,fries dry and over fried.  Side salad green salad with one olive one cucumber and one tomato slice.one half slice red onion. Ordered tee with lemon it came with no lemon.  For me is OK"], ["Abdul G.", "I think this place is family owned so they have that personal touch that is really nice. The falafel pita is crazy good. That's the only thing I've eaten here, so if you're into falafel, this would be the place. The atmosphere is pleasant enough. It's a casual eatery and is pretty busy during lunch time, but the service is fast and courteous."], ["Digger B.", "Always consistent freshness. Greek salad w/chk is the perfect lunch. Love their dressing and tzatziki. In restaurant atmosphere is average but the food is great. Recently we've been ordering their catering platters to go and set it up as a self serve for family or guests in a casual setting."], ["Biorunup J.", "I went for a lunch at this place and ordered grilled chicken kabob wrap. It's really tasty.Looks like lamb kabob with yellow rice also good.i will revisit again try some other items."], ["Maria J.", "The food was good and the gentleman behind the counter was friendly and efficient. Started with the hummus appetizer which was served with piping hot pita bread. Hummus was flavorful but not extraordinary and I wish they had served more pita bread with it. The gyros were full of meat with a flavorful tzatziki sauce. The main reason I gave them 3 stars is because the ketchup bottles which were on the tables were filthy. We were one of the first customers, if not the first customers of the day so no excuse for dirty condiments. Details are important especially when it comes to cleanliness."], ["Jamie B.", "Within the past month or so we've ordered from this place at least 3x. We don't eat out often so that's a lot for us. We order the gyro platter every time. And every time it's delicious! The food is PLENTIFUL & it's all so good: gyro, fries, salad & pita bread. Not only is the amount abundant & tasty, but it's ready in 10 minutes or less- literally. Oh & when you walk in the aroma is heaven!"], ["Mindy N.", "The food was not as good as I had hoped. I ordered the Spanakopita and they were soggy. I expected crunchy and flaky and was sadly disappointed. Baklava was tasty but not the best"], ["Jason B.", "Has this place taken on new management?  I went recently and it was not even close to what it was a year or so ago.  I was just a little disappointed.  I had the Gyro and it was bland and had no crisp to it.  I used to love this place. I'm hoping it was just a 1 time thing."], ["Deb S.", "First time here, just got two gyros with salad. Everything was very good, meat did not seem \"microwaved\" and the pita was soft and slightly crispy. Salad was fresh. The woman behind the counter and the one who served us couldn't have been nicer, coming to check on us a few times.  Finally, my SO wanted some more pita and tzatziki,  went to order it and they gave him a couple w/sauce on the house.  Maybe the place was just having a bad day when the very unhappy reviewer visited?  They seemed very friendly and competent tonight and the food was very good.  Will def be back."], ["Sid F.", "Authentic food and great taste!"], ["Eric D.", "Went here for a quick lunch one weekday afternoon.  Decent food at a decent price.Atmosphere - Clean, basic, small, busy, pizza shop-ishFood - I ordered the Chicken Kabob which came on a wooden skewer.  It was accompanied with a Greek salad, Steak fries, and a pita.  The Kabob was tasty but the salad was drowning in dressing.  The Steak fries were awesomely crisp with a tender inside.  The pita was fresh tasting.  Service - It was prompt with hints that the owner was present as any question was quickly answered in a way that seemed to say the responder cared about answering you correctly.  I was a little disappointed that the food came on a Styrofoam plate (see photo) but this place is more geared toward takeout. Overall - While the salad was more or less ruined by the amount of dressing, everything else was tasty.  I would stop here again...but would recommend to anyone when ordering to get the dressing on the side."], ["DS K.", "To the ever so pleasant, disinterested child working tonight. You are rude, you are inaccurate and give horrible customer service. The puss face, nasty toned lady on the food side - smiling is free and so is preparing an order THE WAY IT'S ORDERED. To the owner- these two people are hurting your business and I will never return to your establishment.  I have been here many many times before tonight. I live steps away from Zetouni and I like different items on the menu from each. The staff at zetouni is pleasant, attentive and efficient. There were 2 tables of 2 when I came in. The teenager working doesn't say hello, doesn't look up at you. As she's looking at her phone says \"what do you want to order\". RUDE. I ordered one of the specials for the night. Gyro sandwich and SALAD. Fine. Seems easy enough for a Greek restaurant no? I nicely asked for extra tomatoes and onions. The nasty lady behind the counter gave me a dirty look as soon as she heard it. Fine. 10 mins go by as I watch the child working stomp her feet around the restaurant in her leggings and Tshirt - very professional. My food is ready and again, without looking up, \"utensils?\"  I reply \"no thank you, may I have some tatziki sauce on the side. The nasty one in the back chimes in \"that'll be 70 cents\". The child proceeds to turn to me and for the first time actually looks me in the eye \"it's 70 cents\". The lady in the back will not hand her the sauce yet. Fine. I only had a debit card on me so that's what I handed her. SEVENTY CENTS. she swiped my card for seventy cents. Good luck with that credit card processing fee owner!!! I have NEVER in my life seen anything like this. She slaps the receipt and my card on the counter, nasty in the back hands her the sauce. She puts it on the counter and walks away. I am really not a difficult customer nor do I expect anything I don't pay for or deserve. That being said WHEN I ORDER AND PAY FOR SALAD IT'S MIND BLOWING THAT I GET HOME TO FREAKING FRENCH FRIES. ?????What gives here? It's a shame because the food is actually good. Which is why I gave the extra star but after my experience today- whether they care or not - they have lost me as a customer. It really is too bad because there used to be a very sweet lady running the counter who couldn't have been nicer. I don't need to drive out of my way to be treated like a second class citizen bothering nasty people who are being PAID to be there and provide customer service. Will not ever go or recommend again. Your loss. No thank you. Hope your seventy cents came in handy."], ["Julia M.", "Great little casual joint that serves up good Greek salads, chicken kabobs, etc.   They are super quick, which is nice when you are busy.  As the other reviewers have mentioned, the place is nice and clean and service is friendly.  Definitely a great go-to place for a quick & affordable lunch."], ["K B.", "i think the good ratings must be family/friends or a system error. bland grilled chicken salads, soggy chicken \"fingers\" that looked like huge meatballs. falafel pita was mush. fries were served just before burned. this was my second and last time going to this location. I will gladly drive a little farther to go to the Arboretum location (which is consistently good). My family just ate what we could of our meal and threw the rest in the trash. Such a waste of money:-("], ["Alex V.", "Good Greek/Mediterranean food. But every time I go there they have a new waitress. I wonder why..."], ["Maureen B.", "The place is VERY clean.  It's the type of place where you order off the menu which is listed above the cash register and they bring the food to you.  The hummus was probably the best hummus I've ever had at a restaurant.  I ordered a Gyro & Greek salad for my meal.  The gyro was so delicious-had green peppers, onions, feta cheese, and yogurt sauce on it.  Probably my favorite gyro as well.  The salad was fresh and good-just a little too vingerage-y for my taste though. the prices were good and the food was great!!"], ["Rebecca W.", "This wasn't a planned lunch stop, but in the end, I'm glad my friend and I ended up here.  The place we wanted to go was closed for some reason, so we jumped on Yelp to find another place nearby.  I had a gyro sandwich was was really good.  The pita was fresh and the tzatziki sauce was not too runny.  I don't live in Charlotte, but if I ever find myself back there, I would go to the Akropolis Kafe again."], ["Vanessa C.", "The food was decent for a quick lunch spot. The price is ok but it would be better if they didnt kill you with all the extra charges for every little thing. The service leaves a bad taste in your mouth. The man behind the counter was very abrasive. The negative customer service coupled with the extra charges does not make a customer want to return."], ["John H.", "Great food nice staff clean"], ["Adam R.", "I discovered Akropolis Kafe during my first week at my new job.  I'm glad I did.  The inside is pretty plain, but since the place strikes me as being a quick lunch spot for office workers more than anything else, that's not surprising.  You don't have time to linger on your lunch hour, anyways.Anyways, I order the gyro with a side salad.  They gyro was very good, perhaps one of the best I've had in Charlotte outside the Greek Festival.  The meat was well-seasoned and juicy, with just a hint of char.  Mmm.  The salad was a little more disappointing: as others have mentioned, they ladle way too much dressing on that sucker.  Next time, I'll order fries or ask for the dressing on the side.I definitely recommend Akropolis for a quick lunch, and I will be back soon."], ["Kim A.", "Great place for lunch -  Food to good and the combo's come with fries or salad.  Salad dressing and sauces are yummy."], ["Karl C.", "We went here for lunch, hoping for authentic Greek food. However, both are meals were disappointing. I had the chicken souvlaki platter, and my wife had the gyro platter. Both salads were literally swimming in dressing - way overkill (but tolerable). However, the meats, which should have been the star of the dishes, were both less than stellar. My chicken had little flavor, and was slightly undercooked. My wife's gyro meat was 'mushy' and tasted like a hot dog. (My guess is that it was pre-sliced from the gyro 'log', then kept warm in water.)We ended up just leaving and going to Moe's...  I would not go back."], ["Crystal M.", "I just moved to the Charlotte area from Greensboro last week. In Greensboro, my favorite place to have lunch was/is Ghassan's on Battleground Ave.  For one, the food is consistently good.  I always get the chickon on pita platter, fries and salad (or sometimes, all salad- but at least they give you a choice).  I will have to do a review of Ghassan's on Battleground Ave. because I could go on and on about how great they are (fast, consistent, friendly,realy delicious etc.).  So, in need of something to remind me of home, I went to Akropolis in Ballantyne just up the street from my work.  The service was not as fast as my dear, sweet Ghassan's.  The menu was a little confusing, as I was looking for my old standby, so I asked they guy at the counter what would be a chicken on pita- he said it was the sandwich.  He asked if I wanted fries OR salad.  When I said both, he said I could only have one with the plate and would have to order one of them seperately... gasp!  Ghassan's always lets you have both!!!  So, I ordered the salad with the box and got a separate order of fries.  It was a lot of fries.  The pita was good, but not the best I've ever had.   The pita wasn't as fluffy and warm and the chicken at Akropolis is not as tender as Ghaassans (sorry- if I could move Gassans to Ballantyne, I would!). The tzatziki sauce was $.65 extra but it's some of the best I've tried. The tea is sweet, but that's how I like it.  The fries are big, thick steak fries (I prefer crinkle). The Greek salad is wide cut iceburg lettuce (I like the stingy kind better), a peice of red onion, a couple grape tomoatoes, a cucumber, I sliver of green pepper, one seeded kalamata olive, a tiny bit of feta, and on the side you get ample olive oil vinagarette, which they make too tart and peppery for my taste (too vinegarey, if that's a word).  I put some of the cucumber sauce in my salad to take the tartness off and will probably do that every time. The salad was ok, not outstanding, but fresh.  I'd like it cut up more, but, hey, they did give me a plastc fork and knife. The prices were very good. I did not eat in, but I did use the ladies room while waiting for my order.  It's very clean.  That always is a good sign that the kitchen is clean.  You can actually see the cook from the counter.  It all looks well maintained.    I would eat there again, but I still long for Ghassan's on Battleground Ave. If you're ever in Greensboro, you have go there.  Akropolis is not bad, but I wouldn't say they are great.  They are decent, reasonably priced, and their tzatziki sauce has it going on!  ...oh, and a little stingy on the ketchup for all those fries (just sayin').  Guess they have high rent in Ballantyne and have to control costs, which is understandible.  LOL"], ["Paul D.", "Best Greek chicken salad in Charlotte.  Eat it a lot.  Plus used this company to cater a 22 person lunch.  It was perfect.  You should give them a try."], ["Michael T.", "Nice little Greek restaurant and take out. They don't have a large selection but what they have is pretty good (and actually pretty close to real Greek food). I usually go there if I'm in the neighbirhood and need a quick bite for lunch. Most of the time I get some sort of Kebab with Greek salad. It's always fresh and nicely seasoned. The interior is nothing to write home about, not inviting you to spend a lot of time there. But hey: if you're in the mood for some good (cheap) Greek food this is a good place to get it."], ["Somak M.", "Great Greek food.  I like their gyros more than the ones at the Yiasou festival."]], "Little Village Grill": [], "IOS Greek Kitchen": [], "Chicken King": []}