{"Copper": [["Claire M.", "Visiting and decided to check it out despite the mixed reviews here - very glad I did!It's in an old house which has an interesting juxtaposition of decor, shall we say, against the historic feel of the house, but still nice and comfortable.They were accommodating and the meal came out quickly for us:Murgh Tikka Masala: delicious and lovely with plenty of sauce (yum) and nicely cooked chickenSaag Paneer: By far the best I've ever had - I could not get enoughLamb Kozhambu: On the (good) spicy side but imo not as great as the MTMOverall assessment - try it.  If you're unsure about a dish, just ask.  If you're nice, they'll be nice back :)"], ["Koyel G.", "One of the best restaurants serving Indian food that I have been to in the recent times. The food was flavorful with just the right amount of spices and you can feel the aroma as you walk in.The ambiance was good and I would definitely recommend this place."], ["Stella T.", "Overpriced and overhyped for lack luster mediocre and poor service. I've been to Copper on two occasions.  Having lived in major cities in the US, I'm still trying to to adjust to the consistently higher ratings for sub-par places in Charlotte. It seems to take very little from a Charlotte restaurant to get 5/5 star ratings...but I digress. Copper is undoubtedly a perfect example. Service matters.  Our server was no where to be found most of our meal on an uncrowded night.  Our wine glasses were empty for quite a long time prior to food arriving...we tracked him down...but barely got him to stop for a moment and ask for another glass.  He returned, left the full glasses, and didn't touch the empty ones.  I picked them up myself and put the empty glasses on the bar.  He also had unmeaningful answers when we asked for recommendations off the menu when ordering. Food was flavorless and under seasoned, which I didn't now was possible with indian. Naan, rice, and both entries were unexciting...and the meat overcooked and dry.  The server didn't bother to ask how the meal was or check in.  He knew the service and food was poor that night.For $90, it was not money well spent.  For a $45 meal in a \"fast-food-pace\" in and out indian place, it would have been fine."], ["Annamaria-Guarneri M.", "Good cocktails, had a Sahma that was fruity and fairly strong! Our waiter was attentive and they were pretty busy! Very pretty inside, soothing, the tables are pretty tight so you hear everyone's convo (not loving that) food was delish! A cod dish and chicken dish, the names were so long I can't remember! It's pretty pricey but worth it."], ["Melanie E.", "Just an update on service!  Shannon at the bar is very nice and we are happy she introduced herself us!  So nice for the manager to show us the bar when we came in for our resv as we didn't know they had one!  Sanjee was our wonderful server for the evening...one of the nicest and most personable since we started visiting here.We've still only gotten the Tikka Masala but Sanjee let us know about their lunch offering specials to try other things and the buffet of more traditional Indian dishes at their sister restaurant in Ballantyne!We are looking forward to it!"], ["Anand Kumar C.", "Horrible guest and hospitality. Wish I could give a 0 or a negative star. I once showed up with shorts and sleeveless tees and the management got pissed off because of that and asked me to leave. Worst place ever and would never recommend to anyone."], ["Apurva N.", "What a great find! I was a bit daunted at first when I saw the three $ signs on Yelp but I thought I'd try it out anyway.. and I'm glad I did!My colleagues and I arrived around 8:15 pm. The weather was so great we decided to sit outside - consequently, I didn't really look around too much inside.. it looked pretty upscale and nice from what I saw though!. The host walked us out to a table and we got settled.For appetizers, we ordered the cauliflower dish and the samosas. Both arrived fairly quickly and were really good. The cauliflower could have used a little less sauce though.. was bordering on overpowering.That is where the gripes end! For our main courses, we ordered the Lamb Kozhambu, Lamb Chops and the Cod dish with Tandoori Rotis and rice. All three dishes were REALLY good. The lamb chops in particular were outstanding! I highly recommend you try them!Since we were enjoying our meals so much, we decided to order dessert as well. I ordered the Gajar Halwa - Rabri combination dish (name escapes me). My colleagues god the Three Excuses and Hedonism. All three desserts were really really good and we polished it all off.I think we have discovered a bi-weekly Indian restaurant in Charlotte and will be sure to return. You should check it out, and be sure to try the Lamb Chops!"], ["Lisa C.", "After pulling up to a quaint house repurposed to restaurant you enter into a dimly lit entry way with soft music playing in the background. The white table clothes and smartly dressed waiters definitely add to the romantic atmosphere. However the mood is dampened a bit by the small and rather close together tables.The menu is thoughtfully laid out starting with a good, but not overwhelming, selection of appetizers, traditional Indian dishes and modern Indian dishes. The samosas come beautifully plated with a hot sweet and sour chutney. The seared scallops are my personal favorite because they always come cooked tender on the inside with a distinctive seasoning seared on the top and bottom.I am still a novice when it comes to Indian food so my go to order is the chicken tikka masala and I love the creamy tomato sauce it comes in which they do not prepare with much heat. I have also tried the dahl makhni which was also a solid choice for those still experimenting with all the new flavors of Indian cuisine. While Copper dishes have been consistently enjoyable I am not quite sold on the value of the meal. They offer a single slice of naan to begin the meal, but if you would like additional naan, even plain, they charge. That seems a little too opportunistic when they are already charging $20 for most of their meat dishes and $15 for vegetarian. At least they do include the rice in the meal price.Other people have noted that the wait staff can be a bit off-putting and we have experienced that before but our last two visits the waiters were very attentive and had a courteous and friendly demeanor. Hopefully this is a sign of a long term improvement.I would definitely recommend Copper with the caveat of understanding this is probably the most expensive Indian in Charlotte."], ["Jennifer H.", "Best Indian in Charlotte.  It is not the typical Indian restaurant, but a modern take of Indian food.  I still tend to order off the traditional menu.  My favorite part is the naan and chutneys they give at the beginning of the meal.  I have also been for lunch and love their menu.  It isn't a buffet that is often found at Indian restaurants, which I do like.  However, here you are able to choose your protein and choose your sauce to create your own dish.  It comes out in a big bowl so for around $10, it's quite a deal.This is the place I go to when I want a quiet bar to sit at and just enjoy a delicious meal by myself or one other friend."], ["John M.", "Copper is a pleasant, 30-minute walk or quick rail ride from Uptown Charlotte, housed in a beautiful old property that's been wonderfully renovated inside. Indian EDM thumps incongruously from a mounted speaker, quite at odds with the relaxing environment.There is a 'Coppertini' menu along with a fairly impressive wine list, with a few decent whites by the glass, including a light and refreshing Indian Chenin blanc, which is what I went with.The menu promises not just the old Indian restaurant standbys but also some modern takes on the country's cuisine, including a tandoori-spiced duck leg confit (not cooked in the tandoor, of which none exists in this restaurant) and dhana dal with scallops.'Masala Chili Cauliflower Florets: Zesty Soy-Tomato-Scallion Glaze, Toasted Spices, Ginger' ($9) sounded good. In reality what arrived was essentially a pretty poor plate of gobi Manchurian. I understand that the taste in Indian food is towards very crispy batters but this was something else, nowhere near pliable with a fork, and the glaze was reminiscent of over-salted ketchup more than any of the promised spices or zest. Some complimentary naan and completely extraneous chutneys arrived with this, the bread clearly out of a bag, as well as some raita.For entree I chose 'Kashmiri Chili-Fennel Roasted Lamb Chops, Wild Mushroom Pulao, Lamb-Mushroom Redux' ($27) and was sorely disappointed. The lamb chops, which I requested medium, came rare, and needed knife and tooth to be prised from the bone. That would be excusable were it not for the nearly total lack of flavor. Some fennel came through, but the lamb-mushroom redux on top was simply overpowered by the burnt edges of the chops. The pulao was a bit better, having a genuine earthy hit to it, but not enough to rescue the lamb. With this dish came more of the naan and a vast bowl of basmati rice. Yes, rice to go with the pulao.I was of no mind to try a dessert after that so that was the end of the meal. Service was professional, if quite reserved.For just short of $50 this was a hugely disappointing experience. Frankly I am baffled at Copper's excellent reputation. It's a beautiful space and clearly a great deal of thought has gone into the menu, but the food is nowhere near good enough at any price point, much less the one charged."], ["Trent S.", "Really good Indian food--heard about this place from one of my coworkers from India. The naan and rice are great, and the entrees include traditional, fusion, and vegetarian options. Of the two vegetarian entrees we tried, the goat cheese koftas were really good--the dal makhni seemed to be a little bland. The setting is fairly formal but not over the top (converted house), and the service is very good.The prices are slightly on the high side, but you can defray some of the cost by using vouchers from Restaurant.com (as of this writing). This is definitely one of the better Indian places in the state, but will probably only return on special occasions, and the outstanding lunch buffet at Taaza Bistro in Burlington remains my overall favorite for food, selection, and value."], ["Abby A.", "Disclaimer: might have given four stars if the service had been better.My beau and I went to Copper on a Friday night to recreate our second date (from four years ago). We made a reservation for 7:30 and arrived right on time. We were seated promptly and then completely left alone for 8 minutes. I know, because I checked my watch. The dining room was busy, but not slammed, however there seemed to only be two waitstaff for the entire business on a weekend night. Seems ludicrous.We ordered samosas, saag paneer, their lamb curry and garlic naan. The food came out in a timely manner and tasted really good. I had asked for no cilantro garnish, but there was a significant dusting of cilantro on everything we received. No biggie, I picked it off and stuffed myself full. Now that we are done with our food we waited nearly 15 minutes for a waitress to come around so that we could get our check and go.I am not slamming the staff, as they were curteous and prompt when they were around, I am admonishing the management. It makes no sense to fill your restaurant to 90% capacity and have barebones staff. Copper is not an inexpensive establishment, and with the prices that are posted, diners expect to have not just tasty food, but a full food experience. That is simply not possible when you aren't properly staffed."], ["Jane S.", "Very rarely do I go to a restaurant that, upon leaving, makes me keep thinking about when I can return. Copper is the only restaurant in recent memory that's caused me to feel this way. I had lunch at Copper for the first time 3 weeks ago, and since then, I've thought about it at least once every other day (if not daily). I can't say that I've ever had bad Indian food. Indian restaurants, to me, have always been more or less the same when it comes to taste of food and ambiance. Copper, on the other hand, takes Indian dining to a whole different level:Food: Had the mango lassi, naan, and Saag Paneer (my go-to Indian dish). Everything was spot-on and amazingly flavorful. Probably the best Saag Paneer I've had. Ambiance: One of the things that set Copper art was their location - a historic house-turned-restaurant - in the heart of South End. Service: attentive, but not intrusive. Lunch at Copper was far better than most dinners I've had at other Indian restaurants. Looking very much forward to my next visit."], ["Mohith S.", "Started with guns powder shrimps and we got 4 shrimps for 11$..that was ridiculous..but then we ordered chicken murgh malai which was yummy and also dessert gajar ka halwa with rabdi was delicious..Overall food is good and awesome but prices are bit expensive.. please check out their Menu before you go :)"], ["Sasha R.", "Indian food is almost always expensive, so I won't even bother to complain about that.  But the food here is good and they accomodated a special request, so for that Copper gets high marks.  The SAMOSAs are as expected.  Potato and pea wrapped in a nice fried crunchy dough. The chutneys are tasty.  Nothing out of the ordinary or that you couldn't get anywhere else (or make at home).CHICKEN CHETTINADU is not for the faint of heart (or palette).  My colleague was warned that the base was spicy, but she scoffed and said she loved spicy food.  Fast forward 20 minutes and there was sweat dripping from her forehead and her eyes and nose were watering.  I tasted the gravy, and thought it was great, but I didn't try to eat a bowl full of it.  All entrees are served family style, with rice added to the table.  We also got a bit of naan free but ordered extra with the meal.  No salt or pepper on the table, but they're happy to bring it if you ask.The ZESTY VEGETABLE BHAJI side was interesting.  Long julienned pieces of mixed vegetables, including beets, all mixed with a dry spice rub.  The traditional vegetarian menu offers PANEER MAKHAWALA, which is a red gravy similar to tikka masala or butter gravy.  Very rich and flavorful but not too spicy. I asked to substitue cauliflower / gobi for the paneer, and the chef nicely complied.  Overall this was a very tasty and well balanced dish.  The service was great, and the interior of the restaurant (located in a very old rehabbed house) is unique.  For people looking for more Indian options, try the University area.  It's full of great Indian hole-in-the-walls.  My personal faves: Persis (everything is good, but the Gobi 65 is amazing), Tulips (varied weekend buffet and good a la carte ordering) and Passage to India (great gobi manchurian and weekend/lunch buffet)."], ["Kristin T.", "Don't get me wrong: it's good food. Totally delicious. But I have to say that's it is a bit pricey for what it is. We loved the food but the check was a shocker considering our menu choices.Do get the cauliflower tikka masala appetizer. That was our FAVORITE of the meal."], ["Stephanie Y.", "Food wasn't terrible, the ambiance was OK yet I'm oddly pissed after eating dinner this evening at Copper.Pros  - Hmm...well my meal was serviceable.  Nothing to rave about.  But it was tasty.  I got the chicken tikka.  As did one of my dinning companions.  Our other girlfriend got the lamb.  Her review was similar.  Not bad, but not raving from the rooftops at how good it was.  I also give them props for automatically splitting the apps.  That's nice,  can you tell I'm digging for positives.  The Cons -  There's more of them and they are more concrete.1.  The service.  The hostess was very little help when I came in asking for my party.  She seemed clueless.  Now in fairness I guess she didn't seat them, but you'd think she'd know who was where based on the fact that it wasn't busy and it's not a huge place.  Our waiter - he was meh, and very slow.  I honestly can't tell you if they offer free refills as I was never offered a top off or refill of my diet coke!  It took forever to take our orders.  Also he was very little help when asked about the menu.  I'm sure he was knowledgeable,  but he didn't appear to give a eff quite honestly. 2.  The portion size.  For the price I expect a lot more.  For a table of three we were given one plate of rice to share.  Now all of our meals were swimming in broth.  Oh hell no, you need to keep that slightly crisp (was is supposed to be that way?) rice coming.  3.  One dining mate got a side of vegetables  -  which turns out was $7 bucks.  I repeat $7 bucks.4.  Yes Charlotte is in the midst of a record heat wave, but no excuse for being so damn hot.  Copper turn the A/C on high!Overall I won't be back and I don't get why people rave about this place.  I think there's better Indian that doesn't stink of 'try too hard' in Charlotte."], ["Devanshi P.", "Copper is a fancy Indian restaurant with a modern touch. You will not find all your typical North Indian dishes here. I have been here twice and have found the portion sizes to be bigger, although it is on the pricer end, but nothing too extreme. I would definately recommend anyone to go here for a nice dinner."], ["Vijay A.", "The taste is not very authentic. I did try the chicken chukka and their shrimp curry. The ambience is nice. Give it a shot for an formal dinner or a date! But not to try authentic indian cuisine."], ["M K.", "Horrible service. Server forgot to bring my appetizer and soup. Food was not authentic and low quality. Very overprice and noisy inside. Would not recommend this place to anyone."]], "Persis Indian Grill": [["Josam R.", "Great lunch buffet - awesome way to try different indian dishes! Love the paneer saagwala!!"], ["Purvesh D.", "Everything is fantastic. The only problem is when there is too much crowd, the staff is not able to maintain the quality of the food. Esp on Friday and sat nights. Chicken biryani rocks! It is advisable sometimes to order for a take out .. service is slow during crowded days. Desserts is not a speciality out here."], ["Srividya V.", "The best in Charlotte...paneer chilly highly recommend. Malai kofta and veg biryani were very tasty.. Most of the veg options have turned out to be quite tasty.. The buffet is also good.. Very good service.."], ["Evatini W.", "We visited Persis late one evening when there was a nice briskness to the air.  We thought it'd be a perfect time to warm up with some of our favorite food!  Upon entering, we were immediately seated and handed expansive menus full of incredible looking dishes.  Being vegetarians, we often seek out Indian food and Persis doesn't disappoint in their offerings.  A few experiences stood out that night.  Hang with me.  To start, I wasn't comfortable drinking out of the metal glasses, so I asked for glass and the waiter immediately accommodated my request without question.  Graceful and polite. Then, the strangeness began.  My husband had decided on biryani at spice level four. The waiter (who we later found out was the owner) tried to convince him that level four was 1. Too spicy for 'people who usually come here that aren't Indian' and 2. Asked a few times if we'd ever had biryani..that it was a very traditional dish.  Once we finally convinced him that both the dish and the spice level were adequate, he insisted upon bringing a sample of biryani so that my husband could try it before he bought it.  The funny part is, the sample was almost as large as a full order.  The spice level was perfect, the sample biryani was delicious, and the main entrée of biryani was a normal portion. They didn't take from it because we agreed to a sample.  I ordered chana masala with no spice. I found out later they call this  'baby mild' :-). However there must've been some confusion in the kitchen, because the owner told us that there was already an order of chana masala at level four that was confused with my baby mild.  They brought out a new order of Chana masala (still spicy) that looked suspiciously like my original AND offered a complementary order of any other entrée of my choosing.  The owner strongly suggested the paneer with fenugreek leaves. It was delicious and perfectly seasoned.  All in all, our meal was excellent with a couple of speed bumps along the way. But as they say, it isn't the mistakes but how you recover from them that matters.  We will visit again and again. Delicious food, super value, portions  - wow.  Keep up the hard work Persis!"], ["Ellen O.", "I'm a fan of Persis.  It's tucked away in a shopping center on the corner of Ballantyne Commons and Johnston. When it comes to Indian food, I don't have a huge repertoire of dishes under my belt, but what I've had, I've loved. It can get very busy on Sunday for brunch but if you can snag a table - it's well worth it - especially if you want to try a bit of everything. But just a tip - you may need to dodge several people in order to get your food and it can feel a bit chaotic with the number of people trying to fill their plates.  My hubby and I have done dinner here mid-week and it's quite enjoyable.  The service is very attentive and the servers are willing to answer any questions you have about their dishes. And for spicy food lovers - this place is for you! I usually go with level 3 but I think I can go a bit higher next time.  Their naan is really good  - chewy and crispy at the same time - and the chicken tikka masala is awesome - I could drink the sauce!   I look forward to trying something new next time."], ["Nancy Y.", "This is my favorite Indian haunt outside of the wondrously copious choices I had in Boston. Our go-to order - me: chicken vindaloo, him: chicken tikka masala, to share: two orders of garlic naan. The vindaloo comes with several big balls of potato, and is slightly on the garlicky side, but there is nothing wrong with garlic. The chicken tikka masala is also very tasty, and comes with a few dollops of cream. You can adjust the spice level accordingly. Prices are very reasonable (avg. $15 for dinner entree). They are also not stingy with their rice.The place gets busier on the weekends, so be ready for a wait. We had a nice chat with the manager/owner last time, and he told us this was the first Indian restaurant in Charlotte that served biryani. They cook it the \"dum\" style where they seal up the rice, seasonings, vegetables, and protein and let it cook until done. I've never tried biryani, but it's next on my list.This location in Ballantyne is a little far for me, but we still make it out a few times a month. They also have a University location that I'm going to have to check out. If you love Indian food, you've got to give this place a shot.Side note: Every time I've been, I've asked for chai and been refused. I guess they don't have it very often :("], ["Young Y.", "I work in the area and this is one of my favorite lunch spots. I probably eat here 2-3 times a week. The main reason I love this place is the variety in dishes they serve for their lunch buffet. Most other places I've tried they serve a limited number of dishes and chicken is the primary meat. But here, they got chicken, goat, fish, etc. And they seem to put out a couple new items a day so it doesn't get old or boring. They also do brunch buffets on Sundays too. Great place for healthy and satisfying lunch if your into Indian food."], ["Gigi D.", "Just had a FABULOUS Indian feast!The lunch buffet is nothing short of delicious! Known for their biryani dishThe veggie and chicken served is spiced perfectly with just the right amount of kick. The tiki masala is rich and creamy and the curry dishes are delicious!Highly recommend for those who love Indian food! YummyDefinitely coming back!!"], ["Matt S.", "Lots of good vegetarian options okra,eggplant, mushrooms, yogurt cheese (paneer), and garlic naan."], ["Sid F.", "I used to be a regular as it's close to my work place.The weekday buffet quality faded over months and now its horrible.Weekend buffet is okay.They need to improve the quality of their Vegetarian Biryani.***********************************************UPDATED 4/4/14**********************\"If i hear any complaints again,I will call the immigration department and ask them to verify the legal status of the workers there...\"I am changing my rating to 1 star because of the 'WONDERFUL' hospitality received last couple of times.Waiters must be waiters (just serving food and swiping cards!).There's one headstrong,rude dark skin toned Indian guy you 'must' avoid talking to ,if you are looking for a pleasant dining experience.I still stand by my previous review ' weekday buffet quality faded over months' and that's true.Today after a very long time,it was good and that's not just me saying that(my whole team of 6 agreed to that).Everything was good till the checkout.We were talking about the new Indian place(Cafe Nirvana on Providence) and how good the food is and the buffet prices. Suddenly,this guy(the one mentioned above.i guess his name is joseph) jumped in to our conversation and started talking about how great the food is at persis and some BS about the prices and quantity of food they serve.Who gives a damn man! We go to a restaurant to eat quality food and have a good time.You must be in a position to take the critics and improve. That was the main reason YELP was developed.And that's how businesses work and develop.We had a heated discussion for 5 minutes.When my turn came to pay,this guy charged me close to $13.90 something and rest of my folks $11.00(The Ballantyne corporate discount).I still have the receipts and can post them here. How's this fair??? Is it because of me saying that their food quality downgraded over the last couple of months and they must need to IMPROVE.....I'm definitely not going there again and I will ask my colleagues too to avoid this place."], ["Himanshu D.", "Unexpectedly, this is one of the best Indian Restaurants in Charlotte. The lunch buffet has been consistently good. The chicken tikka masala is really tasty, especially when drenched over the plain basmati rice. Every time that I have been back, there seems to be at least one Chef Specialty dish. On my last visit is was a Himalayan Spiced Fried Chicken. Little tasty chunks of chicken that really satisfied. The Sambar (indian soup) was really tasty as well. Pleasant staff that can sometimes be inattentive when the restaurant is very busy. But I've only been during busy buffet hours. The Bollywood TV shows that are generally on can be a little loud at times.If you like Indian food, this is definitely worth trying. Great food at a very reasonable price."], ["Victoria R.", "Food wasn't so fresh and I found it very bland. And the waiter was so super annoying!! He kept asking me questions and tried to flirt with me. Asking me question like ' am I single ?' Why am I single?' Then he started complimenting and saying stuff like 'you're so beautiful' ' when I saw you I was like wow' I found it very inappropriate and very uncomfortable. Never going back for sure."], ["Bryan R.", "This is my favorite Indian restaurant. Very good service and the food is wonderful. I've been here a few times and have enjoyed the experience each time. I highly recommend Persis!"], ["Jonathan C.", "This place has the best indian food I have ever had. Very authentic and the flavors make you feel like you are in Mumbai. The only problem is the service is very slow. Don't come here if you are on a schedule. The service is polite just very slow. I had the butter chicken. It was amazing."], ["Biorunup J.", "This is my first review to Persis after management change.The food quality and service is too good now. Especially on weekends biryani is delicious and Lamb and goat biryani worth it to try."], ["Mitch K.", "We discovered this gem on a rainy night looking for a restaurant.  Small, intimate and VERY Indian.Our problem was a lack of understanding about the menu offerings.  Lots of dosas and curries and what we ordered was excellent, but we could not understand the ethnic servers.  Even when the owner came over, we never really understood the dishes.They do offer a buffet lunch, but we have not been there for it and don't know if signage is there to explain what is being offered.Too bad, as it was packed with Indians with my wife and I the only gringos there.  You just know it is good.We are trying to get an Indian couple to join us for dinner there so we can get educated.If you are looking for authentic...this is the place."], ["Asha R.", "Came here w a large group on a Friday night. The evening started off smoothly enough - our waiter was friendly and quick to bring waters for everyone. The meal took a turn for the worse at that point. The waiter disappeared for 45 mins while we waited to place our order. When he got around to us he kept ducking out while we ordered to take care of other patrons. The food took nearly another 40 mins to arrive, so do not come here if you are starving when you sit down as I was. The food - to preface this I have eaten Persis catered food at many an event and have usually enjoyed it. However the waiter was not clear on spice levels so you have been warned - don't order above a mild (#2) unless you want to be crying in pain during your meal! I am of south Asian descent and I ordered medium spice goat biryani. It was nearly inedible.  Not to mention they had cooked the goat in way too many cloves. Chili paneer app was delicious, as was gobi manchurian, although gobi was again quite spicy. Fellow companions enjoyed their more mildly spiced lamb vindaloo. Now reaching the end of this epic meal, our waiter disappeared once again and the bill took 30+ mins to arrive after two companions chased him down twice. Once we got our bills we were told the credit card machine was broken and the waiter had to hand write (!) my number down to charge me later. So yet another warning - bring cash. My thoughts - if you have a craving for biryani or manchurian style (Indian Chinese) food, place a takeout order. But I cannot recommend sitting down for a meal."], ["Muhammad A.", "Food - 4 starsEverything Else - 0 starsThis might be the best Indian food I've had in Charlotte.  Unfortunately it was also one of the worst dining experiences I've ever had.The portions were weak The music was terrible and loud.  And our server was super awkward. He could barely speak English, hovered around creepily, and put his hands all over the silverware and plates. Literally the last guy in the world that should be a server (I've worked at a lot of restaurants). Ok, I get that you hired your relatives or whatever... but why can't your food runners at least speak English?But when it comes down to it, I put a lot more stock in food than service, and I'll def be back... I'm just picking up to go."], ["Sree N.", "Service needs to improve. Food is generally good, however. If you can look past the hit-or-miss service, then you'll like this place. Otherwise, you're gambling for a good experience :)"], ["Erin B.", "Beware of this place! My boyfriend and I had the intention of only ordering one dish for the both of us to share. When I asked for a recommendation the guy instantly said that he was going to get us one curry chicken dish and one spinach dish. We didn't even have time to look it over! He went straight to the back. Then he came back with a shrimp appetizer that we didn't even ask for and a beer that was the most expensive one on the menu, which we didn't ask for either. After we ate our food our bill came up to be $61!!! We realized that he ordered the most expensive dishes on the menu!!! The server didn't speak English very well so we couldn't explain anything to him but after he ran our card our receipt went up to $77!! He gave himself a tip!! My boyfriend and I were so angry, but their was nothing we could do. The food was amazing but I will never be returning to this location again. We got completely ripped off."], ["Siva K.", "I have been to this restaurant  twice after reading the reviews but all of themAre total lies  .. Once for lunch buffet and once for dinner .. Neither of them satisfied me . Buffet has very limited items and is just avg.. Dinner is the worst one I have in USA. I ordered a chicken 555 and a chicken boneless byani..  Chicken 555, I did not even touch a second piece after tasting. First one .. And have no words to say about byani.."], ["Julia M.", "We finally caught up with Denise and Chad the other night for socializing outside of a Yelp event. :-)  After stopping into to Duckworth's for a bevvy, we went to Persis for dinner. (Good call Chad!!) I must admit, I was a little unsure of how we would like it because the reviews on Yelp were a bit mixed.  However, I was impressed with our overall experience.  Even though the restaurant was pretty busy when we arrived, we were seated immediately.  Our service started out a little slow because our waiter was brand-new and did not know the menu.  We had questions, and he had to go get the manager (or owner) to help us.  I did not catch the name of the  manager/owner but he was so helpful and patient with our questions.  He also told us detailed information about some of the dishes and explained some of the differences about the various regional cooking styles & history about how some of the dishes were developed. Everyone was hungry, so we decided to start with a couple of appetizers. We also ordered off the menu for our entrees - which was good because I am not a big fan of buffets. Samosa - Crispy pastry turnover, filled with potatoes, peas, spices and herbs Served with chutney-  5 stars.  This was one of the most delicious samosas I have eaten.  The inside was flavorful and the crispy pastry was perfectly cooked.  Gobi 65 - Cauliflower marinated in Corn flour batter & spices, deep fried and tossed with yogurt and spices - 5 stars. Wow, I would have never ordered this if it had not been for the recommendation of the manager/owner.   But it was really delicious!Naan -  4.5 stars.  The naan was very fresh and tasty. Chicken Tikka Masala - Cubes of chicken roasted in a tandoor clay oven cooked with mildly spiced tomato gravy and served with basmati rice -  3.5 stars.  While the dish was flavorful, it was not the very best Chicken Tikka Masala I have ever eaten.  I got a 3 out of 6 on the spicy scale and thought the spiciness was just about right. Chicken Khorma - Pieces of chicken cooked in mildly spiced cream sauce with fresh cilantro (coriander) - 4.5 stars. Unfortunately, we didn't save room for dessert on this visit but they have some good selections on the menu.I thought the prices were very reasonable ($67 for 4 entrees, 2 appetizers, 2 orders of Naan, one coke, and one glass of Prosecco)  and the quality of the food was good.  I noticed that the majority of the other patrons during our visit were Indian, which I thought was a good sign."], ["Sandra M.", "when we first went to persis it had a great owner nuveen, he treat the staff well paid them far wagers and the rewarded him by taking control of his business while he was in India The is still basiccal the same works just with equal percebtage"], ["Unknown S.", "Quality and taste is degraded. Its no more like before. Never ever order Andhra chicken curry from their menu, that's the worst thing you would have ever had."], ["Scott L.", "Somedays I'm just craving Indian food and I don't want the buffet. I found Persis when I was in such a mood while in South Charlotte. Yes, they offer the buffet and it seems that's their bread butter for the numerous office employees in the area. However do not ignore their menu.After a hiccup when I arrived after they had closed after lunch, I came in already knowing what I wanted. As it was late lunch, I was starving so I started with samosas and fresh mango juice. it's such a pleasure to have fresh juice available in the middle of the day. The samosas were fresh made and light, the breading not too heavy as can happen. As my main course came a wheat roti flat bread with Daal Tadaka, a yellow lentil tempered with onion, tomato, and red chili served a generous bowl of basmati rice. I was very full and had enough left over to take home for dinner.Service was very attentive, a little on the hovering side, but I appreciate that more than the opposite. Parking is easy in the strip mall and it a multi state chain. They are sticklers for hours, I've arrived 5 minutes late for their lunch service to find the door locked and been turned away when I arrived 10 minutes early before dinner service started but the door was open."], ["TJ S.", "We had a fantastic meal at Persis. Our server, Joseph, did an excellent job of helping us choose our dishes. We had some in the group that were gluten free. This was not a problem and we ended up with a varied selection of foods. I highly recommend this restaurant."], ["Rod O.", "Since neither my friend nor I knew about Biryani, we decided to gamble on a new place and WON! BIG! ! !We walked in a saw Bhim (former Manager of the Blue Taj) and we were confident this place would be good!  They have only been opened about one month and Chefs are still arriving, they have done almost no advertising and at 1:35 Tuesday afternoon we walk in to a more than three quarters full Restaurant!  Most of the Patrons were Indian!We had Chicken Tikka Masala, Manchurian Chicken (an Indo-Chinese dish) Chicken Biryani, Salad and Naan Bread (Salad and Bread with Raita included with Lunch)... The Salad and Dressing were very good and the entrees were Exceptional!Since Persis is on a corner you have perfect access to the Outdoor Alley Dinning (shared with the neighbors and Persis staff will serve you there)!  This is a cool Dinning area!This place is plenty good and I'm confident they will only improve as they are getting ready for a \"Grand Opening\" once a few more Chefs with different Indian Region Recipes and skills arrive!10-3-12 Fantastic Lunch Buffet!  Chicken Tikka Masala was even better than last time!  We were the only Non-Indian Customers Again!!!  They say it is very Authentic!12-8-12 Dosa!  FANTASTIC!  Masala Dosa!  Shrimp Biryani!  Masala Chai  Cheese Kulcha!  Onion Pakoda and BUTTER CHICKEN!  Mango Kulfi for dessert!  Everything was Superb!!!  The Butter Chicken was our Favorite!!!  Bhim and the Owner both checked to see how we liked everything!  Service was Fantastic, the meal was Timed perfectly!Butter Chicken is a \"Gateway Curry\" so you can have it!  If you do not think you like Curry, you may sing a different song after this one!"], ["Anoop S.", "Finally a Biriyani place for Charlotte ! We had Chilli Chicken and Chicken Biriyani, both were mind blowing ! This is easily the best biriyani you can get in Charlotte ! Biriyani portion was huge, well worth the $12 ish price.The ambience is mundane, nothing special but does the job.Service staff are friendly but slow.  We got our food 25 minutes after we placed the order. But all these peeves vanish once you get the food ! Absolutely delicious !Since they opened up recently on July 7th, they only have limited menu titled \"Grand-Opening Menu\". But that includes most of the famous/routine items. Will I go back again ? Hell Yeah !NOTE: Their spice levels range from 1-6. The starters were pretty spicy with level 4 for me (I'm an Indian who can tolerate a decent amount of spice) . The biriyani was prefect with level 4 spice though !UPDATE: 7/9/2013After multiple visits, I have noticed that food tastes better in a la carte when compared to the lunch buffet."], ["John C.", "The best Indian restaurant in charlotte by far. The food is authentic and flavorful. The service is very attentive and helpful in explaining everything. You have got to try this place if you appreciate the flavors of India."], ["Salman C.", "Great authentic South Indian food!Last time I went I ordered Masala Dosa and Lamb Vindalu and try we're both pretty good.Service is extremely helpful and they really make it easy for those not so familiar with the cuisine, order any of their delicious dishes"], ["Neekosum N.", "Biriyani is real good. Goat is awesome. Medium is a bit spicy on biriyani. Kebabs are good. Naan is ok, curries are ok. Ambience is below the mark and service can be better."], ["Ken H.", "Food was good but the service was poor.  We waited for our order to be taken.  We ordered a glass of wine and it was forgotten.  Nobody checked to see how we e are doing.  We waited a long time for our check.  I won't go back."], ["Cat R.", "Tried this restaurant for the first time over the weekend. On Fri/Sat/Sun, the buffet was the only option. The food on the buffet was not very good. The Chicken Tikka Masala had no flavor, while the Chicken Biryani had plenty of flavor, it just wasn't a flavor that I liked. They had Mango Lassi drinks in glasses by the buffet, but the drink was warm, which is never good in a Mango Lassi. The 87.5 sanitation rating also threw me off.The restaurant is in a nice spot. I was actually hoping for a more casual style Indian restaurant, since this seems to be a chain, but it's a traditional sit down restaurant. Bim (sp?), formerly of Blue Taj, was running the restaurant the day I visited.I don't know if the dishes would suffer so much individually if ordered off the menu. I have noticed that the Chicken Tikka Masala on a buffet always seems worse than a fresh version of the dish. I just know that I was not impressed at all by the quality of what was on the buffet. I hope they do well, but I will probably not return for the buffet, and I'll definitely wait for that sanitation score to go up before I return again."], ["Lauren L.", "This is one of my favorite spots to grab dinner. Persis was recommend to me by one of my Indian co-workers, as I did not have much experience with Indian cuisine and she totally pointed me in the right direction. The Chicken Tikka Masala is delish! As are their chicken wings from the appetizers. Each time I go I ask the servers for recommendations, and every time they bring a new and exciting dish. The wait staff has always been attentive and very willing to help point me in the right direction with the food. If you want to try lots of different things I recommend the lunch buffet, it is a great way to try their food and it is very reasonable."], ["Soujanya E.", "I have visited this place twice both on Thursday only for dinner.first we have ordered chicken biryani and chicken 65 they both tasted awesome.next visit we tried dosa actually Thursday night is special for dosa.biryani was good.indians will like the taste.we have ordered fresh lemon soda also but that is not good.overall both the visits was awesome.we loved the lamb dosa very much."], ["Josh I.", "Loved the chicken tandoori and the chicken tikka masala. Butter naan of course. The service was excellent, Joseph was a star waiter, and overall an excellent dining experience. Good portions, good prices."], ["Caldwell T.", "I visited Persis for the first time this weekend.  I waited to go on Sunday because the Sunday Buffet is normally the biggest and the best way to get a taste of the majority of their dishes at one time...HOWEVER, this buffet totally lacked in variety. It was not even as many options as an average lunch buffet but costs a WHOPPING $13.99!!!!!The service was good and the food was okay, but definitely not a good value at all. I doubt I will make that drive again."], ["Clint P.", "I would put this place at the top of my list of favorite places to bring the family to, My kids loved the butter chicken. The place has a nice cozy vibe and the wait staff was very friendly and helpful with selections. Not only was the food top notch but the manager was very friendly."], ["John E.", "Wait staff was rude, limited buffet options for vegetarians (if you can believe that for an Indian restaurant). On of the buffet attendants tried to push me out of the way. Good food does not make up for a poor experience.  Won't be coming back here soon.."], ["Derick S.", "We have now been two times and both times, the food and service were fantastic. Naan is fresh, flavors in the food are also fresh and delicious and Joseph does a great job of recommending some items that he thinks we will enjoy. He has been spot on. Butter chicken, samosas, chicken tikka, methi chicken, goat dishes and the appetizer sampler are all excellent and we look forward to trying the rest!The atmosphere is cozy and it is the type of place where you do not feel rushed. Thursdays have great deals including half priced bottles of wine and discounted dinners. Have not tried the buffet, but will be regulars for a la carte dining. Glad to have found Persis!"], ["Sanjay N.", "Great service. Very friendly staff. We are coming here for last 2 years and every time has great dining experience. Best Indian food in town."], ["Josh L.", "Great Indian food, absolutely lousy service.  Best I've had in Charlotte, and most dishes are on par with the Indian food that I grew up eating in Central NJ.  Don't go during lunch - that's when most Indian places have their bland, americanized options out.  Their Indian dishes (especially when ordered Medium to Hot) are authentic.That being said, the service has been horrendous every time I've been there.  This last time, we were seated by the hostess fairly quickly, and within 2 minutes the waiter came over asking if we were ready.  We said no, so he came back about 5 minutes later.  We went with a Biryani (Chicken 65 Biryani), and the waiter's recommendation for a special when we said we wanted goat.  Ordered Naan, but the waiter was extremely pushy trying to upsell other breads, as well.  Once ordered, it took just over 30 minutes to get the food out - 2 dishes & naan.  And since we ordered around 7PM, the place was practically empty (but filled up around 8PM) so we should have only been behind 2 other tables of 2.  The food was dropped off by another waiter - the naan was cold, but nobody came by to check on us during the entire meal.  Trying to flag someone down at the end for the bill and a to-go box took a few minutes, and after requesting the bill, the waiter forgot about us.  Had to wait another 5 minutes to flag down another waiter (who acted shocked that we flagged him down when he wasn't working our table) to ask him for the bill and to-go box we had already asked for.Extremely similar service to previous experiences - slow to get food out, no check-ins from waiters (can't order more naan if we wanted!), slow to get the bill, slow once we gave them the credit card.On a lesser-reviewed note, they've recently had lousy health inspection scores - their 10/6 inspection was an 83, and 10/20 was an 86.  You'd think that after an abysmal score, they'd rebound a bit more (in July they scored a 94.5).  I'm trying to get my stomach ready for traveling to India, though, so I looked at this as a twisted positive...Overall, great food, but there is no sense of urgency or customer service among most of the staff, perhaps with the hostess as the exception.  Maybe I'll order take-out in the future to get the food without having to deal with the lackadaisical attitude of the staff & lots of unnecessary waiting."], ["Tim B.", "I was sitting here at work and kept hearing so many great things about Persis.  And finally got an opportunity to go with family and good friend.  The buffet was very good. Loved the pani puri and fruit custard.   Persis is known for great biryani.  They lived up to reputation.  Looking forward to return visit."], ["Gianna E.", "Place was completely empty at 7pm, waiter was sick, even said he had a sore throat,  and it smelled very very strongly of cleaning solution. Totally overpowering. I knew when I sat down we should leave, but  my guests wanted to give it a try. The naan was very good as was the butter chicken.  We also ordered the mixed veggie khorma,  and a rice and noodle dish which none of us liked compared to other places that serve the same dishes. All in all, I wouldn't go back, even if it were just for the chicken and naan."], ["Beanie E.", "As it goes for Indian fare this is frankly one of the best I've had. This more than rivals the amazing Indian food I had in London; a gastronomic hotspot of Indian cuisine.  The flavors and spices are quite fantastic and satisfying. The okra and eggplant are so yummy! Best comfort food ever. Don't forget the Naan."], ["Barath J.", "Unethical place. Ordered shrimp biriyani for take out and they mixed chicken with it and my wife doesn't eat chicken. And they have mixed it before also. When I called them about it they acted innocent. Cheats. Out of 3 times, they screwed up the spice level two times. Being honest is the first rule to run a restaurant, and these people are not"], ["Aanil P.", "Persis  in ballantyne no consistency everytime food tastes different and all hygiene lovers they store food containers in restrroms. Service is below par but I could live with that if food quality is better which is not at all. If its your you will get good food or else it would suck. I would try something else if I want good food for sure."], ["Stephanie T.", "After attending a Friday night event with friends... we used Yelp to search out something close for dinner. Indian sounded really great, and we had not tried this place yet. So glad we did! Not only was the food phenomenal, our waiter as well as the staff who came to our table to chat.. were extremely pleasant and helpful in assisting us with our likes/dislikes. This was a major plus for our experience! They do serve a buffet that at the time we came was not open. So this will be our next visit so we can try everything! Absolutely recommend!"], ["Shiroy C.", "The methi chicken and onion kulcha were delicious! The chicken in the chicken biryani was soft and fresh! The chicken 65 was also excellent."], ["Ben T.", "The food here is five stars. Hands down. Great flavors, various Indian dishes, and nothing that will make your nose run (too badly...). This is a marathon of a buffet that is understandably priced at $14 per person because it is the best Indian food in a 60-mile radius.Only reason I take this down to four stars is because of the service -- the Chai tea we ordered, though delicious and rich with whole milk, took about 30 minutes to prepare (they were making it fresh). And I understand how busy this buffet gets on a Sunday, but several of the marquee items (Chicken Marsala) simply were void of chicken - same for the Tandoori Chicken.Other than those two points above this is a five-star meal -- affordable, authentic, and well worth a drive for this living closer to Uptown :)"], ["Vivek D.", "Worst service EVER! We called in and placed an order for takeout. When we went to pick the order the guys shamelessly told us that they are OUT. How do you accept an order and then be out??? Very unprofessional staff. Stay away from this place."], ["Carson S.", "My girlfriend and I have been to Persis 4-5 times.  Based on my first few experiences, after it first opened, I would not have rated it this high.  Although the food was great, the service was poor and our server had a very difficult time understanding our order.  Also each dish took far to long to be served.  Since then, they have certainly figured it out.  Our service has been excellent the past couple times we've gone.  Joseph is extremely friendly and more than happy to explain menu items and spice levels.  The manager came around to ask us how we were doing and the food came out much quicker.  So from a service standpoint, Persis is doing it right.As for the food, it has always been outstanding.  Of the appetizers, I've tried the samosas, garlic chicken, fried jalapenos, and button mushrooms.  For entree, there are to many to name, but my favorite is the Chana Masala.  Also, they do not have Dal Makhani on the menu; however Joseph had it specially made for us.  I would give this 4 1/2 stars if it were available.  I highly recommend it and I promise you will not be disappointed."], ["Erick T.", "The tikka massala is on point but the Butter Chicken is where it's at!  I have tried several Indian food establishments in Charlotte and this is by far the best both for the lunch buffet and the evening service which feature large portions and informative service.  Dang now I've gone and made myself hungry :-)"], ["Karthik R.", "Ah, the long missing Biryani place for Charlotte. Charlotte had its share of Indian restaurants, few as they might be - but none of them had a good biryani, a good gobi manchurian, or a good (fresh) samosa. There were places with good north indian curries (mostly because of the amount of cream they used), but they either did not have the biryani, or if they did, they made it in the most horrible way possible.This is a brand new restaurant - its barely been 3 weeks since it has started (and I've already been there 10 times - that says something, doesn't it?), and while they are still experiencing growing pains, and having trouble dealing with the crowd that comes in, curious about the new place, the quality of the food, as well as the taste, is amazing. I can flat out say that these guys make the best gobi manchurian I've had in the US (and I've tried it at MANY places). I've already said a lot about the biryani, but let me add one more thing - it takes you back home. Its very tasty, doesn't have the raw masala we come to expect in Indian restaurants in the US, and its very well done.The curries they have are great as well. Due to the limited menu they have currently during the opening weeks, I haven't been able to try all the varieties, but of what I've tried, all of it is super tasty, not extremely creamy, and feels good in the stomach (if you've ever had indigestion issues after eating in some of these Indian restaurants, you know what I mean). The staff are extremely friendly, helpful, and very eager to help. Right now, Bhim (the manager) is probably the only one who is good at what he is doing, but as I said, its a new place, and it will improve over time. The chef is also very friendly, and is always open to any input you might have.Overall, relative to the other places around Charlotte, this easily gets 5 stars. I will probably go here again and again, until I get completely tired of the place, or a doctor tells me that it is very unhealthy to eat out every other day. :)"], ["Jennifer E.", "Hands down this is the best Indian restaurant I have ever been to, and I've been to dozens. The flavors are complex and very fresh.  I don't know why there are two star reviews of the service because each time we go the waitstaff is fantastic."], ["Dawn F.", "My husband and I are new to the South Charlotte area, and we love exploring Indian restaurants.  So far we have been to Blue Taj (4 stars-good, but sauces too creamy, and Bombay Grill - (2 stars, food absolutely wallowing in sauce, in fact, I can't find the food, no flavor, tiny portions, but decent naan).  Persis far exceeds the other two, both in food and service.  The ambiance has a cool vibe (didn't notice any Bollywood videos), blue and red lighting, hanging scarves to give a sense of intimacy and sophisticated music that you would find in an upscale hotel.The appetizers.  The vegetable samosas arrived to the table hot, cooked perfectly, and quite delicious, but did not come with any sauce (not sure if those are supposed to come with sauce).  We also ordered the cauliflower fried in cornmeal.  At first taste, it was way too hot (we had ordered mild) .  With near tears streaming down our faces and drinking buckets of water to get rid of the heat, after awhile one waiter came back and fessed up that ours may have been intended for a different table and we got the medium spicy and they got the mild.  So they brought us another and it was OUTSTANDING!  We thought that was really honest, something you don't find in a restaurant every day.The main course.  I ordered the chicken tandoori and the waiter explained it was an appetizer and suggested other main dishes.  I wasn't sure if he meant it wasn't enough food for me, but I stuck with my order because the first time at any Indian restaurant I usually order the chicken tandoori.  As it turns out, the plate was huge, and I did not finish half and I have a huge appetite.  My husband ordered chicken korma as usual, and he devoured it, yet still having leftovers for today.  The buttered naan was buttered perfectly and cooked to perfection.  Our waiter.  A word about Joseph.  He was extremely attentive, and nearly over- explaining things on the menu, suggesting this and that.  (Perhaps this was in response to some of the earlier reviews that talked about the waitstaff not knowing the menu).   In fact it was to the point we felt he was \"over-suggesting\", aka \"up-selling\".  We have noticed this in general in Charlotte restaurants and this one is no different.  His English was a little hard to understand, but he got his point across, and hey, after all, this is an Indian restaurant.  I would rather have Joseph as a waiter, and say \"no\" to most of his numerous suggestions, than have a lack of service.  There were several waiters attending to our table and as mentioned in another review, they did not communicate whom was doing what.  But that's okay.  It was very heartening to see most of the patrons were Indian!  That is always a good sign.  We will be back, and soon!!!  So glad this amazing restaurant is nearby."], ["Lakshmi V.", "This Joseph who served food for us is cool .. We ordered rasa malai , but they ran out of it and he served us fresh gulab jamun  .. It was complimentary .. It was yummy !!"], ["Kiran M.", "Rude staff!!! Checked in to give a party order,.. Got a rude reply.. Will never be back nor will recommend my friends.."], ["Charles A.", "This is a great southern India restaurant!  The staff is very friendly and the service is outstanding.  Be sure to ask for Joseph.  He is most knowledgeable and will order for you if you wish.  I strongly recommend you eat here soon."], ["Foodie S.", "I have been to this place twice, once for dinner where food and service was good.Second time, for lunch-buffet.Limited choice when compared to other Indian restaurants in Charlotte . Food was very spicy. Tandoori Chicken was not properly cooked could feel the raw flavors of paprika.The service was horrible.. We waited half an hour for the check.. asked the waitress thrice. Finally ended up paying at the counter. Not worth of $14."]], "Hyderabadi Biryani House": [], "Rajbhog Indian Food Market & Cafe": [], "Woodlands": [["Phillip K.", "Being a vegetarian, there are very few restaurants that have a diverse menu.  Woodsland is such a place.  I frequent various ethnic restaurants due to the fact that so many cater more to vegetarians than  American restaurants.  I also like the fact that Indian people frequent here as it lets me know that their food is authentic Indian cuisine and not some Americanized version of Indian food.  Their focus is southern Indian cuisine.   I am a regular customer.  They have an award winning appetizer, Samosa Chat, that is wonderful.   I cannot count how many times I have order that item.   They also have a variety of Dosas that many Indian eateries do not have on their menu.   They also have a variety of curries, rice  specialties and  assortment of breads.  They even have an organic menu.  I have been to other Indian places that may have better Dal Mahani but if you are a vegetarian and enjoy Indian food than Woodlands if your place.  The biggest drawback is that their service WILL be slow at busy time as they usually only have two wait staff working."], ["Sid F.", "Best vegetarian indian food in charlotte."], ["Tim C.", "I ordered the Palak Paneer (spinach with cheese) for dinner, and it was like most other Palak Paneers I've had in the past - nothing too special.  It came with rice.My main reason for giving it 3 stars (instead of more) is that the service was a bit slow and the portions were not very substantial for a dinner meal (especially for the price).Would I go back?  Maybe for the buffet, but not for dinner."], ["Nia P.", "I love this restaurant. I have not gotten anything that wasn't delicious here. The biryani is great as are all of the dosas that I've tried so far."], ["Bharadwaj R.", "Good food. Veg Uthappam & Tomato soup were good. Almost tasted like home cooked food. Booth seating could be better... The couches were not too comfy."], ["Pavneet S.", "Indian lady at counter...Lady like her will only have negative rating for business. Don't know how to deal with customers.We went for dosa lunch buffet and after serving 2 dosa they said it will be extra charge plus buffet charge in middle of lunch .They don't understand what buffet means and the lady kept coming to our table to tell us you can take once per dish in buffet.WILL NEVER GO AGAIN AND I SUGGEST EVERY ONE TO STAY AWAY FROM THEIR BAD TRICKS TO CHAGRE EXTRA."], ["G P.", "DO NOT WASTE YOUR MONEY HERE!!!!! I am late in writing in this review but I did want to get the word out there on this restaurant.  I have visited this place a few times and it was pretty good, however I went a couple of weekends ago & OMG the food was so nasty I felt I wasted $40 on Sunday buffet.  There was no salt, spices, flavor, or color in anything.  When you know what true Indian food tastes like and you end up eating something so tasteless, you wonder if the chef even tasted the food.  Not only that, but these people give you warm water and you have to ask for ice....what place does that? Not only that, it was a hot Sunday when I went and there was no A/C in that place. Charging $11 for buffet, you are telling me you can't afford ice & A/C...REALLY?!!! I read recent reviews on this place & no disrespect to anyone's taste buds but being Indian and knowing what the flavors should be this place DOES NOT meet the standards.  Please enjoy other places like Bombay Grille, Blue Taj, Persi or anything other that Woodlands.  If you give this place a chance, you're optimistic you'll get good food or you have a craving for Indian food and this is the closest place to you."], ["Arvind R.", "Average food in buffet, food www not hot, wierd combination of items in buffet.."], ["Veronica M.", "I am blessed to have a lovely boyfriend from Andhra Pradesh who is an EXCELLENT cook. Everyone flips out when he cooks and begs him to cook again. Honestly, I can't stand most Indian food, but he is a magical unicorn in the kitchen. Anyway...the man was starving last night and he wanted to take me to Woodlands. We ordered idli and vada for appetizers and a dosa and veggie uthappam for the main course. He tried to order something else that he saw on the online menu, but the server, who we assumed as American, had no idea what he was talking about and looked at my bf like he was an idiot. The server was kind of rude and dismissive in general. I've seen worse service, but still...When the food came, I must say that it looked delicious. It was very well presented and seemed to be very well prepared for what it was. The vada was tolerable. The idli was too heavy. The sambar was not that great, but the coconut chutney almost made me throw up (for an hour after we were done eating). I kept trying to eat, but with every bite I took, I cried to God for mercy. My bf asked if I wanted to order something else. I said only if he was going back to the kitchen to cook it. The dosa was pretty good and the uthappam was alright but I learned that you cannot take your leftovers home unless you want your car to smell horrific after the food cools down on the drive home. We had to stop and throw it out. I may give this place another try, but I'm pretty sure nothing will beat that man's home cooking.Three stars for what was probably decent food to other people, minus one for that rude server."], ["Annie W.", "A huge thanks to Julia S and Tonya P for turning me on to this place. I'm ashamed I hadn't written this review earlier, this place is fantastic. Despite my love for Indian food, I can never remember the names of anything I eat, so I'm just going to say that it all tastes great. Especially the curries. And the dosas. And the naan. And the samosas. I am so hungry, let's go back please. Don't mind the location and decor. Service is great and food is delirium inducing."], ["Sudha P.", "Great food . Chana bathura on here is the best"], ["Ashu S.", "I had been to this restaurant 2 years ago and had liked the food, so decided to revisit yesterday. But it turned out to be a bad decision for multiple reasons.First, the food was nowhere close to authentic Indian food.We had ordered several items on the menu ranging from north Indian cuisine, south Indian cuisine to Indo chinese. None of the food items were flavorful for what they were. Schzewan rice was very bland - no hint of vinegar or soy sauce or garlic. Samosa chat was dry and soft, the crunch was completely missing.To top it all, the servers were rude and paid little attention. We had been waiting for one item that we ordered and kept waiting until we could wait no more and decided to leave because of the the main servers asked us to \"empty the table\" as other people were waiting for a table. I have been to several restaurants that have huge influx of diners. But at none of those places you are asked to leave just because there are people waiting while you are still waiting on your order. In short, I was highly disappointed. I am never coming back again."], ["Foodie S.", "been to this many times... variety of dosas... chole is the best... veggie fried was just fine, not great...best choice for desi snack and breakfast... service is just ok.. have to wait for the waitress for a very long time..."], ["Drea G.", "Don't let the outside scare you, Woodlands is really a great restaurant. Clean and has very tasty authentic food at reasonable prices. Their dosas are amazing! They usually have a $9 buffet on the weekends as well."], ["Bob H.", "Woodlands has great vegetarian and vegan options as well as all organic options of Indian cuisine.  The food is fresh with outstanding flavor.  They have beer and wine to go with your dinner.  My only complaint was that the samosa wasn't the best I've ever had, but was still good.  It tasted like it wasn't as fresh as everything else I had. The rest of the food I had there was excellent, as was the service.  I recommend Woodlands for anyone who likes Indian food and is vegetarian or vegan."], ["David A.", "Best Indian restaurant I've been to in the Charlotte area.What they may lack in ambiance (it is relatively spartan, although they do decorate for Christmas by hanging ornaments from the ceiling), they make up with their huge menu options that are prepared quickly and deliciously. I appreciate that they serve the classics (palak paneer, malai kofta, etc), but also uthappam (think a pancakey pizza) and even some of the less seen southern Indian items, such as dosa (those comically EMORMOUS crepe-looking things you sometimes see, but never know what it is called so you never order. Yah, those). The food is consistently tasty, well-spiced, and decently priced. And vegetarians rejoice--you can't go wrong as it is all meatless!Plus, they have fantastic gulab jamoon for dessert--deep fried doughy cheese balls in rose water. Nom nom nom!!!!"], ["Neo N.", "Went with family for Lunch. With average expectations. We ordered Chola Bhatura, Chilli Pakora, Schzewan Noodles, Mushroom Masala, and more. As per my friend this was the best Chola Bhatura in US, I loved the schzewan noodles its like typical Indo-Chinese flavor that is available in India. Very good place, surprisingly very distinct Indian food."], ["Katie B.", "Excellent, authentic vegetarian Indian at indecently reasonable prices. Go. Like, now."], ["Elizabeth A.", "This is my favorite restaurant in Charlotte! The food is heavenly: super fresh and perfectly spiced. My favorite curry dish is the Paneer Makhani,. Favorite appetizer is the Paneer Pakora. The Poori bread and the Garlic Naan are to die for. The service is a little slow, but I am under the impression it's because they make your meal to order, from scratch... it's totally worth the wait."], ["Bethany R.", "Woodlands is everything I could ever want in an Indian food restaurant.  The food was excellent.  I have tried malai kofta and aloo palak at many Indian food restaurants and I can confidently say that Woodlands versions of these dishes is among the best.  The portions were a very descent size and there was just the right amount of spiciness to the food (if you like it hot, I recommend telling your waiter you want the food \"India Spicy\" , which the Indian patron sitting at the neighboring table told the waiter).  The naan was cooked fresh and to perfection.  The samosas were delicious.Not only is the food excellent, the menu items are very reasonable priced.  About $10 an entree and this INCLUDES rice, which typically needs to be ordered separately at Indian restaurants.Also, the service was good.  The waiter was attentive enough and the food came out very quickly.  The restaurant interior is clean and to the point.Honestly, I'm tempted to not even bother trying any other Indian food restaurants in Charlotte because I found a keeper."]], "Maharani Indian Cuisine": [], "Tamarind Fine Cuisine Of India": [["B E.", "The food is delicious, very authentic Indian Food. The naan is also very good.I have eaten here about 4 times and I am never disappointed! It would be nice if they offered specials for dinner, but it's still a great place to have Indian food!"], ["Sandra M.", "Excellent and chef owned. Which might seem silly but is extremely important. The food is always going to be good, he is never going to walk out, so the food will be constant. He is classically trained at the Taj Hotel in Mumbai, Makes a chicken tikka to die for and while the menu seems limited just ask and he will craft anything you would like."], ["Christine G.", "Excellent selection of Indian. Quality cuisine, worth it!  The chef / owner visited our table, he was gracious and kind. The food was excellent. Service was superb. Definitely going back."], ["Joseph R.", "We came to Tamarind based on some friends' high recommendations, and wow did it not disappoint. Super authentic indian flavors with the chefs own twist on traditional dishes. Chef Bhim Thapa does an excellent job of blending flavors from all regions of India, and you can tell from talking with him, that he is extremely passionate about what he does. The food was simply spot on. We ordered the Chicken Tikka and the Chicken Sorpatel, and I highly recommend both dishes...spectacular. The apricot butter Naan was excellent, and the mango lassis were a perfect pairing with the heat of the curries we ordered. While the place is small, you definitely get a very intimate experience when it comes to the staff and their care for their guests. I really can't recommend Tamarind enough...the food is superior to other indian restaurants in and around the Charlotte area, and if you are close by, I would definitely encourage you to stop by and see what Bhim has cooking!tripadvisor.com/ShowUser…"], ["Sherry S.", "The methi chicken is delicious and so is the apricot naan bread.  We're so glad to have found Tamarind on Yelp because we really love it.  I do wish the chairs were more comfortable -- and this is coming from someone who regularly flies in small aircraft seats.  I wish we lived closer to order take-out and bring it home instead to avoid the uncomfortable chairs."], ["Sean K.", "I travel a lot around the U.S. and eat out a lot. It was so great though to find this place right near home. This isn't just a great Indian restaurant....this is the best Indian restaurant I have been to in the U.S. or the UK. In fact they are one of the best restaurants I have ever been to. The look, the feel, the personal attention and conversation with the chef are just amazing. I have been a few times now. Everything I have tried is amazing in both taste and presentation. Even the classic that everyone knows chicken tikka masala, a dish you wouldn't think could be improved, is just somehow better than any I ever tried. All of their favors in all the food are just so vibrant and fresh and alive. You really taste the passion this chef has and the love for what he is trying to do with his restaurant. I can not think of a single negative thing to say about it. I imagine soon, I may be complaining about wait times :-)I do want to see them succeed so I encourage everyone to try them and hope you also experience the pure dining bliss that I have enjoyed so far."], ["Brittany K.", "Was in the mood for Indian food tonight. Found great reviews on yelp and decided to give it a shot. This place was amazing. Friendly and attentive staff. The food was excellent. Best indian food in the area!! I will recommend it to all my friends. :)"], ["Victoria M.", "My husband and I come here at least every other week for lunch. The waitress that we gotten every time is as sweet as can be, the atmosphere is clean and inviting, and the food is DELICIOUS. Bhim, the head chef, takes great pride in his work, and his passion for Indian cuisine is very evident every time we visit. He has taken the time to know us personally and comes out to ask how we are and how our food is tasting. We could not say enough good things about Tamarind!"], ["John S.", "This is a great new addition to the Matthews area. The appetizer Cholay Samosa Chaat is unique and delicious. There are several different options of naan and 3 dipping options for them. We will definitely be back."], ["Shane O.", "We ordered takeout and everything we ordered was delicious. Many vegetarian dishes with fantastic flavors. The bread was terrific and they were so helpful in being able to suggest possible vegetable dishes.Can't wait to try it again next time we are in Charlotte."], ["Jenn E.", "The food here is incredible. The best indian food I've had in charlotte. its really small inside but beautifully decorated. The service was awesome too. I would highly recommend going here."], ["Tracey W.", "Agree with all the positive reviews!  This spot has a great modern vibe. The food was incredible!  Server was very helpful in recommending and explaining the dishes. A MUST try if you like Indian. Very authentic and fresh ingredients."], ["George F.", "Fantastic food, great service, and nice atmosphere. A definite must try! Everything on the menu is solid, while a little pricey, it's well worth it"], ["Greg H.", "So happy there is yummy Indian food in the Matthews area! I visit Tamarind at least once a week. The ingredients are always fresh, you don't feel like your eating warmed up food from the day before. Usually I order the Methi chicken which is nice and spicy and very tasty. And the garlic naan is always warm and fresh, never dried out or cold like other Indian restaurants I've been to in the area. The hostess is very nice and the chef always visits the tables to make sure the food is cooked to your liking. Awesome place!"], ["Chetan S.", "Awesome Food and a great service. Samosa is delicious and best in Charlotte. Methi paneer and chilli naan were too good."], ["Nikhil P.", "The wait for a top notch Indian restaurant in Matthews is finally over! My wife and I had the pleasure of dining at Tamarind today for lunch. We enjoyed a delicious meal coupled with excellent table service and a warm welcome from the owner Bhim. Gone are the days trekking out to Ballantyne or Dilworth for some fine Indian food. Everyone should try Tamarind, you will not be disappointed. Please support your local restauranteurs!"], ["Mike C.", "Great food! We have been here numerous times and order something different every time. They have never disappointed us. Lunch and dinner menus are reasonably priced for the amount and quality of the food."], ["Patricia Y.", "After reading all the great reviews, my husband and I decided to give Tamarind a try. We were not dissapointed! The food was exceptional. They have some dishes we have never seen anywhere else. I tried the Malai Kofta (croquette potatoes in a creamy nut sauce). It was so good that I brought home the leftover sauce with rice to eat for lunch the next day. The owner/chef came out to talk with us for a few minutes to make sure we were satisfied with our meals. He gave us some background about the dishes and Indian food in general. It was a very enjoyable dining experience overall and we will definitely be going back."], ["Todd R.", "Tried tonight for the first time. We had the Bhuna Boti lamb appetizer which was excellent and the ordered the Tamarind Lamb Curry which was exquisite with just the right amount of spiciness! We finished the meal off with the Kulfi traditional Indian ice cream that is infused with Cardamom spice! We will definitely be coming back to try their other dishes! Wonderful wait staff also!"], ["Jackie F.", "I visited Tamarind with a friend for lunch on Friday.  This was our first time.  We were both impressed.  We both had the Chicken Tiki Masala.  My friend had it spicy; I had it mild.  It was excellent.  The naan that they give you is so light and very good dipped in the masala sauce.  They place a large glass water bottle on your table.  They must filter the water or use spring water because the water tasted very good.  They don't add ice to the water, it's already cold enough.  we will definitely be back."]], "Godavari Indian Cuisine": [], "The Blue Taj": [], "Jaipur Indian Restaurant": [["Davidson B.", "Jaipur has long been my favorite Indian restaurant in Charlotte.  I took my girlfriend there for the first time on Friday for dinner and it blew us away.  I guess on Friday nights they do a buffet which we chose not to get, but it had the one manager/server hopping the entire time we were there.  Despite the fact he was taking care of basically the entire restaurant, he paid amazingly close attention to us and was extremely gracious.  To wit, he started us with a complimentary appetizer of pakora, which was absolutely delicious.I had the lamb rogan josh, Indian hot.  She had paneer tikka masala.  I got some garlic cheese naan, and she got just some regular naan.  Both of our dishes were outstanding.  I can't help but order lamb every time I eat Indian food so I'd never tried their paneer before, but I stole a bite of hers and it was excellent.  My own dish was fantastic as well - a generous portion of lamb cubes in a delicious sauce.  Of course, the jasmine rice was terrific and perfectly seasoned, and the naan was excellent as usual.After we were finished, he then came by and gave us a complimentary dessert of what were listed as \"sweet balls\" - and boy, were they.  Basically donut holes in some sort of syrupy glaze (I'm guessing corn syrup was involved), they were intensely sweet...a bit too much so for me, but my girlfriend loved them.The food was terrific as usual and the service, while never disappointing in the past in any way, simply blew me away this time.  I will absolutely continue to visit Jaipur any time I need to scratch that itch."], ["Rohan C.", "Very bad food. Located in a seedy part of town. Was actually afraid walking in.Nothing was good. Even with the low standards of Indian restaurants in Charlotte, this one should be avoided"], ["Kelsey O.", "The food's great! This was our first time and we will be sure to come back. The service was excellent and so was the buffet."], ["Joseph P.", "Friendly worker(only 1 person working)Good food and varietyDrinks never run dryDownside, décor and bathroom are scary"], ["Aravindhan J.", "Great food. Very tasty. Buffet wasnt a very big spread. However everything was so tasty. The tandoori chicken was especially awesome. Big place."], ["Peggy C.", "I can only attest to the lunch buffet. First of all, the price is right. After tax it is $8.75. Between this and the one on King's Drive, it's pretty much my 2 go-to for Indian lunch buffet. Jaipur has good naan, a tomato soup that goes well with them, and the little fried chickpeas patties that are very tasty. There are typically at least 4 entrees options (vegetarian & chicken mostly) plus the must have tandoori chicken. This is a solid quick lunch spot when you're craving a little Indian."], ["Loretta B.", "We had the Sunday Buffet.  It was terrible. The food was terrible and there was one guy running the place who kept going outside.  So much Incense burning as you walk in too.  One of the worst restaurants I have ever eaten at. My husband liked the lamb curry so it got one star for that."], ["Rick D.", "Tucked into a strip mall, this Indian restaurant was surprisingly good. Not a big crowd at 7pm when we got there for dinner. My wife and I enjoyed the lamb samosas. Good flavor, nice and crispy and hot out of the fryer.  My wife loves chicken tikka masala, and this one did not disappoint.  My lamb korma was also rather tasty and the garlic and plain naan were very fresh, hot out of the oven.  The service was good and prices reasonable. We will be back."], ["Adam S.", "Look beyond the décor and give Jaipur a try! It may not feature items specifically from Northern India, but we had a very pleasurable experience there tonight.What we ate:Lamb Vindaloo (spicy)Vegetable Masala (mild)Garlic Nan breadSimple and to the point.  Our entrées came with a shared pile of Indian rice.  Beer and wine start from $4.00, which is right on point.I've not been to India, but grew up in Singapore.  Been eating lots of curry and for now, this will be our Charlotte spot.  Thanks Jaipur."], ["Shabreen H.", "After looking around for few days in town finally ended up here. Best service good food. This will be my meal for the rest of the stay in North carolina. Best of all I tried around this area."], ["Hillary M.", "Years ago, I came here often and enjoyed it. Now, not so much. Everything is VERY tired and the food is lacking in too many ways."], ["Steven P.", "Edible, but not really recommended for the lunch buffet. Limited selection, more bland than flavorful and no level of spice in either the meat or vegetarian dishes. The naan and rice were very good. Friendly owner and the restaurant was clean. Decor was sparse and restaurant had pretty loud Indian music, but it added a little welcome atmosphere."], ["A C.", "We are indian food lovers and were happy to find this place near our hotel. It is in a strip mall. We had the dinner buffet. Very mediocre and the food was dry and unappealing. Had we not been so tired we would have left. The gnats flying around our table were an irritation. Awful gulag. And it cost 15 pp. Don't bother."], ["Bret H.", "The decor is a little catty wompus but the food is delicious and reasonably priced.  It's certainly the best Indian food restaurant I've eaten at to date in North Carolina.  Tandoori chicken is my favorite Indian dish and they serve a really good one here.  I will definitely be back!"], ["Lora W.", "This is a great Indian restaurant. The owner was so sweet and accommodating, and made sure we always had exactly what we needed. The buffet was incredible smelling and looking-- even though we ordered off the menu, which was also great. I also enjoyed one of the best mango Lassis I have ever had! The place was also extremely clean. I will definitely make sure to come back any time I am in Charlotte."], ["Keita R.", "We lived in the Charlotte area 5 years ago and used to frequent Jaipur almost weekly.  We loved the food!  We were in town for the weekend and stopped in for lunch for old times sake.  The food is just as awesome now as it was then.  We highly recommend Jaipur!"], ["Dominique D.", "I did not get as far as to actually eating the food just  based off service alone I gave this restaurant one star. Restaurant opens at 5:30 for dinner I had to knock on the door for them to open promptly and there was a line of other guests waiting for the restaurant to open at 5:30. I ordered the vegetable masala the smell is obviously the spices of curry not masala . I told the gentleman excuse me this is curry not masala  trust me I've ordered masala and Curry before from various Indian restaurants in various states and the gentleman tried to argue me that I'm wrong and what I had in my hand was masala not curry so I just walked out of the restaurant."], ["Nikki D.", "Great food! Owner personally walked my friend and I through the buffet. Everything smelled and looked great!"], ["Raquel N.", "This is definitely a diamond in the rough!Located in a ghetto strip mall, but don't let it fool you. The hubbster and I have eaten here on many occasions and I finally have to tell the world (or at least the world o' Yelp). This place is amazing. I not only say this for the food. I say this for the customer service and atmosphere. It's a family owned establishment and you are treated just like one. I have tried their weekly buffet lunch and their weekend buffet dinner. I would love to go for a non buffet, but the food, selection, and price for the buffet is so good I just can't pull myself away from it:) The lunch buffet isn't as good as the dinner though, but I think that is because it isn't as busy. At least the times I have gone that's the way it's been. For the weekend dinner they offer appetizers, soup, 2 different kinds of rice, naan, and multiple dishes, plus desserts. For 2 dinner buffets, large Kingfisher for about $30! Who can beat that??? To say I need a wheel barrel to leave the establishment is an understatement. We even had our Xmas din din here. It was absolutely packed and it put the biggest smile on my face to know that this wonderful place gets the support and the recognition it deserves. I am proud to write this and to verbally tell people if they are looking for wonderful Indian cuisine this is the place to get it.Yummers!"], ["Claudia C.", "Service was really good. The person who greeted us (guessing the owner) seemed very friendly and attentive. That being said I would rate the food reasonably priced but OK when it comes to my standards for Indian food. It was bland to what I am used to at my usual Indian restaurant (Farmington MI). I will note I have worked for an Indian family for the past 9+ years and have had various types of Indian cuisine and LOVE Indian food in general but I prefer the spicier dishes. So if you are looking for Indian food but don't like things too spicy then this would be a great place."]], "Nirvana II": [], "Flavors of India": [["Elizabeth M.", "Great little lunch spot that I hardly ever remember! A styrofoam takeaway joint in Latta Arcade. The food is basic but well thought out and seasoned nicely. The samosas are a delight. Looks like a family owned restaurant, they're super friendly, no trouble telling me what's what behind the glass. It's a good little spot to drop in on for a quick bite to eat."], ["Dillan T.", "Walk across the street to Nirvana II and save yourself  the disappointment. I usually get the Chicken Tikka Masala and Chana Masala (chickpeas) and it has always be just 'OK'.  Last week I order the Chicken Tikka Masala and the gentleman served me two, lousy, small pieces of chicken- overboard on the sauce and rice.  Upon noticing this, I walked back in and asked if this was typical meat portion sizes and he responded 'Yes'.  After giving him the \"really, are you kidding me?\" look, he gave me a few more pieces.  Just not worth the $."], ["Misha T.", "Being super close to where I work will do wonders for them because I eat a lot of Indian food. Still the food leaves a little to be desired in the flavor department. Things just don't taste that strong and the naan is kinda soggy. On the other hand the portions are generous."], ["Heather W.", "Good food....sorry but I love Nirvana II more"], ["Demetria M.", "Small Indian takeout spot in Latta Arcade with pretty good food, although my veggie entree was a bit watery.  The naan was fresh which is always important.  I'll probably go back and try something different just to make sure they're legit."], ["Ramón Y.", "The food was OK.  The Nan Bread was good and so was the Somosa.  There wasn't really that much choice.  I got the vegetable curry and it was bland.  Normally Indian food the spices that stand out and really give good flavor to the food. The Chicken Masala tasted like Chicken with coconut milk poured over it.  I would go back there again if all the restaurants in uptown Charlotte closed."], ["Nicole S.", "The food was flat and not overly fresh. It is worse than its Uptown competitors by far. The portions, however, were generous, but that does little good if the food isn't great. I would not go back."], ["Uomograsso U.", "I decided to give Flavors of India a try.  Its close to where I work downtown and I work with a bunch of guys from India, so why not give it a try.  It's a very small take out place with about 6-8 dishes.  There are some other things like wraps, etc.  They had a special of 1 chicken dish with rice & naan for $6 bucks so how can you go wrong with that.  I ordered the chicken curry.  The portion size was a little small but the curry was very flavorful.  The naan had been sitting around and could have stood to be reheated a bit.  But overall not a bad place.  Since I'm not too knowledgeable about Indian Cuisine I'll have to bring some of my coworkers here and see what they think.  There are not too many Indian places downtown and Flavors of India is pretty OK."]], "Persis Biryani Indian Grill": [["Christina P.", "Loved these guys my husband and I have tried them for both lunch and dinner.Lunch experience: VERY BUSY! Your sometimes lucky to get a table if you arrive a bit after noon. We found one table that was right in front of the Buffett, so it was quite noisy. The food was great and appeared fresh and tasted great. I think it was considered pretty expensive for a lunch buffet however.  I remember us spending about 3ish dollars for the two of us and then two week later, it the price was reduced to 11 dollars. It was really pricy for what it was for the first experience. We have come back several more times and we have had a wonderful dinner there. I am a big fan of their chicken masala and butter chicken and the chicken chettinad.The waiter had checked on us thought our meal and was always full of the water jugs that they use for drinks. It appeared that they had a fully stocked bar with a collection of beer also.I highly recommend this place for a great dinner."], ["Mohith S.", "I visited the restaurant multiple times..Here is my take:Buffet is not worth trying ...Nothing seemed to be fresh..For dinner..Food is ok..Slightly over priced.."], ["Pragna A.", "Just back from their busy saturday lunch buffet.Food was exceptional ! From appetizers to curries to deserts, everything was on point, neatly refilled and hot and spicy.We were quickly seated and offered drinks and the used plates were removed time to time from the table.Though it was quite busy and noisy , it didnt stop us from enjoying the food because it was that good.I couldnt stop admiring how delicious DUM KA LAMB was, i had to refill the curry 2-3 times. Every non veg item was perfection.You could tell i am writing this review from the food coma this place gave me."], ["Bruce K.", "A little rushed, however the food delivered. Coming in, it was pretty empty, but I believe they had a reserved party coming in sometime during the night but I didn't see them. Anyways, we sat down and ordered our drinks. My parents as Asian parents are, ordered hot water with lemon. We got warm faucet water, which didn't really sit well. I guess tea or coffee is on the menu? I didn't check. However, let's just say the water isn't stellar/filtered. Or if it is, they need to change it.Anyways, what did we order? We ordered the 1. Butter Chicken - I enjoyed this dish. I know I listed this first, but I actually ordered this last because I was curious on how it tasted. If you question on what to order, this is a pretty safe order.2. Goat Curry - I wanted to try something new. The problem with this dish was that it's a little unknown on if you're just going to get a bowl of basically bones and not much meat. That's what made us a little scared about ordering this dish. What came out was a mix of what we expected, some of it was just bones and not a lot of meat, and then some of it was full of meat. It was sort of like half and half.3. Chicken Chettinad - Chef's special. Weird one here. I asked the waiter if it was dry or if it had sauce to it. The waiter said it was just dry rub. In my mind, I'm thinking okay just dry. What came out was it was extremely close to one of the other dishes that we order. I can't remember if it was the Goat or the Shrimp. Anyways, it did have sauce to it. 4. Shrimp Vartha Curry - This dish wasn't bad. It had shrimp mixed with a very similar curry. Both my parents and I enjoyed it.In the end, what did I think of Persis? Definitely a stop for our family if we're craving for some Indian food. This restaurant wouldn't have been an option if the 485 wasn't finished. Now, since that part of the city is so close now all these restaurants are not a 30-45 minute drive anymore. This place is definitely a viable place that we will be back here for an Indian meal."], ["Krishna V.", "Worst experience in food quality and taste!!Ordered many items. .none tasted good and non tasted like the actual dish name suggests.."], ["Monica M.", "Good, but not great.I came here based on the recommendation of the King, the guy with the most check-ins here.What they get right: variety - they have a nice variety here and they do serve biryani on the buffet which many places don't bother with.  They also had the obligatory chicken curry or butter chicken etc., the thing your non-adventurous fellow diners can eat.I enjoyed the way you can bring your food back to the table, reminds me of a dabbas carrier.  I really like being able to put my raita in a little bowl and the edge of my plate.  They have a variety of different sizes of metal bowls/tins depending on what you want.What was missing - tandoori, I like the tandoori chicken but I really enjoy the onions and green peppers that go with it.  Flavor - some of the items weren't up to what I had wanted.WARNING: This place is inconsistent.  I agree with what I read in the reviews about things being a positive experience along with those having a negative experience.  I don't know why but each time I go here the experience differs widely.My favorite Indian dishes, other than biryan, have been absent.  I love chana masala and all forms of korma.  I haven't seen rogan josh here yet.  I go here because it is close to where I live, but I am trying other places trying to find my sweet spot.Good enough most the time but not so good that I don't yearn for something better."], ["Hashani S.", "I wasn't super impressed with this experience since Aroma just blew me away a few weeks ago. I ordered a Goan breeze to start, was pretty good. It was like a strong piña colada. We started off with gobi manchurian and were sadly disappointed. Gobi manchurian is supposed to have this crunchy texture. It's almost like you shouldn't be able to tell the difference between this and orange chicken which was just lacking here. The we ordered the malai kofta and goat pepper fry. The malai kofta had 4 small, round dumplings and the sweetness of the dish overpowered the spice. On the other hand, the goat dish was so spicy it couldn't be finished. We also ordered the chicken biriyani. It had good flavors but was also lacking in heat. The waiters didn't check on us once nor asked the desired spice levels of our dishes. This is experience was ok but not amazing."], ["David H.", "Some variety for a very good price.I mainly like this place because my brother jumps at any chance to get lunch with me at this place.  The company makes it worthwhile.They have less vegetables in the tandoori chicken than I would like (I really like the onions and peppers).The shining star for this place is that they change up the buffet.  They keep staples like butter chicken on there as well as biryani (it is the Biryani Indian Grill), but they rotate in some very exotic items each time I visit.I actually don't care for the biryani that much, even though it should be the signature dish.You don't see much goat or lamb, these are items I am looking for.  Weekdays it is always chicken.  You should really head out here on the weekends and pay the extra $2 for the meats."], ["Sasha R.", "I've had a few disappointments recently at Persis, but overall the food is still my favorite Indian in the University area. if you are looking for something spicy, try the Gobi 65 appetizer. It's harsh and spicy but amazing! Unfortunately, the last time the Gobi was not crispy even though we ordered it extra extra crispy. When brought to the server's attention, he argued at first until we asked him to take it back to the kitchen. He returned shortly thereafter only to tell us that the kitchen said it was perfectly done. Since I've been to Persis and ordered this exact dish many times and it's always been crispy, I'm going to overlook it. But it was not a pleasant experience and made me reluctant to go back for a while. To be fair, the waiter later told us that the main chef was off that night, so I assume the Gobi got tossed in the sauce and left to get soggy for a few minutes. Timing is key on this dish. We've also recently tried the Chicken Tikka appetizer, and it was great.  It's served on a cast iron skillet with cabbage, onions and extra sauce in the bottom so no bite is without flavor."], ["Bony M.", "Always great food here, whether it's biriyani or any other curries. Try their Goat biriyani!"], ["Mohan P.", "Loved the courteous service. food  was amazing. Felt the real taste of Biryani. Had ordered gobi Manchurian and vegetable dum Biryani. Enjoyed both the dishes."], ["Peterson L.", "Came here last night for dinner. This was my first time having Indian food. The restaurant itself was nice, nothing extravagant. The service was good. The waiter had a really good feel for the menu and was able to give great recommendations. Both of our entrees was really good. I'll be back to try the buffet to try some more indian food."], ["Teri W.", "This is my favorite Indian restaurant and as it is my favorite food at this present time, l have tried all Indian restaurants in Charlotte and surrounding areas. We have around 5-6 Indian restaurants in the university area where l live. To me this is the best. Right now l have 6 restaurants close to me and 4 of them are on my street!! Lucky me!!! I always eat the buffet because l love trying all the interesting dishes. Many Indians eat here too!"], ["Aaron S.", "To be honest, this was one of the worst dining experience I've ever had. I refuse to go to this restaurant ever again. Really cheap looking interior. Water served lukewarm with no ice even on request. The waiter argued with us for asking to not serve the appetizer first but to bring it out with the entrees. There was multiple babies crying super loud because it was around closing time and the owners and customers refused to find s baby sitter and brought one year olds to a restaurant. It makes me unhappy that a place that had decent food had to ruin the nuance for its customers and I wish they improve on all of these points. Besides that, the flavors were good for the food but even with only 5 tables in the entire restaurant, the food came out barely warm. I really was hoping that this place would've been a great experience but I was entirely let down and walked out 26 dollars less in my pocket for just about 6 ounce portion of food off the appetizer and a biryani, and I drank water as well."], ["Jimmy P.", "It was ok, not great. I was not impress with the biryani. The rice is also a little too mushy. However, the samosa was great with the sauce."], ["Taste Buds T.", "Just back from their lunch buffet and it was the worst I have ever had at Persis. The food was cold and did not look appealing at all. The taste was not very impressive either. No much variety to experiment.Usually a fan of their biryani, I did not like it much today. The 'Meethe ka Tukra' was horrible.Hope it was just one of those bad days and they pull up their socks soon."], ["Sourabh S.", "I had a buffet lunch here on a weekend and it was really good.Being a non vegetarian ,i had all the options from mutton curry to chicken biryani etc.The gulab jamuns were exceptional ,liked them a lot .Wha i did not like there was the pan which was sold at the counter ,somehow it was a little bitter in taste."], ["Kriss M.", "Great food. I had the goat curry.My wife had the chicken tikka masala and she loved it.Ohh my mama,excellent food !Plus the chai( tea) that was superb . I'm from East Africa and that was close to home .Why fly home when I can dine here.I almost went to the kitchen to clap for the chef and pop his collar..Only thing I didn't like which is not a big deal, I wish our waiter greeted us.But she was good overall, thereafter. After all we went to eat and they fed us well."], ["Andi M.", "We found Persis after my husband passed by the place on his way home from the University area.  We've been back more than a dozen times already, and are always willing to drive the distance for their delicious food.  We've tried many of their appetizers, but our favorite is the paneer tikka.  Even if you don't like Indian cheese (or have never tried it), you MUST get this appetizer at least once.  The paneer is cut into large cubes, baked in a tandoor oven with a delicious sauce, and served with sizzling onions, peppers, and cabbage.  It takes a little longer to prepare, so order it first!On our first visit, I was initially disappointed with the few shrimp dishes on the menu.  But when I asked if there were any other options, the server offered me shrimp korma.  I'm a huge fan of korma, and jumped at this.  He also suggested switching my husband's dish from lamb vindaloo to methi.  We'd never had methi, so he jumped at trying something new. Both dishes are consistently phenomenal.  Their korma sauce is not your standard creamy sauce with raisins and nuts.  This is more of a mix between a korma and a tikka masala sauce, and it's my all-time favorite variation.  The shrimp are also nicely sized and perfectly cooked.  Their methi is similar in color to a korma (wit just a bit richer color), and it has a more complex flavor.  The lamb is always cooked perfectly.  We love our bread, and Persis's naan, roti and paratha are marvelous.  We always order extra so we'll have some with our leftovers.  And there always are leftovers, which usually taste even better than even the first time (if you can believe it)!The dining room and atmosphere complement the food.   They now play soft, relaxing music, which has improved our dining experience tremendously! Persis is our go-to spot for Indian food.  If you go, ask for the shrimp korma and lamb methi, even if they are not on the menu!"], ["Maya P.", "Came here the other day since I was really craving Indian food and was not disappointed. The butter chicken was delicious and creamy and the naan was very flavorful and the perfect texture. The rice was very flavorful and aromatic, definitely impressed. I got my food to go and the staff were all very friendly. I'll definitely have to come back as this place is only 10-15 minutes from my house. I am so glad to find a good Indian place near me! The other one I tried near University (passage to India) was just awful. I'll be back very soon to sit in and enjoy with a glass (or two!) of red wine :)"]], "Adisil": [], "Saffron Indian Cuisine": [["Rosie O.", "If you hate delicious tikka masala and fresh garlic naan then you are correct on not eating here. Because this is a great display of Indian food. If your nervous to venture out and try new things, opt for the buffet. It's a great way to sample a new food! Place is nicely decorated and immaculate! Owners are present when you get there to greet you. They also have a regular dinner menu great for date night!"], ["Chad E.", "I am not an Indian (American or Eastern) expert by an means, and I fully realize that my experience with the lunch buffet at Saffron may not be indicative of the quality of their food: It is simply to efficiently handle as many people as they can as quickly as they can, while allowing them to partake of a wide variety of offerings at the same time.That said, and while I have been known to visit a buffet or two in my time, this may not be the one to visit. The food on the buffet, while reasonably tasty, is typically served at varying temperatures. I do not know if this is a \"feature\" of Indian cuisine, or if the buffet table itself was broken, not being an expert, I just know that there seemed to be a difference in the temperature level of some foods.Also, while some buffets will provide good service - clearing plates, filling drinks, etc - Saffron is not one of them. The plates tend to stack up and the glasses empty quickly without being refilled. When someone makes it by, they are friendly enough, it's just that they seem understaffed - or busy doing other things.Since they are on the other side of town, I'm not sure that I'd make the trip often."], ["Jacqueline P.", "So I came here for lunch with a friend the other day and I have to say I was sorely disappointed!! The buffet was sad!! Seriously they had a tikka masala that looked like a random watery chicken curry. In fact all of their options were watery!! I'm not sure what happened as the first time I came it was a solid 3 1/2 stars now the only thing making me give it 2 stars is it was cheap and the samosas with tamarind sauce was good. The waitstaff seems really off as well. They didn't seem to want to be there that day. All in all I highly doubt I will ever come back, I came out of convenience and well totally wasn't worth it!! Watery curry and unidentifiable selections are a clear sign to stay away!!!"], ["Khalia B.", "This doesn't surpass the Indian restaurant I frequent in California but this qualifies as very tasty. I ordered the Tandoori chicken, mushroom matar, naan and chicken curry. The naan had a slightly different flavor than what I'm accustomed to but it was good."], ["Aditya K.", "Pathetic place, poor service and attitude of the owner. Definitely a place which one can give a miss"], ["Thomas M.", "Happened upon Saffron and was really impressed! The appetizer sampler and chutneys were spicy and delicious, the service was excellent, and  it was a perfect meal from start to finish.I had a spicy chicken biryani and my date chose  channa masala (vegan), and we were both raving. Finished up with a warm dessert that was like donut balls in a honey syrup.Neither of us live in Charlotte, but if we did, we'd be regulars. Wonderful dining experience!"], ["Crista P.", "I came here yesterday with a friend for the lunch buffet.  I'm not one to really care for buffets but I have been wanting to try an Indian one for awhile.  For about $9 I ate samosas, naan, a spinach & chickpea dish, aloo gobi, & vegetable biryani.  My stomach did feel weird the rest of the day but it may have been because I ate 3 huge plates of food! Definitely hit the spot for my Indian food craving.  Service was nice, although a bit slow on refilling water.  I will admit I probably drink way more water than normal people when I go out to eat.  I also ordered a chai tea & I guess it wasn't what I was used to because it tasted really watered down.  Our total bill for 2 lunch buffets & a chai tea came out to under $23 not including the tip but we left happy & stuffed.  Looking forward to my next visit!"], ["Emily D.", "Very nice atmosphere for dinner! We had samosas for starters which were pretty nice. I feel that some samosas have a bit of a frozen and then flash-fried taste but these tasted pretty fresh and had plenty of filling. I had channa aloo masala (a chickpea and potato dish) and my husband had chicken tikka masala.  When you go for dinner you will be asked for your spice preference on a scale of 1-10. I chose 7 and was very pleased! I love spicy food and it was perfect for me. My husband chose 10 and loved his as well. Very friendly staff and a laid back atmosphere. Definitely will return especially with the Groupon!"], ["Soujanya E.", "I went to this restaurant on Saturday.we have ordered vegetable Manchuria,kadai paneer and tandoori roti,vegetables Manchuria was good but they have given only 5 manchurian balls which we feel bit less quantity but the taste is too good.kadai paneer was also good but bit spicy for us we have ordered 6 on spice scale might be 5 is enough for us.for indians who want more spicy they can go for 6 on spice scale.overall the visit is good and lastly we liked the ambience very much."], ["Don W.", "Really enjoyed this as it was my introduction to Indian Food.  The lunch buffet was great and let us try all the different varieties.  Thanks for the treat.  We will be back!"], ["Rohit P.", "This is my first review ever. But I have to write this. Went there for dinner. Found hard stone like black stuff in dal makhani. I had ordered daal for my kid. When I called the lady at the counter and told her, instead of saying sorry, she says thanks for letting her know and went straight into the kitchen with that stone. Service was pathetic, they won't come to the table after serving to check if we need water or other stuff. Never going back again."], ["Arpita M.", "So I've had the lunch buffet here once; was alright. I thought the dal and chicken curry was very tasty. The rest was just OK. Based on it's potential my husband and I dined there last night & ordered a paneer tikka for appetizer & the special for the day-goat curry (which comes with rice). a) the paneer tikka quantity for $7 was a shocker. It was TINY and worse than that, the paneer was definitely old. It was hard and had rubbery corners. When we passed on the feedback to our server (point to note: very politely, making it known that we just wanted it cleared because the paneer tasted stale), he actually argued back saying the paneer was fresh. That felt rather inappropriate. The goat curry looked great but was almost tasteless. No salt, no spice :-( I was disappointed in all."], ["Beth S.", "I cannot believe I have not already written a review for this restaurant. It's seriously one of my favorite places to eat. We frequent the lunch buffet at least once every few weeks, more if we can! I have been there at night and I think Saffron is a whole different place in the evening.I consider everything they cook amazingly good, but their specialty, in my opinion, is the chicken tikka masala. It's usually on the buffet and I eat entirely too much of it every time I go. It's probably contributed to at least one dress size that I'm battling.In addition to kick-ass food, the service is impeccable. You take a single drink and someone is right there to refill your glass. Plates are whisked away quietly while you're at the buffet loading up again.Now, as a side note, which may or may not be important to you, the decor in the restaurant is truly lovely. At lunch you notice it and appreciate the delicate artwork and calm but spicy color scheme. But in the evening, this is a great place to take a date. With the colors and soft window dressings, this restaurant is elegant and understated, without being stuffy and expensive. The food is spicier at night, so be aware of that and order lots of lassi if you can't handle a little heat."], ["Avinash Kumar R.", "Dinner: had Dosa and Baigan bartha. It was good. Lunch buffet: was also good."], ["Hayley H.", "Saffron is very \"so, so\" for the price of the food I would rather go to Blue Taj or Copper since they are highly superior... If you get food to go be warned to get very little rice .....  There is better out there ....."], ["Carolyn L.", "I love Indian food. But I seem to managed to order the same thing everything I come to Saffron. It's the Chicken Tikka Marsala, Aloo Goobi and of course the nann bread. I usually tell them to do it non spicy because I can't handle spicy food at all. And I love it. I love how every time I order the food it taste as good as the last time. Their services have gotten way better since my previous review. I also like their lunch buffet. If people are interested in trying Indian food. Their buffet is a good place to start."], ["Mandy T.", "After 3 visits, this has become my favorite Indian buffet!!! I never eat alone, but today I craved this place so much, I made an exception. The chicken tikka masala is perfect for those of us who love Indian but can't handle too much heat. The naan is delicious even if it is a little burnt.Totally deserving of 5 HUGE stars!"], ["Terri K.", "We found this place while looking for another restaurant and thought it would be great to give it a try. It was during the lunch buffet and since I'm a vegetarian,  I thought to myself that you can never go wrong with Indian food. Since we've been to 2 others in the area (Spice South Indian Cuisine which is now Peacock Indian Cuisine and still amazing, and the other place being Jaipur) we thought this place would be a nice spur of the moment change.  First off the vegetarian options were very slim with only about 4 options versus the many chicken dishes. I got some of the vegetable biryani and naan and my husband got the other vegetarian dishes that I didn't get. I took one bite of the naan and the biryani and was instantly done! The flavor was non-existent and the rice was dry. I tasted the dishes that my husband got and they tasted like baby food and like they had come from a can and cooked in the microwave. I am not Indian, nor do I consider myself an expert on the subject of Indian cuisine, but, Indian food is my favorite kinds of cuisine and I've eaten and cooked enough of it to know that this was NOT good Indian food. Anytime I can cook your food better than you and I'm not \"you\" there's a problem. The food was elementary at best. We spent less than 5 minutes in this place, and even though I didn't feel like I should have to pay a rusty nickel for such a rudimentary execution of a meal, I did ($25 + a $5 tip for NOTHING) simply because I was already so disappointed and just wanted the experience to be over. Anyone that knows me, knows that nothing messes up my day more than bad food. If you think this is good Indian food, you are cheating yourself because you have obvoiusly not eaten GOOD Indian food(because there is a difference). And this place should certainly not be called \"Fine\" anything. I'm only giving it one star because I can't rate it any lower."], ["Amanda Y.", "We ordered carry out from this place and it only took about 20 minutes. The saffron chicken tikka masala and korma chicken were delicious. I asked for medium heat and it was still quite a bit spicy so I recommend mild if you don't like your food too hot. The spinach and cheese stuffed naan was excellent and one order is definitely enough for 2 people."], ["J T.", "I've come here once w my family and twice w my company. The food is ok- edible but definitely catered to Americans. Not much flavor or spice. Place is clean though and in a good location. If I were footing the bill I'd be headed for some of the better Indian restaurants in charlotte."]], "Bombay Grille": [["Michael C.", "Dinner from the menu is leaps and bounds better than the buffet at lunch. Otherwise pretty good Indian food. Love the staple Indian dish, chicken tikka masala. The naan is great too.The staff James good. They're very attentive and the restaurant decor is great. Indian restaurants are known for their lunch buffet. I enjoyed dinner at BG but the restaraunt's buffet wasn't great so I couldn't give it 5 stars. I actually debated giving it 3, but ordering from the menu will result in a great experience, so I will go with a 4. Also, while the atmosphere is definitely kid friendly, almost all of the buffet options are fairly spicy, too spicy for almost all kids. I love spicy food so I enjoyed it and it wasn't overwhelmingly spicy for me and wouldn't be for most adults. Again, when you order from the menu, this is not an issue. Cooper on East Blvd is a great Indian cuisine option."], ["Mara P.", "Great food!! I highly recommend this place. It was so flavorful and really enjoyed their naan."], ["Seth A.", "I'm teetering between a 3 and 4...but I choose a 4 and I'll tell you why in a second.I came with friends a few Sundays ago and I fell in love with this type of buffet-I generally equate buffets with Golden Corral and run the other way.  For a newbie to Indian food, its great to be able to try a little bit of everything.  If you love food that uses a variety of spices in unusual combinations (not necessarily spicy as in hot), Bombay Grille provides a nice introduction to Indian food.The buffet is small-ish and usually has several chicken dishes-butter chicken, curried chicken, and chicken vindaloo among others.  The sauces are out-of-this-world delicious and even the paneer (Indian tofu) has a bouncy texture.  The buffet includes fresh naan brought to your table, which you can dip in the delicious sauces from the entrees.  They have a strange looking dish that is chopped spinach, mint, and chickpeas-looks like baby poo but tastes delicious!  The reason that this place deserves 4 stars is the mango custard desert.  It is creamy. delicious, and helps cool off my over-spiced American palate after a spicy meal.  I would bathe in this stuff if I could!!!  Be sure to save room for dessert.  Tip: The Sunday buffet is more expensive ($12), so try it during the week if you're budget-conscious."], ["Karthiknathan S.", "Probably one of the worst Indian  food I have ever had in USA. Went there for Sunday buffet and the food was terrible. Serving is bad and avoid this restaurant."], ["Jason K.", "No, I haven't been to India. No, I'm not going to india, YES, I love indian food! This is one of the top indian restaurants in Charlotte. I've only ever eaten their buffet ($9.95 weekday) and thats just fine with me. I love to try a little bit of all the different flavors, and then wash it all down with a mango lassi. If you live anywhere in South Charlotte, its worth trying. It isn't a fancy place (if that's what you are looking for), but it's fine, and the food is why I keep going back!"], ["Arunkumar K.", "The best place for Indian food in Charlotte. I tried lamb briyani, gobi lasanwala, naan, chicken tikka. Everything was perfect."], ["Elizabeth A.", "Visited here for the first time on 1/21/2012 with a Groupon!Atmosphere was nice, dark with lots of recessed lighting, you could definitely go casual or dress fancy and be in place with either. The service was really good, fairly quick to take your order and bring out plates. Plus, they had a waitress constantly refilling your glass of water (which can be a blessing at an Indian restaurant if you accidentally order something to spicy for your taste!)Half of the menu was vegetarian, thumbs up for that!!I was impressed that they immediately bring out a complimentary plate of very thin flat bread and chutneys as soon as you're seated. We ordered the veg sampler appetizer, which was pretty good. I definitely preferred the paneer pakoras and cauliflower pakoras over the samosas. I ordered the malai kafta as my main course, good. Garlic naan and paneer bread were very impressive.I enjoyed Bombay Grille, but it doesn't top the quality of food at Woodlands... I'm forever spoiled."], ["Albert L.", "Loved the lamb madras and the Peshawar Nann. The lamb was cooked well with just the right amount of spices. The peshawar nann was something I never had before. It was filled with shredded coconuts, cherries and cashew nuts."], ["Grace S.", "What a hidden treasure!  Wonderfully authentic and fairly priced.  My friends and I came here for their Sunday lunch buffet and we were not disappointed in the least bit. I was skeptical at first over the location and feel of the restaurant.  The joint is fairly dark (and, I hate to say it, but- dumpy).  There also seemed to be a thin filmy layer of grime on the benches.  After much convincing, my friends finally got me to stop complaining and try the buffet.We, of course, tried everything (as that is the right thing to do at a buffet). Everything was a literal burst of tasty fireworks in our mouths and we spent the rest of lunch raving about how wonderful the food is!  We also ordered a side of Samosas (not included in the buffet) and I would highly recommend them to everyone who eats here.  I will definitely be back for a repeat!"], ["Raghav K.", "Very good service, food was very well cooked, taste was okay. Served even after closing time."], ["Ritesh P.", "After reading some of the reviews here on yelp, we wanted to give this a try. We went here for a lunch buffet on a weekday, had to wait few minutes while the table was made ready. Were somewhat disappointed (probably due to higher expectations). There were hardly any choice in the appetizer selection and very limited options for vegetarian palate. The saving grace was the naan which was continuously served at the table, fresh and warm. The overall experience seemed somewhat disappointing."], ["Jacqueline P.", "This restaurant had been recommended to me many times and while my Aunt was visiting for the holidays we decided to try it. I will honestly say my experience with Indian food is fairly limited but I LOVED Bombay Grille!  We ordered the Samosas, garlic naan, chicken korma, and chicken vindaloo. I love spicy so we got level 4 on the korma and the waiter warned me the vindaloo was very hot. I have to admit the vindaloo was super hot lol... It was amazingly good but it did make my eyes water at first. The korma was a perfect 4 and was very good! As for the naan an samosas, I was in heaven both were awesome. The rice was okay (seemed a little under cooked) And that was my Only negative. We also ordered 2 masala chai teas and my aunt was impressed said it was the best she's had! All in all this was a fantastic experience, the staff was attentive and helpful and I will be back very soon to try more of their dishes and their lunch buffet!!"], ["Jack M.", "Despite the atmosphere (not too inviting), and unfortunately the slow service, the food was actually good.  This appears pretty consistent as I read the reviews before trying it out with the family."], ["Melissa P.", "The smell of this place was a striking mixture of chai masala tea, cardamom and curry spices. The wait staff sat our group of four in a small middle table. This was a bit uncomfortable and we had requested a booth, but hey, they were busy.We started off with two appetizers along with two bottles of La Crema, a delicious white that quenched the flame of the hot vindaloo dishes. My favorite appetizer was their sweet peshwari naan with cherries and coconut. This stuff tastes like pie filling!  Add to that the freshly baked puti (puffed bread) and we were on our way to fantastic meal.Bombay Cuisine shines when it comes to curries, offering seemingly endless variations. Plus, you can choose the level of spiciness to suit your own tastes.  We ordered a five, not American five, but Indian five. The extra chilies cleared my sinuses and made my temperature rise.As a vegetarians I found nirvana in the muthia (Indian dumplings) in a  vegetable cream sauce. We ordered three different curries and the carnos ordered tandoori chicken. The curries were served with basmati rice.Overall the best dish was the peshwari naan. Never had I experienced a bread product that thrilled my taste buds in such a way. If you go try this naan and surely you will walk away satisfied."], ["LA T.", "I love Indian food, and this place used to be my favorite.  But starting 2-3 years ago the food went downhill. We tried it again recently and sadly I won't try again for quite a while. The pakoras lacked flavor, like something microwaved. The entrees were very disappointing -- Chicken Palak was the worst I've had anywhere. Bummer to need to post a negative review of a previous favorite. Hopefully the food returns to its prior quality someday soon."], ["Paul D.", "The food here is quite good, and each time I come here, I order a different take on a lamb dish.  I've never had their chicken, fish, or veggie offerings, just lamb.The service is attentive, and the place is dark and nice.My favorite is the cheese and garlic naan.  This probably isn't a real, traditional Indian side order, but it is nonetheless very delicious.  For their lamb dishes, I always order a 5-level spiciness, and even at that level, I find it to be rather non-spicy.  That's ok though, because I am really ordering it for the lamb.There is however one BIG COMPLAINT I have about this restaurant:  The servers always, always upsell.  What I mean is, they always ask if you want to order more, an appetizer? dessert?  alcohol?  I KNOW this is a common practice to get a higher bill, but seriously, I am an adult, and I know what my caloric intake should be.  I suppose white America is all about excess, and ordering tons of food.  Anyway, stop upselling!  I can afford to eat out a lot, I just don't like wasting food."], ["Jeff M.", "Great Indian food! There is always great food on the buffet. Great for take out or dine in. Kid friendly."], ["Ami T.", "I restaurant is great and i love their catering services.  If you need a half pan or pan of curry for a party, they have very reasonable prices.  The dishes are filled with paneer, meat, or veggies.  They do not skimp... great way to feed a crowd and keep your kitchen clean.They also catered my wedding.  I really can't tell you how great they did, especially since they had to make the trip to Columbia, SC for the event. The Indian restaurants in my hometown leave something to be desired, so we went with a Charlotte catererWe had a tasting at the restaurant, the owner drove down to the site to see the venue and attended the event to make sure everything went well.  The food was perfect, looked great and tasted even better, actually, it tasted even better than the tasting samples.  We were so impressed and everyone said they would be using his restaurant in the future.  Am I gushing?  Well, I guess I am, which is really rare for me... its just that through this whole wedding process, you find that it is rare when a company really lives up to their promises.  They did a great job, very professional."], ["Kathy C.", "Reasons I will never go to this restaurant again:-Out of all the empty tables, the waiter (a creepy, older man) sat me at the table against a wall right next to the door, pretty much isolated and alone.-The waiter tried to find out where I was from (my ethnicity), where I lived, whether I was working that day and whether I was on my lunch break, whether I was married, and whether I lived alone or with my parents. -When I was getting food from the lunch buffet, my waiter would pop up from behind me and point to the last dish I got and say \"This, very good.\"-When the waiter had nothing to do at the moment, he'd stand against the wall across the room and just stare at me. I felt extremely uncomfortable there, and the buffet was not worth its price."], ["Kristi V.", "My friend and I went last night to Bombay Grille. We started with samosa (she ordered and oh boy what a good choice). They are very filling and come as two big pieces. I ordered chicken palak. It's quite tasty but a little spicy for my taste. Next time note to self to order only #2. Luckily, the waiter was very prompt in refilling my drink. The garlic naan was sooo yummy! I can eat that for dinner with the sauce of Chicken Palak. I wish this place only 10 minutes away from my home..."], ["Himanshu D.", "Great consistent quality of food & service. The lunch buffet is perfect for begginers in the Indian food genre. Very clean & pleasant decor."], ["Sarah M.", "My favorite Indian restaurant in Charlotte! The food and service are excellent."], ["Elle L.", "The service here is fantastic, but I'm not quite sure the food is worth the price tag. If I order take out for two for dinner, usually the bill runs about $30. Again, dining in is great, the wait staff is very friendly and attentive. There's nothing exceptional about their dishes - and it doesn't taste any better or worse than any other Indian food I've had. If you ask me, the private owners of these little, ethnic restaurants charge way too much for their food. Even the Thai places I've been to in Charlotte are expensive."], ["Starry r.", "2nd time we have been to this restaurant and it was great!  The service was good the food was great!  They will alter the food to how spicy you like it.  I would definitely recommend this place!"], ["Crispin B.", "First time eating Indian food.  Great staff great food.  clean.  All around excellent.  Can't wait to try it again."], ["Diane D.", "The service is a highlight. But the rice tastes... plastic-y to me. The paneer is very bland compared to what I've had at other restaurants. It left me missing Bombay Cuisine and wanting to try the Turkish restaurant across the parking lot. The sauces were really tastey and they do a good job of adjusting the heat up or down according to tolerance. The garlic naan seemed really thick- which could've been a fluke because I don't remember it ever being like that before. I've been here about 5 times.  Nice atmosphere, nice service, tastey samosas (on the hot side!!!).Here's the deal- I would go here if that's where my friends wanted to go (which is what happened last week). But I would not choose to go otherwise when there are two other Indian restaurants that I enjoy so much more."], ["Brad S.", "We have been dining at BG for several years now and it is still the best all around Indian experience we have found in Charlotte."], ["Ryan O.", "The food and service here are both great.  Any dish you get will be unique and flavorful.  My favorite is the chicken vindaloo.  Be careful the vindaloo is extremely spicy.  They also have a fairly extensive lunch buffet worth checking out."], ["Peter L.", "The lunch buffet is probably one of the better Indian meals in Charlotte.  Dinner can get a bit pricey.  Service is adequate.  Atmosphere is better than most Indian restaurants in town."]], "Tulips Indian Cuisine": [], "Peacock India Restaurant": [["Nik F.", "I think they changed chef ! Not that Authentic indian food for sure ! I have to lower my review on this"], ["Melanie B.", "I don't know what the other reviewers are complaining about. This place has wonderful authentic Indian cuisine. Try the Butter Chicken. It melts in your mouth with just the right balance of spice and flavor. I highly recommend this place!"]], "Situl Indian Restaurant": [["Jillian S.", "I was really excited about coming here. I see the ad in Creative Loafing for the $7.95 all you can eat buffet, which sounds like such an awesome deal!! Except...not when you don't really want to eat anything. The restaurant is dark and rickety and does not feel welcoming.The buffet was limited and nothing really had much of a taste. The first line has a few sauces and a salad with iceberg lettuce, peppers and carrots. The second line had soups and the third had four vegetarian and four chicken options. The rice pudding on the dessert bar was super runny and bland. The cantaloupe tasted a bit old as well. I love all things Indian but Situl does not measure up. They give you a basket of naan upon sitting down. It too was bland and even tasted a bit stale. We usually eat up the naan and ask for more to dip into all the wonderful sauces, but it was left untouched. I was looking forward to an Indian buffet so close to me, but paying a little extra and going to Bombay or Blue Taj is definitely worth it."], ["Gabe T.", "Having only eaten Indian food one other time, years ago, I consider this my first real experience with Indian food. We went on a weekday night and there was only one other table seated, so service was good.My lack of experience with Indian food meant I was relying on the menu for guidance. The menu seemed fairly descriptive and I was able to get a pretty good idea of what I was ordering. I was a little confused as to which items were spicy and which ones weren't. It turned out pretty much anything could be spicy (on the ol' 1-5 scale). However, since I wasn't aware of this at the time and wanted something spicy, I decided to go with the chicken vindaloo (which had the word \"HOT\" in the description). I went with a 3 on the spiciness. The dish was quite delicious and it was certainly spicy. In retrospect, I may have actually been okay with a 2 on the spiciness since this left me with sweat dripping off my brow. My chief complaint was with the portion sizes. I thought all the portions we had at our table were on the small side, especially for the price.Though the food was at least 4 stars in my book, the price and small portion sizes of the entrees mean I can't go above a 3. However, I do look forward to going back and trying some of the other dishes soon."], ["Fay B.", "This review is based only on food and service.  The restaurant is clean, I have no issues with the decor, but others may. So I'm saying up front, I don't care what it looks like, you just gotta get in there and get some food! I have been here more times than I can count, the food is AMAZING. The staff is so nice, as well, but go for the best Indian food in town. The naan is perfect, the samosas are delicious, and the lamb saag makes my mouth water just talking about it.  I also really enjoy the fried Cauliflower here. I've sampled several menu items and never once been disappointed. I've tried a couple other places around town, but nothing gets close to Situl. A true hidden gem in Charlotte, totally worth finding!"], ["Michelle T.", "I drove by Situl a few times before we decided to try it out. The location is a little out-of-the-way being behind Park Road Shopping Center but we are in that section from  time to time to go to Sir Edmund Halley's (Irish Pub, also very good!) so we were curious to try it. The food was absolutely delicious. The menu has tons of interesting choices. I am a fan of Indian food and this is the best I have had in Charlotte. I got Malai Kofta and my friend stuck with the classic staple, Tikka Masala. Both dishes were flavorful, hot from the oven, and perfect portions. We actually had some leftovers to take home. Next time, I will try some of their Nepali dishes.  We went on a Wednesday night and had no problems with the service. It does take a little longer than a chain restaurant but isn't that the point? I am willing to wait a few minutes for quality, made from scratch food. We aren't talking a super long wait either, just a few minutes extra compared to some other restaurants.Several reviews mention the decor as a drawback. The decor is pretty wacky but I don't eat decor so I really do not care what the place looks like as long as the food is good. It looks like any family owned restaurant that decorates with fake greenery and outdated floral linens, along the same lines as Skyland or Park 51 Cafe. Like I said, who cares?"], ["Kris S.", "OK so the service is a bit slow in this family owned and run restaurant. But the food is worth it. My first time here so I had the Tandoori Chicken. I was warned it would take some time to prepare, but it was worth the wait. Served crackling, spitting hot out of their clay oven it was delicious. My companion had the Nepalese version with a different sauce, also great. Home made nan hot from the ovens. Quite a tasty experience. The portions were just right, too. I was there on a Saturday night and the place was only half full. This is a small family operation that is barely hanging on. Most everything is made fresh to order and takes a bit of time. Too bad that so many of us are in such a hurry to eat and run. I will be sorry to see them forced to close their doors."], ["Aaron L.", "I am biased towards Situl:  going to Situl has been a longstanding tradition with my Charlotte friends that started when I was in college, and there are a lot of fond and important memories I associate with this restaurant.  That being said, this is my go-to Indian restaurant in Charlotte.  The service is not top-notch and the prices somewhat high -- but that's been most of my experience with Charlotte Indian restaurants.  We've waited over an hour for food before.  Additionally they don't go as hot as I'd like them to -- but then, I like spicy food that hits the threshold of pain.  The amount they spice the food will appeal to most of their customers.  The food is fantastic, though.  Some of my favorite Indian (and Indo-Chinese) food.   Currently I am living in New York and Situl is one of those places I will have to visit each time I am in NC to visit.  Just writing this makes me want to order some Chicken Manchurian!"], ["Re Y.", "First time at situl. Amazing food. Not very restaurant style oily food. Great taste...homely taste. And a whole lot of options. Tried the Bombay chicken...yumm"], ["Chloe A.", "Situl is great - it's the best Indian food I've had in a long time. It also has Nepalese fare. The decor may not be trendy, but the food is delicious. It's also not any more expensive than your typical Indian restaurant. Dinner entrees range from $10-$15, depending on what you get. It's just behind Park Road Shopping Center, kind of behind the Michael's - you enter the same parking lot and then just drive behind. Service is great and friendly."], ["Jason W.", "I'll also preface and say that I do not care about the decor-give me good food and I'll eat in a dirty ally. Their dinner is good although it is a bit expensive. I do not recommend the buffet though-the first time I've been at a loss to eat Indian food. Staff is very friendly and always attentive."], ["John E.", "I love this, off the beaten path delight. Lunch is good but the dinner meals are excellent."], ["T. C.", "I love Situl.It's the best Indian I've found to date in Charlotte. MUST have the lamb! But EVERYTHING is great.It's a bit expensive, but it's soooo good. :) I highly recommend it to anyone -Especially if you've never had Indian before."], ["Shannon H.", "I'm a huge lover of Indian and Situl does not disappoint. I've had several dishes, but the Channa Massala and their Paneer Tikka Massala are the best. Their onion chutney goes great with the Naan and the owners are very friendly."], ["Diana W.", "I will never go here again. The management is absolutely horrible. I frequently eat Indian food at various restaurants. I had never been here before so I used Alu Gobi as my \"measuring stick\". The food arrived and the dish was all wrong. I asked the waitress if why it was so different. She sent the manager out and he told me that Indian food is not Chinese food. He said \"We don't have your brown sauce.\"Never going back after that."], ["Laura B.", "Very good food and service. Definitely give them a try!"], ["Ravi M.", "Was a little tough to find because it is in a strip mall but behind the strip with most stores. I had never tried Nepali food before and thought that it'd be interesting. Got mango lassi to start which was really good. The owner's wife took down our orders and was really nice and helpful. She suggested that we try spice level 2 (they rate their spice level for all dishes 1-5) as even that might be very spicy. I wondered if my girlfriend would find that too bland, but she thought it was perfect. As for me, even spice level 2 had my nose watering a bit.When we ordered Momos as a starter, she warned us that it'd take time and we could probably get that for a main course. We wanted to split it anyway. So we also ordered a curry (Bodi Tamaa - bambo shoots and black eyed peas) that she recommended and got Garlic Naan with it. I also ordered a Chicken Chowmein. It was a lot of food and we had to get some of it packed. But it was great reheating that for Sunday brunch :-)Service - 5/5. Very friendly, came around multiple times to make sure we were doing al right. And I appreciated the warning that Momos would take time. Food: 4.5/5 - I didn't try any of the Indian dishes. But I really liked the curry and the Naan. Also liked the Chowmein even though it was a little oily (well, Indian chinese is usually really oily) but that wasn't unexpected. I liked the flavor of the chicken pieces in it and liked the slight tanginess of both the chowmein and the curry. I didn't like the Momos as much as I'd expected but my girlfriend loved them and the tangy dip served with it. Overall, very happy with the meal and would definitely return. My previous fave Indian place in Charlotte had been Passage to India near Univ. But the last visit had left me disappointed - maybe the chef had changed or was on holiday. But for me, the 10 mile drive there was just not worth it after that. Glad to find another place closer that seems much better and seems like it will be far more consistent as it is family-owned and run."], ["Bill A.", "Really miserable Indian fare and that single $ is not accurate. I paid $12 for some of the worst and saltiest chicken tika masala I've ever had. In fact, everything i ate there was over salted except for the nann , which had a decidedly un-nann bread taste to it. More like pizza dough. There were none of the cool sweet sauces that usually work well with Indian dishes, just more salt. (And I usually like salt).Also, I had sweet tea there and it had that sat-in-the-brewer too long taste to it.My wife was equally disappointed, and especially as we were having a mini-celebration of her running her first 10k. The place was decidedly UN festive compared to a lot of Indian restaurants we've been to here in the states and in the UK.For what we ended up paying we could've gone to Copper. :\\"], ["naren b.", "This is the worst ever restaurant I have ever gone. Not much variety of food on saturday, yet charging high weekend buffet fee. Even then, none of them are tasty. The dessert (Gulab jamun, kheer) if you taste, you will never want to eat them again. My dad once tasted, stopped eating his whole lunch. My kids told me lets go somewhere else.  All food have excess salt. When told to the server about our feelings, he told me that they do like that only, and everyone likes those and says its not a south indian restaurant.  Very head weight answers. I hate the location, restaurant and its staff. It does not seem like a indian restaurant. Some family is making money."], ["Anna V.", "This is our go-to spot for Indian in Charlotte. The management and wait staff have always been very friendly and helpful, and after several years of regular visits we still haven't tried everything on the huge menu. Best samosas in town!"], ["Kris Y.", "Food is AWFUL. If your looking for Indian food, do not go to SITUL. I am originally from India and I can tell how bad the food was. Besides the food, our bill came to $28 (including $4 waiter tip), after few days I noticed charge on my bank account that they charged me for $32. The bad part is I could not even file a case against them since I did not preserve the receipt. BE AWARE OF THESE PEOPLE OUT THERE."], ["Joe C.", "I like this place.  The people are friendly and the food is good.  It is definetly quiet.  I must say though, I enjoy a good quiet setting from time to time.  It is a wonder how they stay in business though.  It's always sparce on the patrons."]], "Passage To India": [["Jamie P.", "The best Indian food I ever had.The Shai paneer is incredible.You will not regret this one!I have been here at least 25 times and have always left with a smile."], ["Steve P.", "The best Indian food in Charlotte...period. Cannot go there without ordering the Eelam Calamari appetizer, Chicken Tikka Masala and Garlic Naan. The price for what you get is solid and so consistent in quality and taste every time.The Buffet is great as well (but I do wish they offered the Tikka Masala on it more often.Plus they deliver within a 6 mile area!"], ["Ralph D.", "No Lunch Buffet!  as of 7/30/2015I'm not sure when they stopped, but it was in the last two weeks.  Now, their lunch is a small menu with small portions of curry, large portions of rice, for the same prices as the buffet.  No longer a good deal, but still good flavors.  I like their Saag dishes."], ["L G.", "The food tastes fine. The problem is that I ordered Mutter Paneer, which is peas and cheese in sauce... and there were hardly any peas. There were exactly 5 peas in a serving. For comparison, this is like ordering a pepperoni pizza, and there only being 1/2 of a pepperoni on your slice. It might be a great slice of pizza, but if it's missing the critical ingredient then it's not what you ordered. I called and Andy said he'd tell the cook next time to be sure to have peas in it and prepared to get off of the phone (what?? This is like telling the cook to make sure a pepperoni pizza has pepperonis next time and offering nothing to the customer) When I gently pressed, I was offered 25% off my next meal. Kind of expecting more recompense there. Probably won't be back. See photo if you would like to hunt for my peas."], ["Melisa G.", "This was our first time here. We were visiting from out if town. My husband said they had the best mango Lassi he ever had. For dinner we ordered an assortment of naan, mango lassi, saag, tikka masala, and vegetable lo mien. Service fast and portions were big! Which was great because we had a toddler. I wasn't expecting to really like the lo mien I just ordered it because my toddler loves noodles; but I couldn't stop eating it. We loved it!"], ["Mike K.", "I went to Passage to India with a couple of friends for lunch. It is basically right across from the UNC Charlotte campus so it is quick to grab lunch off campus. We all got the buffet for lunch. It's about $10 for the lunch buffet. The buffet isn't huge - but it has a good assortment of different dishes. All of the food was flavorful and delicious. I have not had much Indian food before so the buffet was perfect for me - I got to sample the different dishes/sauces."], ["Kenneth W.", "Food was decent. Prices were not. The Tandoori Platter is $16. The portion I got was tiny. I ordered to go. Maybe the portions are larger if you dine in."], ["Monica M.", "It's usually hit or miss when we go to Indian buffets. I'm not one to partake in spicy food, so I'm especially picky when it comes to the entrees they have on the buffet. Most Indian buffets have butter chicken on the menu, or some mild chicken curry dish most would like. A Passage India did not have my favorite dish, but they had chicken dish called Chicken makhani. Superb! The Naan was soft and delicious. Even the rice dessert was the best I have ever had. The only thing I don't like is the fact there is no parking during the week at lunch. If you do find parking, the spots are too narrow. Don't bring your most expensive car. Your doors will get hit. You will love this place if you love Indian food!"], ["Trey B.", "I am very confused on how this place has such a high rating.  The Goat curry I ordered for pick up may or may have not have actually had goat in it.  The actually curry tasted all right.  However, the \"meat\" was nothing but bones, fats, and tendons.  I am not the type of person to who would freak out over finding one bone in my dish, it happens.  The problem comes when I ordered goat curry and there was actually only on small bite of meat in the dish with the rest being bones and random other bits.  If they where running low on actual goat meat and had to make due they could have given me a call and I could have ordered something else."], ["Brenn T.", "Went for a lunch buffet and there were a lot of great vegetarian options. Would go back."], ["Robert B.", "Just moved to charlotte and I was searching for good Indian food around University City. I was relieved once I found Passage to India....I got the lunch special with two different flavors of Curry chicken...its been three hours and my mouth us still exploding with flavor."], ["Elaine W.", "The buffet was excellent.  Biriyani had a wonderful spicy flavor. I look forward to coming back."], ["Ginny L.", "s/o and I were visiting from out of state. both of us were craving Indian food and decided to drop by this place after looking it up on yelp. we ordered naan, mango lassi, chicken curry and chicken korma. all the dishes were for the most part, excellent. the entrees were well spiced, promise it'll give your taste buds a nice kick.  s/o got the chicken curry in medium; it had good amount of heat but not overbearing where you'd reach for a sip of water after every bite. chicken korma was less so but good balance of spice. plus it was super creamy!if you get a chance order the mango lassi! it was such a delightful surprise as there were cardamom pods blended in; I had never experienced that at any other restaurant before. complaint is that it was on the thick and heavier side. wish they could have blended in some more ice to make it thinner.also, my chicken was a bit on the dry side. wasn't tender enough to my standard. overall, recommend!"], ["Kevin M.", "F this stink hole.Got there Sunday night at 920pm.Sign on door says open til 10pm.Google said open til 10pm.Door was locked at 920pm.Hope they have to shut this place down soon.Idiots."], ["Hashani S.", "Oh man, this place left me with the worst food poisoning I've ever gotten in my life! We came here for the weekend buffet, the little place was crowded...a good sign since quite a few of the patrons were Indian themselves. The buffet selection was also good, they even had a pani puri station, seemed cool. I grabbed quite a few things but all were mediocre. I think what got me was the paneer tikka masala..I ate some (my bf didn't touch it) and in my head told myself..hey this isn't the right texture for tikka masala..something's off...and then 6 hours later I was barfing my guts out for the following 24 hours. I'm sure this was an off day as my bf and his room mates have eaten here many times before. Sadly, I don't think I'll be eating here ever again, I'm basically scarred for life. The buffet is large and cheap..but considering my experience you may want to stick to the a la carte menu. Good luck."], ["Lodz S.", "Came for lunch.....so disappointed......no more weekday buffet. The lunch special was limited to two vegetable choices and two chicken curry choices. They had vegetable rice on the menu but it wasn't available today. The plain basmati rice was cold and hard. Not coming back. Now I have to look for another Indian buffet place for my weekday lunches. :("], ["Saniqua P.", "As an absolute novice to Indian cuisine, I had always been a little hesitant to try it out because I wasn't sure I would be able to stomach the spices. Well, I was pleasantly surprised at how much I enjoyed the flavors and the dishes I ordered at Passage to India.I tried this place thanks to a suggestion of my best friend who works nearby and asked me to join her for a Friday evening dinner. Passage to India is situated in a tiny strip mall right down the street from UNCC (aka my alma mater, go 49ers!) and is quite small inside so the place can fill up quite quickly. I joined my friend around 6:30 p.m. and walked right in with no wait.For my beverage, I ordered the mango juice which was pure, delicious mango puree and the vegetable samosas as an appetizer. The samosas were brought out nice and hot and served with two different dipping sauces. One was green which had more of a cilantro flavor and the other was brown which was on the sweeter side. Forgive me, as I have no idea of the \"official\" names for the sauces.I didn't have the chance to look over their menu online before I visited so I relied on the knowledge and preferences of my friend to walk me through the menu possibilities. I would personally recommend checking out the online menu before you go because it can be a bit overwhelming especially if you're an Indian food newbie. I settled on the chicken tikka masala which is grilled chicken breast cooked with tomato creamy sauce and served with basmati rice. My friend ordered the tandoori chicken. I have to rave here: THEY WERE BOTH DELICIOUS. My taste buds were so relieved!Our waiters varied throughout our meal but all were so kind and accommodating and checked in to make sure we were satisfied with our meals. As a newly-minted Indian food fan, I am happy to have a place to recommend and cannot wait to come back to try their highly talked about lunch buffet."], ["Belma E.", "Went there yesterday the buffet was sub-par, I was very disappointed and unimpressed with the menu on the buffet, seemed like they cut the buffet menu in half. This was one of my favorite Indian restaurants!"], ["David H.", "Free extra serving of rice would have made this 5 stars.  I am one of those who is staunchly in the camp of rice is cheap so why charge me for an extra serving (especially when you have the smallest servings or rice in town).The food was good, we really enjoyed the flavor.  The table had the lamb korma, the chicken malabar, butter chicken, and the lamb kebabs (different name).  The food came out attractive and properly spiced.They didn't get two parts of our order right: we had ordered raita, and they brought out the wrong dessert.Water service was right on the spot.  Although even before things got busy they seemed to not be in the groove - slow.Skip the garlic naan - way too strong.  The mango lassi is as good as any I have had in Charlotte, still not the level of what was available in Mumbai.I would go here again but I will probably not ask for extra rice and I may come for the buffet.UPDATE: I came back for the buffet.  I thought the biryani was better than at Persis, and the buffet had a better variety of things to eat.  I enjoy that they had goat, but unfortunately a variety of meats (lamb, possibly beef although it is not traditional), would have been appreciated.On the menu were two chicken dishes - a tomato based sweet dish and one with bones.  Some toroidal (donut shaped) fried food.  They had a vegetable and cheese version of meatballs in what resembled korma sauce.I strongly recommend the buffet over getting an entree because of the variety, although the entree I ordered tasted better than what was on the buffet."], ["Ernie And Dora H.", "For this edition of Excited about Eating we visited Passage to India, located in the Campus Station Shopping Center in the University area of Charlotte. Now, I have to admit, I normally don't eat at Indian restaurants because I have heard the food is very spicy. But today we were up for trying something different.We were in luck. Instead of choosing just one dish, we were able to experience multiple items from their lunch buffet, and many of them were very good. My favorite was the Chilli Fish, fresh tilapia marinated with spices, fried and tossed with bell pepper and onions. The fish was lightly battered and perfectly cooked. Dora here. Tilapia typically isn't a fish I'd choose, but I really liked this dish. Not too fishy and great flavor.Another favorite was the Tandoori Chicken, marinated in yogurt, ginger, garlic & fresh spices and grilled in a clay oven. This dish was outstanding with the ginger and garlic shining through and the chicken carried a smokey favor. The Goat Curry, baby goat cooked in onion, tomato, and ginger gravy was great over the Basmati rice. My wife's favorite was the Chicken Tikka Masala, boneless chicken breast marinated in ginger, garlic, yogurt & spices and grilled in a charcoal clay oven. Dora here. The Chicken Tikka Masala was moist and tender, and sported just the right amount of heat. Unlike the Chicken Biryani which lit my mouth on fire! One taste of the Biryani and I was begging to switch my iced tea to diet coke. lol. And I really liked the Gulab Jamun, sugar-soaked balls shaped like doughnut holes, and that's what they tasted like: dense, sweet doughnuts. Ernie wasn't a fan. For dessert, we had the Mango Custard, made with fresh fruits. Not too sweet but just the right amount of fruit in a creamy milk sauce. Dora here. The mango custard was light and refreshing, not too heavy after eating from a buffet. And that's another thing. Normally, buffets leave me stuffed and bloated, but neither of us felt that way when we finished eating.Overall, this experience was enjoyable and I would eat Indian food again. I would rate this restaurant 4 forks out of 5 for a family friendly restaurant that serves great food.Ernie & Dora HiersFiction Faith & Foodies Blog"], ["Mohith S.", "Nice place..Loved the Paneer chettinad and Kashmiri naan...Absolute delight.."], ["John G.", "3.5.Food = 4Service = 3I'll rate a 4 to give the benefit of the doubt. The Indian food was pretty good. I was satisfied but it isn't the best I've had. I'll just lay it out there that I'm totally fine being the closed minded American eating Chicken Tikka Masala, and they did that pretty well with it. Service could have been a little quicker though. Also very reasonably priced which helped the rating."], ["Sid F.", "Best Indian food in Charlotte"], ["Brandon A.", "Great food. Restaurant was clean and well kept in a nice area of town. Dinner menu has many options and they'll ask how spicy you want your food. Chicken curry was great! Server was running the register, seating guests, etc, but service was great as other members of the staff seemed to float around and help each other out. This place also delivers if you're in the area and don't want to go out. From what I could tell this was a popular option, as I saw many meals bagged up and ready to head out."], ["Fiana L.", "we decided to try Passage to India out during dinner time, which it's not very busy at all. When you first walk in the place, the curry smell hit your nasal right away. I order a mango lassi  which taste more like a dessert.  We got Samosa for appetizer, and  shrimp biryani, curry chicken, garlic naan and plain dosa for entree. Then the cheese ball and rice pudding for dessert.Overall, the food is ok not very impressed. I do love the garlic naan, which is crispy outside and soft inside. The price is a bit expensive for the amount of food. I probably wouldn't go back here again."], ["Ron B.", "My girlfriend and I went to Passage To India for the first time last night.  Neither of us have had Indian food before and we were kinda hesitant.  We heard Passage To India was the place to go.  They were correct.  The food was amazing!! We simply explained to our waiter that we have never had Indian food before and could he please help us.  The dishes he gave us were amazing.  The place is small and doesn't look like much but don't let it fool you.  You will not be disappointed!!! We loved it so much we just ordered it for delivery!"], ["James M.", "Lunch box. Do it. Your mouth will thank you. It's cheap. It's tasty. The only thing this place is missing is a drive through."], ["Adam S.", "Absolutely, positively, the BEST Indian restaurant in Charlotte!!What you get at Passage is more than just some of the tastiest Indian you've ever tried in your life. You also get a really unique atmosphere. As soon as you smell the cuisine from outside, you know it's on like freaking Donkey Kong man!!! If it's your first time, check out their lunch buffet. It's a little bit cheaper on the weekdays, but if it's the weekend, you'll get more variety. I find it difficult to try everything I want to try in one trip, sometimes two trips. It's seriously all good! You're going to want to try the Paneer Tikka Masala or Paneer Tikka Masalam as it is the best in town and the Onion Pakoras are fantastic too. Make sure you try a Mango Lassi to drink! If you're not as hungry, ask for a \"lunchbox\". It's only $4-$5 for naan, rice, and enough curry to make most anyone full.Passage is one of those few restaurants that if the place went out of business, you would be really depressed. It may also make you consider not moving if you live close by it. You may or may not be a fan the first time you go, but as I tell all my friends, go three times. It's something about that third time that will make you a fan for life!Also, ask for Andy the owner or Avito and they'll take care of you. By no means am I affiliated with PTI...just a super fan!"], ["Nick L.", "Ordered here this afternoon (Delivery) was definitely quality food nice balance of spices unlike some Indian restaurant I have ordered from in the past where they feed to the misconception of indian food being purposely blazing hot.  Very professional attendants and food arrived precisely on time (50 mins).  I had ordered a plate of Lamb Biryani, Goat Vindaloo and some Butter Naan.  The only disappointment was that the food was a bit cold by the time it arrived, however it is a bit chilly outside today.  It would have been nice if the restaurant took measures to ensure the food remained hot by the time it reached.  All in all cant complain, I will definitely order again."], ["Sam J.", "Namaste.I took a coworker here for lunch. Now you've got to imagine, my coworker and friend, was the living embodiment of Aunt B. from the Andy Griffith show. My mischievous nature thought that it might be interesting to introduce her to something outside of her comfort zone. Passage to India is a neat way to be introduced to Indian cuisine, since lunchtime features a buffet. One gets to try a little of everything. I have to admit, that I didn't know what I was eating the majority of the time - but it was flavorful, and spicy. I was smart enough to get plenty of the yogurt dish, that I characterize as an \"Indian fire extinguisher.\"Service was very good. The buffet was kept fresh, and the employees were friendly. Prices were reasonable. When I asked \"Aunt B.\" if she enjoyed lunch she said, \"yes.\" When I asked her later on if she wanted to return she said, \"uh uh,\" - translation: no. The spiciness was just a little more than she bargained for. ;o)PS: Parking here is pretty much like trying to squeeze into a sardine can, so arrive early or park down at the left side of the building and walk up. There is more parking on the left, next to Arby's, and less chance of door dings. Also be careful of \"idjits\" driving around the blind narrow corner too fast - it happens."], ["Ryan G.", "If you find yourself around Harrisburg, and you like Indian cuisine, this is definitely one you should check out. As an UNCC alumni, I know my way around this area well and there really isn't much on this left-front corner of campus. It really can be hard to spot at first, as it is wedged in the Campus Station shopping center.This place has a pretty sweet buffet. Although I've gone here once, I highly enjoyed their food options and felt it was an average size buffet. The food was of overall decent quality and the service was very tentative. I'm sure most items ordered off the menu are equally as good as what was available in the buffet.The location is not a bad walk from campus. The lunch buffet runs until 3p, 3:30p on weekends. The business delivers and takes orders online."], ["Allen H.", "My girlfriend and I ate there over a month ago. Right when we got inside, it felt awakard as if we were unwelcome and waited to be seated. Of course it was our first time there so we didn't really know much of how the procedure and process of the restaurant works. Apparently, we went in the afternoon because they were still serving their lunch buffet yet we wanted to order from the menu since I've checked few reviews about it. It took them a few minutes longer than average restaurant to give us the menu and take our order, including bringing our drinks. So let's cut to the chase, I couldn't order what I wanted because it was lunch time and that was the whole purpose going there; therefore, my girlfriend and I shared her entree and appetizer. Overall, the food was pretty good and different. The water had little ice and by the time it was refilled, all the ice had melted away already (like really, no kidding). Service wasn't the worse but had an unwelcoming environment. I'll give it another try (next year)."], ["Jerrod D.", "Ate here with some coworkers again lastnight, and again the food was flawless along with the service!!! I couldnt eat anymore I was so full!!! We are so happy we found this little gem!"], ["John H.", "Came here for their lunch buffet.  The restaurant is located in a strip mall with an awkward parking lot, but once you get into the place, the entire dining room is filled with the aroma of food.Yes it is a buffet, but they kept it very well stocked and very neat.   The food was good (I ate too much naturally).  Lots of vegetarian options.  Now, I am not an Indian food expert, but I felt pretty satisfied with the price and the food.Servers were very nice and kept our drinks refilled and the tabled bused even though the lunch crowd was growing and busy.The place is pretty cramped and doesn't have much atmosphere, but face it, it really makes the food the star.  There is a nice mural of the Taj Mahal on the wall but other than that, nothing too tricky or gimmicky here."], ["Ali S.", "I won't lie, me and Passage to India go way back. I used to live in Charlotte, and when I visit Charlotte:I always visit, my Mom, Dad, brother's, sisters, In-laws, and Passage to India. Some times all at the same time if I am lucky.Andy has done a great job, I know he has been there since 2011 at least, and he has come a long way, the first time I met Andy I believe it was at Bombay cuisine an upscale Indian restaurant that I never really ate at, I did some wholesale deliveries there. What Andy has done for Charlotte, was made the best Indian Buffet, and made it available to the masses. I am perfectly comfortable with the prices, and it is well worth paying the extra for the weekend buffet. I am always sure to stop by and visit him when I am in Charlotte.Things I like on the buffet:Gulab Jamon (Usually Weekend)Rice Pudding Chilli GobiGobi fish (Weekend)Tandoori ChickenButter Chickenanything NaanNot going to lie, I don't know all the dishes by name, but I eat it and love it. I remember another reviewer mentioning a paneer dish. Definitely need to get that on your plate too.I usually come for the lunch buffet, as I am more of a budget/binge Indian eater."], ["Sai D.", "Food : 2.8Quality : 3Service : 2.8"], ["Mandip S.", "I dated a girl who lived in front of Passage to India and eventually got married to her. We went there several times and always enjoyed food! Food is prepared with heart! You will enjoy going there too..!"], ["Bruce K.", "This place definitely hit the spot for me and a fellow yelper (Grace check her page out!)We came here for the lunch Buffet which was reasonably priced. ($10 for all you can eat) They had a very nice assortment of Indian food and they all tasted pretty good. And I was told from a friend of mine that it is quite authentic as well. The butter chicken was pretty good and after two plates I was full. Overall, I liked the atmosphere and how they catered to giving you the sense of an Indian culture.But I definitely enjoyed the food and will recommend people to come here to eat their buffet and get a taste of that butter chicken. (and all their other delicious food!)"], ["Priscila S.", "First review I ever make here in Yelp, but I felt like I had too.My husband and I just came back from having a GREAT dinner at this restaurant.It was clean, yuuummmyyy food, great service and the prices are good!I would highly recommend this restaurant!!:)"], ["Elizabeth A.", "Unfortunately for Passage To India, I compare every Indian restaurant to Woodlands and It's hard to match that level of quality.Everyone else's reviews raved about the buffet, but I was here for dinner on a Tuesday. I will definitely try to make it out to the buffet if I'm in University at lunch time.I had been here years ago when the place was Udipi, it doesn't seem like much has changed. We split the CHILLI PANEER appetizer. It was good. I definitely liked it more than my boyfriend but I'm a sucker for any Indian food with lots of paneer. The texture of the panner in this app is a lot like tofu with almost a sweet and sour type sauce over top. Served on a bed of mixed greens, rather like a salad.I tried the MUTTER PANEER as my entree. I told the server I wanted it at a medium level of spicey, but it was pretty mild. Maybe I looked like a sissy and he didn't think I could handle it? :] I was still happy with my selection.My boyfriend ordered the MUSHROOM PALAK, which was okay, Nothing special, nothing bad.We shared POORI BREAD and GARLIC NAAN. Not the best we'd ever had, but still yummy."]]}