{"Capriccio New York Pizza & Italian Restaurant": [], "Brio Tuscan Grille": [["Cristin M.", "I have been here many times for brunch on the weekends or lunch. Glad to say they help out with finding out what is Gluten Free for me and what is not from the Chef since i have Celiac Disease. Love Love Love the brunch Mimosa's! the chef's special is always a winner too! Even if people do bring their kids, it's almost too big, or they are just well behaved, to even hear them.Recommend it. I know a good restaurant when i don't get sick within 72 hours. ( Celiac Symptoms) or when i eat the food and i don't spit it out because it's tasteless and gross! Brio is definitely a go to spot that won't empty your wallet!"], ["Jared W.", "Today's business lunch was at Brio, and overall the food was quality but the service left a little to be desired.The food:-Calamari: crispy fried but still tender inside; nothing mind blowing but solid quality. Came with a horseradish spicy dipping sauce and marinara sauce, which were both good-Bruschetta Quattro: the bacon and ricotta bruschetta was incredible, the steak was also really good, and the other two were standard but good options. Great app to share!-Side salad: I give this a separate mention because it was HUGE; filled me up before my entree with the apps and was very tasty with fresh lettuce, tomato, onion, and cheese-Mediterranean shrimp: only 5 shrimp but they were flavorful, juicy and each were fairly large so no real complaints. The orzo was decent as were the vegetables it came with.The service wasn't great by any means. Our waitress filled our drinks, was quick to take plates and was fairly nice, but they messed up multiple orders. One of my colleagues specifically asked for no gorgonzola on her salad but they put some on anyway. Then she didn't want to make us wait so she asked for the lobster bisque soup rather than having them cook steak for the salad over, but our waitress returned with minestrone instead. The food was also very, very slow to come out so I would avoid this location at lunch time if you're trying to get a semi-quick bite and get back to the office."], ["Jon B.", "Whenever I'm around the mall during the week, I always try and make it a point to stop here for happy hour. From 2-6:30 (and 9pm-close) they do bar bites in the bar area ranging from $3.95-$5.95. They also have a selection of cocktails ranging from $4-$6.HH Drink Recommendation: The Italian lemonade ($4) -- vodka, gin & orange liqueur blended with fresh lemonade. It's basically a long island without the Coke ... and it's basically delicious. It's loaded with liquor, so you're definitely getting your money's worth for $4. HH Bar Bites Recommendation: 100% first order should be the Black Pepper Shrimp ($5.95). It's 12 pan seared shrimp served over crusted eggplant (think eggplant parm without the cheese) and covered in a delicious pepper cream sauce. The Sausage, Pepperoni & ricotta flat bread ($4.95) has great flavors to it. It's just the right amount of spicy sausage toned down with ricotta & a house made tomato sauce. New to the menu is Italian \"tots\" ($3.95.) They're good, not quite what expected. They're basically breaded/crusted mashed potato balls with bacon & cheese. The brio burger ($4.95) is a full size burger served with chips, another great value.If you're around Southpark after work, this is a great place to make a pit stop!"], ["Emily E.", "A lot like Olive Garden in my opinion, but a little fancier.  I really like the flatbread they bring out as a starter, but the other dishes are kind of hit or miss.  For the price, I'd probably go elsewhere to get better value for my money.  Never had a bad dish here, but never felt wow'ed either."], ["Jacqui G.", "The ambience here is beyond amazing and the event location is centralize around the shops boutiques and restaurants I didn't recommend anyone to eat in here if you really want to patio experience"], ["Nikki W.", "For me, I think there's only one way to do Brio: sit at the bar.Why do I say this? Three words: Bar Plates Menu. It's only available during the week. Sorry weekenders. The BPM (why yes, I did decide to shorten it) has plates starting at $3.95, including a beef carpaccio that is delicious and a big size portion. You can't really go wrong with anything on this list for the price. I love the eggplant fries, too.If you don't feel like sitting at the bar, Brio does have a great patio. Like Desiree F said in an earlier review, I don't go here a whole lot. There are just a lot of great places in this area. I've always had good service here. The atmosphere is nice. My last visit I talked to the manager on duty for a long time. She was really sweet. Parking is annoying for me, but that's more because I don't come here a whole lot and all the decks look the same. Brio has a rewards program. You can get a card or download the app. After five visits, you can get $10 off your 6th."], ["Jenny B.", "My husband I have been here for happy hour before and it's bomb.com. Happy hour is till 6:30 and again from 9-close. $3.95-$5.95 bar bites?! You can't beat it! They also have select drinks on special including sangria, mojitos and martinis ranging from $4-$6.They recently updated their bar bites menu with new options. We ordered the 'tots' which were filled with potato, cheese and bacon with a side of spicy ranch (new to the menu-  $3.95) along with the peppered shrimp with eggplant ($5.95). Both dishes were great. I was expecting the tots to be more \"totty\", but they were basically deep fried mashed potatoes balls-however they were still good. The shrimp was awesome-the right proportion of spicy and savory. I highly recommend the shrimp! I wish we ordered more. Both dishes came with 10 pieces each-great for 2 people. For drinks I had the sangria and my husband had the \"lemonade\". Both were great- no complaints. Overall we have always had great service, food and drinks at Brio and I highly recommend it for happy hour :)"], ["John B.", "This was kind of a depressing upper-end chain restaurant, exactly the sort of thing one settles on when traveling with a mixed group. The menu certainly wasn't vegetarian-friendly (let alone vegan), which I find odd given that Mediterranean cuisine (including whatever people eat in Tuscany) is usually more plant-based. Nevertheless, I settled on some mushroom ravioli and traded in appetizers, all of which was palatable but predictably overpriced.It's a nice location, and there was live jazz on the night I was there, leading me to afford them a generous three-star rating."], ["Nikki W.", "Simply put: I adore Brio. I tend to snag lunch from Brio at least every other week and have stopped in for happy hour several times as well. I have never had bad service and the food is top notch. Stellar patio with a cover area if you please. The steak bruschetta is the way to go for an app but I also end up back at the lobster bisque as it is stupidly good even in the summer. I usually wait until they bring the bread at the beginning and then dip it in the soup - your service will bring sourdough bread as well as crispy, thin, seasoned pieces to start off with. I have no clue what the crispy pieces are but they sure are tasty. The beer tends to be a little higher priced as $6 for a Blue Moon is more than I'm used to but hey, welcome to South Park. Pro tip: Brio is one of many places in South Park that hosts a food happy hour. For this location, stop in between 4 and 6pm to snag discounted apps, like $5 spinach dip or $4 flatbread. Great way to try out Brio at a nice price!"], ["Josam R.", "Soooo good for Sunday brunch - veggie omelette with egg whites is so delicious. Our 4 year old is obsessed with the Italian wedding soup and they're very good with the kiddos. The bread cracker things are delicious, but I was a little weirded out seeing them cut the bread and arrange with their bare hands - surprised that's \"OK\" according to health code. I watched all of them do it - so it must be kosher ??? I also understand the marscapone cheese cake is delicious, my husband and son devoured it in 30 seconds"], ["Georgette D.", "Great place for business lunch or just to catch up with friends.  Food is fantastic!"], ["Amanda K.", "Food is great but waiting 2 hours to get your food is not.Its my birthday & not really enjoying as I am still waiting .... May take longer ...brrrrrr"], ["Weekendgirl G.", "Brio's is a lovely Italian restaurant in the South Park area. As expected the restaurant is beautiful. I set outside on the patio. I was quickly seated and had a very attentive server. I ordered the vegetable panini which was very delicious and was also a pretty decent size amount considering the price. It also came with a quinoa side salad. Overall I would say this place is worth a try its nothing super special but the food is not bad either I'd say about average.."], ["Fleece P.", "Love the atmosphere and the ability to alter the selections to my personal taste . Pasta was delicious and a large serving. Great for business meetings or a gathering with friends ."], ["Serena Q.", "Excellent chicken pasta recommendation by the bartender. We sat at the bar and got quick good service. Bartender was extremely friendly. Great location. Indoor and outdoor dining. Outdoor party was going on and the let you bring in your own table decorations."], ["Georgia O.", "Decided to stop here for lunch. We both ordered the fontina bacon burger with fries. We asked for the burgers to be cooked medium but they both came out well done. Despite that they were quite tasty. Bitter greens, creamy cheese, smoky bacon, and sweet tomato jam. The service was also good."], ["Desiree' F.", "I hadn't been to a Brio in years. Nothing against them, there are just so many places to try in this city. I went for a late lunch with my sister and immediately remembered why I liked this place. The beautiful decor and golden lighting just puts you in a relaxed state. We were seated right away and our waiter was very attentive. I ordered the pasta pesto and loved it. My sister had the parmesan crusted chicken salad and found it to be less than stellar. Still, we enjoyed a nice cozy lunch and had no issues. It will probably be a long time before I'm back again though. Nothing about my experiences there ever leave a lasting impression."], ["Ava B.", "Even though this is a chain I would say that it is one of our top places to eat in CLT. The prices are on the high end but we just keep going back because the food is so good. If you go right after work you can get a great spot on the patio. Our favorite dishes are the spicy eggplant/shrimp appetizer and the beef carpaccio. The eggplant/shrimp dish is scrumptious; it has a very yummy sauce and the carpaccio is HUGE, especially for an appetizer. It comes out in the biggest plate you will ever see and has a tasty salad, flatbread slices and capers on top to make it even better. If you sign up for their rewards card/app, they send a lot of promotions to lessen the pain of the bills. Almost every time I have been in we were able to get at least $10 off by using these offers."], ["Paula B.", "Great place to enjoy an adult  beverage. Sarah, and  Davis always go above and beyond . Great menu."], ["Scott D.", "Bartender Sarah P. blew me away today with her amazing service! Although I haven't eaten at Brio for several months, she remembered my name, drink, and important aspects of my life. Couldn't have been more impressed with her genuine interest in me and my guest. Made us feel valued and appreciated and makes me want to dine at Brio more and more. Food was excellent as always. Thanks Sarah!!"], ["Candyce B.", "My family and I chose to celebrate my dad's birthday this year at Brio's and we were not disappointed. We made reservations for 6:00pm on Sunday night. This was the perfect time, the place was not overwhelmingly busy and our service was fast. Here's a rundown of our night: Drinks:They serve some signature sangarias and martinis for only $5 so we helped ourselves to the White Peach Sangaria and a Cosmo. Both were pretty good (a little light on the liquor) but still very tasty. Appetizers:My dad ordered the lobster bisque. It was fabulous! Very creamy and rich...with perfect flavors...Be prepared to practically lick the bowl! Yum. My mom had the Chopped Salad-cucumbers, tomatoes, feta cheese and black olives. It was also very tasty! Really good combination of flavors...and the dressing was delicious. I chose the Bistecca Insalata which is basically their version of a wedge salad. It's a wedge topped with Gorgonzola cheese and bacon with a creamy Parmesan dressing. I was a little disappointed with the ratio of lettuce to toppings...I could have used more cheese and bacon BUT the dressing was divine! Like, so good I asked for extra so I could dip the bread in it! Ha. Dinner:My dad chose the Sausage Peperonata Pomodora it comes with sausage over angel hair pasta and tomatoes....delicious! It was a huge portion and the sauce was awesome! My dad really enjoyed it!  My mom had the crab and lobster cakes again winners...nice chunks of crab and lobster not a lot of filling or breading....I'm still dreaming about them! Mmmmm....I chose the Gorgonzola Crusted Bistecca with the filet and it was perfect. O.M.G! The meat was so tender and juicy! And the steak came out exactly as I ordered...and that cheese was to die for..I could seriously eat this...again and again! The only downer was the veggies, they were a little over cooked and not seasoned to my liking. But when everything else is so delicious this seems irrelevant! We were wayyy too full for dessert! But everything on the tray they bring around looked wonderful! I'm definitely trying something on my next visit! Go ahead! Give Brio a try! It's definitely worth it!"], ["Haeyon L.", "As my boyfriend and my favorite \"special dinner place\", I have come here multiple times in the past few years. I've always enjoyed the food. I thought it was good. But they're recent menu blows everything else out of the water. The Diavolo pasta had the perfect kick and the pesto. OH THE PESTO. So delicious. Nothing was 'too-'anything. Not too salty, or bland, or saucy. Perfection on a plate."], ["Michelle P.", "Not only does this place have a slamming happy hour menu ($3.95 for specific apps and $5 drink specials) daily, there's also a $5 martini night on Wednesday at the bar...  I only love one thing more than good food and good drinks which is reasonably priced good food and drinks... lolI've been to this location numerous times and the service is always top notch... My favorite dishes are the sausage and pepperoni flatbread (which is incredibly light and crisp, but still filling), the spinach artichoke dip (which comes with some absolutely awesome pita points and is also super tasty), the Brio Burger (which is pretty standard, but still delish) and the frittata al forno (which was my yummy brunch choice)... The prices are not incredibly high during regular times, so that's good... The patio is really nice on warm days... The only thing is you should definitely go early or late for the happy hour because their bar fills up quickly!  Happy hour is from 4:00 pm until 7:00 pm and starts up again from 9:00 pm until closing..."], ["Renee R.", "Years ago, we tried this place and received bad service.  So happy we gave it a second chance.  Had the best caprese salad and Gorgonzola crusted beef medallions for dinner.  David, our server, was attentive and cheerful.  The cocktails were icy cold and the perfect mix of ingredients.  Looking around, it seemed all the patrons were having an equally enjoyable evening. Overall, the experience was exactly what we needed on a Friday night.  Give this place a go. You won't be disappointed."], ["Errol T.", "I come here about once a week on average since I work in the building next door. The staff is very helpful and friendly. I have a Brio rewards card that is indeed rewarding periodically. Anyway, I order lobster bisque at least once a week because it is so good, and inexpensive. It comes with delicious bread. I also order the calamari which is perfect. The portion is great for the price. I've ordered all the items from the Fresh menu and they're all delicious. My family and I dont really like the dessert here. Favorite thing to order: Light Grilled Salmon FrescaWhen I consider the ambiance, the quality and portions of food, the staff, cleanliness, parking (free valet) and price, I have to say this is probably one of the best choices you can make for dinner in Charlotte."], ["Aerin S.", "I came here for a lunch meeting. I wasn't paying for the meal so I wanted to make sure I got something fairly inexpensive and easy to eat while talking. I decided on the lobster bisque and even though I tend to shy away from getting it at most places (it's made too rich most of the time) it was the bestttttt decision I could have made!! Lump lobster and creamy, it was perfect! Better than Ruth's Chris FYI. I would argue best in Charlotte.You're welcome."], ["Candias D.", "Decided to end my birthday night at BRIO and what an amazing dining experience it was. We had a rather big crowd and got there around 9:30pm; even though they closed at 11pm the service was spot on and very accommodating.  We had everything from the crab and shrimp cakes, grilled salmon fresca, shrimp and eggplant app, lobster bisque, ravioli, lasagna, grilled mahi mahi, sweet potato risotto, and calamari and there was not ONE unsatisfied person. Everything was delicious including the drinks! We were way to full for dessert but this birthday girl was HAPPY!"], ["Spencer L.", "Each and every member of the staff was polite and very friendly. David was our server as well as Anthony for a bit. They were both absolutely wonderful and made sure we were enjoying our experience. The atmosphere of the restaurant is fantastic, very open and calm. I ordered the Pasta alla Vodka, Lobster bisque cup, and peach croissant. The pasta was quite frankly the best meal I have ever had at a restaurant. The chicken was perfectly seasoned and cooked, the pasta was delicious, and the ricotta filling was absolutely stunning. Every other part of the meal was great as well. The only disappointment is that I am leaving the area tomorrow and will not be able to eat here for some time!"], ["Joanna H.", "I generally am a fan of Brio - fresh Italian food, very flavorful and appropriate portions. I came on a busy Saturday and it seems the front wasn't quite organized. We didn't get a warm greeting and the hostess were having intense discussions despite our reservation."], ["Emma K.", "Brio's is one of my favorite dinner spots when visiting my grandmother in Charlotte, and I never would have known it's a chain unless I looked at their website.  This location has complimentary valet which is a huge plus given the location.  The restaurant is HUGE so it can get a little loud, but not overly so.  Outdoor seating was not open when I was there last weekend, but can imagine it would be a great place to sit.The food is absolutely delicious.  I really wanted the Lobster & Shrimp Fettuccine, but wasn't sure about the \"spicy lobster sauce.\"  The waitress was great about explaining the level of spiciness and after seeing me still look uneasy, she offered to have them make it without any spice at all.  It was so delicious - I will definitely get it again on my next visit.  We also got the Bruschetta Quattro appetizer which was delicious, but 3 of the 4 varieties came with meat.  I suppose we should have looked at all the bruschetta descriptions since the Quattro isn't described, but my mom's a vegetarian so she had to stick with the only vegetarian option.  Regardless, they were still yummy.All of our meals out in Charlotte are delicious, but this one definitely stands out!"], ["shirley d.", "Food is delicious, and service is excellent. It's a bit loud on the weekends, if you go when a live bad is playing (if you are coming just to eat in the restaurant.)"], ["Princess N.", "I have been to few different Brio's in different states. This one is my favorite. Food tastes consistent every time and service and view are exceptional. My favorite is the happy hour menu. Great portions and great price. Must try"], ["Jennifer C.", "This was my first time inside Brio. I've seen it often when around Southpark. But I was definitely pleased to experience it finally. We had a ladies night full with drinks and dinner. We were planning to meet at 7:30 on Saturday night, but we decided an hour before maybe we should call to see about the wait. Thank goodness that we did. They had call ahead sitting. By the time we all got there, we were only waiting maybe 10min. With drinks, that was no time. About my food, it was excellent - everything. We tried apps, pasta, seafood, and dessert. All delicious. The crab dip was very good. I only wish they gave you more. I ordered the Lobster and Shrimp Pasta. Beyond tasty. A little spicy, but delicious. All my favorite ingredients, seafood (lobster/shrimp), mushrooms, cheese, noodles and it had tomatoes and green onions. It was a lot for a dinner portion, so I had lunch the next day. Now on to the dessert. We tried the sampler - Bread Pudding, Creme Brulee, and Apple Crisp, as everything looked good. My favorite the Creme Brulee. Very well made. Now I saved my favorite for last - their Flirtinis drink. Absolutely amazing! They were medium in terms of alcohol level to me. But they were so sweet and went down smooth. I also tasted the two Sangrias, but the Fliritini was the best.Loved, loved. I want to go back now."], ["Kelly M.", "I really like the atmosphere here.  The absolute best thing I've had is their Gorgonzola-topped filet.  They have an awesome menu with great variety.  Great happy hour specials too!!"], ["Meck G.", "Service was fine, but could've been more personable.  The food was kind of bland.  It was good, but I expected more.  The italian wedding soup was excellent though.  The bread was very good.  The spicy tomato cream sauce I had on my pasta lacked flavor.   My wife's chicken sandwich with applewood smoked bacon and avocado, had very good flavor -I wish I had ordered that.  Overall good, but I expected more."], ["Melanie E.", "Came in & sat at the bar again for dinner.  Bartenders are helpful when you can get their attention.  I think if I was on display (behind a bar) as they are...I would be more circumspect about discussing the tips I get, what I did last night (:O) etc...My pasta dish was really spectacular though!  It was the Lobster & Shrimp Ravioli with Crab Insalata.  Very well stuffed ravioli, cooked perfectly!  The crab insalata was some yummy dark greens dressed with a light viniagrette & plenty of yummy chunks of crabmeat.  The tomato sauce really was the best though...very bright, creamy with a slight smoky sweetness.  Chunks of stewed tomatoes throughout (but not stewed down to mush).I'd definitely recommend this dish."], ["Nash B.", "Love the food here, and friendly environment."], ["Kandi L.", "This past Monday was my roommates birthday so we went to celebrate and came to this place. Talking about wonderful! The service, ambiance, the happy hour and 3.95 food specials are the best! Love it b/c it's a nice chill spot to go to relax after a long day of work or to just lounge and kick it."], ["Ron H.", "Love this restaurant. ..the decor is beautiful and the atmosphere is a perfect complement to an intimate dinner.  Food was awesome as was the service. Unlike many upscale establishments this restaurant has not succumbed to the ripoff pricing structure of a \"fixed price menu\".Great experience for a Valentine`s dinner."], ["Brandi S.", "I love this restaurant!  The service is consistently great, with a welcoming and attentive staff.  The atmosphere is perfect for just about any occasion concerning adults.  I have celebrated my birthday here a couple times and each time the staff has gone above and beyond to make the day special for me and my guests.  The food has such an authentic italian flavor and I have never had a dish I did not like.  Some of my favorites are the campanelle carbonara, lobster and shrimp ravioli, and the crab and shrimp cakes.  Friends have also told me the salmon is perfection as well as the veal.  The wedge salad and lobster bisque are also amazing.  On top of the great food and incredible staff, the atmosphere here is also amazing.  I love the decor and lighting.  I will definitely be a returning customer."], ["Eric K.", "We went to Brio last night to celebrate my birthday.  I had signed up for Brio's email club several months ago and got an email wishing me a happy birthday and offering me a free surf & turf dinner ($30 value!).  Naturally, I couldn't pass that up.  Plus, we had been to Brio before and had an exceptional time.  This time, though, we brought my partner's kids.  I was very impressed with the kids' menu.  It was quite extensive.  There were regular kids' portion size items and then there were bigger portion options for older kids.  Some were full dinners -- grilled chicken or a pork chop with mashed potatoes and broccoli!  Then there's the create your own pizza where kids can choose three items on top of their humongous-sized pizza (it's literally enough for two meals).  Anyway, enough with the kids' stuff.  I don't order steak out very often, but I have to say that the filet served with my surf & turf dinner was one of THE most amazing pieces of steak I've ever had.  It was so thick, tender, and perfectly cooked and seared.  I savored each and every bite, and there were a lot of them.  The crab & shrimp cake that I was looking forward to was delicious, too, but the filet really overshadowed it, both in size and taste.  Rounding out the meal were roasted veggies and potatoes.  It was just the perfect amount of food so I wouldn't be overstuffed for the birthday cake that was waiting for me at home. :)My partner ordered the Sweet Potato & Chicken Risotto, which was prepared with pancetta, roasted chicken and sweet potatoes, grilled asparagus, Parmigiano-Reggiano, and pine nuts.  Our server described it as \"Thanksgiving in a bowl,\" but it was SO much more than that.  I tried a taste of it and it was incredible.  It had so much flavor to it, including hints of wine.  My partner gobbled it right up (pun intended).  I seriously think he could have eaten another bowlful.  Brio may look intimidating, but they're not as formal or pricey as one might expect.  Plus, they have a great, spacious, comfortable bar area, which I hope to experience sometime."], ["Pamela S.", "I've dined at Brio a number of times at various locations across the nation.  I have always loved the food, atmosphere, and service.  Let me also mention that I also always ordered the same dish (Grilled Salmon Salad) on each visit.  It had been a few years since we had dined at Brio so after I received a certificate for a free entree (steak and shrimp) for my birthday, I thought it would be a great opportunity to go back.  There were 4 of us in our party (me, husband, mother, and son).  We started with drinks (Blue Moon, Sprite, Watermelon Margarita, and Peach Bellini).  The drinks were all very good.  We ordered Calamari for our appetizer and I was very disappointed.  The Calamari appeared to be made from frozen, the batter was bland, and the temperature of the dish was luke warm, at best.Our entrees were also a let down in terms of temperature....especially since we waited a long time for our entrees.  My husband's Sausage Pomodoro was the only dish with steam coming from it, my son's Lasagna was very warm (not hot), and my Mom's Grilled pork chops were barely warm.  I ordered the Steak and Shrimp with Orzo.  The bottom of the scoop of orzo was very warm (not hot), but everything else on the plate was luke warm.  The sauce on the beef was heavily peppered and I had to remove it from the meat in order to eat it.  The Shrimp was also very peppery and I could only eat a couple of them.  When we told that waitress that the food was barely warm, she made a comment that she \"didn't make the food\".  I know that she was trying to be funny, but I really didn't think it was appropriate nor did she try to make it right.My son and I ordered mini desserts (milk chocolate caramel and tiramisu, respectively).  When the waitress delivered them, she put a candle in mine for my birthday and then told me \"I don't sing, so don't ask\".  Again...I think she was trying to be funny, but it still seemed a bit cold and unnecessary.  On the bright side...the Tiramisu was pretty decent.The realization of just how poor the meal really was came to light when the bill came.  I've been known to drop some serious money for a great meal and I will never complain about price as long as the meal is great.  However, to have sub-par service, luke warm food, over seasoned sauces (and under seasoned calamari), and a sassy waitress it sickened me to pay $160.00 for that meal!     Sadly, I'm quite sure that I won't be going back to Brio anytime soon.   There are too many good restaurants in South Park to go back to one where I've had a bad meal."], ["Peggy C.", "NOTE: this review and rating are for the dinner main dining room experience. For the life of me I don't understand why I keep getting really bad dinner service at this restaurant, which is unfortunate because the food and ambiance are both of decent quality. This past Friday I went to meet up with my friends at Piedmont Row for the golf tournament after party. I suppose all the establishments were aware of the special event and thus the crowd.  After mingling and enjoying a cigar, we came over for a quick bite. The hostess was nice and prompt, but that's the end of the pleasant experience.I don't recall the waiter's name, likely because he never greeted us or introduced himself. Heck, I don't think he smiled once. I guess he was on his \"barely minimum effort\" mode.  He barely paid attention. He barely took our order and brought our food.  I had to wait until my soup was cold to get bread to soak it with. The kicker was when the only guy at our table of 4 said to him \"put the appetizer on my bill,\" he came back with the appetizer split among all of us, then looked at us like we caused this, and half heartedly offered to redo the check by his manager (as in he had no intention of redoing it). Our guy friend felt awful, and we were all pissed. Oh, the food was good, the soup is always delicious, and the mushroom ravioli could have more sauce. But the service was so bad we couldn't really enjoy the food. MANAGEMENT: if you are reading this, please be selective with who you hired. This is my 2nd time stuck with the most uncaring server (ironically the same booth, 2nd to the last row, 1st booth near window). If they don't want their job or tip, I am sure someone else would. To end on a better note, they have a great happy hour menu, which restarts after 9pm. And their bar service is normally consistently decent"], ["J R.", "One of the best meals I've had in a long time...or ever. We came in drenched from a mini-typhoon, but were warmed right up by friendly service, a mellow acoustic band playing some folk and classic rock classics, and delightful food. My parents and wife and I were new to Charlotte and we were looking for a few good meals.  Brio definitely pleased.  All four of us were very pleased with our entrees (I had the pork chops). Based on the reviews I've read for Barrington's, it seems like it's a local favorite. However, I have to say that even after eating at Barringtons a couple of nights later, we unanimously all preferred Brio."], ["Londonbridge X.", "Great food, great service and great atmosphere. I'm never disappointed when I go here to eat. I love their spicy eggplant with shrimp and steak here. They also have great mix drinks and recently added the eggplant fries that is a MUST try!! I've also tried their lamb chops and its so juicy and tender!"], ["Tiffany N.", "Being an Italian girl, I am very picky about the Italian food. When I go out to eat, very rarely do I opt for Italian since I can make most of the dishes at home. However, I had a BOGO coupon for this place and decided to check it out. It was a gorgeous night so we had a short wait for the patio area. I like how they have cushioned seats outside where you can get drinks and also eat if you choose to instead of waiting for a table. They had an intriguing selection of wine and I had a smooth, robust pinot noir while waiting for our table.The service could have been better as our waiter wasn't too attentive. He did the job but forgot an item or two that we requested however the artichoke crusted beef medallions redeemed the bad service. They were absolutely perfect---cooked just how I ordered and they melted in my mouth. It was served with mashed potatoes and a hearty portion of fresh veggies and I couldn't have asked for a better meal. Others got the pasta which wasn't drowning in sauce, which is a nice change of pace compared to some Italian restaurants in the area. The chopped salad was wonderful as well-it reminded me of a greek salad.I absolutely love the patio area, selection of wine and was very happy my meal along with the variety of their menu. They had traditional Italian dishes along with more modern Italian dishes so you can go old school or new."], ["Melissa B.", "YUM!  This is a great spot for dinner (if you can duck the Sopa cougars!!!)  Service here is outstanding (we got a free plate of calamari - yay!)  Two waiters were by constantly to make sure we had enough water/wine/etc.  They didn't care at all when we lingered over wine after the meal - just great service.  The menu is a bit overwhelming and the smell in the place is so delicious you feel full when you haven't even eaten anything.I had the ravioli - so fresh and delicious.  The sauce was light and tangy - not too garlic-y.  It was way too much food - I had to get a to-go box.    The dim lighting makes everyone gorgeous - this is a great place for first dates!"], ["Ryan L.", "There's an inexplicable craving that overcomes my friends when they see an upscale restaurant near SouthPark. I can't blame them; great location, valet parking and decor that makes Olive Garden a 70's mom-and-pop Italian Bistro. I could honestly care less about the superficial details of any restaurant. Atmosphere will never hide the taste of mediocre entrees. And that's the case with Brio. The atmosphere of the restaurant is classy, service is great and made me feel relaxed. This all dissipates when your main entrees are served. You're brought back to the reality that there was a hidden cost to this atmosphere. My order was a Chicken Parmesan with their much coveted \"Italian Herb Pasta.\" When you look at the picture of what I was served you will understand why I have the following opinions.It looked like a novice chef beginning his first day on the line. Nothing was special about the meal at all. Herb pasta was probably the only part of the dish that had any new or exciting taste bud busting flavors and even that was short lived. I looked around at the other meals being served at my table and it was pretty much the same. Olive Garden dishes in a fancy location. For the record, Olive Garden is just as sub-par and I'm in no way promoting Olive Garden rather providing a comparison for you to visualize. I'm not a person looking for massive quantities when I come into a place like this, but I'm expecting fresh ingredients. The salad was withered and the fresh vegetables looked just the same. If you're looking for a great dinner atmosphere, then by all means come and enjoy the place. Just remember, \"looks aren't everything.\""], ["Travis W.", "I tend to forget about this place when thinking about a dinner out.  That's sad to say because I really enjoy the dishes here.  Great food and the service is as good as any.  Combine that with the decor and dim lighting and it actually makes a pretty good date night location for me and my love.The particular night we were visiting they actually cooked an extra calamari starter plate and offered it to us for free. That's a win!"], ["Mike M.", "Having lived in Virginia before coming to Charlotte, I frequented the Brio in Tysons Corner quite often. It was a nice place for lunch and dinner with friends. Since moving, I've visited this location three times and it does not disappoint. This location has a larger dining room and bar area than the one that I was accustomed to. And since the VA one was in a mall, it lacked the outdoor seating that this one has. Which is a definite plus!The food here is terrific. I'm a fan of their pastas. Good portions, nice flavor. Good stuff.We also had the chocolate molten lava cake. I must say, it was delicious. Service was fast and attentive. Our meal was out pretty quick. Our waitress was especially warm and personable and gave her share of suggestions. Price isn't bad. Definitely a nice place to take a special someone to dinner. The bar area is cool too. And apparently they have appetizer specials in the bar area on weeknights.Definitely worth checking out!"], ["Hayley H.", "I like Brio for a chain restaurant they always know how to make a good drink. I try not to go out to eat late after being I. The industry for many years Tahoe people that walk in 10 mins before close used to kill me  but my fiancé works late and we went in around 10:25 one say when they were due to close at 11pm. We still got amazing service , perfect freshly prepared food and were not ignored or rushed... So in one slightly dirty martini and one great tip later we have decided we will go again ... Thanks Brio...."], ["David R.", "First time visiting Brio. I had the lamb chops, served with mashed potatoes and asparagus.It was great! The lamb was cooked the way I liked it and seasoned well.The Merlot I had was good also!I don't have a lengthy review to write about Brio, but it is a restaurant that I would try again!"], ["Phi N.", "I came here not knowing what to expect. Turns out that the place is fantastic! I sat around the bar area. You also have the option to sit outside. The area is really new and clean, so it can be nice out there. As for the bar area, it was kind of crowded, but there was a sweet live band. Oh, and lots of ladies in their 40s getting crunk and getting down... It was kind of awkward for me because there were only a couple people in their 20's there, but at the same time, it was pretty interesting to see, lol.I really only came here to eat though, and have a couple drinks before going out. Food was on point. The bread and crackers were delicious. I preferred the crackers; there was cheese on it or something. We started off with some calamari and then I had the veal marsala classico. Calamari is always good anywhere-- the pieces were pretty large too. It came with two sauce, a mayo that I thought was too rich in taste and a marinara sauce. I like to mix the two... My main dish tasted great. Not sure how to explain the sauce... I really like mushrooms too! I enjoyed how the vegetables and potatoes complemented the veal. mmmM! Ask for Edith, she's an amazing waitress/bartender!"], ["Kelli B.", "Went here last night for my MIL's birthday.  The service was okay - when we asked the waiter to take our photo I'm pretty sure he rolled his eyes.  But the food, the food was AMAZING!  My Hubs & MIL both got the lasagna.  I had the Pasta Alla Vodka and my FIL ordered the Pasta BRIO.  Hubs considers himself a lasagna connoisseur, and he says that the lasagna at Brio is THE BEST in Charlotte (2nd and 3rd place go to Mama Ricotta's and The Open Kitchen).  When asked to describe why Brio is the #1 lasagna in Charlotte he said, \"It's better than the other lasagna's because it incorporates alfredo sauce in addition to the red sauce.  I also believe that it's not sliced out of a large pan but built to order with fresh pasta.  It's also very meaty.  Can't be beat.\"  My FIL took a bite of the lasagna and said, \"That's the best thing I've ever eaten.\" :-)I'm also convinced that my pasta alla vodka was made to order with fresh pasta and it was phenomenal.If you're looking for a great italian meal in CLT you have to try Brio - and I highly recommend reservations, there was a big crowd on Saturday night."], ["Pat P.", "They charged me the drink I sent back, not cool"], ["Ronnie A.", "We come to Charlotte at least once a month on business, we always try to eat here. We come from a city of restruants and many of them high end. The service and food is out of this world. They know how to do it right, it is obvious  they cater to and know how to maintain a top shelf  restaurant.  I am sure there is nothing on the menu that we have not had or sampled, with all thumbs up."], ["Jacqueline P.", "So service here can be hit or miss. I totally understand why people give them bad reviews based on that because I've had some fairly crappy waiters. Whether it be incompetence or haughtiness (I've had both types) they should really work on that.  However they have some really REALLY good food here. Not everything is amazing but there have been some stand out things.  I love LOVE their sweet potato and chicken risotto!! Seriously I would cry if they got rid of it. I don't like asparagus but I will eat it in this that's how good it is lol.  My partner in crime absolutely loves the Ravioli di Bello (lots of mushrooms). I've tried various appetizers which had all been decent and the desserts are good. My favorite is the chocolate chip bread pudding seriously sooo good :-)  Even with the hit or miss service I still will give this place 4 stars because the good is so good!!"], ["Corey Tess T.", "I used to eat lunch here about 3 times a week. The patio is great and the bar is comfortable. When I was there they had a great \"happy hour\" where appetizers and small menu items were about 5.95. They carry Sketchbook Cab by the glass which was my staple and the wait staff is very professional and sweet. The managers are great too.. Say Hi to Julian for me.. My faves were \"The Salmon Salad\" and the \"Chicken Parmigiana\" as well as the \"Wedding Soup\"  and the cute little mini tiramisu in a cup. The take a long time to make a cappuccino though and it is always scolding HOT, so if you are like me and want an after meal coffee, make sure to tell them about 10 minutes before you actually want it.The main dining room has many big booths and they are great for when you are having a working lunch, you have room for your note pads and things. The patio is great for chillin out with appetizers and wine in the summer time.. the place does get packed during special occasions, but they move pretty quick.. I used to get sick of Brio, simply because it was the place downstairs from where I worked, but actually it was great to have them so close on those days when deadlines did not permit me to sit down and eat in peace.. the take out is just as good.."], ["Tera S.", "If I ever go back to Charlotte, NC I am returning to this place for many reasons. The food was delicious I had the lobster bisque, best I ever ate. Followed by the roasted garlic & spinach artichoke dip (I couldn't stop eating it), finally the Lunch crab cakes. The service was amazing, only wish I could have remembered her name. The restaurant was immaculate and so was the rest rooms. Only negatives were there was no changing station for our infant. I ordered two pomegranate martini's in which they were both made differently. However, I enjoyed the second much more."], ["Heather T.", "I love coming here when I'm craving Italian cuisine! The food is always great, but my favorites are the Ravioli de Bello and the Lobster & Shrimp Fettuccine. The service is always friendly and helpful, and I love to see that everything is always consistent. Overall, great food, polite customer service, and a beautiful location!"]], "Portofino's Italian Restaurant & Pizzeria": [["Ryan D.", "Let me just start by saying... If you go to a restaurant that is known for its pizza, then order a salad, then it is YOU that deserves the low star rating. Best pizza in town that I know of. Best cheesesteaks in town hands down. Best garlic knots for sure. I've never had a Chicken Portofino anywhere else, but I can't imagine it would be better. Summary: phenomenal"], ["Sara P.", "After a long road trip, I was interested in trying out a unique or \"buzzworthy\" local restaurant as a first-time Charlotte visitor.  When my host pulled up to Portofinos in a non-descript strip mall, I was a little disappointed.  Italian restaurants from my hometown of Indy mostly offer bland-tasting, Americanized muck, so I was immediately biased against Portofinos. However, I was pleasantly surprised by Portofinos...décor, food, service, and all. Our table split both a bottle of dry spicy Malbec and the delicious Hot Antipasto sampler (clams, mussels, stuffed mushrooms & eggplants, and shrimp).  In an attempt to avoid a too-rich meal, I ordered the caprese salad and a cup of Italian wedding soup for dinner. While the mozzarella didn't meet my ideal (i.e. buffalo-milk-based bits of heaven), the salad was fresh-tasting and hit the spot. I also tasted my dining mates' salmon salad, baked ziti, and shrimp scampi. All were good, but the grilled salmon salad really stood out.  It came with a diverse assortment of marinated vegetables (artichokes, mushrooms, red pepper, etc) that really elevated the salad beyond just plain ole lettuce & fish.I regret not getting to try out Portofinos' pizza, as I was repeatedly told how delicious it was.  You can watch the pizzas being made through a glass partition, which was a nice touch. Next time, no more negative Italian food bias ...and anchovy pizza, you will be mine!"], ["Saniqua P.", "I tried portofino's for the first time on a Wednesday evening a couple weeks ago. This location is in a shopping center that's in a somewhat shady part of town (so I was definitely glad that we were in and out while it was still light out).We were promptly seated and informed of the specials of the day. I had my mind set on ordering a sauvignon blanc but was told that they didn't have any so I settled for a glass of pinot grigio that very much tasted like a cheap glass of wine. I ordered the arriabbate which came with a side salad and Italian bread.I decided to try the house salad dressing, which is tomato basil, and it was very good. Not too heavy but not too light either. The Italian bread was the true star. It was slightly warm and served with butter. Absolutely delicious and I even asked for a second bread basket #allthecarbsplease.My main dish, the arriabbate, was just OK. I was expecting to taste more of the flavors but all I could taste were tomato and olives. The prosciutto that it's supposed to have was very inconspicuous to my taste buds. Our waiter was in training so he was very attentive to our needs.Overall, I'd say it was good 'bang for your buck' meal and I'd be willing to try the other locations."], ["Sequoya S.", "Somebody recommended Portifinos pizza to me. Well I decided to try it but I didn't get pizza I got a meatball sub ($9.65 way too much) and it was awful the meatballs were so nasty.  I will try Portifinos again but this time I will try the pizza like I was supposed to."], ["John H.", "I have an unnatural love for the white pizza with broccoli.  Nothing fancy, but just the right combo of salty and greasy and comforting.  I've had the capresi salad as well when the tomatoes are in season and it is just what you'd expect.  They may also have other good stuff, but frankly I always order the white pizza with broccoli.I do look at the desserts most trips and have had several that are excellent.  Over the years I've done their cheesecake regularly, which is a good sized slice of very respectable cheesecake with a raspberry drizzle.  I've also done their carrot cake, which I like a little less.  The frosting is less cream cheesy than I'd like.  They also often have special desserts and those are hit or miss.  Most recently had one that was two layers of a homey white cake with a lemon creme in between and it was fabulous.    Wouldn't mind if they had that one as a standard offering, although I'd probably have to buy larger pants.  We tend to take out, as it's in a sketchy shopping center and can get a significant number of beggars/loiterers over the years--east end has character:)  Shopping center may be looking up, however, as a QT has been built as a new anchor.  If you want more typical ambiance, go to the Park Rd. location, but expect a wait.  Overall, a very solid little restaurant for unpretentious Italian food and some surprisingly good desserts."], ["Elizabeth B.", "Yum, yum and yummy. I had my carb overload from here and that is okay.  For a starter I ordered the calamari and it was delicious. It came with the usual marinara sauce and slice a lime.  What I could appreciate about the calamari was that it was not overly salted like most restaurants do. My meal that I ordered came with bread and salad.  You can tell the bread is fresh out of the oven and I enjoyed every bit of it. The salad was just like any other iceberg salad so nothing really special but I did love the house dressing.  As for my main dish the tortelini gorgonzola and it was nice an rich the way I like it.  I am so lucky I don't live in the area. I know I will be back!"], ["Bev L.", "Very nice! It's been at least 10 years since I've been to Portofinos. Don't know why I waited so long to return. Maybe because it's located in a not so desirable part of town. This side of town has been trying to \"revitalize\" for years but I guess not enough gentrification has occurred. Anyhoo (yes, anyhoo), after attending an event at nearby Ovens Auditorium, our group of 5 went here for dinner. It was close to 8:30 pm upon our arrival and the restaurant closes at 10. Nevertheless, we were greeted with a smile and attended to promptly. Three of us ordered the special \"lobster ravioli\" and it was amazing! Huge portions and a yummy sweet sauce. Sorry, I didn't take a picture. Another ordered the lasagna and she really enjoyed it. Everyone took home doggie bags because the portions were so huge. Our server was great. Prompt, attentive, polite. The prices were very reasonable. Oh yeah the bread! So good! Hot and soft! Butter just melted right on it. Will definitely need to come to this side of town again. Glad that Portofinos decided to stay and support this community."], ["Chris C.", "Got there about a hour before closing time, still welcomed us as if we were there first customer of the day with excitement. Got the bruschetta, fried calamari, and shrimp scampi!! I was hungry so the shrimp scampi was on point. Fried calamari was ok I had better. Bruschetta my g/f ate that and she liked it. Def try em out tho!!"], ["Kendra F.", "I first came to Charlotte and knew my NY Pizza life had ended. But I was pleasantly surprised that Portofinos knew good pizza. I told them when I walked in that I would be honest if it sucked. I was honest and it was fantastic. I have never been let down. We get a pie for lunch and and eat in the car. Just cause its fun. The arrabiate is great too. I have seen them grow from one store spreading throughout Charlotte.  Its worth trying. Enjoy"], ["Kat T.", "My son turned 21 and wanted pizza. Are you serious?!. We are not in Chicago buddy!We sat in the driveway with all five kids for about 25 minutes while I searched on Yelp! for a decent pizza place. Criteria being good, not too fancy, or expensive.We narrowed it down to this place and finally headed out with hungry monsters in tow.What is up with restaurants in mall strips? It really give us pause as to whether to enter or not. Sorry. I'm not from around here so I'm still adjusting.Well, we ventured with our ravenous pack and was seated immediately. Ordered our drinks and appetizers. Then two pan pizzas. I appreciated the quick and attentive service.Loved the mozerally sticks. Bruschetta was missing something but decent.As for the pan pizzas- delicious! Cheese tasted fresh. Sauce was flavorful and not overbearing. Crust was buttery and thick. Little monsters transformed into happy satisfied saints. We left full and happy.Birthday dinner for my now adult child was a success.Guess where we are ordering our pizzas when the Chicago Bears are playing?"], ["Abby L.", "Food is very good, consistent each time. Fast service for ordering pick up food. I dined in twice and never had to wait. Only downfall: pasta is pricey and no kids menus."], ["Katie R.", "Found this place in yelp! 4 stars so I thought it would be a winner. Ordered two takeout pizzas, pepperoni and white with broccoli. A little doughie for my taste, and not enough broccoli or garlic flavor on the white one. Would have given two stars originally but we had the left overs for lunch and it crisped up in the oven  and was better the second time around."], ["Joseph P.", "Best pizza in the 28205 and surrounding areas. Authentic Italian dudes running this joint and reminds me of the pizzerias I grew up with in NY. I usually stick with their pizza, however I've had a few pasta dishes here and loved them as well."], ["Jason R.", "Awesome pizza.  Come to think of it, I've never been disappointed with anything from here."], ["Anand G.", "I hope this business thrives in this location for a long time.  Its sad that this shopping center has kinda gone the wrong direction.  Once your in Portofino's you forget about the shady people and businesses outside.  I came for lunch with a friend and was promptly seated with and given bread and butter immediately.  The waiter came out several times to refill our drinks and knew I was going to order more.  I must say that at most Italian joints, the calzones and Stromboli's are made fresh in the morning.  This does not allow for custom options.  Here I was able to order a stromboli with lots of marinara sauce without ricotta cheese. Something, I have not seen most places."], ["Jackie P.", "I've lived in Charlotte for about 10years, and I have eaten at Portofinos for 10years. I have nevered had anything but a large pepperoni pizza.. And their pizza is AMAZING. Perfect, thin, great sauce gooey cheese and just enough spice to the pepperoni. Perfection in a slice. The service is always great, I always like to sit at the counter to watch them while they cook. The owner is really funny and loud and Italian. Perfect ambiance. Recently I had the pasta puttanesca for the first time, all I can say is Mmmmm. Chock full of olives, capers, chunks of garlic and tomatoes, it was sheer heaven on a plate. My penne noodles were cooked perfectly, not too mushy or hard. It was a great meal with salad and bread sticks. To be honest, I still had to take a pizza home as well, its that good."], ["Ashley B.", "I haven't tasted anything from here that I haven't loved! Truly reminds me of the Italian food I grew up with in upstate NY. Dine in or takeout, always consistently delicious! Some of my faves are Veal/Eggplant/Chicken Parm (basically all the Parms,) Manicotti, and Linguni with Arrabiata Sauce. Great service, and I love that you get a salad and bread with your meal. You can tell these people really care about their guests and business."], ["Amanda M.", "If you own a car and live in the 28205 zip code, there is NO reason to order delivery. Go pick up your pizza from Portofinos. It authentic...down to the genuine Italian guys running the joint...who will verify with you EVERY single time you call that you are calling the Eastway location. I get a large pepperoni, small cheese, garlic knots and cheesecake...and I drink a peroni when I go pick it up."], ["Katherine C.", "How oh how have I not reviewed Portofino's yet?We have been going here for years. It is a great, local Italian restaurant. The pizza is ABSOLUTELY DELICIOUS (the quottro is our favorite). All of their pizza is delicious. The seafood pizza is surprisingly good. I honestly think this is probably the best pizza in Charlotte.Go sometime for the other dishes- everything is good. Don't get sucked into thinking it is just pizza.The owners/staff are warm, hilarious, hospitable and genuinely get to know you. We have had a good/ongoing rapport with most of the staff for years now. They treat us very well. If you become a regular- they will treat you like family. The house salad is really, really good. The dressing is homemade. DIP YOUR CRUST IN THE DRESSING. My only complaint? They don't deliver"], ["Tamara A.", "Will never ever return to this location again. I've been coming to Portofino's for over 10 years. Never been so disappointed. I always get shrimp Fra Diavolo with a mix of marinara and Alfredo. First time ever (actually second, same rude waiter different location) the waiter insisted that I had to get a side of Alfredo and be charged 3.25. Ok fine. So then my salad got an extra dressing $1, croutons $1, cheese $1. When the bill came it showed 55.60. I added it up four times came to 52.60 waiter said its because they didn't have the buttons to add the dressing, cheese and croutons. So why are they charging me for it. I'll never come back here, long long time customer lost. Food was good as usual. Had this same issue with this waiter before the other waiter said don't worry it's his last day. Just to realize he only moved to another location."]], "Riccio's Italian Restaurant": [["F T.", "The food was okay.... Just okay nothing exciting about it.  My problem was the service. We had to ask for plates when the pizza we were splitting was served, And the service for drink refills was nonexistent. The server we had was friendly with lots of people and those people she paid attention to, she did not know us and therefore had no time for us. I have the spaghetti with meat sauce and there was a lot of water in the bottom of the dish. The pizza was way over sauced, and the crust was not  crispy. The one shining moment of the night was the garlic knots... They were really good. Probably would never go back!"], ["Jonathan T.", "Oh Riccio's how I adore thee!  If you are looking for some good Italian fare then you should try this place out.  I've never gotten anything in here that was bad and most of the entrees are wonderful.It's worth a trip there for the complimentary garlic knots alone...yum!!  I give them a solid 4 stars because while the food is great it's not really 5 stars great.  Also the atmosphere in the restaurant isn't the best in the world but considering it's in an older strip mall they are doing pretty good.I haven't tried the pizza before but they seem to sell a lot of them and the wait staff and owners are always super friendly."], ["wen t.", "I bought a groupon deal for Riccio. The eggplant parmesan pizza is amazing and it has the best garlic roll.  If you want real Italian food, Riccios's is the place you want to go. It has plenty of parking space you can park. A great place for family to eat. Friendly staff."], ["Bill P.", "The expanded location is very nice. The food is just as great as it ever was.  I am a huge fan of pizza and Riccio's version should not be missed. Although pleasant, the service was painfully slow, but that's what you get going out on a Friday evening."], ["Rob B.", "We found this restaurant on yelp.  Service was very good.  Waitress was friendly, attentive and made great suggestion on the meal - go with the tomato cream sauce.  And the garlic knots were spectacular! Don't let them being a second basket or you'll eat them."], ["Liz M.", "I visited Riccio's for the first time after a coworker recommended it. She raved about the pizza so we tried it. I must say it wasn't my favorite pizza ever. It was a veryyyyy thin crust pizza with a sweet sauce.  As we waited for our takeout the owner or manager came by and greeted us. He was very friendly and thanked us for coming in. I think next time I will try something other than pizza."], ["Caitlin M.", "I can't say enough good things about Riccio's. I love it!!! I have been going there since I was a kid and nothing changes so delicious and never disappoints! Hidden gem!"], ["Miranda C.", "Garlic knots, is all that needs to be said.  Half a dozen for 2 bucks!!!!"], ["Mindy V.", "OK, so not sure it deserves 5 stars- probably more like a 3 in another City- I ordered the fish with alfredo sauce which sounds gross but is AWESOME.  The manacotti is really dissappointing.  I adore manacotti and was really sad it wasnt good, a friend had told me that it wasnt good here but I ordered it anyway- yuk. Riccios- if you hear this please revist this recipe and you could have a once a weeker in me.  Seriously- if you do change it send me a message and Ill yelp you again and spread the Riccios gospel.  BUT Im giving it 5 stars because they have excellent pizza- fish romano and DELIVERY!!!!!  Seriously Charlotte- WTF here, why does no one in this town deliver in the Southpark area??  So kudos to you for that.  Plus the delivery guy is great, really stands out!"], ["Adrian C.", "I give this place two stars because the service was friendly and accommodating. Pizza...2 stars, presentation...1 star. Why do all the places around here say NY style pizza? Not even close :("], ["Ted M.", "Only place we go for pizza locally"], ["Mike C.", "Best Italian in Charlotte? Debatable. But it's pretty darn good. They are definitely in my rotation of go-to pizza spots. The portions and ingredients are good. I will agree they have excellent service. The interior isn't anything special but it's not an eyesore either. Stop by if you're in the neighborhood and you shan't be disappointed.Edit: They do not serve pizza by the slice. I definitely thought it was important to note that."], ["Coleen B.", "Still a huge fan 2 years later - they have recently updated the interior - has a really warm and fuzzy feeling now - Tanya is the best!  Great wine prices and the food is still 4-star - love this place!"], ["Gary S.", "I love this place. The kids always get the pasta and my wife and I usually get the pizza, although my wife likes to explore the menu, and she has yet to find anything she didn't like. As for me, I keep getting the pizza... it's fabulous, so why change?The restaurant was recently redecorated and it looks great. Even with the new ambiance, it is a great place for the kids.The garlic knots are great and the service is great."], ["Steven C.", "I had the Tortolloni Bellagio without mushrooms, and it was RIDICULOUSLY GOOD.  Oh my gosh is was some of the best pasta I'd ever had.  It did taste kind of like really good macaroni and cheese but it was of the gods it was so cheesy and delicious.  My friend had spaghetti with marinara sauce.  The marinara sauce tasted kinda strange, so it was just ok.  The garlic knots they serve you for appetizers are delicious as well.  This place is definitely off the  beaten path and most people wouldn't know about it.  Thankfully, it came recommended by a native Charlotte person as I moved here recently."], ["Gigi P.", "The best Italian delivery! Large portions and always good. Super fast delivery and staff excellent at handling orders. Salads are fresh. Which is hard to find in a restaurant that delivers."]], "Stagioni Four Seasons of Food": [], "Maggiano's Little Italy": [], "Luce Restaurant & Bar": [], "Fiamma": [], "Napa on Providence": [], "Aria": [], "Libretto's Pizzeria": [], "Toscana": [["Michael A.", "This is our second visit to Toscana, the first time was with just my wife to celebrate our anniversary, this second trip to celebrate my birthday with the entire family, and both times it has been a fabulous experience. The service first of all is outstanding, our waitress was textbook perfect, making suggestions, answeing questions, and no request was an issue, all were met with a confident smile. She knew the menu extremely well, including the off menu items for kids. The food is outstanding, everything from the bread and bean dip, to the main dish to the desert and coffees. We will be back again and again.  And the house wines are fantastic.  Hiighly recommend this for all occasions."], ["Ron D.", "Lunch for two at Toscana. We both had the Carbonara and shared a nice bottle of Primativo. Service was exceptional. The beans that come with the bread are very good. The Carbonara was good but I make it better. I like bacon in my Carbonara instead of ham. The waiter was nice enough to provide us with a bottle of the wine that was a special and it was very nice. Most wines carried the typical restaurant level prices (a little high)."], ["Karthik R.", "Good ambience, food and service. Vegetarian menu was good but limited though. I will return..."], ["Mike C.", "Went for date night with my wife last night.  Had to catch an early movie so we made 5:45 reservations at Toscana.  It was a perfect fall day yesterday so we were greeted promptly and decided to sit on their awesome patio.  This restaurant is tucked away by Williams - Sonoma across from Southpark and could easily, but shouldn't be missed.  It was early so there wasn't many people there but got steadily busier as the nigth progressed.The patio area was for the most part quiet except for the occasional passer by or some skuttle could be overheard from nearby Bricktops.  The fountain added to the ambience nicely.The service was prompt and attentive without being overbearing.  The specials were well explained and I ordered the Caprese (Tomato, Mozz, Basil) salad which was wonderful with ripe, flavorful tomatoes and fresh tasty mozzarella.  The balsamic was drizzled sparingly so we ordered an extra side.I chose the grouper as my entree which was nicely pan seared and served on top of potato stacks and accompanied by a nice lobster ragu.  It was well put together and the flavors meshed nicely on the pallette.  My wife had a simple penne pasta with shrimp and zucchini.  The pasta was cooked perfectly al dente.  The value of the meal was great and with us sharing a dessert of Tira Misu it cost us $88.00 which is what we expected.  I like Toscana, and have been there before.  Good, consistent flavorful regional Italian dining that should be celebrated in this world of \"never ending pasta bowls\" and \"Family Style Italian\""], ["Claire G.", "Great dinner but customers beware that even when you specifically ask for decaffeinated coffee this restaurant will substitute regular coffee without informing you.  This may not seem like a big deal but it was given to an individual with a heart condition who as a result had an episode of irregular heartbeat that needed medication.  Its sad to believe that in today's day and age restaurants will lie to customers and create health issues for them just to sell a cup of coffee.  It was a sad ending to an otherwise great dinner."], ["Kate T.", "Upon arrival, we were treated at the bar with a nice glass of Prosecco, and were seated quickly to a nice booth in the corner.  We enjoyed the Fritto Misto and Bruscetta, both amazing...along with the homemade bread and cannelini bean rub, to die for.  We all chose different dishes, and shared.  From the evening special, mushroom risotta, to the positano, the dishes were fresh, light, and gave my Mom a true Tuscan experience.  For dessert we enjoyed cappacinos with cannolini & meringes with homemade whipped cream, raspberries and strawberries.  The entire evening was a pleasure and the environment was enjoyable. I look forward to our next dining experience at Toscano!"], ["Pete C.", "I wanted to love this place, really love this place, but it just wouldn't let me. There was something off, not too bad, but just off. People were nice, food was as good as other Italian places (except Portofino's of course). The service was good, the line wasn't too long. Anyway,it's in a nice spot, around the corner from Williams and Sonoma. So a little shopping and a little dinner. Maybe more shopping than dinner."], ["Eric K.", "Toscana is a small Italian restaurant tucked away behind Williams-Sonoma across the street from SouthPark Mall.  You'd never know it was there; there's virtually no signage.  Upon arrival, I was immediately impressed with the outdoor seating courtyard by the water fountain.  It immediately appeared to have a lot of atmosphere.  We entered the restaurant to check in and I was again impressed by the quaint atmosphere indoors.  The hostess was very accommodating and got us a great table outside by the water fountain.  We had read here on Yelp about the complimentary bread and bean dip, so we were surprised that we hadn't gotten any after ordering.  We finally received some (as did other tables) right before our meals came.  Perhaps there was a bread back-up?  The bread was delicious, but the bean dip wasn't actually a \"dip.\"  It was more like whole white beans in oil with seasoning.  Still good, though, but a little messy on the bread.  The food was excellent, although a little pricier and smaller portioned than your Italian restaurant chains, but the pasta is all made fresh in-house.  It was the \"just right\" size so as to fill you up but not leave you overstuffed.  For hearty eaters, though, it probably won't be enough.  Sides are available for an additional charge.I liked that Toscana had a variety of pasta options; not just the traditional ones.  I tried the Carbonara.  It was very flavorful and creamy.  Our table by the water fountain was perfect for the beautiful evening we were there, and we had a great experience.  Would we come back, though?  Most likely not.  Not for anything that the restaurant did.  The clientele just felt too snooty and \"plastic\" for us.  Fortunately, the servers and hostess with which we came into contact weren't."], ["Corey Tess T.", "I use the word adore alot.. so i will say J'adore Toscana! Seriously, some of the best lunches and dinners I have had in Charlotte have not been at Del Frisco, Ruth's Chris, Morton's (though I have enjoyed them also) but at this quaint little hard to find spot...I see someone said the service isn't good, this can be seen both ways, I love the staff there. They speak italian for the most part and struggle a little with communicating, but let me tell you, every time we came in, they knew i took sparkling water instead of flat and the little girl who never said a word to me EVER in all the time I had been going there never failed to automatically brine me my cappuccino at the end of my meal, as if she was reading my mind..  the menu is small, but the risotto and frittata change daily...  my fave is the Rigatoni Buttera and the Bow Tie Pasta dish...  the frittata when I am trying to be good about protein and the caprese is TDF!The hostess there actually recognized me when she was working over at M5 and was happy to see me there too :)It is a tiny dining room, but on sunny days you can sit in the courtyard.. the frito misto is yummy to start and share and the bean/oil dip for the bread that they provide is SO YUMMMY!As a foodie, I really adore this little gem.. it reminds me very much of Europe, even the staff being a little scattered now and then doesn't bother me because that is SO truly italian. in italy they just close the restaurant when they feel like going home or having their own lunch or dinner.. lol..  i guess it is all part of the experience to me.. and they really are nice people...  don't be put off by the language barrier, flash a nice smile, you will get one in return.."], ["Christian R.", "Good food and wine.  Had been here for lunch a few times over the years and always had a good experience.  Not sure why it took me so long to try dinner at this fine establishment.  My only complaint- thought the calamari was bland but cooked properly. For my entree i had the sea bass special they were running..sea bass with potato, artichokes and EVOO.  VERY good and perfectly cooked.  I will definitely visit this place again."], ["Erin B.", "My husband has been wanting to eat here for months ... his colleagues at work claim that this is \"the best restaurant in Charlotte\" and yet it's never quite made it to the top of our list. Finally, the stars aligned, we got a babysitter with a limited schedule and needed to eat close by and early ... so I grabbed a same-day Friday reservation on Open Table for Toscana. I was excited. I kind of got dressed up. I even wore heels. And then ... mehhh. I'm not sure that I will rush back. The hostess was nice, the ambience was pleasant, the white bean dip was incredibly delicious. But the actual meal ... not so amazing. We split the calamari and an arugula salad. The salad was delicious. The calamari had to be salted - it was light and crispy but no taste. My husband and I both ordered fish - I had salmon, he had a trout special. His trout was very good and well seasoned. My salmon was too thick and not well seasoned. Again with the salt shaker. Hoping to have better success with dessert we both ordered dessert. Silly, silly us. The desserts were decent but they were huge. Of all the times we decide not to split the dessert... of course. My husband ordered the tiramisu and I ordered the creme brulee. Both desserts were simply too heavy. Strangely enough, while we were there ... we see my husband's boss and he says, \"This is the best restaurant in Charlotte.\" - in kind of a secretive, hush-hush tone. As I looked around the room, I noticed that we were just about the youngest people in the restaurant by 20 years. So... if you are over 50 and have lived in Charlotte for many, many years, this might be the place for you. I, however, prefer to explore the endless array of inventive eating options that Charlotte continues to serve up and save this place for the regulars."], ["Jane T.", "I recently read a study about how people are much more likely to enjoy a place and write a favorable review if there are already favorable reviews out there, and that's the only way I can account for the good reviews of this place. If I had an elderly aunt who was used to the Olive Garden and had more money than sense, this might be a good place to take her. The food was a step up from the OG (the salads not even that) but nowhere near the quality you'd find in a decent Italian restaurant in Italy, New York or London. The menu is unimaginative and its execution mediocre, and the waiter had the personality of a flounder--I would have called him surly had he actually spoken more than the bare minimum. The patio was pleasant, but hardly a magical place. I'm happy to pay high prices for great food, drinks, and service, but we left Toscana feeling as if we'd just been mugged. $10.50 for a house gin and tonic. Seriously?"], ["Julia M.", "Toscano has been serving up wonderful and authentic Italian food for over 10 years and I love authentic Italian food!  I have enjoyed many great meals here at lunch time and at dinner time as well. Toscano is an excellent escape for lunch if you want to get away from the loud & obnoxious crowds. And, at dinner time, the ambivance is intimate and somewhat romantic.When the weather is not blazing hot & humid, they have a wonderful little patio tucked in the middle of the Specialty shops which I think should qualify as one the best patios in Charlotte. This place is nothing like the big chain restaurants.  It is not Americanized-Italian food served in ginormous, family-friendly portions.  If that is what you are looking for, skip Toscano and head over to Maggianos instead. It is not inexpensive at dinner but for me, it has always been well worth the splurge.  It is a small restaurant and I cannot imagine going here with a  group of more than 4 people. To me, it is at it's best when the restaurant is not too busy (i.e., not during restaurant week) and for smaller, more intimate dinners. Lunch entrees are typically in the $10 - $12 range with selections of various appetizers, salads, paninis, pastas (including some freshly made in-house), and chicken or fish with fresh vegetables.Dinner entrees range from $16 - $26 and offer a wide variety of pastas, meats, seafood, and chicken dishes. Of course, at dinner you'll want to start with one or more of the wonderful appetizers as well. They have a nice selection of wines by the glass or by the bottle - even if you are not an Italian wine afficienado, ask your server for suggestions for they have some really nice Italian wines.  I like to start with a glass of Prosecco before dinner and then switch to something that complements my meal.  After dinner check out the dessert  menu for the after-dinner drinks such as Moscato."], ["Andi M.", "I'm torn with my rating of this place. I really wanted to love Toscana. But several things just don't let me do that:1) Toscana is small and when full, it's so loud you can barely hear others in your party talking. That's not my idea of a nice dinner out.2) The menu is too similar to Positano (closed for over a year), and Luce. But the prices are higher. Why don't you set your nicest restaurant in the group apart by offering a truly different menu? And two items our group ordered were nothing special (snapper and lasagna). Only my hubby's mare (a high-end version of seafood linguini) was worth getting again.3) Service was extremely slow, and our server was not very attentive to our group. Again, it wasn't what you would have expected from a high-end restaurant. I much prefer Luce over Toscana, and will likely never return here for the reasons I mentioned above. If you decide to go, definitely go early to beat the crowd. And try the mare if you like seafood."], ["Lettie J.", "I broke bread with my new employer at Toscana, it was like a being in New York with old school Italian Families. The space was small but awesome and the decor was unique. I started with a taste of red wine, it was ok, but ordered goose and tonic, I ordered the Kale Salad good, then followed with Mare: Lobster, shrimp, calamari, clams, mussels, scallops, imported linguini pasta, cherry tomatoes, peperoncino, garlic & white wine"], ["Christopher S.", "My 2011 rating remains at 4 stars. This place has great food and service. I am actually shocked at a couple of these reviews indicating the food was poor quality. May have been an off night, Chef not there, not sure.I have tried everything on their menu and found 95% of the entrees to be excellent. The other 5% were good.Excellent wine selection, fun crowds, the place rocks for me. Many people recommend this establishment to vistors coming to Charlotte.Good price/value relationship."], ["Stephanie T.", "Toscana, how I love thee!  I have dined here a handful of times never to leave disappointed.  The inside is charming and romantic, and the cozy outdoor patio is even more so.  This is an EXCELLENT date spot, and has way more character than one might expect.I highly recommend the salumi and formaggi as an appetizer.  The tartufo is my most favorite cheese in the world.  Creamy and truffle-y.  It's perfect.  The calamari is crispy and delicious as well. Perfectly crunchy.  I sampled the Osso Bucco which was so tender and flavorful.  It had the consistency of a short rib.  I had the snapper special which was lemony and bursting with bright flavors.  I loved every bite!  Tiramisu, one of my favorite desserts, which seems easy to screw up, was outstanding.  Just the right amount of liqueur.  Split a bottle of wine with your date and enjoy a romantic evening out at Toscana!"], ["Tonya P.", "I worked with a chef, calamari was his favorite cuss word, he would be dead serious and yelling in his Italian accent, \"ohh calamari!\"\"Oh, calamari!\" was what I wanted to yell when I ate at Toscana, it is a true Italian restaurant, not a wanna be, down to the tall, dark, European waiters.  This restaurant is a hidden little gem in the Specialty Shops at the Park (gag, what a lame name for shops.)  I ordered linguini with shrimp, calamari, clams, mussels & cherry tomatoes.  Pretty tasty and for $13, not a bad deal for a pasta dish enough for two and loaded with seafood.My lunch partner in crime had rigatoni with sausage & peas in a tomato cream sauce. You can't go wrong with anything with heavy cream added!They have a small express lunch menu for $13, including soup or salad, lunch special and a tea/soda. Not a bad way to spend an afternoon."], ["Scott D.", "Came here with our family of 19 for a Holiday Dinner.  They seated us at two tables of 11 and 8.  The food we all had was unanimously considered to be tasty and Great - from the complimentary bean dip starter, to the Seafood Risotto, and that day's special - Pasta di Giorno and its beef ragu sauce.  However, we all felt the service was gruff and surly from our two male waiters who spoke little broken English and apparently forgot how to smile.  The restaurant is small, intimate, cozy and attractive by Chicago standards (where several of us were visiting from).  Unfortunately we were seated at tables near the entrance door, so it felt cold and chilly just like Chicago's weather and our wait staff's service throughout the meal.I'd certainly rate Toscano much higher. like other Yelp Reviewers, if we had gotten Toscano's better servers and a less drafty table.  Maybe next time..."], ["Catherine L.", "We were very disappointed in this restaurant. To start, the waiter talked to us a total of 4 times. The first to take our order, second to bring our food,  third when we requested our check, and lastly to deliver our check (15 minutes after we asked for it). The food was expensive, they offer small portions, and the taste is lacking. I had a pasta dish that was so salty, I could not even taste the noodles. My husband had the Veal Marsala. It tasted more like burnt brown sauce than Marsala.  To top it off the portions were very small. When the bill came and it was $60 we were very shocked. I have no problem spending money on great food, but to spend $60 and to still be hungry is a shame. I wanted to give one star, but I felt bad, so two it is.  Save yourself time and money. Skip this place-"]], "Vivace": [["Andrea T.", "Love this place! You can come on a romantic date night or even just a casual night. One of my favorite places to sit is out on their patio because you get a great view of the Charlotte skyline. Light and modern American cuisine that never fails to please!"], ["Koli D.", "I recently came here with my boss for happy hour and have to admit, I was impressed!! The outdoor seating by the greenway makes for a pleasant seating area because you aren't sitting on the road, like many other restaurants in Charlotte. We ordered cocktails which were all great, I had a Mojito and mule. My boss ordered a drink that came in a tiny martini glass and was pink.  He wasn't too happy.  We also ordered the calamari and flatbread both which were great.  Customer service was good too - our server couldn't have been nicer and more accommodating. Also, plus with the complimentary valet.  Will be returning to explore the menu more."], ["Jessica K.", "We had a large group of girls for a birthday dinner. We had 2 people waiting on our table. The girl was super sweet and hopeful, the guy was not. In fact, he was rude. Not sure if this was an off night for him, but I wasn't a fan of his remarks or comments. He acted as if we were inconveniencing him.The food was pretty good. I know my girlfriends enjoyed their meals as well."], ["Paula Marie B.", "OMG THE La Vigili 7 course menus with wine paring was awesome!!  We dined here on Christmas Eve. And we will be coming back"], ["Mary C.", "Vivace is quickly becoming a new obsession.  First off, their brunch special is incredible.  2 course plus unlimited Bloody Mary's or mimosas for $25.  They also just rolled out a new bar bites menu (the Brussels pizzetta with smoke mozzarella and caramelized onions is awesome and only $6)!  Add to this the patio with incredible view of uptown (and the greenway).  Awesome."], ["Paul C.", "First time here....Definite HITS and MISSES.The misses - I ordered the Veal Saltimbocca. Well the VEAL was a clear MISS! Not pounded out flat but served relatively thick. Since VEAL is the star of the dish, it failed.The hits - The fresh ravioli that accompanied my Veal Saltimbocca was OUTSTANDING! Tasted freshly made, and the MUSHROOM sauce was TO DIE FOR!The Dessert - Tasty. The Tiramisu was good, but not in the upper tier I've had here in Charlotte. Very good quality but it still lacked that \"je nes se quoi.\"Service was good and my company was outstanding! I'd like to come back to try other things......so keep the book open on Vivace!"], ["Joseph P.", "Went here on a date night with my girlfriend. Their bruschetta might ACTUALLY be the best in the city. We also split the pan fried truffle gnocchi salad and it was so delicious and fresh.We had their bolognese and homemade linguini noodles. The house made pastas are incredible. They fall apart in your mouth. The sauce was perfect, not too heavy for a bolognese which we liked a lot.Very attentive wait staff and the atmosphere in the dining area is perfect for a date. Overall a GREAT trip and we will be going back again soon!"], ["Sarah F.", "I dined here the other night and it was fabulous! I hate that there are bad reviews because we had such a great meal and the manager, Josh came by and was so friendly. I highly suggest the cheese plate with honey and for dinner my husband had the gnocchi which had mushrooms that were on point and my veal saltimbocca was the best I've ever had. Please go there; you will not be disappointed!"], ["Bri S.", "I was disappointed by my visit this evening. We were sat 30 min after our initial reservation and had to ask for water, 15 minutes after being seated. The food was average and after waiting over 15 minutes for a second glass of wine, I was charged for a more expensive wine than I ordered. I was really looking forward to great service based on previous reviews but left less than satisfied."], ["Gina P.", "The place was super trendy, and I felt like I was dining in the heart of Manhattan. Vivace was a great spot to admire Charlotte's city lights, enjoy some tasty Italian treats, and create new memories. Read more about my experience here: ginapacelli.com/2015/04/…"], ["Tiffany L.", "Overall, this is a good place if you are looking for italian food in the south. My expectations are a very high when judging italian. We ordered the carne pizza; places on the crust were burnt and there were stems on a few of the peppers. The pasta we ordered was slightly overcooked but the flavors were good. I do have to say that the bread and white bean spread was nice. The food did seem overpriced by the service made up for it.The service was amazing and the feel of the restraunt was great. The decor was beautiful and the view of Charlotte was amazing at night I just wish we could have sat upstairs on the balcony.Would do again. I would say 3.5 just because my expectations were very high and this place didn't quite reach them."], ["Matt J.", "As far as Italian food goes, you're in North Carolina. Lower your standards. All things considered, not a bad spot. Don't bother with the meat and cheese plate. $17 wasted. Great table bread, though. Excellent service all the way through. Food came out a little slow, but we were a larger group. Tagliatelle was WAY too creamy and thick. Chicken was shredded but pretty tasty. The sauce drowned the pasta and it tasted like I was eating mayonnaise spaghetti. The four cheese ravioli was very good however.GET THE CHEESECAKE. Skip the Tiramisu. Their ice cream is very good as well. Solid desserts. Cool scene and set up. Nice little date place. Nothing over the top and relatively inexpensive. Not a must-go but a decent option nonetheless. Beware of the 90.0 sanitation score"], ["Michael M.", "Save money and time by avoiding this place. The food was horrible."], ["Kelly B.", "My husband and I went to Vivace on a Friday night with two friends to celebrate recent events and we were really looking forward to a lovely evening together. This was our first time to Vivace, but we had heard great things and we were excited that the weather was perfect to sit outside on the patio! It wasn't too busy for a Friday night, though every restaurant around them seemed packed. Unfortunately, our experience at Vivace was disappointing to say the least. Terrible and slow service were the main issues. We arrived first and sat at the bar to wait for our friends - we were there ~5-7min without being approached or even greeted by one of the two bartenders who seemed flustered. Our friends arrived and we decided to head straight to our table - which was dirty and needed to be cleaned. Our server came by and greeted us to say he'd be back in a minute...Service Disappointments: 1) Drinks - once at the table, we waited over 15min to get our first drink order2) Appetizers - took ~20min for Calamari, Brussel Sprouts, and Bruschetta3) Table Prep - when apps arrived, we had no plates or silverware for an additional 5ish min4) Drinks Round 2 - second round of drinks also took ~15+min for 4 glasses of wine5) Entrees - when dinner Finally arrived, (we'd already been there for 1:30) the server accidentally spilled our friends dinner all over her lap and shoes, then took ~5min to get her some soda and towels to clean herself up. They offered her dessert for the inconvenience. 6) Food Quality - After ALL that, the food was mediocre at best. Fig pizza was prob the best thing we got all night - and the cheapest. While we all had a great time catching up, we didn't expect our time at Vivace to span almost three hours for dinner. Our experience was terrible - we will not be back."], ["Joy R.", "I travel a lot, and I admit - I've made this mistake before. I scope out restaurants on Yelp! near where I'm going to stay, and then I get attached to a menu item, despite the gentle hints from the hotel staff that there might be better alternatives.While Vivino has ambience and might be a great place for a work dinner, the food was utterly bland. I am not a salt fiend - in fact my husband is on a salt-conscious diet, but both the Tuscan  bean dip amuse bouche and the artichoke ricotta pizza were virtually devoid of salt. The bread was unexceptional - they could have bought it locally for all the character it had.While the crust of my pizza was crispy and the hint of lemon worked with the arugula and artichokes, I feel like I would have had better value ordering a delivery pizza. The concierge recommended Mama Ricotta's - next time I think I'll listen."], ["Karmilla C.", "I love this place!! Why 5 starts?Maybe we ordered the right thing... But one thing for sure was the service!!!! We had the best waitress ever, even I forgot her name! Good service makes more enjoyable.Then the restaurant itself , very romantic inside, perfect for dating or even for meetings. Nice designed, very open. Lastly- the amazing food that we ordered: Steam fresh mussel, just so freaking amazing and fresh!!! Wow wondering if I can make it at home, light sauce but so clean, and brings out the taste of the mussels!!! Great appetizer!! House sausage pizza, fresh bake on too of a piece of wood, the sausage just so delicious, so moist as well, the pizza it self was thin and crispy, love it!!!!!!!!!! Last and the best -- the scallop, OMG, they were not only BIG, but fresh and soft , perfectly COOKED!!!!!!! Even the sides of the scallop... Yummy, so unforgettable!!! Wish this place is right next to where I live so that I can order this every time!!!! Super fresh sea food!!!! Must try!!!!"], ["Bill G.", "This has been on of my favorite spots in Charlotte with good food and service. That said on my recent visit they took away one of the best attributes of Vivace. The view. Their entire upstairs bar, seating area and balcony was closed all night. This is a key attraction for my visits so closing off the great view of Uptown Charlotte left a negative mark, particularly when my reservation requested that area and they never told me it would be closed until I arrived. Bad form."], ["Corey Tess T.", "Good patio with nice views of the greenway. Good cheese and charcuterie choices. Nice cocktails and good wine choices.I had the mussels - YUM and the charcuterie and cheese plate with way too many meats - but it was delish!  If you are avoiding carbs, like me - this is the perfect meal to have at an italian place - just don't use the bread provided with either item and you are good. No pasta, no flatbread, no problem. :)The salads looked good as did the flatbread though - if you are into that. :)Take a walk on the greenway, then stop in here for a bite. It is casual enough to feel comfortable in street clothes and later at night, you could be more dressy here."], ["Adrian H.", "I have been to the Vivace many times in the past. It seems that the food quality has deteriorated somewhat since the last time I was there about a year ago. I think they do a good job with their pastas etc. On my last visit (June 2015) there I ordered the ribeye (medium rare) and it looked beautiful, perfectly glazed, and flash broiled at the very end for the sear. Unfortunately, I could barely cut the steak and once I was able cut a piece, the next challenge was chewing it. My client looked at me like I was trying to chew an entire pack of Starburst at once. I chewed through several pieces and threw in the towel. I will give them another chance, but will likely order something else."], ["Melissa M.", "Brunch is amazing! Your choose of appetizer and entree with unlimited Mimosa and Bloody Mary Bar! $25"]], "Giacomo's Pizzeria and Italian Restaurant": [], "The Fig Tree Restaurant": [["Inge C.", "My husband and I ate here for our anniversary and am so glad we did. This restaurant is so cozy and the service was amazing! Started with a cocktail at the bar then was seated shortly after. We shared the oysters appetizer and stuffed calamari. I enjoyed the lobster with the fish and my husband had the filet. We ended with the beignets. Everything was amazing!"], ["Dan L.", "loved it.  was in from out of town and took my GF here for her birthday.  Place is about 2-3 miles outside of downtown in a cute little hood.  Restaurant is like walking into someone's house because it is....a house.  greeted right away and shown to our table without wait.we were put upstairs in what could best be described as a small bedroom but the decor was very nice.  only issue I could come up with is being in that room with another couple you could hear their whole conversation as it was very quiet.service was top notch.  menu/wine list was explained nicely and all questions answered.  had a nice bottle of wine, an app, salads and main courses.  she had the chicken and I had the trout.  both dinners were awesome.  very well seasoned, cooked and temperature.  one of the best meals we have had in awhile.place is not cheap and is best used for a special occasion.  if I am every in Charlotte again I will come here!"], ["Carol G.", "Wonderful birthday dinner. The menu is interesting, local and broad. Nice wine list and attentive service. They even added a special chocolate Happy Birthday message to our desert. Our favorites were the appetizers, escargot and carpaccio, both were outstanding. My husband tried the elk but wasn't a fan, although it was very well prepared. I definitely will go back to experience the rest of the menu."], ["Alissa H.", "Great food and service. Went hear to celebrate our met-iversary  (1st time we met). Service was the best I have had in a long time. The waiter, Rich, explained everything. I liked that he said the prices of the specials and additions without having to inquire. We ordered the lobster hush puppies. They were good and the jalopenos  were very spicy... Great flavor. I ordered the lobster and grouper. Lobster was delicious and buttery. The grouper was okay not heavily seasoned but the rice like( I think to risotto ) was yummy in the sauce. My fiancé got the filet done medium. It was cooked to order and he enjoyed it. The food came out nice and hot.  And everything timed perfectly. We also each got the Caesar salad ... Well worth the $3 each additional. He did order a martini ... He liked it but the name I can't remember but it was citrus and champagne like. For dessert we tried the beignets  ... Yummy and the accompanying coffee gelato was impressive!! Definitely recommend this place. It's nice, intimate and worthy of any special occasion (including just because)."], ["Rod And Can R.", "FIG TREE RESTAURANT- was absolutely fantastic. We went for my Birthday, this is defiantly a hidden gem in Charlotte. Very Romantic setting, friendly waitstaff.We both had the ribeye which was very tender and seasoned perfectly, every bite left you wanting more.  The dish was served with Char and a cream sauce with mushrooms that was good as well. in addition to the meal we opted to add on a lobster tail which was just okay.  We finished dinner with cheesecake which was overrated for the price.This is defiantly a Special Occasion or a Fancy Date night kind of place, very pricey."], ["Ashley N.", "Fig Tree is one of the best restaurants in Charlotte. The restaurant is in an older home and has a wonderful, inviting ambiance. The service is always attentive and friendly. Everything that I have ever ordered from seafood to desserts has been excellent. They have an expansive selection of wine. You will not be disappointed with the Fig Tree."], ["Chris H.", "Very enjoyable experience. The bread, and cheeses are fantastic. I can't lie; the entrees were a little underwhelming for the price. Do: - Take advantage of the lengthy wine list- Order the flight of ice wine"], ["Zack H.", "Excellent restaurant! My first time dining in Charlotte was a great experience at The Fig Tree. You can eat outside on the front porch on a beautiful 80 degree evening.The garlic spread was way too strong for me, but the Lobster Hush Puppies and Chorizo Stuffed Calamari were amazing. Ask for the Calamari to be pre-sliced for bite sized portions. I guess they normally serve it as one large piece, but our request for smaller pieces was nicely met. They should consider serving this way, as the presentation was quite nice.The Grouper and Maine Lobster Tail over Rissoto really couldn't have been any better! Not fishy at all, and bursting with flavor!"], ["Sapna B.", "I SO badly wanted to give five stars to this review -- however I had to deduct one due to all but TWO dishes (out of about 8) being average.I came here Saturday night with my husband and another couple.  We started with a few appetizers -- Escargot, Scallops & Foie Gras.  Everything was amazing.  All the flavors were so well balanced, the dishes were flavorful and we were very pleased.  The Scallops were cooked PERFECTLY and I know that's not an easy ingredient to perfect.  For entrees we ordered the Grouper & Lobster, Elk Chop, Veal Chop and Truffle Ricotta Ravioli.  The Grouper & Lobster was AMAZING.  It was served over a Saffron Risotto which was delicious and the fish was cooked perfectly.  The lobster had a delicious flavor to it but you could also taste its inherently sweet flavor.  However it was definitely a small portion of fish and lobster for the price of $42.  The Elk Chop was disappointing.  The sides that it was served with didn't complement the dish well and also the meat was very dry.  My husband sent it back and ordered Scallops instead which were good, but not great.  At $37 for 6 scallops, it should be great.  I didn't get to try the Veal Chop but it looked amazing and my friend had rave reviews.  The Truffle Ricotta Ravioli was a BIT on the salty side -- but delicious none-the-less.  For dessert there were so many delicious things so we ordered three items -- Peanut Butter Pie, 5 Layer Red Velvet Cake and Beignets.  I thought the Beignets were the BEST.  They were freshly fried and served with a delicious cinnamon creme and also accompanied by a scoop of coffee gelato.  The sweet beignets with a bite of the coffee gelato was to die for.  The Peanut Butter Pie was good as well, I loved that it was served with a caramel peanut brittle.  The Red Velvet Cake was good too -- more chocolatey than red velvet though, which is a good thing to me.I would definitely return if we come back to Charlotte!"], ["Nick V.", "Loved the menu. Wide variety of seafood and game. Service was delightful and the cheese was stinky and satisfying- local honeycomb superb touch. Focus more on your appetizer and main because where this restaurant shines. The place is a cute house repurposed. Upstairs room is perfect for a private party up to 12. Enjoy!"], ["Georgia O.", "The whole experience was amazing. We started with the ginger martini and the sparkling pear. The drinks were delicious and a perfect balance between sweet, sour, and strong. We ordered both the escargot in a Gorgonzola cream sauce and the foie gras with bacon praline. Both were amazing and our waitress did an excellent job pairing a wine selection with each. As for entrees I ordered the rabbit saltimbocca and my husband ordered the elk chop. While my rabbit was quite yummy the elk was out of this world perfectly cooked, seasoned well, and melt in your mouth tender. We finished the meal with the chocolate Aztec cake, rich moist and spicy. It was served with a delicious horchata ice cream. The best restaurant I have had the pleasure of dining at in Charlotte."], ["Dawn K.", "Amazing wine selection.  Impeccable service.  Had trigger fish special delicios! Others had steak filet melted in your mouth and grouper lobster combo butter drenched.  Can't go wrong here."], ["Troy T.", "I really don't understand all the rave reviews for this restaurant.  Some of my favorite restaurants are prime steakhouses like, Del Frisco's and The Palm so maybe my standards are a little high but I do like trying local independent restaurants so I thought I would give the Fig Tree a try.  The menu here is very diverse and contains items you typically will not find in most restaurants like Ostrich and Elk, however, the quality, in my opinion is average at best.  The starter salad did not taste fresh and was very bland.  The Elk was so tough I had to ask the server to bring me a sharper knife so I could cut into it.  The two sides served with the Elk were strange and also very bland.  The atmosphere and the service was exceptional, however, because of my food experience I will not be dining at The Fig again."], ["L K.", "We went here because of the great reviews on here and ended up not liking it so much. We started with an octopus appetizer which was pretty good and went onto to our entrees I had the Elk chop and my husband had the Grouper with Lobster. The Elk chop was nice and tender and the horseradish spaetzel was okay. The grouper and lobster was pretty good too. However the reason why I am giving it three stars is because I think it is a little over priced. Our total came out to be around $150 including two glasses of wine. I think the overall experience was good but for my husband and I, the food here was not worth the total on the bill. We don't mind paying for a nice meal but not if the food is not worth it."], ["Craig R.", "Great ambiance, mostly attentive staff and food was so so. Felt for the price the food was a little underwhelming. Had the elk chop, not that great. Wished I had had a different dish."], ["Tiffani E.", "Absolutely love this restaurant. The halibut piccata is one of my favorites.  Appetizer are worth saving room for. My husband normally orders steak and that is also great.  If you want a great dinner with super service, go here.  I call this a treat.  We have now been there 4 times in very short period of time.  Can't wait to go back."], ["Mathew W.", "I am not going to keep this review long winded but Fig Tree is the best restaurant in town.  Never a bad meal, amazing service.  Mark the bar manager is amazing, knows everyone and knows how to make you feel special.  We eat at the bar a lot unless we have more than the two of us.We had a bad dinner last night at another restaurant and went there for dessert and it more than made up for it.Thank you Fig Tree for being AMAZING every single time!!!!"], ["Emily G.", "What a wonderful place! My boyfriend and I went here the other night just as a regular date night. Our server JD was more than helpful with menu items and had a very bright and cheerful personality. We shared a bottle of wine for dinner and I got the Sea Scallops which were divine. My boyfriend got the pasta dish (I forgot what it's called), but he gobbled up the whole thing so I'm assuming it was very tasty. Even the dinner salads that come prior to the entree were amazing. It is a bit pricey, but if you have nice company to share a night out with or have a hot date ;) this place is the spot to go."], ["Steve C.", "Wonderful experience. Although more expensive than necessary, and our server was a little condescending. But overall, one of Charlotte's very best."], ["Alicia M.", "I was in Charlotte this Monday December 1st on business and we were brought here by the guests.  Everything was splendid; from the food to the excellent customer service.  I has the Lamb dish was well prepared, generous helping, and beyond SUPERB!  The bartender(kind of a bald guy) was such a gentleman!!  The waiters and hostesses went above and beyond with service.  Will return again on my next visit."], ["Elle P.", "Can't think of one thing to complain about at our amazing dinner at the Fig Tree last night.  We were celebrating my birthday, and from start to finish, they made it so special!First and foremost, the bottles of wine are so reasonably priced, which was a nice surprise.We started with escargot.  Delicious, and very rich in a gorgonzola cream sauce.  It was just enough.  Be sure to get extra bread for that sauce!We then had our salads.  Both good, nothing to write home about, but solid.I then had the grouper with lobster tail over saffron risotto. It was unbelievable.  Extremely rich but oh so amazing.  The perfect birthday dinner.  My husband had filet mignon, and the meat was so tender you could cut it with a fork.  Both entrees were five star, for sure.We capped off our meal with the biegnets.  We subbed out the coffee gelato for buttermilk gelato and my god, they were unbelievable.  I would go back just for dessert!All in all, service, food, and ambiance were outstanding.  We WILL be back for sure!"], ["Belle D.", "I really like The Fig Tree, I just don't loooove it. Food - My husband and I ordered an apple dish for an appetizer. He was reluctant but I figured it cannot be bad! It was actually good and refreshing to eat. Definitely a great starter before the main show. I ordered the scallop dish in a bed of beluga lentils. They did a great job with the temp of the seafood. It was perfect for me (I do not like them undercooked). I find the lentils very interesting and it complemented the dish. My husband had the lamb and he really loved it.Price - Definitely a pricey place, but you get your money's worth for a $$$ restaurant. Place - Very cozy decor, home feel, but nice restaurant setting. In some areas, I feel it is a little too small or cramped (especially upstairs).  I saw people parked next door where it said do not park..Special - The waiter and staff was kind to personalize your birthday or anniversary on the dessert plate. It makes the occasion/dinner special! Service - Our waiter was nice and attentive. It did take awhile to get our check though.. But ah well. Although our experience at The Fig Tree was good. That's one checked off on places to go have dinner dates in Charlotte. I was just not blown away with the place and venue. I tend to prefer the more modern, upscale restaurant for that price. If you are more of a comfy and homey feel, this place is for you."], ["Katherine C.", "Sometimes you want a nicer meal. Fig Tree is one of my favorite choices in Charlotte. It is a beautiful old home. The service is impeccable. The food is delicious. It is cozy. Not pretentious. We love their cheese plate. The scallops are cooked perfectly. I highly recommend going here."], ["Colby B.", "My fiancé and I went to Fig Tree for dinner the night we got engaged, it was our first time. We have heard so many great things about the restaurant, I, glad we could finally go!We ordered the lobster hush puppies with a black bean purée for a starter, I had the filet and she had the lobster tail served over grouper and saffron risotto with a lobster blanc sauce - AHHHMAZING! We ordered a killer bottle of wine too. Our server was absolutely amazing, very personable but also gave us our space as it was a special night. I wish I could remember his name! We finished off our meal with the beignets, which were to die for!!!!! We can't wait to go back and indulge for our anniversary, this is the best restaurant in Charlotte in our books!"], ["Casey S.", "If it wasn't for the service I would give the food 3 stars. Not sure if I just had too high of expectations but like a previous reviewer said I thought the best part of the meal was my salad. I got the Elk and it was great to try something different. My issue is the sides cabbage and some weird lentil did not compliment the Elk at all. Would of loved some type of potatoes or risotto cake."], ["Kelly K.", "Great date night restaurant. I loved coming here and experiencing the full spectrum of their menu: wine, appetizers, meal and dessert. The atmosphere, service, and food all deserve 5 stars. If you are looking for nice restaurant to have dinner or special place to celebrate, make a reservation @ Fig Tree."], ["Shad C.", "The food is inspired.  I would give them a five star on food.The service and environment were less so for us.The waiter just seemed unengaged.  Normally you expect very friendly and engaged wait staff at a restaurant where it is easy to spend $60-100 a person.We went for our anniversary, it was noted on the reservation, we were put in a room close to the door with a very loud group of people.  None of the staff said a word about a special evening.The place is marked as being dressy and romantic.  A lot of people were there in jeans and polos even on a Saturday night.The food was wonderful and we will go back for it but I will not put it on my places to go for a special occasion.Definitely a place for foodies but not somewhere to have a romantic dinner or quiet conversation."], ["Christine S.", "Amazing food,  excellent service, and quiet atmosphere. One of our favorites so far in Charlotte!  Our waiter David was perfect and his recommendation of the chef special fish that night was spot on."], ["Robert P.", "We wanted to go somewhere special Saturday night and read good things about this place on Yelp. It is a charming old house and the staff is very attentive. They have patio seating available.  We really had  a great time.  My only criticism is the meals are a little pricey for what you get.  The salads were nothing special, I had pasta and my girlfriend had the duck. Her duck was delicious,  my pasta, good."], ["Ava K.", "Cute place with good food. We had the foie gras & escargots to start, which were delicious. Then we had the lamb tenderloin, ny strip, grouper, & veal chop. Finished it up with red velvet cake. Everything was delicious & the service was awesome. Great place for a special occasion."], ["Michele S.", "Outstanding Easy elegance. Great dinner, loved the quail appetizer, wine selection, and wow the Banana Upside Down Cake was out of this world!!!"], ["Lauren Y.", "Fantastic food, top notch service. Pricey but everything we had was excellent (chicken entree, lamb entree, excellent house salads, and beignets for dessert). Such a classy atmosphere too. Highly recommend."], ["Brittany D.", "What a wonderful experience. I was brought here on my birthday and I couldn't be happier. Our server was phenomenal and because I have such a terrible memory, I believe it was Jay or Jason? He took us on the tour through the menu and truly made us feel welcomed and appreciated. The food was also excellent! We had duck and red snapper. Excellent excellent excellent! We will be back!"], ["Caroline K.", "The food was delicious and a great place for an intimate dinner with close friends. Nothing crazy mind glowingly delicious, but I highly recommend if you haven't been. Great for family or in-laws when they come to town."], ["Chrissy M.", "We went to Fig Tree for our anniversary. They did a wonderful job of making it special and pacing the meal so you can enjoy it thoroughly. We were impressed when our appetizer arrived and we were not quite ready to order our entree... The waitress took our menus out of the way so we could enjoy it and then brought them back when we were through. We sat outside on the porch which I highly recommend. It was a very warm day but cooled off (not a ton of sun) by about 7pm. If you plan to arrive by 6 on a week night it will be empty (we were literally the first people there). It gets busier later which adds to the ambience. The feel is quaint and romantic. Our waitress recommended the scallops which my husband ordered and I wish I had, too. I never order scallops and always worry they won't be filling but there were 7 medium sized scallops and they were delicious. The salad was wonderful, too fantastic dressing) and I highly recommend adding the goat cheese. I was pleased with my trout as well. Their wine list is extensive with bottles ranging from $30-$2000. We thoroughly enjoyed our bottle of Walt Blue Jay Pinot Noir.I would give it 5 stars if the feel was a little more up to date (it was a little outdated IMO) but overall our experience was very enjoyable and I would definitely go back."], ["Michael M.", "well prepared and delicious. We we're seated in essentially a private room upstairs. Great date spot."], ["Delon F.", "Not sure where to begin with this restaurant because everything about it was exceptional. The service, the ambiance and especially the food was five star quality. This is a special occasion restaurant for sure and you will not be disappointed when you dine here. My wife and I came here for our anniversary. We had the scallops to start and they were delicious. Even the garden salad was top notch. I highly recommend the veal chops, with shrimp and potatoes. The set up for this meal was perfect. My wife had the swordfish which was the special for the night and she thought it was divine. This is a beautiful restaurant in Charlotte and a must dine for anyone looking for a wonderful night out"], ["Kristin P.", "Great for a special occasion! Amazing wine list and deliciously crafted plates!! Must make a reservation and sitting on the patio is lovely. Restaurant is in a house-turned-restaurant, so it has a fancy but homey feel. I definitely recommend this place to anyone visiting Charlotte!"], ["Carl S.", "So went back to Fig Tree this past weekend, and was inspired to write an update to my last review. We sat upstairs, which had a much better decor/ambiance, and the service was exceptional. The food was great (we had the escargot, lobster/halibut, filet, elk, and Ostrich Carpaccio), and they hit the nail on the head with the various flavors/sauces. We will be returning again for sure."], ["Joshua R.", "A cheese plate featuring 100% water buffalo cheese, elk chops, and the cayenne pepper triple chocolate cheese made for one of the best and most unique Charlotte meals I have ever had. My only criticism, however minor, is the music: \"It's Beginning to Look a lot like Christmas\" and \"Rudolph the Red Nosed Reindeer\" played on a loop can get absolutely maddening through the course of a one hour dinner service. That should not deter you though as The Fig Tree is now in my Charlotte Top 3."]], "Vapiano": [], "Luciano's Ristorante Italiano": [["Regina H.", "Wonderful restaurant. Beautiful interior design, very elegant Italian upscale features including imprinted tin ceilings, luxurious crown molding, beautiful piers and stanchions make you feel as if you on a lovely vacation. The detail work is amazingly intricate.Our waiter Roy is an engaging, friendly perfectionist who always seemed to appear when you thought you might need anything. He was knowledgeable, informative and interested in meeting all of our needs. He introduced some of the restaurant's guest favorites - all yummy!We had Greek salad, bean and sausage soup, meatballs, spaghetti and meatballs, chicken and spinach pizza, wine, peach bellini's, and tiramisu (sp.) dessertFoodies - Please go and enjoy.Regina Taylor-Hines"], ["Lindsay A.", "I've been wanting to come to this restaurant for a long time and finally got the chance tonight! They checked off every item on my list! It's really quite a pretty restaurant. They have a pizza oven behind the bar which kind of sets the ambiance and really simple black and white table clothes. As I sat down our waiter brought me my own personal purse rack so my bag didn't sit on the floor. I've never had that happen before at a restaurant! Such great service. I think our server was Chelsea and she checked on us often and was very friendly. They were prompt with water and bread and it was hot and delicious. For dinner I ordered the veal Marsala which was perfect! It wasn't breaded which I love and the sauce had beautiful portobello mushrooms in it. As good as that was, I think the angel hair pasta on the side was even better. Just simple marinara and it was delicious! I had a lovely martini and wedge salad before which were also awesome. And we finished with tiramisu. They did the tiramisu right, too! Definitely worth it. Delicious and superb service!"], ["Candyce B.", "I've been waiting to try Luciano's and finally got the chance for a friend's birthday dinner. And it was well worth the wait! There were about 14 of us in the party so we were seated in the private dining area and that worked out so well! We were able to enjoy the evening and feel like we basically had the place to ourselves! Our waiter was Fernando and he was awesome! He was supper attentive and we always had what we needed and that's no easy task when you have 14 starving ladies! We started off with some sangrias and the bread with marinara. Those sangrias definitely packed a punch. Don't think of your typical sangria mix....kick it up a few notches and you have the Luciano's version. So good! To start, I ordered the Wedge salad which come topped with tomatoes, bacon, parmigiano dressing, and gorgonzola cheese. It's a classic,  not overdone or too fancy. Add to that the dressing was perfect! I'd definitely recommend. For  my dinner I ordered the Shrimp Fra Diavolo. My goodness. The large shrimp were perfectly cooked and the marinara and brandy combination was so flavorful! So glad I had the opportunity to give this place a try. The service and food were both excellent and I look forward to my next visit."], ["Mike W.", "Foot and service was very good. Salads were substantial and great home made dressungs.We were glad we tried it and if back in Charlotte it would be one to try again."], ["Kru K.", "I wish I dint have all the tragedy I did at this place....I was visiting Charlotte for work and ended up going to this restaurant for dinner.... Being new to the city I was very excited to see the neighborhood this restaurant was located in and it's beautiful ambience...The place is really very classy and perfect for a date.The server told us about 10 different things which were not on the menu and they were flexible about making many things vegetarian...But even before I got there I knew I was going to order a mushroom ravioli.So one colleague got the pasta with bolognese, I ordered the mushroom ravioli with white sauce and another colleague ordered the same with marinara sauce..... How I wish he had ordered a flat bread instead...Anyway so we get our items and very excited to start.... And I taste something weird in the first bite and the bites to follow.... There was sour taste to the ravioli, my other confirmed the sour taste in his too and we told the server and manager about it,..They confirmed that they received the ravioli just a day ago so it wudnt have spoilt etc... I asked the manager to taste it to check if that was how it was supposed to taste... Of course he dint taste it and offered to get us another one..... We should have just asked for something else at that point...Anyway in about 20 mins me and my colleague got our raviolis again and this time with much lesser sauce....it still tasted sour !!!The manager stopped to check and I was blunt about the sour taste again..., and then he says... This time the chef confirmed they received the packet with goat cheese stuffing in the ravioli and that might be resulting in that different taste.....Well I would have loved to know this before ordering as I can't stand goat cheese at all!!!All said and done, I dint enjoy what I ordered but that won't stop me from going back.... We ordered a chocolate dessert in the end which was great. And they did take my ravioli off the check but kept my colleagues coz he dint fuss about the second time it came...The bread and sauce on the side was very good too..Want to come back to try other things ..."], ["Saniqua P.", "I tried out Luciano's thanks to Queen's Feast aka a food lover's favorite time of the year! Reservations were made so it made dining on a Saturday evening a breeze.We were greeted and immediately seated in the room off of the main dining room. The main dining area is very nice, all black & white decor. Our table of fabulous ladies started off dinner properly with glasses of wine. To note, if you order a glass of red wine, the wine will be poured into a comically oversized wine glass. My glass of sauvignon blanc appeared in an adequately sized glass.For appetizer, I ordered the fried zucchini. Forgive me, because I forget the actual Italian name for it. They were delicious!! Thin zucchini patties served with arugula and a side of marinara sauce for dipping. Main entree, I ordered the seafood cannelloni. I wasn't as happy with this dish. It tasted a little too shrimp-y for me. Dessert, I got the chocolate cannoli. It was good but nothing special.I found the portions to be just right and the meals were spaced out with just enough time in between. A lot of the time with restaurant week menus, the wait staff seems to rush to bring out the dishes with you not being able to fully enjoy each plate. Not at Luciano's, I got to enjoy and eat every bite of my meals.I was very pleased with my experience and look forward to going back!"], ["Rose L.", "I'm going to be honest, we had a fabulous meal and service experience at Luciano's, however we did have an \"incident\" happen to us as dinner that was very unusual and surprising. However, because of the beautiful way it was handled and the incredible understanding and sympathy of not only our waitress but also the manager on duty, I can hands down say that it was a completely honest mistake on the part of the kitchen, something that after our experience would be examined and re-examined so as to never happen again. With that saying, we truly had a, aside from this one incident, an incredible experience and I would visit Luciano's again in a heartbeat. I always forget how much I love Italian food until I have fabulous Italian food, Luciano's reminded me of that love once again (note: my partner in Italian, that is no accident friends!). We were lucky enough to be able to set up a reservation an hour before we wanted to eat online and walked in and were seated right away. Immediately we felt welcomed, by our waitress and the manager, who at the time we didn't even know was the manager. I love that they have a manager on duty that greets each table and brings bread, water, etc., just welcomes people to the restaurant. The bread is made out-of-house by baked in house and is fantastic, especially when paired with an incredible, somewhat spicy marinara. Funny, my Italian partner makes homemade sauce often, and his favorite thing is to dip fresh bread into the sauce, must be an Italian thing! For entrees we ordered the BBQ Chicken Pizza: Smoked chicken, red onions, avocado, fresh cilantro, and the chicken parmigiana. I honestly couldn't say a negative thing about either dish, they were superb. The pizza would be a good two person meal or appetizer. I loved the new take on BBQ chicken, the avocado, red onion and cilantro complimented it perfectly. It's not often, after having a \"bad\" experience in a restaurant, that you'd rush to go back. But the food was so fabulous, the service stellar and the situation was handled so graciously, that I will definitely be heading back to Luciano's!"], ["Megan C.", "I was visiting Charlotte and was not disappointed with their food. The calamari friti was easily some of the best I've ever had, they fry bell peppers with the calamari to give it an amazing flavor. Then for dinner I had their signature eggplant parmesan and let me tell you, THE BEST! It's better than my family's receive and the eggplant and pasta were cooked PERFECTLY. The tiramisu for dessert was to die for as well. I can't wait to come back here. My husband and father ordered their brick oven homemade pizzas, they both said it was some of the best pizza they've had."], ["Jennifer Y.", "This place is really fantastic for upscale Italian cuisine. The ambience is quite nice, and the food is delectable! The only reason I can't give it 5 stars is because the service is only so so. The last time we went our waiter was a bit rude to my best friend, my fiance and I. I'm sorry, but don't be in t he service industry if you hate people! This guy was blatantly irritated with us from the moment he first greeted us."], ["Shay J.", "This was my second time visiting. My fiance and I have a weekly date nights.... we Love the food and the staff here, everyone is delightful!!! The manager always greets us when we come. Personally I love the ceaser and wedge salad. The spaghetti with sundried tomato sauce is soooooo good....I swear it's large enough for 2-3 people, i can never finish. A few weeks ago Lucianos saved us! We arrived in Charlotte after a 11hr drive from the Midwest....we were craving Lucianos for dinner!!!! Of course there was a HORRIBLE storm that same night.......our power went out and all our food went bad except for our food from Lucianos lol! Our to-go orders were  tightly sealed in a cooler from our trip.....luckily the power came on around 3pm the next day. Guess what was for lunch,...yep...you guessed it lol! Thanks"], ["Kylie O.", "Great Italian! The pasta I ordered was cooked to al dente perfection and the pasta sauce and sausage was excellent. My fiancé had the lasagna and he already wants to go back and order it again. My only criticism is with the sauce that came with the bread to start dinner. The bread was great but the red sauce for dipping was strange and hard to share with our group of 4."], ["Steve J.", "Had a great lunch with friends today. The carpaccio w/truffle oil was to die for. They also do a very respectable calamari. We tried the lunch  combo's; choice of salad, sandwich & dessert for $12ish. Service is solid except our waiters name was Roy! Shouldn't it be mandatory that they be named Guido or perhaps Alberto. We had fun with that!"], ["rene m.", "Had the Duck two way for dinner ,it's a  very delicious and rich plate.The service is good and if you like people  watching get a table outside.Will come here again."], ["Fabiana F.", "I tried to think of some reason as to why I shouldn't give Luciano's 5 stars and, as you can tell, I couldn't think of a single one. I absolutely love this place. We've lived less than a block away for over a year and finally just ventured over and we're SO happy we did! I like the inside of the restaurant as it's decor is very nice but not stuffy, it feels homey while looking like quite a 'fancy' restaurant - which is hard to accomplish, but they did it.To start, our servers have always been 100% spot on; Great personalities and great service. Along with our main server, there is plenty of staff to keep our waters and delicious bread filled. We have also never waited long for our meals, no matter how packed it been or what time of night. Managers come by and sometimes there is a band playing. Plenty of people to keep you happy while at Luciano's. Now for food...holy delicious. Our first time we tried a pasta and one of their chicken specials for entrees and both were a great amount of food, not too much but very filling and both just tasted so good(note: I have been looking everywhere for a chicken marsala as good as my dads and Luciano's is as close as it gets). Tom was really impressed with how many meatballs and mozzarella were in his pasta (apparently other places really skimp). Another time we went for just appetizers and I'm gonna lay this out because we were amazed. We got the carpaccio and I swear, enough for 6 people and perfectly done. There was plenty to go around for just us two and the aioli and arugula salad on top was great. We also got the calamari which were cooked perfectly and also had the great aioli sauce to compliment it. However, for me, the Holy Grail was their Scallops and Artichoke antipasti (bow your heads for a moment). It was perfect. The scallops were cooked perfectly. The long stem artichokes were tender and so so tasty and perfect. The pancetta, perfect. And...the lemon sauce, perfect. I had to ask for an entire other bread basket just so I get every little bit of that lemon sauce. Amazingly perfect. Okay, enough about my obsession with the food and scallops. We love this place. They always find us a seat, we always have great service, there is complimentary valet, the vibe is awesome and the prices are surprisingly modest for the quality and amount of food. I can confidently say, this is my favorite Italian and restaurant in Charlotte so far. Check it out."], ["Brittni C.", "FAVORITE! As most foodies know, Charlotte has a lot of great Italian restaurant options and I'm a pasta lover through and through! Luciano's is my absolute favorite. The menu has so many options, the appetizers are all amazing, and the wine selection is perfect! I've never had a bad meal or anything less than exceptional service! I'm a pasta + wine person and my boyfriend had pizza + beer -- we were both happy! I've been for regular dinners as well as special occasions - Luciano's is perfect for both! I can't wait to go back and enjoy the patio : )"], ["Lucinda L.", "I really can't find any objection to my recent trip to Luciano's. I ordered a flounder dish which is new on the menu. Another dish had English peas which I love. I asked that they be added and the chef was happy to do so. Wine by the glass was very good and the service at the bar was attentive.Luciano's is a really good restaurant- I need to go more often."], ["Sarah C.", "Let me explain..FIVE STARS for valet parking, excellent service, excellent atmosphere, excellent ambience, excellent dessert. THREE STARS for our dinner which was such a bummer. Again beautiful presentation but the taste lacked. The Fettuccine Alfredo was runny almost a soup needed heavy cream and a egg yolk to thicken in our opinion. The mushroom ravioli was ok, needed more sauce and maybe a tad more salt. The baked goat cheese dip was yummy and the bread was very tasty. Overall taste experience lacked but all other aspects shined."], ["Melanie E.", "The bartender was really good and made some hand-crafted cocktails based on our preferences.  Very nice.Excellent Italian food...well-made, fresh, tasty with decent-sized portions...not huge, but enough that I didn't have to take home leftovers.A nice, acoustic guitar player in the corner.  So glad he didn't have it amped.  A lot of restaurants that have music let the players use amplifiers and then you just end up with everyone in the restaurant raising their voices and it gets way too loud, so thank you for letting me talk in a normal voice while listening to nice, live music.Overall the restaurant is quietly elegant and people are wearing nice clothes and talking quietly amongst themselves and enjoying a wonderful evening with wonderful food and ambience.Cheers to a restaurant and people that appreciate that dining out in Charlotte doesn't mean being unnervingly loud."], ["Anonymous A.", "Definitely one of my favorite restaurants in Charlotte! Great atmosphere, excellent food (plenty of gluten free options), and top notch service!"], ["Walter B.", "Made our Anniversary.The service and the staff are excellent! Not to mention the food! Never been to Italy.. But after eating here... I feel like im fluent in Italian!! Thanks for making feel at home!"], ["Don L.", "Another fine meal at Luciano's.  Great place to stop before a show though traffic approaching it on South Boulevard can be tough.  Love the veal here and pasta dishes I've had are tasty.  A little pricier than the local place we often go but fine quality in a nicely appointed setting for an evening out."], ["Mary M.", "This is an incredible restaurant. I went there with my family for Easter brunch and was so impressed by the food, service, and ambience of the restaurant. We were able to order from both the special Easter brunch menu and their regular lunch menu. We started with calamari, which is the best I've ever had. The breading on it was not overwhelming and it was perfectly cooked. Half of the table ordered blackened salmon (with linguine) and the other half ordered sea scallops and risotto--both were impeccable. The salmon was well-seasoned and cooked to order, the pasta sauce tasted fresh and homemade. I was especially impressed by the scallops. I have often had overcooked scallops but these were tender and flavorful. The risotto was out of this world. Again, everything so fresh. The service was wonderful. They were polite, friendly, and accommodating, checked on us, and offered us a rack to put our purses on. They kept our waters full, and our tables clean.On a side note, I was also very happy with their restrooms. Often, restrooms are neglected or unkempt. On the contrary, this restroom was very clean, stylish, and they had the best quality toilet paper and paper towels to use. They even had Listerine for use as well. It's the attention to detail that makes the difference.I would recommend this restaurant to anyone, and will definitely be returning. It made our Easter brunch very special."], ["John C.", "After being spoiled with the fresh Italian food from Vincenzo in Cincinnati, this is the closest one that we can find in Charlotte.Start with their Carpaccio and Calamari. Then you should ask for the spicy black ink pasta. It's not on the menu, however most of the time they have this on their special menu. The secondary option would be LINGUINE FRUTTI DI MARE."], ["Jeff S.", "Some of the food at this restaurant is decent but the whole experience is not worth the 5 stars many reviewers give it.  I was tempted to give it a 2 star rating but I figured 3 is a good rating for an average restaurant.  The decor of this place is beautiful...a far change from what used to be there before.  My friends and I were seated at a table next to the window. The place was not too busy when we arrived on a Saturday night but it quickly filled up.  The odd thing is that our server explained the dinner specials before even taking our drink order.  I ordered a Chianti which was about average in my book.  I later switched to a dirty martini which the first one came without olives?  Our server said he would go get some but they never arrived.  Maybe this is a new trend but wine glasses are not even filled halfway anymore and they still charge you $8 or more for the wine.  Also here, they charge you for the vodka and add another charge for a martini.  I just thought that was strange.  And $10.00 for a martini with the house vodka.  Ouch. This place serves bread with a marinara like dipping sauce which was quite tasty.  One of two things today that were worth my money.I ordered the lasagna and a chopped salad.   The salad came out right away and it was tasty with an Italian vinagrette dressing.  The lasagna looked more like a gourmet casserole with what looked like wide egg noodles instead of lasagna noodles.  It looked appetizing but once I bit into it, there was no flavor...no garlic, no Italian spice flavors.  Shame.  I actually had to smother it with red pepper flakes to give it some flavor.Service was really hit and miss.  It took forever for the entrees to come out.  It took forever for a second round of drinks. Overall,  this place is average.  Average food that you can find and the run of the mill Italian place and average service.  Dinner prices are reasonable.  They have a few expensive items like chilean sea bass and a few others but where they get you is with drinks. The kicker is that my friends and I still do not know why this place has a higher rating than Fiamma on the the other side of Dilworth.  Fiamma is by far better than this."], ["Lorees R.", "I am really sadden to say that I was under-whelmed and very disappointed by my experience. I planned a wonderful surprise bday dinner for someone special in my life and the service of the restaurant did not come through. Though the staff members  were nice,  it left me regretting my restaurant choice (which was between 2 other Italian restaurants). First, I made reservations and added a note  to the reservations that this was a bday dinner and to please make it special..only to get to the restaurant 10 minutes before our reservation and still had to wait almost 30 minutes..to which my partner asked \" what's the point of making reservations\". While at the restaurant I told the hostess that it was his bday and to surprise him with his name written on the dessert plate, but when the dessert came out there was no bday message. And to top it all off, the spaghetti served with our meals lack any flavor. My selection of this restaurant was based on its advertisement of a more sophisticated, sexy ambience, but when we got there it was bright, cramped, and noisy. Now I understand that you can't select who comes in and how they're dressed or how loud they speak, but  if someone makes a reservation with specific notes that's this is a special date and also tells the hostess upon arrival the same, the least that could be done is to call and notify the person or at least write happy birthday on a plate. Bright side, the mash potatoes were good. I gave it a 2 star because the staff were friendly, unfortunately they were not helpful."], ["Carl S.", "Solid neighborhood Italian spot. We've gone several times, and never been disappointed. Service, wine, food, and ambiance is great."], ["Jackie F.", "This was our second time visiting Luciano's.  Both times there were about eight of us dining for a birthday celebration.  We went for brunch on Sunday. The warm bread with the sun-dried tomato and olive oil spread was delicious.  We must have gone through four or five loaves.  Most of us enjoyed the food. Lunch portions are enough to fill you up.  I had the omelet special with roasted potatoes and fresh fruit.  The omelet was stuffed with onions, peppers, mushrooms, ham and cheese.  It was delicious.  The birthday girl received a free strawberry cheesecake which was delish. Service was excellent.  They tacked on a 20% gratuity which we thought was a bit much.  But, one of us crossed that out and added her own tip amount.  I keep forgetting to do that.  But, will remember next time.  Atmosphere is lovely with tablecloths (even for lunch) and chandeliers.  Very nice."], ["Michelle S.", "This place has it all. We were greeted and seated immediately on Saturday, 8/22/15. The ambience is great, so quiet and beautiful - like an italian restaurant should be. Service was fantastic. Staff answers questions and were right on the ball. Giving refills to drinks without us asking. Offering a stand for my purse so I didn't have to place it on the floor. Food was fantastic. Marinara sauce was the best I have had since moving to Charlotte in 2011 after living many years in NY and NJ. I highly recommend it - sorry I can not do five stars, nothing is perfect! But, this restaurant is close."], ["Claire G.", "I ordered Caesar Salad, Vegetarian Panini, pannacote and cappuccino. It was wonderful!"], ["Kat T.", "5 stars to me since it's been a challenge finding exceptional quality food establishments in NC. I know I'm a bit spoiled having lived in Chicago all my life and visited New York a few times for work. There's nothing wrong with having a high standard when it comes to nourishing your body with good food. Can I get an amen?!So far Luciano's has met my foodie expectations:1. Ambiance- romantic, classy, yet still good for a family dinner with little ones2. Decor- modern with traditional accents3. Service- courteous, attentive, and inviting4. Food- light but decadent enough to allow those Italian flavors to come through5. Value- a final bill for a family of six in the amount of $88!!!! It would have been higher if we would have ordered their seafood or angus steak plates. Next time.Our server Ronald went above and beyond attending to our table. Patient and attentive. He didn't up sell on any dish and pretty much told us we can't go wrong with anything in the menu. Overall, our plates ranged from individual pizzas, chicken under the oven, Fettuccini Alfredo, and chicken piccata, which we all loved. The bonus was making our daughters birthday dinner here more special by presenting her with a chocolate brownie with a side of ice cream. It was absolute bliss, according to my daughter. She gave me a bite (very tiny one) and I agree.Try this place. It's really good."], ["Stacy M.", "I absolutely loved this restaurant. Visited from out of town on business and dined here last night. From the decor to the service to the food it is a must goto place! I had shrimp & calamari as an app. The pizza looked incredible but I didn't get a piece..bread was delicious! I had the seabass over rostr potatoes and veggies wow! Soooo good. We also had dessert: mini doughnuts filled with nutella were a stand-out plus I really liked the tiramisu. Make this part of your meal plan if your in the area. Can't wait to visit again."], ["Brooke B.", "Hidden gem!  I've walked and driven by this place many times but never realized how spacious and gorgeous the interior is.  Great bar area, seating, and patio.  We went for restaurant week and everything we had was delicious.  My cocktail from the list was a little too sweet-but I would just make one to order next time.  I definitely want to go back and try other menu items I didn't get to taste yet!!! Worth a visit!!!"], ["Corey Tess T.", "Italian food. Great atmosphere. I was surprised by what they did with this space. The decor elevates it quite a bit. We had lunch here on an off hour, so the place was empty, but still the Caesar with chicken (my lunch go-to) was delish and the service was good.I can't speak to the pastas and other items yet. I will have to try them sometime. I never eat carbs at lunch time. :)I think this would be a great place for a date or even a corporate dinner."], ["Steve K.", "Why stay in Ballantyne where with rare exception the food is so iffy? First time dinner at Luciano's where  the  food was perfect and the service just so professional. My wife had the Salmon on a bed of mashed potatoes. According to my wife \"To die for\". I had the Zuppa di Pesca. Outstanding. The scallops were large, the mussels were plump and so tasty and the red sauce was a bread dipper.These folks take their food seriously and we cannot wait to return. This will no doubt become one of our new favorite go to restaurants."], ["Guy Y.", "Lovely restaurant . Great service . The pomodoro cheese dish is great to own with . I took the salmon salad with a tasty sweet balsamic  Italian music in the background and very professional service . Also have wifi."], ["Joe S.", "Really pretty and classy small neighborhood Italian place.  Had the short Rib osso bucco. Very good! But I would still prefer it was veal.   Wife had gnocchi and very pleased very good homemade.   Appetizer was grilled octopus.  Surprising tenderness and flavor !"], ["Jim S.", "First and foremost Luciano's is a clean restaurant, with very fresh food and friendly staff. I have eaten here about 6 times. Our waiter claimed that the owner was a meat wholesaler and he had first crack at quality products. The Chicken Parma is the best I have ever had due to the freshness of the chicken and the preparation.I do have a problem with this place and several other \"Italian\" restaurants in Charlotte. The ownership group being from Latin America does a great job, but the red sauce here is not a priority for them. I love red sauce at Italian places and their red sauce is not great. Fiamma is also has Argentinian roots and does a bad job with the sauce.Also what Italian place have you ever heard of that puts sun dried tomatoes on the table in oil for dipping bread? In summary you will enjoy your meal here, but if you expect red sauce reminiscent of Italy, Boston, New York or Philadelphia.....your not going to get it."], ["Kieran M.", "We went to Luciano's  the other day thinking this place was just a chain restaurant and similar to Carrabba's.  We were definitely wrong.  Luckily our curbed expectations led to a very pleasant surprise. (PS - There is nothing wrong Carrabba's)The inside of the restaurant is very nice, and feels upscale.  Luckily the prices are not 'upscale' in nature for the food or drinks.  The BIG PLUS here is their SERVICE.  It was exceptional.  Everyone was extremely helpful, friendly, and polite.  The service reminded of something you would see at a very nice steakhouse.For drinks, we tried the Strawberry Lemon Drop  and the Pometini.  Both were delicious, especially the Strawberry Lemon Drop.  My only tiny gripe is that they could have been stronger, but they were not watered down.In terms of food, we got plenty of their bread, which was warm and delicious, with some kind of olive oil dipping sauce that had a tomato-y taste to it.For the entree, we tried their Lasagna Coco Pazzo, which is much different (in a good way) than the traditional Lasagna that you would think of.  Great meat sauce and tons of cheese.  Also, a massive portion, so plan on bringing most of it home, especially if you get after it in the bread department.For some reason, we decided to get a dessert, despite the mass quantities of food consumed 10 mins earlier.  We got the Zeppole, which are mini cinnamon sugar donuts with nutella and ricotta cheese in them. Very tasty, but I could have gone for some dipping sauces...because...why not.When we saw this place open up, I thought Carrabba's would have competition, but now we are thinking Sullivan's will have to step their game up to keep us from going to Luciano's for a nice meal."], ["Allyson D.", "I will definitely be returning to Luciano's! I loved the ambiance, antipasti board and the service."], ["Marco F.", "This place was amazing and the food was delicious! Service was great and the waiter checked on us most of the time to make sure everything was okay. The Antipasti board was PHENOMENAL, and the Shrimp Fra Diavola was one of the best I've ever had. If you are in the mood for good Italian, definitely try this place out!"]], "Nothing But Noodles": [], "Mama Ricotta's": [], "Portofino's": [["Mary S.", "The husband and I went here last night for dinner. We shared the large antipasti salad, the shrimp scampi pasta, and the clams casino. All were excellent and we left very happy. The house dressing is awesome...Not sure if I want to know what's in it, it's so good :) Service was very attentive. Food came out quick and food and wine prices are reasonable. What else can you ask for?? Definitely give it a try"], ["Brian F.", "It had been years since I had eaten at this location.  I have been to the one at Ayrsley a few times and it was just blah.  I decided to go back to this location and was glad I did.  The food was so much better and everyone working was very nice.  I ordered a gnocchi dish and while the gnocchi was definitely not made from scratch, the read meat sauce was delicious.  My friend had the baked ziti (which I usually get)  and loved it.  This location seems to have t together and will be the one I go to henceforth.  Lunch prices are pretty reasonable too."], ["Tamara A.", "LOVE this place! If you're looking for authentic Italian look no further. The pizza is awesome, cheesesteaks are great and the pasta is to die for. My favorite is Shrimp Fra Diavolo with a spicy pink sauce. I have been going since 2003 and have yet to be disappointed in any location."], ["Brad B.", "In town for one night and tried to find the best Italian food possible.  I found it!  Just back from Italy for a week and didn't notice a difference.  I wish I could give it 10 stars!  I'll be back every chance I get."], ["Maureen B.", "I had been craving Italian for a while and we randomly found this place.  I was so happy when we did - it was exactly what I was missing from the Italian restaurant in NY.  We got fried calamari for an app., which came with plenty of food and the marinara sauce it came with was out of this world!  I got chicken parm for my entree.  It was perfect and it came with a side of spaghetti with their delicious sauce.The service was great and the prices for the quality of food was perfect!!"], ["Lyndsay N.", "We always come to Portofinos with my in-laws for celebratory dinners (birthdays and whatnot). This time we came to celebrate my father-in-laws 60th birthday. We had a group of 9 people set in the back of the first room. We ordered the bruschetta, calamari, and mozzarella sticks for appetizers. The mozzarella sticks were my favorite, but the calamari was very good. I didn't get a chance to try the bruschetta, but it looked good. We also got bread that was served with butter, and if you ask they can give you olive oil and vinegar. We were stuffed before our salads even came out. Luckily I got mine to go. I ordered the Gorgonzola tortellini with chicken and added mushrooms. It was delicious! It was the first time I had ordered it, and I loved every minute of it. We at the rest the following night and it was just as good reheated, which is a big plus in my book. My husband had a few remarks he wanted me to add to this review so the following is from him. His entree came with olives and he asked if they could be removed because he's not a fan of olives. When his salad came, he remembered he forgot to say no olives, which it typically comes with. Knowing that he did not want olives on his entree, the cooks took the olives off of his salad as well. HUGE WIN for the kitchen. He ordered the trout special for his dinner. He was not a fan. The trout was breaded with marinara sauce on it. Not really his style, he thought it would have come pan fried with no breading and maybe a light butter sauce. Lesson learned, ask about cooking styles before ordering the special."], ["Erinn D.", "I normally only get take out from here (which is always good!) but man was I pleasantly surprised when we actually went in to sit down and eat. We called ahead to put our name on the list since it seems to always be a popular choice, and ended up only waiting 10 minutes. Soooo... we got a glass of the Cabernet the bartender suggested- DELICIOUS!For appetizers, we ordered the roasted red peppers and mozzarella and the \"appetizer for 2\" to share. A lot of food but full of flavor! I may add that their calamari is always a winner but we had to try something different for once :-) For our entree, we split the chicken cacciatore that was served with a white wine sauce. Not sure if I'm wrong here, but I normally make this with a red wine marinara sauce. However, the sauce was absolutely delicious!!! A lot lighter than I typically expect but really good. (Even though we had to take majority of it home!)Definitely get the house creamy basil dressing! Cant get enough of it. I also want to add our server was really great. She was super patient with us taking a little extra time to order and splitting an entree. Also, I loved how attentive each and every staff member was to not only our table but each table individually. Authentic food. Wonderfully sweet staff. And great family/date atmosphere! Great job Portofinos :-)"], ["Julie J.", "This is the best pizza in Charlotte,  hands down.  The pasta is awesome too. If you get a salad, the house dressing is very good.  Delicious!"], ["Anna C.", "Delicious Italian food. Great pizzas and good tortellini Alfredo! Family atmosphere and good wait staff."], ["Kat E.", "The best Italian in Charlotte.  Period.  I have been going there on Sunday night for 20 years.  The food, the people and the ambience cannot be replaced by any other restaurant I have ever frequented."], ["Elizabeth L.", "Headed to try this place for the first time tonight. Having moved from New Jersey, we've been looking for decent pizza. We headed in at 6:45 on a Friday evening and were seated immediately on the outdoor patio. There were three servers working the outdoor patio, all of who made eye contact with me and my husband. But after 15 minutes, not one of them had come by to check on us, bring us water, or take a drink order. Finally we just got up to leave. I can't rate the food because we couldn't get any service to take an order. But the service was atrocious. Worst I've experienced in Charlotte."], ["Michelle C.", "Went to Portofino's for lunch with a few coworkers and we all enjoyed our meals and experience!We got there at about 11:45 and I'm glad we did, because as we were leaving there was a line out the door... That must say something for this restaurant!The sever was really quick to get our drink order and to take our meal order once she brought our drinks.  She told us about three lunch specials that all sounded delicious but I decided to order off the menu.  I ordered a side salad to start out with Witt he house dressing and the shrimp scampi for my meal.  One of my coworkers ordered the chicken and vegetable lasagne that was one of the lunch specials and my other co- worker ordered the linguine pasta with arrabbiata sauce.  Our side salads were delicious and very fresh!  I loved that they put green olives on the salad...different but good (if you like olives)!  The house dressing is really good and tastes even better with the warm bread they bring with your meal!The shrimp scampi was probably some of the best I've ever had!  I chose the linguine as my pasta choice and it was perfectly al dente!  The shrimp were huge and fresh!  I could only eat half my meal and it was still good the next day reheated!  My coworker offered me a bite of his lasagna...now I see what everyone was talking about in the previous reviews!  Amazing!  It must be on special a lot and I could see why!  My other coworker enjoyed his dish as well (he ate it too fast for me to swipe a bite)!All in all I love Portofino's and can't wait to go back again!!"], ["Eric B.", "Portofino's is the kind of restaurant I can get behind. A small local chain with great food, equally great staff, and a warm and inviting atmosphere. I've ate there twice and both times were good experiences. Their food is hearty and filling and a notch above anything I could concoct in my kitchen. The chicken portofino has everything Italian food should in my opinion, alot of well seasoned tender meat, rich creamy sauce, and a huge helping with enough for leftovers. The shrimp parmigiana isn't quite as perfect, but I still enjoyed it and like that they use really fresh jumbo shrimp. Kudos for their tomato sauce too, some places have a tendency to make theirs overly sweet, but Portofino's keeps their sauce a little tangy, just as a tomato should taste.I feel that great service can make average food subconsciously taste better, but luckily the quality of their food and service shine through in both areas. Their staff is superbly friendly and they come by frequently to check on things. They clearly want you to have a great meal, and as you can probably tell by my review, I like Portofino's quite alot. Skip the 45 minute waits at Olive Garden and come here, you'll leave with a full belly and a smile on your face."], ["Mimi C.", "One of the very best Italian places in charlotte - highly recommend the pasta sorrento. Comes with salad so lots to wait for"], ["Kate T.", "On my hunt for a good slice of New York style pizza, I decided to check out Portofino's for lunch, hearing they offer pizza by the slice on the lunch menu. Unfortunately I wasn't too impressed. I ordered a slice with chicken, green peppers and onions w/ a side salad. The salad was ok, nothing too exciting. As for the slice of pizza, it appeared to be a slice from a large cheese pizza with my toppings just added. They were cooked, but not heated through and didn't melt into the cheese like it should have, :-(.  Overall, the service was slow and the meal, just okay. I would like to give dinner a try, as other helpers have giving Portofino's good reviews. Once I do, I hope to update with a better rating, but for now, it was just ok."], ["Paola D.", "I'm a fan! I live fairly close to this place and so far I've not been disappointed."], ["Jena W.", "How does this place only have three reviews. I have been going for at least 10 years between this location and Eastway. Best pizza I ever had. It's thin but not too thin you can fold in half and it folds just right. Best crust. We love this place."], ["Josh M.", "In the mood for Italian, we found this little placed tucked in the back of a shopping center.  You know it is going to be good when the person walking out as you walk in say, \"Boy that was yummy!\"  It has a nice authentic feel and the service was very attentive.  The brushcetta was excellent and they even pronounced it correctly.  Baked pasta was so tasty.  The marinara sauce was homemade.  Short rib was so tender, the fork glided through the meat like Michael Phelps in the water.  The only negative was that it took forever to get the check."], ["Jenette T.", "Best Italian food I have ever had. A neighbor of mine recommended this place and he didn't steer me wrong. The calamari to start was great. Their bread could be better but who wants to fill up on that! I ordered the chicken Gorgonzola and oh my gosh! The first bite in and I said wow! It was so delicious. My parents were delighted with their food as well. The service was prompt and we all left saying that was some of the best food we've had before. I highly recommend this place."], ["Charity M.", "We've been regulars at this location for years. But lately, I feel that they've slacked on quality and flavor. The last few times we've eaten here, the food has been bland. Their pizza is still top notch and I love the bruschetta. However, the pasta dishes have been disappointing, with runny sauces and no seasoning. Even a little salt could've helped tonight!"]]}