{"Bistro La Bon": [["Veronica A.", "Very nice cozy spot! Went for brunch and it was worth the $22. I would definitely return and recommend it . The food was delish, I'm not a fan on buffets but everything was fresh hot and yummy. Eggs and fresh toast made to order! Yummy to my tummy!"], ["Heather N.", "I've been trying to get to Bistro La Bon for brunch since December. When Graham and I were going to bed Friday night it dawned on me that we had no plans for Saturday morning, so I decided that we needed to have brunch. I hopped on Open Table and made a reservation. The restaurant is over on a side of town that was always pretty shady when I was a kid. So it's very cool to see it being revitalized and filling up with excellent, local places.Graham and I started with cocktails. I had a $3 mimosa and he had a bloody mary. Their bloody mary bar is pretty awesome. You pick the vodka, and choose from a variety of mixers and add-ins. I had never had a bloody mary before, so I had a sip of his. I took one sip and promptly realized I don't care for them and would be sticking with mimosas.Graham had a breakfast that was, in his words, \"a vegans nightmare\". This was two eggs, a potato cake, and steaks with carmelized onions and bernaise sauce. This breakfast made me wish I liked runny eggs, because this looked so, so good. I did try the steak though, and it (and the sauce) was so delicious.His breakfast had nothing on my french toast. This was a huge piece of brioche, fresh fruit, syrup and orange zest. This was sweet, delicious and filling. I typically don't like syrup on my french toast, but with the fruit and the hint of orange flavor, it really worked. I would order this again and again. I did order a side of bacon (un-pictured), which was just okay. It was thick, but wasn't crispy at all.The server was a little slack (it took way to long for her to return with drinks and to take our orders, since there were only 2 other tables in the entire restaurant, but whatever. She was friendly and our food was delicious."], ["Janeka H.", "I went here for Sunday brunch on Father's Day and I was expecting to enjoy some good food.  However, I didn't really enjoy the food or the service.  It seemed like I waited forever for the french toast and bacon to come out.  And once I got it... I wasn't pleased with the quality.  It was just mediocre.  From the buffet, I had their watered down cheese grits and their not so fresh watermelon.  The items that I thought was okay at the buffet was the biscuits with white gravy and their Mac and cheese.  Typically their buffet is $20 but for Fathers Day...I paid $30.  And it was a complete waste of money.  I don't think that I would ever come back here.  Sorry Bistro La Bon, I'm just not that into you."], ["Elisabeth B.", "Countless incredible meals later I'm ready to lay five stars on Bistro La Bon. Their cuisine consistently is innovative enough to push your food comfort zones- lamb belly anyone? Served in a comfortable and gracious environment. You may have dined here for their famous brunch buffet. I implore you to try them for dinner. For an extra special good time:1. Sit in the spacious bar area. Many tables and several couches. The couches are where it's at. 2. $6 cocktails on Wednesdays. And yes they even ran that special on New Year's Eve. 3. Snag a handful of bar bites. These offerings are a teensy tiny bit smaller than the small plates served in the dining room but a couple bucks cheaper. You won't be missing out. 4. If it's on the menu-Try lamb belly, tuna tartare, lavender chicken (it's often listed as a main too and the best chicken you'll ever order out), their mussels are divine and the grilled octopus is on point. Oh yeah, the bread pudding is worth it. It's the bar I compare all bread puddings too. Perfect way to end a meal."], ["Kaitlin L.", "Amazing dessert, wonderful food, and great atmosphere! My husband and I have been going there for years, and have always had wonderful meals."], ["Neal D.", "This review is for the Sunday brunch...which was crazy good! What a spread they put out. This is definitely not a typical brunch menu--you won't see pancakes, sausage links, or cereal stations here. Instead you get a variety of dishes like kielbasa and streusel, chocolate waffles, brisket, and biscuits and gravy. You can still order scrambled eggs and bacon direct from the kitchen to your table, but don't look for those standard items in the brunch area. A nice treat is a wide variety of freshly baked sweets, including MACAROONS. The macaroons pretty much sold me.Service is also very good. Overall a 5-star experience."], ["Corey Tess T.", "Today's service was lack luster as I had to wait 40 minutes for a mimosa and then they ran out if glasses. They had a delay on my coffee because they didn't have a mug available. Really!? So I cancelled our drinks after waiting 40 mins for them. Geesh! The brunch is popular and they have some good choices on the buffet but they need to get more cups and glasses. This is service 101.  So disappointed."], ["Randy K.", "Visited Bistro for a quick and casual breakfast on a Saturday morning after seeing the great reviews on Yelp.As an out-of-towner and total foodie, I thought I might have landed on something amazing. The pictures looked great, there were rave reviews, should've been an easy win!I ordered the french toast - but, it was a bit burnt on the edges. Not like caramelized burnt, just burnt. And, nothing really special about it to be honest. However, the bacon was phenomenal. I wouldn't recommend the french toast nor order it again. Next time I would order probably a classic breakfast (the people next to me had this and it looked awesome). Friendly staff and nice looking place, but waiting to be wowed by the food."], ["Candyce B.", "My girlfriends and I stopped in for Sunday brunch not knowing what to expect, we didn't make reservations and had a short wait but the seating was comfy and it gave us some time to see the plates from the kitchen and buffet. The brunch includes your choice of items from the kitchen including french toast, chocolate waffles, eggs and bacon. And a decent selection on the buffet including jalapeño macaroni and cheese, Swedish meatballs, pot roast, sausage and cabbage, grits and biscuits and gravy.The highlights for me were the meatballs, biscuits and gravy and sausage and cabbage. The French toast has a bit too much orange zest for my liking and the grits and mac and cheese were classic. Nice job! Honestly, everything here is worth trying! It makes for a great brunch option on a Sunday afternoon! Oh yeah...they have $3 mimosas!!"], ["Janet P.", "Urban? Trendy? Delicious? Yep...! This place is great for a casual Friday night w friends or a romantic dinner. Amazing dishes that are complex without being overly complicated... And the drink menu is impressive too.  #awesomeness #yummy"], ["Lauri G.", "Disgusted, and we will never be back.  When we called to make a reservation for Sunday brunch (party of 4) Bistro La Bon told us in 2 different phone calls to the restaurant that they would not be accepting reservations.  Expecting huge crowds, we arrived early enough and were glad to see that we were the 4th party in line (as they open at 10am).  We were confident we would get a table as we were so close to the door.   Upon seeing the completely empty restaurant, the hostess asked, \"do you have a reservation?\"  Surprised, we responded, \"No, we called and were informed that reservations would not be available.'  The hostess replied, \"Oh, we do take reservations for parties of 10 or more.\"We were shocked, because there was no mention of this rule when we attempted to make our reservation. We were offered a small bar table or wait for \"about an hour.\"  During this exchange, a steady stream of about 15+ people were ushered in ahead of us.  They seamed to have appeared from out of nowhere. We watched as our seating options dwindled before our very eyes.  Disgusted, we left and made waffles at home.  Happy Mothers Day!   We felt cheated and misled by Bistro La Bon. And up to now, we had always recommended this restaurant to friends, family and out of towners - NO MORE.  I don't care how the food tastes if this restaurant does not treat their customers fairly - take reservations or don't.I wish I could give zero stars."], ["Kristi M.", "One of the best brunches of your life. Cool eclectic awesome tastiness at the buffet, plus eggs, bacon and waffles or pancakes cooked to order. It's different every time and that makes it WOW!"], ["Rebecca K.", "My oh my. I first visited this unexpected gem for dinner when we were hungry and out of options. What a great treat! I love the eclectic décor and fund small plates. My husband and I spent a date night here and ordered several small plates, then ordered another round of small plates. We especially enjoyed the lavender chicken (go ahead, try it, you'll love it).The next time I dropped in was with my brother on a Sunday for brunch (more like lunch for us). What!? Buffet brunch for $20 and the variety of foods are endless. Plus, $3 mimosas. Sold. How can a buffet do both pâté and biscuits and gravy well? I have no idea, but this is my new go-to brunch spot."], ["Melanie E.", "Had not been here in a while to eat.  We came after work to check it out.They've completely changed the bar area and there is no longer a TV.  I think I liked it the other way better, but this way gives much more open space and bar area seating including the bar itself, plenty of high-tops and lounge seating - overall a winning combination.  They also play some chill music, which I like.There is patio/outdoor dining as well as it is very comfortable and spacious, although seating is limited.We sat at the bar to have some appetizers and the bartender/server for us was Kevin.He is a new bartender, but he was very personable, helpful and informative but still allowed us our privacy.We had the Calamari with a smoky, chunky tomato sauce.  It was very good with sun-dried tomatoes reduced to provide a nice toothsome sauce with a slight sweetness from the tomatoes!  Calamari with rings and tentacles - crispy and perfectly cooked, not rubbery at all.We also had the seared gnocchi with parmesan pepper sauce...slightly salty to me, but absolutely delicious with chunks of artichoke that were cooked well so you didn't have any hard parts.We finished our appetizer selection with the scallops.  Two seared scallops (a little under to my taste) and a dollop of delicious pureed potato with a brown sauce.  Very, very good.We ended the evening with the Brioche Bread Pudding with caramel sauce and vanilla ice cream.  I think this is the best bread pudding in town.The chef, Majhid (not sure if I'm spelling this right and I didn't get his last name) came to check on us and he was very friendly and interested in our feedback.Reasonable pricing for Charlotte.  Not crazy like some places.They have a Saturday brunch which is more traditional fare and the Sunday brunch which is more of a European-style brunch with cheeses, meatballs and other assorted goodies.I think they've made some great updates here and I look forward to going back soon!"], ["K S.", "Great for Sunday brunch. The buffett has something for everyone. Also, you can special order traditional menu items - omelettes, French toast, chocolate waffles etc. - from the kitchen at no extra cost. Some of the buffet food items dos not appeal to me but enough options for all palates. It's Southern and eclectic.Between the people and the music it would be hard to hear for some people in this environment. It's noisy and festive at brunch. Service is attentive.Come at 11:45 am to get the best brunch table and beat the crowds. Bloody Mary's and mimosas start at noon."], ["Todd R.", "Loved it. Wanting to have a nice but quick dining experience with some friends prior to the Led Zeppelin Symphony last week they suggested Bisto La Bon...and am I glad they did. From the Brie Brûlée to the Grilled Spanish Octopus each bite was a delectable feast. Our waitress Jess was attentive and made great suggestions. Would I return?...you bet. You can enjoy small plates or order a full entree, they'll even split the entree as a small plate. The wine list is great, the atmosphere upscale but far from stuffy.Would I suggest it to a friend, only if I value their friendship :-)"], ["GD M.", "Simply put, the food was delicious! Here for the weekend and went on Yelp to check the reviews for a Sunday brunch spot and this restaurant had rave reviews. So, let's try this spot. The reviews were on point!  This place is great. Did was delicious and a variety and our server Ashley was awesome. Highly recommend this spot. Will be coming back again when I visit Charlotte."], ["Kelly K.", "I love this place. Yep, it's a hidden treasure next to the Family Dollar but really - who cares? The décor is lovely and the food is absolutely amazing. I have been to Bistro LaBon several times for dinner or drinks/appetizers and have ordered several things from the menu. I can truly say I have not been disappointed in anything that I have ordered. The dishes are thoughtful and creative and, well, amazingly good. Try it. I must say, however, that I especially love Sunday brunch. It is beyond fancy yet somehow simple. The French toast, chocolate waffle as well as eggs/bacon are served to you at your table (order as much as you want) along with the lovely buffet (smoked salmon, capers, veggies, salad, fruit, to name a few). The French toast is probably the best French toast I have ever eaten. Really, it's that good."], ["Jason L.", "It's so dark in here. I can't see shit. Really though it's like I'm in a cave. I literally need to use a flashlight to navigate. It's a delicious cave though, with delicious food. Don't come here with less than a half-moon."], ["Connie L.", "ended up here because soul gastrolounge had a 2+ hour waitbut im glad we did because everything was so good!the grilled calamari with eggplant.. SO good! small dish thoughbaked brie brulee.. it was okay but way too much and heavy for one person. good to share! the jelly and chutney was semi-on the edge of too sweet but still good, came with a variety of chips/breadstried friend's chicken with pumpkin, really good, the pumpkin bread was deliciousfriends also enjoyed fried brussel sprouts and musselsso cute inside, good service! would totally go back!"]], "Zeitouni Grill": [["Jaymin P.", "One of the best falafel I had tried. Accompanying tabbouleh was really good and fresh too. Why not 5 starts ? Because Pita served was cold. However Upon request they heated in microwave and accomodated us. Babaghanoj had smoky flavor but very close to taste coming out of can. Would pass on that one next time. Overall great stop for quick lunch , go again for falafel"], ["Sydney H.", "Seriously awesome! Being Lebanese it's hard to find good authentic tasting food. This is one of the few that has it!"], ["Josam R.", "It's really tasty.... And I'm glad this place is here. Hummus is great and marinated chicken is fantastic. The only downside is Friday nights - we've been a few times and they've run out of hummus!!! A mediterranean place without hummus is disappointing - but the babbaghanoush is solid and the falafels are also very good. Grape leaves are a little soggy compared to what we loved in little Greece in NYC, but trust me, this place has won our hearts and we hope they stay for a very long time. Excellent baklava for dessert too!!!"], ["Biorunup J.", "Every thing here is like fresh food and smells like authentic Mediterranean food.i have tried shawarma,falafel and Chicken sandwich rap, all are Yummy.Price also reasonable.The last is Baklava sweet. Don't forget too."], ["Dawn M.", "Everything was fresh and delicious. We had several different items and they all were as good or better than what we had in the Middle East!"], ["Joe L.", "The only thing that taste like what it is was the ... Tomatoes....... Everything else tasteless ......don't waste your time and your $$ ... Go somewhere else!"], ["Dawn F.", "Went today for a quick lunch. Everything about this place was awesome! My girlfriend and I were unsure what to get and the guy at the register was very helpful. It had been some time since I had a good gyro so I went with that. I've never had stuffed leaves so I decided to try a side of those. The guy at the register recommended their chicken sandwich, which my friend got along with the side of eggplant. Everything was so fresh and delicious! Looking forward to going again to try something different."], ["Christina J.", "We split two platters (Mixed and Mezza) and the Zataar flatbread, so we could try more things. Things we would get again: ANY of the meats (all cooked perfectly and so flavorful!), the potato harra, the fatoush salad, the hummus, and the tabbouleh. I would skip the Zataar, the Babba Ghanouj and the Falafels. Also, we tried all four types of baklava, and I felt they were all somewhat dry, and butter was an extremely prominent flavor, but the long rolled ones were the best imo. All said and done, we would definitely come back."], ["Catherine R.", "I just wanted to take the time to say how amazing this place is! With the food and superb customer service is what keeps me coming back time after time. All the staff members always have a smile on their face and you can tell they enjoy what they do. My favorite dish here is the chicken gyro platter I always pair it with the outstanding hummus and the fatoush salad. I can't forget my favorite side dish! The potato harra OMG!! If you love Mediterranean food you will love this place!"], ["Beth B.", "Today, was the first day I have ever been refused service! I took my 18 month old daughter to one of our favorite places to have lunch.  We have been here countless times and have always ordered the same thing - chicken kids meal minus the fries and drink but with a side of tabbouleh. Today I was told no we can't do that! I explained we always order the same thing every time was told, No! The manager looked right at me and said NO, then hung his head down and wouldn't look at me. He didn't offer any solution! He could of said well I am sorry but we can do that but we can... Or we can but its going to cost a little more, just a flat at No we can't to that! I waited for a solution, but he was unresponsive. Total lack of customer service and no healthy options for children! Only fries as a side for kids - I am sure in Lebanon they don't just give fries to kids.  Restaurants should offer healthy options or substitutions for kids not just unhealthy fries. To be blunt parsley, tomato, onions, mint &  bulgar is not pricey! My 18 month old loves tabbouleh, kibbeh, falafel, & hummus.  After we were refused service we went over to the Kabob Grill in Ballantyne and they gladly served my 18 month old chicken and tabbouleh,  (subbing the fries) no questions asked. The server even commented how well she ate. Needless to say we will not be returning to the restaurant due to the extremely RUDE service and lack of management skills.  I recommend you check out the Kabob Grill in Ballantyne or Dilworth. There is also a wonderful Arabic restaurant in Matthews Kabab the owner is from Beirut and is very customer service orientated."], ["Rob J.", "Awesome experience. Maybe the best falafel I've ever tasted. Highly recommended the Mezza so you can try it all."], ["John C.", "Our family favorite Mediterranean Rest. You cannot go wrong with the entire menu. The Gyro meat is so moist and tasty. Their dolma  (stuffed grape leaves) is very good."], ["Brian A.", "The best falafel and hummus I've had outside of Turkey (the country that is)!I'd love to expound on all the wonderful flavors and how their decore is this or that...but simply...the food is great and exactly what it should taste like.If you care about the ambiance and whether it's worth a 40 minute drive or not, defer to the other reviews.  The falafel sandwich alone gets five stars from me.I do know this:  If I'm in the area, I'd be hard-pressed to choose another location for lunch."], ["Carol R.", "Very good. Great choice and the Lebanese beer was a plus. I never take the time to rate anything but the food compelled me."], ["Victoria W.", "This is definitely the best middle eastern place in Charlotte. It is very fast, the service is excellent, they make great use of seating in this restaurant and best of all, TRULY AUTHENTIC. My falafel wrap was served warm in a foil, inside it is filled with hearty falafel, veggies and amazing tahini sauce. The stuffed grape leaves I ordered were just perfect, not too sour, just the right amount of oil and very great stuffing that makes me want to call this place a home. Overall this place is great because:1. Committed family business2. passion for great authentic middle eastern food3. very quick service4. friendly and knows how to do business right!5. Fair prices for amazing food!This place resembles everything that embodies a restaurant with a sound business model, bravo!"], ["Brian E.", "I haven't tasted the food yet but being on hold for 10 minutes and walking in and seeing no one in line and the phone lying down isn't a good start.  Then giving me a side order rather appetizer order of grape leaves didn't help.  Well then rather than up charging the price difference I was charged for another side.  Food may be great but don't need heartburn before the meal."], ["Kelli S.", "Um...YUM! Haven't had a gyro in years and I never remember them tasting sooo gooood! Cant wait to try other things on the menu.  I will be back!"], ["Margaret B.", "This little place next to Earth Fare in Ballantyne holds hidden treasures, specifically the best baba ghanouj (smoky eggplant dip) and other freshly made Lebanese food. I came during the lunch rush, but was able to get a high top table without trouble. There was a line to order, but never longer than a few people. Longer was the wait for the food - 10 to 15 minutes. It's not fast food but well worth the wait for such high quality food. Service was given with a smile and quite efficient. The baba ghanouj was smoky, creamy, with tender pieces of eggplant and wonderful notes of herbs, lemon, and olive oil. Personally I favor Greek pita bread over Lebanese, but it was a great vehicle for this delicious dip. The chicken gyros sandwich was perfectly prepared, tender and juicy chicken, with a fabulously fresh tzaziki (yogurt and garlic sauce), and just amazing. I swear I was licking my fingers! (One advantage to eating alone.). I'm seriously considering ordering more to take home for dinner!!"], ["Nicole T.", "Have eaten here twice now for lunch.  Both times had the lamb gyro - which is pretty good.  It's not too big, so perfect size for lunch.  The taziki sauce is a touch on the sour side for my liking, however, the ingredients are fresh and the staff is very friendly and prompt.  The hummus and pita was disappointing.  Paid for extra pita as 4 triangles are never enough!  However, they don't toast or warm the pita when served with hummus.  (The gyro pita IS warmed/toasted)  This ruined it for me.  Can't even tell you if the hummus was good as they lost me on the cold pita.  Eager to go back as the kabobs and salad look awesome!"], ["David T.", "Really good food but service can be aggravatingly slow especially on weeknights when they have less staff.  I would probably go more often if service was more organized."]], "Kabob Grill": [["Sukesh Reddy K.", "Worst food !..was served food which felt like it was  atleast 4 days old . The rice was cold and lumpy and meat was uncooked and rubbery . Would not recommend it . This place is expensive  and waste of your time and money ."], ["Ellen O.", "Hands down - Kabob Grill has the best hummus in town! This review is for the Stonecrest location. The service and food is great and consistent. Some of my favorites are the kibbeh (who doesn't like football shaped food filled with meat?),Nabeel's salad, and the chicken kabobs.  The entrees come with two sides, I recommend the potato hara and the hummus - they are both really, really tasty."], ["Leah S.", "We were hard pressed to find gyros on a Sunday, as most of the other Greek places are closed. While gyros aren't actually on the menu here, they're happy to prepare it for you if you ask. It differs from the fast food \"Americanized\" version, but in the best way possible. The pitas taste like they're made in-house (not sure on that one though) and it comes with hummus and an array of spices that make it so delicious. And now I'm craving one. I'll definitely be back!"], ["Evan J.", "This place is a hidden gem if you are interested in Mediterranean food (particularly Lebanese). The service and food have always been excellent."], ["Elly A.", "OK food, humus was delicious and the falafels were good we were a group of 10, we ordered several platters. While the service left us perplexed, we definitely will not go back to avoid such lousy service! Unbelievably rude!"], ["Mark S.", "We love eating at Kabob Grill. The staff is very friendly and the food is excellent. We really enjoy the lamb kabobs, falafel, and the hummus is smooth and creamy. On Tuesday and Wednesday they have 1/2 price bottles of wine. If you are looking for a change of pace from the average food choices offered by Charlotte restaurants give Kabob Grill a try."], ["Michael D.", "We stumbled upon the Kabob Grill the first time as we were leaving the Regal Movie Theatre, hungry and deciding where to go. We looked across the parking lot and there it was.The food was fantastic! Tonight it was our destination and again they delivered! Try the yalantis, a sort of Middle Eastern grape leaf rice stuffed dolma. The falafels are just the right kind of crunchy on the outside and tender and flavorful on the inside. The falafel salad incorporates the same tasty crunchy falafels with fresh veggies including tomato, cucumber,onions and pickled veggies. The best however are the namesake kabobs. I have had shrimp, lamb and kafka, (seasoned ground beef), and they have been perfectly seasoned and grilled. Can't wait for the next dinner and a movie, (or perhaps just dinner!)"], ["Brenda G.", "I do not recommend. I've been sick to my stomach since eating there this evening. Ordered chicken shawarma and hummus. Hummus was excellent; however, the chicken was way over cooked and lacked appropriate seasoning. Pita bread was stale and dry.  I thought the chicken tasted a little funny, but attributed it to the poor seasoning at the time. I left over half on my plate and declined a doggy bag. In retrospect, I think the chicken was on the verge of spoiling and then over cooked to masked it."], ["Richard B.", "Love the food.  Always delicious and made with the freshest ingredients.    Owner and staff very friendly.  One of our favorite restaurants for lunch and dinner."], ["Brian S.", "Had a $10 of coupon,  so we gave the place a try.   Huge Mediterranean/Middle Eastern food fans. Decent food,  but nothing special.   Good humus,  falefel.   Grape leaves tasted like exactly what we used to buy from Costco.  Portions were small to average,  prices typical. Requested the bill,  and noticed it looked like the coupon was not deducted.   Asked the server,  and he said they stopped taking it.   Would not have mentioned it to me if I didn't ask. I miss the old Middle Eastern Deli that used to be on Independence."], ["Adam H.", "I absolutely love the food here.  It's one of the few places near me in south Charlotte that I go to regularly.  Note that the food is great here, but its definitely a casual kind of place.  It's not a 5 start atmosphere and service, but both are more than satisfactory.Back to the food- the kabobs here are ridiculous.  I particularly enjoy the lamb and the kafta kabobs. The chicken is also fantastic.  For appetizers, get the hummous.  Yes- you've had hummous before, but this is on another level.  Another interesting choice is the grilled Halloumi- its salty and has a really interesting texture. Give it a try.The pita wraps are also great- and a good choice for a meal to go. You can't get them on Friday and Saturdays after 5, so stop by on a weekend or for an early meal and enjoy."], ["Tim K.", "Every time I am in Charlotte this is my first and last stop.  Absolutely the best Lebanese food I have found, right down to the garlic paste.  I highly recommend the potato harra side, and I usually get the chicken skewers or shawarma.  I have brought lots of friends here and everyone rates this place very highly.  You really can't go wrong if your looking for a good middle eastern food place."], ["Niya S.", "I want to like Kabob Grill, I really do! But for me its ok and I probably wouldn't go running back there any time soon.I grew up eating a lot of Middle-eastern, Mediterranean food and good food so I was excited to try this spot out since a lot of my friends talked about it constantly. Their ambience was ok, staff was incredible but the space was very limited.The tabbouleh, fattoush, falafel was good and I ordered the lamb kabob which was pretty good too. Their portions are small and prices are a little steep and honestly I have had way better middle-eastern food around this area, so this is a no for me."], ["Charles A.", "This a wonderful Mediterranean restaurant!  The food and service can not be better.  The restaurant offers a very pleasant atmosphere and an excellent selection of beer from around the world.  The prices are most reasonable.  I highly recommend you eat here."], ["Matt S.", "Incredible food and service. I would eat here every night if I could. The chicken Kebob, potatoes and toubilee  (sp?) are to die for. Also make sure you get desert as well."], ["Brian W.", "Food is excellent, always fresh, and more than enough. If we are ever in Stonecrest, this is the first place we choose to eat."], ["Tiffany N.", "I stopped in for lunch on the wknd and there was one person working the entire room. She finally stopped for a minute to take my order after waiting at the bar for almost 10 mins and she told me it would be 15-20 mins which was fine with me since I had to run to the Teet. Well, 30 mins later, I am back and still no food. She forgot to put my order in and at that point I was starving and just wanted my gyro lunch special. They had a nice selection of lunch specials available seven days a wk so I'll give that to them.I got it and took it home. it was good but nothing to write home about. The lamb wasn't too flavorful and the tsatziki sauce was kinda weak. I would love to check it out again when they have a better service situation going on. I hear their hummus and baba ghannouj is terrific so I think I will be giving them a second chance in hopes of a better experience."], ["Amanda F.", "I love the Kabob Grill. We went this weekend and all I kept thinking was \"why don't we come here more often?\" Service: A+ Food: A+ Ambiance: A (pretty good for a strip mall)Price/Quantity of Food: A+Parking in Stonecrest Shopping Center: F&$#Oh yeah, that's why we don't come here more!But - the good news is the food is totally worth driving around in circles and yelling/getting yelled at by people in giant SUVs. It really is that good. They have reasonably priced bottles of wine, their quantities are HUGE (you can easily share the mixed kabob platter - there are 4 skewers of meat + 2 sides). Don't worry, they bring pita bread in case you are really starving! And I have to mention that the food is so delicious! So delicious! I am still mad at myself for forgetting this place."], ["Michelle B.", "You know it's going to be a good place when the place is filled with Mediterranean people! I ordered take out because I didn't realize the place was so nice and that it's really a place to sit and enjoy the food. I ended up getting the vegetarian combo which included hommos, tabbouleh, baba ghannouj, falafel, spinach pie, yalanji and potato harra. This was all accompanied with pita bread. I foind the potato harra a little too acidic and the overall meal was a little too salty for my liking. I also would have liked some tzatziki sauce on the side. Overall, the place was really nice and the service was great. I combo platter was large and I was unable to eat it in one setting which isn't a complaint because these leftovers were yummy!"], ["Maureen B.", "The food here is pretty good - I ordered a lamb kebab with a Fattoush salad on the side.  We loved the hummus as well.  The prices were pretty steep for the food you get.  Everything tasted good, but we probably won't return as the prices were way too high for the food we received."], ["Sri S.", "Service is horrible. The main manager is very rude and does not explain things about my order in a nice manner. This has happened second time and I will never go there."], ["George R.", "This was a weeks ago but I realize I won't be going back so here it is to the best of my recollection. -the humus was tasteless 2 stars-the $16 Kafta Kabob looked great but wasn't any good plus overcooked and dry to boot -one of the worst Kaftas or Donner I ever had in fact: One star!-the Baba Ganouj was very tasty and the falafel excellent: Four stars but I think the menu said $10 for the falafel wrap?? Overall I found the pricing too high for what it is  and I'm deducting one star. I'll take the gritty but authentic La Shish Kabob over this overpriced desperate housewives of Ballantyne location anytime."], ["Michael T.", "Great place, best Chicken Shawarma with Hummus I've had so far! I try to go there once a week for lunch. Service is always great and quality of food consistently high."], ["Elizabeth B.", "Great place for kebabs.  I love the falafel pita, the pickled veg in it is so good.  My hubby usually gets the mixed grill and it's always a hot.  We have had their meat pies before and they are good, but a little heavy for an app, and too big for two people.  You wouldn't expect it from the outside, but the inferior is actually quite nice.  They did a good job of making this casual dining spot have a relaxing and clean feel."], ["Rod O.", "Fantastic!  Tabbouleh, Vegetable Soup, Beef Kabob Wrap and Five Desserts!  Breaking my diet on a Monday is a great way to start the week!  Great for me to write some reviews!  Last night dinner at Kabob Grill was very good.  I think he said he and his brother own this one and the one on East Blvd.  This was my first dine at this location!  This was the first time I've ever noticed Mint in Tabbouleh - WOW!!!  The Mint really made a difference!!!  Fantastic!  First I had a very good Vegetable Soup: Sweet Corn, Zucchini, Carrots, Onions, Potatoes and Mushrooms!  I have never put crackers in my soup.  Last night I did.  They were more liked naturally dehydrated pita bread pieces.  The Beef Kabob was very good: Beef, Onion, Pickle and Garlic Sauce instead of Hommos (hummus? Right?)Then dessert:  Chocolate Tartufo: Zabaione Cream center, surrounded by Chocolate Gelato, caramelized hazel nuts and topped with Coco powder. Pistachio Baklava Mmmmm!  Bombe: Sorbet - Mango and Passion Fruit with a Raspberry center, covered in a White Chocolate Shell!  Chocolate Fondant: Chocolate Layer Cake filled with Chocolate Cream, topped with thick Chocolate miroir and the end was surrounded by Chocolate flakes (this one sounds wonderful and was good, though was the least unique and least wonderful, yet was the richest by far!). The Fifth Dessert was Torta Nocciola: layers of Hazelnut Cake, Hazelnut Cream and Chocolate Cream, topped with Hazelnuts.   I would and probably will repeat any part or entire meal again!!!  Service was Fantastic!  The owner was waiting on everyone and did a great job!Get the Turkish Coffee!!!"], ["Curtis W.", "Had the Mixed Grill kabob dinner - kafta, chicken, steak, and lamb with potato harris and Omar's salad.  I have had kabobs n NYC, DC, and northern VA, but none have kabobs as good & tasty as I get here.  Friendly attentive staff."], ["Annie W.", "Oh man, I'm still drooling over the vegetarian combo I had last night. Probably because there was enough leftovers for lunch today. Everything on my plate was delicious! Service was fantastic, super friendly and efficient. We were in a rush to see a movie and the kitchen was able to whip up both our dishes in record time! I'll definitely be back to more thoroughly enjoy the delicious food."], ["Matt B.", "I just realized I haven't reviewed Kabob Grill yet.  This is one of my wife and I's favorites in Charlotte, and the best Mediterranean place we've found in the area. The falafels are great, and they have a number of selections for vegetarians. The staff is also friendly, but not overbearing and the restaurant is comfortable - a good place to go on a date.  Tip: try the Turkish coffee.Both locations are good - though this one is a little bit more spacious."], ["Sherry R.", "Wonderful mediterranean dishes...excellent lamb, great flavor in falafels, creamy hummus and to-die-for pistachio baklava."], ["josh d.", "I went here for a get-together this weekend. I'm vegan, so I only had the veg items. Everything was very fresh and delicious. The standout dish by far was the baba ganoush appetizer. It was absolute heaven - the best I have ever tasted. As for the vegetarian combo, the falafel was crispy and flavorful. I gave my spinach pie to someone else, but they thought it was mediocre. I don't like parsley, but I actually liked the tabbouleh. If I have any criticism, I would say the pita bread is mediocre. It's quartered and packed in plastic bags. I would prefer it to be heated and served with the dishes instead of being served as a separate item. The place is small and clean with a cheery atmosphere. The workers were attentive and nice. If it were possible, I would give it 4.5 stars, but since I have to make a decision to round up or down, I have to go with 5 stars."], ["Colorado G.", "I guess it will take a few more years for the food scene to mature in Charlotte so that, on future visits, I don't have to deal with the likes of people who run this place. Clear indication that Charlotte needs more authentic Mediterranean establishments. I look forward to finding one on my next visit.We went there as a group of 5 last week and the place wasn't busy. This was my second visit. The experience was the same as the last one.  Average kabobs, lousy salads, inexperienced wait staff and an incredibly tactless/rude owner (maybe that explains the churn in staff). He clearly should not be in hospitality and food business; especially in the highly hospitable/polite culture of Charlotte. My friend, who lives in Ballantyne and suggested this place, apologized to rest of the group after the meal. Stay away from this place!!"], ["Paula S.", "Hi quality fresh Mediterranean food (think falafel, olives, eggplant, hummus, tzatziki, tabbouleh, etc) and fast, friendly service.  Best place for Mediterranean food in ballantyne area"], ["Wain S.", "This place was nicer than I thought it would be. The food is good and the staff was accommodating. I thought the portion sizes were big, but it still seemed over priced.  I may go back if I'm hungry for Mediterranean food or if there's a coupon."], ["Tonya P.", "Vegetarian ComboHommos, tabbouleh, baba ghannouj, falafel, spinach pie, yalanji and potato harra for $14.  Plenty to share.  They also offer kabobs and wraps.  I tried the lentil soup today, yellow lentils and spices, puréed to  a smooth consistency.  Very tasty!Kabob Grill is located in the  Stonecrest shopping center, on the side facing the movie theatre. It is kind of tucked away.  There are also a few tables on the sidewalk for outside seating."], ["Dia B.", "I have to give these nice folks very high marks!  The food was delicious and I was very happy with the way the staff paid attention to the questions my fiance and I had before ordering (which is very important because both of us have food allergies.) They were patient to listen and answer our questions and customized a few things for us. The waitress was pleasant and efficient. The owner helped out with following up on drink refills when the waitress was busy.  Everything was fresh and the quality of the food was excellent.  I've honestly never much been a fan of Mediterranean food, but my fiance loves it so I figured I would just go along for the ride.  I ended up thoroughly enjoying the entire experience and I liked it enough to save it in my GPS for future reference.  You could say they've made me a convert!"], ["Lauren W.", "Hidden at the back of Stonecrest in a shop that faces Regal Cinemas is the Kabob Grill. Talk about quality Mediterranean! On Tuesday Casey and I dined there due to my intense tahini and falafel cravings. As usual, I left fat and happy.The restaurant itself is classy; the decorations are tasteful and not overdone. Every time I visit I see at least one family, and a few couples. The atmosphere is casual and relaxing. The dining area is smaller than in most restaurants, but comfort is not compromised; there is never din and it usually seems fairly quiet to me. Among the things I've ordered that stand out;  the grilled kafta kabobs (delicious ground beef with spices), the grilled lamb kabob, and most recently, the lamb kabob pita (packed with hommos, lamb chunks, pickled vegetables mmm!) . Delicious side items to try are; baba ghannouj, falafel, and potato harra. I've never ordered it, but this restaurant also offers hookah on the patio to those 18 and older. The guys that work here are so nice, and always very attentive. This is a must-try location while in the Ballantyne/South Charlotte area!!!"], ["Amy K.", "Ate here last night.  My son and I both ad pita sandwiches....mine,the lamb, which was tasty, but not much lamb, mostly lettuce.  My son had the beef, which had a little more meat in it, but not much.Our bigger complaint was one of our servers who was rude!  We were served some type of bread, encased in  Saran, which I thought was a little odd since we had ordered sandwiches, but as I reached for it and actually had my HAND on it, the first server runs by, grabs it out of my hand with the comment that we were NOT to have been served that!   Really?  Ok, so another server made an error, but once it's on the table, be gracious enough to just let it go.  It's only bread, anyway.Then, we are served our pita sandwiches, wrapped nicely in paper, and as I'm unwrapping it, Rude Server, once again, GRABS it out of my hand, to \"enlighten\" me on how this is to be eaten, partially unwrapping it and handing it back to me.  Does the same routine with my son.Frankly, I'm a little put off by a server who grabs food out of my hand, TWICE, (or anyone else, when I'm hungry!), so between Rude Server, and not so much meat, I would think twice about revisiting if it weren't so close to home."], ["Giannabrie F.", "BEST falafel I have had in Charlotte.  That's all I was hoping for and I found it.  That is all I want to share!"], ["Wendy K.", "I have been to this restaurant a few times since it opened.  The food is good but I always feel shortchanged when I leave.  It seems overpriced for the amount of food they give you.  And once when I asked to substitute another side for the fries the owner told me no since the other sides were more expensive than the fries.  He actually brought out the gyro with nothing else on the plate.  That really should have been the last time I went there!"], ["Pample M.", "I would rate it a 3.8.  The food is very good, but we were disappointed by the portions.  Also service was very slow, the place was understaffed the night we went. Maybe a good lunch place but not coming back for dinner."]], "Levant Mediterranean Cuisine": [["Tae-Sun K.", "Disclaimer: My introduction to Mediterranean cuisine was in the largely Muslim community of Deafield when I use to live in Michigan. So in terms of taste, I would give Levant 4 stars . . . but the fantastic service and beautiful furniture earned it the 5th star. I love the chicken kabob . . . and anything lamb will not disappoint. The lentil soup is good -- it is completely  pureed. I actually prefer chunks of lentil in my soup. Oh, there's also belly dancing on Saturdays! Not the audience . . . just the paid professional :)"], ["Barbara S.", "I really enjoyed my meal at this restaurant on Friday, November 18th.  My friend and I ate the appetizers (hommous and black rock shrimp) and they tasted quite good and were appropriate portion size.  I also enjoyed my lentil soup.We ended the meal sharing a crème brûlée, which was tasty, but not quite as firm as I was expecting.  The service was excellent.  The restaurant was not close to capacity when we dined, and the service staff made us feel welcome and comfortable.This seems like a wonderful new addition to Uptown and I would certainly go back again."], ["T G.", "We went here for the first time tonight and loved it! everything was so fresh tasting and wonderful. I recommend getting the veggie plate with 7 selections of salad and hummus and then get a kabob combo.  Share both for a delicious dinner for 2.  The grape leaves were terrific as was the lamp kabobs.  Also, very lovely interior decor.  Will go back when we visit Knight Theater or Bechtler Museum."], ["Kevin P.", "This a review for the vegetarian bunch.  This place was fabulous.  We both had the vegetarian entree which was a combo place of many of their sides.  Not only was the food good but the waitstaff was excellent and helpful.  It was shame to see them not busy on a Friday night, but can only claim a low profile location for the reason. Go here before it becomes crowded!!"], ["Tony T.", "While living in London I had developed a serious love for the Turkish/Middle Eastern cuisine that was so prevalent in the city.  Sadly, upon moving back to the Charlotte area my taste buds were devastated by lack of restaurants offering what I was craving. I had seen Levant while walking past it a week or so before it opened, and finally decided to visit during lunch the other day... it was fantastic. I went for my favorite kind of kebab, the kafta, and it was perfect. Perfectly cooked; tender and deliciously seasoned. The sides were great as well, and it was more food than I could handle for lunch.  The only complaint I could make was that the pita bread they brought to the table was served cold. I had seen someone else make the same complaint prior to going, and it certainly would have been nice to have warm slices of pita help shovel the wonderful food into my mouth, but it definitely didn't ruin the meal.I usually never bother to write up a review for restaurants, regardless of how much I love or hate them, but this place was great and I'd love to see them stick around for a long time.  The decor and the service were really nice as well.  The waitress was pleasant and prompt with our order, and the entire place was well decorated with Middle Eastern/Islamic style furniture and art pieces. It was busier than I had expected for lunch time (no wait though), but I'd love to see the place packed out so they don't close up shop early like some new places have a tendency to do. All I'm trying to say here is... this place is pretty f**king awesome. Check it out, I promise you won't be disappointed."], ["Fareeda S.", "I came here for lunch.  Food was awesome- we ordered a lamb shwarma and a rocket shwarma, both super tasty.  Service was great - super FAST!  Perfect for lunch.  Heard they might start up hookah in the summer, which would be a great addition.  Def will come again."], ["Robin B.", "Good food. Great taste/service. Needs more ambiance...kind of boring atmosphere..."], ["Krista M.", "A gem of a restaurant!  Who would have thought that uptown Charlotte would have such a wonderful restaurant in its midst? The food is quite delicious and the decor and subdued lighting set the tone for an elegantly exotic, lush ambiance. The room is cozy with beautiful wall sconces and traditional middle eastern style mirrors on the walls.  The servers are pleasant and paced our courses perfectly.  The menu has an excellent array of choices for meat eaters and vegetarians.  My first course was the lentil soup served with homemade salted pita chips (delish).  I wanted to try a variety of flavors for my entree, so I chose the vegetarian sampler (you get a choice of 7 sides) and it was outstanding, most especially the falafels!!!(amazing).  Ended the lovely meal with a soothing Turkish coffee and split a dessert (name escapes me) that consisted of melted goat cheese topped with a sweet walnut cranberry type spread that was uniquely excellent.  My husband tried the lamb kebobs and various side dishes and also thoroughly enjoyed his meal.  We opted for the Turkish tea (a type of green tea) to accompany our meal but the wine list appeared to have a very nice selection.  Sacha  r doesn't know what she is talking about because everything here is fresh and hating on the pita bread or the falafels is just plain ignorant and obviously someone who has never eaten middle eastern cuisine. The whole vibe was quite relaxing, moderately priced menu, clean, all and all an excellent presentation!"]], "Ilios Noche": [["Linda W.", "So disappointed we chose to take our daughter here tonight to celebrate her birthday. After an hour an a half of watching the two women next to us allow their screaming children to run around and misbehave while they drank wine, I finally said something to the manager. He responded by saying that anyone was welcome in their restaurant. We eat here quite often and I was surprised by his response. I had always thought this was an upscale restaurant. The wait staff is usually impeccably trained but tonight the waitress was new and didn't even know the specials. The food is always good though."], ["Alanna M.", "I dined here with some friends this past weekend.  I have Celiac and one of my friends is 7 months pregnant, so needless to say we had some dietary restrictions.  Not only did they offer a gluten free menu, but our charming waiter was just as accommodating as he was entertaining.  I ended up ordering scallops and potatoes.  My only complaint is that there weren't more of each!  For dessert I had a decadent pistachio chocolate torte.  I already look forward to going back!"], ["Chris A.", "Excellent service over several visits and several different wait staff members.  Great appetizers, drinks and desserts.  This is becoming a \"go to\" spot for us.  Get reservations as it will be close to capacity."], ["Tracy T.", "We had a TERRIBLE mix-up with the too young hostesses in charge of seating (Immediately forgotten after checking in, then told we had never claimed our 7:00 pm reservation).  But Ilios Noche made everything right!We appreciated the sincere apology from the Manager and received top-notch service from our waiter Juan.  The Valentine's menu choices were absolutely delicious (I had the short rib stuffed ravioli appetizer with baby lima beans and Parmesan, my husband devoured the whole lobster with Greek seasonings) as well as the tried and true standards (grilled octopus and sea scallops on cauliflower mash with artichokes and dried cherries). There are so many yummy items that appeal to diners of all ages, you simply must go back again and again to try them all!  I absolutely love their traditional Mediterrean favors with a fun, urban twist!"], ["Anthony H.", "My first visit here with the family for Father's Day and while others in my family enjoyed their meals, I on the other hand had a different experience.  I am not here to knock Ilios Noche, I just didn't have a great experience with my meal.  I ordered the Atlantic Salmon and requested the dish done with a slight sear on the outside.  When the food finally came, the portion was the size of my iPhone, not the best sight I've ever seen but hey it is what it is.When I tasted the salmon it was definitely crunchy and overcooked.  Also, the taste profile of the dish was not to my liking and needless I wasn't pleased. I've read other reviews and there seems to be a consensus on the quality, decor and waitstaff.  So I'll check this off as my bad, however I don't see myself returning for a mediocre experience."], ["Andre B.", "I want to say that Ilios Noche has been open the whole time that I have lived in Charlotte, 9 years and counting. It took me 9 years to make it here and boy am I kicking myself. Head and shoulders, their tzatziki is the best that I've had since moving from Montreal. The perfect combo of garlic, dill and cucumber is on display here and that is just with the dip appetizer.For my main, I chose the veal chop which came with sautéed mushrooms and included a side. I can't begin to tell you how much I like mushrooms, so as my side I got more mushrooms. Other people at the table were drooling over my entree, so I guess that I made a good choice. I didn't try any other entrees, but the salmon, tuna and pasta entrees represented at the table look tasty as well.I will certainly be returning to Ilios Noche with the wife soon."], ["Joel H.", "Great modern twist on classic Greek.  Everything was yummy.  We'll be back."], ["P M.", "We went to Ilios Noche over the weekend and had a great time.The restaurant was busy with lots of laughter in the air.My daughter and her boyfriend were going their on a satty hawkins date (she's 15).My wife and I also went separate to grab a bite at the bar and pay for their meal.We had made reservations for them and they were seated promptly.They had a Great time and were treated like gold..Thanks you so much Ilios Noche.Sometimes teen at nice restaurant dont really get the deserved service.There was a full bar so my wife and I ordered some wine to enjoy in the seating area.We put our name in and were told the wait could be up to 2 hrs...it is what it is at nice restaurants on a Sat. night.I asked for the manager \"Patrick\" to let him know we would be taking care of my daughters bill.He laughed and thought the whole thing was cute.To our delight he was able to get us seated fairly quickly and NOT next to my daughters table.The whole experience was perfect...my daughter and her boyfriend had a Great time...we had a Great meal with first class sevice...AND once again I appreciate that Ilios and the team helped to accommodate our family...What a Rock Star of a manager!!We will certainly be back and would reccomend this restaurant to anyone.The atmosphere is wonderful and the food terriffic.I will say that the thing that put us over the Top was the way the staff made us feel like REAL Guests!Thanks again."], ["Hannah S.", "A little pricey with drinks and all included, but well worth it! On a friday night, they had an awesome band, great service and even better food."], ["Donna L.", "Recently moved back to Charlotte after 6 years away, and our return to Ilios Noche was such a welcome surprise.  We didn't expect it to be even better than we remembered.  Friday night, 6:15 and the place was packed.  Great energy, and our waitress Marie hooked us up.  I wanted to order the spaghetti but she wisely led me in another direction and I was so grateful.  Everything was expertly prepared, the wine complemented the meal, and the  advice from Marie made the evening."], ["France S.", "This review was submitted by my Mother! -I left myself signed in on her iPad. LOLAfter seven years living in Charlotte and always looking for a place that cooks what they say is their specialty, again, the same problem that I've encountered in many other restaurants here in Charlotte, Ilios Noche lived to my personal observation, neither Greek nor Italian, from the appetizer Saganaki, -C, salad $7.50 very small and underdressed, then the entrees came, preparation and visual failed miserably, my husband ordered Moussaka, it was served cold, what a mess, the only thing Greek in that dish was the spelling, I made the mistake in ordering the Greek style pork ribs, wow, the seasoning was so minimal, no enough salt and pepper and a few oregano leaves, it should have been marinated in lemon, olive oil, plenty of garlic and oregano with grated Roma tomatoes and grilled and smothered with in their juice, served on a bed of rice/potatoes and roasted vegetables, no that thing they served me, the portion was enormous, who eat that much meat. I took it home, I have a dog that loves meat and not as informed in world cuisine.  In our way home I stopped in a store for while and when I got back to car the smell was so bad that I thought not even my dog was going to eat it, I was wrong, he is a dog and he ate it, I guess that was the only complimentary critique of this meal, and what I don't understand is, why don't they have salt and pepper shakers on the table, believe me, it may help, then, have their chefs travel, all expenses paid, to Greece for cooking lessons, and then, maybe then, they will deserve to get paid for what they are serving, just saying.....one star for ambience."], ["Kellie K.", "I hadn't been to Ilios Noche since they renovated, but my fella and I decided to go for Sunday brunch.  Their Facebook page, Open Table reservations and Google search page all said they opened at 11:00 a.m. on Sunday, but their website and the brunch menu on their website said 10:00 a.m.  We got there at 10 a.m. on Sunday, and the hours on the outside of the restaurant said they opened at 11:00.  We called from the parking lot to ask what time they really opened, and it took the girl who answered a few minutes to confirm that they did, in fact, open at 10:00.  No wonder we were the only people in there!  Besides that bit of confusion, the breakfast was great.  I loved the new decor; it looks completely different!  The reds, oranges and browns/grays made it feel much cozier than before.  We both got the Ilios breakfast, but I got scrambled eggs and bacon whereas fella got over-well eggs and grilled sausage.  The sausage was almost like a brat - thick and a little spicy.  He loved it, but it was just a smidgen spicy for me for breakfast (but I'm a wimp).  He also loved the fresh-squeezed orange juice.  Talk about going above and beyond!  The breakfast potatoes were out of this world with onions, peppers and garlic.  The panzino toast was uneventful; some jam would've helped, but it was pretty bland on its own.Ilios Noche is a little out of the way for us, but after we got home I read that another location is opening in Quail Corners this spring, which will be much closer to us.  I (and my stomach) can't wait!"], ["Neekosum N.", "Very nice food. Very good service. Excellent experience. Lamb chops and braised lamb are really good. Wine and appetizers are good."], ["Paul C.", "This is a nice Italian/greek sort of place. The decor is nicely done without being over done and the food and service are great. I had a grilled chicken sandwich and mom and sis had salads along with a sort if spinach thinger wraped in filo dough. Sis is mostly vegan and she was happy with it and eats there quite a bit. I'm a confirmed carnivore and I liked it too. So it'll probably do for everyone. It was a little on the expensive side but not outrageous and the food and service were worth it."], ["Matt B.", "Nope. Overpriced and moderate food quality. I've been to Ilios often over the past 7 years, on the last year or so the food quality has declined and prices are up. Service is usually quite good, but staff has lately been light on busy nights and a lot of new faces. The owners focus may be drifting a bit. There are better options close by like 131 Main..."], ["Seema A.", "Great food. Not impressed with Management staff.We walked in around 6p on a Sat. night. Even the hottest uptown restaurants keep a few tables for walk ins. The manager had a bit of an attitude because we were a walk in over the weekend. Get over yourself. This isnt NYC. This is freaking Ballentyne!!The place was packed and we sat at the bar. All the food was pretty good - more tapas style. Meatballs were OK, not great. I did get introduced to a lovely Malbac called Llama from the super friendly bartender.I do like the romantic dim lighting atmosphere here, but the manager turned me off enough to lead me to explore other Mediterranean/greek places to find my fav."], ["Alan W.", "Awesome place awesome food awesome music, what a great place since they expanded. A must place for a night out on Friday or Saturday."], ["Rose S.", "We came late afternoon for a late lunch.  It was fairly empty.  Had a gyro & really enjoyed it.  The fries were golden & crispy."], ["Joe D.", "I know people who like this place, in fact a few of my close friends think this is their favorite place. Me - no. It's not that great. I had a flat bread type pizza for lunch that was covered in some greens - I mean COVERED ! haha. Now I didn't think much of it until I got about half way through - I started thinking to myself - \"Self, is this any better than the flat bread pizza I had the other day at Chili's?\" Well - sadly the answer was \"No self. No self it is not.\"So if you can't do better than Chili's why am I going here? This was the second visit. The other time was not any better. Some people like it though - so you might just be 'one of THOSE' people. haha"], ["Zed N.", "I wish Yelp would allow for multiple ratings on different categories. The food is good, nothing to invite out of town guests but it's a solid 3.5. The service is great. The staff there are consistently friendly and appearance is professional. I'd rate them very high, a solid 4 or higher. I have an issue with management. We've dined here seven times, mostly lunches but a couple of dinners. One three occasions I've actually witnessed management berating their staff, using expletives and gestures that drew much attention from customers. Later I found out that it was the manager and the owner on another occasion. Perhaps in Greece (owner) or France (manager) you can get away with that type of belligerent behavior but this is America. Not only that, it's the South!  Watch your back."]], "Casablanca Cafe": [["Rod O.", "Moroccan Tea is HOT with fresh Mint, sounded great so I order one.  This was good though I do not need to order one next time.Chicken Bastilla ! ! ! The Appetizer was like a Chicken Turnover!  Imagine (and see my photos) pulled Chicken, perfectly flavored sauce, wrapped in thin layers of dough and topped with Powdered Sugar?  Based on this dish the yelp rating is 4.5 stars easily!A lettuce salad was included with the Entree.  This salad was simple Iceberg Lettuce with a good dressing and a very good mixture of toppings!My entree was a Chicken Leg (NOT boneless) in a light Curry with small Olives, served with Potato Fries and Fantastic Bread.  The Curry gets 3.5 stars, the fries get 3 stars and the bread gets 6 yelp stars or at least 5!Tabbouleh is one of my favorite dishes and this one is SUPERB! !! !!! Six yelp stars or at least 5!For Dessert I had Baklava, it was very good 4.65 stars! In case you want to know the Service is Excellent!  The Decor is Totally Moroccan! The Patrons make this place a Lookalota!!!UPDATE Nov. 18 2012They said the Bastilla had to be ordered a day in advance!My Girlfriend and I split the Kabob Platter : Chicken, Beef and Shawerma on top of Saffron Rice!  The Arabian Coffee was better than many Turkish Coffees, very similar!"], ["Sarah W.", "I visited Casablanca Cafe for the first time yesterday evening and was absolutely delighted. The decor was simple Moroccan/Mediterranean prints and patterns, with pillows everywhere - don't let the strip mall location throw you off; the inside of this restaurant is absolutely adorable. The in-house menu is much more extensive than what you'll find online, and is full of traditional Moroccan/Mediterranean dishes seasoned with cumin and saffron spices. (I had the kafta tagine - small beef meatballs served in tomato sauce with peas and onions ... delicious!) And to top it all off, our server was incredibly helpful: at restaurants, I always want to find a dish that can't be easily replicated (by myself or by another restaurant) and so I lean heavily on the wait staff to help me make my decision; our server was very honest about all the dishes on the menu and proffered his opinion which ultimately led to my decision of the tagine and to our decision about the appetizer. At the end of our meal, he recommended a mint-and-honey tea which was a perfect complement to the rest of the evening's food and drink. Highly recommended!!"], ["Brad B.", "Been here a few times for a local book club. Atmosphere is nice and food is good. I'd recommend giving it a try."], ["Mandar V.", "Food maybe delicious... But if you are hungry, don't even think of stopping by here! Too much waiting time... I am concluding after a few number of visits. I am writing this as I wait for my next order gets served!!"], ["Justin D.", "This place has so much potential. What they do well - namely, the couscous, gyros and tagines - they do damn-near perfectly. Where they fall short, improvement would be easy and inexpensive. So, like a middle-school English teacher with a bright but lazy student, I'm simultaneously pleased, annoyed, and yet hopeful for progress.First, the praise. I've tried the baba ganoush just about everywhere in Charlotte you're like to find it. Casablanca Cafe's is easily the best. I simply can't recommend the lamb couscous highly enough. It's truly a thing of beauty; full of big chunks of fresh veggies and a generous size of perfectly seasoned lamb that really does fall off the bone. The French bread they serve with it is a delicious and authentic reminder that Morocco was a French colony until 1956. The tagine is very good and quite authentic, but lacks the vegetables you get in the couscous. For a simple lunch, the beef gyro is fantastic with a creamy garlic sauce. Try it wish their slightly smoky hot sauce. It's called harissa, although the girl at the counter didn't seem to know that. A repeated source of frustration is their continued failure to actually provide what is on the menu. Where a side of grilled vegetables is offered you will have to make due with a decent but unremarkable salad. And don't even bother ordering the Moroccan Symphony (assorted Moroccan pastries). They never have it. Seriously, never. Which is a shame, since the mix of French influence and the Islamic affinity for sweets makes Moroccan pastries some of the best in the world. I've been coming here since it opened about three years ago. At that time it looked like little more than a gutted Subway whose future was yet to be determined. Since then they've made some small efforts to impart some Moroccan style to the dining room. However, dimming the lights, painting the walls a dark color and draping some fabric like a tent to hide those bland and decidedly un-Moroccan ceiling tiles would go a long way to making the place feel much more authentic. Also, as enthralling as those soap-operaesque music videos they play on Arabic MTV are, there must be a better musical option than Egypt's answer to Ricky Martin's \"Shake Your Bon-Bon\". I just don't know what that could be."], ["Jonathan B.", "I've been to Casablanca Cafe at least ten times now. I typically go with a small group of friends in the evening (after dark) and the atmosphere is great for it. I almost always order the crispy chicken plate when I go to Casablanca and at the end of our meal we have hookah. But I'm sure, as my friends agree, the other food is just as good.Staff is very nice and the atmosphere very inviting and relaxing, especially in the evenings. There are a few televisions running Arabic music videos and always some kind of Arabic/Mediterranean beats playing. Highly recommended!"], ["J T.", "My friend and I visited on Saturday Dec 14, 2013. It is a nice cool environment. The waiter was a college student that was very friendly and personable. I order the Casablanca Special Combination (platter of Hummus, Babaghannouj, Tabbouleh, Safron Rice, Chicken Kebab and Beef Kebab) he order something similar but it came with a salad. Overall it was good. The Tabbouleh was fresh but I have had better so I will give it a 3 Star...same with the hummas. The Chicken and Beef were excellent. We also had some sweet tea. It was very good. He said they use rose water....very interesting but made it very good."], ["Charlotte H.", "I wish I had gotten the chance to try their food. My husband and I went to the restaurant at 12:30pm this afternoon for lunch. The cafe still had their open light on but their doors were locked. We peered in the window to see the lights on but no one inside: I assumed the cashier had to use the restroom and temporarily locked the doors. We walked around for a couple minutes and came back to find the door locked again, this time when we looked in the window we saw two staff members looking back at us and then ducked/hid behind their curtains. SO RUDE!I would have been understanding if they left a note on the door, or turned off their open sign, or simply come to the door and told us they were closed. I have worked in restaurants and retail and I have never seen such blatant disregard for potential customers or such rude and childish avoidance! I think I'll stick with Akropolis."], ["chrystal t.", "I quit visiting this place for a while, because the owner opened another location and quality went down in his absence. We went back about a month ago just because it is walking distance, and he was there. He said he decided to close the second location and focus on this one.There have been decoration updates, but most importantly, the food was back on track. I got the chicken bastilla and it was to die for. Didn't get  my usual chicken brochette so can't speak for it- it had really been suffering. Hubby got kefta and agreed that it was as good as before."], ["Hossein A.", "Very delicious kebabs...Enjoyed the Rib steaks a few times. Their Hummus is excellent."], ["Chris K.", "Love this place! I am not as versed in this type of cuisine (middle eastern/mediterranean) as I am with other things but have had enough to write a pretty good review...plus i took my 1/2 lebanese gf that can cook the hell out of this stuff.  Casual dining....they have couches along the walls so it can be very comfortable and \"loungy\" one could say.  Excellent hummus, falafal, shawarma, kabobs.  Touboulleh and baba.... (spelling) is very good as well.  Stuffed grape leaves are ok...definitely had better though. Been here about 4x and had different things each time the food is very good.  Definitely a place to check out if you are new to the type of cuisine or even if you are familiar and want a solid meal."], ["Debbie O.", "Stopped here after shopping at IKEA.   Food was very tastty. The lamb was grilled perfectly, Even the children's chicken was grilled well"], ["Daija P.", "I came to Casablanca for the first time yesterday and it was pretty good I must say! Having lived in the Middle East, this place was a pleasant surprise. I ordered the Casablanca Shrimp Wrap and boyyyy was it spicy! It was good but it opened up my sinuses LOL. I noticed that they offered hookah, but no one seemed to partake. I may come here and try it out sometime in the future. The space is not as big as I expected, but it is quite cozy. I did give a side eye when I asked for sprite and I was given a can and my fork was in a baggie..... o.O. yea lol The only other thing I can add is that the tv's that are on play Arabic music videos. Meh, I guess that adds to the atmosphere...But besides that, no complaints."], ["Sarah K.", "Limited options but the food is solid.We sometimes order and just pick it up, the girl who used to work the register wasn't very friendly but theres a new girl now who is easy to talk to.The kababs are good but not like mama makes. The place always seems empty when I go but there are a lot of regulars."], ["S J.", "I am so sad to write a 2 star review of this place...I wanted to like their food so much! But, there were some problems, that we just couldn't ignore.First of all, it was Saturday night, in Charlotte...now, Charlotte is a restaurant town. No where is empty on the weekends, and I don't think anyone stays home on the weekends for dinner!!! This place was completely empty. We were the only customers the entire time we were there. This is a huge red flag, but when we were done with dinner, we understood.We got the variety plate appetizer. The falafel was nice. Hummus was good. Babaghannouj was pretty good. Their stuffed grape leaves were the best thing we had the entire meal.Hubby and myself both ordered tagine, I got lamb and he got the fish. The fish was fishy...I like fish, but this just wasn't exactly right, and I can't put my finger on where it went wrong. The lamb was tender but dry...I know that sounds strange too!!! But, it was pull apart tender, but there was no moisture, no succulence...it was ok.Our other issue is that we wanted \"authentic\" Moroccan food...If you have ever read any of my other reviews...we really really like different foods.But, when we were ordering the waitress told us that \"authentic\" came with french fries, and the \"american\" style came with rice... This just doesn't seem right to me. But, the rice was nicely cooked and flavored.Sometimes an ethnic restaurant can suffer from trying to stay too true to their roots, and fall short because the ingredients are lacking here in the states.But, sometimes an ethnic restaurant can suffer by trying to americanize their menu...and going way too far.I think this is the problem with Casablanca. With zero customers on a Saturday night, they need to re-think their approach to Moroccan food in Charlotte."], ["John H.", "The lamb tagine was delicious, the rice was great, the baklava was huge and excellent. The only drawbacks were that the server was a bit inattentive and I was dismayed to discover when I got up to pay that the health department rating is only 86 (B)."], ["Brendan O.", "I have been living in Charlotte for the past year and half now and I have been to a large selection of middle eastern/Mediterranean restaurants.  None of which had the same quality food or the friendly staff that I have known to love at CBC.  The chicken is to die for and the atmosphere of the restaurant has a very authentic feel to it.  I go here a lot and also love the fact that they stay open so late.  Wonderful overall!"], ["C D.", "Great place.  Very authentic,  complete with moroccan t.v in background.  The bakalava was amazing!  The burgers were yummy (had a extra spices).  The chicken plate I got came with fresh bread.  We stopped during a long trip.  It was not far at all off of the highway.  It's in a small strip mall and doesn't look like much on outside.  This will definitely be a regular stop for us when we are driving through."], ["Michael C.", "Came here for my birthday lunch. I loved the layout and decor. It was very comfortable. I'm used to small plate dishes in Mediterranean restaurants, and was surprised this place wasn't like that. The meals were fairly large. The food was flavorful and appetizing. I will definitely go back and think its a place that all those interested in Mediterranean or Moroccan cuisine should try."], ["Keith D.", "I had dinner here tonight with an old friend, found the place on Yelp and decided to give it a try.  While it wasn't bad, it could have been a lot better.  They were doing work on a partition (hammers and drills), and the air conditioning was off.  My hummus was bland, although my chicken and steak kebabs were flavorful, the baba genouche was about as bland as the hummus.The best thing was the Moroccoan Mint Tea!  It was delicious!"]], "Caffe Siena": [], "Golden Bakery": [], "Nefelie's": [], "Zoës Kitchen": [["Sporadic W.", "My job has ordered catering from Zoe's twice now and oh my goodness- FRESH, TASTY, HEALTHY & FLAVORFUL.I love the salad with the mixed greens, kalmata olives, cucumbers, grape tomatoes, green peppers and pepperocinis.I love the spinach roll ups- heated or chilled!I love the pita bread- so soft and chewy!I LOVE the mashed potatoes- LOVE them!  Heaven- definitely order those!The rice pilaf is pretty good, but compared to the stuff above- it wasn't as worthy for a second helping. The salad dressing- FLAVOR!!!!  I put it on EVERYTHING!  It's LOVE IN A BOTTLE!The cookies- I didn't even get to try, my co-workers scarfed them up before I got to the meeting and everyone said they were the bomb diggity!!The sweet tea was also gone, I was left to try the unsweetened tea, which tasted like pretty much all of the other unsweetened teas that I've drunk before. One thing that I don't remember seeing on the menu that I would love Zoe's Kitchen to make would be a falafel pita wrap with veggies and fava beans in a bean salad."], ["Rebecca C.", "Talk about eating clean! There's no room for grease on this plate. I ordered the salmon kabob. The entire plate was good. I do like my salmon cooked a little softer (I'm sure I could've requested that) but the veges and side salad made up for the dryness in salmon. I could eat this a few times a week. The food is flavorful and good size portions. My daughter ordered kids chicken rolls with the fruit cup. She's normally picky but finished her plate. Thanks for reading!"], ["Victoria R.", "Fresh off a boxing workout my nephew and I were seeking out undiscovered, casual food spots in the Ballantyne and StoneCrest areas, last night we stopped in Zoes and it was perfect.  Casual, counter-served, yummy mediteranean (did I spell it right) food, tons of healthy options , easy atmosphere and kid-friendly.  The shrimp kabob entree was on point and definitely filling!  For $12 I got the kabob, rice, salad and pita bread which I think is decent.  Would I pay that for a lunch meal, probably not, but it was a good look for post-workout dinner. My heads up to you would be:  The kabobs are indeed grilled so be prepared for some char on the meat, veggie and skewer.  If you're not down for some char, this isn't the kabob place for you."], ["Julia M.", "I stopped in to Zoe's yesterday when I found myself at Blakeney Shopping Center during lunch time. I had originally thought about splurging for lunch next door at 131 Main, but because I needed to get back to the office, decided on getting a take-out from Zoe's instead.  I ordered the Tossed Greek Salad. First off, this thing is huge! Seriously enough for 2 meals... and calorie-wise, it's also 2 meals.It is loaded with feta, black olives, cucumber, a few cherry tomatoes and lots of chicken. It also comes with pasta salad, carmelized onions, red onions, pepperoncini peppers, and a side of pita bread. They are happy to customize it though and will leave off anything that you do not want.  They were pretty busy & told me it would take 10 mins for my takeout to be ready but it was ready sooner than that so that made me happy."], ["Rick D.", "The reason why I am rating 2 stars is that this location has lost so much when it comes to customer service. My family and I would love to come here because the food was great and we always felt like our business was valued. Our most recent visit has taken this place from wanting to exceed our expectations to \"I wish you wouldn't have come in so I can go home early\" attitude. It would be nice if they would smile and make you feel welcome but I would take common courtesy. Instead, we felt like we were a bother and heaven forbid we ask a question, because it was answered with shortness of attitude and a rushed feel. We were the only ones ordering but we were bothering the young lady who took our order. Food was good, we did have to wait for 20 min for 2 salads but with everyone acting miserable to be there, we were just happy to get our food and leave"], ["Foodmaster F.", "Loved everything about it!!! I ordered the side Greek salad and it was big with peppers , Red onions, feta cheese, pepperonciniand i added grilled chicken to it and a side of Greek potato salad. Everything's fresh and delicious. You order at counter, they give you a number to place on your table and they bring it over. They clean up too. So good. I'll be back!"], ["Cassaundra M.", "This restaurant kept popping up in my feed. Very popular by my fellow yelpers so I finally decided to give it a try. I'll just go ahead and add this to the top of my list of healthy restaurants to visit near my job!!! I loved this place! I ordered the Steak Kabob with Greek Side Salad and Vegetables and the Salmon Kabob with Greek Side Salad and Vegetables. I substituted the carbs since i'm on a diet. I ordered both to eat one for lunch and one for dinner. Thats how excited I was to try this place. Best decision I made that day! The Salmon was a bit Charred which I LOVED! Seasoned perfectly with onions. But the steak was the star. I'm not sure what sauce they use to marinade the steak but it was so good I poured the excess over my vegetables. The greek salad was nice and fresh. I wasn't that impressed with the dressing. It was a bit bland for me. But with a pinch of salt it shined! I can't wait to return to try the rollups and the shrimp kabob which seems to have really good reviews. After my favorite healthy alternative in Ballantyne recently closed, i'm so happy I found this Zoe's!"], ["Janet B.", "Love this place and the staff, can not speak highly enough of this place or the people who work here,  The food is some of the freshest I have ever gotten out at a restaurant...  The salad is huge and is delish, I had the Quinoa Salad, & i can not rave about this enough...  My Son got the steak kabob & it was cooked to perfection, His Girlfriend got the Greek chicken pita & loved it... We also got the Hummus trio which made our meals perfect...  Did I mention how wonderful the staff is? If so it bears repeating, never seen people who are happier to be serving others... Great place!!!"], ["Terri M.", "We absolutely love eating here. The food is healthy, fresh, and most importantly it tastes good. The salad dressing they make is some of the best I've ever had and we always keep a bottle of it at home for our salads. The service is great...fast and friendly. They have outdoor seating which is always nice on a pretty day.  If you have children you won't have any problems finding things on the menu that they will want as well!"], ["Candyce B.", "I like the concept for Zoes Kitchen. Basically it's healthy Mediterranean and Greek cuisine...FAST. But I've got to agree with previous reviews, this place stays super busy. I visited on a Saturday afternoon (I know, I know...I should expect it to be busy) and this place practically had a line out the door when I walked in and still had one as I was leaving. So just prepare yourself... But you can always use that extra waiting time to review the menu. You will need it, because the menu is massive. Which in the case is a good thing because they offered tons of choices including pitas, sandwiches, kabobs, and salads.I decided to go with the Chicken Roll Ups with a Greek salad. After you order, they give you a number and bring out your food to your table. I appreciate that they keep the Greek dressing on the table. That way you can use as much (or little) as you like. I was surprised that even though they were busy, it didn't take long for my food to arrive:Chicken Rolls Ups: They come stuffed with chicken, caramelized onions, feta and a dipping sauce. I really enjoyed them. I added some of that yummy Greek Dressing and used the dipping sauce and they were delish either way. I just wish they included a little more feta cheese. But I'd definitely order them again.  Greek Salad: It comes with feta, olives, peppers, onions and tomatoes (none for me). They also throw in a side of pita bread. Classic flavors here folks. Really fresh and tasty, especially with their Greek dressing. Yum. I'm looking forward to trying more of the menu items. I hear the kabobs, pasta salad (without mayo) and humus are divine!"], ["Kristen M.", "One of my favorite places to go for lunch. The food is always great but it is definitely always crowded."], ["Brian F.", "My chicken entree came with a piece of chicken that was no more than four ounces.  I ate it in five bites.  The entree included more orzo than one person can eat and not enough sauce to cover it.  Less pasta, more chicken please.  Salad was good."], ["Mia M.", "Pretty crowded! U will be surrounded by lots of kids and mummies at weekends! Not the place I would like."], ["Hania A.", "FRESH!!!!!!!!!!   Some good Mediterranean food on the go.  My favorite is the quinoa salad with chicken kabob...healthy and delicious.  The hummus appetizer is delicious as well, great to share before your meal comes out."], ["Mike S.", "Great sandwich! I got the chicken salad sandwich with the red potato salad. Relatively inexpensive for the area, with a decent amount of outdoor seating."], ["Tom R.", "This place has really good food service is good & the food is very good.I would recommend this place for a couple or family the parking is not great."], ["Miranda B.", "I downloaded this app and made an account just to write a review for this place. The only time I will ever go back to zoes kitchen is to pick up the refund that they owe me. Today was my last time in there due to terrible service. I got home and my order was wrong for the fifth time with them. I honestly can't believe that it's even possible to get someone's order wrong that many times. It's a shame because when my order is correct the food is excellent. Sigh... If someone from zoes kitchen sees this you need to sit down with your team and let them know that just because an order is to-go that doesn't mean don't pay attention or care about what you are doing. Unfortunately, I won't be back. Sincerely, -Person that drove 15 minutes to get an incorrect order (5 times)"], ["Haeyon L.", "I've drove past Zoes kitchen a gazillion times, and have never noticed it. How? I have no idea.  Thank goodness for my sister's friends' recommendation to try this little place out! Zoes kitchen is a cute little restaurant where you order as soon as you walk in and they bring your food out to your seat - much like other places such as Noodles and Co. or McAlisters.  They have plenty of options to choose from.  I'm definitely not a Greek food junkie, as I usually run the other way when I hear 'GREEK FOOD', but I was very pleased with the taste and quality of my meal.  I had the Greek Chicken Pita with feta cheese left off and pasta salad as my side item.  The chicken was dry but from past experience, I just assume that Greek chicken is cooked that way.  The flavor was really light and tasty - perfect for brunch - but the portion was enough to make me extremely full.  The pita bread was on point. The pasta salad was delicious despite the fact that it had feta cheese all over it.  It almost made me regret keeping the feta off of my pita. All of this food for just 8$? I'd go back ANY day. My only quibble is that there wasn't a ton of seating inside.  It was noon on a Saturday, so it was pretty busy.  We got lucky and found a seat right away but it was dirty until the waitress came and wiped it down for us.  If you don't want to be an unlucky customer with no table to sit down at, definitely try to go at a different time! Otherwise, awesome food, awesome prices. Get the pasta salad. Don't leave off the feta cheese."], ["Pete C.", "I love Zoe's! But don't try to go here in the middle of lunch hour. By 12:30 all the tables inside and out are filled and there's a line out the door.But should you be one of those lucky ones who can go to lunch at 11:30 then it's a perfect place for lunch. The food is good, reasonably priced and fresh. There is low calorie fare as well as some items that have a little more than you would like but who cares it's your day off counting calories anyway.The Steak roll-ups and chicken roll-ups are my favorite but having just tried the kabobs I think that's about to change.One thing to remember is that if you have a smart phone, join the club, take a picture of every receipt you have from a meal there and they will e-mail you a coupon for something. Usually it's a soda or chips or a side salad, but the other day it was for 1 free entree . . . and that steak kabob was mine."], ["Kelly C.", "I love Zoe's.  I always get the same thing.  But it is always delicious.  Zoe's is always clean and a pleasant place to eat for lunch.  If you're stopping by at peak lunch hours though, it might be best to call ahead - they have a separate line for pickups, and it's always much faster.  Chicken roll ups with mozzarella instead of feta and no tomatoes, please."], ["Shannon H.", "This is a kinda Greek place that serves a nice selection of somewhat healthy foods. I wished they had actually called the dishes their real Greeks names (ie: gyros, souvlaki) but they have to appeal to Southerners who aren't always up for weird words. (gyros = yeee roes).Anyways, we had the hummus and salad plate which was very good. The chicken roll ups were nice and warm with a definite Greek flavor, the shrimp kebabs were entirely too spicy, though. My 11 year old loves spicy so he ordered these knowing it would be a little hot. They were scorching hot. I wish they would've noticed that a kid was ordering this and said something. The \"pick 2\" that my 16 year old got was less successful. He opted for the cookie side dish -other choices were salad, fruit, dessert or hummus which is a nice selection - but his sandwich was TINY and the cookie didn't round out the meal much by making it full-size. Go for a bigger side dish unless you aren't that hungry! My one complaint was the pita. It's very good here, warm little triangular pieces served with the meal and with the hummus, but they don't give you enough! There was easily a half cup of hummus on my salad plate but only 4 triangles which was probably the size of a small pita or even half of a larger one. I asked for more when I went inside (we ate on the patio which was nice) and the girl there seemed baffled. They should be throwing this stuff around left and right because it is dirt cheap, calls out for hummus and a drink and really makes for a well-rounded looking meal. So, I said we had too much hummus left and needed more pita. She brought out...4 triangles. We actually laughed because these things are about the size of one Doritos chip. Oh, well. It was tasty, at least!The bill came to $35 for 2 meals,1 half sandwich and cookie and 1 hummus and salad plate. Not expensive but not cheap. Healthy and fresh and nicely different. Good for kids, too!"], ["Sarah M.", "I love Zoe's! The food is great and the service is very friendly. The protein plate never disappoints!"], ["Gus S.", "I come here about once a week. The chicken kebobs are great, and the roll-ups (steak, chicken, or spinach) are terrific. Most items on the menu are lower-cal, so this is a great place for those who are counting calories."], ["Amanda G.", "Great healthy and fresh food. I love the salmon kabobs with roasted veggies and humus."], ["Ryan B.", "Without a doubt, the friendliest service around. The people who work here are young, professional and very socialble. Btw food is great too."], ["Jeanne F.", "I have had Zoe's cater for several business lunches and the food is always a rave review by guests.  Much better than Jason's  Deli, and healthier choices too."], ["Winston C.", "It's a healthy, simple and unique menu.  Food is fresh and prices are reasonable."]], "Le Kebab Grill": [["Maddie M.", "I wish I lived closer to this place because I'd eat here every day!My favorite here is the gyro wrap and the chicken shawarma platter. Somehow the chicken shawarma platter and sandwich taste different but are both equally good! They also have some delicious rice plates as well. The other dish I absolutely love is their tabouleh salad. Ask for pita with it, the combination is yummy!The restaurant itself is very cute and cozy with outdoor seating if you want to sit out. Plenty of parking available too. Be careful with directions on google maps because the location is incorrect on there. This place is next to Jimmy John's. They also have hookah, although I've never tried it here."], ["Sam S.", "Been here a few times and all positive. For everyday meals the mixed kabab and shawarmma are amazing. For the shawarmma it's probably the best I've ever had. Seriously puts my brother's overseas to shame. If you come on a Friday get the mansaf. Won't be disappointed."], ["Tameka G.", "My love and I decided to come and give this place a try for dinner.The atmosphere there is calm and casual and the staff is nice and helpful as well.I ordered the chicken kabobs with rice pilaf and steamed veggies. It also came with a little bit of garlic sauce ( wish it was more sauce). The food was pretty good the chicken could of been a little more tender.My love had the falafel pita and some lentil soup. He loved the pita so much he went back the next night to get another one. I also tried it, it was pretty good and the portion was a good size.We would more than likely go back again!"], ["Lisa N.", "Awesome!!!!That is all....I love tasting food from other cultures and I have just at started eating Mediterranean cuisine. This place is awesome!!!"], ["Jennifer L.", "Very authentic and great flavor.  We found this restaurant via Yelp, and were very pleased with what we found.  There was a great atmosphere, with cultural decorations and music playing.  The food (appetizers, drinks, entree and dessert) was all phenomenal.  My fiance hadn't had Greek food previously, and it won him over.  We had a pick your own appetizer, where you picked three of five items.  Then we shared the entree of three different kebabs over rice with a side.  We had baklava for dessert.  Everything was excellent.  My favorite was the beef kebab, which is saying something since I am mostly vegetarian these days."], ["Tom W.", "The chicken shawarma is on point! Really good food, gets busy so service takes a little bit but well worth it!!"], ["Jonnny W.", "Amazing food. The gyro plate and falafel are on point and surprisingly they have some AMAZING fries."], ["Abby L.", "Everything was very tasty.  A little on the expensive side.  I got babaganoush and I really enjoyed it. The service was a bit slow, as I was on a time limit and in for lunch.  I would go back again to try more things."], ["Rolando V.", "The food is Delicious!  Best Mediterranean restaurant I have been to. The menu has a lot of variety. The employees make it that much better."], ["BJ W.", "Well... I was seated quickly but didn't get served til 15 minutes later. The server looked our way several times but didn't come. Finally I had to ask another server who our server was and she had to tell him, TWICE about his table. Service right now is what dropped the rating. My friend that was with me had orange and black specks in his water and I had black specks in my tea. Had to get another server to fix our drinks because our server was, once again! no where to be found. The price is great. And from the looks of everyone else's plate since I still haven't gotten mine after about 30 mins, I can't tell you how it tastes.As I look around... I see that those around were served quickly, while friend and I, whom are African American, we're not waited on as quicky. Very disappointing. I may venture to Bread and Kabob from now on."], ["Kellie K.", "The only thing better than the food - which was delicious - was the service. The fella and I stopped in for lunch on a Tuesday around 11:45, and by noon, the place was hopping. And our waiter was just about the nicest, friendliest, smile-ist person I've ever met. Maybe because he eats there all the time and it makes you happy?I got the kofta (beef and lamb) kebabs, and the fella got the chicken kebabs. We were just boring enough to get the same two sides, too - rice pilaf and steamed veggies. He liked my meat better than his, and I liked his meat better than mine, so we gave each other one of our two kebabs. His chicken sauce was like a spicy, Crisco, and my sauce was tzatziki but a little thinner than I'm used to. The rice was almost sweet... and I ate almost all of it.All of that was only $21 (we both got waters), and the service can't be beat. Awesome place!"], ["Chelsea Ellen A.", "Glad to see this place is thriving!!I used to come here for hookah and baklava back in my undergrad days. This opened in the old Yoshi's Grill location by Jimmy Johns in the University area. It's my favorite Mediterranean place in the area."], ["David H.", "A-OK is a rating that makes this place worth visiting.  I don't know what I was expecting, but I was with a friend and had to hurry up and eat to get to another engagement.I wanted more, either more portion, more of a particular sauce, and/or more of a particular flavor.  I can't put my finger on it but I think this place has 5 stars hidden in it with a particular tweak.  I wish I had the inspiration to let you and the owners know what to do, but this is why I don't run a 5 star restaurant, that and I don't have a passion for running a restaurant.My advice is to try this place out without expecting too much, and also don't have a lot riding on the event.  Such as a critical second date with someone you really like.  I might recommend going with some laid back people that like everything.  Then you can try multiple dishes and figure out the solution to me ennui with regard to Le Kebab.3 Stars from me is still a good rating, if you look at my profile I am not stingy with the 1s and 2s, not because I am crabby but because I try a lot of places once that in hindsight you should try zero times.  This is not a try zero times place."], ["Tejus P.", "I was in the area and this place popped up as one of the top Mediterranean spots in town, so I rushed over knowing how much I loved lamb over rice and shwarmas. My experience was not as good as I was hoping, but it wasn't necessarily bad either. Service: Service was good, but understaffed as it was extremely busy. The servers are extremely nice and have great knowledge of the menu. They'll make a custom order with just about anything without really breaking a sweat.Food:Here's where I got some disappointments. I ordered the lamb over rice with a lentil soup * Falafels. The falafels were pretty good, the soup not so much, with the lamb being fairly dry. I got some garlic sauce on the side which really brought out the flavor of the lamb over rice. However, if I didn't order it regularly from other Mediterranean places, I would've been really disappointed with me meal.Venue:Very nice venue that seats a surprisingly large amount of people (even if it does look small). Extremely clean with plenty of room, has a very charlotte-esque feel.Overall, I believe this place is extremely overhyped, maybe because there's a lack of good Mediterranean food around the area. Overall, I might come back but only to try a sandwich."], ["Jeremiah N.", "Stopped in for a quick lunch with my wife.  Staff was very attentive and welcoming.  When they heard it was our first time eating there, they gave us small samples of the hummus, baba ganoush, chicken shawarma, and falafel.  All of the samples were really good.  We ordered the dinner with three kebabs: chicken, steak, and kafta.... All of them were awesome!  The rice was great as well.  Also got a chicken wrap and a falafel wrap.... Highly recommend this place."], ["Belle G.", "This is a cozy little casual place that doesn't skimp on the portions!I got the grilled chicken kebab with rice and a Greek salad. The rice was flavorful and the salad was full of feta and red onion - just how I like it! The kebab was delicious - perfectly spiced and tender. My dinner companion had the Philly cheesesteak, which he enjoyed, and the chicken shawarma pita, which he said was not great - the pita was hard. The baklava was very disappointing. For my second visit, I recommended this place to a group. It took a long time for us to receive our food. But everyone thought it was delicious! I'll be back!"], ["Chris S.", "We were in the University area looking for something to eat a bit later than usual. A quick Siri search offered several options, but this seemed like a good choice.We arrived to find the atmosphere nice and the place busy, even at about 9pm. The clientele seemed to be the types interested in something authentic. Plus, in the University area, they were expecting a good deal.We started with the falafel appetizer, and we both really enjoyed it. Very tasty.My wife ordered the mixed kebab - three kebabs on rice with mixed veggies. I ordered the Turkish kebab with the rice and the lentil soup. We both highly recommend the soup. It was delicious, and we'll be making it ourselves in the future.The kebabs were all cooked very well. Seasoned and spiced very well, and very tasty. The rice was light and very flavorful. The only miss of the meal were the mixed veggies - apparently a nod to western tastes. Avoid them and get something that comes from the Mediterranean. The service was pleasant, and the place stayed busy. Overall, this is the best kebab/Mediterranean meal we've had in Charlotte, and we highly recommend it."], ["Mike K.", "The food at Le Kebab Grill is great! Everything tastes extremely fresh. Appetizers - The hummus is absolutely delicious! Lots of fresh soft pita bread. If you love hummus there is really no comparison when you get delicious fresh made hummus versus the stuff you get at the store. Lunch Special - You can get a skewer and two sides for a reasonable price. I usually opt for the kofta skewer, lentil soup and a salad. The lentil soup is very good. The salad comes with a delicious oil and lemon juice dressing that is very light and fresh. I have also had the gyro wrap and french fries. The gyro wrap is very good, the meat is soft and tender. The fries are crinkle cut. Service seems to be hit or miss here. Some of the servers are extremely friendly and helpful. Other times you get a server who seems like they just walked in off the street and aren't really sure what's going on. Also some servers are very good about timing what comes out when with your order and others not so much. Today our waitress was awful. Only came to one side of the table and asked us to pass food and pass our glasses for her to refill. It just was bizarre, like she didn't realize she could walk around to the side of the table. She also brought out french fries about 10 mins before our entrees. One take away when you look around at other patrons in a restaurant is if the ethnicity of the food they're serving matches that of the patrons - when I visit this restaurant there are always middle eastern patrons. This tells me that the food must be pretty authentic and GOOD!"], ["Soheil Y.", "This place is one of the best mediteranian restaurants I've been to in US and definitely the best in university area. Food quality and quantity are both reasonable. Good variety of dishes. I've tried almost all the items on their menu and I really can't say which one I didn't like!The staff are nice and friendly. The only catch is that the tables are a little bit sticky sometimes, although they have been cleaned. It's probably because they use only damp cloth to clean them and leave them wet."], ["Bob B.", "Fantastic and authentic Middle Eastern Food! The Lamb Swarma was tender and flavorful, chicken was good but lamb the star! The Kibbeh and Meat Pie were really great and the kebabs were grilled perfectly! Overall great food!"], ["Maegan G.", "I have no clue what half the menu items are nor how to pronounce them, but the folks here are so nice and helpful that it's never been a problem. And omgosh everything is delicious! Even the picky kids like it here. We normally order take out, which sometimes takes a while to prepare, but that just lets me know it's freshly cooked. Love this place!"], ["Lauren P.", "The server was really friendly and the food was really good.  We shared the falafels, grape leaves, baba ghanoush, tabouleh salad, hummus, and greek salad.  The falafels were so good and the grape leaves were my favorite.  I would definitely go back and recommend to those looking for a healthy/vegetarian option in the University area."], ["Monica M.", "I got lamb and only lamb.  Plenty of meat and plenty of rice.  Really enjoyed the spicy sauce.  Could use more spicy sauce.Friend came with but they don't eat dairy, including butter.  That only left about three appetizers as possible food options.  Not a good stop for the dairy free crowd.  You can't get items sans dairy, they can't prep special for you.  You eat hummus or olive paste or not at all."], ["Tran N.", "My friend had been saying he loved this place so I decided to check it out. At first I was confused what to do when I walked in because there were a lot of coworkers in the front who were trying to tell me that I could sit anywhere. They seemed to be overstaffed and the waiters and waitresses spoke so softly that I could barely hear them. Despite that the environment was nice. There are a lot of cheap options on the menu and they give you a big proportion! The hummus is amazing!!! You have to try! I don't usually like hummus, but this one is a must. I believe I got shawarma chicken with the yellow rice. It was very filling and the white sauce that come with it makes it taste even better. I got a salad as the side, but the dressing was a bit too much. I couldn't even eat more than two bites of the salad because of that. Besides the salad, I would recommend eating everything! Its amazing! Trust me. I'm not a big Mediterranean person but somehow this place got me."], ["Rodel T.", "When we're in the area we always come to this place. Food tastes fresh. I recommend to anyone that like Mediterranean food. I do recommend to have more meat than rice. But over all food is great. Price is ok."], ["Kristine A.", "First time here and the food was great and the service was as well!  Will definitely go back again and again!"], ["Joseph V.", "Absolutely fantastic.  Truly incredible.  The service was quick and fast.  The food spoke for itself. I got a Gyro.  The lettuce, tomatoes, onions were all fresh.  The lamb was very good.   The taziki sauce was delicious.  The pita was fresh and soft as well.  I wish that this place was closer to where I lived, because I wouldn't definitely come often."], ["Paul C.", "First time here....always looking for good places before my French language classes up in the University Area. And it won't be my last time!Started with the Falaffel balls, with a delicious Tahini sauce. Very tasty and well seasoned. Due to the Yelp reviews, I tried the Lamb Shawarma which came with 2 sides, so I opted for their very delicious Lentil Soup (everyone who reviewed this was indeed correct - YUMMY) and the yellow basmati rice. The lamb didn't have any \"funk\" in it that it CAN have (at less than reputable establishments) and it was very delicious. A little \"odd\" in that they were small strips and not \"Greek Gyro-like\" in thicker strips....but boy do they give you a LOT of it. My only criticism is that the tahini sauce, which was the same they served with the Falaffel, didn't seem to go with the Lamb. A yogurt based sauce (like Tzatziki) would go better with the Lamb. But the lamb itself was delicious by itself.And just because I'm a Hummus Junkie, I had to leave with a side of their Hummus. I had it for breakfast the next day and it was very good! I'd personally like a tad more garlic in it but hey, it was very creamy and delicious.Oh, the staff and my server were all SUPER nice and friendly, and made sure my experience was a great one. It was. And when she found out it was my first time there, she threw in a Baklava for free. And it was very yummy as well!Overall a really great place for Simple but DELICIOUS Mediterranean food. Definitely a place to check out! For those of you on the South Side of Charlotte (like me), check out Jasmine Grill on South Blvd, which is just as good if not better than Le Kebob!"], ["Vanessa S.", "Awesome food and great atmosphere. The chicken kebab pita was very flavorful and filling. Hummus was excellent too."], ["Dave W.", "Simply awesome. Ate here 2 times in 3 days. If it was closer I would eat here probably every other day. It's that good."], ["Allen H.", "Let's get to the point. Food and price was excellent. Quite different. About a month ago, my girlfriend and I went there during lunch time at noon and it seemed pretty busy so while taking our time, we felt rushed, even though it was our first time there and was deciding what to order. The table we had was really small to where we better finish our appetizer before our entree gets there or we'll have no space to put them; the place itself was pretty packed in and tight. Definitely worth trying but do pick a good time to go in to eat. P.S. Now to the single men out there, there's a beautiful hostess who works there so put your game on and see if she's single."], ["Nick H.", "An amazing middle eastern experience. Perfectly done cuisine.  The falafel were the best I've ever had, they were insane.  I ate like a glutton. Had some hummus some grape leaves, lamb shawarma.  Everything made you crave even more. Make sure you save room for dessert.  Their baklava will make your knees buckle. They dust the pastry with pistachio crumbles!!!!!  BEST EEVVVAAA"], ["Peter M.", "Visited today with a colleague and was treated to a great lunch.  We chose the sampler appetizer (liked the warm grape leaves), lamb shank and triple kabob entrees.  All were delivered promptly and piping hot--they also tasted very well, too.  Our server was friendly, quick and efficient.  Good local find with some nice selections.  I'll be back!"], ["Ashley S.", "Ordered take out once. It was good. Will try it in person again."], ["Gary C.", "Had lunch and it was ok. I lived in the Middle East and I know what Arabic food should taste like, so I am particular. I would go back again."], ["Ani D.", "This place is fantastic! We were served by a husband and wife team who were so pleasant. I asked our waiter for a suggestion and he said his favorite was the grilled chicken. I am so glad I went with that choice. It was delicious!  This place made me slow down and just enjoy the atmosphere and the food. My husband and kids really like it as well!"], ["Cynthia G.", "I just got an absolutely five-star takeout lunch from these guys. (Or really more like 2 lunches because their portions are humongous, be warned). I hadn't been over for a while and the menu has changed quite a bit. Today they had a special on that was a very rich Jordanian dish, lamb with yogurt sauce. They were very funny and pretty much required me to try a sample to taste because they thought it was something I would not be familiar with and therefore I might not like it. But, with lamb and yogurt you basically can not go wrong. It smelled fantastic. The lamb was nicely cooked and the sauce managed to be creamy and tangy, almost lemony, at the same time. Now I want to come back and try all the specials."], ["Sujith R.", "Really nice Mediterranean food !! I love their lamb shanks and knaffe. The servers are really nice and so is the owner /manager. He comes to every table to check if everything is good. The rice that they use is high quality basmati. Very tasty. Knaffe is worth dying for."], ["Chelia S.", "THE PLACE to go for FRESH falafels! OMGosh they do it right! I am a newly-aware falafel freak and ever since I have made the discovery, this has been my go-to place for Mediterranean food. I have had other dishes Here including chicken kabob, falafel wrap, falafel appetizer, geek salad...I recommend trying it all.I have yet to dine in here, but the times that I have gone the staff is always nice and the restaurant seems very clean. It will vary greatly with the potential language-barrier with some of the staff, but in the end They are very accommodating. It has indoor and outdoor seating. The outdoor seating isn't on an enclosed patio so be prepared to be just kind of out there on the sidewalk. But it's cool :-)They do take quite a long time if placing a carry-out, for obvious reasons (freshness perhaps) so I do recommend calling way ahead. The parking lot is usually the devil, but that is the least of a concern. It's certainly worth wiggling in and out of the awkward, Always-packed lot!"], ["Amy P.", "Clean, casual and friendly atmosphere with wonderful customer service! Oh yeah and the FOOD!! The most authentic Middle Eastern food I have eaten since visiting Jordan and Lebanon. Everything on the menu that I have tried has been fresh and excellent. Nothing frozen here. Staff is happy to recommend their favorite dishes. The staff is always so welcoming and friendly. I plan to eat here often!"]], "Ilios Noche Quail Co": [["Adam F.", "It's hard to give a place five stars after one meal. This is one of those places. I can't wait to go back and try other menu items. Highlights: Food was the star of the night. Service and ambience a close second. Waiting to head to the Charlotte Film Festival on a cold and rainy night, I stumbled upon this place on Yelp & decided to give it a go. I was quickly seated on a Friday night at 8p. The menu overwhelms the mind a bit, as it has many traditional Mediterranean centerpieces, a good amount of seafood choices, and a handful of other entrees and sides (such as pizza and lasagna).I began with the falafel appetizer, and it did not disappoint. 4 perfectly fried balls of goodness, swimming in a shallow pool of some of the best tzatziki sauce I've ingested. I lived in the LA area for 10 years, and this was one of the top 3 falafels I've ever experienced.As for the entree, I asked my waiter, Daniel, his recommendation, and without hesitation, he suggested the Lamb 'Youvetsi Me Manestra'. It is described as \"slow braised lamb shank, tomato shallot orzo, mizithra cheese.\" Wow. Just, wow. It was very close to a perfect dish. The lamb was tender and fell apart as the mizithra cheese slowly melted into each bite, adding another layer of flavor. Spices were mixed in well, and the perfectly cooked orzo complimented each bite . It was a good sized portion, but I had to finish it. It was one of those meals you didn't want to end.Do yourself a favor and give Ilios Noche a try. Date night, anniversary, or just after a long week of work, this is the kind of restaurant that deserves to be celebrated."], ["Kia T.", "I came here for brunch and I wasn't impressed by their brunch menu. It lacks depth and creative choices for brunch options. There were three fritattas and some omelet options and of course waffles and pancakes. I was just searching for something more creative.  It was a little heavier on the lunch side than brunch. I got the chicken and waffle sandwich. I had issues with it and had to send it back. I'm not one for sending food back unless it's just wrong. The chicken wasn't well seasoned and desperately needed some salt.  The waffles were rock hard, you could Crack a tooth on them. I was with a large party and 3 of us hard waffles and we sent them all back. Both times my sandwich didn't have the honey&hot sauce and ligonberry jam on it as described on the menu. When I asked about the jam, no one seemed to know or realized that the jam was supposed to be on the sandwich. And I never did get the honey & hot sauce combo. The Greek fries were great. I actually paired them with their homemade tzatziki sauce, which I was charged $1 extra for a small ramekin of. If I come back here, I will try dinner and not brunch. Maybe their dinner dishes are winners. Fingers crossed!"], ["Gideon R.", "Ilios Noche has a great menu! I start with the Musclun Salad, which has candied walnuts and blue cheese. Their falafel is out of this world. I always think about getting a second order. I also like to have the broccolini. I enjoy sitting outside and listening to the music. Ilios Noche is my 'go to' restaurant for a healthy, relaxing meal!"], ["Nina P.", "Brunch on Sunday absolutely delicious! The spinach pie to start was warm and tasty! The lamb burger was so good! Really fresh, tons of flavor! Defiantly would recommend this place! Next time we're in town we will come back, so much more on the menu to try!"], ["Kristen M.", "OMG!! All Around Superb!!I had never heard of this place before, but had received a coupon for a free appetizer and went for brunch. The service was excellent, our waitress Anna G was on top of everything! She brought our drinks right at noon (Sunday), continuously checked on us and made us feel very comfortable. The manager stopped over a few times too to see how everything was going and was pleasantly friendly. The food was delicious and came out pipping hot! The app we got was the Zucchini and Eggplant Chips - SO SCRUMPTIOUS!! The poached eggs were cooked to perfection and the drinks were splendid!Best tip about this place: Large portions!! for everything, even the sides that come with the entrees are huge portions."], ["Marshal C.", "Absolutely shocked!   This place, for a strip mall, is so AWESOME!   Let me tell you about my experience.  We made a reso on Open Table for 7:30p.  We were seated at 7:25p.  The decor is very classy and yet has a rugged cabin feel to it.  It is very cozy!   The food was great.  I tried the pork ribs, and they were good but not as good as I would have imagined.  The slaw and flash fried potatoes that came with the ribs were OUT OF THIS WORLD amazing.  The taste of four appetizer was WOAH, drop your iPhone AMAZING. There was smoked eggplant dip, Greek cucumber dip, hummus, and a tomato based dip with EXCELLENT pita bread.  The waitstaff were VERY knowledgeable about every aspect of the menu.  There were a lot of managers zipping around making sure the guests were well taken care of.  We asked for custom drinks that were not even on the menu, and they were made by the bartender to PERFECTION. The melon vodka martini we asked for was SO fresh.  The bathroom was super clean and well kept.  Seating options are numerous and the almost every space was occupied by happy people enjoying their Greek food.  I would definitely come here again.  Be aware that parking can be difficult, but that was the only issue I could find with my entire experience!!  Happy eating."], ["Meck G.", "It's been about three weeks, but I do remember the food was great.  I had a lamb burger with goat cheese that was awesome."], ["Marco F.", "We came here the other night for dinner and boy was I impressed by this place. Start to finish this place is 5 STARS..!!! The entire experience was absolutely PHENOMENAL..!! By the time I arrived my buddy Paul had a dip platter waiting - hummus, tsatziki, eggplant & roasted pepper. It came with a bunch of pita bread -- All 4 were delicious.I then ordered the pork belly sandwich.... I repeat, PORK BELLY sandwich...!!!! As many of you know, the belly is the pigs greatest culinary gift. It came served on pita bread and came with red onion, tomato, lettuce & tsatziki. I can't even put to words how delicious this sandwich was. It was just AMAZING...!!Allyson had the moussaka. It was enough for Paul and I to sample and she had plenty left to take home. I've had moussaka at Greek restaurants all over the country and this is one of the BEST I've ever had. We ate outside on the patio and as the night went on, it got a little chilly. Our server came over and as soon as we mentioned it was getting cold he turned on two heat lamps for us right away -- He was extremely attentive. In fact, the service provided by the entire staff there was beyond anything I could have possible expected or asked for. I can't wait to go back...I'm sure that the only problem for me will be deciding on what to order.This place is truly a hidden gem in the far corner of a strip mall. I HIGHLY recommend ilios noche quail co..!! Don't underestimate it.. Give this place a try next time you are in the area!"], ["Phil L.", "This place is a great dinner spot for south Charlotte without driving towards the city. They have quite a large menu with choices from traditional Greek dishes to other dishes with Greek touches (pizzas, pastas). I had one of the pasta dishes which tasted great and everyone else in my group wanted to try. The decor of the place is very stylish. Rustic but very classy and updated. Think Restoration Hardware. Great setting to have cocktails, which were very well made also.The one tough part is parking. The lot fills up very quickly at dinner time and we had to park by Harris Teeter. Consider making a reservation for peak times- the waiting area was quite crowded but we didn't have to wait having made one."], ["Charles M.", "My dad and I went here one night and one of the best Mediterranean places I have ever been to. All the ingredients were so fresh and prepared wonderfully. I am definitely looking forward to my next visit here. A little pricey but the quality is on par with the price.We started with the Roasted Red Pepper 'Htipiti': barrel-aged feta, chili pepper, arbequina olive oil. Awesome spread to begin the meal.Then we split the LAMB 'Youvetsi Me Manestra' slow braised lamb shank,tomato shallot orzo, mizithra cheese. And the PAN ROASTED CORVINA greek risotto cake, grilled ratatouille vegetables, aged balsamic. Hard to say which one was better both blasting with flavor the lamb was so tender and the corvina was moist.Next time you're in the mood for some Mediterranean can't go wrong here."], ["Arlean Z.", "OMG!!! An amazing food experience!! Phillip was our waiter with great suggestions. We had the fried calamari as appetizer, the signature lamb dish and risotto Parmesan. The ambiance, service and food 5 stars. Definitely a must for fine dining."], ["Armando A.", "This is our new goto, Friday night, hard day at work, need a good meal and a drink place. Food is great and our waitress Ariana (I'm sorry if I'm way off) was amazing. I'm sure she would have been even better if my 6 month son wouldn't stop flirting with her. Almost every waiter took the time out to stop and play with him which actually gives us time to eat. That alone makes it well worth it. I'm a sucker for customer service and this place has it."], ["Noel L.", "What a swanky little place for a strip mall.  Really cool decor....rustic and modern.  The cocktails were pretty good....and they had a nice bar area.  The food was EXCELLENT!  I had the Grecian Pork Ribs with Greek Potatoes and Slaw.   It was delicious.  The Ribs were served piping hot and perhaps the most \"fall off the bone\" that I've ever had.  What really upstaged the ribs were the Greek potatoes ...they were delish.   The Lukomades (for dessert) were incredibly fresh and tasteful!  Nice way to close out the meal.The place was hopping and had a fine wait staff.   One head waiter...with several people including management rolling by the table to check in and make drop offs from the bar...etc.   They really took care of us without interrupting the flow of conversation at the table.I would definitely recommend."], ["Bruce K.", "Yummy times ten. Great meal, great service!I booked on Open Table and arrived to find that the place was barely a quarter filled. Nice. We were immediately seated at a table towards the back, near the very filled wine racks. Sadly, my wife and I aren't wine drinkers but if you are then you'll be pleased. I chose a Catawba draft instead.The taste of four starter is the way to begin here. Scoops of hummus, tzatziki sauce, red pepper and eggplant with a nice serving of slices whole wheat pitas. Probably too much for two to start with because there was a lot there and we were \"uh, what?\" when our main courses arrived.My wife chose the lobster ravioli. A very large portion with plenty to bring home, especially after we filled up on the starter. Tasty, creamy, seafoody (is \"seafoody\" a word?) and easy to eat. Delish.I had the quarter chicken which was served with potatoes and other veggies. A very big portion, there was a lot of flavor and texture in here, with the perfectly al dente potatoes.Dessert? Well, I guess we can try. We split a piece of baclava which came topped with some sort of (lightly peach-flavored) ice cream/yogurt. Delish.STUFFED with a delicious meal. We'll be back."], ["Jo S.", "We had reservation at this place. When we got inside, the hostess tried to seat us at a table near the door, it was cold outside so we asked for another table since the restaurant was half empty. The decor is generic-upscale wanna be, there's nothing ethnic or cute about it.We love Greek and Mediterranean food in general. We were very interested in this place and their take on that type of food. I'd say after dinning at this place that we enjoyed their appetizers more than their regular entrees. Their menu is too much of a mix of things, tries to please too much: pizza, pasta, some Greek dishes.For appetizers we got the fried zucchini and eggplant chips (they were very good) w. cucumber yogurt and the meatballs (they're just OK). For entrees we chose their pork chops (read good things about them) which were big, too much meat, dry, kind of bland, I couldn't sense the lemon flavor or coriander (they were supposed to have). Their fries were good. The coleslaw with olives (not the most Greek idea for a dish in the world) came later, way after they brought the pork chops with the Greek Fries. If I pay around $20 for an entree, I want all the components  that are listed in the menu to be brought in the same time (it's just coleslaw). The service wasn't that great, they don't bring the coleslaw when they're supposed to, but then they keep coming to your table to rush you to finish the food with a typical question:\" Still working on it?\" - I'm eating, not \"working\".  Overall, this place doesn't have flavor in their food as well as in their decor. The food lacks the Mediterranean flavors and the place lacks the Mediterranean fun!"], ["Rachael B.", "My boyfriend and I went here for dinner tonight and we were not disappointed.  Our server was Phillip and he was absolutely phenomenal, very knowledgable and friendly.  We ordered the humus, olives, chicken souvlaki, caesar salad, and the fennel and grape salad with lamb.  All of the food was cooked and seasoned perfectly.  I was extremely happy to find out the founders are CIA alumni as well, it's always amazing to see what our alumni can do!!"], ["Rick T.", "Really good lamb burger, didn't like the bits of red onion in the meat though. The lamb sandwich was good but not as the burger. Will try the ribs and other items when I return. Nice lunch spot !"], ["Mitch K.", "I think they have pretty good Greek food, not out-of-this-world good, but decent and some dishes are excellent.The octopus appetizer was excellent and ditto the dolmaties.  If you are a novice to Greek food, do the four starter/dip plate that is a selection of humus, egg plant, peppers along with pita bread.  You can get regular or whole wheat pitas.Crazy lasagna is unique and very delicious.  My friend had a big salad and it looked fantastic and he said it was one of the best he ever had.Menu is Mediterranean and covers quite a variety of dishes. Portions are generous.Hard to comment of describe other than to say that the service is great, selections many, prices reasonable and everything is savory.  Treat yourself to a selection of appetizers and you will have a great experience and learn something about Greek food.Good place."], ["Tina T.", "Excellent! Food is superb, different, eclectic. I had the Crazy Lasagne...the only thing crazy about it was  how crazy delicious it was! I love the atmosphere at the Quail Corners location...very pretty outdoor patio seating. To top it off...excellent, friendly service. So happy that this great place is just a quick walk for me!"], ["Nathan M.", "2 stars for thinking they know how to do chicken and waffles for brunch. The chicken and waffle is merely a vessel for the three sauces it comes with, which for a fried chicken lover is very disappointing. Step 1 brine chicken, step 2 add seasoning to the flour...easy"], ["Howard K.", "My unrefined palate could be mistaken, but I think Ilios Noche is terrific and deserves all the great reviews you see on Yelp. They are masters of perfect seasoning. Not only some of the best food in Charlotte, our server was extremely helpful and attentive."], ["Thomas R.", "What a pleasant little gem inside a strip mall in Charlotte North Carolina.  The outside one would be hard-pressed to perceive the hip, spacious, and dining environment that exists behind the walls of this building.We came in for a late lunch weekday and the restaurant was wide open with no wait. Were quickly seated and have a cocktail and appetizer orders taken almost immediately. For an appetizer we enjoyed the mediterranean spread sampler. This item featured tzatziki, baba ganoush, roasted red pepper, and hummus dips. The flavors present in these dips were authentic, fresh, and very satisfying. The dips were accompanied by warm pita slices that provided a perfect accompaniment. For meals we enjoyed the combination of two different Mediterranean salads and a pita wrap. All of the food was fresh, promptly served, and everyone was pleased with the outcome. Additionally we were all surprised by the quality of the Greek potatoes that accompanied the pita sandwich. Overall, we had a great experience. The service was attentive. The restaurant was clean and have an upscale vibe without being pretentious. We would definitely go back in the future when we are in town."], ["Carol G.", "We had a good meal. The atmosphere and decor was energetic and modern. I would recommend the lamb shank. It was delicious. My husband had the pizza and didn't like the crust (too doughy). We were there on a Saturday night. It was very busy. I would recommend reservations."], ["Nataliya S.", "Great restaurant for dinner.  Food was very good. The decor is much better than in most american restaurants."], ["Brenda P.", "Pros:Great Patio dinning for this time of yearGreat ServiceDessert was good had the trio platterHalf Price wine night on Tuesdays and good wine selection at decent pricesMiddle Ground:Mezze Dip platteraah  it was OK. Nothing to write home about. Have had better dips before. The tzatziki was nice though. Eggplant dip was not what I was used to having visited Greece and TurkeyNot so Good:The flounder. It was SUPER dry. Like fried beyond all recognition. The sauces were nice that came with it but there wasn't enough. Both me and my friend had the same platter and both used our mezz dips to drown the fish in. Neither one of us finished the fish. Could have used more artichokes in the potato, salad artichoke thing which was mostly just potatoes and nothing spectacular about that either. Other issue I had was that our entrees came out to soon we had barely recieved our dips when the entree came out.Overall would recommend the place just not the flounder."], ["L B.", "The food was a 4 star which is really high for me, but the service made it a 5. We went with a party of 5 and ordered several starter plates, ravioli, goat cheese in sauce and yogurt and all were great. I had the scallops and they were great. One of the guest at our table had to run his wife home and the food was delivered we asked them to keep the husbands food warm when he returned they had made him a whole new Gyro. Our waitress was great all the staff seemed very courteous. Very much enjoyed the visit."], ["G P.", "it was my first time to this place with a group of my friends & it was right around the holidays. we had made reservations, but we were seated almost an hour later.  But this wasn't the fault of the restaurant but the party that had been there since 5.  When the manager knew how long we were waiting, he arranged for us to be seated right away and got us situated.  We also had a great server who was knowledgeable about the food on the menu. Being a vegetarian I ask every question you can think. He was honest in saying the fries are cooked in the same oil as the calamari so that was a no go. But I totally enjoyed atmosphere and the food. My only issue was the leftovers i had the next day seemed very salted.  I would request that they chef go easy on the sodium so it doesn't taste salty the next day. I will be returning to this place in the near future."], ["Megan L.", "A little hidden gem!The food is delicious, the staff is accommodating & welcoming, the atmosphere is very relaxing & modern! A great place for a quick tasty lunch or a long, romantic dinner!"], ["Mike P.", "Service makes a difference. I had my first experience at this restaurant and it was terrific. Very attentive server who made us feel welcome. Good pace of service and recommendations spot on. The food is of good size potions and our party made diverse choices all of which were good. Tried the Eagle red and it was amazing. Licked out as it was half bottle night too!"], ["Femi L.", "After hearing much about this restaurant, I tried it on a lazy Sunday afternoon.  It was good but not great.  I ordered the scallops and a side of white beans.  The scallops were okay, but nothing special...your basic pan sear.  In my opinion, they werent very flavorful.  The white beans were an awesome side.  Very flavorful, they made up for the blandness of the scallops.Ambience - 5/5 very nice setting, beautiful stained wood furniture in a low light setting, with tons of spaceService - 4/5, extremely nice staff and fast serviceFood - 3/5, i wasnt impressed and dont feel an urgent need to return anytime soonPrice - $$, typical middle of the road dining experience"], ["Steve R.", "Great menu, well prepared and excellent service. A foodie joint."], ["Dave E.", "Ilios Noche has quickly become our favorite restaurant in Charlotte.  You wont find better service or more delicious food anywhere. Anthony continues to impress with his wine recommendations.  This place is fantastic."], ["Erica P.", "Went here on a date night, made reservations for 9pm after another event.  Event cancelled, so we decided to try and hit the restaurant early.  They told us it would be 30-45 minutes.  We grabbed a drink at the bar, and our 30-45 minutes turned into one hour and 10 minutes later, and them continuing to assist folks who we could overhear did not have a reservations and were just \"regulars\".  They allowed us to continue to sit here and wait walking past us over and over without even acknowledging us or even updating us as to an estimated seat time.I get it, we showed up on a busy Saturday without a reservation, but seriously people, handle it with class and you will have a never ending stream of regulars.  Your hostess staff are doing your restaurant an incredible disservice.  We aren't in New York City guys.We have been here before, food is excellent, solid spot for Charlotte, but service is just not there."], ["Kajal M.", "Great food! Nice servers and quick service. Their octopus app. dish is delicious. Their cocktails I'm not too crazy about but the have a full bar. Elegant for a date as well as great for a dinner with girl friends or a business meeting even. Great lunch and dinner spot. Would recommend this place!"], ["Christian R.", "Had my first experience here the other night.  First off, very nice bar area and very large dining area.  Overall very nice decor.  I had the braised lamb which was fantastic.  service was spot on.  will def go back"], ["Vanessa C.", "The food is consistently good. No complaints on the menu. Please, please turn the air conditioner on...its summer in the south. We need to dine comfortably and without sweating."], ["Jamar C.", "By far one of the best restaurants in Charlotte. The service and food is impeccable..Make it your business to go to ilios...I was there on a Friday night and they had live music...it sounded so good..a great compliment to the environment, very sexy and chic!"], ["Bill G.", "Excellent!  Second time here as good as the first. This time meatball apps(amazing moist and tasty) and the killer cheese. Wow. Dinner was the crazy lasagna and that was awesome as well. Great service and great atmosphere"], ["Susan P.", "Never disappoints! Their spinach pie appetizer works as a great meal. I definitely recommend this for a date night or just out with friends."], ["Missy G.", "Ilios Noche was a fantastic experience. Booked reservations based on all the positive reviews, and we were not disappointed. We ordered the spread sampler to start off which was delicious. Three separate times we were asked by three different individuals if we wanted more pitas, which was very nice. I ordered the chicken lemonada (sp) and it was fantastic. Like nothing I have ever tasted before! Definitely would recommend. Hubby got the pork rib which was so tender it fell off the bone. The flavor was great a well. Great decorated venue and attentive staff makes this the place to go to in Charlotte. Looking forward to when it gets warm again to use their outdoor patio which looks romantic and comfy. Bottom line, this city is in desperate need of more places like this."]], "Kabab Je Rotisserie & Grille": [], "Euro Grill & Cafe": [["Steve B.", "I enjoy the Cevaps every time that I have come here with the fresh bread and sides of roasted pepper puree and creamy cheese. The side salad is awesome also .. everything combined is just perfect !"], ["Meleah S.", "A few months ago we got some delicious cevaps from the farmers market so we've been talking about going here to try the ones at Euro Cafe. It was reasonably priced and tasty! I got the small cevaps and my boyfriend got the combo. We both really liked it! It was fresh and made to order. The only thing that would've made it better for me would be if the cevaps were a little crispier on the outside but I can just request that next time. The service was great and the whole market / cafe combination reminded me of my time in Europe and Turkey. We will definitely be back!"], ["Daniel B.", "I really was not very impressed here at all. We actually stumbled upon this place in some online listing as I haven't heard many people talking about it elsewhere.In general the venue didn't seem very well kept. The same owners manage the grocery store next to it so I imagine they are torn between the two spots at times. When I visited there was a table covered in food that looked to have been sitting there for a while and nobody in site to clean it up. It took some time for the one person who was working to come out, tidy up a bit and wait on us. In general wouldn't have been a problem with just one other person staffed. I suppose this is to be expected in a small space but could have made a better first impression if it were addressed.For the food, it could just be that this particular cuisine isn't my style, I'm willing to admit that. The cevapi was suggested because it was a specialty so I went with that. Again, I'm willing to admit it might just be a preference of mine but this dish really wasn't very appealing. Back to the staffing issue, it took a while for our food to come out and when it did, I wasn't impressed by the presentation, how greasy it was and how limited the options on my plate were to break up the greasy meat and greasy  bread it was served on. Unfortunately, I really can't see myself going back as I prefer cuisine with a bit more variety. I will say however that the meat pastries on the menu looked pretty good as well. If I were to head back, I'd give one of those a try."], ["Ben N.", "I love trying places like the Euro Grill & Cafe.I didn't know the first thing about Bosnian food going in, or any Balkan cuisine for that matter.  But I'm not sure the Euro Grill & Cafe broadened my knowledge to any significant degree because the menu actually features few purely Bosnian items.  Instead, it's sort of a catch-all cafe, offering schnitzels, burgers, gyros, and even a Philly Cheesesteak.  There is a focus on cevaps, though.  That item consists of excellent kofte-like sausages served on a roll or flatbread similar to focaccia, but softer and oilier, along with housemade sour cream, a flavorful roasted-veggie spread (mostly red bell peppers?), and diced onions as condiments.  Overall, delicious.  Served in combo plate with fries that weren't especially noteworthy but that made for a huge amount of food for nine bucks.There's also a sopska salad, which is much like a Greek salad but without the kalamata olives.  It comes in a huge serving that could probably satisfy a table of four as an accompaniment to other entrees.The business consists of a tiny cafe with just three or four tables, plus a small market selling mostly Eastern European items in the back.  The lone fella operating the cafe and store on a quiet Friday evening (we were the sole diners eating there, although several take-out orders went out during our stay) was very warm and welcoming."], ["D. E. W.", "I was craving Indian food, but they were closed, so we ventured down Central. I am so glad we did! We had never eaten Bosnian food, but will become regulars. We tried different dishes and tried from each other....everything was wonderful. The owner is nice and even gave me a chocolate bar for Mother's Day. I didn't even notice how small the space is after a little while...not for large groups...so worth it.What a wonderful time."], ["Sara E.", "Really fantastic, authentic, Bosnian food. If you try it, you will fall in love. I haven't had this authentic of cevape since I was last in Sarajevo. Absolutely perfect. The zeljanica was also fantastic. Can't say enough good things about this place but so glad I was passing through Charlotte and made the stop. The owner is also a super sweet guy. I am happy to recommend this place and hope to be able to come back."], ["Matthew C.", "Good food.  Had the small cevapi, and it was plenty of tasty food for me, with strong coffee.  I definitely plan on coming back.  It's Bosnian, not Turkish, but yelp has no appropriate category.Coming from down/uptown/the west, I had my eyes peeled towards the strip malls (this is Charlotte, after all), but Euro Grill & Cafe is in a light cream-colored house with indigo awnings right up close to the sidewalk.  It's on a corner, and there's parking in back."], ["Devin H.", "I'll keep this short but definitely sweet. We come out here all the way from Fayetteville and love it every time. The food here is very authentic and my Bosnian wife even loves it!! It's so good that every time we eat here I forget to take a picture to share because I just want eat everything up! Definitely should come check this place out!!!"], ["Matt R.", "Just had lunch at Euro Grill and we loved it. No frills place that appeared to be run by a father and son. We shared a Sopska salad then I had the Meat Medley combo and my wife had the meat pie. Everything was delicious. The authentic Bosnian market next door is a must to if you're going to try your hand cooking Bosnian food at home."], ["Shauna C.", "I am scared for this little gem of a place because I went during lunch today and it was empty! It makes me sad to see places like fast food chains or even my beloved Panera filled to max capacity but yet little mom and pop places like this remain empty. Do not be intimidated by the menu or the fact that it's not your typical American dishes, this food is approachable and tasty!I consulted yelp prior to my visit and knew I had to give the Cevapi a try. While they look like sausage links they certainly do not taste like sausage! If anything it is very similar to Gyro beef/lamp mixture in a link form. The bread it is served on is simply outstanding. This is served plain with onions & tomato or with two sauce options ajvar, which is kind of similar to blended roasted red peppers and/or kajmak which the server referred to as sour cream (and it tasted identically). Anyway, both taste great. If you want an average sized lunch (and very filling at that) go with the smaller version...trust me, it is plenty. We also decided to split the ground beef burek - it was good but didn't compare to the cevapi in my opinion. It was served with a side of pickled cabbage & carrots. Our server recommended putting the \"sour cream\" on it as well. We ended the meal with two cups of Turkish coffee. Well as it turns out I do not like Turkish coffee very much. I can't fault the restaurant for this at all...I am usually one who skips the sugar but doubles the cream - so this was too stout. I will say if you're a strong coffee lover Turkish coffee is a must. The atmosphere is quiet but seating inside is limited and a bit cramped. This is also connected to a Bosnian grocery store as well. The service is friendly -though distant,  but all in all I was fine with everything.It is VERY reasonably priced for lunch - everything I describe came to $14 and I left food on my plate at the end of my meal. I'll be back to get dessert!"], ["Romeo L.", "Fabulous....Small place, owner cooking, serving.More restaurants like this make going out fun, exploratory, healthy."], ["Bonnie C.", "I've been eyeing this place for awhile now. I finally got a chance to visit today for lunch. The same building used to be a Vietnamese restaurant. The inside hasn't changed a whole lot since then. They've added a bunch of little round mirrors, but that's about it. I ordered the combo cevaps sandwich.  Super simple sandwich - spongy bread, sausage, red pepper sauce, onions, and some kind of cheese. It tastes so much better than it sounds. It was pretty great. I can't wait to try other stuff on the menu."], ["Michelle M.", "I tried this place out after reading Thomas' review below, \"stop everything you're doing and go to this place right now.\" I am really good at following directions when it comes to food!I love to try new cuisines and had never eaten anything Bosnian or from that region at all, so I was really excited to try this out. I got everything to go since I was late for work already, and the food took about 20 min. to prepare. A man, who I'm guessing was the owner, was there all by himself today cooking, waiting tables, bussing tables, and working the register at the market next door. After about 5 minutes of waiting, he brought me out a salad on the house for me to eat while I waited. This was unnecessary, but extremely nice of him and I devoured the delicious salad. Before I left, I asked him what kind of cheese he put in my salad and ended up buying two pounds of it! The cheese is Krinos brand, Bulgarian White Cheese and is very similar to feta, but milder and not as dry. Walking to my car I was positive of 3 things: I was going to burn the crap outa my fingers, I was going to spill on my work clothes before even getting to work, and I was going to start eating before taking pictures, I was ok with all of that!I ate most of the Zeljanica (Spinach pie) on the way to work and it was absolutely delicious! The pastry was flaky and crunchy on the outside and the dough had a bite to it on the inside. The spinach filling was delicious and reminded me of something my grandparents (French and Hungarian) used to make when I was little. I cut up some of the cheese I bought and ate it along with this spinach pie and I was in heaven. The Burek, or meat pie was just as good. I believe the actual pastry was the same, it was just filled with meat instead of spinach. It was delicious and I dressed it with a bright red vegetable sauce the guy gave me along with my food. If had some spicy mustard I definitely would've put some on the Burek, I think that would've complimented it really well.The last thing I tried was the Cevapi. It is a Bosnian flat bread that they split open like a pita. It had 5 skinless sausages in it, it's just ground beef which they shape into sausages, and it came with some raw onions on the side. The whole thing was great, but the bread was outa this world and now I think most sandwiches should be make with it! After a little research I found out it's called Lepinja, it's kind of like a fluffy pita/Ciabatta/Fry bread combination and it was delicious! I found a couple of recipes online but next time I'm in there I will ask if he sells the bread on its own so I can make all sorts of sandwiches with it!This place is great and the prices are very reasonable. Each of the pies was $4.50 and one would be enough for a lunch on its own. I can't wait to go back and try some of their other specialties and definitely some Turkish coffee!"], ["Rod O.", "First comes LOVE then comes Sudzukice similar to Cevapi... With Sudzukice comes long skinny spicy Sausages... Cevapi is shorter sausages... Both served with or on thin bread usually joined by Onions!  Bosnian Cuisine!  OF COURSE I took Photos!  What!Burek one of my Favorite foods - Beautiful and Yummy with a Special Cabbage  Zalad!  Bosnian comfort Food!  Meat, Potato, onion and spices wrapped in dough and baked!  Fantastik!Sirnica, Zeljanica, Pljeskavica, Schnitzels, Kabobs and Gyro, also on the menu!To get ready for the Real Dessert I had a slice of Tiramisu, though plenty of food I consider this the Appetizer for the Real Dessert!Turkish Coffee for Dessert and a lesson in how to enjoy Turkish Coffee I had never heard... If you hear this education information please message me and let me know what you know!!!Small enough inside that you would want to sit outside if the weather is nice... Seriously about 15 seats if you are good friends, five tables with only room for four of them!Dude!  Check this place out!"], ["Colin K.", "Absolutely incredible place. A true gem on Central Avenue! Opened in February and I hope it stays open a long time. We walked in through the store, filled with a decent variety of Bosnian and Turkish imports. Delightful! The seating is limited but it wasn't very busy. We had the Cevapi, Bosnian sausage, which was seared to perfection. The Bosnian coffee was excellent, served in traditionally on a silver plate with sugar. To top it off, the owners are just the nicest, most accommodating people. It was a joy to eat here and we'll definitely be coming back."], ["Jason R.", "Incredible food and an absolute bargain.  So authentic that you feel as if you walked into an old world, Eastern European market.  Cevapi is really delicious and as others have said, enjoy the sauces that are available.  The owner is very nice and obviously a very hard worker.  Be sure to check out the market too and try something new."], ["Samantha R.", "This place was absolutely wonderful.  Everything they gave us was absolutely amazing.  The Bosnian Coffee was fantastic and completely unlike any coffee I have ever had...and it wasn't just the taste, it was the whole presentation/experience.  The food was delicious and the family who runs the place are very kind (and helpful when we struggled to pronounce the names of the food). Definitely go visit this place.  You will not be disappointed."], ["Annika W.", "I only tasted cevaps for the second time in my life here. And out of the two experiences, this was by far the better one! Food was freshly prepared, albeit not \"fresh\" in the sense of having anything vegetable-y in it. This is a place to go when you're ready for a hearty, somewhat greasy and meat-heavy meal. Menu choices are simple and not extensive - but it's usually better to do a few things right rather than to do a lot badly. It's a fun experience, and the owners were very friendly and helpful. I'd happily recommend this place to anyone who wants to give their taste buds a new experience."], ["Thomas P.", "Wow - stop everything you're doing and go to this place right now.  Here is what you should order:1.) cevapi (chay-VOP-ee) with ajvar (eye-var) and kajmak (ok, I forgot how to pronounce this one).  The cevapi is 10 small sausages on homemade bread.  The ajvar is some tasty little tomato/vegetable mix and the kajmak is kind of like cream cheese but better.  OUT of this WORLD!  2.) eggplant napoleon - this was one of the yummiest things ever - mozzarella cheese on top of the homemade bread with eggplant and tomato bursting with flavor.  3.) roasted vegetables - i'm tired of explaining everything, just take my word for it.We also got cockta (i guess it's a Bosnian coke - average).  Should have tried the Turkish tea.  Oh well, next time.  All this food, and it was a lot, was about $23.  Tremendous value!  And the family that own/operate the place were the nicest.  we checked out the Bosnian market which is connected to the restaurant and which they also own.  We picked up some interesting things.  I can't wait to go back."], ["George R.", "This ethnic market/restaurant is a little dive, but in a nice way. The restaurant side is a hole in the wall, with only five tables, spotless and as far away as possible from Charlotte's ubiquitous strip mall spaces were you eat while staring at a depressing parking lot. The owner (I think) hovers over you eager to please but the food was slow to come out of the kitchen. Well worth the wait to me because it's delicious if you like peasant food from the Balkans with a heavy Turkish influence - which I do!- and very cheap too.  Turns out thanks to the Ottoman Empire's influence Bosnian cuisine closely resembles the Romanian cooking I'm so familiar with.  I love the cevaps (spiced ground beef) with the home made bread, sirnica (cheese pie made from Bulgarian feta) , the eggplant dish. To finish a slice of better than usual tiramisu was only 95 cents and the Turkish coffee was served with a little cube of Rahat Lokum. Cheap dive, tasty, fun... not recommended for chain restaurant lemmings."]], "Showmars": [], "Little Village Grill": [], "La Shish Kabob": [["Clint K.", "Best food in town at great prices. Lamb shank is excellent and lamb Philly best ever had. Food is top quality and owner very friendly."], ["Johnny V.", "Lamb leg meat just slides off the bone. This place is best for satisfying when u crave hearty flavorful meat and rice dish. My mouth is watering. Their beef is so tender and packs so much flavor in its grilled goodness. The sides of salad and daal soup are well portioned and just as yummy. I couldnt stop scooping their green chili chutney with every bite. I can eat here multiple times a week. Their dates are super moist too. I had their whole chicken and hanburgers too- soooo good!"], ["Natasha F.", "Amazing food, amazing prices and everyone was so helpful. They walked us through the menu and explained everything. The veggie plate was great and so was the Gyro Lamb."], ["Chris S.", "Fantastic, authentic Middle East deli in Charlotte.  Food is fantastic, prices are unbelievably low and the owner makes you feel like family.  Seating is limited due to the deli style.  I usually call ahead for take out."], ["Kiersten T.", "Don't let the appearance of this place deceive you. The food is fantastic! My husband and I order food from La Shish at least once a week. Our favorite is the shwarma (it's SO good!), but you can't go wrong with any of the menu items. The owner is super friendly and always recognizes us when we come in. Love this place."], ["Lisa H.", "Delicious!  Fresh and great service.  Here for first time... Very helpful in choosing items from the menu."], ["Bradly K.", "Just for the record absolutely hands-down the best middle Eastern cuisine I've ever had still to date ! Me and a buddy AJ and his family went here couple years ago now ...damn good food omg it's really amazing.. Yes there is other places in town but after revisiting this place again it's just better I think. You have to check out the Kibbeh, Falafel, Chicken Shawarma, Kafta Kabobs....!!  They also have a few desserts but my favorite is Baklava. If your a coffee person try the real deal Turkish coffee .....You won't regret it you'll thank me later ...enjoy!!!!"], ["Christina H.", "Amazing food.  The best middle eastern food hands down.  The service was fast and friendly as well."], ["R M.", "Very delicious and authentic food. Service was excellent and wait time was not bad."], ["Joshua M.", "Extremely authentic. They even bless the meat before killing and cooking it.Awesome food, too. Will definitely come again. Sadly, they don't deliver; if they did, that'd be awesome."], ["Renee W.", "Went here with my Mom. She had tabouli  and hummus. I had the mixed kebab plate with rice and lentil soup. We were both very impressed with the taste of the food. Each meat was seasoned perfectly  and not with the same seasoning it seems. The hummus  was so creamy. Those were the stars for us but all dishes were great and the service was super fast. I recommend a dinner here. We are already planning our next order!"], ["Shalu B.", "If you love kabobs and gyros/middle Eastern food...this place is a bit too bland and everyday. The chicken shawarma was super dry and it definitely needed more sauce. The falafels were dry and not flavorful and the lamb gyro was decent. You will find better gyros on east boulevard or even the little village grill. The owner was super nice and friendly but not worth going out of your way at all"], ["Jason B.", "I just wish I had found this place sooner. Love it!I have been starved for good Middle Eastern food in Charlotte.  This place is By Far the best that I have tried.  The price are extremely low and the quality is exceptionally high. The portions are large. How they can sell two lamb shanks for such a low price is beyond me.  You don't come here for the atmosphere.  You come here for the food.  But I did think that the diversity of the patrons was very interesting. I've probably eaten here 6 or so times now and every time I have been extremely impressed. Just try La Shish Kabob.  You won't be disappointed."], ["Jeannette L.", "Came here for lunch. Food was good and cheap, def want to stop by here again sometime to try more stuff. Now if only the parking was better, I imagine it must be a pain in the butt when things get busy."], ["Ayesha S.", "I've been wanting to write a review for this place but didn't get a chance until now.  I was visiting Charlotte, NC for a conference in November 2014.  I met the owner, very graceful and hospitable man, may God bless him and his family always!!!  He deserves 100 stars and I'm not just saying that out of no-where!!! The service he provided was absolutely wonderful!  The food tasted great!!  I had ordered the full Cornish hen with rice and had substituted another side for hummus.  The portions were huge!!! I had also ordered some food to take with me on the next morning flight for my husband (chicken kabobs and other items) and the owner packed everything for me in very good packaging (for the flight).  My husband really enjoyed the meal the next night.  The food was great, the place was super clean (even the bathrooms), the prices were very reasonable (or even cheap compared to Bay Area) and the portions were huge.  On top of that, the service was very welcoming and hospitable.  What else can you ask for in a restaurant!!! I wish we had such great tasting Arabic restaurants in the Bay Area.  If I ever get a chance to go back to Charlotte, I will definitely ask him the recipe for the most flavorful yellow rice I've tried in the whole world.  Thank you for providing such great food and great service to a hungry customer at close to 10pm at night.  God bless you!!!"], ["Rosa R.", "Try to place an order and the spanish speaking man who was trying to get the order was rude by telling me to hurry up with the order because he was busy.."], ["Fero A.", "Ok! so, the price on the menu board doesn't match with the price that I've been charged, the amount of food was good but I noticed a piece of metal in the Taboli plate, where did it come from, i think from the dish washing materials, so I went to report the problem and all what i got is an angry face from the owner that does most of the stuff usually and I even saw him earlier standing with his shoes on the dining table to fix the ceiling fan, and finally I wasn't impressed with the way they deal with customers and they charged me for water also."], ["Sam S.", "All around excellent taste, excellent pricing and quality.The owner is a hard worker and always present taking care of every customer.Very special place for a great meal and generous portions.A Must Visit Spot."], ["JAM J.", "First time here and this place is pretty good. The prices on food is reasonable.  The lentil soup is delicious, and lamb kabob was cooked right."], ["Kathy G.", "I love this place, first it's like a Palestinian deli in NYC, they have freshly made salads, hummus, also Cornish hen, and THR portions a HUGE...so you need to be hungry!The food it's fantastic and you can have also amazing desert!Won't be disappointed!"], ["Jackie P.", "The owner is super friendly and the gyros and whole chicken are really good. It can get kind of crowded, and the place is small, but the food totally makes up for that."], ["Tanya L.", "We came here as a party of 10 after our families decided to meet up in the area.  I read so many good things about this place. The place is small but, even late at night, there was pretty good business.  The owner looked straight out of The Hobbit trilogies and wasn't super warm and fuzzy.  I think this place was too hyped up in my head after reading the glowing reviews. We had taken our food back to the hotel and unfortunately, the food did not live up to the hype.  I don't think anyone finished their meal.  I love me some spices but the entire meal was entirely too overly spiced.  It might have been due to the meat tasting a bit off...so maybe the heavy hand in spices was to offset that taste/fact?  I was especially excited about kibbeh being on the menu but instantly disappointed when I popped in the first bite.  Too bad I ordered a bunch of everyone.  We are huge fans of kafta but we could barely finish ours.  The kids even quit early and they loooooiiove kafta/kufta/kubideh.Overall, the portions were decent and the food ok if I hadn't had anything to compare it to.  Maybe this was just an off night since I'm sure the reviews are glowing for a reason."], ["Muath A.", "Great food and prices! Lunch specials are amazing with very reasonable prices. I had lunch special, chicken over rice. It was very big portion, couldn't finish it all."], ["James P. B.", "Wow that was really good. Had the #6 beef kabob. Picked a soda out of the nearby fridge. Great people watching, this place caters to a truly international crowd. The tightly packed tables gave it a communal vibe. I'll be back!"], ["J C.", "The best food around.  Doesn't get much better"], ["Ahmed J.", "The food is authentic, fresh and delicious. Came all the way from high Point and it was well worth it :)"], ["Julia M.", "La Shish Kabob is not going to win any awards for décor or atmosphere, but the food is good and solid.  The owner is very helpful if you ask for suggestions or if you want something made special.  I knew that I had to try the falafel since I had read on other reviews that their falafel is really good.  So, I ordered a falafel wrap and a bowl of lentil soup. Both were very solid, but not better than what I can get at the Kabob Grill in Stonecrest.  However, the pricing at La Shish Kabob is much cheaper. So, if you are looking for good solid food at great prices, I would definitley recommend La Shish Kabob"], ["Alexis Z.", "This place is authentic, delicious and a true gem here in Charlotte. Recommend anyone to come here and finish with a desert. You won't regret it"], ["Ashlee F.", "Delicious I ordered the chicken kabobs, hummus and falafel balls all of which were well seasoned, fresh and authentic. You can tell the owners or the establishment take pride in the product they are serving and the freshness! Amazing food!"], ["George R.", "Four stars +A year and over three dozen meals later I'm raising its rating. No, not everything is perfect, that doesn't happen anywhere but the food consistently more flavorful than it has right to be for a falafel joint - I suspect the owner is a foodie himself. Usually with Arabic food I'm not drawn to meat dishes primarily, La Shish being the exception. I really like the Adana kabob, the mixed grill with special rice is a meat eater delight, even the chicken shwarma made me go like Larry David : \"don't know what the Palestinian did with the chicken but it's out of this world!\" Well, no it's not but it's really really good. I recommend sharing a Foul Madamas appetizer, the taste always bring a smile to my face. I usually take home a container of their humus, priced like supermarket crap but so much better.  One thing: made without preservatives so you really want to eat within a few days.  The local Muslim community fully supports the restaurant  and it does a brisk business (Friday after prayer is a zoo in there!) but in spite of the many positive reviews I rarely if ever saw fellow gringos or gringas eating there. We've never felt anything less than 110% safe eating there ourselves, but I did hear otherwise from locals so I'll end with this caveat: For adventure tourists only ! Not recommended for the tour bus or all inclusive cruise crowd.  8^P"], ["Red S.", "This little restaurant is a gem. The owner is a sweetheart and recognize me each time I come in. The food is good and you can find healthy items on the menu. I eat there every Other Thursday when I'm on that side of town."], ["J Z.", "Amazing delicious! Two lamb shanks combo! Never finished it in a single meal! Very clean! The stuffs are so kind! The guy with a red cap all the time is so shy and funny!BTW, you can't miss the jalapeño spicy sauce. It is spicy but very delicious! A special smell that can make you feel fresh and comfortable."], ["Nicolette H.", "If you're looking some pretty good food, La Shish is your place!The food here is delicious and priced very well. The portions are large, so sharing is definitely an option (that is if you can pull yourself away from your yummy dish).The restaurant is cozy with a really friendly manager, he's very helpful and kind. I've been here a few times, and I think I finally have a favorite. Shwarma's are great, and the homemade hummus is something I could eat by the spoonful O_o !!! I love getting the 3 Kabob plate which comes with lamb, chicken, and kafta. KAFTA KAFTA, so so so yummy. I mean I pretty much ate all of that first, then the lamb, followed by whatever chicken I could fit into my belly. This is a good choice if you want to share or try a few different things. The food here is always on point and I've never had a bad experience. I'm a huge fan of La Shish Kabob, and will be back soon."], ["Karuna S.", "Talk about a hidden gem!! My weekends are not complete until I have had at least one meal from La Shish... it's usually a Sunday afternoon takeout.Basmati rice so perfectly cooked, to go with the perfectly seasoned chicken kabobs (the lamb kabobs are good too, I'm just a bigger fan of the chicken ones)  Warm pita bread with fresh falafels, topped with hummus, fries and garlic dip on the side. It doesn't get any better than this. In my experience, the food has always been fresh and flavorful, and the portions are big! Really great value for your money. There's something so wonderful about food that's simple, affordable & downright delicious - For complete soul, palette & pocket satisfaction - check out La Shish!"], ["Ian W.", "It's open until midnight.That alone makes me happy, but there is a lot to this little place other than keeping convenient hours. Maybe I'm hungry at 11 cause I didn't get a chance to eat earlier & don't feel like a high fructose corn patty from MickeyD's or some other fried abortion swimming in grease. Too harsh, I love bar food and late night Chinese, but sometimes I need something else that's open late besides, fast food or a Denny's. Something I won't completely regret eating.Too much ranting about the inconsequential...again.La Shish is a hole in the wall Mom & Pop establishment. There's no pretension, no linens, no giggling strumpets on dates with tall doofuses, just solid Middle Eastern food at reasonable prices. The simplest things are always the best. They serve up well seasoned grilled lamb, chicken and beef kabobs. Their fries are a meh minus, but I feel like an infidel getting them here anyway. Then there's my favorite refrain for any restaurant: the food is not oily or greasy.As far as I know (which is not much), this could be the best shawarma and definitely the best tahini sauce in Charlotte. The \"shawarma wrap\" is not unlike the donner kebabs that are ubiquitous in many European countries that serve as their version of fast food, late night drunk munchie snack and hangover placebo. Fucking delicious. And definitely better tasting than fast food with REAL meat and REAL vegetables. I mean, they even cut the meat off of that big thing, you know, that big thing.Fairly vegetarian friendly; I like a good falafel every now and again & they have one.\"Okay my friend\" is what the owner behind the counter always says when your food is ready. This is a quickie joint, not a Michelin star place, so expect the service to be \"authentic\" as well."], ["Chelia S.", "The staff was rude and the falafels were stale. I have no intents on returning. When I called to place the carry-out order the staff practically hung up on me without taking a name or telling me how long of a wait or giving me a total. I should have not even bothered to pick it up (dummy move #1). When I arrived, the place was very hectic. Customers were gathered around the counter in no particular fashion. Finally somehow I eventually made it to the counter, although there was never ever really any line or anything, where there was a guy behind it on the phone. He didn't greet me, but acknowledged me with a glare and I told him the order I placed. My second opportunity/cue to just leave...Nevertheless I paid and he placed my order on the counter without a word and walked away. I get home only to find dry falafels that apparently were not fresh. Nor were any of the other items in my order worthy. Total waste."], ["Liz K.", "Ate here once, it was delicious!"], ["Zied D.", "La shish is one of the best places to eat middle eastern food in charlotte. I eat here frequently. The service is always fast. The food tastes really good and it s really cheap for an exceptional quality of food."], ["Daniel B.", "Location, sketchy. Food, phenomenal. This place is one of the defining reasons why I LOVE Mediterranean food. The spices, herbs, meat, EVERYTHING is incredibly fresh. I had quite the sampling of food so I did get a good idea of the beautiful things this place is capable of. Even with the large sampling the bill was quite reasonable.If you're a fan of Mediterranean food or you just love great food this is a great place to get some of the freshest and most flavorful food you'll ever have."], ["A P.", "Been coming here for almost 4 years now. This is handsdown the best kabob place in charlotte. Dont come here for the ambience but for the food and the hospitality. 5 stars all the way"]], "Jasmine Grill": [["Kristy A.", "I need to give this place a second try. Comparing it to other Middle Eastern restaurants, it's only okay. I was impressed that this place was being efficiently ran by two men only. One cook, one server and they were able to get everything done during a busy lunch hour. While the guy who was the server wasn't exactly warn and fuzzy, he got my order correct. The food was okay. I had a chicken shwarma (?) sandwich that left me wanting more and needs something with a twang in it. Either a pickle or that plant that's pink that's found in Mediterranean food. Hope I don't sound ignorant. Long story short, it's a decent choice for lunch. I think I need to give it a second try dining in."], ["Alex K.", "This place deserves as many stars as I can give.  I'm not amazingly familiar with Mediterranean or Middle Eastern fare, but this restaurant gives a great foray into the cuisine.I enjoyed a Beef Kofka lunch, which came with lentil soup, house salad, and rice.  Everything was top notch.  I also had a side order of Hummus, and maybe I've been missing out on decent hummus my entire life because this stuff was phenomenal.  It was even presented in an aesthetic fashion.  The beef had a perfectly light crisp on the outside while still retaining a nice level of juicy meatiness on the inside.Perhaps one of the better things about this restaurant is it seemed all of the employees here actually wanted to be there.  They were all smiles and genuinely seemed to enjoy their customers. Bon Appetite."], ["Jacqueline P.", "I ordered delivery from here Saturday night. Had I known it was going to take almost 2 hours I probably wouldn't have but it was too late to change it. I ordered the chicken/steak kabobs with rice and hummus. I also ordered a side of falafels. The meat was good, nicely flavored but not very tender. Both the chicken and steak were a bit tough but not to the point that it was bad per se. The falafels were really good which is why I'd prefer giving 3.5 stars but since that's not possible I'll round down. The hummus I didn't like... Not even a little bit and the pita bread was hard and not very fresh. The rice and veggies that came on the side were good but I would have liked more veggies!! All in all it was a decent dinner but probably not one I'd repeat."], ["Peter M.", "All in on 5 stars:  great service, reasonable prices, plenty of seating...oh, and great food, too!  All their food is prepared in-house and it shows.  My lunch special was a chicken kabob grilled perfectly, rice, grilled veggies, freshly chopped salad and lightly dressed, and a cup of vegan lentil soup.  My belly is happy and so is my wallet, $6.99 + drink (which was comped with my Yelp check-in, and refilled)!  I'll be back for sure.PS:  my server did an excellent job explaining their food choices, philosophy, and attending to my dining needs."], ["Wayne B.", "We did the vegetable appetizer and it was delicious. The hummus at Jasmine is the best I've ever had. My wife and I then split a kabob plate with lamb, chicken and beef, and it too was excellent. The server suggested we order the Fatosh as a side, and it to was wonderful. And the homemade bread ... out-of-this-world good.The prices are great and the service is excellent. We found this place on yelp (we're from Dallas). Thanks to all those who came before us and took the time to review Jasmine Grill. Dinner tonight was treat!"], ["Arlene H.", "Had the chicken lunch special, which includes a soup and salad.  Soup was kind of bland, but salad and dish were very good."], ["Anshuman G.", "So we tried this place totally based on ratings and it did not disappoint at all. Very friendly staff. We loved being there and it was such an inviting place that if I have an urge to eat Mediterranean food, this place is going to be on top of my list!Coming to food, everything was delicious to say the least. We tried Baba Ganoush for the first time and realized what a wonder a magical set of hands can do to egg plants. Hummus, chicken shawarma, shawarma wrap, falafel- everything delicious and honest to their origin.Finished with Baklava and it was the freshest and the most delicious set of 3 pieces I have ever had!!"], ["Ron J.", "Great food great service will be a regular We ordered delivery and the food arrived hot fresh and to die for"], ["Mike D.", "I love the food here from falafel to kebabs it was all wonderful and the lunch special can't be beaten."], ["Shane L.", "I went here for lunch and ordered the chicken kabob. The waiter was very friendly and attentive, but the wait time for the meal was ~20 minutes (this was also considering that I was the only customer there at the time). With that being said though, the food was solid. The meal came with a thick and hearty lentil soup and fresh cucumber/lettuce/tomato salad in addition to the well grilled chicken kabob and rice. Do yourself a favor and mix in the garlic mayonnaise and spicy salsa, which adds a tangy kick to the chicken. For $6.99 + tax, this was great value."], ["Olivian F.", "The food here was very good. I was greeted with a smile and great customer service . There was lots of stuff to order from, the homemade humus was excellent!  I also had the shaved grilled chicken with yellow rice. It was nicely seasoned with fresh herbs/spices. I will most definitely  come back to jasmine grill again! High Five!!!!Jasmine Grill for providing \"FRESH\" fast food to Charlotte."], ["Benjamin R.", "The grape leaves and the Fatush with chicken are amazing.  Best I've had outside Jordan and Israel!"], ["Pradeep B.", "If u love Mediterranean, this place could be one of ur favorites. Their version of lamb shank was delicious. Fries and pita with hummus was good too!"], ["Ani D.", "Wow! What a phenomenal lunch. We got the daily special, chicken kebab and kefta kebab and we thoroughly enjoyed it!  We also got the blackberry juice and the mango juice which was almost like a fruit smoothie. I cannot wait to go back."], ["Kathy W.", "Best baba ganoush. Hummus has right amount of tahini (most places you can't taste any!). Salad with chicken was excellent. Chicken perfect color, spice and doneness and still moist. We will be back and with friends!"], ["Javed K.", "The food is great and has a reasonable price. I loved the lamb chops, they were so tender and delicious. The Kunefe was one of the best I've ever had. I would definitely recommend this restaurant and you should try the Kunefe as well. Great place."], ["Sandeep R.", "Amazing food and friendly staff. Their falafel, chicken kebob, hummus and baklava were excellent. I would have given them a four star if they served everything that was on their menu. On a Friday afternoon they were not serving chicken shawarma and being a turkish restaurant I expected them to serve that at all times. On another occasion they were running out of chicken and veggie pies."], ["Tim W.", "This restaurant may not look like a lot from the outside, but the food is incredible.  The service was excellent, the cook came over and talked to me and made recommendations.  The food was fresh and really tasty. I'll be back."], ["Alice M.", "This place is such a hidden gem! We went there for lunch today and their lunch specials are hard to beat. For 6.99, I had a chicken shawarma plate, hummus with pita, and a bowl of soup. The service was great. Our waitress was kind and attentive. The food was delicious! The lentil soup was perfect on a cold day. And the hummus is some of the best I've had. It has tasty oils and spices on it that add to the yummyness. The chicken shawarma was also great and the white rice was great. We left stuffed and with happy tummies! I would highly suggest anyone who wants to try some authentic Mediterranean food to come here!"], ["Suhail N.", "Awesome food and value. Lunch time sometime can be tricky and you may wait a bit. They do the best they can. Always good food with good service. One of my favorite places."]]}