{"Good Food on Montford": [], "Lempira Restaurant": [["Hailey H.", "huuuge portions, and tasty food!Just a heads up, most of the staff doesn't speak English, though the menu is in English and in Spanish so you can make a choice and then point if necessary. Even though members of our group speak Spanish fluently, our pale skin immediately sent the hostess for the English speaker on staff. Can't blame them, I guess, but in case she's not there when you are, you can still get a good meal!As others have mentioned, the menu is fairly large, and encompasses a few different regions. We ordered everything from stuffed plantains to chicken and steak tacos to pinchos to a beautiful shrimp and fish dish, and some were accompanied by fantastic house made tortillas. I ordered the chicken pinchos. YUM! Perfectly cooked, a nice sauce, rice, salad, fried plantains, and a small odd shaped hot dog tasting thing (we've made our best guesses, but I'll just tell you it mostly tastes like a hot dog and looks like it went through a cookie cutter). I couldn't finish my large platter, and actually most people couldn't finish their plate. Hello, 4th meal!We asked if they had any draft beer, she said \"yes\", but it was all from the bottle. Oh well. Pretty good service, jukebox, delicious food, I'm ready to go back!! CMYE?? (and pay at the counter on your way out)"], ["Shatara C.", "I've been living on this side of town for almost 6 years, and this is the first time I ate here. Only ordered the chicken flautas to go, and OMG,  it was so good!!! I haven't eaten these since I left NY, and it reminded me so much of this Mexican joint I used to always go to. It was just an appetizer but they add lettuce, tomatoes, onions and guacamole so you could easily have it for lunch or dinner. Ok, rant over. :-)"], ["Ian W.", "Dos palabras: Me gusta."], ["Rachelle T.", "Great food, clean restaurant, & the menu is huge! Try Honduran dishes- they're to die for!"], ["Christina K.", "Had baleada 5 and it was really great and cheap. Can't wait to try more."], ["Nastassia S.", "Hands down, this is among the best Latin American foods I've experienced. I am not going to subtract points for customer service, or for servers not speaking English. ARE YOU KIDDING ME??? This is the reason WHY the food is so exceptional. Look, if you want the American experience of eating Mexican food, go to Taco Bell, or On the Border. But if  you want authentic, quality food that Latino people actually frequent on a regular basis, then this is it. My husband and I were taken aback when we were greeted in Spanish, and saw that the restaurant was full of Latin Americans, but it was a GOOD \"taken aback\"! LOL. What went through our minds was: \"Oh yes, we're in the right spot!\" And the food did not disappoint. If you're smug and are put off because you have to wait a few moments for them to bring and English-speaking host to seat you, then that's on you, but you're missing out!  :D"], ["Julia S.", "More Honduran than Mexican, forgive my categorization.Lempira's menu is huge, HUGE, like Greek Diner scale with many typical Mexican delicacies (minus Mole), Chile Rellenos, Fajitas, Burritos, Burritos Suizas, etc. We went for pupusas but ended up with more - Boltanos, like an open-faced brekkie burrito, cheese, eggs, beans, avocado. Some sort of empanada wrapped entirely in plantain and deep fried, filled with some sort of rice pudding. Deserty. But delicious.It can be a struggle to eat here if a) you don't speak a lot of spanish and b) if you're vegetarian, but both of those apply to me and I left very, very full. As we were poking at our various foods, enormous Platos Typicos were steadily streaming out of the kitchen, all large and enticing. Veggies will stick more to breakfast, empanadas, pupusas, and burritos. Be emphatic - some menu descriptions forget to mention ham, etc.Ask for the spicy salsa when you sit, as their gringo Red is mucho boring. They also do Botela Coke - enough for two to share. 6 dollar lunch specials daily. Breakfast combos served all day long. Lots of wood and curved doorways. Neato."], ["Juanita M.", "I have to say the food at this place is quite delicious, however, the service is absolutely terrible!!! The plates are HUGE and portions are generous. Just be prepared for your server to not be super peppy."], ["Bryan K.", "I would have given this place 2 stars but the food was good. Staff was fairly inattentive, only checked on me once. Beer was not ice cold, and no draft selection. Food was pretty good. I can't remember the name of what I got but it was pork chops on top of a bed of typical Mexican restaurant salad fixings, shredded lettuce, tomato, with a side of white rice and refried beans and fried plantains which were good but some of them were dry and almost cold. Overall I would say meh, I've had better. Also the restaurant seems to be for Latino people not Americans. I did like that everything on the menu had a pic!"], ["Emily W.", "Great, authentic Mexican and Honduran food. The best I have found after touring the South Boulevard corridor. The lunch specials, 11-3 including weekends, is a steal. The portions are a crime... Take some home!  Ordered a tamale ($2) and plantain empanada (also just $2) as sides... Both were outstanding."], ["Anthony D.", "Fantastic! The food is exceptional, prices are great, and the pictures on the menu are exactly what you'll get on your plate every single time."], ["M.dayanara F.", "I love this place.there is music playing + a jukebox, bar and big TVs. the menu has a variety of plates from Honduras & Mexico also some American. Huge portions @great Price highly re comment it..& sure I'm coming back!"], ["Pathik S.", "Open late, full bar. Really good food. Everything I had was good, even the flan. Huge menu, great prices. My friend had the Guatemalan plate which was like $20 but it looked great( sausage, red beans and rice, chicken, shrimp, steak, plantains and a salad). I thought it was an awesome price. Some of the servers don't speak English. My first one didn't understand me but She had another server that could speak English wait on us. She could've been a little better about Checking on us more frequently, but I personally enjoy long dinners"], ["Jennifer M.", "BEST spanish food in Charlotte.  They have the best pupusas and the prices are reasonable.  I love this place."], ["Candice K.", "I like this place a lot but i was a little disappointed because they don't do pupusas con frijoles y queso. :(((  They just have pupusas con queso and like two other choices. Other than that its cheap and they were really nice to me so i was happy."], ["Suresh S.", "The pupusas are terrific but the service is lousy. The food here is great with a great variety of Honduran, Salvadoran, and Mexican dishes. I tried pupusas and tamales here and the pupusas were great and the tamales de elote were average. My friend ordered a half chicken with plantains which he said was rather good. The portions are big and generally a good value for money. The service is rather lousy. I pointed out to the waitress that my friend was overcharged on the bill and she refused to correct it and was icy from then on. She wasn't terribly friendly to begin with but it was solid ice by the end. Oh well.... If you don't mind the service, the food is terrific."], ["NOLA N.", "seated quickly,drink orders brought fast, with spicy and flavorful fresh made salsa hot thin crispy chips, waitress spoke some english, good for me foor was out of this world, just like Hondouras,"]], "Moe's Southwest Grill": [], "Arepas Grill": [], "Carpe Diem": [["Matt W.", "Living in the Chantilly area, this is a family favorite. More often than not, we carry out, but we've also dined in a number of times. Carpe Diem is located on the amazing strip in Elizabeth, along with Customshop, Passion 8, Viva Chicken and Earl's grocery to name a few. The restaurant is quite large with a large bar area up front that is great to get a drink or have a more casual dinner. The dining room is nice and quite formal though you can easily get away with nice jeans and a collared shirt. The menu is fantastic. We've never had anything we don't like. A few favorites...fried chicken and scallops. In my opinion, this is the best fried chicken in Charlotte. Amazing crust, very tender and juicy. It is served with mashed potatoes and a pepper gravy. The scallops are my wife's favorite. Tender, always great texture (important with scallops)."], ["John H.", "This place is on point.  Ate at the bar with a friend, bartenders were fun and skilled.  The cappuccino martini was sooooo good!Ordered the cheese plate, with some amazing candied cashews and spreads.  The duck confit was out of this world!  Green beans with some sort of crunchiness mixed in...yum.I need to come back with a small group and try the dining area, but if it's anything like the bar experience this place is a gem!"], ["Kristy A.", "Really good experience here, but not going to be my newest food addiction. The house salad included strawberries, feta cheese, and pumpkin seeds, which I inhaled. They had enough salt/pepper on the salad as well as balsamic dressing done right. I also had the shrimp & grits, which had pinto beans. That was unique, but flavored well and the shrimp were large and w/out a tail. A vegetarian option that subbed mushroom for shrimp was available. My friend had the duck confit and was pleased. Their butter for the bread was a bit salty. Service was great, as the waitress had an impressive command over an expansive menu. Drinks were tasty, but weak. Overall, I see why this place is hyped. Everything was really flavorful and made from quality ingredients and the service is second to none."], ["Nicole E.", "We came here on a Saturday evening for a dinner date. A bit dressy here so I'd recommend looking nice. The service is impeccable- the waiters were always checking in on us. The food was good- I had the mushroom bolognese with shrimp with a side of sautéed spinach. For dessert I had the Crème brûlée which was delicious. All in all, I recommend to try it out."], ["Ellen M.", "My fiance and I stopped in for a celebratory engagement date.  We both ordered the special that night which was a braised beef ragu over homemade pumpkin and ricotta gnocchi.  It was incredible. My only complaint is that I wished there was more.  And then dessert came... our waitress, who was very friendly and personable, informed us that one of the sisters that owns the restaurant also makes all the desserts and they change pretty frequently.  That night my fiance got what he calls the 'best thing he's ever eaten' which was a pumpkin gingerbread trifle (I believe) with caramel sauce.  I had the blueberry cobbler which was also really really good.  Overall, we loved this place and can't wait to go back the next time we are in the area!"], ["Marco F.", "I had been wanting to try this place out since I first got to Charlotte so when I saw they were participating in restaurant week I made a reservation right away ($30 for a 3 courses). We came here last Saturday night with our friend Paul who had never been here before either. While RW can sometimes take away from the experience certain restaurants would typically provide, it's a great opportunity to see what the restaurant might be all about without walking out of there with a $200 tab. What it really comes down to at a place like Carpe Diem, $30 would typically get you just an entrée. So you can look at it however you would like, but pretty much just tell myself that I get a free appetizer and desert with my meal.All 3 of us participated in the 3 for $30 - However, since they were offer their full menu as well, we started our meal by sharing the seared rare tuna as well as the steamed mussels. Both were VERY good. I then had the potato soup. It had a little bit of truffle oil and what they call \"duck bacon\". Paul and I both agreed that there is only one type of bacon in this world and it comes from animal that goes \"oink oink\" haha. With that said, the soup was tasty and of course I inhaled the entire thing. I then had the pork chop - I would have to say this this was just average. However the mashed dumpling squash that came with it was very very good. It might have been the highlight of the entire entrée. I had a bite of the hanger steak as well as the fried chicken and those were both delicious. Of the 3 entrees that came out I would say the pork chop came in last place. For dessert I had the coffee crème brulee. For my liking, the top was a little over cooked/torched - I really had to press down to break it with my spoon - but I didn't mind it. The custard was delicious so it kind of makes up for it.Since meeting Paul, he's been really teaching us a whole lot when it come to wine. There's a reason why he's the \"wine guy\". He's picked up on the types that we like and brought a GREAT bottle of wine to dinner for all of us to enjoy (THANKS PAUL!!) Overall, I had a great evening and I got to enjoy CD with GREAT COMPANY. I can't wait to come back and try this place again!"], ["Nicole T.", "Great dinner experience here with a close friend and Charlotte resident!  She had previously heard good things about the establishment and wanted to try it out, so we did.  The atmosphere is classy and chic.  Began the meal with cocktails, which were good but on the weaker side.  Our waitress recited what seemed to be 15 different specials for the evening, and new every detail of each--down to sauces and ingredients. I was quite impressed! For the main course I ordered the Duck Confit, and it was tender and fell right off the bone.  Overall a good dining experience!"], ["Paul C.", "Went here for Restaurant Week with my friends Marco and Allyson. With all the rave reviews, I had high expectations, and Carpe Diem delivered!The first thing you notice is the decor. A LOT of work has been put into making Elizabeth Avenue Charlotte's premier dining destination, and it really looks great! The trolley will FINALLY provide service this summer after a decade of work, and I'm sure the business owners can't wait to finally get that trolley up and running. The interior of Carpe Diem is very beautiful, with dim lights but not \"dark\" (don't need to use your smartphone camera light to read the menus....yeay!). Lots of wood all around and a very romantic atmosphere.Since we all chose the Restaurant Week menu, we of course were limited to that selection. However, we couldn't resist ordering a couple of things off their \"regular\" menu, and we got the Seared Tuna and Mussels Apps, The Mussels had a cilantro white wine broth that was delicious. The tuna was cooked perfectly with that nice sear with sesame seeds on top. So off to a good start!I started off with a potato soup with truffle oil. Now if you know me, I order anything that's got the word \"truffle\" in it and it was a solid effort. I would have liked a bit more truffle oil as I think they put just a couple of drops so I really couldn't taste too much truffle. Allyson got the salad with goat cheese and THAT was quite tasty as the goat cheese was lightly coated and flash fried. Love chevre!They then surprised us with an Intermezzo sorbet with Thyme to cleanse our palates. Nice touch.Next up was the Hangar Steak with crumbled blue cheese and creamed kale. I asked our waitress to bring it however the Chef recommends, and she asked if Medium Rare was good. I said yes! But it came out more \"rare\" than medium, but it was still tasty. I'm not a huge blue cheese lover, but the older I get the more adventurous my taste buds become so I now order things I never used to. While good, it still confirms that blue cheese is not my favorite. The creamed kale was average, and this also confirms that I do not like the hard, chewy texture of kale.My buddy Marco got the pork chop and Allyson got the fried chicken. After tasting both, I thought Allyson's chicken was the best thing on the table. It was juicy on the inside and crispy on the outside. In comparison, this chicken was better than the famed Leroy Fox's. The pork chop was good but not mind blowing.The piece de resistance was the dessert! I got the Chocolate Crepes with caramel sauce and creme angliese. OMG were these things DELICIOUS! They were filled with a chocolate mousse or creme...no matter, it was EFFEN GOOD! Marco got the coffee flavored creme brulee and that also was quite delicious!Because my friends were kind enough to invite me to this special meal, I brought a great Napa Merlot (their fave, not mine) from Nickel and Nickel. I figure IF I'm to endure a Merlot, might as well bring a top notch one, and it paired nicely with our food! Their corkage fee was only $15 which I find very reasonable for such a top end place.So thanks to Marco and Allyson for making a generous invite. We've all become good friends in such a short period of time....remarkable how FOOD can bond people, even though I'm more than 20 years older than them.And thanks to Carpe Diem for delivering another really good restaurant week experience! I look forward to going back!"], ["Amy C.", "S'wonderful, s'mahvelous.  What a wonderful evening in a beautiful restaurant with delicious food!  The other reviews about the romantic atmosphere are spot on - the exposed wood, low lighting, gorgeous light fixtures, white table clothes, comfy chairs, artwork... everything is just perfection.  We had an early reservation that on a dreary January Tuesday evening wasn't really necessary, but it's always nice to have the option - I would imagine that on date nights, this establishment is packed.  We were able to easily park in one of the two large lots for Elizabeth Ave businesses.  Be mindful of the tracks that run down the street, cracking your ass in front of a first date could be catastrophic (or a good story for later).  Fresh, warm bread and butter (plentiful butter, instead of one tablespoon that people have to fight for) were brought to the table.  Our waitress explained the specials of the evening in detail and gave us time to look at the menu and decide.I opted for the fried (boneless) chicken breast and Yukon Gold mashed potatoes, sauteed spinach with shallot-black pepper gravy.  My serving was two smaller chicken breasts that were fried perfectly, not greasy at all, and were very tender/juicy.  The mashed potatoes were buttery delicious and the sauteed spinach was seasoned just right.  The portion and flavors were spot on!For dessert I had the cherry cobbler which was served with vanilla ice cream.  Again - perfect.  Buttery cobbler with just-tart-enough cherries, and just enough ice cream and whipped cream to complement the dish, but not dairy it down.  From the moment we walked in the door, I could tell it was going to be a wonderful evening.  The host was friendly and helpful (asking if we were celebrating any kind of occasion), the waitress and staff were attentive without hovering and the food was one of the best meals that I have had recently.  Queen's Feast 2015 is starting soon - I would definitely put Carpe Diem on the list as a stop!"], ["Rod O.", "Beautiful!  Romantic!  GREAT Service!  Fantastic FOOD!  Impress a Date or Client!  Funny, I have Never taken a Date here yet!  So it is a nice place to take a MaleFriend and have a quiet Dinner!  Not as Pricey as you would think for the Total Experience!Beef is usually what I want here and I have tasted many of the other dishes my Friends have ordered... Entrees are Meals (not a la carte) and a VALUE for the Quality! Potato (dish) many different ones, sometimes a Potato Pasta... One time we got here so early (5:00 PM) the Chef had not decided what he was going to do and let us decide... (Thin Cut Fries... YES!!!) this is a Funny place to order Fries I know and though they were good, I would rather the Chef use his Ideas, Imagination, Recipes or the internet over mine!Salad Dressings are so good it is hard to choose! I have enjoyed them ALL!Food here is Better than Del Frisco's (I will NOT be reviewing Del Frisco's) I have eaten at both in the Same Week!  The Sauces here are better than \"The Palm\"!  Value, Service and Desserts Here is better than Both!!!"], ["Rachel A.", "The mister and I came here as part of Queen's Feast, which can always be a dicey time to give an accurate review of a restaurant. However, I think a solid 4 stars is quite spot on. Here's why:I was pleasantly surprised with the large portion sizes because many restaurants tend to skimp for these kind of events. I had the kale salad and the mister had the goat cheese salad to start. Both were delicious and entree-sized portions. I appreciated the gelato as a palate cleanser between the first and second courses. We also sampled the pork chop and the shrimp and grits, which appeared to be regular items on their menu. The pork chop was massive, and the squash puree was a nice complement. I love creme brulee, so the dessert was the star of my meal. I also had the Southern Julep cocktail with my meal, but after having lived in Kentucky for several years, I can't sing the praises of a julep without the mint leaves, so that missed the mark for me. The mint was supposed to be infused according to the menu, but it seemed to have zero mint flavor to me. As as an aside from the food, many other reviews noted the ambiance, but truthfully, I wasn't digging it. For a Friday evening at dinner time, the restaurant was surprisingly quiet for being busy, and I wouldn't necessarily describe it as having low, romantic lighting either. The crowd seemed generally older, so maybe a great place to take parental visitors."], ["Jim M.", "Yelp said the restaurant was the 8th best vegan restaurant in Charlotte (7th on Google Maps).  But there was nothing on the menu that was truly vegan.  How does this happen?  And when I asked for a Vegetarian dish with no cheese I still got cheese.  This is an expensive restaurant and you would think that the waiter would get your order right.  2 stars for mediocre service, high prices, and no vegan options at the \"8th best vegan restaurant in Charlotte\"."], ["Winn M.", "Favorite restaurant in Charlotte, hands down. Solid, consistent and great. Great atmosphere, service and food. Since days on Tryon St., Carpe sets a major standard for excellent dining in town.Cheers!!"], ["Breland F.", "Food was great & service was excellent!! The coconut pineapple cake is the best dessert I've ever eaten!!I also thought the acoustics were great - we could hear each other speak without yelling, which seems to be a luxury lately.They changed to plate set for my cobia without any grief which was appreciated!!"], ["Nick W.", "Recently took my fiancé here for our anniversary. She is always skeptical about spending the money for a nice meal, but this changed her mind completely. She had a kale salad with grilled chicken and was blown away. I told them about the occasion when I made the reservation, and when we arrived they had put confetti on the table which was a nice touch, and the server immediately congratulated is upon greeting, little things like that go a long way with me.I had the grilled quail with a butternut squash purée, and for dessert we shared a toffee cheesecake. This was one of the best meals I've had in recent memory, and after a couple glasses of wine, two entrees, dessert, and tip, the bill was only about 80 dollars, and I promise it was worth every penny. Will DEFINITELY be returning here"], ["AP P.", "We had a table of 10 people so we shared a few appetizers and my favorite were the Fresh Squid and Mediterranean Meze Plate. For dinner I ordered the Pork Chops and I was not disappointed. I highly recommend this place and since we had a few people that were vegetarian they too enjoyed their dishes. For dessert we ordered one of each...I forgot what they were but all of them were awesome. I would go back there in my next business trip."], ["Angela P.", "One of my favorites! The buttermilk chicken and grilled grape salad are outstanding. the bulldozer martini is great.  Great value for the money."], ["Joya D.", "Took a colleague for dinner here and had nothing but specials! It was really good, a white fish, can't remember the name over savory crepes.  Delicious!! The service was fantastic as well.  The server was knowledgeable about the menu and its components, which is always a good thing.  My colleague was pregnant and couldn't have several items, but he explained everything thoroughly which made her comfortable, which ultimately made me comfortable as well. All in all - Four Stars.  I am returning next week for Queen's feast where I will more than likely eat off the regular menu."], ["Robin C.", "Beautiful interior, excellent service, divine food.  That is all that I really need to say.  However, there are mentionable aspects that set this restaurant apart from others.Carpe Diem is the quintessential date night restaurant.  It features romantic lighting, a carved ceiling and large paintings of flowers.  What could be sexier than that?  We had reservations and were seated immediately.  There were several nice wine selections by the glass, and, although they were pricey, they gave you a darn good pour.  In fact, one glass each took us through dinner.We were brought the most delicious bread with butter.  I rarely eat bread, but when I sampled theirs, I ate one and a half pieces.  Bad girl!I was pleased to see that they featured Anson Mills products on their menu.  And, even more delighted with the offerings of vegetarian and vegan selections. They even had a vegetarian special for the night.  How thoughtful!I did  order that vegetarian special.  It was a tart with a whole grain crust, covered with tomatoes, asparagus, cheese and a perfectly cooked over easy egg.  Phenomenal!  My date ordered the Anson Mills rice grits dish that featured their sea island red peas and Gouda cheese.  He chose the mushroom option instead of the shrimp.  Again, a stellar dish.  A five star rating seems skimpy with this kind of quality.  I rate them an entire solar system!"], ["K M S.", "Wow! This was the first time my husband and I have ever been to Carpe Diem but it will not be our last. Today was our anniversary so the decorated a private table for us. Another touch they gave us was desserts with a candle amongst other unique perks. The food was outstanding. We had the vegetable pizzetta to start, for entrées: salmon, and the duck. Dessert (made in house): mocha Oreo pie with mascarpone whipped cream and coconut cake with ice cream. Yum! Portions were huge for a fancy restaurant. Ask for Yolanda if you're looking for a great server. You won't be disappointed!"], ["Lauryn C.", "I'm still wildly impressed with this restaurant.  They just can't seem to disappoint me they not only serve some of the best food in town but the people that work there truly make you feel welcome and I love that!.  After trying to decide where to take my guests out to eat Saturday night I decided I had to take them to Carpe Diem I just didn't want to try a new restaurant and risk being disappointed. Everything we ordered was perfect, a cheese plate to start with, and I went with the  $23 filet mignon special that was out of this world.  There are so many options on the menu to please any vegetarian or carnivore.  Just one more reason I love this place."], ["Ash M.", "We used Carpe Diem to cater our wedding, and it they were nothing short of outstanding.  Bonnie is amazing to work with - she is unbelievably creative with her cooking, and really helped us to get the exact experience we wanted.  Our guests all raved about how great the food was, which was really important to us as foodies.Every time we've come here as diners, the experience is just as good.  The only time it wasn't to the nine's was during restaurant week, when (like most establishments) they are extremely rushed.  Definitely give this place a try, it's 100% worth it."], ["Michael L.", "Decent food.  No desire to go back for a second try.  Salad was good but the fried chicken is very bland.  I don't know why the place is supposedly known for fried chicken but it does not even break my top 10 for fried chicken.  I'm from the south and know fried chicken.  It was tender but very, very bland."], ["Crystal P.", "I dined at Carpe Diem during restaurant week with a group of 7 others.  The goat cheese salad featured some tasty onions and tart goat cheese, but the dressing was lacking in flavor and it definitely didn't live up to the expectation that several \"yelpers\" had set.  The salmon entree was spot-on, and the relish topping popped with incredible flavor.  Finally, the chocolate pudding was decadent and the perfect end to the meal.  My only complaint was the service.  Our waitress appeared to be in a less-than-enthusiastic mood from the start.  She rushed our drink orders within 30 seconds of being seated, required that we order appetizer, entree, and dessert all at once, failed to refill drinks, and then made errors on our receipts.  I love enjoying a fancy meal out, but there is simply nothing more frustrating than sub-par service.For more details, including pictures, you can read my complete review.trifoodiemd.blogspot.com…"], ["Will H.", "This fine restaurant deserves 5 stars if for no other reason than the hands-down most artistic and romantic ambiance in the entire Metrolina region.  Seriously, I feel like I'm sitting in Bilbo Baggins' hobbit hole with all the bowed wood and twisted iron.  The wine rack behind the bar looks like a many-branched oak tree.  The bar and dining room just call for a most-intimate dinner.Luckily, the food is just as quality as the environment.  Little galvanized metallic boxes hold fresh-baked rolls for the table.  The many-seeded variety are best- tasty and a good mix of crunch crust with a softer inside.  For a salad course, I'm a big big fan of the grilled grape.  The micro-greens are always garden-fresh and when you get a grape, they each have just a hint of smoke taste that blends nicely with the blue cheese but is a unique surprise.  The goat cheese salad is also very good, but still in second place, in this Yelper's humble opinion.Between the salads and the entree, we've always had a small intermezzo course of fresh sorbet.  The flavor changes, but is a great palette cleanser regardless.  Entrees run the gamut from a couple fresh fishes, pork chop, and a (very tasty) buttermilk pan fried chicken.  The selection is well manicured so that just about anyone can find an option.  The even make a point to have at least one vegetarian entree option every night.  Even the vegetables that accompany the protein are artfully done.  Foodies will appreciate the detail that goes not only into each of these dish's components, but the way the flavors and matched together.I'm even a raving fan of their desserts.  These can change regularly, but you can count on at least one chocolate option and a cheesecake.  Everything is made from scratch and the portions are perfect for sharing.The staff works in a team approach, though your server is leading the effort.  Courses and delivery are expertly paced and everyone is very knowledgable about the menu and the bar.  I always feel very well taken care of.  We can never seem to leave here for under $50 a person, with a drink or two, but I never mind, the quality of the food and the service are on a plane above most of what you'll find around town."], ["Anthony D.", "This place is awesome! The food is delicious and beautifully plated. Great wine list and seasonly selections. Staff is very pleasant and know the menu very well. My wife and I will be back."], ["Flavio D.", "Carpe Diem is one of those gems I wish I had discovered years ago.  It is on the pricy side, but boy, will you get out of there happy.  These people know how to serve the best food: The carpaccio was tender and defrosted to the right amount.  The hanger steak was cooked properly and to perfection.  And don't me started on the grilled grape salad.  I could go back just for that. They know their wines - the recommendation of the Spanish white was 100% spto on.  The service was impeccable and the place is gorgeous - decor, architecture and the location in the heart of Elizabeth Avenue."], ["Elizabeth H.", "I had high hopes for this place. Maybe it was because it was restaurant week, but I was not impressed. The only good thing I have to say is the wine I had was excellent. Our waiter was lacking and did not explain the menu or specials. I had the goat cheese salad and it was good, but did not blow me away. We we're suppose to get the sorbet between courses to cleanse our palate but it seems he forgot to bring it. When the main course finally came I had to ask for a knife and he seemed to have forgotten who ordered what, so there was a lot of shuffling of plates. I got the trout and again I was not impressed. Dessert was the same, nothing special. Maybe this place is good when it's not restaurant week but I am not sure if it's worth the price."], ["Andrew L.", "Great service and a nice but relaxed space.  The food was creative and interesting.  I tried the salmon special, which was cooked to melt-in-your-mouth perfection.  It's fairly pricey, but I would recommend giving it a shot for a nice occasion."], ["Deb C.", "Yes, 5 stars for this wonderful restaurant. It's now one of my Charlotte favorites and I'd urge readers to seize the day (ok, had to say it!) and give my new fave a try.The atmosphere is lovely - white tablecloth service, beautiful oversized floral paintings/photos adorn the walls, polished wood throughout and faux flickering candles on the tables. A low murmur could be heard throughout the room but it was not overpowering (not a fan of noisy restaurants).The service is outstanding.  Attentive, smiling, helpful and friendly from the host staff to the wait staff.And the food?  Heavenly.  I went with a group of 6 and all were unanimous in praise of their meals.  Warm sourdough bread with sweet butter that melted in my mouth was a good place to start.  If you like goat cheese, you'll want to try the warm goat cheese salad with apricot jalapeno vinaigrette dressing. The goat cheese is encrusted in hazelnuts and the flavor and texture are outstanding.For an entree, I ordered the pork chop prepared medium (first time in years I've had a pork chop and I was a bit nervous to try).  Marinated in apple cider and grilled, served with a divine jalapeno and goat cheese cornbread pudding and carrots, this was a pork chop for the ages.  Oh my goodness...I'm serious here though a bit effusive.  It was really that good.  Even better was the cornbread pudding and some type of salsa verde on top that brought all the flavors of the meal together.  I would order it again were it not for my desire to try every other selection during my next visit.  Which will be very soon.Dessert selection was Belgian chocolate cake with a raspberry sauce.  This is my favorite combination of dessert flavors and it was quite good.I skipped my normal girlie martini so can't report on the skill of the barkeep here but the wine list had very good selections and thankfully I chose well on this evening.Enjoy great food?  Add Carpe Diem to your list!"], ["Shauna C.", "Very much enjoyed my dinner at Carpe Diem. I had a tasty scallop dish albeit a bit small portion wise and two delicious starters - the tuna and calamari. I was happy in the end that I did get appetizers or my meal might have been a bit small. The real stand out was the fresh bread- wow delicious..I literally couldn't stop reaching for another roll - even after I was full! Our server was friendly and attentive- he recommended a nice chardonnay for my dinner and was pleasantly surprised it was in the $8 range.The atmosphere was a little stark- nicer for a quiet date than a girls night. Overall id say bring your wallet- my meal with two drinks and an appetizer was about $60. I would absolutely visit again since everything was really yummy!"], ["Nicole W.", "Seize the day and get your hungry self over to Carpe Diem. While Carpe Diem is a little fancy pants to just roll into with jorts and a Dale Jr. tee, make the effort. It's a lovely restaurant- beautifully appointed and as Julia S points out - stellar service and impeccable pacing. I've taken many of visiting family members here and I've never had anything less than an extraordinary meal. It's not a cheap meal, but it's well priced for the quality and quantity. For two of us with a few courses and a bottle of mid-price wine we usually spend about $120-$150 (including tip). Some of my favorites...Warm Goat Cheese (salad): I mean, really, it's warm goat cheese over delicious greens with hazelnut crunch. It's so good you basically want to start fist pumping through the restaurant.Cheese Plate: A very generous and tantalizing plate of cheese of the day. As Julia said - the accompaniments make it stellar. Scallops: I've had them so many different ways here I can't even count. One time they had some vanilla essence another atop of risotto. Both times they were out of this world. Cooked and seasoned perfectly. Plus they give you a very generous portion of large scallops. YUM.Desserts: They special make their desserts daily and I wish I could remember what I've had here. I know I've had some delicious type of creme brulee and something uber chocolately. Regardless, I don't think anyone would be disappointed with their dessert selection!"], ["Robin B.", "We received a BoGo coupon in the mail and tested this place out. We walked in and were surprised by how quiet and welcoming the atmosphere was. I ordered the Buttermilk Chicken Breast dinner and the meal was fantastic. One of the best chicken recipes I've had. Everything tasted like it was made from scratch.  I have no complaints and would certainly visit this restaurant again."], ["Uyen C.", "Yelp brought us here, and it is as good as it gets!This restaurant lives up to all the great reviews it has garnered here on yelp.  Atmosphere is cozy, service is phenomenal!, and food was sooo great!  The goat cheese salad was to die for!  Entrees were so good, and so were the desserts.  It was a wonderful dinner and I definitely will come back."], ["David A.", "Fantastic meal with impeccable service and decor that would leave Alphonse Mucha green with envy.Confronted with a hunger and desire to take advantage of restaurant week, we showed up on a Friday night around 5 without a reservation and was--amazingly--able to get a seat at a small table in the bar area.Bread, service, and water came quickly from the attentive and friendly staff. After ordering we were attended to just the right amount: not too pushy, yet not absent.While enjoying the bread, which is fabulously fluffy on the inside and crispy on the outside, we soaked in the ambiance: romantically lite room, beautiful woodwork, and mesmerizing back-lit vines.For the first course, we shared two salads, the goat cheese  and the grilled grape. Both are fantastic. I particularly enjoyed the blue cheese vinaigrette on the grilled grape, which only hints at its blue cheese roots.Next, we had the (famous) buttermilk fried chicken and vegetarian cous cous. Again, both were wonderful. The chicken was slightly battered and fried, which was a refreshing contrast to to more traditional fried chicken. The cous cous is a cornucopia of veggies and, well cous cous, in a light tangy sauce that I couldn't get enough of. Both are highly recommended.Finally, dessert involved sharing a walnut and pecan pie (delicious, but I like my desserts like I like my chocolate--with chocolate) and a chocolate (yay!) bread pudding. The latter earned a paragraph unto itself.Through years of diligent research, I've reached the conclusion that many chocolaty cake desserts are a let down. They are either not moist enough, too sweet, not sweet enough, too much, or just not satisfying. Yet still, time after time, I trepidatiously order the chocolate whatever in hopes that somehow, this time would be different. Usually, I am let down. However, this time at Carpe Diem it was different: this was the perfect mix of chocolaty goodness delivered via an appropriately moist vehicle for facilitating the devouration (yes, I just made that word up) of said chocolatly goodness (the bread pudding). I realize my error has always been relying on the traditional 'cake' delivery method. No longer. If ever you get the chance, you need to devourate (oops, I did it again) this chocolate bread puddingIn a final note, there is the bar area and the official dining area. We actually preferred the bar area on account of the lighting and more intimate nature of the experience. Still, the dining area has beautifully crafted art nouveau woodwork, a flower centerpiece, and wonderful artwork. I would return just to admire the place."], ["Linda L.", "OMG. Service impeccable.  The food and drinks were spectacular. My husband enjoyed the fried buttermilk  chicken dish ( he said to die for). I had the special -pink snapper, with red risotto, topped with mushroom salad and  crab stuffed zucchini flower (a first). The tastes blended perfectly. The  dirty martini was well made, and the salad with fried goat cheese was very nice! I liked the touches like sorbet between appetizers to clear the palate and the little giraffe holding olives on my martini glass. We'll definitely return and highly recommend."], ["Christopher M.", "This is a follow up to an earlier review I wrote about this restaurant.  I recently ate here again and the experience was just as phenomenal as the first time.  The environment still reminds me of something from The Hobbit.  It is so unique and intimate feeling inside.  There is truly nothing like this place in way of atmosphere in all of Charlotte.  As you might imagine, the food is to die for.  That said, save room for dessert.  You have to try the creme brulee or something on the dessert menu anyway - it is all amazingly delicious!  That said, a few things I would I would highly recommend: make reservations since Carpe gets busy and plan out your parking strategy before you get there.  I really mean it about the parking because if you go on a day when it is busy, you will search and search for legal parking.  Nothing will spoil a night more than finishing a wonderful dinner only to discover you have a ticket or your car has been towed.  My car was safe on this visit - thank goodness."], ["Bethany R.", "I went here for restaurant week and had an amazing experience!!!  First of all, the ambiance is awesome - cool back-lite vine and flower designs all around the bar area along with arch-shaped ceilings in the main dining room with crazy windy metal vines and flower lights.The service was perfect.  My water glass was never less than half full and all of the food arrived in a prompt, well timed order.  There was always someone there to check on us, but not in an intrusive way.The food was delicious!  The bread is fresh, warm, flaky on the outside, and soft on the inside.  I started with the hazelnut goat cheese salad which was amazing.  Then I had the fried chicken breast with mashed potatoes and spinach for my entree.  Apparently this is one of their most popular dishes, and I can see why.  The chicken was battered and fried to perfection and covered with a light, flavorful gravy.  The chicken was served on the mashed potatoes and wilted spinach.  Surprisingly, the dish did not feel heavy, like most fried chicken entrees.  I ended with the chocolate-carmel bread pudding for dessert - it was also awesome!  Nice and warm and gooey with a scoop of vanilla ice cream on top.The waitress told us about 1/2 off wine bottle and appetizer specials during the week - so I definitely will be going back to Carpe Diem!!!If you are looking for a quiet, romantic, intimate setting for a date, this is the perfect place!"], ["Mike P.", "An old standby that actually sources their food. Very upscale for the price, friendly service, but most importantly fresh and local cuisine. Always on my go to list!"], ["Karen B.", "Carpe Diem is a special place.  The interior looks like it's been there forever, maybe as some old, upscale law firm or church, but it's also updated and modern, and you spend the meal trying to figure out how to update your house to look exactly like this.  The prices signify that this will be a celebratory meal, but it also isn't too expensive that you couldn't just be celebrating a darn good Wednesday.  And the level and quality of service is impecable.Our waitress asked if we had somewhere we needed to be after dinner and if there was a certain time we needed to be out of there by - perhaps my date's tuxedo tipped her off?  Regardless, she kept us on schedule and (we realized when she brought it) had even tagged the check with our goal departure time.  As we left the restaurant, I looked at the clock and realized we were 5 minutes ahead of the time she wrote down; now that's service.With the stage set now for a great evening, the food doesn't disappoint.  My boyfriend and I each ordered the goat cheese salad, which had a surprisingly sweet and spicy kick from the jalapeno apricot dressing.  For our entrees, he got the duck, which was slightly pink, succulently juicy, and perfectly topping a mouthwatering sweet potato polenta.  Are you drooling yet?  I ordered the buttermilk fried chicken, and I almost proposed to it, it was that good.  There's no \"if you love something, set it free\" mentality here; I scraped up the last little tidbits with a smile on my face.  By the time dessert came, I could barely finish my chocolate caramel bread pudding, but I tried my best; although I was nearly married to the fried chicken, I'd consider taking the bread pudding as a lover.  Carpe the experience, and enjoy!"]], "Zen Asian Fusion": [], "Viva Chicken": [], "Blue Restaurant & Bar": [], "El Pulgarcito De America": [["Stephen B.", "Food was PHENOMENAL! Very authentic, with excellent drink selection. I had the limonade, which was s delicious frozen-type drink (non-alcoholic).I had the pollo asado (chicken, grilled with excellent flavor plus rice/beans/salad). The best part was the combinacion;which included an empanada, tamal, and a pupusa. All three were made fresh and piping hot when they came out to the table. This restaurant is now my new favorite Authentic Latino joint in town"], ["Journey N.", "Service:  Excellent.  The waitresses were kind, personable and funny.  Food:  Fajita Mixta was just not that good.  The chicken was too salty, the steak was OK, and Prongs just plain bland with overall loads of onions.  The salad, rice, etc. was pleasing.Walked away unsatisfied, but did not express that with the waitress who provided excellent service. Maybe on Sundays there is a different cook."], ["Peter M.", "Went for lunch with my friend Matt.  Easy parking and super friendly staff (yes, English is spoken).  Great menu which needs a few more visits for me to get a good handle on it . . . no problemo! The food was fresh, fast, and tasty (although I thought the plantains were overcooked).  Nice variety on the plate, and a refreshing departure from rice-n-beans.  Diner-style layout.  Family friendly.  Credit cards accepted.  Give 'em a whirl!"], ["Annika W.", "It's hard to pick a Mexican or other Latin food option with how abundant they are on Central Ave. My favorite is still Three Amigos, but this one is a good alternative. Dishes are huge and come with all kinds of things (beyond rice and beans you can get yuca, plantain and other sides). Food here is a bit heavier and not quite as fresh-tasting as Three Amigos' is, but still good.The options here are bigger and while you can get fajitas and burritos, they also have other dishes like seafood soups and all kinds of entrees. It's very cheap, especially considering regular menu items seem to be on special occasionally - same dish, lower price, such as chicken and veg fajitas for 6.99 recently. (Great option, at least veggie fajitas here doesn't just mean onions and peppers but also squash, broccoli, etc.)"], ["Emily H.", "Service was great, food came out fast and fresh. Everything was delicious and affordable. We got pupusas and plaintains and it was AMAZING. I'll definitely be going back."], ["Cristina M.", "Great food! People were always flowing in throughout the night so the restaurant stayed full. The menu included Salvadoran, Honduran and Mexican food. We stayed with the Salvadoran food which was excellent. Pupusas with cheese. Delicious. Plate called: Super Tapatio including grilled chicken and beef, shrimp, fried yuca and plantains, rice, refried beans and salad. It was equally delicious. The plantain empanadas filled with \"leche poleada\" which is a sweet milk, rice flour mixture. It was different and delicious!I'd go back any time!"], ["Kim A.", "OMG - Their steak is seasoned so well, love it.  Horchata, yum.   Street Tacos Rock.  I too had a coupon but had a tough time spending the min. amount even with a family of 4.   more than reasonable prices, great food - wish it was closer to waxhaw area, but well worth the drive."], ["Ana C.", "Last year my bf and I found this place through Yelp while searching for restaurants that were open pass 10pm- We stumble across this restaurant and now  always order over the phone. All staff is Spanish speaking, so make sure you know some spanish before ordering food over the phone. We normaly order the bean and cheese pupusas, carne asada tacos, carnitas tacos and chicken tacos, and all are pretty good. Their green salsa is delicious and Carne Asada quesadilla is good too. With $26 you can feed 4 people- the prices are pretty reasonable.  We are regulars here. The food is great and pretty authentic--- A must try if you want to venture down Central Ave."], ["Ben C.", "My two friends and I were the only gringos there. Solid service and huge portions.  I ordered beef tongue enchiladas.  They would have been perfect if they would have seared them at all. They were great and flavorful but needed some crust and rind on the meat. Such a fatty and soft meat feels like you're eating raw beef after a while. The guys at the table got chicken and a burrito neither of which they could finish and these guys can eat.  Horchata could have used a tad more sugar but I loved it anyway. Will return for sure and try something new."], ["Jasmine T.", "Love this place! This is true Central American food. You get a bang for your buck and and the food is delicious. It is kind of essential to know Spanish going here but what other great way to practice than with natives!"], ["Joseph P.", "Well... I found my new favorite Mexican place in Charlotte. SO authentic and fresh. Get the pupsas!! Everyone talks about them for a reason. Wow the pork and cheese is the best.My tamale was super fresh and bursting with authentic flavors. And the taco I had was also unlike any I've had in the city. The side of plantains came with beans too! Delicious. Can't go wrong here."], ["Brooke M.", "One of my favorite restaurants in Charlotte! My husband is from Central America, so our family frequents this great hole-in-the-wall for their incredible papusas, shrimp with cream sauce (camarones con crema), and the huge platter of grilled meats (tapatillo). The food is authentic, fresh, and outstanding! And even if you don't know much Spanish, don't avoid this great place because the menu has pictures and the staff are very friendly! This place is a local classic!"], ["Joanne A.", "The Pupusas here are Amazing. I went to El Salvador once for 3 months and everyday this is what I ate. Since then I've been looking for a good Pupusa. The toppings are the best I've had - better than what I had in El Salvador. The staff was really nice too!"], ["Diana J.", "This is actually one of my favorite Latin restaurants in the area. The only reason for the 4 stars is you really have to watch with breakfast because they will often cook even sunny-side-up eggs to death so make sure you're very clear if you want them cooked medium or less. And I'm a real egg freak... I've been to this restaurant several times and ordered a variety of items. The Platillo Guanaco will satisfy even the hungriest carnivore with a protein urge, while the seafood soup will almost make you cry it's so good! Oh and for breakfast it's excellent here- with a delicious green salsa for huevos rancheros (but heed the previous egg warning well). If you're used to the thin Mexican style tortillas these are really very thick and may surprise you, but they are very good. Also they have agua de jamaica, and I can never say no to that. If you don't speak Spanish it can be a challenge here, but well worth a little confusion. I speak Spanish and there has been occasional confusion anyway, but they always jump to fix anything that you think might have gone wrong with your order. Parking can be a real challenge as their lot is frequently full (a sign of how good it is), but like the occasional order confusion it's still very worth it.The prices here are a real bargain. I think another reviewer mentioned having to get a table-full just to be able to use their Groupon and that is about right. This place will definitely not kill your budget, all while serving surprisingly well-executed and extremely large dishes. When I order a Platillo Guanaco (the chicharron is pretty dry though, so I skip it and get more steak) I have 1/4 to 1/3 of it in the restaurant before I'm full, taking the rest home for 2-3 more meals."], ["Emeril B.", "Excellent food and incredible value.  I have traveled all throughout Central America and can tell you that this place is very authentic. I had the tapatio plate which is kind of like their sampler. It came with chicken, steak, shrimp all grilled also had a salad, rice, beens, pico, sweet and green plantains and fresh made corn tortillas.  Everything was cooked perfectly and the staff was extremely friendly. Will definitely be back here"], ["Giselle A.", "They have the most amazing pupusas . I have had them at other places and most definitely this is the place to go... They have a friendly atmosphere and the servers take care of you as soon as you walk through the door .."], ["Michelle M.", "We first found out about El Pulgarcito through a GroupOn they had a while back and since I am always on the look out for any type of Carribean/Mexican/Central/South American food I was really excited to find this delicious Salvadoran spot. When driving down Central I usually stop at Three Amigos, so if it wasn't for the GroupOn I don't think I would've ever made it far enough to find this place.Let me just start off by saying that we had to spend $35 for the deal, and between just two people it is nearly impossible to do that at this place. What made it even more difficult is the fact that they had a whole fried fish on special for $6.99 that day and I can never say no to fried fish when it comes whole! It came with a salad, rice, refried beans, and a homemade salsa and it was TO DIE FOR! This is the type of food us immigrants seek in the U.S. because one bite and we are instantly transported to a beach somewhere back in our country (mine is Venezuela!). I don't remember what my husband ate, but we did get several types of pupusas, tacos, empanadas and other sides as well. I felt like we were at one of those Brazilian steakhouses where the food just keeps showing up at your table because to reach $35 we had to just keep ordering A LOT! Needless to say, we both went into food comas and were completely worthless the rest of the day, but it was totally worth it. This is a really great place to try too because it has a huge variety of offering, not just Salvadoran food, but Mexican as well. They also have pictures on the menu so if you're not familiar with a specific dish it is easy to order from the pictures. El Pulgarcito offers friendly service and delicious food at incredibly low prices, there's not much else I look for in a restaurant!"], ["Joey F.", "Best Latino restaurant in Charlotte. They have Mexican and El Salvadorian selections.The papusas are a must. Surprisingly their fried chicken is amazing. Also they have a very good Tres Leches cake. Very cheap compared to the competition in Charlotte. Very Clean too."], ["Dawn A.", "I found out about this place via one of the local magazines when they did a story on the various eateries on Central Avenue and Pulgarcito was one of them. Let me tell you.....the Asade Carne Torta is the ish! It's a mexican sandwich and it's the best damn sandwich I ever had. I also had the shrimp soup and it soothed my soul. This place isn't fancy but the food is stellar and the prices are very reasonable."], ["Tiffany N.", "Holy perfect pupusas batman! Ok so I dont know if they were perfect pupusas but they were everything I dreamed of and more. Warm, gooey and when you looked under the hood, the combination of beans and cheese living in bliss (and soon my belly) was a heavenly sight.The only issue? I kept having food envy as the waitresses brought out other tables dishes which then made me question the pupusas. So that means I must go back and have some platter of yummy, ethnic goodness for 8 bones or so, I can do that.I like the decorative deer heads on the wall. I kinda wanted to go up there and hang my pupusas on the antlers......instead I ate them.4 items and my bill was under $7--holla if ya nasty!"]], "Malabar": [], "Soul Gastrolounge": [], "Dandelion Market": [["Kelly E.", "Came here for brunch and we were not disappointed. Their Low country hash is wonderful and filling. Prosciutto Benny was really good as well, but it was a smaller portion. Will be back!"], ["Emily C.", "Wow. Gross. Ew. Steak skewers were charred black. Pomme frites were from Applebee's. French Quarter mussels tasted like a Red Baron frozen supreme pizza with less flavour. The scallops were delicious and the only saving grace. What a travesty of a restaurant."], ["Heather M.", "My boyfriend and I went here on a Wednesday night, atmosphere was great. We love the simple arrangements of tables and brick walls. We came to Charlotte  from the Orlando area (suprisingly foodie  friendly ), and were  expecting  to be bowled over by the food.Sadly, this wasn't  the case.  I ordered  a drink that had some fancy name but was basically  a gin ricky.  I had to send it back for more St. Germaine because it was tasteless. We ordered the cheddar  sliders which were flavorful but the bun was so dry it crumbled in your hand. Then the mussels, meh is the only thing I can say. I'm used to there being at least an inch of delicious creamy soup with giant amounts of bread. I get it, tapas. But seriously, 2 little croutons each? No worries, they were pretty bland regardless. Then the bizarre greenbeans came.  Basically take some regular ol greenbeans  and coat them in bottled sauce.  I thought they'd  be great fried as a finger food as it was tapas  but nope, wet and weird.  Service was fine, not spectacular  but average.  I  wouldn't waste my time here until they correct what's going on in the kitchen."], ["Joannie T.", "I am picky about food. The Dandelion Market passed the test.I had prosciutto and baked mussels. Both excellent. The desert was a pleasant surprise. I can bake just about anything, so I am tough to satisfy. The apple ravioli succeeded. The right balance of softness and crispness, and the cinnamon sugar on top was just the cherry on the cake. Furthermore, the ice cream was really creamy and tasty (be careful with the ice cream you serve if you want to be appreciated, that can ruin an otherwise great pie!). And last but not least, the staff was nice too."], ["Carolyn P.", "Dandelion is one of my go to places to eat and drink in Uptown. I love the diverse options for food and the rotating beer list. Every time I'm there the staff is friendly and staff."], ["Maggee R.", "Came by for drinks and I was happy w selection of beers on tap and cocktails. Kitchen wasn't open yet. They were just putting away the bloody Mary bar so if you fancy those, it seemed like a nice setup. Customer service was good. I would recommend this place as a pit stop in the area."], ["May C.", "Pretty impressed with this place.  Good beer selection, I had a porter and it's just right.  The southern caprese was as good as other reviews have indicated.The shrimp and grits was the perfect amount, although slightly too much heat for me.  The goat cheese topping the grits made it tolerable for me.The grand finale for me was the lamp lollipops, the only thing I thought a tad disappointing was the lamb was not medium rare, but still very tender at medium done.  My server was so nice she asked the kitchen to re-make it!  I originally wanted to give this place a 4 star but it deserves a 5 star because they care!  I posted before and after so you be the judge of it."], ["Cherie F.", "Good spot for Sunday brunch. I've only been there twice but the food was good and the service was solid both times. If you like omelets and seafood, I recommend the Carolina Shore. It was fantastic. I paired it with the hash browns (they were ok but not the best) and a Bellini. Overall it was a delicious meal and perfect for post workout!"], ["Maxwell T.", "Went here for drinks and dancing, after dinner service hours. Only in town for a week so might as well hit this \"dance club\" up.The bar downstairs was nice, not packed, regardless of the line to get in outside. Not worth the 5$ cover to get the shortest, and weakest drink I've had in a long time.Go upstairs, sweaty smelly wanna be club. All I could smell was the dudes puke on the floor next to me at the bar. Head down. Literally unresponsive. Pointed him out to the bartender. Not sure if she handled it, cause I drank my drink, and left.Maybe come earlier, for food. Only because I haven't had it yet.... Lol"], ["mellow y.", "I happened upon this place on yelp, and headed here for dinner. The dishes are all served tapas style (which I love) but they really weren't that delicious (which I do not love). I was really excited to try the southern caprese (fried green tomatoes and house made mozarella) but the cheese was too firm, too cold and really underwhelming. The tomatoes were great, sauced with a sweet balsamic. That same balsamic, however, fully OVER-sauced the prosciutto crostinis beyond palatability. We had a sausage plate, fine but regular, a nice bean dish with a tomatoey herby sauce, and mussels, that seemed to be cooked in the very same sauce. Good sauce, just redundant. A cucumber cocktail was too sweet to drink and the wine was fine, but regular. I didn't hate it by any means, but it wasn't properly satisfying and I surely wouldn't go back."], ["Mike M.", "Awesome food. A do-it-yourself Bloody Mary bar greets you on entry. Food is fast, fresh, culinary ingenuity. Friendly wait staff. We will be back!"], ["Amanda P.", "had the baked potato croquettes (really good, but probably not worth the cost for only 4), artichoke dip (very filling), sweet potato gnocchi (amazing), mussels (large portion size), car bomb cupcake (delicious, even to somebody that doesn't like a lot of chocolate), mint chocolate chip cheesecake (small, but delectable), mint chocolate martini (yum!) overall more than we would normally spend for dinner, but perfect for a special night out.  great atmosphere and servers. would highly recommend!"], ["M K.", "We just got the hummus tapas plate, but it was tasty! And they brought us extra pita slices when we ran out! Overall, I just loved the vibe of this place. You could be out in the main part or tucked back into a corner where you can watch the people around."], ["Jason B.", "My recent visit to Dandelion was the 4th time that I have been there.  It was also the last time that I will go there.  I've had better experiences here.  But never good enough to offset poor food that I was served at this last visit.  The Good:  Nice selection of beer.  Pretty chill atmosphere.  Decent service.  The Bad.  The Food.  The Food.  The Food.  We started with the calamari.  Meh.  Why I keep taking risks with calamari is beyond me.  It's rarely impressive and is often has blasé as can be. But when it's good (like at Bentley's) I really do enjoy it.  And it's something that should be pretty hard to screw up.  But Dandelion's calamari was mediocre at best.  I thought the Portobello fries sounded interesting.  I was Oh So Wrong!  I love a big meaty Portobello on the grill.  I was hopeful that this dish would have a similarly robust flavor.  It was very disappointing.  Mussels are another thing that I keep trying all over town and it appears that there are only a couple of places (like the Liberty) that consistently get them right.  Dandelion's rendition was subpar.   We finished with a dish that just had to be good - The Crab and Avocado salad.  Crab + avocado + citrus is a combination that one just can't go wrong with, right?  WRONG!!!  I was shocked at how bland this dish was.  Nothing about it was good - not the presentation, or the texture, and certainly Not the flavor.  Then today as I was paying my credit card bill, Dandelion Market gave me on last swift kick to the groin.  It was bad enough that I wasted $72 on a very poor meal.  But Why did the server add on an additional $0.67 to her tip?  Okay, maybe it was a mistake and I really don't care about $0.67.  It's the principal of it."], ["Eric C.", "Decided to come here after passing it on my way to 5Church. Glad I decided to stop by instead.Ordered:-Dando Crab Cakes: 4/5. Typical crab cakes, cooked well, flavorful sauce. 2x cakes served on a bed of leafy greens. -Grilled Lamb Lollipops: 3.5/5. The lamb lollipops themselves were great, but I was not a huge fan of the sweet, black cherry based jus they were served on.-Surf and Turf: 5/5. Fantastic and definitely my favorite dish of the night. Tender scallops and perfectly cooked pork belly on an absolutely flavorful bed of sauce and pesto. -Sweet and Spicy Green Beans: 3.5/5. Fairly typical green beans served with a sweet, and very mildly spicy sauce. I would definitely come back in the future. Great selection of beer too."], ["Rob U.", "OMG.  Amazing combinations of flavors.  The shrimp n grits is to die for w the perfect mix of spicy red pepper cream sauce tempered with the goat cheese dollop.  And never thought green beans could be so good when they combine the szechuan spicy w crushed macadamia nuts. Top it off with the browny Sunday and 5  doesn't say enough."], ["Zachary H.", "Not a bad spot for a vegan bite in Charlotte. Though there are few options on the menu. Enjoyed the black bean sliders. Nice staff, and very solid local beer selection."], ["Mark E.", "1. Go here for the bar... great drinks and good choice of beer and wine. This area saves Dandelion Market from being downgraded to a two star...2. The food menu is a tapas approach with a wide variety of food.3. The downer... the food was simply bland.     - The shrimp bruschetta was a complete myeh... come on chef, dare to present some unique flavors!!!    - The black beans sliders look great but, again, a flavorless mass of myeh!    - The red pepper dip was pretty decent but lacked zing! Whenever I start looking for sauces to add to a dish that means that nothing is baked into the original recipe.A caveat... the other dishes may be simply awesome and we just happened upon the three items that were myeh... please prove me wrong with the other dishes.4. Service is well done but the young lady who seated us was a bit grouchy... after we sat down we both laughed and told her, under our breath, Have a Nice Day!!!"], ["Priya G.", "Great place to grab dinner with friends. They have several small plate options which are great for sharing. Service is pretty good as well. It's a great place for late night dancing if that's your sort of thing!"], ["Neal D.", "This is a review for brunch only. It was excellent! I had the migas and a side of grits and both were pretty good. You can't get *real* migas outside of Austin, in my opinion, but these weren't a bad substitute. My wife's eggs benny looked pretty delicious, too. I really like the vibe of the place, too, especially the music selection. Not too hard to get there from North Meck on a Sunday morning, either! We'll be back for sure."]], "Miro Spanish Grille": [["Shawn B.", "5- customer service (our waiter Alejandro was excellent.. He made a great recommendation on a white wine and was able to have my paella custom made with chorizo and chicken instead of clams and calamari.. He also surprised my gilfriend with desert for her birthday.5- drinks ( Marques de Caceres, white wine)5- main course ( Paella was perfectly cooked and seasoned)5- ambiance ( perfectly lighted, and nice layout)5- desert ( tres leches was moist and airy)5- price ( reasonably priced and good portions)"], ["Basilus P.", "For a place that has such wonderful reviews, I expected both good food and good service. The food was unexceptional, but I did not try the entire menu, so my review is not negative for that reason alone. The service is what motivates this negative review: it was terrible. I do not know whether we had a new hire--a fast speaking fellow that wore red framed glasses--but it was apparent upon our first introduction that he didn't have much time for us. The real indication arose when we (my date and I) received a lackluster artichoke marinated in vinegar. It looked and tasted like something pre-prepared at the grocery store. I gave it a try, hoping that it might taste better if I tried the heartier bits, but it was no use. It sucked. We left the artichoke untouched, expecting an inquiry by our server as would be common at most high end restaurants. We waited, and waited, until the server came to take our plates away. He finally asked how it was, and we told him we didn't like it at all. He took our other plates and left this grocery store concoction on our table. We waited again. We discussed between ourselves whether there was some miscommunication, so we awaited the waiter's return. When he arrived, he asked if we wanted him to take our untouched artichoke. We said yes, and tried to imply what he should do. We very kindly asked if we could have another appetizer instead. He didn't seem to understand, so we said it again. At this point, he seemed visibly annoyed. He asked point blank, \"so are you saying you want Empanadas?\" Assuming he'd understood our plea--or just hoping--I said yes. He returned with them; they were alright. And then the check arrived. There I was greeted with the charge for those nasty artichokes in addition to the Empanadas. I was perplexed. I flagged our waiter, and reminded him that he forgot to take the artichoke off our bill.  He was even more perplexed, and visibly annoyed. He asked, \"didn't you order that?\" Yes, we did, but it was terrible, and we spoke about this already! He sharply exclaimed that he'd talk to his manager. He must have because the bill was quickly and hardly plopped on our tabletop without a word or look from the waiter. The artichoke billings had vanished as quickly as our resolve to return. I hope this was an aberration. But I wouldn't feel comfortable returning to possibly run into our friend with the red-rimmed spectacles."], ["Rod O.", "55 Told me over a year ago Miro was moving to this new location!  This Space Looks Great!  We got one of our Favorite Waiters fro the former location, he remembered us and did a Great Job!We Ordered Three of the Entree Specials of the Night and 55 got an 8 oz Filet Mignon that was on the Menu!Lamb Chops with Cimmichurri was my favorite Dish of the evening and my photo could not capture how fantastik this Dish lookedBeef Tenderloin stuffed with Spinach and Lobster was good not greatVeal Shank was good though my least favorite, included a long prong Fork for the MarrowGazpacho was BETTER than Ever!!!Black Bean Soup still a FavoriteFried Calamari was as good as everChimmchurri Sauce ! Mmmmmmm!!!!  I always order a side of Lemon Wedges to go with this Sauce [I'm Guessing in Spain this is NOT so common (I'm Guessing) so which Culture did I learn this adding Lemon to Chimmichurri ???]Tres Leches was the BEST I have tasted ANYWHEREIn Total four of us got Four Desserts... Usually I'm not a fan of Tres Leches though 55 and my eBay Bride LOVE it sa O always know I will get a bite, this one IS ! ! !Dessert Tray The other Three Dessert were a bit of a letdown...Though they were Rich and Good, NONE were great nor worth repeating, even if they were Free, I think I would pass!Miro History :  Modern Artist Miro from Spain I guess an Abstract Impressionist though I'm guessing... 2003 I moved to Charlotte... 55 and I regularly ate at Sole and Miro this was after the time of Donkey Ho Ho and other Spanish Restaurants were losing popularity... Miro Stands Alone!"], ["Foodmaster F.", "WTF HAPPENED HERE IN THREE MONTHS!!! This place has changed so much in three months that I will probably not be returning. When I first came to this place as you can see in my first review I was very impressed and the food was delicious. I feel like they've gotten comfortable and have slacked in that area as well as the service. The young waiter was very nice and very accommodating, however he needs to cool it with the Rico Sauve attitude. Getting back to the food,  we ordered the garlic shrimp, plantains, empanadas, potatoes bravas and jamon croquettes. First off, the garlic shrimp were smaller than the last time, not as good quality and swimming in oil. We sent hem back. The potatoes bravas came out smothered in so much sauce that you could barely identify what they were. They were not the same potatoes we had three months ago. The empanadas were good but were only served one and a half, not cool. They couldn't give us two??? The croquettes tasted like puréed spam and it came with what can only be described as mayonnaise without a flavor. They were very generous with our wine and topped off my glasses very nicely. A friend of mine had A chicken dish and wasn't impressed at all. It's a shame that this restaurant has gone that way since it was just absolutely delicious the first time that my boyfriend and I were there. I'm going to try a different Spanish restaurant that is consistent with their quality and service. Ole!"], ["Hanna Y.", "Nice find while in Charlotte. We were looking for a true Tapas, and we found this little jewel. This was on four square top 10 list! Fast & Friendly service! We put in our order and within 5 min the food was being delivered!! Food was fresh and full of flavor! Great for a little group and larger groups. A little noisy.. But another table were just having a good time. In the door, seated, ordered, ate, paid the bill in less than an hour! We will be back for sure!"], ["Landon W.", "I recently went to the new location - this place used to be in Stonecrest but moved to Torringdon beside Earth Fare - and the new digs are really nice!  The atmosphere remains comfortable and classy but not stuffy.You'll always find great service at Miro.  The waitstaff is extremely knowledgeable of the menu and can answer questions and give recommendations.  There are specials every day that they can rattle off with ease, and I'm not talking about 2 or 3 things.  It's more like 8 or 10.  You'll find all your traditional Spanish dishes here as well as some Spanish-American fusion type things.  My favorites are the paella and the red snapper.  Things are reasonably priced for the good quality that you will get.The dessert menu is insanity, and they literally bring the dessert items to you on a platter for you to drool over as you ponder your decision.  There are cakes a' plenty, torts, pastries, and my favorite - the tres leches.  Check out the picture I posted and tell me you don't want that! This is my favorite restaurant in Ballantyne a place you must visit if you're in the area looking for a nice meal."], ["Greg R.", "Was very disappointed with our visit to Miro and it came down to one thing - food quality and prep.  First, I'll say the atmosphere is inviting and the service was exceptional.   We had a drink and tapas in the bar and the bar tenders were the most friendly and fun we've met in some time.  I would recommend it as a place for drinks anytime.  But - the food was under/ over cooked and cold in places.   It really was 'blow the kitchen up and start over' bad.   Something must have happened for this place to become popular.  It must have been good at one time but is no more.  All three of the dishes we tried were exceptionally bad. We love authentic Spanish dishes and were really hoping we had found a great spot - but Outside of stopping for drinks, I'd pass it on by."], ["Leslie B.", "The staff is knowledgable and accommodating. The bartenders shake your hand, introduce themselves & suggest tasting wines before you order to assure you're pleased. And they usually remember you the first time you return. I especially like the stuffed peppers appetizer and the Miro pasta dish. My only complaint is the food doesn't always come out piping hot, as it should. Otherwise, I do recommend going for dinner &/or just drinks."], ["Cassaundra M.", "If I return, it'll be for the Tres Leches Cake. Now granted, this restaurant isn't horrible, not even close. But I expected a lot more. I made a reservation for 5pm and only had 1 hour to eat before we had to be at an event. It was perfect timing. They have very fast service! We were seated immediately and our server was A+!! There are so many wonderful options on the menu and I wanted to try everything!! I ordered 2 appetizers, the Fried Calamares & Gratinadas; the Churrasco de Cerdo entree (My friend got the Paella Valenciana); and the Tres Leches Cake for dessert. Overall, everything was pretty bland. It wasn't that burst of flavor that I was expecting. Everything needed salt. The calamari was fried but not to a crisp, I was sooo disappointed with this because I order Calamari literally every time I see it on the menu. I love it! But it just was not good here. I did enjoy the Scallops once I put some additional salt on it. The scallops were cooked perfectly and were nice and plump. I could have had that for my entree. My entree was decent, but again, pretty bland. After seeing all of the reviews for the Tres Leches Cake we just had to try that and we are so glad we did. It turned our disappointment of a mediocre meal into a great big smile walking out. Our server even put little designs on the plate. It was hands down the best i've ever tasted."], ["Mike C.", "I used to go to Miro's sporadically when it was at it's old location.  The new place is closer to where I live so when asked for a suggestion for a place to eat on a Friday night I suggested we go here.  I was a HUGE fan of Eddies Place (RIP) and never went to Brig's.We made a 6:30 reservation and was seated right away to a booth for 4.  They did a nice job on the décor which is modern, a bit dark but trendy.  Our waiter Juan Carlos took very good care to explain the menu and make some great suggestions.  We started out with the mussels, and shrimp which both item has some extremely flavorful broth for dipping.  We had to keep asking poor Juan Carlos to bring us more bread since we kept running our because of all the sopping going on.  I come from a long line of soppers and Miros provided the perfect dishes to continue my family tradition.Anyhoo, I ordered the lamb because, I love lamb and most restaurants in Charlotte don't offer it.  It was served with some carrots and mashed potatoes which didn't get paid much attention to because the lamb was so delicious.  Slowly braised. tender and seasoned well I went full on Fred Flintstone on it when I first apologized to the other patrons when I picked the bone up and ate every last morsel of lamby goodness.For dessert we had what else, but the Tres Leche.  Just as wonderful as I remembered it.  The Manager or Owner came by and greeted us and thanked us for coming as the restaurant slowly filled up which is always a nice touch.  I am glad Miro's reopened and will definitely return."], ["Irene R.", "Just moved to Charlotte from DC and speaking as a foodie, this place has authenticity! Great atmosphere, fantastic appetizers! I've been here twice and brought friends visiting from LA and even they were impressed. Must pair with their sangria...amazingless ! Can't go wrong :)"], ["Ken D.", "If you know me you know how much I hate strip malls and the usual restaurants that reside in said strip malls. However, Miro Spanish Grille is not your usual strip mall eatery. Once inside, you will find a modern, sophisticated decor and a menu full of delicious choices. On our visit we had the calamari (served in a rich, atypical style), grilled octopus, paella and a stuffed eggplant entree...all pleasantly unlike what we expected. Perhaps the most enjoyable part of the evening was our bartender William who immediately got the party going as he regaled us with stories that would make more modest folk blush. We are not the blushing types, so his bringing us into the fold of regulars at the bar made it hard to leave at the end of our night. We felt as if we were among friends we had known for years...think back in those two years you spent in that reform school.We will be back. We have to, after all, we have more dishes to try and we know William has more stories to tell. They'll be much more shady than a '50 Shades of Grey' sequel, and I wouldn't miss that kind of entertainment for anything."], ["Curtis S.", "I got the \"Entrecote con Chimichurri\" NY strip steak which came topped with a chimichurri sauce and was served with a small side of garlic mashed potatoes. The mashed potatoes were forgettable but the strip steak and chimichurri is making my mouth water while typing. The steak was tender, juicy, thick, cooked beautifully, and the chimichurri was abundantly flavorful.Ella got the \"Carne de las costillas cortas\" oven braised beef short ribs in white wine with potatoes and carrots, topped with a natural al jus and served with sautéed green beans. The braised beef was incredibly soft and pulled apart with the greatest of ease. What we loved most about this dish was the combination of bold colors on the plate and the the balance of fresh veggies with the braised short ribs.The couple sitting next to us was so intrigued with all of the photos I had been taking of our food that they offered their food up for the photo spotlight. I never got a chance to taste their dish (Vieiras Chilindron Sautéed scallops topped with fresh tomatoes and peppers sauce, served with seasoned white rice) but it looked gorgeous. Unfortunately (for me) I just cant bring myself to like seafood and if these were the best scallops in the world... they would be wasted on my palate.Miro Spanish Grille was absolutely delicious and an easy recommendation for South Charlotte."], ["Kristen M.", "Just ate there for the first time today and it was wonderful. The server was amazing. The atmosphere was great and the food was delicious and fast! I will definitely be back."], ["Sara G.", "Delicious! A little fast on the courses. Excellent service and loved the mojito! I had the beren jenas--eggplant with red sauce-- great flavor, not overdone. Started with piqillos- with manchego cheese and roasted red peppers. Love the Spanish flavors!"], ["Marina D.", "Last nigh at Miro: Grilled Calamari - delicious, Zarzuela de Mariscos - excellent, the only time I regretted  that I don't eat much bread and had nothing to deep into that tomato base broth, (the bread was offered by the server btw). But that allowed me to save room for their desert - Tres Leches house cake was airy, with a creamy top, must have! Great experience."], ["Maureen B.", "We went to the new location this past weekend and it was much better than the last time we ate here.The restaurant is way nicer and brighter than before, which I liked.  The servers were super nice and friendly.Three of us ordered the mahi mahi special and it was delicious.  We all loved it.  It was perfectly cooked and on a bed of spanish rice which was good too.  My husband ordered the lamb and he enjoyed his meal as well.For dessert, we got the tiramisu and thought it was excellent.  Can't wait to go back!"], ["Jordan P.", "Couldn't be happier we came here.  Service was great and food was exceptional. I had the empanada appetizer and the seafood stew entree, and both were perfect and extremely reasonably priced. Ask for the special hot sauce with the empanadas - it adds a great kick"], ["Bryan P.", "My wife and I went here to celebrate a special occasion and were not disappointed. The place has a high end feel to it, but still not overly expensive and you can can also dress casual. There were plenty of people here in shorts. Our waiter was very knowledgeable and attentive. He made us feel very special. I had one of the specials for the night and it was fantastic. We had a great bottle of spanish wine recommended by our waiter. This place has a great dessert selection. They bring out a big plate with many amazing deserts on it. We had the Tres Leches cake, recommended by our waiter. This cake was amazing. It was the moistest cake I've ever had in my life. This cake was so moist, it was like liquid standing up. I can't believe it didn't just flow out onto the plate.After dinner we drifted over to the bar area and had 2 of the best Mojito's I've had in Charlotte. So, overall, a 5 star experience."], ["Peggy C.", "Let's be real - there isn't much of a selection in Charlotte for Spanish cuisine. While everywhere is now offering up \"tapas,\" sometimes I still want some good ole TAPAS - jamon, manchego, croquettes, gambas etc.This is my 1st visit to the new location (to think of it, I can barely remember visiting the old location). It's closer for me coming from Uptown area, and parking is nowhere as crazy as Stonecrest - both are pluses. The place was packed on a Friday night, so even though we had a reservation, we had to wait just a little for a table.Service overall was ok - our waitress was eager and enthusiastic (at times maybe a little too enthusiastic but I am not complaining). My friend and I ended up starting out the night with the Pulpo Gallego and Jamon y Manchego. I enjoyed the grilled octopus, thus it was a little under seasoned for my tastebuds. The serrano ham were good as well as the mangchego cheese, but you don't get much in an order. For both of the dishes to be priced at $10, the grilled octopus is definitely the better deal.For entree we shared an order of Marbella. I never had squid ink pasta so I was excited about trying something new. This pasta dish was full of flavor without being too heavy. They were very kind to split the portion up in two for us, and my half was more than enough to fill me.We ended the night with a slice of tres leches. They did have some very impressive looking options, all so gracefully presented on a silver tray for decision making. BUT there's no better option than tres leches.Overall it was a very pleasant experience."]], "Dressler's": [["Toccara R.", "The best lamb I've HAD thus far. My husband sitting across  from me making moaning noise because the food was so great.The cheesecake was another hit.Great flavor, great service, and awesome food."], ["Kelly K.", "I have been to Dressler's several times over the years and always enjoy it. I love sitting outside on a warm night and seeing Charlotte's distant city view. We had dinner there yesterday (random Monday night) to use a Living Social deal that was about to expire. The deal provided 2 appetizers, 1 Salad, 2 entrees, and 1 dessert. I also ordered a Prosecco (to add to my other pre-drink @ Pisces while we waited for a table). Apparently many others in Charlotte were doing the same thing because we didn't make reservations and could not be seated until about 9PM. In light of the deal above, my date and I ordered the following:Shared Appetizers1. Ahi Tuna - Excellent (a predictable, over-ordered restaurant appetizer -- but Dressler's did it justice!) - 4*2. New Orleans Style Shrimp w/ Baguettes - better than Ahi - 5*Salad (shared)1.Tomato & Mozzarella - 5*Entrees:1. Filet w/ mashed potatoes & asparagus - 5*2. \"Just for the Halibut\" (my date's favorite -- was sold out) so he ordered the NY Strip instead. IMHO, the NYS was not anywhere close to as good as my filet but it came with french fries so all things balance out. ;) A strong 4*Dessert1. We shared the chocolate cake with ice cream and it did not disappoint. 5*We were so full and we both loved the meal. The waitress was great too. A great Monday night out in our beautiful Queen City. I have to say, however, Dressler's is a great choice with or without a deal. I am not sure they'll offer this deal again but will readily return. Enjoy!"], ["Jessica D.", "My fiancee and I went to Dresslers for our three year anniversary. We've been to Dresslers a few times and it is hands down our favorite restaurant in Charlotte. The ambiance is amazing and to further things we sat outside during a beautiful night with an awesome view of downtown Charlotte. Very romantic :).The food was absolutely terrific as usual. I don't know if I'll ever be able to get calamari anywhere after having Dresslers' calamari. The best parts of calamari lightly dipped in wasabi sauce and a signature sauce. Phenomenal! I had the scallop salad and thinking the scallops would be small but they were definitely jumbo but the salad was not too filling. My fiancee got the blackened heart of ribeye which he said was cooked to perfection. After trying a bite I agreed.The thing that really sets Dresslers apart for me from other restaurants in Charlotte is the service. Kent was our server and he made the dining experience one of the best I've ever had. Extremely attentive and he even convinced me to try the scallop salad. He even said he remembered us coming in and we got a complimentary dessert and sherry for celebrating our anniversary there! Just an unbelieveable dining experience and would recommend this restaurant to anyone in Charlotte."], ["Molly M.", "My husband and I usually love eating here. But, the last time we went we were VERY disappointed. The food was very good, as usual but the service was way off. I would go as far as to say our server Beth was highly disrespectful to our party. Our table was unattended to and when it was she had a very bad attitude. The service ruined the entire experience and we were so excited to take our family there because this was one of our favorite places. I am very sad to say we will not be going back again."], ["Bree C.", "My food was prepared wrong twice, so I'm leaving with a to go order and thus can't comment on the food. I will say that they charged me $1.50 than advertised more for a glass of whiskey because, they tell me, I ordered it neat. Apparently, the prices they list for liquor are only for drinks on the rocks, which he claims are a larger pour. So, if you decide to have a drink here, remember that they have a system all their own. They do not measure out a shot, like every other bar in the country. They pour more than a shot (though I didn't see the increase) and charge an additional fee (without note in the menu or any word from the server) if you order neat."], ["Jan M.", "We opted to revisit Dressler's for our anniversary. Our Appetizer was Low Country Crab Dip and scrumptious in every bite. For entree we had the Blackened Heart of Ribeye which came with fingerling potatoes, asparagus, herb blue cheese butter. My wife enjoyed the Just For The Halibut with lump crab, roasted red peppers, spinach, chive potato cake, sun dried tomato buerre blanc. Our dessert was a shared Mom's Apple Cake ...enough said...caramel, ice cream -delicious. Our wait staff was attentive but not overly intrusive and Natalie was very informed in terms of the menu. We were not rushed from the restaurant and sat talking without any worries from the staff.In terms of drinks they were good but the melon mule wasn't as good this time...In terms of parking there is ample public parking as well as valet should that be preferred. There is outside seating and sometime there are bands playing."], ["Christopher G.", "Lamb was great.  Crab dip app was great and should have ordered two !  Service always on top of everything.  If you have not tried them, do yourself a favor and go check them out!"], ["Marie J.", "This place was just wonderful! The staff, wow!!! They were over the top helpful, polite and just all around very accommodating. The food was great, we started off with drinks, I had \"French Kiss\" and my husband had something that had bourbon in it, we both loved them, we later split some house drink with peach in it and it was out of this world good! We aren't really drinkers but I could have been tempted to order a couple of them!We also had onion rings, crab cakes and steak. There wasn't a single thing we didn't like and to top it off we enjoyed the carrot cake! We will certainly be back again!  So glad to have found this place!"], ["Mya R.", "I have only been here once but so far my experience has been delightful. The bar manager Jeff is welcoming and the environment is comfortable. Jeff gave us great recommendations of the menu. I had the opportunity to try their cheesecake and it was the best I ever had. I will definitely be back to try their full dinner menu!!"], ["Lisa C.", "A combination of a sudden wave of gorgeous weather and a LivingSocial deal brought us to Dressler's this past weekend.We both ordered drinks - my pomegranate sparkler was delicious! It was the perfect refreshment to celebrate the return of warm weather. The calamari we ordered was the best calamari I have ever had. Instead of the small over cooked and greasy ringlets most restaurants serve the calamari at Dressler's is cut into long juicy strips and is topped with a glorious peanut sauce that has wasabi drizzled without. We also sampled the crab cake, which was good but paled in comparison to the calamari. After a brief interlude with a split wedge salad (a salad came with the deal) we got to taste our entrees. My filet was done perfectly and the cut was one of the more tender steaks I have had. The asparagus were lightly seasoned over creamy mashed potatoes. The only flaw was the sauce on the filet was a little too sweet and I think it would have been better done if the cut of the steak was more lightly seasoned to show off the natural deliciousness of a filet.We ended with the cheesecake which had an enviable lightness, though neither of us cared for the cinnamon sprinkled on top. The waiter was very friendly and kept our drinks full. We will definitely be back to sample more of the menu!"], ["Joelle J.", "Awesome service, exquisite food, lovely setting. Jerry was our server and was knowledgeable and attentive."], ["Rachel A.", "This review is long overdue! I've dined at Dressler's with my mister, taken prospective employees out to dinner here, and hosted a retirement party lunch here. Like a lot of people, I fall into restaurant ruts, but that is not the case with Dressler's. So, why the multiple visits? To start, the view is great, especially if you happen to dine on a warm evening and can eat outside. Lots of great people watching from that vantage! The decor inside is sophisticated enough to impress a client or for a celebration, but casual enough to have a nice meal without a lot of fuss. On my several visits here, the food has been consistently good from appetizers through dessert. I have to say, I am partial to the pork chop or the ribeye steak. I want to note as well the expansive gluten-free menu with a range of options beyond salads like a lot of other restaurants. I also want to second how seamless event planning is here. Rhonda was a pleasure to work with, and the wait staff were so accommodating. I work for a state agency, so we can't expense alcohol, but the bar staff was still able to create a custom \"mocktail\" so that we could toast our retiring staff member. Great, right?"], ["H M.", "While visiting Charlotte dined at Dressler's for a business dinner. Service and ambiance are top notch. Dined on the pear salad which was amazing. For the main course I had the famous halibut. It was good however the sauce was richer then I expected, would have enjoyed it more if I omitted the sauce or put it on the side. Desserts are amazing here, especially \"Mother's Desserts\". we had a sample of several desserts. The pumpkin cheese cake was such a hit we ordered more for the table! It was hands down the best pumpkin cheese cake I have ever had. Would visit again while in town and would recommend Dresslers to anyone visiting the area."], ["Regina J.", "This was our first stop on our passport tour of some Charlotte restaurants. The drink was good, but the service was excellent. Our waiter/bartender was prompt and very personable. We definitely plan to go back. Our drink, the bees knees was refreshing! Great Job!"], ["David B.", "This was my first time at Dressler's and I did not know what to expect. All I can say is that it was an extremely pleasurable experience. Our waittress, I believe her name is Liddy, was very kind and welcoming. Our food was amazing. I had filet mignon and my partner in crime had the Spring chicken. Every single part about the meal was  delicious. I do not know how, but they managed to perfectly marinate and dress the entree and sides. We topped off the meal with the Oreo cheesecake, which went perfectly with the strawberry. All in all, one of my better restaurant experiences."], ["Lindsay A.", "I am very sad to say I was very disappointed with this restaurant. With all the reviews and how pricy the menu was, I was expecting excellent service and food. It was all ok. We started with the calamari which I saw many rave reviews about online. It was definitely not my favorite. Very different with a wasabi sauce and a light fry, but I've definitely had better. We both had stead for dinner. The potatoes were good, but the steak was not. For the price I was expecting way better but what I got was equal to one from Outback Steakhouse. It was way overdone (I asked for medium and it was definitely medium well to well done). And it didn't seem like high quality meat. For dessert we had the chocolate cake. It was an ok cake, but the chocolate sauce was sour for some reason, and I didn't see anything about raspberry or anything in the description. As for the service, our waitress was nothing exceptional like it should be for a restaurant of this caliber. We are a young couple, and it seemed like she didn't want to give us too much attention because we obviously weren't going to buy the most expensive bottle of wine. Didn't offer us straws when she did for the table right next to us, nor lemons for our water. The bread came after we were completely done with our appetizer. It just didn't feel elegant. I do wish it was better but it wasn't worth it! We will not be going back."], ["K J.", "I usually enjoy the calamari from dressers alway been a fan favorite and why I keep coming back. I must say having it delivered was a fail. Portion size was probably about half what you get in restaurant."], ["MtnGirl 1.", "Dressler's was such a great choice! Neither my fiancee nor I are from Charlotte but were in the city for my birthday and wanted a nice dinner spot to celebrate. I spent a good deal of time searching reviews, and I ultimately made a reservation with Dressler's. We both ordered the New York Strip, cocktails, and dessert (chocolate cake for him, pumpkin cheesecake for me). Everything was delicious, and the food came out so quickly! Our server was attentive, helpful, and let us sample two beers. We even met and shared a few laughs with the owner. Just a very, very nice night! Thanks for making my birthday dinner top-notch!"], ["Megan C.", "I am from out of town and attended a wedding rehearsal dinner at Dressler's. I love that the back private room comes with it's own patio for cocktail hour. We were able to see sunset over the city skyline.Once it got too dark and cold to be outside we moved into the dining room for dinner. I had the smoked chicken with mashed potatoes. Best dish I've had in a long time!! We had salad and dessert as well and I ate way more than I should have but the food was soo soo good!The complimentary valet was also a nice touch since we were running a little late and needed to get in quickly!Thanks Dressler's for showing these out of towners a great evening!"], ["Dezzi Y.", "My 1st time out in Charlotte and I have to say this is a very nice location to dine. It is great for intimate settings or group settings."]], "Halcyon Flavors From The Earth": [["Megan A.", "The ambience is great - the wooden tree tables are beautiful and sitting outside is awesome.the service is alright. they are never too crowded for brunch, but I always get seated in  less than ideal spots. highly recommend the chicken biscuit and the french toast."], ["Robin C.", "So glad that I looked at their very informative website or else I would have never found Halcyon.  And glad to find it I was.  What a beautiful space!  Large windows with a beautiful view of the city.  A fountain in the middle of the room.  A long shellacked wood table outfitted with beautiful dishes and silverware.  And twig chandeliers up high.I ordered the baba ganoush.  It was ok, but the real star was the hard cracker type bread served with it.  Was that lavosh?  Before hand, we were brought bread with creamy lemon tinted butter sprinkled with a paprika H.  I also ordered Harvest, an entree featuring root vegetables with a tomato confit.  Perfectly seasoned and displayed in a rectangular plate.Some of our party ordered desserts.  There was an apple dish, creme brûlée, and a goat cheesecake, which was the most delicious one.Our server was helpful and personable.  Just part of the wonderful package of great food and a beautiful environment.I told my husband who was not with me that night that he can surprise me anytime for any special occasion by taking me to Halcyon.  Like when I find a dollar in my coat pocket or I slide through ten consecutive green lights.You know, the important things that make life grand."], ["Darren G.", "First time in Charlotte went with a party of 5 to Halycon and have to say its overpriced and 4 out of 5 of us thought our food was lousy.  The menu is super confusing and overly fancy. I ordered a 40 dollar steak and crab entree that was fatty and had no flavor. Two others in my group ordered grouper fish that they thought was lousy. The last two ordered a vegetable plate that one said was terrible and one said was good. The appetizers of oysters and flatbread were excellent and the service was good. To give the place credit they did give us a big discount when we told them we thought the food was lousy. So they avoid one star because they do good business. However it is a higher end place and for the price Halycon does not deliver on quality. The food is disappointing and it was honestly maybe the worst steak Ive ever eaten. They even try to gourmet up the bread with this gross butter contraption that stinks. Overall Halycon tries to be elegant but there food is lousy and Id rather eat somewhere with better food.  They do have a unique menu but I think its overly unique to the point that its ridiculous especially when the food doesnt deliver. I wont be going back if Im in Charlotte again and if you want a good meal Id look elsewhere. Good service and they do good business so have to give them credit there but it just cant make up for how lousy the food tastes."], ["Serg Z.", "I'm not much of a cocktail drinker but this place had a few that I really liked. The view is also very nice. Service was excellent, our waiter was very friendly and did a good job giving us suggestions on what we might like to order. It is somewhat pricy and the food was just alright, I think my expectations were just a bit too high though."], ["Tammy T.", "Beautiful locationFriendly serversFresh flavorsHalcyon is on the second floor of the Mint museum and has lovely views of Tryon st.  The decor is contemporary with some warm elements of wood (which I felt was well done).  I ordered the salad with phyllo and the daily special -- rabbit sausage sandwich.  Food was well cooked and fresh tasting but perhaps under seasoned. I also had their fresh squeezed orange juice (which was fantastic). I was one of only 2-3 other tables and the service and attention was appreciated. I would come here again but not power walk or run here as I'm really not sure what I crave there or would order (although it would definitely not be the same as my first meal). In summary: atmosphere/location great, food good/not memorable, service great."], ["Sarah S.", "My boyfriend I went here for our anniversary dinner and had a fabulous meal!I appreciated that Halcyon is classy and upscale, but is also vegetarian friendly. As a vegetarian, it was such a delight to have options on the menu other than salad. I got the harvest which is a grilled vegetable dish with a wide variety of vegetables. It was great!! My boyfriend got the rabbit saddle, which he also said was good.I have to give Halcyon a lot of credit. I arrived in a bad mood because we are new to Charlotte and couldn't find the entrance to the restaurant. We took some wrong elevators and terrible directions from a clerk at the bottom floor. We arrived almost half an hour after our scheduled reservation and were soaked, but they didn't bat an eye and checked our coats. Our service was prompt and they turned my mood around quickly.The best was the cheese board. The portions of cheese were perfect and they didn't give you too much bread with the cheese. The bread was enough to spread a hearty amount of cheese and also the pairings were delightful. It was hands down my favorite part of the meal. With a bottle of organic white wine, an appetizer, two entrees and two desserts, we were expecting the bill to be a lot higher. We will definitely be back :)"], ["Andreas H.", "A large group of us stopped in a few weeks ago and took the large center table in the dining area.  3 hours and a stack of cash later we were full and happy.The Highlights:+  Cheese tray was impressive (we went with every cheese they had)+  My duck entree was perfectly cooked, tender, and was a shining example of how duck should be prepared.+  Nice wine options in the $10-$15 a glass range.+  I enjoyed the atmosphere.  The lighting, the table, the high ceiling.  It worked.+  Scallop and Pork Belly was spot on.  +  Hamachi - clean and fresh tasting.  I enjoyed it.+  My bacon cocktail was awesome.  Mmm... bacon...The Meh:o  The snackboard was a miss.  The farro was overcooked and the eggplant was a bit bitter (and had a funky texture) .The Fail:-  The foie gras boudin blanc with my duck was awful.  Bitter, funky, and not good.  I had one bite and left the rest.  **Note** I am a fan of foie gras AND have never met a boudin blanc I didn't like... until this.Overall it was an impressive meal and it ended up being a great time.  Thanks to the staff and team that made the experience so great."], ["David D.", "Really great restaurant, from the farm-to-table yet high-end, modern vibe to wonderfully delicious and healthy food.  But wait...the cocktail and wine lists are amazing!!   I highly recommend the food boards, which are great to share.  The fish dishes such as the local NC Flounder and also very tasty."], ["Julie W.", "You can't beat the of the view of the city! Great customer service and the food is out of this world. I highly recommend the scallops and pork belly as a starter."], ["Alexander J.", "Great food! We tried a few small plates and an entree. The veal was the best I've ever had. They do a great job preparing it. Our server was attentive, knowledgable, yet seemed to speak as if he'd experienced each of the dishes individually. The decor was modern, hip and interesting. Overall, a great dining experience!"], ["Amy C.", "With a name like Halcyon Flavors from the Earth, I wasn't sure what I was getting into, but color me impressed!After a tour of the Mint Museum next door, I had worked up an appetite and the desire to sit down and reflect quietly for a bit.  What a beautiful space!  With a large wall painted a Carolina blue with white birds silhouetted, neutral-nature upholstered comfy chairs paired with wooden tables, some of which looked like they were cross-sections of large trees, along with the chandeliers made of soft lighting and branches... wow.  They also had exterior patio seating with beautiful views of uptown Charlotte.  I really was wowed by the space itself and was looking forward to my lunch. My waiter, I believe he said his name was Noah, was polite and helpful.  I asked him for his suggestions and went with his first suggestion of a Monte Carlo, which was an open-faced sandwich of custard soaked brioche, topped with cheddar cheese, BBQ and cole slaw, and served with house-made fries.  Noah was quickly over-sat with the uptown lunch time crowd and did his best to keep up but I rarely saw him once my order was placed - he seemed to be working twice as many tables (indoor and outdoor) as the other 2 waiters that I saw.The sandwich was quite good (I have added photos of the sandwich and the fries).  The cole slaw was creamy without being drenched and the BBQ was well flavored.  It was a bit of a mess to eat, so if you are on a date or with your boss, I would pick something a little neater.  The fries were delicious and the house-made ketchup was sweet and subtle, letting the taste of the fries come through.  My total for water and sandwich/fries was just over $14, so by no means a crazy-expensive lunch, and well worth it to enjoy the restaurant itself.  Had it been a slightly cooler day out instead of a late-June mid-80's, the patio seating would be wonderful, though this time of year, the seating along the railing was full sun and I imagine a little warm.Should I find myself at this end of Charlotte again, I would not hesitate to stop at Halcyon for a meal."], ["Peter D.", "Lunch with two others today - none enjoyed the experience. Speaking for myself, the kale salad had a measly portion of torn kale, a heavy dose of heated cranberries, too many sweet potato \"curls\" and the roasted chicken I asked to add came on the bone making it very difficult to eat on a salad. I was so excited at the description and so disappointed in the execution."], ["Jarrod S.", "Food: 5Ambiance: 5Food/Price: 5 (brunch and lunch hour) 3 (Dinner)Pros:  Fresh Ingredients, Expert Execution, Serene Unique AmbianceCons: Dinner PricesHalcyon is a restaurant that can do no wrong. A sleek modern terrace abutting the Mint Museum in downtown Charlotte, it seems that nothing on Halcyon's menu is anything less than excellent. I recently went with a group of nine people during their brunch hour and was able to try a wide variety of what they offer.HighlightsPork Belly BLT: An open faced pork belly sandwich topped with crispy bacon, avocado slices, and herb aioli. The pork belly was rich and velvety, the bacon cooked to crunchy perfection, and the marriage of avocado and aioli added a slightly tangy/buttery character to expertly balance out the meat.Cinnamon Apple French Toast: French toast on steroids...No joke this toast is comically large and fluffy. Our waiter told me it was once normal bread that got angry after being zapped with the gamma radiation machine Halcyon keeps in the back. But this plates transcendence is not solely in the heft and consistency of the bready goodness. The cinnamon and apple blended seamlessly with the butter and syrup to make what I can un-ironically (but totally pretentiously) describe as the platonic ideal of French toast.  Every French toast I've ever had has wished it was this French Toast. If you like shitty music this is the Beyoncé of French Toast. If you like shitty TV shows this is the How I Met Your Mother of French Toast. And if you like shitty restaurants this is the Olive Garden of French Toast. If you ever get to Halcyon, do the responsible thing and order the French Toast. I've only eaten three things that I consider to be bucket list meals: Ron's Biscuits and Gravy at Nosh in Durham, The Brisket at Franklin's in Austin, and now the French Toast at Halcyon.Though I didn't order any for myself I was able to try most of the table's cocktails and can say they were consonant with the quality seen in the dishes, though perhaps even more unique.And all this without a mention of cool, modern, \"organicy\" feeling décor that somehow makes you feel both avant-garde and cozily local. The only downside is that once the dinner hour strikes Halcyon's prices jump precipitously, but if you can get there in the morning/afternoon your money will be very well spent."], ["Jacky M.", "Wonderful food set in an inviting atmosphere. Wine selection was great and very interesting cocktail menu as well. Started with 3 tapas and the cheese trio and loved everything. The plates are beautifully presented and flavorful to the last bite. Definitely try the scallops and pork belly if still on their seasonal menu. Entrees were perfectly sized and presented for having consumed 4 plates prior to the entree round. Also beautifully presented. Chef does a wonderful job of bringing out the rich flavors in all of the ingredients on your plate. Scallops were perfectly cooked, juicy, and absolutely wonderful.Definitely make a reservation as the restaurant itself is on the smaller side. Wonderful outdoor patio space, weather permitting. I would definitely go back for their new menu starting in the next week or so! Bravo!"], ["Kate T.", "What an amazing and beautiful night. We arrived and received a table on the patio, only after checking out the amazing interior design of the inside. Beautiful, with amazing carved tables, great bar and an open feel that is very inviting. After being seated on the patio, we were greeted with water as we previewed the wine list, which is very extensive and offers a wide variety at all different price points. We ordered a bottle of Chardonnay and started with the hamachi appetizer. The hibachi is thinly sliced, with a hit of sea salt, and served with grapefruit and multiple smears, a wasabi one that was best! In addition to the hamachi, we received complimentary bread with a rosemary butter, yum!For entrees we chose the scallops and roasted chicken. The scallops were served with crab ravioli and a vegetable medley. The scallops were cooked to perfection and the ravioli truly allowed the crab to be enjoyed. The roasted chicken was too die for, one of the best pieces of chicken I have had ever. It was also served with vegetables and some potatoes. The food was amazing and was service truly did not disappoint. I truly van no wait until my next visit, maybe this weekend :-)!"], ["Landon W.", "Halcyon is one of the coolest, most eclectic spots in all of Charlotte.  While it's bit pricey, it is well worth it.  The atmosphere here is one of my favorite parts of it.  There are walls of windows looking out over uptown Charlotte.  The dining room is small and open.  It's nice, but very casual and earthy.  I love the tables, they are made of what looks like huge thinly cut tree stumps.  That is probably giving you a very weird visual, but it'll make sense once you see them.  You also have the Mint Museum right there and you don't even have to walk outside to go to it.The cocktail menu is the most unique list you will find anywhere.  You'll see all kinds of original concoctions that are created by the on-staff mixologist who is basically a genius.  For food, there are lots of offerings that you won't find at many restaurants (rabbit sausage anyone?) as well as some Southern classics like shrimp and grits.  The most recent dish I had there was the duck confit.  It was truly outstanding.  Fresh ingredients, tender meat, and loaded with flavor.  If Halcyon is not on your short list of places to try, go ahead and put it on there, stat."], ["Lin G.", "Despite the weird fucking name, I really like this place.  Walking in was like wow, beautiful decor, inside and out.  Inside was like being in some crazy woodland adventure with snow white while on crack.  Outside was more subdued and got great views.  At 3pm they told us the menu was limited and we can only get like 6 things.  My friend got the pork belly and I got the oxtail.  Let's just say, both dishes blew my fucking mind.  ESPECIALLY the pork belly.  Every bite, with the sauce, was phenomenal.  And the dishes aren't large so I was suspicious that we'd still be hungry but we were surprisingly full.  Maybe humans aren't meant to eat full Cheesecake Factory portions after all."], ["Denise B.", "Halycyon, Flavors from the Earth! Great Name for a Restaurant that serves incredible small plates. Went to dinner on a Sat before a concert, we had quite a bit of time but did mention to our server that we had to be out by at least 7:30 to make the concert, she was very prompt with all we ordered. We started out with \"SOME PIG\" which is a variation on a Old Fashion with Benton Bacon infused Makers Mark 46. With BACON stir sticks..which made the drink!! We then went on to the Scallops and Pork Belly, which was probably some of the absolute best Pork Belly I have ever had!  A Blue Cheese souffle - melted in your mouth with a veloute sauce and  beech mushrooms ! I could have done shots of the sauce! The Foie Gras was delicous, a very nice portion and cooked perfectly. We then got the Kobe Beef Tartar with Harissa. Now I love Steak Tartar any way but I do think the flavor of the Harissa ( which I also adore) was a tiny bit overwhelming on the beautiful beef. For dessert we ended with a Cheese tray which was outstanding..all the little chutneys and purees were perfect with each different cheese. I will be coming back to this beauty again. Kudos to the Chef for his creative thinking on the small plates. Loved it!!"], ["Julia M.", "Wow, my experience at Halcyon really exceeded my expectations! After a visit to the Bechtler Museum on Friday, we decided to pop in to enjoy a late lunch.  The decor is awesome - earthy but upscale and the atmosphere is nice, but not overly stuffy or pretentious.  Our server started us out with water and a flavored popcorn that was savory and oddly addictive. I don't remember what the spices were, but the flavor reminded me of some sort of curry.  Yum. I ordered the Poultry Junction Chicken (roasted chicken that was served on grit rice risotto w/ seasonal succotash & malabar spinach - $14) and my dining companion ordered the Duck Confit (on focaccia w/ cranberry marmalade, pomegranate, greens and sweet potato crisps - $14).  Both dishes were beautiful and absolutely delightful! After our entrees, we decided we needed a little pick-me-up, so we both ordered cappuccinos (I think these were around $6).  They were served in enormous cups and were delightful.  Then, we splurged and ordered a hazelnut yule log dessert with a cherry root beer sorbet to share (around $8)... it was delish! The food was great, the service was great, and you can't beat the beautiful view. I will definitely be back!"], ["Melissa P.", "So if the Chef reads these..keep the Salmon on the menu...I would have put a picture up but it was so good that I shared it with everyone at my table and it was gone in 5 minutes...just think of Beef Wellington, but with Salmon...it was probably a top 10 food item I have ever ate...it was a great option to getting the scallops...which a lot of people have raved about...drinks and wines were pretty good...only 4 options for each white/red by the glass...It is a different menu featuring locally-sourced ingredients, it is a restaurant you Evolve into once you can appreciate good, clean food...while I feel like a dork for that comment...if you can appreciate the difference of getting bar food and going to a dining experience...you will know what I mean...  In a city that is really starting to be recognized for it's culinary chefs and accolades...this place has all the cool, sexy and ambiance a girl could want, hello...and it is in a Museum...so gentleman...there is your hint...wanna impress a gal? This restaurant is your chance...PS, Chef- Please don't ever take the salmon off the menu! We will be back again!"], ["Shelley C.", "So beautiful! So amazing! New and creative menu items that scream farm-fresh and delicious and live up to their descriptions.Their wine list is exceptional and their cocktails were tasty! (Although, I didn't care for the squid ink, but the server didn't bat an eye and whisked away, bringing me something new on the house!)Although I've heard that service is sub-par, our server was amazing. Food came out with beautiful presentation and glasses were never empty. And we never once felt like sub-standard human beings that some pricey places can portray.And did I mention it's BEAUTIFUL!? It's located in the museum which is a perfect fit for it. Tables and chairs and lamps that all had to have been made for that restaurant. Exquisite design. Even the lighting level was perfect.This restaurant is definitely a treat, so we can't wait to save up and head back again."], ["Michelle K.", "We had a great brunch here!  I've been hesitant to try Halcyon because it's pretty expensive and I heard the portion sizes are really small.  I'd say our brunch was on the pricier side but not outrageous- especially if you're looking for something nicer.  The portions were much larger than I expected.  I got the Pork Belly BLT (and added a fried egg) it was outstanding!  I couldn't even finish it- my husband did though!  Of the 3 orders, this was definitely the largest.  The décor is beautiful- a perfect cross between rustic and modern.  Definitely a great restaurant for a special occasion!  We will definitely not hesitate to go back."], ["Eddie C.", "Great ambiance, great view of Charlotte and excellent food! Save room for dessert, the french toast with chocolate gelato was amazing!"], ["H S.", "Really enjoyed squash blossoms, burger, hamachi. Pork belly a bit dry and more caramelized pork fat would have made it even better. Carpaccio could use some aioli or maybe even tonnato. Great desserts. Bar could be improved (measure out drinks instead of free-pouring, stir whiskey drinks instead of shaking, and keep that easily oxidized vermouth tightly capped and in the fridge!)"], ["Ling P.", "This is a really really nice, upscale place.despite their very unique and local menu, my favorite is probably their cornbread with the fruit butter. i think they whip it in case and it literally just melts on the cornbread and then subsequently your mouth.We got the quail, burger, and kimchee fried rice with pig ears.  everything tasted very good, and our server was excellent.  Very knowledgeable and very well spoken."], ["Rachel C.", "Overpriced, overrated, not very diverted menu. I tried there twice and never had anything that I liked. Unless you order the cheese platter, entree wise, everything our friends and I tried were not that good. The atmosphere is really good though."], ["Laurie I.", "very nice place. I had the omelet which I would say was rather dry and i could make better at home. but all the other  meals were really nice. We started with the spread plate to share and that was really nice. The girls had the egg Benedict and Jay had duck and it was also great. The iced teas were really tasty and the desert which I had the cheese cake was very good. I would  have liked more syrup but it was still really good . We went for Sunday brunch and I would like to try dinner. Make sure you make a reservation as it does tend to get busy"], ["Amy R.", "The downpour did not stop us from heading downtown and finding a farm to table restaurant for my friend coming from Raleigh.  Tricia wanted a vegetarian option so she found Halcyon on the website.  Unfortunately when we arrived they had changed their menu (which is great based on what is available and seasonal, but it did not coincide with their website menu. That being said the service and the wine was spectacular.  The server knew his wine and presentation was perfect.  The decor has always been intriguing to me whenever I have passed by to experience the Mint Museum.  What we found out last night is that the owner made the tables from fallen oak trees that came down in the yard.  They are gorgeous and make the experience great!"], ["Kellie K.", "We were grateful Halycon was not participating in Restaurant Week and decided to make our second visit.  As others have stated, the decor is very cool with chandeliers made of branches and tables that look like elegant tree trunks.  You can't beat the view of the city at night, and I'm sure the outdoor dining would be great in good weather.We decided on a pork belly and Brussels sprouts appetizer.  At $10, it was a steal considering the size and flavor.  You can never go wrong with pork belly, and the sprouts were a tangy, vinegary surprise.  Even though we were trying not to get full before dinner, we ate the whole thing.  Since you can also never have too much pork belly, my fella got the burger for dinner.  We thought there was no way the burger could live up to the hype... but we were so glad to be wrong!  The bun was sweet - almost donut-esque - and the pork belly/beef were just the right balance of salt.  The bacon marmalade was smoky and creamy, and the cheese made the entire dish.  It almost doesn't seem right to call this just a burger, so I'm gonna call it a work of culinary art.  I got the fire-roasted chicken, which was fall off the bone tender, and the greens, sweet potatoes and farro balanced it out nicely.  I ate all of it plus a bite of the burger.  Oh, and some of the fries with homemade (cinnamon-y?) sweet ketchup.  Nom nom nom.Needless to say, we were too full for dessert!  I should note that our server was very fun and personable.  He made a couple of mistakes (forgot a beer we ordered, messed up the check), but he was so apologetic and nice that it was easily overlooked.  I can't recommend Halycon enough!"], ["Jeremy D.", "Locally sourced ingredients, creative menu, one of uptowns best cocktails menus, and a beautiful location make this one of uptowns best restaurants.I had the tomato tart for an appetizer and the rabbit for dinner. Both were very flavorful without being over seasoned. My cocktail had arugula and black pepper... I would definitely order it again."], ["Lynn N.", "Lovely, really! So gorgeous: the food and the view. Root veggie salad, phylo veggies, lentil soup, cheesecake. Even their ice tea is perfect! Waitstaff: courteous, attentive, helpful. I try to dine here every trip to Charlotte. Perfect!"], ["Jules S.", "Everyone has mentioned the great decor and cool wood tables, so I won't gush about the lovely ambiance and great views.Onto the food! The first time I went here I went with a client and wasn't hungry so I just had the side salad that was A-MA-ZING! The dressing and inventive topping is always interesting. Whether its almond brittle or kettle corn, it's delicious and somehow works.  The greens are satisfying and just all around a great salad. Yes, I'm talking about a side salad. I also had the french onion soup (seasonal) which was fantastic.Another time we went for brunch/lunch while museum hopping and had an awesome sweet potato waffle and the burger. Personally, I seriously think it's the best burger in town. Juicy, perfectly pink, flavorful. It had fried green tomato, jalapeno cheddar and a chow relish that didn't sound good from the menu but my husband ordered it and it worked perfectly. YUM!  They also have a lot of locally grown stuff on the menu. Another time I brought my mother from the wine country here and even she was impressed.  I would definitely recommend this place, especially for out of towners. Well-executed southern gourmet and the best burger for lunch in town. (only comment is the dinner burger seemed expensive and had extra stuff I wouldn't want) Another nice surprise from the Something Classic folks. It's shocking that the people who brought the best vegetarian restaurant in town also has the best cow burger."], ["Kevin M.", "This gets a three, which means I will not go back. We ate there last night, had ceviche and the steak tartar for an appetizer. The ceviche has a bland marinade which overwhelmed the fish, but at the same time did not provide any unique or exciting sensations for the taste buds. The fish was fresh and in no way would you say it was bad, but it was not worth ordering again. The tartar was pretty much the same as the ceviche. It was there, it was not bad, but it failed to excite. For the entree we had the rabbit, as recommended by the waiter and the boar bolognese. These were a step up from the appetizers, but again failed to create the \"I can't wait to go back\" experience I was hoping for.  All the ingredients were there, but it was not assembled in such a way as to make a great experience. I am not a true foodie, in that I do not know how to tell them what they need to do different.  I am fortunate enough to experience many great culinary opportunities, but this was not one."], ["Nicole W.", "Another Charlotte Restaurant Week experience!Again, it is my personal belief a participating restaurant should put their best foot (or dishes, for that matter) forward during restaurant week. It's two weeks out of the year, folks. Do it up and do it right.That being said, I was absolutely jacked to try The Mint Museum's newest addition - Halcyon! Their fresh (no freezer on site) farm to table concept is just as lovely as their decor. Gorgeous twig chandeliers, lots of deep, rich browns, ocean blue wall, interesting silverware and more. Plus, that patio is going to be stunning during the warmer months. Service was friendly and efficient and we were in and out within an hour. I can, however, imagine staying a while once CRW is over. The food, however, is where Halcyon fell a bit short of wondrous, both in flavor and in portion sizes. I see on their Yelp biz categories they listed small plates and new American, perhaps I should have paid more attention to the small plate mention. Listen, I don't expect grandiose portions, but I left Halcyon hungry. That's sayin' a lot. Here's what I had:Amuse Bouche - Hummus w/pita points: 3/5: This was actually a generous helping of hummus, especially for an amuse bouche. Our server brought us extra pita points because the heaping pile of hummus only came with three. Ha. I love carbs, I'd like some extra pita. I just wasn't wowed by the flavor of the hummus,Farm Salad: 4/5: Local butter lettuce with a few sunflower seeds, tasty tomatoes and a delicious mustard vinaigrette. Great texture and full of color. I really, really enjoyed the dressing. Short Rib: 3.5/5: Let me put this out there right away - I love the flavors on the plate. Loved the tender short rib, the tasty glaze, the potato puree and the root veggies. My problem with this dish? There wasn't much of it. At all. Three very small slices of short rib, two bites of potato and the equivalent of two baby carrots diced. Normally I offer hubs a few bites of my dish, but I didn't have any to share. Color me disappointed, but they said this was supposed to be a main course*? Maybe I got the runt of the short rib  - it was very short. *In the same vein, hubs ordered the chicken and I chuckled when they set it down. The chicken was the size of a kiwi with a protruding bone. Creme Brulee: 2/5: Very cold inside and the texture was pretty off. Not smooth, creamy and delicious as I had hoped. Plus, the flavor was lacking. So, maybe I should have paid more attention to the small plate classification? I'll take a bit of the blame, but that could have been advertised a bit better on their CRW menu and website, for that matter. I know I'll come back to Halcyon as I really adore the concept, but I'll be sure to have a snack before I arrive."], ["Jeff S.", "I stopped here for lunch after a couple hours exploring the Mint Musuem.  The restaurant is not a big place but it is laid out well with counter seating and several tables.  There's a patio out front with large tables so you won't feel crammed.  The view from the window is a great one of South Tryon Street.  I was greeted immediately and seated at the window.  My server was there almost immediately and started me out with an unsweetened iced tea with mint.  She also explained the menu to me a bit and explained today's soup a watermelon and 3 other ingredient gazpacho.On a hot day, a cold soup would be quite refreshing so I ordered that and the Monte Carlo sandwich with dressed greens.The gazpacho was amazing with a bit of spice to it.  It was so refreshing that I could have jumped in if the bowl were larger.  The Monte Carlo was an interesting and very flavorful open-faced sandwich - BBq pork with cheese and a slaw on top.  Service was outstanding and I definitely thought I needed to schedule my dinner group here."], ["Gabriela G.", "Terrible service, I was there yesterday around 3:30pm after visiting the museum. It took at least 10 mins to have someone ask what I wanted to drink, 10 more to get a coffee and 10 more minutes to get sugar after I asked for it. I was never asked if I wanted to have something to eat, the place was not full there were only 4 busy tables including mine : 2 people in 2 of them and a lady on the other table.  2 waiters busy cleaning up tables, and a not very friendly hostess. I was starting to feel bad about being ignored until the person sitting at the table behind me stood up and screamed \"the service in this place is horrible\" and walked away. I finished my coffee, paid for it and left HUNGRY!The place is beautiful, the location great, very nice views of the city and a spacious terrace but service is bad and unfortunately I cannot comment on the food because I did not have a chance to try it. Coffee was OK."], ["Lisa M.", "Great dinner tonight.   We were a party of 10 to celebrate a birthday - sat at the beautiful table in the middle.   The food was great and the waiter was fantastic. Extremely knowledgable, pleasant and helpful. The time between salad and enter seemed a bit long, but with a large table it might be expected.  I'd return next time in town."], ["Betsy G.", "This is the perfect spot for entertaining folks traveling in for a business dinner.  It's as nice as a high end place, but has a local southern flair that is unique when put up against the usual chain steakhouse.  The view and the food are great too!"], ["Will H.", "This local farm to table concept by the folks at Something Classic, located at the front of the new uptown Mint Museum, is a new gem in the Queen City's crown.  Flavorful and well-prepared local ingredients shine throughout the menu.Let me begin with the decor.  You know the new Mint is very modern, and this carries thru to Halcyon's dining room.  There are muted natural colors accented by an earth-toned blue that pops up in many unexpected places.  The idea of dining in nature is enhanced further by the naturally shaped dark wood tables and the \"twig\" chandeliers.  Indoor and outdoor seating, with a great view of Tryon St. and the new cultural campus, are abundant.  Ceilings are tall and the whole place has an airy openness to it.  I could come here and just sit to enjoy the room- luckily the food was just as good.The wife and I dropped in for a bite on Saturday around noon.  To our surprise, they we rolling out a brand new brunch menu.  Plenty to choose from- soups, salads, omelets, and a handful of features.  Emphasis is placed on locally-sourced ingredients.  While we looked over the menu, our server brought by a few slices house-made baguette with a selection of homemade butters- pumpkin, cranberry, and red wine.  Interesting, but since the bread was already drizzled with olive oil we mostly skipped on the butters.The wife went for the french onion soup and, while we have had many versions elsewhere in town, this was by far the most flavorful.  Carmelized onions and gruyere cheese in a rich beef broth further flavored with port.  Not too salty, not sweet, just filling and packed with flavor that shone thru every spoonful.  Served in a perfectly portion little coquette dish that came out piping hot.  Perfect for cold weather days.I had a more traditional egg and toast breakfast- only the toast was more slices of the baguette and the meat was a house-made lamb sausage.  Totally could have eaten that sausage all day long- juicy and fresh tasting, with the flavor of lamb and spices mixing crazy good.  But the piece de resistance, not to be missed, is the duck confit hash.  Even our server noted it was a star on the menu.  The tiniest little cubes of potato, bell pepper and onion are cooked golden brown with a bit of duck fat.  Unusual and interesting, and oh so tasty.  Decadent for sure, but what a way to mark your ground on an otherwise crowded brunch scene.We will be back to try more- sadly there was no room left to try the french toast, but our server mentioned it was made with their homemade pumpkin bread.  Sounds yum-o to me.  I did note they serve a number of beers and wines, both by bottle and by the glass.  I also inquired about their cheese plate- currently comprised of 3 choices- you can have 1 or all 3.  Though was passed on this trip, I do want to try the Carolina Blue- topped with truffled clover honey.  Sounds good enough to make a meal out of alone!Overall, I have nothing but high expectations for Halcyon- everything about it ought to appeal to the modern Charlotte diner.  Well-thought out food locally-sourced and expertly prepared in a dining environment that is a treat in itself.  Hopefully the location is not a killer- but it ought to do a great weekday lunch business.  If you are in or around uptown, make this a must on your list.  I'm smitten for sure."], ["Lemuria C.", "This place has an excellent brunch. I usually like brunch buffets, but the food is so good here that I gladly make an exception. I had the grit bowl with shrimp, mushrooms and greens. It is the best shrimp and grits in the city. The ingredients are sooo fresh. Sit on the patio for a great view of uptown.  The decor inside is also fabulous, it's very chic."]], "Pio Pio": [], "A Piece Of Havana": [], "Morazán Restaurante": [["Ken G.", "Best latin food ever and really cheap. It's a hole in the wall kinda feel, barely speaks english servers but with the big and extensive menu you can never go wrong, tried over 25 dishes for less than $10 and each one is done good. You don't have to speak spanish just point the picture on the menu and you are set. Definitely worth a try and brought over 40 different friends not one said a bad thing."], ["Lisa C.", "Great food! Very reasonable prices. I'll be back."], ["Rachel L.", "Huge plates of authentic fresh food and friendly service make this place a gem. If I lived in town, I would be a regular. Try the Honduran specials and the drinks. The carne asada was also tasty."], ["Michael D.", "This is my favorite Mexican/Honduran food in all of Charlotte. Everything is spot on, more authentic, and taste better than other place I have had so far.  The lunch specials are cheap as all heck and you get a lot for what you spend regardless.  The only thing that might throw some people off is that not all the staff speaks English.  So people who come with me usually just either point at something or ask me to request it.  Definitely check this place out!"], ["Demian S.", "Clean NiceGreat foodFresh as your going to get in Charlotte Incredible food for the money"], ["Joseph R.", "Excellent food and staff. The portions are large and the presentation is great. The flank steak is incredible here and is cooked to perfection. The horchata is the best horchata I have ever tasted and I would definitely recommend this place to anyone who wants fresh, authentic Latin American food in Charlotte."], ["R L.", "Morazan serves Central American food at the best price around. Their portions are huge, and the plates are always so neatly garnished. They have an extensive menu that includes Mexican, Salvadoran, Guatemalan, and Honduran food. All the items are described in English and Spanish and includes lots of pictures which help with the language barrier for some customers. I've been here several times and the service is decent, the waitresses often check on our table and the wait on the food is not long. They also have lunch specials that are a steal. Bigger than dinner plates at most places and under $10, and to top it off, their corn tortillas are always hand made. I don't understand why anyone will go and pay twice as much for mediocre Latin food at some of the hipster places around town when this restaurant is so close to the city, particularly South end. The only reason for four stars is because the staff needs some training on personal skills. The body language on some waitresses could be seen as cold or not caring. Most likely it's just cultural. I've experienced the same thing at other ethnic places and don't take it personal."], ["Kat C.", "To be honest, I was pleasantly surprised by this place.We were craving Mexican food, and happened upon this place with Yelp's help as well as proper timing. Most other places that were closer were closed. So whatever, this place had a few reviews.The exterior isn't something to be admired, but I never count that into a place. If it's got good food and good service, it hits the mark for me. The food was more than I could ask for. The portions were huge, the food was fresh (save one of my enchilada tortillas that was stale on one half), and the plates looked really delicious (plating, garnish, and array of color). The menu was huge, and I could see myself ordering something different every time.The service left a little wanting. Our waitress didn't come by often which led to empty waters constantly. The only reason this gets a four out of five is that the service wasn't top mark, and the one enchilada out of three was slightly stale. Would I go back? Most assuredly. This will be my stop for Mexican from now on."], ["David L.", "Very good service and portions for a lunch menu.  If you are a soda drinker this is not for you as they serve cans at a hefty cost.  Overall, the presentation and cost of the meal were very pleasing and acceptable.  Would recommend."], ["Michelle B.", "Great food great prices. People that work here are not the nicest but I just get it to go, everytime."], ["Keith N.", "It is due only to my laziness that this is my first review of Morazan (South Blvd location). During our first two visits, the experience was tremendous - a lot of tasty food for the money and excellent service by our waiter (perhaps owner?), who introduced himself as Mario and shook hands all around. He was friendly, patient as we perused the extensive menu, and attentive. *That* review would've been 5 stars. We (a family of four adults) returned tonight, and it felt like a Twilight Zone episode...but not one of the good ones. Everything looked the same and the food was still high quality; however, the server had morphed from the esteemed Mario to an 18(?)-year-old who perhaps started his career in the restaurant industry, say, earlier today. He seemed to have not been trained at all. It was not only that he lacked significant social skills, but his poor attention/ memory caused us to get some (minor) incorrect food...even after another server came back to confirm part of the order. But the biggest problem was simply that he clearly had no interest in his job. This included ignoring our party for most of the evening while chatting with the 5+ female servers. So, two stars tonight. Please bring back Mario and I will gladly increase this to a 5-star rating."]], "Sabor Latin Street Grill": [], "Punta Cana": [["jim m.", "THIS PLACE IS GREAT.  2 huge plates of food, 4 beers, 2 people 30 bucks.  The service is great and the place is spotless."], ["W. L.", "I've been wanting to go to Punta Cana for a while now, but I hate driving on South Boulevard. It stands from its surroundings (despite being in what looks like an old Wendy's) because of its bright colors and the palm trees out front. It was mostly empty on the inside and we were seated promptly. My wife and I both ordered mofongo (something I fell in love with during a trip to Puerto Rico last summer) - hers with fried pork and mine with fried pork belly. I liked the mofongo, but the pork belly was slightly overcooked and dry - almost as if it was cooked earlier and reheated for me. The portion was bigger than we expected. I finished mine barely, my wife got her leftovers to go. This is the only place I know of in Charlotte to find mofongo and it was pretty good, so we'll be back (but next time I'll get the fried pork or steak)."], ["Liz M.", "I was so excited when I heard about this place I couldn't wait to try the pernil and platanos. I was so disappointed after my visit ! The service was terrible! I don't think I saw one employee that looked remotely happy to help with anything. I probably asked for bread 5 times. When I finally received my food everything was cold and my rice was hard. My husband ordered the shrimp mofongo and he seemed to enjoy it. I doubt I will be back!"], ["Marc W.", "This place is amazing for the money. I eat here frequently, and frequently take newcomers with me who love it as well. The atmosphere is just okay, and the service is decent, but I wouldn't say exceptional. But the overall value is just amazing. The lunch special is $6 and you can choose from fall off the bone chicken, amazing pork, or other selections. You also get two sides which means a TON of absolutely DELICIOUS FOOD for $6!Do yourself a favor, particularly if you are new to this type of food - or even if you aren't - get the tostones. They are the fried plaintain, and with the mojo sauce they have, it's so amazingly good.I've been here for dinner once, and I think based on the service and atmosphere it is probably a little overpriced for my taste, but this is my absolute favorite place to have lunch!"], ["MrandMrs O.", "Punta Cana had been a favored locale since it first opened, as the Mr. has a crazy yen for Dominican food.  The Mr. likes the chicharron (de cerdo), the chivo guisado, and the chicharron de pollo (con hueso).  He likes the pernil, though he says that sometimes it is a little dry and not as tasty as it used to be.The Mrs. agrees that the chicharron de pollo (con hueso) is tasty, though not as much as it used to be, and she likes the mofongo.  The sancocho, which is available only on Sundays, is good and as close to authentic as you will find in the area.  But she had a bad experience with rancid bistec encebollado, which tasted as if it had spent too much time without refrigeration before cooking.  On a few occasions, the platanos maduros have been overcooked and burnt.  Sometimes the chicharron (de cerdo) in the mofongo was undercooked.  Fatty pork is very unpleasant when it is undercooked.Punta Cana went through a fire some time back and has not fully recovered from that disaster.  The service is not the same excellent service it once was.  The food is now in much smaller portions, and the quality is not what it used to be.  We used to be regulars, but now . . . not so much.The Mr. and Mrs. would like to see Punta Cana go back to the wonderful service it used to have.  The Mrs. would like to have Punta Cana be more careful of food preparation and hygiene.  (The Mrs. is sensitive to ill-prepared food.)The Mr. and Mrs. recommend Punta Cana, with caveats.."], ["Tae-Sun K.", "This place is great. Best mofungo ever --- the mound was textured with crispy, fried pieces of plantain integrated within the traditional mashed up plantain chunks. I could eat that all on its own. I ordered it with the fried pork chop, which came with the traditional gravy --- delicious. The maduros and boiled yucca were prepared just the way I like it. The garlic sauce for the yucca was potent . . . but again, that's just the way I like it."], ["Cynthia G.", "I went to Punta Cana at 8:30 or so on a weekday evening and had a really nice dinner.  The place was pretty empty given the lateness of the hour, but service was fast and pleasant.  Even though it's located in a seedy stretch of South Blvd, the inside of the restaurant has a nice atmosphere for a sit down dinner.  The food was definitely interesting, maybe a touch on the bland side, though -- but I'm not sure if that wasn't just a result of what I ordered.  The mofongo (plantain hash) was something I'd never tried before, and with it I had a crab creole dish that was very tasty.  Dessert was flan which was, well -- flan.  Hard to screw up.  I would definitely go back and try some of the other specialty dishes."], ["Pourina R.", "Ohh I think I frequent Punta Cana enough to be considered a regular. While the food might not be the best tasting latin I've had, it sure is hearty. With a variety of different lunch time meals at $7 you get your dollars worth and it sure beats a large #2 at Mickey Ds!"], ["Callan C.", "Great place on South Blvd.  Lunch special is $5.95!  The juice is great, I had passion fruit.  I got a pork dish, yellow rice, and yellow plantains and it was a great combination.  Other items I enjoyed were the steamed bread appetizers, chicken empanadas, and the green plantains dipped in some kind of vinegary garlic concoction.  Can't beat the value!"]]}