{"Cuisine Malaya": [["Dominique J.", "This restaurant is my new favorite in Charlotte. I got the chicken satay, fried gyoza, California rolls, fried ice cream, and beef and broccoli. This all came to $30. The veggies in the sushi were crisp. The beef was tender and well seasoned. The peanut sauce was great and at the right consistency. The food came out in a timely manner. I will definitely be returning!"], ["Janine D.", "Good service, average food. If you're one who appreciates authentic, spicy curries, this may not be the best place for you. The roti is fantastic but I wasn't over impressed with spice levels or flavor. Overall not bad. Worth a second trip? Maybe for the roti. ;)"], ["Rachna B.", "One of the worst restaurant experiences. Waiter snatched a review out of my friends hand. Manager said they were busy but there were only 3 tables at 8:45pm on a Tuesday. Please do not come here. Food was mediocre and the waiter should not be working in he service industry."], ["Ron W.", "Score 1 for Yelp!  After a failed attempt to eat at a local hotspot I re-check my Yelp bookmarks and voila!  There's Cuisine Malaya, all the way across downtown Charlotte.  I hoof it over about a mile and show up at this basic and simple cafe.  Inside, the space is big and I'm hungry.  All that walking has worked up an appetite and bonus, there's a check-in special for a free glass of wine or beer, woohoo!I order up a bunch of Malaysian items and they all please.  One roti canai, one Malaysian chili shrimp and a peanut pancake for dessert.  All well prepared, tasty, spicy and overall yummy!  Service is really spot on and the price is right.  Cuisine Malaya also serves up Japanese-sushi but I'd stick with the Malaysian.  Cause it was good!   So rock on Cuisine Malaya, you were worth the walk and thanks for the vino..."], ["Jeff T.", "A lot of authentic Malaysian dishes.  Very homey feel.   A very good place to take ur friends and family for a non American dinner."], ["Kate T.", "I have been meaning to get here, and being lazy tonight and seeing they delivered I made the call. Having never been I had a few questions and the individual taking my order was extraordinaire! He walked me through a few items and made recommendations, so I went with his choices. I started w/ the steamed popusas and the miso soup, both good. I am a miso fanatic and it wasn't my favorite, but was definitely good. I decided to order the sushi/sashimi platter, fresh fish! Overall, thought it was great and the fact they deliver is a plus!One final note: I was quoted 30-35 minutes, and they were spot on. Love that!"], ["Paramita G.", "Awesome food. Loved the Roti Canai. 'Sarong Burong' with the red pepper chutney was great. It had a mild and dull taste but with the red pepper chutney it tasted so good. 'Blissful Noddles' tasted blissful even the next day.Nice place, nice people and nice neighborhood. Had a nice walk around after food."], ["Katie W.", "Started off with the roti canai after reading all the yelp reviews. It was pretty delicious, although I would have preferred a little more spiciness. For the main course I ordered Curry Laksa with beef and my friend ordered the same with shrimp. SO GOOD. Again, I would have preferred a little more spice but the flavors were totally on point. When I come back (and I most definitely will be coming back) it might be difficult for me to order something different on the menu, just because I enjoyed the curry laksa so much. Some of the main \"specialties\" dishes were a little pricey, which I wasn't really prepared for. I'll keep that in mind for next time. Don't forget to check in on Yelp for a free glass of wine or domestic beer! ;)"], ["Michael M.", "Meh. I wasn't impressed. The roti was good but not what the reviews suggest. I ordered the  curry with rice noodles; it was bland."], ["Rachel S.", "Incredible food with great flavor. The rest isn't is a little dated and needs a makeover but the food more than makes up for the questionable ambiance. We had several traditional dishes as well as some sushi. The soup was amazing!!"], ["Supreeth R.", "Overall a good restaurant to go to. But the food wasn't that spicy and was served a tad cold for my liking. Do ask for their chili sauce and that has a very fresh taste to it. And don't miss the calamari. Non vegetarians have more options to try out."], ["Clay C.", "My wife is Malaysian and I've consumed more Malaysian cuisine than most Americans, so I think I'm qualified to review these folks.  Their beef rendang and roti canai were on point.  On par with what I have had in Kuala Lumpur!"], ["Noll K.", "I eat here fairly often, usually lunch; and I've always enjoyed good service here. My lunch go-to's are Curry Laksa and Prawn Mee - both spicy soup dishes. I've eaten dinner here a few times, mostly sushi (always sit at the sushi bar - a universal rule for sushi!). The sushi is decent; but nothing mind blowing (mouth blowing?) to be had here... Today it's chilly outside (at least for Charlotte) so I got an xtra-spicy Prawn Mee - it completely cleaned out my sinuses! So good! Give it a try if you like the spicy stuff."], ["Tins H.", "Ordered the coconut curry and my daughter had the shrimp terreyaki hibachi.  The flavor for the coconut curry was very bland.  The terryaki was just way to sweet.  I will not be returning here."], ["Joseph H.", "Pretty awful entrees, sushi wasn't bad and decent service.  The chicken they used in the pad Thai was so horrible I couldn't even eat it.  I finished half my plate and didn't get a to go box"], ["Cat S.", "What an eclectic restaurant! They say they're Japanese and  Malaysian, but they also seem to have Thai and Chinese influences on their menu. I had the Curry Laksa, which is an amalgamation of a traditional curry and pho. It's a large bowl of either egg or rice noodles with beef, chicken, shrimp, and vegetables in a flavorful curry and coconut milk broth. My dining companion got the shrimp hibachi, which was delicious as well. A solid choice in an area of the city known for its Asian food.* Be sure to look for the Yelp check-in offer for a free glass of wine or domestic beer. :D *"], ["Tracy D.", "I have been on a Cuisine Malaya kick lately, ever since I realized they deliver to NoDa!!  I have always enjoyed dining here, and then would forget about it for a while and then kick it back into the rotation, lately its just been more so because I have been on a sushi and noodle kick and they provide both.  The other day I was driving home and stopped it around 4 and asked if they had lunch specials still, and was amazed that they do till 5!  So I got a sushi combo where you pick two rolls for I wanna say $7.  The food was ready fast and I was full, can't beat that.  They also have a lot of good appetizers, the chicken lettuce wraps are delicious and enough food for a meal.  The employees are always so nice, the prices are pretty reasonable and the food is good.  That's what keeps me coming back!"], ["Donovan H.", "Cuisine Malaya can be quite hit or miss from dish to dish. The vegetable tempura I had was pretty greasy and over-cooked. Then I tried Kung-Pow tofu and it was under-cooked and over-sauced. Neither time was so bad as to write it off.Then when a friend of mine and me needed a late supper we went there and got sesame tofu with mixed vegetables and seaweed salad. It was all so very good! I am glad I gave them another try.The place it's self is located very close to the CPCC and is very convenient for those close to uptown Charlotte, as I am. It has a nice atmosphere and bar. They have sake, beer, and liquor. What more could you ask for while you wait for your food?"], ["Pilar C.", "I was very impressed with the food here. The food taste very fresh and delicious. We ordered shrimp wrap for appetizer (really good), Pad Thai- house Especial and Scallops with sesame. Highly recommended!"], ["John H.", "Nothing that memorable. Decent, but impersonal service. Forced 18% tip for 4 or more.  Sushi was alright, menus are somewhat hard to choose from."], ["Guam D.", "I had the Roti Canai, similar to what I've had.  The pancake was softer not as flakey as it is here but still delicious.  Every place makes it slightly different.  The curry dipping sauce makes this appetizer the bomb.  It has a nice light curry flavor to it.  I highly recommend it.I also ordered the hainese chicken, I believed the chicken is boiled.  They provide three different types of sauces; soy sauce, red peppery sauce and a garlic type sauce. I tried each one with the chicken and it was also very yummy.  Be brave and give it a shot.  I must warn you that the chicken is not deboned so be prepared for a little bit of work.Lunch was so delicious that I decided to return for dinner."], ["Angie Y.", "I have eaten here several times and haven't had a bad experience. I have a difficult food allergy and the staff is quick to accommodate. The steamed popiahs are excellent and they have unique sushi rolls."], ["Robert M.", "I'm always a fan of Cuisine Malaya!  The food is best at lunch because it's so cheap.  I always get the pan fried noodles... it's good.  Oh, but if you're not in the mood for noodles... the curry fried rice is amazing."], ["Navin S.", "Decent for a city like Charlotte, but cannot compare to the Malaysian restaurants on the coasts (or in Asia of course). Had a coupon that offered a free glass of wine for every check-in on Yelp but after we ordered 2, they said it was only one per table. Very stingy that way. What if my group had come as 4 individuals and sat at the bar? We would have got 4 free glasses then. You would expect Asians to be better at math."], ["Tiffany W.", "Love this place.  This place served Thai, Malaya and some Vietnamese food here. My favorite for appetizer is the Indian pan cake (roti canai). Service a little slow but the food are great so it makes me forget about services HA. Enjoy!!!"], ["Londonbridge X.", "I've seen this place million of times since I've been in Charlotte and has never once tried it until a couple of weeks ago! My husband use to go to school by there and told me it was not good so that kind of stop me from trying it although I've heard good reviews from other people. We finally decided to try this place since we wanted a break from Viva Chicken and it was close by. I was amazed! I got a hibachi plate with steak, chicken and veggies. It was super delicious! The meat was cook just perfect with a flavor glaze that is so good."], ["Bruce K.", "The recent chef that changed at this restaurant made it for me and my family. This is one of the regular restaurants that we come to now because of this very reason. A couple of years they had a chef that was horrible, my parents didn't approve of his way of preparing dishes and it was just sloppily done. Doing business with this restaurant has recently created ties with my parents and now well, they have the family going here every week if possible. Off menu items are a constant thing every week. Delicious steamed fish, sting ray, every week when my parents have the chance they ask what's special to the chef and he blows us away every time.Inside, the ambiance is a nice laid back sushi bar with several big screen tv's and if you walk around to the left side there's a grill for hibachi. Everyone is friendly, and the service is pretty good. But honestly, what gets me is the food. The flavor is good, it's not too oily and they don't put too much MSG as some restaurants do. Until they change a chef (which our family hopes they don't) this will be one of the restaurants where we will eat out at, and we don't eat out often. Come here, enjoy your time, order anything off the menu and you'll be surprised and ask for some more."], ["Kenny R.", "The food ain't bad.  But their predatory towing practices are.I parked in front of a sign that said customer parking only.  I was a customer, and my car got towed.The owners of the business say its not their problem, its the owner of the parking lot.  The owner of the parking lot says its not his problem either.So, my $30 meal just got a $120 tax added on to it."], ["Joseph P.", "Always make sure to scrutinize a resturant review from a college student.It's more than likely based on the cost of beers rather than food quality. My sushi was warm, food was cold, and the chicken in my stir fry tasted old."], ["Abby A.", "I eat here about once every other week. Their Tom Yum soup and hot and sour soup are delicious. The favorite starter is steamed popiah and my favorite sushi roll is the spicy scallop roll (ask them too add masago).  Their curry duck is my favorite entree, but the basil duck is good, as well. This place never skimps on the veggies. They are always fresh and in interesting combinations. For example, the curry duck comes with steamed okra in the curry sauce. If you are a regular or a first time visitor they'll treat you like royalty. I recommend sitting at the sushi bar, as their chef is friendly and informative.Beware: their online menu is missing several items that are in the dine in menu."], ["Rajeev N.", "They serve THE BEST roti canai!! MUST EAT!! Highly recommendeddddddddddddddddddddddddd!!!!!!!!!!!!!!!!!!!!!!!!!"], ["Stephanie M.", "I tried this place out Tuesday night with a fellow yelper friend after a trip to the Mint Museum on Randolph and wasn't as impressed as some of the other reviewers I see for Cuisine Malaya.   The menu is extensive though a strange combination of Chinese, Japanese, Thai, Indian and maybe more...but I guess it's a little of something for everyone.We started with Vegetable Tempura that had onions, mushrooms, and zucchini (minus broccoli since he doesn't prefer it).  It was okay, not the best I've ever had, but not the worst either.I ordered the Curry Chicken and it was good.  Not too spicy, maybe could've had a tad more spice.  Chicken was tender and well flavored and veggies were cooked through but not soggy.  The flavor was good, but I have had better curry dishes elsewhere. He ordered the Basil Beef.  They delivered Chicken (not sure if it was Basil Chicken but it was spicy!).  So we tasted the chicken first before they took it back to exchange it for the correct dish which was on it's way.  Both were good - the beef was tender and flavorful and the veggies in both dishes looked good.Our glasses stayed full and the waitress was friendly enough and very helpful even though she'd only been with the restaurant for three months, so that was a plus.I might try Cuisine Malaya again and give them another chance if I was in the area, but I wouldn't make a special trip."], ["Rena H.", "don't feel like it's a authentic malaysia restaurant...the food is more like chinese."], ["Anne B.", "Nice atmosphere. My meal was good but not as spicy as I would have preferred. The roti canai was absolutely delicious."], ["Alien T.", "I don't remember going to many Malaysian restaurants in the past. So I tried this on my first visit to Elizabeth neighborhood on one rainy night on a Friday. It was worth it! I really liked the roti cani. The roti was cold but the perfect and spicy gravy compensated for that. I would highly recommend everyone to try roti canai, at least one time. This is a nice appetizer.I had a curry flavor from the Chef's Specialties. It was perfect. Very well cooked vegetables in the curry, made me happy. The meal was big for me after I had roti so go with the big appetite. I have to pack the left over but I know it would taste yummy next day. Any spicy food taste delicious next day. That's the fantastic fact about spices. As per my visit to this restaurant, it was favorable. The staff was friendly. Although I wanted to sit on a high tool or a high chair in the bar area but they made me sit at the short chair area in the bar area. That's fine. No harm done.The food made all the difference. The menu looked really great and it was hard for me to decide as everything on it seemed worth trying. I went for a simple (according my gut feeling) and predictable (as one can think) dish which was Curry Flavor. I have become very picky since I become pesceterian. Instead of trying sushi or seafood stuff, I went for pure vegetarian. I can confidently say that many vegetarian folks would like this place. They have few items on the menu for vegetarians.Overall, I like this place."], ["Kenzie K.", "I went to Cuisine Malaya hoping for some fun Malaysian food, however it seemed to be more generic asian cuisine. I tried a pineapple dish that was entirely too sweet. Overall the food was nothing out of the ordinary. The service was fine, the restaurant was plain, but clean. I would say if you are looking for americanized asian food, it is not a bad place. I probably will not be returning anytime soon!"], ["Misha T.", "The variety and options at Cuisine Malaya are pretty amazing and it also seems to be the most vegetarian friendly (of non strictly vegetarian restaurants) i've been to in Charlotte. The chicken curry was good and roti canai is always a winner. Probably my favorite thing I've had there so far is the basil duck."], ["Benjamin G.", "I had been meaning to check out Cuisine Malaya for some time and was happy to finally check it out for lunch. Though I love Malaysian cuisine for it's mix of great curry dishes and noodles, I went with sushi here. Not exactly sure why, but I was rather satisfied with the selection. We started with the roti telur which is one of our favorite Malaysian dishes. Theirs was a little more spicy than others we've had, and the curry was housed the typical potatoes swimming in a delicious curry sauce. The pancake was great and cut into larger pieces than usual. As always, eating this with chopsticks is the way to go!I ended up ordering a specialty sushi roll -- spicy tuna, avocado on top, a spicy mayo, and veggies. It was pretty standard and exactly what I expected. Nothing out of the ordinary. It was filling, but we all know the problem with sushi....Give yourself 30 minutes and you're hungry again! Blast! I should have ordered more to go! Service was a little sluggish and our food was brought out in oddly spaced waves. Not a deal-breaker, but it was a little inconvenient. I can't wait to go back and try one of the chef's specialties. I love the feel of this place as it is rather open with plenty of seating. A drawback is the odd placement and parking. There are like....4 entrances and only one of them is unlocked/functional as an entrance. Kind of weird, but who cares. Very much looking forward to my next visit."], ["Biagio C.", "My wife and I went here for dinner on June 1st for the first time. First impressions were not great as around 7pm, the place was almost empty and very quiet, meaning no background music. We were quickly seated and greeted by our server. She was very pleasant and attentive. Shortly after ordering our drinks, background music was turned on and a couple more patrons were seated. We ordered some traditional apps that were popular on this site; the popiah, roti and fried shrimp. We really enjoyed the shrimp but the flat bread and popiah were just ok. For entrees we ordered 2 sushi rolls which were some of the best we have found in Charlotte! The spicy scallop roll was fresh, tasty and terrific. The sushi special, which was something like Mumbo Jumbo roll was even better! We will be back for sushi for sure and also hope to try some of the more traditional entrees. **I like the tip on this site about checking in on Yelp for a free domestic beer or glass of house wine**"], ["Alexandra M.", "This review is about the FOOD only! I'm in town and without a vehicle so naturally I was looking up some tasty delivery options on yelp, when I came across cuisine malaya, I was elated to see that they delivered.  I got my food fast, both dishes came in very nice containers and I was sure i was in for a real treat! Based on other reviewers I had the steamed Popiah  and the beef Char kway teow..Back to the opening of the containers.... First the steamed popiah, I'll admit I have never had popiah before and they probably would have been better if they were fried.   The popiah consisted of a thick roll stuffed with mostly rice and some other ingredients, it was topped and garnished very nicely, the problem is.... It didn't taste like anything!!!  I'm a firm believer in not eating tasteless food.   The char kway teow was similar in appearance to pad see ewe but again, this dish was tasteless..... I mean I couldn't taste any flavors! How does this even happen?? Did they forget to add flavor to my meal???  I ended up only eating a tiny amount of my food...  It's so sad when you have something that looks delicious, but turns out to be a barrel of bland....."]], "Koishi Restaurant & Sushi Bar": [], "Ru San's": [], "The Cowfish Sushi Burger Bar": [["Stephanie F.", "So. Many. Options!!! This place gets high marks for a really wide array of food options even if it is a little overwhelming. It was packed when we arrived on a Sunday night but we got around the 1.5 hour wait time by stalking people at the bar. We snagged 3 seats together and my daughter played video games (embedded in the bar) while we looked at the extensive menu.If you are gluten-free: THEY'VE GOT YOUR BACK. They know what IS and IS NOT gf and their menu is pretty clear. Any questions and they ask the chef. We got burgers and make your own sushi. The food was amazing and the service was excellent! Great atmosphere, easy parking, and an overall great restaurant. Wish we had one in Atlanta!"], ["Jennifer K.", "Always a fan. Decided to treat myself to lunch during a day off from work. I always do the make your own roll with seaweed, jalapenos, cream cheese and brown rice... it should be on the menu because its super good. I also always order the thai cucumbers they are tangy, crunch, cold and a perfect side dish. I sat at bar and the service was excellent."], ["Joan L.", "Is something really \"hype\" or \"hyped up\" if it fully lives up to its expectations?  Coming from out of town, I had not heard any \"hype\" about Cowfish. I was just in the area and as usual, let trusty Yelp guide me to a place that looked good.  I read a few reviews to get an idea of what to order, but it was not until I started to read more, that I realized that this restaurant had a reputation to live up to.We were intrigued that this restaurant specialized in two things our family loved: burgers (my husband & boys) and sushi (me!).  Starving, we made our way over for lunch on a Friday, only to be told it would be a half hour wait.  The wait was only about 20 minutes, which gave me a chance to explore the lengthy menu and look at yelp reviews for food suggestions. We were all ready to go when the very friendly server came for our order. Warning:  I think just reading what we ate for appetizers might give one coronary artery disease!  The two Moms and their teenage daughters (eating their salads) sitting at the next table looked at us in both horror and envy as we chowed. All I could tell them was, \" Eating is different with little boys!\"  They laughed and said, \"We wish we got what you did!\"We had:  Coconut Battered Onion Rings ($6), served with a horseradish aioli & Thai sweet dipping sauce. I am not usually an onion ring fan but i did taste these, especially because I love to dip. They were huge, crunchy,& delicious!Crab Rangoon Dip ($11) - great recommendation by yelpers! Unusual, creamy, yummy!Parmesan Truffle Fries ($8) - with Parmesan cheese & bacon. So tasty! Really sinful!  The apps alone left me stuffed!They have more unusual burgers at Cowfish than I have ever seen. Husband & 11 year old shared two: 1) the Hunka Hunka Burnin Love ($16):  Yes, a burger with peanut butter, fried bananas, & bacon. You could almost hear Elvis singing! It was good, but not as great as burger #2) the Arnold Hamandegger ($13):  cheese, ham, fried egg, bacon, grilled onions, cowfish sauce, onion roll. 9 year old and I each had our own Bento Boxes. These are combo meals with a mini burger, sushi roll, thai cucumbers, sweet potato fries, & edamame. It is really the best of both worlds and it was a fantastic choice!    9 year old got the Cowfish Bento Box ($9) which came with a plain mini burger and he chose a Philly Roll, which he loved. I got the Ultimate Bento Box. I really did not care much about the double stack featured mini burger. I thought it was somewhat dry and I just tasted it. I got the ultimate because I wanted to try one of the special rolls.  There are many unique rolls (as well as sashimi, nigiri). You can even create your own roll. I tried \"The Boss\" and it was original, satisfying, and delicious:  Spicy tuna, kani salad, cucumbers inside, coated in tempura flakes, topped with avocado, tuna, etc. Service was very friendly and efficient.  Our server even pointed out that Joey Fatone was in the house. Woo hoo!  The manager (possibly owner?) stopped by to see how everything was and I begged him to open a place in Fort Lauderdale.   Proof enough we loved this place?"], ["Sharon Q.", "The restaurant is overall very nice! Although the waiter spilled coke on my dress by accident, but is food is good. The mango roll is very good and taste explotion burgushi is special, too. I personally perfer the original sushi instead of the burgushi which is too American..."], ["Rachel F.", "Got a recommendation at work to try out this Charlotte restaurant. So glad I did!I tried the crab rangoon app like everyone recommended, it was as amazing as everyone before me has said. I also offered the Jim Bean spiked milkshake, it was delicious, but very filling, as you would expect.I also ordered the specialty bento box with Mark's roll, Mark's roll was by far my favorite thing I ordered!I sat at the bar, the place was packed on a Tuesday night. The bartender always made sure my drinks were full and once the placed died down a little, came over to chat a little. I think anyone visiting Charlotte should make an effort to check out this foodie dream restaurant!"], ["Chris S.", "The trendy place to be but its really good food too. I get the bento fusion box with Marks roll usually. Plenty of food and it's a perfect combo, four pieces of sushi and a slider burger of the day. If there is a wait walk all the way around the left and follow the bar. There are sometimes open seats at the bar you can jump in for quicker service.When you're done you can walk over to Cheesecake Factory for dessert."], ["Victoria W.", "Oh the legendary cowfish.I have been dining at this restaurant at least once a year since it opened, and every year it seems to change just slightly. When I say change, I mean that people from the queen city more and more come to realize that this place is as close to a foodie fusion place as it'd ever get in Charlotte. The very first time I came here was back in 2009, that was when they used a school bus to deliver orders. I thought it was a super cool concept, I had even read about it in the local magazine. At times I would show up at this restaurant and the manager would have daily huddles with his team of servers right before the restaurant open. I'd say great business mindset. Service is everything and they seem to have had it right. The interior decor is very matching of the name, everything had some kind of cow and some kind of fish resemblance. Aferall cow fish means a burger and sushi place!The bar is a nice area with a cool blue back drop. The presentation of the food was nice, their burgers are stellar. Price is around the $10-$20 range for an average dish. The last time I was at this restaurant, It was late December 2014, by then it seems it had became the \"IT\" place of Charlotte. The wait was now around 1-1.5 hr just for dinner on a weekend. They ask for your number and you can track the status of your wait on a cute website with a fish. That time we never made it in to the restaurant, we ended up eating at upstream instead, however, if the wait wasn't so long, we would have definitely preferred dining at cowfish."], ["Kimberly V.", "Everything was delicious, creative, and well blended fusion.  Got the Poke Dip (which I highly recommend) and Prime Time Surf and Turf roll...amazing!!!  Hope they make it to DC Metro area!  I ate at the bar and Sean, the bartender, was very attentive, friendly, helpful, and knowledgeable (Not to mention a great mixologist)."], ["Tran N.", "The menu is overwhelming however the waitress was nice enough to give us a good summary of what's good on the menu. The burgushi is AMAZING. You must eat it!,I got the pitsburgooshi sand which and the bun is made of kani and inside of the bun is rice! It was delicious. The bento box was also super filling. The blackened tuna roll is spicy but in a good way! Oh and I would suggest going to eat at odd hours because this place can get packed."], ["Allie H.", "This place is just ok. I don't really understand why they have such a long wait all the time! There are better choices for both burgers and sushi in the area. It's not terrible, but not amazing either.  The tuna nachos are a solid choice. It's convenient that they serve burgers for the sushi loving/sushi hating problem that some people might find themselves in, otherwise not sure why you would make these 2 cuisines a combo as the split focus seems to make the food suffer."], ["Eric R.", "We came in at 6:30 and were immediately seated outside. It was a beautiful evening and the atmosphere was great. The patrons dress ranged from shorts and a golf shirt to slacks and dresses. You will feel comfortable here!For appetizers we had the crab rangoon dip and the seared steak tataki. I loved the dip and my wife did too. The seared steak tataki had steak, scallops, yellowtail, and tuna that was seared on the outside and raw on the inside. Not my kinda thing, bit my wife LOVED it. For the entrees I had the taste explosion roll (on the advice of a  fellow Yelper) and my wife had the filet and lobster roll. We both ate until we thought we'd pop! These were great choices, but beware, her steak was again seared on the outside, rare or raw inside. That's something she loved.David (complete with a handlebar moustache) was an EXCELLENT server. David took the time to explain things and make recommendations. All of his advice was 100% correct. He even had the chef make a few alterations at our request. He is fast, friendly, and knowledgeable. Ask for him!"], ["Brandon D.", "So...we left Carowinds and my friend, to my surprise has never been to South Park Mall...pulled up the GPS and well it's only 20 minutes away.  Away we went, after emptying my checking account at the mall, we were starving. Pulled up the trusty Yelp app, and this place appears.  Well lots of good reviews, let's try it.  Parking was not a problem and the we found the place pretty easily.  We walked in and were greeted, and promptly seated in a booth, that I requested.  Service was pretty good, just a bit off from excellent.  As for the food, the Parmesan Truffle Fires were out of this world, they were the bomb.  A surprise awaits you on the bottom of the bowl, parmesan queso.  Turn the bowl upside down and OMG best thing ever.    The burgers were also very good.  We got the Longhorn burgers, and the jalapeno bacon added a great deal of flavor. The meat was cooked to a prefect medium, and tasted great.  Overall, great place to try.  I will definitely try the sushi next time."], ["Jonathan O.", "Had a very basic burger and a specialty shrimp tempura roll. Both were delicious, absolutely outstanding quality. It's worth every single cent. I wouldn't recommend the Bento/Combo box. It's somewhat small/lacking in variety. Overall fantastic place to eat and the atmosphere is great for young people, which is a huge plus when trying to avoid the family crowds."], ["Monica M.", "I didn't actually get to eat here.  The wait was over an hour so I gave up.This places was packed - watch out for wine events because everyone comes out here to get lit up.Make a reservation if you can - you really really need to."], ["Tim F.", "Great great place. We went on Saturday nigh so my review is a couple days late. We had a 45 minute wait( which was unusually short according to other people waiting) which is not bad because they text you when your seat is ready. So you can visit the shops around the restaurant. Started off with the tuna nachos and they were freakin awesome!! We had decided to try the burgushi even though the burgers and sushi looked amazing around us. I got lamburgushi and my wife got dougs filet roll. Dougs fillet was the way to go though. I got a yellow tail roll just to try some sushi and it was absolutely perfect. Great service and good food. Probably should expect a wait. It's first come first serve at the bar. Next time I'm just going to get a burger because I really wanted one after I saw a few come out."], ["C G.", "Wow.... amazing food, great atmosphere. I was shocked how fast food came even with how crowded it was on a Friday night! Had the salmon sandwich and a black bean burger. Both were fresh with amazing taste. Onion rings were good and Cole slaw fresh. Wait staff was on it and front desk people were pleasant and alert. An all around amazing visit! Will bring in visitors that come to visit me."], ["Ken K.", "2.5 stars.....Sat in the sushi bar area, at the bar. Cool touch screens built into to counter tops, except they don't work very well at all. Still pretty cool. LOTS of staff about, except they are all cleaning and not really paying attention to customers.It took a WHILE to get an order in, couldn't get my check in a timely manner, didn't get my tea refilled....this actually became pretty amusing, then frustrating. It was after traditional lunch hour. (I arrived about 1:40 pm, and the efforts of the employees present were spent on doing everything except looking after me.)Ordered the lunch special bento box w/burger, which also took a while to receive. HOWEVER, it was really, really good.So, my experience: Kitchen - \"good\" -- Service - \"Lacking\" -- Cleanliness - \"good\" as I witnessed a LOT of cleaning going on around me, and not-so-much attention to getting me in and out at lunch time.I will go back when I have lots of time for lunch, and will revise this review if I experience better service next time."], ["Matt F.", "I've been here a couple of times, and just have not been able to come away happy. Cowfish has a cool interior, as well as the wait time and higher price you would expect from a restaurant in South Park. Which is totally fine and as expected.I have them another shot after they re-opened (for the second time) after their rhinovirus scare. It made sense that their lines would be shortest, and their kitchen would be cleanest, after their recent shutdown and extended cleanup.That was correct, and no one in my party got sick. Indeed, Cowfish was about half full, and I was able to get in and seated immediately.On my last visit, I was disappointed with some of the burgerushi, but was really impressed with some of the sushi. I was determined to stick with the sushi, which was fresh and delicious.I'm not sure what my waiter's name was, but it should have been, \"10 minute minimum.\" Because every single thing took at least 10 minutes. It was at least 10 minutes until someone came to my table. Again, the restaurant was hall full. I am unsure if I have ever had someone take my dinner order after my appetizer had arrived. I am certain that has never happened after the appetizer had arrived but drinks had not. At least, before my recent visit to Cowfish. Pretty certain Chilis can manage such basics, but somehow a place that goes $50/$60 a plate cannot.I am done complaining about all the waiting I did during my 100 minute long dinner. How is the sushi?The sashimi is my favorite in Charlotte. Their sashimi is easily the freshest, juiciest, tastiest I have had in this town. Nothing like a big bowl of their fresh fish on ice, especially when it is fantastic fish.The rolls are good. I would not say better than a number of other sushi joints, but good. Inventive. A little weird (I think mine came with burger sauce or something I didn't try).I really wish they had better service, because they could potentially be better than Baku, Pisces, Yama, or a number of other sushi restaurants. But my last visit was a disaster, and their sushi is not good enough to make up for their prices, wait, and service."], ["Michael S.", "Wish I could make it here more often.  Interesting menu and honestly a really fun place to eat. I have enjoyed everything I have ever had at this restaurant. Worth the visit"], ["Julie W.", "This is my go to/celebration place! Love it! Tuna nachos and the lobster crab spring rolls OR any of the sushi.  Delicious!"]], "Hasaki Grill": [], "Sushi Guru": [["Oki L.", "Went for lunch today, 2 of us out of maybe a dozen diners. A slow day. We both had the Guru bento box. The Guru roll is great and we both enjoyed them. This bento box gives you 4 pieces of their signature roll. We both ask for a substitution on the fruit (she asked for soup and I asked for a small amount of seaweed salad) and she asked for just tuna sashimi instead of the piece  of salmon and white fish that comes with the dish. Ryan told us there would be an up charge for the changes which we agreed. Before describing the up charge, let me first tell you the food was very good. Not great except the guru roll, but very good. Now for my ax to grind. The up charge was $5 for $12.50 meals. The charge didn't result in bankruptcy but it's the principle that the changes weren't that significant and the place was lucky to have a hand full of customers for a rainy Saturday lunch. Face it, you got to make a decision what to charge based on the charge, they did and I doubt we'll go back. There are too many other options for good sushi and there was no need to stick it to the few customers you got. By the way, I didn't think it was Ryan's call on the up charge, so his tip didn't suffer, albeit on the lower side our usual 20%. He was enthusiastic and personable but didn't adequately represent sticking I was going to get."], ["Chad E.", "Hmm. Definitely one of the stranger names I've heard. Usually \"guru\" is associated with technical prowess - and rolling sushi is more of an art form than technical, but who am I to judge?The inside of the place is nice enough, and service is friendly, but not quick in any way, even when no one else is there. And when I say no one, I mean no one. I mean perhaps even a sushi chef, because a simple roll took forever to come out.Once it did arrive, it was good enough, but I don't know if it was worth waiting as long as we did. I have no problem waiting (within reason) for something worthwhile, but this was just a little insane."], ["Aleks K.", "Finally made it out for sushi in Charlotte. We chose this place based on all the good reviews, I would say it was decent. It's in a funny mall with seating inside and outside. We had 3 rolls, all not too big to eat, generous and fresh. The search for the best sushi continues!"], ["Alyssa T.", "Came for lunch and it was alright. The tempura roll that they had on their lunch menu was amazing- best tempura roll I've ever had! I got a tempura bowl off of their lunch menu also and it was soggy and the choices in vegetables were unconventional and also there was no rice in the bowl. Everything was overpriced- especially for having a lunch menu. The waitress we had was nice to us but there were two people coming in and she said that they \"always bitch\" and the other staff were using profanities in front of customers. Only reason to give them a 3/5 is because the sushi was THAT good."], ["Jimmy R.", "Great stuff, truly a Charlotte gem. Would recommend  it to anyone. Was in town for business. Tried  it for the first time. There will be a second. Guaranteed!!!"], ["Mike A.", "Good quality sushi, but the service turnaround time leaves everything to be desired. For the second consecutive visit, we're 45 minutes post-order (there is one party of 8; otherwise we're one of only two tables in the restaurant) without a thing on our plate. Last time the server comp'd an edamame...after our meal...as an apology. Once is an anomaly, twice in a row is a pattern. Probably our last try."], ["L K.", "Worst place ever in my opinion. One weekday, my friend and I stopped by here around 1:30pm for lunch, we were both starving because we had just gone to the gym. We stood around the front of the restaurant for about 10 minutes and nobody came to greet us or seat us. Finally some guy that was eating his lunch on the terrace part came and told us we can sit where ever we wanted. We sat down and waited and waited... We saw one of the servers chatting away (for about 20 min) with one of the customers at their table. Finally another 15 min later, a different server came out of the back and said \"sorry I will be right back with a menu\"another 5 minutes later she finally bought us menus and took our drink order. We were so hungry at this point we chose right away what we wanted to eat and ordered with the server when she bought us our waters. My friend ordered a spicy tuna roll and another roll and I had the Salmon lover and Negi hamachi roll. By the time we ordered, the restaurant was all empty leaving my friend and I with only one other table (who had already finished eating and were having a meeting)tick tock tick tock....2:30pm rolls around still no food. We could NOT understand why 4 little rolls were taking so long to make because obviously we were the only table who have not eaten yet. And the whole hour we waited, none of the servers stopped by to refill our water or to tell us why the food was taking so long. Finally around 2:45pm we got our 4 rolls. Still No apology or explanation why it took so long. The rolls tasted whatever. Definitely NOT worth waiting an hour to get our food. Stay away!! Horrible Horrible service. Will NOT be returning."], ["Tatyana C.", "Amazing, fresh, yummy sushi. I asked the waitress for the best tuna sushi and she hesitated for one second then a huge smile crept up on her face. She said it would be a surprise and that if I didn't like it I could choose another roll. Let me tell you people, this was one of the best tuna rolls I've ever had and mind you I am a sushi snob. The surprise tuna roll wasn't on the menu either! So I felt so special!! It was called the super tuna crunchy roll. The sushi was a bit expensive but i don't mind paying for quality food. I also got the guru roll and salmon crunchy roll, which was Ah-mazing!"], ["Ryan M.", "This was my first foray into Charlotte sushi since moving down from NYC. I was definitely impressed while not having the highest of expectations (even placing an order to go).  The rolls were well made with great flavor combinations (with the exception of the Guru roll which was way too creamy/mayonnaisey). Most importantly, the fish was very high quality, which is the best gauge of a sushi spot.  I'll definitely come here again!"], ["Karuna S.", "If you're looking for a casual dinning experience, delicious sushi and friendly service - Sushi Guru is your place.I've been here a few times, and it's always been a good experience. So far, everything I have tried off their menu has been great! My favorites include the Sashimi Pizza, Hamachi Hottt and quite a few of their specialty rolls. I also like their miso soup because it's not overly salty. The last time I was in, I was pregnant and couldn't eat any raw fish - they offered to make any roll of my choice with the fish fully cooked. I got the Salmon Lover Roll and loved it with the cooked salmon! I'm not the biggest fan of the sake cocktails, though I did enjoy drinking some of the flavored sakes they offer. The restaurant is relatively small and the first time I ate here was with a group of 5 on a Friday night. We had a little bit of a wait; but the food, the cozy ambiance and good service made it all worthwhile."], ["Lisa J.", "Excellent service.   Fantastic sushi.  We sat in the atrium, so not sure how the atmosphere was inside the restaurant. Highly recommend.  They told us they're opening. A new location closer to me. Can't wait!!"], ["Jirapa S.", "My boyfriend and I were in Charlotte for the night before the Panthers Game last weekend, and we were so thankful for Yelp. We found Sushi Guru and decided to have dinner their. Great food! all of them. Signature Sushi Guru roll was amazing. I had Umeshu (Plum wine) and I love it!"], ["Som S.", "We found this place from the local online coupon.  I love to try new places especially sushi.  We went there for lunch.  It wasn't extremely busy but good traffic.  I love the outside setting which was indoor with a really nice arts and a fountain in the middle.  There's a walk way to other shops and restaurants.  I ordered my special Spicy Tuna which was extra spicy :D  It was really spicy but really good.  My hubby ordered Spider Roll which was great as well.  We will definitely go back again and I would recommend this place for all the sushi lovers out there."], ["Ellen O.", "I've always  knew that there was a sushi restaurant near South Park but I never really figured out where it was... oh...it's inside the building, behind Roosters! My husband and I decided to try it out on a Friday night.  It wasn't very busy (which can be worrysome  - it is a Friday night!) and we were seated right away. We started off with the salmon pizza, which was fun and tasty.  We also had the Guru Roll with lump crab.  Anything with lump crab piques my interest.  Our server was attenative and came by often. I was glad to find someplace other than Cowfish in the area for sushi. We'll definitely be back!"], ["Emi G.", "I feel like this is a hidden gem in Charlotte. The location is a little odd as its kind of like a weird strip mall turned restaurant alley, it's fabulous food though! I have been here a few times and plan to keep going."], ["Sara S.", "By far the best sushi in the Charlotte area. The atmosphere is small and quaint, but the food is always extremely fresh and delicious (and they can sub brown rice which some places cannot)! No drink specials which is a bummer, but the sushi beats any other nearby (Yama, Cowfish, Sushi 101, Pisces, Room 112, Nikko, etc.)"], ["Travis W.", "Another solid sushi spot for us in Charlotte.  I love the creativity and the variety of offerings.  I had a the low carb roll and dynamite roll specifically.  Both were well rolled and very flavorful.  They will also do brown rice rolls if you so desire.Our server was very friendly and quick to serve which was a nice plus.  The interior of the place isn't anything to really get excited about but the seating is ample and comfortable.I wouldn't put SG on the top of my go-to list but it's certainly top 5!"], ["Fleece P.", "Basic sushi spot, nice setup for decor,  but nothing special. There are too many sushi spots in Charlotte. I went here on a business lunch meeting , I'll have to go back."], ["Kate T.", "After reading the other reviews, maybe I went on a bad day. After arriving, I waited as the door, as the sign says \"Wait to be seated\". After a few minutes I peaked inside, no hostess but the sushi chefs said sit anywhere. After a few minutes, I was brought the menu, which offers a lot. I decided to try the Guru Bento Box, get a taste of a few different things. In addition, I ordered the miso soup, with had no flavor, very bland warm water, not worth it. The guru roll was god, but very heavy with the fried shallots on top, and the other items, sashimi, tempura shrimp, salad was ok. Overall I thought it was ok, nit bad, but not a 5 star sushi choice in my mind."], ["Jason B.", "I've been here twice now. I think the sushi is reasonable.  Not great, but it's a reasonably ok option if you are craving sushi."]], "Futo Buta": [["Maricel T.", "I've come back a few times a few months later. Much improved and now I'm hooked. Love their Fire & Ice. Lots of flavor and very filling. Go with extra broth and add an onsen egg :) Try to go early to beat the lunch and dinner rush. You usually get seated immediately if you do so or you'll wait a good 15+ mins. Seating is tight, still no hooks to hang coat or bag. Music genre is random and loud at times.Old review when they first opened:3 stars...for now. UGH. I know. I will be back... they need to work on some kinks, hopefully before their grand opening. It also doesn't help that I was already mentally comparing Futo Buta to Ippudo NYC and Momofuku. Just reading the menu reminded me of Ippudo's items. Upon entering, the place is cozy, small. I can only imagine the wait once they start picking up. Love the decor which reminded me of Momofuku's and a little bit of Toki Underground and Daikaya in D.C.. They could use some hooks underneath the bar and community table for purses, bags and jackets. I ended up pulling my purse handle up my leg to secure it. Staff is really friendly. While waiting for our food I noticed a few customers take their left over ramen to-go. WHAT?! Who does that??? Immediately my husband said, ratio is off, too much noodles, not enough broth. Once we got our ramen, I realized that was that was very true. I ordered the Niwa (vegan) and hubster ordered the Fire & Ice (salmon). For appetizers we ordered Shishito pepper and the Eggplant Buns. Here we go:* Shishito Peppers - Best thing we ordered from the menu. We enjoyed every Bite of it. Flavorful, made us want more.* Eggplant Buns - Fail. TWICE. First time, the buns came very chewy and undercooked. Second go, same but just barely undercooked. Eggplant itself was tasty.* Niwa - Could use a little more flavor. Noodle texture was perfect. You can tell they were homemade and fresh. Too much noodle, not enough broth. Plenty of veggies in there.* Fire & Ice - Salmon is smoked which gave it that earthy flavor but it was too salty and maybe a little too smoky as well. Cooked perfectly. Too much noodle, not enough broth. Fresh noodles. Overall, it was fine, underwhelming. As I mentioned earlier, a few kinks and fine tuning and this place will be great. Can't wait to come back."], ["Carrie O.", "We eat a Futo Buta often with our kiddos!  We love everything!  Gyoza, tuna and rice krispy squares, chicken, asparagus, buns, ramen.  Everything!  Thrilled to have them in my hood!  Atmosphere is awesome too!  Finally some good food in Charlotte!"], ["Dave J.", "Happy!, what makes you happy?. I have to say every time I come to this place I instantly get happy. Why?. Well the food is great and very authenticate. The have taken the time to find out the ingredients that work. And I made a rule not to judge the service but only the food, but in this place you will always get both in a quality like no other. Now, is a small place and it can get crowded and it will as more people find out how great this place is.The food, I have tried all appetizers, theirs buns and just a few of the ramen. In the few months they been open I have made this place my once a week visit. And I usually order the pork belly buns and brussels sprouts and my favorite Tonkotsu ramen. When I am done, I leave this place with a huge smile. The one bad thing I can say about this place is that is just a small location, but other than that you WILL DEFINITIVELY enjoy their food."], ["Mary M.", "loved the pork buns! love the ramen. I've eaten ramen in tokyo.  its good here!"], ["Danny S.", "Great fast efficient service in a timely manner. Servers and employees really friendly! Good location next to the train station. Atmosphere really clean and modern. Can't go wrong with the various choices of ramen to meet anyone's taste buds. Recommend the BBQ Pork belly buns! Only thing is that it gets crowded during weekends so try to get there early!"], ["Jacob W.", "Finally was able to try Futo Buta and it was okay. We ordered the Brussel sprouts and the fried chicken for apps, they were freaking amazing. They were gone in a flash.  Then we proceeded to order tonkotsu ramen. The ramen came out piping hot, once we took a bite, we weren't that amazed and hyped anymore. It was missing something, I can't put a finger on it. Order their house made soft serve ice cream! The flavor of the day was the Love Monkey which is chocolate and banana. So yummy. Overall, I would totally come back for the appetizers and soft serve, as for the ramen, ehhh. I'll pass on the ramen. The ramen is way too hyped. Our waitress Caitlyn was super sweet and attentive as well, kudos to her."], ["Brooke C.", "I had the Brussels sprouts and the Miso Hungry.  I tried my friend's rice Krispy squares too.  Everything was delicious!!  Our waitress was super nice and helpful.  I'll definitely be back."], ["Maya N.", "I had a chance to stop by this place for a late lunch. I felt in love with the simplicity decoration of this place. I had pork bun for appetizer. It was phenomenon!! The pork was flavorful and so tender and juicy that the fat is melting in your mouth while you're eating it. A+ for the bun. I also ordered miso ramen and added spicy pork into it. The taste of miso was very light. My friends had fire and ice ramen and the signature one that I can't remember the name right now. All the broths are flavorful and distinct from each other. Only down side is, I'm not sure if I was full from the appetizer or there was too much ramen. I couldn't finish it. Overall this place is great ! Everyone should come check them out!"], ["Danielle C.", "This was my first time at Futo Buta and I love this spot!  I still eat ramen from a package from time to time .  But this place is amazing.  I ordered the Fire and Ice that had salmon, which was so tasty!  The owners were nice along with the wait staff.  The establishment is kind of small and a bit hard to find if you're not from the area.  Didn't get to try the ice cream because the machine wasn't ready....But I will be definitely going back!"], ["Mike B.", "Plain and simple, the food at Futo Buta is fantastic.  It's a great mix of creative and authentic, and will absolutely fill you up.  The ramen is delicious and can be served spicy or not spicy, depending on your tastes.  The pork belly is fantastic.  Pork buns are really great, too.On top of that, they have their own soft-serve, which I believe was ginger flavored when I first popped in! I didn't try it, but it sounded amazing.The location is a bit tricky if you don't know where you're looking.  It's in the Post South End apartment building (the same one with Crepe Cellar and what used to be World of Beer), facing the light rail on the Bland Street Station, on the far corner of the building away from Bland Street.My single, solitary complaint seems to be a common one - the place is just too expensive for lunch.  I totally understand that I'm paying for high quality food, but I wouldn't at all mind a pared down, cheaper lunch menu.   That would get me coming back more often.(And if the chef wanted to start serving breakfast, I'd probably be there for that, too.  It's really good.)"], ["Patrick A.", "It is a Ramen and Saki restaurant with really fresh sushi. The small plates and steamed buns are good as well. The must try is a fried rice cake that is served with macerated tuna. The ramen is awesome. We have tried the pork, salmon, and miso and loved all of them. The saki menu well thought out and diverse. More seating outside than in and right on the Blue Line.  The two flavors of soft serve that rotate frequently."], ["L K.", "I really really wanted to love this place because I was so excited that a Ramen place was finally coming to Charlotte. Having been to countless ramen places around the US and in Japan, I have to say that this is no where near authentic Japanese ramen. We've been here twice now and both times we left very unsatisfied. The first time we went we thought it was bad because they had just opened but the second time we went ( last week) it was just as bad. We've tried all the ramen on their current menu and our least favorite was Tonkotu and miso. The tonkotu soup is so bland and it really lacks depth in the flavor. The miso one was so bland at first and 2/3 of the way done, I realized that all of the miso was at the bottom ( no wonder it was so bland! The staff should inform you to mix it before eating) I mixed it up and boy did it turn salty! It was so salty I couldn't finish it. Although it was salty after I mixed it, it still lacked in the depth of flavor. It was just plain salty broth. The cha-shu is too fatty in my opinion and for the appetizer, the tori karaage is way over priced for such a small portion. The fire and ice ramen was okay in flavor but I don't think you call that ramen. Its not really ramen. I know it hasn't been too long since they opened so I am willing to try this place out one more time in the future and hopefully it will become better. One more thing, their ice cream they make is really good! First time I went I had the peach ginger and it was so good. not too sweet and perfect! Second time we went, I had the strawberry basil and my friend had the chocolate sesame chili. The strawberry one was delicious but the chocolate one was pretty bad... I love how they don't make their ice cream too sweet!!I would definitely come back just for their Ice cream =)"], ["Clara R.", "This Japanese Ramen place is pretty decent. Coming from New York where there is numerous ramen places in the city, Futo Buta was pretty good. I would recommend getting their pork belly buns. It's a bit on the pricey side for what you pay for comparing the size of the buns, but it's still worth a try. You must get their soft serve! Their sweet corn flavor is a must!"], ["Shanti R.", "We had the miso ramen, Brussels sprouts, and rice cakes with tuna. Every thing came out quickly and was delicious ! I could eat this ramen every meal. I highly recommend going. My friends got the miso ramen which was also good. My only recommendation is to add sriracha to the bowl for some extra flavor."], ["Allie H.", "Exactly what Charlotte was missing. Fantastic ramen - for Charlotte.  More authentic than I was expecting but not exactly what you might get in NYC or a larger metro city.  4 stars as relative to what else you might find in the area this place is great.  The decor and atmosphere is great.  Seating is communal style reminding me of beloved Wagamamas.... I've tried most of the appetizers and they are great, standouts are the dumplings, peppers and fried chicken. Get the spicy pork added to your ramen... Yum!"], ["Jeff B.", "Very good! This place is very inviting and the staff is great! I highly recommend. We got both pork and eggplant bun. The fried rice and tuna app was excellent, and miso Rahman was too.The only reason I couldn't give it 5 stars is I thought it was slightly overpriced. 2 bun was $10. I thought 3 for $10 would have made more sense. The Rahman was $10-$14. We split a few item and it was $50 plus tip."], ["Bogey W.", "I think this place has so many stars, because so many reviewers in Charlotte have not had authentic Japanese ramen. This is NOT authentic ramen. The miso ramen had absolutely no flavor and the noodles were off. The steamed buns were plastic-like. Brussel Sprouts were good, but for the price, diner should be given more. Yama Izakaya or Earl's Grocery in Charlotte have FAR better, more flavorful ramen."], ["Brett S.", "This is the best Ramen I've ever eaten. It's not close."], ["Caroline K.", "Always add the spicy pork to any ramen. Even if you don't, still a delicious meal!! My favorite place in Charlotte, every time I go I find another reason why I love that place."], ["Jonathan L.", "The service was friendly, the food was okay, but the price was just too high for what you get. We had lunch on a Saturday at 2:00pm and they were out of tonkotsu and vegan ramen already. Maybe if we had a chance to taste those, we would have been blown away... Our group tried 2 appetizers, both types of buns, and 2 types of the available ramen left on the menu and we just weren't satisfied by the quality or quantity. The place definitely has a certain charm to it and I think they are going in the right direction, but I think the prices need to come down or the quantity go up to really feel satisfied by the experience. Would I discourage people from trying it? No.Will I go back? Probably not."]], "Umai Sushi & Asian Bistro": [["Lori H.", "One of best dining experiences ever!! Excellent service, excellent food...can't say enough good about this place. Patio seating and ambiance was great too. Benson was our server and was again...EXCELLENT!! Marylyn monroll delicious!!"], ["Alexis G.", "I went for the all-you-can-eat lunch sushi last week after much deliberation on which sushi lunch buffet I should try.  We were the first ones seated for lunch on a Friday and quickly chose our rolls.  Unfortunately, that was the last quickly that I can write.  We ended up ordering two times and we barely got out of there in an hour.  Not sure what happened with that..So the sushi, it started out decent.  Spicy Tuna, Tuna Avocado, California, Crunch California... but the second time around, it started to be more evident that this was AYCE sushi lunch & not quality sushi.I really liked the ambiance of Umai and maybe I'll come back and try something for dinner - or a lunch bento box, but I think that may be my last all you can eat sushi lunch."], ["Kelly C.", "Holy Sushi Lunch Special Batman!!!This lunch special was fantastic, it's a little pricier than I like for lunch - coming in at $16 per person. But the quality of the food makes up for all of it.I rocked lunch with Sammy J (duh). You're allowed to order 8 items per \"round\". So that the kitchen can keep up with you. I loved the salmon and avocado roll - it was cooked, and used a smokey salmon. And the spring rolls!  Fresh and tasty, although the cabbage fell out with every bite. I highly recommend this for lunch, it's $16, but totally worth it.Come hungry."], ["Elisabeth B.", "Really delicious lunch special made to order. No sketch buffet here. On a recent visit I sat outside and stuffed my face with nigiri. I never even made it inside on that visit, the team kept my water glass full and brought water out for my pup too.I visited again this week for a late omgeeee starving why didn't we eat until 9pm style dinner. The food came out Jimmy Johns style- freaky fast!The dumplings hit the spot right away, standard but a nice portion. Y'all weren't kidding about the spice level of the Marilyn Monroll- pow. Really creative and delicious though. I was also pleased with the $6-8 roll section the bagel roll never disappoints although I wish they noted on the menu it comes topped with a mayo-based sauce. If you are in this part of town and are craving sushi this may be your only/best option without going to Southpark."], ["Mike S.", "Hello friends,I'm glad a nice sushi spot has opened up near me. It looks really nice on the inside. I usually go in the daytime. They now have a pretty good lunch special. Including sushi!!  You are greeted at the door by a hostess, I usually prefer to sit at the bar (so i can see the sushi be prepared). I haven't had bad service any of the times that I've been here. I dont get the same thing when I go, so i always order sushi. All of the rolls that i've ordered have been spot on. With none really standing out as a MUST HAVE. However, the egg rolls are very good and crispy & crunchy.  (I think they are only 1 buck during lunch..i think) They have pretty good Sake as well. I've tried a few and really liked them.I have and will return, maybe....justttttt maybe i will order an entree and get something more than Just shushi. Until next time,TTFN"], ["Rachel R.", "2nd time eating at Umai and most likely the last.  It's not that it is terrible....  It's just not that good.  Reviewing their lunch \"special\", the amount of each component within the roll is just off, not to mention, the rolls are just sloppily thrown together.  Everybody likes cream cheese, but that shouldn't be the only thing you taste.  Or what's up with the huge chunk of cucumber?  Also, the ginger dressing for the house salads... Ugh!  It must come from a jar because if I weren't at a Sushi & Asian Bistro, I wouldn't necessarily know that it is ginger dressing.  Again, it's not terrible but just not that good.My 1st experience was for dinner a few weeks ago.  I was craving hibachi and gave Umai's a try.  I will say it was quite the generous portion, I got two meals out of it.  But it's not exactly steak.  I had ordered online and specified that I wanted my \"steak\" medium rare.  What I received was the same beef that you would find in a Chinese favorite like 'Beef and Broccoli' so to call it steak is definitely misleading.  For the $17 price tag, you would expect a better cut of meat."], ["Benjamin B.", "Great service and sushi. Surprisingly not that busy on a regular basis. Prices and variety are good as well. Try the lychee nut sake, it's awesome!"], ["Matthew Z.", "Good sushi in Charlotte! Girlfriend and I went here for a date lunch, and we both thought the fish was fresh and the prices were reasonable.  I got the sushi lunch with side ginger salad, and she got the all you can eat $14 sushi lunch special.  Service was reasonably fast, and bill came $25 for the two of us.  Not a bad place to go when craving some raw fish!"], ["Dawn F.", "We recently moved to this side of town, and were hopeful that Umai would be our new \"go to\" spot for sushi. Having been spoiled like crazy by the wonderful sushi and value at New Zealand on Monroe, and still saddened by the closing of Mai Sushi at Colony/Rea, we ventured down to Quail Corners in search of our new neighborhood spot. While the atmosphere is great, the food was not our cup of tea. We started with an order of edamame, which is difficult to mess up. But the beans were clearly not fresh - they tasted like they had been frozen too long because the texture was mealy and the pods were wimpy. Move on to the sushi order - a couple of sake (salmon nigiri) and a spicy tuna hand roll. Well, it was all.. okay. The fish was fine, but nothing special. It was all pretty much tasteless, in fact I think the sushi I've picked up from the fridge in Harris Teeter was tastier, and half the price. I mean, I would eat it if I were really desperate for sushi, but considering how close we are to SouthPark, Park Road Shopping Center, etc., and the fact that Umai's prices are pretty steep for what you get, I would definitely head in another direction the next time I crave sushi.Now let's talk noodles for a second - because my son is pretty much a ramen afficionado. He is only 12, but has been eating ramen noodles since he could eat solid foods (not the kind that come out of the wrapper). He has an amazing palate, and he certainly does know good ramen... and this was the worst he's ever tasted (according to him). The broth was just wrong (I tasted it, too), like maybe they added some miso then boiled it, which is a huge no no, or maybe the broth had been revived from the day before one too many times. I have no idea, but all I know is that we're not fans. The ramen noodles had pork as the protein, and the texture was tough and inedible. I've never seen my son leave a bowl of noodles uneaten, but despite our best efforts to salvage it with a touch of soy sauce and some sriaracha, we just had to let it go. Just for full disclosure - I did order a seafood stir fry dish carry out for my husband and he ate every last bite - but he's not really that picky and he was really hungry... The dish was $18, so it should have been way better than \"good\" in my opinion. It didn't look any better than the seafood dish we've ordered from Chi Thai (in Arboretum Harris Teeter) for years and years, and was much more expensive. Anyway - I've had better in Charlotte. If you like authentic tastes and textures of Japanese food, you are probably better to steer clear of Umai."], ["Chris Y.", "I travel down to Charlotte pretty often for work and this place is my go to for sushi! I order from this place once or twice a week and it's always delicious. I usually get a nirigi or sashimi combo and a few items from their specialty nigiri - usually toro, uni, or soft shell crab. They do their portions right and give nice thick cuts of fish. Occasionally I'll get some of their rolls . All very good! Food Rating: 4.5/5Service Rating: 4.5/5Ambiance Rating: 4/5"], ["Rose S.", "All you can eat sushi rolls at $12 a person incl a drink.  Not bad at all.  The wait & host staff seems to be on the youngish side & seemed to be there more to gossip or point at customers & laugh vs. serving customers.  Wait & host staff aside.  The sushi rolls were tasty & came out pretty quickly considering the amount of customers at the time.  The owner picked up the slack from the employees & made sure we were taken care of.  The ginger dressing on the salad had a more tangy flavor & wish I knew what brand they use."], ["Jane T.", "Best Asian food in south charlotte ... Love this place! Never disappoints in serving delicious sushi and fantastic desserts ! Two thumbs way up !"], ["Nikki W.", "We eat here quite frequently. It's a good and quick sushi spot, usually not busy. They also have a sushi buffet everyday for a decent price but the selection is limited compared to their full menu."], ["Chris S.", "The lunch special: $14, spring rolls, fried rice or white rice, and a crazy good selection of sushi rolls and nigiri...So i asked the very nice server, Christian, how it worked and she said to order whatever quantity you wanted, up to 10 pieces...and i misunderstood this to mean 10 pieces at a time...but in reality, it was 10 rolls of 4 pieces each (as stated on the menu), so i ended up with 40 pieces....and it was outstanding!!!  and they asked if i wanted more..i could barely move.  We were going to Rusans but they were INSANELY packed when i remembered Umai had opened...so glad Rusans was packed or i would not have had the chance to try this place.  I'll be returning as soon as my waistline lets me.  Just remember: 1 roll= 4 pieces, 1 piece nigiri=1 piece...I am just amazed at how much better of an experience it is than the standard all you can eat buffet type thing...they encourage not wasting food, and they make it worthwhile to order what you want...so good.  i can't ramble enough about it.  Just so good."], ["Kate T.", "After passing Umai and seeing some recent reviews I wanted to check it out. I decided to order a variety of items to get a good idea of the overall food at Umai.I started with the edamame and spring roll. Both really good. The edamame was topped with sea salt and warm to the bite, yum! The spring roll was also great, lightly fried and not greasy, with a variety of veggies inside. So, my starters were the best part of the meal. Onto the sushi. I ordered salmon nigiri, a spicy tun hand roll and the Japanese Mafia roll. The salmon was good. Spicy Tuna, ugh! Unfortunately there were a lot of tuna veins throughout the roll and it was hot, and not hot in a good way. Oh, and to top it off I received a roll of entire rice, and not a hand roll. And, as for the Japanese Mafia, it is a cooked roll, but the fish was cook too long that it smelled and ruined the flavor of what was meant to be. I did enjoy the crab salad in the roll though, since you usually see crab sticks.Overall, everything was okay, but not a sushi spot I would run back to anytime soon."], ["Linda H.", "I've had lunch at Umai four times and each time it has been outstanding!  Not a sushi lover so thoroughly enjoy the chinese menu. My favorite dish is Basil Shrimp with extra basil! We received excellent and personable service. Bobby was our waiter and made sure we were well taken care of. I live nearby so thrilled to find this excellent restaurant! HIGHLY recommend!"], ["Annie M.", "What a great find to stumble upon. In the unassuming Quail Hallow shopping center, we decided to try Umai. On a quiet Monday night, this place was pretty empty. We were seated right away. Our waiter was wonderful, helpful, speedy and seemed like he genuinely enjoyed his job. The sushi was fresh with one spider roll and one tuna royale it was a great end to a Long MONDAY. We also snacked on some miso soup, shrimp tempura appetizer, dumplings and this delish fried mashed potatoes. I think our servers name was Justin! He deserves some serious props. Also I think we received our entire meal in less than 20 minutes."], ["Bruce L.", "My review is only based on my experience with the all you can eat lunch.Stopped in for the \"all you can eat\" lunch buffet, at the suggestion of a friend whom said it was good. The food quality was not too bad, service was pretty good, and it seemed like a nice clean place. The lunch deal is $14/person, and not really a buffet, but you can order unlimited off a small menu. It was a pretty slim sushi roll selection, and about 8 different nigiri choices. Only about 4 fish options for nigiri. They also offer rice or spring rolls which was cool, and the spring rolls were good and came out fast.Not amazing, but the fish tasted fresh, and the service was good. Will I be back someday? Sure. I would like to try them for dinner sometime, with a more expanded menu option."], ["J T.", "Love this new place, located in a new shopping area. Clean, modern, and sleek is what I like in a restraurant...and I do love me some sashimi! They have all you can eat $12 sushi buffet during lunch time, which is perfect when you're looking for a quick fix during your busy weekdays lunch! So this is a win win situation.  Everything was fresh and brought out quickly. We had a chance to enjoyed it last Saturday and the owner even came out to ask how was everything. That makes us feel very welcomed. More restaurants should do this!  My favorite was the tempura roll, warm, crunchy outside but moist inside and just a punch in flavor in one! Yum! I'll be coming back to try out more dishes from this place again! They also try new sushi rolls every few mons so I can't wait to see what's in store!"], ["T. Nelson W.", "All You Can Eat RiceBy offering nigiri only with the all you can eat buffet (with a big chunk of rice under a tiny piece of fish) and insisting (rudely) that you will not be served more until you eat all of the stomach filling rice, they are not doing much to ensure a return visit."]], "Baku": [["Linda T.", "Ate here on a Saturday night and the ambience inside the restaurant was exciting with the cooks grilling the meats on the right side when you first enter. We sat on the second floor which was quieter than downstairs. We ordered 3 sushi tapas and 3 meat tapas with prices ranging from $7-$30. We got the Rainbow bowl, salmon belly nigiri, spicy hamachi crispy rice roll, wagyu tartar, robata chicken livers and robata pork belly. The sushi dishes were delicious! Fresh fish and beautiful presentation. The wagyu tartar was over seasoned and was way too salty for our taste. If you have a great piece of wagyu why kill it with all that seasonings?? The robata chicken liver was undercooked and pork belly over cooked. I would come back for the sushi but not robata."], ["Ashley K.", "Living in the Southpark area, I had heard from many that Baku was a 'must-go' restaurant. We finally decided to try it out this week for Queen's Feast. I ordered the Hidden Hibiscus cocktail and it was bubbly & refreshing. The music was audible but wasn't too loud that we could not hear ourselves speak. We were unaware that the menu was Japanese 'tapas' style, but our server gave us a long rehearsed speech about the menu and restaurant style. The Queen's Feast selections were described well on the menu but the portions were rather small. The spicy chili edamame was great, but edamame isn't hard to mess up. I ordered a type of maki roll with yellowtail; it came out in 4 tiny pieces. The tiger prawn & vegetable tempura consisted of 2 skinny tiger prawns, a 1/4 of a mushroom, 2 asparagus stalks and a piece of eggplant. Quite disappointing. I am glad we went here for the reduced price during Queen's Feast as opposed to paying triple the price on a regular night. I wouldn't rush back here again."], ["Dan C.", "Melange of colors,Thing of beauty and tastes good,Just get the sorbet.Place is overhyped,Pay too much for what you get,Baku, not Haiku?"], ["Clayton W.", "Japanese Fusion... Went there for my Wife's Birthday with her Brother and my Sister-in-Law... Excellent! A bit pricey, but Excellent... The food was amazing, the service was amazing and the desserts were also - Amazing! The Best Sazerac I have ever had! Highly recommend, we will go back."], ["M. C.", "Tried this place for restaurant week....not impressed. Had a larger party of about 12. Waiter tried to upsell to chefs choice menu and told us the rest. week option wasn't going to be that good. Honestly he was right.....the Brussels sprouts were horrific. Burnt, bitter and not edible. Changed to the salad which was good with ginger dressing. About an hour after our apps we were served our dinners....all but one of my gfs. We all were about finished with our dinners when she finally got hers. To say the least, service was ok. Food was a huge let down. Too expensive and so many places to eat in Charlotte to have such mediocre food."], ["Janet L.", "Quality was good. Presentation was beautiful. Service was ok. They should've changed out our plates at least once during dinner as our plates were drenched in oils and flavors from the other dishes. The Uni Spoon ($10/each) was my favorite... had the perfect amount of caviar, truffle and uni, and the blend with the ponzu and quail egg was great! The A5-12 Japanese Wagyu Beef Nigiri ($8/pierce) with Burgundy Truffle and Hon Shiso was another one of my favorites. I was very disappointed in the Salmon Belly Nigiris as that was what drew me into wanting to go to this restaurant. The salmon belly was fresh but the flavor was off because the chef had a big dab of mayonnaise on each piece.  The flavors did not go together and the mayonnaise took away the flavor of the fish. I feel that this was my main problem with this restaurant... the combination of flavors just did not go together. They would have fresh ingredients that are amazing even all on its own but then they would add something that overpowers the main ingredient. Another example was the yellowtail sashimi ($12 for 3 pieces)... the yellowtail was great, the truffle ponzu sauce was great but then they added this overpowering pickled smoky onion in it which in my opinion, totally ruined the dish and seems like such a waste of good quality fish. They could've added some onions but not so much where it was more than the fish itself. Another example was the Foiegras and Scallop dish ($28 for 2)... foiegras.. perfectly cooked, flavor was great... scallop... perfectly cooked, flavor was on point... and then they add this mint leaf that tasted like licorice in the middle which totally caught me by surprise and added this overpowering, pungent flavor that had a bitter aftertaste. Overall, good experience but disappointed in the dishes I was most excited to try."], ["Melanie E.", "the decor is nice, kind of upscale rustic.  I love the sound panels on the ceiling.  what a great idea.The food... Grouper Bites... a bit oily, not crisped up, but still tasty.  I also loved the green tea-infused salt.  That was new and interesting.  Pork Dumplings, again, oily, and a little thick in the skin, chewy.  Tenderloin Skewer...sort of bland.  The pricing is what I'd expect for Charlotte, but I don't think the food rates those prices.We sat at the bar downstairs, which is a nice bar, but smaller.  Our bartenders were very nice but one bartender was really loud and he would make loud comments about what he was watching on sports center and when he was chatting with other staff it was obtrusive.Also in the bar area... everyone from the kitchen staff, managers, hostesses... would come behind the bar to fill up their drinks, get ice, check out what was going on on sports center, chat....  It was really a bit irritating.  The bar isn't that big and although I would choose to sit further away from the tv side if I'm eating at the bar next time - it was just odd that it is set up that way.I recommend people try it and I definitely want to sit upstairs next time."], ["Christine W.", "Someone led us to this awesome place. They got really wonderful sushi and sashimi. Roast beef and chicken are also yummy. The only drawback is that it's a little expensive hh."], ["Jennifer C.", "Lovely new little spot! Went here for restaurant week and it was refreshing to know they didn't over book.  Downstairs and upstairs seating, bar on both levels. Our party was upstairs and I was able to get a small drink prior,  House sangria. It was average. They said they added Sprite normally to the drink,  which to wasn't the best idea. Food overall was really good. Small plates, but all 3 courses were delicious.  For apps,  I had Pork Belly, main course, steak with Wasabi sauce, and dessert, Creme Brule.  Each course was better than the last and surprisingly filling. A bonus to me is that it's smack dab in the center of 2 bank locations in Southpark. So weekend dining, you always have a parking spot. Not really much congestion. Only con, I could give is that I wish there were bigger plates with more food!"], ["Andrea B.", "I hosted a dinner program here in the private dining room.  I heard ahead of time that the food was great, so we decided to try it.  Although the food was good, the service was terrible and we were extremely disappointed.  The dinner was on a Thursday night, the servers were not attentive and I had to refill drinks and serve food.  When they brought our food, they did not bring serving utensils.  When we went to finalize the bill, we were overcharged for the gratuity--they gave themselves 29% gratuity and didn't even deserve 10%.  It was awful!  They also charged us for several dishes that we didn't even get.  I do not recommend this venue for private dining functions."], ["Allison Z.", "I decided to write a review since they seem to be so mixed on here- and I almost didn't want to come thinking I would be disappointed. We started out at the upstairs bar with a couple Nigori Blue Martinis- Belvedere unfiltered vodka dirty martinis, so good we never even switched to wine during the meal, we just kept these comin'. Only $11- good deal. We sat downstairs at a booth, our server was awesome, all the staff seemed very polite. Now- the food. We ordered a variety and shared everything. Favorite thing hands down was the tuna tartare with what I think were taro root chips- this stuff was heaven in your mouth. Other plates that really stood out were the salmon belly nigiri, rock shrimp tempura, and the yellowtail roll with serrano peppers, cucumber and avocado. Crispy calmari with serrano peppers was good too. We also tried the wagyu beef tataki, gokujo tuna roll, lobster & avocado roll, and of course we had to get the giant Madagascar prawn. Everything was delicious!! All of the presentation was beautiful and the plates rolled out a few at a time so we had a chance to really enjoy them. Decor is really cool, great vibe and relaxing & inviting atmosphere. Extensive sake list, will have to explore more next time. It was a great dining experience- I can't wait to try their brunch. Will definitely be back again!"], ["Pan P.", "Best sushi in Charlotte:Tiger shrimpBlue fin toro tartareSpicy hamachi rice crispy treatBig hourany rollSalmon belly nigiri"], ["Andy B.", "Simply amazing - great option if you are looking for inventive, interesting Japanese options.We went there on a random weeknight after doing some shopping. Located in an older building across from the South Park mall, the overall impression inside is intimate and sophisticated. Great for a date night or going out with friends after work.We order a cross section of small plates, including sushi as well as their specialty, grilled meats. Everything was spectacular, from the delicately assembled sushi (including an incredible butterfish with a citrus glaze) to the high-heat grilled items, in particular the scallops and the beef tenderloin. On a related note, if you are a chicken liver fan, you must get their skewered livers, probably the best I've ever had! The ingredients are all top-notch and the subtle flavor combinations are genuinely unique. Service was very good - intelligent, well-timed and not pushy.This place belongs on your top-5 Charlotte list!"], ["d w.", "I was in Charlotte on business last week and my associate and I were craving sushi. Based on yelp reviews and our proximity to the restaurant, we headed to Baku expecting a good meal.  I have to say, I wasn't expecting a meal this great.  It was fantastic. From the moment we sat down, the experience was wonderful. Our waiter was that perfect blend of knowledgable, funny, and wry. We knew we were in good hands. The plates are small and meant to be shared, so we ordered three plates (two rolls and dumplings - all amazing), then asked him to bring us two of his favorites - even better!It really was a perfect evening of food and wine, each course better than the last. I cannot recommend Baku strongly enough. If I lived in Charlotte, it would be tops on my list. I hope you go. I know you'll enjoy."], ["Luke T.", "A new Izakaya restaurant, very posh and upscale.  I expected an izakaya to be less formal and less stiff. More of a watering hole for the tired salaryman but this place has turned the local watering hole into a semi-formal dining establishment. Lots of uniformed waiters, a sake sommelier, a valet.. its just a wierd vibe for an izakaya.  The clientele is all dressed up for dinner, in heels and all. Kinda snobby.Service is impeccable. They will take very good care of you. Our server was cordial and attentive.  We just about ate everything on the menu. Even had their Nanbu Bijin Dai Ginjo. Kitchen is fast. Our skewers came very quickly.  The best is the scallops and prok belly. So good, we asked for 2 more plate. The Omakase, at $60 for 3 was expensive.  There simply wasn't enough to justify $60 for 3.  I would say the portion was enough for 1 person.  All the other plates were OK.  Nothing too spectacular.Sake list is good. They had a few bottles from JunMai to DaiGinjo. We had the KiKuSui , which came is such a small 300ml bottle is was pathetic. We stepped up and got the $150 Nanbu Bijin that was much better. The next time , I would ask them to sit the bottle in a bed of ice. I kinda like my sake colder.Anyway, its not your typical relaxed, let your hair down, end of the day, drop your butt down and drink your tired day away of an Izakaya.  People actually dress up and come here to be seen. Sorta different vibe, sorta pretentious..but damn good service.  It is on the pricey side."], ["L K.", "Came here for my father in law's birthday dinner. The ambiance was nice and the server was nice. However, the food was very normal and over priced. We ordered a lot of small dishes and the sashimi platter for 4 and the big bone in steak. The sashimi platter was pretty good and the steak with the different kinds of salt was unique. But all in all, the foods were just way over priced for the taste. Definitely worth giving it a try but was just not enough for us to be returning."], ["Lisa B.", "We came here for Charlotte restaurant week last night. We ordered the edamame and Brussels sprouts, both were very good. Next course we got the maki and the calamari. The sushi was awesome but they only give you 4 tiny pieces!  And finally our main courses were served, salmon and steak for my husband. We just hope that's their restaurant week size portion because we would NEVER pay their full price menu price for those cuts of meat!! Would like to go back and try sushi next time!"], ["Kimberly H.", "Great atmosphere and music. I chose the scallops and the sweet corn. Very delicious! I will definitely come again to unwind after a busy day."], ["Meredith C.", "So delicious!  Very unique food!  The meats are super tender, the sushi is on point and the cocktails are amazing!  Definitely one of the best meals we've had in Charlotte!  We got the pork belly skewers (super rich and great flavor), roasted oysters, Hamachi sushi roll, black cod, and lamb chops.  Everything was perfect!!  Ambiance was good too, not pretentious.  Don't be afraid to ask for a different table if you get seated in a really dark spot!"], ["Heather B.", "From my research only place to get butterfish/black cod in Charlotte and it did not let me down. Make a reservation or plan to wait. Small portions meant to share. Slightly over priced for what you get but despite this will be back for that black cod."], ["Kellie K.", "I'm so glad I'm not the only one who isn't completely wowed by Baku! Phew.  The fella and I visited on a Wednesday night after making Open Table reservations, and we parked in the back to avoid the valet.Upon entering, literally seven Baku staff members were lined up to the right of the door to... welcome us?  Bizarre.  We headed upstairs to have a drink since the downstairs bar was already a little crowded.  Our bartender was nice, but fully admitted she was having an off night after making the wrong drink then spilling the right drink.  Oy.The decor is really cool - dark walls, orange fans on the ceiling, painted eyes on the wall staring at you - the staff are all very chic and sleek.  It definitely has a clubby vibe.Onto the food!  After our drink, we were seated upstairs. Our waiter was awesome - he was so gracious and helpful and didn't even make fun of me when I had to ask for a fork (chopsticks aren't my forte).  The fella and I got a bottle of wine and ordered three of the small plates/appetizers so that we could try a little bit of everything.  * The pork belly skewers were good, but there wasn't a ton of flavor, and they were TINY.  We got two skewers with two tiny pieces on each.* The rock shrimp tempura tasted very fresh and light, and since there were six pieces, I got to take a few more bites than of the pork belly.* Lastly, we ordered the beef and asparagus skewers, which were good, but nothing to write home about.  There were three tiny pieces of beef and one piece of asparagus.Two drinks at the bar cost $11 and $12 + tip.  Dinner was a $50 bottle of wine and those three small plates cost more than $60... then we added tip.  The moral of the story is that Baku thinks A LOT of their tiny portions, and I had to eat a real dinner when I got home.  Cool, hip ambiance and excellent service, but I just can't justify the price for what you get."], ["Stefannie B.", "Joined Baku for dinner last night and was super impressed with the food, ambiance and service. The setting was elegant and intimate, perfect for the aura we were trying to achieve. We started off with the J. Lohr sauvignon blanc and a good bit of small plates - oysters, blue fin toro nigiri, tiger prawns and shishito peppers. They were all amazing! BUT the shishito peppers stole my heart, urging me to order another plate along with the butterfish, salmon belly, wagyu tataki and chicken liver with shishito peppers. It was all amazing, except for the chicken liver, which after venturing out to try for the first time, I decided just aren't for me! I couldn't get over how elegant and fresh everything tasted. It literally all melted in my mouth! We ordered the molten lava and mango salted caramel cakes for dessert. My molten lava cake could have been more \"molten-y\" but it was still a nice end to  dinner with my prosecco.Our server was remarkable and had I not been drooling over my food, I would remember to have snagged his name for the review! His assistants and everyone else who encountered us, minus just a tiny 'tude from the hostess (it was late, I get it) were friendly and compensating. I give Baku 5 stars - definitely am excited to go back!"], ["Lynn A.", "Great sushi- service struggles a bit. But good sushi is hard to find and the food has never disappointed"], ["Melissa B.", "A very rare 5 STAR review from myself goes to Baku.  Located right on Sharon road near Diamonds Direct - Baku is very easy to find.We were here last Thursday night at the suggestion of other yelpers - Thanks guys!!!  They had valet parking right out front in case you didn't want to try to hunt down a spot.There is an upstairs and a downstairs where you can be seated.  Downstairs has the excitement of the open kitchen and very nice decor.  Upstairs is a little sexier with a bar, lounge areas, high tops and low tables.We were told to get a few small plates so we ended up with the pork dumplings (seared slightly on the bottom - comes with the house sauce - DIVINE), the peppers (I can't remember the name?!?!), tenderloin and asparagus skewers, pork belly skewers, and shrimp tempura.  Each dish was delectable, not too smoky.  Just the right amount of food for two people.The wait staff was super attentive (although struggling with the restaurant's newness still....)The decor and music - so sexy chic.  The hot towel service was a great touch.  I can't wait to go back and try new items.  Superb experience and truly a unique Charlotte dining experience."], ["Crista P.", "BF & I dined here this past Saturday. We got here a little before 630 & apparently the entire restaurant was booked with reservations, with the exception of the bar & the patio. It was pretty nice outside, so we decided to sit out on the patio. Our server was extremely knowledgeable. They have an extensive list of sake, & I'm not a sake expert but I decided you can't go wrong with the flavored ones. I got the fuji apple sake & my BF opted for the lychee sake.. both were great but the fuji apple was my favorite!They have a few vegetarian items on the menu. The ones I remember are coal roasted shishito peppers, a couple of mushroom maki rolls, some type of sweet & sour tofu skewer, & wild mushroom kamameshi pot. I decided to get the peppers & was almost going to choose one of the sushi rolls, but I decided to try the kamameshi pot instead. The peppers do come with bonito flakes sprinkled on top, so we got them in a separate little bowl. My BF got the tempura tiger prawns, beef & asparagus skewers, & soft shell crab maki roll.The shishito peppers came out first. They were tasty & not really spicy. They came with a little dipping sauce made of soy sauce & chili flakes. $7 was a little steep for a plate of peppers but I enjoyed them & would get them again.The tempura tiger prawns came out next.. $12 for 5 pieces of fried shrimp.. what?? I kind of laughed when the prawns came out because at that price we were expecting at least ONE more to make it an even $2 per prawn. I did not eat them & while my BF seemed to like the prawns, he said they weren't really anything special.Next up was the wild mushroom kamameshi pot. It came to the table unstirred, but I was unable to get a picture of it at the time because our server stirred it while explaining the dish. I enjoyed the flavors but again felt it was overpriced at $17 for some rice, mushrooms, & a few vegetables. The nice touch was that the rice on the bottom was a little crispy from the hot pot.. love it!My BF got his beef & asparagus skewers (I think it came with 2) & soft shell crab roll. The skewers looked much better in person than that shitty picture I posted (blame the BF for that!) I think he liked the skewers & the roll was comparable to Cowfish prices but definitely not in size.. Cowfish wins that hands down! I don't remember the exact prices of these 2 dishes individually, but together they must have been around $25 based on our bill.Overall, the service was great, sake was awesome, & the food, while good, was definitely overpriced. We weren't particularly blown away by any of the dishes which is kinda disappointing for a meal close to $100 (including the tip). We will probably be back because my BF wants to try the duck & a couple of other grilled meat dishes, but Baku will likely not be in our regular rotation."], ["Travis W.", "Wow, thought I had already reviewed this place but apparently not.  Well for starters you have to love the interiors.  As stated in some of the other reviews, the upstairs area is preferred if you are looking to lounge.  I loved the ambiance of the place.  We came on their first official night open so there were some kinks in the armor, mostly relative to bar menu and drink selection but the service was friendly and prompt none the less.The food was fantastic, the pork belly melts in your mouth and the shrimp tempura was divine.  The peppers we had were incredible and although considered a small plate, I found the portions to be fairly large enough for two."], ["Michael W.", "As good as it gets for Japanese in Charlotte! Went here on a whim with a friend and it didn't disappoint. The rolls were very well made and the presentation was excellent. The Alaskan crab roll was one of my favorites. The food is mostly tapas style meant to share... and most of the small plate portions are a little small. Everything grilled is cooked on a Japanese grill with coals imported from Japan which gives it a very unique flavor. Their black cod was excellent... I'm gonna say it reminded me of Nobu's... though the execution was a little off. All their beef is prime, we also had the Waygu NY strip and it was delicious. Cocktails were ok, nothing out of this world and the service was decent. Overall I think they did a good job, albeit the NY city prices... this is a place good for an expense account."], ["Matthew J.", "Me and my wife really enjoy this restaurant! They are always on top of everything when it comes to service. The sushi is very fresh and tasty. I love the variety of sushi too the menu is to the point but not limited I am glad it s not like those other sushi places that have million different rolls to choose  from! This place is modern but relaxed. 5 stars for me!"], ["Michelle B.", "My two friends joined me for Restaurant Week here on a Tuesday night. We sat upstairs across the room from a table of 8 men and it was very loud! We ordered the lobster/avocado roll and a dirty martini which were both excellent. As for the three course meal, I chose the spicy blue fin tuna rolls, the tempura prawns and veggies and the mango pineapple cake for dessert. I would get something other than the tempura if I had to do it again only because the veggies were a little greasy. The salmon course looked really good as an alternative. Overall, the experience was a good one. Not sure if I'd want to go back on a weekend night just knowing how loud it gets in there, but I will be back."], ["T S.", "This is a review specifically for the Queen's Feast (Charlotte restaurant week).Some restaurants really give the vibe that they do not enjoy the 10 days of the Queen's Feast.  This is most readily apparent in their menu, where they are outright stingy in their selections of what is available or plaster the menu with upcharges.  Very offputting.Delightfully, Baku is NOT one of those.   It has a reputation for being a bit spendy, but they really don't hold back on the restaurant week selections.We thoroughly enjoyed the salad course, the small plate course and the entree course.  Someone looking for volume of food might cast a critical eye -- Baku is a small plate concept.   But we appreciate quality over that and Baku delivered in spades.  The NY Strip was the big winner, though my m-i-l very much enjoyed her salmon.  Excellent preparation and presentation.  Sometimes a wait staff can make the Queen's Feast unpleasant as well, perhaps allowing the smaller check size to sour their attitude.  Again Baku came through with top marks.  Our staff was prompt, accurate and engaging.Thoroughly enjoyed our first trip to Baku.  We will be back.  This is what restaurant week is supposed to be about."], ["sarah e.", "Yum!  Date night heaven.  My husband and I came here a couple weeks back and it was delicious!  We ordered several dishes, mostly from the special menu but everything was tasty.  The sushi was super fresh but in my opinion over priced. The dumpling were tasty!  The sake was really good but overpriced.  The mark up was too much for what I know wasn't an expensive bottle.  The butterfish was very tasty as well and I would order it again.  Everything was pretty good but overpriced to me... Coming from New York I think that says something.  I don't want to take away from the food because it was good but not super special to explain the prices.  Perhaps we were paying for the atmosphere which was very nice.  Our server was nice but didn't offer any suggestions which wasn't super helpful but that was okay because everything was tasty.  We will come again when we want to spend a lot on some decent sushi"], ["Monica V.", "Amazing food, excellent service and a very cool atmosphere.  I will say that it is VERY pricey.  For a full meal with wine/drinks, starters, etc I would say this is just as expensive as The Palm, Capital Grill, etc...  It's definitely with trying and if on a budget just  look for more reasonably priced small pates and rolls."], ["Mark O.", "Excellent!  Every dish is like a work of Art. Wonderful atmosphere, excellent food and service!"], ["Aaron W.", "I went to Baku with a local Charlotte friend who knew I was a foodie and thought I would appreciate this Japanese inspired restaurant.  Upon reaching the front door it was opened for us by a waitress who welcomed us with a smile.  We were seated in the main dining area (there is a lounge-y space upstairs).  It was a Tuesday night around 8:30 pm and the space was surprisingly full.  Subdued in its decorations, perfectly lighted so that you could clearly see what you ordered, the restaurant could easily exist in New York City or any other major metropolitan area.Service was impeccable - our main waitress was attentive and genuinely enthusiastic.  A bevy of support folks attended our table as well.  It was evident that the owners were rigorous in their expectations for the front of the house and that staff were willing to execute in order to make those expectations happen.My friend and I decided on a small plates for our meal.  I must say that I was somewhat put off by the voluminous menu; it had to have been 10 pages (including 3 pages of sake and other drinks) as well as 2 additional separate menus of \"specials.\"  So there were 3 menus in all!  I  felt like I needed to have studied and prepared prior to arrival.  It was a little overwhelming.  In the end, I questioned our waitress for recommendations which she was more than happy to do.Along with cold sake (1/2 price bottles that evening YAY!), we had 8 small plates; each presented with a rigorous attention to detail.  You could tell these were chef conceived items and that he ran a tight ship.  From the sake bottle resting in an ice filled wooden box onward, every element of the food and its presentation is the vision of the chef.We had first a plate of homemade kimchi, the cabbage tart and vinegary.  It was followed by a Hamachi dish - two thinly sliced pieces of delectably fresh fish atop a pickled mound of crunchy veg.  I would have liked a larger piece of fish as it was dwarfed by the pickled mound and kind of lost.  Charred baby octopus followed, plated in a long white ceramic runway.  Tasty and delicious, it offered a wonderful bite.  A tuna tartare was next, to be scooped up with homemade taro chips.  The chips were an unexpected item, a nice touch - the tartare; weak of seasoning fell flat as merely mushy.  We then had tempura shrimp.  When it came out, I was at first disappointed by the size of the shrimp - smallish and popcorn - like.  But after popping one in my mouth, I was amazed at how they remained so succulent and juicy after being deep-fried.  But they were.  And the tempura batter, thin and crisp, did not overpower.  A really delicious dish.  Next came pork belly with sous vide egg.  The pork belly was prepared nicely, fatty and flavorful.  I was very disappointed in the egg though as it was cold.  I told my waitress to let the chef know as I was sure he did not intend the warmth of the fatty delicious pork belly to be paired and eaten with a refrigerator-cold egg yolk.  I looked at my friend and said just you wait - a chef this meticulous would send us another so that we could enjoy as he intended.  He didn't - oh well.  Last we had scallops with foie gras.   It contained two big meaty succulent sea scallops adorned with slivers of foie gras, some sea salt and pickled plum on the side.  This was a winner; a choreographed ending to the savory portion of the meal.Lastly, but not least - I had to have a dessert.  I ordered the chocolate ganache  cake with homemade coconut ice cream.  Need I say more?  A brilliant pairing - the cake's center was warm and gooey and the ice cream cold and coconutty - combined the two were unified into a wonderful yummy finale to the meal."], ["Kristen C.", "My fiancé and I came to Baku for the first time on my birthday. The service was wonderful and food presentation was excellent. We ordered the pork dumplings, chicken wings, spicy tuna roll, and the butter fish. Everything was just ok. Asian food is my favorite cuisine. I have eaten at Asian restaurants all over the country and this is one of the lowest on my list. Maybe the chef was off tonight, I don't know, but he or she must not have been tasting the food. During dinner we even starting discussing what we were going to eat when we got home. Unfortunately this visit was a fail for us, and we may not be coming back."], ["Daniel S.", "Amazing restaurant. Always great service and awesome food. The Blue fin toro tartare is quite delicious. Huge selection of sake. One of the best restaurants in Charlotte."], ["Megan F.", "Excellent sushi--we had the yellowtail tuna. Also enjoyed the pot sticker dumplings, which has the best savory sauce. The cocktail menu is unique so I ordered a manadarin orange vodka with yuzu juice, from a Japanese fruit. The drink was sweet like a Midori sour but comes in a small glass. Great service even though we had to wait for food. I would suggest reservations because the kitchen was backed up that night."], ["Fly B.", "I have to agree with David d. The taste, quality and price are completely misguided. 24 dollar rolls should make me dance around in delight, not think i should have gone to Cowfish.  And having loud drunk grown women at the bar screaming in a lounge atmosphere is in poor taste.....and so is having grown women so drunk that one vomitted on the top of the stairs last night. Gross!!!!!!!"], ["Kerri W.", "We finally ate here. We had a reservation and it was a beautiful night, so walking in as I realized they have a patio, I hoped to sit there. We were told there was a wait and my husband was hungry so we got seated inside immediately. I was told wine pours were small, so we both opted for a cocktail. My husband got a gin & cucumber concoction which he thought was kind of like lemonade. I got a wild tea vodka & cucumber drink. It was a little sweeter than I prefer but glad I tried it!Now to the menu . . . our waitress, Morgan, was very thorough in explaining the style of the restaurant. She suggested an item from each page, but that seemed like a lot. But I guess in the end we probably ordered that much! We started with the calamari which was delicious! Lightly crispy and delicate! We decided on two sushi rolls. Spicy tuna - yum! - and Forbidden Rice roll which had white asparagus. It was unique and tasty! For our next round, I asked about the baby artichoke skewers which Morgan highly recommended, as well as the rice bowls. My husband wasn't up for either, so we focused on entrees. We ordered Grilled Branzini b/c we'd never had it. It was 2 small slices of grilled fish (not much flavor!!) and a tomato salad. Very small portion and disappointing flavor for $24!! Since our waitress asked about it, my husband told her it was just ok and didn't have a lot of flavor. When she brought the bill, she informed us she took the Branzini off the tab! We greatly appreciated that!All in all, it was good but not a great experience and not worth the $65 (total without the entree). I'd go back but not anytime soon."], ["Jarrad L.", "This place is off the hook good. Probably the best asian place in town. The food is more meat based opposed to sushi based and everything I have ordered from here (normally 6-9 small plates each time) is really good.It isnt cheap, but it is worth it. We go maybe once a month, but would go more if we could."]], "Yama Asian Fusion": [["Satish C.", "I expected to see more variety when I thought I was going to an Asian Fusion restaurant. Expect to see a heavy Japanese focus in the menu. We ordered 3 sushi rolls and couple of entrees. Sushi was excellent and we all enjoyed the entrees.. The shrimp tempura starter has exactly 2 pieces of shrimp and the rest were vegetables. It was not what I expected ."], ["Paul C.", "First time here. Surprised at how nice it was given the typical strip mall exterior. In keeping this one short.we got the Tuna wrapped in Cucumber, the \"Paul's Roll\" (NO not named after me - I wish) and the Crispy Bagel Roll. The Paul's roll was very creamy with fresh tuna, cream cheese and avocado. There was NO crunch at all in it, which is OK. But the Bagel Roll was unusual in that there was NO bread or \"bagel\" component to it at all. I believe the roll was oh so lightly breaded then flash fried to give it the TEXTURE of a crispy bagel. Well it worked! Loved this roll!Our service was fantastic and overall this was an excellent experience. However, as you've all heard me say, NOTHING beats Sushi Guru for Sushi ROLLS!"], ["Wei L.", "Best sushi restaurant in Charlotte. I found it on Yelp and read the amazing reviews. Flew to Charlotte from Detroit for business. Amazing sushi and fresh fish. Very impressed with the restaurant.  Friendly staff with genuine smiles."], ["Chase M.", "This was my second visit to Yama, and this time it was for a Valentine's Day dinner. We had reservations for 6pm, but the restaurant was not crowded when we arrived. As we were leaving, the restaurant was starting to get busier for dinner service.The waiter we had was enthusiastic and friendly. I ordered the chicken and shrimp hibachi and my date ordered sushi. We were going to get the Tempura Roll & H&M Roll, but the waiter suggested the Magic Roll (not listed on the menu) instead of the Tempura Roll. It was a great suggestion and had a good taste to it! For dessert, we had the tempura ice cream with whipped cream and chocolate. The dessert tasted like a funnel cake with ice cream - it was perfect!The restaurant is dim and in a tucked away area of SouthPark. For a date night, this restaurant was great and not overly expensive. Great service, food, and ambience - overall great experience!"], ["Nanci C.", "This place looks nice. The sushi is tasty but not the best that I had. It's good. My waiter was very friendly and this place gets crowded really fast on a Friday night. I'm 90% full from a $90 bill."], ["Gabrielle U.", "I just moved from California so I am very particular about my sushi. Yama passed the test and was as delicious as back home.Nice, classy ambiance with trendy decor. You can tell a lot about a sushi restaurant by how it is decorated. The staff was friendly and the chefs were having a good time, which I also believe to be a good sign.I ordered the yellowtail sushi, a spicy tuna handroll and a seared tuna-type roll. Oh my. Everything was incredibly fresh and on point. I had been craving sushi for literally weeks and Yama hit the spot. I am so happy that I found a great sushi place in my new city."], ["Will S.", "Service was good. We had party of 8, but the waiter did a good job.Food wasn't anything special. I had the hibachi steak and scallops. Scallops were a good size and well cooked. My steak was a little overcooked; I asked for medium rare and got closer to medium, but this normally happens when I get Hibachi. Nothing too special here.I tasted someone's udon noodle dish and the noodles and sauce were pretty good.I'm not a sushi fan, but a few of my friends got the sushi said it was pretty good.I'm giving it a 3.5 based on my own meal and experience, but raising it to a 4 b/c my friends thought the sushi was really good."], ["Ryan M.", "Review not based on sushi.Came to Yama seeking Udon.  Had gyoza, which was fine and beef namaki, perfectly adequate.  The Udon was fine, not good or great. Not sure I'd come back for either of these items but am willing to give sushi a shot."], ["Lolis R.", "This place is nasty, my fiancé and I had the worst experience at this restaurant. We ordered 5 tempura rolls and a shrimp hibachi and they give us the wrong order. This was a Togo order, when my fiancé got home I tried the first bite and I almost trow up. It was the wrong order with some kind of nasty tuna. When we called to let them know they never answered the phone. We live about 30 mins away from this restaurant, and as soon I was able to come back to the restaurant the next day, I brought of corse the nasty wrong order in order to ask them for a new order, not only a refund but the right order. Well the manager, \"Janene\" said that they can't do anything about it. I even show her the menu online where it shows how confusing it is because it has a  description along with a different item. No refund, no food, no nothing... Wow wow wow  Never going back I feel disgusting and VERY disappointed!!!They were very mean and definitely no customer service skills!!!I don't recommend this restaurant - totally a turn off in all ways!"], ["J T.", "Overpriced.  Chirashi bowl looks like the size of a kid bowl I can serve at home. Fish looks not fresh. I was kind of scared to eat some of them...which wasn't even much in the first place served. I'd rather go to Rusan and get bang for your bucks!  Rusan would give you a large amount and amples of fresh sashimi for less than here. Decided to try this place but guess it made me realized why Rusan was better! Whoever said this place has amazing sushi must be crazy because if you eat out enough, you know it's not the best in Charlotte."], ["Mel L.", "Sushi mediocre at best, service was okay. One good thing is miso soup!Fried ice cream was so cakey& not even warm or gooey to eat. Tempura was mediocre at best& sauce was great for tempura. It was my birthday, and it was disappointment! Great way to spend my birthday dinner."], ["Amy M.", "We came for lunch and I was pleasantly surprised with the quality of the sushi. We did the snow roll, h&m, spicy scallop and spicy salmon. I think the h&m and the spicy scallop were the best. The service was alright but definitely could be stepped up a bit. This is definitely one of the better sushi places in Charlotte."], ["Daniel S.", "Took my girlfriend here the other night and was very impressed. The place has a nice laid back atmosphere. Our server, Alton, was helpful and attentive as well as very friendly. The fish here was very delicious and fresh. The scallops, Hamachi and Tako were all amazing. We also had two sushi rolls, the Kenton and the lady in pink. Both were tasty, but the Kenton stood out to me as being really unique. Definitely will be coming back here for dinner again soon."], ["Jennifer H.", "I've been told by a few people that this is the best sushi in Charlotte.  After eating there, I have to say, Best Sushi in Charlotte is a pretty hard argument to make. I ordered a miso soup, house salad, Firecracker Roll, and a Volcano Roll.  Below are my thoughts on each.Miso Soup:  Watery.  Very little flavor with mini tofu pieces.House salad:  Dressing was good, but the lettuce was brown and tomatoes were not yet ripe.Volcano Roll:  Menu said it had lava sauce on top.  i guess my image of lava sauce is a deep red chili paste sauce.  Their version was some type of congealed slop with a sweet (rather than spicy) taste with waaaayyyy to much tossed on top of the roll.  Gross.Firecracker Roll:  The best of the night.  The sauce was redder and thinner than what was on the volcano roll and was more in line with what I would think of as lava sauce.  Still, the tempura breading was pretty thick and was too overpowering for the tuna. Finally, service was friendly, but I sat at the sushi bar.  There were no chairs at the center of the bar with a wooden panel that could easily hold the sushi going out.  However, this held the stand to put the tickets on when servers picked them up.  The sushi was placed directly in front of the patrons sitting at the bar, so I spent most of the night with servers hanging over me either waiting for the orders, or picking up the orders...directly in front of me."], ["Fleece P.", "I was very satisfied and impressed with this sushi. The rolls were a good size and fresh , service was OK but food made up for it. Went with coworkers for business lunch and had a delicious glass of wine as well."], ["Jacqueline P.", "I think that Yama has some of the best sushi in town. There are many many things here that are amazing however I only give them 4 stars as not all my experiences here have been great.  Overall the sushi here is fresh and delicious.  The Morrison roll, and the crazy tuna roll are two of my favs!! The gyoza, clear soup, miso soup, and salad are all extremely good as well :-)  I have tried their hibachi dishes and I've had better. I generally stick with sushi here though and the sushi never disappoints. I've read some other reviews and I have on occasion experienced some of the haughtiness of the staff/owners.  I'm going to be honest I have some friends who know and are friends with the owners, so for me to admit that is telling. However I think it may mostly just be the result of someone having a stressful/bad day.  I'm not saying it's an excuse especially considering the prices here, but everyone has a bad day!  The wine selection here is good, but the Saki selection is bar none the most fabulous thing here.  Don't get me wrong the sushi is to die for and probably some of the freshest I've had in Charlotte, but the Saki mmmhmmm the Saki!! They are well stocked with amazing hand picked selections. The staff is knowledgeable and always ready to lend a helping hand in your choices as well.  Overall I suggest trying this place it puts cowfish to shame and I kind of like cowfish on occasion haha.  It really is my favorite sushi place in town, and I'd truly give it 4 1/2 Stars, high prices and all."], ["Joshua C.", "Excellent sushi and decent wine selection. Service is always good. Every time we go out for sushi in our neck of the woods, this is where we go."], ["Mark C.", "Pretty good food, great service we had sushi and hibachi, food comes out fast, the appearance was pleasing, the food was aromatic.   The atmosphere is pleasant, decent music I believe soft Spanish guitar most of our visit, the people were decent, nice layout to manage noise.  In a great part of the city.  Plenty of parking."], ["Kelly H.", "The miso soup was the best I've had. The chicken hibachi was amazing as well. To top it off, our waiter Chris provided great service! He always made sure I had water or a full drink."], ["Steven K.", "This is the place if you want high quality sushi and pretty darn good hibachi style food. The price is a bit high but, as I say in many of my reviews - you get what you pay for. Great place to take a date as well if you both like this type of food."], ["Mike P.", "First time here and everything was on point. Had the snow roll and firecracker roll to start. Both were fresh and well made. Hibachi chicken and steak for dinner because I had a craving. Definitely hit the spot and can't wait to come back. The place is pretty quiet and I like the dim lighting that helps create an overall cozy feel. I'm giving 4 stars because it's my first time, but I hope to change it to 5 after my next visit."], ["Don B.", "We came here last Saturday night to celebrate my friend's birthday.  We made reservations and were sat promptly upon our arrival.  We ordered drinks and a variety of sushi rolls.  Everything came out in a timely manner.  Overall, service was very good.  The rolls were well made, the fish tasted fresh and the rice tasted very good.  What more can I say?  Service was very good, food looked great and everything was delicious.  I finished the meal with an order of Uni (sea urchin) and was very satisfied with that as well.  Next time I'm back in Charlotte I will be bugging my friend to take me back!"], ["Michele S.", "Hard to read the menu on my phone but I ordered hibachi shrimp & filet to go. The veggies were delicious, the soup amazing, & loved the filet & shrimp. I'm definitely a fan but would request brown sauce as the white sauce tasted more like yogurt than the traditional white sauce...little pricey -$38 for 5 shrimp & 6 pieces of filet...."], ["Jules S.", "All this time I always thought my metric for judging how good a sushi restaurant was the quality of the fish, or the taste of the rolls. I apparently was wrong. I first heard about Yama when it opened and was told I needed to try it out. I was surprised that the rave reviews were gushing because the environment was very clinical and cold. What's worse is that it had an overwhelming smell of bleach. Unfortunately, no matter how good a piece of sashimi is, if my nostrils are being filled with chemicals, I'm not going to be able to enjoy it. Don't get me wrong- I appreciate that they take sanitation seriously! But ever since then, I have enjoyed my rolls and sashimi consistently, but the smell kills it for me and just doesn't put it at the top of my regular rotation. I need to remember to go in summer months and eat outside and my problem would be cured! Their edamame is often over boiled and not seasoned enough and I had a friend who got an entree they thought was fine but not amazing.  Bottom line: If you're in the Southpark area and have a hankering for sushi, it's a good place if you don't have a sensitive nose or can sit outside."], ["Monica V.", "Excellent sushi and, for the area, pretty good prices. I have always enjoyed the variety of the rolls here. The atmosphere is nice and fairly upscale without being pretentious. Definitely recommend."], ["Michelle B.", "The atmosphere is warm and welcoming.  The lighting is dim but you can see the menu, each other, and what's going on around you.  Perfect.  Service came swiftly and with a smile. Our waitress was well informed and listened intently when taking the order.  We sat at the sushi bar and overheard her instructing the chef preparing our order.  The special (forgot the name) was recommended and was fabulous, as was the Boston Roll (spicy salmon topped with seared tuna, scallion and masago). We didn't have too much of an appetite so this hit the spot.  Of course, since we were so tired, we went for a slice of the chocolate cake (see photo) to boost our energy levels.  It was served on the cool side, but was rich and yummy for sharing.  It's a good thing because I assure you I would have eaten the entire slice!  The wine I selected for the evening was an even bigger surprise.  McManus Petite Syrah - it did not dissappoint!"], ["Rachel C.", "This is my third visit here. For Appetizers, we had their special: Mongo wrapped by Salmon toped with special sauce. Really good!!!!!! Then we ordered H&M roll, Downtown Roll, and Uptown Roll. All rolls we ordered were great! Definitely should come back here more often!"], ["Charles K.", "Oh my gosh!! I've probably been to all the top sushi restaurants in this area an by far this is THE BEST I've ever been too! Why haven't I found this place earlier! If you want some quality sushi this is definitely the place to go. Ru Sans used to be my go to sushi restaurant but now I would have to say I'm moving over. Yamas is my new go to sushi restaurant. My family is definitely coming again and I'm definitely bringing my friends here. The owner is very friendly and the servers are amazing as well. My family ordered a lot of the specialty sashimi and wow it just melts in your mouth. If you want to have really good sushi come here. It may be pricy but it's pricy because the quality. I still can't get over how delicious it was. This restaurants quality went way over the quality I got at Ru Sans, and Ru Sans was pretty good quality. I'm most definitely coming here again!**UpdateLet me restate just a little bit, don't get me wrong this place is amazing but it's amazing for the sashimi. If you're looking for rolls don't come here looking for something and disappointed this place is for people that have experience eating sushi and want something exotic because Yama's has selections other place do not have. I come here for sashimi and Ru San's for rolls."], ["Bianca L.", "It was ok. Good ambience and service. But food was alright. I go to this sushi buffet in VA for $13. This was way more expensive and not quite as good. Spicy mayo wasn't spicy at all. Crunchy roll didn't have the \"crunchy\" part. Cold sauces is a no no. It makes the food cold."], ["Adam R.", "This is probably the freshest sushi I've found in Charlotte and I've tried just about all of them. We did the sashimi combination and were thrilled with the results. Each bite was fresh and flavorful, and even the fish we typically don't find as flavorful tasted great. I haven't had anything but the sashimi but if you like good sushi this is your spot."], ["Ana C.", "Me and my bf tried this place for Valentine's. Being new to Charlotte from SoCal means we are definitely spoiled with the best food, specially when it comes to sushi. We tried Ru San's not long and it was eh ok.  The service was great. Here we ordered: Gyoza, Crispy Bagel Roll, Crazy Tuna Roll,  Firecracker Roll and the simple Tuna Roll. All of them were pretty good. I love any roll with tuna, and the tuna tasted fresh. The Firecracker Roll  and Tuna Roll were my favorite.  We are used  to more spicy and  full of flavor rolls, we are yet to find a roll like that in Charlotte. But, non the less we'll be back at Yama to try other rolls."], ["Ali H.", "After discovering there was a two hour wait at the nearby cowfish burger sushi, we decided to try Yama asian fusion. What a delightful surprise! Great regional wine selection, and very fresh amazing sushi. We particularly liked the crunchy roll and the rainbow roll.  Our only complaint was that our server lost the plot towards the end of our meal, and our dessert took 20 minutes to show up."], ["Rod O.", "Yama I LOVE You!!!  Mmmm!  Two Diners and several Lunches!  Until last week it had been a few years since my last visit... Everything is still Fantastic!  The only Huge improvement was there GINGER Sauce (they will tell you it is a Steak sauce)... This ginger Sauce is the BEST I have ever Tasted anywhere!!!  Tempura and Hibachi  is Excellent!  Last week I had Chicken with Fried Rice and Vegetables! Nice Looking place and it better be in this Neighborhood!  Modern with a Japanese (I guess) Flare (not Rick)... Tacky would NOT have worked here!  The Service is Always GREAT!  They have always treated me with the GREATEST SKEPTICISM as I expect everyone to!  It's a HUGE compliment to me when someone is incredulous! You want to look smart???No Food fights here, no chef to catch something on fire and throw shrimp n you lap...I'm great with \"Japanese\" Cookes stay in the kitchen and I can enjoy my own company or ____!If I were more of a \"Japanese\" \"Food\" American style Japanese so-called food or if I were a fan of Rice or Rice rolled up with other untasty or barely tasty ingredients and called Sushi... If I had only Rice or Sushi (I know the word \"Sushi\" IMPLYS more in America) to eat I would NOT starve to death - I might die of a Broken Heart, because this is not on my list of food that I want to eat, so I would not starve, though I would not be even one pound overweight because I would be eating only for nutritional needs and ZERO enjoyment!   If I were a fan of Sake (never had one I liked and never tasted any here) They have a selection beyond what I knew existed!"], ["Justin B.", "Terrible service, unattentive and uncaring staff. Went on a Thursday night, one of the first parties for evening rush... place was empty when we arrived Hut we waited nearly 2 hours for food while numerous other tables arriving after us were served. Manager didn't care at all and didnt do anything to rectify the situation. There are too many other good sushi joints in Charlotte to waste your time and money here."], ["Sascha S.", "I wish I could give no stars for this place. To preface my review, my wife and I dress casually, we are both significantly tattooed, and we sat on the patio and started by saying \"we are going to start with drinks\" and we never saw our server again. We got two beers and never saw the server again. We were considering getting something to eat or a bottle if sake, especially because we live across the street, our address is one off from the restaurant. I work at a restaurant and my guests are important to me, on or off work, my wife used to work at a sushi restaurant down the street. We are most forgiving when it comes to servers, having been servers before. The worst thing was that I asked to speak to a manager when we didn't see our server for 20 minutes and we told him that we felt discriminated against and he said I will be right back and he never came back. I guess to get good service here my wife would have to bleach her hair and I need to put on a pair of khakis to be taken care of. Thanks, but no thanks."], ["Kellie K.", "First, I should say that I'm not a sushi fan, but I went because the fella is.  We hadn't been in over a year, but the place was still as warm and inviting as I remembered.  Unfortunately, our waitress didn't have much personality, and we had to remind her to bring a glass of wine we'd been waiting on for awhile.  We skipped the appetizer and went right for entrees - he got the Snow Roll, and I got hibachi chicken (boring, I know).  The chicken tasted very fresh, and the fried rice had more flavor than most.  Fella said the sushi was good but on par with the place he normally goes.  He was impressed that there were 10 rolls instead of the standard 8, which also made the price ($14.95) a little more reasonable.  I thought the price for the hibachi chicken ($14.95) seemed lower than most places.All in all, a solid experience."], ["Matt V.", "Best sushi in Charlotte hands down"], ["John H.", "I'm really glad to see new sushi places like this one popping up on the map in Charlotte.   It used to be the same old places, but now with the competition moving in people will have to up their games to compete.Know your roll.... I only tried 2 rolls during my first visit here last night, but they were delicious and very filling.  The menu had a lot of other rolls to try that sounded super yummy so I have a feeling this place will not get old fast with the variety of rolls offered.  The menu also had a lot of sake - which I could totally go for on a weekend.. not when I have a deadline to beat on a Friday (the following day).Our server was very nice and was patient with us since we were a large group and did not all arrive at the same time.  Making reservations for the group, and it was just a quick, painless (less than a minute) phone call.  I did feel a little funny since the phone is quickly answered with a quick \"yama\" and I found myself stumbling over my words, but I managed to get my gears turning and the words finally came out coherently.   Overall... this is my \"sushi-go-to\" place for the time being."], ["Ann L.", "Delicious! Service was good since he was new. Food selection is great for sushi rolls! I recommend the red hot roll and lake Norman roll both were fantastic! Seaweed salad was yummy and gyoza! Would definitely visit again during lunch to try the bento boxes or hibachi lunch."], ["Kevin L.", "I tend to follow Faith Ds advice and she doesn't lead you astray here. Above that, I was amazed with the level of service.  Our waitress was absolutely fantastic and full of personality.  We tried a few different rolls and a basic bottle of Pinot.  It was wonderful!  I don't think you can really go wrong with any of the rolls.  Hint : If you love Sake, they have a great selection."]], "Akahana Asian Bistro": [["Mia W.", "Tables were sticky, sushi chef slow, waitress forgetful, food not so good and they overcharged us $10. Won't be back."], ["Vivek B.", "Went here on a Tuesday evening when my hunger was at its prime. I ordered some sushi. After a single piece I knew something was wrong. It was just not fresh especially the rice. I felt like throwing up so I stopped eating and drank the beer I had ordered instead. After a while I though I had second guessing myself and tried another piece. It was the same bad stale taste. I stopped eating. I think I had two pieces out of the 10 or so on the plate. I lost my appetite altogether.BUT, the  worst was when the waitress came by to hand us the check. She asked me if I needed a box for the remaining sushi. I actually said in an almost apologetic tone \"mm.. sorry I actually didn't like them at all. I couldn't eat them\". She looked at me without any expression and nodded and said \"Okay\" and went away. The LEAST I expected was for her to ask me what was wrong with the sushi. I would have told her gladly. Anyway, I will not go there again because this restaurants sucks. The Akahana at Baxter village is much better. A better crowd comes there and they are much nicer to you. I think it's a SC thing!BOO AKAHANA. Two thumbs down."], ["Cortney G.", "Came in to the restaurant and sat here for 20 minutes and had no service. Jason was supposed to be our waiter but he found every reason not to pass us, so we asked a very nice waitress out of the dining room to help us and she politely took our order even though she was busy and Jason was not."], ["Kat V.", "I have a love hate relationship with this place. The food is good but at times inconsistent. My favorite things to get here are the pineapple fried rice, Vietnamese steak, and sushi.The sushi is such a bargain. Buy one get one free everyday. You can't beat that. The prices ate very, very reasonable. Fairly inexpensive for a solid meal."], ["Elizabeth H.", "I have been coming to Akahana for dine in and carry out for the past two years and it never disappoints! The sushi is fresh and tasty, and the other things I have tried have been good too. Lots of options for sushi, and their soup portions are tasty and huge! The BOGO sushi specials are always great too! I would definitely recommend this place!"], ["Brandon F.", "I'll never go back to akahana. The service was awful. One of my friends got the calamari.  It was undercooked so my friend called the manager. The manager actually argued with us about it. My drink was spilled accidentally. Usually places will give you another drink. Not Akahana. Took forever with our bills.  The sushi was mediocre."], ["YumYum Y.", "First of all I come here just for the sushi. I've tried most of the dishes and the only one I like is the lemon grass chicken dish. As an asian, none of the food are authentic at all. Don't get pho because you can spend money at vietnamese restaurant that can taste way better for a cheaper price. So the boyfriend and I ordered togo for the first time, the person who picked up the phone was a young man with brown hair? I can't recall. But I had a couple of questions and I think I can be the reason why he messed up my order. But he repeated back my order before we hanged up... and he forgot to tell me the total amount of my order. When we get there it seems like they were busy. I tipped him because I understand how it is. And because he answered my difficult questions. When I got home and looked at the food... I didn't get my order right. I ordered sushi and it was fine... BUT i ordered vegetarian sushi and it was next to my boyfriend's dragon roll. It wasn't a big deal for me... but for other vegetarians it might be. So please put that into consideration!For our meal, we ordered lemon grass chicken and flat rice noodle with chicken. I don't know why.. but he messed up the flat rice noodle dish. Instead, I got a Chicken and vegetables with no rice... and I got a side order of flat rice noodle with just vegetables and no meat? WHAT THE HECK WAS THAT? How do you mess this up? Because even though I tried eating the chicken and vegetable dish it had no seasoning. It needed salt and sugar. It was so bland. I swear I come back because I want to see if there's a great dish that I haven't found... but I think its because there isn't. I don't even know what and how much I paid for... I can't even refund my money because he didn't hand me my receipt. Half my fault that I didn't ask... but c'mon. Youre running a business here. I shouldn't have to ask for a receipt... I'm the customer. A receipt should be handed to me."], ["Stephanie T.", "Well!!Little do I remember ! I wrote a review almost 3 years ago on this place... I remember NOT liking it there at akahana. SOMEHOW my friends encouraged me to try it one more time- FAIL. The BOGO enticed me, let me tell ya, if those sushi rolls weren't bogo- I wouldve been soooo pissed off. Its bogo for a reason folks. The sushi is awful. Not much different from what I was claiming in 2012. I tried the cherry blossom roll and the surf n turf. YUCK.My other 2 friends that were with me agreed that their rolls tasted old, just as mine did. My sushi had avocado where some of it was turning in color (old) and the salmon also did not look fresh....or the tuna.... DAMN! Like seriously guys, sushi isnt your cup of tea.... practically 3 years later....STILL, simply put, AWFUL sushi. I will never go back, I dont care what kind of luring special they advertise, on top of it all - believe it or not this place is pricey!  Like 14 bucks for something you wouldnt pay a dollar for. Rusans, in my opinion,  can't be beat in Charlotte."], ["Stephanie E.", "I think most people go here for the convenience as it's located right in the heart of plaza midwood. Food is alright, service is okay. Nothing special. Although the buy one, get one sushi rolls is one of the better deals you'll find in the area."], ["Foodie Q.", "I have only had there Veggie rolls - but I must say...there Green Day roll is delicious!!!"], ["Megan M.", "I've always had really good experiences here. Seriously, never had a bad meal. I almost always do the buy one get one sushi rolls. My favorite is the Charlotte and bagel roll. Spicy edamame is very delicious too!"], ["Dee W.", "I've been to this place a few times over the past few years and only got sushi for their special. Went last night with some friends for a birthday and everyone else ordered things other than sushi. They all looked and tasted soooo good!! Sake-tinis were awesome! I must go back soon just to get something other than sushi. Customer service was decent. Restaurant pretty clean. Quality of food was good and the low prices were excellent!!!"], ["Shay J.", "Wtf is this! Ok I'm alllll for BOGO. However, my sushi was the size of a dime.... Not worth my money. Maybe I should have purchases fried rice! At least my server was cool."], ["Lucinda L.", "What I ordered to go: Stir fried vegetables with chicken and no mushrooms, light white sauce, brown rice; spring rolls. What I got: bland, over cooked vegetables with gloppy corn starch sauce. Spring rolls were ok."], ["M K.", "1) BOGO: what a gimmick.  Their rolls are about half a roll from most other restaurants, so you're paying $14 for 2 mediocre halves.2) AVAILABILITY: Tried to order some a la carte nigiri and sashimi.  Pretty much everything I tried to order was unavailable and has been \"for MONTHS\" (per our server).  Uh... then maybe don't have it on your menu.  Then the waitress said the restaurant doesn't order it because they don't make money on it.  Uhhhh... then maybe raise the price? I think people who want uni or toro will understand that it will cost more.3) VARIETY: Sure, variety is the spice of life, but I don't trust an Asian restaurant that serves multiple different Asian cuisines.  I only tried the sushi so maybe the pho, thai curries/noodles, udon, and teppanyaki is really good... but dubious.4) SERVICE: Our server was adorable and nice, but she was not good at her job.  Her timing was so bad it was comical and it provided us with entertainment.  E.g., she would only come to take food/drink orders when one of us was in the bathroom.  Also, she never blinked. TL; DR -- Wholly unimpressive; BOGO is a gimmick; service is bad."], ["L B.", "This used to be our go to place whenever we were having that discussion \"where do you want to go, I don't care where do you want to go'. We loved the food . But I'm not sure what's happened but it has gone way down. The rice seems to be old the food also does not seem to be fresh. The roles are sloppy, come in all shapes and sizes. We gave it three shots before we decided to not come back. It's a shame this place used to be so good."], ["Nikki W.", "I'll be generous and give Akahana 3 stars when it should probably be 2.5 stars. I was a frequent flyer of this place when it first opened, mostly because for a year this nice little bistro who offered buy one get one free sushi rolls. As someone who should probably open her own sushi restaurant to get a return on my investment, anytime I can save cash on sushi is a plus.A while back the restaurant management changed and switched the deal to buy one get one half off. I understand this a business with profits to make so it didn't upset me but left my sushi-loving soul disappointed. Yet, I only dined here a good bit due to price and not quality... and even though the rolls the discounted, the prices are a bit higher so not truly snagging a discount. The sushi isn't bad by any means but not memorable - nothing that blows me away. At Ru Sans I covet the Firecracker roll. At Sushi 101, I always snag the Sir Justin roll. But I have yet to find an amazing roll at Akahana. Pretty average sushi here with no special sauces, ingredients or anything that makes me crave this eatery.However, props to the bistro for the atmosphere. It's a sleek, modern design with plenty of room between the booths and tables so you're not invading anyone's personal space. Upon walking in, you're greeted with a waterfall trickling down a tall glass panel that almost hits the ceiling... nice touch. We've always been seated promptly at the restaurant and service is more times than not good. Never had bad service, just slow... and last time I never got my requested side of aioli... blasphemy.Plus parking is easy and Akahana is located conveniently in Plaza Midwood... no fancy parallel parking here or trying to figure out how one-way streets connect."], ["Nancy N.", "Akahana has a very trendy interior. The lights are dimmed and there's a blue tone that circulates the restaurant. The only issue I have with this ambiance is when I come for lunch. The entire restaurant seems too dim compared to Mr. Sun shinning oh so brightly outside lol Of course you can always choose the outside seating, which is nice during a cool afternoon.This is the typical fusion restaurant with a very extensive menu. They have Vietnamese, Thai and Sushi. I just don't expect a restaurant with a broad menu to have amazing \"omg, I have to live here\" food (which is my normal reaction to a restaurant I love :P), but Akahana is decent. It's a good place to go when you're indecisive or if you have a large crowd with different tastes.I've tried all three cuisines here and the Vietnamese dishes are my favorite.Reviews for all three cuisines:The Vietnamese dishes are very affordable. I believe all dishes are $10 and under. The pho is pretty good, but it varies. From experience, it is really good on Wednesdays lol I'm not really sure why. The Pork Chop Rice Platter is my go-to plate since it has never let me down! It comes with grilled pork chop, an egg, rice and vegetables. Very delicious and filling! I would also recommend the \"Vietnamese Shaking Beef (Bo Luc Lac)\" and \"Seafood Crispy Egg Noodle (Mi Xao Don)\" I think most people will be overwhelmed by the Seafood Crispy Egg Noodle. It is a stir fry over a bed of fried noodles. It is HUGE and looks like a bird's nest lol The Thai dishes are also affordable, about $10 and under as well. I've only tried the Pad Thai and I wouldn't really recommend it. The flavor is decent, but the noodles are never done correctly. They fall apart with every bite.SUSHI! The sushi rolls are generally more expensive than other places (prices comparable to Cowfish, but not as yummy). Though the sushi is BOGO so it's decent. My favorite is the Spiral Ecstasy Roll! It comes with three different types of fish and avocado! :D The Tropical Exotic Roll is interesting. It's a sushi dish but it comes in triangles. I didn't really care for it (the presentation or the taste), but my friend thought it was unique.Overall: decent food, affordable prices, trendy atmosphere, but nothing out of this world amazing"], ["Donovan H.", "Akahana is an OK place to go for an great variety of Asian style food. Their veggie sushi is ok and so is the miso soup, however their stir fry sauces are really unimpressive. Also the food seems to be pretty inconsistent in quality, ranging from 2 to 4 stars on any given visit.While tucked away and not very noticeable on the outside, the inside is very nice. It's got a nice dark atmosphere, lots of dinning area, stylish decorations, and a pretty nice bar. The staff are all attentive and nice folk. It would be a good place for a date if the food was better and more consistent."], ["Ciara M.", "I came here for the bogo sushi special with my boyfriend thinking it was a great deal. It honestly turned out to be too good to be true. Our roles tasted decent but I have had far better for a better price. The waitress didn't really seem to care we were there and rushed our experience entirely, asking us we were ready to order after JUST handing us our menus. Plus and hour after we both felt pretty \"off\" and the next day our stomachs were jacked. I wouldn't recommend this low quality regrettable sushi place to anyone."]], "Ginbu 401": [], "Enso Asian Bistro & Sushi Bar": [["Deitra J.", "Had one of the specialty rolls and a mako. They were small and not worth the price but they were tasty. I had a couple  Dragon Fire cocktails which were good. Overall ambience was nice. Would come back for happy hour though."], ["Bud K.", "First, I've been here before. Speaking as a Los Angeles sushi snob, this place has the best (if not most expensive) sushi in Charlotte - that I've been to anyway.Today, lunchtime. 5 people in the place including me. Not 1, BUT 2! hostess looking females walked passed me (averting their eyes away from me) from the restaurant to the hostess stand - and back into the restaurant without acknowledging me AT ALL!! I took matters into my own hands and accosted the last one before she got away and asked if I could sit at the sushi bar, she said yes. Whew!Sat at the bar, waitress comes over, asks me what I would like to drink. I reply a large Sapporo. 3 mins later, she returns and says they are out of Sapporo. That's TOALLY understandable, as you are a restaurant that serves Japanese beer. How could you possibly be expected carry enough product so that you didn't run out? (To myself btw...).i told her I'd think about what I wanted to drink.She returns a couple of minutes later with menus and leaves. At this point I've heard 4 dance songs from the tunes above that equates to at least 20 mins since I've seen her last. To add insult to injury, she left me no pen with which to order my sushi. The sushi chefs are too preoccupied with their prep work to acknowledge me. I am alone here. \"Manager please???\"Manager, Eleanor approaches, listens kindly, offers to serve me herself. A very kind and generous offer. I decline, and just politely ask that the situation be addressed and rectified, as I would love to keep coming back to get more of the sushi that reminds me of home. Thx Eleanor. Good luck."], ["Pun B.", "My fellow diners loved their seafood dishes. I wasn't crazy about my miso soup or vegetable tempura roll. The roll was a little cold and not as crispy as it should be. Very limited vegetarian fare. Cocktails are divine. The Kudzu-tini was fresh and bursting with cucumber/melon. The ambience is the major draw. Sexy, dimly booths with lit red leather banquets, high ceilings, and modern lifting fixtures interspersed with Asian inspired accoutrements throughout. Almost like a modern take on a British Colonial bar in Singapore. Very elegant and a great place to come on a first date."], ["Sean B.", "Location - awesomeService - disappointing Drinks - yummy Sushi - pretty good, borderline very goodAppetizers - mehDessert - mehPrices - can't complain Wait times - decent Will I return - sure, why not? Done"], ["Amy P.", "Dined here last week for girls night out - we've been here a few times now and food has always been good, but tonight's service was awesome! Our server Ginny Q. was awesome, she's very social and provided great service. Make sure you ask for her. Our group will be back :)"], ["David R.", "I had a very nice experience here last Saturday. The abidance is set uniquely for both an intimate date or a group having cocktails before heading out for an evening uptown.  Our server Kelsie was very knowledgeable of the menu and recommended some awesome appetizers and sushi rolls. (I definitely recommend the Wagyu Tacos and Godfather roll) This was extremely helpful since the menu is almost 6 pages long. That might be the only downside to this place. You have too many choices. :)"], ["E O.", "The first time we went to Enso, the sushi rolls were so good we were floored.  It was a great night uptown all around, so maybe we were just living in the moment - this was a 5-star place for us.The last time, it came back down to earth.  It was a sunday night and largely unoccupied, but our rolls still took 25 minutes or so to be presented.  That was completely offset by our server, who offered a complimentary salad to make up for the wait.  Awesome, more than fair - one of our rolls was tempura anyway, no biggie.My wife had the miso soup, while I went with Egg Drop.  When the foodrunner brought it, he said 'soup of the day?' which was a red flag.  My egg drop did have egg, and fried noodles on top, but underneath it was largely some kind of unusual consistency - more like a chicken noodle soup than an egg drop.  The two conflicted and let to a pretty bad experience.Still the rolls are good, fish will be high quality, pretty big choice of rolls.  The biggest downsides here are a) the clubby music, if that bothers you, and b) high cost.  Two rolls, a free salad, two soups and a tea: $44.  But hey, its uptown, prime location, and focusing about 70% on ambiance, so whatever."], ["Kristie T.", "Went there for lunch with the girls.  We had an awesome experience.  Great food and service, nice bistro atmosphere and easy to get to on the light rail.  We tried a little bit of everything and it was all really tasty.  Would go back again and again!"], ["Amy M.", "We came for a birthday with a large group and I was kind of impressed with Enso. It had a very cool vibe to it. Even though we were in a large group our service did not suffer at all. I had a Honey River and Panther roll which were yummy. I also enjoyed the rock shrimp appetizer and the seaweed salad. I would definitely come back.. this is a perfect spot for groups."], ["Allison P.", "Lunch date on Saturday in Charlotte.  The restaurant was dead but I'm sure it gets busy for dinner & late night.  Service was great considering there were only two other parties.  Ordered green tea and two rolls to share - sexy salmon & tom tom.  Everything came out quick and tasted fresh. Enso is definitely trying to be up-scale and trendy.  In my eyes, that usually means expensive and over-rated.  I was definitely sticker-shocked when I got the menu and looking at the website now, I see that there's a lunch menu with a decent sushi special.  We weren't given that menu and I assume it's because we were dining on a weekend?  Either way, this place is pricey.  For Uptown, not sure what the other sushi options are but I'll look elsewhere before coming back to Enso."], ["Craig M.", "Enso is an upscale sushi bar with a great menu and sushi. I switch off between Enso and Room 112 to fill my sushi needs. I think Enso is a little more costly than Room 112 but some of the rolls are better than Room 112. Really can't go wrong at either place"], ["Patrick M.", "This one of my favorite places to visit when in Charlotte. The sushi is always good and never disappointing. I haven't tried too many things from the menu other than the sashimi and sushi rolls. Everything that comes from the kitchen looks delicious. On my last visit with friends, we started at the bar and were treated very well by Christina and Elton. My glass was never empty and they worked very well together. When we did eventually sit at a table, Marion was our server. She was very friendly, attentive and always smiling. She suggested a few things of the menu I hadn't had before and definitely enjoyed. All in all, I will definitely go back next time I'm in town. I always do."], ["Satish C.", "I have been eating here for almost 3 years. Nice and convenient location, good selection of wine and their Sushi is above average. The wait staff are changing too often, not sure why they can't have people stay there for more than 3-4 months. Food quality has come down some since I first started eating here. I really like the old menu and miss the choices"], ["Theresa C.", "Was there Wednesdsy evening. Had a few different sushi rolls. Very tasty and fresh. Has a strawberry martini off the menu which was great. Been there a few times and have always had a good meal!"], ["Donna A.", "Based on Yelp reviews I ordered the Maryland roll. Love it! Great taste and nice blends of texture with traditional sushi plus some crunch. Also ordered the ginger salad. I love ginger and this meet my expectations."], ["Brittany K.", "Average to slightly above average sushi."], ["Kendall K.", "We visited tonight after Sam Smith and had a wonderful meal with wonderful service! I was interested in a table that was seated after us with 5 guys getting attention from all staff...managers to multiple wait staff. Shots and appetizers and loads of sushi! Found out it was some \"Kardashian friends\" in town and restaurant staff was hoping for Twitter tweets or other social media status. Instead of giving local, potential frequent diners, the best service this table received top notch attention. They left before we were done dessert and ate, not even half the food on their table. It's sad... the waste of food and \"brown nosing\" I witnessed tonight. Just shows who this restaurant values the most!"], ["Safiyyah S.", "Great place, good sushi and great ambience! Love the atmosphere. A bit pricey but very worth it, also good drinks and appetizers and awesome presentation!"], ["Kseniya M.", "Came in on a Saturday afternoon for a quick snack of what has been advertised as the \"best sushi\" in town but was totally underwhelmed. The service was slow and limited, the server kept disappearing for long periods of time. The sushi selection was not good at all, most rolls contains either cream cheese (ew!) or tempura. We found a roll that seemed like it would be ok (the Tom Tom) and it was tiny and flavorless for $17. The spicy tuna roll was not spicy at all. The sashimi was the only decent part, the \"tuna\" was ok, the octopus was average, and the salmon was good. I wasn't expecting Tsukiji fish market quality rolls, but I also did not expect crap."], ["Lindsay M.", "If there was a place for zero stars I would have left it blank.  This sushi place is beyond horrible.  This was the second time I have been in the past two years and it did not get any better.  The waitress was slow with drinks.  The sushi was way below average and the prices were steep.  Don't know how this place makes it in such a high rent area downtown.  I was so stressed out from trying to park in a parking deck my food could not have been enjoyable even if it had been good.  The manager came around to ask how everything was and he was wearing a cheap suit from wal-mart.....just like the sushi!"], ["B J.", "Food is good but not great. However it is ridiculously over priced. We had a few rolls and a salad and the bill was almost $100 for two people and no booze. Bad decision and total tourist trap."], ["Kajal M.", "Reserved a month ago for a group of 12. Not only have we been waiting an hour and a half, but the manager didnt even seem to care.  Terrible customer service. I will NOT be coming back here ever. If you have a large group, skip this place."], ["Ashley C.", "I went here for dinner while visiting Charlotte, probably one of the best places to go on a weekend for dinner. I loved the ambiance, trendy decor, great music and good food. Definitely recommend for meeting up with your girls or even a date :)"], ["Dennis T.", "Food was pretty poor. Service was also bad. Constantly being rushed to clear out. Would not recommend."], ["Mark D.", "Just OK. I ordered the pepper steak with white rice and it was just ok. Service is good. But nothing about this dish says \"Order me again\".  Most of the time I can't do this, but I was able to de-construct the dish and that is difficult with Chinese food. Black bean sauce, cracked pepper corn, hoisen sauce, soy sauce, regular and black sesame  seeds. White rice portion was small and for Asian people, we'd have to order 4 more sides of white rice. Red pepper, green pepper and onion.  Steak was tender but not delicate. Paid about 13 for the dish. Would come back but probably wouldn't order this again. Looks like a nice place to take a date if you aren't too hungry."], ["Megan B.", "I went to enso for lunch the other day with one other person. The ginger salad was just like you would expect. The sushi really pretty but tasted just like typical sushi. The spider roll was awesome. As for atmosphere, it's way too dark inside and it's super swanky. The place is run by Americans and there is nothing authentic about it. We ended up spending $100 without any alcohol. It's pretty good but not worth the price. Head to New Zealand cafe for better sushi for half the price."], ["Jennifer H.", "I had previously been to Enso a couple other times and was not impressed, but for the review, decided to give it one more shot.  I still was not impressed.  it wasn't horrible, the fish tasted fresh, but the rice was undercooked.  I also ordered the sushi lunch special and asked for a soup.  The server tried to tell me it only came with a salad, so I asked if I could get a soup.  He then said it was being cooked.  I didn't know why he would try to tell me a salad was the only option and not just tell me the truth up front.  The prices are pretty high, so, for the price I think there are better options."], ["E. L.", "Service was good but it was also around 2PM on a rainy day. I tried the Maryland roll which probably isn't worth $22 but the crab cake on top was flavorful."], ["Rebecca W.", "The food was ok but the service was terrible. We went around 2:30pm and the place was dead. So you would think we would have attentive service, but no. Also we told them we had never been there before. So we were surprised when the service was so bad. After we got our food we hardly ever saw our waitress. I never even had my water refilled. The when we left the hostess and other worker she was talking to didn't even turn to tell us anything when we left. Not a good way to get us to come back.The only reason I gave it two stars was because the food was pretty good. A little expensive for the generic Chinese lunch specials."], ["Tanaura W.", "This is a trendy yet chill Asian restaurant. We come here every time we visit Charlotte. We've always had great service. It's a little pricy and there's no all you can eat sushi. I'm thinking that must be a west coast thing???I got the spicy chicken pad Thai. It was actually nice and spicy! We also got a lobster egg roll. Very good. Tried the Maryland roll that has the house made crab cake on top of it. It could have used a sauce on top of it. Very good, just a little dry. For desert we had the most interesting Asian desert ever. It was a fried ice cream roll. Green ice cream rolled in cake, dipped in tempura batter and fried. Then they drizzle chocolate on top and line it with whip cream. YUM!!!"], ["Peggy C.", "Been here several times. Mostly for bday dinner/special occasion. With that being said, service has always been acceptable (especially with big group). Last week 3 of us stopped in for a late night dinner at about 10pm. We sat at the bar. Service wasn't as good that night, our waitress had a tendency of going MIA, and the food took a long while to arrive given that we were only ordering sushi. In fact I didn't even see the sushi guys in front of us making them, so I'm not sure where they came from.As many have mentioned, this is not a cheap place to eat. However, I do give them credit. The nigiri pieces were fresh, of good size and not too much rice. I was told that they always have toro & uni, which are rare in Charlotte. We also had a bottle of sake that was very good (Ty Ku Black). While prices are higher, it is one of the better dining options in EpiCentre, especially late night (and extra star for that reason)"], ["David H.", "Nice place to visit for lunch. You can order off the sushi menu or use their lunch menu. Many different offerings including non sushi items. They have a Lunch A and Lunch B sushi combo which is excellent. I had the lunch A which consisted of nigiri roll, tuna, salmon and yellowtail along with a chef's choice. You also have your choice of miso soup or ginger salad. I took the salad which was closer to miso salad than ginger. Great location. Our service was very good."], ["Chelsey V.", "I've been coming to Enso for years. Although the menu and staff have often changed, Amanda has been a consistent part of our dining experience. She is always friendly and an integral part in helping us select from the many great choices."], ["Mark T.", "OMG. An all around five star experience. We had the Rock Shrimp Appetizer first. Very, very good. We then ordered some sushi. Very, very good. My son had a Jumbo Shrimp meal set in four pools of pureed edamame and spicy potatoes. I had the Galdi beef ribs. AWESOME!!! No room for deserts. Going back soon !!"], ["Nicolette H.", "My boyfriend and I joke that 'If it's too dark to see the menu...you probably don't want too\". Enso is a 'classy' uptown restaurant where you pay Uptown prices. Even their website plays Jersey Shore Techno.We were saved by Groupon because I know I would never pay that much for Sushi, especially sushi that isn't amazing.The service was a bit slow, and our waiter would appear and disappear, which is bad when my boyfriend is hungry, you don't wanna see him when he's hungry. We ordered Edamame ($5). You can't really mess this up.Then we each got two rolls:Spider Roll ($17) - Deep-fried soft shell crab, lettuce, avocado, cucumber, and masago, finished with sweet glaze and sesame seedThis was interesting because I've never had soft shell crab in a roll, while the textures were intriguing it was overall, not that special.Ninja Roll ($16) California roll with tuna, yellow tail, salmon, white tuna, shrimp, eel, avocadoI love eel and yellow-tail, so this was my favorite of the night. But I feel like I could've gotten this roll somewhere else for 12$My boyfriend had the:Checkers Roll ($19) Yes...$19 ----Shrimp temp, spicy tuna, cucumber and cream cheese, topped with sweet tofu, spicy crab, spicy mayo, scallions, eel sauce, and masagoI'm sorry I can't get over that...$19? Can you say Apple Bees 2 for $20~!He DID NOT  like this ----- The sweet tofu had almost a coconut flavor and was hard to get around, we left 2 on the plate cause I was too full to eat the ones he pushed away. I want to be like \"That's like $4 worth of sushi!!!!  Eat it and like it\"!!!!!!!Alas I cannot remember the last roll, something probably hot, because he loved hot food.I will probably never go back to Enso, it's not my style. It's not great sushi.Just go to Emzy down the street  (I took my BF here for a Birthday)- It's Cheaper, same Yelp Rating, great for date night.See Sushi menu below....not one sushi roll is $19  :)emzyuptown.com/files/411…"], ["Ameera D.", "Best sushi in uptown. I loved everything I ordered! Octopus, salmon, yellowtail. It was all extremely fresh and the sushi chefs were very entertaining. I didn't care for the service. I liked the DJ. It is pricey but it's worth it if you enjoy good sushi."], ["Iskeisha P.", "It was good a bit more pricey than I'm use to but good. Up north in DE u can get more sushi less money but this is the city.  The miso soup was good and tasty. I had the crunchy something with crab and the butterfly shrimp on a bed of rice. I was satisfied once finished and I would definitely go back. I had the combo 1 special $16 plus  tax another thing I'm not use to. Also, very nice inside."], ["jo c.", "Came here friday night and got seated right away at the sushi bar. They ran out of toro and do not have ume. They brought the wrong appetizer for my husband and the beer from tap seems flat. While enjoying our appetizer a server carrying a bunch of plates hit my husband on the back of his neck with all these dirty plates- No apologies and walks away! Food overpriced! Don't come here!"], ["Bryce C.", "Had lunch here. Great service. Amazing miso soup (hard to do). Sushi was tasty and fresh. Service was keen and attentive, but not annoying. Recommend this place to anyone looking for some sushi and atmosphere!"], ["Morgan H.", "I paid $55 for a glass of wine, watered down \"gin cooler\" and suckey fried rice. Parking not included"]], "Room 112": [], "Pisces Sushi Bar & Lounge": [["Heather N.", "This is one of my favorite sushi places in Charlotte. The atmosphere is intimate and cozy, especially if you get one of the hidden away booths. The sushi list is extensive and full of creative rolls and creative cocktails. The Rainbow Roll is one of the best ones I've ever had. The Jumanji Roll and Screaming O are wonderful as well. The service has always been excellent as well."], ["Regina J.", "Our 2nd stop on our passport tour of Charlotte restaurants. The drink, pick your poison was #1. The atmosphere was sexy and the guitar player was on point. We enjoyed the vibe at this stop. Plus, they had jellyfish in the wall."], ["La'Tosha S.", "This place is great!I love the all you can eat made to order lunch special.  Hibachi and the Sake are also very good. This restaurant is one of my favorites."], ["Lisa S.", "Very fresh and delish food.  Server was very helpful to the point of being chatty, LOL.  you could really tell your food was right off a boat. The booth area needs some serious decorating upgrades. They are like black caves where you may never be heard from again.  Maybe add a little color, cut out the openings so you don't risk getting a concussion? other than that, a nice night."], ["Sara B.", "I am a chef, and working in the restraurant business and I have to say pisces has amazing sushi. So compliment to the chef, which I know one of the chefs Vang from living in Virginia Beach. The only thing that could be better is the service. When it's busy, the service is great, but when it's slow, the service isn't the best, which doesn't really make since. I would understand if it was busy and the service was bad, but while it's slow, I expect the best service.  But other than that, I still go at least once a week or once every two weeks. The food is amazing, and they have awesome specials."], ["J T.", "Pricey. Sushi rolls weren't all that. Had a couple of different rolls from this place multiple times and nothing stood out. However garlic noodles were awesome. They have all you can eat buffet for lunch but the ordering style was annoying, since the server had to come check on you to place your order ...then you have to wait for it to be made and sometime you sit there waiting forever and the server is no where to be found.  Hello? It's lunch time. Don't you know some people have a time limit on their lunch break? Nothing spectacular about this place other than it's in a hip location and good for younger crowds on weekends. Decors are nice but I wouldn't wow my friends and families from out of town with their sushi. Go to Rusans, decent priced and way better flavor in their foods.  Last time I was there at Pisces for a friends bday, two of my friends made a mistake and ordered the crab salad thinking it would be something awesome considering the price! When it came out, it was nothing but shredded imitating crab meats (wtf?) mixed with tons and tons of cucumber, so flavorless! Anddddd it tasted like something a kid could make.  They both didn't even want to finish it. Seriously not impressed."], ["Caci T.", "We had dinner here on Saturday night and it was a great experience! They even made a roll that used to be on their menu but hadn't been for a long time! Both manager and server were excellent! Thanks so much for the great experience!"], ["Bruce K.", "After reading the discussions in Talk and seeing some recommendations for Pisces, I thought we would give it a try. Even though it was early lunch time when we arrived, there was a good vibe coming off the place. The large bar area and the private booths in the back looked very comfy, but we took seats in the middle of the dining room.Opting for the all-you-can-eat, the sushi is prepared when it is ordered as opposed to the buffet-style at other places. A handful of hot plates (noodles and such) are complimented by a few different nigiri-sushi, (salmon, tamago, mackerel, etc) and a dozen or so temaki rolls. Don't expect anything earth shattering, but the stuff that they do offer is good, quality sushi that isn't nearly all rice.Our waitress was quite attentive, refilling sodas before they were empty and getting our sushi orders before the plate was gone.Is it the best in Charlotte? Maybe not. Is it the best ayce in Charlotte? Possibly."], ["Gabrielle A.", "Such a good lunch special. All you can eat rolls for $10! It's quick and pretty good. Nothing fancy but simple and fresh. They have good garlic noodles and veggie spring rolls too!"], ["Dan M.", "Cool Modern feel. Awesome Sushi. Live music was fantastic. Being foodies, my fiance and I have made the rounds in Charlotte since moving here from Austin this year. This is not only our favorite sushi spot, but one of our favorite restaurants. Definitely worth checking out. We'll be back soon!"], ["Chad E.", "The location and vibe of Pisces is great - right in the midst of the action at the Metropolitan, but across the street so you get a bit of separation. Plus, you walk in and the darkened room gives you a bit of a breather from whatever stress you have felt outside.When it comes to food, the sushi is definitely on the upside, though in some cases looks like they have spent some more time on the appearance than anything else. It's not a bad thing, just a thing. When it comes to other items (hibachi, etc), the dishes are also good, but nothing earth-shattering. Again, it's like more time is spent on the appearance than anything else.Now there isn't anything wrong with a lounge being a lounge, but a lounge being a restaurant? To borrow - and paraphrase - from Jerry Seinfeld, there isn't anything wrong with that, but it lends airs that just make it seem a bit indifferent. If you're there for cocktails then it might be a better experience. If you're there for dinner, it's a bit less impressive."], ["Noelle D.", "Omakase all the way! Tell them your preferences and prepare for greatness the likes of San Francisco."], ["Carol P.", "The A2 appetizer and the spicy garlic edamame are a MUST! The yellow submarine roll is always my favorite, and the little booths/cubbies are romantic for date night. The water always seems to taste a little funny- don't know if it's the water or their ice."], ["Elisabeth B.", "$10 all you can eat lunch is back for a limited time. $4 up-charge for sashimi but I highly recommend as they have beautiful fish. $10 includes all you can eat brought to your table- sushi rolls, garlic noodles (get them), fried rice AND spring rolls."], ["Mya R.", "I Love Pisces! I go there for lunch all the time and the sushi always tastes amazing! The place looks very cool."], ["Paul C.", "I really wanted to like this place much better. But in taking into account the price I can only give Pisces 3 stars. Was it good? Yes. Fresh? Again yes. Was it worth $20 a roll? NO.To give a fair comparison to other Charlotte Sushi places, I ordered 2 of their signature rolls. One featured spicy jalapeños,  the other had filet mignon on top. Both were good and fresh. But both were also missing that Wow factor....that je ne sais quois.Now the bartender was awesome, and his drinks rocked! But for 2 rolls and 2 drinks, that set me back $75 (including tip)!To me, the best Sushi I have had in Charlotte so far still is Sushi Guru in Southpark. Their Sushi Guru Roll is TO DIE FOR! If anyone out there has other suggestions for great sushi place then pease let me know. I lived out West for 6 years so I know good Sushi."], ["Nikki W.", "Like a fine wine... this place just keeps getting better with age.Now three plus years old, Pisces has expanded into the space next door to create a trendy bar and lounge area.Cocktail genius Bob Peters continues to pull more tricks out of his bag. If you go to this place and order a Bud Light- you're doing it wrong. This is what real bartending is all about. Whether he's using a carbonator, playing with new liquor infusions or adding smoke to a cocktail... put your drink decisions in this man's hands. Intimidated? Tell him what you like. He'll come up with the perfect concoction for you.Hungry? The best bang for your buck happens at lunch with the all you can eat sushi deal for $14.My biggest problem at Pisces is narrowing down my order. I have to issue self-imposed restrictions or I will easily convince myself that I need five rolls. They're all delish but here are my current three favs (yes they change every few months):Leo (tuna, mango, avocado and chili oil). I love the chili oil kick of this one.Kissy (mango, crab, cream cheese in soy paper, re-wrapped with basil and rice paper) There is just something so clean and delicious about this roll.XoXo (crab, avocado, topped with baked scallop and a honey mayo eel sauce) The topping just takes this roll to a new level.I'm also a big of the Tuna Bruschetta for starters and Tempura Oreo with green tea ice cream for the grand finale. For the late night crowd, Pisces also serves food til 2AM on weekends.Need some entertainment for your food coma? Stare at the jellyfish tank. It'll hypnotize you for hours."], ["Josh B.", "Great fresh sushi, best spicy garlic edamame I've ever had, must get! Really good service!"], ["Hania A.", "Good sushi but my fiancé and I have had much better.  Maybe because we have been to the best of the best, but this was just ok and nothing spectacular.  It was fresh ingredients though and a nice cute date spot for maybe a first date.  Service was quick!"], ["Marshal C.", "The food is always amazing and the staff are very friendly.  You have a wide variety of seating options from traditional tables to booths that are extremely private in the back of the room.  Sushi is always prepared fresh and quick to suit your busy schedule.  There are nights every week where they have half off bottles of wine, call ahead to verify the correct date. This is somewhat new to the business.  The dining area is clean and so are the restrooms.  Great for parties and large groups."]], "New Zealand Cafe": [["Yulia Y.", "This place was okay. Sushi was basic - not bad but not the greatest. Service wasn't so great. The waitress was rude. We waited a while for the food. Wouldn't recommend."], ["M T.", "This is my favorite sushi place in Charlotte! Words can't describe how happy I am that I have discovered this gem of a place. I wish the absolute best for the owners but sometimes, for my own selfish reasons, I hope they don't expand because most restaurants that expand, often don't do things the same. Such as, the chef's are different and the prices increase because of whatever reason... It's just.. This place is perfect and I don't want anything to change. And plus, I don't want any more people to know about this place because this place can get packed real quick. I'm just joking... Sorta.The sushi here is spectacular and at a reasonable price too. The quality of the sashimi is just incredible and especially for the price. It's a bang for your buck!! And for my non sushi lovers out there, the bento box is great also, really good portions. Favorite dishes:Big Boss RollLobster King RollCentury RollSake NigiriTuna Tataki PokeSquid SaladFried Ice Cream"], ["Kelly C.", "Oh. My. Gosh.  A.m.a.z.i.n.g.Everyone is right.  This place looks sketchy.  It's in a strip mall, not very big, crowded, not well lit, but the sushi is fantastic.I went in for lunch today. I was in the Matthews area and this has been in my Yelp bookmarks for a while.  It was a little crowded when I got there around 1pm or so.  I was seated at the sushi bar, there are only 4 or 5 seats there.  They are so quick here, I had my water and was asked if I was ready to order in no time.  I panicked a little as I was scanning the menu, trying to order something I had read a review for on here.  I ordered the Ichiban Spicy Roll and the spicy salmon roll.  I was looking at everyone else's plates and the guy next to me got the Valentine Roll and the rainbow roll.  They were very pretty.  The man a few chairs down recommended the Double Taste roll if you like something spicy - it has a sliver of jalapeño in it.These rolls were delicious!!! Hands down, some of the best sushi I've ever had.  They tasted very fresh, and held together well.  The Ichiban roll had some heat to it, but not so much that you missed out on flavor.  And the spicy salmon was packed with fish!!  I will definitely be back here for lunch, date night, grabbing a quick bite, with friends, etc. ;)  don't let the atmosphere scare you off.  Excellent food, quick service and cheap prices!  This is totally worth it."], ["Megan B.", "This is the best place for sushi in Charlotte... there is no room for argument... this is a fact. I live about a quarter mile from New Zealand Cafe, but I didn't know about it until a coworker of mine recommended it. It took me a couple of weeks to actually make it over there, but once I did I was hooked! I have been there 3x so far. It can get really crowded for dine in, so be sure to expect a wait.. a wait well worth it. Carry-out is also an option I have done a few times.The sashimi bento box was delicious. The fish is very fresh and they roll the sushi right in front of you. They have $1 nigiri which is phenomenal and very high quality. The prices here are cheaper then most places and the sushi is better tasting and higher quality. My favorite rolls are the spicy tuna and the tempura rolls. I have a lot more to try! 5 stars"], ["Bem H.", "This is one of my favorite sushi restaurants in Charlotte. They have an amazing selection of all different types of sushi and Asian inspired dishes. The restaurant itself is on the smaller side so there might be a wait if you come with larger parties. Prices are unbeatable, sushi is amazing, service is great..what more can you ask for? NZC definitely delivers."], ["Chad W.", "Affordable?  Yes.  Fresh?  Mostly.  Cramped?  Yup.  Slow?  Absolutely. Worth it?  Depends on how much you like sushi.Those that rave about this place really don't know quality sushi.  Harsh perhaps, but true.  I went all nigiri here; I appreciate that all fish has its Japanese name, even though the server couldn't understand my white-guy pronunciation.  Anyways, some things I tried were fresh, some were clearly thawed from frozen.  Some items that I ordered were subbed out, (e.g. I ordered ama ebi, got ebi...that'd be like ordering raw tuna, and receiving fried catfish).  and some simply were not served (where's the hamachi)?  It was by no means terrible, and for the price I would go again, but don't expect to get blown away here.  NZ cafe is affordable sushi in a strip mall, no more, no less."], ["Greg R.", "This place is snappy, fresh and has awesome customer service!Every time I've been here around 6pm or later durring the week I've been seated very quickly.I've gotten the Crispy Tuna Roll, Volcano roll and the New Zealand Chicken a couple times. All thier food is of very high quality and tastes fresh. The host, servers and all of the sushi staff are very nice, accommodating, and are very knowledgeable about the menu. You will not be disapointed. This place is so good and is a almost a hidden gem!"], ["Nicole J.", "The sushi is on point. I had been hearing about this place for a while. Had the chance to stop in for lunch. I ordered the Itchibon Roll, it was over the top good!I have been back 3 times since. Great staff also, GO THERE NOW! !!!"], ["Rob H.", "Been coming here for years. Great hole in the wall restaurant for sushi or any other Asian fusion dish. Best sushi in town and also best value, very afordable. Get there early as it has a small dining room and there are always lines out the door. Staff and owners are also great people and very friendly."], ["Sule C.", "Good food and decent prices! Best one around matthews. The only down side of the restaurant is being too small. Should always ask for the high tables if you want some privacy because the middle tables are way too close to one another that it feels like you are dining with strangers (and yes..they could hear all of your conversations)"], ["Ash H.", "It is located in the Harris Teeter shopping center,next to the \"Chinese Food\" sign.Tiny restaurant,the lightning is a little dark,limited seating and yes the tables are really close to each other. It feels a little uncomfortable. The sushi is really average, it taste like grocery store bought sushi,except it's not cold. Most of their rolls are deep fried. The quality of food and price are both lower compare to other sushi restaurants.I would maybe just order take out from time to time if I'm feeling cheap and need a quick sushi fix."], ["Annoymous K.", "I love this place for SUSHI! TEMPURA! JAPANESE FOOD! ASIAN FOOD! ALL KINDS OF FOOD! This place is jam packed because they make their sushi fresh out of the fish! This is a perfect outing for a family or group time."], ["Lindsay M.", "This place had great sushi at affordable prices. The fish was fresh and the rice had good texture. The place is small but the service is good.  I will definitely be back."], ["Elisabeth B.", "Eat here with your eyes closed. The decor isn't THAT bad but you certainly don't frequent New Zealand Cafe for its strip mall ambiance. Don't let the fake plants and cramped dining room scare you off. The food is at least fifty percent better than you would think.Service can be a bit slow so grab an app. Rolls are fresh, varied (tons of non-fried options) and affordable. Four rolls at dinner with beers ran us about $37 before tax and tip. This is a great spot for affordable sushi or try the bento box for a little bit of everything.I wish they had more outdoor seating -only two tables- but this place is the only place in the area with quality sushi. It is packed for a reason."], ["Nina H.", "Great service! Plenty of choices. I wouldn't say five star sushi quality. However, the price and variety make it completely worth it!"], ["Allison K.", "This restaurant is WONDERFUL!  I have been here multiple times and have never been dissatisfied with my service.  My only complaint would be that they are always busy and the seating is very close to other patrons.  Despite this fact, I still love it here!The food is amazing and hot, the waitresses are amazingly friendly, and they are quick!  I have tried several dishes on their menu and none have been dissatisfying.  My favorite on the menu would be the thai chicken curry.  The prices aren't bad either.  ;-)"], ["Patrick D.", "I am very conservative on accolades on yelp.  Charlotte is devoid of a selection and variety of restaurants but this place is an absolute gem.  We drive 45 minutes across town to eat here.  Prices are fair, service is good, the sushi is excellent.  Presentation is great, the rice is perfect, and the portions are abot 20-30% more than anywhere in town.  Try the Ichiban roll!  Went on monday night at 7:00 and place was full, but only waited 5 minutes for table.  The dining room is small and a bit tight, but the food makes up for lack of elbow room."], ["Ethan H.", "Great hole in the wall. I have been to many sushi places from NYC to Chicago even LA. This place is an awesome must try place. Very small cafe location but looks can be deceiving. Would highly recommend for someone looking for a casual dress sushi spot in Charlotte."], ["Cristina M.", "Great sushi at great prices. It's a little hard to find in the strip mall but it's well worth it. It's small so go on off times or early. We ordered a lobster roll and tuna roll. Both were fantastic. Fresh. Crunchy. Flavorful. My new favorite sushi place."], ["Kelly N.", "I love this place. The BEST SUSHI IN MATTHEWS! They are very far price for their food and they have a really friendly staff . I would eat here everyday if I could."]], "Sushi 101": [["Stephen P.", "First I have to start off by saying I can't believe I have been in charlotte for almost eight years and today marks my first time venturing out to sushi 101, as I have heard so many things about this place but never seemed to find myself nearby when I needed my regular sushi fix (which is pretty much any day ending in the letter y), but all that changed today.I ordered the panhandle roll, the jasmine roll and the voodoo roll and hold on, I seriously don't want to put my chopsticks down to type because these three rolls are absolutely AMAZING!  The individual flavors mesh so well together and the freshness of the ingredients is clearly evident with each bite.  I love spicy and the server did not disappoint with her recommendation as these are some of the most flavorful rolls I have ever tasted, and that my friends is not hyperbole or exaggeration!I also have to give my server Megan special recognition as my water glass never got less than half full before she refilled it with a smile every time.  She was extremely personable and actually genuinely appeared to enjoy being there, which sad to say isn't always the case with servers in some places as I am sure we can all attest to!First class service with a smile + fresh flavorful sushi at a solid value = the next entrant into my five star club!   Congratulations sushi 101 as it is well deserved and I will definitely be back again and again and again!"], ["Vanhtha S.", "I grew up in new England with great seafood.   I've always thought Portland had the best and freshest seafood until I had sushi 101.  I only get sashimi everything else is a filler to me.   The fish was fresh and proportion were very generous.   I've been in Charlotte for two weeks and I've gone there twice and going tomorrow.   Also the bacon scallops  for 3 bucks is a killer deal.   I'm a fan.   I'm still exploring so I'll might be back to change the rating."], ["Eren C.", "I'm a big fan of this place and I wouldn't even call myself an avid sushi lover. Although I like it, it's not my favorite food on the planet, (that would be my wife, she could eat sushi every day for life) but sushi 101 is incredible. I've never had a bad experience here. The sushi is DELICIOUS and I'd say it's fairly priced as far as sushi goes. On our last trip I ordered the Super Crunch Roll- one of my faves and one of my \"usuals\" and the Ballantyne roll. I expected the SCR to be great, and it was, but that Ballantyne was to die for. It has crunchy salmon skin on the inside of the roll and raw salmon on top. (Ugh, wish I'd gotten a pic of it) it was absolutely delicious and it might become a new favorite of mine. We went with a large group of friends and everyone enjoyed their meals and the service was pleasant and fast. Oh, the edamame as an appetizer is a MUST! It comes out warm and flavorful and we couldn't stop eating it. My father in law ordered the chicken fried rice (I don't think he's a sushi fan lol) and they brought him this massiveeeee plate out of the most delicious rice ever, he was in heaven! The other thing about Sushi101 is that they're right next to Polkadots bake shop, one of the finest cupcakeries in Charlotte!"], ["Kristen M.", "INCREDIBLE!!This sushi might even be better than CowFish!! A fantastic, dive, off the beaten path, low key place for some of the best sushi I have had in Charlotte!! Tons of deals, great fresh sushi rolls, and noodle bowls - so even if your friends are not sushi fans there is something for them to eat too!!Best tip about this place: Cajan edamame - not listed on the menu, but unbelievable - and the sauce at the bottom of the bowl - best dipping for sushi instead of soy sauce!!"], ["Logan F.", "Terrible chefs choice sashimi  combo, mostly fake crab and shrimp hardly any good fish, can't  believe the chef would think that fake crab and shrimp are his best offerings. Since when did imitation crab become passable as chefs choice sashimi. Have been to the other location at the promenade many times and loved it. Really sad that this location is so inferior. Should not be allowed to carry the name"], ["Michael F.", "The Chicken fried rice is excellent! 1$ domestic beers on Tuesday!? You can't beat it."], ["Hugo J.", "I cant say enough about the service and the wonderful people that work here. Unbelievable atmosphere and just an overall fantastic and pleasurable experience."], ["Amy L.", "The food was ok. The service here was below average. Our server wasn't attentive whatsoever.. I don't know if he was new or he's just like that. We accidentally spilled our tea.. So instead of the server rushing up to help us try to clean it, our server and another walked by twice without even saying a word. We had to bring it up to him. The sushi here is just alright, it wasn't bad but it wasn't the best.  I wouldn't visit this location again"], ["Gabrielle A.", "Love this place. It's not fancy and it's in a strip mall but it's great. If you want casual reasonable good food then give it a go. Allison (the bartender) is amazing. She is Always pleasant, remembers your order and gets your food out fast! They have great noodle bowls(ramen yaki style with veggies is my favorite), good vegetable fried rice and their jasmine roll wrapped in cucumber instead of rice is pretty yummy too! Good miso soup, and if you need a sweet the mochi (flavored icecream wrapped in gummy rice) is sooo good! I love this little place for a quick bite, a late bite to eat or even take out! Their sushi is not the best in Charlotte but they have a lot of good stuff on the menu!"], ["Nikki W.", "Good sushi, even better price.This location is tucked in the back of the Parktowne Village Shopping Center. It's kind of dimly lit at night, so it would be easy to miss if you didn't know it was back there. Must get item: Spicy Edamame. All edamame should strive to be this. The staple app tossed in a delicious sauce. One order may not be enough for your table.Spring rolls: These were tasty, but they were all different shapes and sizes. Nothing wrong with that... just threw us all off when they arrived.Crispy Maki 101 Roll: Tuna or salmon rolled in nori and lightly fried. Topped with a mayo and chili sauce. I usually get this every time. I like that it's not too heavy for a fried roll.Professor Vu Roll: Shrimp tempura and cream cheese topped with avocado, tuna and crab salad. Everything is better with crab salad on top.Sushi 101 has some great drink specials throughout the week, but note there are no specials on Fridays and Saturdays. They are also not opened for lunch on Saturdays. Service is always good. I have never had a bad experience here. Our server Quinn was fantastic during my last visit here Friday evening."], ["Chad E.", "Sushi 101 is probably the name of a sushi place where I would eat - though truth be told, I'm probably even in remedial sushi, as when we have gone, I don't even always order sushi. Send me to detention.The good news is that the staff is ultra-friendly, and doesn't seem to mind if you don't order sushi. Hey, if they put it on the menu, it's fair game. So when we order fried rice, they didn't turn up their nose or anything.Now I get that it probably isn't their speciality - it's not like we were eating at Fried Rice 101 or anything - so it wasn't spectacular, but it was perfectly serviceable, so when we're in the mood for sushi, we'll give it a shot."], ["Heather A.", "For the price this sushi cannot be beat. In fact it's better than a lot of places that cost much more. They have a large selection of sushi as well as other traditional Asian dishes. The inside of the restaurant isn't large so larger groups may feel crammed. The atmosphere is very casual."], ["Shad C.", "The lunch specials are really good most days. The staff is still great. Speed of service at lunch has gotten pretty fast over the last several months.Defiantly enjoy going here every few weeks for lunch."], ["Mike S.", "Hello friends,Since this will be my 3rd time writing a review for Sushi 101 I'll keep it short.This is my go to place for a quick dose of sushi. Pretty good specials also. TTFN"], ["Christa O.", "My husband and I love this place.  I was pretty skeptical due to the name and location but don't let that deter you!  The sushi is fantastic and the prices are very reasonable.  Service is not over the top but they get the job done efficiently and with a smile.  I'll take that.  Drink specials are the best I've found in Charlotte.  $3 martinis on Monday and $1 beer on Tuesdays.  ONE. dollar.  Great spot for dinner or drinks after work on a long weekday."], ["Judy L.", "Sever was okay. Wasn't as attentive as he should be as a server. Accidentally spilled our drink on the table, he walked passed many times by the table, saw the mess but didn't offer to even clean up the mess or asked if we needed any napkins.  Bad customer service. And the server would need to be coached on being better with 5 star customer service. Would not return as a customer."], ["Jennifer H.", "Sushi 101 is one of the first restaurants I happened to find when I first moved to Charlotte in June, 2011 but, I have not been there until tonight. Now I'm kicking myself for not going earlier. We walked in the bar and immediately greeted and told we could sit where ever we want. It was a very casual place with a come as you are vibe.  The server was very friendly and made a point to check on us without being bothersome. I was able to ask questions and she was knowledgeable with her answers. I ordered 2 sushi rolls, salad, and miso soup for myself. My only complaint was the salad was too large and the dressing tasted like there was a touch of mustard. I would probably not order that again. The sushi tasted very fresh and was some of the best I've tried in Charlotte. My daughter ordered miso soup and nothing green and fried rice with only egg. There was no problem with her special request and the food came out exactly as she asked.I wanted to try sushi tonight, but they have different versions of noodles on the menu. One is served in a broth as a soup. For this, you are able to choose your type of noodle and the protein. I would like to come back soon to try this. Perhaps this weekend."], ["Crazy N.", "This is one of those places I would recommend all the sushi lovers to check out. From outside, the restaurant looked smaller but as we got in it looked spacious enough. I'm a vegetarian and had variety of options to choose. We have tried vegetarian lettuce wraps, noodle bowl and sushi rolls. Every thing we ate was tasty and mouthwatering. The waitress was not annoying at all and was periodically checking us about the order. I would say everything was reasonably priced."], ["Giannabrie F.", "Good Sushi, pretty fresh, nice place if you need a quick sushi fix that is reliable, consistent and basic. I ordered one of their speciality roles that had tuna, white fish, avacado and tempura crunches..it was pretty good.  The pieces stayed together pretty good which was nice and they weren't too big which was also nice!  I wish there was a bit more crunch to offset the mushy avacado but that is a personal preference.  Overall the service was nice, the food was good, the price was reasonable."], ["Candyce B.", "I was across the street in the Park Place shopping center and decided to get some sushi. Well actually, I had been craving sushi all week, and figured this was the time to try something different. I had heard some really good things about Sushi 101 and there are multiple locations so I knew that I would be in good hands.Well, I really wanted to like this place...I did but in my book it was just average. I stopped in a little after 1:30, I wanted to make sure I missed the heavy lunch crowd. Lucky for me the place was pretty empty. I scored a seat right in from by the window and was presented a menu. The menu is pretty extensive so that was very impressive. And they have a pretty good wine list and daily drink specials...whoo hoo!In an effort to \"try something new\" I got the Crispy California Roll which comes topped with napoli sauce. Think delicious california roll...deep fried...classic flavors a little bit of crunch...I really don't know what to say...other than it was just okay. I really did enjoyed the napoli sauce ! But everything else was just pretty basic. Nothing really stood out to me, I mean don't get me wrong, it was not bad by any means. It just didn't WOW me. However, service was good. And the prices are very reasonable. I'm going to give them another try. Maybe with a different roll and a drink special I'll become a fan!"]], "K.O. Sushi": [["Alex R.", "I hesitated at first giving a five-star rating to a carry-out place, but this place is 5-star. The sushi was fresh and the portions were generously cut. We ordered a selection of nigiri and rolls to go. Prices were excellent, particularly when considering the value. Highly recommended!"], ["Alessandra S.", "The other night during the torrential downpours we were craving sushi. And all of you sushi lovers know how that goes, you could not think about sushi for weeks, but the minute it pops into your head you MUST have it. So we decided to try KO. Like morons, we decided we'd walk over and get it. 20 minutes and one broken umbrella later, soaking wet, we made it back and dug in. We were very impressed!First and most importantly, the fish and all of the other items inside the rolls were very fresh. We ordered 4 of the special rolls and loved them all, especially the volcano roll - so tasty! Be aware, though - some of these rolls are HUGE! Took a few tries to fit it all in my mouth! The miso soup was, well, miso soup (can't really go wrong here, let's face it we are eating seaweed and tofu). The Crunchy Roll was also delicious, as well as the Panthers Roll. The sauces that were put on them made the roll, gave it a little kick. Prices were what you would expect - anywhere from $5 to $9 for the specialty rolls and $4 maki rolls. My only suggestion would be for them to offer more speical rolls to choose from!"], ["Mary Ann K.", "KO Sushi is one of my favorite places ever.  Doug who works days is super !  I used to work across the street and now I plan my week to make at least one trip into Uptown to get KO Sushi.  I love their Spicy Tuna - and good miso soup too!"], ["Greg H.", "The price is right and the food is dynamite.  The fact that Charlotte has a good sushi place downtown was exciting for me.  They have lots of fresh fish and they even deliver.  If you like sushi, definitely check this place out."], ["Gerald M.", "Just the other day I was wishing there was a quick take-out sushi place downtown. I saw this place on Yelp and went down to check it out. It's a small place with only two stools for seating, so you'll definitely want to get it to go or have it delivered. The selection of rolls is pretty standard, but varied enough for my tastes. The maki rolls are about 4 bucks, and their \"special\" rolls are about twice that. Maki rolls are pretty much the size you would expect. We picked up a few of those, along with a special roll -Rainbow- that was nice and plump.The quality was pretty good. The fish tasted fresh and the sauces were tasty. I thought the rice was very slightly undercooked because it was a little looser than expected, but that's really a very minor issue that will probably vary from day to day. Overall, I'm pretty happy with it. It's great to have a take-out sushi place downtown. I'm sure I will be going back there many times."], ["Bela M.", "I love this place!! After moving to Charlotte, KO quickly became my favorite delivery place. It is so convenient and fast! The sushi is always fresh (lovee the Rainbow Roll) and they even have specials! Their rolls are pretty big and you can customize them if you want (like adding toppings on a pizza). The best part is that you can order online and by the time you get home from a hard day's work, they are already at your door. I would recommend this place to anyone who isn't a sushi foodie, but just enjoys some simple rolls after a long day of work or a lazy weekend."], ["David C.", "the spicy tuna roll is really good and the fish seemed fresh. i also ordered the teriyaki chicken and rice dish and that was super good too. the portions are great (8 pieces for the roll) and a mildly hearty rice dish. the prices are great as well and i cant argue with that yo."], ["Eva H.", "Recently opened sushi take-out/delivery place offers freshly made sushi at a good price.  It has all the common sushi selection and the service is fast.  I called in my order and it was ready in 5 minutes.  I had the combo #6 for $10 (8 pieces of sushi of your choice).  I had Salmon, Yellow Tail, White Tuna and Spicy Tuna.  Slices were generous and the fishes were fresh.   It's such a great bargain.  I will definitely come back again."], ["j w.", "Take out only and you can't see who prepares the sushi.  The interaction between guest and sushi chef is important to me.  I didn't get anything."], ["N K.", "I just moved to Charlotte from San Diego, and have been looking for a decently priced sushi with good quality. K.O. is moderately price and the sushi is fresh. I like the fact that it is a take-out place. We had the Dragon and Eel roll as well as the seaweed salad. Everything was great and I will defiantly go back soon."], ["Alexis T.", "Great rolls. My favorite is the Tiger roll. Good seaweed salad. Most of the girls I worked with frequented this place for lunch!"]], "Bonsai Fusion": [], "Nakato Japanese Steakhouse": [["Kevin M.", "Very good sushi.  No wait at sushi bar on a Wednesday night.  $21 combinarion platter with 10 pieces sushi and an 8 piece sushi roll, and another $7 for an 8 piece spicy tuna roll.  I like to rate how good a sushi place is by how rubbery the octopus is, and for some reason they love to include it in combo platters. .. this was perfect, ie, not a piece of hard rubber.I will be back."], ["Frank K.", "I'm here in Charlotte on business and happened to just find this Japanese restaurant by accident and thought I would drop in to satisfy a hankerin' for sushi and sashimi created by my wife sending me awesome sushi pics from a restaurant in Austin today. Heh heh I haven't been compelled to write a review in a VERY long time....so either this is good or bad....unless you spaced and didn't notice the actual reading, I won't spoil it for ya. Also, I don't feel it is really needed to caveat this, but just to put this review in perspective - I am half Japanese, born and raised in Japan....so I kinda know a little bit of what to expect...just a little.  ;)I popped in on a Tuesday night, around 7:00 pm, nice decor, seemed to be busy for a mid week night with friendly service folks. I elected to sit at the sushi bar and found myself to be the only customer at the bar. As I walked up to he bar, I looked at the fish in the cooler and immediately wanted to leave. The color of the various fish was off(as in obviously NOT fresh) but alas, blame the wife...I was determined to find some decent home country fare. I immediately noticed how unfriendly the sushi \"chef\" was. No real greeting and I sat in silence until a waitress arrived several minutes later. Ordered a Sapporo draft beer and started looking at my \"wish list\" of sashimi and sushi. I checked off the seven piece sushi dinner that also comes with a California roll($18) and also added a four piece sashimi of yellowtail(for $10) and a four piece sashimi of white tuna/escolar(for $8) and handed my sheet to the \"chef\". As I contemplated what hashtags to use when I undoubtedly take a pic of my dinner for Instagram and sipped my beer, my dinner was presented forth to me several minutes later (which I initially appreciated the quick turnaround) and I was again IMMEDIATELY disappointed and realized there would be no Instagramming after all. :( The dinner came on two plates, sushi on one and sashimi on the other. What struck me so quickly was how THIN the sashimi was cut! When I mean thin, I mean thin enough to see THROUGH the slice! Seriously, wtf??? I was OFFENDED. This \"chef\" is blatantly trying to rip people off. The whole point of sashimi is to enjoy the flavor of the fish without rice...how in the hell can I taste any fish when it is like 3mm thick??? Not to mention, the slices were sitting in little pools of water, which means these \"cuts\" of fish had been frozen for too long. Seriously. What. The. Frick. smhThe sushi platter was no better. Sloppy California roll(I freaking hate it when they include the ends of the roll!!) in some weird, rounded triangle shape that barely held together.  The sushi themselves had thicker cuts of fish and was presented better, but again, I was struck by the color of the fish. It came with a tuna, shrimp, salmon, eel, squid(I think...it was weirdly soft and not \"crisp\" as fresh squid would be and I couldn't tell by the taste either), seabass and one more I can't even remember. The tuna had a dull, magenta color(indicates it is old) and had no taste. Neither did the salmon or any of the other pieces have any taste, for that matter.  The shrimp was very dry and the other pieces lacked any.....texture. If you have enough experience with sushi and sashimi, you will know what I mean by \"texture\". Horrible, irresponsible old cuts of fish. None of the fish had any taste and these cuts, when fresh, have a VERY distinct differentiating flavor between them, but not tonight. Not here. The four cucumber pieces had the most flavor out of the entire meal....at least they were \"fresh\". Some of you may find this review overly harsh, but I write this specifically to share what to look for for those that do not know any better. It PISSES me off to NO END when individuals run a \"Japanese\" restaurant that is wholly not representative of my culture or the quality expected. I am a proud half-Japanese man and I take offense to those that misappropriate my country's culinary culture to just rip people off who are unsuspecting or those that do not have the experience to know any better. As for any other food offered at this establishment, I cannot comment on. However, if you are contemplating sushi and/or sashimi, take your hard earned money to an establishment that strives to do better for you and offer you a genuine Japanese culinary experience.....neither of which this restaurant is succeeding at."], ["Ben S.", "I've been to a good number of these places because they are pretty popular for group dinners in conjunction with meetings and training classes.  Of the ones I've tried, this place ranks in the bottom third mainly because the staff was pretty unenthusiastic (except the bartender), the performance aspects were lacking and the food was uninspired.  It doesn't help that our chef was something of a slob and didn't try very hard to do a good job with our meals.  Sauces were strewn across the table.  A co-worker who is allergic to shellfish had the shrimp appetizer deposited on his plate anyway.  Another co-worker who ordered a combo was given the wrong food.  One of my scallops was accidentally thrown into the mayo-based dipping sauce due to how the chef was slinging hash.  The grill cleaning portion resulted in a significant amount of scrapings leaving the cooking surface and landing on the table surface.  Etc, etc, etc."], ["Mike K.", "I had plans to meet a friend for dinner and this is the restaurant that he picked. Despite living in the University area for almost 5 years now, I had never been to Nakato. Nakato offers Teppsn Yaki (hibachi) and Sushi. My friend and I were both in the mood for sushi so we did not sit at a hibachi table. The sushi/non-hibachi section is a decent size. It has a full bar with seating and then probably about 6 table/booths with seating for 4 at each. Obviously hibachi is this restaurants main selling point which is always a cause for concern when you order the sushi whether or not it will be any good. I've been to other hibachi places that also offer sushi but it seems more like an after thought and isn't that great. However the items we ordered from the sushi menu were great! Off the sushi appetizer menu I got the Hawaiian poke salad with tuna and the tuna carpaccio. I visited Hawaii last May and fell in love with poke. While it is definitely better in Hawaii this salad had a a good flavor. The tuna carpaccio was also delicious.  I also ordered a sushi roll. The rolls here aren't that special or creative - again I think it has to do with the fact that hibachi is its main attraction and the sushi is more of a secondary menu item. My friend ordered  the sashimi Omakase and the sea urchin. He was excited that they actually had the sea urchin. He told me other restaurants that list it on their menus often tell him they do not have it in stock.The parking lot is a little strange, especially if you get brought in the back. The outside decor is pretty stark and bare for the most part. You might drive right past it. The inside is very nice and clean. While the sushi was nothing special it was fresh and delicious. If you don't want anything fancy or into sashimi and nigiri Nakato is a great option. I am glad that I finally found this gem in the University area."], ["Paul D.", "When we walked in was a bit concerned looked huge and empty... Guess it gets busy end of week. We ate a sushi bar.  They did not have all items available but the sushi was good and reasonably priced. Service ok."], ["Jennifer C.", "I went to Nakato today for lunch for the first time ever based on the sushi reviews and the proximity to my job.  I got seated immediately as their lunch rush was pretty much over.  My waitress was prompt and efficient without being annoying.  She kept my water full and remembered the lemon which is always a plus.  I was disappointed in the sushi menu.  There were not a lot of special rolls or variety.  Shame on me for going to a hibachi place for sushi and believing all these best sushi in Charlotte reviews.  Get out people!  There is MUCH better sushi in Concord and Charlotte.  I ordered the fantasy roll and the hot twister roll.  The fantasy was simple and fresh. I prefer soy sheet so it was nice to see one on the menu.  The hot twister was ehhh.  I knew better than to order a fried roll as I like cold sushi.  I really could not taste anything in that roll except the batter.  Overall, it was just ok sushi.  If I come again, it will be to try the hibachi."], ["Melissa D.", "I stopped in here while staying at the hotel next door on business. Ordered a seaweed salad, shrimp tempura app and one sushi roll. The seaweed salad had great flavor, the tempura was good as well. The roll was nothing fancy but had real crab in it and the avocado was perfectly ripe. Service was quick, I was in and out in less than thirty minutes. Will be back if I stay in this neck of the woods again."], ["Sarah M.", "Had a wonderful time. Food was delicious, the waitress did an amazing job and the chef was very entertaining. Great evening!"], ["Peter M.", "I like the style of Japanese steakhouses, and this place doesn't disappoint.  Went with a family of 6 and all had a good time.  Ordered an appetizer but the timing of its delivery didn't mesh with the rest of the meal.  Only ding I give is for my family having 4 kids they do the \"automatic gratuity\" thing that only serves to lower the total tip I give.  This is a practice that needs to die or get a more reasonable threshold."], ["Mike W.", "Good food! The energy wasn't all there when cooking! The filet was very good! Overall the restaurant was very clean and friendly. I'm used to high energy cooking by the Chefs in Fredericksburg VA! They interact with the guests a lot. It may have been just an off night though."], ["Megan B.", "I was super disappointed with my trip here.I got the filet and scallop lunch which ended up costing about $20+ dollars. The waitress didn't remember my friend wanted shrimp AND chicken... Also didn't remember my other friend wanted steak. Two of us said we didn't want noodles so she didn't give us noodles or veggies...my steak was cooked well done not med rare as I ordered. My scallops were extremely overcooked. I had to go to bathroom and spit it out it was so hard. Not worth the money. There are cheaper options that taste way better (ie Toyama)"], ["Paul C.", "Good sushi. Didn't get the Teppan Yaki (chop chop) food....didn't want anything too heavy before my French class! Got the Hawaiian Poke Salad as an \"app\" and it was very tasty....Then a \"Panther\" roll which featured Tuna, Eel, cream cheese and avocado with some crunchy \"stuff\" up top, drizzled with their Eel sauce (by the way, just what the heck is \"Eel sauce?\")???? It's yummy nonetheless. Check out the pics. Recommended. I've had their chop chop stuff at the Pineville location, and that too is quite good. Overall a good place to grab some chow!"], ["Donald V.", "I'm deathly allergic to Mushrooms and Carrots. So they said that they would cook it in the back, so there is no contamination. They brought out my salad... It had carrots in it. Then they brought out my fried rice. It had tiny bits of Carrots in it! The chef Tuan, he Noticed it ! It wasn't the Display Chef's fault! In fact I applaud him for his vigilantes!"], ["Peterson L.", "The food here was really good, especially for the amount that they give you. We all left with leftovers and that's saying a lot because I almost never leave places with leftovers lol. The restaurant itself was nice and has plenty of space inside. The staff was helpful but took too long with our drink orders. Overall, a great laid back hibachi spot to get some good food"], ["Denise L.", "A Benihana like restaurant near our hotel and where we dined for a team dinner on a week night. They do not seat you until your entire party is here, but sink into one of their leather couches in front. You will not want to get up.Our party of 16 or so sat at 2 grill tables, circled around. I knew off the bat I didn't want teppanyaki, so I asked for a sushi menu. I started with the hawaiian poke salad (mix of salmon and tuna) and then two rolls. The 49'er roll (ode to the SF Niners) which was a CA roll with smoked salmon, spicy aoili (fancy word of spicy mayo) and scallions. I also went with another typical favorite roll of mine, the Rock N Roll, a crunchy roll with spicy tuna and smelt roe on top. Everyone was served salads and soup, and I also had a nice bottle of hot sake. Although I prefer cold sake, this one hit the spot. Service was great, but when the show began, we were definitley at the dull table. The other cook put on a fun and exciting show, doing tricks and everything you would normally see. Ours was...the quite opposite. When I asked him where our fun show was, he did a volcano thing with the onion, and THE END. The hawaiian poke salad was okay, too much sauce that was overwhelming. The rolls on the other hand were delicious! I was surprised at the freshness of the fish, and I liked how they didnt clump so much rice on the rolls. And surprisingly I was still hungry! Usually I can barely eat two rolls, but I was still wanting more! I decided to order another, the Spicy Snow, salmon, cucumber, and jalapeno. My coworker and I also shared an order of 4 pieces of fatty tuna. That was amazing, but for $32, the slices were awfully thin. Everyone seemed to enjoy their teppanyaki, and the noodles were good too. They do seem to cook their steak very well, so tell them your liking if you prefer it more raw.My roll took forever, and people were wrapping up so I asked for it to go. It was delicious but the jalapenos were HOT! After one burning my lip, I had to take them all off.We had two birthdays and I asked them for their options. Ice cream is free, but a birthday cake, song, and photo was $10. We opted for the latter, and the birthday gals enjoyed their treat. The cake looks almost home made, but maybe store bought. Its a good size for about 6-8 people, and it was really light and delicious! Overall, a great experience! Would come back again for the sushi! Service was great in the beginning but as more and more diners came in, it seemed harder to get a hold of the waitresses. I do appreciate them turning on the channel for the A's/Tigers game for my avid A's fan coworker."], ["Jacqueline A.", "This is our fourth visit to Nakato's and this time we were mostly pleased with our meal. Previous visits have been hit and miss. This visit was more \"hit\" than miss.For appetizers, we started with miso soup and baked scallops. To not be jumbo scallops, they were quite pricey, but the flavor was good. We got 3 scallops for $4 a piece. That was a bit high. Next, we had the Gyoza. The Gyoza could either be pan fried or deep fried. The waiter didn't ask which my husband wanted and they just brought deep fried which he thought were \"ok\". We ordered the baked mussels which were good, but my husband didn't care much for the mayo topping. Next, they brought our sashimi plate and a spider roll. The mackerel, eel, hamichi and salmon were fresh and we were quite pleased. The sashimi was the highlight of the evening. However, the spider roll was smaller than we expected. The size was not what we had in the past.Lastly, I ordered a small shrimp hibachi plate with vegetables and garlic noodles. The vegetables were lukewarm and it was as though the plate sat for awhile before it was brought to the table. I probably will not order that dish again.We like Nakato's. It's a good spot to go to when you want some good sushi in the University Area. The sashimi is fresh and the presentation is somewhat artistic. Some menu items are just \"ok\" and others are a bit pricey for the amount that you do get."], ["Shannon K.", "Food was great!  Service excellent only bad part was our chef was so boring, didn't talk nothing!  You pay for entertainment too not just the food! First time there I would go back but ask for an entertaining chef"], ["Christina W.", "Food was delish.  We had the seafood combo which included salmon scallops and Shrimp and the Filet Mignon and Shrimp.  All dishes come with soup, salad, shrimp appetizer noodles and rice.  Great food at economical prices. Will definitely be back."], ["Kia L.", "Love this place. The food is always delicious. And you won't be leaving hungry. With entrees you get onion soup, ginger salad, white or fried rice, mixed veggies, and noodles. I always substitute the salad for an extra soup which they have no issue with. I love that. We always end up here on someone's birthday, and when you tell them they song in English and Japanese and you get a cake and a photo! Anyway...go here if you're looking for a good hibachi place!"], ["Tiajuana T.", "Went here today for lunch. Only tried the sushi bar this time, sushi was amazing.  The onion soup was good too.  The waiters were nice and attentive but not to the point of being annoying.  From the sounds coming from the other side the chefs were great.  Will definitely bring my kids back to try it. Gave 4 stars instead if 5 because the frozen drink that I got was weak."], ["Joan H.", "Never again!    We had a party of 9 and we had to wait for all to arrive.   Our reservation was 6:30, by 7:30 we were told we had to wait another 30 minutes because there was only one chef.   Really!   Ending up leaving and going to TGIF.Sorry I won't recommend."], ["Leesa D.", "Oh, no!!  Maybe I'm spoiled but what is a crab stick??  There is no hamachi Kama sushi, only grilled. Does that make sense?  The food doesn't have any flavor. The sushi guy has major attitude. The sushi is not worth your time. How do you screw up shrimp tempura appetizer?  I know.. Don't cook the vegetables long enough so you're biting into hard vegetables. And the shrimp you can get as Costco for cheaper. This is a pass!!"], ["Louis M.", "We sort of liked parts of Nakato, but thought the overall picture didn't really add up.The sushi was good, but was served very late in the meal, despite being ordered first thing. One of the pieces I received was totally different from what I ordered. When the waiter fessed up, I was still charged for it. That is the type of restaurant this is.The show was not among the best I have seen, and the chef looked like he was not really interested in the performance. The food was VERY salty, with everything getting a healthy dose of soy sauce. The portions are quite large.  The soup was watery, and did not have the obligatory fried onions, the salad was typical ginger dressing, but not sweet at all. Our meal was quite expensive, well over $100 for the 3 of us, not including tip.  Ultimately, we feel this restaurant is yet another lame ripoff of Benihana, which is better, but no longer among the best of these restaurants either in my opinion.We would not go again, having experienced far better. However in the current climate in Charlotte, this restaurant will probably be around forever."], ["Pete C.", "Nakato is wonderful. We went here for my wife's birthday and it coming from South Charlotte it was well worth the drive. The entrance has high ceilings and an overall great atmosphere. Had the hibachi and it was dinner and a show as the chef was very good at making a delicious dinner but he was very funny as well. The portions were good, the fried rice was great, and my standard steak and shrimp was all I could ask for.We had a great time and we will be back."], ["Selene R.", "Very Good food, but... Maybe making it for so many people at the same time doesn't let the food cook throughly, still very delicious and fun place."], ["Chris O.", "Tremendous! First time here, the restaurant itself has a nice open feel to it when you walk in, we sat at the sushi bar. The staff were all very friendly and attentive, the ginger dressing on the salad was different than any other place I've been (in a good way), miso soup was good... sushi was awesome! Next time I'll have to try some of the specialty rolls, they looked GOOOOD.Prices are fair, it's not the cheapest sushi around but the quality is there which is more important (to me) than price. I'll be back for more.... :-)"], ["Aishah S.", "WE went for sushi, and sat at the sushi bar on a Saturday night.  The sushi list was long, but kind of repetitive, and a lot of the rolls had the same ingredients.  The rolls we did get were fresh and were made quickly.  To supplement the lack of rolls with various ingredients, I ordered nigiri.  Honestly, this is hands down the best sushi place in the University area.  Kabuto doesn't seem as fresh and any other place is whack.  Ru Sans will forever wear the sushi crown in Charlotte!"], ["Jessie W.", "Just went for sushi. Superman roll was good. Overall I would prefer Pisces or Ru Sans, but this place was nearby and it did the job. Service was also good although it wasn't busy at the time."], ["J T.", "From out of town and this was my first visit and I enjoyed the food. We had a fun cook which was also nice."], ["Aaron F.", "Excellent food! We enjoyed that they are one of the hibachi places that actually uses the ginger sauce on the side to dip with. The early bird special they currently run at $13 for a chicken and steak combo is an amazing deal too. They also serve noodle as well as the normal fried rice."], ["Sheena G.", "I got take out. The sushi was edible but by the smell of it when I first took it out of the box, it was not as fresh as I would like. There is not much of a raw roll selection.I am used to more creativity in rolls and this place was lacking. I'm new to the area and this is the second place I've tried for sushi so far.It's in 2nd place out of two. And it's pricey!"], ["Bruce K.", "Lets just say... This place knows how to cut costs! I know that the economy has been hard on everyone, but whoa. I commend this restaurant for taking actions to minimize the amount they spend. This nice restaurant I believe sunk $5 million dollars on the property. Now, I'm going to update my review from my 2011 review. And the outcome, as you can tell by the stars is ummm... not good.Now, lets start off by the menu. I came with a party of 5 and we all got seated down at the hibachi grill. Menu is pretty standard as far as hibachi grill food items goes. I came to Nakato because from word, the owner owns a farm out in Colorado and farm raises all the animals and also their freezer blast freezes their seafood. This is an important fact because when you blast freeze seafood, it's usually 50 or more below 0 degrees Fahrenheit keeping the seafood fresh and bacteria free. So, this was definitely a reason to try this restaurant out.So, lets get back to the menu. Looking at the items something pops out. Fried Rice..$1.75. So, fried rice doesn't come standard with the meal that costs $15+? Steam rice on the other hand is free (which I picked). I ordered the combination of Chicken and NY strip. My party all got the fried rice when it was asked because they were under the assumption that it came with the meal, and I'll break down to you what that fried rice consisted of.Fried rice: Eggs, Sesame seed, and Soy Sauce. That's it. No green onions, carrots, and all that other good stuff. On top of the lack of extras with the fried rice it had no taste. Bland.Meats that I ordered weren't bad on the other hand, but the portions were a little too small in my opinion. Their noodles that also came with the meal wasn't filling, and just left me a feeling of not full but at the same time not hungry. And mind, I ate two of my party's portion on noodles.We also had some tempura. The tempura, I had no taste for it. I've definitely had better. The batter had no taste, as well as the sauce. The veggies that was served in the batter surprised my mother, which found out it was just a whole half of an onion dipped and fried in the tempura. She also wanted to tell me that what made it worse was that the onion had no flavor, the batter, and on top of all that the sauce!Finally lets get on with the end when we pay our bills.Sitting with us at our grill was another party of 5, 3 kids and 2 adults. One of the child's birthday happened to be that day. So, you usually get a dessert, or a cupcake, or some ice cream right? Not here! This lucky girl got a nice candle, in a sauce dish. Well, they did sing the birthday song to her.But wait! That's not it! The table sitting directly across from us also had a birthday. So, they take the candle the little girl just blew out and lights it again to give it to the other birthday person. Mind, these meals cost I believe $15+. Easily.Way to cheap out your customers there, Nakato. Charge extra for fried rice that's bland, and some pretty expensive dishes, with no complimentary birthday dessert. Now, that's how you run a business: Cutting costs, and try to recuperate losses."], ["Donald R.", "Me and wife love this place. It is our favorite Sushi place. Love the atmoshere, the decore, the staff, the hot towels, and of course the food. They have a beverage and a sushi bar. This is also a Japenese Steak House, but we mostly come here for the sushi. They have 16 Teppanyaki Tables in the main dinning room and 4 more tables in private roomd that you do not need a reservation for, but you have to take your shoes off and sit on the floor."], ["John M.", "In the style of Beni Hana but a little \"up scale\". The seating and service was prompt and courteous. The food ( steak and scallops) was totally delish.  In a departure from similar restaurants, noodles instead of bean sprouts were served with the vegetables. Next time I visit Charlotte (from the left coast) this place will definitely be on the itinerary!"], ["Jon C.", "I'd give this a 3.5 only due to lack of rolls. Sushi (nigiri) was great,but I like some crazy rolls on the menu.  Had one that was good but not a huge selection.  I'll be back.. It's close to the hotels so easy walk."], ["Joe S.", "Very pretty restaurant.  By far the nicest ambiance Japanese steak house in the clt area.  Food was quite good also.  Service was excellent.  Sushi menu was quite varied for a steak house.  Overall and excellent experience."], ["M.dayanara F.", "Yumm!! Don't forget Sushi!"], ["Khemary S.", "This place used to be good. Keyword used to be!  The fried rice was over done by garlic and if you love garlic you would understand why I didn't like it cause I love garlic. It was absolutely too much. Nothing else complimented it. Short ribs were horrible we didn't eat it and still was charged for it even though we told our server it wasn't good. Service was fine... But I think their hibachi isn't worth the money. The chefs can hardly entertain!!!  Anyways. Good luck on you're trip."], ["Stephanie T.", "I brought a co-worker here for a business dinner while in town and thought it was great. We had some downtime when we first sat to talk about work and then enjoyed a great, reasonably priced, hibachi. Portions were abundant."], ["Terri W.", "I have to say overall I am not very exited about this place. The ambient is not so bad,  a lot of tables and the waitress was cute. ... About the Shusi... ;) Got Vulcano, Tuna and Superman roll. The Miso Soup was hot but the taste only average. You could get the Kirin beer only as draft when you don't want to drink the 12 oz bottle. I am not why draft beer has a frozen foam...The rolls were as well nothing exiting average again someone said something about pricing and it is right 38$ is not ever age... Would I go again!? I might but will look for different places as well..."], ["Lauryn C.", "On my way to a movie in Concord and I was craving some sushi....I thought of Nakato I had been once before for lunch and remember it being pretty good.  I've never eaten the hibachi - but they have a decent sushi bar, prices are a little high, and they lack on selection when it comes to rolls.  I really enjoyed my miso soup, and tuna tataki though.  If i'm in the area I'd come back but I wouldn't drive out of my way."], ["John S.", "If you want a little entertainment mixed with your meal, this is a good place to go.  This is a teppanyaki place, meaning they cook your food on a big cooktop right in front of you.  Think Benni Hanna if you're familiar with that chain.The food is good and the service is usually pretty good too.  The one down side here, as far as service goes, is they don't start cooking until they fill up the cooking area, which if you go with a small party might add a few minutes or more to your way.  At least that was the case the times I have been.  The regular order I have is chicken, which comes with a clear broth soup, white rice and veggies.  The soup comes from the kitchen first, but everything else is cooked right in front of you.  They also serve several sauces, which are tasty combined, by the way.  You can get the same thing with steak or shrimp instead of chicken.  For dinner the same meal also comes with a few grilled shrimp regardless of what meat you order.  They serve it as sort of an appetizer for all dinners I think.Overall, it's a good place for some light entertainment with your meal."], ["Marie A.", "Good average Japanese steakhouse for hibachi but this isn't Benihana...at all.I went to this location after seeing all of the reviews on yelp, which were mostly positive but I saw a few things wrong.The hosted greeted me and my date immediately, and got us seated quickly since it was a Monday night and virtually empty except for the hibachi area, which was what I came for.Seating is wierd here, they had half empty hibachi tables but insisted on putting me and my date at an empty table. Part of the hibachi experience is the show, which is usually better when their are more than two people at a table of eight!!! People trailed in the door but only a group of three were sat at our table and at the other end...what?The food made up the bad seating, I had the Nakato Delight, and chose the NY strip instead of the filet. It was great....steak was cooked perfectly, shrimp not overdone and the chicken was tasty. The hibachi chef was in good spirits, although he gave up on the entertainment portion of his job since the group of three across from us were ignoring him and kept talking amongst themselves.This Nakato has a nice albeit dated interior, but much better than the run down Kabuto on Pineville Matthews. The prices were in line with most hibachi places, 18 for chicken and around 22+ for combos. And you will have leftovers for sure!"], ["Mary M.", "love it here! esp the early bird special chicken and steak if you are there before 6pm!"], ["Rebekah P.", "For those of you who have been to Nakato before you know that it is separated into two rooms, the sushi bar and the grill room where the chefs cook the food for you.  My experience here has only been in the sushi bar, and it was a pretty good one.  The sushi itself was very good, fresh and really big.  It was a mouthful to eat a whole piece.  Plus I'm beginning to think it's kind of hard to mess up spider rolls, but then again I may just be spoiled.  Then there was the udon soup.  It was really good, but not any better or worse than other udon I've had.  I was kind of impresses that they had one of my friend's favorite foods, inari, that came with the soup."], ["Sam S.", "This place is GREAT! I can't wait to go back! Went with my boyfriend on a Sunday evening, we ordered the Pacific Fried roll, the Superman roll, teriyaki chicken, teriyaki squid, and a side of rice. Both of the sushi rolls were AMAZING, seriously some of the best sushi I've ever had! It's obvious they have a very experienced sushi chef. The staff was friendly but they did switch off a little and got our teriyaki squid confused (we ordered it cajun and it came out plain). The restaurant itself was very beautiful, minimally designed and very open and bright, and they bring you hot towels before your meal. We sat in the sushi bar area and it was very quiet and peaceful, even though it is next to a cook-in-front-of-you performance area. From what I overheard of that, it sounded a lot less obnoxious than some other Japanese steakhouses I've been to where the chef is more concerned with cracking jokes than cooking food. I did not get that vibe from Nakato and cannot wait to go back with a group and sit around the grill. Very satisfied.Oh and PS, this would be a great place to take a date! Sit in the sushi bar if you want a more intimate, relaxing evening or sit around a grill if you want a more exciting night!"], ["Amanda B.", "This is the best Japanese steakhouse I've ever been to in a long time. The food is outstanding, the wait staff is friendly and accommodating, and the seating doesn't make you feel like you have to rub elbows with your neighbor. The place is divided into 2 sections. The hibachi grills and the sushi bar. You have a choice of sitting in chairs at the hibachi grills or going into 1 of their rooms where you have to take your shoes off and sit down on the floor (they provide pillows). I haven't had the chance to sit on the floor yet, so I won't include that in my review.You make your selections off the menu and have some time to sit and chat with other people at the table. Their iced tea is always perfect (whether you get sweet or not), and your glass is always full. The 1st items to come out are the ginger salad and soup. I normally pass on the soup, but I love their ginger salad. It's not over powering with ginger like most dressings that are in this category.Next comes the appetizers and sushi. I would recommend the calamari steaks (but don't take left overs home, they don't save well) and for the sushi, try the one that has \"Pacific or Pacifica\" in the name (sorry, I can't remember what it's called). Every time my husband and I have their sushi, it's always fresh and tastes wonderful. The entertainment begins when the chef comes out to cook your meal. I like how they confirm your order and they pay special attention to any modifications that you've made to your order. This part is great for kids. They cut the tails off of the shrimp and throw them in their hat, light an onion stack on fire and make a train noise with the spatula, and they do an egg roll before throwing it in the air and breaking it in half on the spatula! The meal portions are reasonable and get extra shrimp sauce (it's the pink stuff)! Of course, everything is nice and hot when it hits your plate and fresh because it's cooked right there in front of you. On my first trip there, I was pleasantly surprised that I wasn't hot from the grill (yes, I've been to some places where I was sweating when the cooking was finished).If you have a birthday, this is a great place to go! You get your meal like always and they give you a cake (that is so sweet, your teeth will rot with 1 bite), they sing to you in Japanese, and you get your picture taken and it is framed (a paper frame, but hey it's still cool lookin).I can keep going on and on about how great this place is. I will keep going back until they close! I do have to point out, if you're not careful, the bill can get a bit high if you keep adding all the goodies they offer. If you want a good comparison, go to Kabuto's and then Nakato's and you'll see a huge difference."], ["Tracie S.", "I love Nakato!  They always have the freshest sushi, and I love the variety of special rolls.   I have never had a bad experience here.  The staff are fantastic as well.  This is the place to go if you're in the University area!"], ["BJ S.", "Domo Aragato for Nakato!!!!Yum is all I can say!!  Walking in to a grand foyer to be greeted by friendly hostess' and a minimal wait for the hibachi!  SO we mosied on over to the bar and made the decision to hit the mai tai!  Something fantastical about that drink!  LOL...  Once we made it to the hibachi grill the waitress took our order,being vegan I asked if they would be able to avoid the egg in the rice, once I said that she immediately offered all suggestions for me to eat!  I was shocked at the offering, usually not a normal approach from the wait staff!!  The MISO soup was by far the most flavorful that I've ever had!  It was flavor explosion in my mouf! (that's right... I called it a mouf)...  The vegetables with tofu were phenomenal as well and the pricing was moderate, moderate high, but for two full meals and a round of drinks for half the gaggle (two people) it was right on key... about 50 bucks or so!  Take your friends here if you wanna impress them with one of Charlotte's finest!  hands down 5 stars!  Can I throw in a comet!  Cuz this place is outta dis world!  :))"], ["Terry S.", "Great great great!  That's how I would describe my experience at Nakato.  The service was great, my fellow vegan yelper was told all about menu choices by are waitress, something you don't often get at a restaurant.  The drinks (Mai Tai's) were delish and very strong at that!  What made the dinner though, aside from the great company, was the food itself.  The soups and salads were amazing, the chef was fun and efficient.  I had the shrimp and chicken hibachi combo - and I honestly had no complaints...you get fried rice, a salad, soup, noodles, and the shrimp and chicken - it was sooo much food!  The sauces they provide are tasty with free refills, and the chef was on top of it the whole night.  If you are in the university area and are looking for a really nice Japanese hibachi grill, Nakato is definitely worth a trip, I certainly will be back!"], ["Steve and Kasi D.", "We stopped here last week to try the sushi. Nice atmosphere and the staff was friendly. We ordered a special of the day roll that we cant remember the name of and also a rock-n-roll. The rolls were fresh and good. An average place for sushi. We rate it A-Ok..."], ["Todd W.", "Should have put the elastic band in the jeans before coming to Nakato...good lord! Located only 15 minutes from Uptown in the University area. Wife had a hibachi craving, and fellas, we all know how that goes...best to say, yes dear and ask where, and the \"when\" is immediately. Not going to lie, I'm glad it was hibachi and not ice cream :). You walk into Nakato and are greeted immediately. We made a reservation so we checked in and got a buzzer. Only strange thing was the 2 story lounge/bar area and the TV's in odd locations. No worries, just grabbed a spot on a couch while we waited. Only 2-3 minutes. Upon being sat, our waitress came by right away and she was very nice. I can tell they take their service commitment to heart. The menu is extensive with hibachi offerings. They also have sushi, so if you want that make sure to ask for that menu too. Went with the \"Nakato Delight\" which came with shrimp, chicken & NY steak for $23.95. Most of the entrees (combo) are around $20. For extra items or premium like filet or lobster expect and extra $5 or so. Also went with the fried rice which was $1.75...kind of annoying, but no big deal, as I like egg in my rice. Came with onion soup, salad w/ginger, shrimp app (small), noodles & veggies (surprised variety!), rice and of course the meat. I was doing fine on my \"timing\" until the the noodles & veggies came. Soup and salad...gone, no problem. Then a FULL plate of noodles/veggies...as I'm eating, I see the rice start an say oh \"SH&T\" and start to eat faster while my wife watches and is content letting her plate rise with goodness and not concerned about \"timing\". Little did I see/know as I finished shoveling the noodles/veggies that the rice had their own separate bowl and did not need a place on my plate...ha...oh well, there was room if needed now! Overall a great experience and for $20-$25/person average, so much food...can you say leftovers! As we got up to left I said to the table \"nice shoveling with all of you\". Not far from the truth...ha! So good!"], ["Hungry C.", "I really enjoyed the hibachi but have not got the chance to try there sushi yet. They are fast and the food is great. The cook was friendly and my meal was great and everything id expect from a hibachi restraunt. Its a little pricey but all kinds of places this style usually are but all in all its a good eat"], ["Rick M.", "It's ok. A bit pricey for what you get. Chef hardly spoke."], ["Mike O.", "This place is really nice and the staff were all very friendly.  We stuck to the sushi bar side and everything looked and tasted very fresh.  While I stuck to my regular standards, they had a very good selection.  I really liked this place and expect to return whenever I am in town for business."], ["Garrett G.", "Quick! Slice it up, dice it, throw it in the air, and juggle that food!  Light it on fire, put it out!  Alright calm down and relax, cherish your shrimp sauce, hell let your food take a bath in it.  Now throw back some saki and order another course.  Nakatos is an exciting food experience, I love coming here on my birthday or when I come across a nice stack of cash.  The wait staff is so accommodating and friendly, they enjoy their work-and you can tell.  Sometimes I was seated across from complete strangers, but it wasn't awkward or uncomfortable at all; everyone is so happy to be here.  You will be too."]]}