{"Thai House At Tower Place": [], "Thai Taste": [["Sherri M.", "Every time I come here I'm amazed at how delicious the food is. I haven't had a let down with anything I've ordered to this day. Thai chicken is up there with my favorites and the soup they serve you with dinner, out of this world. I've been guilty of walking over and getting the large order to go. It's a great quick lunch if I don't really have a break and I'm hungry."], ["Corey Tess T.", "Fast, well-priced, no-frills.They bring you soup as a starter as part of their service and the food comes out so fast it will make your head spin. Great for a quick lunch option. Our office is one street over, so we walk over here every now and then.Good flavors - again - nothing posh, but simple and tasty.Another plus, is there is hardly ever a wait - you get seated right away. Noodles, Pho, Soups, Curry etc. You will find it here."], ["Nick M.", "Very authentic and delicious! Highly recommended and priced more than fair! Great spot for locals, and you will feel like you're in Thailand!!"], ["Nicolette H.", "I was not impressed with the overall amount and quality of food. While everything tasted fine, nothing captured my attention enough to come back."], ["Jorge N.", "My wife and I visit this place almost on weekly basis either sit down or take out.  We cannot get enough of their Pad Thai. It is full of flavor great portions. Their souls are great and we love the spring rolls."], ["Koli D.", "My boyfriend recently introduced me to Thai food.  The Pad Thai and Pad See Ew are amazing!! I love this place.  I don't believe the are open on Sunday's which is a bummer but great Thai restaurant."], ["Paul C.", "First tine here. Had their daily special Thai Taste Chicken, which was crispy chicken breast pieces over broccoli and lettuce. The key here was that the chicken WAS crispy. And tender! And DELICIOUS! A little more sweet than heat but enough heat to cause the occasional sniffle.I just had to also order their house Fried rice. I opted for beef as I already had a chicken dish. This was decent but not nearly as good as the chicken dish. I had to add a little soy sauce to bring out the flavors. But it WAS good. I guess I've eaten at so many great Thai places around the Continent that my expectations were a tad higher.One criticism is the lack of a decent wine list! With Asian food they should have some semi sweet whites by the glass to choose from. They didn't, unless you count White Zin in that category. I don't. A simple Cali Riesling or German Spatlese would work.Overall Thai Taste did not disappoint! I will definitely be back to try their more traditional Pad Thai dishes that everyone raves about! Based on what I had I'd definitely recommend Thai Taste."], ["Giannabrie F.", "I like Thai Taste but I don't know that they are the \"best\" Thai restaurant I have ever been to.  I have visited the Matthews location as well and I was not very impressed.  The pad thai tasted fishy and the spice they used completely overpowered the other flavors.  So it was basically fishy cayanne.  Great!Ok, I know this isn't about the Mattthews location but I had to preface this review by letting you know the experience I had at their sister location.  So, I tried the pud see ew.  I think the \"ew\" pretty much describes the dish.  Others recommended it so I went for it.  Big Mistake.  It was basically salted noodles with a couple pieces of broccoli.  I added shrimp and they were super fishy.  It just wasn't good.  My friend tried the green curry and that was pretty good...heavy on the coconut but it was decent.  My other friend tried something that had tofu in it so I didn't even try hers.  :)The wine was served in these little dessert wine glasses that I couldn't even get my lips around--odd and not enjoyable.The service was good, the atmosphere was simple, the prices were decent but I just am not that thrilled with the quality of the food.  I know for some reason it is just me but I just find it to be ok."], ["Steve C.", "I have lunch here weekly. Thai Taste is one of my favorite restaurants. I also occasionally eat at the University location. Both locations have great food. Also, the soup that comes with lunch is delicious. My only complaint is that they are very busy at lunch time so sometimes you have to wait, but the food is worth it!!"], ["Katie I.", "Normally if a place isn't good I wouldn't do a review but I will for Thai Taste because Im surprised at how bad it was! Ive always heard good things about this place. I ordered Chicken Pad See Ew and they gave me complimentary fried shrimp/egg roll things. I was hungry so I was ready to dive into my food but, it just wasn't good!The chicken looked poor in quality and it had an odd smell. I couldn't help but to think of dirty mop water the whole time I attempted to eat it. On top of not being able to finish it my stomach turned and I had heartburn for the rest of the night. I will not order take out again; first & last time for me!"], ["John H.", "I'd say a solid 3.5 stars for Thai Taste on East Blvd.  Food is good, service can be hit or miss depending on how busy they are, but if I lived closer I would be here for take out a lot!  My last visit, we were actually seated near the desk where people come in and pay and the orders were lined up on the counter.... It would be a little overwhelming, but I think it's great that can handle that many orders at one time (this was also on a Sunday evening!!).One minus is that they didn't have a kid's menu, but the server was good about recommending things that are good for children.Had the C-2... curry at a spice level 4... and man it about kicked my a**.  Luckily they put all the pepper flakes in the middle so you can mix it in yourself (which I thought was smart) so you can gradually make it to your spice level... I went a little gun-ho and mixed it all in, but in hindsight should have taken it down a notch.   Oh well - another time.Parking is a little tight, but there are plenty of spaces.  I would stay clear of the spaces toward the front of the lot because you have people zooming in and out trying to get their take out.  When you are hungry, you are hungry, because people seem to whip in here like no tomorrow..."], ["Shauna C.", "I've had takeout for Thai Taste that was incredible- unfortunately, I didn't order it myself so I never knew what I was eating. I went this past weekend and ordered the Gaeng Keow Wan Curry which I found to be super bland. It tasted more like water than anything else. I was really disappointed, and found myself wishing I ordered something else.The restaurant itself is really cute, and I liked the Koong Gra Bok appetizer (kind of like a shrimp egg-roll), and my husband loved his meal (pad thai with pork) but I wasn't impressed with my meal at all. I will have to try their red curry to see if it's any better. Still a Siam girl for my Thai cravings..."], ["Chuck K.", "if you're looking for some good thai.. here's your place.  Portions are very generous and the service is fast and friendly.  They are a tad pricey, but you'll get your money worth.  Cashew Chicken is a great!"], ["Robin C.", "Once again, I tried Thai Taste.  We had a beautiful window view seat.  I ordered fried tofu as an appetizer.  It came with a sweet and sour sauce and was quite good.  For my entree, I ordered pad thai, which I prepare at home and love.  As with my visit before, I requested a heat level of 4.  The dish arrived, with tofu, vegetables, and a heavily sweetened sauce, but no heat.  Like before, I dumped the supposedly hot sauce from the table on it with no noticeable results.  Next time, should I request a heat level of 10?  It only goes up to 5.  My husband requested a heat level of 3, and he stated that his dish was spicier than mine.  Is it that my tolerance for spiciness exceeds most people's expectations?  Or, does the restaurant think that as a woman, my longing for heat is wantonly and should be more subdued?  The food is not bad (although I would appreciate the sauce being less sweet and hotter); therefore, I can't lower the rating, but I certainly won't give a higher one."], ["Rebekah M.", "This small restaurant is a staple in my life, and has been for at least 3 years.  Thank GOD there is another one down in Matthews now (closer to home), but this one is a lunch-time sit down or dinner-time take-out standard.  If you are coming for lunch, be prepared to either (A) come a tad early to beat the rush or (B) wait a moment... the staff moves their behinds to get everyone seated and fed in  timely manner, but there is only so much they can do!  I love that hot soup is served as soon as you sit during lunch (not sure about dinner, but I'd assume so)... I love that all tea is served without sugar, but there are either simple syrup or sweetener options on the table... I love that the food is fresh, delicious, and perfectly spiced to my taste EACH and EVERY time!My favorite meal here is their Pra Rarm Long Song with shrimp and a bowl of Gaeng Jerd with tofu... I get this to go for dinner whenever my husband and I do a take-out night.... it's enough for two meals, and it's simply irresistible to me!  My second favorite is Pud Thai with shrimp... I love it super spicy!!As long as this restaurant stays in business, I will be a loyal customer! DELISH and PERFECT every time!  Service with a BIG beautiful smile!"], ["Dave C.", "I have eaten here several times over the past couple of years and the food is awesome.  My favorite dish is pad woon sen.  I don't like my food too spicy, so I order it with two stars.  You need to make sure and mix up the dish as the hot spices are spooned on the top and you will want it evenly mixed.  The only reason that I give this place a 4-star rating rather than a 5-star is that I think that the prices are a little steep for me."], ["Connie L.", "definitely NOT authentic thai food.the pad thai tasted very americanized. did not have the peanuty tamarind taste that pad thai usually has. it tasted like sweet and sour.was super disappointed, sad, upset that i wasted calories on this meal.they also did not have sriracha (which was definitely needed) and their hot sauces were weird and watery yuckk"], ["D'Art S.", "De-freaking-lish-ious. Hands down the best Thai food I've had in CLT. Great lunch specials. Quaint place."], ["Kenzie K.", "The first time I went to Thai Taste I loved the food. Unfortunately this last trip made me less than impressed. Service was beyond slow and somewhat rude. The waitress cut us off to go assist another table mid sentence with a very curt wait a minute. We ordered the lettuce wraps and they tasted like pure ketchup. They were inedible and we sent them back. The pad thai was good, but was a little too sweet for my liking. I am unsure if I will return after this last experience."], ["Michael D.", "So the ambience isn't the greatest and the servers will never look you in the eye (or even close to at you), and their beer menu isn't the greatest.  Though screw it.  Everything else about this place is great.  I started with an app of the dumplings.  Nothing special, but not bad.  Though, when I got my pad thai I was amazed that my 80lb server could carry such a big dish.  DAAAYUUUM they give you a lot of food.  For 13.95 for the seafood combiantion it is a steal.  They ask you how spicy you want you want your food (1-5).  I went with three and I am glad I did.  I think 4 or 5 would have been to much, but like goldilocks i am slut and 3 was just right. I finished this up with a Thai ice tea which was spot on.  Looking for an authenitc nothing fancy thai place?  This is your spot."], ["Jason B.", "The McDonald's of Thai Food.  It's edible but that's about it.  This is very mediocre Thai food.  It tastes hastily prepared with minimal effort to use quality ingredients or to create the depth and layers of flavor that exist in good Thai food.  Don't waste your time.  There are plenty of other Thai places in town."], ["Ricky M.", "I took my Mother here for her birthday on April 11th. Worst Thai restaurant I have ever been to! We ordered veggie spring rolls and they only had cabbage in them....just cabbage....nothing else.  The food was not fresh and the employees were not friendly. The decor was very dated and the tables looked like they were from the dollar tree. We will never be back. If I could give this place 0 stars I would."], ["Joe A.", "I've been to this location a couple of times for take out. Fast, friendly service! Reasonably priced and good flavors. I really enjoyed the Gaeng Dang with chicken. The first time I went with a 4 spice level and it wasn't as hot as I expected so the next visit I upped it to a 5 spice level. As I told the guy on the phone when I ordered, \"what the hell, it's Tuesday, right?\". None the less, I took it home anticipating my mouth catching fire, well it didn't. I was disappointed until I had the leftovers the next evening. That's when I located the 5 spice level at the bottom of the dish. Wow, it really brought the heat! Lesson learned, eat the whole damn thing in one sitting! Looking forward to my next visit!"], ["Evane C.", "I came once and ordered veggie pad Thai. The veggies were undercooked and the sauce was sickly sweet and goopy. Pad Thai is supposed to be a bright light dish and this was really a strange and not tasty dish."], ["Nicola E.", "Dine-in. Carry out. Lunch. Dinner. You can't go wrong! I was introduced to Thai Taste in 2010 and it's been a staple for me ever since then.  Once a week. Sometimes twice a week. When I worked in the area, I was definitely a regular. So much so that they know who I am when I call in my order and when I dine-in they walk up to my table with a smile and can tell me what I will order. My staples are the chicken Pud Thai and the fried dumplings (can't recall the Thai name). I've tried the pad see ew and fried rice which were pretty good too. If you go during lunch they offer a cup of complimentary soup that is pretty tasty too. What are you waiting for? Walk in today for some great Thai food."], ["Jessica G.", "If we were judging on the food alone I would have bumped up the rating, but the restaurant is very tiny.  We went at lunch and had trouble parking, when we walked in the restaurant at 1 in the afternoon it was packed-obviously it's popular.  However no one was there to greet us or tell us how long the wait would be.  There were already some people standing by the entrance when we got there waiting to be seated.  After being passed by and ignored a table opened up and the man just waved us over to it.  Maybe it was because they were just super busy but it felt super rushed.  They didn't even ask what we wanted to drink when someone came to our table they just asked if we were ready to order.The lunch menu was really small and I was kinda disappointed cause it didn't have my usual favorite thai curry so I settled for something else (which was still really good). Don't know if we will be back, we have other thai places that are less cramped and way friendlier with food just as yummy."], ["James P. B.", "For the price compared with what you get, you can do much better elsewhere. The Pad Thai is $10.95 and hardly had any beef in it, almost all noodles.Terrible beer selection; Michelob, Bud, Heineken, the usual suspects. The whole experience was meh, doubt I'll be back."], ["Heather A.", "This place has quickly become a favorite! The menu isn't as vast as some other places but everything I have tried had been great! The Pad Thai is a huge portion and always lasts me 2 meals. The service here is very quick and so is the take out! Prices are very reasonable too!"], ["J T.", "Want to try"], ["M.L. W.", "Loved it!! Impromptu stop while driving through Charlotte and what a fantastic choice. Menu was simple and easy to understand, although I relied on the expertise of my date in ordering. Plates arrived quickly. At first I thought the serving size was a bit small, but it ended up the perfect amount. The Pad Thai was surprisingly sweet, but still excellent. Atmosphere was cozy and very authentic.  A definite new favorite when traveling through charlotte."], ["Megan B.", "The delivery is fast and reasonably priced. Food is always hott and delicious. I would definitely recommend this to anyone who likes thai."], ["Aleaha R.", "Food and service was good. I had chicken pad Thai and was good and what I would expect. My only issue is I think they mixed up my spice level and my husbands. Mine was super spicy for level 2 and his was not at a 4. Will return and recommend."], ["Levi Q.", "Thai taste is indicative of ethnic restaurants in Charlotte--second rate. $13 gets you a small portion of shrimp pad Thai or an even smaller portion of gaeng dang (red coconut curry with chicken).The red coconut curry is fine on taste, however the pad Thai is too dry, typical for this dish as it is difficult to make. Other restaurants provide a lemon wedge to cut the dry peanut flavor, not the case at Thai Taste. I love loving in Charlotte but it has a long way to go to shake itself of its white middle America populace that dictates the culinary industry.  There's no decent kabobs, Chinese, Thai or Indian here. Guess I was spoiled living in Northern VA."], ["Deena M.", "The parking lot began filling up before the restaurant opened. (A good sign indeed). They were busy and handled the crowd well. My guess is that they are used to being busy.  The red curry and pad Thai were both delicious. Look forward to returning."], ["Maddie M.", "I have mixed feelings about this place. The food is delicious (which is the most important thing anyway), but service is just meh. Also the interior is a little cramped up with not much elbow room between tables. It must be about as wide as a train compartment. While we were there, they always had a lot of take out packs waiting at the counter so other people might be sharing my opinions about the service / crowded interiors too? But I repeat, the food is MIND BLOWING.We had the spring roll appetizer which was just okay. For entrees we had the Pud Met Ma Muang (cashew nut) with duck. The duck was delicious. It was crispy and full of flavor. We will definitely be back to try more variety (or maybe just keep ordering the duck?) but I definitely do recommend this place."], ["Stephen B.", "Delicious shrimp fried rice. The best part to me was all of the extra sauces they have on the table, green (vinegar based), red (sweet), and hot pepper, to name a few. They have a few Eastern beers as well. Enjoyable place to eat, reasonably priced."], ["Soujanya E.", "We have visited this place for dinner.we have ordered the spring rolls and chicken fried rice.spring rolls were perfect and good.the chicken fried rice was good but the best I have eaten from Thai restaurents they can make it better with Thai flavours.overall it's a good visit"], ["Alisha M.", "I went to this place after a B-cycle ride around Dilworth and the greenway. It's a cute little restaurant! The prices are a bit high on some dishes but they give you so much food that it kind of balances out. The service was good and the dining room clean. I wouldn't say any of the food blew me out of the water but it definitely was not bad and if in the area and craving pad thai, I would go back!"], ["Lacy H.", "Worst service.  I have gone here for years and will never go back.  The waiters were rude and completely terrible.  With all the great Thai options in Charlotte- go somewhere with a welcoming atmosphere and good food."], ["Ana C.", "After hearing all the great reviews about this Thai place, my bf and I finally gave it a try.So, glad we tried this place! For appetizer we have the Koong Gra Bok, it was really crispy, deep fried, not the healthiest, but still so good. For the main entree I had The Beef Pad Thai, it was so flavorful and sooo good! Service was great and quick on a late Saturday night.  Can't wait to try their other dishes."]], "Viet-Thai Noodle House": [], "Thai Thai Takeout": [], "Thai Viet Noodles House": [], "Thai Taste at University": [["Luke T.", "Good place for lunch. Service is fast.Standard Thai fare."], ["Jimmy H.", "I've eaten here a few times and always leave extremely satisfied. The red curry is everything you'd want in a curry. My wife and I were in a hurry and let them know when we got there. We got in and out in 20 minutes. The customer service is top notch!"], ["Tuan H.", "Food is a pretty good. I eat their pad Thai lunch specials all the time and it's by far the best I've had in Charlotte. I usually order the pad see ew, it was okay here. Would definitely recommend it to a friend for lunch."], ["J T.", "I went here yesterday with a friend. The customer service was really good. We ordered the red curry. Out to 5 for spice we got a 3. At a 3 it was still really spicy. Still good. The portion was very small in my opinion. We also ordered the sesame chicken. It was very good. A little bit too much batter but still good."], ["Carrie B.", "'s place is so good. A hidden gem. So happy we tried it today. My kids really loved it too. We can't wait to come back again and try something new. The lunch specials are great!!"], ["Jimmy P.", "Went there for lunch yesterday, the lunch menu is kind of expensive. They give you an egg roll, but each item is almost 9 bucks, and the quantity is not that generous. I would stick with dinner."], ["Latha S.", "Worst food ever. I love Thai food but did not like this place. Will never go back.  The ambience was a little ok and the staff were friendly but they could try to improve the taste of the food to get people come in."], ["Sonia M.", "This is one of my favorite Thai spots in Charlotte. The green curry is delish, as is the mango and sticky rice when in season. I like to judge a place by their pad thai, which is my staple, and I give them a 4/5. The one subtracted point is because the chicken and shrimp in my last pt tasted like they were boiled and added last...they didn't taste like the rest of the dish. It wasn't bad but I've had better at Thai Taste. Definitely worth going back again and again."], ["Supreeth R.", "Lunch menu isn't great. Dinner is decent. Would avoid coming for lunch. Dinner it is ok to be here. And if you go a little late for dinner, the person asks if its take out :P ? Haha! New way to say to customers, go away! Avoid lunch for sure.. Not worth at all."], ["Bill H.", "Pad Thai is usually a good indicator of how the food is in a Thai restaurant. Theirs is quite good. Not too heavy. Not too much sauce. Just right."], ["Bianca E.", "Went during lunch and ordered vegetarian pad Thai with tofu. Food was fast, yet hot. Very moist and tasty. Wish I would have asked about spice level because I would have liked mine kicked up a few notches yet not a huge deal. With lunch you get small bowel of soup, spring roll, and iced tea with entree. Would definitely go back!"], ["Sara A.", "The food is great but the service And manager are horrible. She does not know good customer service or mannerism while she is talking. Byebye good food all because of your ill mannered management."], ["Katherine P.", "Great place to grab a business lunch. Service is always fast and courteous, and the food is good."], ["Chris T.", "Solid Thai food at a fair price.  Thai House in Univeristy area has better music, decor, and ambience, but costs about 30% more."], ["Courtney B.", "Stopped here on a Saturday night because hickory tavern was on a wait. The food was good. I had a soup (that I can't pronounce) it was tasty with lots of veggies. I also had the Thai salad but that was not very good. It was drenched in dressing and the dressing was off putting. My companion had the chicken pad Thai and it was very tasty. The service was just ok. I would go back and get the pad Thai to go."], ["Robin B.", "I eat here all the time!  I love it!  The food is delicious and the one time my order wasn't right, they gave me a free meal.  One of the best Thai places I have ever been to.  The waitstaff is so friendly and fast."], ["Lissette G.", "I've been to a few Thai restaurants in Charlotte looking for that amazing Thai flavor I got at the Thai joints back home (Miami) and sadly I am still looking.  However, for the time being this one is close.  I have not been here enough times to be able to rate consistency but on my last visit I was pleased.  I ordered their cashew and vegetable dish and it was so good I almost licked the remaining sauce off the plate.   Im still dreaming about that wonderful basil infused spicy, salty, brothy, tasty sauce.  The vegetarian spring rolls were also delish and they include 4.I almost  jumped out of my chair when they asked if I wanted dessert and then mentioned 3 on the menu.  What!?!?!  Dessert?  No Thai place I've been to here has dessert other than sticky rice with mango, if any at all.  YAY!!!!  I ordered the fried ice cream and it was a nice ending to a great meal.  No, it still doesn't compare to the lucious fried ice cream they serve in Miami floating on top of a sweetened condensed coconut milk and drizzled with chocolate sauce..... **drool**  but it will do.  If they add fried Thai donuts to the menu they will have a loyal Fan.  :)"], ["Demetria M.", "I was first introduced to Thai Taste on East Blvd and I've been coming here ever since.  I've had so many different dishes here and they've all been superb....I can't even pick a favorite...Gaeng Jerd, Koong Ob Mor Din, Poh Heang, Pad Woon Sen, and the fried rice are all amazingly good"], ["Gary A.", "Thai Taste is one of the best Thai Restaurants I have ever been to.  The food is very authentic, flavorful, and fresh.  The staff is extremely nice and provided great service.  The food comes out quick and hot.   You can specify how spicy you want your dish.  I have had level 3 each time I have gone and it has been perfect.  I like my food spicy.  Each time I come to Charlotte, I make time for this amazing restaurant."], ["John H.", "Great food... and great lunch specials.  Service is fast and friendly.... you can get in and out pretty quickly or even east at your leisure (since the place is nicely decorated with images - I'm assuming from Thailand or the Thai artwork on the walls).You can customize your heat level if needed, but I usually leave it up to the chef and it's right about a medium.There are two entrances to this location so it can get a little disorienting, but the place is cozy enough to \"right the ship\" before it sails out the wrong door.  Even if it does, it's not that bad of a walk around the building.  It also looks like they sell jewelry in the lobby area, not sure if the owner makes it his/herself, but it's a great idea to kill time if you are waiting on a table."]], "Bahn Thai": [], "Bangkok Ocha": [["Patrick A.", "Been coming here for 15 yrs. We love the food and wonderful couple who run the place. Consistently good and spice levels are perfect. Don't miss the Thai Iced Tea, Spinach and Peanut Sauce, & Paad See Ew."], ["Sharon B.", "Was told by the owner they don't take shortcuts on their food.  And it shows.  I've been several times trying something new every time I visit. And they have never let me down.  The food has so much flavor and is just the right amount of spice.  I always get an extra spring roll because it's delicious.  The restaurant is small and private but a bit dark. Which is nice for a quiet meal.  Lunch portions are a good size."], ["Ash H.", "We ordered delivery from them tonight and we are so disappointed ! Coconut soup is too creamy,the flavor is there but its texture is too thick for soup.Pad thai noodles were mostly vegetables , and it's kinda bland, and there's baby corns. WHY is there baby corns in my pad thai !!?!? Ugh !!! I would make a wild assumption that their cook is not from Thailand because this is not how an authentic pad thai should taste like. Curry fried rice was also bland, luckily we have sriracha at home. Again the curry fried rice is not authentic neither.We will not order from this place again, sorry.For those of you looking for an authentic or even great taste thai food, this is NOT the place!"], ["Allison K.", "Underwhelmed.  The decor was outdated and looked drab. The lighting was nonexistent, we were basically eating in the dark. The wait staff was friendly,  but honestly it was hard to understand them because they spoke so,  so fast. The food was not great.  I ordered #23- Gaeng Panang curry. I ordered it with chicken. I was greatly disappointed when it arrived. It was barely spicy,  despite the waiter describing it as \"level 3\". The chicken was rubbery, the vegetables were soggy, and the jasmine rice was mushy. For $12 I was expecting something not quite so gross. The saving graces-nice staff, clean,  not busy at all. The cons-drab decor, not great food. I wouldn't recommend this restaurant."], ["Nate M.", "This is one of my wife and I's favorite spots for Thai food and never disappoints. Its very laid back and the owner and his wife run the place as well as take all the orders. I dont think Ive ever gotten a different server that one of those two. There are many good dishes here and I cant really think of them off the top of my head but make sure you ask what all the ingredients are in the dish before you order. I dont eat mushrooms and one time left them on my plate when i was done...the owners wife asked me why I didnt eat my mushrooms...I kindly replied that I dont care for them and she then said \"next time just say no mushroom\". I think they get a little offended if you leave anything on your plate so, just a heads up there! Oh, they also try to upsell you on a drink even though I normally get water when I come here. Nice folks, good food, check it out."], ["Lori L.", "Staff is very friendly. We sat by the window. We ordered the tom yum soup with chicken as an appetizer and it was very flavorful. I got the Pad Kee Mao with chicken. This is a dish I always get at thai restaurants. It was good and fresh. I got the spiciest and it wasn't that hot for me so I added some chili paste to it. Boyfriend got curry and he liked it. I will definitely come back."], ["Kellie K.", "Even though I've lived just down the street for 8 years, this was my first time to Bangkok Ocha. The fella had been many moons ago and liked it, so we ventured out on a Wednesday night. When we walked in, there was only one other couple in there at 7:30 pm. As we sat down in the booth (of which there are maybe 6, plus 6-8 tables), the fella and I both noted at the same time that there was a really weird smell - I said wet and musty, he said dog. I think it was maybe wet dog. Service was really good, and we ordered pretty basic dishes; I got chicken pad thai, and he got chicken something. Mine was fine, but just a little dry, and his was better. For those two entrees and two glasses of wine, it was $35. Not too shabby.I'd give it another try, but I'm not in a hurry."], ["Michael L.", "My kids and I eat here every time we get a chance. The spice is perfect and the curries are spot on and delicious. We skip around the menu each time and have never been disappointed."], ["Elizabeth C.", "It was weird eating in the dark.  Vegetarian lunch was bland. I kept dumping salt on it, even though I don't eat salt. It didn't get any better with salt. Meat entrée had more flavor. The soup included with lunch tasted like egg drop soup with bits of canned  creamed corn floating in it."], ["J B.", "My family and I eat here all the time. I would put this food up against any Thai restaurant in town. Every time we go the food is consistently delicious and the owners and waitresses are very personable and friendly. Give this place a try you won't regret it. The house noodle dish is fantastic."], ["Nancy T.", "This place made me feel like I was visiting my parent's friend and eating in their dining room. It is AMAZING!Large portions or endless flavors and freshness. They give a lot for such low price! I love the environment and super friendly staff. I want to take this place, move it to Brooklyn and have it to myself.I shall visit again when I am in North Carolina :)"], ["Jessica G.", "My husband and I frequent this spot for lunch and have always enjoyed it. The service is very friendly and attentive. The price is a great value. Today I had the #1 lunch special (coconut milk with red curry and chicken) and it was DELICIOUS. I'm sure I'll return next week and have the same."], ["C L.", "Just okay... Not great but not bad... The service is quick, can get in and out for lunch well within an hour. The Thai dishes are the usual suspects... The red curry could have used a little more time to thicken but not too runny. Overall a decent place BUT make the trip a little further down towards Ballantyne and goto Bahn Thai! Great place!!!"], ["Jeff S.", "I've been in the process of revisiting some of the area Thai places and decided to give this one another shot.  The outside of the restaurant is receiving a makeover along with the rest of the shopping center.  Gone is the covered walkway right in front of the restaurant and the brick facade.  It's now a white facade with shade awnings above the windows.  It seemed to be better this time around than my original visit but there were still some flaws.  The soup that came with lunch was kind of bland.  It was like an egg drop soup with corn and all you tasted was the corn.My lunch was a chicken dish with bell peppers, onions, mushrooms and of course rice.  The chicken was overcooked.  The veggies were good though and the spice level (5) was spot on.The staff was friendly here and everything came out super quick and although I increased my rating for them by a star, I don't think it's enough to make me want to come back again.  There are better lunch Thai options for me."], ["Nancy N.", "Tucked away on a shopping strip, latent and nearly concealed is Bangkok Ocha. I've actually never noticed this restaurant despite the millions of times I've frequent this road and passed this exact location. One of my friends recommended Bangkok Ocha and raved that this is his favorite Thai restaurant. Let's be honest, I ignored him. The dull, insipid exterior does not exactly scream \"GREAT, AUTHENTIC THAI FOOD HERE!\" Nonetheless, the boyfriend and I decided to pop in last night and give Ocha a try!We ordered the stuffed chicken wings as our appetizer.  I must warn you, patience is key since everything is made to order. Boy was it worth the wait! The dish is accompanied with a sweet and sour peanut sauce. Crushed peanuts floated on the sauce's yummy horizon. I added some spicy peppers (\"hot sauce\") and BAM, perfection! Kinda felt horrible, but I couldn't resist asking the waiter for TWO refills on the sauce.For the entree, my boyfriend settled on the Curry Fried Rice and I went with one of my Thai favorites, Pad Kee Mow (pan-fried noodles stir fried with various vegetables, tomatoes and FRESH basil!). We asked for a level 4 (out of 5) of spiciness for both dishes. The main reason why I LOVE Thai food is the abundance of flavors, herbs and spices.  WOW.. Ocha delivered just that! Not at all exaggerating, but with the first bites into the entrees, all my worries drifted to the ceiling and I was in food heaven! SO many different, yet distinctive flavors between the two dishes. The Pad Kee Mow was steaming of fresh basil. The Curry Fried Rice was what really stimulated my taste buds, the most compelling flavors and spices that I've ever had in a Thai dish. Level 4 of spiciness allowed the perfect amount of spicy that complemented the other flavors and not at all overwhelming. We topped the prefect meal with Thai tea. I couldn't believe my luck, even the tea was more abundant in flavor than other Thai teas I've had. That was it. I officially fell in love with Bangkok Ocha!The only recommendation I have is to reflect the amazing spice and flavor of the food onto the design of the restaurant. I love hole-in-the-wall restaurants as much as anybody, but the flat decor and exterior does not do this place any justice! The restaurant is nice and clean, but the lighting is dark (and no, I do not mean dim), rendering the place dull. I think with a little bit of color and lighting, Bangkok Ocha will get the attention it deserves! Regardless, the service and food is so amazing that once they get people in the door, they're hooked (noticed most of their customers are regulars that the staff knew by name!)."], ["Julia M.", "I have not been to Bangkok Ocha in quite a while... but came to have lunch with my sister here the other day.  We both decided to get the chicken Pad Thai on this visit.  I ordered mine with a spicy level of 3..it was good, but it was not quite as spicy as I had hoped.  The menu is very reasonably priced for lunch.  Service was good.  I definitely need to get back over here for dinner sometime soon, since I really like their version of Penang Curry here."], ["Rowdy S.", "Nice atmosphere. Soft music and no televisions. A lot of food for the price. Pad thai was kind of bland. Good spring rools and thai iced tea. Attentive staff."], ["Benjamin G.", "I don't frequent this little shopping center off of 51 often except for the occasional Fresh Market visit or essentials from Party City. I was happy to find solace in Bangkok Ocha for lunch with a deer chum of mine. Certainly a diamond in the rough for those who have not tried it. A quaint Thai resto with a lack of glitz and glam - my kind of joint. All about the food and service. You can't set your drink down without them filling it right back up! So rad. Food: They start you off with soup. It's some sort of rice-y, broth-y soup that has a somewhat peculiar color. Off white-ish. Very flavorful and salty. Contains some sort of protein as well. Either tofu or chicken, but not certain. I ordered the Pud Kee Mow. One of my favorites at any Thai place. Flat, pan seared noodles with veggies, chicken and plenty of spices. The flavor is very earthy and peppery. Huge portion for lunch, too. They give you a nice spring roll with your entree that isn't incredible, but definitely a nice touch for an already generous meal. Me and my buddy ate for just $18. Not too shabby, in my opinion. Definitely will be back for lunch again soon. This city has so many Thai options and I'm happy Bangkok Ocha is one of them! Cheers!"], ["John C.", "I have been eating here for years.  While the ambiance is not great, the food is very good and the prices are very reasonable.  I have probably eaten every item on the menu, lunch and dinner, and never been disappointed. I am a bit of a Thai aficionado, originally from NY.  Bangkok Ocha is better than most.  I have had better Thai at significantly higher prices in Florida and California.  There are a couple of places in an Atlanta that are as good but overall this is a terrific \"once a week\" (at least) spot.While I understand reviews are subjective; the details in some of these reviews, what was ordered and the comments, suggest input from Thai posers and dabblers rather than addicts.  I am the later."], ["Nicole W.", "Craving Thai-ish and need a quick lunch? Hit up Bangkok Ocha, son. I met hubs here for a very speedy lunch where their lunch special includes iced tea, house soup and a noodle dish w/egg roll for $7.95. Oh, and it comes out in about 10 minutes flat. That's fast. And the food? Not too shabby! The house soup is a total bust for me - it's a corn egg drop soup. Yeah. Not sure where that came from, but it tastes like a watered down egg chowder for me. I'll pass on that. But, I ordered the pad see ew (which on their menu reads pud see ew) and it was quite tasty. A generous portion of chopped up flat, rice noodles with a soy sauce base, a bit of broccoli and bits of tender chicken. Considering it was lunch and I still had meetings to get to, I asked for a 3-star spice level (out of 5 stars) and it had quite a bit of heat! The service is quick and efficient and they definitely know how to turn those tables around during lunch time! While it's not my favorite Thai food in Charlotte, it's a nice quick and affordable option in South Charlotte."], ["Chris R.", "This restaurant is tucked away in the Carmel Commons shopping center off of Hwy 51.  I've only been here for lunch, many times, and their lunch specials are very good and affordable...$7.54 I believe?  It comes with an entree, soup of the day and iced tea.  The menu rotates so some of the dishes aren't always available but the traditional noodle dishes are always on there.  I really like their house noodle (kind of a mix between Pud Thai and Pud See Ew).  They also have good curry/rice dishes.  Their ingredients are really fresh and the noodles are some of the best I've had from a Thai restaurant.  Lunch on Wednesday is always really crowded (I believe it's because of the hot and sour soup served that day only) so get there before/after the lunch rush to avoid a long wait for a table!  4 stars because they could use some more staff on hand otherwise I'd give them a 5!"], ["Elle L.", "I am an ethnic food snob. I lived in San Francisco for 6 years and have had the best of the best. Save your money and try Thai Place just down the street. Dinner for two people was $40 with a tip and definitely not worth it."], ["Keeb M.", "Really good food. Excellent friendly service. The staff were sincere attentive and kind. I ordered the Ga Prow aka Ka Prow Chicken. It was flavorful and spicy with fresh vegetables and basil. The lemongrass soup had fresh veggies and mushrooms. It was also very flavorful and delicious."], ["Charles O.", "I have eaten at this restaurant a total of three times.  On the last visit we tried the Kang Dang curry with chicken, Chicken Basil stir fry and Pad Thai.  All were OK, but not extraordinarily flavorful.  I agree with one of the other reviewers that the Pad Thai must have been made with ketchup.  The Chicken basil didn't have a strong basil flavor and looked different than I am used to-- it seemed to consist of dried basil, rather than fresh.  Not a lot of Chicken in the Kang Dang, but it certainly contained curry."]], "Thai House": [["Mark L.", "Great restaurant, never disappointed by the spur of the moment choices I made to try something new and be adventurous! My experience has always been positive, and, as for the previous reviews regarding spice level, if you order a red curry mild, please don't expect spice, and don't give a 2 star rating for that reason. That's what the spice tray at each table is for. (Rant complete!) The appetizers are on point, the beef skewers are always tender, with the hoisin peanut sauce is a great complement to the salty well seasoned beef! The fried tofu is always fried to perfect crispness on the outside and delicate fluffiness on the inside! Any dish I have ordered has been cooked to order per my preferences.  If you are going to order the ever popular Pad Thai, you really should ask for it \"Thai Style\" which is a much better tasting tamarind based sauce, not that ketchupy crap you get when you order pad Thai at any Thai restaurant."], ["Cody M.", "This restaurant isn't just good \"for a restaurant in Gastonia.\" This is a really good restaurant. The location and outside would not give you a clue as to the ambiance and classy decor on the inside. It is a cool place to take the family or to head out on a date! But the way it looks only matters so much. The food is where it is at. Adults: For me, I love the Pad Thai. Just about every Thai restaurant I go to, this is what I get. I even posted a picture of it here on yelp. It is good. Really good. If you want it spicy, ask. If you want it REALLY spicy, ask for it to be \"Thai Hot\" and make sure they know you mean it. Oh man it's good. Kristina has tried a few other things on the menu and it always is well put together, cooked well, and the presentation is even nice.KIDS EAT FREE Wednesday and Thursday with a paying adult.Kids: One of the big worries at a place like this is our 3 year old. Sometimes new foods are hit or miss. Even worse is when the \"Kids menu\" provides second rate burgers or something of the sort. The mac & cheese was piping hot, and cheesy to the level of awesomeness. The fries were battered fries and the kids ate them all. The other kids menu item was sweet and sour chicken. It was fantastic.The hosts are always there with a smile and a high degree of courtesy. Every time I come I've been treated as though they were waiting for me to get there... I've watched, it's like that with everyone :-)NOTE: If you are in the mood for southern sweet tea, don't order tea from this menu. It is a great green tea that is sweet but it is not McAlister's southern sweet tea... Family all agrees that this place is one of the tops in our books. Thanks for the experience!"], ["AJ P.", "Great Thai food at an affordable price. I was craving some Thai food and looked around what's near me, and most of the restaurants are in Charlotte which is a little ways away. Thank god I found this place. Will def be coming back in the near future. My waitress was very nice and service was quick. If you're in the area, I highly recommend eating here."], ["Vanessa H.", "I do my best to stop at Thai House any time I'm in Gastonia.   Their clear broth soup is the best I've had and I love their spring rolls.  Everything I've tried tastes fresh and delicious."], ["S T.", "My wife & really enjoyed the food here.  We'll definitely be coming back. Who would have thought that a really decent Thai place was in Gastonia!"], ["Brittany P.", "Food was good; my dish (Kai Khua with tofu) was very comforting in a stir-try version. Flavored weren't too overpowering and the vegetables were cooked well for that evening balance of slightly crunchy and soft in texture. Tofu is cubed and fried and not over done. Overall, food was pretty satisfying. Amount given equaled with what you would pay for. Service on the other hand, could've been more welcoming. I felt rushed and as if our waitress was annoyed with us from the beginning of our seating. I would still come back, but now I know what to expect. I've had better experiences, but this place wasn't too shabby, just wasn't the best."], ["Lori H.", "Delicious and well balanced Thai food. The richness of the coconut was well balanced with the heat of the curry."], ["Jeff S.", "Stopped in here on the way back to Charlotte.  I am a frequent customer at one of Thai House's Charlotte locations so I figured this would be just as good here.  If you are looking for this place, it is in a newer shopping center down the street from Franklin Square.  Compared to their two Charlotte locations, this one is quite large.  There are the usual Thai House green booths in the front and additional seating in the back.   They also have a small bar in the front and this is the first location I've been to that has a sushi chef.  The menu is the same here as with the other Thai House locations with the exception of the sushi.Lately, I am more of a vegetairan/pescetarian but on this day I was already allowing myself to eat meat and I was craving a chicken dish that I love at their other locations, Pad Krapraw which is ground chicken mixed with veggies and basil in a light sauce.  Of course I ordered it extra spicy.  I also ordered the steamed spring rolls as an appetizer.The spring rolls were the worst part of this experience.  I was expecting something along the lines of a Vietnamese spring roll but this was nothing like that.  It was tofu with cucumber wrapped up.  The wrapping seamed rubbery and it didn't hold its form so everything fell apart easily.  The best flavor of the roll was the cucumber.  The meal on the other hand was spot on as I always enjoy it.  It could have had a bit more heat to it.As far as service, it was excellent, not outstanding but they were friendly here.  I also enjoyed the thai dresses the wait staff were wearing.  I can't say I will get to this restaurant often.  I think this was just a case of being in Gastonia and wanting something other than a national chain restaurant experience but it's nice to know Thai is now available here if I ever get stuck here again."], ["Tr N.", "Great food. Pretty atmosphere.  Excellent staff that works as a team. Recommend the soft shell crab in curry with potatoes and the Thai Namprigpaow with duck. Tom Kra soup was outstanding!!!!!  Tom yum soup was a bit too sour (too much lime) but it grows on you, spoon by spoon. Too much food to try the sweet sticky rice with mango for dessert. Next time!"], ["Jason L.", "The red curry isn't spicy at all if ordered mild. Definitely will get it medium next time even for a spice wimp like me.The potstickers fried are super crispy.  I would prefer them steamed here since they are packed with spinach.First try wasn't bad.  I need to try more on the menu!"], ["Tiffany T.", "The food here is horrible. Not real or even close to good Thai food. The pad Thai and pad ke mow was mushy and noodles all broken up. I love pad Thai and this was the worst I've ever tried. We asked for it to be spicy but I'm assuming they forgot cause it wasn't spicy at all. And they brought out a dish of crushed pepper without us asking for it.  The best part of the whole thing was the water they gave us. We will never come back. The restaurant is nice inside but if your food isn't good then there isn't any point being a good restaurant at all. In all the Thai food here is horrible."], ["Lisa Y.", "Great service, but food was blah. The knockout rolls were chewy, the Tom Kha soup tasted like salt water, and the Pad Thai sauce was completely absent of peanut flavor."], ["Greg H.", "Came to the Thai House with a friend and I will say that we it was close to closing so I won't critique this place so much until I come again. The service was great and even though they was closing they treated us very good and didn't rush us. We had sushi and it was very average at best and they soda did have much fizz at all. I would recommend this place although it wasn't the best I think it has great potential."], ["David Z.", "Best Thai food in town. Yes, it doesn't say much when you realize this is in Gastonia but this is as good as the Pineville location."], ["Sheigh J.", "Beautiful. The ambiance was so relaxing and beautiful. The food was a A on the presentation and a B on the taste. The customer service was A+."], ["Kayla M.", "This is one of the only places I'll eat out at in gastonia. The food is wonderful, especially for a vegetarian like me. The sushi is pretty good here from what what my roommate says. The only thing that could be better is that certain employees could be friendlier. Especially the hostess. I really only like getting served by the guy from New York (I think), the tall slender woman, and the one with the edgy short hair. They're great at making me feel welcome and relaxed, something that hard for me to do at a restaurant."], ["Sarah N.", "I've been here twice in the past month, and both times I wasn't impressed - and I'm honestly not the overly picky type.My boyfriend and I ordered two separate dishes, but they were served with the same sauce/flavor - it wasn't what was advertised.  They used different vegetables than what the menu stated also.  This was the first time I had a red/spicy sauce with Pad See-Ewe instead of a soy/brown sauce.  I didn't enjoy it.  The second time I was there I ordered yellow curry, but it tasted watered down and didn't have a lot of flavor to it.If you have children, be warned that the kid meals come with a cheap juice bottle like you'd get at a convenience store.  I ordered water for my son instead.  They also seem to be inconsistent.  Both times I was there, it was for dinner, and I ordered similar dinner items.  The first time we were given soup with our meal.  The second time they seemed to rush us, and didn't offer soup.  I'm a big fan of Thai food in general, but out of all of the restaurants I've been to in the area (including Charlotte/Concord) - this is hands down the lowest on the list."], ["Robbie K.", "I eaten here twice and was very satisfied with the taste, service and portion size. I will definitely be back and suggest you give this place a try. You won't be disappointed."], ["Carol B.", "Not a favorite. They will change the veggies without telling you depending on what is in the kitchen. Small meat portion. Not generous  pretty annoying to me"], ["LaTasha C.", "Thai House has an excellent atmosphere matched by outstanding customer service! The food is superb! I will be back!!"], ["Robin B.", "Absolutely a wonderful surprise! From the road this restaurant looks like a hole is the wall; however, it is much more. I had the most expensive item on the menu since I was eating alone. The seafood was excellent done in Thai fashion. I would recommend this restaurant to anyone, More of a grown up setting however. I have gone back."], ["Jim C.", "We've been here a couple of times: once shortly after it opened, and a couple of times since. The place seemed to have great promise, but was a bit uneven in execution. They seemed to have leveled out quite a bit, and it's mostly good. Sadly, they still don't make the spicy dishes spicy enough."], ["K B.", "I used my Groupon purchased last night.  I was pleased with the ambiance, the service and the food.  I had several things:  seaweed salad, stuffed soft crab, jasmine tea and L2 entree for lunch.  I will definitely be back."], ["Dixi S.", "I was in the area to check out the planetarium and ran into this place. What luck! The restaurant is really nice with great service. Also, I really liked my dish. When it comes to Thai food, I usually get my usual faves but decided to venture out this time. I got the duck namprigpao. Yum!!! I'm gonna have to add this to my fave list."], ["Carl A.", "My wife and I eat out a lot. Been to the Thai House over 30 times and the meal has always been good except for last night. My wife ordered the Thai bbq duck and when the order came out it was misleading. All the was duck was a few slices of breast meet and everything else was chicken. We cook duck several times a year and get duck when we dine out and know that duck does not have white meat and taste like chicken. They charged me the very high price for duck on the bill. If you were someone that never had duck before they would be pulling the wool over your eyes. TOO ME THIS IS JUST TO MUCH AND WE WILL NOT BE BACK AND WILL NOT RECOMMEND THE THAI HOUSE ANYMORE."], ["L. T.", "All I can tell you is I could LIVE on their Yum Neur.  It's in my top ten of restaurant dishes.  It's so strange because I see so many people herd to places like Cheddars and The Olive Garden in this city and I can't help but wonder why.  I've eaten at BOTH places and they don't even try; you get pre-cooked, bland, tasteless chain food there.  At least at Thai House you get FLAVOR!  As a matter of fact, a friend and I are heading that way on Friday for a little pre-birthday bash; nothing brings in another year like sushi and that DELICIOUS Yum Neur salad!"], ["Dan W.", "The green curry and chili curry dishes were delectable. Thai House also had nice touches with the serene decor, prompt and cheery service, as well as attention to detail with little knotted staircase patterns on the drinking straws. The girlfriend and I agreed it was nice for date night."], ["D M.", "Very disapointed.  We were very unhappy with our food and they could not have cared less."], ["Christine D.", "Stopped in for what i thought would be a good lunch with similarities to the location i used to frequent in Pineville. I mean, i know that Gtown is definitely limited when it comes to decent food. Lets be honest here... they have really dropped the ball at this location.  During my visit the shrimp in my pineapple curry were obviously frozen and out of a bag. Some deveined some not. The level 5 that we ordered our items at had no heat at all. The plate of spices we requested couldn't even save this stuff. My friend found a rock/piece of concrete in her entree. When the sweet tea was then refilled with the wrong drink i decided to say something to the waitress. I showed the her the rock/whatever it was in the food, told her i was not happy with my dish and that we now had wrong drinks. She apologized, took all the food including my barely touched curry and brought the bill. The entree with the rock in it had been removed. I was still charged for everything else. I paid, left and wont be back. It sucks because i KNOW this restaurant can be better. Ive had better at Thai House. I have had dishes with shrimp and it hasn't been frozen and out of a bag. Not sure if they're cutting corners because of the location or what but this is not good Thai food. It's just not."], ["Spike J.", "Great Red Curry Chicken and Pad Thai, but evening prices are much more than lunch, with no added benefit.  No spring rolls or soup included.  Good, upscale atmosphere but poor value.  I prefer Thai Taste or Monsoon Thai in Charlotte."], ["Steve I.", "The decor was fantastically elaborate. And for as fancy as it was, I was pleasantly surprised by the low prices. $9 for a lunch special, which included soup (brought to us before we even ordered), a spring roll, a large dish, and an orange wedge for desert. Good stuff."], ["Jessica M.", "This really is the only place to get Thai food in Gastonia.  And it is so so great!  My husband and I love coming here. Everything there is so fresh and delicious, I wish we could eat here once a week!  Staff is SUPER friendly and attentive, which you usually have to drive to Charlotte to experience."], ["ChemistNC N.", "Thai house is a little pricey. The food and service is always good. I love the red curry, the panang curry, The duck in thai bbq sauch, and the sushi is great! They have a buy two get one free sushi night! Don't miss out on the jasmine iced tea."], ["Terry S.", "I was very pleased with my whole Thai House experience - the service was great (although our waitress said thank you more times than I could count!), the appetizer, steamed rolls were delicious and both my friend and I had more food than we could eat for our entree. If you are driving along Wilkinson/Franklin streets between Charlotte and Gastonia and you are hungry for Thai, I would definitely swing by here, you won't regret it!"], ["Steve O.", "Would you go back?  In a bind.Been to this location twice and have no major complaints.  The food was good, albeit not great.  My biggest sticking point, and I admit it's kinda petty, was that on both occasions I asked for spicy sauce on the side, and the waitress simply pointed out the little dish that sits at every table with sauce.  Look, if I wanted to pour spicy sauce that every prior occupant of my booth has had their fingers in, over my food, then I would go ahead and do that, but I really don't want to do that, so I'd much rather you bring me something that at least seems fresh, from the kitchen.The \"decor\" is a little busy in this place, sort of what you might get if someone says \"let's grab everything that looks like it might be Thai or Asian-influenced and set it up as decoration\".  But with all that aside, when short on dinner ideas, or when that urge for Thai food sets in on a weeknight...this place will do and I encourage you to give it a try."], ["Angie B.", "This is my all time favorite treat!  The service is impeccable, the food is original and tasty.  The atmosphere is quite unique with the carved wood booths in the back.  Very quaint and on the top of my list in G-town."], ["Jason S.", "Yum!  Tucked in a rather non-descript location along Highway 74 (Franklin Blvd), this place is a favorite of mine.  Food is great, portions are just right, and the service is very good.  My wife is gluten/dairy free and has no trouble picking from the fresh and healthy menu."], ["Dianna D.", "The Thai food is wonderful and their sushi is phenomenal.  Very creative and a wide variety of flavors.   I no longer live in Gastonia, but I drive back just for their sushi.  They have an amazingly polite staff, and quiet laid back atmosphere."], ["Diana B.", "Everything we tried was really good. Even found something for our picky eater"], ["Lori W.", "I'm not a Thai expert but I sure do like this place. The decor is \"pretty\" and not tacky. The bamboo lining the booths gives a fresh look and the ornate wood work is exquisite. The food is great and the service attentive. If you want more spice there are spice trays they will give to you. I highly recommend the Thai House."]], "Basil Thai": [["Ray W.", "I'm finding many of the other reviews pretty disappointing.  If you go to ANY Thai Restaurant and order Pad Thai...then you probably shouldn't be eating Thai Food in the first place.  I've been to countless Thai restaurants all over the country (and outside the US as well) and this place ranks among the very top.  Great ambiance, terrific service, and our food (and cocktails) were a perfect blend of \"gourmet\" Thai.  Overall it was a tad spendy, but we are excited this restaurant is close by and will visit again soon."], ["Keifer S.", "Two words come to mind that best describe my experience: thoroughly disappointing. The ambience is great - the decor is good and the waitstaff were nice enough. If I could end the review there this would be a 5 star review... but oh, the food. I ordered a staple, Pad Thai. I'm not sure where they went wrong but it was terrible all around. Instead of choosing your protein (as is common with the dish), this chef is confused - they include chicken, shrimp, and something else I couldn't quite make out; the flavor was just 'off' from what Pad Thai should be - that's as best as I can describe it. The spice level also left much to be desired - I ordered 'Thai Hot', the spiciest they have and the dish packed as much punch as a wet noodle, no pun intended. Lastly, the consistency of the noodles was just wrong - either it was too soggy or too wet and the noodles were round instead of flat so it didn't feel quite right in the mouth. And the price? At $14.95, this was the most expensive Pad Thai I've ever had; I wish I could say it was worth it. On our way out (based on what I could see), I noticed that they didn't have a single Asian/Thailander working in the kitchen - it just seemed like a bunch of Southerners trying to mimic Asian cuisine; maybe that's why the food didn't have an 'authentic' taste. Maybe I'm being way too harsh/overly critical, but I'll tell you this - this is the first review I've ever given less than 4 stars; that's saying something. I really wanted to love this place, I did (especially since we live across the street from it), but based on tonight's performance, they're going to have a really hard time winning me back. Oh and did I mention they don't have a lunch service? A Thai place with no lunch - that's like McDonald's with no breakfast."], ["Diane U.", "I found myself at Basil after a haircut and decided to get some takeout and wait for it at the bar. The restaurant is really beautiful and has a classy atmosphere. Our go-to thai dishes are larb, Pad Thai, and panang chicken. Panang curry was not on their menu so I ordered larb, Pad Thai and a shrimp and vegetable dish. I noticed it was pretty expensive, so was expecting it to be really good. I drank two drafts while I waited and the staff was really nice. The manager stopped by and spoke to me, he was very personable. The bill came to $64. When I got home, my husband and I opened it up and found a very skimpy portion of larb. It was tasty, just not very much. The pad thai was fine, not great. Clumps of noodles not mixed in, chicken was dry. The shrimp dish was a container of steamed broccoli, cauliflower and cabbage with 5 grilled butterfly shrimp. The sauce was on the side. No rice. Overcooked shrimp, undercooked broccoli, wet cabbage, sauce was ok. This was a $25 dish and I was not impressed. We usually have at least enough leftovers for one person to have lunch the next day, but that was not the case this time because there just wasn't that much food.Since I can get delicious succulent Thai food from other places for half the price, I won't be returning to Basil."], ["Michelle H.", "Really enjoyed our visit to this restaurant!  The food was absolutely delicious with so many vibrant flavors!  The ambiance was really nice, and Howdy provided great service with some wonderful recommendations. The portions aren't huge and makes it a great place for sharing some different dishes. We particularly enjoyed the basil rolls, egg rolls and wontons for appetizers. We also really liked the volcano shrimp, green curry shrimp, pad Thai and pad see you noodles."], ["Taylor H.", "I went there on a Friday night, thinking it was going to busy but it wasn't we got in within 20 mins of arriving. The ambience of the restaurant was excellent and the decor was good, as well as the wait staff being very helpful and attentive. However though the food wasn't awful it wasn't authentic I thought. I eat Thai food all the time and I was expecting a more authentic taste. I got the basil chicken and it just didn't taste authentic, the food was still good however."], ["Chris B.", "The food was good. That is what my wife and I told the man who asked us how our time at the restaurant was when we left.   To be honest the food was okay and that is why I give this review three stars but the service was terrible.  The service was rushed and rude.  The waitress seemed to think that reciting a draft beer list at warp speed was cute or helpful (Saints preserve us if she thought it she was being helpful).  Ordering was a very rushed and stressful experience that I would ordinarily associate with being at the Varsity in Atlanta GA.  I kept thinking we came here for a nice leisurely meal with our precious alone time and whoops there goes the waitress sprinting from the table before I could add an appetizer to the order.  (Seriously she did not even try to up-sale us from water when we sat down originally, let alone ask us if we wanted an appetizer) It doesn't get any better from that point.  She forgets the beer order.  Splashes it over the table when she brings it over.  We decide at that point that we rather leave and inform another waiter of our intention but he asks us to stay and will talk to the waitress.  We had hoped that meant that we had seen the last of her at our table but no she comes back over to almost spill a drink on us. (Only soaked the the plate which was gratefully finished at that point).  (She never spilled drinks before she tells us).  Anyways I enjoy eating at places where our patronage is welcomed and wanted.  Obviously this is not that place and we do not intend to go back."], ["Bill G.", "Really good Pad Thai, spring rolls, and hot tea. Prices are a bit high, but understandable given the high rent district they are in. Very attentive service. If you get it to go they do a nice job of packing it for you. Overall, really good option for Thai in the Ballantyne."], ["Jen E.", "We spent $34 on dinner, and we are still hungry.  We did carry out.  The Pad Woon Sen filled half of the container and had very few vegetables in it.  The red curry with chicken was supposed to have extra bamboo shoots and no bell peppers, instead it just had no bell peppers.  Everything was very skimpy, but flavorful.  We enjoyed the taste until I noticed that my chop sticks had mold growing down the entire length of them.  Yikes!  We called the restaurant to tell them, and the hostess who answered was quite nice and yet seemingly ineffectual as she did not ask for us to bring the moldy chopsticks back or if we wanted a refund.  I say stick with Thai House on Hwy 51--always delicious, fresh and plenty of food in the dish!!!I will try to post a picture of the chopsticks when I figure out how to do that..."], ["Jeanine F.", "Amazing food, kudos to the Chef, just a shame the evening was spoiled by a waiter who was not interested in serving our table.   We loved the basil wraps, chicken pad Thai and curry dish.  The waiter didn't take our drink order, we had to track down another waiter after a long wait.  Then we had to ask if we could place a food order, getting the impression our waiter wasn't interested in serving us.   Please note, the place was half empty.   Hmmmmm......"], ["Ramya M.", "Average Thai food for above average prices. Granted, the ambience is better than your neighborhood Thai restaurant but I can't trade flavor for ambience. The service is earnest but save your pennies and head to Bahn Thai instead for the real deal."], ["Ken A.", "We had a great dinner at Basil last night. The food quality was beyond what we expected. We will definitely become a regular!"], ["Eddie G.", "Ok so this was our second experience at basil in stonecrest. The service was not good at all. The servers are cold and not friendly at all. The portions are small and for the price they should be bigger. But I guess when your a chain restaurant this is expected. We will continue to eat Thai food at Thai first in Blakeney. Were the servers are nicer and the food is better."], ["Amanda B.", "Amazing satay. Wonderful, attentive wait staff. Great with food allergies."], ["Sarah D.", "Tom Yum Soup here-need I say more! Packed with lots of Seafood and generous portion, says two but we had multiple bowls. I went with the shrimp pad Thai-delicious. The decor is casual but with a modern simplicity.  Bar in front with lots of good looking young people and you can eat there too."], ["Alex T.", "I have been here twice since it opened and both times I have been blown away.  Delicious!  Service was solid, ambiance was good.  I had the Pad Kee Mow with chicken and it was out of this world.  The wontons are great as well as the wonton soup.  Will be back again."], ["Doug V.", "Good food - great atmosphere - we had a great server, however he spilled my beer all over my friends pants.  Pretty much ruined his night.  I would expect them to comp SOMETHING as a gesture of apology, but they didn't do anything except say they were sorry and bring out soda water to clean it up.  The whole front of his shorts were covered with my beer, come on - anything comped would have made a huge difference in the visit...  Won't be going back there....."], ["BJ M.", "Went to basil in Stonecrest for first time last night. They said wait would be 15 minutes but was more like 30-35. We finally got seated and waited 15 minutes for waiter to come to table. He apologized but was very short with us and was clearly overwhelmed. Food was average. As I was eating I overheard other patrons complaining how bad their service was. At one point I counted 7 dirty tables with no one cleaning up. Don't think I will be back anytime soon. So many better places in charlotte now."], ["Bethany A.", "This is BY FAR the best Thai food in Charlotte!  I have yet to try a dish that I did not like.  My favorites are the Nam Sod, Chicken Satay and Pad Thai (best I've ever had!!).  I would highly recommend this place!"], ["C L.", "A few weeks have passed and thought I would give Basil another try. It seems as if they are getting back on their rails. In my previous review, I was very critical of the overall experience and lack of consistency compared to the flavors served at their other Charlotte location. This time around, the food/flavors were good. I order the same crispy red curry duck, the duck was cooked and more tender than the pervious. Also the spice was tack on! They could afford to put a little more sauce on the plate but it was fine nonetheless. Overall, glad that this particular Basil is not a bust; thankful it's closer to the homestead!"]], "Thai House at University": [["Dean W.", "This is by far the worst dining experience  I've ever had. Service- 2 out of 10, disorganized, slow, almost apathetic. Food- overly sweet, sweet, sweet... And not in a good wayPresentation- sloppy at bestAtmosphere- beautiful wooden carvings line the walls of this restaurant however this cannot change the fact that the food is disgusting."], ["Mike C.", "Shredded chicken and basil is amazing! L1! Service is extremely fast and food is always amazing!"], ["Manjesh G.", "Horrible service. Though lot of tables were there and asked for a different table as our table was way at the back they refused to give us a different table."], ["Keith F.", "I love the thai house, my wife and I discovered this restraunt when we first moved to charlotte.  They have excellent food and excellent service, can't ask for more than that.  Favorite dishes are red curry chicken, Rama of sunset with fried chicken, pad thai and they have an amazing coconut mango sticky rice."], ["Cassie O.", "I like to come her on Sundays after church. If we get there early enough we would t have to wait. I like their red curry with pineapple and hubby likes the house fried rice. Their summer rolls with shrimp are fresh and a good size."], ["David Y.", "Some have knocked the service here but on our visit the staff bent over backwards for us. They were attentive but not overbearing.The food was good. We had the tom sum (papaya salad) and it was plentiful and tasty. Not as spicy as I have had at other places, but flavorful. The panang duck was tasty as well - nice thing about duck is it is fattier than chicken so can take some overcooking, and I think mine was a bit over. It was complimented by plentiful broccoli, carrots, and snow peas. The sauce had a good level of heat for me - which is to say, spicy but not too spicy. I asked for 2 on their 4 star heat scale.The prices are a bit higher than I find in Winston-Salem, but the restaurant is between the Carolina Medical Center and UNCC so I would expect to pay more and the portions are generous.I would definitely go back if I find myself in the area again."], ["Mai V.", "This place was recommended by one of my friend's sister that lived in Charlotte. Great recommendation! I liked it a lot more than I thought I would.  We went on--I think--a Wednesday which they have a lunch special for pad thai. I ended up getting the chicken pad thai special and it was delicious! You have to mix the entire plate including pepper and sugar in order to get the full taste! They also gave us a chicken soup appetizer which was also pretty good. The waitresses and waiters were nice, but we were being waited on by like 3 different people ..? I didn't mind it much though, just confusing. The pricing wasn't too bad either. For really good thai food, it was pretty cheap! Oh and if you can't find parking right in front of the restaurant, there's a whole big parking deck behind and on top where you can take the stairs or elevator."], ["Sangita R.", "I would give 5 stars for the food and the decor. But the service is awful, there is a waiter who always try to act really smart and funny. He assumes Indians don't understand english and I feel is extremely racist. The regulars here, would know who I am talking about."], ["Travis W.", "I'm not much of a Thai lover but this place hit the mark for me.  I enjoyed my Pad Kadapow?  I forget how to spell it.  To start the lunch, they serve a nice soup and then followed up with my entree and it was piping hot tempature wise.  I chose chicken as my protein and to be honest I was a little surprised it came out as ground chicken and not little tenders as I expected.  Maybe that's just the style of the dish, again, I'm not a Thai lover so my knowledge of the dishes is very limited.The interior is actually very nice in here with nice wood carvings and a bit better than a lot of the other Thai resturants I've visted.  The staff were super efficient and quick to the table for our water, food and checks.  I would certainly make another visit sometime."], ["Kamilia L.", "Authenticity at its finest. My favorite is the Pad Kra Pow aka Thai Basil Chicken. I love the additional juice and actual cooked basil in this dish which makes it unforgettable. Their spring rolls are nothing shy of amazing and they explode with flavor while maintaining their crispness. When I have a day off in the city this is my go-to lunch spot."], ["Mitchell A.", "Not sure why this place has such a high rating. Perhaps some of their food is good but what I and the rest of my party ordered was dry and just covered in a layer of chilli/curry powder. Wouldn't go back ever again."], ["Monica S.", "Great first experience here. Food came out extremely fast and was good quality. I got a brunch special (weekends 12-3pm) of Chicken Pad See-Ew which came with soup and a spring roll. The soup had veggies and rice in a clear broth and was simple but perfect to tide me over until my entree arrived. I also got a Thai iced tea which was a bit sweet but overall filled my craving. Service was polite but not super friendly. Overall a good experience."], ["J T.", "I thought I would try this so I went for lunch yesterday. I was immediately seated. I sat there for 5 minutes without a menu. When I asked for one the man (seemed like he didn't speak or understand English) finally got me one. 15 minutes later....still no water or any type of attention from the staff. I even asked whom my waitress was (even though I knew). I ended up leaving with no water and no food ordered.  When I led the waitress says ' thanks coming in'. REALLY LaDy. Customer Service is horrific."], ["YumYum Y.", "I come here with my boyfriend once in a while. The papaya salad and pad thai is a YES. When it's cold outside I like to order this thick rice noodle soup with broccoli. It is YUMMY. The only thing I would complain about is how in consistence the food can be. Sometimes the portion is less than it usually is. Also, its often that the padthai is soaked in sauce or there's no sauce. Once it looked like soup... lolThe staff is always friendly. Except this one lady that never smiles and quite rude. But either than that when you order something with duck the waiter would make duck noises! haha Get a bigger place... cus it gets SO PACKED. That's a sign that they serve good food!"], ["Richard N.", "My family and I come here often.  The food is ALWAYS good and the service is great.  It really is one of my most favorite restaurants in Charlotte."], ["Yingying C.", "it's a good restaurant that you can come once every week or two. Red Curry is great ! But service in the restaurant is not really good."], ["Janet N.", "Always great service! Favorite go to dishes are the pad Thai and padseeawee. Family style eating is probably best to take advantage of the different dishes and vibrant Thai foods! Their papaya salad is very very spicy!! Make sure you can take the heat!"], ["Han C.", "First time in Charlotte, first stop in this store, Nice food and service! Will come again"], ["Supreeth R.", "This place is generally good for their food and ambience. Decent pricing of meals too. Sometimes, the food gets a little on the tangy side, but most of the times, the quality is decent. Its a must place for Thai food lovers .."], ["Casey F.", "Some friends and I were in town for the weekend and we tried Thai House on a whim, even though the reviews were so-so.  We went for lunch at around 1:30 on a Saturday and were immediately seated.Our booth was roomy, and the decor was a little more festive than other Thai places I've been to. Our service was good - the waiter was very nice and kept my glass filled, so no complaints here.We each ordered lunch specials, which come with a spring roll and soup. The soup didn't do much for me - I assumed (which is my fault) that it would be a creamy tom kha-type soup, but what we got instead was vegetables in a clear broth. The soup wasn't bad by any means, it just wasn't great. I could take it or leave it. The spring roll was good, though. Crispy, not too greasy, meatless filling.I can't speak for what my companions had, but I ordered the Pad Krapraw with chicken and it was pretty tasty. I'd give it 3.5 stars. At Thai restaurants I haven't been to before, I always get medium spice instead of hot just in case it's a place that is generous with the chili peppers, and I'm glad I did here because the medium was quite hot. Not, like, blisters on the insides of my cheek hot or anything, but it wasn't a medium. I'm okay with that though, since I like my food on the kicky side. The rest of the dish was perfectly spiced too - you could tell the basil and onions were there, but they didn't overwhelm the dish. This was the third day in a row I'd had Thai food (I was on a kick, okay?), and even on top of that, this place was still good. So overall, four stars for me. I'd go again the next time I came to Charlotte."]], "Chi Thai": [], "Monsoon Thai Cuisine": [["FoodLover A.", "I've tried all the Thai restaurants in the Charlotte area, and I have to say this is the most authentic tasting. All of their basic Thai stir fry and noodle specials are spot on - even beating out the ever so popular Thai Taste (on East Blvd). Favorites:Appetizer: Mee Krob, which is classic chicken lettuce wrap. Other places give you noodles with a tiny little bit of chicken. But Monsoon's can be eaten as a whole hearty meal. Their version has a lot of savory gravy (so if you are into the dryer stir fried chicken wraps, this may not be for you) Stir Fry: Pud Prig Pow, which is the classic thai basil stir fry. Nice flavor, with good amount of basil.Noodle: Lard Nar. This one isn't always available at some of the other Thai places around town. So seeing it on the menu, I had to try - and I was delighted.Aside from the good food, the staff is friendly and the service is fast. Price point is comparable to other Thai places around."], ["Devanshi P.", "One of the best places in Charlotte for Thai food. I got the Pad Kee Mao and it was delicious. The service was good and everyone I went with was raving about their meal. I will definitely come back here again."], ["Leah R.", "Well done! Stopped in for a quick lunch (thankfully a non-fast food option for many blocks) and found a clean space, great menu selection, friendly staff, and extremely affordable prices. The lunch special included a rice & chicken soup (simple but hit-the-spot), perfectly sized entrees with a crispy egg roll, rice and fresh iced tea. Portion sizes were appropriate, leaving not a morsel of food to waste. All food was DELICIOUS! Meats were tender, vegetables crispy, and the flavors were spot on. They will also adjust the spiciness to suit your liking (and we went for it hot!) Our server had a great sense of humor and was pleasantly attentive. We left thoroughly fulfilled and not over-stuffed. Thrilled to have found a new little gem!"], ["Ash H.", "Never again. I should have known not to stray from Thai taste, but I figured if give them a shot since I live between the two. First of all, they took my order over the phone and I had to call them back to give them my payment and spice level. They arrived with the food pretty fast, so I was willing to forgive the initial interaction. My boyfriend said it seemed light for what we ordered. We opened the bag and a LIVE BUG crawled out of the bag! The we realized they had forgotten half of our order, not that we had an appetite after the bug. After not being able to reach them by phone, we jumped in the car and sped off to take to food back and get our money back. They were closed and unreachable. The food now sits in my car waiting to go back to its home tomorrow. Yuck, gross, ew."], ["Kevin B.", "Good food and amazing customer service.  If you order takeout expect it to be ready in about 15 minutes."], ["Jon O.", "Awesome food here. I have tried one of their Stir Fried dishes as well as one of the Curry and they are excellent all the way around. I'd probably rate this place as just a bit better than the Thai house. The staff is super friendly here as well. Also, the prices are very reasonable for a lunch."], ["Arpita M.", "My husband and I had ordered-in once, out of sheer laziness and the desire to try something new. We had the red thai curry and rice and were pleasantly surprised with how delicious it was. So we made a lunch visit & had 2 options from the stir-fried menu. For starters, the restaurant is a small cozy one, almost homely. Service is excellent, and this coming from me (read, stickler for good service). Our server was a young cheerful girl and not only helped me choose between a few options (read: good knowledge about the food), but was pleasant, engaging, yet non-interfering. For $9 each we had a sumptuous meal of an iced tea, warm non-heavy soup, and just the right size for a side of chicken with veges, white rice and a golden crispy egg roll. My only complaint was the size of the plate was a tad small. But nothing that spoiled our experience. My husband & I are new to Charlotte and eat out a lot. Monsoon Thai, we both agreed, is a GOOD discovery!"], ["Lauryn C.", "Boo, I was really excited for some Thai food today but this just did not satisfy my craving. They have a decent lunch menu priced well for $8 to $10 you get soup and an egg roll. The food was just mediocre service was just ok...they delivered the wrong food but they were nice about getting us the right order. Unfortunately Monsoon you will not be added to my regular lunch venue list... the place was really busy so who knows maybe it was just one bad lunch and I should give it another try...I'll let you know."], ["Jennifer M.", "Food was delicious & service was fast & friendly.  Pan fried noodles & curry #22 were very tasty!  Will definitely return!"], ["Stephanie T.", "Sorry friends, but I have experienced much better Thai cuisine in Charlotte than this.  We started with the fresh rolls wrapped in rice paper.  It was mostly stuffed with noodle and barely any shrimp or basil.  Majorly lacking in flavor.I ordered a salad, I do not recall which one, but I asked for grilled shrimp in lieu of the fried options.  I got a soggy salad with dressing that smelled like dirty feet. $20 later, I really wish I had stuck with the leftovers in the fridge!My friends' food looked soggy and over-sauced as well.  The service was friendly, but that alone cannot make up for bad food."], ["Kevin L.", "Stay away from the upscale Thai places and hit this up instead.  I have yet to find a better dish of Pad Thai in Charlotte.  My next adventure is to somehow sit down and order something other than the typical Pad Thai order.  Recommend lunch because the pricing is better and it's the same amount of food.  It's $10 vs $15."], ["Paula G.", "Four stars, again, might be stretching it for the overall package (IE. the abandon parking lot at night , the tacky menus both take out and dine in and the price point for all of these lovely features) Having said that, the fried rice (Kow Pud) gets four stars for sure! And they have this special sometimes it's crispy chicken and scallops that is fabulous! The coating and crispness of the chicken and delicious scallops covered with a yummy sauce is an awesome dish. *Hey General TSO (flippin him the bird)* I am thinking of boycotting Chinese fried rice for the rest of my life.There is so much more flavor with Thai fried rice. And many other food choices on a Thai menu for that matter, that are similar to Chinese dishes. I love Calamari. Though sometimes a little tough here, the \"sweet and sour\" sauce they serve it with is good. It has a nice little kick to it but still very sweet at the same time. I want to Sharpie (a Sharpie pen seems fitting for the tacky menus) the sour part off of it and replace it with spicy so it reads sweet and spicy sauce. If you do not ask for a spice level here most everything (I have had) comes mild meaning no spice present what-so-ever. Dare I say almost everything taste kinda sweet. Mainly the Pad Thai. So be sure to tell them how spicy you like it. Kick it up a notch will ya! Hell, give me another reason to down a Singha! The poultry and the fish that I have ever had included in the dishes were good. Service is good but like someone else mentioned it was pretty empty on those visits. They must be doing something right they have been here for 16 years I believe. Maybe everyone that dines here enjoys \"packing heat\" HA! Pun intended! HA!"], ["Trina T.", "Excellent food and great service. The restaurant has a very good feel/environment."], ["Julia S.", "By far the best Thai I've had in Charlotte.I would be more excited if the prices were a bit lower-- there wasn't an option under $11 on the menu, including vegetarian mains. But when I asked them to make my curry \"thai spicy\" (their menu refers to that level of spice as \"native thai\" spice) it came out almost as hot as I'd hoped, but also managed to maintain a deep level of flavor. There were a number of vegetables in my green curry that had not been advertised for on the menu, but they were all cooked perfectly (even the canned baby corn ! ) and added to the end result. Tom Kha soup was good, if a little bland, and the two noodle dishes my buddies chose were awesome (but if there's curry to be had...).Service was attentive but not annoying. It was very empty, and I hope for their sake it isn't always like that... saw a number of people come in to pick up orders, however, so they must do a good take out business."], ["Hailey H.", "I've only eaten here during the lunch hour (oddly always in the same booth), and I've been happy with it every time.The lunch \"combos\" ($8-10 depending on your protein/veg choice) are served with a spring roll and soup which will forever remind me of Campbell's chicken and stars. Some days it's well made, some days all the starch has seeped out and it's like a porridge... edible either way.The Pad Thai reminds me a bit of the one served around the corner at Thai Taste. Not a bad thing, I like both- not too peanutty. Lately, the Pad See Ew has become my usual order. Last time I asked for extra veggies (a few carrots, mushrooms, something to up the vitamin count) in it and after a little confusion I got it - a lot of it. (I don't know if adding other veggies no longer makes it a see ew, but I didn't really care) Carrots, baby corn, mushrooms, green beans, squash, zucchini, and cauliflower in addition to the standard broccoli. AMAZING. (and they didn't even charge extra)Let's talk about the spice level... most places around town it's on a scale of 1 - 5, here it's 1 - 4... and 3 eventually triggered the waterworks. (for reference, a 4 at thai taste barely makes my nose run) surprising- but so good, and so spicy. Plus, the food already comes out of the kitchen mouth burning hot (temperature wise).Good portions and attentive service, though the after you get your meal part can be a bit slower than the before. They're very efficient at taking your order and bringing all the food, but if you need a to-go box you might have to go hunt one down yourself. Most of the time they end up bringing the check to the table instead of you having to get up and pay - but it kind of depends on how busy they are."], ["Augusto L.", "This place is excellent for lunch or take out dinner. The Pad thai is the best in Charlotte, the green curry dish is also excellent. If you like spicy food (really spicy), you need to try the Sum Tum Salad... it is made with green papaya, tomatoes and lettuce. It is fresh and flavorful. On a hot day, I can't think of something better."], ["Stephanie V.", "I go to Monsoon when I want decent, inexpensive Thai. I don't go for ambiance or sexy decor. I either grab takeout, or eat here solo, because it's quiet and the staff doesn't hound you every 2 minutes. My go-to dishes are the vegetarian fried rice, which is a huge serving with lots of veggies and egg, and the Peah Kai Yas Sigh (stuffed chicken wings). I've had a couple of the curries, but I keep it simple with the fried rice and an app. Great place for a quick lunch."], ["Tom G.", "I love the snapper fillets, I have tried the soft shell crab which was very good.chicken satayfried dumplinsthai tea.Very friendly staff.dont let the little strip mall and the lack of a large crowd scare you away!a nice and quiet meal awaits you!"], ["Pete W.", "Monsoon Thai is, as the pop-up said when I clicked 3 stars, \"A-ok.\"The food was pretty good.  Not the best Thai I've had but definitely authentic.  The young Laotian waitress was friendly.  Service was timely.  Food came out quickly, was piping hot and tasted good.  (I had the Red Curry Chicken.)So why was I left somehow disappointed?It's the second Thai restaurant I've tried since moving to Charlotte two weeks ago and both have left me basically unimpressed.  Sure, the food was fine; even good but... the prices seem really high for Thai.  Monsoon Thai is anything but fancy, but it was $13 for my Red Curry Chicken.I had a similar experience at another Thai restaurant a few nights ago (I'll review it separately) and came away feeling the same way.  That place was beautiful so perhaps they could argue for higher prices but let's be honest, both are strip mall eateries; hardly \"4-Star\" restaurants.Sigh. I doubt you'll be disappointed with your food.  I can recommend going there and I'd order the Red Curry chicken again but still... it wasn't \"outstanding\" and the prices are annoying.  I moved here from Nashville where I had found several really incredible Thai places with much more moderate prices and far and away better food.PS - My yardstick is a street vendor at the head of Khao San Road in Bangkok.  To say that his food is incredible is an understatement AND two can eat for less than $3.  OK.  I don't expect two to eat for $3 bucks in the USA, but my $3 bucks got us 3 or 4 small entrees, rice and bottled water.  In Nashville I could eat for under $10 bucks for one, for dinner - less for lunch and the food at least was close to my little street vendor.  So far, I'm still searching for something close in beautiful Charlotte.  Wish me luck."], ["Jimmy T.", "I came here hungry. I left still hungry, as I didnt have enough food to fill my stomach. I ordered the pad kee mow(drunken noodles). I do have to say it was delicious, on the other hand I felt I paid good money for insufficient food."]], "Thai Orchid Restaurant": [["Victoria W.", "Three stars. I had high hope coming here because a bunch of my friends have been dining here. I thought, if they keep coming it must be worth a try? Later I found out that they come here often more as a convenience because they live nearby...Anyway, to break it down, this place is on the expensive side, their portion is also rather small. I don't even think their food is that authentic or super flavorful, which is strange because Thai food is supposed to be pretty heavy on flavor. I do have to give them thumbs up for nice and courteous staffs, this does not come by often at Asian restaurants. They also have a patio like dining area that has glass panels, which I personally prefer because their inside lighting is VERY dark."], ["John X.", "The food at Thai Orchid is mediocre - period- full stop. I've been an occasional customer for years and I have never had a dish I would consider well-prepared with quality ingredients. Why do I return? Because of convenience - I live within walking distance and sometimes we want something quick to bring home to eat. The other evening we picked up cold duck salad, crispy fried rolls, Thum Yum soup, and a #38 ginger and veggies with beef. A new low for us. The soup was flavorless; the duck salad was missing the advertised crispy noodles, and the #38 was filling, but boring with limp flavorless vegetables. Plenty of ginger though. The rolls were crisp, but lacked any depth of flavor."], ["Amanda F.", "We used to live in Strawberry Hill when we first moved to Charlotte, and haven't been back to Thai Orchid since then (don't know why?). Checked it out again & I'm glad we did.We started with the fresh rolls - they were really good, especially with the dipping sauce. It had a nice kick! I had the chicken and shrimp Pad Thai and my husband ventured into something new - the Gai Nei Lung. It looked like a stir fried chicken, vegetable, cashew combo that's served in a really cool fried egg noodle basket. Great presentation! We both thought it was a little bland, but next time we'll ask for it spicier. They seem to do a lot of takeout orders and I noticed they are part of the Foodie Call service (I've never used it, need to check it out). If you're looking for a new Thai spot, check it out!P.S. here is the link to their menu: thaiorchidrestaurantchar…"], ["Weekendgirl G.", "I went to this place again last night and as always I am amazed. I love the location of this place it's nestled in the shopping center in the  shopping center where Fresh Market is located. The setting is very intimate and the decor is fantastic! For my appetizer I ordered the Thai Orchid Spring Rolls the rolls were crispy and delicious and came with a phenomenal peanut sauce. As my entree I ordered the vegetarian Pad Prik King with tofu and it was amazing I requested them to make it spicy and they were able to accomplish that! The dish was full of wonderful veggies in a creamy coconut curry sauce the dish came with rice! Normally I get the pad thai but decided to try something different and I was not disappointed! I would definitely recommend this place the staff is also very knowledgeable about the menu and very friendly the prices here are also fairly reasonable!!!"], ["Andrea H.", "Best best Thai I've found in charlotte. The atmosphere is welcoming and friendly. And the food very flavor filled. Order #32 with a fried egg added and you cannot go wrong."], ["wen t.", "I bought a Livingsocial deal for Thai Orchid. It was a disappointment going to Thai Orchid. It was toally different than what I expected it would be.  This place have the pan fried noodle and it is very rare for restaurants to make the pan fried noodle right. The pan friend noodle was plain taste and nothing special. The noodle soup was bland taste. The vegetable they used in the noodles were cheap. Bunch of cheap onions and baby corn. There were big slice onions not thin onions.The wait staff was nice but honestly the food wasn't good."], ["Mark M.", "My wife and I have been wanting to try this place a couple of years now, finally did last night, were not disappointed! Everything we tried was excellent. We had the Mee Krob appetizer (lettuce wraps)"], ["Angie P.", "We hit up this quaint little spot last night to celebrate the birthday of Mr. Poprock Photography. :D  Needless to say, it's nestled away in a shopping center that pops up out of nowhere (especially in the dark).It's really small, but adorable! I felt like I was walking into someone's home.  At 7 PM, they weren't busy; it was a bit awkward for it to be so quiet, even with music playing in the background.Luckily, Tonya & Billy are foodies like my boyfriend & I, so we sampled quite a few of Thai Orchid's offerings.  Fresh rolls: Heaven on a plate. I am such a big fan of fresh (spring) rolls & these were amazing.  First of all, they were HUGE! Packed tight & full of ingredients. The peanut sauce was spicy & hot & a perfect compliment.Spring rolls: Just the right amount of crunch & ingredients. The spicy sauce was hot & spicy, too.Chicken wings: Cooked perfectly & again, the accompanied sauce was yes, hot & spicy!  Tonya & I both agreed it would have been tastier if they tossed the wings in the sauce prior to serving. Maybe next time, we can ask politely. :)I had the shrimp fried rice, which wow, the medium sized plate was overflowing with rice goodness.  I was a little taken a back due to having tomato chunks in it, as well as the shrimp having their tails still on.  Due to snacking away on appetizers, I was unable to finish my rice, but Shawn will enjoy it for lunch. Shawn, Tonya & Billy all enjoyed their dishes of flounder, jasmine rice, & Chicken Pad Phed.  Our waitress was nice & checked on us just the right amount.  Our water glasses stayed full.Like Nicole, I am giving 3.5 stars, but bumping up to 4 for the appetizers & portions."], ["MsJenita M.", "We found this place on the GPS.  It's located in between the Fresh Market store.  It looked a little confusing on the way inside.  The atmosphere was quiet but lots of families inside.  The waiter (older gentlemen) was very helpful and charming.  The waitress was helpful in helping us pick out our order and to our personal taste. Beautiful Thai Costumes at the front of restaurant.Afterwards I wouldn't come back but it was just a bad order for me.  I ordered the Pad Thai but with beef for dinner.  I had always heard about pad thai while watching No Reservations and Food Channels. I decided with that.  My other choices would have been to try tuck or something with pineapples.  I ask the waitress for mild flavoring but nothing mild was on my plate.  The food arrived got but became room temperature really fast probably because i had mostly noodles.  The pag thai tasted like literally peanut butter and jelly.  I was hard to think of my food as anything else but a mix of PB&J (jelly: apple flavor).  My mom had originally a vegetarian plate with beef added.  It was good and very flavorful.  My dad had braised shrimp (with sauce) and broccoli. And a thai egg drop soup. Not bad.I would consider trying it again.  Afterall it's rated as a top 10 restaurant in Charlotte.  After looking at the photos, I would pick from there for the first visit.  I wish I had Yelped before I can inside but my phone's battery was low!See pictures posted by me."], ["Savannah W.", "The quality of the food and the service has decreased SIGNIFICANTLY since the original owners sold the restaurant and moved back to Thailand. The new owners are stingy with their portions and the quality of the food sucks! I had been eating there for years but will never go back again. The service this last time was the worst I've ever seen. My server was extremely rude @ it was the owner! I'm done with this place forever!"], ["Rod O.", "Based on last night's meal, and easy Five yelp stars.  This may be unfair because I have been to this restaurant so many times over the last eight years and I know what I like and what to avoid!  This food is extremely consistent!  Every time each dish is as it was on previous visits.  First I ordered Fresh Rolls! These are the largest Fresh Rolls of any place I have been!  Their \"Peanut\" Sauce is the most unique, House-made for sure, super thin, sweet and sour with minced peanuts on top.  The Fresh Rolls earn 4.5 stars and the Peanut Sauce gets 4.1 stars.One of my Favorite Thai Dishes (when it is done well) is stir fried Thai Basil with Beef (my friends and I call it Basil Beast)!  What I like about Thai Orchids approach to Beef Basil is the beef is very good, it has very few other ingredients, Garlic, Peppers, Soy based sauce and Thai Basil.  This simple recipe yields one of my favorite versions of this dish!  The Rice is Jasmine I think.  This dish gets an easy 5 yelp stars every time I have eaten it here!!!For Dessert, Custard with Sticky Rice!  Tastes much better than my photo conveys.  I'm glad I got it though would not order it without a couple of people to share it with and last night I ate it all!!!  I have to keep reminding myself I'm on a diet!"], ["Mitch K.", "Elegant interior, if you can find this hidden restaurant nestled deep in an alley of the Strawberry Hill Shopping Center.  Decor could be a bit overdone, but there is an air of elegance and there is always take-out.Look for the sandwich board and then for white pillars...that's the place.Prices are a bit high, but the food is OK Thai and the menu covers the typical array of Thai dishes.  Portions are reasonable, but on the small size given their prices.Their spring rolls are excellent and we usually order a dozen.  They are firmly wrapped and fired just right, without oozing oil.Their curries are excellent and for those that like the Thai standard Pad dishes, which I don't, you will be pleased.I like how you can order your dish and then amplify it with beef, chicken, shrimp or have it meatless.  Spiciness is very mild.  I ordered spicy, the two pepper logo, and it was not spicy at all.  Live dangerously and insist on spice and they certainly can melt your inlays, but if you like spice, mention it and ask them to jazz it up a bit.  Sooner or later I will come up with the right-for-me level of spice.You can dress up here and one will see families so attired, also couples on dates wearing more than t-shirts and flip-flops.  Your call."], ["Julia M.", "This cute little native Thai family-owned restuarant is a Charlotte staple and it has been tucked away in the center of the Strawberry Hill shopping center for at least the past  12 -15 years (if not longer). Most of the time, the service is good, but there have been a few misses in this department when they are extremely busy. However, overall I am pleased with the food and service and can overlook the occasional off-day. They offer several lunch specials which come with a spring roll or egg roll. They also start you out with a small soup of the day which varies.  I really like their pad thai here and often get it when I am here for lunch since its usually one of the lunch specials.  For dinner, I like their curries -especially the Penang Curry.  (I have only had one really bad meal here and sadly I cannot remember what I ordered on that visit, but it wasn't one of my \"normal' favs.) They season their food for the \"American palate\" so if you like it spicier, just let them know and they will bump it up for you. The portions are definitely generous, so I usually have leftovers... I love getting 2 meals for the price of one!  :-)"], ["Nicole W.", "3.5 stars - bumping it up to 4 for generous portions...Hubs grabbed takeout from Thai Orchid after a very long holiday weekend..I was itching for something spicy and noodle-y, thus pad thai seemed to fit the ticket. Price wise, our bill for two noodle dishes and an order of their fresh rolls came to $28. Not too shabby and a bit less than my Thai fave Uptown. Since I can't comment on the staff or the ambiance, I'll get right to the eats...Fresh Rolls: Light, fresh and tasty spring rolls filled with chicken, carrots, cucumbers, and rice noodles, wrapped in rice paper and served with tangy peanut sauce. The menu said shrimp were in here too, but I didn't see any. Maybe it's an option? Nonetheless, they were large, fully stuffed and a perfect healthy start. Pad Thai: Typical pad thai with shrimp, chicken, green onion and tons o' noodles. I asked for it spicy (not Thai spicy) and it had pleeeenty of kick. Blowing my nose kick. Kick start my metabolism. Flavor wise it's a nice pad thai - not my favorite in Charlotte, but well made and a generous portion. If I'm in the SouthPark-ish area and jonesin' for some Thai, I'll definitely try Thai Orchid again!"], ["Bee C.", "I eat here every week for lunch with a lunch group (their choice, not mine).  The lunch menu is changed weekly and always includes Pad Thai and a curry dish (number 4).  All can be made vegetarian.The lunch comes with a spring roll and soup.  I enjoy both.  My favorite meal is when number 4 is green curry with eggplant and green beans.  It is spicy- beware!The service can be hit or miss but I can easily order, eat and pay within 50 minutes.  As a parent, I have gotten quite good at scarfing down a meal...In the summer this restaurant is HOT.  And I don't mean hot as in crowded and covered with paparazzi, I mean they keep the AC at 78 degrees... sit in the main dining room rather than the sunnier side -room to keep from completely melting down- figuratively and literally.Sadly, the food has declined in quality.  What was once a 4 star establishment is now a 3 star restaurant.  Go get your curry on!"], ["John H.", "Been meaning to write a review for this place for the longest time now....  It's a great 'hidden gem' since it is not very visible from the corner of Fairview and Providence.Definitely my \"go to\" Thai place... everything I have had here has been delicious and the service is great.  I've never tried their take out, but it's probably just as good as eating there minus the relaxed and cozy atmosphere.  Tip:  When mangoes are in season, get the mango and sticky rice dessert!"], ["Michelle C.", "Thai Orchid is an OK Thai restaurant.  The lunch specials are moderately priced and small enough for you to not want to take a nap right after eating.  I mainly get the Pad Thai when I visit because it's usually the 1 out of 4 dishes I recognize on the menu.  I've had better, but it's decent. Today I was happy to see that they had Pad Prik King (or Pad Prig King depending on the restaurant) on their lunch menu today so that is what I ordered.  Next to the item it indicated it was of medium heat (spice wise) and I was fine with that because I can tolerate some pretty good heat.  When it came in front of me I was happy to dive in!  My first bite started off with a good flavor....until about 3 seconds later when the heat hit.  Holy moly, it was so hot I almost started to cry right in front of my co-workers!  I thought maybe I picked up a Thai Chili by accident in that bite, so I drank some water and had some plain rice to cool down the fire and tried again....MISTAKE!  I couldn't believe how spicy it was!  I couldn't even eat the spring roll that comes with the lunch because the heat (temperature) from the spring roll was only making it worse!  I asked a co-worker to try it just to make sure for some reason that my tolerance for spice today wasn't lowered, but he couldn't eat it as well!  He can sit in front of me and eat a raw jalapeno seeds and all and not even flitch and he couldn't stomach this dish.  I've ordered the Pad Prik King for dinner once and definitely know that it wasn't nearly as spicy as it was today!  It was actually quite tasty and that was why I was excited to see it as a lunch special.Usually Thai Orchid is ok, especially for a quick lunch and it's proximity from our office, but I really can't see myself coming back here.  Next time I'll stick with what I know and travel a little further to my favorite Thai restaurant in the Dil'!"], ["Catherine L.", "We just moved to Charlotte and have been looking for a place with great Thai food. This place is not for you. It took over 30 minutes to get our noodle dish and over 15 minutes to get our check once we asked for it. They do a lot of to-go business and the dine in people are the ones that suffer. I am only giving 2 stars because I feel bad giving one star."], ["Julia S.", "Passable, veg friendly Thai place. Nothing out of this world, or even stand out, but a decent choice if you're looking for curry and live in this 'hood. Surroundings are a little contrived and stuffy (think fake village chic), but the interior is comfy, warm, and casual. Service was great start to finish, and we saw an owner (older Thai lady) wandering around, greeting her regulars. Tres cool.Interesting features: hotpots (they have a large variety of soups, all of which feature veg friendly versions) are served somewhat traditionally, in an aluminum pot built around a sterno insert to keep things warm. A large part of the menu is \"pick your meat\" and accessible to veggies via the tofu option, cool cool. But the flavors are toned down (I blame that on the obscene rent I'm sure these guys are paying) and even though my red curry was decently hot (of course, I ordered extra extra extra spicy and this was far from it) it lacked the deep level of flavor I eat curries to experience. Ah well."], ["Chris C.", "Love it here! Pad thai is awesome and my wife loves the red curry. I recommend those two items highly. The owner is a great guy and I guarantee you'll enjoy your evening there."]], "Siam Garden": [], "Thai Taste Matthews": [["Brannon P.", "Staff was amazing but the food was up and down. The coconut chicken curry was absolutely delicious and the portion size was good for the price. I got it pretty (4/5) spicy and it had the perfect amount of heat. Someone else ordered the Pad Thai at my table and it was definitely off and we ended up barely touching it. Definitely wouldn't order that again. Plum wine was very sweet but tasted very good and was something I've never tried before. You get jolly ranchers with your check which was a first for me after a meal. Staff was the highlight of the meal, they are very friendly and quick."], ["Amanda J.", "I love Thai taste! I always get the pad Thai lunch. It's a great value because it comes with soup and a spring roll. Be warned: their food is spicy! I always order a 1/5. The reason I knocked off a star is because I wish they were more consistent with their spice. Sometimes I get a 1/5 and it's totally fine. Other times, it's so spicy I can't even finish it all! Despite this, it's hands down my favorite Thai place in Charlotte. Great food, great value."], ["George R.", "The food here is getting worse as time goes by. Yelpers like to lay claim to the \"Best in Charlotte\", well here I had the WORST Pud Thai lunch in Charlotte! I asked for 5 star hot and I got medium hot as expected, not well mixed in either,  it was \"hotish\" parts , totally mild in others.  In itself not a big deal but overcooked needle thin noodles, no ground peanuts, hardly any sprouts ... it was bland bland bland, had no flavor whatsoever other than...salt and sweetener, as in high fructose corn syrup. Personally, I felt it was an insult for them to pass this crap as Pad Thai, but they seem to know their clientele and what they can get away with.I forgot to mention that rice soup ( a facsimile of Gerber's baby soup) is included with the lunch"], ["Bruce K.", "Somehow related to the Thai Taste on East Boulevard in South End, this location has a few differences in the way they approach the lunch specials. Instead of unsweetened tea and a pitcher and a squeeze bottle of sugar syrup, they simply have sweet tea. Fewer condiments on the table. And they take the check at the table instead of at the register.But the differences don't end there. The lunch specials \"menu card\" is the same with the same prices, but I found the Pad Thai with Chicken a little hotter (two star fresh here is equivalent to three star fresh in South End) and it was mixed up differently. Slightly different flavor and texture. Not better, not worse. Just different."], ["John F.", "Best currently open Thai food in Charlotte area that I have experienced to date.  They honored my request for native Thai spice on the last several occasions.  Great food, value and service with pleasant atmosphere.  We will be back for more!"], ["Giannabrie F.", "I don't know why I chose three stars...It just wasn't as bad as 2 stars but not as good as 4 stars.  I just overall didn't really enjoy my experience here.  The service was ok, just not super friendly.  The food was decent but nothing special.  I tried the chicken pad thai and the flavoring was just odd.  It is almost as if they cooked some type of fishy fish in the same pan right before heating up my frozen meal.  It came out too quickly to be very fresh and I couldn't really taste anything but a fishy aftertaste and there wasn't any fish in my dish.  Bleh....The chicken was not tender either...it was chewy and I left most of it on my plate even though I really wanted the protein.  It just wasn't worth choking down the \"smicken\" or whatever type of alternate meat it was.Won't be back.."], ["Michael N.", "Okay - so I didn't go in - can't speak for the decor - we were at the Carolina Beer Temple across the way and ordered take out - the fried tofu was pretty dang good - had a nice nutty flavor. The summer rolls were a bit bland except for the basil, which is pretty much all you could taste. The Massaman chicken curry was out of this world though - brought my experience up from 3 to 4 stars when I tried it. Hope to go back and visit both places again. Every neighborhood needs a good Thai restaurant. Am I right, or am I right?"], ["Annika W.", "I thoroughly enjoyed my food here, the vegetables were fresh and crunchy, service was very nice and helpful. I'm usually wary of the quality of Asian food after many bad experiences, but I was completely happy here. I had the vegetable green curry, which was delicious and surprised me with many different flavors of coconut, basil and lemongrass. My husband had a fried noodles dish with chicken and was also really happy. We'll be coming back here!Edit: Came back again later, and realized that flavors don't vary very much between dishes. That was a little disappointing, but the food there is still good! Edit June 2013: Thai Taste of Matthews got a 93.5 health rating. Not so good."], ["Lillia T.", "We ordered the Shrimp Pad Thai, Summer Rolls, and Fried Tofu. The food was delicious and fresh. The service was friendly and accommodating."], ["Patrick H.", "Great food, very fast and friendly service. Only wish they wouldn't close for a week for every holiday....."], ["Berta S.", "My husband and I found this place while looking for a restaurant to eat in Matthews . It was an after all pleasant experience . The food was good. We ordered the Tom yum soup which was a great choice .  For appetizer,    We had the Koong Gra Bok or Marinated shrimp in egg roll shells, deep fried and served with sweet and spicy sauce . It was also good but nothing exceptional . For entrees, we chose two items.  The Pud see Euh was my favorite ( Rice noodles ) prepared with a mix of vegetables . Our server was very helpful and helped us with our choices. We definitely will be back ."], ["Siana C.", "The best Thai food I've had....ever. For the past 4 years, I've eaten here every 8-10 weeks (I would eat here more if my eating-out budget allowed.)Pad Thai, (level 3 spicyness) is fantastic. Fried Rice: great. The beef & chicken skewers with the coconut dipping sauce is addiction forming :) I ALWAYS finish my meal with Mango Sticky rice. Sometimes, I just head there for this desert treat alone.  The staff is always exceptionally friendly & accommodating.I love cooking at home, and will often learn how to many of the dishes I enjoy at restaurants. Thai Taste is the exception; I simply cannot match the ambience, food,  and staff experience at home. That's what eating out should be all about, right?Love Thai Taste."], ["Joe A.", "Finally found myself in downtown Matthews for lunch and stopped in at Thai Taste. I knew it was there but just hadn't had the chance to try it yet. It was just after 1pm and the place was fairly busy but I was seated right away. Went with the chicken Pad Thai with a level 4 heat. The chicken was tender but the heat fell short on where I expected it to be. That's ok, the flavor & texture was spot on. The spring roll was crispy and hot. The staff was friendly and quick to refill my tea. Overall a really good experience. I look forward to going back."], ["Rod O.", "Pad Kee Mow, close enough for four yelp stars.  Ordered without Egg, served WITH Egg, still real good!  The way they cooked the egg is the way I would cook the egg for this dish or for Pad Thai or any stir-fried dish!  This was the best meal I have eaten at Thai Taste (the last one was shortly after they opened this location years ago).  The Pad Kee Mow carries the stars (4 yelp stars) for this dine!  The service was good though I usually do not add or subtract stars or even fractions of stars for service good or bad!  So good service does not increase their rating though the rest of the food could bring the rating down, I'm over looking it this time!The Chicken Satay was A-OK close to 3 yelp stars.  The Peanut Sauce was better than most, though not as good as the best ones - 3.2 stars.  This means I would not order it again. The soup and the spring roll were included in the meal and would NOT get 3 stars, maybe two, though I do not let \"throw-away\" items effect the overall rating of the meal most of the time including today!Great Dinning Room, almost a Sun-room.  Glass around three sides shows off the outdoor patio! The Decor is Simple, not gaudy!  I like both Simple and gaudy, though I prefer Simple!  If I were giving stars for how the place looked I would say this place has potential and the stars would not effect today's dine rating!  Usually the way a place looks does not effect my yelp rating."], ["Betty S.", "My husband and I ate lunch here for the first and last time 7/26/14.  Our waitress, who appeared to be the owner or manager, was very rude and argumentative.  She refused to even consider our one special request (steamed tofu instead of deep fried).  Her answers to all our questions were always  \"no.\"  She seemed to be doing us a favor when taking our order and bringing us the overcooked, BLAND, greasy, overpriced poor excuse for Thai food.  The women's bathroom was dirty and needs a complete renovation.  Thai Taste is awful compared to all the other Charlotte area Thai restaurants.  If you do decide to give it a try, don't order any shrimp dish.  The chef has no idea how to cook shrimp."], ["Patty L.", "Practically born and raised in Thai restaurants because my family owns several in Chicago and Thailand  -- I hope that means something when I say I will never go back to this place. Worst Thai food ever. Sometimes when I walk into a place they immediately wonder if I am Thai and ask me if I want \"authentic Thai\".  Isn't that what I am here for?  Immediately I recognize that I might not have always have a good meal if I frequent the restaurant.  I walked in to Thai Taste and got several looks and stares but none of the owners or wait staff ever asked me.  I figure that this place has been around for years and it's busy so it must be decent, right?  This place just serves whatever they throw on a plate and calls it Thai food, maybe that's why the restaurant is called \"Taste of Thai\" because it sure don't taste like it!  I would be much happier eating Chinese and I don't even like Chinese food.  Just because it's the first restaurant of its kind in the area, does not mean that it's the best or any good.  So enough of my ranting.  Here's some useful information - our table had Satay, Mee Krob, Tod Mon Pla,  Panang, Pad Gra Pow, Pad Thai, and their \"specialty\" Thai Taste Fried Rice.  You know...basic Thai food that most Thais know how to cook. The equivalent difficulty in cooking a few of these dishes would be chicken wings, spaghetti, and beef stew.  I tasted everything (I chuckle now when I say \"taste\" simply because of the name of this restaurant) and did not enjoy a single thing. The meat was either dry or tough, the flavor was either lacking in one dish or foul in another.  It also seemed like the cook was trying to be \"creative\" but ended up tasting (haha, there's that word again) like a disaster.This place is busy and I have heard good things about it from locals.  I have also heard that before this place opened, no one really has had Thai food before.  My experience with people and Asian food, actually food in general in NC, is that people don't know the difference or don't know any better. So readers....here is my recommendation - skip Thai Taste and go to Thai 1st Bistro @ Blakeney and get yourself some decent Thai food!  It's worth the drive.A message to the Thai Taste owners: stick with simple basic Thai cooking.  Stay true to the flavors and ingredients of Thai food by keeping it authentic."], ["A W.", "Never in my life have I been ACCUSED of something when simply trying to pick up my to-go order! I walked in to retrieve my order of Pad Thai, to be confronted by a hostile, fire breathing woman asking me if I had written a negative review on the Internet because whoever did....placed an order similar to mine. I told her no, that it wasn't me...because surely there has to be another person on earth that has placed an order for meatless Pad Thai. She asked me again. I told her once more that it was not me. She then summoned an older women to the front where they exchanged foreign language shenanigans and at that moment, I no longer was ok with this bullying by little angry Thai women. It was also apparent that they had decided I was the guilty party before I even arrived, so I definitely was NOT ok with eating that (probably tampered with) food. I was a patron of this mediocre place because it was closer to me than Basil Thai...but from now on, I will drive further for better service and better food. And now....I definitely am writing a negative review and will shout it from the mountaintops that this place has horrible service with food that is extra average & should not be patronized!"], ["Peter E.", "I find myself in agreement with some of the other reviewers (some of whom I'm never in agreement with). I've been here several times for lunch and a couple times for dinner.There are few options in Matthews-Mint Hill for Thai food, so Thai Taste Matthews serves to fill that void. A unique corner space in Matthews Station across from Town Hall, Thai taste is elegantly decorated and staffed by warm, welcoming employees.For lunch, they are fantastic. A variety of menu items that arrive well executed. I find their lunch portions to be just the right size, too: not so small you find yourself snacking but not so egregiously large that you need a mid-afternoon nap. I'm not the biggest fan of heat, so you order your spice level using 1-5. Two is usually where I fall, especially if it's in a coconut sauce with a slight sweetness to cut the heat. Friends who are into hot and spicy are happy with a 3.Dinner, on the other hand, has not been as kind to me. The prices are noticeably higher for many of the same dishes and the quality seems to lag. Maybe I've just been on bad nights, but it has happened more than once and worthy of noting.For a quick Thai fix, especially when the mood strikes midday, Thai Taste will certainly fit the bill if you are in Matthews."], ["Todd R.", "Not only do I love this place, but I'm quick to send friends. The soft spring rolls are fresh and very authentic. The taste brings back memories of Southeast Asia. when within 30 miles and looking for Thai, this should be your first pick."], ["Seth A.", "Thai Taste has good reason to be the oldest Thai restaurant in Charlotte; its bursting with flavors, very attentive wait staff, and reasonably priced.  I recently visited the Matthews location (across from Beantown Tavern and the public library) and I was filled and fulfilled with what I ate.My friend and I began with the spring rolls. crispy and not saturated in oil.  Our waitress explained the different lunch specials and combinations of meats (4 meats and tofu) and curries (three of varying heat).  I ordered the sesame chicken lunch special.  Unlike sesame chicken at Chinese restaurants, the sauce was not at all heavy and sweetened beyond recognition.  The chicken was white meat and lightly fried, covered with a spicy, sweet sauce and fresh broccoli florets, served with a large bowl of clumpy white rice.  I sipped on hot jasmine tea from a small kettle, which the waitress replaced twice and offered a third refill.  Who does that?For $14, I think is a great place to get a \"catch up\" meal with a friend.  If you eat too much, you can always walk it off in downtown Matthews.  Kudos, Thai Taste!"]], "Mai Thai II": [], "Basil Thai Cuisine": [], "Thai 1st Bistro": [], "Deejai Thai Restaurant": [["Samantha K.", "I went to Charlotte for a concert and went to Deejai before heading to our concert. The menu had a lot of great options, had good prices and the wait staff gave excellent, attentive service. I had the Pad Thai Chicken and it was one of the best pad thai chickens I've had. My wife had the pad thai tofu and she also described the dish as one of the best she's had as well. Whenever we are in Charlotte again, we will definitely check this place out again!"], ["Greg G.", "Darn they're closed today:(( Guess 3 days after July 4th is still a holiday..........,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,"], ["Lucas P.", "Love this local thai joint. It is way less filtering of to go orders like Thai Taste on East. Great intimate dining space to enjoy some of Charlotte's best Thai! The service is top notch and the food is outstanding. I enjoyed the Pad Kee Mow with chicken (spice level 4 , +1 to the typical) and it was full of flavor AND heat which is rare! The chicken was no mystery meat. We also enjoyed the spring rolls - those were top notch!"], ["Claudine S.", "This was a wonderful surprise. My parental units were tired and asked if I would bring home some grub. I wasn't in the mood for the usual pick up and take home - so decided Thai and something on the way to get my girls their dog food as well. So Yelp pointed me this direction.. They are def on my de-lish list. I was immediately greeted once entered. I sat at the bar, ordered a chardonnay while I looked over the menu. I ordered the Basil Fresh Rolls, Tom Kha soup with Tofu, Pad Thai Beef and the green curry with tofu as well, this was plenty of food for 3. I even had left over's for the next dayMan, it was damn good! It is a bit pricey, but worth it! I will be going back for sure!"], ["Dimitri T.", "The quality/price relationship doesn't get any better than this family owned Thai restaurant.  Excellent place to meet with friends or a business lunch.  Service is always good, and the food excellent.  I'm addicted to Panang Curry (with chicken), I often have to force myself to order something else."], ["LH P.", "Worse Thai food ever!!!!!! Absolutely NO flavor, too salty! Meats smelled like old rotten fish! Fish was a bit fishy seem like have not been cleaned good. Nothing taste like Thai! Not recommended! The 1 star is for the water boy and the nice outside sitting area."], ["Liz K.", "Really good Thai food.  Desserts were ok, I liked the fried bananas, though."], ["Kellie K.", "I always forget Deejai Thai exists because it's tucked away next to the Manor, but it popped up on my radar screen one Wednesday night, and away we went.  I like going to Deejai a little bit later on a weeknight because parking is easier in the strip mall lot, and when it's full, it feels full.  Honestly, the crowd usually makes it or breaks it for me.  The night we went most recently, it was about half full and felt energetic, and I didn't feel like I needed to scoot my chair all the way in til it hit my spleen to get some room.  However, I do love that it's dark and romantic... because then I don't have to wear makeup.The service was prompt as usual, and I got the chicken pad thai ($12.99) while the fella got beef pad see u ($12.99).  Since it was a Wednesday night, one of their bottles of wine was half off, so we got that, too!  I was in the Clean Plate Club after about 20 minutes of inhaling my dinner, and the fella said his was good but mine was better.I really need to do a better job of remembering that Deejai is out there.  Now if only I could figure out how to pronounce it..."], ["Linda H.", "The food was excellent but walked in at 2:45 and it was very obvious the hostess wasn't happy about it. She told me they closed at 3:00. I started to leave but they were open. Not at all welcoming. Won't go back, at least for a good while."], ["John F.", "I moved here from San Francisco and San Diego (homes of great Thai food) and this is by far the best Thai restaurant we found in Charlotte. It's just as good as my favorites there. We have yet to eat inside the restaurant - we order takeout. The Pan ang Curry is just as delicious as my favorite Thai restaurant in San Diego. Also, the Pad Thai is delicious."], ["Jen C.", "The sushi and thai dishes here are amazing.  I love to get a curry dish with a request that it be a level 3 spicy, which is the spiciest.  The sushi here is amazing, as well.  I would definitely make a reservation on the weekends if you can.  There is usually a Groupon offer - $22 for $40 but they are currently sold out of those so that was a disappointment.  My boyfriend and I consider this \"our place\" because we went nuts here one night and everything was absolutely amazing!"], ["Shauna C.", "I went to Deejai Thai for dinner yesterday and really enjoyed it. I decided to go with the Lemongrass chicken and it was spicy but mouthwatering. I opted for noodles rather than rice and it wasn't a problem. The dinner portion was a great size for $12.99, and it would be enough for leftovers (though I'll admit I ate the entire thing). I also tried a bite of the Pad Prik which was slightly less spicy but very flavorful as well. I loved all of the veggies in both dishes- they were plentiful but light at the same time. We started with spring rolls and basil rolls- both were tasty- but I don't think I am as big of a fan of basil rolls as some of the other folks here though as I could have gone without them. The atmosphere is nice & clean, and the service was good as well. I will definitely be back to try some of their other dishes. Great prices and delicious food!"], ["Erica L.", "Mom treated me to a birthday lunch yesterday.  We beat the lunch rush since we got there around 11.  Nicely decorated, cozy seating.  It looks like they also have a nice outdoor patio seating area when it's warmer.Started off with complementary chicken rice soup (although the menu says free soup or salad with dine-in, we were not given the choice) and those addictive crunchy fried noodles with the sweet chili sauce.  Of course we ordered Pad Thai to honor the tradition of eating noodles on one's birthday \"for long life\".  It was yummy with the jumbo prawns.  We also tried the Pad Prik with seafood, but turned the spice dial down to mild. The second dish was just okay, and there was a higher proportion of rice to seafood and veggies.  We both split each meal and had enough to split a second smaller meal the next day.Service was fast and friendly.  I would not mind going back to try a meat dish or their dinner menu."], ["Julia M.", "I met a co-worker at Deejai Thai for lunch on the way to a meeting.  We met at noon and were seated right away.    We both decided to order Penang Curry w/Chicken. The service was super-fast and the food was very good.   I would definitely eat here again."], ["Maddie M.", "Let me start off by saying that the food here was very good and if I just had to judge them by food I would give them 4 or maybe even 5 stars. We ordered the green curry with scallops and eggplant, the Pad Prik and the basil rolls. Everything was delicious! The green curry was mild yet full of flavor. I think they have at least three different kinds of green curries, but the scallops one was good, especially the eggplant part. Usually eggplant (if not cooked all the way) makes my tongue itch and I've heard it happens to a bunch of people, but theirs was very well made and I felt nothing but bliss on my tongue. Careful with the Pad prik though, it can get spicy. If you are not very good with spicy, you might want to ask them for a spice level 2 (default is 3), but I would never make the mistake of making it 4 or more unless you KNOW you and your insides can handle it. The basil rolls were really good as well. All the flavors melded well and the sauce was not too peanutty. Someone else from our party had the mango pudding with rice for dessert and were really happy with it. They said the mango had a very nice flavor. The ambience was nice as well.My only problem was that these guys don't have a baby changing station despite having a big bathroom. We had a four month old baby with us who needed to be changed so I accompanied her momma to help out and was very surprised to not see a baby changing station. The bathroom was big enough to fit one in, but nope. We had to lay the baby down on the floor (of course we put a changing mat under her) and it was just weird for her mommy and I to be squatting down by the toilet, trying to change her up while she kept wriggling around and flailing her hands off the mat on the bathroom floor. Normally I wouldn't strike down the stars to three for not having a changing station, but last night's experience with a baby and us on the bathroom floor was just not a nice experience at all. Also, the server took forever to bring our checks. We were just sitting there for 10-15 minutes after we finished out dinner and the plates were cleared, just waiting for the server to bring us our checks. I'm not sure I would go here with a family again, but for date night it might be good."], ["Paul S.", "Deejai, I want to love you. I do. Sometimes you take me in your arms and give me what I crave. Other times, it's like you aren't even there, like you don't care any more. I deserve better than this, but I keep coming back to you. It's embarrassing when someone I care about comes into town and it's my responsibility to take them to a favorite local place and really show off what Charlotte has to offer. And I bring them to, say, Deejai Thai. We order. We get two bland dishes. We send them back and reorder, and get 1 amazing dish and another bland dish. I can't keep going like this, Deejai. I need someone who's there for me all the time. I want to give this place a 3, earned wholeheartedly by their curries, spring rolls and their drunken noodle. They are hands down the best in the area. But without the support of a good Pad Thai and many other dishes, I can't reasonably give this more than a 2. Stray not beyond the confines of those few dishes, for you will wander into a world where taste, spice and flavor have been forsaken. And you will be sad, and embarrassed if you've talked the place up to an out-of-towner. Celebrity most likely to enjoy eating here: Charlie Sheen: I imagine he'd be too drunk to care about the blandness of the dishes. Half hour to live and I have to get my last meal here: The drunken noodle never disappoints."], ["Tim H.", "Awesome atmosphere, friendly staff.  Only reason I didnt give 5 stars is because the pad kaprow only had ground beef and not beef strips.  But that's more of a personal issue I suppose."], ["Rachel S.", "I really enjoyed our Deejai experience.At first I was a bit skeptical because the place was so crowded and it took forever to get a seat... we learned our lesson and will DEFINITELY book a reservation next time. Deejai is a TINY restaurant and is very crowded because the food is the bomb, so take my advice and call ahead!Once we were seated the experience was truly top notch. They had great sake (I've never had bad sake, just to be fair), Thai beers on the menu, great spring rolls and some mouth-wateringly good entrees. I ordered the mixed vegetable dish with chicken (I think the Thai name for it had Ruam in it, but I honestly don't remember). My fiance ordered a chicken curry dish that was spicy and absolutely delish!We'll definitely return, but next time we will be armed with a reservation :)"], ["G.R. P.", "First time dining here, have passed by it many times. The food was excellent. I ordered the Druken Noodles w/beef..spice level 3, was just right for me. The staff and atmosphere was great too...will definitely  go back and try more options on the menu."], ["Stephanie M.", "Oh my Thai!  My first experience with Thai food was wonderful!  From the chicken satay appetizer to the green and red curry chicken to the mango sticky rice...I was a fan from the first bite of all of it!Deejai Thai is simply but attractively decorated and the atmosphere is cozy yet family friendly too, we saw a wide variety of patrons in our visit.  I loved the tabletop fresh roses and super cute black and white lanterns!We started with a chicken satay appetizer with a wonderful peanut sauce and a relish like mix of cucumbers and carrots that I really liked!  Chicken was perfectly grilled and the combination of the dips was great!!!My date ordered us the red (medium hot) and green (medium) curry chicken so I could sample both and I enjoyed them both very much...deciding that the red was indeed my favorite of the two.  The jasmine rice was different and flavorful, and a nice balance to the heat of the curry chicken.  My nose did get a little runny at first, but oh my goodness it was worth it and the heat was not overpowering, but just right!!  The peppers, eggplant, green beans and of course chicken in the red curry sauce were just delicious!  The green curry was yummy as well and I really liked the flavor of the veggies in that sauce.We finished the meal with mango sticky rice, which was delightful and suprising...the combination of warm sticky rice with toasted sesame seeds topped with ice cream and served with mango...wow...I loved it!Service was very friendly and our glasses never got even close to empty!  I would most certainly eat here again!  My first visit to Deejai was wonderful!!"]]}