{"Yin Yue Restaurant": [], "Dragon Land": [["Kaushik J.", "The place does not have really great vegetarian options, but whatever they gave me was really good. I had the noodles and it was exactly like I wanted - spicy and freshly made. The staff is friendly and cater to all your specific needs."], ["Bob B.", "Food was so good that my son ate all his brocoli...dipped in General Tso's sauce!  The food was all very fresh as opposed to many Chinese restaurants where it is hard to recognize what you are eating and your stomach confirms that a few hours later.   The owners are the employees and are very kind.  They opened 17 years ago which is a testament to the quality of their restaurant.  Very good and we will be back!"], ["Pradeep B.", "Ordered take out thrice in the last ten days and never been disappointed. Great Chinese food and for the price it is awesome. Mostly the orders are available in 10 to 15 minutes and good quantity even for a small size. Its run by a husband and wife. The lady recognized me the second time onwards and has been very friendly. Would definitely go there again."], ["Ean B.", "First of all, the owner Linda is so very friendly. I absolutely love service with a smile. I'm lucky in the fact in live so close so I'm a regular here. The house fried rice is my absolute favorite and the egg rolls are incredible. The price is very good and you get quite a bit of food. Might actually have this for lunch today!"], ["Samantha A.", "Cheap, homemade chinese food.  Its made to order, any way you like it.  Best for take out, cause the restaurant is quite small.  I used to come here all the time for lunch because it was near the office.  Now in a new office, I still make the trip once in a while!Linda and Eddy are the owners and only employees.  They will certainly remember you and your order.  Very reasonably priced!  I recommend the spicy Basil Chicken and delicious egg rolls!"], ["Clinton R.", "Great food and service. Place is really clean and food is really temperature hot even after a 20 min drive home."], ["Hannah M.", "Love this little place! Best food and friendly service! Lunch specials until 3:30! Awesome!"], ["Randy J.", "Had to try this after the great reviews. A little dissapointed i must say although i had high expectations from the reviews. It was ok and not real pricey.  Food was average to a little bland. Very small dine in area that was crowded for lunch . I got my staple Kumg Pao chicken and hot n sour soup.  Not real spicey. The soup was more sour than spicy. I will say the people there were nice enough but the food which is the important part was your average cheaper chinese food."], ["LJ W.", "Good food the rice is awesome. Rice 1-5=4."], ["Kati J.", "Excellent service and good food. The owner is extremely friendly and seemed genuinely interested in giving us good service. The food took about 15 minutes to prepare because of the fried dumplings but she warned us it would take that long when we ordered. The food was pretty good and the crab rangoons were delicious."], ["D O.", "My first trip here based on yelp reviews.  To be quite honest the phad thai was not very good.  It was soggy, bland taste and does not at all taste authentic.   I spent much time in Asia and have had this dish over 100 times so I believe I can rate fairly.   Nice owners but poor tasting phad thai."], ["Edy D.", "This place is a typical humble Asian establishment and the owner was very friendly. I really wanted this place to be good since it is close to work and on my way home.....but it was not. There was no taste to the food, it very greasy (egg rolls) and lots of gummy coating in the chicken (Sweet n Sour Chicken and Chicken w/ garlic sauce). I won't be back!   :-("], ["Jeremy S.", "I love this place so much! This is my favorite chinese in cbus by far. The fried dumplings are insane and Linda's hot and sour soup is probably the best I've ever had. Highly recommended!"], ["Craig J.", "Great Chinese food at ridiculously low prices. The prices were so low that I was worried I'd be getting some kind of mystery meat passed off as chicken, but what I got was just delicious Chinese food. This place deserves its many 5 star reviews."], ["Jackie S.", "Linda and Eddy are amazing, he always waves to me and she is so sweet, their crab Rangoons are unbeatable and actually have CRAB in them, so many places either just give you straight up cream cheese, or blend the crab out so much you can't tell it's in there, but not here. I love their Hung Sing. Looking forward to trying some new dishes."], ["Jackie C.", "I don't even really like Chinese food, but I love Dragon Land.The woman who works there is so nice and remembers me every time I go in. The food is quality too, always hot, always fresh, just pure amazing."], ["Chris M.", "Upon moving to the area, my girlfriend have been on the lookout for some good Chinese food. We found this place and decided to try it. From the exterior, you'd think that this place was your typical \"bought frozen and heautup\" Chinese place(a lot of places have to buy from the same distributor)...don't judge a boom by its cover!This place is absolutely fantastic! All homemade food by the sweetest family ever. My favorite Chinese food in the world."], ["Anthony F.", "You can't beat the quality of food for the price. The friendly service of a family owned restaurant."], ["Cory N.", "Great lunch specials and great customer service!"], ["Bill D.", "they are proud of their Vietnamese egg rolls which are very tasty. Their food is some of the best Chinese I have have had. small family shop."], ["Kim D.", "Very good green mussels and singapore noodles.  Nice portions and very reasonable."], ["Ryan N.", "Can't say enough good stuff about this place. After trying a few other local places and a few of the chains for Chinese food we never found a place we looked forward to ordering from. We wanted Chinese so would get food from one of the options in our area but never looked forward to it. So in our quest to find a better place we turned to Yelp and saw this place was highly recommended and have been going back ever since.  Both my wife and I highly recommend the stir fry with the General Tso's sauce but have been impressed with everything we have tried so far. As everyone else has mentioned too the service is great too. Just wished they were open on Sundays"], ["Caerleigh T.", "Honestly, the food is pretty standard Chinese - although the egg rolls come highly recommended by me, apparently they are made in-house - the service is awesome.  Just as the other review says, the owner makes it a point to chat with you and pointed out we'd never been in before.  I don't doubt that on our second visit that she'll recognize us!"], ["Patrick S.", "if you are looking for really good chinese food (with some thai and singapore dishes thrown in) at reasonable prices and GREAT personal service this little strip center place is for you. it's not fancy. looks like it was probably a pizza or sub shop originally with a few booths. you order at the counter and Linda (the co-owner/wife/mother) brings it out to you. Her husband can be seen in the kitchen cooking every order. In the summer their kids help out at the counter. i almost always get the chai chai pork -- a malaysian dish -- and it's great. the few other dishes i've had have been great too.here's the real difference though. on my second visit Linda remembered my name and what i had ordered. and she offered some suggestions of other things to try. when i ordered pans of food for my daughter's high school graduation party they insisted on delivering it so it be would fresh and hot at the start of the party. and she refused to take any money for it even though it's a 15-20 minute drive. to top it off, Eddie had hand carved carrot \"birds\" to put on top of every tray. you don't get this from chains. check these folks out."]], "Asian Kitchen": [["Mike G.", "正宗的中国菜！First of all, get here early if you want to do lunch as they fill up fast!  Someone's in on the secret here about how good the food is in this typical on the outside - not so typical on the inside upscale casual strip mall Asian restaurant is.  Now like a good Yelper, I did my homework and John M.'s picture of the Authentic Chinese Gong Bao Chicken intrigued me enough that I had already made up my mind.  I ordered the Gong Bao Xia ie the shrimp version.  It was different, flavorful and very good.  Just picture a lot more peanuts, a ton of chilis and a lot less sauce than the American style.  As usual with most Asian restaurants, the portion was huge so it was a very good value lunch.You'll find there's plenty of interesting dishes to choose from with their authentic menu and for those less courageous, there's the usual stuff too.  Their lunch specials look interesting too.  As usual, it was a good choice for lunch with Anna H. who seemed to enjoy her tofu dish.  Unfortunately, she didn't offer to share!  : - / and : - pI'd recommend this place to you and I'm looking forward to another visit myself.Solid 4 stars."], ["John M.", "Came in and order the spicy wings to go. 5 minutes later, I changed my mind and asked to sit inside and eat. Was told that, he took 10% off for carry out and it would cost extra to eat here and plus tip for the waitress. Maybe I took it the wrong way but seemed kinda rude but at the same time I should of sat down. I'm gonna chalk it up as a misunderstanding. I handed him a $5 bill and said my apologies, here this should cover it. I wasn't in the mood into argue over chump change. Food just got here and OMG their wings are huge! These wings are AMAZING, have to give 5 stars!!!Start ordering of the Chinese menu!"], ["Kevin H.", "This place is pretty good.  I got a dish that I'm not sure was the strongest choice.  The Japanese Udon (9.25) Was tasty, interesting, and well prepared but needed a lot more vegetables.   A few carrot shreds and bean sprouts get you all the yummy flavor of stir fry but the textures on display here were a bit disappointing.  The dish is complete with shrimp, twice cooked pork strips, and bacon, all of which came out surprisingly well prepared in their own way.  Tender shrimp, chewy pork, and crispy bacon topped a pile of rubbery udon noodles with savory sauce.  That's got to be right up somebody's alley but I'm going to have to go with something with a bit more veggies next time. The hot and sour soup (~1.35) was tasty, well balanced, and has nice crispy water chestnut slices and fresh scallions on top.  I really enjoyed it and would at least compare it to some of my favorite takes on this dish, which at it's best is thick, spicy, and actually sour, all of which are cravings satisfied by this soup.The prices are great, the interior is clean, trendy, and has a modern American sensibility that belies the authenticity of the food.  ESPN clashes with the background music and the exposed ducting along the ceiling adds that just-built vibe popularized by Chipotles everywhere.Service was timely and effective despite the fact that I was at an Asian restaurant at 10:30am on a Thursday.  Staff gets a pass for several cardinal sins for servers (sitting and mobile browsing) due to several genuinely professional touches (pre-bussing dirty dishes, using my name when dropping off the check).  Looking forward to coming back next Thursday to try a different entree because I'm almost positive I really like this place."], ["Cherie R.", "Time to update the review!  Living in Bexley, this place isn't too far.  And we're happy it isn't!  We order takeout from here quite regularly - the little one doesn't really allow us to eat out very often.  We've tried a few more dishes from this place, and I can say that the beef noodle is my favorite here in Columbus.  My husband has since upgraded his opinion of this place to one of his favorites in town, as he has tried a few more dishes.  My brother in law often accompanies us and has found some favorites as well.  (Hot and spicy pork ribs.)The prices are reasonable, the food is good - what else can you ask for?  We almost exclusively order off the Chinese menu, which is translated."], ["Jason S.", "I have only been here once.  I ordered the pad thai.  it wasn't really what I was looking for, unfortunately. It was good, it was fresh, and the ingredients tasted as  though they were of quality unlike many Asian restaurants. The pad thais Im used to are a little bit sweet and tangy.  My order was very spicy hot. I like spicy hot, it just wasn't what my taste buds were after.  The service was great and attentive.  The eggroll was pretty good as well.  I will definitely return to try another dish."], ["Ben V.", "Last time my friend and I ate here it was great but this time around it was awful and we felt sick afterward. We had the general, honey chicken, crab Rangoon, and sweet and sour shrimp and all of it was pretty bad to the point of abandoning dinner and throwing it away."], ["Realous P.", "What I've learned about eating Chinese food in Columbus is that certain Chinese spots are only good at making certain dishes. This place has great General Tso's & Sweet and Sour chicken and that's about it."], ["Sarah F.", "I came to know this place from a recommendation from a Taiwanese friend and it does not disappoint. My bf and I eat here regularly, driving across town from Dublin to feast on their awesome menu. I highly recommend the General Tso's chicken and their spicy chicken wings. They have an authentic Chinese menu, too. Everything we have ordered has always been fantastic! The servers are friendly and professional and the restaurant is always in top shape."], ["Angela H.", "This place has good service and food. Recommend getting the General Tso Chicken or Walnut Shrimp. I'm not a huge fan of the egg rolls or crab rangoons but other people like them. All of my Chinese friends order from here, so I think that's a given that this is good Chinese food."], ["yan s.", "I stopped by last weekend when I was in the neighbourhood, ordered takeout for Pipa Tofu and SZ chuan Pork from the Chinese menu. Both came out very authentic and flavorful. Hands down the best Pipa Tofu I had so far around Columbus. Each piece of Pipa Tofu is a little heaven that is a shrimp wrapped inside tender tofu. The owner was nice and kind, top notch service."], ["Tory R.", "I don't often give five stars, but this place was well deserving of five!  I went here with some people from work on our lunch break one day. It was easy in, easy out! It's decorated very nice inside, modern and trendy, yet the prices are insanely cheap! The staff is fast and very polite and the food is really really good!!   I had the General Tso's chicken and it was amazing! I had a cup of hot and sour soup to start with. I had to get a box to take the rest home in as I was so full. Can't wait to go back and try out some of their other dishes too!Great job, Asian Kitchen!!!"], ["Mark K.", "Handy Chinese place for us.  Still, you never know what you're getting into- it's hard to guess what it will be like, just another stripmall Chinese restaurant.This is a good one.  Nice decor inside, very friendly service, good food.  We got lunch specials; Sweetie had garlic chicken, I had Mongolian beef (my go-to comparison meal.)  Both were very good, especially for the price.  Our crab Rangoon appetizer was fairly good; not a lot of crab, but real cream cheese, fresh green onions, and the whole thing made to order.We'll be back."], ["Tina F.", "Asia Kitchen is clean and the staff is friendly. Went on a Saturday night and the place was pretty busy with a few dozen people sitting in and several carry out orders. They can accommodate larges parties comfortably. It was just two of us and we ordered off the Chinese menu. Had Beef Chow Fun which is the Beef Rice Noodle dish. It was very tasty and the noodles extra thick. Beef was extra tender. Mala String Bean isn't your typical green bean. It's a longer, thinner bean. It is A little spicy from the jalapeños and has a really great crunchy texture. Also had the Sweet and Sour pork ribs. I was expecting a thinner cut with bones-in, but it's your typical thick cut boneless pork chop. I enjoy this style better than traditional s&s because it doesn't use all that red food coloring. Overall. we had a good experience. Portions were good, dishes were tasty and prices were reasonable. We would like to come again and try more of the Chinese menu dishes. It's great to have some traditional Chinese food close to where we live."], ["Craig L.", "I came here for lunch twice this week while in the area for work training. The first day I got General Tso with an egg roll and the second day I got the Empress Chicken. I would describe the food here as good but not great. I certainly enjoyed my experience and the prices were very average for Columbus but it wasn't as good as my favorites in town. One major positive is that the chicken in both dishes wasn't over breaded much. I want to taste chicken, not breading, and this place delivered that to me. Don't bother with the white rice. It was a little dry so I don't think they store it well. The fried rice was very good, not too salty. Overall, I would come here again if I was in the area but it isn't worth a special trip."], ["Nicole M.", "I ordered the pad thai with tofu, no egg, mild, peanuts on top. That thing was not really good. It was the worst pad thai I had ever had. It was not flavorful, it even looked bland. The tofu was tough and chewy. The fried rice I ordered for my toddler was just okay. Customer service was fine. I will not be back though!"], ["Rebecca G.", "The staff is always friendly and the food is great! My kids love this place! I would recommend to anyone."], ["Karen S.", "UPDATE TO PREVIOUS REVIEW - No, no, no, no, no!  I just picked up General Tso's based on several reviewers that said it was amazing.  NOOOOO.... it's just like the Chinese buffet's General Tso's. Note to self -  STICK WITH THE EGG FOO YUNG!!"], ["Matt C.", "Service was wonderful; polite & very attentive. The food was delicious, especially the Shrimp Toast! Pricing was extremely fair and the portions were large. Overall very impressed and will be back again."], ["Paul F.", "On the whole this restaurant was just \"okay.\"  The looks of it is a little Spartan with only a picture or two to cheer things.  And the floor has no carpet, just painted concrete.  I played it safe and ordered sweet and sour chicken plus an egg roll.  The chicken was very good but the sweet and sour sauce was unlike any I've run into anywhere else.   They also put the sauce and the mustard out in plastic squeeze bottles instead of in jars or dishes.  Makes it easier for them but not as nice for the customers.  The food was okay but I probably won't be returning."], ["Roni B.", "Tried the spicy wings at my friends party and they were amazing. Not too hot but not too mild. If you are thinking about getting them but teetering back and forth I suggest that you get them! I have never dined at this restaurant yet but i cannot wait to give it a try!"]], "Peking Dynasty Express": [["Chris H.", "Wonderful place, we often go for lunch and have never been let down. The food is alway good and fresh, served hot. The egg rolls are the best and always served fresh. The wait staff always keeps our glasses full. We also get this for take out from time to time."], ["Joshua S.", "This restaurant rocks!  We visit very often, and we've been going for about 6 years.  We've had almost everything (types of food) on the menu, including sushi and the Thai menu.  We also order take-out on occasion and never had any issues.The staff is great and friendly and I would recommend this place to anyone!!"], ["Mike B.", "While I wouldn't really trust this place for good sushi, it's there.What's even better about this place is the chinese menu. They don't deliver, but it's a great place to eat-in. average decor, has never been crowded on the three times I've visited.My favorite dish is the crispy duck. It was juicy on the inside and crispy on the outside from being deep fried, just superb.I've also tried the lemon chicken, orange chicken, sweet&sour shrimp and kung pao calamari all with good success. Average cost per diner is $10-$15, so it's a great place for big groups on a budget."], ["Malia A.", "The best pad thai I've found in town so far!"], ["Cornelia S.", "Been eating here for 9 years.....LOVE the Chinese food and the Thai.....Pa Nang Chicken is great!....wish they made Tom Ka Gai soup.....Never tried the Sushi.....my only complaint is this:You're not fooling ANYONE with those tortillas you serve with the Mu Shu pork!.....pick those up at Krogers didja?If I wanted Mexican food I'd go to Cucos....."], ["Jess S.", "Their regular Chinese cuisine is pretty standard. My husband got the Peking Chicken (kinda like Gen. Tso) and my son got the Beef Sticks (appetizer, since there was no kids menu). Both of those tasted pretty good. I, however, ordered sushi (spicy tuna and futomaki) ... biiiiiiiiig mistake. I should have known better, but I really wanted to give them a try. It was like something from a grocery store. The rice was wet, warm and flavorless. The cucumber was in a huge chunk WITH the skin on. It was so horrible I had to drown each piece in wasabi and soy sauce (which I NEVER do anywhere). I was sure to cross my chopsticks and unfold my napkin."], ["Pete C.", "Peking Dynasty has all the makings of an excellent Chinese restaurant- mild surroundings, fast service, reasonable prices, and crazy big portions. On top of that, the menu here is absolutely enormous, and that's not even including the sushi bar selections. Although it's billed as a Chinese restaurant, you'll also find a healthy dose of Thai food on the menu that's definitely worth checking out. Maybe it's me, but a lot of places have recently been adding Thai entrees to their menus (like Pad Thai, for an obvious example) with little luck. No worries here- Peking Dynasty does it right. If you enjoy spicy chicken dishes that are heavy on fresh, crunchy veggies, the Summer Chicken special may be right up your alley. This may not be a rare dish in most regards, but this is certainly the first time I've ever seen it on any menu in Columbus, that's for sure.The sea food entrees are tremendous as well. Like the Thai dishes, they're loaded with fresh veggies and have more than enough meat to lend one to believe that they were made to be shared amongst two people instead of just one. Classics like Kung Pao or Sweet and Sour shrimp make a showing, as do a couple more interesting dishes like Hunan scallops and Curry shrimp. The latter is likely to burn your mouth off, but if you love spicy food then you're definitely in for a treat.  If you're looking for cheap eats, the lunch menu here has what seems like an endless selection of options that will rarely ever run you more than $6.45 per dish. Nothing here is too out of the ordinary, but then again the portions are generous and everything incredibly well. The price of the combo includes an egg roll as well.One thing I wish I could comment on is the sushi bar, but unfortunately I've never made an effort to give it a try. I hate to admit it, but I generally only get sushi from trendy sushi lounge places like Haiku, Shoku, or Lemongrass. It's all part of the experience for me, I suppose. Other than that, I can vouch for the fact that just about everything on the menu here is more than worth what you paid for it and will provide you with plenty of leftovers to take to work the next day. What more could you ask for?"], ["Kase V.", "They messed up my takeout order."], ["Shawndrea T.", "Peking Dynasty is really good, the service and the staff are exceptionally friendly. I have searched for good places in Columbus and this is one of the few that I recommend to people. The atmosphere is typical for a Chinese restaurant plenty of cultural pictures and decor. I don't usually each sushi, but I did try some from their bar and it was good. They do have a really good and diverse menu. I ordered my food extra spicy and got exactly what I wanted. The appetizers came out fast and my water glass was always filled. Lots of items to choose from they also have plenty of vegetarian dishes if that's your thing. The prices are good for a lunch combo you spend around $6.50 and they jump to $9 for dinner. Definitely worth the time and money and most importantly my food was hot and fresh. The best place for General Tso's Chicken!!"], ["DJ S.", "This is a very good place to get Chinese food. Nearly everything on the entree section of the menu is great. Some of the best spring rolls and crab rangoon you can get in the Columbus area. My favorites are the cashew chicken or shrimp, szechuan shrimp and scallops, pad thai, garlic chicken, hot and sour soup, as well as the spring rolls and crab rangoon. You get a lot of food for your money here. The lunch combinations are moderately priced and they give discounts to Capital University and Devry University students. The dinner portions are huge, more than enough for two servings of whatever you get. The owner \"G\" and his staff are very friendly and helpful. The restruant is very nice on the inside with a bar area with a large flat screen HDTV behind the bar usually showing some sporting events if they are on. \"G\" is a big fan of basketball. I used to get sushi here as well, however it has not been as good since their original sushi chef EK left. They guy who makes it now is ok, but it just has never been the same for me so I usually don't get the sushi from here anymore. All in all I highly recommend the cuisine here and you will definitely get your money's worth."], ["Jo K.", "I used to be a huge fan of the restaurant, but in the past few years, it's gone downhill. Found a cigarette butt in my food a couple of years ago. The sushi used to be great, but it's mediocre. I decided to give it another chance a few weeks ago, but it still just wasn't right. The kung pao tofu had a funny almost burnt taste to it, and the sushi wasn't anything special."], ["Steven H.", "I love Peking Dynasty Express! The service is always kind and efficient and the food is always delicious. The sushi menu is also extensive. I recommend the Philly Roll and Salmon Skin Roll. Try their carryout -- this place is awesome!"]], "Moy's Restaurant": [["Ran H.", "The food in here is fine, but the service is so terrible!!! I ordered a half of roast duck, when I ate the duck, it's too oil, so I asked the waitress whether they have any sauce, like sweet and sour? Waitress said in hongkong, no one eat roast duck with any sauce. So they don't service any sauce. Well..... If she just said we don't have it, I think it's fine. But why said that? It's like they look down upon me. I really feel uncomfortable! I will never go back to this place !"], ["Bernard O.", "Do not go to this place. The lady boss is rude and arrogant. The food is not that good but expensive. The service is so bad yet she demanded full tips. Giving them business would mean you support being treated poorly, and that customer service means nothing to you."], ["J D.", "Recently tried this place again on a cold, snowy-rainy evening, it being closer to home than my preferred Chinese in town (Sunflower and Lee Garden).  I called Moy's and managed to place an order for Hunan Pork, Cashew Chicken and Beef with Broccoli, all non-spicy, but it was difficult. 'Mama Moy' keeps interrupting, interjecting what she THINKS I want, and talking over me. And she talks LOUD and too fast for her own good. Anyway, I think she has my order for pickup. I drive down to get the food, come back and we open the containers only to find none of the orders are right. I immediately called Moy's and talked to 'Mama Moy' again, telling her the problem.  She immediately tells me I ordered General Tso's chicken, Sesame Pork and Broccoli Beef, all SPICY!  I couldn't believe my ears. I insisted there's no way I ordered that, as I detest Gernal Tso's, no one in my group likes Sesame Pork and no one likes spicy food. All the while Moy is laughing and giggling. Finally she says, 'OK, OK, I GIVE YOU FREE ENTREE NEXT TIME COME IN'. She talks LOUD, I tell you.  I hang up and our party makes the best of the situation,not wanting to go out again. Later, I called my credit card company and disputed the bill and it was removed totally from my balance. I also want to make the point that this is the second bad experience with Mama Moy. The previous time I placed an order (again 3 dishes), but when I show up, she has me ordering 5 entrees! She didn't want to give me credit, then, either. I think she just talks too fast and LOUD for her own good, so she doesn't hear properly. The food is not bad, but dealing with the loud-talker isn't worth it."], ["Ruby D.", "Moys was the first take out I got the first night in my new apartment here in Columbus.  I never would have expected my first attempt at take out would be so successful!  I'm a vegetarian and the vegetarian menu is excellent.  I especially suggest the tofu with black bean sauce.  Moys seems to really excel at tofu and spice.  My boyfriend (not a vegetarian) says that the vegetable egg rolls are actually superior to the normal egg rolls.We always get take out from Moys as the restaurant itself is tiny.  Also, parking is kind of a bitch.  We park at the McDonalds next door and one of us stays in the car while the other runs in (to avoid any towing situation).We eat here at least once a week.  I recommend it to people all the time."], ["Anando S.", "Good chinese place. Has the typical 'chinese american' food. The owner was quite loud and actually demanded a tip even before I could get my credit card out. Average interiors but value for money."], ["Adrian V.", "Moys restaurant truly is a diamond in the rough when it comes to quality Chinese food. If you've ever been around the neighborhood, you'll know that there are well over a dozen options for Chinese; Yet none which I would consider palletable when I'm sober. Moys does the exact opposite of what the other \"options\" do with their menus. Moys provides a variety of dishes ranging from the classic Americanized general Tsos, sesame chicken etc, To unique and authentic dishes I have never even heard of, and costs a few bucks more (you get what you pay for). I settled on the Mongolian beef with fried rice after having it recommended by a friendly member of the staff. All I can say is well done moys, well done. The sauce had real depth and the fried rice was actually made correctly! (If you've had hibachi you know the value of well-cooked fried rice). Moving from New York city to Columbus was a very difficult move as a lover of quality Chinese, but after suffering through buckets worth of pre-frozen microwaved crap, I have finally found a haven of flavorful, well made Chinese in the heart of OSUs campus. Huge, delicious portions of food at a fair price and a menu that encourages you to try new dishes. It's the best Chinese I've had in the city so far."], ["Cherie R.", "I cannot tell you how many times someone has told me to go try this place out.  And for some reason, I never made it.  So I finally went.  On the night of the homecoming parade.  I had no idea.  Really.  Took me an HOUR to get there!!!  (It should have taken 10 minutes, 15 at most.)  I got takeout, since it was just little ol' me eating, but the lady who greeted me was very nice.So the verdict?  Very good.  Not FANTASTIC.  But very good.  I got Ma Po Tofu (with pork), rice noodle with beef, and General Tso's chicken.  The last is not something I usually order, but since everyone mentioned it, I figured I'd get it.  Did not like it.  Sorry guys - at least I tried, right?  If deep fried covered in sticky sweet salty sauce is your thing, then go for it.  I'll stick to my favorites.  :-)  The Ma Po Tofu currently has the title of being my favorite in town.  YEAH!  Salty, silky tofu with bits of pork and beans - I could shovel it in all day.  And the best part?  The husband doesn't like tofu, so I get it ALL TO MYSELF.  The rice noodles with beef were also very good - not too much noodle, and just enough sauce.  Most people over do it on the noodle with not enough sauce for me.Just wish the prices were a LITTLE bit cheaper...  I'd be here a lot more often."], ["Ben H.", "Moy's: Unless you're looking for it you might just pass it up. As far as campus food goes, it is much higher quality than the other greasy chinese take out places around. I had the general tso's chicken with hot and sour soup--pretty good! Layout wise it's very tiny inside, which means there aren't many places to sit. Additionally, when it gets busy and the door opens continuously, the room gets freezing from the cold air outside. But still, if I'm ever on campus this is where I'll choose to eat because it's delicious."], ["Shea H.", "My favorite Chinese restaurant in Columbus.  The owner is very personable although sometimes in a bad mood.  I don't care- I love her anyway.I highly recommend the General Tso's Chicken.  The vegetable lo-mein is also deeeeelicious. I'm not a huge fan of the appetizers here; it seems that not as much energy is put into those as is the entrees.  They've got a great lunch special-- do it!"], ["Matt R.", "\"Sensational!\" he said in his best 4-star voice.Was that Ms./Mrs. Moy who served us? (don't get any ideas about the Ms./Mrs. confusion... c'mon Yelpers, keep your head in the game). If so she was the best darn hostess I could have asked for.We went for the beef of the Mongolian and Orange variety. Both quite good, but the Orange Beef was particularly amazing and I would definitely order that again next time I'm in.No beer/alcohol here and if you're looking to have soda, there may be no free refills as they brought it in a can. Better to keep those undergrads on the straight-and-narrow and not give them too many drugs, no doubt.Also not sure exactly where you're supposed to park, but I ended up in the McDonald's lot. Didn't get towed in the hour I was gone, but it was 6pm on a Sunday. Take that for what it's worth.By the way, I'm noticing that a lot of people mention Buckeye Donuts in their review of Moy's. I'm just sayin', sounds like the people have spoken: Buckeye Donuts and Moy's need to collaborate and create a little Moy's specialty: Peking Duck-nut? Well, maybe we'll work on a combo name a little later..."], ["Jackie P.", "Mmmm.... Moy's... I lurve you. In the words of the boy let me just say, \"the beef.\" Oh dear... the beef. He is obsessed. And it is succulent, juicy, and tender. Perfectly cooked.... every time. You really can't go wrong ordering the Mongolian. But ask for a little spice. We are trying to find a delicate balance because sometimes the way we say it makes them add tooooo much spice..and sometimes not enough! aah!The chicken. Just as delicious. No weird hard, dark, oddly strange syrup drenched meats here. Everything is prepared fresh and perfectly cooked.And to what the other reviewers mentioned about vegetables... yeah, you don't really get much of that. BUUUTTTTT.... if you get soup, split a meat, and get veggies on the side (rather than two meat platters) it can be enough for two depending on your appetite.Use the hot oil in your soup.....yuuuummmm!!Come here for the food...stay for the neighborhood feel."], ["Nicole W.", "I really, really wanted to like Moys. Here's the thing - their positives are soooo overwhelmingly positive, but when it comes down to it - I did not like our food and had to force myself to eat the leftovers for lunch (I'm economical - can't throw it away!).First, Moy's greatness:  Even though we only walked in to order take-out,  the owner bustled over, shooed us into some seats, served us water, let us change the channel on the TV to watch the World Series while we waited, and even cracked a joke or 2. I loved it! Second, the chicken is likely the only place I have ever visited where it is real breast meat served. Seriously, I'll say it again because it blew my mind: Real. Breast. Meat.  Not the gristley  half white/brown meat usually served at a local take out joint - just true nice meat.  And they don't see the need to fry every dish and I am down with that.Unfortunately, the sauces on both our dishes were blahhhh. I see the general tso's is quite beloved, but I thought it tasted like bad buffalo wing asian sauce. The Kung Pao was chopped and chilling in a watery soy sauce that really had no flavor, plus no vegetables always bums me out a bit.I thought I was about to find my next take-out love, but I will keep searching. Thanks again to the owner for the superb service though!"], ["Gavin D.", "A couple people were a little pushy to us about trying this place - like we were really missing out.  The mala string beans and General Tso's chicken were the recommendations, so that's what we got.  \"Meh. I've experienced better.\" Describes it exactly.The General Tso's are like chicken tenders (at least the meat isn't mystery gristle like some places I guess) soaking in barbecue sauce - American barbecue sauce.  Just not good.  The string beans were in a not very tasty black bean sauce and ovecooked.The people were nice enough on take out, but dog gone it I want to eat good food near my house in Clintonville and I was hoping this would actually be an option.  Nope.  How this place gets so many positive reviews - and for these two dishes in particular - is beyond me."], ["Chrislyn K.", "You can't bring food or drink in to the restaurant. If you do, the owner will ask you to keep it closed until you leave. I made that mistake!"], ["Emily C.", "As a Chinese person, the food is ok, it's Cantonese style Chinese food, and I'm from the north. The thing I hate about Moy's the most is that the waitress is really rude and mean, and pretty pushy too. None of my Chinese friends would eat there."], ["Ariel M.", "Orange chicken and pickle beef were incredible! Service was warm and helpful, and food came quickly. Will definitely be returning :)"], ["Il P.", "This is not your usual cooperate Americanized Chinese food. What you get from Moy's is fresh, high quality food. It reminded me of the movie \"God of Cookery\" starring Stephan Chow. The shrimp fried rice, and green beans with pork in dark soy paste sauce were both amazing.We actually got there at around 9:20 pm, and the door was locked (yelp indicated they were open till 10 pm). As we were walking away disappointed, a lady opened the door for us and cooked us yummy meals. The result: best Chinese food experience in a few years!"], ["Cheri Y.", "I'm only givin three stars bc I think this place is way overpriced.  The food is good but it's not so great it should cost $60 for 2 people.  This isn't NYC.  My go to place for Chinese is little dragon.  Better & cheaper."], ["Patrick C.", "Moy's is by far the best Chinese food in Columbus. One of only 3 or 4 places in the city I'd give 5 stars to, Chinese or otherwise.I'm a sucker for their General Tso's which is completely unlike any i've have anywhere else. We also really love their string beans in black bean sauce and the the egg rolls are pretty amazing. If you want something a little less tailored to the american palate you can always ask Mrs Moy for a suggestion. I can't always pronounce the things she serves me but they are always incredibly tasty."], ["Emma L.", "The owner who is also the server is extremely mean. So beware. I overheard her scolding some customers for not reading the check before asking her questions. And she dropped my spoon while she's cleaning up my table, she never apologized but glared at me and said, \"you shouldn't have placed your spoon there.\" I heard things about the owner's bad attitude but now I get to experience it myself. Food is okay, but service is the worst in Columbus. Never going back again."]], "Fortune Chinese Restaurant": [], "Little Dragons Chinese Restaurant": [["Charles C.", "Authentic food if you order from the appetizer section and onward.Spiced Beef Tripe Pickle Vegetable IntestinePork w/Chili Pepper"], ["Gwen W.", "A friend and I went for their Sunday (only) buffet. Interesting dishes - almost all of them were new to me! Not the typical Cashew Chicken or Sweet and Sour dishes. Many of the offerings were of the Szechwan variety. However, I was able to fill my tummy with the other dishes.I particularly  liked the two different dumplings. Great meat and veggie taste. I also tried a green bean dish that had pork, I believe. My \"dessert\"? There were these small sesame-covered balls, soft and almost \"gooey\", that had a slightly sweet taste. Totally ticked my eyes, haha.Clean establishment. Great service: the lady checked in with us at all the right times. A pleasant afternoon meal."], ["Andrew L.", "This place is frickin' amazing.  Very authentic, one of my favorite Chinese places.Can it be a bit pricey, with dishes in the 10-15 dollar range?  Sure, but if you are in a group and all share a few dishes, it's not so bad.How do you enjoy a Chinese restaurant like this?  Look - whenever the owners of a Chinese restaurant are gracious enough to include delicious and authentic dishes on the menu in English (as a Chinese American guy who isn't very good at speaking Chinese, not being able to order off of the Chinese menu at some places is a source of great frustration), go for those dishes.Skip over the Kung Pao General Tsao crap (which is probably still tasty, but you can get that anywhere), and instead go for some stuff like this:1) Spicy Conch Salad2) Szechuan-style spicy fish fillet hotpot (Probably not the exact name)3) Frog legs with basilWhat's that?  You're worried that the beautiful conch shells provide a false idea of how the slimy gastropod contained within will taste?  Don't worry.  The Spicy Conch Salad is delicious, crisp, refreshing, with thinly-sliced conch pieces (everywhere else, they are cubed, and don't quite capture the flavor of the conch as well).  The pieces are chewy, but sliced thinly so they can be enjoyed thoroughly, with none of the taste going to waste.Worried Szechuan spice will be too spicy for you?  Well, maybe, but it's never too late to start getting accustomed to spice.  It really isn't that spicy, and the fish is super tender, soft, and flavorful.  The broth is delicious as well.Eww, frogs?  Look, the only reason you should hesitate eating a frog is if you're in the amazon and you're being served brightly colored frogs.  These frog legs are 100% delicious.  While the idea of eating it might be off-putting to you, they really aren't too different from chicken.  Oh, except they're better, as the meat is not dry and stringy like chicken can be.  Don't forget to chew on the bones after.These three food items are just a sampling of some of the dishes you can get here.I really suggest you come here and go for the gold - the real, authentic food, and not the usual stuff.By the way, I also ordered the Rabbit here once.  I felt bad for eating a cute rabbit, and it was very bony.  It tasted great, but was quite a bit of effort to eat.  i liked it, but you may not.  To the server's credit, she suggested I get lamb instead.OVERALL:Great restaurant, good service, fantastic, authentic food - so long as you order the right stuff."], ["City G.", "Just tried this place for the first time and must say I'm delighted. The food was super fresh and the prices were great. The hostess was the sweetest and the place is really clean."], ["Roderick C.", "NO BUFFET ANYMORE! I stopped by last weekend and was disappointed to find they've stopped their buffet, so I turned around and walked out. Their website also no longer makes mention of a buffet. So sad: This had been one of the best buffets offering real Chinese food in Columbus."], ["Tabitha F.", "I was looking for a buffet on Yelp, ended up here. There was no buffet - apparently that's on the weekend. But no fail...not at all. The food was authentic and amazing. The menu has a section for Americanized favs and for authenic fare. I say be brave but no matter what you choose, it will be delish.Service was spot on and friendly. We really enjoyed our visit,  maybe we will catch the buffet one day."], ["Pra R.", "They don't do buffet anymore. I went on lunch weekday and weekend. So I left. FYII wish they did authentic lunch buffet, like Panda Inn and Imperial Garden.  I plan to go there every weekend because I am so sick of Chinese American style. The food probably good but I did not taste it because I only want buffet. It's too pricy for one person to try out many dishes."], ["Anna S.", "Good Singapore noodles, spicy noodles, and chicken sweet corn soup.  I had no idea this place was so close to me!  I only got takeout, so I will be back to try a dinner or lunch service.  Definitely a solid place to curb those Chinese cravings if you live in Clintonville (which is curiously void of amazing Chinese places)."], ["M D.", "I always get the same things here but it never disappoints. Over the years, the portions grew smaller but the taste remains the same. Quality over quantity I guess? It still a very fulfilling amount of food. I recommend their chicken fried rice, make it spicy! Their hot & sour soup is also very good. I love their wonton soup although it is a little on the salty side. Guilty* & their crab rangoon is also a thumbs up in my book! One of my favs Chinese restaurant to go for a quick pick up!"], ["Nathaniel K.", "Average Chinese fare, if authentic.I came here for dinner with my parents based on positive reviews, and we opened the doors to an empty restaurant. Granted, it was still pretty early, and there were five other people eating here by the time we left, but we were a bit worried. I ordered the Family Style Bean Curd off the Chinese menu, and it was almost all tofu with few vegetables, and not much sauce. I was hoping it would be spicier, but it was pretty mild in flavor and spice level. My parents ordered mixed vegetables with tofu in a brown sauce, and it was pretty good. Service was great, although there weren't a lot of other people to pay attention to. I'm not a big fan of Chinese food, but I would come back if a friend invited me. (Though I'm not sure I'd be on Morse again other than to go to the titling office!)"], ["Van S.", "For me the best way to enjoy Little Dragons' Chinese menu is family style by sharing multiple dishes.  Since that's what I've done on my past visits, it made today's meal feel incomplete.For the lonely 1 entree meal today I had the \"Intestine w/ Chinese Basil\".  I actually ordered this by mistake. What I really wanted was to get the \"Spicy Peppercorn Intestine\" because I loved it the last time and was jonesing for some Sichuan mouth numbness.  I looked at the menu too quickly, and ordered the first vague intestinal item I saw.  While I didn't address my Sichuan fix, I still had a very good meal.  The intestine was simmered in ginger and soy with basil leaves throughout.  The basil flavoring was well pronounced and went well with the clean tasting intestine.  The dish was a tad to salty, and probably too rich to eat alone (again wouldn't have been a problem when eating family style).  For those who don't eat this type of thing there's plenty more to choose from.  I'd recommend the sauteed snow pea leek and \"Spicy Pepper Corn Fish Fillet\"."], ["Jeff C.", "Pretty good authentic Chinese food at normal prices for the dishes.  Flavor on everything we ordered was good. My only complaint is that the pork was mostly bone...but thats normal for some real Chinese food.  We had enough to eat with three dishes for two people.  There was a Chinese movie playing in a projector while we dined, which was different but an OK distraction while waiting for our order.  If I  ever have a chance, I'd like to go back for the buffet."], ["Hank Y.", "Having lunch buffet here on Sunday. The food are pretty good! Shui Zhu Fish is my favorite."], ["Michael H.", "Great food and very friendly staff. They have the more traditional American chinese food like general tso chicken and they have authentic chinese food as well so it's a great place for the more picky eaters and adventurous ones. Service was fast and very friendly. Great food for a good price, most entrées were under $10. Would definitely recommend this place."], ["Michelle H.", "This is very authentic Chinese food place. The food is consistently good. It has a nice home-cooking feel to it, but it's still well polished. The staff is very attentive (past few experience). I've never tried the American menu, and honestly, if a place offers both a Chinese and an American menu, the American menu probably won't taste as \"American\" as you'd like them to. That's when you just stick with pf chang, Panda Express, or food courts at a mall.We always come for the weekend lunch buffet bc 1) it's different every time we come here and 2) quality of food is very similar to that from the a la cart menu. Because the food are cooked with attention to detail, they do tend to come out in much much much smaller portion, and they are gone FAST. The place opens at 11 but they slowly put out the foods for the buffet until a rush of people comes in around noon (maybe something to do with the Chinese church near by on Sunday?) The a la cart menu has large portions for the ones I've seen. I've only had one dish a la cart, and it's the beef chow fein (not sure how it's spelled). It's was very tasty.The place is filled mostly Chinese the past 3 or 4 times I've been. The restaurant is at a pretty dodgy place. If it's in a nicer environment, I would probably come get takeouts to bring to work for lunch everyday.So bottom line- come here if you want good authentic Chinese food. But drive down to Panda Express if you just want orange chicken."], ["Mark K.", "Stopped here for a quick lunch, and walked out stuffed and smiling.  I'm reluctant to give five stars in general- a place really has to be good, and I feel like I ought to try this a few more times to be sure- but I am torn between four and five stars for this place, because I had such a good experience.It's in a dingy strip mall, one I'm familiar with because of the BMV and title bureau.  Inside, it's clean and nice.  Service was very good.  I came mid-afternoon so they weren't busy, and was served by several different staffers, all of whom were helpful.  I started with the crab Rangoon, one of my favorites, and while this version wasn't the best ever it was pretty darn good.  I was tempted by the lunch specials, but went with an entree from the Chinese part of the menu, Double Cooked Fried Pork.  I've had twice-cooked pork before and loved it; never considered it authentic, but I'm no expert.  This version was very, very good.  Plenty of meat, in fact maybe too much in proportion to the vegetables.  Everything was incredibly flavorful, though it wasn't very spicy.  Did they ease off for me?  The meat was closer to bacon than in some versions, and I wanted to inhale every bit of it.I'll go back for more from the Chinese menu section, and try some Americanized things too.  I like both types; I've had authentic dishes in Toronto and occasionally around here.  Their menu is pretty expansive, so I'll need to find a reason to swing by this area."], ["Steven F.", "I recommend their Szechuan grill fish, seafood cheese soup, and crispy pork belly.I highly recommended, very authentic better than any Chinese restaurant in town."], ["Stone J.", "Ordered the Kung Pao Chicken and the Triple Earthly delight.  Both were very good and pretty authentic Chinese."], ["Yanfei L.", "The first time I went to the place was crowded because if buffet. The food tasted not good but acceptable. Hope next time will be better"], ["Gen Y.", "Great foods! They just keep surprising me,try Beef Tomato hotpot, amazing! Especially for the coming winter time."], ["Johaun C.", "ok, this is firmly my own personal opinion, but you should not be reviewing a Chinese restaurant if you are ordering dishes like Kung Pao Beef or General Tso's, or Orange Chicken, etc.  like most authentic Chinese restaurants, you have to know what to order--and unfortunately, it certainly helps to be Chinese.  to note, this is NOT a Cantonese restaurant.  Little Dragon serves prolly the best Taiwanese cuisine in Columbus--when my parents are feeling nostalgic, they come from Dayton just to eat here."]], "Helen Asian Kitchen": [["meg m.", "This is a a amazing place. Authentic food, wonderfully prepared. The crab Rangoon tasted amazing. The chef selection of pork w vermicelli noodles was amazing. The cashew chicken was so perfectly seasoned. And the garlic eggplant was fantastic.The location is an old strip club, and they left the mirrors up, so it is awesome. This is a real Chinese restaurant that is not afraid to bring it. Highly recommended."], ["Cherry S.", "Among all the food I ordered, eggplant is the best out of all. For all the spicy food, their flavor shadows the food."], ["Rick M.", "I'm going with 5 stars. You just don't see lamb on too many Chinese menus. The owner seated us and gave us the lunch menus. When I asked for a recommendation, something spicy, she sailed back to the hostess stand and retrieved the secret Sichuan menu.It's a bit of an ala carte menu. There are meat dishes and there are vegetable dishes. Bring some company and order a selection. This would not be my favorite Sichuan in cleveland and I'm not sure if it would be my favorite in Columbus. I will gladly eat here again whenever I'm on the north end of town"], ["Chanwun Y.", "The owners are super super nice! And food are awesome! I recommend their Beijing Zhajiang Noodles and Xiaolongbao! And they also have hot pot! You can call before you come, telling them what you want for hot pot and they ll be ready when you get there! In a word, I love Helen kitchen so much:) best of the month"], ["niki c.", "Authentic food. Amazing textures and flavors. The dumpling section is not to be missed. Xiao Long Bao (soup dumplings) were unique and so comforting. Like something Grandma used to make, if my Grandma were even remotely Asain."], ["Jarrod S.", "We happened upon Helen's when our original destination turned out to be closed. Boy did we luck out! In search of an authentic Chinese restaurant, Helen's met and exceeded our culinary quest by a mile! Eating late, we missed the crowds. Wait staff was attentive, knowledgeable and cheerful. The food came out promptly, hot and delicious! Probably the best Chinese we've had in a very long time!  On our way out, I asked our waitress if they usually had entertainment due to the grand piano situated in the center of the restaurant. She told us the owner was an opera singer. She then lured him out and he played and sang us a beautiful tune. What a memorable experience!"], ["Bryant M.", "Every time I'm in New York, I love riding the 7 to the end of the line in Flushing and going to a dumpling house where English is nowhere to be found. It's one of my favorite experiences in the world. Well, back here in Columbus, there is no 7 train and no Flushing, but there IS an authentic Chinese restaurant with some kick-ass dumplings!Four of us decided to load up on a freezing, snowy Friday evening and make the trek to Northland to check out Helen Asia Kitchen - which is hilariously located in an old strip club. Oh yeah, the mirrors are still there too.I knew the food was going to be amazing as soon as we walked in. The place was packed - and not with people who looked like me. I was in heaven.On that note, I need to point out that the service is more authentically Chinese, not the expected American service. What do I mean by that? It's all about the food, not a syrupy-sweet service experience. You might have to wait a while, you probably won't get a refill, and you probably won't be treated like a king (or queen). Accept it for what it is, and don't let it ruin your dinner.As for the food, I'll quote Susan R's review since we went together:\"We decided to eat family-style so we could try a little bit of everything. We ordered the xiao long bao, the shao mai dumplings, Chinese broccoli, General Tso's chicken (yeah, I know--it's the one Americanized dish I really love, and theirs was almost as good as Yau's Chinese Bistro's), shrimp pad Thai, a scallion pancake, and various little appetizers. The biggest hits were the pad Thai, the xiao long bao, the General Tso's, and the Chinese broccoli, but we didn't have anything that we just absolutely didn't like.\"I really loved the whole experience, and I can't wait to go back. If you're looking for traditional American-style Chinese food (nothing wrong with that), you might want to skip this one. But if you're looking for the real deal and some amazing dumplings, definitely give Helen a try."], ["Susan R.", "The other day, I had a hankerin' for Chinese food. Not just Chinese food, but xiao long bao and Chinese broccoli, which I haven't had since we visited New York last year. The buzz around the internets is that Helen's is the place to go--maybe the ONLY place to go--for xiao long bao. So, a group of us hit up Helen's, curious to see if her food stood up to the buzz.If I were going to rate Helen's on the food only, I'd give it five stars. I can't say how authentic or not authentic the food is, as I've never been to China, nor lived anywhere with a real Chinatown, but to my American (gorilla? cough) palate, the food was great. (I *don't* like overly Americanized, syrupy-sauced Chinese food that you'd get at Panda Express or Mark Pi, or at a Chinese buffet. I have an American palate, but it does have its limits.) We decided to eat family-style so we could try a little bit of everything. We ordered the xiao long bao, the shao mai dumplings, Chinese broccoli, General Tso's chicken (yeah, I know--it's the one Americanized dish I really love, and theirs was almost as good as Yau's Chinese Bistro's), shrimp pad Thai, a scallion pancake, and various little appetizers. The biggest hits were the pad Thai, the xiao long bao, the General Tso's, and the Chinese broccoli, but we didn't have anything that we just absolutely didn't like. I want to order off of the Sichuan menu next time, now that we have our bearings a bit. (Richard P., you are the man for translating it and putting it on Yelp. Those of us with more adventurous eating habits thank you.)I'd give Helen's another half-star if I could, but I'd knock a half-star off for service. I don't expect the same kind of service in an Asian restaurant as I do in an American-style one, but we never had our water refilled, and getting alcohol was quite an adventure. Still, the servers were friendly and accommodating, despite the fact that they were clearly busier than they expected to be. Helen herself was on the floor, taking orders and bringing out food. Our server was able to split our check effectively without making it overly complicated, which we appreciated.The things I would have changed: more water refills (please!); getting our to-go orders for absent menfolk in a little earlier, as we had to wait a long time after our meal was done to get them (we told them when we were ordering that we were going to have to-go orders, but they didn't get put in until we were done eating); a drink menu at the table to streamline our imbibing of alcohol. Things I would never change: THE FOOD, which was delish.I will definitely be back. Sooner than later, I hope."], ["Danielle A.", "Based on Bryant M's review, I knew that I was in for a real treat when he and Keith M invited my husband and me to join them for dinner at Helen Asian Kitchen last night. I was not disappointed!!!  If I could, I would rate it 4.5 stars. Bryant made us a reservation for 6:30 so we were promptly seated when we arrived. The server was friendly and quickly brought our drink orders. He was back within a few minutes for our food order. We started with Xiaolong Buns which I have never had before. OMG!  They were delicious!  I lost count of how many I ate after the 4th one. We then ordered Shrimp Pad Thai, Chicken Pad Thai, General Tso's Chicken, and Szechuan Style Chicken. Everyone thoroughly enjoyed their meals. I personally ate the Chicken Pad Thai and General Tso's Chicken. Both were so good!!!  The portions are HUGE and the price is super reasonable. We all had food to bring home even though it was practically impossible to stop eating because (I repeat) it was so good.  The service was a bit slow (we were there nearly 2.5 hours), but we didn't mind. It gave us a chance to catch up, and we had no other plans for the evening. A server that came to refill drinks did apologize for the slow service which was nice. If you are in the mood for delicious Chinese food, I highly recommend going to Helen Asian Kitchen!!!"], ["Robert H.", "I popped into Helen's for a lateish dinner the other night.  The interior is interesting and definitely different.  However once you get past the scruffiness of the place, Helen's service and the food were pretty good.  We started with Hot and Sour Soup, which was good, though perhaps a little under-spiced.  They do not overdo it on the thickeners, which is nice, too.Then came the Xiolong Buns, soup dumplings.  The serving was bigger than I expected with 8 or 9 buns in a bamboo steamer.  The buns were not as bloated as what I have had in China, but the taste was pretty much the same, with the warm \"soup\" when you bite into them.  Then we had the boiled duck -- one of the traditional dishes.  It is prepared by boiling the duck to cook it, and then plunging it into cold water to congeal the fat.  The fatty duck skin is a delicacy -- to some.  I did enjoy the meat, which was tender and tasty, like duck should be.To go with the duck, we had the most amazing bok choi.  Served with a garlic sauce, the flavor was absolutely superb.  This dish alone made the trip worthwhile.  Fantastic.They have a full bar, and they have Tsingtao to complete your meal.(Bathrooms were decent.)"], ["Birdy N.", "Still a 5 star, but somehow better than before.Helen's husband managed to get his papers this year and came over from China and has taken over the kitchen. And what an amazing addition to the menu, there are many new dishes on the authentic Chinese menu.If you like Schezuan peppercorn, then try the ''Dry fried beef slivers''....they are not stingy with the precious spice. Or try the \"Chili pepper chicken'' which has whole Schezuan peppercorns, my tongue was buzzing for hours.....they made a Tofu version of this dish for my mom who is a vegetarian. The Salt and pepper squid was amazingly tender, with a sheer but crisp battered shell. To boot, Helen's husband is a retired opera singer and piano player. When he finds time to slip away from the kitchen, he will come out and play and sing a few songs for his guests. It does not seem coherent to eat authentic chinese food and listen to Mozart and italian opera....but when it comes from the hearts of two such wonderful people, it makes complete sense."], ["Matt W.", "OK, here's what you need to know.A) Yes, it's in a converted strip club. There are a LOT of mirrors around. If that bothers you, order carry out. No one will blame you.B) Xiao Long Bao. The best and possibly only soup dumplings in Columbus are delicious, but you have to eat them quickly to get the full experience. Certainly worth the trip.C) The Chinese menu (\"specials\") is where it's at. We went for an order of twice fried noodles with pork and shrimp and an order of bamboo shoots with pork and both were excellent. The bamboo shoots are actually fresh, not out of a can, and the difference in texture and taste is notable. I'd say that in general the service has been quite good, but there were a couple of occasional language barrier moments. Fortunately, we were able to work through them and were rewarded with a very tasty meal!"], ["Gina 9.", "Came here with high expectations because of a few recommendations from my friends. But really disappointed.  The worst is the service there. The waiter was not responding our request at all. We waited for literally more than 40 mins to get our food served. And I can't believe the waiter was trying to convince us to give them 15% tip after their negligent service. The food is just ok. Not that good as recommended. I will probably go again for the food if it not for the service there."], ["Krista B.", "Very delicious! We had the soup dumplings, the Dan Dan noodles, and the spicy string beans. All were yummy, and we're already thinking about the next time we'll get it!"], ["Patrick S.", "Found this on the Columbus.alt.eats website and it was a great find. tucked away next to the Waffle House at 71 and 161 this is some outstanding food.  excellent dumplings. the only place I've found twice cooked pork in Cbus and it was excellent. an eggplant in garlic sauce dish that I'm still dreaming about. frankly I'd eat virtually anything covered in that sauce. I can't claim to be an expert on \"authentic\" Chinese cuisine but everything we are was far, far better than your average General Tso's or sweet and sour. Service was helpful and very friendly as well. Highly recommend this place."], ["Marlena L.", "I was so looking forward to being blown away by this place, considering all the good reviews. Honestly, I am slightly disappointed. The food was good, just not great.What was good, portion, prices and service. Yes, Helen is very nice and makes you feel welcome, I like that. My family ate the basics, sweet/sour chicken, lomein, and some kind of peppered steak dish. All those dishes were good. I got the salt and pepper squid, good but a little on the too salty side. Day two leftovers did tone down the saltiness though. What was not great was that the temperature in the restaurant was freezing! We kept our coats on. The other issue was that my meal, the squid was brought out at least 8 minutes after everyone else, matter of fact my son was finished by the time mine arrived.I'm sure I will give this place another try and see if the next experience is better, plus Helen was nice. I think I'll try the dumplings I've heard so much about."], ["Michele W.", "I went here based on the high ratings on Yelp.  I was not impressed.  The service was excellent (but I got carryout).  The food was average, not horrible, not great. Seeing as how I went out of my way to go there in the hopes to have excellent Chinese food.  I won't be returning."], ["Eric S.", "Made an online order and it wasn't ready, which isn't a big deal as I was early. Then they told me they didn't even start my order and it would be an hour and a half. Really bad service, needless to say I'm not going back any time soon."], ["Gail T.", "We were some of the first customers here and now can't get a close parking spot.  We see more and more Chinese guests which tells me that this is good chinese food.  We are also seeing more non Chinese guests.  The food , service and Helen are all still great."], ["Helen G.", "Still just as good. Since my last review I've become obsessed and eat here at least twice a month."]], "Lee's China Kitchen": [], "Lucky Dragon": [["Luke T.", "I've had a few pretty decent meals here. I can't remember EXACTLY what I had the first time, but it was some kind of dish like tofu with cashew nuts or something and I had them spice it up. It was big crispy chunks of tofu too, me likey! Also, they have some decent TVs in there and my Celtics were playing a game that went into two overtimes against the Heat on my first visit. The owners were rooting for the Celtics too, which was cool. On subsequent visits, I got takeout. Once I got Szechuan Tofu and once Szechuan Shrimp. Both meals were delicious, and pretty cheap for lunch! Included an egg roll and rice. Oh, and they actually fry their fried rice, as opposed to using some pre-fried stuff like at a few other joints around town. I could see this becoming a regular lunch spot with its proximity to my work."], ["Stephanie K.", "This place has gone from what I was told, a shitty Chinese buffet joint to a pretty classy Chinese restaurant.  The interior was fairly nice looking despite the shabby strip mall exterior.  There were white tablecloths and everythaaang.I ordered the combination pan fried noodle.  I requested the thin noodles, but was brought the thick ones instead.  It was all good though since it was still delicious.  I loved how the layer of pan fried noodles at the bottom had areas of crispiness and then areas that were a little more tender from the sauce.  The noodles were topped with a mixture of vegetables and pork, chicken, and shrimp.  It was quite satisfying.  It looked like half of the menu consisted of Vietnamese fare and the other half Cantonese. I'll have to try other stuff on the menu sometime."], ["Luan N.", "Pretty impressive menu with some authentic Chinese dishes.Shared the jelly squid, tong sum choi, smelt fish, and roast duck. Out of those, I thought the smelt fish stood out. Sorry, I still can't find great roast duck in C-bus yet!WIll be back to try some other dishes."], ["John W.", "This is ok Chinese food.  This is your typical Chinese fare and basically on par with China Dynasty on 161.The ingredients were decent but everyone in our family described their meal as bland, mine included.  We tried the General Tso's, Sesame Chicken, Orange Chicken, Lo Mein (beef), and rice/noodle soup.Like I said, it was just OK.  If you go there be prepared to dress your food to make it more spicy and flavorful.  There are just other options for Chinese that I feel are better."], ["Raymond S.", "Quite possibly the worst meal I have ever eaten. I ordered the curry chicken, crab rangoon, and my dinning partner had the roasted duck...We will start with the App...the cream cheese filling was way to sweet, they use imitation crab, and their sweet and sour sauce was more sweet than sour.The curry chicken was ordered spicy and came out flavorless. When I asked to send it back the waitress seemed insulted when I gave her the reasoning. The dish came back...and by this I mean the same exact dish I sent back came back to my table with chili flakes just sprinkled on top....at this point..meal ruined.The roasted duck came to the table as a plate full of bones and cartilage. The skin was chewy and meat tasted like dried paper."], ["Nicole D.", "YAYAYYAYAYA! Finally some decent Chinese place in Columbus!Spicy Sautéed squid! MUST TRY! Its a million times better than the fried calamari from most other places. Stuffed Tofu or something.. it's a fried tofu stuffed with minces shrimp. very good. Literally crispy on the outside and creamy on the inside. It's a little pricy but you get the clean, fresh and decent amount of food on your plate, and no regrets tomorrow :D Never tried the American dishes, but I've seen the portion, very big too. And they serve water in wine glasses lol so fancy"], ["Morgan M.", "I thought this was still a buffet, albeit under new ownership, but we were pleasantly surprised to see that it is a couple steps up from take out although I wouldn't call it fine dining.  The service was very good, the food was DELICIOUS, and the ambiance was nice.We had the mixed appetizer which had fried wontons, crab rangoon, beef skewers, pot stickers....and I feel like one more thing.  The beef skewers, despite the awesome presentation were underwhelming everything else was good, not mind blowing.For our meals I had orange chicken and my husband had the Family something which was mixed meats and veg.  The orange chicken really satisfied my craving and was nice and crispy but still had lots of sauce and real orange rind mixed in.  My husband really enjoyed his meal too.There were quite a few asian people eating there which I consider a good sign.  My only complaint was that as I was leaving I saw that other customers had chopsticks and we were only offered forks.  I enjoy eating with chopsticks and felt slightly cheated.We are excited to have somewhere that does takeout of such high quality and where we could sit down and enjoy a meal!"], ["Nate H.", "This is the best chinese food I've found in Columbus in the 2 years I've been living here.  The staff is always friendly and the food is reasonably priced.My go to meal is the spicy szechuan beef.  They also have some of the best chicken fried rice I've ever had.  I've had great luck going here with large groups.  They have a big (and clean) dining room with several large tables."], ["Joseph T.", "This place here, another great Chinese restaurant on High street. (too many good food on high street now)Must try items:Vietnamese - Pho Dac Biet (special beef noodles)Spring rolls with shredded pork bellyChinese -Spicy beef tendon (appetizer)Shanghai spring roll (appetizer)Chicken wings (appetizer)Beef stew noodle soupCurry Beef Stew with egg fried rice (not the soy sauce fried rice)Chicken with Creamy corn on top of egg fried riceShredded beef fried rice with Tomatoes pineapple sauce on topoh man, I can go all day... please visit and you will not regret."], ["Susan H.", "I wondered into Lucky Dragon on accident and stayed on purpose. I lost a coin toss with my daughter who decided we would have Chinese buffet for lunch. I was feeling miserable and disappointed before we even got to the restaurant. I was in for a lovely surprise the buffet had been replace by a restaurant. The tables were turned as my daughter wanted to find another buffet but I insisted we stay.The decor was decent, clean and quiet, nothing to overwhelm the senses. The food was where they wanted to make an impression and boy did they. You can go with the typical Asian food staples or you can have an adventurous stomach at Lucky Dragon. I chose adventure. My appetizer was beef tendon with spicy sauce and my main dish was lamb stew in clay pot. I was nervous about these two dishes I had never tried before but now I can't wait to have them again. The beef tendon was cold and refreshing not overly spiced. The bed of lettuce it layed on was crisp and the tendon was perfect. The lamb in clay pot was delicious. It was like comfort food for my soul the rich thick sauce was like heaven in my mouth. I was already on my way to being full from eating half of the beef tendon but I could not stop eating the lamb. I burned my mouth the first few bites but obviously something happened to my brain that caused me not to care. I will definitely be returning if you go order from the Asian special or noodle soup side of the menu. Have an adventure don't order what you can get elsewhere."], ["Stephanie C.", "Gave this place a try with my family and ordered the sautéed snow pea tips, beef with snow peas, and seafood pan fried noodles. Everyone enjoyed it. I'll definitely be coming back."], ["Brittney M.", "Loved this place! It is so nice inside...white table cloths, wine glasses for your water, relaxing music. The food of course was wonderful, I got the Spicy Schezuan Shrimp! Delish! I also got some of the Original Bubble Tea which was a amazing! The prices were very good as well. You can get a lot for your money! The service was great and I will defiantly be back!"], ["Meredith H.", "A solid option for takeout or if you have a craving and live in the neighborhood. Have had several items on the menu, really like the pork and bamboo shoots. Very clean inside and fast service."], ["Tod S.", "Best Lunch Deals in the area, maybe in Columbus.Have had Chinese all over the country and this place is frequently great. The staff are super friendly and you cannot beat the lunch specials. They give you awesome proportions for a lunch special and unlike a lot of other Chinese joints, they're food is not going to put you to sleep with tons of oil.I recommend the Chicken Fried rice which is always decent cuts of meat and the Orange chicken which is usually awesome. They lightly fry the orange chicken and it's great cuts of white meat chicken. And for the lunch special you get fried rice plus a very good Egg Roll on the side. And I've never been a fan of Egg Rolls til these.One note, as I am a big fan of Chicken and Broccoli. They pack theirs with a lot of radish which threw me off and wasn't as good. The broccoli was very fresh though which I love. Also, they don't have Chow Mei Fun but they have a Chow Fun which is big rubbery noodles with an almond taste. Not my favorite but the quality was still there. So far, those were the only two items I've tried that I didn't' much care for. If you like radish and almond type foods then they might be perfect for you.I plan to try many more items from the menu as this place has definitely won me over."], ["Brian A.", "I have lived in Clintonville for 5 years.  Prior to Lucky Dragon being in the strip mall it was a chinese buffet.  that place was god awful.  God awful.  I was very excited when I had seen that it was now a chinese restaurant.  I only new it had changed because i was at the post office next door.  And looked through the window.  I love Chinese food so i ordered take out that night after stopping in to get a take out menu.  The inside of the place looks great.  Very clean.  I noticed the music was like elevator music and i live a block away.  Right by my house.  So takeout is the way to go for me.  I ordered the chicken with black bean sauce.  it was ok.  Pretty weak portion.  Egg rolls are the worst in Columbus.  One night I stopped in with a friend to eat.  There were like 4 tables eating.  No one greated us.  We stood there for 5 minutes then left.  I swear to god ask my roomate Enrique.  I think we ended up walking to o Reillys and getting a burger.  So Today.  About 30 min ago I called to order the lunch special.  BtW.  I have eaten there quite a bit just because I live so close.  The food is decent.  Nothing special.  Weak portions.  Bad egg rolls.  Anyways... I just tried to order a lunch portion of general tsos.  I asked if I could switch my egg roll with a won ton soup and pay an extra 25 cents.  She said no. no.  Sorry that is against policy.  I was like what!?  She was like No. no. That against policy.  I was fucking baffled that she would say no to a soup that is the same price as an egg roll.  I explained to her how I been eating chinese around Columbus all my life and most places give you a choice between a soup or an egg roll.  I told her her egg rolls are no good.  I told her she lost a regular customer over her stupid \"PORiCY.\"   This place needs to go out of business.  TAI's Asian bistro needs to open up there.  Tai's asian bistro on Lane Ave has way bigger portions than lucky Dragon.  The food is better.  Service at tai's is amazing!  If you live in clintonville.  Try Lucky Dragon.  Then try Tai's Asian Bistro on lane Ave.  You tell me what is all around the best place!  I hope Lucky Dragon fails.  They lost a good customer today.  Nazi's had policy.  This is America.  I vote with my dollars.  If you go for lunch ask for a soup instead of an egg roll.  Just see what they say.  I am so mad now."], ["Ka T.", "Such a relief to find a good Cantonese style restaurant in Columbus.    The noodles were awesome and the vegetables were very fresh.  I recommend the snow peas in garlic if you have never tried them before.  Ill definitely be back"], ["John S.", "I enjoyed the egg drop soup and Szechuan chicken was deelish!  Excellent service too!"], ["Joy W.", "Some dishes is authentic."], ["Jack S.", "I ordered the chicken pad takeout 9/28/13. The food looks appetizing, it contained beansprout and carrot slice in addition to the noodle. I told them to make it extra spicy which they did. That dish I give it a 4.7 stars out of 5 stars. Another week I ordered the spicy general tso chicken takeout ($6.55) which included one eggroll. I didn't like it the general tso but the eggroll tasted fine.  The chicken tasted too salty and sweet, lacked any heat (spice), and uses low quality dark meat chicken. Please be aware that not all general tso chicken meats are of the same quality, some places use highly breaded chicken and very little meat which is only good if you want extra belly fat. The general tso I give it a 1 star out of 5 stars. Other than the food taste and quality, the cashier lady is very nice and friendly. The restaurant looks clean and upkept."], ["Sandy W.", "Came here again for dinner. I ordered the Saigon rice noodle soup, and it was tasty, except the color on the slices of meat seemed kind of off to me and did not look appetizing so I didn't finish eating the meat but slurped up everything else. The broth tasted similar to the wonton rice noodle soup. In addition to getting a side of bean sprouts/lime wedge/jalapeno slices, you'll also get sriracha and hoisin sauce. I also ordered the fresh spring roll appetizer, and I did not like it. The rice wrapper was a little chewy, like it had been sitting in the fridge instead of being freshly made. It included a piece of shrimp and a sliver of meat (pork possibly?), but the meat looked old. Then again, I've always had a hard time finding decent fresh spring rolls. Maybe it's time I quit trying, and start making homemade ones."]], "Lily Teriyaki": [], "Jiu Thai Asian Cafe": [], "Peking Wok": [], "Hunan House Chinese Restaurant": [], "Yau's Chinese Bistro": [["Neha B.", "My dear Yelplings,If you're ordering from the multiple-page-long menu, you're basically in the wrong place. Ask them nicely for their non-American menu, a far briefer affair, and pick something from there. I recommend the fish hot pot highly. I will say that their house pan fried noodles, found on the American menu, is to die for.I saw the high ratings on Yelp and ordered some takeout from the online menu--which is all Americanized stuff. When I went to the restaurant to pick it up, I saw the amazing things the people around me were eating. And the smell, oh the smell. I've frequented Chinatown in NYC and SF with people in the know, and the smell in Yau's was seriously legit. It was the real deal.So imagine my devastation when I got home and opened the containers of kung pao chicken and general tso's chicken. The dishes were lackluster to say the least: even though these are Americanized dishes, kung pao chicken can be really yummy, as can general tso's. These were not. These were awful.My friends nodded sympathetically when I bewailed my misery. They told me to ask for the Chinese menu. I marched back in the very next day and did exactly that. And, reader, I was in heaven. I devoured the fish hot pot. I devoured the pan fried noodles. And I am going back today again because oh my god I need Yau's in my life, and in my belly.And there you have it. The True Story of the Secret of Yau's. Be wise. Order from the Chinese menu. You're welcome."], ["James D.", "way above-average american style chinese and THE BEST authentic cantonese in columbus. fast and friendly service in a low key environment; what more could you ask for??p.s. re: the guy who ordered the spicy garlic steam pork... dude, that is simply the way cantonese pork is prepared. it's amazing and one of their more popular dishes so do some research / gain some culture before trashing a restaurant please."], ["Claire D.", "My bf and I stopped by Yau's for a quick dinner before seeing a movie at Gateway tonight. We got broccoli chicken, General Tso's chicken, and fried rice ($16). As 2 Asian people, we were a little bit embarrassed to be ordering basically the most Americanized \"Chinese\" food on the menu. But whatevs. When you want General Tso's you get General Tso's.Food: Yau's General Tso's chicken was fried white meat chicken coated in a very sweet, somewhat tangy pepper sauce. The sauce was a bit too sweet for me and very reminiscent of BBQ sauce, but overall pretty tasty. The broccoli chicken was pretty standard Chinese takeout: dark meat chicken, lots of broccoli, and a salty/savory sauce.Pros: Service was quick for a sit down restaurant. We were in and out in under 30 minutes."], ["Mark K.", "I don't know why it took so long to come here.  A bit out of my way, I guess, but it is worth a detour.On the far south edge of campus sits this little \"bistro.\"  It is not fancy.  It isn't very big.  But the food is really, really good.  I got crab Rangoon and the spicy pork chop.  The Rangoon was pretty good, with big chunks of \"crab.\"  There's a jar of hot sauce/oil on the table, which made me nervous, but it's really not all that hot.  Granted, I love spice, so my taste buds may be different than yours.The spicy pork chop was deep fried bits of pork chop, perfectly cooked, and sized just right for chopsticks.  Again, not as spicy as I was afraid it might be, but I did have a pleasant tingle on my lips and tongue when I was done.  I would call it moderately spicy, not overwhelming.  There are pepper seeds mixed in, and chunks of pepper that I thought would be hot but were very mild.  All in all, the heat was just right, adding flavor but not much pain.I had the fried rice with it, and it was very plain.  A good counterpoint to the meat, but no veggies, etc.  Drinks are in cans, but there is real silverware and nice chopsticks.  Service was basic but good.  Prices were okay for how much you get, and how good it is.I will absolutely be back (and not just because I stupidly left my jacket there...)"], ["Laura B.", "Got the chicken broccoli mushroom and steam rice, it was not all that great. The seasoning was not there, I will not go back prices to high."], ["Helen S.", "Yau's was one of my favorite places to go for Chinese food (or any food for that matter) while I was at Ohio State. I don't go here as often living in the burbs and it makes me kinda sad because the food here is so good and authentic and cheap! You're definitely not coming here for a fancy restaurant experience with nice plates, cutlery and decor. It's all about the FOOD! I always get the spicy schezwan wontons as an appetizer. The beef or shrimp with egg and the salt and pepper squid or pork chop are some of my favorites too. Yau's is nothing fancy.. quick service and great authentic Chinese food!"], ["Chris D.", "Although they have better than average food I will not be back.I was approached in the alley near the restaurant by the young man that works the afternoon shift.  He said he recognized me from the restaurant and ask if I would loan him money. I declined his request.I will not go back. How might the employee retaliate?"], ["Louise P.", "I really like Yau's. It's cheap, some dishes are kind of Americanized, but you can find more \"authentic\" items if you take a look t their specialties and don't just stick to sesame/General Tso's/sweet and sour chicken.I would give it 4 stars, except for the service this year.They hired a new guy - young guy with brown hair - who is not a good server. Have interacted with him twice, and he doesn't have a friendly/welcoming attitude, barely knows about the menu items, and doesn't refill your glass or even ask if the food was OK, despite the place not being busy. Not attentive - doesn't come to pick up the tab even though the customer has been done for a while, because he's too busy making unprofessional snarky comments with his friends. He literally bangs dishes down on the table, and didn't hand me back my card when I payed, instead placing it down on the counter - again, rude, and if I were a mean person, I wouldn't even have left a tip.everyone else working there is at least polite, even if it's not known for *great* service. but this guy's service isn't just OK, it's kind of bad and it makes me not want to go there because he's an uncomfortable person to interact with. should have better social skills or at least training if you're going to hire someone and put them in a position to interact with customers. I will not frequent Yau's as often because of this hire."], ["Allen Y.", "The food here is delicious. Reminds me of the Chinese food you get in cleveland,  ohio. Its the best Cantonese type of Chinese food you can get around osu. I had the squid with black bean sauce and beef rice noodles from here and they are delicious. The price is really cheap."], ["Maribeth B.", "Never disappointed with the food here! I've been going here for years!! The Chinese broccoli is amazing and the seafood bowl is so good. The owner is so nice and hospitable. The atmosphere is very relaxed and the food is authentic! I suggest this place for sure!"], ["Andrew L.", "Haven't been here in a while, but they have fantastic wonton soups, which is all I've had here.  Good price, good food, and near the campus area.  Not too much else to say about that."], ["Dan B.", "Absolutely terrible. I ordered a spicy pork dish for carryout. When I got it home and looked at it, there were disgusting chunks of fat which should have been trimmed from the pork and just a side of sauce so it was totally plain. Luckily I live nearby, so I walked back and returned the order, letting them know that this was unacceptable. To replace the pork dish, I decided to play it safe with an order of Kung pao chicken, which was mediocre at best. I'm shocked by the amount of positive reviews this place has for such subpar food and also disappointed because I really wanted to have a good Chinese place close to my house. I tried two different dishes and both left much to be desired. I'll never be returning here."], ["Jacki M.", "This place was horrible. I ordered the general tsaos chicken. It tasted like ketchup mixed with cough medicine. The wing appetizer was unfortunately cooked in the same oil as the seafood so those also were not good."], ["Michael W.", "I ate here while on a project: I would take the bus from downtown to here. SO WORTH IT! I love their spicy pork chop; it is the BOMB. In general, everything I have had is good. It isn't fancy but the food is great and worth it. Fyi... Parking is around back in a lot just south of the building."], ["Grace-Anne P.", "The beef was the consistency of rubber. The lo mien noodles weren't lo mien noodles. The service was so bad I was amazed my girlfriend tipped at all."], ["Tommy M.", "UPDATE TO MY PREVIOUS REVIEW!I previously gave this place three stars. After trying out the handmade dumplings and handmade stretch noodles soup tonight, I give them four stars! Both are excellent dishes...especially on a freezing cold day."], ["Fallon M.", "Great authentic Chinese food. I love eating there. The fried rice there with shrimps. The management is very polite and respectful to customers. Go there. You won't be upset with the food or service."], ["Cherie R.", "I'm constantly on the hunt for good Chinese -  I liked Yau's.  Didn't love it.  Maybe I need to try one of the soup noodle bowls, being a sucker for noodle soups.I tried the ma po tofu and the beef with wide rice noodle.  Both were ok - beef chow fun is one of my favorite dishes ever and I'm always looking for a good one.  If you know of a place, let me know, because Yau's didn't fit the bill.  Both dishes tasted very fishy.  Literally.  Neither of them contain fish.  If it weren't for that, I would have been much happier!  I'd come back, but I'd try something else."], ["Andrew W.", "There are few things in this world that I feel as passionately about as Yau's. There is absolutely nothing to not love about Yau's. Everybody is super friendly, the food is super tasty and the fare comes at a super low cost (especially for how much food you get). A large entree with extra rice (only $1.00 for a full, large container, instead of mixed in with your entree (!!!!!)) is enough food for me for roughly three meals.When you get down to it, Yau's is everything I want out of a real, Chinese restaurant. No artwork on the walls, delectable food, fast service and easy on your wallet. All the love goes out to this easy to miss treasure at High & 9th."], ["Kimberly T.", "The service here is amazing. I walked in with 10 other girls and we were able to get in and out and less than 1.5 hours. They are super nice. The food.. AMAZING. I am Chinese, their food is better than anything I have ever had. I got the beef and egg. They were the best eggs, perfectly seasoned and cooked. Fluffy and hot. Amazing. My friend had General Tso's chicken, and she has never finished a dish as long as I have known her. The dish was so good she demolished it. You can not go wrong when you come here. Get anything Cantonese and you will leave full and happy."]], "Coco's Grill": [["Bryan G.", "Best fried dumplings in town. Really good food. You know it's authentic when you're the only white person."], ["Karyn M.", "This place has decent chinese food. I usually stick to their chinese menu if you wanna avoid the generic panda express-like dishes. I've tried their pork & bamboo shoots dish a few times, which is pretty good except recently. It used to have bigger portion and a lil more flavor. The garlic eggplant dish was good - but I LOVE eggplants, so it's pretty easy to please me with that. They gave a hefty amount of white rice, which I like. It's cheap and quick basic Chinese food - haven't tried anything else"], ["Katie B.", "Popped in there after a long day driving and working out and just wanted some good Chinese takeout-- I recognize the irony- with which to flop down on the couch.  I was not disappointed! I got the crab rangoon (my standard item to rate all Chinese food places against) and the chicken pad thai which were both good!  The crab rangoon was busting with a creamy peppery filling and not over cooked.  The chicken pad thai was fresh and flavorful and I have leftovers for lunch today! Score! After I had tried a sufficient amount, I added some red pepper flakes, because I'm a spice-enthusiast, and that was, of course, delicious.Also worth noting, I didn't get that salty, bloated, sluggish feeling that can sometimes accompany new food experiences.  Loved that!"], ["Mengmeng D.", "One of the worst Chinese restaurant in columbus, in terms of food and service quality. I was served a \"frozen\" chicken with green garlic sauce and it was dipped in raw chicken blood! It's suppose to be a cold dish but chicken needs to be fully cooked first and then cooled down and sauce goes on top. However, it is so obvious that it was pulled out of fridge immediately since the chicken was frozen in ice! I couldn't even tear it apart! And more, it was covered with blood! WTH?! Then the male manager offered to replace it with another dish and when we asked for the bill, the chicken dish was still on it! Waitress said it was actually for the charge of the replacement dish. What?! This is really unacceptable to me as it were to happen in a western style restaurant I would not even need to pay for anything. I know it is not a five-star dining place but at least show your customer some respect!I will never be here again."], ["John W.", "CoCo's doesn't offer delivery service.  There is a mistake on the business info."], ["Madison R.", "Ordered spicy tofu, bulgogi, and eggplant.  The food was ready super fast, in maybe 5-10 minutes.  It was also extremely, extremely hot.  A few minutes after the eggplant came out, I decided to try a bite.  It didn't have steam coming off of it, so I thought it was good to eat, but the inside was super heated.  When I bit into a piece, it burnt the *#!& out of the inside of my mouth.  The tofu was a little too chewy.  It seemed like it was fried twice, like maybe it was first deep fried, stored, and then stir fried with the sauce to order.  The bulgogi didn't taste like bulgogi but was more like a Chinese-style fried beef.  It was actually pretty good and was the only thing that didn't taste like it was from Panda Express.  The rice didn't taste very fresh.  Price was reasonable.  We will probably go back sometime in the future and try other items."], ["Zack R.", "The General Tso's chicken was some of the best I've ever had. Perfect bite-sized pieces (some places make them way too big) with sauce that's actually spicy (but not too spicy)! The crab rangoon were excellent too, and even held up for a 15 minute car ride. The chicken lo mein and vegetable lo mein were outstanding as well. The garlic beef was too spicy though (tons of jalepenos).I'm really looking forward to trying more menu items at CoCo's."], ["Milly C.", "Never expected to get REAL dried bamboo shoots!  Not canned ones.  Really delicious.  Taste of home.  Yum! Definitely will come again."], ["Candace R.", "This is really a 3.5. I had the coco chicken and my fiancé had the general Tso's.  The portions are large and there was plenty of chicken and broccoli. The coco chicken was too sweet and not 'spicy' at all like the menu says. I'd say it is as good as the average Chinese place."], ["Jennie I.", "I really want to say that this place is still by far my favorite place and that their house tofu is above all the best I've ever had...it is, except tonight I seriously found 4 bugs in my meal. Needless to say I'll never order from this place again!! So disgusted right now :-("], ["Mr F.", "As we walked in, the greeting was anything but friendly.  There was no one in here and it seems they liked it that way.  I ordered the Hunan Beef.  It's what I always get when I go to a new Chinese restaurant to compare a similar dish across restaurants.  Although the food did not taste like any other Hunan Beef I've tried, it was still good, served quick and hot and was reasonably priced.I'd go back but I won't expect a welcome next time."], ["Nicole D.", "this place is good if you enjoy panda express type of Chinese food.I'm Chinese and I'd rather go to Jimmy Johns next door.meh"], ["Woodshire S.", "Ah yes.  Sesame chicken, we meet once more.  Encounters like these render our culture's disbelief in reincarnation ludicrous INdeed.  I do not suspect but simply know that sesame chicken and I have met in a dozen previous lifetimes.  How else to explain the unique cocktail of neurochemicals my brain secretes in a frenzy every time the dish's aroma (in WHATever variation) crosses my mucosal membranes?  But, shall we focus on the present lifetime?  CoCo's is a serious place.  The meat is practically spilling over the plate.  The rice, oh the rice, so densely packed I'm drawn into the past again, but 25 ft (8.5m) underground, the Furherbunker had walls this thick.  They were warm and safe as well (though it didn't do them much good in the end).  If there is a theme to Coco's it is Density.  The takeout containers stagger to contain the weight.  I have had more than one collapse in mid-carry, spilling the cargo onto the surprisingly clean Columbus sidewalk.  I ate it there.  Rather like a dog, but what are we but dogs?  Dogs to enslave our brothers, dogs to our future of East Asian peace drones buzzing overhead (sure hope I've reincarnated by then heh)?  When I licked the brown sauce out of the crack in the pavement, I was again lurched into the abyss of our geologic past.  A dark time filled with steam and an unfamiliar wetness.  The components of Coco's masterpiece, daring in their scope, had expertly prefigured this moment.  For it was this dark unfamiliar muck that all life crawled from.  Ejecta from the dawn of time, hurtling to a future in which only the terrifying bits are known to us.  When I had finished, exhausted, naked, but quite lucid, I ordered a coke, where Coco's gets extra points for having styrofoam cups and serving them to deranged naked men.  I haven't been back since, but I know, I know, sesame chicken and I will meet again.  A lot like Cloud Atlas, but non-ficition and without the gay guy.5/5 - also good eggrolls"], ["Paul F.", "I stopped in here for lunch today.  It's a very narrow store right next to Subway on 5th Ave.  They were out of the only Japanese entree that I was planning on ordering so being that I was hungry i ordered sweet & sour chicken and white rice.  The chicken didn't taste too bad and there was a lot of it, but there was no pineapple and no green pepper.  And while I was waiting on my food, I got a chance to notice how filthy the store was.  The table tops were dirty, the floor was dirty also, and the mop and bucket they use was left right in the middle of the dining room.  From now on, I'll skip it."], ["SaRea S.", "Oh Coco, how many times have you saved dinner?  For me this is some of the best Chinese food in the city.  The dining room is hardly ever empty, and most people are usually head down devouring the yumminess.  Quick carryout 10-15 minutes and cheap prices.  So please bypass the standard Jimmy John's next door and go to Coco's!"], ["Buddy Jack E.", "No complaints here. Good food for sure. Nothing extraordinary but no pitfalls, either. I've had General Tsao's Chicken and some Shrimp dishes. It's good stuff and I will return."], ["Syn Dee C.", "One of the best places to get pretty authentic HOMECOOKED-styled chinese food. I've been here many times for a quick dinner. Food comes out hot, fresh and fast.Some of the dishes I'd recommend: - Crispy Honey Shrimp- Pork with Jalapeno - Garlic Eggplant-  Chicken Cashew- Cantonese Chow FunThe owner and the main cook can be very friendly if you work up a conversation with them!"], ["Kevin Y.", "Got \"Coco's Chicken\" and it was glorious. Lightly battered chicken, savory spicy sauce, only 7 bucks. Will definitely go again.."], ["Richard P.", "As a general rule I try to avoid restaurants that advertise that they do several different cuisines.  You know, \"Chinese/Japanese/Thai\".  That sort of thing.  Says to me they aren't really cooking their own food, because they're trying too hard to please everyone.  Or they figure you can't tell the difference, anyway.So I was happy to discover my hard-bitten cynicism was misplaced, at least in the case of Coco's Grill.  If you ignore all the generic throw-away stuff, there's a nice menu of Chinese home cooking, just like you'd get at home, if your grandmother was from northern China.The hand-written menu to the left is only in Chinese, unfortunately for those who don't read the language.  But a friend of mine tells me they're willing to translate, if you pester them enough.  Even so, there is a nice selection of authentic Chinese dishes on the menu.  Nothing fancy, but like I said, the kind of things you would eat at home.By the way, as Chinese restaurants in Columbus go, this one has atmosphere, sort of.  By that I mostly mean it's clean, busy, and painted a nice bright yellow.  But hey, it's the food that really matters, isn't it?  You can't eat atmosphere..."], ["Emma D.", "hit or miss. The fried rice main dish is the same rice as you get with other orders. I also ordered beef with eggplant and got way more eggplant than beef. I'm still trying to find my favorite fast food Chinese."], ["Shannon M.", "FINALLY!  I was starting to lose hope that any good fast Chinese places existed anymore.  This place is great!!!!!  I ordered WOR su gai.  The chicken was already in the sauce, which is a first for me... And instead of the usual sliced whole breast, its smaller pieces... So I was nervous to take a bite. But surprise!!! All white meat, quality chicken.  Sauce was excellent and even the plain steamed rice tasted extra good. I'm so excited to know about this place now.  I'll def be back anytime I want Chinese food.  When I picked up my order they had a big board with specials.  I can't wait to try something new."], ["Nicole W.", "This review is not meant to convey that CoCos has the best food in the area -- however, I have been on a hunt for a stand-by local, lazy evening, chinese restaurant and I think I have found it. And OH_BOY! It is cheap!I've enjoyed the orange chicken and chicken w garlic (like I said, looking for stand by's for *those* nights) and have been very satisfied with the take out.  Will continue to go!"], ["Zhong C.", "I often go there. 1.delicious Chinese food, 2. reasonable price, 3. close to campus."], ["Beth S.", "The atmosphere here is different than most fast-food style asian food restaurants. Decor-wise, its very run of the mill with its bright walls and sparse wall art. Just a few tables in this place line the walls for dine-in eaters. But as you peek through the doorway to the kitchen, you see the chef's getting down to business. The food is good AUTHENTIC asian food. I'm not sure what nationality the owners are, but there's korean, thai, and chinese here. Oh my goodness order the spicy tofu. So freakin good! I also love the chow mein. My only gripe with the food was that the noodles were clumped together, I had to break them apart. Surprisingly good food for the location!"], ["Jenna A.", "The food here was definitely inexpensive and worth the price. The sesame chicken was ok, not as crispy as I'd hoped, but the sweet and sour chicken was very good! The rangoons were hit or miss, with some being completely filled with cream cheese and crab and some being almost completely void of filling. I'll definitely stop by again though to try more options!"], ["Kimmy S.", "The staff was very friendly. The pad Thai was good but could use more sauce. The bogogi could have used more sauce. But definitely a good deal for $7! Our fave was the General Tso. A major plus, we asked for spicy and it was definitely spicy. Most places don't make things spicy enough to taste but we got what we asked for :) I would come again just to try more of their menu items. It's very budget friendly and the portions are generous. 2 thumbs up!"], ["Marshall S.", "Another great option for great east-asian food in Grandview."], ["J.J. C.", "This place is very good!I love their Garlic Eggplant and Szechuan Fish Soup.It's definitely saucy, so if that's not your thing, this may not be the place for you. But I definitely enjoy it."], ["Daniel K.", "Best Chinese in the Grandview area. I haven't had their Thai / Korean stuff, but the salt and pepper shrimp is outstanding, extremely spicy (how it should be) and in expensive."], ["Jeremy L.", "I was craving Chinese food and a friend recommended this spot. I'm new to the area and was looking for a reasonable consistent place. I ordered a few egg rolls and some king pao chicken and chicken friend rice. Not the best I've had but very good and cheap. Ready in 5 minutes! I will be back."], ["Krissy K.", "I was really excited when I saw a Chinese take-out place with four stars . . . but Coco's Grill did not live up to its rating on Yelp. We got three different dishes - the first was sesame chicken and the chicken was so disgusting neither of us could eat it; it was like chewing on old leather, except I think old leather may actually be more edible than this dish. The sweet and sour chicken was okay, by which I mean it was at least edible but definitely nothing special. The third dish was lo mien, which was also just okay. Overall, very disappointed with this take-out experience."], ["Kim K.", "My boyfriend and I were visiting from LA.  We were craving some good cheap Chinese food, but we were a bit wary of good Chinese food in Columbus and because the name of this place did not sound very authentic. My boyfriend ordered the Szechuan beef with fried rice and I got kung pao chicken with steamed rice. The total was only $13 and the portions were huge...great deal! The quality of the meat was great, the food had amazing taste, and our dishes even had a kick to them! I was very very impressed. If I lived in Columbus I would be a regular here for sure :)"], ["Eames E.", "to test coco's mythic speed I ordered the CoCo's shrimp special for pickup while waiting in the parking lot and walked in with a half drank dew tall boy seconds later and it was waiting for me on the counter. as i paid a disembodied voice from the back kitchen yelled out \"THANG YOU!!!!!\".  this is a real review."], ["Kate O.", "This place is blech.My friends and I all ordered take out last night. I got the pad thai and my friends all got various chicken dishes. My pad thai was NOT pad thai. It was something weird, fishy, and sour. I also ordered spring rolls and got some weird soggy (and again, fishy) things. My friend ordered mushroom chicken and that's most definitely not what she got - it was something covered in sesame seeds. Another friend got what basically equated to sauce with some chicken and a little rice. Maybe some people like this kind of food. All that I know is that I want my money back."], ["Robert H.", "Low priced, consistent 4 star food. Half the price of PF Changs. Sometimes better tasting. Took my significant other here a year ago, and have had to take her back about 30 times since. I recommend.  Pad Thai is good, House Tofu, and General Tso's"], ["Jasmine K.", "This place is top notch for quick tasty Asian food.  The owners are so friendly; I ordered a chicken dish but wanted the battered chicken instead of the white meat, the girl taking the order forgot to tell the cook and he could tell that I wasn't happy (for the record I would have eaten because it still looked awesome) he fixed the dish exactly like I wanted and it was so so good.  They were having issues with the CO2 tank for the soda that day so they gave us canned soda, they were very customer service oriented and made sure everyone was happy.  We will be back ... often!!"], ["J L.", "It's hard to review this place. Service is hit or miss. Sometimes there's none to speak of, like today. But then again, it does seem like self serve at times. Good thing I'm not here for service. I love certain dishes on their menu. They have some more authentic Chinese dishes if you know what you're looking for. They're very good at some dishes and average for others. Their Japanese and Korean dishes are not as authentic for example. For me, I know exactly what I want and as long as they continue making those dishes well, I'll be coming back. Recommend trying more than one dish and coming more than once before deciding if this place is for you."], ["Malik A.", "With all the positive reviews, we knew this was a sure hit. They stuck out on both items we ordered. We both had to throw the food out. We ordered carryout. Now I'm only getting my local Chinese at Happy House or China Dynasty."], ["Sara D.", "My husband and I have been on the hunt for a great Chinese food place and keep coming up a bit short. So on a friend's suggestion we headed to CoCo's Grill on 5th Ave next to Jimmy John's.  The restaurant itself is nothing to write home about. It's clean and there is plenty of seating, but it's lacking in \"atmosphere.\" So don't go here for a romantic dinner. Do go here if you want some good Chinese.It's a very casual joint; you order at the counter and take a seat (or you can take-out) and someone will bring your food. We started with pot-sitckers. Usually I feel guilty about ordering pot-stickers because they seem unhealthy (usually pan fried a bit as far as I can tell). These pot-stickers were amazingly fresh and were crisped by grilling over an open flame--no added grease or fat. Very light and delicious! My husband ordered sesame chicken extra spicy, which wasn't spicy, but their English is not very good, so I'm not sure they understood his request. They brought out some spicy sauce though and he was happy. The sesame chicken was pretty good, not as sweet or greasy as many places (my husband makes better though). I ordered chicken with green beans, which was very good. The green beans were fresh (I saw one of the ladies trimming them at the counter) and the sauce flavorful. Over all the food was very good and the price very reasonable. It also came out super fast. We will definitely try this place again. So far I give it 4 stars because of the lack of atmosphere (we didn't linger after eating), but the food is worth it."], ["Susan B.", "I was craving some Korean food and did not want to drive up to my favorite Korean place on Bethel Road. I ordered the Kimchi pork and it was alright. Nothing special at all. I also ordered some steamed dumplings and they were terrible. The edges were hard and didn't even seem remotely cooked. the staff were also unpleasant. I simply don't think it is worth it when I could ride an extra ten minutes for the best Korean food in town."]], "Oodles Noodle & Dumpling Bar": [["Brooke M.", "Oodles is DELISH. Their chicken pot-stickers are my absolute favorite (6 for $5). You can choose between rice (brown, traditional, fried, etc) or noodles (many kinds). They have traditional dishes like general tso, sweet and sour, kung pao, etc.  My favorite go to is fried rice and shrimp. The portions are big (typical Chinese bowl sizes). I recommend calling ahead to pick up, if not you will just wait about 10 minutes or so inside. There is parking in the back with it being right downtown a street spot can be hard to find. I would go daily if I could!"], ["Kara M.", "i work in this area and i forgot my lunch today so I was interested in places that are a walkable distance from my job and oodles popped up. the place is small with modern decorations and was really clean. they have good variety of options including noodles and rice and they have vegetarian options as well. there was also the choice of adding on protein or your choice as well. i went with the fried pork potstickers and the pad thai. both were freshly cooked and were good. nothing to rant or rave about but a solid lunch spot. will definitely go back"], ["John M.", "If you work in south downtown Columbus like me and you frequently neglect to pack your lunch like me and you are too lazy or pressed for time to huff it down to German Village like me, you will often find yourself frustrated at the lack of dining options -like me. Oodles, however, serves as a little-known precious Plan B.  The menu is not expansive but covers all your basics: several varieties of chicken, soups, noodles and dumplings.  I tend to favor the Moo Goo Gai Pan and the Shrimp Tempura.  The food is fresh, tasty and, as you might expect in an asian restaurant, the portions are plentiful.  Lots of beverage options are available.  If that wasn't enough, the service is speedy (rarely will you wait more than 5-7 minutes) and the prices are very reasonable: splurging on any one entree means spending a measly eight bucks.  The naysayers of Oodles would do well to keep that in mind.BOTTOM LINE: Oodles doesn't try to pretend it is what it isn't.  It's cheap asian cuisine served by a reasonably friendly staff.  I wish there was more ample parking in the area and that they had more shrimp-based entrees, but boo hoo and get over it.  This place is solid."], ["Leilani M.", "I've only just moved here and tried one thing, so maybe there is more goodness to this place? But really, this getting two stars for being edible and that's about it. The chicken pho soup pretty much tastes like a bland tepid salt water with mushy noodles and some veggies thrown in. I'm not inspired to return."], ["Amanda D.", "Food was okay. Not awful. Pho was not traditional nor very flavorful, which was what we went for, and we were not impressed. It actually tasted more like a Chinese noodle soup."], ["Billy C.", "Great Dan Dan noodles!"], ["Ariana E.", "The first time i went here for lunch I had Pad Thai with tofu and it was pretty good. Unfortunately, the second time I went here I wanted Dumpling Soup and was told they were out of dumplings. How does a dumpling bar run out of dumplings?"], ["Catherine J.", "I've been wanting to try this Oodles location for awhile. I have my two go-to Chinese comfort-food joints between work and home (Lee's Chinese Kitchen and Happy Dragon), and thought it was worth checking out a third. It's feasible I might go back, but it's not enough in my normal path (out of the way by just a few blocks, but the other two are right in my footpath), for me to make a habit out of it.There are many things to like and enjoy about Oodles:- Cool, modern interior- Customizable choices in the menu (like brown rice, and usually have a choice of protein). - Parking at this location is easier than one might expect, with some shady spots(as in trees, not creeps)  in an alley-type through-way. This little block of Main is actually a bit of an oasis. Nothing horrible stuck out to me, but take note:- The food is a little more bland than other Chinese food joints. I had the Moo Goo Gai Pan, and it was fine. Just a little bland. Same with the dumplings. I had the steamed dumplings, and they were lighter on filling and thicker on dough. I don't mind that, but FYI. Still, I saw Sriracha and other condiments scattered around the cute dining room, so blandness is easily fixable and may indicate lower sodium levels? If true, that would be a plus, but I don't know for sure.- For it being called a \"dumpling bar\" there wasn't much dumpling variety besides pork vs chicken, fried vs. steamed, order of 4 vs order of 6.- The service was a little awkward, language was a bit of a barrier. But, the fella helping me was cheerful and made sure to double, even triple check the order to make sure it was right, sort of acknowledging that there could be communication issues otherwise. - Despite the mod interior, there was just kind of an awkward vibe going on. The menu is a little confusing, I guess, combined with the slightly awkward service. All of the customers in there (including me) kind of seemed bewildered and quiet, glancing around like they weren't sure what they were doing there. Fun to try someplace new, but next time I need takeout on my way home from work, Happy Dragon is just fine."], ["Kate Q.", "I'm here more than I care to admit and love this location.  The food is cheap, quick, and tasty for the price.  My favorite dish is their Pho Nam because a big bowl of rice noodles, bok choy, and broth is like comfort food to me.  Plus, they put fresh sliced jalapenos, lime, and, cilantro on top of the soup.  Yum.  Overall, this is a handy and clean place to grab a cheap and quick lunch if you are in the neighborhood.  For $7.45 at lunch I get a giant serving of soup that can actually be made into two meals, a side of my choice, and a fountain drink.  Not a bad deal."], ["Paul F.", "This is a very small shop on east Main Street.  I've been by it a hundred times and never noticed it.  But it was easy to find when I was looking for it.  I came down for dinner tonight.  With a little help from the guy at the register, I picked a half order of pork pot stickers and an order of Singapore rice noodles with curry sauce and chicken and shrimp.  The noodles were a lot better than the pot-stickers but both were edible.  An interesting point was that the only oriental working there was the owner.  The cashier was a young white guy..  Very personable though."], ["Brian W.", "I saw an on line positive review of this place and it's right on my way home (now I'm diverted by the 71/670 construction), so I stopped to pickup some dinner.  Glad I did. Best Chinese takeout alternative downtown we've found yet.The place is a bit off by itself, but easy to find and get to (on the two-way portion of Main St).  The shop is a bit small and pretty much empty on a rainy Thursday evening.  Basically a fast-food arrangement, but lots of sitting options that would have worked great if my wife had been with me.  The menu was a bit confusing to me at first, but the cashier was knowledgeable and helpful.  All the options are dinners, rather than having an ala carte option like most other Chinese places I've been.  Agree with other reviews that the brown rice option is nice, although I opted for one fried and one white this first time.We tried the sweet and sour chicken, and beef and broccoli. Both were pretty good.  Nice and fresh, rice was cooked well.  Price was reasonable.  We'll be back, now I've figured it out."], ["Amruta D.", "It's nice cheap asian food, they've different lunch and dinner specials. It can be very greasy so I wouldn't go here if you're looking for a healthy meal."], ["Mike B.", "Went back today after more than two years away. The sanitation levels as noted in my previous reviews were definitely fixed, everything I leaned against or touched was clean.The place was hopping, unfortunately a 10 person line means it was over half an hour from the time I walked in the door to the time I walked out with my food.Food was good, nothing that blew me away, I had the house (triple delight) Schezuan, I asked for extra spicy, it was just spicy to my taste. There was a lot of sauce in it, and it was a bit oily (imagining from the wok toss), but the ingredients were fresh and I could see the pepper flake.The service was great this time, and they calmly handled 15 people in about a half hour. I'll be hitting this place up again, but will hopefully make it on a less crowded lunch day."], ["Devon P.", "I found the flavor!  It is in the Dan Dan Noodles :)  Delicious noodles in a creamy peanut sauce was the special today.  For $8.75 I got the house variety (shrimp, steak and chicken), a cup of delish hot and sour soup, and a fountain pepsi.  Sweet!  Only ate half the noodles and half the soup before I was full again; definitely share-able.  I plan on making it a regular lunch destination."], ["Merisa B.", "I really wanted to like this place. They are pretty nice, the space is clean, and the prices are very reasonable. I also am not a fan of negative reviews online, but the ratings seem overoptimistic. But the food is a solid \"Meh.\" On my first visit, the fried rice was fried rice - a little too greasy and just okay. On my second visit, the chicken pho was some of the blandest I've had. It also seems like they might flour-coat and fry the chicken before putting it into the soup. Some good vegetables in the soup, but overall disappointing.  Sounds like the ownership is making inroads and improvements. And I hope the restaurant succeeds. However, I do not recommend the fried rice or the pho.  Also not gluten-free friendly."], ["SaRea S.", "I was surprised the reviews for place were not as good as I thought they would be.  When I don't feel like cooking, Oodles Noodle & Dumpling Bar is my stand-by! Tasty food and friendly service :-)"], ["Miss J.", "Food was good. I had fried rice, and it was delicious. I also had some tempura chicken, and it was just okay It was no worse than your typical Chinese chicken place but not that great. They also have no place to park. Prices are reasonable though and the staff was friendly."], ["Angie P.", "I'm Asian who lived in most parts of Asia before, so I'm going to be a bit more critical than other reviewers.  The Chinese food there is \"Americanized\" to a certain extent and may not be as authentic as it should be.  However, it is good value for money with the portion they serve. Whenever I ordered something with tofu, they were generous with it comparing to other restaurants.  They are also very friendly and flexible in terms of substituting some of the ingredients and appetizer in their lunch or dinner sets.  I went to the Nida's Sushi at North Market several times, and they always refused to substitute any ingredients.  They would just hold what I didn't want or ask me for extra money for putting a little more bean sprouts or tofu. So I really appreciate Oodles being customer-oriented. This is why I gave them 4 stars."], ["Craig L.", "I tried this place on a whim and was pleased with my choice. It was OK. Certainly not the best Asian food that I have ever had but for the $6 I spent on it I was very happy. I am generally weary of a place that continually ASSURES me that everything is made fresh but the staff member seemed to be genial in his rambling.My favorite part of this place was that every single table had its own bottle of Sriracha! AWESOME!!"], ["leslie t.", "Im a franklin university student, so oodles is the closest place, i can eat ate,so  i love the discount they offer to students and employees, and definetely love the noodles, you got to love this guys"]], "Imperial Garden Restaurant": [["Sharon W.", "They offer a good variety of taiwanese food. I love their weekend brunch buffet, the price is reasonable and most of the food are pretty decent especially the spicy fish fillet, but it is busy around noon, so make sure get there early so there are still fresh food. Sometimes if you come in late, like around 1pm, they start stopping refill some of the food and some dishes can be dry."], ["Francis M.", "I was nervous coming in on a Saturday evening that there was only one waiter but boy did he deliver! My daughter wasn't in the best mood and he did voices and accents and got her laughing and having fun. Not only did he do that but also got the food out fast and hot and put all my worries to rest. Good food at a good value and some fun...what more could you ask for? :-)"], ["Gavin D.", "I am a fan because this is a buffet with multiple well cooked options that I've never had before (and you probably haven't either).  If only everywhere with new food you want to try had a buffet!Full of Szechuanese and Taiwanese options, I particularly liked the fresh dumplings that pop up on the side table and get snatched up quickly.Only been once and didn't get to try many things that looked interesting and good.  Looking forward to a return visit!"], ["Angela C.", "I've eaten at Imperial Garden for dinner a few times in the past and always enjoyed the dishes on the Chinese menu. What I didn't know that I was missing out on was the weekend lunch buffet! This is not your stereotypical Chinese buffet, no no. I told my mom it was kind of like eating at home, but buffet style. Hot soy milk, fried gluten sticks, and a ton of other mouthwateringly authentic dishes. Be sure to try the eggplant, the fish, and the chicken wings, too! You know it's a good sign when the majority of the restaurant is filled with Asians. If you're looking for good authentic Chinese food in a buffet, this is the place to go."], ["Aireal M.", "We came here due to the rave reviews of the buffet food here on yelp and a close friend recommended this restaurant. We missed the buffet so we ordered off the menue. Food was very average service was excellent."], ["Brad S.", "I could eat asian food every day of the week, so scoping out the chinese takeout joints in my new neighborhood is an important task.  So far, Imperial Garden is in the lead.  My friends and I gathered up some Chinese to celebrate the Oscars.  For not very much money, we stuffed ourselves and had leftovers for two days, and it was all delicious.  The standout, for me, was the crispy orange beef.  The sauce was thick and sticky (ha!) with just the right amount of heat.  The meat was incredibly crispy, despite spending ten minutes steaming in the car on the ride back.  The dish is exactly what you want when you order orange-anything. We also had the steamed dumplings, which were soft, chewy and substantial.  The filling was delicious, very flavorful.  The crab rangoon was the opposite - I found the filling to be bland, and there wasn't enough of it.  I'd skip them the next time.  We had one veggie dish - some delicious string beans with jalepenos.  They were great - the beans were still firm (ha!), and the sauce was hot without being overwhelming.  The service for takeout was good - the food was ready when promised.  Bottom line:  if you're in NW Columbus and jonesing for some good, cheap Chinese, here's your first-choice (for now...)."], ["Cherie R.", "So, after torturing my husband last weekend at home in Chicago with the folks and all sorts of Korean and Taiwanese (courtesy of sister-in-law) foods, I prolonged his torture by dragging him to this place for lunch yesterday.  The lunch buffet is definitely for the adventurous eater, not for a Panda Express connoisseur.  Seeing that my husband will try anything once, I didn't feel TOO bad about dragging him here.He liked the eggplant, various braised and stirfried types of pork (which he called \"the hammy looking stuff\"), spicy mussels, and the chicken wings.  I liked all of the above, plus the seaweed salad, noodles, hot and sour soup, and the red bean dessert soup.  And hot soy milk!The skin on the dumplings was just a little too thick for me."], ["Birdy N.", "Been going here for over 4 years now, and have never had less than an awesome meal here.THE FOODI can only speak for the authentic section of the menu....the majority of the offerings are standard american-chinese fare, though friends tell us that also is done very well.My perrenial favs are Chicken or Fish in Schezuan Peppercorns, Shredded pork with dried tofu, any of their greens especially Water Spinach. The weekend lunch buffet is heaven for those who want authentic chinese.THE ATMOSPHEREStandard family run chinese place, could actually use some updating.THE SERVICEThe family runs the place and they are all super friendly. The dad is hilarious too."], ["Mike H.", "I would say that this restaurant is slightly above par for a Columbus Chinese restaurant.The Szechwan Sesame Noodle appetizer was really good.  I used to order a similar dish at Hunan House back in the day and haven't been able to find it in years.  It didn't disappoint.The General Tso's was ok.  The texture was good but the sauce was a little too sweet and gelatinous for my taste.  It could have used a little more spice.There was a dish ordered off the House Specialty menu section but I can't remember what it was.  My best guess is a seafood combination in garlic sauce.  It had a lot of potential but was ruined by a boat load of celery.  I like celery just fine but there was so much of it that it overpowered the dish."], ["David M.", "Was there for authentic Chinese buffet.. disappointed.. soy milk was watery.. sweet n sour rib.. taste old.dry.for 11.95. Was expecting a little more?.. again disappointed"], ["Joe H.", "Okay, Here it goes... The Imperial Garden blew my socks off.... My wife and I with our three kids were in Dublin for the Labatt Blue Hockey tournament and got this massive craving for Chinese food. So I plugged \"Chinese\" into yelp and Imperial Garden came up on my list. Reading through the reviews I was a bit skeptical about going in, but decided that I am the adventurous type, lets give it a try.  First: We were greeted by a gentleman named Jeremy (who happens to be the owners son) who showed us to our seats. He was very helpful even bringing an extended authentic Chinese menu out to us. He patiently answered all our questions and gave his suggestion on what he liked. We were very impressed with his professionalism and knowledge of the food. We tried the Hot Pepper Chicken, Low Mein, Orange Chicken and Empress Chicken. It all came out hot, crispy and oh so delicious. After eating till my poor stomach hurt we still had enough left over for another meal. So the portions are nice and large. The price was very reasonable as well, with each plate costing around $12 on average. I would highly recommend this place to anyone and we will definitely be back the next time we go to Dublin."], ["Jason S.", "I can't feel my tongue. It's a little alarming.Sometimes I just want to sweat. Awkward, I know. I'll open a restaurant's menu, search around a little for whatever insignia indicates hot & spicy, and see what strikes my fancy. Hot food isn't really a Columbus specialty, but some Asian restaurants in the area let you vary the level of heat and offer a fair number of inherently spicy dishes. Imperial Garden has a few that come in at a slow, satisfying burn, along with a wide assortment of traditional Chinese dishes and what I've heard is one of the best Chinese buffets in town.Let me fall face first into a Yelp stereotype (even featured on The Simpsons) by advising you to order off the Chinese menu rather than the standard one, specifically if you want some spicy fare. The Szechuan peppercorn variations featured there (pork, chicken, beef, fish fillet, and tripe) are my favorite spicy option on any of IG's menus. Szechuan/Sichuan/however-you-want-to-spell-it-uan peppercorns, which look like little Pacmen with tails, are unique Asian pepper variations known for causing oral numbness and a tingling sensation. They aren't spicy on their own, but instead are augmented by hot or chili pepper to create a mess of stress and confusion for your mouth. They're fantastic. My tongue's all a-tingle just thinking about them.The first time I went to Imperial Garden, I ordered the chicken peppercorn variation. The dish isn't excessively spicy; the Szechuan peppercorns actually make your tongue a bit more susceptible to the heat of the chilis and spice blend, which doesn't overwhelm the palate. It's truly delicious, and one of my favorite Chinese dishes in the city. Their eggplant in garlic sauce and red hot diced chicken are also excellent, rounding out a great set of spicy dishes, with many more yet unexplored. Compatriots who've dined here have been generally impressed by their meals, ranging from moo shu pork to chop suey to cashew chicken.The buffet is my next adventure. Reports are that it's one of the best in the area, featuring more authentic Chinese dishes than many others, and at a reasonable price. Oh gluttony. On top of that, there is a portion of the Chinese menu only written in kanji, and a similarly indecipherable Taiwanese menu. The menus are online in PDF format, so you can get some coarse translations of the individual dishes if you're ambitious. Of course some translations will border on useless, unless Garlic Mud White Meat is in fact a traditional Chinese dish and Pickle Factor One Hundred is in fact a traditional Taiwanese dish. Wonder what the dishes actually are? So many food adventures yet to go."], ["Rachel B.", "Please note, we did not dine here! We visited with the intentions of dining but did not recognize the majority of the items on the buffet. (I did see some goat, tofu, rice noodles, ) I just wanted to alert prospective diners that this is an authentic Chinese restaurant and not the common Americanized version of a buffet. The venue was nice and service very friendly!"], ["Christina A.", "So for New Year's Day a group of us decided that we should have Chinese to get our pork and sauerkraut on. Due to the high reviews on here, we decided to hit up Imperial Garden's buffet. I will say that I am not a super adventurous eater particularly when things are not clearly labeled. So with a slight New Years hangover, I bring my plate up to the buffet as I look forward to some comfort Chinese, egg rolls, to ease the pain. There was not an egg roll in site. Also, I was extremely disappointed to find that  I could not really identify anything but the fried chicken and white rice(which never seemed to be full and what was left was cold). I attempted what looked like beef and onion, which was also cold and not very tasty and what looked like sausage and onions. Most everything else looked too much like some kind of seafood, especially the thing that appeared to be squid, tentacles and all.  So after an extremely unsatisfying meal, our group of 10 took our 1 bill to the register to pay. Friend #1 goes up says \"I am only paying for 1\" hands the cashier his card, Friend # 2 goes to pay for his wife and himself and says \" I am paying for 2\" and hands off his off. I then go up and say \" I am paying for 3\" (myself, husband and step-son) to which the woman asks me if I am sure. I look puzzled and say yes and at this point she puts her hand on her stomach and say that the don't charge like that. I am apparently a little slow, but my husband sees what is happening and replies \" You think my wife is pregnant, she is not. You just insulted her!\" And now unsatisfied and quite embarrassed, I wait to sign for this horrific experience so I can start my not-eat-anything-new-years-resolution. Overall, if you are an adventurous eater and you have a desire to be insulted, this maybe the place for you. But I will not dine here again, in fact, I may not be dining anywhere for a while lol:)"], ["Robin R.", "For a little background info, I am of Indian / Trinidadian heritage so have grown up eating and loving lots of varieties of spicy foods. As I am new to the area, Imperial Garden is the first local Chinese Restaurant that I have tried. After having read about a few of the local places here on Yelp I decided to try them because of the reviews that they served good spicy food and because they were listed as offering delivery, and because they were pretty close to where I now live.I called them and ordered the Hunan Chicken (Extra Spicy!), the Bean Curd Country Style, a couple Spring Rolls and some Crab Rangoon. To my disappointment though, they told me that delivery was not available to the apartment complex I live in, even though it was just about 2 miles west of them. It was a bit of a let down, but I made the drive over there in about 6 minutes on a Friday around noon, so it was not too bad.On a side note, for anyone wondering where the plaza is that they are in, it's the same one with a local BMV office, on the North side of the street, just a little west the intersection of Hayden Run and Sawmill.The service was fast and staff was friendly, and the place was pretty full. The portions for take out were good sized, tasty and well prepared and my wife and I enjoyed the food. The only negative thing (for me) is that I found the level of spiciness was not as hot as I had hoped for. I do plan on going back and trying different dishes as well as eating in sometime (where I can tell them in person again that I really can handle the hot stuff), so I will probably be updating this review whenever I do."], ["Christiana C.", "Christmas night we were looking for a place to eat and called all over to find a Chinese place open.  IG's laid back reply?  \"Yeah, sure, come on over.  We're open till 10!\"  I was predisposed to like these people.  We had great waiter service even thought the restaurant was moderately busy.  And the food was out pretty fast.  But the main event, the food?  It was just good for me.  Admittedly, I did not heed fellow yelpers and take a look at the Chinese menu.  I went straight for the Americanized Chinese food, so maybe that was part of it.  But the sesame chicken was just good and the fried rice was a little peppery.  When we went to pay, we asked how we split the check and a staff member said, \"well, it'd be easiest for me if you just split it three ways\", even though we didn't all have the same things costing the same amount.  So, I don't know, that part was a little weird.  All in all, for Christmas day dinner, it was good.  I just don't know how often I'll be back."], ["Craig L.", "I had high hopes for this place but it was just good. Big portions for the money but really uncomfortable seats and a very impatient waitress. She took my girlfriends order before mine, as in 5 minutes before mine. I asked her for a few  more minutes for me to make up my mind and she then asked my girlfriend what she would like, left the table, then came back for mine. How and why do you take half an order when someone at the table blatantly asks for more time. Bad service, that is how! The terrible service dropped the place a star.I actually really liked the Szechuan Chicken I had and my lady liked her Veggie Egg Foo Young. Food, 4 stars. Service 2. Average 3."], ["Joy W.", "It's getting worse and worse, especially for the buffet."], ["Maharaja of Gaipajama G.", "I came here expecting a different sort of buffet based on the reviews of Joseph A. and Peter L. Boy, were they right! The buffet IS different. Different foods and different tastes. Hidden in a strip mall I never frequent, I would've never thought to explore this place. Thanks to our adventurous eaters here to pointing the way. The owners were attentive, happy to see us, and re-filled the buffet even though we came ten minutes before the tail end of lunch time.Every dish had a distinct flavorful taste. I especially enjoyed one chicken dish with what tasted like coriander leaves on it. Dessert was included, and was authentic. There were other clientele, all of East Asian descent or origin. I'm guessing this is what Chinese food in China tastes like, for all of these people to come here. While I was getting dessert and dumplings, kept in another part of the buffet room, I spied some of the owners and waiters eating the same food we were. That's ALWAYS a sign of quality. In fact, before the waiter took from the buffet for lunch, the owner asked us if we were done eating from there. At the end, she asked us to tell our friends about it. We definitely have. It may not look like much from the outside, but coming here gives you a different buffet experience than the usual. And is less than ten bucks."], ["Joseph A.", "If you are an adventuring eater, and have a group of the friends that are the same- you owe it to yourself to come here and order off the Chinese menu.Gather up 4-6 people, order 3 to 4 dishes off of the menu, enjoy.  You will leave full and feeling like you had a food experience.  This is the closest I've had to the 'walk-into-a random Chinatown restaurant in SF/NYC/Toronto and order what the locals are ordering' experience in Columbus. I have come here a couple times for work-dinners.   Half of my coworkers are Japanese- and they love coming to this place because of the availability of more authentic Chinese food.Sorry- I can't tell you what the local Chinese population thinks of it.  Some of my favorites are the Szechwan Peppercorn fish.  The salt and pepper squid.  The duck.  I've never had anything I didn't like or at least was interested by.  The vegetable dishes are good as well- a good balance to the smoke and spice of the meat dishes.  I especially like the Chinese greens.  (Sorry- can't remember the name).I have come with only my wife and ordered 3 dishes because we couldn't decide, and ended up with enough food easily for six people.  We ate it for the next three days.  It was $50, but it was A LOT OF FOOD.  I halved my grocery bill!    The service is friendly (but 'family-owned' style if you catch my drift).  The décor is ho-hum.  The restaurant is rarely crowded at dinner from my experience.  It's between the BMV and a down-on-your luck looking drinker's bar.  Go for the food!Notes:-Sometimes if you go on Friday's you will be treated to a group of Older Chinese people singing Karaoke to the open room.  One guy that seems to have a thing for Elvis isn't bad!-I have an advantage here that my wife is Japanese, I can speak Japanese- and we can read the Chinese characters on the menu and guess what some of the mystery items are.  There are English translations on  parts of the Chinese menu to as well- just not all of it.  The menus are available as PDF's from the restaurant's website.  This isn't one of those places that hides the authentic menu.-I've never had the buffet, but it may be a good option for someone looking to try a lot of different things who isn't able to round up a group.  I can't confirm though if the buffet focus on the more authentic stuff or not.-The owner and waiters are friendly.  Feel free to tell them that you want the Chinese menu food- and ask for their help.  You can just ask what the most popular dishes are.-The tables can be a little sticky, the restrooms not the cleanest.  The décor is outdated.   The owner will bring a 6-pack of Tsing-Tao to your table in the cardboard sleeve and open it in front of you.  That's the kind of place it is.  This isn't a scene.  It's authentic Chinese food sold authentically (at least to as far as I can tell!).  I'm simultaneously warning you and suggesting that you give it a try!"]], "Sun Tong Luck Asian Cuisine": [["Lindsay E.", "By the far, the BEST in Asian Cuisine in the entire city of Columbus. She uses traditional heritage cooking, without MSG. They even have a sign on the fortune cookies that encourage you to read the fortune and not eat the cookie.Truly a treat every time, especially the atmosphere. Typically greeted by name or at the very least a smile & \"How are you doing today?\" with genuine interest."], ["Fred B.", "Tasty, inexpensive Chinese takeout food. Really nice people.They offer very good dim sum all the time, though Helen literally broke my heart cutting back to just offering pork instead of the pork and shrimp shu mai that I loved so much... :-(Good place."], ["Andrea H.", "First of all, Helena is a sweet heart. I had what is most definitely the best take out call ever. She even called me honey! Our order was ready in a speedy ten minutes. We breezed in and out of the shop, but not before noticing their firm stand against hydrogenated oils. Thanks for looking out for me!We ordered a veggie curry and pad thai. Both dishes were delicious, although I'd definitely recommend the Pad Thai! We could tell the food was freshly cooked and that coupled with the level of service makes this a go-to for anyone craving quality, speedy chinese. Definitely recommend!"], ["Autumn E.", "After a dozen visits (and while literally sitting here waiting for takeout!) I thought it was time to review Sun Tong Luck. Sun Tong Luck is one of the first places I visited after relocating to OH and I have been a regular visitor ever since. The food is sooooooo good! Everything is prepared fresh to order and they do vegan right. All of their sauce bases are vegan and basically all of their menu can be adapted to be vegan. Their tofu is tasty. The veggies are fresh and still have some crunch. Soggy veggies make me sad. They have vegan fried rice available as well as vegan spring rolls. Like I said, so good!Helena is so sweet and helpful! Half the time when I come in I just have her surprise me with a main entree and a noodle or rice side. I am never disappointed. I HIGHLY recommend her Singapore noodles. Her curry blend is fantastic! You can buy little cups to go for $1 and I always snag an extra. Another thing about Helena... I don't know how she does it but she always remembers names. She has some magical ability to recall names and it makes you feel so welcome. She always greets me by name and asks me to say hello to friends I have brought in. It kind of makes me think of what it would be like to go into a place that someone in your family owns. But the thing that makes Sun Tong Luck standout from other places is the food. Fresh. Hot. Delicious. They don't use food coloring, hydrogenated oils, high fructose corn syrup or preservatives. Perfect."], ["Tammy A.", "So I'm going to admit because most of my reviews this week have been off and then you see this one where it's a little bit better. I was not feeling well all week and still feeling about the same. Why I picked this restaurant is because I really wanted to try the Singapore noodles and I was able to handle the curry better than I thought. Like any other day it would be cool but this week I've just been off, like I can't even drink anything too acidic or anything that will disturb my body. I loved the noodles and they had a lot of flavor. The price for the noodles was great. I would compare it to China Way because the lady there also tries to keep her prices low so people will keep coming back. Next time I really want to try the pad thai, it look great as well. I will have to bring my husband here soon. I'm sure he will like the orange chicken or any of the noodle dishes."], ["Mirabelle L.", "It was typical Americanized Chinese food. It tasted decent but definitely not within the top fews of my list. We ordered sesame chicken, general tso chicken, and spicy garlic beef. A bit overpriced for its offering. Honestly wasn't so sure why people raved about this place so much..."], ["Rebecca L.", "The food was delicious for the most part. Egg rolls were definitely just okay, and the fried rice that came with our meals was literally just a funky color of rice. No veggies mixed in or anything. Sure hope that's not what it would be if ordering it as a dinner. However, we got the sesame chicken and the Kung pao chicken and they both were EXCELLENT. So good. The chicken in the sesame chicken almost seemed flash fried-but not heavily fried in crap. The chicken was delicious white meat-definitely no mystery there! I was very happen. The Kung pao def was one of the best flavored I've ever had. My only complaint regarding the entrees were the size. We got large portions to share with a friend and if was hardly enough. But my fiancé and I will definitely be ordering for just the two of us in the future"], ["Tiffany C.", "Man... what is it with me and driving by these Chinese places and going.... \"Meh.. maybe next time.\"I'm so glad I finally made the decision to stop here the other evening. You walk in to Sun Tong Luck, and there is really no ambiance to speak of. There's news articles dating from 1984-current about the restaurant, and some random cliche asian prints here and there. The chairs are probably about as old as the restaurant as well as the wallpaper. It'd be nice if maybe they considered a facelift to grab some dine in customers. However, I'm not really here to look at wallpapers and tiled floors... I'm here for the food. You walk up to the counter, and there are just pictures of the food tacked above. No names... no descriptions, so look and decide what appeases your appetite. I settled on the Singapore noodles and the husband settled on Fried Rice, wonton soup, an an egg roll. My Singapore noodles with shrimp was the bomb. It was really flavorful, and left me scarfing it up real quick. With a lot of places cheapening out and serving salad shrimp in everything.. it was really nice to see some nice big ol' shrimp in my dish.. and more than three of them at that. The eggs rolls were decent. Nothing extraordinary, but they hit the spot. My husband remarked that the wonton soup wasn't bad, but the broth had little to no flavor in it. Service was as expected from the other reviews... friendly, non invasive, and courteous. They remark as having the best General Tso's in town, so perhaps that may be on a future return trip. Sun Tong Luck was a step up from the regular strip mall.. mass take out Chinese places in the area and earns an extra star for the thought and care they put into their food. This may be a minor thing, but they carry different fortune cookies from the pictures here on Yelp, and I will remark that they may possibly be some of the best fortune cookies I have ever had. Yes, something so minor.. can make such a difference."], ["Brandie B.", "Only Chinese spot I go to in town! I come at least once a week! Tons of vegan options. Helena the owner is super awesome too and remembers us every time we come in! Best vegan Chinese food I've ever tasted"], ["Julia V.", "Hands down the best Chinese in columbus! Any of the breaded chicken dishes are out of this world. I love the general tso's, the breading is light and crispy and it's all white meat chicken. I usually don't do breaded chicken at other places because it's always mystery meat. This place is awesome and the service is wonderful. They are very helpful and will answer any questions or make modifications as requested! Definitely a staple on my cheat day list. :)"], ["Naiying C.", "We decided to step out of our usual Chinese food circle and give this place a try. We did take out and when we got home and tried the food, the sauce on our dish was sour like it went bad. I'm not sure how or why, maybe it was their off day."], ["JJ S.", "I decided to give this place a try after reading many yelp reviews! I was initially excited to find a Chinese restaurant in Columbus. It is a small family owned shop and it is not hard to miss because it is located right at the end of the plaza. I ordered the chicken lo mien with veggies. The noodles was drenched in sauce and there was a lack of flavoring or seasoning. I would have to say the customer service was good; the lady greeted me with a big smile so that was a plus!! I might come try this place again and order something others recommended in their reviews."], ["yan s.", "My first time at Sun Tong Luck was such a great experience. It's a hidden gem among all the Chinese restaurants. Don't let the ordinary menu options fool you. They cook everything with real effort and real ingredients, even your ordinary general tso's chicken. First impression of the establishment, it's a classic setup for your normal Chinese dine -in/take out place, you can see the back kitchen behind the counter, which btw is very clean. I was greeted by a very friendly lady, who I believe is one of the owners. I decided to try their signature dishes: Singapore Noodles with a side order of freshly prepared to order Hot and Sour Soup. I ordered it to go, and the owner brought out the soup immediately after it's ready,  because I told her that I wanted it since it's prepared per order.  The soup was spot on, loaded with bean sprouts, tofu, and surprisingly a large amount of tender chicken breast bits. While I was waiting, the owner told me their noodle supply is carefully selected to make sure it does not absorb all the grease and oil while cooking. After tasting the Singapore Noodles, I must say I agree with her. The noodles taste very refreshing and chewy, not soggy or greasy at all.  Unlike some cheap Chinese restaurants, the dish was bursting with  fragrance and flavor, yet the curry taste was not extremely strong. The portion was also great, with plenty of veggie, chicken and shrimps.I am very impressed by the history of Sun Tong Luck, and am happy to see they continue to serve the local whole-hearted. It's one of those places in the neighborhood that you know you are getting the real stuff. Their dedication to their food is much appreciated."], ["Meg B.", "This was our first visit to Sun Tong Luck after adding it to our \"places to check out\" list upon moving to OH.  We were not disappointed.  Helena is incredibly nice and is very proud to use :no hydrogenated oil, HFCS, food coloring, or preservatives (rightly so). Very vegetarian and vegan friendly! We ordered from the vegan specialties list: Tofu black bean sauce and Spicy garlic tofu, both full size. First, the portions are very generous! We both (very happily ) had enough left to pack away for tomorrow. The vegetables were cooked perfectly, the sauces were unique and delicious, and the tofu was lightly fried to golden brown. Helena also suggested we try a vegetable spring roll, while promising that the next time we came in we'd order two, right again. The wrapper was light and crispy (even after the car ride home) and we greedily ate our respective half and hoped for more.  I can't wait to come back , this is a stand out place that really cares about their customers and menu. Next time, the vegan singapore noodles and TWO vegetable spring rolls, please."], ["Andrew J.", "I just discovered this place a few weeks ago and it has easily become my go to Asian restaurant  in north west Columbus. It isn't flashy on the inside but that's ok because the food is top notch. The ingredients always taste fresh including the shrimp! The hit and sour soup is always great and they know how to make things spicy!!! If you're in the mood for Asian food and anywhere near sawmill/bethel you owe it to yourself to stop here!!"], ["Brandon S.", "We have been enjoying Son ton luc for probably close to 5 years now . The food is high class, what you would expect at an expensive Chinese restaurant  but their pricing is much better . One thing I want to point out , although you can eat at the restaurant , it's more of a carry out restaurant if that makes sense .The Szechuan chicken is excellent, curry chicken is excellent , and the lo mein noodles appear to be homemade and are the best I have had . On top of almost every dish being excellent , the thing that keeps us coming back is Helen . Did I mention this is a family business , husband, wife , and Son n law . Helen will remember your name and is always so friendly . Try it out , and I'll bet you agree . Best Chinese food around , and it's cooked with no hydrogenated oils or syrups."], ["Farid S.", "The food here is just ok in my opinion.  The biggest surprise is that they only serve chicken, beef and shrimp.  No pork option found on their menu.  Ordered the Shrimp Singapore noodles which was just OK. Not much flavor, and Instead of thin noodles they use the wide noodles used in their Pad Thai.  I may consider giving this restaurant another chance."], ["Joey A.", "YUM YUM!  And the best prices too!  I wish YELP was around five ten years ago, bc this would be a update to say it is still the best option in Dublin!"], ["Oni B.", "some people say \"this is the best asian place in columbus\", but do they really know for a fact that it is? have they tried every other place in columbus? i came pretty close to it. a few years ago i tried a different asian restaurant almost every single night for the entire year. after trying over an estimated 250 restaurants in the central ohio area (no exaggeration), sun tong luck was by far the best out of all of them. hands down."], ["Becca W.", "So happy our family found this gem. Owners take so much pride in their restaurant as they should. This place is the perfect example that fresh, healthy food without added preservatives, coloring, etc makes for better tasting food."], ["Dawn M.", "I love this place. The owner takes you in and makes you feel like family. She makes all her food without preservatives and is msg free. Best Chinese in town! A must try!"], ["Vin R.", "I want to love this place based on the other reviews and the very enthusiastic owners.  However, I felt the quality of the food was a step behind that of Hunan Lion (also on Bethel).  On the other hand Sun Tong Luck is quite a bit cheaper.My main issue was that the owners decided to take their phone off the hook for about 45 minutes on a Saturday night (ostensibly because they were busy), making it impossible to call in an order-- forcing me to drive over, order in person and wait for our food.  Not a good situation if you have a very hungry and very pregnant wife with chinese food cravings.  Kind of an odd business model, but I guess it insures quality for the customers they already have.We'll probably go back, but I'll need to know if they're answering their phones first."], ["Neal W.", "Helena at Sun Tong Luck serves the best Chinese food I've had in Columbus and quite possibly, ever. All of the ingredients are of exceptional quality and the flavor is hard to beat. Pair this with her excellent customer service and you've got a winning combination.I generally keep it pretty simple with General Tso's chicken or lo mein but everything on the menu looks pretty good. If you're in the area you should be sure to check this place out. I guarantee you'll likely want to come back for seconds. If so, Helena will likely remember you are a repeat customer and greet you with a smile.Seriously, this place is great. A+"], ["Edy D.", "I haven't had any luck lately. Here's another place that I wanted to be good because of its perfect location, right by a 'cheapie' movie place. It had good reviews but unfortunately I can't give them one.  It's a typical humble Asian establishment and the owner was super friendly, called each patron by name...however the food was not good, bland and uneventful tastes. Sadly, I won't be back!   :-("], ["Susannah E.", "If Sun Tong Luck's food doesn't win you over, their friendly customer service will.I wouldn't even call myself a regular here, but Helena always calls me by name and asks me how I'm doing. If I'm calling in an order on a night that the movie theater is busy, she makes sure to remind me that I can park in the PNC lot. Frankly, I don't think I've ever gotten better customer service from a takeout place.Sun Tong Luck isn't fancy on the inside -- the lighting is unflattering, and the last time I was there, they had put a lonely stick of bamboo in a scratched-up plastic water pitcher and used it for a betta fish habitat -- but this is the only place in Columbus that I can get Americanized Chinese food takeout that doesn't make me feel really sick afterward. I should note that though I'm not vegetarian or vegan, there are some great options for both here. I often order the sesame tofu with extra vegetables thrown in. P.S. I love that there's a bowl of fortune cookies on the counter, but a little sign says not to eat them (hydrogenated oils!).EDIT: OK, I was in here the other day and they now have a legit fish bowl for their betta."], ["Andrew B.", "Service was great. The lady working the counter was very friendly. Good prices. The food was fresh, but the General Tso's recipe was a little too bland for me."], ["Janna B.", "It's so rare to find amazing customer service anymore, and Sun Tong Luck has re-defined it. I go out of my way to get their food and to visit with their fantastic owner. I HIGHLY recommend this spot!"], ["Todd B.", "Excellent dim sum and a great overall dining experience!"], ["Robin R.", "I chanced on this restaurant while out running errands today and decided to just give it a try to see what it was like. I loved it - and will definitely be eating there again!The first thing to note is that the dining area is about what you would expect from any inexpensive fast food/takeout place... nothing fancy. Don't judge the place on initial looks though, while it may not have the ambiance of a higher end sit-down restaurant, the food is right up there with the best at reasonable prices. What makes them stand out in my opinion and was responsible for my 5 star rating was the combination of the personable service, the healthy food and the great preparation/taste.Helena makes it a point to learn all her customers names and seems to be a genuinely friendly person who makes you feel right at home. They also make it a point to use no Hydrogenated Oil, Preservatives, High Fructose Corn Syrup or Food Coloring in their foods. Finally, when I told her I liked spicy food and opted to order the General Tso's Chicken and Crab Rangoon, she let me know she would make sure to dial up the heat a bit more for me. It was in my opinion perfectly done - spicy enough to my taste, but also very flavorful. The other flavors were not drowned out by the peppers. The Crab Rangoon was also the best that I have had so far in Columbus - a light and crisp shell, not oily at all, and with a very well balanced filling. I was in heaven!If you find yourself near the intersection of Bethel and Sawmill and want to have some great food, give them a try. You won't regret it."], ["Kurt S.", "This place is awesome! I only wish we lived closer so I could have it more often. General Tso's is amazing. The lady who owns it is so nice and personable. I really wish they would open a second location on the east side."], ["David L.", "Dine in: lady was very nice..place could use a little cleaning...the smell from the restroom was overwhelming, I did not venture in there I was too scared. I had cashew chicken half size and an egg roll and small Pepsi. Cost $10.59 and was not worth it. Food was mediocre and egg roll was burnt. Will not visit here again"], ["Rich S.", "Sun Tong Luck is my favorite restaurant on the NW side of Columbus. The food and the owners are enough to bring anyone back.Sure when you walk in it looks like most Chinese carryout joints, but the food stands far above your average takeout place. It's made from scratch by an actual Chef, not rehydrated or fried from frozen or mixed together \"semi-home made\" style. You can taste this in their dishes. They have a TON of vegan selections, most everything can be made vegan so just ask! The owners are amazing too. Just go there a couple times and Helena will know your name and what you usually order. She will often throw suggestions my way to try and they are always delicious, though I always come back for the spicy garlic tofu. This place is a treasure Columbus! If you haven't been here, come check it out! You will be super happy!"], ["Michelle S.", "Great crab rangoon, it never fails me! I'm a crab rangoon critic too. My dad has been going there for years and we always get the steam bun, dim sum, soups, crab rangoon, etc."], ["Kevin R.", "As seems to be the trend with my wife and I when we go out to try a new place for lunch each week that we're off together; We found ourselves in the Carrige Place vicinity pushing the late lunch early dinner time frame by the time we got done with our chores/errands (we both work predominantly second shift hours any way so we're used to eating later than most). It was between Bollywood Bistro and Sun Tong Luck and we weren't really feeling indian food. So we gave Sun Tong Luck a whirl.I have to admit I rolled my eyes a little after looking at the menu posted on the door that was complete with questionable use of english (kinda like my reviews) and a typed up paper sign below it claiming their General Tso's and Sesame Chicken were the best in the city. We almost turned around and walked down to Bollywood Bistro. I am very glad we didn't.When you go inside it looks just like any one of hundreds of other chinese take out places in Columbus. It's got a small dining area with a mix match of different style tables laid out in front of a counter that leads directly back into a small kitchen. Above the counter is the typical menu board with pictures of popular items printed out on computer paper. It's no Hunan Lion when it comes to dining room ambience. When it comes to the food it's more.What sets this place apart is what's going on in that small kitchen behind the counter. The food is excellently prepared and very fresh. As the owner enthusiastically put it when I went back to the counter to compliment her on how great my meal was: \"We take no shortcuts!\" If that doesn't seem like a big deal to you then you're probably one of the people who assume (wrongly) that most places you eat (except for fast food) are preparing most things from scratch. They aren't. The chef as well as ownership of this place are not only very friendly, but they also clearly have a passion for what they are doing that shows in their food.Even though I didn't really take it seriously at first I was still pretty much taunted into ordering the General Tso's by the sign on the door. The sign is not false advertising. It is the best in the city that this Chef has had. The chicken is hand cut and battered chicken, not the processed pre-battered chunks most places use. It fries up to a nice and thin but crispy shell on the tender pieces of chicken. Given the thin nature of the batter I'm not sure how well it would hold up if taken for take out, but it'd still probably be better than most. The sauce was delicious as well, not as spicy as I'd like, but thats an easy fix. It didn't taste like the corn-syrupy pre-made brown sauce based sauces that many places use.This (and the last review I did for Taste of Bali) are a reminder to heed the old saying; \"don't judge a book by it's cover\". A restaurant may look like a cookie cutter strip mall joint, and if it does, it probably is, but it never hurts to try it out anyway. You never know when you're missing out on a gem of a place like this one."], ["Kevin C.", "My first venture to this restaurant was just yesterday and I'm thoroughly impressed.  My wife and I are vegetarian and vegan, so when I heard that this placed catered to vegan and non-vegans alike, I decided I had to go.  For me, I was completely blown away by the lady behind the counter.   I assume she's the owner.  She was extraordinarily nice and really interacted with us.  Most restaurant employees I run into are usually kind of in robot-mode and go about doing their job with little interest and with even less personality.  The lady had plenty of suggestions for us, was extremely articulate, and had just a wonderful demeanor.  Personally, I've never run into an owner who had such a wonderful personality.  Anyways, you're probably thinking, \"That's great and all, but what about the food?\"  The food was excellent!  Upon ordering, the owner said that all of their sauces are prepared vegan-style, that way, anything on the menu can be adapted to be vegan.  I never really thought about it, but she said that  many restaurants may have sauces that have been prepared with certain meat juices and then sold as vegan...because there is no meat, per-se, in the dish.  I also liked how we had the choice of steamed or fried tofu.  So while I can't comment about the meats served with the dishes, I can say that the two dishes that we tried - General Tso's Tofu and Mapo Tofu - were excellent.  The General Tso's was sweet and spicy without being too spicy or sweet; it was just right.  The Mapo tofu was a steamed tofu (so it should be a bit healthier) and the sauce was mild and tasty.  We also ordered some extra veggies to go along with the dish.  I'm used to going to restaurants and having an extremely limited selection of foods to choose from.  It's very refreshing to know that Sun Tong Luck can prepare dozens of dishes without meat!  Downsides: parking is kind of weird in this strip mall.  I had to park quite a distance to get to the restaurant, but as I was leaving, I believe that there is customer-only parking that I overlooked.  The interior is also plain and typical of a carry-out, but that's not something that I mind.  If you were planning a really sit-down dinner, you probably would want some place with slightly nicer ambiance.Overall, I'm a big fan! This place has super-nice employees and super-great food with a ton of vegan options."], ["Big Baby Jesus C.", "Wow!  I think I just ate the best Chinese take-out I've ever had.  I don't know if I'd call this place a restaurant necessarily, more like a take-out place where you can also eat-in.  The cashier/proprietor was SO freaking sweet and nice.  I ordered a half order of sesame chicken and an order of crab rangoon.  The sesame chicken I picked because it said \"best in city\" under it in the menu.  It was the best sesame chicken I've ever had, although, I don't think I've ever ordered sesame chicken before.  It was lightly battered  really crispy chicken breast pieces, and it wasn't the usual tempura-ish batter I usually see at Chinese places.  Then the pieces of chicken were sprinkled with sesame seeds when they were still hot out of the batter, and then covered with a very thick, earthy, dark, and pleasantly sweet sauce.  I opted for steamed rice with that.  The crab rangoon came 4 to an order, and they were big triangles of wonton wrapper with the usual filling.  They were nicely browned, crispy, and not real greasy, despite being deep fried.  ~$10 total.I also got to taste the best hot n sour soup (each serving made to order) I've ever had, and the crispy chicken loin was freaking amazing.  The crispy chicken loin doesn't come with a sauce, so if she asks you \"fried or steamed rice?\"  I'd probably go with the fried next time so the rice wasn't so plain.Highly recommend this place for Chinese take-out."], ["Sarah R.", "BEST CHINESE FOOD EVER!!!  Honestly, Helena at Sun Tong Luck serves the best Chinese food I have ever tasted.  The ingredients are high quality and always fresh!  The flavors are amazing every time I visit!  My husband and I crave her carefully created dishes - and sometimes even wake up thinking about eating Sun Tong Luck.  Helena's is so warm and inviting, you can't help but smile the entire time you are there!  I would HIGHLY recommend Sun Tong Luck to anyone wanting excellent Chinese food!"], ["Emily U.", "Friendly staff. Great tofu- perfectly done. Prices are pretty good. Cheap for small dishes- full meal around $10 plus drinks.Would like the veggies to be cut thicker and not cooked to mush. Not much color in the dishes. Eat in is hot and tables are sticky. It's OK, but not my fave. Would go again if in the area, but wouldn't make a special trip."], ["Jared E.", "Hadn't been for a while.  Tried the Hawaiin Chicken tonight alongside some crab rangoons and hot and sour soup.  I've been worried about a lot of things going on in life lately and this meal made me feel so much better.  As always they are such friendly and inviting people.  I know they use only quality healthy ingredients, but I also found out tonight that they don't use any coloring in their food per Helena the owner.  Hence why none of their sauces take on that neon red color, as she explained to me the Hawaiian chicken is usually red for that reason.  It was simply so good.  And as usual I did not have that sickly feeling after eating like I get from most Chinese places, including the king of them all PF Changs.  The meat was fresh, all white and everything here just tastes pure and fresh.  Truly amazing food :)"], ["Katie O.", "This place is awesome! It is cooked without MSG or hydrogenated oils. The food is fresh and they will make it to order. If you want extra veggies, then you get extra veggies. If you want more meet, they you get more meat. The food is not authentic Chinese. It is American Chinese, but it is the best American Chinese you will ever eat. It is totally fresh. The owners are super nice and they will provide the best customer service!"]], "Jie's Good Tasting": [["Joseph B.", "Had the Mapo Tofu out of curiosity and it was amazing. Service was quick, and polite. My server was upfront about it not being a pretty dish to look at and but it had great flavor. What an understatement, it was spiced just right and the tofu was perfectly cooked and tender. Will return for more surprises! And the prices are excellent. It is tucked away in a plaza and was fairly empty, and quiet."], ["Brandi H.", "I was glad to see a new dining option in Grandview so close to where I live, so my boyfriend and I decided to give Jie's a try asap.I've personally never been anywhere where dumplings are an entree, and dumplings are one of my favorite things to eat, so obviously I ordered 16 veggie doughballs of goodness.UNFORTUNATELY, at least 6 pork dumplings were mixed in to my and my boyfriend's respective plates. That's kind of a problem when neither of you eat meat. I asked the server who said no, that's just egg and tofu. But after further investigating, there was no doubt, so we called the owner over, who confirmed and apologized. She said she would replace them and cook up some veggie ones. Spoiler alert, we never got them.This place became more and more packed and hectic the later we were there. I was actually kind of surprised they remembered to bring out my boyfriend's side of rice he ordered later on.The rice hit the spot and the dumplings were plump and flavorful, tasting especially nice dipped in their soy sauce.In the end, we were there for about 2 hours. Just trying to get the check and then give it back easily took the longest as they ran around trying to seat people and get carryout orders together.Overall, I appreciate the authentic handmade food, but I could do without the atmosphere (or lack thereof) and general stress of the place and I'll just order to-go from now on. Also, it's  not ok to mix up meat in a vegetarian order but I'll keep it at 3 stars because the food I was supposed to eat was good."], ["Bill Y.", "No frills place.  Basic 60's style tables and chairs.Very authentic food, ordered pork eat sandwich and dumplings.Surprise was their spicy pork sauce noodles.  it was very good, good hearty sauce and their noodles had excellent texture!"], ["Xiaoran J.", "The waiting time is so long. Expecially during the busy hours. The food is okay. Not my tasye tho."], ["Elaine H.", "Great, fresh, homemade Chinese dumplings in lots of different combinations - pork & cabbage, pork& celery, pork & Shepard's purse, pork shrimp & chives.  The owners are from Xian in western China and they serve amazing homemade noodles in spicy broth that is totally unique to western China. Yum!  They even have lamb noodles although they were out when I was there last. Also have interesting appetizers like \"smashed cucumber\" with garlic and rice vinegar and something called \"Mixed Shreds\" which involves rice noodles and other \"shreds\". This place is a little slice of Xian right in the middle of Grandview.  Complete with a very stripped down decor. They could use a more descriptive menu and maybe a softer atmosphere but they make up for it in authenticity."], ["Yana Y.", "Jie's Yum Tasting! I went there for lunch and got spring rolls for an appetizer and a plate of chive and pork dumplings. The dumplings were oh so tasty. The meat inside the dumpling is not just pork and chive but also has shrimp and other veggies. The dumplings are soft and fresh. I'd eat them every day any time. Their other lunch specials are great as well. For example, they have vegetable tofu plate for just around 5 dollars. The dining room itself is not very comfortable, although the chairs are nice. It's probably better to do a carryout."], ["Li S.", "Good dumplings! They are hand made, unlike the ones you can get from the grocery store. A variety of dumplings for you to choose from. A small dining place with a public parking lot."], ["Joshua H.", "I feel remiss in taking so long to review this establishment, as it has been such a pleasurable addition to my restaurant-going repetoir.  I've had a number of dishes, from orange chicken to traditional Kung Pao, and I\"m always impressed.  The vegetables snap, fresh and full of flavor, the sauces don't run and collect in the middle of the plate, and the proteins are prepared expertly.  Add good old steamed rice and a traditional serving of Chinese tea, and you are in heaven.  All of the dumplings and buns are HAND MADE by Jie herself, and prepared to perfection.  I've never eaten so much Chinese food as I have in one sitting here.  Even when you're full, you have an irresistable urge to just try MORE.    Jie's reminds me of growing up going to traditional Chinese, Korean, and Japanese restaurants. The care, the service, the friendly attitude and genuine appreciation for your business will keep you coming back for more, as will a versatile, but not overwhelming, selection of deliciously prepared foods sure to tantalize your tastebuds.I confidenly stand behind my endorsement of it being the best Chinese I've had since I was a kid, and definitely the best I've had in Cbus so far.  Try it out, show them some love, and enjoy a truly delightful meal!"], ["Thuy S.", "Aside from the really long wait (I waited 45 minutes for dumplings, potstickers, and orange chicken), their food really is \"good tasting.\" It takes a lot for me to even say that since I'm from California and Chinese food there is mouth watering good. Since I don't live in California at the moment, I've learned to try to be more open minded about the other choices Columbus has to offer. Well, let's just say I was about to lose hope on ever eating Chinese food in Ohio again until I came here one day after work. As I've mentioned earlier, we ordered the dumplings, potstickers, and orange chicken. All were very good except I felt I've had better dumplings (again, Cali girl talking). Aside from the realllllllllllly long wait, I'm sure my husband and I will be dining here again."], ["George Y.", "This is a tough review to write, because I really enjoyed the steam buns and dumplings that they serve and prepare from scratch. The food came out fast and hot, and you can't complain about that. My major gripe is that the service is nearly non-existent. I know that some people say that you should expect slow to poor service in a Chinese ma and pa shop like this, but there are limits. Our server did 2 things, bring us water once and bring our food. We didn't get any napkins, no chopsticks (or spoons, forks, knives), no plates to share dumplings and no bowls to share the fried rice or egg, tomato noodle soup we ordered. There is a table along the back wall where they have take out containers, spoons and knives. No chopsticks and no plates or bowls to be found there. I was tempted to take some to go containers and use those as our bowls. I'm not asking for nonstop refills of water or every 5 minutes stopping by our table to ask us how the food is, I'm just asking for the basic tools needed to eat and share noodles, soups, rice and dumplings. We literally had to pass the bowl of noodles and the plate of rice back and forth between us to eat. Ridiculous.One other thing that irked me. The space is relatively small, fits roughly 8 tables. So on a day when it's 15-20 degrees freezing-mini-polar-vortex-cold outside, they decide to prop the front door open to air out the kitchen heat. This door is literally 5 feet away from me. The cold air flooded the restaurant fast. Everyone at my table had to put our winter coats back on. How about just propping open the back door of the restaurant? So to sum things up, great food, non existent service."], ["Wen G.", "the dumpling just feel normal. The food comes so slow!!! I wait in the store one hour for a plate of dumpling. Although there is only four table, the waiter come to slow when we call!!!"], ["Nathan L.", "Based on the previous comments I decided to give this place a chance, as I love pretty much all Chinese food. Maybe it was because of the snow, maybe it was because it was the weekend. Whatever it was, I wasn't impressed. They had a 4.99 lunch special, which includes a can of pop. Great deal! I have it a try, and being on a tight lunch schedule got it to go.  I ordered a combo of sweet and sour chicken, and asked if the rice that came with it was pork fried rice (my favorite). She said no it was just fried rice. Ok, said I, because after all, it's still fried rice. I also ordered an order of potstickers. After waiting 40 minutes (my lunch break was only supposed to be 30 minutes), I received a plate of sweet and sour chicken with white rice. Not to go, not fried. At this point I just wanted to go and eat my food. She boxed it up and handed it back. Still had to wait another 5 minutes to get the potstickers. While the dumplings are indeed hand made (saw Jie rolling them through the curtain), they were only good, not great. Definitely better than standard food service pot stickers, but not the best homemade ones I've had. I expressed my concern about how long it took and that I needed to get back to work, and she apologized."], ["Randall L.", "Was in Grandview planning on going somewhere else for lunch. Noticed Jie's, which is new since I've last been in Columbus. Decided to try. I was very pleasantly surprised. Easily some of the better Chinese I've had in Columbus, and I've been all around. The hot and sour soup was maybe the best hot and sour soup I've had. Recommended. Got the Yu Xiang Chicken for entree. Very good. The customer service was great, but I did come at an off time (around 2 pm), so I was one of only two customers in the restaurant. I had leftovers and asked for a box, and they offered to give me more rice to take home in the box, which I gladly accepted :). I will definitely come back to this place and I recommend it. Always nice to find hidden gems like this."], ["Allison M.", "I am skeptical about any new Asian restaurants but was drawn to Jie's based on Yelp reviews and the menu which includes homemade dumplings, pork buns and hand-pulled noodles.  I have only found similar food in China and China Towns in NYC.  My sister-in-law is from northern China and the food is the style her family eats.  I cannot pronounce it properly, but the Za Jing noodles with tofu are my favorite and I was glad I ordered the tomato egg noodle soup - which was not on the menu but they seemed pleased when I ordered it.  The pork buns are authentic and delicious; I am under the impression that the restaurant has x amount per week and when they are out they are out.  Pork buns are typically a breakfast food and not eaten with dinner, but I will get an order from Jie's anytime I can.  The restaurant itself is small and very minimal, if you go on off hours some tables are taken up by staff and it has the feel of waiting in someone's home while they prepare food.  I have not eaten and the restaurant and would not necessarily recommend dining in; take-out is best with the family-style portions."]]}