{"Lashish the Greek": [["Danette N.", "Love this place...so glad we finally made it here!! Friendly staff, excellent food and huge portions.  We will definitely be going back soon!"], ["Shea H.", "The food here is rather basic.  I've tried twice and both times I was not particularly impressed.My veggie gyro was a wee-bit flavorless and the fries were... just blah.  I consider myself pretty easy to please when it comes to fries and these weren't all that great.I was given some sort of yellow piece of cake or something for my wait and it was yucky.At least parking was easy...Oh and to the patrons of the female persuasion: the older, owner-looking gentleman, although very sweet, seems to like the ladies and will pretty much violate your person space when flirting.  He put his face in my neck region and I felt kinda violated.  You have been warned."], ["Robb M.", "Amazing food and great service!!! I absolutely LOVE this place!!!"], ["Jessica S.", "I ordered takeout & I really enjoyed the LaShish Gyro Platter, it was absolutely delicious. The Greek salad was rather bland. The Dolmakia, for the lack of a better work was mushy and gross... I love Dolmakia, but I did not like theirs. The baklava was off; it had all of the ingredients but it just didn't taste good. I also orders the chicken lemon soup and combo appetizer plater but put them away due to being full... I'm hesitant about trying them. I love Greek & Mediterranean food, but that wasn't either.... It was an \"-ish\" food, had the ingredients but not the heart or flavor of the cultural food in it. If you ever go to Morgantown, WV you should try the Lebanese bistro and Ali Baba's both are better than this place."], ["Ronnie P.", "Good customer service. Good food. Large portions."], ["Meron G.", "I was in the area doing some shopping and decided to stop by for a quick lunch. It's a small/comfy, family owned restaurant, with about 15-20 tables. I ordered a regular beef/lamb Gyro with everything on it and a cup of lentil soup.The soup was good but lacked enough salt and pepper. After adding some salt and pepper, the soup was much better. The gyro was absolutely delicious and flavorful! The meat was soft, tender, juicy and the temperature was just right! Hands down one of the best gyros, I've had in a long time. The owner also added to the positive experience. He greeted every customer that came in, checked to see if we enjoyed our meals and started conversations; \"with every customer\". You could tell that he genuinely wanted to make sure, that every customer left happy. I will definitely be back! :)"], ["Curt P.", "Add Lashish to the list of places most people like that I do not/have been ruined by one bad experience. Again, it just comes down to hospitality. The food was pretty good, I got an assortment of Kabobs over rice but the vibe I got just wasn't worth the reasonably well done authentic cooking. If the owner/manager/host whomever doesn't want me there, well then I certainly don't want to be there. Maybe I have some sort of persecution complex, but the host/owner (I'm not sure he never introduced himself) seemed like he couldn't be bothered to take care of us and just seemed a lot more invested in the other patrons, even running outside to stop some people from forgetting their leftovers. Make what you want of that, if you're the people who are getting the leftovers brought out to them, then this review has an entirely different character. I guess it comes down to this, it's not that he didn't care (the restaurant was pretty clean and well maintained), he just didn't care about us.Honestly, I don't want to discourage anyone from going here, I don't think that others will be doomed to the same experience we had, but I know this is not the place for me."], ["Andrew C.", "This is a constant stop for me. As I usual do quite a bit of Chinese grocery shopping nearby.I usually get any one of the plates or their gyros. They all taste amazing. The chicken is soft and tender and tastes really amazing.The owners and servers are also very nice and they also give you free things. I have gotten free soup/tea before.Definitely would suggest this place and I will keep going back. It is the best greek you can get in Columbus"], ["Madison R.", "I stopped by here to meet up with a friend and his family.  I wasn't planning on eating, but the owner brought me a complementary bowl of soup.  Can't complain about free soup.  I also ate some of their Greek fries, which were awesome, and I got a slice of delicious mail order NY style cheesecake."], ["Candace M.", "Upon looking at reviews for new places to try in Columbus, we saw that Lashish the Greek was highly rated and decided to give it a shot.We walked into the restaurant. Immediately, we noticed the restaurant was really small. We took a seat and, soon after, were greeted by an individual who appeared to be the owner. He didn't seem particularly excited to see us; he wasn't unfriendly, but it seemed like we were putting him out. He was a lot more courteous to everyone else in the restaurant. Before we ordered, we received a lemony chicken noodle soup. It was good, and a pleasant surprise. We ordered the deluxe shish kabob combo and a shepherd salad. Mine came out after about 10 minutes, and my boyfriend's took about 10 minutes after that. We waited way too long for being 1 of 3 tables in the restaurant. Everyone else had already been served, so there was really no reason for ours to take so long.My salad tasted more like the individual parts than a combined salad; I tasted tomato, cucumber, banana peppers, and 4 olives. The dressing and feta cheese were fairly tasteless. My boyfriend's shish kabob was pretty good, but again, took forever to come out. Someone else came in after us, ordered the shish kabob, and got take out fairly quickly; not sure why that took so much longer than ours.Every other table got special treatment; the owner personally brought both other tables something in a take-out box; bread maybe? He even walked one all the way out to a patron's car. We received nothing of the sort. Because the restaurant is so small, you feel like you're right on top of the people next to you. We were unfortunate enough to hear every single tidbit of a rather obnoxious conversation happening at the table immediately next to us. We were unable to have any conversation over their loud banter. We were pretty disappointed. If we were enamored with the food, we might consider take out. However, the food was good, but not worth the experience. The prices also weren't great for what we got. We will not be back."], ["Russell S.", "Excellent quality. Nice variety. Dessert to die for. Friendly atmosphere. Reasonable prices. Wish they had a restaurant in the state where I live."], ["Jacinta Y.", "So I tried out Lashish tonight for dinner, and I was pretty pleased with the results. My husband and I didn't get anything particularly out of the ordinary. We both opted for the gyros combo w/ fries. The gyro meat was cooked well, and the tzatziki had a great flavor. I could've done without the overabundance of shredded lettuce though. The fries were pretty good as well. They weren't too crunchy, and they were seasoned pretty well. Plus, the food was super affordable."], ["Beth E.", "It's Friday after 2 and this restaurant has all its tables filled. It's not noisy and crowded. It's just comfortable and relaxing. My husband and I a nice early dinner. My lamb chops were delicious. My husband really enjoyed the Grecian chicken. I highly recommend. Great prices. A nice find!"], ["Sarfaraz J.", "Lashish #GREEKFRIES Are going to make you #jump #jump.Seriously a bang up owner who does a bang up job.#GreekFOOD4LIFESas"], ["Anthony N.", "A cozy, sit down restaurant with very friendly wait staff! I came in for lunch hour and got the Greek fries, which was a hearty helping of fresh cut fries covered in a greek yogurt sauce and feta. cheese  I didn't even ask for ketchup as the toppings provided ample flavor. I had the shawarma, and my friend had the lunch gyro, which are typical of your Greek fare. Food was served promptly, and we were able to get in and out, even with the friendly owner coming by to chat with us."], ["Cara C.", "Strip mall restaurants make me nervous. You never quite know what you're going to get. Sometimes it's a total win & other times... not so much. Lashish the Greek was a win for me! After seeking the help of local Yelpers, I knew ya'll wouldn't steer this visitor wrong.Small, local place with what seemed like authentic Greek food & workers. I'm pretty sure it was the owner making the rounds that night, saying hello & asking how everyone was doing. While I waited for my take-out order, another worker treated me to some delicious hot tea. For the price you pay, the ambiance isn't much if you're dining-in, but since I was getting my food to go, it didn't bother me.The highlights for me were the hummus, baba ghanoush & fattoush salad. I really enjoyed my Grecian Chicken meal & my husband liked his salmon. Veggies were steamed & not drowning in butter or oil. We shared the appetizers with others but it still turned out to be too much food for us, which meant leftovers the next night - hooray!Lashish is definitely on our list of places we'd stop at again when we return to Columbus."], ["Denise M.", "Coworker is 100% Greek and very picky.  We have been here multiple times for lunch.  Service and food are always good.  Today I had blackened grouper on salad.  I don't normally order anything blackened because it overpowers, but this was amazing.  And had enough for lunch tomorrow!"], ["Emily L.", "My new favorite Greek place in Columbus. Also, Bethel Road in general is the cultural melting pot of Columbus when it comes to authentic world cuisine. How is it that the best Korean BBQ, Mexican tacos, vegan Indian food, Vietnamese, fine French dining, and now Greek food are all within a mile from each other?! Very awesome. Anyway, my boyfriend and I came here after a failed attempt at going to the Greek Festival (no parking). We had wanted to try this for awhile, so it worked out perfectly. We started with the smelts appetizer and they were amazing. Huge portion of smelts with a creamy dipping sauce. Then for dinner, I had the moussaka, which was the biggest piece of moussaka I think I have ever had. It was delicious. My boyfriend had the shawarma platter, which was also huge and delicious. We took home 2 pieces of Greek baklava for dessert. I pretty much want to go back here ASAP. Also, the owner was so nice. He visited every table and even gave us some tea as we were finishing up our meal to enjoy."], ["Phil S.", "Amazing Gyro. When you walk in, you feel like it's family owned and I like that about this place. To the poster who gave it 2 stars named \"Shea\", The reason your veggie Gryo was \"tasteless\" was because you got a veggie gyro bro. Get some meat on it next time."], ["Vicky T.", "Wonderful little place, and what a hospitable man the owner was! A personable, hearty man. Disclaimer: I do not boast a Mediterranean dish expert, but I feel comfortable to say I know quality food.Now to proceed with my dinner:I hate lamb. My mom tried various ways to convince me otherwise. Wine, spice, sauce, somehow nothing cut it; nothing compliments. Well, I shared both a beef gyro and shawarma with my foodie buddy. I loved it. Generous portions of meat, and the chef did an excellent job adding spices and cooking it, tender and juicy. Very impressed with my dinner as well as the hospitality. I will visit soon again with friends!"]], "Acropolis Gyro Palace": [], "Funny Greek": [], "Nazareth Restaurant & Deli": [], "Taste of Greece": [["Holly K.", "I stopped by this little truck on my way home one day due to my one friend had mentioned, at 10am, she woke up craving a gyro. Well, needless to say the craving got me too....only at 6p. Service was quick. For the amount of food you get, you can't beat the price of $5. All ingredients were fresh and tasted pretty good. I still am a fan of the Gyro Shoppe in Dublin and Henderson Rd more but it was still decent. If you're in the area, stop by and give it a try."], ["Corrie H.", "First off let me just say that the owner of Taste of Greece is so friendly.  My husband and I love the gyros here, the prices are really great also.  I have had a lot of gyros and I can honestly say that you can't find a better gyro for the price.  You really can't go wrong here.  My husband loves this place and he is rather picky when it comes to Mediterranean food.  I will say that I haven't really branched out much on the menu, but I would not be nervous to try anything on the menu."], ["Paul F.", "I stopped by here today but only for dessert.  I couldn't help but notice that he has a lot more than just gyros.  I settled on a piece of baklava which I'm going to knock off as soon as I finish this review."], ["Cest Y.", "This food truck is great! The owner is a very nice guy. Besides the gyro are fresh and awesome, he noticed my sister and I were looking at the stuffed grape leaves that he wrapped for other customers and he gave us two just to try. I would recommend this place! Great food and nice person!"], ["Andy F.", "What a great place. The guy who makes the gyros (owner? manager?) is really nice. You can tell he takes a lot of pride in the establishment because everything in the food truck is spotless.The food is wonderful. All the ingredients are fresh and nothing is wilted, overly oily, or anything like that. The food is simple, delicious, cheap, everything you could ask for. $5 for a large lamb gyro is as good a price as you are going to find and its the real deal, cut from the flame seared spit. No pre-sliced nonsense here.The other major benefit of stopping here is that you can pop into Savor Growl (formerly the Weber Market) really quick and pick up excellent beer while your gyro is made."], ["Aly H.", "The BEST gyro money can buy. It's seriously tasty and authentic. By authentic I mean it's a GREEK gyro, not an Americanized version of a Greek gyro. The owner is really nice, although a bit serious. You can buy feta cheese, olives, etc. a la carte. Look for the red food truck on the Weber Market lot."], ["Andrew B.", "Fast, cheap, and delicious. I've had better, but I'd certainly never complain about grabbing a gyro here."], ["Ryan S.", "Great place great gyros probably the beat I ever had will most def return here.  5 bucks for a large can't beat it.."], ["Forrest C.", "Gyros are by far my favorite food. I've tried gyros at probably 9 or 10 different places in Columbus, and this is by far the best!"], ["Jeff M.", "I love stopping by here when I'm in Clintonville. Fast and excellent for the price! I normally get the gyro but the Souvlaki is really good too. They have a sign that says, \"Best Gyro in Town\", which some other reviewers have pointed out is not true, and they're right, but it is the best in town FOR THE PRICE!"], ["Yousif S.", "This is my favorite gyro. The tzaziki sauce is authentic,it doesn't cover up the flavor of the meat. If you're expecting some over garlicky ranch sauce then don't come here because you'll be disappointed. A small gyro (which is actually a pretty good size) is $3 but I highly recommend adding feta for an extra $.50 ."], ["Gavin D.", "I was so hopeful about this place.  Went on the day of the big storm (summer 2012) when the power was out.  I'd been seeking (still am, sadly) a good gyro in Columbus and thought to myself: what better time to hit the jackpot on a gyro truck around the corner from my house?I told the nice guys running things that I was really hoping and they told me I wouldn't be disappointed.  Unfortunately, I was disappointed.The tzatziki - it's bland, please sex it up!  The meat is bland too - and at least you could crisp it up on the grill.  That's really all it takes for a decent gyro - that and not getting the balance all wrong with too much pita (which I don't even remember because the main stuff was so off).There are lots of people in the area that want legitimately flavorful food - but maybe I'm wrong and there are just more people who like bland food.  I pray the new generation of younger people moving into the neighborhood - and anyone who likes tasty food - will usher in a new era of food in our friendly confines."], ["Kyle H.", "Stopped by today for a Gyro...It was okay. Pita bread was soft, gyro meat had good flavor and texture but nothing special."], ["Jim F.", "I have been eating gyros since I went to the 1st annual Greek Festival in 1971 and this gentleman's are some of the best!  I have the good fortune of passing his truck every night on the way home from work. I call ahead, tell him it's \"The OSU Guy\" and he knows exactly what I want and it's always ready when I get there. This place is tops all the way around. My kids love the food too so it makes for an easy dinner on nights I don't want to cook! I have never been a member of Yelp or any other \"review site,\" but I love this guy's food so much--I signed up just to Yelp about it!"], ["Sandy W.", "I'm no gyro expert, but I think the lamb gyros here are pretty decent. I buy the large size for $5, and I usually can't finish much more than half of it in one sitting, which is great because I can save the rest of it for later in the day as a snack. My bf likes to jazz his lamb gyro up with feta, which costs an extra 50 cents. It also only takes me a few minutes to walk to this place from home, which is a big plus for me since there really aren't many food choices within short walking distance. It's definitely saved me on days when I'm too bogged down from schoolwork to go anywhere far."], ["Lori W.", "I love to stop here. Where else can you get a small gyro for 3.00. Personally it fills me up. Makes for a great for lunch. I love the iced Greek coffee for 2.00 as well. The owner is very nice and his truck is clean. They take debit cards as well. I only wish they  had fries."]], "Apollo's Restaurant & Spirits": [], "The Happy Greek": [["Christopher S.", "Great environment, great food, great service. Thanks Alex. Walking distance from the job site. Good for blue collar and white collar. I felt very welcome."], ["Allison R.", "I had the gyro pita and the eggplant dip as an appetizer. It was all delicious! The gyro had a wonderful spice mix in it."], ["Lukus T.", "always happy to suggest this place and bring out-of-towners in.let's get straight to the point.  I come here for one item-- the gyro.  when they say it's the best in town, they are not fooling around.  the place has won numerous awards and rightfully so.  it's so overloaded you have to use a fork at first and eat it like a salad before folding it.  meat is fantastic, sauce, all great.  I suggest ordering grilled jalapeños for an extra bite.I've had other options, as have friends, and I've never heard a bad come away.I'm not kidding you when I say that if you're on the strip and craving Greek food, this is one place you have got to try!"], ["Megan B.", "The Happy Greek is my favorite Greek restaurant in Columbus. The service is always excellent. They are very friendly and always get things right. The food is always out quickly. My favorite thing to get whenever I get Greek is a gyro platter. Happy Greek's gyro platter does not disappoint. The meat is perfectly seasoned and the pita bread fluffy. Good Greek salad and fries are always piping hot. Check out this place for your next Greek craving!!"], ["Allan M.", "I ordered the keftedes kebabs which is aGreek meatballs over rice pilaf with mixed Greek veggies and it was amazing. My friend ordered the lamb shank pasta special which looked spectacular and he said was equally awesome. The service was a bit slow though, but not horrible."], ["Melanie F.", "Yum! It's a total dive, but the food is so good! The flaming cheese and greek salad was amazing! We come every time we are in Columbus!"], ["Tim A.", "A lot more posh on the inside than it looks outside.  Very intimate and well decorated.  Friendly staff,  great drink selection.   Great place to stop and relax after work, or go for date night.  Enjoyed it greatly...but don't recommend the feta fries.  Fyi...they love their lemon sauce as well, it's on almost everything.  Check it out if you like greek!"], ["Bob F.", "Good food. Pricey for lunch.   Had the gyro pita with fries. $12 which included tip (no lunch menu). It was good, lots of meat. Friendly employees"], ["Kathryn W.", "I came here with my in-laws after a long morning at the Cheer Competition at the Convention Center! We were STARVING! It was one of the first casual places we approached out of the convention. I have always heard good things about Happy Greek so was excited to try it out!When we walked in we were immediately greeted and seated. It wasn't too busy so it was fast to get a seat.The atmosphere was nice, but did not feel very clean. The Restroom was terrible. I felt dirty when I was in there and couldn't have gotten out fast enough. As a whole, I felt as if the place was becoming a bit run down and updates and regular maintenance within was lacking very much.We ordered multiple things and enjoyed all of the meals! My mother in law ordered a salad and was in love with it, much so, she said she could have eaten another one! I ordered a Gyro since I hadn't had one in awhile and it was very good as well! My father in law then ordered a plated gyro and polished that off!Only other thing it seemed, although there wasn't a lot of people dinning since it was later in the afternoon.. all the waiters/waitresses seemed very confused and disoriented. There was one gentlemen directing orders out loud for all the customers to hear and then the waiters/waitresses just seemed like they were trying to heard cats. Our waitress was upset because one waiter took her table... but made it known enough that I saw the minor problem occur. All this made it a bit uncomfortable.If I get invited by friends/family to dine here, I will definitely go, but it's not at the top of my list. Food was great, but service was very unstable!"], ["Anton T.", "I enjoyed the atmosphere and the food at The Happy Greek. Hummus was delicious, and the Gyro pita may very well be the best in Columbus. I am only visiting Columbus for a few days, but was pleased with the quality and service."], ["Michael T.", "I am originally Greek and I can vouch that their food is authentic and tastes great!  I tried their tzatziki, skordalia, hummus, and baba ganoush.  All 4 dips were excellent.  Pita was fresh and warm.  Also had kalamari.  My friend raved about how it was cooked perfectly and was not too rubbery.  Finally I had the keftethes pita.  The spices on it were perfect!"], ["Wendy V.", "Plenty to eat for meat eaters and vegetarians alike. Veggie Gyro - lots of options for the appetizers too. Vegan and vegetarian options are possible. We ate in the back patio on a warm summer night. It was absolutely perfect."], ["Alaina C.", "Everything here was delicious. Our server was new, so he couldn't tell us a whole lot about the menu when we had questions, but he was very quick and friendly. I tried the pastitsio which I wouldn't normally order at a Greek place (I'm a gyro fan) but it was good."], ["Cooks C.", "Yumm food!! A must try for vegetarians! I was really happy to see so many vegetarian options for a change. I had the vegetarian platter and my husband had the Greek lasagna thing (again vegetarian)...both were really good! I'll go back  again for sure!"], ["Kelly B.", "My new favorite Greek Restaurant. Highly recommend. Great dips, warm pita bread and friendly service."], ["Leah L.", "Great greek food! Great drinks!  Service was great!  Everything was great!"], ["Arun A.", "Awesome Greek food. Love everything I've tried here. My favorite is the spicy argos with gyro meat!"], ["Michael B.", "Happy Greek, you're like pretty good. Like, then gyros in my belly and I'm like so happy. Like wow. Like at a good price too."], ["Linda T.", "Happy Greek is an authentic Greek restaurant. The food is amazing, the service is very good. It's always my must go to place every time I visit Columbus."], ["Mare B.", "In town on business for 5 days, I ate at The Happy Greek twice. (I stayed across the street from the convention center, it was a quick walk past interesting storefronts.) Delicious food, I had lamb shank with delicous rice and fresh sauteed veggies.Second time, fresh grouper special - they adjusted recipe for my dairy allergy. Decent prices and wine selection. Great service, good advice from staff.Very casual atmosphere, typical Greek restaurant decor, but more serene atmosphere - they have close captioned TVs with basketball games! cozy bar."], ["Vinny G.", "We stopped here due to reading positive reviews while visiting Columbus and were very happy we did. Every dish was excellent and our waitress was very friendly and efficient.We started with vegetarian dolmades which were served warm with a nice rice/spice blend inside tender grape leaves. Very good oil and lemon over the top. For main courses we had the spicy gyro and charbroiled snapper. Both were delicious. I asked for the sauce on the side because I didn't want butter, and the chef prepared a different sauce with no butter on the side. Nice touch,The spicy gyro was nicely spiced; hot enough without masking the meat. The snapper was flat out perfect. Tender and flaky. Sides and salads were fresh and tasty as well.We drank soft drinks and refills were free and came often.Prices were very fair considering the quality of the food.A very good choice if you're in the area."], ["Donna B.", "Stopped in on a Friday night, around 715.  Most places around had an  hour plus wait, so we were glad to find a table for our party of 5 right away.We had one who had never eaten Greek food, and another who is a picky eater.  We were all pretty hungry, and so ordered hummus.  It came with 8 pita wedges!  Not really enough to take the edge off for all of us.  Hummus had light garlic and lemon favors, nice but not awesome.Entrees were fried calamari platter, gyro platter, 2 gyros, and pastitsio.  Everyone seemed satisfied with their meals, but no one was raving.Glad we had decent food at a fair price.  Since I don't live here, next visit to the Short North will be trying something new."], ["Eric S.", "Number of visits: ~5Most recent visit: 6/2013This is a pretty good Greek place.  I've had Greek food I like better (for example Greek St. Tavern), but the food here certainly is not bad.  I always order the Gyro Pita.  On my most recent visit the lamb was ever so slightly drier than I expected but not terrible.  The garlic fries served with it are pretty tasty, but in a bit of a small portion.  I don't go to Greek places with drinking as my top priority, so this isn't much of a minus to me, but the draft list isn't very extensive.  About six or so on tap, but at least they have the Elevator's Dark Horse to appeal to people like me who always look for something local first.  This place does a great job with the OPA! experience."], ["Zack R.", "Happy Greek is just a few doors down from our place, so we finally gave it a shot based on the close proximity. I had a gyro because I wanted to see how they handled the most basic of all \"Greek\" foods. Pretty damn well actually. The meat was tender, juicy, with just the right amount of crispness. The sauce wasn't the typical tsatziki (sp?), which they do have, but it was a garlic cream sauce. It was delicious and they put on just enough to compliment the flavor of the meat. It comes with lettuce, tomato, and banana peppers, but I went as traditional as possible and got the peppers on the side. Served with some pretty good parsley fries, though I think they were frozen.My wife got the Greek salad with crab cakes on top. First off, the salad was pretty boring. Iceberg, black olives, feta. I know that's a Greek salad, but they could have put some more exciting versions of those things on it. There were also some of the worst pepperoncinis on this thing too. The crab cakes were fishy tasting, with an overwhelming amount of cream sauce mixed in and breaded in panko and fried. Yuck. Probably the worst crab cakes I've ever had.Go with the gyro. You'll be happy with that."], ["Bear C.", "My 7 year old daughter had a nice time here. She loved the flaming cheese dip and I knew exactly what I was getting with the gyro platter, no frills but it's a gyro. Fun night out after dealing with cheer moms all day. I would certainly come back."], ["Thomas S.", "My wife and I shared one appetizer (a shrimp selection), one pita and dip order, and two entrees.  The flavors in each one were amazing and unique.  I am glad she finally drug me out to a Greek place.  My entree was perfect and her lamb could have been more tender but overall this place was a real delight for a Sunday lunch."], ["Sean M.", "The food was great, I tried the spread combination, it was very good share for two. For main course I had the mixed grilled medley. The lamb chops were tender and tasty."], ["Lindsay B.", "Good place for a late dinner! Environment: The lighting was a little weird and the neon lights around the bar was different, but it was an overal nice place!! Very authentic!!! Food: Delicious!!! The gyros were all good! Everyone had a different one and they were all delish! The fries were really good and so were the vegetables on the side instead of the fries! Drink: Good, we all had some Greek beer! Way to go Greek bar for having Greek Beer!! Price:VERY reasonable! My boyfriend loves places like this ;) So pleasing and doesn't break the bank. Service: Very nice and helpful!! This is our favorite Greek restaurant!"], ["Mark H.", "Good place, not at all bad. There are other places for Greek food that are better. It will be hard to top Yanni's. Our food was okay. The service was good. I had the chicken Zagora (sp?). It is their exclusive dish. The chicken was a little tough and the flavor was nothing outstanding. The lemon potatoes were below average. The rice pilaf had an odd (but not bad) flavor. My wife had the Chicken Athena. The chicken filet was very tough. Tasted alright. Coke is served, that is a plus!The restaurant inside is nice with the typical Greek murals on the walls. One of the employees must of not had a baby sitter so the restaurant served as one. The young boy in the corner making play noises and moaning was a little annoying."], ["Chris S.", "Just go in and order anything.You will be pleased.Food is exceptional and service fantastic.Stuffed red snapper sound good?Wait till you taste it."], ["Angela H.", "Excellent Greek food! The flaming cheese is very fun, what with lighting it on fire and saying Opa! The flaming cheese also has a really good taste and texture to it. The dip sampler is also very good, especially if you like to try new things. Both the cheese and dips go great with the warm pita bread.For entrees, the gyros are absolutely the best. They were perfectly cooked, great flavor. My friends said the Chicken Lemonata is also a great dish to try.I will definitely be going for lunch again!"], ["Mikey B.", "Perhaps the best Greek food I have had.  The veggie couscous was AMAZING.  falafel--ehhhh; maybe a stretch but has almost a johnny cake flavor to me.  But otherwise I highly recommend this reasonably priced delicious restaurant.  5 stars."], ["Joel M.", "Happy Greek=Happy Geek!Pita was wonderfully fresh and delish as was the hummus I dipped it in.  Baklava = best in Columbus as far as I am concerned.  This is a MUST if you are in town for the Ohio Linux Fest or any other conference at the Convention Center.Opa!"], ["M. C.", "Yes!  I gave this place  2 stars.  And I'm not ashamed, unless an Elite yelper yells at me.  Oh well if they do! They can Suck it!   My big hairy elbow! That is!  Perv!   Har!  Har?!   Why Lee?   Why did you rate Happy Greek so poorly?  You ask?!  They nickel and dime you on the fixings!   The FIXINGS!  And I loath and detest a place that does that.   Seriously.  I just paid you 10 dollars for a pathetically made gyro and you won't throw a little more banana peppers and cucumbers on it.  And you charged me a dollar!   Grrr!   You what I'm taking a star away.   Take that Greek boy! Are you happy now?   Man, I need a life."], ["Lydia W.", "Love at first taste: the warm, fresh pita quarters. The perfect accompaniment to any meal. G and I knew exactly what we wanted before we arrived thanks to previous reviews. So we set out to split a Chicken Lemonata and a Spicy Chicken Argos.The Chicken Lemonata is probably a safe choice for those who don't want to venture too far in their gustatory range. It's tasty, yet familiar. You can also get it with delicious garlic yukon potatoes. We ordered some veggies on the side. This was good, but I was much more interested in our second dish. The spicy Chicken Argos was kind of like a stew, PERFECT for eating with the pita. Anything I can eat with pita, I will. It was a wonderful level of spiciness, and the taste was magnificent. I would happily get this dish every time I visit the Happy Greek. It also comes with hummus and has delightful veggie pieces. Again...very pita friendly. This place is wonderful to celebrate birthdays and hang out with a group of friends. I really enjoyed the atmosphere and the service was decent! Parking is a bit of a pain but it's worth the struggle."], ["Sara C.", "So, the boy and I occasionally force ourselves to go on dates -- I mean, have enough money to go out -- and so on Sunday after work, we walked down to the Happy Greek.  We arrived around 5:30, and it was pretty slow, so we had our choice of seats, and ended up at the back of the new patio.  It did fill up quickly after that.  The boy had a Stella while I indecisively pored over the menu.  He ended up with the beef shawarma platter (which somehow I DIDN'T get to taste) and I had the lamb tenderloin platter.  The platters were quite large, and came with french fries, a greek salad, and rice pilaf.  Does anyone know why the french fries?  I don't, but they were so good that I wasn't going to ask any questions.  They went great with the salad dressing too. I don't know how the beef was, but judging from how fast it disappeared, it must have been good.   The pita was really yummy too, although I only got one piece before it disappeared too.  The lamb was decent, although a little tough and dried out as if it had been overcooked or sitting on hot plates a while.  I probably wouldn't order that again.  The waiter was friendly although a little distracted (forgetting our silverware, not bringing our pita til midmeal).  We also were not offered a water refill until just before we were leaving.  Our total including tip came to about $45, which goes a bit over budget for us.  Good, but not somewhere we'd go regularly."], ["Aaron C.", "Loved this place, went here for the first time and I been craving a gyro.  Was around the area and saw they had a gyro special with fries for $5.99 couldn't past that up so I went in and ordered it.  The inside is very welcoming.  The waiter was very nice, I ordered the gyro special and the feta cheese got to have the feta cheese and a order of fried calamari.  Now here's the real test calamari is easy to screw up, (bad or not probably would of still ate them if it was edible).They brought out the calamari first so I was snacking on that, while the gyro was being made.  And I have to say it was delicious, perfectly fried and breaded.  Was halfway done eating those, when they brought out the gyro.  Now I was expecting a small gyro since it is a special and all (normally anywhere around here special means half the size)  Well they bring it out and this thing was huge.  Didn't think I would be able to finish it but I did.  All in all I was very pleased, and have to say its rare that I am this happy with a restaurant around here.  It is pricey but if you can catch their specials, it is well worth it."], ["Angie P.", "I love this place.Whenever I want a good gyro this is the place to go. The meat is so moist and perfect. I usually just go with the classic gyro pita with extra banana peppers and it keeps me full for hours. We usually get an appetizer of hummus & pita as well. The staff is extremely friendly. Just a good experience every time I'm there."], ["Christina H.", "2.5 stars. I've been here four or five times, and I think might officially be done with this place. I just keep leaving feeling nickel-and-dimed. My husband and I usually each get a gyro pita and fries. It's the perfect amount of food for me, but not quite a big enough portion to satisfy my hubby, and for 9.50, I feel like it should leave us both filled. Not to mention that I substituted tzatziki sauce instead of the garlic dressing, and learned once the bill came that this \"premium\" sauce warranted a $1.00 upcharge. I went back with friends soon after that experience (friends chose it, not me!) and ordered the four-dips appetizer combo. It came with exactly 7 tiny pita slices. Our pita was gone and we still had 2/3 of the dip left, but ask for more pita? Upcharge. I promise I'm not one to write a poor review based largely on the price or value. I get it - rent's high in the SN. But give your hungry customers a full, satisfied feeling, and don't upcharge them in the process! Service is also a bit spotty. Gyro meat/flavor I'd give a 7 out of 10. I've had better (though not in C-bus). Tzatziki sauce is 9 out of 10. Portion sizes for the money is where Happy Greek just falls flat."], ["Liang G.", "Fairly good food.  Thought it was pricy for what it was.  Portions were generous, service was prompt.  Yet to find a better Greek restaurant in the area"]], "Mykonos Gyros": [], "Pita House": [["Gwen W.", "I had a Groupon I still needed to use, and since this place has caught my eye several times when scanning the \"100 Best Restaurants\" list, I figured why not.The gentleman at the register was very polite, nice greeting when I came in. At first, he told me they couldn't take the Groupon I had because they got a whole new register system/tablets. I was kinda bummed. However, he offered to call the higher up and double check. Whaala! They could figure it out - *smile*. After trying a few of the side dishes, I loved the Matbucha and Tabouli. Light, fresh lemon tastes of the Tabouli. There made-fresh hummus has the consistency of chocolate mouse! Pillowy soft, great chickpea flavor, not overpowered with spices/garlic. The stewed tomato taste of the Matbucha was a personal fav! Huge chunks of the mixed-in veggies. I couldn't pick, so I caved in and went with the Lamb Schwarma Plate with Tabouli and Matbukha for the two sides that flank the dollop of hummus. I've had moister meats at other Greek spots, but the onions and sauce cooked in with this lamb was a plus. The portions are huge, so I took some of that Matbukha bad boy and mixed it in with the Lamb Shawarma and the hummus. Good? Grrrreat!! I definitely had leftovers. The Shawarma platter cost $10.99, thus the $12 Groupon made this a happy evening :)"], ["Michael G.", "Some of the best humus in town.   Always fresh and served with a dolop of tasty olive oil. Most of their sides stack up pretty well to what you can find around Columbus.   Falafel add-on choices seem endless and tasty. Bathrooms could use some attention.   I took off a star for this important oversight."], ["Andrea L.", "I've driven by this place local to my residence in Whitehall.  I walked in the first time in months and was not disappointed.  The flavors and seasonings are vivid in these dishes.  I ordered the Lamb platter, Sambusas, coleslaw, and Chicken Shwarma.  I'm so glad I came here and I hope to come back.  The food is not greasy, is healthy and I feel so good after eating this.  I can't say this about other food in Columbus.The associates and owners are good-hearted people and warm towards customers.  And I hope they continue on more years to come.  I recommend you go here and try something different from the last time you ordered every time.This is categorized as Lebanese, Jordanian Palestinian inspired dishes."], ["Miranda L.", "The best hummus in Columbus, hands down. It's perfectly balanced and spiced.  It makes all the other hummus I've eaten in Columbus seem so bland, boring, and flavorless. Like I said in my tip, we drive from UA to get it. Every time we even consider eating at any other Middle East/Mediterranean restaurant (aside from King Gyro; but that's Greek), we wind up at Pita House. The falafel is so incredibly delicious.  Flecks of hot pepper and visible coriander coupled with the pillowy, yet crisp texture sets the bar so high for any other falafel I'll ever eat. The lamb shawarma is mouth wateringly spiced as well. Tabouli, beautifully bright and of course, delicious.  Tahini sauce, balanced, palate pleasing, and wonderfully complementary."], ["Jeff J.", "Great falafel. Very cold atmosphere. Not a relaxing Restraunt .... More like a fat food or falafel stand. Also a good app is the babaganoush and humus. Very affordable and clean."], ["Troy S.", "The Falafel sandwich was pretty solid and I would recommend it over a few other med. places in Columbus.  I really liked the presentation of the sandwich as it did look pretty good.  The sandwich artist seemed to take pride in making it the correct way and having it look presentable.  And for $4.99 it comes in at a good value that won't set one back.I also ordered the Eggplant Salad which was a nice compliment to the falafel.  My only complaint is the sign on the outside stating free WiFi but it was a secure password and I was already sitting down.  Ok, Im lazy and didn't feel like getting up to ask.  This is a nice option to get a quick meal on Broad or in the Bexley area."], ["Lisa G.", "Not wanting to venture out much today because the cold and rain I decided to order in for dinner. Not sure of where to order from and not wanting pizza I was quite happy to find this place on yelp. The menu is listed on their site. I ordered a bit of everything to share with my munchkin. We had a chicken shawarma plater that came with pita, hummus, baba ganoush, and Israeli salad. I also ordered kibbeh(1), grape leaves, falafel and baklava. Needles to say I have lunch for tomorrow. The chicken shawarma plater was so good. The stand out for me was the baba  ganoush. The kibbeh was interesting. I've never had it before and I wasn't expecting the all spice. It was good though. The baklava was so good!! Now onto the complaint section of this review. The falafel and the grape leaves were so small(there's a dirty joke in there somewhere). One maybe 2 bites at best. I like large falafels what can I say. The flavors were great. My other complaint is my pita was dried out. I wish so bad it wasn't. If not for those small issues (see what I did there) this would have been a 5 star all the way."], ["Gus W.", "I went here for lunch today and really enjoyed it! I work in the area, but I hadn't ventured down this way yet, and I'm shocked I hadn't, because it was delicious. My buddy and will totally be frequenting this place from now on.I was being conservative and stuck with their jumbo lamb gyro (the bigger of the 2). I got the combo, which came with fries and a drink, and what's this?? Free baklava? Apparently, it's free baklava Tuesday.. what a delight. I also put in a side order of falafel just to try it out.I have to say that I've been to quite a few Mediterranean places in Columbus, and Ohio for that matter, and the lamb here was phenomenal. The sauce was fantastic, and all of the ingredients on the gyro tasted really fresh. The fries were cooked perfectly and had some tasty seasoning on them. They were really nice and crispy with a soft center.The baklava wasn't incredible, but it was free, and it wasn't super sticky like most of the baklava I've had. It wasn't overly sweet either, so that was kinda nice.By the time I was done eating the combo, I barely had room for the falafel, but I muscled a few of them down and brought the rest back for co-workers. They were pretty damn good, and a side order of 12 is only $2.99. So much food. I brought them back to work, and everyone here enjoyed them, although they will leave your breath quite pungent, so make sure you have some gum.Overall, this place will definitely go into our lunch rotation at work. I only wish I had tried it out much sooner."], ["Cheryl F.", "I never write reviews because, well, I am lazy. But today honey, at this very moment, my my my...I am full and happy. I've eaten less than half my food and can't eat another bite! So I walked into this place and it was one couple and the guy behind the register.  I told him \"I've never been here\" and \"I don't eat meat\". He said try the veggie platter and showed me the many things that I could choose from as we had conversation about what made me stop in today. (Everyday I want hummus or falafel.)  He doesn't know me, doesn't know that more than two choices will give me an anxiety attack so I said, what would you get. He said \"I'll just fix you what I would eat.\" Well, let me tell you, he eats good! I've no clue what I had other than the hummus, but it was on point. He was very nice and conversational which is rare. I am in love with Pita House. I will become a regular. You, from Palestine in the black chef's coat who fixed my to go box. I am crushing on you."], ["Brooke M.", "I was seriously craving a gyro and searched for \"gyros\" near me on Yelp. When Pita House popped up I remembered my cousin saying how much she loved it so I went there. Ample parking in front with it being inside of a strip mall. There is an area for you to sit inside but I ordered out. He will let you try a sample if you tell him you haven't been there before. I got the gyro plate $8.99. All plates come with two sides, hummus, and pita bread. The Hummus is amaaaazing, super creamy and smooth. The portions are really big, I could only eat about half before feeling stuffed. The lamb was good, just a bit too salty for my taste but im not a huge salt person. I would eat it again for sure though. Fried cauliflower was one of my sides and the potato salad (kind of sounds like a weird combo as I type it but it was all very good together). Big portions, good pricing, will be back!"], ["Matt D.", "Pita House is not the best Mediterranean I've ever had, but it's very good.  The friendliness of the staff is also a plus.  The lady running the show was super nice and put together a little sampler plate for me, since it was my first time there.The baba was awesome, as were the meats and tabouli.  I thought the hummus was the weakest thing on the plate, because it lacked flavor.  The baklava on the side was really subpar:  dry and bland.  Upon a second visit, I'd go with the kabobs or schwarma, which both looked fantastic.  Not far from the airport, if you're willing to make a two mile detour."], ["LeeAnna S.", "This is right around the corner from me.  I ran up one evening to grab something for dinner.  It was super fast - they were very friendly.I got a falafel sandwich with fries and tabouli salad with a side of pita.Everything was delicious - especially the tabouli!The man forgot my extra pita at first but ran out after me to my car to make sure i got it!"], ["Heather B.", "The hummus is amazing! Very authentic middle eastern food. super nice staff. They fry the falafel to order and it's some of the best I've ever had."], ["Aaron P.", "I'm not a huge partaker of Mediterranean food. That being said, I've never had anything against it, just never had much of an opportunity to eat it living in a small town. On a doctor's trip to Columbus, I decided to stop in Pita House and try something new.So I went with something I had never heard of until I saw the first Avengers movie -- Shawarma. Oh, lovely, delicious, mouth-watering Shawarma!So, yeah, it was incredible. The location is your typical storefront eatery but the food was anything but typical. The aromas that met me when I opened the door conveyed that I was in for a treat.I ordered the Chicken Shawarma Combo, which came with French Fries and a drink. The fries are sprinkled with a seasoning that makes them very good as well.The Shawarma was amazing! Taz made it perfectly and I was overloaded by the flavor combinations of the chicken, the cucumbers, spices and sauce that melded together into flavor nirvana.Kudos to Pita House, and I highly recommend checking this place out."], ["Meriem H.", "Amazing lamb shawarma platter!!!!! The best I've had since leaving the Middle East. Authentic Lebanese cuisine, salads were amazingly delicious. Babaranough was to die for. I'm only visiting Columbus for the weekend but planing to eat here everyday. Oh I don't want to forget about the Bakhlavah, we got a mix of 10 different pastries, they were so good, my taste buds are screaming. I'm going to order a large tray to take home. This is my spot every time I visit Columbus from now on. Awesome food, atmosphere, and service is phenomenal."], ["Godley V.", "Great little find as we were preparing to leave Columbus. Had the lamb shawarma platter with hummus & pita, cauliflower, & Israeli salad. Good portion size, tasty, and freshly made. Noshed on a couple of falafel balls we ordered for the table and they were amply crispy on the outside yet fluffy and very well seasoned and flavorful inside. Was a quiet Sunday afternoon so it was dead inside although more people did venture in later. Location is a little weird - in the middle of a strip of stores - so you would have to know it's there or you may miss it if you were driving by."], ["Brianna M.", "I came here with my friends for a little lunch to catch up on our lives. I got the chicken shawarma. The pita was soft. The chicken was juicy, but it could have been more flavorful. We went pretty early in the lunch hour and the vegetables were still fresh. I got the combo, which came with a small side of fries. They were well cooked, but again, I wanted a bit more seasoning. Overall, it was decent. Definitely not my favorite Greek/Mediterranean experience in Columbus. It's okay if you need a gyro fix and are in the neighborhood."], ["John D.", "This might be my favorite Mediterranean food in Columbus.The falafel certainly is the best I have tried. It is crisp on the outside and very moist and fluffy inside, unlike others that have been overly dense and dry for my liking.My go to's include: lamb kabob or chicken shawarma plate with some assortment of the jerusalem salad, tabouli, fried culiflower salad and the hummus. Perhaps some other locations do one particular item better, but I think the overall quality of Pita House is higher than most."], ["Angela G.", "Excellent, authentic Mediterranean food! The chicken shawarma plate was MASSIVE and delicious. It's like a Piada almost for Greek food because you get to pick what you want on it. Extremely welcoming, accommodating, and cheerful staff made it even better! I'm going back tonight!"], ["Michael D.", "Excellent, quick Greek food. This is a \"fast food\" style Greek place, but the food is far better than fast food quality. I would go here for lunch anytime. I highly recommend the gyro, which I consider the litmus test of any Greek place. Also, Pita House boasts many different baklavas. While we ate there, one of the ladies there gave out free samples! We stumbled into this place traveling from Dallas, TX, and Pita House almost makes it worth making a special trip to Columbus."]], "Mezze Middle'terranean Cuisine": [["Alisha A.", "gyros like no other! soft, warm, fluffy, fresh.. and their baklava! mezze is absolutely to die for."], ["Miro N.", "Absolutely love the place. So many ways to order your food and comes out great everytime. I love hummus so the obvious choice was the hummus plate. The schwarma was spiced perfectly. The fresh toppings of tomato, cucumber, lettuce makes the hummus extra tasty. Will always come back to this place."], ["Tim D.", "The atmosphere here is sort of a crossover between a Mediterranean chipotle and a cafe. Menu selection and building your entree is well spelled out even for the novice. The selections are good. Went with whole family at busy dinner hour on a Friday- place was jamming but management is hands on and proactive.   Service was pretty fast.   food was really good. Had gyro made spicy and it was delicious... Sampler dipping tray was yummy.  Bit overpriced!  But so darn good and fresh.  Very good experience my stuff for school is in the Charger so can you be back as soon as you are ready -Alek"], ["Michael W.", "Solid value and tasty preps.  Kind of like a Medi Chipotle, but so much better and worth the wait.  Very fresh and tasty. You will likely be a fan if you try this place.  Recommend the mujadara with shawarma.  Fries and tabouli are also great."], ["Tony T.", "I walked in tonight (Friday) and the place was rather empty.  3 people were eating in. Anyway I placed my order, and stood around for 18 minutes waiting. 3 people AFTER me got their to go orders made and handed to them before mine was even started. I watched it it made, then it just sat there for 5 minutes before someone wised up and called my name. It seems the gal making everything knows how to run a restaurant because the heavier set guy sure as hell doesnt. Now let's just hope it good. This was my first time here and I'm pretty pissed about the customer service.Edit.Ok. So, it's tasty. BUT, It was stone cold after my 5 minute drive. Tahini overload, I had to scrape nearly all of it off. I'd try again and hope for better results."], ["Krina K.", "I love this place. I've brought my friends here multiple times! The restaurant is clean, the service is fast and friendly and the food is delicious! Definitely one of the best mediterranean food places I've found in Columbus."], ["Kyra T.", "Soooooo good! They are super friendly and everything is delicious. It's like a Mediterranean version of chipotle. The hummus is my favorite."], ["Brent O.", "Eh... So so"], ["Jackie K.", "This is the best Greek food ever. Everything I've tried is flavorful and just the right size. Small place but their always good service."], ["T'Ria E.", "I have never had a bad meal here yet! Super friendly staff and quick.  I love the Greek salad and their spicy feta"], ["Lisa D.", "Update to my prior review. I went back a week after my prior review and it was basically the same :( After that I got a message on yelp from the new owners offering me a free meal and apologizing for my experience. Not necessary..but very nice response. So I went back a 3rd time give it another try (on my dime)  and was happy I didn't give up on this place. The service was back up to the level it had been previously! I ordered my standard  tilapia salad and it was full of fresh ingredients and the fish was cooked perfectly. I also got a Mezze plate with spicy feta, hummus and the eggplant salad. The hummus seem like a different recipe- not as oily as hummus can be..really thick and very nutty tasting..I really liked it. The eggplant salad was really good and is my new favorite. I'm glad I went back that 3rd time!!"], ["Jessica W.", "It was great! Falafel was super good. Everything was very fresh and the staff was so nice and caring. We will definitely be back."], ["Safiyyah A.", "I ordered take out for dinner last night and it was better this time than the first time.  The portions are large to me so I eat mine over the course of two days. This was my boyfriends first time and he loved it. We both ordered bowls. I always add the feta and olives as the premium toppings."], ["Nikalete F.", "We frequent here for lunch. The service is always great and so is the food. Love the \"middle\" twist to the typical Mediterranean fair."], ["Jessica H.", "Great stuff!!loved the beer from Cyprus, there's also Mythos.  I hope they might offer a bucket special on a saturday afternoon someday...Tabbouleh is fabulous with just the right amount of bulger in with parsley and mint.Loved the summer eggplant salad and their homemade dressing.  The baba and hummus were also pretty sturdy.  LOVE the mujadara - that could stand alone as a meal - it's a hot lentel base mix for your fixings.Falafel was good.  There may have been a bit too much cumin?Spicy feta was good, but too spicy for mild-mannered me :)Justin is fabulous and funny, even though he is a Steelers fan.Preferred the bakalva to the chocolate balls."], ["Laura J.", "Went back again recently.  Pleased to find they still have the same excellent food and excellent customer service."], ["Nicole W.", "This place seems to get pretty mixed reviews but I have no complaints. I actually came here based on other Yelpers' good reviews and I am so glad I did.Yes, I see why the comparison to Chipotle. But really, beyond the way the counter and ordering is set up, the comparison stops there.It was our first time there, so the staff gave us a sample of EVERY SINGLE ITEM ON THE MENU. We even told them they didn't have to, because we weren't all that hungry, but they insisted. Well, I'm not going to argue about free food. It wasn't the absolute best Mediterranean food I've ever had, but it was pretty darn good. The baba ghanouj was delicious. I could take or leave the spicy feta, but I get it that they want to have a gimmick. Falafels were flavorful and crispy, the tabouli was perfect. The owner personally came to thank us for coming in.The food is probably a 4 - 4.5 star experience, but the service definitely bumped it up to a solid 5. Well worth a trip to Hamilton Road."], ["Grant C.", "The Mezze plate is so good I've considered taking intravenously.  Puree it and bang in up my left arm yo!Just kidding but its damn good."], ["Laura H.", "Best kept secret on Hamilton Rd.  Best staff and flavorful food.  Walk up and order establishment. Cost is good. Try it. You won't be sorry."], ["Mike D.", "Review update to say Mezze is still going strong a year after my first review.  I still love everything I've had here and I keep going back for more on a regular basis.  The chicken gyro has a nice blend of spices on it, and if you want spicy the spice it up option will definitely get you there.  Service with a smile can't be understated, and everyone here is great.  Johnny is the owner and a super nice guy, and Justin is also awesome and works behind the counter most of the time.  I'll forgive his Steelers hat due to his awesomeness.I have really been enjoying the falafel and feta here.  The feta is really delicious.  Really.  Bottom line, everything is still excellent.  Check it out."]], "The Mad Greek": [["Michael J.", "Great food!!! We go quite frequently and we like to try new things each time and have never been disappointed. Great food to start here are anything with the Greek dressing, Greek/fire fries, and the amazing dolmadaka, but you can't go wrong with a gyro pita, bowl, or platter as well as the great seafood and pasta/lasagna dishes. Also they have a wide range of prices on dishes, which make it a great place for anyone looking to take out or go eat Greek."], ["Gary K.", "Love this place. It's like a little Greek oasis on Broad street. The walls are covered with hand-painted murals giving you different scenes of Greece. Everything is blue... It's like I was in a scene from Mama Mia. When I entered I was warmly greeted and shown to a table. My server was very nice an friendly. Had the calamari with Greek salad and fries. And for dessert they forced me to have the chocolate baklava. Ohhhhhhhh my goodness!!! OK... maybe they didn't actually force me to have desert, but the server suggested it so he might as well have forced me... Overall, I was extremely pleased with everything!! A++ for service, food, atmosphere, and overall friendliness.  I can't wait to go back again and try some more!!! Maybe I'll sing a little tune from Mama Mia for them..."], ["John B.", "Some of the best Greek food I've had. Price is reasonable and service was great!!  I'll be back that is certain. :-)"], ["Becke B.", "Save your money and avoid The Mad Greek like the plague. The calamari we ate on the way home was tasty, but the rest of our $150 (plus $30 tip) takeout order was a hot freezer burned mess. And no seasoning that I could discern. Horrible packaging meant a soup lid busted and soaked everything in the bag. We ordered 2 three dip samplers and they put them all in the same non-divided white styrofoam box that meant that they all mixed together into one gloopy mess. All of the vegetables were freezer burned. The lamb and kofta and the chicken in the mixed grill were overcooked to the point of inedibility. The souvlaki was undercooked and overcooked (it varied depending on which chunk you got). The fish also tasted like it came from a freezer and was so overcooked that even with a fork and knife, I couldn't cut through it. Baked fish should flake easily. We called them (twice, even! the second time to talk to a manager) to see if they could rectify the problems with the order somehow (even if it meant that we had to drive across town again, since they are on the east side and we are on the west), but the only thing they offered to do is replace the one soup that broke the next time we came in (nevermind it ruined everything else that was in the bag with it, and that by this point, we had decided that there wasn't going to be a next time). We paid in cash, so it's not anything we can contest with our credit card company. We got screwed, big time, and hope that our loss acts as a warning that they just do not care about customer service, and if they screw up your order, you're on your own because they refuse to fix their mistakes."], ["Tom W.", "Killing me with your price changes. $7.00 for Kopanisti?"], ["Marla B.", "A charming Greek atmosphere with ethic music playing. I have a feeling we might have caught them on an off day, or maybe it was just what I ordered. But can't give more than two stars for my Country Greek Chicken. Chick was tough, veggies on side without flavor and cold. The sauce was good. My husband liked his Gyro platter. I would prolly try it again and try something else."], ["Kenisha S.", "Great quality and service! The food is always fresh and made to order."], ["Michael G.", "What's with the new prices?  Boy did they take a jump across the board, especially the lamb.  I'm still trying to be a fan."], ["Joshua S.", "I love the hummus at this place.  When I was eating meat, I used to get their gyro salad, which was awesome.  The fries have rosemary on them, which tastes incredible.  Sometime the staff seems rude, but usually they are very friendly.  The food makes up for it.  I've never had to wait long for seating.  And they now have a full bar!!"], ["Andy S.", "Great selection of Greek dishes. Souvlaki is my favorite, but my wife swears by the pastitsio. This is my top choice in Columbus for Greek food. They are also good about food handling for kids with allergies."], ["David G.", "This was my 4th or 5th visit to the Mad Greek.  Every time I've been very happy with the entire experience.  The food and service is excellent.  I recommend this to place to friends without hesitation.  I've only had dessert there a couple times because I'm usually pretty full after dinner.  However, if you enjoy good desserts, they have a wonderful selection that anyone would enjoy."], ["Kristie K.", "Excellent Greek Food!!  Minus one star because their avgolemono soup (chicken lemon) was not so hot.  In fact I think they forgot to add lemon.  It just tasted like good chicken soup.  I did like that they used orzo instead of rice.  Since this is a favorite of mine, I tend to judge Greek restaurants by it.I ordered their falafel bowl.  It was delicious!! I will definitely return.  It may become a craving.  For dessert I had the pistachio baclava.  It was super cinnamony, but not very nutty. I loved it, but its different than any baclava I've ever had.I ordered a Greek red wine also, and it was delicious. They allowed us both to taste the wines before we committed to buying, which was awesome.  Nothing worse than ordering an expensive wine only to find out its gross.Their bakery window was quite impressive and made it hard to decide what to order :)"], ["Robb V.", "Excellent place.  Found this place on Yelp, and took a couple of co-workers here for dinner.  We all enjoyed the food, and one said it was the best lasagna he had ever had (greek lasagna).Close to the airport, nice small, good service, worth a try!"], ["Donald D.", "This is another regular place for whenever I go to Columbus.  The building is quaint, painted in nice Mediterannian colors.  Family owned business, with everyone having a nice thick greek accent.  I had the Greek salad with grouper.  It is a huge portion with plenty of veggies.  The grouper was huge, and tasted good.  I normally do not order salt water fish from the middle of the country, but was not disappointed here.   The creamy greek dressing is very good, but they do not provide enough with the serving, I always have to ask for more.  I didn't have it on this visit, but the chocolate baklava is amazing.  I would love to have lot's of it every visit, but then they would need a crane to get me out of there."], ["Jackie S.", "i was on the fence whether to give 4 stars or 3 and 4 eventually won out just because the food is so good.The wait staff was rude, and the woman who took my order didn't seem to understand (or care) that I kept asking to purchase a pint of tatziki sauce to take homeI hate rude staffBut on the plus side, the food is delicious.  I love their gyros and their house sauce on them is to die for.  They come out so stuffed you have to eat them with a fork.  The french fries are lacking but the tatziki sauce and the warm soft pita makes up for it.I would reccomend this place to a friend but only after i told them how the service sucked"], ["S E.", "I had a ham and cheese pita it was covered in a nasty mayo with oil on top. The service was a joke it took 30 for drinks and there was only five other tables of people. The friend had the mad Greek sub and a 1/2 piece's of meat on the sub we told the waiter he got all pissed grabbed the sub after 10 min waiting he brings is back with 2 Pisces of meat. I will never go to this place"], ["Bill W.", "I can't say anything bad about them - it's simply a very good place.  I have never had a bad meal with them."], ["Carla D.", "Whenever I get the chance to go to the Eastside, I usually make a stop at the Mad Greek.  I first found out about it when I lived in Blacklick and was in seventh heaven!I've tried the Happy Greek, but in my opinion the food there was not as good as the Mad Greek.One of my favorite things about the Mad Greek is it's the place that I've found has the best fried calamari in town.  Cooked to just the right consistency - slightly chewy but not rubbery.  And sooo tasty!So far, all that I've tried at the Mad Greek is amazing.  I agree, they have the best gyros in town as well.  I also love their dolmadakia (stuffed grape leaves).  The lemon sauce that they're drenched in gives them a nice zip.I actually like the look of the place.  The not so smooth whitewashed walls look like the pictures that I've seen of the countryside in Greece.  The watercolor murals of famous places around Greece like the Parthenon in Athens and the White Tower in Thessaloniki add a nice touch as well."], ["Naman N.", "Very good food and service.  Make sure your ordering what you feel like eating and not what you're not sure about and just want to try, it may not be what you think it's going to be."], ["Thomas J.", "Great Greek food.. A regular stop when I am in the area..."], ["Irena N.", "3 stars for the service. The waitress was abrupt to the point of being rude but extremely attentive, and the food came very quickly.4.5 stars for the food. I had the chicken limonato and also a few bites of my coworker's mousaka, and both were yummy. Great little lunchtime spot."], ["Don C.", "This is always our first choice for Greek in Columbus, and has been for many years.  I have never had a bad meal.  The food is always ultra fresh and very consistent.  I must admit that I occasionally will sample my friends choices, but I only ever order ht large gyro, that is ridiculously overstuffed, and insanely sloppy, but o-so satisfying.  Not a good place to take a business client that you are trying to impress with your dining etiquette!"], ["Phat P.", "I went there only once but my colleague tells me he is a regular and I can understand that!We shared a humus which was fresh, nice, and chunky.I opted for the mousaka and this was probably the best mousaka I ever had. that's probably because I was not a fan of this, until I tried that one...Perfectly cooked, with potatoes, ground beef, and eggplants, its just a festival of flavorsA great find in a very unassuming place, really looking forward to go back and try their other offeringsHighly recommended!"], ["Elaine M.", "I've visited Mad Greek twice and have loved it both times! Last night I went for a date with my husband, and we received some YUMMY food and some great service. Our waitress was very sweet and attentive. We started with the Skordalia (potato and garlic) dip with pita- so delish, though my mouth still tastes like Garlic today. The waitress kept the pita coming when we ran out- a small favor that I really appreciated! Husband had the Chicken Shawarma with fries, and I had Grecian Chicken (chicken breast topped with tomato sauce and feta) with rice and buttery veggies. Everything was perfectly cooked and seasoned, and super comforting on a chilly December night! We finished with the chocolate baklava- holy crap, that's one great dessert!!"], ["Sanford R.", "The best go to restaurant on the East side of Columbus. The service is 2nd to none. The own Kahlid always makes you feel like you're coming home. I always order fish is prepared wonderfully and lamb shank is the best in Columbus. If you enjoy dessert you cannot go wrong. All of their homemade desserts are on display and are delicious as the look. The 3 types of baklava,  Tres Leche cake and rice pudding are standouts. When I take my 88 yr. old mother to dinner or am dining with my wife, this is one of our favorites."], ["Joshua K.", "Being a fan of the Mad Greek in Baker, CA (yelp.com/biz/the-mad-gre…), I was thrilled to find a restaurant with the same name while on a business trip to Columbus, OH.  For a moment I thought these two restaurants were operated by the same owner, that is, until I tasted the food. I ordered the gyro plate with soup and salad. The gyro has seriously twice the amount of onion than meat. I like onion, but not THAT much. I bit into not one, but two pebbles in my soup. The salad was okay, but I guess it's hard to mess up something that you don't have to cook.Service was decent even at a rather busy lunch hour, but the food is un-impressive at best."], ["Joshua Y.", "I work up the street, and its beginning to be my favorite places for lunch.  I always get the gyro, but my friends get the salad and it looks pretty tempting.  I've been there over a dozen times, and its so good I sometimes order something to take home for later that day."], ["Olivia E.", "I used to work next door to this place, so we ate there quite a bit for lunch. I've had their Chicken Gyro and their Gyro Greek Salad, and they are both fantastic. The Greek sauce/dressing is to die for, but make sure you have gum or a peppermint afterwards or you may lose a few friends/customers upon returning to work! We mainly ordered take-out from here, so we end up waiting in the lobby for a few minutes. The guy at the register is super friendly.  He'll put a rush on your order if he knows that you are waiting. The price is very reasonable and the atmosphere is excellent. The entire restaurant if filled with intricate mosaic tile-work that I can't keep my eyes off of! The owners and employees are all of Greek descent, so there is a little bit of a language barrier, but this has never been a problem for me. The waiters/waitresses are extremely helpful in selecting a dish if you are unfamiliar with Greek cuisine. Just please don't say \"JI-row\" when you order a Gyro."], ["Michael H.", "Our waitress brought us vodka instead of Ouzo, but maybe she misunderstood us. It was surprisingly crowded inside. I had a traditional gyro. It was as expected. Reasonable prices."], ["Randy S.", "The Mad Greek on Broad has some of the best Greek food in the city in an unassuming location. Found in what appears to be an old Rax building, the restaurant lacks in speed and service but makes up for it in quality and variety. The spanakopita, gyro, shawarma, hummus and baklava are all mighty tasty. And I've never heard any complaints about the rest of the menu either. They have some pretty tasty fries that go nicely on top of a gyro or shawarma. I'm still looking for a stateside restaurant that will put the two together for me like food vendors naturally do around the Mediterranean region.Oh, and check out their website. It's a laugh. Make sure you have your volume up!"], ["Mike M.", "Second time here and is still awesome. I ordered the keftedes and a side of tzatziki. It was exactly what I was looking for. Especially after last nights \"steak\" in Hamilton, AL. Decent atmosphere. I'll coming back when in CMH."], ["Terry S.", "The Mad Greek is a neighborhood restaurant  that I have over the years eaten at often. The food including the fish dishes and appetizers have consistently been excellent. Service is good and prices are reasonable. I recommend the grouper, the escargot sauteed in creamy garlic butter sauce, the hummus and egg plant. I have eaten more  expensive  fish dishes at other restaurants that don't come close to the taste of the fish dished at the Mad Greek.  The atmosphere is mediocre and at times quite noisy."], ["Meredith M.", "I work near the Mad Greek and love that I can come over here on my lunch hour and get in and out within an hour.  They have the best Gyro I have ever had.  They don't load it with iceberg lettuce.  And their pitas are the best."], ["Steven H.", "Although not quite as good as The Happy Greek (located in The Short North and Campus Gateway locations), the near East side's Mad Greek has some excellent food as well. Service is average to poor but the food is delicious. Try the garlic-infused hummus with warm pita, the delicious Gyro Meat Salads with yogurt sauce and the spinach pies and baklava. Great stuff!"], ["Pete C.", "The gryos here at The Mad Greek are top notch every time. The vegetables are fresh and mixed perfectly, the sauce is cool and generous, and the portions of the meat on these things are approaching gluttonous. What this store's relation to the two other Happy Greek locations in the city is somewhat unclear to me, but most of the items on the menu are about the same (including those super-stuffed gyros that they're so famous for). If you aren't in a rush, you definitely need to check out one (or four, in a platter) of the special dips that are served with a side of warm pitas for dipping. The tzatziki is the best I've ever had anywhere in town, and the kopanasti is amazing as well. Unlike the Happy Greek in Short North, however, this location comes off as a little seedy at times. It might have something to do with the fact that it's in Whitehall, or maybe it's more because it's built in what Randy S. observed is an old Raxx location. Speaking of Whitehall, this place is a lot more out of the way than it's supposed brethren, but if you're in the area it's most definitely worth a second look."]], "Greek Express": [], "Anna's Greek Cuisine": [], "Loops": [["Thuy S.", "Their chicken gyros are so yummy. Add an order of fries and it's magic in your mouth."], ["Dee L.", "Is this a chain? The place feels, looks, and acts commercial and mass-produced. Assembly-lined food, impersonnel service, and sterile ambiance.  It's a real shame, because the concept is awesome. The Fire Feta and Clark Street gyro equal gyro-versions of sausage pizza and philly cheese steak.  Avoid the Cream of Chicken Rice Soup - nothing but cornstarch."], ["Paul F.", "I'm less impressed than I was.  My hot dog buns were stale and fell apart as I was holding them.  And the smart-ass behind the register had the nerve to question my prononciation of \"hummus\".  That's okay; no tip for you."], ["Chelsea W.", "Loops is great if you are in the mood for some greasy, quick food. The french fries are to die for!! They are so greasy and crunchy and covered in some delicious blend on parmesan and herbs.Other than that, the gryos and wraps are A-Ok. The hot dogs are good. All around just a good place in a convenient location. The rice pudding is really sweet and yummy!!The staff are super friendly and accommodating. If you call in an order to pick-up, they'll have it ready for you in 5-10 minutes!Plenty of parking off of King Avenue. Try Loops for a quick lunch!"], ["Michael J.", "The Greek gyro was very good, but the hot dogs did not sit well in my belly. The gyro rolls are very good too. Overall, not bad for the price."], ["Angela Z.", "I hate to be so cliched, but based on my first experience, Loops! really earned a solid 3.5 stars and not exactly a 4 rating, but I'm feeling generous...I had the chicken Feta-Fire which is described as \"tossed with spicy feta spread\".  Altough it was tasty, there was nothing \"spicy\" about this feta spread.  Positives:--Great looking, simple menu with tons of choices and I am looking forward to going back to try some other things.--Delicious and extra bad for you friesNegatives: * The food took FOREVER today--during a lunch rush.  I realize this could be an isolated incident and hence my generous rounding up of the star rating :D *  Although my chicken 'gyro' was good, there is a strange, fishy aftertaste.  Not sure if it was the spicy feta spread or the tzatziki I added.  Weird.[on another note, there was a very snarky woman who tried to take over the entire patio seating before even ordering her food--which by the way, didn't come until my party of 6 was almost finished eating]"], ["A L.", "This place is solid. Delicious gyro. Delicious chicken parm sandwich. A variety of sandwiches and pitas. Something to please everyone. Not crazy about the poppy seed dressing on the cole slaw, but otherwise this place is a good fast option."], ["Nate H.", "Fast food greek, with a twist.  I got a steak classic with feta.  Not too bad.What will keep me returning are the fries.  These fries are truly from Mount Olympus.  These fries taste like Zeus commanded Hermes to gather up all of the top-notch potatoes from Earth, drop them off at Hephaestus's forge for cooking and after being deep-fried Aphrodite grooled over the entire batch."], ["Tina G.", "YES!  THE FRIES ARE AWESOME!  The place is super clean.  It takes awhile for the food to be ready (10-15 minutes).  If there are too many people in the lobby you'd have to really listen for your Ticket # for your order.  The seating area seats about 50 maximum. The Spicy Gyro Roll is favored better than the Buffalo Gyro Roll for me!  Love the Hotziki sauce that comes with the Spicy roll. Boyfriend got the Kronos.   It was loaded with chicken and gyro meat.  I suppose you need to request lettuce, tomatoes and 'ziki sauce to balance the meal.  But he loved it as it was.  I took a bite and thought it was good, too!But again....The FRIES are DELICIOUS!  Super crunchy with what seems like they sprinkle a parmesan garlic salt on them!Will go to Hellas up the street soon!  I am still pretty partial to a certain Whitehall Greek restaurant (The Mad Greek) that has a fantastic Gyro and Gyro Salad."], ["Kayleigh A.", "DELICIOUS- I'm not a huge gyro fan, but if I am going to have one- it better be from Loops.  I also love their hot dogs! It is a Chicago-style eatery with fast and friendly service."], ["Jonathan S.", "This was my first time here. I loved how the menu was so simple and everything was reasonably priced.  For 6 dollars, I got a classic gyro, and it was more than enough to fill me up.  Though this place had a fast food feel, the quality of the food certainly was not.  Many greek restaurants tend to make the gyro meats too salty, but the thinly shaved meats served here was flavorful, not salty at all.   I also got the fresh hummus with warm pita.  For 3.95, I ate that hummus as appetizer for the next couple of meals.  Pretty good hummus,  though maybe it would've tasted even better if it had a hint of lemon.Overall, yum! Next time I will try the spicy roll!"], ["Angie P.", "This place is A-OK. Simple menu but tasty. The interior decor is pretty shitty though...but what do you expect? I got the Greek Town gyro and it was pretty loaded up with sauteed onions and peppers. I was happy they weren't stingy with that. I'm also glad that they carve their own meat rather than having pre-cut slices. It tastes better this way. Oh, and their fries are SO GOOD. This location isn't near where I live so I can't imagine going more than once every so often, but, I'm glad I did try something new."], ["Lynn H.", "Feta fire! This is one of my favorite things. Try it on the pita nachos. The fries are awesome. Only negative is that the last two times I've tried to call ahead for carry out no one answered the phone."], ["Christiana C.", "I love me a Dirty Frank's dog, but give me Loops any day.  Loops has a really great Chicago dog.  And those fries!  Those fries are like an angel.  I can't just get a dog since tasting those fries.  I must combo it.  The interior doesn't inspire staying for hours on end but it is clean and fast and there is definitely a place in my life for that.  Additionally, I love the theme of a Chicago el station.  It's adorable and totally works with the product.The service is pretty fast...I don't think I've waited more than 10 minutes for an order and this place is almost always open and never crazy busy (at least when I've been there). Take out is super easy too if you are on the move.  It travels well.  I've actually had the boyfriend get carry out the nights I have to stay late at work.  Loops to me is the diamond in the rough hot dog place I've always dreamed of.  And it can be yours, too!"], ["Adam L.", "The FRIES are AWESOME!!!!!!!!!!!!Also, I really like the buffalo chicken wrap. The Fries are AWESOME!!!!!!!!!!!Gyro is good too. THE FRIES ARE FREAKING AWESOME!!!!"], ["Rob W.", "Some of the freshest Greek food I've tasted and the fries are AWESOME!The owners are really friendly and the staff is great!Even if you have a gluten or dairy allergy they'll make a gyro on top of a bed of fries and you can get the fries seasoned without the parmesean cheese. I've definitely a regular there!"], ["Allie L.", "Eat a Loops if only to try their fries. YUM! I usually get the gyro (also good). They make the food on the grill right there and there are TVs if you're waiting. I don't really like eating INSIDE Loops. It's a bit bright/stark and usually there are people waiting for their food staring at you while you eat."], ["Marshall S.", "I really liked the food but they could honestly use less meat in their gyros (hard to believe, right?)."], ["Christopher G.", "Not a Windy City native, but have been there a dozen times or so. Ive gone to Loops about 4 times now, and everything is de-lish. Gyros are off the chart...lots of meat and fantastic Tzaziki sauce with a perfect garlic balance. Their Chicago beef sandwich is on point too. Even the dogs replicate good Chi-town grub. We will be going back."], ["Matthew B.", "Yay, I AM a fan of Loops! It's not my favorite gyro in Columbus, of course- that's a throne I expect Apollo's will occupy long after good sense has proven me wrong thrice over- but Loops is far better than merely serviceable, and has some real gems on the menu to boot- and I've only been there twice, so there is undoubtedly a gem or two left undiscovered!First, let's get it out of the way: Loops is not perfect. Its atmosphere is a bit too far gone on the sterilization kick, all bleach white and polished chrome and... eck. Too bright, too clean, too unnatural. And am I mistaken, or are those giant televisions ALWAYS tuned to sports? Even CNN would be an improvement once in awhile!Anyways, here's what I love: the fries. Oh God- the fries! Spiced, crunchy, piping hot- damn near fast-food fry perfection. And then there's the menu item I can't get past: the gyro nachos. This is basically your standard gyro meat and gyro fixin's salad with pita chips to eat it with, but with a spicy tzatziki for that extra oomph towards the pseudo-Mexican (I guess). All in all I'm pretty excited when I have cause to be in Grandview for lunch with all the great options around- but more and more my choice has been Loops. Yum!"]], "Panini Opa": [], "Easy Street Cafe": [["Steve W.", "Love to stop by in the afternoon.  Also, was here last week. Had to get the grilled cheese again. Very cozy and relaxing atmosphere. Like the music too."], ["Ms. S.", "I've not been that impressed with the service  or food in the past, but they seem to have redone their menu and changed some things. Recently sat at the bar for dinner as they were on a wait, and the bartender was friendly and knowledgable. Great beer selection on tap and the new menu and plate presentations add some great flair!"], ["Jessica D.", "I have lived in German Village for six months now, and finally ventured over to Easy Street this morning. At 8:06 PM, the time at which I am writing this post, I am still full from brunch... from six hours ago. That's a sign of a meal well spent. I had no trouble selecting a most delicious dish, the El Guapo. Easy Street's brunch is the perfect remedy for the morning/afternoon after a long night of Long Islands at Union. Would I like a mimosa with a hearty bowl of oatmeal? HELL NAW. I want water, and that savory El Guapo: two soft tacos brimming with eggs and chorizo and cheese and vegetables. My belly felt like Queen of the World afterward. I also loved the laid-back vibe of Easy Street. This may sound creepy, but they have hipster mannequins perched in all areas of this place... I think it adds character. The staff is friendly and down to earth. All in all, there is nothing corporate or humdrum about this place. Come with friends, a fun date, your gay brother. I have not been to the bar portion of this place, but I bet they make a mean Gin and Tonic."], ["Matt W.", "This place was Plan C today, but it's going to be plan A (or B) from now on. We wanted breakfast at Skillet, but they were slammed. We decided to try the GV coffee shop, and the line was out the door. We decided to walk into Easy Street for the hell of it....and got seated right away. Our server was fun, gave good suggestions, and hooked us up with desperately needed coffee in record time.It's really primarily a bar, but the breakfast options here are surprisingly awesome. We decided to try the \"pig sticks\", which are basically breakfast sausage corn dogs with cinnamon-sugar coated batter and a big dish of maple syrup to dip them in.They were out of corned beef hash, which was disappointing, but my backup plan was \"The Hangover\", which gave me a big bowl of home fries, scrambled eggs, and the house chili. I asked for some sour cream to finish it off, and mushed it up into a delicious mess that will probably contribute to my first heart attack sooner or later.A friend who was out with us for breakfast got the Pig omelet, which looked fantastic, filled to the brim with sausage, bacon, and veggies, and her husband tried the El Guapo breakfast tacos, which I think I'm going to be back for myself.This was a really nice surprise that I'd never have gone into if GVCS hadn't been so busy. I'm betting a lot of people pass them by in favor of their more famous neighbors, but I'll be happy to take advantage of their mistake."], ["Erin F.", "One of my go-to places in German village. Love the Greek inspired entrees, the bar atmosphere, and the friendly service. Anything with their fried pita or gyro meat is a guarantee for a good meal. Their spinach artichoke dip and their French onion soup is some of the best in town!!!"], ["Liza V.", "I haven't been totally blow away by anything I've tried at Easy Street, but I also can't say I've been disappointed. Service has always been warm and attentive. They've got a decent little selection of draft beers, and also plenty of choices for liquor. They gyros (I get chicken, the bf gets the regular gyro meat) are good, and the tzaziki they make is perfect! I branched out on my last visit and got the Cheech and Chong burger, because I wanted to try the chili, but couldn't decide...and it was delicious! And the curly fries, of course, are yummmm.  I'm hoping the next time I head to Easy Street will be for brunch, since I keep hearing about it."], ["Jaclyn E.", "I used to regularly dine/drink at ESC when I lived in German Village (2006-2009) and loved it.  Unfortunately, over the past few years, both the food & the service are slowly becoming worse & worse.  The server was nice(ish), but extremely slow.  In her defense, she was the only server & the bar was fairly crowded.  We were craving the dip trio... The dips (hummus, tzatziki & garlic spread) hit the spot, but the pita was okay, but the pita was drenched in butter & soggy.  I had French onion soup (which was pretty good) and salad (which you can't really mess up).  The people in the bar (40s+) were clearly having an extreme Sunday-funday... They were yelling/screaming/laughing at the top of their lungs, which made us leave before finishing our meal.  Usually I wouldn't mind people \"having fun,\" but I felt like they were \"Mike's Bar\" drunk & it was too much!"], ["Tom H.", "Great food and service for a Sunday Brunch! We spIurged and I ordered the Jake and Elwood burger.  Before you order this make sure you have the appetite and the room. Hand cut fries are great. The Gyro was authenic as well. Omlettes, Rueben sandwiches all done super."], ["Steve G.", "I've only had gyros ever since trying one here. They're SO GOOD!!  And with the sweet potato fries, here I am thinking of ordering another plate. The gyros are great, and I've also found this is my favorite place to go for watching buckeye games. It's not packed, the game is on most if not all tv's with the volume cranked up, and everyone is just enjoying their food, beer, and the game. Favorite restaurant!"], ["Goose R.", "Went here for Saturday brunch. Nice menu! Had the Alexander the G. It was good. Home fries excellent and English muffin. Nice place. Good service. Definitely will come again"], ["ERIC H.", "Great burgers!  Great fries!  Great brunch!  Great service!  Great atmosphere!  Great neighborhood!  Easy Street Cafe is one of my favorite restaurants in Columbus!"], ["Ryan G.", "New beers on tap to try, which is pretty fun. The food was pretty average. Regular bar food and a pretty decent price. I would come back here again."], ["Sara C.", "This was the first place (after the airport and my friends' house) that I went on my return to Columbus (mostly because my friends live just down the street and we walked there).  I hadn't been, but they are there often, and advised me on the menu.We started with the saganaki, which is brought out in a slightly alarming flaming show, and served with pita.  It was described by one of my friends as \"like the crispy skin of a bird, but with cheese\" and was subsequently devoured posthaste.  One of them ordered a salad with smelt, and the other had a pizza with an almond topping, which was interesting texturally, but which didn't really appeal to my tastes.  I was getting over a bout with laryngitis, so I had a bowl of the avgolemono soup, which was full of lemony chickeny noodley goodness that was great for being sick, though I'm not sure I would order it under normal circumstances.It was pretty crowded when we were there (late dinner on a Saturday), and despite the double doors in the entry, we got a few gusts of cold air sitting at the table by the front door.  The ambiance is pretty busy and loud, so it's not necessarily a good place for conversation (especially if you have laryngitis).  I wouldn't mind visiting again when in proper health."], ["Buddy Jack E.", "Stumbled onto this place quite by accident. We were scheduled to go to Thurman Cafe. Got there and it was packed. No problem, we'll try this cafe place on the corner. It was wonderful. I highly recommend it and I'll certainly be returning in the future. The Greek fries were new for me and I'm glad I ventured off the traditional chips or standard fries at the server's suggestion. My burger was great, too. Perhaps a smidgen overcooked but too much is better than too little when it comes to cooking burgers! Good food, good atmosphere, good times. I can't ask more for a place like this."], ["Emma L.", "Oh, Easy Street. I wish I had know about you sooner. When Thurman's and German Village Coffee Shop are busy, it seems like this is always the third choice.Easy Street is a great place for brunch. They offer a ton of different food, much of which is Greek-inspired. Their breakfast offerings are solid (try the BELT!) and their tzatziki is the best around. I order a side of that no matter what I'm eating - even the Cajun Chicken Sandwich. Oh, and their fresh-cut fries are awesome (especially in the tzatziki). Overall, this is bar food done well.The booths are giant and cozy and easily fit 6. Service is good. The decor is fun with lots of fun memorabilia around, which makes the wait for my breakfast a little easier. Prices are pretty standard, leaning toward the cheaper side. Bloody Marys are solid. I have no idea why this place isn't always experiencing a long wait. Maybe they got lucky that they're right next to two hyped spots. Regardless, I'm a happy customer."], ["Chrysee H.", "I will admit that the first time we came here it was Thurman's overflow, which itself was actually Schmidt's overflow. But since then we have returned every time to purposefully come here.I should mention that we have only ever come here during lunch/brunch on weekends and our service has always been just fine. We've never had a huge wait. I think we're usually quoted 20 minutes or so but generally get a table faster than that.Their breakfast menu always looks great, but the only thing I ever end up ordering is the gyro with Greek fries. I'm sure breakfast is good and friends have gotten other things and enjoyed them, but I only want the gyro. And that's because the gyro is just that good. It is gigantic and full of wonderful gyro meat. I've had other gyros in town and usually find them to be mostly lettuce and tomato with some meat. This is excessively meaty and the tzatziki is very good. I tend to drown fries in vinegar, but the Greek fries are very flavorful on their own and don't need anything."], ["LeAndra S.", "Disappointed with new reduced menu and quality of the food. Hopefully they can turn things around. Will not be back any time soon. =("], ["Lily C.", "The brunch is terrific and the greek gyro is great! Plenty of food and decent prices. Also, I really liked the cozy atmosphere of the place. It has a \"local\" bar feel to it, even though it's family friendly.  The service is not the best, but it was not terrible either. Also, the entree items and the specials are not available before 5pm, so if you are coming in earlier, keep in mind that you are limited in options."], ["Jay L.", "Every time I've been here I get awesome service and awesome food. Everything is high quality and affordable. Tonight's special of Creamed Chicken was great."], ["George Y.", "Greek food good, service not so good. That's pretty much how I would sum up Easy Street. I've had the standard Greek fare easy street offers, gyros and saganakis are my go to greek grub and they truly do a great job with those. Side note, I must admit I was bummed to learn that saganakis are only served up for dinner and not lunch. So thumbs up on the food. Service kinds of dampens the enthusiasm that I have for their greek food. There have been a couple instances of the staff showing indifference to providing at least average service to hints of disgust and confusion to requests. One time my friend wasn't keen on their ice tea, so she asked to have another drink. The server (who I think is the owner), took the tea, looked at it, then looked at my friend, and displayed a look of confusion and irritation as he walked away. The atmosphere and food are great, but it just creates a bad vibe when the service makes you feel like your wasting their time."], ["hollie w.", "This place was found on accident! Me and my husband lived in German Village and planned to walk over to Thurman Cafe. Of course, it was packed and there was a huge wait so we decided to try the place next door. At first we thought it was more of a pub, but once we looked at the menu we were pleasantly surprised by the Greek menu. We decided to try the Saganaki (flaming cheese) and both get gyros. The cheese was DELISH and visually really cool too (they pour 151 over it and then set it on fire!) As for the gyros..I've had many from many places, even other authentic places, and NONE can touch how amazing Easy Street's are! The lamb tastes so flavorful and all the veggies were fresh and crisp! From that point on, it was a weekly ritual. Monday's are half-price pizza nights so you can get a delicious Greek pizza for $6! We loved Easy Street so much that the owner George let me have my husbands 26 birthday there, and provided a huge pan of Baklava! ( He clearly knew we were big Easy Street fans!) The sad part is that we moved to New Albany and it's not as easy to get to anymore, but anytime we are in downtown Columbus we pop down to G Vill and go to Easy Street!  We had dinner there last week and it was just as good as it's always been! DEFINITELY GO!!!!!!!!!"], ["Scott R.", "Great food, great fun, and the staff are really friendly, food comes out in a timely manner."], ["Paul G.", "The chili fries were a soggy, greasy mess (they had sat waiting to be picked up for quite awhile obviously) and the chicken wings were of the most amateur, weird tasting variety I have ever encountered.  There was still powdery wing sauce mix stuck to parts of the wing...no es bueno. Better yet, after being sorely disappointed by the grub I was treated to a lovely bout of stomach cramps and the sh!ts for about 4 hours... brilliant!  Do not eat here, maybe grab a few drinks whatever, but stay away from ALL food, these were only appetizers mind you..."], ["Monica W.", "Most of the time, I am a fan.  However the last few times I have been it has just been ok.  If you don't sit at the booth, you DON'T get very good service.  As an example of the last time we went.  There were 3 of us, and we sat at the table by the window.  We ordered 3 waters, and 1 coffee.  The server came back with 2 waters and 2 coffees.  Easy Mistake, no biggie.  We then waited 15 mins for her to come back with the 3rd water and take our order.  When the order came, 1/2 of it was missing and one member in our parties order was wrong.  He ordered the greek omelet and instead got the veggie omelet.  Again, after 20 mins she emerged to check on us and when we told her the order was wrong, she blamed the kitchen and went to go re-order it.  When we told her we didn't  have 1/2 the order, she again blamed the kitchen and Im sure she just forgot.  The rest of our dining experience went pretty much like that.  The food was also just OK.  I don't know that I will go back for brunch anytime soon.  Good luck to those that do!"], ["Le Ron C.", "Easy Street Cafe was the first restaurant I tried when I arrived in Columbus 5 years agp at the suggestion of my friend. The servers and staff were wonderful then which really added a lot to the experience. A lot of the new staff is friendly but I've yet to get the vibe that was there when Jen was behind the bar or Kelly was serving tables. Everyone talks about visiting Easy Street because the line is long at Thurman's which I find amusing as I really enjoy the atmosphere much more at Easy Street.The food itself is a unique blend of quasi-Greek with an American twist. More authentic than Happy Greek and most of the other places I've had in Columbus but with enough twist to make it unique and fun for the masses. Spinach Dip is an absolute joy and has ruined anyone else's dip for me. The Saganaki is tasty and is a lot of fun when they light it on fire! The Greek Veggie (Meat) Pizza is like a Gyro on olive brush pizza crust and is amazing. The Chicken Ceasar Pizza and an interesting idea that combines a salad with a pizza and it works. In closing, I want to take a moment and talk about something near and dear to me. PANCAKES. I'm just going to say this and you can disagree with me but Easy Street has the BEST Sunday Brunch Pancakes in the Village. I love Der German Village Coffee Haus but Easy Street has them beat. The main reason being size of the pancakes, variety of pancakes and consistency from each visit. That's all I've got \"drops the mic\"."], ["Kate H.", "I don't think this place gets nearly enough credit. It is often used as overflow from Thurman's, which I don't entirely understand. The building is great, the food consistently very good, the service can be spotty, but generally well done. The hummus is spectacular as are the gyros. I am also a big fan of their breakfast/brunch options. Parking is not bad, but seating is limited and it can be busy at times."], ["Zack R.", "Sooo, it's Greek food? I guess if you put feta on everything and call it Greek, and Columbus natives don't know any better, then yeah. This place could do so much better. The service was horrible. We had one girl seat us by pointing across the room at the open booth. Then another girl took our drink order, but another person brought them to us 20 minutes later. After another 15 mintues, we still hadn't ordered. Another guy came over and said that our waitress got stuck behind the bar, and he'd take our order.Lousy service, and sub par food. This is the kind of place that I think you go to when Thurman's wait is too long."], ["Katie G.", "I love love love their brunch! Their lunch/dinner menu is also surprisingly tasty as well, but it's their brunch that keeps me coming in the door :)"], ["Scott L.", "This is one of my favorite places in Columbus. Everything on the menu is delicious. I've been coming here for over 10 years. The laid-back, casual atmosphere makes it an easy choice when I want to grab a bite with friends."], ["Nikki K.", "Holy cow was this place amazing!! We honestly weren't sure what to expect, but it was all so delicious! We had the Saganaki (flambéed Greek goat cheese) and Calamari for appetizers, both were wonderful. For entrees I had the lamb Greek gyro, I absolutely loved it! The tzaziki was finger-licking good! My boyfriend had the Philly cheesesteak and loved it. My aunt had the Greek quesadillas and loved them as well. We will be back for sure!"], ["Megan D.", "I stopped in for lunch here awhile back and had a pretty decent time. Service overall was a bit slow for what you'd expect at lunch time but my sammich was pretty darn tasty. I got the rueben which was recommended by a few people and it was stacked with yummy flavors. I wasn't a huge fan of the chips nor was I a fan of paying for french fries. I had a nice slice of baklava for dessert which was, as I would hope at a Greek restaurant, delicious. It was the completely authentic and a great way to top off a slightly decadent lunch. The atmosphere was nice and casual. I liked the fun and quirky decor."], ["Steve Z.", "Nothing short of excellent! Super casual and well done bar faire that always is served with prompt and courteous service. The Cajun chicken gyro is not to be missed and is a favorite of local project teams."], ["Susan R.", "I have to confess that I don't feel like I've had a \"complete\" experience with Easy Street.  It's not a restaurant where I feel at home.  We happened in here one day when the line for Thurman's was too long to bear; it was crowded, but we found a table by the door and wedged ourselves in.  Normally, I am quite anxious about places where you seat yourself; I've had enough terrible experiences at Hounddog's Pizza to know that it's quite easy to be overlooked when it's busy.  I don't remember getting poor service the first time we popped in, though, so it must have been okay.Even though we semi-frequent Easy Street Cafe, we only ever order one thing:  Greek pizza, add gyro meat.  (We also once got the spinach dip along with it, which was really freakin' tasty.)  I love their Greek pizza; rather than a pizza that is heavy with red sauce, their Greek pizza is olive oil on a lean dough, mozzarella, feta, olives, green peppers, the optional gyro meat, topped with tzatziki and baked.  It is truly excellent, so much so that we can never bring ourselves to order something different.The service has always been decent every time that we've gone in.  I've never had cause to complain about the food or the service.  (Of course, we only ever order the one dish....)Oh, and Brad S.?  \"Don't be ridiculous.\" ;-)"], ["Michael U.", "Finally made it to Easy Street.  My go to was always German Village Coffee Shop.  I decided to give this place a chance and am glad I did.  Not crowded....for breakfast.  But a steady amount of people.  More of the line from GVCS and Thurmans should give this place a try.Atmosphere very nice, clean, dark and comforting.  I sat at the bar since it was just me.  I probably won't do that again as the stools seem a little low to be able to comfortably eat, since the lip of the bar makes it difficult to get the plates close enough.  I ordered Scooters Favorite.  Biscuits and Gravy, eggs any style, homefries and choice of bacon or sausage.  The portion was huge and well worth the 7.99.  Everything tasted amazing.  The homefries could have been crispier but that's just my preference.  They were cooked well...just not as crispy as I like.  People were nice, professional and accomidating.  I will absolutely be back and try their lunch and dinner!"], ["Catherine J.", "I  had a great time here last night-- cozy, neighborhood-vibe, hold the dive. I was on the fence between a 3 and 4 star rating (and as I always must say-- not that 3 stars is bad!). I went ahead and gave it the \"Yay! I'm a fan\" status because: (1) the service was extra-friendly and attentive and (2) we could all use a little more monounsaturated fat in our pub eats. The food was pretty good, I just had two appetizers (hummus plate and flaming cheese) and some brews, but the mood was festive and fun, even though the snow continued to fall outside. I see what others have mentioned about the menu being a little strange (Mediterranean-meets-pub fare) and the wacky wall decorations. Still, I'll give extra points for uniqueness. The flaming cheese was pretty good, but the real novelty is in the presentation. Lean back, and watch your tresses.Easy Street Cafe is exactly what it needs to be......which is apparently a neighborhood pub with a wacky Greek uncle."], ["Paul F.", "As others have mentioned, this is a little strange.  It probably should be called George's Greek Palace or something.  The decorations are wild, includiing the Blues Brothers sitting up over the doorway.I stopped here today for dinner.  I started off with the hummus and pita appetizer.  The hummus wasn't bad but it wasn't the best I've had.  For my dinner, I went with one of their specials of the day, meatloaf, mashed potatoes, and  asparagus.  This was pretty good also.All in all, a pretty good meal."], ["Angie G.", "Usually I love it here but my last experience ruined me. I went in and it took 20 minutes between drink refills, the waiter brought our food and it was great but he ignored us, and didn't advise up that instead of an up charge I would get a half order of onion rings and be charged the full price of the appetizer and took nothing off the entree. I asked about and he said chips were free, but I didn't get chips. If I was going to be charged for both, why did I not receive both or get informed of this before the order? He then also took an additional 30 minutes to get our check. And no it was not busy."], ["Corey G.", "Sunday brunch before a shadowbox show. Not bad.  Had the med spinach salad with gyro meat added. Very generous portion.  Service was slow.  Cool location and atmosphere.  Would go again."], ["Sheila C.", "The Greek gyro was a good choice. Very filling. I got the seasoned mayonnaise with it for a kick. The seasoned fries are just ok. Could only smell the seasoning but couldn't really taste the seasoning."], ["Kevin P.", "I love EASY STREET!!!!! Great food. Great staff. Perfect for Sat or Sun brunch too! I have been to both locations and I like them both but my heart is in German Village! I think you will be happy with the price and the food!"]], "Number One Gyro Shoppe": [], "King Gyros Greek Restaurant": [["Meredith M.", "I had heard from coworkers that King Gyros was better than the Mad Greek on East Broad St.  I was also warned that you need to get it to go.So my husband stopped here to pick up our carry out order and then we headed to Wolfe Park for my lunch hour.I was disappointed.  I love banana peppers and there were none on our gyros.  The fries were also very soggy.They failed to put napkins in the bag and gyros tend to get messy.I won't be back, not when Mad Greek does it right everytime."], ["Amy S.", "My dad surprised me tonight by bringing me some wonderfully, yummy, lamb gyro and baklava!  Let me warn you, if you've never eaten here, the food is well made and the portions are huge.  One portion was enough for both my mom and I to share and still be full!  If you've never thought that you would like lamb, do try it here.  The lamb is amazingly flavorful and you'll never want a gyro without lamb again.I was planning on coming back here soon to make sure my boyfriend got to taste the best Greek food in Columbus, but I'm glad my dad thought that I needed it sooner!Yianni, I'll be back soon!!"], ["Jenny B.", "I don't like giving this place three stars, but it was just A-OK.  I was driving by and had heard it was good and needed to eat, so I made a little stop through the drive thru.  I ordered a combo that included a mini chicken gyro, fries and a drink.  The girl speaking at the drive thru was very very nice!!!  She made sure my order was correct and offered me upgrades that I didn't mind hearing about.  When I got to the window she told me that it would be about 3 minutes since they cook the chicken fresh to order.  She also asked if I was on their e-mail list, and I would have happily joined, but I live a good 35 min away.Now to the food.  The fries were wonderful!!!  They were perfectly crisp with the skin on.  But, I was not a fan of the gyro sauce.  It was way too runny for me.  I like gyro sauce that is thick and creamy, but this was not.  There was also a little too much lettuce for my liking.  I know you can just take the lettuce off, but it felt like a filler; I could hardly taste the chicken under it.All in all, I enjoyed the service and the fries, but the gyro sauce just didn't do it for me."], ["P D.", "Very good quality food out of a old Taco Bell building. You'll be hard pressed to find fresher ingredients anywhere and the service is very good. Nothing special about the dining area, just basic fast food type setting. Very large and diverse menu and excellent Greek desserts. It has been in same place for over 20 years I believe."], ["Carlos M.", "When you pull up to this place its a small place which when I was there it was under construction for expansion good note on that. Now the food was simple freakin awesome. WOW!!! The gyros are the thing to have I guess cause it's my fav but u can't go wrong. They even have like a supersized gyro for all you manly man eaters and even a mini for the lady like in all of us. U have to try this place!!!"], ["Kase V.", "Big Chipotle sized gyros.  Very friendly, they want you business.  This place showed up on my Yelp search, I will go again."], ["Bob K.", "I disagree with the other reviews. You call this place heaven, I pity your life.I ordered a Jumbo Gyro. WAY too much sauce, making the pita soggy and overly sloppy. Jumbo apparently means jumbo on the lettuce, because I had to eat about a head of lettuce to get to the meat.Fries were absolutely flavorless. Nothing to be said for them other than they were a calorie delivery mechanism.I'm back to Yannis on Cleveland Ave. I've found nothing better in the Columbus area."], ["Steven H.", "King Gyros, although initially a bit offputting by the run-down appearance and fast food-style, is an excellent (and inexpensive!) eatery. It even has a drive-through (which is a rarity for Greek food)! Try the excellent Gyro salad with signature tzaki sauce, the hummus with warm pita, the huge King Gyros overflowing with lettuce, meat, tomatoes, onions and sauce and the tasty baklava and tiramisu pie sweet treats in the dessert case."], ["Angie G.", "Great lamb. I used yelp since I was visiting Columbus. I am so happy I did.  What a wonderful meal."], ["Dave M.", "Huge menu. While nothing is spectacular, everything is above average. Prices are very reasonable. The fries are the best. I always do the drive thru and service isn't horribly slow but it's no McDonald's either. Get the fries and eat them on the way home."], ["Patrick S.", "this is pretty basic Greek food and it's in what appears to be an old fast food joint but it is really, really good. the best hummus i've had in Columbus. very nice, friendly service too. I wish it was closer to me."]], "Yanni's Greek Grill": [["Nijole T.", "This place belongs to the father of King Gyros from what I  have heard and since I liked the owner but not the food there and father knows best I decided to give this place a try.In a skeezy strip mall on Cleveland Ave tucked away I wasn't sure if I wanted to go in but I'm glad I did.The people working were awesome, and hearing the meat is Lamb and they had tsatziki was enough for me to give it a try.Though ,points off for tsatziki being made with mayo, NOOOOOO...... yogurt, cucumber, garlic thats how you do it....sigh....We got a combo to go since a gyro is $8 to dine in and to go also $8 but with a huge order of fries and a drink, so we sat outside in the sun and enjoyed our food there.The fries super hot and fresh, left in a bit longer which is always better, just no seasoning at all, Greek food has the best seasonings ever why not throw some of that on your fries?I got the greek salad with the housemade dressing, AMAZING! The gyros was huge but again not authentic using a tiny wrap, I think I can give up hope having gyros stuffed in a huge pita pocket like I am used to, nonetheless, so far the best gyros in Columbus, great price, service, portion size, all is good here. It was packed, mostly with regulars, also always a good thing, nothing wrong with giving this place  a try.I have got to try the baklava here, HUGE and so yummy looking but at $5 a piece I just wasn't up for it this time around."], ["Ray B.", "A favorite place to visit. Friendly service and great food. My standard order is hummus as an appetizer and the grilled chicken salad."], ["Mary S.", "To be fair, I've only been there once. Good food (ordered a lemon chicken dish) and decent portion sizes (had enough for lunch the next day), good service. It was a little packed and noisy, though considering its popularity, that is hardly the restaurants fault. Would go back."], ["W. Alan E.", "Boy has this place gone downhill.  My girlfriend and I had lunch at Yanni's today.  It was my first time back since the late 90's, and will probably be the lady time ever.  The salad greens are exactly the same as you would find in a pre-cut bag of salad from any local grocery store. The creamy salad dressing lacks any amount of flavor.  The gyro meat and French fries are woefully under-seasoned.  The service also leaves a lot to be desired.  Lastly, the difference between the house salad and the Greek salad, other than size, was the addition of 1 slice of cucumber, 1 wedge of tomato and a couple of Kalamata olives.  If you want good Greek food, go to Anna's off of sawmill..."], ["Leslie A.", "Get here early for lunch."], ["Abby C.", "I have to say, with all of the hype and feature in Crave Magazine, I had high expectations. I don't mind driving 'far' if the food is worth it. Definitely not worth it. And I went with 4 people and we all got different things. I do have to mention that the person who got the lamb gyro said it was very good lamb meat. The hummus completely grossed me out as did the tzatziki sauce. Hummus was SOOO salty and had way too much garlic, and I love garlic. It didn't taste of chickpeas whatsoever, I'm actually afraid they may put mayonnaise in it (I have no idea if that is true, just judging by taste and consistency). Tzatziki was definitely not made with Greek yogurt. I always thought it was supposed to be? Some type of ranch or mayo situation, either way, gross. Again, that's just MY opinion. I'm pretty open to all different foods and try to keep an open mind always. I just don't think anything was very good."], ["Jill Y.", "Rating Yanni's against Greek restaurants--5 stars.  The best around.   I'm always just mildly disappointed when I stop at a different Greek place.  My go-to dish is gyro salad.  Lemon soup is also good.  Staff are great."], ["Naiying C.", "Good portions, good food and feels like a hole in the wall place. If you are in this area give it a visit."], ["Alecia W.", "Outstanding!!! A \"must try\", reasonable prices for great food, never had a bad thing, too bad they're closed on Sundays."], ["Deb R.", "it was okay.  i had the lemon chicken soup and the stuffed grape leaves.   they were decent.   is a good place for a quick lunch if you happen to work nearby but it is not worth making a special trip to eat there."], ["Nick C.", "I was raised by my grandmother, who moved here from Greece. I was raised on Greek cuisine and Yanni's is the closet to her cooking as I have experienced in Columbus. Large portions for the $$$ only make it better!"], ["Steven N.", "My favorite place for Greek in Columbus. Friendly staff, great prices and amazing food. What an amazing combo!"], ["Eli S.", "The best gyros I've ever had so far. Cheap prices, hilarious staff, fast service. You can't beat this place. I've been to other places who just seem down and depressed to be alive. Not this place. I kinda want to work here. It's a place that makes you feel at home even on your first visit. A must. Would like to see an update to the dining room. The floor seems a bit grungy. Bonus: You can connect to the free wifi they have at the next door bar."], ["Mallory S.", "This place is amazing! Oddly enough one of the best Reubens I've had and the French fries are perfect! Great service, everyone is so friendly!"], ["Sheena A.", "Wish there was a minus star I have NEVER in my 31 years of life been so mistreated by owner or whatever the old man is here. My boyfriend ordered dinner here when he got home the steak was completely over cooked and disgusting. I call as soon as he got home and they were closed. I call as soon as I got off work I work in Polaris and live out east. They remembered my boyfriend and kept saying he ordered something different. She said I could get it replaced in 15 min so I go there as soon as I got there this old man is yelling across the restaurant he ordered med well THEN ASKED WHY I WAITED. Did I mention they were closed when  I called??  Whatever he ordered what I got was past well done.  At this point I'm annoyed so I leave the food. Never will I be treated as if I was a theif. It was uncalled for I will never patronize this location PERIOD."], ["Anna H.", "I found Yanni's as a last minute carryout lunch option and they had good reviews.  I was disappointed.  Strike one, they don't have falafel on the menu.  Strike two, they put American Cheese on my veggie pita.  Yuck, gross.  Strike three, their tzatiziki sauce was a tad salty.  The fries were good."], ["Bryant M.", "I hate Westerville. And strip malls. And strip clubs. And Cleveland Ave.But I LOVE Yanni's.For real, this is the best Greek food in Columbus. Don't be deterred by its hole-in-the-wallness because Yanni's is the real deal. The service is great, the food comes out pretty switfly, and everything tastes fresh and amazing! Do yourself a favor and try the saganaki and a gyro.Oh, and it's insanely cheap.So, do it. Go to that dreaded Westerville and fall in love with Yanni's."], ["Karen P.", "I love, love, love Yanni's.  The food is fresh, fast, and delicious.  It's also nice as those that are a little timid to try outside the everyday \"American\" cuisine, they offer some standards like hamburgers and whatnot.   The hummus is great, the gyro is awesome...   I mean come on, you get the tastiest gryo I've had in the states (I've been to both the Greek Town in Chicago and Detroit) and this one beats them all.   Better yet is that the prices are super cheap and there is tons of food.  One comment I have to make about a prior reviewer, Falalfel is not Greek, but Middle Eastern (originated in Egypt)..  You should really only see it on the menu of somewhere claiming Middle Eastern or Mediterranean (and not all as this term is pretty vague when categorizing).  Yanni's boasts being Greek, they just accommodate American palates as well for the less adventurous or more picky."], ["Jack S.", "simply great food in a small restaurant with personalized service. The lemon chicken is perfect and you must try the homemade desserts and pastries. Exceptionally friendly and, at least for me, a must-stop every time I travel to Columbus."], ["Keiana S.", "I get the gyros at least once a month. I don't even live close by. It's THAT good. And must must must get a cup of chicken lemon soup. If u are dining in, which I would recommend for ur first visit, try the calamari, stuffed grape leaves,and dessert"]], "Firdous Express": []}