{"Tandoori Grill": [], "Mughal Darbar": [["Mun K.", "Being from California, it's hard to be impressed by any Indian Restaurants... let alone the weather etc. anyhow, I tried out their lunch buffet, and I was not impressed with the Butter Chicken dish it seemed to have excess oil coming apart from the dish itself, my bf seemed to enjoy it. I enjoyed the lentils very much out of everything, tandoori chicken was a bit dry, and everything else seemed kind of unhealthy. Server was kind of slow since we waited nearly 10 min to leave since we were waiting for him to take our credit card, that seemed like forever. But overall the bathroom seemed well sanitzed downstairs, and all in all it was okay, but not the best. I am a previous Indian Restaurant owner, and I can tell if the food is fresh."], ["Ashley A.", "Food and space was freezing. Naan seemed off today and usually we get a special plate of fresh garlic naan on the table, but today we just had the cold buffet food. Disappointed."], ["Evelyn V.", "Another amazing & delicious meal. Shrimp handi & veg platter, which includes naan & dessert. The lentil dal was luscious & creamy. The paneer was texturally right on. Service is serious. Total pro cocktails, table service & food arrives/departs on cue. Smooth & friendly. It's a family place. Open, smart & genuine."], ["Don L.", "The food is excellent!!!! I had the samosa, tikki masala, and garlic naan. It was so delicious! I'm already planning my next trip with my friend!"], ["Sharmeela S.", "Cute retro ambience.  Street parking.  Nice patio and bar.  The food is delicious.  They have a variety of kebabs and a large selection of non vegetarian dishes in addition to the above average assortment of vegetarian items at indian restaurants.  I loved the lamb shahi korma.  The flavor was excellent and though i ate about half it at the restaurant, i immediately devoured my leftovers when i got home."], ["Maria M.", "Great customer service and delicious food. Especially my favorite biryani. I've been here several times and I love their food. Friendly and cosy environment."], ["Steve K.", "Tip to the ambitious maitre'd of Mughal Darbar: If you run the restaurant and both people from the table of two send the food back as inedible - you DO NOT CHARGE THEM FOR IT.   This is an absolutely reprehensible oversight that I didn't discover until my date explained - after we had left - that no adjustment was made to the bill she paid - despite our having received two completely inedible, lukewarm main courses that tasted of refrigerator and despair.  The staff is well-meaning, but not well-meaning enough to back up their sentiments with action or consistent competence and in the end - are essentially undisciplined and clueless.  One fun and true anecdote is that the entire staff - except the incompetent cook - stood for over 10 minutes, not paying any attention to their customers while - get this, folks - the expensive cars attending the Columbus car show went by in a procession on High Street.  \"There goes a Studebaker, there goes a Jaguar, ooh, there's a Lamborghini\"   Apparently during this spectacle, the cook put out the $17 shrimp dish on the counter - when it should have gone straight to the dumpster."], ["Jaynie M.", "Maybe we ordered all the wrong things but we were not happy with the food. We got the veggie platter. Kinda bland and boring. And it was really an appetizer for 1. Think finger food. Then we got mango ice cream for the dessert that I'm pretty sure was a Mango lassi frozen in a cup with freezer burn. Basically, I miss Taj. Trek to Aab for better Indian food."], ["Staci F.", "Excellent Indian food!  We were very impressed by the great service.  The decor and music were enjoyable as well!  I had the Kadhai Paneer and my mom and fiancé had the Tikka Masala.  We were all very happy with our meals.  Try the garlic Naan, because you will not be disappointed!!  This is now my favorite Indian restaurant in Columbus. :)"], ["Sam K.", "f you like Indian food, one of out favorite restaurants in Columbus is Mughal Darbar on High st.. We have good Indian food here in NY and we still make it a point to have dinner there whenever we're in town. Delicious food, great service, family owned and operated. They've also got a funky little bar there too.yelp.com/biz/mughal-darb…...We've enjoyed the Murgh Saag Wala, Lamb Dhaba Style, Darbar-e Chhole Masala as well as a few other dishes and we truly enjoyed them all."], ["Gautham K.", "Lunch buffet : they have quite a number of dishes. Few chicken dishes. Sweets are just eatable. Chat was OK. On the whole, the food has no Indian masala. It was more americanized. For desis, not a place I would recommend."], ["Sudharshan M.", "Well Not exactly Indian, and definitely not spicy food. Even the extra spicy tastes bland. But has a good variety for vegetarians and tastes good. The lunch buffet is not worth the price. The location is the only thing that saves this restaurant.  Do try the Sabz Handi and Aloo Tikki Chole."], ["Spencer M.", "Phenomenal! Vindaloo was perfectly spiced, blueberry and basil mojito was perfect and the wait staff was attentive; will be returning!"], ["Rich R.", "Best Kadhai Chicken in city. Good service. I am a foodie and very choosy with India food. These folks had the best Indian food in Columbus, so far (in last 7 weeks that I have been traveling). I am going here regularly."], ["Ashley F.", "This place is delicious and FRESH.  The owners are passionate about the food and it's made with love. We come here all the time! Where else can you get TASTY healthy vegetarian curry on Campus, Old North, or Clintonville?"], ["Coco C.", "I always love Indian food, and this restaurant made me love it more and more.Marsala chicken was super delicious; it was legendary!!! Love Indian spice: spicy and salty!Also a dessert I did not know the name made of milk and rice was awesome, sweet and smooth! Also the service was perfect, I enjoy the time spent here."], ["Fancy K.", "This place is under new ownership so if you weren't happy before, try it again. The new decor is very nice and much homier feeling. Our food was delicious and I saw a few thing on the menu that i can't wait to try so I have to go back - I haven't seen them anywhere else. As a sweet touch, an adorable child offered to seat us when we arrived. The child seemed to be having a grand time it was really cute and sweet touch to a family owned place. All the servers were really nice and had a good sense of humor. Also did you know they have parking in the back? We usually walk but drove in the sub zero weather and were pleasantly surprised!"], ["Aseem P.", "This place's food is phenomenal. Being from India, I always yearned for good authentic delicious Indian food over here and very seldom I could say that Indian restaurants' preparations are close to what I used to have in India. This place go miles ahead in this especially for non-veg lovers. I tried mutton bhuna and it was so close to any punjabi/mughal non-veg restaurant's prep I would have had in India. The ambiance is pretty good too but I would recommend any non-veg lover to go just for food here. That doesn't mean veg food is bad here. Just that I didn't get a chance to try that.. :P Definitely worth a try once to make your own opinion.."], ["Bill T.", "This place is AWESOME! Be sure to make it there by 2:00pm for the lunch buffet. A family owned Indian restaurant with a courteous and friendly staff. I make it a point to go there each time I am in Columbus."], ["Shellie H.", "I love this place.  I know, I know- \"love\" is a strong word but I do.  I often dine with an awesome bonafide carnivore (I am a vegetarian) and we both always end up with a dish we love.  I particularly enjoy the Vegetable Pakora, the Darbar Paneer Pasanda (my fave), the Paneer Saagwala, the coconut filled naan, and the Blue Lotus and Rose Gaarten cocktails.  In fact, the cocktails are overall incredibly inventive and are among the best in Columbus.  This is a great place to take a date, to watch the world pass by on their patio or near a window on your own, to celebrate, or simply to catch up with friends.  And don't get me started on the service- it is fantastic.  Ash always makes visitors feel like her personal guests and never disappoints as a hostess.  If this is your first time, I recommend skipping the buffet and ordering from the menu.  There are too many amazing dishes you will not want to miss.  Not sure what you want?  No worries- just ask Ash for a suggestion.  You are always in good hands here."]], "Cumin Indian Restaurant": [["Syed A.", "So apparently the manager refused to serve my friend's family until I take my review off from here. What a SHAME"], ["Kendra S.", "My family and I have been going to Cumin since it opened.  I've been reading the reviews and am really shocked to hear anything bad.  The owner, Vince, has always been fantastic to us.  He knows us all by name, knows what we all do, and always makes time to come over to our table say hello and make sure everything is ok.  The food is by far the best Indian food I have had (second to actually eating IN India) in Columbus or any other city I've lived in (DC, Cleveland, Akron, and Milwaukee).  My father is Indian so I tend to be very picky about my Indian food. The buffet is the best bet and what we always go for, but tonight my father and I went in for dinner.  We had the Goat Curry, Shrimp Curry, Pakoras, and Mango Lassi.  Every dish was wonderful and unique in its own way.  It had the perfect amount of spice...I tend to like spicy so I was really pleased with the plate of chilis they gave.  The naan was fresh and warm and the service was also fantastic.  They were all so attentive and friendly.  I just posted some pictures for proof of how wonderful it is!  Nothing will top actually being in India and having the food, but this is as close as it gets.  When we go to the buffet, I am never disappointed, although I tend to stick with the same go to's: Chicken Tikka Masala, Rice, Mixed Grill, Raita, Chutneys, the Bhel Puri station (my favorite and the first thing I go to), Gulab Jamin and Rice Pudding.  I love this place and have no shame going at least once a week! Highly recommend for anyone looking for a fantastic Indian restaurant!  Go for the buffet first, so you can sample it all!"], ["Joshua L.", "Before it was cumin, it was Bayleaf. My wife and friends used to go here a lot, and on a return visit from school, they brought me. It was delicious. After it changed names, we were skeptical. However r, we went there a few weeks ago when our first choice fell through.It was great! It was still far more flavourful and less diluted than other Indian restaurants, and there were a few atypical buffet offerings. I Was highly impressed and not just because I had low expectations. We'll definitely be back!"], ["Madhulika S.", "My first week in Columbus and I discovered this place. I have been here twice.This is the first authentic Indian restaurant which serves buffet dinner. The food was simply splendid and the chaat counter was a cherry on the top. The best prt was the gajar halwa that I had. This place got me indulged in my food. Five star for this place and its staff..specially restaurant manager Meenu ..good job guys :)"], ["Kyle P.", "This place is outstanding. Outstanding service, outstanding food. If you haven't given it a try you're really missing out. If you don't know what to order, ask for a recommendation. They'll be more than happy to match you with a perfect dish."], ["Makiah D.", "I love indian though I can't claim to be an expert, as my experience is limited to the greater columbus area. That being said cumin has the best indian food and service in this area. Their chicken tikka masala is creamy with the perfect amount of spice I need. The naan is great. I often order takeout and come for the buffet on Saturday. They are always nice and my food is always great the quality is consistent. So if   Your in the polaris areas and like indian cumin is a must try!"], ["Jay S.", "Pretty legit.  Staff is accommodating.  Food is always tasty.  Spice level is appropriate.  When I ask them to make it burn, they oblige."], ["Nathan K.", "I've been to a lot of Indian cuisine lunch buffets in the area, and this one has impressed me the most. The service is amazing here too. It's not a hidden secret that Indian food can be spicy. Nothing infuriates me more when my mouth is on fire and no one can be found for a water refill. That's not the case here. The water and naan are ever-flowing!Vince,The only thing I'd love to see at your restaurant is Aloo Saag. I haven't found it on any menu in the Columbus area, and it's my absolute favorite! Other than that, I think you're running a great restaurant!"], ["Bharat B.", "Good food and very good service.I go their often and like their food.The owner, the manager and the wait staff- all know what we like. How spicy we like.They greet us with a smile and say thank you when we get out. Service is courteous and with a smile.I love to go their again."], ["Raleigh P.", "Went for lunch and dinner. Great service and positive interactions with all staff members. Lunch buffet had a wide variety of options from appetizers to desserts). Dinner menu (also lunch menu) very thorough. For anyone who may not know where to start with Indian food, Cumin is a great introduction to the cuisine!"], ["Cassandra S.", "The food and the service were both outstanding! Vince, our server, was quick, efficient and congenial.We had Bhel Poori for an appetizer. Asked for it to be spicy. It came out within a minute. The spice level was just right and the flavor was incredible.I got Rogan Josh (with lamb and spicy) and my boyfriend had the Cumin Melthi Gosht Harydl. Both dishes came out quickly and tasted wonderful. Of course, we also had garlic naan. Very pleased.This was our third visit to Cumin and we will definitely return."], ["Steve N.", "This was a unanimously good experience.  I travel a lot, and this is the first Indian restaurant that I have tried in Columbus.  But comparing it to Indian food around the country, this is hands down my favorite!  Decor is nice, good options, and they were set up for several large parties the night I ate there.  Service was very good, personal, and helpful suggestions.  There is a good selection of vegetarian dishes, as well as a broad scope of meat dishes. We ordered lamb biryani (asked for it hot), chicken korma and chicken tikka marsala.  All were very tasty, well seasoned, wonderful sauces. The lamb was a little dry, but the dish was good and we would order it again. The prices were surprisingly reasonable for the quality of the food, the excellence of the service and the decor. I will look forward to future visits to Columbus and the opportunity to visit Cumin again."], ["Courtney W.", "Delicious, good variety on the buffet at lunch. Loved the chicken tikka masala and the chicken biryani. It wasn't very busy, but the service was good and they kept the naan coming. Maybe a little more expensive than we'd usually prefer for a buffet, but we were both stuffed when we left so I think we got our money's worth :)"], ["Sriram T.", "We stopped by for dinner on Labor Day. We were seated quickly and were asked for out beverage orders that were delivered to the table quickly. After ordering our food, we were served complimentary papad and chutneys for dipping - the chutneys were okay. We had the vegetable manchurian for the appetizer - while the spice levels and favors met expectations the texture could have been crispier. The main course consisted of the bread basket, paneer dilruba, bhindi (okra) masala and basmati rice all of which were excellent. We skipped dessert. The wait staff was attentive to our needs and it was overall an above average experience."], ["Nicole Z.", "They're a solid Indian restaurant. If I don't feel like cooking or leaving the house to get food, Cumin is my go-to place on GrubHub.Their naan is amazing. I recommend their lamb tikka masala. It's really, really yummy.  So much food and the leftovers are always just as yummy the next day."], ["Van S.", "If you value the decor of a restaurant and service, then this is the right spot for you.  I enjoy those parts of dining, but weigh my rating more heavily towards the food.  The lunch buffet was pretty solid.  Only disappointment for me was that the protein options were limited to chicken.  I would have liked goat or lamb on the buffet line to mix it up a little.  Highlights of the meal were the tandoori chicken, chicken biryani, and to my shock the dessert.  I'm not a dessert person, but had a craving for something sweet.  I had tried what reminded me of Vietnamese che because of the sweet coconut milk base and some type of tapioca like noodle threads throughout; very light and refreshing for a dessert."], ["Bethany K.", "Since my last review, I have dined twice at Cumin...  Both times buffet ~ one during the week, and one Sunday...  And so far, they have redeemed themselves.  After my first review the owner reached out to me to make amends...  which was appreciated, but I wanted to keep everything authentic for my review.I look forward to going back for dinner."], ["Emily L.", "I have been to Cumin twice for their lunch buffet and both times I have walked away happy and stuffed. The lunch buffet was around $10 and was a great deal. They have a little bit of everything, including soups, salad, vegetarian and non-vegetarian options, desserts, and chai tea. I love the aatish khumb, which is a mix of vegetables (mushrooms, onions, tomatoes) with a spice mix (their website says it's pickled spices). It's something I have never had at other Indian restaurants and it's been my favorite choice both times I've come. You also can't go wrong with the saag paneer or the chicken tikka masala either. Both of those are pretty standard for Indian restaurants, but I really enjoyed the flavor here. One of the best things with the lunch buffet is that they bring you baskets of naan to go with your meal as well. I pretty much ate my weight in naan, which is not the worst thing. The service both times has been good and the place is very clean. Also, pro-tip: right now, if you check in on the Yelp app, they have a 15% off coupon. I work right around the corner for Cumin now, so I have a feeling this will become a regular lunch time spot."], ["Adam R.", "One of the best Indian Lunch buffets I have found in the Columbus area! Well priced, wonderful tastes, and great variety of both meat and veggie options. The Saag Paneer, the Cumin Palak Bhutta, and the Peshwai Cholley are a few of my favorites. The nan bread is very good. The dining space is very comfortable as well, good for work lunches (which I've done numerous times), but I could also see bringing my 2 kids here (just haven't had the chance yet)."], ["Neil F.", "I usually like to go into detail about my experience, but Hakka Manchurian WOW!!!!!!  Everything else was great."], ["Myrriah S.", "Cumin had a variety of Indian dishes to choose from,. The service was good and the prices reasonable. My husband is from India and he did not particularly find the food authentic but decent nonetheless. I don't think we will be returning to this restaurant but this shouldn't discourage you from trying it out for yourself."], ["Deep M.", "Not happy with the Naans, they don't seem fresh. Otherwise the food is nice. Good for people who like mild spicy."], ["Tash L.", "If I could give them a 3.5, I would. We went on a Wednesday night - chaat and Indo-Chinese buffet (admittedly, one of my favorite cuisines so I'm a bit picky here!). The chaat station was fantastic, especially the potato chaat and pani poori. The Indo-Chinese or Hakka dishes were so-so. I will return but probably just for the Indian buffet/food."], ["K S.", "Our server was great, nice and polite.However the manager was extremely rude! So anyway instead of the server, the manager came upto us and asked us what we wanted to drink. My sister ordered a Moscato (which we never got). Right after he was like are you ready to order. I asked him to give us five minutes. He came back in less than 5 and asked us if we were ready to order, so we ordered appetizers and he goes 'what about entrees'  I felt like we were pressured to place our order. The food came really fast but honestly, I have had way better indian food. Don't go to this place, if you want shitty customer service and okay food."], ["Samara R.", "I'm obsessive about Indian food and absolutely loved everything about our dining experience. The staff was very friendly and the food was excellent. Fresh naan was brought to the table as needed so none of the dried out and hard to eat naan. My favorite thing is that there was minimal cream added to food in buffet. There was a mixed selection of food for meat eaters to vegetarians so there is a little something for everyone.We came here based on yelp reviews and were not disappointed one bit. We might even have to make the 3 hr trip back for good Indian food or maybe just stop off during our next road trip."], ["Tayler S.", "My mother and I both have celiac disease and have to be cautious about where we eat and what is in the food.Our waiter at cumin was very educated on the menu and new which dishes had allergens and which didn't, and it was an overall amazing experience and meal."], ["PinkJmmmm M.", "I was there for Wednesday night Chatt buffet.I think the food was very different and interesting.The indo-Chinese food was so so, not very impressed.The ambiance is good, service was nice too.So i will definitely come back and try the Indian buffet."], ["Moses S.", "I came here today for the lunch buffet. The ambiance was more upscale than I was anticipating. The buffet was your usual fare of white rice, chicken tiki masala, tandoori chicken, palak paneer, and a couple veggie based dishes and this one dish that I was pleasantly surprised with because it was fairly spicy.  The nan is brought out to you so don't freak out when you don't see it on the buffet line.Seeing how it was like a high of 12 today, there weren't that many customers, but the service was excellent.  The food was also good, but not great. Nothing that really wow-ed me but also nothing that really was disappointing either. 3 stars."], ["T P.", "Excellent food - with an upscale feeling. BEST Indian buffet in all of Columbus."], ["Thiagarajan S.", "This is my second time visiting the restaurant and again a very bad service and completely worst tasteless food being served.  It's not only my opinion, but also a collective thought of 4 of my friends. As everybody posted here, the reply and the tone of the manager is very rude. The food was served by the Chef, look so delicious with sizzling sound of the starters straight from the stove in a skillet. As soon as everyone started to taste the food, there was something missing - THE TASTE. I can see food cooked but no taste, no spices, no salt, simply nothing but food, they call it.  We ordered varieties of items from Biryani to Naan and several gravies and yet not even one item was average. Being an Indian, I confidently say that it's too bad to qualify for an Indian food or any other ethnic food for that matter. While the look and feel of the restaurant is on par with the American restaurants, but the main purpose, which is the food, is pathetic, I must say. The cooked unhealthy oil, which I believe supposed to be thrown away, was poured very generously over the gravy, made the food completely unhealthy and everyone's tummy was inflated if not satiated. I'm not an opinionated person and do not have anything personal with this restaurant, but in order to ensure that a restaurant is keeping its standard well by not compromising in health and taste, I'm taking this time to post this review. I'd be more than happy if their money making attitude also considers their customer's health. Thanks!"], ["Sharmeela S.", "Went to cumin today for the first time for the lunch buffet. It was for a friends baby shower so im not sure if the items served are normally part of the buffet.  My favorite dishes were actually the appetizers including the pani puri and samosa chat.  I also enjoyed the chicken tikka masala, saag paneer and naan.  Will pass on the chicken biryani next time.  Overall an above average Indian buffet."], ["Social Worker C.", "The food is wonderful. The lamb tikka masala is seasons with herbs and parsley and it's beyond delicious. The sizzling chicken tikka is served with vegetables. Must try this place out for delightful meal."], ["Kitty K.", "This is a REALLY GOOD place. I've always had attentive service, and very good consistent food. I haven't had to chance to try to buffet yet, but one day...Dishes I can recommend:samosa- warm, soft, flaky, addictiveveggie hakka manchurian - like sweet and sour spicy non meatballs- tasty!keema naan- awesome! I dream of this stuff, it's life changing. this is a must have.chicken tikka masala- beautiful smooth and slightly sweetshrimp rogan josh- yummy, i got it spicy and it was delishchicken korma sahi masaledar- the almond sauce is so smooth and rich. amazinglamb vindaloo konkan- nice and meaty and spicy, so goodghulab jamun- these were not what i expected, great flavor, surprisingbadami kheer- rice pudding, i love rice pudding and this had so much sweet flavor. very cool and refreshing after a spicy curryand they always ask how spicy you want it, so it's all very accommodating.Most of the decor is originally from India, and it's beautiful. I crave going to Cumin."], ["Be K.", "PROS:  I did carry out but the service was excellent, welcoming and with a smile. The restaurant itself looks very nice. I would bring family here when visiting if I return. Food was ready on time and very hot even when I got it home. I like how everything was packed and the containers they use. The vegetable Samosas were very good and cooked all the way through which I appreciate. The rice was good and the sauce to Chicken Massala also very good.CONS:They give you plenty of chicken if that is your thing. Picked through my food because chicken was not all the way cooked. Also not all white meat. I do not like dark meat. I usually ask but I forgot. I also did not care for the Garlic Naan. although fresh garlic they were too big and to much so it took away from the Naan for me. I asked for medium but there was no spice so I may need to go ahead and ask for hot. I like it hot but still be able to taste my food. I think I would give it another try because it could just have been an off day and I really like the service and closeness to my home."], ["FNU N.", "I read good reviews about it and went for dinner with my wife. Things that led to 1 star review -1. the tea was cold. On pointing that they just microwaved it for a min and served the same tea. In the end the lady (I believe the owner) argued that tea was fresh though it was prepared at 5:00 PM (and we were having dinner at 8:30 PM). At a fine dining place you do not prepare tea and store in flask but prepare on request.2. The Veg Manchurian - the gravy was decent but it failed to penetrate the veg Manchurian balls. 3. The Dum Aloo - It was Idaho potato stuffed with a lot of stuffing and it has sweetish gravy. The person who prepared it had put in a lot of effort and could given the dish any name he wanted and it would have been good. But when you put it as Dum Aloo in the menu, the expectation of customer is that they will eat spicy Dum Aloo.4. The Goat Curry - It had Chicken in it and the lady said since all the meats is placed together, it may have fallen in. I am sorry but you have to be careful what you prepare and serve cause that is your business 101.She gave me 10% discount for the tea and goat curry mix up. What she failed to understand that for $50 dinner for 2 is not inexpensive and we go there to have a good food and not for 10% discount. If I can pay $45, I can pay $50 as well.Anyways, I always give any restaurant 2 chances to impress me with their food. Everyone can have a bad day and it will not be right to judge anyone on their bad day. So Cumins, please be more professional and careful next time. I will not be impressed if your restaurant has been there for 10 or 20 years but I will be impressed by your food and your service. Thanks,Nikhil"], ["Matt W.", "After being taken over by a friend, we really enjoyed the goat curry and mahi-mahi fish curry (I'm not a fish fan at all, but I stole a second helping from my wife's plate!), but I found the service a bit hit or miss and the food took a LONG time to come out.The mint paratha pairs really well with the milder curries, and their garlic naan was a great compliment to the chicken vindaloo. I haven't tried the chaat bar and buffet, but I have heard a lot of good things and intend to go back."], ["Paula M.", "We have been coming several times to this restaurant. In fact, it is our go to restaurant when it comes to Indian Food. We enjoyed the Naan bread, Chicken Tikka Masala, Saag Paneer, and another beef curry entree (I forgot what it's called). We ordered another rice like we usually do, and this time the server said it's extra, but we told him ok anyway because we still have curries but no rice left. My friend looked at me and said since when they start charging people for rice now? Why are they so inconsistent?! Long story short, got the bill and the rice was additional $4. RIDICULOUS!"], ["Lisa E.", "The lunch buffet was the best I've had at an Indian restaurant in Columbus so far. My favorite dish was the goat curry and I was pleasantly surprised that they also had samosa chaat and carrot halwa which I usually don't find on a lunch buffet. It was a little pricey (about $13), but worth it."], ["Alex U.", "Great food and the garlic naan is delicious! I had the malai kofta.  I would definitely recommend it, some of the best I've had. Also had some kind of kabob with cheese and veggies. It was very good, tasted like it was fresh off a grill. Service and environment was great too!"], ["Gerry J.", "Not an expert in Indian cuisine, meaning I always try the same usual stuff. The default are: chicken tikka masala, sag paneer, and garlic naan. I had those at Cumin, and all tasted really good. So overall, enjoyed it, great experience."]], "Khyber Market and Restaurant": [["Savannah C.", "I eat here all the time. Being a neighbor to the store I don't mind the neighborhood even though it come across as \"ghetto\". I get the New York style spicy chicken gyro with lemon. me being a regular and picky costumer, I get it made kinda different then what they usually serve. Prices are great and you get what you pay for. Great job Khyber! Keep up the good work!So pros- great tasting food and great serviceAnd cons- location Either way I still give them a 5 star rating because you can still come from nothing and make whatever you have into something :)"], ["Emmanual S.", "All  items are very good. Briyani and kebab are excellentMy special is goat Briyani and seek kabab They have tandoori item too ... Price are very reasonable This place is very near to holly wood casino , you can give a try.There is no paya :)"], ["Samar K.", "The food is really really good...better than the other competitors' (*cough* Tandoori Grill *cough) & the prices are much better as well, but sadly the location is really bad. I had to deduct a star for that. I have dined in and would not recommend it to anyone. The bathrooms are just horrible too and I had just gone in to wash my hands!Good thing is the food is worth the drive. Love their kebabs & New York style gyro!"], ["Debi H.", "OMG, I freaking love this food. The beef biryani is outstanding. One of the best things I have ever eaten. The beef kabobs are flavorful with just the right amount of spice and heat. The cilantro sauce is super delicious. I eat it even though it gives me the worst heartburn. It's worth the pain. We have never eaten in because the place looks like a dump. That being said.. Do not let the semi-scary, neglected, sad storefront deter you. This is some amazing food!"], ["Felix F.", "The taste of the food definitely makes up for its lack of curb appeal. Just go up to the counter and try the mix gyro with rice."], ["Jeff H.", "I like to carry out from the Khyber Market because the food is delicious! Best Biryani and Kababs in Columbus!  Atmosphere in the cafe needs work, but the food is well worth it."], ["Josie M.", "Generous biriyani rice. Wish they added a little more meat in it. $9, then, seems a little pricy for 3 small pieces of goat meat (took one star out from this reason). However, delicious! This is my 2nd time and it's still good."], ["Fahad M.", "This place has the best North Indian/Pakistani food in Columbus.  I got Goat korma, Goat biryani and Reshmi kabab. Everything was flavorful and spicy. Had a great meal and cannot wait to get back and try some more items on the menu"], ["ShelbyLynn C.", "Great food! Just needs to clean up. The place itself is in pretty bad shape, if your someone who isn't bothered by that try it out!"], ["Andrew B.", "Food here is excellent! This is a family friendly place. Lots of kids running around all the time. Great value for money. Do not be put off by the exterior or the spartan interior!!"], ["Johaun C.", "I've been meaning to check Khyber out for a looooong time now, but it's so friggin gosh darn out of the way (tho, to be fair, much of Columbus's cheap, good ethnic food seems to be around these parts).  finally resolved myself to get some carryout with my wife and a friend.  as previously mentioned, try not to be deterred by the environment--i went in knowing this was a relative hole-in-the-wall, but shoot, aren't all the best ethnic spots?  the food is good, but unfortunately, nothing really to justify the trip unless you happen to be in the area (ahem, gambling addicts):- the beef nihari, while the flavor of the sauce is amazeballs, had about a half inch of oil on top.  admittedly, this was my first time having nehari, so i'm open to the idea of having some good spicy oil on top, but the sheer amount of it was pretty disconcerting.  skimming most of it off went a long way, and although the prices are really affordable at about $8 a dish, FYI, ours came with only two decent sized chunks of beef.- the goat biryani was probably the best dish that we had.  i love goat, and Khyber's is flavorful and tender--i just wish there was more of it!  that being said,  i may or may not be spoiled by the biryani my father-in-law makes.  solid, but again, nothing exceptional.- the NY style gyro dish (mix of chicken and lamb), if you've had anything like the chicken and rice found all over the east coast, is pretty disappointing.  mainly, my biggest grip is that Khyber's interpretation of white sauce is \"ranch\" sauce--this may totally be a result of appealing to local tastes, cuz let's face it, midwesterners are all about ranch.  i was hoping for something a bit more true to the halal chicken and rice carts fare.all in all, a solid alternative ethnic spot that i will revisit the next time i relapse into my degenerative gambling habit."], ["Van S.", "Went out of my way to the west side after reading a review on alt.eats.columbus.  Pulling up I was a bit taken back by the neighboring market/liquor store, but I'm glad I gave it a chance.  I put in a carry-out order for goat karahi, 3 naans, chicken gyro, and chapli patties to take home and eat with the family.  I enjoyed everything: the karahi was very tasty with well prepared goat, the chapli patties were very flavorful, the naan was nice, and their spin on a gyro was different in a good way as deconstructed with basmati rice. The food was spicier than expected which was great for me, but my wife and kids had trouble with the heat.  I expected the karahi to be a little spicy, but it was actually the chapli and gyro that were the spiciest.  The employee who took the order was extremely friendly and helpful.  The only knocks I have on the place is the time it took to prepare the food (but I'm willing to wait if it means a better meal) and the location.  The employee did mention they would be offering delivery very soon.  If you're by the casino I'd highly recommend you to stop by and check this place out, but unless you want a 20-25min wait call your order ahead of time or dine-in."], ["Birdy N.", "Awesome food, in a filthy and putrid shop.THE FOODThis gets a 5 ... among the best I've had anywhere in the world. Ask for what is good that day. I tried the Nihari, Daal, Goat Korma and Naan .... outstanding ... all of them. Even better than Tandoori Grill, if that is possible.THE SERVICEPretty good. They are pretty eager to help and serve.THE ATMOSPHEREI usually am not phased by appearances at all, but this is something else. The decor and furnishings are less than humble, but that is fine with me. The first issue I had was with the bathroom, it was beyond disgusting and had an odour that will turn your stomach. But the final straw was the stench of sewage that began to waft into the dining room as we were finishing up our meal.Bottom line ... I will never eat here ... but I will order takeout, unfortunately that is not very practical for me so it will be less often. Tandoori Grill will continue to get more of my business for this genre, though the food here is much better."], ["Courtney B.", "Very tasty! My boyfriend and I tried this place tonight. Not much to look at but great taste and great prices!"], ["R K.", "Best Pakistani/Peshawari food in Columbus.  Best biryani too. Hands down (and I'm Pakistani btw). The restaurant decor is lacking, but it caters to local Pakistanis and Arabs who order it carry out anyway. I wouldn't recommend dining inside the restaurant unless you like harsh fluorescent lighting.The biryani is great. As are the kabobs. The ras malai desert is creamy, as it's meant to be. Other places like Aab in Grandview make a ras malai that's way too cakey, and smothered in sweetened condensed milk - that's a cheap shortcut most south Asian restaurants use for ras malai. True ras malai cream shouldn't taste like sweetened condensed milk. This one doesn't."], ["Brit A.", "Don't be deterred by the location. What it lacks in curb appeal, it makes up in taste and price. This little restaurant serves some of the most authentic Pakistani food around! For those virgins out there wanting to taste authentic Indian/ Pakistani food, wrap your taste buds around the Chicken Seekh kebab with naan. Or  my favorites- aloo palak ( potato and spinach) , aloo gobi ( potato and cauliflower ) and the bhindi curry ( okra curry). The naan is freshly made in house and is a bargain at just $1 each. The samosa's are to die for, team them with a hot cup of tea / coffee and it's an explosion of pure bliss in your mouth!With the low prices ( can pick up a curry for $6-$8) and tastes that are reminiscent of your mothers curry, expect it to be busy. The restaurant gets a lot of carry out orders so be prepared to wait a good 40 minutes. In my book, the food is well worth the wait.My five star rating is based purely on the taste and price. The staff is friendly and polite, but the wait times and decor are a slight let down."]], "Indian Oven": [["Helen M.", "My first-ever Yelp review, so here goes!:I could not understand the 3 1/2 rating so had to speak up.If I could give a half star, this place would always get a solid 4 1/2 stars in my book, and definitely a 5 for Columbus.  I have gone there many times for family dinners to birthdays and holiday dinners, and have never had anything but wonderful experiences.  The modern, industrial interior is contrasted by the friendly and jovial owner, who is always happy to have a good conversation, and answer any questions you might have.  The wait staff is always attentive and good-natured.And now for the food...Being a lover of Indian food, and having had my Indian boyfriend's mom's home-cooking, as well as having traveled to India, I can honestly say that the Indian Oven does an excellent job both with traditional dishes, as well as modern twists on the classics.  For instance, tonight tried the owner's recommendation of chicken cabbage rolls, sort of a take on the Chinese egg roll, that were comforting and very flavorful, and come with a semi-sweet, semi-spicy curried dipping sauce.  For the entree, I again the special--lamb served as five lollipop pieces seasoned with cumin, garam masala, among other spices, and cooked medium over a bed of fluffy biryani rice with sautéed onions and peppers.  It had just the right amount of spice for my \"medium\" selection, and the meal left me completely full, and satisfied my Indian food craving.So, to wrap it up...TL;DR...if you like Indian and are in the area--GO HERE!! No, it's not your traditional mall food or everyday curries....it's much , much better!  Give it a go :)"], ["Rishi R.", "Great ambience. Great location. Great service by the server (also the manager). But lacking on food quality of the main entree. The server was quick and interactive. She knew about the dishes as opposed to having a generic answer. All items were brought quickly. The main entree I ordered was their main chicken dish based in the recommendation but the chicken was hard. I also had to add salt. I will return to this place for another chance to try out something else."], ["Chaitanya V.", "For the prices they charge, the food should taste lot better than that. Their buffet menu is very limited especially for vegetarians. I know atleast 4-5 better indian restaurants in columbus itself. Good staff and service but high prices and ordinary food."], ["Amruta D.", "Very overpriced. The food is just mediocre Indian food, I didn't think it was all that special, and there are definitely better indian restaurants in Columbus for the price. I don't think it's necessarily bad, it's just not authentic and I'm giving it 2 stars because it is very very overpriced for the quality."], ["Robin C.", "It wasn't until I moved to the great big old state of Ohio (now we know it's all bigger and *ahem better in Texas so I mean this figuratively) that I had my first taste of Indian food.  For many a month my friends would try to persuade me to give it a try but the concept of curry, tandoori, and naan were scary.  Oh, how the culinary palate times have changed!  Indian Oven is the closest place for this delectable cuisine that I have of for us East Siders.  The location is set in modern decor and the price point matches the overall goal you can tell the owners are going for.I was immediately taken to a table and before I had my coat off a cripsy treat with delicious green sauc was sitting in front of me before I even meet my waitress, who was only a few steps behind.  I ordered the Mango Lassi, adult style, that was DEE-LICIOUS!  Next up was to order my entree, which proved to be very difficult!  The daily specials sounded magnificient and the menu had several options for a curry lover.  I went with the chicken makhni and onion naan.  The naan was great!  It was stuffed with minced onin and piping hot.  The chicken makhni was...fine.  It wasn't the greatest Indian dish I've ever had and I doubt I'll ever order it again.  Now, I'm not saying it isn't worth ordering but it just didn't wow me, knock me off my feet.Toward the end of my visit, my server seems much less attentive than when I first arrived and my exit was extremely delayed as I waited around for her return to my table.  Now, I don't blame her one bit.  She was the only server working.  I would recommend that the restaurant add a server or have other employees assist when the restaurant starts to fill up.  There were a few guys just standing around waiting for something to do, while she was running around solo."], ["Brandon H.", "Wonderful service, very attentive. The business as a whole is very clean and nice. Upscale compared to any Indian restraint I have been to. Food was excellent. Came out in a timely manor. Did I mention the food was awesome!!!"], ["Erica R.", "A little off the beaten path, this Indian spot has become one of my favorites. They have an incredible lunch buffet and the food is always delicious. It is a great spot for a private dinner with a quiet romantic atmosphere. The staff is friendly and they provide great service. They also have a fantastic drink selection."], ["Tia P.", "This place is a hidden gem. I never knew about this place if it weren't for my friend who came here a few times with his colleagues. Food was good, nice atmosphere and good service. It's a bit far for me but I would come back."], ["Bryant M.", "Whoa... I feel like I'm in that sideways universe on Lost right now.I'm usually pretty in synch with Yelp's overall rating, especially for an established restaurant like Indian Oven. At 3.5 stars, let's just say I wasn't tripping over myself to try this place out. But then a good friend of mine wanted to meet there for dinner--I really like this friend, so I said 'yes.' From the looks of it, a lot of the disgruntled reviews mention the lunch buffet. I'm not really a buffet kinda guy, so completely disregard my review if that's what you're looking for. Maybe it *is* terrible? I have no clue.I love the location of Indian Oven, especially at dinnertime on the weekend. There's loads of street parking, and it's only a 7-minute drive from my house. I'm used to having to drive all the way to Grandview to get good Indian at Aab.The interior here is lovely. It's so bright, airy, clean--very minimalistic. The service is top notch. The guys running the restaurant are friendly, kind, and genuinely care about your experience. We never wanted for anything; I constantly had water refills, and someone checking to make sure I loved my meal. It was a lot of attention, but it wasn't obnoxious--it was very sweet and thoughtful. One of the guys--I'm assuming an owner?--talked to me at length when I asked about where all the meat comes from. I had roasted chicken, which was the special that night, and it was a special type of hen he buys from a local farm. He then went on to tell me about where the goat is from, the lamb, etc. I could have geeked out on this stuff all night, but I don't think my friend was quite as into it as I was. #FFA4EverMy entree, the previously mentioned roasted chicken, was spectacular. It was a Bangaluru dish--chicken smothered in a spicy cashew sauce over seasoned jasmine rice. When I mentioned my wheat thing, our server told me it wouldn't be a problem. I love places that put my mind at ease and don't make me feel like a weirdo.As we were wrapping up our dinner, the server brought out a mango custard, compliments of the house. He told me it would be good for digestion. It tasted like a thick lassi, and I was a fan. My dinner cost about $20, which I thought was on point. A beautiful atmosphere, incredibly sweet people, and delicious food... how could I not give Indian Oven five stars?"], ["Greg S.", "I am not sure what all the fuss is about. I read the reviews here and decided to give it a go. In my opinion the selection was small and the taste bland. I mean I have never had to add salt to Indian food before to give it some taste! This time I did. The goat dish had no meat in it and there was not much meat on the chicken either. (they serve both on the bone) For my money it is hard to beat the buffet over on Mill Run in Hilliard."], ["Tan N.", "I'm not sure why this place is only 3.5 stars! That is just crazy to me. Is it because people just want the same old curries and can't taste the intricate flavors in Indian cooking and can't taste the difference between this and an average Indian joint? I'm so glad I read Bryant M.'s review and gave this place a shot. It's amazing! From the extra delicious cilantro chutney that came with the papadum to the extra entree we ordered because the first two were so delicious, we were very pleased. We thought it was because we were just hungry in the beginning and maybe that was why the free papadum was so good--but no! I think it's because they know how to taste the food. The lamb vindaloo was tender and and the exact spice level I wanted (medium). The bhindi (okra) masala was extra spiceful (not spicy). The palak paneer we ordered in addition had amazing, fresh tasting handmade paneer (cheese). Amazing. The onion salad was spicy and went well with all of the entrees--a little too much on its own. The Chenin blanc (from India, no less) was surprisingly tasty and went perfectly with the food. And finally, the service was fantastic. Our waiter was a sweetheart and though the owner (?) tried to sell me on french cut lamb chops, I took it as a sign of interest and pride rather than selling it too hard. I made my choice of vindaloo and next time I'm going to go with his recommendation when it's not the end of the month. ;)"], ["Michael A.", "I was extremely skeptical before going in to the Indian oven, but my skepticism was quickly extinguished when meeting the waiter. He was very cordial, polite and patient. The waiter recommended the roast chicken and let me say...wow! Very very good food. They even offered to comp my meal if I didn't like the dish. This was a great experience. The service was great, the food was great and the inside is very simple and clean. I recommend this when you want to get your daily fix."], ["Jay D.", "My favorite spot for Indian food, the place is well lit and nicely designed but the food and the service are what set this place apart. The owner is always there and always greets you with a friendly smile just before warning you that their 'hot' is really really hot, I'd say it's about medium high on the spicy scale. Go for the Chicken Tikka Masala, some samosas and Naan --you'll not be disappointed."], ["Matt H.", "Pretty good Indian food. Curry has various levels of spicyness. The mango ice cream was very expensive and sub par. I think the place is over priced for what it is."], ["Brandie J.", "I could have not been more satisfied with the menu, food, and service. Owner was extremely friendly and welcoming. Made you feel like he was welcoming you to your house for dinner. Will be coming back again next time I am in Columbus."], ["Giovanna A.", "This is probably my favorite indian restaurant to order off the menu from, not reviewing the buffet since I have never been to theirs. First of all I love the carryout here, including the spiked mango lassis while I wait, but the space is modern and the service is great eating in too. The garlic naan is to die for, the spice is just right as far as truly being able to get a medium, and their butter chicken is just perfect. A lot of places make their vegetarian dishes way too rich, something I associate with trying to get people to not eat too much at a typical indian buffet situation, and these folks are not guilty of that. Though I get to come here much less often since moving, the owner still remembers me and what I like, gotta love that!"], ["Karthik R.", "i had a horrible experience today... rude staff, so so food and quite expensive... staff seemed to value only white american customers"], ["Branham P.", "the buffet is a must. Go ASAP. flavor and more flavor in each bite. so go for lunch and get the buffet you will be happy. I don't know about dinner because downtown closes at 5:30pm."], ["Jonathan M.", "Very delicious... My Indian friends tell me it's very Americanized Indian food, but everyone says it's amazing!Very elegant and yummy!"], ["Jasmine M.", "I love this place! The food is above average for what you get in the area, but what really sets it apart is the decor. It's much nicer and has much more of a \"date-night\" feel than other Indian restaurants. The service is great too!"], ["LA F.", "I wish Indian Oven was a bit less expensive so we could eat there constantly. Their food is special. There's a complexity to their sauces that is rare to find; the deliciousness does not seem to come from heavy oil or cream."], ["Erica C.", "Indian Oven never seems to disappoint. The staff goes above and beyond to make sure you feel like family. Tonight they recommend a special dish of slow roasted chicken to my husband---it was amazing. The nann, especially the garlic, is the best I've ever tasted as well. The best thing about this restaurant is that it seems like a hidden gem. Never extremely crowded but very clean and industrial looking. Try it out- you won't be sorry!"], ["IaMa F.", "The food here is not authentic Indian/Pakistani/Bangladeshi. The food is bland and the meat dishes are overcooked. Went there because close to work - not going back again."], ["Mark R.", "The food and the service are both top notch. You'll never ask to have your drink refilled. It must be the clay oven because the veggies are cooked to perfection. Exceptional restaurant."], ["liz l.", "Man, I LOVE this place! The look: good first impression. Easy location and parking. The service: super friendly and welcoming. The food: awesome awesome awesome!!!!!!!!!!! Some of the best Indian food I've had, definitely the best in Columbus. We had onion salad, palak paneer, bhindi, and lamb masala. Everything was wonderful--very flavorful and perfectly spiced--as was the Chenin Blanc. So, so good."], ["Ram B.", "I am..quite picky in choosing a good Indian restaurant ...having said that, Indian oven rocks when it comes to non-vegetarian indian food!(The only other good Indian restaurant in Columbus is Dosa corner -South Indian food)Best dishes are their specials - roasted chicken & lamb chops!! & pakoras!!Downsides..expensive! But worth it, will go again! Hope Indian oven keeps up the good work"], ["Richard P.", "Every now and then I go to Indian Oven for the lunch buffet, mostly because it's one of the few places in reasonable walking distance of my office that serves decent food and is appropriate for business lunches (unfortunately, neither Donatos nor McDonalds meets that criteria).It's a small buffet: white rice, naan, two vegetable entrees (usually cabbage bazi and vegetable korma), and two meat entrees (every time I've been there, it's been chicken curry and chicken tandoori), plus raita, Indian-style pickles, and dessert (usually rice pudding or fruit in yogurt).  It's small, but the food is well-cooked, and how much food does on need for a workday lunch, anyway, assuming you want to do any work afterwards?  Plus the space is stylish without being pretentious, and pleasant.I wouldn't consider them the best Indian restaurant in Columbus, but every time I meet a particular colleague for lunch, he always asks to meet at Indian Oven.  So I guess they're not too shabby, either."], ["Matthew S.", "Been coming to this restaurant for fifteen years. Would never consider going to a different Indian restaurant. The lamb vindaloo is complex. The shrimp Palau is sublime. The owner treats us like family. Best Indian food in the country!"], ["Lana C.", "We ate here on Valentine's Day.  Not crowded, beautiful atmosphere, modern, urban, clean.  Service was impeccable.  Refills constantly.  Food was the best!  We had the two specials that night, huge shrimp with green beans and then 1/2 a free range chicken in a wonderful sauce.  The garlic naan is delicious and the veggie patokas appetizer.  Even the desserts were unique and tasty.  You must go!!!"], ["Demetreus R.", "Not a expert on Indian cuisine, but I eat Indian all over the country. This places food is on par with all of them. The waitress was cute and friendly. The clientele seems to enjoy themselves. The food is great. I'd definitely recommend this place to anyone who wants a nice Indian meal."], ["Harry S.", "Arrogant and insulting manager. As soon as we walk in he felt the need to make vulgar remarks about how we should speak English. We had a group of educated hotel developers, administrators, and a Colonel. We not only felt insulted, but also felt unwelcome the entire time. Had the weather not been terrible, we would have happily walked out and went elsewhere. Our waitress was polite and tried her best to be as helpful as possible. I do not see how this restaurant is rated high with such low quality of customer service. I will not bring my hospitality group here next time."], ["Alana H.", "I don't know. Maybe I had an expectation in my head that I shouldn't have, but this place just didn't do it for me.I'm not one of those people who likes to be talked to by the owner for basically the entire time i'm at a restaurant; so this place immediately rubbed me the wrong way when the owner was bearing down on us the entire night. It really reminded me of that Seinfeld episode with Babbu, and how he keeps tending to Jerry's every need. I came here wanting yellow curry. Because YES, I am boring. I have not delved into the Indian food world much, but I do know I loves me some yellow curry; that is what I wanted. Unfortunately, in the owner's overbearingness, he basically ordered us to get a variety of dishes and share them. None of which were yellow curry, and all of which were VERY small. He went on and on about how this one dish had HUGE shrimps, and really we only got three medium sized shrimps [and there were four people.] Not really something you can share. Even after eating dessert I was very hungry. The food was all alright, it was tasty, but all was kind of the same. The desserts were also very small but tasted good. I have to admit, it was a Saturday night and there were only two other tables filled, that isn't a good sign for this businesses future. Maybe next time, but unfortunately I don't think there will be for me."], ["Chandri V.", "Interior is very impressive, servers are all courteous, everything is great except the food :( The food is not exactly authentic Indian. We ordered biryani and okra masala. The okra masala was good, but nothing exceptional for the price. The biryani was a total disappointment. It was simply a plate of rice, chicken, egg and certain vegetables such as potato and zucchini which have no business in a biryani, especially a Mughal one! Biryani spices were missing from the dish. The only spices that had been used were turmeric (an overdose) and red chilli powder.I want to give the place a second chance, just because it dares to be different from other Indian restaurants in terms of the menu and ambiance. However, at these prices, I definitely expect a much more flavorful meal and so am not sure I want to experiment again!"], ["Rebecca H.", "The service is wonderful.  However, our food was mixed in terms of quality.  From the appetizers we ordered lamb shish kebab and I overlooked that it was made of \"ground meat\", so when it arrived it wasn't chunks of lamb as I'd expected (and as one might wish).  The bigger problem is that the chunks looked like sausage cut up, and the texture was strange.  I would not order that dish again.  The dal dish I ordered was great, as was the chicken special that one of our party got.  The tomato soup and paneer dish we got were also good.  I ordered raita and it was watery, perhaps that's the family style, but I've never had such watery raita.  The paratha bread was wonderful-- hot, fresh, delicious.  Overall, just okay.  And yet we'd go back-- it's a very welcoming place."], ["Scott N.", "The food here was amazing and the service was incredible. Our waitress was extraordinarily attentive and directed our choices to the specials that evening. I had the roasted chicken and my partner had the beef rezala. Both dishes were unique and delicious. We had cabbage rolls for an appetizer. This dish was also a special not on the menu. The flavors exploded and the coriander (I think) sauce was the perfect accompaniment. After a wonderful, filling meal, our waitress brought us complimentary Gulab Jamon. I've had these many times at buffets, but i've never had them warm.... YUM! The waitress mentioned they have a special fish biriani on occasion. Given we live in Cincinnati, we'll just have to hope next time we're in Columbus that it is a fish biriani kinda day at Indian Oven, because I want to try it... bad! So there, I ended a five star review with the word 'bad'. That's pretty good. ......Aww, I just messed that up!"], ["Steven H.", "Why all the hate? This is a fine, fine restaurant. Clean, classy, good service, and wonderfully spicy food (you can order 1-5 spiciness). Definitely try the alcoholic lassis, which can mitigate the heat; and all the food is at least one notch above the \"standard\" Indian diner. I'm not a connoisseur, but I will be coming back again often. Plenty of options for vegans, vegetarians, and meat lovers. What's more: ample parking!!!"], ["Brad S.", "It's impossible not to compare this lunch buffet to the others in town, namely the one at Aab.  This one doesn't measure up.  The choices were very limited (2 chicken dishes, some rice, a veggie side).  I expect a more varied spread in a buffet - all curries make for a boring lunch.  The staff were friendly and the meal was well priced, but I'll go back to Aab for my regular lunchtime indian fix."], ["Kate H.", "This is one of those places that you either really love or you don't. I am a big fan of Indian food generally (I think Aab in Grandview is spectacular), but Indian Oven isn't quite the Indian I was familiar with. That being said I love it here. I love the restaurant, I love the food and I love owner, who take such pride in this place,the ingredients in his food, his employees and his guests.I am a big fan of the chicken vindaloo... I am usually a lamb fan at Indian restaurants, but that is not the Oven's strong suit. The samosas are excellent, as is this mango chutney like dip they have for their new cabbage chicken egg roll (that is not on the menu yet, but will be soon). Their saffron rice is also excellently done, which Aab sometimes lacks. I'd stay away from the garlic na'an unless you want to sweat it out for the next month.The Oven is much more of a fine dining experience than you'd expect and the price is higher than Aab and other Indian restaurants as well. I think it well worth the trade off. We are always welcomed guests and know most of the staff. I feel a loyalty to this place and hope they can keep a decent client base in someone difficult location."], ["Steve G.", "Indian Oven is one of those places I have a love/hate relationship with. Food was delicious, service was great, but the prices were just a bit beyond what I expect to pay.  I had a very similar experience with a place called Bollywood Bistro, and that location closed. Indian Oven, on the other hand, will attract to the more upscale Downtown residents that are craving good Indian food, so I'm not worried about this location. I'll be back when I'm craving great Indian food, but it won't be a common occurrence."], ["Tom B.", "Lunch Buffett is rather limited. Disappointed by their Chicken Tikka Masala (served with grilled onions and the sauce has little cream). Great bar selection. Decor is very nice. Great place for dates or friends, but don't expect the Indian dishes to knock your socks off. Acceptable and passable in crunch. Bar menu and atmosphere make up where the food is lacking."]], "Curry & Dosa Indian Restaurant": [], "Apna Bazaar": [["Maharaja of Gaipajama G.", "Since my exuberant, pleased review of this place almost a year ago, it seems Apna Bazaar has regressed. I visited last night with a couple friends hoping to show them what real meat biryani should taste like. Seeing that the kitchen moved from the back to taking up an L-shaped space from the left side to the back, I presumed that its customer base had increased, and that could only mean the food had gotten better. Wrong. I like to give purveyors of ethnic fare great latitude, taking care not to conflate taste with quality, ever certain that they know more about their region's cooking than I might. But on this day, I was expecting a little more than \"thank-you-Apna-Bazaar-for-being-here\" dishmaking. Columbus is no Devon Avenue in Chicago, with its adjacent storefronts of top-notch Indian cooking - but that doesn't mean you don't try - at ten bucks for the special and 2 naans, especially when there are 4 other places within five miles. My friend and I got the beef kofta curry, and another friend a chicken dish. Sure, the meals were savory and richly spiced, the brown hue dense with flavor. But the brown hue also glistened, and the dense spice had to be spooned from a thick veneer of oil. Interspersed from each other, like the humps of two Loch Ness monsters on a break-up avoiding one another, sat the koftas, and one spoon in, we discovered the ground beef was devoid of any taste, a very covert yet conspicuous denouncing of its very identity as a kofta (kofta is a spiced ground beef).Apna Bazaar prices its food from 7-9 dollars per dish, sans rice or bread, which you have to pay extra for. If that's the case, expectations run higher. The last two times I was here, even its meat biryani lacked the minimum amount of meat, the joint pieces instead accompanied by a chewy cartilage. I'm still holding out for the biryani's sake. I'm a big believer in that you shouldn't have to go to Chi-town to eat good meat biryani. Apna Bazaar's biryani has the hard parts down - the color, the flavor, the spice, the sheer skill of presentation. Now, if only it could take care of what's easy."], ["Sam R.", "I normally avoid this restaurant because I had bad experiences with its food in past. However, my craving for a Paki food made me forget about my bad experiences and I thought I could give them one last try. Being from Pakistan I know what an authentic Pakistani food taste like. This time I ordered chicken Karahi $8.99 and two Naans for $4 which is not a bargain price. I don't mind paying these prices if the food was worth it. The curry was greasy with three pieces of bony chicken thigh which has hardly any meat on them. They used the cheapest part of the chicken meat. The naans were better tasting than chicken but they have pieces of dirt in them and when you chew your naan, you chew pieces of dirt in them as well which sometime hurt your teeth. I don't know how they cook their naan in clay oven that collects dirt. I could hardly finish my half a naan and thew the rest of the food. I don't know how this place stays in business. I will not be coming back!"], ["Giovanna A.", "I really liked the food in this place. Unlike a lot of establishments they were not at all shy about giving out full spice to a non-Indian/Pakistani. I thought the food was fabulous, will be back for sure. A couple of things that would help is the ability to maybe order a lassi while waiting, which takes a bit, maybe being able to order an appetizer? All and all not too different from the food next door and while the service isn't the same, the pricing makes up for the difference very well. Have not checked out the grocery part of the store but sure will next time!"], ["Shabby R.", "tl;dr They're racist/discriminatory - don't support these terrible people.So I've been here a few times, usually to grab some samosas or a small curry deal or whatever after hitting up Columbus Asian Market across the street.I, however, had an absolutely terrible experience there the last time I went.So it was the first time we went to actually grab dinner from the place. My two friends (both white - this is applicable) both received their meals relatively promptly, within 5-6 minutes. I had ordered a kebab roll, and being ethnically Indian, but relatively white bread, I was explaining dishes and spices and whatnot to my friends.The guy who was working the till/taking orders kept giving me rather weird looks, and was really rude when I ordered my food, but I didn't think much of it at the time. Well, the minutes go by, and 25 minutes in, I'm certain that I see my food sitting on the counter (it had been there for a good 15+ minutes by that point) and ask him if it's ready. He said it'd be a few more minutes. Well, I ask the guy every five minutes thereafter if my food is ready, and 40 minutes in (I only stayed because I had already paid), he hands me the food that had been on the counter for a good 30+ minutes already.This is utterly unacceptable. These guys are extremely racist/culturist.Do not give them your business, they discriminate and give awful service based on one's cultural upbringing. I highly suggest never going here, and boycotting this store. The way I was treated was absolutely deplorable and hurtful. There are many other places to get Indian food in Columbus, do not go here."], ["Emma D.", "oily, yummy, but room for improvement. Good serving sizes."], ["Nathan S.", "This place is great.  The goat curry and tandoori chicken are especially money.  They more or less have the same menu as Tandoori Grill next door, but it is a bit cheaper and they also have several other thing on the menu.  Hands down best Indian/Pakistani food for the money in Columbus."], ["Amar K.", "I'm giving this a five stars, my highest rating ever for a restaurant. It's authentic, the folks are warm and friendly and the food is so good, it could rub shoulders with the best that New Delhi offers. A friend of mine took me there, swearing by their Biryani. Biryani is a richer, meatier version of a Pilaf or Pulao, enjoyed by everyone from the Middle East, South Asia, East Africa and even Latin America.The place is bare bones and most of the space is dedicated to run of the mill Indian/ Pakistani/ Turkish? grocery items. But behind the shelves is a brand new kitchen with a Tandoor. There are a couple of tables and it's best to order ahead if you want carry out. The proprietors hail from Pakistan and are welcoming hosts. The food speaks for itself. I tried the boti kabab, 4 chunks of marinated chicken cooked in the tandoor, the most authentic naan outside of Old-Delhi and mint chutney with raw thin slced onions, under 10$. I was bowled over. The menu held promises of Halim and Nihari, items that cannot be found in most of the North-Indian themed curry houses here in Columbus. Do call and place your order before you go there, even if you plan on eating in. Oh, and they sell GOAT MEAT!!!"]], "Dakshin Indian Bistro": [["Andy M.", "How did I not know Dakshin existed?I'm certainly glad that I discovered it. I went with a friend from work who is Indian and says that their entrées remind him more closely of home than other central Ohio Indian restaurants.We work downtown; so it was a haul, but it also was well worth it.Their buffet had several byranis -- I went for goat; I love the goat.I also had an eggplant masala, a tandoori chicken, goat curry (with potatoes) and some exceptional chicken wings.Because Dakshin is considered a South Indian restaurant, their food is more spicy than most other places that I've visited in Columbus, but I like the heat. For the record, I would have been okay with a higher degree of heat, but not sure that my wife or daughter would enjoy it at that level.There also plenty of dishes I didn't get to try, so I definitely will have to return to sample the full range of offerings.Definitely worth visiting if you like Indian food and definitely worth a drive if you have the time."], ["Emmanual S.", "Been there for veg buffet dinner . We have about 25 items including  6 chutneys. Live station there was rava and wheat dosa. Whatever been there in the buffet taste really good.Items are : pongal/lime rice/veg Briyani/ upma/ curd rice Paruppu/ panner  tikka masala/ navarathna kuruma/ chick pea masalaRava dosa/ wheat dosa / nan / pooriBrinjal potato sabjiChat item/ cucumber6 chutneys But we miss core South Indian delicacy dosa / idly/ medu vada ...  Further they I felt for 14 dollar ,  itms can be little bit more ....... No coffee in buffet"], ["Donna O.", "Dakshin moved from its previous Dublin home to this new-to-them space at Polaris. The interior is split into two parts with minimalist decor. Our waiter was friendly, if distracted, but our drinks, food and bread arrived on time. They have unique appetizers - they look like Honey Comb cereal and taste like papadams. Highly addictive! I ordered a salted lassi, which was quite salty and so thick it was almost like drinking sour cream. I used this drink to cut the heat of my dish, but I did not prefer it.For dinner, I ordered the lamb hyderabadi, spicy. It went well with the chili naan - quite spicy. The spouse had a mixed biriyani, which I liked as well. Overall, we enjoyed our experience and would return."], ["Amy F.", "I'm a huge fan of Indian food and have tried most of the local Indian restaurants around town. My favorite time to go is lunch because they all have a lunch buffet and it gives you a chance to try many different options. We decided to try Dakshin at lunch time on Friday. Dakshin has a ton of delicious options on their lunch buffet and even has a vegetarian table and a separate buffet with meat options. I liked it, but didn't love it for these reasons:- They didn't have any items made with rice flour. I'm gluten free and can usually get a few items that I can eat because they're made with rice flour.. Eg: Dosas or idli. Dakshin only has naan.- I live and breathe for mint chutney. Their version was a huge disappointment. I would consider it a crime to call it mint chutney actually. - Their yellow dal was way too soupy.But, I did really like their biriyani. They had a veg and non veg option and would say it was probably the best biriyani I've ever had. I would go back to Dakshin if they'd change their mint chutney recipe. Until then, You will find me at Udipi and Maanas!"], ["Gus W.", "The only reason I knew about this place was because the guys show up to our work parking lot in a van, slinging tikka masala out the backdoor. No joke. Not even a food truck, just a van with their name on the side. I don't know how they chose us on the complete other side of town, and I don't even know if it's legit, but I don't even care. Well, I had to look them up and find out where the actual restaurant was, and Wednesday I finally got to try it up near Polaris.As with Aab, they have a buffet setting, and the there really isn't any service minus them removing plates from your table. The guy that was there overseeing things basically pointed out a table for me, where they had a big water jug out, and I sat down and dove into the buffet. I'm sure you could probably get a soda or something else if you asked.Honestly, I was pleasantly surprised by the choices on the buffet. I had read reviews about it being small, but I thought they had a pretty good spread. They had the usual chicken tikka masala, tandoori chicken, chicken curry, as well as authentic biryani, which they were pretty adamant about advertising. They also offered plenty of vegetarian dishes, including an okra selection that was really damn spicy, but I thoroughly enjoyed it. I think the best thing I discovered, though, had to be the Gulab Jamoon. Oh man. These little dessert balls were essentially warm pancake balls except much lighter, and they were covered in a syrup that was flat out delicious. They straight up melted in your mouth. I went up three or four times for more, and the guy working there suggested mixing it with the rice pudding to get a cool/hot thing going, and it was the best suggestion I had all day. I actually ate so many I nearly made myself sick, because they are quite sweet.Apparently the dinner buffet is even larger, but I was fully content with everything they had out, so I can only imagine. Did I mention the lunch buffet is only $6.99? Hell of a deal. If I'm in the area craving Indian, I'll definitely be back. The restaurant is fairly new, so I suggest any Indian food fans, or anyone who just likes good food, give it a shot."], ["Jeff J.", "Great buffet for the price. Lots of variety with  90 % spot on.  Would have been a 5 star if the briani was more spiced up and less Americanized. Very clean and priced great. Get here before chase opens their lunch hour either before 1130 or after 1."], ["Frank D.", "First the positives:The food pretty good. I like that they do not load everything with baking soda like other Indian buffets.  The baking soda expands in your stomach and causes you not to eat as much.  So there is a dieting tip for you. :o)The so-so:The lunch buffet is a good price ~$7, which is a good value considering the quality.  The service is spotty at times.  Now the negative:Or should I say illegal.  They appear to have a practice of changing the amount of the tip after you sign your receipt, if they do not think your tip was enough.  This has happened to several people that I've know.  They have tipped $1 (14% of the bill), only to find out that they changed the $8 charge to $10 (43% of the bill).  I do not have an issue with a $10 lunch, given the choices and quality of food.  I have a serious issue with their immoral billing practices.  I would suggest trying their lunch buffet, but I would suggest taking cash if you want to reconcile your receipts with the actual credit card charge."], ["Matt W.", "Not a great experience here, and it's a shame, because it could be fixed really easily.We decided to try Dakshin for their lunch buffet while up at Polaris running errands, and nearly turned around and left right off the bat. There were no signs to seat yourself or wait for a server, so we came in and waited at the entrance, trying to figure out what to do, for several minutes, being completely ignored by the staff.We were on the verge of leaving when someone finally came and seemed to realize we were there to spend money at the restaurant, he looked at us, ran back to get someone else, finally took us to a table, asked us what we wanted to drink, and disappeared. A few minutes later someone finally brought us menus and then asked if we wanted the buffet. We said yes, and finally went up to try what they had.The food was pretty good, especially considering the price, but I noticed that the biryani had very little meat in it, and the various hotel pans and trays were slow to be refilled. Getting our check was another remarkably long wait, and if I was a less honest person, I suspect it would have been very easy to just stand up and walk out without anyone the wiser.If the staff put any effort at all into providing decent service, I'd probably be recommending them, but as it is I would strongly suggest you avoid them - there are plenty of other Indian places in the area, and even more lunch options nearby."], ["Anthonni C.", "Review for weekdays buffet, amazing flavors as they're not scared to spice their food up. I'm definitely not an expert in authentic Indian food but I'll take dakshin any day compared to the other Indian buffet style around polaris, maybe even columbus."], ["Bethany K.", "This is such a great find!  I have only eaten the buffet, but I have had it several times in a short period of time... which is a sign of great food!I first met my husband during the week for the lunch buffet, and per the recommendation of a server (potentially the manager if not owner) returned for the weekend buffet.The weekend buffet is much larger, but this should't discourage a weekday visit.They do have the stereotypical buffet options such as basmati rice, naan, paneers, tikki masalas, but they're all great quality.They have a lot of vegetarian offers, and from what I have heard, their meat dishes are great as well.I haven't had any issues with the service, quite the opposite actually... in my experiences, the servers have been overwhelmingly helpful and on top of it all.Even though they have recently moved from another location, they are remodeling, and making great improvements.This has quickly become my go to Indian restaurant."], ["Sarah S.", "Still sitting here... Asked for a coke (machine is broken) asked for water with ice ( ice machine broken) asked for bottled water (got a warm bottle of water)... Asked to order from the menu instead of buffet (buffets are not my thing), got a lot of push back. Let's see what the food is like because so far this place has awful service.The food was ok - chicken was rubbery. Best part was the rice?"], ["Antony J.", "The chicken biryani (Paradise Biryani Pointe) doesn't live up to expectations.The locations in Maryland and Virginia serve good biryani. I haven't tried any other dishes.The 3 star rating is only for biryani."], ["Lisa H.", "I would give this place better than 5 stars if I could. By far the best Indian in Columbus. It's on the spicy side so if you don't like spice don't go for the buffet. The chicken 65 is awesome...beyond awesome.....mega awesome. I typically steer clear of tandoori chicken but theirs is super good!"], ["R B.", "The food might be decent, but how fair is it to charge a 15% gratuity if the tip line is left empty? The tip line is left empty for a reason, as for my case, I had ordered 4 items and all of them were served within irregular intervals in a span of 1 hour 30 minutes. The slow service without any priority infact pissed me off and that's the reason why I left the tip line empty. May be the restaurant should just try to understand the customer's point of view and rectify their mistake, when someone doesn't leave a tip, instead of adding fillers to empty lines. Do you really think customers bother to read the last line before leaving the restaurant with no tip on the bill?The waiter observed us waiting for him to pass on the menu cards, but he was more inclined to attending to a larger group of people who entered the restaurant along with us at the same time. My previous visits to the restaurant were good, was quickly served and attended to by the gentleman with a pony-tail."], ["Ajay S.", "Very \"spiecy\" vegetarian diet food.  I like the fact there are vegetarian restaurant in Columbus.Big buffet both like the smells; Cute interior both furniture;  Keep up the great service."], ["Alexis R.", "Food was delicious. Setting is peaceful and the meal is presented nicely. Each dish is really enough for two. Felt awkward walking in however, because you aren't really addressed until you stumble around enough that someone addresses your confused expression. We also didn't get exactly what we ordered breadwise, we both ordered a different kind but received only the one. I would say 3.5 if that were an option."], ["Tawnya H.", "So I tried to order takeout since the buffet so so good last time I was there. I called in when they opened to order and was told I had to wait until noon. I called back after noon and they didn't have 3 of the things on the menu. The person taking the order was yelling at others in the background and they ended up hanging up on me. So, needless to say, I won't try that again!"], ["Chintan S.", "I had takeout. So I cant really comment on service and ambiance.We ordered Biryani (veg and egg) on our way from Cincinnati.  When we got there an hour or so later, food was ready. Transaction was pretty smooth, uneventful.Now the food.  The Biryani is the best I have had in Cleveland or Columbus. The look, the aroma, the taste, the consistency of the rice..... Perfect.The veg Biryani and egg Biryani had distinct flavors which impressed me very much. Nice layers of rice and veggies.The egg Biryani is not just veg Biryani with egg..... It has a different taste and flavor profile. You can tell this chef if trained on how a Biryani is to be made.A lot of Indian restaurants will put some gravy (curry) in the rice and call it Biryani...... Not here.This will be a staple on my every visit to Columbus."], ["Vamsi P.", "Biryani'a are very good and especially dum  biryani's.  The serving and ambience is good . The quantity and quality of food is good. The starters are pretty good too. This one of best Indian restaurants in USA."], ["Gopalakrishnan A.", "The best Chicken 65 and traditional Thalapakatti Goat biryani are authentic. Dal Soup was unexpectedly wonderful. I loved their kebabs along with Chicken Platter where you get samples from chilli chicken, chicken 65 and chicken hariyali....Wow it was perfect and spicy that I ordered two servings back to back. And don't forget to try Chicken Chettinadu with garlic Naan..Place to go for a Wholesome and tasty Indian food in Columbus."], ["Van S.", "My family and I are relatively new to Indian food but have enjoyed most of what we've tried to date at other restaurants.    Our first visit here was to utilize an Entertainment Book coupon and expand our horizons a bit.    We've now been 4 times in the last 7 weeks!   Positives:Food is greatService is fantastic, very friendly and helpful in explaining dishesWe now have \"our table\"...sort of feel like Norm on Cheers...which who doesn't like that!Walk in and sit down immediately on a Friday or Saturday night in the Polaris area! That just doesn't happen.  No negatives so far....my only caveat is since we are new to Indian food, I can't really give a fair comparison to others.  All I know is our food is great and the service is great....that's about all I can ask of any restaurant.Dishes tried so far:Chicken Tikka Masala - whole family favoriteLamb Saag - my favoriteChicken Shahi KormaShrimp MalabarOnly thing left is for us to hit the buffet and explore further."], ["Tony M.", "Chicken tikka masala was wonderful! I thought the service was wonderful! Out waiter was very friendly. My wife had paneer saag and it was perfect!"], ["Nateyelp Z.", "I went there with my girlfriend for a buffet lunch. The food was okay but overall a bit spicy."], ["Daniela Z.", "Had their lunch buffet. Its $7 for dine-in & $5/lb for takeout. This wasn't initially apparent (they have a print out of the prices on an a4 sheet only where u pay). Nice small variety. Food was delicious. Absolutely love their chicken pieces with onions n veggies. A little disorganized but was during lunch and seemed very under staffed. Will def go back especially for the dine in buffet. Such a great deal."], ["Pradeep R.", "Worst service, food is not good as well... I don't why this has 4 star rating... If u want to be ill treated and eat food then u should come here... Food is not fresh there so guys its up-to you if you want to go to this restaurant"], ["Rajaditya M.", "It is a mark of how good a restaurant is that I went there for dinner twice within a period of 7 days after driving 24 minutes just to have their chicken tandoori and chicken 65.Well then you may ask why have I rated it 3 star instead of 5 star ? Let me go deep in :Food : This place in the words of my friend is \"atleast as good as AAB India\" (another popular Indian restaurant in Columbus\".  The food is consistent, hot and freshly made. I ordered the Chicken 65 and the Tandoori Chicken and they are made with soft succulent pieces of meat with flavorful spices.  In the entree portion the Naan and the chicken malabar curry comes in a rich gravy. The lamb is well cooked. I also chanced upon their Hyderabadi Dum Biriyani which is very good. (Almost like the real Paradise Biriyani back in India). Overall amazing food.Liquor : They stock Haywards 5000 beer. For an Indian restaurant, thats 'nuff said. Go try it if you already haven't. :-)Service : This is where they fail miserably. The waiters often mess up your orders. I had to ask them thrice to bring the drinks to the table. You will have to ask for everything. The silverware, the glasses everything. I can understand that during rush hour but even when the place is relatively empty service is below par. In summary, this is an amazing Indian restaurant that can truly give other veterans like AAB and Cumin a run for their money, if they can improve their services substantially. I will be going back to this place in near future."], ["Morgan C.", "We have just come to love this place.  Every time we are in the Polaris area we can not resist going back to this favorite.  My out of town family continues to request this over and over despite all the great Columbus options."], ["Taylor M.", "Dakshin is the BEST Indian food for me. The service is always very friendly and they go out of their way to be nice and accommodate you. Once they didn't have any naan out since they just opened their doors so they brought it fresh out of the kitchen to my table! I promised one of the workers at Dakshin long ago that I would write a review. So here it is. I do not live close to Dakshin anymore so I am not able to go as often as I would like. The lunch buffet is my favorite, especially on the weekends because they have special dishes in their buffet on the weekends. They have the best biryani and their naan is always fresh and hot. They leave a pitcher of water at the table, which is perfect for me. My favorites include naan, biryani, fish curry, and chicken 65."], ["C F.", "Dakshin is one of our favorite treats. The Tandoori chicken is wonderfully moist. The buffet is an adventure of cool dishes. The buffet price can't be beat - $6.99 for lunch! And you know it's authentic cuisine when a good 80% of the customers are always Indian. The service is fine as long as you're not expecting 5-star quality. At slower times, the waitstaff are very pleasant and helped recommend dishes, explain ingredients, etc."], ["Krishna M.", "Did not like the biryani. ."], ["N H.", "No stars. When we walked in we had to with 45 mins left for lunch. 1st thing we saw when walking in was kids climbing all over empty seats and crawling with  toys on the floor. Then when we told the male host host there were 2 of us he put us in a different room away from the buffet and clearly not apart of the actual restaurant. It smelled and the tables were for large party's and not clean. The smell in the room was so awful we thought there was a bathroom door open. When we asked if we could sit in the actually restaurant next to the buffet that smelled amazing we were told no. That he (the host) was going to start cleaning in there. So we walked out."], ["Meredith E.", "Absolutely love everything about this place!!! The warmth of the host gives it a welcoming feel. Anytime I'm in Columbus I make it a point to come here. The option and variety is enough but not so much that it is overwhelming. The food that is there is amazing and perfected. The dessert is really good. Love the rice pudding!! The Chai Tea is one of the most exciting things about going there."], ["Saad H.", "Not the best experience regarding food and service. Other places have better food like the oven."], ["Pariah J.", "Went here for the first time yesterday. We had the buffet. I really liked the eggplant fry. All the dishes were seasoned well with the right amount of heat. If yesterday is any indication, this will be my go to Indian restaurant from now on."], ["Char C.", "YUM!Unique stuff in here...service is efficient. The Tandoori chicken was really good. It's become my favorite, especially for take-out."], ["Srujan J.", "Awesome dinner buffet (Thursday) moderately priced. Lamb biryani is amazing, probably best in town."], ["Kaushik J.", "I love the buffet here. Worth the money for both vegetarians and meat lovers!"], ["Mary Jenny V.", "I had the buffet today for lunch and got raw tandoori chicken. The customer service was horrible. No one even apologized. They acted annoyed that I got raw food when they made a mistake. I will never go there again."], ["Vineet S.", "Best biryani in US for sure. I keep coming back for more. Other dishes are amazing as well."], ["Naveen N.", "Good, yet may not be the best Indian restaurant in Columbus.Their extensive menu seems to cover a great part of India - from Madras coffee to Punjabi lassi. Disappointingly, none of the South Indian options were available on the day we went.The biriyani had a nice flavor and spicy as we ordered. We would have liked the Paneer Tikka to be less dry, but was not bad to complain.It has the expected usual gloomy ambience. Though there was a little mixup in the service, no complaints. It was taken care of. Heard much of the South Indian here. Hoping to try the buffet and South Indian soon."]], "Dosa Corner": [], "Udipi Café": [["Caitlin E.", "Today I visited Udipi for the second time with friends who were born and raised in southern India - the culinary region of this cafe.  They approved the authenticity of the food, and as an American, I can attest that it was delicious!I was pleased to see that they now serve the buffet for lunch on weekends. It was a very great deal (only $9.99 which is the same price as the majority of the entrees and much less than other Indian buffets in the area), and I was able to try all of the options since everything is vegetarian. There was a great variety, and everything was labeled so that I could learn the names of the items I was trying.  I must have tried everything, and there was not one dish I disliked. The service was great as well. The staff was polite, allowed us to choose our seating, and they were very good about cleaning up our empty plates frequently.  I cannot wait to take others here!"], ["Shash D.", "This restaurant used to be the best indian restaurant in town about 5 years ago but now it has completely run down. Good Things about the restaurant1. Dosa's Are the best i have ever had in United states or in Columbus. Their Rava Dosa is Awesome. Chutneys are great! Down Side/ Disappointed1. Please do not go for lunch buffet. Buffet is horrible, Poor Quality, deep oil fried and Unhygienic Food Quality.2. Customer Service is Horrible. 3. Cashier/ Lady in the counter acts so annoying and unprofessional. They play loud music as if their partying with all kinds of stupid music. 4. Udipi is all about Pleasant, Peaceful and naturing loving but this is totally opposite.5. Very Unhygienic and restaurant is very dirty. 6. Booth and carpets are dirty and Disgusting. Advice to Management 1. Please fire your waiting staff or educate them to be professional And stop playing loud music 2. Please stop Throwing disgusting food in lunch Buffet. 3. Stop serving Deep Oil fried food in lunch buffet4. Please keep your restaurant clean and maintain Hygiene5. Please Change the carpets its very disgusting. Don't be cheap!"], ["Aklilu A.", "My friend and I were looking for a quick place to eat and thought Indian. We came across this place, no idea it was a strict vegetarian menu, boy were we surprised. But since we had already been seated, we decided to give this place a try. Open parking lot out front so parking wasn't a problem. The service is nice, the employees are kind and happy folks. Happy to hear we were first timer's and had plenty of suggestions for us. The atmosphere was very clean and cozy, plenty of families around us. Guess eating vegetarian is popular thing because a majority of the place was filled with a diverse group of people. We ordered the Special Rava Masala Dosai and the Udipi's Special Spring Dosai. They came with thin rice crepes, which were crunchy and delicious. The vegetables were grilled and seasoned well. We were still pretty hungry afterwards though, probably because there wasn't no real meat in the meal. But if you're a strict vegetarian, then this is the place for you!"], ["Bayan S.", "Excellent! Lunch buffet only $7.99. Unbeatable value. Fresh ingredients! Best vegetarian South Asian cuisine in Central Ohio. Friendly staff. Clean environment."], ["Paulina T.", "My bf, his mom, and I went for lunch on a Tuesday. We did the buffet which came with a small plain Dosa for each person. The buffet was small but it had  a cold food section comprising of various chutneys, yogurt, and fruit. There was also a hot food section which had two soups, 4 curries, a dessert, and some breads (vada, illdi, bhatura , and uttapam). The food was so-so. The vegetarian curries were bland and uninteresting. The dal was very watery and the channa masala did not taste very flavorful. Our table used copious amounts of the chutneys to add flavor. Having tried ordering the Dosas for dinner, the lunch buffet did not live up to my previous experiences. It seems that some other Yelpers have noticed the dodgy service, sadly I would agree. The restaurant workers seem non-chalant, or even worst uncaring. We were seated with no greeting, and received our check with no thanks. The entire meal seemed very taxing for the wait staff and us. In addition, they keep their water pitchers in a corner, our first pitcher had a fruit fly in it. However, a chef came out at one point and was very welcoming, urging us to try the fresh bhatura. He was so friendly and was the only smile directed at us. Pros: Dinner Dosas, tasty chutneys, uncommon South Indian cuisine availableCons: service, lunch buffet, questionable cleanlinessOverall, I would probably not come back for the lunch buffet. Stick to ordering Dosas for dinner. If the service was better, I probably would have given them 3 stars."], ["Tim B.", "Consistently high quality food. 6/10 in service. The Dal Makini and Masala Dosi are very good -the best I have had. 8/10 for price. 10/10 for quality of food. Ask for a table as the booth seating is not so comfortable. They do need to renovate some of their seating furniture. This is a great vegetarian restaurant."], ["Mary B.", "I usual find myself here with my Indian coworker traveling back from meetings.  He is a vegetarian and enjoys this place.  The dosas are to die for.  I have found that the weekends must be the best time for more options.  The service is buffet style which allows you to try a variety of preparations to find the dish you like.  I have not had a consistent experience here which is why I rated it 3 stars."], ["Christopher G.", "A friend living in Columbus recommended Udipi for its $7.99 vegetarian buffet. Everything was pretty good and there were plenty of South Asian customers--a good sign.By the time I left around 2, some of the buffet trays were drying out a bit.I'll probably be back this summer."], ["Anna S.", "Holy lunch buffet!!  A great way to try the various South Indian wares available at this little gem of a restaurant.  There are dosas (freshly made and brought to the table), idlis, savory rice pancakes, vegetable curries, rasam, sambar, and various other deliciousness.  Also, the last time I went there, there was this stir fried beet dish with chickpeas that was addictively good.  Overall, at $8.99, it's a great value for well-made South Indian."], ["Doug B.", "Went here on the recommendation of an acquaintance and wasn't disappointed. Our visit was for a Sunday lunch, so we had the buffet. Not a big fan of buffets, but decided to give it a go anyway. I sampled pretty much everything available. I cannot begin to tell you what I ate, but everything was very tasty, except the coconut chutney. It just didn't suit my palate.The greeter/waiter/cashier wasn't the most pleasant guy; not that he was unpleasant, just indifferent. Kinda like, 'If you don't eat it, someone else will' attitude. When the meal ended, the check wasn't brought to the table either. We waited for a little bit, then observed others going to the register without theirs, so, like lemmings, we did the same. I do question the overall cleanliness of the restaurant. We'll go back, but likely not for the buffet."], ["Tyler S.", "This was only the second time that i have ever had Indian food and it was much better than the first time, which was a place in Polaris that starts with a C. My Indian friends are big fans of udipi, so we went for lunch on a Friday. I tried all of the items and really liked most of them especially the upma? I'll return sometime, the only reason it's a 4 and Not 5 is that the service was just Ok."], ["John M.", "Honestly, I never know what I'm eating, ironically being Indian and all, but it's good for $7.99 all you can eat buffet."], ["Giovanna A.", "I get carryout from here at least every couple of weeks. Anyone who is a vegetarian, which I am not, absolutely must try this place and anyone who is not will not miss meat al all. My very favorite menu item is the navrattan korma, hope I am spelling that correctly. It is just a vegetable stew and many Indian places make that but not like this one, not too rich, just perfectly creamy. I also love their spinach (palak paneer) and this is the only spinach dish my four year kid will eat. Have not tried the buffet but really look forward to it so I can try all the appetizers."], ["Deepan B.", "During my trip to Columbus with friends, we stopped over her for dinner on thanksgiving Day. A vegetarians delight and plenty of options for snacks. Appetizer platter was wonderful. Even the service was not that bad considering they were short staffed. Our only concern was the ROACH movement on the tables on and off the food that grossed us out. If the dining area can have roaches we could only imagine about the status of the kitchen. That was the last bite of food we took. If only they could be clean this would be a place I would like to visit again."], ["Bharat B.", "I went there today with my wife. The quality has gone down. The lady who took the order does not understand what we wanted. We were two , ordered two Dosas and she wire down  three. Luckily we asked her to confirm the order .Sambhar was watered down sambhar.I met my friend their. They stated sambhar went bad and they had to wait for more than 15 minutes before the food was served.Their quality of chutney  has gone down too.We will think twice before going back again for food.We had ordered hot tea and Mysore coffee . Both hot drinks were excellent."], ["Bhargav M.", "Ordered starter platter which was good but Pongal was just fantastic... Had a good Pongal after a long time"], ["Marni K.", "I have found true love...in the form of Udipi's buttery, flaky bhatoora and chana masala. My dining companion and I also ordered the onion dosa and onion/pea uttapam. I didn't try much of the dosa but the uttapam was almost creamy, with lots of yummy onion flavor, perfect crispy, and melt-in-your-mouth delicious especially with that amazing, addictive green chutney. Yes, I am in love. Off to compose my love songs and sonnets in Udipi's honor now."], ["A W.", "Went in for a lunch buffet.   I'm pretty sure that I wasn't welcome as a single female.  I probably won't go back to eat in.  The food was passable, but nowhere near on part with the offerings just a short jaunt away in Dublin.   The soups and dishes were watery, the naan was slightly raw still.  The chutneys were great.  The sole saving grace of the meal."], ["Big W.", "The food is not great anymore. Everything is oily or deep fried. The taste has been toned down for Buffett and service has been ok. I had Buffett and was not impressed. When we went for dinner, the chole bhatura was not up to the taste. Apparently they have started to substitute spices with salt. The chutney with idli and dosa had too much salt in it."], ["Richard P.", "Four stars, in spite of my prejudices as a mostly unrepentant carnivore.  I came away full, but oddly full; in the absence of any animal protein, I think my stomach refused to believe it was sated.  I realize this is bad for my karma, and I will undoubtedly be reincarnated as hamburger, but given that the Dalai Lama isn't a vegetarian either, at least I'm in good company.The decor is a little formal, but Udipi Cafe indeed is a cafe - the dishes here are meant as full entrees, rather than the family-style ordering I'm used to at other Indian restaurants.  So when my wife and I ordered four dishes, we really should have had two more diners with us.Our dosa was light and delicate, and stuffed with minced vegetables.  We also had the coconut uthappa (an Indian-style pancake, as the menu says), which had large shavings of coconut in the batter, befitting Udipi's tropical South Indian origins.  Both came with a dish of coconut chutney and and a dish of sambar, a vegetable stew in a tomato base.We also had two curries: avial, a mild coconut-milk based curry full of vegetables, and malai kofta, balls of potato & cheese in a creamy sauce.  The malai kofta was the best I've had since Curry and Hurry first opened (which is a story for a different review); the potato-cheese-dry fruit balls (their description, not mine) were hearty but tender, and the sauce was subtle and complex - you could taste the cashews and raisins that were its constituent ingredients.  Both curries came with a generous serving of rice, achar (Indian pickles), and raita (yogurt with cucumber).The service is friendly, the atmosphere pleasant, but it's really the quality of the food that makes Udipi Cafe worth eating at.  There is clearly a level of care and skill in the preparation of their dishes.  Plus, it will be good for your karma, too."]], "Banana Leaf Restaurant": [], "Aab India Restaurant": [["Mark K.", "Wow, there's a little cluster of Indian restaurants off Sawmill now.  I've been to Tadka, now here, next I'll try Amul.  A little background on my Indian food experience: I am not an expert, but I like it and have had it often, in somewhat diverse settings.  One of my best friends in high school was born here of Indian parents, so whenever we studied at his house his mom made us snacks like samosas, etc.  His graduation party was a potluck feast with me as practically the only white face, and his wedding was an impressive banquet.  Since then, I've had Indian at some of the older restaurants near campus, and once in the UK.  My friends there went to Tadka with me once, doubting American Indian (bah-zing!) would live up to British Indian, but we all found it pretty similar.Indian buffets, at least the ones I've tried, tend to have healthier and better food than Chinese buffets.  Of course, it might just be the restaurant type- Indian restaurants tend to have lunch-only buffets, and serve mainly as standard restaurants.  Some Chinese places are similar, having a limited buffet at certain times, with better food than full-time Chinese buffets.  So maybe I shouldn't compare apples to oranges.Happened to drive by this a few weeks ago, and after checking the reviews I decided to stop in.  I'm surprised to see so many negative reviews.  I've never been to the Grandview location so maybe this suffers by comparison, but I found it very good.  The place is nice inside, obviously very new, and the service was decent (I just went for the buffet, so it was mainly drink refills.)  The food was pretty darn good.  The usual suspects- daal, tandoori chicken, curries, saag, biryani, pakora, naan and other breads, etc., etc.  I enjoyed it all, barely leaving room for dessert (there weren't many of those anyway.)  $10 for lunch.  I'll go back and see how well it holds up as they settle in, and how it compares to the others nearby."], ["Ajay S.", "Like the \"spiecy spieces\" and flavour odors.  Ate my usual game the Chole Puri bowl.  Thank Jesus Christ, I can't tell how good all this Bharatiyan food at Columbus restaurants is? I'm less blind..."], ["Carol C.", "Indian cuisine is my favorite of all ethnic foods.  I'm always trying Indian restaurants that I have not been to in the parts of town that I frequent.  I am vegetarian and always go to the buffets.  I rate AAB as the worst of the Indian restaurants at which I have eaten.  They only had three vegetarian choices plus rice. on the buffet.  The food was bland and tasteless.  It was so bad I don't even feel like going on about it  If you like your Indian food properly spiced go to Chutney's in Worthington.."], ["Rob M.", "Fantastic meal. The food was freshly prepared. The naan bread was amazing and fresher than I've had anywhere before. The menu is extensive and the curries were delicious. Level 4 on the spice scale was hot, and just right for me."], ["Monish N.", "I went there for dinner with several friends. While the restaurant and staff looked presentable, the food was terrible. Previously, I have been pleased with their Grandview location where I have had their buffet several times.  Firstly, the menu was confusing; it easily had close to 100 different items. It was evident that they picked every item possible from indian cuisine and tried to include it on the menu. This is a classic mistake by most restaurants.   Secondly, I ordered the lamb rogan josh and my spouse ordered the chicken tikka masala. Both dishes came with a heavy dose of cream with a few pieces of meat (lamb or chicken) that was probably keep frozen in their back freezer for weeks. I am personally not a fan of heavy cream.  Cream is usually used as a way to saturate the dish without any real ingredients such as meat, vegetables, etc. Most cheap indian restaurants use this technique. An above average restaurant will balance the cream with other ingredients such as onion paste, cashew paste, and actual meat. At any rate, I specifically ordered Rogan Josh because their menu said tomato sauce with yogurt."], ["Jennifer H.", "The food is as good as their Grandview location, the service is lacking which is bad enough for me to give two stars.I've dined in and done carry out.  After my latest carry out experience we're done.  I called in my order and told it would be 15-20 minutes.  After waiting an additional 30 minutes, food was in hand almost an hour after calling it in.  When we got home the naan was ice cold.  When I called about the cold food was told they apologize and there was nothing they could do and was hung up on.We were really excited for Aab to move to this part of town, but we'll stick with the Grandview location or go to Amul."], ["Terry Y.", "The food is absolutely delicious.  Some of the best in columbus in my opinion. Also they have a fantastic lunch buffet.  Service is pretty decent as well very friendly staff and great atmosphere.  My only quarrel with this place is I get indigestion after I eat there every single time regardless of the dish.  I eat indian food very frequently and for some reason this is the one place in Columbus that gives me indigestion.  But it could be because I'm over eating since the food is so damn good."], ["Jimmy H.", "I do not know a whole bunch about Indian food as I have only had it a few times. I do know this, I will frequent this buffet. I loved this place. We went 30 minutes before closing and unlike other buffets that would normally be nasty and empty there was still plenty of hot and fresh food there and the staff was very friendly. The place was clean and the decor was right in line. Everything I tried but the goat was phenomenal, goat curry had a few to many bones, thats ok skip that one. Everything else yummy! They have a rice pudding type dish for desert that is awesome along with this mango yogurt type stuff that is so sweet yet light. the chicken in the orange shit was off the chain!!! The bread and tortilla looking stuff was bad ass too, I will be back for sure!!"], ["Barry Y.", "I love Indian buffets, and the lunch buffet at Aab India is delicious.I've never had a disappointing meal at either location.The service is fairly average - for example, they don't rush to refill your soft drinks - but that doesn't take away from their overall star rating, IMO."], ["Derek H.", "Our favorite Indian place in Columbus.  Extremely friendly service and great food."], ["Taylor M.", "Very disappointed. I went one afternoon for the lunch buffet. I was not pleased with the food, it was mediocre at best and they need more selection. In addition, no one came by to refill my water. I waited and waited and it's not like the servers were busy. I saw one server just standing around on his phone. Then when it came time to check out the waitress was rude and asked if I needed change. No way was I going to give her a good tip, so yes, I wanted my change back. In fact, she didn't deserve a tip at all because she literally did nothing. So no, my experience at Aab was not a pleasant one and I will not be back. Service was TERRIBLE. I would give zero stars if I could."], ["Sara B.", "I'm not an Indian food expert by any means.  But this food tasted very food in my mouth. And the price was legitttt! Inexpensive.  I love you, AAB."], ["Emily L.", "I'm so surprised this location of Aab India has such a low Yelp rating...the location in Grandview is one of the best places in Columbus for tasty Indian food and this Sawmill location was just as good when I visited last week. I met some friends here last Friday after work to celebrate a birthday. When we arrived, there was no wait for our party of 5. One thing I noticed right away is that the tables are more spread a part than the other location, which I appreciate(I always hate feeling on top of another table). The menu at this location is basically the same as the Grandview location, if not a little bigger. For starters, my boyfriend and I split the vegetable samosas. The dough was flaky and not greasy at all and the filling was flavorful. I always love the condiments that come with the samosas. You can tell they are fresh. For my main dish, I went with my favorite, Chicken Tikka Masala and garlic naan. The portion size was great for the price. The flavor was great and it was just the right amount of spice(I got a 3 out of 6 spicy, so it has a little kick). The garlic naan was soft and warm and the garlic wasn't overpowering. One thing I want to address is that not all dining experiences are meant to be rushed. A lot of the reviews I had read said that it took too long for the food to come out. I did not find that at all; it took about 25 minutes for 5 dishes to come out. I did not think that was unreasonable and it gave me more time to chat with my friends. I think we are so consumed today with \"We want it now Now NOW!\" and can't appreciate the time it takes to makes something homemade and enjoy a dining experience. I actually appreciated that. But I think I am the minority on that one. Anyway, if you have been a faithful Aab India Restaurant as I have at the Grandview location, I can't imagine you will be disappointed by this new location."], ["Sam R.", "We love the biryani's here both goat and chicken..Tadka biryani we don't think is actually biryani . We also love the buffet and most of thier dishes . First we used to go to tadka but once we tasted this we have been mostly going here . They put new furniture which is good .."], ["Clint E.", "Pros:Really high quality Indian CuisineCons: *Service was average to terrible, but I think the place just opened. They were slow, and the server told me six times he would bring my lemons for my water out, finally just bringing it after the 6th time. *tomato/onion salad: no reason to order this. Don't make the mistake I did! They give you three slices of tiny tomato, with an entire sliced onion. Who the hell is going to sit there and chow down on a whole onion? Who thought this was a good idea? Do the right thing and when people order it, give them a tomato."], ["Amanda G.", "The lunch buffet at Aab is superb! The vegetarian options were excellent. Even the typically boring/leftover-tasting Saag Paneer is a delight here. All of the chicken dishes and the Goat Curry were very good, except the Chicken Vindaloo. It was good, but more vinegary than I'm used to. The ambience is much better here than at most Indian places. I feel like we could come here for a nice evening out. I hate to say it, but Aab is giving Amul India(which has long been our fav Indian place in Dublin) a run for their money!"], ["Todd K.", "Let me start this review by saying I have just recently been introduced to Indian cuisine. I have been to aab a couple times and the food has always been dependable and delicious.If you are just starting your journey in to ethnic food I would suggest the chicken manki with white rice. Simple, flavorful, not to spicy.  I myself started with this dish and is one reason I come back."], ["Steven T.", "I don't have a great deal of experience with Indian food.  But, this wasn't anything exceptional to me.  I ordered the Tandoori chicken.  It was good, but not great.  And my dates first order was barely palatable, to the point when she questioned the server about it, he knew immediately that it was too salty before she got more than a few words in.  They let her order something else, but the experience was skewed from there on.  I've eaten at a couple of other Indian restaurants around town and had a much better experience."], ["Ravi K.", "Nice food and nice variety on weekends with the addition of chaat to the original menu. Had tandoori chicken after a long long time and I would say that It was the best one I had till date in columbus. It would have been far better if they also served Indian style green chilli and curd chutney with vinegered onions. Neverthless the overall smokey flavour of tandoori chicken was at par with my expectations. I would also like to try their afgani chicken, If they decide to include that in the buffet some day.The snacks like pakora with green chutney were amazing. Since I am a hardcore non vegetarian so my review only applies to the non-veg main course dishes. All the dishes were delicious except the goat curry in which the meat was not soft but rather chewy. There were a plenty of salads and I loved the custard there.Overall a nice experience and dollars well spent."], ["Jenny F.", "Best Indian food that I've had in Columbus! The service was great, even on a busy night when they had a large party. We had samosas to start, and then naan, lamb korma and lamb rogan josh. The lamb was super tender and everything tasted great. We'll definitely be coming back - a new favorite!"]], "Aab India": [], "Amul India Restaurant": [["William P.", "In opposition to another post here, I think the absolute hallmark and Gold Standard for an ethnic restaurant is seeing actual members of that ethnicity eating there.And I saw quite a few INDIAN families enjoying their food, as we did!VERY Prompt and  Courteous service.And the food was EXCELLENT.Between the nearby Indian Grocery storelocated a few doors away and this Restaurant, (and watching youtube cooking videos) we are learning not only to enjoy Indian Cuisine, but also how to prepare it ourselves."], ["Jessica S.", "This was delicious! I ordered the Kulfi... Best ice cream dish I've had in a long time and they packed it with ice so it would make it to my hotel. Mango Lassi was fanominal! It was sweet, but not overly sweet. The Chef' Special nan is wonderful and it pairs nicely with their tomato soup. The only this I was disappointed in was the go I Pakora, it was tasteless...I look forward to trying my tandoori Chicken and the sweet mango chutney; I was too full to try them, but they smell delicious."], ["Myka F.", "We were really impressed with the authenticity and level of service of this place. The apprizer platter was delicious and especially exciting for those that have gluten allergies. Highly recommend this place!"], ["Sachin G.", "Decent Indian restaurant in the area. Onion naan and saahi paneer are good. You cannot go wrong about the tomato soup."], ["Christina G.", "Wonderful dinner tonight! Started with a super creamy sweet lassi. Yum! Vegetable samosas were creamy inside and served very hot (temperature). Lamb gobi tasted great, with a nice sauce. I also had a lovely puuri, huge and puffy and hot, with a side of raita. The raita was a bit sweet, which I wasn't expecting. I like it better when it's just yogurt and cucumber flavored, no sugar. Still, it tasted good with the puuri and cooled off my mouth.  The staff are all quite professional and very nice.  I look forward to eating here again next time I'm in Columbus."], ["Heather D.", "Good food. Polite service. Standouts from the lunch buffet: dal soup, saag paneer, chutneys. The dal soup was sublime. The smell of it alone is worth a visit. I love saag paneer and Amul's was creamy, rich, and  full of flavor. I enjoyed the spicier chutney. And had the custard & tea for dessert. Delish. Great value!"], ["Holly C.", "The food here is so good! There are quite a few Indian places in the area, and especially with AAB opening close by. I was surprised at the amount of restaurants in the Upper Arlington/Dublin neighborhood. The decor and ambiance are very classic and comfortable. My friend tried the chicken curry and liked it. The naan was very fresh, hot, and tasted delicious.I'll definitely be coming back to try other items, but the chicken tikka masala is still my favorite! I heard the lunch buffet on the weekends is awesome!"], ["Anna S.", "I've always been hesitant to go back to Amul because it once catered a work luncheon.  And the food was not good.  It left a rather indelible impression, and being an Indian food snob, I failed to give this place another chance until this summer.  Good thing I went back, because I've literally eaten my previously negative words.  The new location is super close to my office and I hit up the lunch buffet pretty often.  It's an amazing array of both well-executed North Indian non-vegetarian AND vegetarian dishes.  I'm not vegetarian but I do enjoy non-meat dishes and this place does not disappoint.  Often, it has not one, but TWO paneer dishes.  Yum!  Also, I love my own tandoori chicken, but the version here is good.  Next, the naan is frequently refilled and they aren't the sorry excuses of weird, hard bread found at other Indian buffets.  Also, the bread station has batura (fried flatbread).  I mean you're killing it, Amul. Fresh naan and batura??  Holy smokes.Lastly, I'd be remiss if I didn't mention the dessert bar with fresh chai.  Not some weird shitty black Lipton tea with \"creamer\" but properly spiced and sweetened chai accompanied with at least two types of dessert.  Basically, if you've been hesitant to try Amul or just been lazy, I'd say go there asap, especially for the lunch buffet.  You definitely won't regret it."], ["Rania L.", "This review is about how Amul Restaurant handled a problematic customer.   As I was about to step up to the buffet, so did this one customer who had been sitting nearby but had ordered off the menu.  He walked up to the buffet (probably thinking they wouldn't see him). Anyways the waiter tells him he can't do that.   And this scum bag customer says \"why\". The waiter says something about it being against the rules and policy. Then this scum bag customer starts to tell the waiter to \"do you know what policy is, do you know what rules are for?\"  I could not believe my ears!!  I wanted to turn around and give this dread locked customer a mouthful but I knew better.    This pathetic man didn't pay for the buffet and thought he deserved to eat more because he said he paid $15 for his meal and should get to eat more.  WTF!!    Who does that??  He would never have done that anywhere else, but he thought he could bully the poor Indian waiters.  The pathetic customer got what he wanted.  They let him.   He ruined my dinning experience.  Oh, and he was a short black guy with long braids eating with a group of co workers.  He was loud and unruly piece of s***Amul handled him with grace."], ["John D.", "A highly successful operation; earning yet another five-star rating.  Service is always impeccable as the proprietress oversees every detail with the eyes of a hawk and a no nonsense-demeanor.Indian food enthusiasts, we've virtually abandoned the Indian restaurants we previously frequented in favor of Amul India.  We go twice a month, on average.  It is always reassuring to see that families and couples whose origins are the Indian subcontinent heavily patronize this establishment; the inference being that these folks will not abide inauthenticity.Whatever we have ordered, it turns out to become our \"new favorite\".  A tip:  whatever you order, consider adding the Mulligatawny Soup:  it's to die for!"], ["Jenni M.", "My family and I ordered delivery tonight and from clicking confirm to opening the door, hardly 25 minutes had passed. We live about 2 miles from the establishment but we ordered during Saturday dinner hour so I'm seriously impressed! We ordered Lamb tikka masala (a little too game-y for our tastes), Chicken Jalfrezi (Level 3 is still pretty spicy! but by far, our favorite from what we ordered), Vegetable Biryani (yummm) and a good heaping of naan which was fantastic. I love, love, love Indian food. I try to find a good restaurant in whatever city I'm traveling through and I must say, it's seriously nice to have Amul so close to home. Will definitely be making this place our regular Indian spot."], ["Zeeshan S.", "This is a surprisingly good find in an unknowing strip mall! Had a few friends rave about this place so I wanted to check it out, and definitely not disappointed. $8.99 for the lunch buffet during the week which is a great price for the amount of options available. The food was very good, and notably the delicious naan was consistently reloaded on the buffet. The chicken and goat curries were also great. Wasn't a huge fan of the chicken biryani but that's a personal preference as I am whole heartedly biased from my moms own authentic homemade biryani. Overall a good Indian restaurant with pleasant decor, and I'll definitely be back here again."], ["Kaoru M.", "This place is located within a run-down strip mall off of Sawmill Rd (across from Sam's Club.) From the outside, it doesn't look that impressive. I probably would have never tried it on my own, had my coworker not made such a strong recommendation for this place for one of our work luncheons. Let's just say that I am very glad that I gave Amul India a try. Despite its lackluster exterior, the interior is modern, spacious, and clean. I've only tried their lunch buffet (which at $8.99/person is a bargain). Compared to other Indian buffets in town that I've tried (Aab, New India, Tadka, Curry n' Grill, Sher E Punjab, Taj Mahal, Banana Leaf), I would say Amul India's buffet is #1 or #2 overall in terms of quality, cleanliness, and variety of food.I'm hoping to come back sometime in the near future to try them out for dinner."], ["Waleed M.", "Perfect taste and service. The most important is that they provide HALAL GOAT AND LAMB, HIGHLY recommended we just arrived from Athens and we weren't disappointed. PERFECTION"], ["Remard C.", "I've lived in Dublin for almost 10 years now and have been searching Columbus for good Indian food and finally found it in my backyard.  Great food, great service and reasonable prices.  Not one bad thing to say about the place."], ["Rose G.", "This was the best Indian food I have ever had from a restaurant. The service was impeccable, and the spice on mine and my friends' dishes were nuanced and robust. The recipes definitely had a lot of thought go into them, on a level I've not seen from another Indian restaurant."], ["Jeremy H.", "This place is my favorite Indian restaurant in Columbus.  I feel really bad for them that big bad Walmart bought up their building and then threw them out of their old location north of 270 on Sawmill.  They used to have a fish tank with this big old Oscars living in it that my kids loved.  The owner told me they died when they tried moving them and that Walmart cost them like $50K.  Boooo Walmart boooo!Anyway, the food here is amazing.  I almost always get the lamb curry and my wife loves the chicken tikka masala.  You can order  your food to any spiciness level you like.  My wife goes for very little and I go for still a white person but spicy.  We always get the vegetable pakora too which is a great appetizer.  As for the naan, you can't go wrong with any of it, we usually get a mix of plain, garlic, and kashmiri naan which is sweet and goes well with a spicy dish.  Moving wasn't all that bad for them as the new location is a lot nicer.  Looks cleaner and more professional, has nicer bathrooms, and I think they also have a big room for banquets now too.  As nice as this place is, they don't have a problem when you bring in your messy kids...I always have to apologize but rice just ends up all over the floor every time.  Service is top notch and doesn't get much better than here."], ["John P.", "This is a review of their lunch buffet. For 9 bucks I got an honest 9 dollar meal. It certainly wasn't bad food, but it wasn't 4-5 star quality. Definitely will be back. Good value."], ["Greta H.", "Possibly the best Indian food I have ever had. I have yet to try a dish that I didn't think was amazing. One thing that really makes them stand out from the crowd is their buffet. They don't stock their buffet with a couple of dishes, they give you a huge spread, and everything is really fresh. They even have samosas in the buffet.  SAMOSAS IN THE BUFFET. Seriously, this is a big deal. I'm mostly vegetarian and appreciated how many vegetarian dishes were in the buffet, something you don't always get."], ["Heather N.", "If an unassuming exteriors is any indication of a good restaurant, this fits the bill. As I dodged pot holes to my parking spot, I pondered what I might find inside. I was pleasantly surprised to find a clean interior complete with crisp white table cloths, and minimal but tasteful Indian artwork. Service can best be describes as professional, attentive and timely. The staff provided patrons with what try needed without being intrusive. Last the food, I overheard another table ask if the food was Indian spicy or American spicy. The waiter chuckled and confirmed it was Indian spicy. With this information I opted for Medium which was perfect for my taste. I ordered the Chicken Tikka Saag, side if Naan and a Mango Lassi to wash it all down. Everything was great and I had enough for lunch the next day!"], ["Savannah C.", "So glad this place reopened! My first choice for Indian food, always. I've had something different on the menu each time I have ate there. Nothing has disappointed me so far!Service is always amazing. Food is so good id say it's orgasmic. ;) I love this place and send all I know to it. My mouth is watering as I type this and I will probably be at the lunch buffet today. If you are someone who has never had Indian food before but are curious, this is definitely the place to try. It will spoil you. :)"], ["Alexis A.", "Some of the best food, and best service I've ever gotten! I got the chicken saag and it was incredible! I like my food on the spicier side and a level 4 was just about right for me! The party I was with however likes things on the milder side, and all found the perfect dish for them! It also just so happened to be my birthday and they brought me out a fantastic dessert plate with a candle and played a birthday song for me.I would HIGHLY recommend eating here! You won't regret it!"], ["Sarfaraz J.", "I do like the VOODOO. [Indian Food]. But I do not like everyone's VOODOO.I like the AMULOODOO very #much.Will be coming again.[a bit expensive though if your going to have a drink while waiting for the food]."], ["Deepak S.", "Was surprised to see an authentic indian restaurant ... Buffet was reasonable and good to have. There was some line and waiting was needed - which was worth it."], ["Matt G.", "All I can say is that if this place just up and decided to move to Westerville I would totally help you pack.  Like, I'd drive to Dublin and help you put stuff in boxes while being careful not to break anything.  I'd even throw a couple boxes in the Thirsty Turbo Demon's trunk and drive them over.  I'd make a vain attempt to put stuff where I thought it should go in the new place and then break the boxes down so they could be recycled properly.  The offer is on the table Amul India, for you and your excellent food, helpful and courteous staff, and reasonable prices ($11.00 for the lunch buffet on Saturday.)  I ate myself into a food coma and then ate more because it's a buffet and I'm gross."], ["Ness S.", "I would give this place 5 stars for the afternoon buffet. It is really quite good with a wide variety of food choices, with an excellent selection of both vegetarian and non-vegetarian entrees. My son also really enjoyed the gulab jamuns and the jalebi in the buffet.  As someone who grew up in India, I'm generally quite disappointed with the quality of Indian cuisine in the Columbus area. And I wasn't a big fan of Amul India, having been to their previous location for dinner before either. However, there are a number of  dishes on the afternoon buffet that taste quite authentic and are delicious. I look forward to my next visit."], ["K.A. K.", "One of the best Indian places in town.  They have the best lunch buffet... wish they had dinner buffets too. Prices have gone up some recently."], ["Sriram T.", "Upgrading to four stars as the quality and taste has continued to improve. The chaat items are a big attraction in their buffet. Overall very satisfied."], ["Deanna I.", "The reviews didn't lie...the exterior isn't the best (but not the worst either), the service is extremely friendly/great & the food is awesome!!We started with the veggie samosas which were delicious. For dinner we split chicken matar and chicken tikka masala. The chicken matar was good, a little salty. However the chicken tikka masala was SO good we were using the naan to scrape every bit we could out of the bowl. Out of their scale of 1-6 for hotness we ordered both at a level 2, which have enough flavor for us and allowed an 8 yr old to eat as well. Thumbs up!"], ["Arun M.", "I visited Amul India after a 18 hours flight ride and on the auspicious day of Diwali so my review might be biased but I will be here again. It is a very nice place if you are looking for fine tasting indian food in the neighborhood. They had spice level just right in the buffet dishes. Wait staff is very nice. I enjoyed pretty much every dish they had on the buffet. Ambiance is nice and clean. One of the best in Ohio for Indian food and especially for vegetarians."], ["Tia B.", "Wow!!! I was in the Columbus area for work and in the mood for something different. I had a yearning for Indian Food and based on the recommendation of a local, I ate at this gem of a restaurant. It's located in a strip mall and when I drove up, let's just say I was a little leery. However, I was greeted by multiple people when I opened the door. The staff was friendly and attentive. The server noticed the SciFi book I was reading and we had a lively discussion about various authors. How often do I find someone as geeky as I am when it comes to science fiction?! I ordered the lentil soup and some garlic naan to start. Delicious! Light and seasoned perfectly. I can't really handle spicy so I asked for my chicken tikka masala to be mild-medium. It was perfect. Not too sweet and not too spicy. All this and I still took home over half my meal. They give you A LOT of food. On my next trip to Columbus I'm definitely visiting again."], ["Marc S.", "Wow. In my travels to various cities for my job, I always seek out Indian restaurants. This place is definitely in the top ten percent. It's run very well (waiters all in black button down long sleeve shirts) as I can tell by the many Indians in the crowd (at the end of the buffet on a Friday) that it's the pale to eat. The goat curry was excellent. Just the perfect flavor profile. The sag was very good as well. The tandoori chicken was probably one of the best I've had. Admittedly I caught a fresh batch as it east bought out, but this tandoori had a subtle crispness to it, not just the crispy charred edges. I've only encountered it done this way a handful of times and it is always my favorite. Hot tea included in the buffet for $8.99 weekdays so it is an absolute great deal. All in all one a really great Indian restaurant. Again, this is a budge review, but typically, menu dining is only better so I an imagine this place would be fabulous off the menu. Now I just hope I can finish the rest of the long drive to St. Louis after eating more than I should have. LOL"], ["Misty M.", "Not bad at all! I came here with a friend after going to the zoo. My chicken makhani was flavorful without being too spicy. They could work on the attentiveness of the servers but the food is delicious!"], ["Craig R.", "Of all the Indian restaurants I've ventured to in the central Ohio area (eight in all), this restaurant, along with Cumin's, are probably my two favorites. For a sit-down meal, I may give Cumin's a slightly better score. However, when it comes to the buffet, I'd definitely give Amul's the edge. With regard to the buffet, the food is always fresh, dishes are regularly alternated, and the price is only around $8.50 per person. That's about a dollar more than over at New India Restaurant. However, I believe the quality of food here is slightly better. The interior of this restaurant is beautiful, the service is top-notch, and waiters actually listen and take note about how \"spicy\" their patrons really want their meals if they're ordering off the menu - which seems to be a rarity anymore. If you like Indian food, I'd definitely recommend giving this place a try!*One warning, though. If you decide to dine here, I'd highly recommend you turn at the light, as opposed to the other route. If you turn at the light, you'll avoid the nasty potholes which could prove problematic to your vehicle."], ["Yassir S.", "Went there for dinner tonight for the 1st time. I'm very happy I found this place.  The food tasted authentic and service was great: fast and polite.  Will most definitely go there again."], ["Maureen O.", "the best value and variety of a Indian buffet in town. great vegetarian and non choices.baring my lunch invitation by a (white)  variation of jam master jay- I enjoyed my visit and will be back."], ["PinkJmmmm M.", "Awesome place to get good north Indian food! Love love love garlic and onion nan, super tasty and fresh!The lamb curry is good. We got fish curry as we, which is little bit too pasty and thick for me. Service was good too . And I like the ambiance there, casually formal. Overall I just love this place and I am 100% sure that I will come back!"], ["Aswinikumar A.", "Very good dinner. Their garlic tandoor roti was the best of the lot. Being a vegetarian we had a craving for their Veg biriyani which was a dud. Their Jeera pulao was very nice and the Malai Kofta tasted excellent. Not to forget about the Mango lassi, it was thick and aptly sweet. Overall a good choice for dinner but dont expect their table service to be the best."], ["Heather C.", "Don't let the location keep you from trying this place.  The inside is very well kept, service is fantastic, and the food will not disappoint!!First, the most important thing to me, service.   Amazing...every time!!!!   The staff here is super friendly, accommodating, and patient.  Always wiling to answer any questions no matter how trivial they may seem.   Giving refills well before the glasses are empty, asking if we need more rice before we are done with what we have, and even bringing kids cups and plastic silverware without being asked.  On the rare occasion a mistake or misunderstanding occurs, the staff is sincerely apologetic and goes above and beyond to correct any issues.  The staff has exceeded our expectations tremendously and they seem to be a step ahead throughout the entire visit.   Each time we go back they continue to give the same level of service or better.  Next, the food.  Their food is so customizable that I couldn't complain even if I wanted to.  No peppers, no onions, no spice, not on skewers, mild, hot, extra sauce, no cilantro, add lemon, on a skillet, in a bowl, well done, the list goes on.  They will do anything they can to bring your food out just the way you want it.   I've tried about ten things and I haven't been disappointed yet.  If you've never tried Indian food this is a great place to start.  As I mentioned, the waiters are very helpful and patient so you won't feel rushed or silly for asking questions.  Many menu items can be ordered with changes so don't be afraid to ask.  If you're a little reluctant still then just stop in for the lunch buffet or go with a few people so you can each order something different.  It will definitely be worth it!Overall...AWESOME!!!"], ["Ian T.", "Just enjoyed the buffet. Both the food and the service were amazing!! I never got less than half way through my beverage before someone was refilling it. All the food was fresh and appetizing. Anything I had questions on, someone was able to inform me. I tried things I wouldn't have considered on my own. Just so delicious. I will be back soon!!!"]], "Flavors of India": [["Neal W.", "They serve warmed pita bread as naan. Repeat: they serve warmed pita bread as naan.That alone should warrant one star.I've actually been here three times hoping to get a different result with each visit. I'm writing this review so I can look at it later and remember why I shouldn't be back.2 of the 3 times my food was cold.3 of 3 times the food just wasn't flavorful. What kind of Indian food doesn't have some kick or rich flavor to it?I have known other people to visit and get the same results. Anyway, I wouldn't recommend this place. If you're in North Market and you want Indian food order something small to help the hunger and then go visit a real Indian restaurant when you find the time."], ["Doug S.", "food is delicious definitely the best live carry that I had in Ohio,don't forget to get the bread as well it's perfect for dipping"], ["Susan R.", "Flavors of India used to be one of my favorite cheap Indian experiences.  I could always count on Flavors of India for chicken tikka, palak paneer, and chana masala.  In fact, I generally love and adore their palak paneer.  The last couple of experiences I've had there, though, have been very disappointing.On my last trip, the nail-in-the-coffin trip, I was waiting in line, the next person to be served, for more than five minutes (this is not including the rest of the time I spent in line while there were more customers ahead of us) while the guy behind the counter wiped and re-wiped the clean counter and the girl at the register chatted up the customer rather than taking her money and asking her to step over so I could be served.  I have to admit that I am that a-hole who will loudly talk about how I am not getting service to the person I am waiting with if I have to wait a ridiculous amount of time to be served, especially when the person behind the counter is doing gratuitous cleaning (I used to work food service, I know when you're just trying to avoid doing your job).  The young man (I feel so old saying that.. I'm not even thirty, damn it) behind the counter finally stepped over and asked what I wanted.  I was eating on the cheap that day and decided to go veggie--aloo gobi and palak paneer.  I skipped the naan, their naan is never fantastic.  For some reason, I decided to add mango chutney to my bounty that day, although I very rarely do so.  The transaction was over fairly quickly when they realized that they had another customer standing there.  I did not receive an apology or acknowledgement of my wait.Had the food been excellent that day--had it been, at the very least, the standard that it usually was--I would have written off the bad service.  But, my friends, I'm sorry to tell you that the food--my INDIAN food--was bland.  I don't just mean that it was not spicy; nay, it was bland.  No flavor.  I was glad that I had picked up my chutney because I needed it just to inject some life into my food.  What is generally creamy spinachy goodness was flavorless; the aloo gobi was not spicy or even seasoned properly.  I literally wanted to cry.  I had been remembering the flavors and looking forward to them, and I was seriously crushed.I would like to restart my love affair with Flavors of India, but now, I'm not sure if I can trust them.  If anybody has a spectacular experience there after this writing, please let me know!"], ["James F.", "This is one of the gems of North Market. After seeing what friends got from here on the previous days, I ventured here for lunch. A line, but a quick moving one, greeted me, and I ordered one of their chicken specials.yelp.com/biz_photos/QleS…My chicken (i don't think i got curry or masala) was tasty, but I think the sauce on their Lamb Curry is a little bit better.  Good veggies on the side as well. Delicious food for here or to go! When there's a line, they focus on getting you in and out in a jiffy."], ["Carolyn E.", "If you're in the market, exceedingly hungry, but don't want to spend a fortune, then Flavors of India isn't a bad bet; however, if you are looking for really good Indian food, I would suggest going elsewhere.   The food is not bad, but it's definitely not the best.For my visit, I gave a \"Meat sampler\" a try, getting a taste of lamb and chicken curries with some vegetables.  I went with carrots, green beans...and I believe the spiced potatoes.  All of it was decent but not exceptional.  For Indian food, I found it to be pretty bland, and not only in regards to the heat (the food was not the least bit hot-spicy).  The flavors themselves were, as a whole, very mild.  The curried meats were the highlight, having the greatest amount of flavor with a good quantity of tender meat, but again, not exceptional.  On the plus side, though, for about $11, I got a meal that I easily could have split with two, maybe even three people.  The platter completely filled a full sized Styrofoam container when combined with the rice, and I did not need to eat for the rest of the day.  The cardamom iced tea was also interesting - a typical iced tea with a hint of cardamom flavor.  I'm not sure it's something I would order again, but it is interesting, and pretty refreshing on a hot day.  Interestingly, the teas appear to be in pre-made cups that they simply pull out of a fridge when ordered.Service is fine-  it can be very hard to hear the people with the ruckus of the market, but they are polite and patient, and had no trouble using a coupon I had brought along.  Unlike some of the other places in the market, Flavors has no counter to eat that I could see, so your best bet is going to the left a few feet and up the stairs where there is plenty of space."], ["Dave H.", "Excellent food at the North Market.  So many choices ready to eat.  I had the chicken curry and palak paneer and potatoes and green beans.  What a great way to warm up on a cold December day.  Just the right amount of spice."], ["Paul F.", "I had the lamb curry, peas and carrots, and green beans and potatoes.  Everything was cooked perfectly.  The lamb and the carrots were tender and the gravy was delicious!I only have two gripes.  One, the styrafoam/plastic silverware and the fact that you can't get a smaller order.  Even with those  gripes, it's still worth four stars."], ["Angie P.", "On occasion, I like to get food at the North Market and sit upstairs in the dining area. I usually go with Flavors of India. I'm still trying to figure out what my favorite Indian place is in this city but Flavors of India is good. You get a lot for your money. The always fill up the entire to-go box--like, all the way. Each time I've ordered, though, I've had to wait another 5 minutes for them to heat up my naan. Not a problem though, because it's super hot and crispy."], ["Troy S.", "I have eaten here a few times before but this is the first time in at least 2 years.  I stopped in on Saturday around 1 for something at the North Market.  This place attracted me because the line was short and I knew I could get a low and healthy carb meal here.  I ordered the 2 Vegetable combo.  I was pleased with the serving size for $6.99.  I got the Palak Paneer and Chanamasala on Basmati Rice.  The server made sure the Chanamasala was running over onto the rice which i was thankful for.  The Chanamasala was decent but could have had more spice to it (but it is pre-made for all tastes).  Like an earlier reviewer's take on the Palak Paneer, I could have had more chunks of paneer.  I think they puree the paneer unlike other places that put chunks in it (I could be wrong and I had minuscule chunks in mine that I did not taste or see).  I did enjoy the taste.  The server was very friendly and helped with my few questions.  He was honest about the food not being all that spicy and directed away from the less spicy dishes.  He didn't seem all that impressed with the dishes he was serving especially when I asked which ones were spicy.  So at least they don't try to act like their food is spicy.  The meal did hit the spot for me even though it wasn't a great Indian meal.  It is a good place for veggies."], ["Wesley L.", "I used to adore this place.  The service was friendly and the food was good for the price.  I went back today after not having been there in a while and was very, very disappointed.I don't get mad about much, but a bad meal is on the top of my list.Flavors of India didn't give me nearly enough rice for the three vegetable combo I got, there was only one piece of paneer in my palak paneer, the vegetable korma was mostly sauce and their samosas seem to be made with phyllo dough now, are limp and shapeless and the one I got was INSANELY salty.I don't know what's saltier now.  Me or that \"samosa\" I had.  Get it under control, you guys."], ["Cea R.", "I've been going to Flavors of India for a few months now because their food is really, REALLY good. But I've noticed over the last few weeks a problem that has totally turned me off.Before I used to buy their lamb curry, but I was getting charged extra and was only getting half the serving that they normally give for their chicken, so I switched to the chicken curry.Now it seems, I'm getting jipped on the chicken side as well. The young lady behind the counter gave me 5.. yes.. 5 small cubes of chicken when I got the chicken curry and vegetable dish, which cost me $9.  The lady standing behind me in line even commented on how meager the portion was and left the line immediately after.Cutting costs has cut this customer out, and I'm sure I'll have no problems finding a new place to get my indian flavor fix."], ["barb s.", "Another long-standing fav of mine in the North Market. I wouldn't say it's the best Indian I've ever had but for fast food it is very good. Had veggie korma and the dal over rice with the requisite naan, kheer n rosewater lassi, all very yummy. The dal was a bit runny, but over rice it was perfectly passable. I've never had anything I didn't like here. I forget what the other two had but the containers were empty when we were done. We all enjoyed our food.You can also pick up chutneys, sauces, relishes and spices such as black cardamon, mustard seeds, garam masala, cumin etc...They have several types of lassis also."], ["Timothy C.", "I went to the North Market on a Monday afternoon when several of the food vendors were closed. I'm a pretty big fan of Indian food, and I wasn't craving anything else in particular.Flavors of India offered me free samples of a few of their dishes because on I was on the fence regarding what to order. I ended up with their Curry Chicken, Saag Paneer, and another vegetable side that had carrots in it. The Curry chicken had a decent kick to it but the veggie sides were nothing to write home about.Overall, they offer very good value and the food is solid. I would go to them again (after trying some other vendors at North Market I've yet to try)."], ["Jen M.", "Good flavors in the Chana Masala and Dal but certainly not the best I have had.  The North Market setup is conducive to tasting anything they have so sample till your heart's content!  Big selection of main dishes, sides, drinks, and desserts."], ["Matthew B.", "Ah, Flavors of India. It is almost a shame that this gem is tucked into the fabulous North Market, because with all the food being constantly cooked around you it can be hard to catch the scent of the wonders being prepared here.What can I say, this might by the only place I've ever gotten food from at North Market. Sad, perhaps. True, definitely. But it's something else, too: irresistible. Not because it is the best Indian food in town, as it were, but because of the value. I'm not sure there's Indian food in town that's this good at these prices.I can't say I have a favorite dish at Flavors of India because I usually wing my order, letting my mind free associate a platter of delicious food for my mouth to savor. I also can not report on how well the food might travel home; my purchases are always immediately consumed at North Market, while still as hot and fresh as possible.I have naught but praise for Flavors of India. Quick, delicious Indian food at a price you SHOULD write home about. Yes, please!"], ["Melanie B.", "Like Lisa S., I always end up at Flavors of India when I'm at North Market. Ze boy and I occasionally take a weekday lunch trip down to the Short North to indulge in Indian + Jeni's, and to say hello to the people we know at North Market. We always get the Indian food, and are usually slightly underimpressed. In fact, I remember at ComFest getting Flavors of India and deciding Never Again (haha yeah right) - for the price at ComFest, you get pretty screwed. But, the last time we were at North Market (last week) and got Flavors of India, we were both actually really impressed. Our meal was definitely four stars last week, but for all the times I've had 2-3 star food here, I can't commit to more than 3 overall. This time around, we shared the meat sampler entree - two meat dishes and four vegetable dishes. Sound like a lot? It is (even though the server wasn't convinced it was enough for two people?!), and it's more than we could finish, but the variety plus the price (11 bucks for the two of us) made it worth it. The lamb curry and the chicken dish were excellent, and the vegetarian dishes were also very good. We were both surprised - I'm not sure if it was the variety, the sharing (aww) or the particular day, but Flavors of India did it for us last time around. I'd say go here if you're looking for a quick plate of Indian or if you're in the North Market and nothing else catches your fancy - I'll be branching out next time (I'd like to try one of the delis), but Flavors of India is a pretty solid standby."], ["Sarah H.", "I am so depressed that this is the best Indian food that I have had in Columbus. granted, I haven't been looking that hard because I haven't driven 30 minutes to the closest \"good\" Indian restaurants (um, hello, public transportation please?).I was feeling cheap (as usual, I'm a grad student) so I just got the navratan (\"nine jewels\" vegetable) korma. it wasn't bad, but it wasn't really korma. no detectable cashews or raisins. however, the spices seemed well-balanced, and it was full of veggies. the naan here was okay, nothing memorable but nothing disgusting either."], ["doreen w.", "This is my idea of fast food. I went here yesterday and for $8 got two dishes (dal and spicy cabbage and peas) jasmine rice and naan and a drink!So worth it. I was also pleased to see that they switch out the foood super fast. There was about 1/3 left in the dal pan and when i ordered the server said let me get you a fresh one and switched it out!Awesome. I know the cost of everything is going up so I found this a bit surprising. Equally awesome the quality of the food considering you could call this 'street' indian. Real jasmine, really fresh and like everything else really tasty!!!!"], ["Luke T.", "Soooooo cheap! Two vegetables and rice for $5.99. You get a big heaping of each of your choices, spilling over onto the rice, served in an (unfortunately) Styrofoam to-go box.  I love the Vegetable Korma. I usually get it and then rotate between some of the other options, although the Dal is a regular winner.  Ask for a sample if you aren't sure about a selection.  Very friendly staff as well, although they can be slow to address you on occasion."], ["Jake S.", "I eaten at several vendors at North Market. Flavors of India is a middle of the pack place. Plus side, service is fast and friendly. Folks working behind the counter were very helpful and described each dish. They also pointed out which dishes were vegetarian.  Now for the food. I found the food to be a little blander than some Other Indian places. I think they might tone it down for the American palette. The lamb curry was tasty but it wasn't spicy even though it was described to me as a spicy dish. The rice was good and cooked well. I also tried a couple vegetable dishes which were decent. Portions were big but they filled the container so full that all of the dishes ran together since everything was runny. It ended up dripping out of the container all over the front of me. I didn't understand the bread. I'm pretty sure it was just cold pita bread which was disappointing. Also, the North Market doesn't have enough seating upstairs. All the tables were full so it made it difficult to eat the mess standing up. Finally, I thought the price was too high. This is just steam table food served in the style of a mall food court. In order for this place to really shine they need to at least have naan instead of pita."], ["Megan M.", "I've eaten here a few times, but the last time I was a bit disappointed. I got the masala and dal, and the two entrees came with just a baby scoop of rice. Everything was bland, which is unusual for Indian food. They needed to add some extra spices at the end, or ask me what level of spiciness I prefer, because I definitely would never order something akin to \"library paste\"."], ["Chelsea M.", "I can really only speak for the ginger lemonade- but it was tasty and refreshing. There was a huge line and people seemed to be enjoying there food."], ["Andy C.", "Great Indian food. Good prices. Workers were helpful at explaining what everything was."], ["Melanie J.", "Every time I go to the North Market I make the rounds to the restaurants and I always end up at the Flavors of India.  The food is always good--my faves are the  Chana Masala, Palak Panir (could use a few more pieces of cheese--I only got 2) and the Vegetable Korma.  There Samosas are good, but they seemed to have changed their recipe a while back and they're not as delicious as before.  I've never tried the meat dishes but they look just as good.  Everything at the North Market is fast but Flavors is lightening fast, even when the line extends to the Pastaria!  The girls that work at this restaurant are very nice.  I chose not to talk about the general unfriendliness of the owner because his food is awesome and it never stops me from eating there.  But, you would think as well as his biz is doing, he'd be a little happier?!?   Oh well.  I still recommend it.  The naan is tasty too."], ["Zack F.", "It's pretty good fast food for vegetarians at the North Market. The portions are generous if you get the combos. The bread isn't the best, but I always eat it anyway. The samosas are good though. The service can be hit or miss, but ordering is a short enough experience to make this not much of an issue. The rice is decent. I wouldn't come here just for the Indian food, but if I am already here, this is often a good choice for lunch. It is not as heavy as some Indian food and the flavors are pretty good."], ["Randy S.", "This is the best Northern Indian food I've had in Columbus. Honestly, it's darn tough for me to visit any of the other great restaurants in the North Market once I pass Flavors of India. The best options are the sampler platters that feature two, three or four items of your choice. The chana masala (mmmm, chick peas) is simply heavenly. Vegetarian items are plentiful and well-marked. Visit and enjoy!"], ["Lisa S.", "I'm guilty! Incredibly guilty! Out of all the many options available at North Market for lunch, I always end up at Flavors of India.Perhaps it's because it's the only Indian place I know of that offers \"fast food\" pricing. Maybe it's because they always offer Lamb Curry. Indeed it could be because Flavors of India seems to always have cute girls working the counter.Whatever the reason may be, I know that time after time, Flavors of India provides quality Indian food at a good price. Don't forget to add some naan to your meal!"], ["Kevin M.", "This is probably my most common choice for lunch at the North Market.  The food is tasty and already prepared, so it's quick.  Plus they have ginger lemonade, which is hella yummy despite just being lemonade with powdered ginger.Basically you can get some number of the dishes they have already prepared, which are standard Indian fare (chicken tikka masala, aloo mutter, saag paneer, dal, channamasala, curries, etc).  The more items you get, the more you pay.  You can also add naan or a samosa.  Mmm.So yeah.  Not incredibly remarkable, but reliable, quick, and tasty.  Yay."], ["Lauren A.", "I've been to this place A LOT.  I love the North Market and I like to give them my business.  I also love Indian food, so it's hard to turn down when I visit the North Market, even though it's not the best Indian food on the planet.  What I like about this place is that I can get a variety of curries as they offer a one, two or three vegetable platter.  I hate when I go to a regular Indian place and I have to commit to a gigantic helping of one dish.  At Flavors of India, I think their best veggie dishes are the palak paneer, the vegetable korma, the dal and the chana masala.  Although, I've had the palak paneer when it's been WAY over salted and at the end of the night some of the dishes start to get a skin on them.  They could also be a bit spicier and the guy that owns the place is kind of a jerk.  I've seen him talk down to the servers and he barely looks you in the eye when you get food, but he did get a cleanliness award (I saw it on the news).  So, even if he's a jerk, at least he keeps a clean kitchen!  If you need a quick fix of Indian, this will fit the bill, but don't expect perfection."], ["Emily H.", "Good Indian food.  All their food is color-coded - green labels for vegetarian entrees, red for those with meat.  There are a number of sampler platters where you can get a number of veggie dishes with rice for a reasonably low price.  My favorite is the samosa platter - a samosa, rice, and chanamasala for $5.99.  The staff is friendly, they are open every day and have no minimum for credit card charges.  Excellent!"]], "New India Restaurant": [], "Tadka Indian Restaurant": [["Ness S.", "Tadka has been around in this location for a few years now and when it first opened we tried their biryanj and I was quite disappointed. So I didn't return for a while. A pity because the food is really among the best Indian food in the Columbus area. I've been here for the afternoon buffer,which is quite good, but their regular dinner menu is much better. For appetizers, try their meat samosas. The goat rogan josh is excellent. Their bagen Bharta and palak paneer is very good as well. But what really stood out for is the service. The server was very kind and patient and helped answer all our questions. This is an excellent place for Indian food in Columbus."], ["Mirabelle L.", "Went with a group of friends. Liked the decor and the place was nice and clean. Food was delicious as well, but on the spicy side for me. Had lunch buffet but really didn't have that much capacity...will most likely return to try more!"], ["Liza V.", "Now that I've been for the buffet and ordered off the dinner menu, I feel I should give Tadka a review. It seems they've got kind of a bad rap in previous reviews. While I won't discount anyone's personal experience, I will say I'm glad we looked past the low ratings and gave Tadka a fair chance, and I think you should, too. The buffet (we came on a Sunday for lunch) is HUGE! Never have I seen a buffet with so many options. Tons of meat and veggie options, and they were constantly bringing out fresh, hot food. I didn't check out what it was that they were making to order behind the buffet line, but I'm sure it was great too, as there was always a line for it. The dinner menu is seriously overwhelming. I love having options, but sometimes, less is more. I looked the menu over for quite a while before deciding on the chicken tikka masala, which is nothing new to me. I think if they were abit more selective about what they put on the menu, I may have been a bit more adventurous. But too many choices leaves me feeling lost and overwhelmed. The food was all spectacular. We started with veggie samosas- loved them. As I said, I had the chicken tikka masala, and it was everything I would expect. Tender chicken, beautifully flavored sauce (and plenty of it to soak up with the naan). My guy ordered the goat rogan josh, and he loved it. With every bite, there was a little sound of delight. I'm sure we will dine at Tadka again when we are nearby."], ["Nicole Z.", "Best Indian food in Columbus, hands-down. We order from Tadka all the time via Grub Hub.  I have yet to encounter a dish I haven't absolutely loved.  Their portions are great (lots of leftovers), and their food is absolutely delicious.  Check out the Murgh Tikka, it's definitely my favorite.  Also the Masala Pappadam is to die for."], ["Shuo F.", "This isn't just an Indian restaurant, they also have an indo-Chinese menu, which I heard is very good (I haven't had the chance to try yet).  The decor is very nice. Upon entering, I felt like I was walking into an upscale restaurant. We had the Tadka Murgh Tikka and the Murgh Tikka Masala. Both were cooked perfectly. We aren't any Indian cuisine experts, but they tasted just right. The service isn't great though, that's why I'm not giving it 5 stars. They brought the Tadka Murgh Tikka first, it was sizzling and looked delicious but they did not give us any rice. After we asked for the rice it took the waiter more than 5 minutes to bring out the rice. The Tikka was too salty to eat without the rice. By the time the rice came out the tikka was no longer sizzling. Other than this, our dining experience was a very positive one!"], ["Zeb L.", "The best Indian food I've found in Columbus, and some of the best I've ever had (and I've tried some of the best restaurants in Portland, Montreal, and San Francisco). It's a little bit on the pricey side, but you really do get what you pay for. The food is spicy, but in that wonderful way that enhances flavor and brings it out rather than drowning it. Lastly, the service is very consistently good and very friendly. Overall, one of my favorite places to eat."], ["Neelam A.", "I threw a small get together here for new years last year and it was wonderful! The dj had great music and seating arrangement was spacious, even with a dance floor.  Not to mention the food was delicious!  I hope to get back here soon for next year's holidays.  :)"], ["Karen W.", "We used to love this place but it has gone vastly downhill. We are very familiar with Indian and Indo Chinese cuisine having traveled extensively in Asia.  The food is not nearly as good as in the past with both quality of fresh ingredients and flavor - and they don't seem to care. Samosas were over cooked with scant fillings. Dinner was very bland when starred as spicy and asking for extra spicy. The masala sauce was good but the chicken in it not so. The woman's room was filthy with dirt, broken tiles piled on the floor and rusted trash cans. Ick!! We were regulars - we are done!"], ["Tera L.", "This is one of my family's favorite restaurants! The weekend buffet is more pricey than others, but is well worth every cent! The food is authentic and delicious. Even my young children gobble it up. The service has been wonderful every time we have been there - and we have been there often!!"], ["Swetha S.", "The best chaat I had in the U.S. They have the most amazing lunch buffet ever! They have everything ranging from dosa, idly, Wada to indo-Chinese main courses. I would consider moving to Columbus just for their food"], ["Lori S.", "This place is near where I live and I've driven by a hundred times, so tonight I decided to venture in and check it out, with an eye toward Yelping about it.  It wasn't a wasted trip in that I can now advise you to seek Indian food satisfaction elsewhere.First, the hostess seemed the opposite of happy to see me.  She seated me in the adequate dining room, nothing special about it.  The menu did not inspire confidence.  First, it was so worn out that it was almost falling apart.  Second, it included an awkwardly sized menu insert (long and narrow like a sushi menu) with a whole list of Chinese and other Asian dishes.  Huh.  It's a danger sign when a restaurant feels the need to branch out from its supposed specialty into other kinds of cuisine - usually it's a desperate move to lure customers or cash in on local trends.  But a restaurant that tries to do too many things will end up doing none of them well.  I was certainly not going to order Chinese food in what was supposedly an Indian restaurant.For most cuisines, there are certain menu items that serve as canaries in coalmines.  They're benchmarks for basic competence in whatever food the restaurant is serving.  A Japanese restaurant that doesn't make good miso soup or a steakhouse without a killer filet must be looked at askance.  I may grade restaurants like this one harshly because I adore Indian food, and we have a number of really good Indian restaurants in Columbus so we are not dying on the vine for want of vindaloo.  So when the papadum arrived and it was almost inedibly salty, my heart sank.  If an Indian restaurant can't even manage decent papadum, you're in for it.I ordered chicken korma and garlic naan.  Pretty standard stuff.  I had a glass of the house pinot noir, which was...well, it was a $5 glass of wine.  When my food arrived, one look at the rice was telling.  One of my favorite things about Indian food is the rice.  That fragrant, separated, tender basmati rice.  This rice was undercooked even to visual inspection, and it was sticking together a bit.  The korma was weirdly pale in color and had sliced almonds on it...okay.  The naan was doughy, too floury and oddly tasteless for being garlic naan.  Again, if an Indian restaurant can't even make good naan, it's a \"look at your life, look at your choices\" moment.  I couldn't help but remember the episode of West Wing when post-heart-attack Leo McGarry is finally coaxed into eating by his Indian nurse's homemade naan.  This naan could barely have enticed a ravenous linebacker.The korma itself wasn't horrible, but it was oddly sweet with no tang or kick.  It'll reheat tolerably for a lunch.Then, I decided to let them have a crack at making me some rasmalai.  Now, you must understand, that rasmalai is one of my favorite things in the whole entire universe.  When it came, I ate it.  But it didn't make me happy.  Good rasmalai should be tender but firm, sweet but light, and the milk should be light and flavorful.  This rasmalai was mealy and dense, and the milk was gooey.It wasn't expensive, anyway.  For a glass of wine, naan, korma and rasmalai I paid $26.  But I can't recommend the food, nor the service.  When I first sat down the waiters couldn't get it together on whether I'd gotten drinks and they tried to ask for my food order before I'd opened the menu.  After getting my food, my waiter did not reappear for ages, and when he finally did, he admitted he'd forgotten about me.If you want good Indian food, head up the road to Amul India, where the naan is to die for, or better yet, head across town to Cafe Udipi, where the service and ambiance isn't so great but the food is divinity itself.  Their rasmalai haunts my dreams."], ["Muralidhar S.", "They claim to be a buffet and every dish out there is empty and nothing is refilled. Even after repeated follow ups they don't refill the dishes! The waiters are rude to the core and they hardly care!!! don't even to dare to try this place."], ["Rami M.", "Tadka has a pretty nice dining area and huge menu variety, which includes a wide array of Indian and Chinese dishes. I opted to go with Indian and ordered the Murgh Makhani (aka butter chicken). The sauce was great, but the chicken tasted old and not good/fresh. I was expecting better, considering how nice the place seemed. I've definitely had tastier Indian cuisine in Columbus. I tried my friends' Chinese dishes and they were pretty good. The service was prompt and friendly."], ["Kim C.", "Good portions but I think something is missing as far as flavor goes. Service was not great either. Had the chicken tikka, tandoori chicken and paneer."], ["Kaoru M.", "Dined here tonight at the recommendation of an Indian coworker. We were not disappointed.To date, my favorite Indian restaurant in Columbus has been Aab in Grandview, but Tadka is now up there among my favorites.The interior is clean, modern, and somewhat upscale. As far as Indian restaurants go, it's a pretty nice building. The now defunct Bay Leaf in Polaris was prettier inside though. The server was very polite and on top of things. The hostess at the entrance wasn't very friendly, so I agree with what some of the other reviews have said.A common problem that I encounter at Indian restaurants in general is that they tend to have the slowest water refill. This can ruin the dining experience considering how spicy their dishes can be! Tadka was the first Indian restaurant that I've been to where they actually leave a pitcher of water at the table for you. This helps soooo much!We had their vegetarian starter platter (samosa, veggie pakora, and a few other things), the murgh (chicken) tikka masala, and lamb biryani. They were all delicious, and the volume was impressive. You probably get 30% more food here compared to Aab. We were also pleasantly surprised to get a complementary plate of papadams. That's a first for me at an Indian restaurant, both in the US and in England.As we couldn't finish our meal (due to the volume), we have take home boxes full of delicious Indian food to look forward to for tomorrow. We'll definitely be back!"], ["Muneer A.", "Worst food ever. Very expensive bread. The chicken pakora was not at all properly cooked. It was almost raw from inside. Paneer korma is tasteless. They need to add more taste to the food. The only good thing thing about the restaurant is that their meat is halal. Would not recommend to anybody."], ["Farid S.", "Despite all efforts to convince a few friends to go to a different Indian restaurant, we ended up at this place once again.  This time it was for Sunday brunch.  As before there is a lack of good service at this place.  The waiters/waitresses seem so disorganized and not properly managed that its difficult to expect adequate service.  The food mediocre at best.  The silverware continues to be dirty.  I can't imagine how dirty the kitchen maybe."], ["Erich H.", "Chicken. Tikka. Masala. The bomb.Nice atmosphere too and amazing service.The menu is extremely diverse too, but you probably only want to order the aforementioned chicken Tikka masala because it is heaven.Also: order garlic naan to dip into it."], ["Matt W.", "Have just been getting into Indian food- I have been here twice and both times I had outstanding meals. Will continue to eat here. Recommended for anyone that likes Indian food. A tip: they consistently have groupons available."], ["Amruta D.", "Personally think this is the best Indian restaurant in Columbus, their weekend buffet is awesome, they have both north indian and south indian cuisines along with street foods, so you can pretty much try everything, their service and quality of food has been decently consistent."]], "Layla's Kitchen": [["Ashley F.", "The Best Indian place in Columbus is on Cleveland Ave?! It's a mirage that turns out to be real.  Eat here,  anything. The veggie pakoras are awesome, the curries, Jalfrezi. Everything is fresh and fast. Its better than all those overpriced Indian places. Can't believe we didn't try it sooner.  I didn't feel like crap afterward even w/ eating extra, its so wholesome."], ["Tae D.", "The food delivers to where we live, which is amazing because a lot of places don't. In addition, the food remains consistently delicious. My friends and I often order from here because of the taste AND delivery feature. Now time to order another dish, some nan, and sambusas."], ["Matt W.", "After moving into the Forest Park neighborhood, we were driving around when we noticed Layla's, and most importantly the magic word \"DELIVERY\". A little bit of googling when we got home lead to their website and menu, and an hour later we were enjoying an awesome meal in the comfort of our new home. The goat vindaloo and chicken korma were fantastic, and we really enjoyed the flavor of their kebab - my wife claimed it's one of the best she's had since moving back from the UK.If their delivery was that good, I can't wait to dine in!"], ["Tabitha F.", "Oh myyyy goodness! This place is ah-mazing!So, my son and I were in the area.....yelped a \"nearby bomb ass spot to stop in and fill our bellies\" and Yelp told us that this was the spot to be. Thanks Yelp! This place is what's up!!!First off, don't let the awkward location deter you. The people, are so nice!!! Attentive. We were waiting for our food to come out and they cane over and said, \"hey - would you sample some food and give us feedback?\" We were like, \"hell yea.\" It was soooo good!Between us, we ordered lamb sheesh kabobs, chicken & corn soup, naan, chai, rice pudding and chicken tiki masala. All of it was incredible. The most popular Indian spot around these parts is Aab - which I love, but this place......10x better!!!!I can't wait to come back here...cause, you bet your sweet ass, I will be back to enjoy this sweet spot of Columbus!!!"], ["Antonio T.", "One of my co-workers an I have a burgeoning tradition where we try to have lunch every Sunday after work at someplace new. After reading the rave reviews, we decided to try Layla's. Now my co-worker was VERY leery on Indian food after having a bad experience a few years back but, we decided we'd give it a shot. Now, the food is indeed good, but I must say it's not the best Indian that I've had in Columbus, that goes to New India in Dublin. The portions were just a little small for me and the food could've been seasoned SLIGHTLY better than it was. Now, that's not to serve as a knock for a casual Indian fan but, I've eaten at some REALLY good Indian places and they've all had that in common. I ordered the chicken jalfrezi w/garlic naan and a meat sambusa. $15?!? For the portion size, I could've seen about $10-$12. Other than the portion size and SOME of the flavor, it's not a bad spot. I've heard that a lot of thngs have been in that location so you might wanna check it out before it's gone......."], ["Jeffrey S.", "Layla's Kitchen is a wonderful, small restaurant serving up excellent, flavorful Indian cuisine . The lamb vindaloo and chicken tikka was fabulous. Our waitress was kind, courteous, and prompt. Great experience! Love this place!"], ["April W.", "My first time having been and I will definitely become a regular.  I ordered the vegetable curry which comes with rice and it was fabulous. .zucchini,  cauliflower,  carrots, peppers, onions, potatoes smothered in curry and spices which literally made my mouth feel like I was eating the earth. It tasted so fresh and healthy, I was grinning from ear to ear.  Some people cannot tolerate curry but I absolutely love it!The rice was also very tasty,  even by itself. You have the option to let the chef know if you like it spicy or not and they prepare accordingly.I also ordered a cup of the vegetable soup extra spicy and man....it was the BEST vegetable soup I have ever had. So tastefu, so fresh and so natural..that's why I love Indian food.  I could tell it was prepared with love! I took a masala tea to go and requested them to prepare it with the amount of sugar they would do for themselves..The tea was amazing.The staff were tremendously friendly and very helpful answering my questions and helping me with suggestions.  This joint even has a drive through! The dining area isn't incredibly huge but is enough space for a few families at dinner. Extremely clean inside.This place has recently opened and I will definitely be a regular here. Winter is on its way and that vegetable soup will be calling my  name. Located right off Cleveland ave about middle of cleveland ave between Morse road and 161.The price is more than fair and extremely generous portions.  This is my new favorite place!"], ["Jamie S.", "Delicious food! Friendly staff! Very clean environment! Would recommend to anyone who loves Indian food!"], ["Brianna M.", "I came here on the recommendation of my friend. I was lamenting the lack of options for inexpensive Indian food in Columbus. We have a lot of great more expensive Indian restaurants, but not a lot in the way of take out. My coworker and I came here for lunch this week and had an awesome experience. I ordered chicken korma, garlic naan and a veggie samosa. First of all, the naan was warm, crispy/fluffy and delicious. We got four big slices in an order, pretty generous. The food comes at a very basic mild and you have to ask for a specific spice level. We got take out for our friend who said she wanted it \"spicy but not SPICY\" still said it was super spicy! I ordered my korma very mild since it was lunch time and I didn't want to deal with heartburn later. The food arrived quickly and was super fresh. I was happy to see that just because it had a bit more of a take out nature that the sauces were still delicious and not oily/low quality. There's no lunch portion, so I took home some leftovers. The building looks humble, but  you can tell that the staff put a lot of energy into remodling it. There was brand new floors and fancy digital menu boards. The staff was friendly and helpful!  I'll definitely put this on my regular roation of lunch places!"], ["J J.", "This was the first time I've actually ever tried Indian cuisine. I ordered shrimp tikka masala, a beef sambusa, and garlic naan. It was absolutely delicious. I highly recommend Layla's! I will be back again for sure."], ["John M.", "Everything was amazing, see pictures. I need to come back a couple more times to get my words together because Layla's deserves a well written review but in the mean time, Layla's is a must try. I will be be coming back."], ["Jeff L.", "I have had indian food all over the us and this place is awesome!  I had veg sambusa very tasty good hear big. Portion.  I also had chicken vindaloo very very hot and it was awesome!  Very tasty savory even w the scorching heat.  Great portion for price.  Chicken was a little skimpy but not bad.  This is a small place but big flavor and great service.  Try it out!  Very fresh food quality!"], ["Annie P.", "As good as everyone is saying; the tandoori chicken was the bomb.  Don't let the sketchy location keep you from discovering this gem."], ["Francis P.", "This is now my favorite Indian cuisine restaurant. Consistently good from appetizers to main course. Desserts are delicious as well. The Chicken korma and goat bhuna are my favorites coupled with the garlic naan and fresh basmati."], ["Donna K.", "We're lucky enough to live in the area, but hadn't seen Layla's Kitchen before noticing it on yelp.  We figured we had to check out a place where all the ratings were 5's.  With 2 small children we were unsure how things would go, but I love Indian food so we took a chance.  I'm glad we did.  The food was delicious!  So flavorful and colorful.  It was not spicy by any means, which may have been more of a disappointment if the food hadn't been so good.With great prices and generous portions, we'll definitely be coming back soon!  The staff was also very friendly, and genuinely cared about what we thought."], ["Jen M.", "Super good! Maybe the best Indian food I've had in Columbus. The palak paneer actually tastes like spinach, not like canned or over-creamed frozen spinach. Layla's Kitchen sautees the paneer so that it's just a wee bit crispy, not all limp and sad.The Chicken Tikka Masala also tasted remarkably real: that chicken was a chicken breast in the very recent past, and the sauce had a deep, rich, vibrant tomato taste. Even the jasmine rice was thoughtfully prepared! I was too busy shoveling it in my mouth to see if that orange stuff in the rice was very thin rice-sized carrot shavings or something else like saffron. But whatever it was, it tasted great. The garlic naan was also yummy and fresh.(EDIT to add: I went back on 9/14, and this time, I added the biryani, veggie samosas, and ground beef curry to my order. Those were awesome too. The biryani portion was *enormous*, much bigger than the orders on other dishes. Maybe that's because it's got so mcuh rice in it, so instead of serving you separate portions of rice + your entree, which is how most of the menu gets served, the mega-sized biryani is actually rice + entree in one.)The only \"miss\" in my order was the ground Beef/Lamb Kebab. It was dry in texture, but the sauteed vegetables that came with it were yummy. I'm looking forward to branching out to the biryani, samosas, goat curry, etc. on future visits (yeah, you know it's good when you're already planning for next time.)Someone else here on Yelp seemed miffed about portion size, but I was fine with the portions. Many Indian restaurants in town serve $12-$14 portions, and it's not really fair to compare a $14 entree to Layla's $9 entree. The entree size at Layla's is little more on par with how much food you'd get at a fast-casual restaurant like Chipotle or Panera: a generous portion for one person but probably not enough to feed two people. My husband and I split the chicken tikka masala + palak paneer + kebab and a single order of garlic naan, and that was a huuuge meal for both of us. I was sorry-not-sorry when we had eaten all the Chicken Tikka Masala and still had ample sauce left over to pour on the rice. Extra sauce is a gravy feature, literally, given that we'd only bought $9 worth of chicken.The setting looks sort of like a fast-food restaurant, but it's a very tidy little place. Picture a counter with a classy-looking iPad + credit card swiper, a hot case of samosas, a big hopper of mango lassi, and an LED menu screen projecting the menu behind the cashier's head. There's enough seating for maybe 25-30 people in the whole place, so it's not huge.As others have mentioned, the owner is a super nice, youngish guy who gives great customer service. I look forward to going back."], ["Timothy W.", "Food was superb. Just wonderful. Very affordable at 8-11 per plate.  Generous portions. Very plain ambiance, but SUPER clean. Look no further for a place to eat."], ["Una K.", "A friend recommended  Layla's a while back but we had not been there yet. We went down to the north market for Indian and couldn't get it to the parking lot  so we left hungry. On the way back to westerville  I told my husband about Layla's  and we decided to try it. Great choice. I had the goat curry and he had Kadai Paneer. Very good and pay attention to the heat level you get what you ask for.  Clean fast and attentive.  I would have given it 5 stars but the goat was a little tough. I make curry goat and it should be falling off the bone. The Naan was excellent.  We will be back. Probably the best Indian food in c-bus."], ["John L.", "This has got to be one of the best all around experiences I have had in a long time. I decided to ry this place for lunch today as my second Indian experience ever. The first left a lot to be desired but this one made top 5 overall restaurants in Columbus. I walked in and was unsure what to do because of my lack of Indian food knowledge. The menu has options without being overwhelming and has some pictures. I decided to go with the Chicken Tikka Masala because I had heard it before. I got a mango juice and Masala Chai tea as well and he told me if I wanted to sit he would bring it shortly. I sat down and he brought me a small plate with a crunchy bread like item on it. I tried it and it was very good. A few mins later he brought out my main course. The main course was so huge that it comes out on 3 plates/bowls. The actual Masala was in one, a bowl of rice in another, and a plate of naan. He brought out a separate plate to combine it and eat on. I tried it a couple ways and it was all delicious so I put it all on my plate and dug in. So good. It was just another gentleman and I in the dining area but the owner stayed around and told us about how he got his recipes from his mom and the difference that America is from home. I finished everything and wrapped up and told him how good the food was and headed out. It was nice dining experience with great food and service but I made it to work with 10 mins to spare on my hour lunch. Yu could totally do carryout and be back in 30. I suggest that if you have time that you get the Chai tea as a desert. It def had cinnamon in it and was so good to sit, relax, and sip your tea and you digest. A couple notes:I got all of this for 12.00Even though the owner is from another country his English is great. They open at 9 for breakfast and their breakfast menu has BBQ chicken Samosa as an item. Who doesn't want BBQ chicken for breakfast?Thus place may not look like a 5 star restaurant when you are flying by on Cleveland but it is a must stop."], ["Steven H.", "Really excellent indian food. Ordered it spicy and actually got spicy. Highly recommended!"], ["T C.", "having explored most Indian food places, on moving back to Columbus after being away in Texas for 4 years, it was a pure accident that my wife saw some online pointers to this restaurant. Cleveland Avenue is not a great place in C'Bus...yet, the food served in this tiny neat shack, is worth exploring. They have a drive thru and allows you to call ahead. It will be no exaggeration to insist that this is the best Indian food that i have had so far in Columbus. Their prices are also much lower than most other places. They also package the take orders real well. Today we were served by Kimberly, a very pleasant hostess who loves what she does and takes the time and effort to explain foods to new diners. i thought she did an awesome job. It is not so easy to explain Indian food to some guests who have never tried it, and more so a great challenge for someone unless they know well enough about the cuisine. I was tempted to overhear as she skilfully went about her job with great patience and conviction. I think this is a great piece in promoting Indian Cuisine! Great food...impeccable service!"], ["YellowTurtle A.", "I've eaten here a few times now and I can say with certainty that this is, by far, my favorite Indian restaurant in Columbus, OH.  In fact, this restaurant reminds me of a similar style restaurant in Arlington, VA (Ravi Kabob) -- people who've had Ravi Kabob know what I am talking about- simple menu, great food.  Layla's is much cleaner than Ravi however, with better (and friendlier) service.  Although small, the restaurant is attractive with tiled decorations, lots of windows and tables that don't wobble.  The menu is simple but the combination of quality and authenticity of the food is perfect.  Given the quality and quantity of the food, the price range is a bargain.        Below is a list of items I've tried at Layla's that I highly recommend.  My favorite is the chicken biryani.  I don't remember having better biryani, maybe because I forgot what it was like to go eat in those big cities, or maybe, because it is the best biryani I've ever tried.  You be the judge, but definitely try it.  It is authentic and made right.  Other dishes that I've tried:Tandoori chicken (I've only tried the boneless) - 5 out of 5Beef Kabobs - 4.5 out of 5Beef Samosas (pastry fried in oil) - 5 out of 5Chicken Biryani 6 out of 5Rice pudding  4.5 out of 5"], ["Isabel S.", "Clean establishment. Cleveland Ave is kinda scary though! Staff is extremely nice and helpful"], ["Daric K.", "I have had curry goat all around Columbus and I have to say Layla's is the best i have had HANDS DOWN. The garlic naan(bread) is the best i have ever had. This is a hidden gem in Columbus and you owe it to yourself to give this place a try. Big FOOD AND BIG FLAVOR. See Lee and he will get u together."], ["Francis P.", "Reasonably priced ,excellent tasting Authentic Indian cuisine. I will be coming back as often as possible. The surrounding Indian Restaurants better be warned, Layla's is here and will continue to be The Indian restaurant to go dine in or to carry out. So far I've had the chic korma, chic mahkni, goat korma, goat bhuna, vegetable samosa, tandoori chicken, garlic naan, beef sambusa and the Gulab Jamun for dessert and they were all excellent. Delicious!!!"], ["Rob L.", "Okay I LOVE Indian food, but always hated how there were no good places by my work for lunch. This place opened though and I didn't pay much attention given the area and sometimes Cleveland avenue pop up restaurants are questionable in cleanliness and quality. However I tried this place today and LOVED IT. This is probably tied with Aab as my favorite Indian in the city after 1 dish. I ordered the Chicken Makhni and said \"make it the spiciest\"; and they did not disappoint. I was sweating while eating it and it was amazing. Spicier than what pretty much any other Indian dish I order \"extra spicy\" is made. Portion size is enough for 2 meals for me personally and it's a good $2-5 cheaper than most Indian options. Also tried the Garlic Naan and found it extra garlic-y which I prefer. The inside is super clean and renovated and like a nice clean Panera/Chipotle looking interior (again not something you expect in this area.) Highly recommended"], ["Kimberly W.", "My friend moved in next to this place and after helping her paint she offered to buy lunch, neither one of us had ever had Indian food. We were going to simply go for subway when we on the way to the car spotted Layla's and took the opportunity to grab lunch there and try Indian food together. We were welcomed by the staff and were helped in trying to understand the menu as well as the flavor blends. Both me and my friend ordered the chicken tikka masala  and we loved it! Needless to say we've found a new favorite place to have lunch!"], ["Jodie L.", "Great food!!  Good price and Lee is super nice.  We took a nice walk there from our house.  We will be back for sure!"], ["Andrew A.", "I was in columbus for work and had a craving for something delicious! Where is the best place to stop? Here of course! Truly amazing quality food. I will be recommending all of my coworkers at tesla come to this place while in town! If I'm ever vack here in ohio I will surely be stopping by!"], ["Ryan L.", "Really good food and really great customer service I love that this restaurant has come to our neighborhood and love supporting a locally owned business. Definitely try the wrap, the samosas are amazing, love the korma, garlic naan, and the chai is better and unlike anything you've ever had."], ["Jackie V.", "All my husband could say while eating: \"This is amazing!\" And I couldn't agree more. I was excited to see an Indian restaurant move into an empty restaurant building in our neighborhood. But now I am beyond excited to have such a delicious and friendly restaurant right around the corner. The food is the best Indian food we have had in Columbus, hands down. And the service was fantastic too!We were greeted right away by Lee, the friendly and energetic guy that the other reviewers referred to. We sat and waited in the small but clean dining area while he calmly dealt with an unruly customer who was trying to argue his way out of his bill. After the customer left, Lee apologized for the situation and the wait and offered to explain the menu to us. While we decided on our meals, he gave us a cup of masala chai tea - so delicious and addictive! It made me want it to be fall or winter, so I could warm up with many cups of this tea. I love chai, and this was the best I've had. We ordered the paneer tikka masala, aloo palak, mango juice to drink, and some naan to share, all for about $20. The paneer was clearly made in house, and the sauces were flavorful, and not oily or greasy. The spices were exactly right and made my taste buds dance. The portion sizes were perfect, quite a meal for the bargain price. My favorite part was the little fried onions that garnished the rice - so yummy! As fantastic as the food was, let's not forget about the wonderful service. Lee came and checked on on us a few times to make sure we had all we needed. He really goes above and beyond to make his customers feel comfortable and happy, and it is much appreciated. I just finished my dinner and am so full, but I'm already planning my next trip to Layla's Kitchen!"], ["Leah B.", "Great food with friendly & helpful service!We were immediately greeted by an energetic & kind young man. He was so patient & helpful answering our questions & explaining menu items. We went just after 3pm & their kitchen was closed but they still had plenty to choose from. He said the full menu was not available from 3pm-5pm. That was just fine because this led us to try the delicious Chicken Tikka Masala. It was amazing. The seasoned rice was flavorful & beautifully prepared. The Naan was fresh & delicious. The Tikka Masala was simply delectable. The sauce is velvety & rich with the chicken that is so tender. The portion size was generous. All three samosas were tasty & well seasoned. The green sauce for the samosas was amazing too.You must try the Chai Masala Tea - it was spicy, sweet, & delicious.  The spices are freshly ground every morning. I could drink that all day.We can't wait to try more menu items. Please do yourself a favor & try this cute little restaurant."], ["Kate T.", "Fantastic service and some of the best Indian food I've ever had. Got the chicken tikka masala along with naan. The chai tea was amazing and unique, too. Will definitely come back again!!"], ["Gina K.", "My husband and I had a rare night without the kids and decided to go out for dinner. We were in the mood for some Indian food but not in the mood for the high price tag of our usual restaurant. I came here to Yelp to read some reviews and this place was highly rated and not too far from home. This restaurant is simple and unassuming but spotlessly clean and tastefully and attractively remodeled. And the food: Wow!  This may become our go-to Indian spot. The food was excellent, the meal was inexpensive, the portions were generous, and the people working there were amazingly friendly and genuinely interested in making sure we were happy with our meal. If you like Indian food, you will love this place!"], ["Fred M.", "This restaurant is a waste of space. I ordered my dish \"very hot\" and it had no flavor at all. The good reviews on here for this restaurant are either fake or from people who don't know a thing about Indian food. Then again, people think that nasty Aladdin's is good Middle Eastern food, so who knows.The cuisine at Layla's is extremely bland. Besides my Paneer Tikki Masala being extremely mild when I asked for \"very hot\" it had no hint of spice and barely a taste. I also ordered a somosa which was just okay at best. Furthermore, for almost  $16.00 I barely got filled up. I really should have sent the order back but I doubt it would have come out right anyway as I believe the cook has no clue on how to make food from the Indian Subcontinent. If you like real Indian food look elsewhere. I'll never return to this establishment to eat psuedo-Indian cuisine."], ["Jamell D.", "Excellent customer service and great Indian and Somali dishes to choose from. I stop in at least once a week to get a chicken Kabab Roll and a Chai tea."], ["Dan S.", "I got food to go from here and it was amazing.  I ordered Chicken Tikka Massala, Chicken Biryani and the Garlic Naan.  The Sauce in the Tikka Massala was thick and rich with cream and flavor.  It was not quite as spicy as I had hoped for but was still very enjoyable, and the several large chucks of chicken were tender.  They do take requests on heat preference so next time I'll ask them to kick it up more.  Then there was the Biryani which was completely satisfying, both in heat level and flavor.  This is a rice dish packed with spice, and the chicken buried underneath is very good.  The gentleman who took my order was very friendly and answered any of my questions and seemed very patient and eager to share information about the dishes.  Regarding portion size, for me the 2 entrees with Garlic Naan was plenty of food for 2.  The people who were seated there and eating in the restaurant appeared to be very satisfied and I overheard several compliments directed toward the staff. I will be happy to return and try some more items."], ["Liz B.", "Today was my second time and last time ordering food from Layla's. I have explored various ethnic styles of food, and Indian food is my favorite, being that my family is west Indian, and I grew up eating a lot of Indian style foods. The food from Layla's is a bit over priced when compared to the other quality cuisine restaurants that are in the same area. The food portions are quite small, and the taste seems to be bland no matter what I have ordered from the menu. Today. I ordered the chicken tikka masala and another dish for my two kiddos. I found my chicken tikka masala to be more lonely on the chicken side. There was a bunch of sauce and a minute amount of chicken in the bowl. My little girl enjoyed her meal, I believe, but my son had a hard time with his food. An hour after eating his food, he threw up the food twice. I already was somewhat disappointed with the food, but my son's reaction to the meal sealed my choice. LAYLA'S KITCHEN is now off of the menu for my family. We are use to ordering Somali style food from a new restaurant in the same area. The chicken and rice from the Somali restaurant makes the chicken masala from Layla's seem so bland and impotent. My spouse said this the first time we ordered food from Layla's. I rejected the notion because I love Indian food and I wanted to give the new establishment a fair chance. This time, I think my spouse was right. Layla's will need to do better if they wish to avoid the same fate as the previous restaurant owner who once occupied that very same lot. (Acme Hot Dog)"], ["Dorothy L.", "We LOVE this place. Don't miss the garlic naan....and so many other delicious menu items."], ["Nicole C.", "Food was absolutely amazing. Some of the best Indian food I've ever had. The chicken Korma I had was so flavorful. If you like spice make sure you ask for your dish spicy and if you don't like it spicy it doesn't come spicy."], ["Doug B.", "I need to say this before I get into reviewing Layla's Kitchen. Typically, I don't post reviews without going to a restaurant twice. The only exceptions are 1) The place just blows my socks off it's so good, or 2) The food tastes like the aforementioned socks. Been to Layla's twice, they should be glad the second experience wasn't the first.First time, with my usual dining companion, was good. Not great, but very good... easily 4-stars. We shared aloo palak (potatoes and spinach) and goat biryani. The naan was good, fresh, and the chai tea was very good. We dined at the restaurant, which was very clean and we were attended to by a very enthusiastic gentleman who was exceptionally attentive and did everything to ensure our visit was top notch. All in all, a very enjoyable and tasty dining experience.Now comes the second visit, again, with my usual companion. This time it was carry-out and there were two things that were the same as the first one. The gentleman behind the counter was awesome, as was the tea. The food was a huge disappointment, though. I got the chicken tikka masala and it would be better described as tikka masala broth w/chicken. It was like soup. I've never eaten this dish prepared the way they do it. First off, it was overly spiced but can't put my finger on it, maybe it was the paprika but it was just toooooo much and it was, at times, overpowering. The oddest part was the soupy broth. I say soupy broth because that's what it was. It should be a sauce that coats the chicken with some remaining portion to flavor the rice. (btw, their rice is very good) What I got was a container of paprika/cayenne soup with very little chicken drowning at the bottom of a carry-out container. I got a $5.99 meal for $8.99. Regardless of price, I am not a fan of their version of this classic dish.The other entree was goat curry. Let's just say I'm glad I ordered the chicken tikka masala. The goat curry wasn't good. I don't know what hard scrabble, weed infested patch of land was home to the geriatric billy goat who gave his life for this dish, but he shouldn't have been butchered for human consumption. Goat is different, I get that, but I've eaten goat many times and this goat tasted like an untended barnyard. Goats will and do eat anything they can get their mouths on, so it is important to know the source. This particular goat was not well sourced. It was grisly, fatty, and overall awful. If we had dined in, it would have been sent back. As if that wasn't enough, the rice pudding was sour. Sour. Not sure how rice pudding is sour and not really sure I want to know. One taste and into the trash it went.Honestly, it bothers me to write this review because I want to love this place. I'm gonna give them another chance, based on my first visit, but there's a very good chance I'll be dining alone the next time. Third times a charm, they say. I really hope so."], ["Bryan A.", "Looking for a good Indian restaurant with friendly staff and great food?  Interested in one such restaurant that also has amazing tea and quick pick up on \"To Go\" orders?  Looking not to spend a ton of money on good ethnic food just because it is good ethnic food?  Then Layla's is the place!  The food is well priced and delicious.  The menu is somewhat small, but in a good way.  The food they offer they do quite well, and it has only been open for about month.  The owner who happened to greet and serve us is perhaps the nicest person I have met in the restaurant business in some time, only adding to the experience.  Is is a big fancy restaurant decorated Bollywood style?  No, it isn't, but it doesn't have to be.  I will take a hole in the wall restaurant that delivers an amazing experience and great food...just like Layla's Kitchen."], ["Tina B.", "I drive by this place all the time as I live just 2 streets over and finally decided to stop in tonight and give it a try...I'M GLAD I DID!! I've never had Indian food before other than store bought naan (store bought is nothing compared to authentic, by the way). When I walked in, I was immediately greeted and welcomed by a young man at the counter, (the owner, I believe), when I told him that I was new to this type of food and asked what he recommended, he was very happy to explain what Chicken Tikka Masala is and suggested that. I got an order of that and naan bread.  The flavor was AMAZING..I couldn't stop eating it!! Even after I knew i had enough, I kept eating...it truly is THAT good...and I still have some left..so portion size is also amazing.  The naan was amazing as well. They even asked me to call and let them know what I thought...NO restaurant I've ever been to has requested that...NONE!!!  These folks at Laylas Kitchen are wonderful...very nice, courteous, takes the time to answer your questions...he even brought me a cup of their house made Chai to sample, which was OUTRAGEOUSLY delicious and addicting..I could drink that all day!!! I will definately go back...and often.  Do yourself a favor and stop by, you won't be disappointed!!!"], ["Tana L.", "I wasn't sure about going to this place, but it turned out to be the most wonderful experience!  They are new - but passionate about their enterprise!  The menu is simple, but better that way - every single item that we ordered was magnificent!  My mom isn't into much spice... she had the Chicken Korma and thought it was delightful.  I had the Goat Curry (which does have bones) - but the meat was perfectly cooked and the sauce was perfect!  They only have plain naan bread (I usually get garlic naan), but even that turned out to be genuinely fresh and surprisingly nice tasting.  We tried out a Chicken Triangle - which was so good we didn't even realize there was a sauce until after we ate it.  Lee, who runs the joint, is SO kind. The restaurant is in dedication to his mother.  Excellent customer service.  Gave me a sample of the Chai Tea (which doesn't have any milk- not like Starbucks) but it was SURPRISINGLY good... good enough that after leaving with my carryout I drove back up to the drive through window to get two to-go cups of the tea for my mom and me.  After this experience, there is nowhere else in Columbus that I would rather go for Indian food; which is a Massive compliment to this place (I am a pretty picky gal)!  Two thumbs up!"]], "New Taj Mahal": []}