{"Lashish the Greek": [["Seesh F.", "I was really looking forward to eating here after a 14 day gyro/tabbouleh craving and seeing the reviews on Yelp. I was disappointed. The chicken was good but everything about the gyro was bland. The tabbouleh was extremely oily and had none of the zest it should have had. I doubt I'll choose this place again. There are much better options around the area."], ["S C.", "YES! Authentic, and the owner is such a great guy - he makes you feel right at home.The place is small - so getting a table especially for a larger party may be a challenge. My teenagers loved it too!In our party of four we had a good variety of food and it was all incredible!"], ["Raychel H.", "I had the chicken gyro, and it was good, but felt like it was missing something to make it memorable.  The Pita was nice and warm and fresh, but the chicken tasted a bit bland.  Good, but nothing great."], ["Andrew B.", "Tasty gyros, good size. The $6 takeout combos are a great deal. Only negative is that the fries aren't super great. With crispier, less greasy fries this would be five stars."], ["Marilyn M.", "My husband and I were in Columbus for the day and I really wanted some authentic food.  I was not disappointed!   The food was awesome.  The best food I've had in along time. The prices were reasonable and the portions were big. To top it off Mo and the other gentleman were fantastic.   I can't wait to visit again."], ["Yousif S.", "I've had better Greek food in Cbus for a third of Lashish's prices. Our apps trickled out one at a time and then the entrée trickle began. Our lil kids received their food very last. Weird. The food wasn't good, but the total bill was the most off putting aspect of our experience. We will NOT be revisiting Lashish the Greek. And I'm beginning to doubt Yelp's credibility after this experience."], ["Amey Y.", "I'm a regular here. I live in Brooklyn, NY. That should say everything. It's about time I wrote a review. My friends from Columbus showed me this place and this is pretty much the first place I ask to go to for food when I visit time and time again. The food here is amazing. Everything I've had has been really good. I love the gyros and the humus and usually get the Greek fries as well but their fish is also delicious and I usually steal some from my friend's plate. The owner and the staff here are very nice and friendly. They always make suggestions and when I came here the first time let me try some of the things that I never had before. Seriously the best service I've had. So support this local place and have some great Greek food."], ["Catherine J.", "High-end of the 4-star ranking from one Catherine J.Lashish the Greek has a lot of heart. The servers care and the chef/owner (Mr. Lashish, I presume?) takes time to come to the front of the house to make sure everyone is enjoying the food. And he'll gaze around enjoying other people enjoying his food. Adorbs. Plus, I've never been here and not been offered something extra: a small glass of hot tea, small slices of honey cake, or both.The ingredients are very fresh. This isn't fast food disguised as Greek, though you won't be waiting forever or break the bank, either. AND, there's a rotating list of specials. I really wanted to try the blackened grouper from the specials list last time, but went with a more traditional schwarma plate instead. Either would have been excellent, I'm sure. I overheard one of the waiters talking to another patron about their seafood supplier, so I know freshness and quality are high priorities for them.My only gripe-- and it's a small one-- is that the dining room could be a little more comfortable. There aren't many seats, which is fine (I've never not been able to get a seat  here), but the tables are a tad wobbly and the chairs are a bit stiff. It's probably too small for a few booths, honestly. But, an upgrade in the furniture, and maybe some festive table cloths, might make the interior match the quality of the food a little more closely."], ["Mr F.", "FriendlyGood foodGenerous portionsPersonal attention"], ["Thomas R.", "This is a phenomenal experience.  I had the lamb shank stew with mashed potatoes.  So flavorful  and hearty.Mo is an awesome welcoming host and his creations are incredibly delicious.Great meal."], ["Jeff S.", "It sucks you cannot give more than 5 stars. This place is amazing and the owner and staff are the nicest people in the world. The Greek fries are to die for that I have sampled everything else on the menu and have had no complaints. This is one of my favorite places to eat when I'm north of the city. Usually eat here a couple times a month and am never disappointed. Keep up the amazing job guys!"], ["Paul F.", "I came here last night for dinner after seeing all the yelling and shouting on Yelp.  It is indeed a small space with about twenty tables.  And I was surprised I didn't have to wait for one after seeing twenty-three reviews.I was seated by the waiter and the owner was bustling around all evening.  You can tell he really enjoys the customer contact.I started off with a small order of hummus.  The hummus was delicious but the pita bread was just so-so or maybe even a little less.  I then ordered dolmakia and a spanakpita (grape leaves and a puff pastry filled with spinach).   Both of those were just great!I was really a little full for dessert but the owner brought me a little square of cake and a glass of tea.  That was a very nice gesture on his part.  Anyway, a very good meal and I'm sure I'll be back."], ["Moses S.", "Everyone before me was really on point.  It's a small joint in a strip mall, kinda unassuming.Going in, the Chef (I think his name is Mo from his uniform) is up and about, very charismatic.My wife and I had the bab ganoush to start. It tasted smoked/smokey and definitely had more eggplant taste than most places, so I was pleased.  My wife had the Gyro Dinner and that came with a great greek salad, long grain rice, pita and a very interesting tzatziki sauce.  Everything on her plate was on point, but the tzatziki sauce tasted a bit off, reminded me of thousand island dressing maybe (kinda a tart taste)? It didn't taste like yogurt and cucumbers like most but was still very good.I had the shwarma dinner and that came with hummus, tossed salad and pita bread. It was very good as well.  The hummus also had a slight grainy teture, which led me to believe it was home made, so A+ in my book.As we were leaving, we wanted to try a baklava. The Chef explained the difference between traditional greek and lebanese baklava (lebanese is more french inspired). We went with traditional, but then he gave us the lebanese one for free because he wanted us to try them both! The owner/chef is really proud of his pasteries (he was picking and choosing which one to give us, not just the closest ones) and definitely deserves 5 stars for his charisma, passion, and most notably, his food."], ["Mindy W.", "The cheesecake.  You must try it!  So very creamy, yet crumbly and just delicious.Mo, the owner is very, very nice.  He came out and spoke with us, gave us tea and cookies to try, explained the different desserts, he is a treasure, for sure.I've been here twice now, and I can't say enough good things about it!  My father had the Angus burger (I know, I know!) and said it was delicious.  It was on a Kaiser roll, and was HUGE!I had the Gyro and it was fabulous.  The meat has a great flavor and the sauce...mmmm.  I wasn't a huge fan of the Falafel, but I'm a \"heat\" wimp when it comes to spice, these were a little too much for me.  I liked the Kibbeh, very flavorful.The three stars of the show are the hummus, the cheesecake, and the little glasses of tea at the end of the meal.  I love that tea.Everything amazing has already been said in other reviews, so I don't want to gush or repeat, but this place is amazing.  Perhaps a little utilitarian in appearance, but you won't be disappointed.  The food and staff are amazing.Thank you Mo for several delicious meals!  I would drive across town to get that cheesecake.  AMAZING."], ["Chad F.", "I love this place!  I typically get the seafood special which is always prepared perfectly.  The owner and his staff are very friendly.  I would eat here on a daily basis if I lived closer!"], ["Roab P.", "Family owned and operated. Some of the best Greek/Lebanese that I've had in a long time at a low price. The cook/and who appeared to be the owner was very friendly and gave my wife and I samples of food we had never heard of. All fresh and made to order. We stopped here on the way back from cleveland to columbus. This was the only non-corporate restaurant with good reviews in the strongsville area. It was a good hike from I-71 (about 8 min. because of the high traffic area and lights) but well worth the detour."], ["Bonnie D.", "I just ate here today and had to post a review because it was SO GOOD. I had the shish kabob. The meat was amazing and just fell apart in my mouth. Everything had amazing seasonings and was absolutely delicious. I also had cheesecake for dessert and can honestly say it was the best cheesecake I've ever had in my life. Mo does a fantastic job and makes everything from scratch. I will definitely be back!"], ["Gary T.", "Spanikopita is a must!!! They often sell out so get there early!! The food here is authentic and made fresh to order. The décor won't thrill you, but the food more than makes up for it."], ["Terry L.", "Great place to dine with the family. Everything on the menu is home cooked and served in very large portions. The Greek fries and the calamari make fantastic appetizers. The Greek salads are fresh and huge with a delicious dressing. The seafood specials are always high quality fish.  Most importantly, the owner Mo interacts with staff and customers to assure their dining experience is a special one!Don't miss the outstanding cheesecake either!"], ["Kylee C.", "Amazing Greek food!  My personal favorites are the hummus, fattoush salad and kibbeh.  Their cheesecake is also amazing, made in the New York style.  One piece of this is more than enough to share and towers at about 5\" high.  The people working there are always friendly and the prices are fair.  This place is great if you want something healthy to go."]], "Cafe Istanbul": [["Diane D.", "I'm a huge fan of Turkish cuisine.  A friend and I stopped in last night after a late bike ride and split a meal.  The pide bread and flavored oil was fantastic as a great start to the meal.  I was disappointed in the hummus, however.  Though the ultra smooth consistency is lovely the dish was overwhelmed by too much tahini, making it taste more like seed paste than hummus.  The Doner special was fantastic, however.  The mashed eggplant and amazing Doner meat was perfectly set off by the light tomato sauce.  Though I still prefer Shish Kebab on Bethel Rd for Turkish in Columbus I will return to Cafe Istanbul again, particularly as the decor is so, so lovely and the patio private yet spacious."], ["Kieran O.", "Great Döner kebab! Very friendly service. Hummus isn't the best I've had but its good, but the bread is delicious. Reasonable lunch price for a starter entree and dessert. Excellent waiter Anis!"], ["Reem B.", "so far this is the best Turkish place I've been to!My husband and I love love Turkish places! They remind us of our hometown in Syria in every way the atmosphere, the music and the food of course, so we keep trying Turkish restaurants every place we go to. we do have some nice Turkish places in Cincinnati but this one topped them all.I loved the decor with those chandeliers. we sat at first in the patio which was very elegant and surrounded with flower and plants but then the rain poured heavily so we had to go inside. hence we tried the complete experience of inside and outside seating at once and loved both!the food was awesome. big portions with amazing flavors. loved the gyro pide even though it feels so heavy but totally worth all those calories :-)Cafe Istanbul will be  my favorite restaurant to eat every time we go to Columbus!"], ["A D.", "Excellent food! Especially the Baklava!  heavenly moist and sweet.  Great decor. Friendly wait staff. I'll be back!!!"], ["Sharmeela S.", "The food here is consistently good.  I usually get the adana kabab or one of the lamb stews and neither have ever disappointed me.  Recently i tried the Shepherds casserole - lamb with red and green peppers served with rice and was pleasantly surprised.  Another classic to add to my list.  The restaurant itself has a nice ambience but service quality is inconsistent but the food has always been good."], ["Kate H.", "Food is probably closer to 4 stars, but service sank this ship. The lunch deal at the Easton location is great. Appetizer, entree, and dessert for $10.00. I had the red lentil soup and the tilapia. My dining companion the Baba Ganoush (babaganoush?) and the chicken kabob. All very nicely made, though the Baba was a little too smokey for me. Nothing to complain about. Good food, good price.But the service... ok, I get that some things bother me that wouldn't bother others, but the lack of attention to detail in service always makes me nervous about what is going on in the kitchen. We were seated in a nearly empty restaurant to a booth badly in need of repair. The cushions were ripped, unlike the cushions in the booths at either side. The menu was sticky and held remnants of food. Then there was the matter of our server. He was well-intentioned and attentive, but definitely missed the memo on not oversharing with your customers. I waited tables for 6 years. You need to smile and be friendly, maybe compliment a jacket or purse... whatever... however, this cannot lead into a 10 minute story about your Christmas shopping or why you think you look better in the color orange. Look, I am not here to have a long conversation with you... I am here to speak with the person I am having lunch with. I appreciate what you do, I know how difficult it is, and I will tip you well for doing it, but I don't care if your mother always puts sour cream in her mashed potatoes or what class you found must interesting in undergrad. Please.move.along."], ["Zach Z.", "Excellent ambiance - I got the chicken delight, which was delightful! They were also willing to accommodate a party of 30.  Very satisfied!"], ["Soly Z.", "I liked the ambiance inside more than the food, which although it was okay. My biggest gripe is that it lacked the depth of flavor and spice that I am accustomed to with Turkish cuisine."], ["Roy Z.", "Took my fussy teenage daughter here last weekend. She had a chicken kabob and fries and loved the seasoning of the chicken so YEA! I had the Moussaka, I would have liked a little most seasoning to it but it was very good. The pre-mela bread and dipping oil was wonderful and the service was polite and attentive. Decor is a smash! Once you are past the entry and Bart"], ["Jodie L.", "This is one of my husband and my favorite places to eat and relax.  We love everything about it.  The food is great.  Try the house salad, iskander or any of the kebabs.  I LOVE their rice pudding!!"], ["Adrienne C.", "The best part about this restaurant is their AMAZING bread dip that they give you for free!! I want to go back just for the bread and the dip. The main courses are good too - I like that it's a flavorful, nutritionally balanced meal. Everyone should try this place, especially if you like indian food. It tastes like its lighter, healthier cousin.The interior design is well done too! It feels like a nice ethnic restaurant without being pretentious."], ["Halie R.", "Very great and authentic food. Our server was fabulous and gave great recommendations. The food was a little pricy, but very enjoyable."], ["T P.", "It could be much better. I am a fan of all ethnical cuisines. Though I had tasted much much better Turkish food in NYC, Orlando, and Europe as well as Istanbul. This is the closest taste you would get in some entrees in this town. However, I would definitely recommend to experience and taste it yourselves. I love the bread that they serve the second you get seated."], ["Teri D.", "In spite of what others have said and what a certain dude said ;)  this is a place that unless I threaten hubs, we will not be going back.  Why? Well, service was ok, a tad slow but ok even though the place wasn't crowded.  The salad I had was very good as was my coffee and the bread was yummy good, the rest? Meh!The calamari was room temp, stringy, and bland tasting, the hummus was bland with barely any flavor and thin and over pureed without any bread to go with it other than what they give you when you are seated.  Maybe they just make theirs differently than others - just my opinion.  The falafel itself wasn't too bad but OMG that sauce that came with it?  Hubs took a bite of his falafel dipped in it and made the most horrible face; it scared me.He said that sauce tasted like ash.  We asked the server what it was supposed to be and he told us it was supposed to have a smoky taste to it.  Smoky? Tasted like the whole house burned down in it!  And that is how I felt it tasted after I took a bite of it.  I really wanted to enjoy and like lunch here based on other reviews but nope."], ["Matthew L.", "DETAILS!The apps; the cigeri is lightly breaded, exceptionally seasoned liver - wonderful on all levels.  I've always thought that I hated liver - until I ate it here.  Now, it's one of myfavorite apps in town.  The calamari is second only to that at the Pub (strange, no, but their calamari and the sauces for it truly are amazazing).Entree wise, they have exceptional kabobs, from swordfish to lamb (steaklike to those who've never partaken, and fantastic) to ribeye to adana, and a word to the wise - try it with yougart.  I know, I know - it's an insane thought, but it's truly worth the risk.  Not a fan of yougart in general, and it took quite a bit of convincing from my wife to try it - and I've not regretted it.  EPIC.  Especially the adana kabob; great combo."], ["Ric F.", "Amazing food ! Great atmosphere ! Good pricing ! Good location ! Great service ! Having said all that, I'm still wondering why I've never been there when its busy ? Seriously, I've been there a handful of times and have never seen the place even half full ! Word needs to spread about how great this place is ! (or, they need to advertise more?)"], ["Amy E.", "Definitely one of the more affordable restaurants in this area, and the food was delicious!  My lamb was perfectly seasoned, had just the right amount of char, and the roasted vegetables melted in my mouth.  I love the spicy sauce and yogurt sauce that came with my meal as well.  I would come back if I'm back in the area."], ["John D.", "Great chicken kabob. What can I say . Will definitely go back great hummus and bread also."], ["Samantha L.", "It's difficult to choose one restaurant to eat at when visiting Easton. After walking through the whole area, Cafe Istanbul's Mediterranean menu convinced me to walk through their doors for dinner. White linen cloths, stained glass accents, gold and red colors, and a high ceiling distinguishes the dining room far from a \"cafe\". Groups of tables are separated into different partially enclosed rooms creating some intimacy if desired. Start the meal with a hot appetizer, their Sigara Börek. It's basically rolled phyllo dough filled with feta cheese and parsley. It reminded me of cream cheese wontons but more tang to it.I ordered the Mixed Grill Kebab to share between two people.  It comes with half portions of the Chicken, Doner, Shish and Adana kebabs. The kebabs are grilled and come on a plate with rice pilaf and veggies. The chicken was moist. Doner is the ground lamb and beef that is a vertically hung rotisserie and carved. The Shish, marinated lamb, was my favorite of them all. It was tender and just how I enjoy my lamb cooked.  Adana is grounded lamb with onions and red peppers - tasty but but after having their Shish, it doesn't compare. The dish is enough for two people to share.Order the Turkish Tea with your meal. It comes with free refills and cleanses your palate throughout. 4 Stars to Cafe Istanbul for the atmosphere, great service, and food!"], ["Rose D.", "This is one of my absolutely favorite restaurants in Columbus.  Delicious Turkish cuisine from a large selection on the menu.Best. Hummus. Ever.And the bread they bring to the table is so yummy!  It comes with a delicious dipping oil as well but I can never resist their hummus.Other faves on their menu is the falafel, the pides (pea-day - kind of like a pizza but not quite), any of the kebabs, and the Turkish Tea (like a spicy chai).The restaurant itself is very beautiful inside with lots of great mood lighting and lovely warm colors.  The servers are very friendly - though some may complain the service is slow, I believe the speed is right in line with this type of restaurant.  Americans can sometimes be in too much of a hurry and this is a nice restaurant to take your time and relax in."], ["Aaron A.", "CC and I were out shopping when the hungry monster grabbed us up and started to drive us insane. I'm doing the slow-carb diet right now, so I'm a pain to feed, fortunately Cafe Istanbul was there to pull us back from the brink.The place is beautiful inside! I got excited when we stepped through the door. I knew we had made a good decision.CC got some appetizers, as is her want. The hummus and falafel were delicious, it was nice of her to share. I ordered from the lunch menu. I wound up with a salad, a chicken kebab, and a cup of coffee that I negotiated because I can't eat whatever the dessert was. The salad was over dressed. The chicken was good, with little charred bits from the grill. It came with some vegetables and I'm not sure how they were prepared, they were warm, but crunchy, with a dressing that seemed similar to what was on the salad.Service was great, no problems. They have a nice looking patio, but it wasn't open during the odd hour we were there.We had a nice meal, everyone was satisfied. I wouldn't say I'm in a hurry to go back though, too many other places I want to try. Four stars!"], ["Patrick P.", "I like food and this does not disappoint.    I enjoy the Adana and Doner kebabs.    It has a lot of flavor and you feel like you are eating healthy.I am not sure how many weight watcher points I achieved but felt I had high score.   The only thing missing from my meal was the trophy I deserved for being in the clean plate club.Meal:Chicken Adana (2), rice, and steamed vegesAppetizer - Humus = yummyBread (I believe it is foccia) and spicy olive oilTurkish TeaTotal price was around $22.00 (Meal $15, $5 Appetizer, and $2 Tea)The people were very nice - I will definitly will go there again."], ["Mike B.", "Service was a little bit less impressive than my previous review, just pretty slow. We waited almost five minutes to be seated. It was in that odd twilight hour between lunch and dinner, so I can understand not having a lot of staff, but anticipate to be busy two weekends before christmas!Food was still excellent, it's a bit pricy for what you get, but it's easton, so it's probably cheaper than most of the places around the block."], ["Asma Z.", "The ambiance was great but the food was average at best. We got the lahmacun which was falling apart in our hands. The iskender was cut too thick and was too salty for consumption. The tea was good! We didn't stay for desert."], ["Andrew G.", "We have been here twice and will return! I order vegetarian dishes, and my husband orders the kabobs. The food is excellent, and the wait staff is wonderful. We are frequent diners at the sister restaurant at the Greene in  Dayton,  Pashe, and enjoy it as well."], ["Erin D.", "Been here several times now; this place is the real deal. Food is similar to greek in many ways. The kebabs (doner-like a turkish gyro-minus the pita) is so delicious. Best outside of Europe. Lots of vegetarian options. Portions are also very generous, especially on kebabs.Great menu items:Cacik (similar to tzatziki)Doner KebabMousakaHummusRice PuddingLamb Shank (hubby doesn't care for Lamb on its own, but this was soo delicious and well-seasoned).The decor is also very beautiful. Also very nice patio. Great little date place. Service can be a bit slow at times, but I think that is the European influence. I have heard this restaurant is Turkish owned."], ["Oliver C.", "large portions make this place great... mix in cool atmosphere and great tasting food, well its a must stop in while your in columbus.All the Kababs are wonderful and you won't regret ordering one of these items.  Some of the best humus I have ever had."], ["Mira B.", "My husband and I went for an early lunch. We ordered the appetizer sampler and grilled veggies. The food was okay, not great. The restaurant was not busy, but the waiting staff was not attentive. We actually had to talk to the manager to get our entree. Our entree came with tomato sauce that tasted like store bought pasta sauce. What kind of 'authentic' middle eastern restaurant serves regular bread and not pita bread. Authentic? Yeah, right...not impressed. :("], ["Tramaine W.", "I loved this place! It's hard to write the review now because I stuffed my face so much that my tummy felt like it was going to burst. The post binge feelings are clouding my memory. First off I hate to say it but a lot of truly authentic international restaurants are usually grimy and not upscale at all. I still go to my hole in the wall restaurants though because the food is often the best. This place surprised me because it is the only place I can recollect that tastes authentic and was swanky and well decorated. The pre meal bread and tomato olive oil thing was the deal closer.  I ordered the hummus, the lamb sauté, and tasted the tilapia. It all tasted great, the lamb being the best. All I kept thinking was damn why don't we have this in Atlanta and wow this makes me want to go to Ohio State more."], ["Joshua C.", "This is a very nice restaurant with a nice atmosphere. The food was absolutely delicious! I totally would recommend this place and look forward to eating here again."], ["Josh K.", "The food was not what I was anticipating when I went here. I was actually expecting more typical gyros and things of that nature. Now, I will never want to go back to the \"typical\" Mediterranean foods that other restaurants offer. This place was excellent, and I can't wait to get back and try another item."], ["Carolyn E.", "Istanbul is chain of restaurants offering \"authentic Turkish\" food.  I am afraid I can't really talk on the point of authenticity, and must leave that to someone else.  However, the food offered is very much in line with other restaurants of the type I've been to, with great flavor and served in a nice atmosphere, though at what seem like rather high prices.Dropping in on a Saturday afternoon with my friend, the place was not exceptionally busy, though a few folks including families were present.  Just as well as the tables are pretty tight together.  I could see it being crowded and noisy if the place is full.  The ambiance is nice, though - warm colors, interesting structure, comfortable seats, and some interesting decorations and lighting that lend it an exotic, elegant feel.  It might be tricky, but I suspect tables could be moved together to accommodate a decent sized group.  I gather there is also patio seating though given the wind and scattered showers, it was not the best day to dine al fresco on our visit. But anyways, the food. I had planned to order a sandwich and appetizer on this trip, but either this branch does not serve sandwiches or it was past the time they are available because I did not see them on the menu.  That was fine, though - I got an old favorite, moussaka, instead.  And wow, that's some good moussaka.  The ingredients blend together perfectly for a fantastic chewy texture with lots of sweet and savory flavors, with the eggplant/mozzerella/bechamel topping being the highlight.  Not to knock the plentiful and flavorful meat, but it's the top part of the meal that make it work.  This is served with a plate of tasty, seasoned rice and a piece of roasted tomato and pepper on a bed of creamy sauce.  Like all meals, it also comes with a  nice big basket of Istanbul's bread and mild, spiced dipping oil to share with your companions. The bread is seriously good stuff, with a slightly sweet taste, a crisp crust, and soft, super addictive inside.  It's both a very good and very bad thing they give you such a good portion - good because it is delicious and you will want to eat it all....and bad for the very same reason.  As to drinks, Istanbul has a full bar and some interesting teas, but I decided on Turkish coffee.  You can never have enough caffeine after all.   However, for $3.25, you sure don't get much caffeine, even considering how pungent the Turkish style of coffee is.  One little (admittedly beautiful) little cup is all you get, which seems strange since I have been to other restaurants where I can get an entire pot of coffee for less than that.  ...though to be fair, they are Lebanese and not Turkish and not located in Columbus.  Anyway, I suggest you try the apple tea instead, which not only has free refills, but is apparently very good (I did not try it but my friend who did said it was fantastic).Prices, in all, do seem on the high side to me, though they aren't ridiculous or that unusual for this sort of food in this sort of atmosphere.   Also, keep in mind that, as of this review, Istanbul offers a 15% off coupon (per person or per table) on their website that you can print off.  It used to be offered in the local newspapers as well.  My friend and I both utilized one without any difficulty.  Now as to other points - service is a bit mixed.  The main server we had was.... not enthused with her job.  It could also take a lot of time to get refills and other things.  However, there was another man (the/an owner?) who popped in and out now and then and was very pleasant.  Also, as the place isn't that large, I expect waits are a normal occurrence come dinner time.  However, there is a very nice area to wait in by the entry, with some big leather couches, reading material, and some items for sale from Karavan (same people as on High Street I presume) for perusal.Anyway, if you're hungry at Easton, I would certainly suggest giving Istanbul a try.  Good food, fantastic, bread, and a very nice atmosphere."], ["QQ J.", "Nice place in Easton. My husband loves the bread and the dinner. I personally love the bread so much. More like Shish Kebab at Bethal road.  Will try more next time."], ["Edy D.", "I love Mediterranean food and I so wanted to enjoy an evening on the patio with my good friend and some good food but it was bland, all of it. I won't be going back.  :-("], ["Fujiwara S.", "Amazing Turkish restaurant!! Very good mezze, especially the eggplant paste. Liver cubes, Kebabu plate, Seafood pide, were also remarkble. Iran as a drink, but very sorry that they didn't have dondrma."], ["Marcia W.", "The food was so great, we ate there twice while spending labor day weekend in Collumbus.  The tabouli salad was great and the lamb and ribeye cabobs were great.  The scalops on some type of crust (can't recall the name) was amazing. The oil and the bread they give you is delicious.I am a very choosy eater because I am a good cook.  So if I can cook it better at home, it will not cut it for me.  This place is one of the best restaurants I have been in a long time. I wish I lived in Columbus, I would be a regular.The service was a little slow, but it was well worth the wait."], ["Nadia O.", "Ultimately, my favourite upscale looking restaurant yet in Columbus! The beautiful Coban salad is light yet filling, the small is a perfect portion. I tried the Bamya okra stew to try something new, I'll admit it's not for everyone but I enjoyed it. The Corba lentil soup is out of this world, a hint of mint and cumin make it the last meal I want on Earth. Above all, they serve you this succulent warmn bread with a divine sun dried tomato dipping sauce; I almost asked it to-go :-/o!A glass of wine is well priced here, I had a pretty good Yakut. The venue has a comfortable appeal with its warm colours and she-sha tone; my Turkish dream a night floating on the Mediterranean sea."], ["Heather M.", "I will start my review by describing the service, which I have deemed to be near comically poor.  Our server didn't seem to know anything about the food on the menu.  When asked if there were any specials that evening he replied, \"I don't think so.\"  So we went back to poring over the menu and waited for our drinks.  Later he said that maybe if we bought two entrees we could get an appetizer for free.   With the exception of the free bread, the food was unremarkable.  We had stuffed eggplant, okra stew with lamb, and the spicy beef.  The meat was generally tough when not ground and the food was over-salted.  Service was extremely slow and we almost didn't make our show.  I really wanted to like this place, but it's just not going to happen.  The decor is stunning, but I really can't recommend anything else."], ["Yara M.", "Horrible server (his name started with N...)We went for lunch...1) We ordered tea and didn't get any--the waiter never brought it. I ask for an itemized bill because the waiter was quick to take my credit card off the table (even though I didn't offer it to him). We got charged for two teas. Since he took my card before I saw the itemized bill, he had to refund my card and re-charge me the new bill amount. Lastly, he offered me tea to go LITERALLY 5 times saying \"are you sure you don't just want to take it to go? I can get it in under a minute. are you sure? are you sure? I can just bring it to you to go\" OVER AND OVER. Uh, no I don't want to be charged over $2 for a small cup of tea to go when I could have gotten free refills the entire time I was sitting there. STARBUCKS ISN'T EVEN THAT EXPENSIVE! I think I should have been offered free tea after that whole fiasco.2) We ordered babaganooj as one of our appetizers and he brought us HUMMUS. The place wasn't even packed and our waiter (who was waiting 3 tables at most) could not get our order right.3) The gyro meat was cold and fatty. It was obviously from the day before and re-heated.4) There was only one dessert option, which was rice pudding. Both of us are lactose intolerant and unable to eat rice pudding. The dessert is included in the lunch order, which is why this is off-putting.In the end, we didn't get tea. I got my card swiped twice. The gyro meat was old,cold,and fatty. We didn't get dessert. We didn't get a discount on our lunch because we didn't get dessert, and we weren't offered anything else in place of dessert for free. We got harassed to take 2 teas to go because it was inconvenient for the server to change the bill....But the bread and oil are awesome"], ["Rebecca O.", "I'm all about trying new foods and restaurants. So when I had an opportunity to check out a three-course meal at Cafe Istanbul during Columbus Restaurant Week, I couldn't pass up the opportunity.Here's what you need to know about my experience: - The ambiance is super swanky, but I still felt comfortable in my casual apparel. I dined with two friends, but I think it would also make a great date spot.- The complimentary bread and dipping oil is AMAZING. The bread is perfectly crispy on the outside and soft on the inside, and the dipping oil has a lot of flavor. I could eat it every day. - I ordered the Doner Kebab, which was delish. It's the Turkish version of the gyro. I thought it seemed a little dry, but the flavor made up for it. - Service was wonderful. The staff was so attentive and patient.I'll definitely be back."]], "Kabob Grill": [], "Nazareth Restaurant & Deli": [["Phil P.", "I have been to a number of Middle East and Mediterranean restaurants over the years.  This is one of the best.Service was prompt, knowledgeable, friendly, and attentive without being intrusive.Prices were moderate, servings plentiful without being overwhelming, and value was very good.Now, to food.  I had a falafel sandwich with a Greek salad.  The falafels were perfectly crispy on the outside, quasi-gooey on the inside.  Herbing was just right.  The sauce wasn't tahini so much as a \"runny\" hummas.  That almost sounds yukky, but it was good!  Between the falafels and all the stuffing, it was almost too much for the pita.The salad was freshly made, and pretty much what you'd expect to get when ordering a Greek salad.  I will say that there was a lot of feta cheese.  Dunno if that's a bug for some people.  Definite feature for me.I'll be back when I'm in Columbus!"], ["Meron G.", "All I have to say is get the Spicy Chicken with rice!It's absolutely delicious! There's nothing else out there like it! The chicken is tender and the spices are music, to my tastebuds! LolThe service was outstanding. Very friendly and I didn't have to wait long for my meal!I see myself becoming a regular here!"], ["Z P.", "Very friendly staff and great, inexpensive good. First time at this location. Unfortunately, they don't.serve alcohol here, like they did at the Cleveland Ave restaurant. Spicy chicken dinner. Yeah!"], ["Haley S.", "Get the hummus. You won't be disappointed. The pita is warm and delicious. Great service every time!"], ["Tory R.", "I ate at this place when it was on 161 a few years ago, but wasn't that impressed. I think it was because I just got the gyro and fries.....big whoop!  Plus it was an old Chili's restaraunt.....which being a former Chili's employee myself made my experience a bit creepy. So I decided to go give it a second try after it moved to Hamilton Rd.   I was talked into getting the spicy chicken on rice.  It was absolutely......freakin' DELICIOUS!!! It's hard to describe, but it's amazing! Just try it! The tabbouleh salad was okay. The Greek salad is really really good! The service is always really good. Just one complaint from my last visit......SERVERS AT NAZARETH: Be sure to take salads out BEFORE the main entree. Do NOT bring the salads and the meal at the same time!   That's rude, careless, and lazy.   Okay I feel better....just had to say that.   But it is really an inconvenience to let your food get cold while you gnarl down a salad. Other than that....I have no complaints. Love LOVE this place!!"], ["Tim L.", "Probably my favorite Mediterranean restuarant in Columbus.Best BABa in town. Best spicy chicken an rice, best lemon chicken soup...only draw back is not the best falafel. That goes to Pita Wrap next to Bob's Bar on high str."], ["Rebecca L.", "We usually go to yannis for greek, so its always hard to pull away from that and go somewhere new. BUT they did not disappoint. My fiance' has been talking about how we went to this place in high school, since ive met him but he didn't know where it moved to-turns out its down the street from us and we had no idea!!! Theyre tzatziki sauce is *dare I say it* a little better then yannis, or any other greek place ive been too. its not as thick and some places-so if you like your gyro with thick sauce this is not for you. theyre prices are reasonable, although not as inexpensive as yannis (I have to compare but theyre both the best in Columbus so depending on what side of town youre on pick one, you wont be disappointed) Gyro meat is perfectly tender (I mean melt in your mouth) and PERFECTLY seasoned. I usually get a chicken shwarma but always start with a gyro at a new greek joint and this is my favorite place to get a true gyro-they add banana peppers which give it a perfect kick not a lot of places have. stuffed grape leaves are delish. My two year old devoured their chicken nuggets (haha!). Overall, its awesome. Service is great, everyone is so friendly. owner is often their messing around with a baseball bat. baklava is awesome-get the chocolate roll (I believe that's what its called)...my fiancé came home with one and I was so disspointed when I ate it all haha! go here-its great"], ["Sharmeela S.", "I only wish id found this place earlier.  Delicious food.  Everything has been outstanding.  Lamb shish kebab, spicy chicken over rice, falafel and hummus are all some of the best Mediterranean food ive had.  The meat is tender and flavorful and the rice is complex in its seasoning and components but really comforting.  I cant wait to go back."], ["Maxy F.", "My favorite gyro place! I remember when they use to be in a crappy location on a questionable side of town. But that still never stopped me before!Spicy chicken and rice is my absolute favorite! I compare all other gyro places in columbus to this place. I really recommend trying it out :)"], ["Nick G.", "Some of the best Mediterranean food around! Formerly located at Columbus square shopping center, Nazareth moved locations just over a year ago. Their gyro is one that rivals the best in Columbus. Ownership is always committed to a great dining experience. The only downside is the traffic on Hamilton Rd. If you are in a hurry to get there at night, make sure to plan some time to get there!"], ["Danielle A.", "Delicious!!!!  My husband and I never had the chance to try the original location as we discovered it just 30 days before they moved. We've gotten take out, however, from the Hamilton Road location twice in the last twelve days. I'll repeat DELICIOUS!  Between the two of us, we've had chicken on rice, vegetarian grape leaves, and chicken shawarma.  Everything is fresh and very flavorful. The service is friendly and fast. Since I didn't have a menu the first visit, I placed my order and waited. My order was bagged and ready to go in 10 minutes. I love the fact that they offer both lunch and dinner portions for their entrees.Parking is a breeze and the location is easily accessible from Morse Road and 161. We will be accessing it again real soon!"], ["Wade D.", "Where do I start? This place is amazing. I loved it. Pure and simple. Everything about this experience was awesome. I went in mid afternoon and it was slow, but they were still friendly. I got the gyro and fries. 8 bucks. I'm not joking, this might be worth 12-13 dollars. The serving size is amazing. I couldn't finish it and I'm a 25 year old guy who didn't eat breakfast today haha. I will definitely be back and I'd recommend anyone who wants some good food to stop here."], ["Zack S.", "Unfortunately, I never had the chance to try Nazareth at their old location....that being said:I ordered both a gyro and a chicken shawarma.  Both were pretty good, but in my honest opinion, I feel Mezze (right across Hamilton) does them better.  Fries were TERRIFIC!  Nothing like fresh cut fries with vinegar on them....yum!  The special maza appetizer plate was ok, but nothing great.  Hopefully this review doesn't sound too downtrodden; I'm definitely going to try Nazareth again...I just have extremely high standards to compare against!"], ["Chandrashekar K.", "This place is awesome. I love their spicy chicken over rice. Also had lamb chops once, which was very good. White cream sauce they give with any order is yummy."], ["Brianna M.", "I love this place! Everything is fresh and made with a lot of care. I always get the gyro and fries. Their fries are fresh cut and AMAZING. I always ask for a side of the gyro sauce so I can dip my fries in it. The staff is friendly and the food comes in a timely manner, even when each table is full. My date ordered us some bakalava--SO GOOD. Definitely the best I've had in Columbus."], ["Kyra T.", "Meh. I frequented the place that was here before (pomegranate) so I was already a little disappointed. I won't be going back to this place. The pita that was served with my hummus was hard as a rock and my husband's gyro was so sopping wet from the tzaziki that nothing else on it could be tasted. The soup I ordered was 95% broth. The lentils and rice was ok. I'll go across the street to Mezze to get my fix from now on."], ["K.A. K.", "The spicy chicken on rice is top notch.  The pita bread and house sauce are a must to help cool off that spice!  Better quality & taste than Mezze across the street, but the portions are getting smaller everytime we order..."], ["Tara H.", "I really like this place. The staff is always friendly and sometime the owner comes out to talk to everyone (with a baseball bat). The food is always good, I especially like the spicy chicken shawarma. Their house dress on is amazing and I always order extra. The humus is great and the fries are hand cut and made to order. Dine in or pick up, food is always good."], ["Jay S.", "Probably one of my favorite spots to take folks in Columbus area.  Gyros are amazing, but the Spicy Chicken and Rice (with spicy sauce on the side) is the bomb.  Get extra cream sauce too.  My mom says the Greek Salad is her favorite salad of all-time.  Merry Christmas."], ["Leah W.", "I had a delicious meal of falafel and baba ganoush. Everything was super flavorful--lots of fresh veggies on the falafel, too. We ordered our food for pick-up and the cashier who rang us out, Farida,  was just lovely and sweet and happy to help.  Will be back!"], ["Corey Tess T.", "I am very picky about Mediterranean food and what passes for it... this is the real deal. The spicy chicken over rice is amazing. The flavors are authentic and rich. I love simple authentic ethnic foods.. no frills, just good. A great lunch spot!Very well priced.Good lunch spot.Try something different!Authentic.Good options."], ["Léon P.", "Love the spicy chx and rice! The tabouli salad ain't bad either, I'm telling ya this guy does his spicy chicken right!We are so glad they have moved into the neighborhood, I used to visit them when they were actually on 161 and Cleveland ave. But this place suit s them soon much better.the food is always consistent and the price is just right also. Hopefully we would have to expand our horizon and try some other items s well."], ["Gary K.", "Here is your list of things to do:GET the Spicy chicken on rice. ADD the side of feta cheese. It's helps with the heatAlso had the tabbouleh salad. Yummy. The Greek salad is very good too... BIG for a side salad!Ohhhhhhh soooooo goooooood!!!!!I love this new location... much closer to home... much better part of town too, though this is a much smaller location.I keep getting the same thing.... because its soooo good... duh....Everything else I see others get looks great too, but I just can't tear myself away from the spicy chicken!!!  YES, its that good!Anyway... go here, get that, be stuffed, leave happy!!"], ["Nick M.", "best gyros on this side of town....its no Mad Greek but it will do just fine :)"], ["Drew L.", "We had just moved to Columbus and this was the second time eating here. We came in (party of 6) for a late dinner about a quarter til 8 o'clock and we were greeted with a smile and promptly seated. I order the falafel platter and a side of fries which were surprisingly delicious for a Mediterranean restaurant. Our waitress was very attentive and delightful.Other customers strolled in late as well and they were still accommodated and greeted with a friendly gesture even minutes away from closing.The food was great. It came out quickly and was fresh hot and flavorful.Overall:Friendly staffGood food reasonable pricesRelaxed atmospherePride in ownershipCleanWill definitely return"], ["Jeff C.", "Oh this place is awesome. Best damn gyros ever. I've been eating at this place since they opened (I think it was the 80's) when they were in Columbus Square. lentils and spicy chicken is good too."], ["Kourtney S.", "The Hummus was AMAZING!!! GREAT Gyro!! A wonderful (not too pricy) great place to eat!  The atmosphere is pleasant and the service was very friendly. The food was without a doubt delicious! The meat was tender and spiced just right. I cannot wait to come back and eat here again."], ["Zach R.", "Love the food! One of the best gyros I have ever had. Very friendly and quick service as well."], ["Holli D.", "Our favorite Greek place in this area. The hummus is amazing and I love their Greek chicken salad. We've always had good service here as well. My only complaint is that they don't serve alcohol here."], ["Cierra R.", "Family owned-great service-even better food! My family and I LOVE this place. Their spicy chicken is amazing and their grape leaves are worth a try!"], ["Brooke S.", "Great Middle Eastern Restaurant! Today I stopped by on my lunch and tried the Gyro and Fries ($8) and they were excellent. I loved how much flavor the meat had and that they dressed their gyros a little differently by including banana peppers! The hand cut fries were fabulous as well (huge portion big enough to share!).I'll be back to this spot for sure."], ["Cheryl F.", "I love this place. I like the new location much better. I usually get hummus and a catfish gyro. I can come here and eat solo and not feel strange."], ["Jeff G.", "Great food and large portions. Only thing that kept them from 5 was the inability to accurately take a phone order."], ["Elijah K.", "This place sets the bar for quality Greek. Love their grape leaves stuffed. The gyro meat is great on the Greek salad. The desserts are delicious too. Fair prices and delicious food. Nice and simple. Will always return."], ["Jason S.", "Reasonable prices, good service, delicious food, friendly atmosphere. What more could you want?"], ["Jeff S.", "Moderately priced and very tasty. It wasn't stellar but it was still very good and a nice change of pace when travelling."], ["Joe T.", "For those of you who are curious, this is the same restaurant as the one off of 161 in Columbus, but it has moved. A great place throughout the years! The owner is an tall eccentric lovable man who will come and thank you each time you come and sit in his restaurant to eat.Food: I will say that I am a bit of a snob when it comes to Mediterranean food. That being said, Naz does not disappoint. The owner is from Israel and has used the same recipes for almost 15 years. The wine selection is great and there is not a better place to enjoy a beer as you watch OSU beat the team of the week. The gyros are perfectly seasoned and the lamb inside is moist and tender. The fries that are served as the typical side dish to most entrees are made in house and very well seasoned. The hummus is also made in house and is perfect. The Hummus and Pita appetizer is great! The grape leaf Dolmas are a little under par but that is the only thing that is underwhelming. Overall, the best place I have found for Mediterranean in Central Ohio after about 20 years living in the area. Service: Exceptional! Exceptional! Exceptional! As I mentioned before, the owner, if he is in will welcome you at the door and usually come greet you at your table as you're dinning. Sometimes he will bring his metal bat with him as a joke, insinuating that if you don't like the food, to not speak up. Don't worry though, he is probably the nicest guy you will meet and his personality is warm and friendly across the board. I have had the pleasure of dining here about 50 times over the years and I have never had bad service. The food is delivered promptly and the service has an excited atmosphere.Price: I am a little biased in my opinion of the price of this establishment. I am definitely willing to pay for good Mediterranean food, but surprisingly, this will not put a big hole in your wallet. Typically, the entrees range in price from $9 to about $14. Definitely a great price for the quality of the experience you are sure to have.Ambiance: As mentioned before, this establishment just moved to the Hamilton Rd location from the far North end. The building they are in is definitely an improvement to the earlier two locations. It is new and clean and feels very open. If you remember and appreciate the old locations, with their Christmas trees year round, don't worry. The tradition has made it's way to the new location as well, with a little more taste this time. This is a great place for a quick lunch or a relaxing dinner. The new location is classy and bright, without making you feel uncomfortable in jeans. The booths have a little higher than usual backs on them as well which adds a little more privacy without making it feel closed in. Ultimately, it is not a difficult decision to say that this place is five star worthy. I have nothing negative to say about this place! Being directly off of Hamilton Rd. near 161 feels like a very natural progression for this Columbus culinary icon!"], ["Craig O.", "Walked in and ordered take out.   Food is very good.  I really like the hummus, lentils and falafel.   I agree the falafel is some of the best I've had.    I also ordered the lamb kabobs.  They were tender.  Almost too tender.  I would have liked a touch more char or crust.  The sauces were also a bit watered down.   Instead of 5 sauces in my takeout, one thick one would have been sufficient. I would definitely come back here and the food is much better than the other similar restaurants in the area."], ["nancy f.", "One of our physicians provided lunch for the staff on Friday which was catered by Nazareth Restaurant Deli. There was an rich assortment of various platters of the most delicious food that I have tasted in a long, long time. Everything was so fresh, perfectly cooked and spices and sauces were so flavorful.  The gyros were such a treat, the chicken was so tender and mouthwatering--perfectly seasoned, the humus AMAZING and the baklava was truly the best I have ever had (and it has always been a favorite of mine),I just love their food!! Absolutely wonderful."], ["David W.", "Love this place. Spicy chicken over rice is excellent, and I love their Greek salad.Can't go wrong with a gyro. This is the best Greek/Med restaurant in Gahanna."]], "Sidebar Columbus": [], "The Happy Greek": [["Scott Z.", "Ate here early on a Saturday evening.  Sat on the back patio.  It was very nice back there.  Our waiter (Brandon or Brendon) was awesome.  Just the right amount of attention.  Very personable.Food was awesome.  I got the regular gyro with fries.  Started with the soup of the day, lentil.  Everything was perfect.  Wife got the chicken lemonato.  Also very good.I got the Greek cabernet wine and was very surprised at how good it was.  I like a wine that finishes clean and this was it.Very nice meal."], ["Brandi H.", "THE FOOD IS AMAZING. All of it.The patio is great. I felt a bit cramped when I've sat in the main part of the place along the bar, but the room next door is beautiful and open and must only be used when things are busier than any time I've visited.The staff has been friendly and helpful - all claim to like everything on the menu, but who can blame them? It's all. So. Good. It is slightly pricey, I always leave spending more than anticipated, but the quality of food you get is definitely worth the extra $2-3 than what you might spend at another Greek restaurant."], ["Olga S.", "If Happy Greek has anything appealing that would be incredibly enthusiastic cheerleading staff. \"Our food is amaaaaazing!\" - our waitress literally sang this into my ear doing a little happy dance around our table. I believed her and ordered Greek salad with some falafel, my husband ordered lemon chicken and my friend ordered some chicken wrap with fires. And we opted for calamari which were claimed to be \"best in town.\" I am not that familiar with the town of Columbus, maybe it has never seen anything better than couple of  overfried circles of octopus but in Cleveland you can buy something similar in a frozen seafood section in Wal mart. This entire world is divided into calamari eaters and non-calamari eaters. The first group wants a real calamari challenge - with chewy tentacles and small unidentified sea monsters. We really don't care about tiny generic rings. Second group doesn't want rings either. Actually it doesn't want any part of it: even sitting next to someone eating \"this gross thing\". My salad was this small collection of greens thrown into a very large bowl with a very bitter over-fried falafel. Actually I have never tried falafel worse than this in my entire life. I couldn't taste the food of others at my table due to Lent season but they were also uninspired. The waitress did throw a baklava piece after my husband complained about the onions in his dish which he asked not to put. She seemed genuinely surprised and concerned with us not finishing our meals but I found complaining useless: I give up on asking for upgrade when I am starting to feel that absolutely everything in this place is mediocre. Even baklava. We left just the way we entered: still not full, not Greeks and not happy."], ["Emma L.", "Happy Greek is good, but doesn't stand out too much from other Greek spots I've tried. In the end I always feel like I've spent a few more bucks than I should have.I really love their 4 dip appetizer. You can choose from the 5 or 6 dips they offer and get a little taste of everything, accompanied with pita and a few cucumbers and kalatmata olives (more for garnish). The hummus and eggplant dip is okay, but the tzatziki and spicy feta dips are great. It's just a bummer you don't really get enough pita to enjoy it all and there's a charge for extra. Also, the dip sampler is around $9-$10, which just feels a little steep to me.I have had a traditional gyro once, it was okay but not super memorable. I really enjoy their salads and love the one that comes with toasty pita chips tossed in it. You have the option of adding protein (from a pretty extensive list), but I usually just get the salad meatless since I'm usually a bit fullish from the dip appetizer. Their Avgolemono soup is really tasty and should be tried at least once.In the past year or so they've added a patio, which is AWESOME for Short North. But it's out back, which is kind of a downer if you enjoy people watching. Overall, I do like this place but I never find it at the top of my list."], ["Jill B.", "It pains me to say Happy Greek is barely a shadow of its former self. We've been coming here for almost 10 years and for most of those years, the place was packed. Now, it almost echoes from emptiness and now I know why. The food quality has greatly declined. My beef kabob was over cooked and the server clearly had no knowledge of the menu or how to simply add a side Greek salad to our order. I really wanted this place to survive the cult followings of Marcellas and Pearl. But with the subpar food and service, I likely won't be back."], ["Mel M.", "My friends and I we're all in town for a wedding and we needed a place for us to have a large group dinner. This place accommodated us perfectly!Our waiter was very nice, and very patient with us (about 15). We ordered apps and drinks as we waited for the rest of our party to arrive. I ordered the flaming cheese app, I for got the name, but I became hooked while in Indy. I also ordered the hummus with a gyro.Everything tasted fresh and was delicious. According to my friends it was a great success and everyone loved their food."], ["Robert W.", "Happy hour prices are fairFood was good but not great Outdoor seating patio in the back is peaceful welcoming"], ["Alice G.", "Excellent gyros! The gyro plate was great and flavorful and I had the chance to try the spicy shrimp gyro. Both were really good. My favorite was the spicy shrimp, flavorful and the right amount of spice. The shrimp was lightly breaded and it was a great paired with the spicy sauce, forgot what it was called but it brought about the right kind of kick. It was a different type of gyro from what I was used to. Definitely worth a try!"], ["Ben M.", "Great Dolmades! Gyro plate for lunch was so-so. Friendly staff but seemed more concerned with bar activity than lunch crowd. I've had better in independent (non-chain) restaurants but this will do if you're in a hurry. I'd probably try this place again with another item in mind for lunch. As Greek goes, about a 6 out of 10."], ["Allison L.", "Ordered a \"large\" greek salad, luckily got falafel on top because otherwise its about the same size as other places' small salad. The falafel were overdone and tasted a bit burnt, and tzatziki sauce I ordered on the side never came. Maybe I ordered the wrong thing here, but will likely go to Tasi or Level next time I want a salad in the Short North"], ["Naiying C.", "The happy greek is the 2nd best place to get a gyro on my list. Gryos are good but thei fries are just okay."], ["Daniel C.", "Was here on a Sunday night. I had the gyro platter which was pretty good. Food is prepared by 2 Greek guys with fresh ingredients. Service was very good.  Place is kind of dark inside. There is outdoor seating."], ["Brenda S.", "I had the gyro pita and it was delicious! My brother got the braised lamb and it was so tender. We came in a rush, let our waiter know, and the food came out fairly quick. Good food. Good service."], ["Cathy C.", "Saganaki OPA we started with - the portion was smaller than expected.  However it was enough for 4 to share for a few bites.  The cheese came with a pita bread which was soft and had wonderful favor.We had the  horiatiki salad which we added gyro meat too - we shared this.   The salad was delicious and some pita bread that came with it.   After seeing the fries that came to a friend at the table, we ordered our own - nice done and brown.The chicken pita looked good, however, I tasted a piece of chicken and not much seasoning or favor.  I believe it would be better if eat as a sandwich to get all the favors of the sauce and other ingredients.  There was also spinach pie at the table.  I must say it looked a bit oily to me, but we were told that the person that ordered it like it.We order tre leches cake - which is a 3 milk cake - it was good, over the top no but still good.  The coffee was good and fresh at the end of our meal.We had been here before - several years ago.  We were in town and decided to try it again.  We are glad we did.Note:  the bathrooms could be updated, which are down a set of stairs.  Also, maybe the place good be updated a bit in general."], ["Josh N.", "Blown away at the experience this afternoon.   After years of frequenting the Greek, I stopped in to use the restroom while waiting on my family in a nearby shop only to be flatly turned away.  I was dressed professionally and explained to the bar tender how long I had been coming.  Told them and I'll tell you - lost a customer for life today.  Hope it was worth it."], ["Teri D.", "We stumbled in here one day while wandering around the area and happy we did.  It ain't fancy by any means but you get good food at a reasonable price.  The small Greek salad I had was plenty big enough, I don't even want to know the size of the large one.  I had the baby lamb chops - nom nom nom!! While hubs had a gyro pita and we split the falafel appetizer.  I am not a fan of falafel but hubs was happy with it.As it is in the Short North you are going to have to pay to park somewhere be it a lot or on the street.  But that's the area for you.The only thing about the restaurant I didn't like was going to the ladies room which is way in the back down the stairs and right across from where a bunch of guys who I guess do the cooking/cleaning were all standing around.  Kinda creeped me out a bit.  But do go for the food!"], ["Good Food D.", "The reason i came here was i read on 614 magazine that happy Greek was voted for #1 gyros in the city. I have to say it was the best gyro in the city. Great service great food and atmosphere. Their gyro should be called THE HAPPY GYRO !!!!!,I will be returning here soon"], ["Rae W.", "I thought, \" Hey, venture out a little bit. You might be missing some excellent Greek food!\" I was SO wrong!!!! I had the nastiest, crumbly , pathetic excuse for a gyro at this place. Granted ,the place looks like an 80's version of a Greek Taco Bell...so I didn't expect the moon and stars....but gezzzz , it was lousy !!!!"], ["Holly J.", "They offer about everything you could possibly want on this menu:) the flaming cheese is a great starter for show and taste! The portions here are very generous so prepare to eat! The place is beautiful with an amazing patio, especially for the short north. Great spot for lunch or dinner."], ["Carl H.", "I knew Happy Greek was where I wanted to go for lunch, and as soon as I got there, I knew I had made the right decision as the owner greeted me by name.We had a great discussion about issues facing local merchants and residents, and then he served my Kefta platter with Greek salad, tzatziki dressing and pita wedges.  The kefta sat on a bed of rice pilaf and literally melted under the knife, as it ought to!It's this kind of experience that makes me really glad to dine local, instead of corporate!"]], "Pita Hut -N- Grille": [["Gus W.", "I stopped in here for the first time a couple of weeks ago and absolutely loved it. It'd been sitting there staring me in the face every time I've been to Bob's Bar, but I just hadn't been interested in the time. It's a very tiny spot with only five or six tables inside, but luckily, we beat the lunch rush just in time. The guy working behind the counter was very nice, and my girlfriend was looking for a more garlicky sauce for her shawarma, and he offered to fix it up with more garlic flavor her.We both ordered the Shawarma sandwich which has a turkey and lamb combo inside. I don't think I've ever seen turkey added to my Mediterranean dishes, but the pita pocket was so freakin' good. It reminded me of the shawarma over at Pita House, but I have to say, I might like it even better. The spices inside, along with the delicious hummus, were fantastic. The fries that came with the meal had a great Cajun spice on them and were super crispy. Overall, this sandwich combo was top notch in my book, especially at $9.99 for the pita, fries, and a drink.I also had an order of falafel, and it's been awhile since I've found falafel that's really amazed me, but this has got to be some of the best in Columbus. The tahini, or whatever it was, that came with it was delicious, and the falafel was super crispy and not too dense on the inside. They're a little smaller, so I think that helps, but you get a ton (10 for $2.49), and I'd order these again in a heartbeat. I don't get up to Clintonville very often, especially not this far up, but I will make it a point to swing by this place again. Had I known how good the food was, this review would have been written ages ago."], ["Pak M.", "Website says open till 11 pm. Ordered food at 1030... get notified at 1045 they arent responding. Tjey even called the owner for me and no answer.Bad service. Ended up going to pita hut. Highly recommend them."], ["Christopher G.", "Some nights back I ordered the falafel platter, which came with 3 sides. I chose the hummus, baba ghanoush, and tabouli. I added a small order of fries, which came to $12.62. That seemed a bit much for the portions, but everything tasted quite good. The falafel was particularly nice, as I like it a bit coarser than I'm accustomed to in Greek falafel.The young Palestinian fellow was quite pleasant and has the curious habit of calling everyone \"boss.\" It was interesting to hear what he had to say about Oman.I expect to return again this summer to have something with meat in it."], ["Anna C.", "The baklava is amazing! By far the best I've ever had. Quick to-go food and very delicious. I'd definitely stop by if you're in the area!"], ["Anna S.", "Solidly good, always.  Perennial faves:  falafel, eggplant salad, and cauliflower salad.  Pro tip:  get your meal as a platter (sandwich, hummus/baba ghanoush, and two sides).  Then you'll have plenty for two meals!"], ["Kara M.", "i ordered the schwarma plate and aded some falafel and it was really good. I loved the rice here and it was so good. it was a solid place not anything I would go out of the way to get but if i'm in the area and someone suggested it then i'd totes be up for it. standard medi fare"], ["Michael M.", "Again, I feel like I fell victim to pre-meal Yelp bias. Reading the reviews I thought I was going to be the best meal I've had in weeks. The definition of 3 stars on Yelp is \"A-OK\" and thats exactly what this place was. Not bad, not great. I had the meat combo (lamb in a pita pocket with hummus and veggies). It was good but not great. Had the flavors I expect from Greek food but didn't have anything unique or special. Maybe its because all of the food is sitting out a la Subway or Chipotle? I had the 10 piece falafel. The price was definitely spot on ($2.50 for these was definitely worth it if you are looking at price per calorie). However, I felt they tasted rather bland and that I was mostly just eating fried breading. Also, its not the nicest place. Bare bones and small.To me, its not a bad lunch or if you want to be filled up for cheap. It basically reminds me of a fast-food Greek place. But hey, thats still \"A-OK.\""], ["Morgan M.", "My husband brought this home from me the other night.  I've been craving gyros and falafel like whoa so he grabbed those (and I'll forgive him for forgetting about the meat pies that sounded good too).  The caveat of this review is that I'm pregnant and so I might be a little sensitive to certain things--namely I was a little overwhelmed by the onions on the gyro.  Also, the meat was in chunks, which I thought was a little strange, since I'm used to it being shaved.  However, the pita bread was delightfully fluffy, the flavors were good and the falafel was pretty good.  The tzatziki was a little thin and in absolutely tiny containers.  So I liked it but I didn't love it.  My husband said that the food looked really good and that they might have other specialties.  Oh! And he grabbed some baklava and it was solid."], ["Siva Y.", "This place is pricy for Mediterranean food! Usually you can get  good Mediterranean food for around $10. Paid around $14 for platter. Expensive Mediterranean food!"], ["Joe R.", "This is your typical hole-in-the-wall place that you discover through a friend. Very friendly service and the food is excellent. Authentic Mediterranean cuisine with a mix of casual diner food. A bit cramped and loud depending on when you go. It a great stop before a movie or to get lunch if your in the area."], ["Donna O.", "Pita Hut is proof that some of the best food comes from the humblest shops. It's along High Street, near Morse - but with big, bright LED lights all around the storefront, you really (REALLY) can't miss it. The restaurant is small, but very clean and there are booths for dining in. Their menu selections are posted in large type with photos on an overhead board and the staff are happy to answer questions and suggest menu items. Vegetarian, vegan, halal, gluten-free - you are going to have plenty of options.I've been coming here since they opened, and I am (sorry not sorry) admitting to only ordering a couple of things in all that time - their gyro plate and their falafel sandwich. SO good. The falafel is fried on order, so always fresh, hot and delicious. They put those heavenly little things into a pita shell along with hummus (mmm), pickles (yum), red cabbage, lettuce, onion, tomato, and creamy sauce. A balance of everything necessary for an awesome sandwich experience, that's what you're getting. The gyro plate is a deconstruction, with plenty of spiced beef/lamb...but I really want a falafel sandwich if I'm at the Hut. It's that good.Pita Hut's sides are fresh and delicious. They have the Mediterranean-middle East crack fries (big, soft inside, crispy outside, dusted with spices), baba, hummus, cauliflower & eggplant salads, tabbouli, etc. I like their cauliflower salad better than the fries! Desserts run more to baklava and cheesecake, but there is kunefe and other shredded wheat-based sweets. Drinks are standard cans and bottles of soda, a few fountain options - but there is plenty of variety at their carryout next door (which is owned by the Pita Hut folks) or take your food over to Bob's Bar and pair up with your favorite beer. Best bar food ever."], ["Julie H.", "I went here on a Sunday afternoon. The restaurant was not crowded, but the service was a little slow. I think they may have had some take-out orders to do. I ordered at chicken gyro. The flavoring was good, vegetables appeared fresh, and the gyro was loaded to the max. I also ordered a side of fries. They have good fries with special seasoning. Everything is made from scratch and fresh to order at this place. The staff was very friendly. I enjoyed my visit here and will probably make another trip here at some point."], ["Lauren M.", "First time here, and I tried the Chicken Sandwich.  Service was friendly and fast, and it tasted really good.  Will definitely be back to try more."], ["Peg G.", "Best middle eastern food in town. The eggplant and cauliflower salads, especially, are excellent. Love everything here, though!"], ["Taylor O.", "A friend recommended this place to me after they just discovered it.  I came after a Crew game to grab a quick bite to eat.  This place is located in the Graceland area and it's in a small strip next to Bob's bar.  It's a small place (had about 4 booth tables) with a one man operation.  This place reminds me of Souvlakis in Athens.  Very friendly service and so was the lady waiting in line for her food.  I told her it was my first time and she said I would love everything they have and I mentioned I was having a difficult time choosing because everything sounded really good.   So I started off basic with the falafel platter with houmous, baba ghanoush, and the tabbouleh salad.Everything was very fresh tasting and good, except for the baba for me.  It had a really strong smoky or some other spice flavor that I wasn't used too.  It wasn't horrible at all, just a different flavor that I wasn't used to yet.  I ate about half of it, to get used to it's flavor.There was plenty of food to eat, as I left here completely satisfied and very full.  I look forward to coming back and trying some type of meat combo with some fries which looked very good."], ["Ryan K.", "If you're wondering whether or not to go here, do yourself a favor and go. Walk, bike, drive, take the bus, Lyft, Uber, CoGo, Car2Go, Taxi (well, maybe not a Taxi)...doesn't matter. If you like cheap Middle Eastern food, go here.First and foremost, I've tried falafel all over this city, and I will tell you this place has the best. At one point, Pita House (East of Bexley) had better, but they changed ownership and now they aren't as good. Why is their falafel so good? They fry it to order, for one. Drawbacks: This place is tiny. There are three, maybe four booths and no other seating. Don't go after sundown during Ramadan...it gets uncontrollably busy then. If you're driving or biking, turning left into this place is quite difficult. Turning out can be difficult as well.Other things I like about Pita Hut: the menu is more than just pita sandwiches, Bob's Bar is next door, staff is friendly, cool mural on the wall, open until midnight.Maybe I'm a little obsessed with Pita Hut. Or maybe you're not obsessed enough. You decide."], ["Barb H.", "Actually, my food was disappointing.I could barely find the tzaziki sauce on my super gyro.  It really needed more.  Also, some of the lettuce was brown as in old.  Which is surprising because I'm sure they go through a ton of it.  But it's what happens when you cut iceberg lettuce and then leave it in the fridge for a while.  Also, my eggplant salad was not that great.  I have had it there before (a while ago) and it was delicious.  This had some charred pieces of eggplant which tasted kind of burned and it was probably 1/3 onion.  I like onions but it should not be the main ingredient in eggplant salad."], ["Katie W.", "Just got a shawarma sandwich on my way out of Cbus, and it was pretty tasty! Had a lot of good ingredients that were balanced, and the meat was well seasoned. The guy made sure to evenly distribute all the ingredients so that I wasn't taking a massive bite of only hummus, and that's a sign of a well made pita sandwich!"], ["Jen M.", "Cheap and delicious eats. The falafel is hands-down the best I've had in Columbus, and they scoop it fresh from an ice-cream scoop right into the fryer. The french fries are thick-cut with seasoning on them; they come out of the fryer hot and yummy. I also appreciate that the sandwiches taste noticeably different from each other, even though there's some overlap in ingredients. The Super Gyro is my favorite sandwich on the menu--delicious, straightforward, and you can really taste the meaty slow-roasted goodness. You can get better gyros elsewhere in Columbus, but I dare you to find one that matches Pita Hut Grille in bang for the buck. The falafel sandwich is very good too--no surprise there since their falafel is fresh and amazing. I love the simple, no-frills, family-business vibe at Pita Hut Grille, and the service is super fast."], ["Sailesh P.", "I dig their cauliflower salad. My favorite. Then their Cajun fries and shawarma platter. These guys make great food at decent prices."], ["Katye M.", "I've been here a few times as it's next to Bob's Bar and we usually grab food from Pita Hut while we're watching games at the bar.  Pita Hut has wonderful food and great service!  I went to Pita Hut yesterday and had the falafel sandwich combo... they add the toppings you want and the falafel is made to order (well, put in the fryer). I've also had the hummus as an appetizer and they add whole chick peas and a spicy sauce on top (I think it's the green sauce), which makes it perfect!  I would highly recommend trying the Pita Hut - it's quick, easy, and very good!"], ["Pete S.", "By far the best pita in town. Chicken, Shawarma, Kabob, Falafal... everything is excellent.With a couple great dive bars right around, this place is a standard stop at least twice a week. Kibbeh and grape leaves, tabouleh... stop reading and go get a pita."], ["Tammy A.", "Pita Hut is great for like a lunch. I came here with my family a couple of times and for me it's nothing special. As Christina said some of the food may taste dry and I've only experienced this when getting it to go for a potluck style meal. For me this is like a fast food chain"], ["Adam R.", "Great food- highly recomend their falafel and the shwarma combo. Love Bob's Bar, too."], ["Mike B.", "This place is delicious!We just got a few things, but the falafel and the hummous were out of this world.To make it even better, it's all CHEAP.Definitely stop here if you're on High street north of campus."], ["Matt W.", "They're not perfect by a long shot, but I think Pita Hut has the best hummus in town with it's silky texture and outstanding flavor, solid falafel, and their shawarma is fantastic - though I'm not a big fan of the price, which is a couple dollars higher than most other Mediterranean restaurants around Columbus.The counter service varies wildly - I've gone in at times where they were attentive and happy to take care of me quickly and easily, and times where they seemed very disinterested and there were some major language issues to work through to get what I was looking for.The best part, though, is the way Pita Hut is open late thanks to their relationship with Bob's Bar. Need food in a pinch at 11:00pm? Go for it, and good luck."], ["Kelly M.", "Best falafel... ever! Sandwiches are amazing. Everything I have tried is great, though I usually get the falafel sandwich. I have seen people buy bags of their pitas, too. We go back constantly, so I only have the best things to say about my experiences at Pita Hut."], ["R Y.", "I've been coming here for ages for the delicious falafel and fries but one day something made me try the cauliflower salad. Best decision ever. Best salad ever. I'm totally hooked; never would have imagined that deep fried cauliflower and peppers served cold would be one of my all-time favorite meals. It's a hole in the wall that's well worth navigating your way into the tiny parking lot. Friendly service, tons of vegan options, and late(r) operating hours."], ["Izzy J.", "Some people complain about Pita Hut being dirty or the employees being rude; both I have yet to notice. Regardless, it's the best falafel in town and the only one that doesn't make me sick. I stop in so often to pick up dinner that the guys behind the counter know my order - falafel combo, no onion, extra pickles. My godmother, who lived on a kibbutz in Israel and has returned there many times since, says that theirs is the only authentic, Israeli hummus she's found in the states. But you should go see for yourself, I highly recommend it."], ["Bill C.", "Good stuff. Falafel is really good stuff. Nice guys."], ["Alana H.", "THE SMELLS. THE SMELLS! I walked into this place at around midnight on a Saturday night. Pretty tipsy....at least...HAH, anyway, this place made my night.It smelled so darn amazing in here it was incredible. I just wanted to sniff the air forever. I asked the man at the counter what made it smell so good [in my drunken state] and he said they home make everything in house. That was refreshing; knowing my late night delight was homemade, haha.Anyway, we only got one item, the gyro. And it was gooooood. I can't wait to come back here and try more items. Like Samoas! or something! I don't know, but this place was cool and tasty! Hit's the spot-late night!"], ["Luke T.", "Pita Hut is one of those places I should've reviewed a long time ago. It's a gem of a restaurant and I love to eat there. The falafel is the best so far that I've found in the city, and I have tried a lot of falafel in Columbus. The price for the veggie and falafel is really cheap, as is the combo or platter with either.  The store opened after I went pescetarian so I can't say anything about the meat offerings, but they do good business so my guess would be it's tasty too. They have several halal offerings as well.They are open pretty late because they get business from Bob's Bar next door. The seating area is rather tiny. Takeout is somewhat encouraged by the layout and if there are more than four or five groups you won't have much choice but to get your food to go. It isn't usually that packed though."], ["Annie K.", "This is exactly what we were looking for as out of towners who found ourselves in the area at lunchtime. We both got the falafel platters - the pita was warm and fluffy, the hummus and baba ghounjoush were spot on, the cauliflower salad was amazing, and the falafel itself was really good. Would definitely recommend it if you're in the area!"], ["Katie B.", "This place is slap-yo-momma good.  Best middle eastern I've had in CBUS.  They offer the full spread and will give you samples of everything if you ask.  Love this place!  My personal favorite is the shwarma w/ the pickled radishes."], ["Birdy N.", "Great food, low prices, healthy too.Very near our house, and we take out almost once a month.The hummous is the best in town by far, and probably the best I've ever had [and I have lived in the Middle East]. The falafels are outstanding too.The tabouleh and kibbeh are very good too. I am not crazy about the meat dishes, not that they are bad at all, but they are nowhere close as good as the other stuff.Not many seats, and they could do without the bright white florescent lights. Service is very efficient, but dont expect a big hug."], ["Christina C.", "Falafel bites: OkMeat pies: Really dryHummus: Pretty goodDuring a trip to the neighboring drinking hole next door, I was hungry. And I noticed some of my fellow patrons at the bar nibbling some goodies. Thankfully, the bartenders generally don't mind if you order take out and bring it on over - so I confirmed, then I did.After reading some of the reviews awhile back, and making my own assumption that I *had* to try this place, I was delighted to see it was right next door to the bar I already planned on visiting.It honestly reminded me of a little restaurant that I'd find along the streets of NYC - and I liked it. Everything seemed and tasted authentic enough, I just wasn't wowed.Thumbs up for the Yelp AND SBB stickers on the windows though!"], ["Tori W.", "This is a great gem for mediterranean food in Columbus. The falafel and tabouli are the and best I have tasted in this city, and the same can be said for the hummos, which includes a little garnish of chickpeas and pickles! The cauliflower salad and the eggplant salad are both recommended side items that have green olives, and red, green, and yellow peppers. Baklava is a must have item! I would recommend getting food to go, as the lighting is pretty harsh and unforgiving."], ["MJ L.", "Been hearing about Pita Hut for over a week from a friend who raved about the place, so we stopped here for dinner on Friday.  What an interesting location... I don't quite know how to classify this area and the \"strip mall\"...?  It felt real tiny as did the restaurant itself - once you walk in, you are right at the ordering line, to the left is the \"kitchen\" with all the ingredients and food already made, sitting out in the open and ready to be assembled into a sandwich or a plate of food.  To the right is a row of small booths for peeps to sit down.  At the (not so far) end of the restaurant are the bathrooms and trash cans.  Very tiny... Murals and decorations on the wall were clever attempts to make the restaurant look more open, inviting and such but when all the tables are all greased up and haven't been wiped between patrons, none of the nice attempts will matter.  We got a sharwarma sandwich, a gyro sandwich, a small hummus, a fried meat dumpling looking stuff and a drink.  For a grand total of $22 or so, I expected either more or better food, but what I got was a tiny, flavorless pita bread for a thing of hummus, 2 small sandwiches and a bland meat thingie.  While the sandwiches were fresh and generally good, they were totally lacking in meat quantity.  Meat dumpling thing was bland and luke warm.  Hummus was also on a bland side.  I've had much much better for less money at a nicer and cleaner place like Lavash, Loop's, Anna's Greek Cafe... Worst of all (and the reason for only one star review), I have been sick with stomach cramps and diarrhea all weekend after eating at the Pita Hut on Friday.  I will never return to this place."], ["Jason S.", "A review of Bob's Bar can only be accompanied by a review of Pita Hut.First off -- it's Pita Hut. Not Pita Pit. That's down on campus. I've heard the latter name enough times in reference to this place that it has to be made clear exactly where we're talking about, lest you end up a couple miles too far south on High Street.I've developed an unhealthy obsession with their pita sandwiches, specifically the meat, shawarma and falafel varieties. The \"meat\" variant is my main choice, specifically featuring lamb pieces as the tasty animal. Ingredients are stuffed into a warmed pita pocket, generally featuring the chosen main ingredient plus a mix of hummus, onions, vegetables, pickles, tahini and optionally hot sauce. What starts as crisp bites of veggies and tahini evolves slowly as the meat mixes in with the toppings, gravity pulling the liquid ingredients and remnants of the others down to the bottom in a sublime melange of sauce, seasoned meat and pita. Don't waste an ounce of that lovely liquid mixture on a napkin or your shirt, or you'll regret it for days...if you can make it that long 'til your next fix.Even though I live well off in Dublin, I find myself braving High Street often for this quick, delicious sandwich, even when I'm not visiting Bob's. The rest of their menu I could honestly take or leave -- I find the eggplant salad tasty, and the rest of the menu pretty good but not overwhelmingly so. Friends who've accompanied me in the past got platters and didn't quite understand what I was raving about.I tried to tell them. The secret's at the bottom of the pita."], ["Sabrina L.", "It isn't much to look at but Pita Hut has hands down the best falafel in town.  The texture is perfect (texture is where a lot of falefel goes wrong) and the taste and color are both spot on to what it should be.The falafel sandwich comes in a pita with lettuce, tomato, cucumber, sauce, and pickles.  The sandwich ingredients aren't always top notch, but they seem fresh, cut that day, and the area around them is kept clean.  Those things can be equally important!You can order the sandwich in a combo with fries and the price is still less than anything you'll get take-out from most of the restaurants around. I've read a few of the other reviews that have had problems with men staring but I've been in a couple of times with girls from work and we've never been treated with anything but the utmost politeness.  Also, on one occasion I had just grabbed my tray and I was eating in that day and dropped it, spilling food and fries everywhere.  It was completely my own fault, but the man behind the counter replaced all of my food and my drink for no cost and even gave me a piece of baklava because I'd gotten food all over my shirt and I looked sad about it.  That sort of service is above and beyond and definitely appreciated."]], "Mezze Middle'terranean Cuisine": [["Alisha A.", "gyros like no other! soft, warm, fluffy, fresh.. and their baklava! mezze is absolutely to die for."], ["Miro N.", "Absolutely love the place. So many ways to order your food and comes out great everytime. I love hummus so the obvious choice was the hummus plate. The schwarma was spiced perfectly. The fresh toppings of tomato, cucumber, lettuce makes the hummus extra tasty. Will always come back to this place."], ["Tim D.", "The atmosphere here is sort of a crossover between a Mediterranean chipotle and a cafe. Menu selection and building your entree is well spelled out even for the novice. The selections are good. Went with whole family at busy dinner hour on a Friday- place was jamming but management is hands on and proactive.   Service was pretty fast.   food was really good. Had gyro made spicy and it was delicious... Sampler dipping tray was yummy.  Bit overpriced!  But so darn good and fresh.  Very good experience my stuff for school is in the Charger so can you be back as soon as you are ready -Alek"], ["Michael W.", "Solid value and tasty preps.  Kind of like a Medi Chipotle, but so much better and worth the wait.  Very fresh and tasty. You will likely be a fan if you try this place.  Recommend the mujadara with shawarma.  Fries and tabouli are also great."], ["Tony T.", "I walked in tonight (Friday) and the place was rather empty.  3 people were eating in. Anyway I placed my order, and stood around for 18 minutes waiting. 3 people AFTER me got their to go orders made and handed to them before mine was even started. I watched it it made, then it just sat there for 5 minutes before someone wised up and called my name. It seems the gal making everything knows how to run a restaurant because the heavier set guy sure as hell doesnt. Now let's just hope it good. This was my first time here and I'm pretty pissed about the customer service.Edit.Ok. So, it's tasty. BUT, It was stone cold after my 5 minute drive. Tahini overload, I had to scrape nearly all of it off. I'd try again and hope for better results."], ["Krina K.", "I love this place. I've brought my friends here multiple times! The restaurant is clean, the service is fast and friendly and the food is delicious! Definitely one of the best mediterranean food places I've found in Columbus."], ["Kyra T.", "Soooooo good! They are super friendly and everything is delicious. It's like a Mediterranean version of chipotle. The hummus is my favorite."], ["Brent O.", "Eh... So so"], ["Jackie K.", "This is the best Greek food ever. Everything I've tried is flavorful and just the right size. Small place but their always good service."], ["T'Ria E.", "I have never had a bad meal here yet! Super friendly staff and quick.  I love the Greek salad and their spicy feta"], ["Lisa D.", "Update to my prior review. I went back a week after my prior review and it was basically the same :( After that I got a message on yelp from the new owners offering me a free meal and apologizing for my experience. Not necessary..but very nice response. So I went back a 3rd time give it another try (on my dime)  and was happy I didn't give up on this place. The service was back up to the level it had been previously! I ordered my standard  tilapia salad and it was full of fresh ingredients and the fish was cooked perfectly. I also got a Mezze plate with spicy feta, hummus and the eggplant salad. The hummus seem like a different recipe- not as oily as hummus can be..really thick and very nutty tasting..I really liked it. The eggplant salad was really good and is my new favorite. I'm glad I went back that 3rd time!!"], ["Jessica W.", "It was great! Falafel was super good. Everything was very fresh and the staff was so nice and caring. We will definitely be back."], ["Safiyyah A.", "I ordered take out for dinner last night and it was better this time than the first time.  The portions are large to me so I eat mine over the course of two days. This was my boyfriends first time and he loved it. We both ordered bowls. I always add the feta and olives as the premium toppings."], ["Nikalete F.", "We frequent here for lunch. The service is always great and so is the food. Love the \"middle\" twist to the typical Mediterranean fair."], ["Jessica H.", "Great stuff!!loved the beer from Cyprus, there's also Mythos.  I hope they might offer a bucket special on a saturday afternoon someday...Tabbouleh is fabulous with just the right amount of bulger in with parsley and mint.Loved the summer eggplant salad and their homemade dressing.  The baba and hummus were also pretty sturdy.  LOVE the mujadara - that could stand alone as a meal - it's a hot lentel base mix for your fixings.Falafel was good.  There may have been a bit too much cumin?Spicy feta was good, but too spicy for mild-mannered me :)Justin is fabulous and funny, even though he is a Steelers fan.Preferred the bakalva to the chocolate balls."], ["Laura J.", "Went back again recently.  Pleased to find they still have the same excellent food and excellent customer service."], ["Nicole W.", "This place seems to get pretty mixed reviews but I have no complaints. I actually came here based on other Yelpers' good reviews and I am so glad I did.Yes, I see why the comparison to Chipotle. But really, beyond the way the counter and ordering is set up, the comparison stops there.It was our first time there, so the staff gave us a sample of EVERY SINGLE ITEM ON THE MENU. We even told them they didn't have to, because we weren't all that hungry, but they insisted. Well, I'm not going to argue about free food. It wasn't the absolute best Mediterranean food I've ever had, but it was pretty darn good. The baba ghanouj was delicious. I could take or leave the spicy feta, but I get it that they want to have a gimmick. Falafels were flavorful and crispy, the tabouli was perfect. The owner personally came to thank us for coming in.The food is probably a 4 - 4.5 star experience, but the service definitely bumped it up to a solid 5. Well worth a trip to Hamilton Road."], ["Grant C.", "The Mezze plate is so good I've considered taking intravenously.  Puree it and bang in up my left arm yo!Just kidding but its damn good."], ["Laura H.", "Best kept secret on Hamilton Rd.  Best staff and flavorful food.  Walk up and order establishment. Cost is good. Try it. You won't be sorry."], ["Mike D.", "Review update to say Mezze is still going strong a year after my first review.  I still love everything I've had here and I keep going back for more on a regular basis.  The chicken gyro has a nice blend of spices on it, and if you want spicy the spice it up option will definitely get you there.  Service with a smile can't be understated, and everyone here is great.  Johnny is the owner and a super nice guy, and Justin is also awesome and works behind the counter most of the time.  I'll forgive his Steelers hat due to his awesomeness.I have really been enjoying the falafel and feta here.  The feta is really delicious.  Really.  Bottom line, everything is still excellent.  Check it out."]], "Lavash Cafe": [["Eric E.", "In town for a medical conference and went with two middle-eastern colleagues. Menu was vast, prices were very reasonable, food was quick, hot and excellent. Owners were super friendly and the place was clean. Wish it was in SoCal so I could go all the time! Two thumbs up!"], ["Alexa L.", "Went here for lunch today with a friend and started with the hummus and falafel appetizers. The hummus was very flavorful and the pita bread it came with was super fluffy and delicious! The falafel was also good. I got the lamb shawarma entree, which was good,  although the lamb was a little bit tough. For half the price my friend got the shawarma sandwich which came with just as much meat as the entree, but just didn't include rice. I would definitely go back but would order a sandwich next time. The food came out very fast and service was excellent. Employees were quick to clean up finished plates, and the owner even  came around to each table to ask how the food was. I can imagine the place gets pretty crowded on busier days."], ["Allyson L.", "Best. Hummus. Ever. Beyond that, all the dishes I have tried here were fantastic. You can tell that everything is fresh and homemade. So far it is my favorite Mediterranean place in Columbus."], ["I S.", "I live about 2 minutes away so I have frequented this restaurant too many times to remember. I would say Lavash has some of the tastiest Middle Eastern food in Columbus. The food is always consistently delicious whenever I come here, whether having order online or in the restaurant. I usually get their babaganoush, hummus, falafel, or shawarma sandwiches/platters. Their salad is also very good, seems like they use  fresh vegetables. It's a very casual restaurant if you want to sit down and eat, therefore I don't understand why their prices have been soaring. It costs about $8 for a shawarma sandwich and that does not come with any sides at all, and a shawarma platter is $15.  A couple of years ago, you could get a sandwich for almost $6 and a platter for maybe $10 or so. I have not been going as much because despite the quality of food, I cannot justify paying that much money for a light sandwich. It's quite disappointing, and I hope they make their prices more reasonable in the future."], ["Matt H.", "Great food! Falafel was really on point, fresh, and crispy."], ["Abby S.", "I got the lamb kabob and it came with one stick, containing maybe 4 cubes of lamb with a sliver of green and red pepper and rice. The lamb was ok, nothing special and the rice was tasteless. For $15.00 I expected more."], ["Kate H.", "Solid.I would be in 5 star territory if not for the confusing way this place is laid out, the difficulty in ordering and the chaos which ensues when you eventually get your food.The people are really friendly (especially the owner), the food fresh and fantastic. It is well worth the confusion."], ["Leo Y.", "The place is slightly misleading, as what they call \"lavash\" is just a wrap, likely whole wheat judging by the taste. I almost dinged them a star for that, but I guess it's probably healthier for me that way anyways, so I'll keep it. I had the lamb kabob lavash, and the lamb melted in my mouth, with the taste and texture of the inside of the sandwich being perfect. I will get the pita next time, as I'm not a big fan of wraps. They had a great selection for both lunch and dinners, an impressive choice of desserts, including baklava, dates, and tiramisu, and a neat little soda dispensing machine with a touchscreen. There was both indoor and outdoor seating, the staff was great, and the pricing was very reasonable."], ["Zeb L.", "This place's food is all over the map in terms of quality. The grape leaves were not very flavorful and did not taste very authentic; we ended up tossing them. The Shawarma and the sandwiches are pretty good but nothing to write home about. However, the baklava is very, very good. The prices are too high for me to go here regularly, especially given that the food is inconsistent, but if I'm at Growl I might stop by for the baklava again."], ["Sharon B.", "We discovered Lavash a few years ago, after reading a listing of some of the top sandwich restaurants in Columbus. This place has never disappointed us. The meats in the cold case - kabobs, raw lamb chops, etc. - look good enough and fresh enough to almost want to eat them raw. The tabbouleh is fresh, fresh, fresh, with plenty of parsley to give it crunch. If I thought it would hold up on the 3 hour drive home, I would buy it by the quart. Their pita is equally delicious; I am not sure if they make it in their own bakery, but the bread chef should be applauded. Portion sizes are quite generous; their sandwiches with one side should be enough for most appetites. This time, I had the beef/lamb shwarma; the meet was a little they this time, but the flavors are still perfect. BTW, one order of fries is enough to serve two people. I can't really speak about the dessert selection; it looks beautiful, but I am not a fan of baklava and the like, so I can't really address that area.When I have to go to Columbus, I often try to figure out how to include a trip to Lavash, no matter how short the visit will be. I wish them a long and profitable future, which gives me ample opportunity to enjoy their offerings."], ["Jeff B.", "Their food is fresh, made from quality ingredients, and is authentic mediterranean food... the best in Columbus I have found so far!  For some reason, Aladdin's is popular among many people but in my opinion, Lavash is one hundred times better in every way.  The prices are very reasonable and the food is always high quality.  I highly recommend it!"], ["John M.", "As someone who lived in the north campus/south Clintonville area for many years, it is difficult to talk about Lavash Cafe, about their menu, their service, their prices, etc, without talking about the elephant in the room.  And that elephant is called Aladdin's Eatery, which had been a solid Clintonville fixture in Greek/Mediterranean cuisine since I was an undergrad.  Lavash made its Columbus debut by moving in two doors down from that much-loved elephant, which is a ballsy move by anyone's standard's, and so it got me thinking: these people must be pretty confident in their product.And make no mistake, their menu offers up much of what Aladdin's offers, but where it seems to stand out a bit is the boldness of their flavor palette.  From their spicy black bean hummus to their falafel (and their fantastic red snapper entree -mon dieu!), your taste buds are sent on a nice little coaster ride.  What's more, the portions are surprisingly generous.On the downside, however, I was disappointed to see the price increases, some dramatically higher, since my first visit.  Also, their desserts leave something to be desired.  The baklava and basma seemed to be a bit stale and somewhat bland, but these are bite-sized and cheap so I let it pass.All in all, these guys have given every Greek/Mediterranean restaurateur a good run for their money, and good for them for doing so.  Factoring in everything, I can't say that it has unseated Aladdin's in my mind, but if I told you I'd never go back to Lavash Cafe, you could safely call me a liar, liar, pants on fire."], ["Kevin D.", "I enjoyed Lavash Cafe but wouldn't return. The pros: friendly service, nice casual atmosphere, big portions, fancy soda machine with dozens of flavors, food made fresh, big dessert selection. Cons: I just didn't love most of the food. Compared to other middle eastern restaurants that I frequent in other cities, I didn't care for a few of their dishes, specifically the falafel, grape leaves, baba ganoush and pita (very thick and bready). This is just my personal opinion however - I don't think anything was made poorly, they just weren't my taste. I think Lavash Cafe is definitely worth a visit."], ["Tiffany W.", "One of my favorites in Columbus! The food here is amazing and the portion sizes are generous -- I usually end up taking some back with me and it makes for a great lunch the next day. The hummus and pita are absolutely delicious, especially when the pita comes out fresh and warm. =) Their main entree dishes are also excellent. The rice is flavorful and delicious, and the meats are really well prepared. I don't even usually like lamb, but I have really enjoyed their lamb dishes! I've tried their biryani, shawrma, shish kabob, kefta kabob, and fish. I've loved everything I've tried so far! Also, their freshly squeezed juices are amazing! A little pricey ($4 for a glass) but makes for a nice addition to the meal or to take back with you. Their dessert selection that is on display is always super tempting -- I have had their baklava (because I love baklava) and it's pretty good, though I will admit I usually don't have much room for dessert after a meal here. Overall, service is great. Seating and parking are easy to find even during peak times, and food is delivered to you pretty quickly."], ["Bethel T.", "I really love this place! The people here at friendly, all the way from the owner to the staff. The meat they have is just so tender and moist and seasoned to perfection. I tend to get lamb chops when I go and love it with the garlic sauce. I'll say this is really one of my favorite Mediterranean eateries I've been to and that I've actually voted for on the 614 mag for the Best in Columbus edition."], ["Jayson L.", "Extremely authentic. My date was pescetarian and had been here before quite a few times so I had her order for both of us. For her the mixed vegetables and rice. For me the Lamb Moussaka. Yellow rice adorned with sliced nuts. Then a mediterranean style lasagna composed of ground lamb cooked eggplant sautéed onions. Fi on top a creamy cheesy mixed vegetable topping which had a thick crust on top to give some added texture. I wasn't so sure I was going to like it as me and my date discussed it eating our small starter salads. We were also give pita bread to go along with it. The flavors were interesting and different but also very good haha. The lamb onion eggplant mix was great and the cheesy cream was alright too, although I thought the crust was the best part. I also thought the lamb could have been slightly more seasoned, but that's just me. Everything here is super authentic and pretty damn good. I'd recommend stopping in if you ever find yourself in Columbus."], ["Andy P.", "I recently got into Mediterranean food, and this place was really good. I got the lamb skewers. I really hate dry meet, so thank you it wasn't dry. The rice was a little dry for me though, but they have nice condiments like olive oil  and other sauces. The service wasn't really that friendly, but they did their job. The decor is interesting with multi-color, and it was definitely different. Very homey feeling to it and great for groups of family where you can share portions. Where you order food also reminds me of a deli style and the wait for the food isn't long.They had a lot of meat on display, which made me want to order everything - especially the kabobs!I want to come back here with a group of people and have a family style sharing dinner."], ["Kent K.", "The main thing I have to say here is that the food is The Taste!! I got the Lamb Mousaka, some kind of lasagna type dish with ground lamb, cheese and fried eggplant instead of pasta, and rice on the side. Plus meals come with a salad and a plate of hummus and pita bread. Unfortunately there is some bad I must add. The food is overpriced, in my opinion. If this is a high class sit down and order type of restaurant it would be ok. But it not. So you see the price and expect more out of the place. Or maybe you see the place first and expect lower prices, but whatever. Plus they had some food pre-made, which is great for take-out, but it makes me question the quality.  And I must mention the Turkish coffee! C'mon, coffee is meant to be consumed alone, not with 30 added spices! I realize though, Turkey is a foreign country and that's fine if they want to make it like that. It's good for 1 or 2 demitasse full. Anyways, it is good food which is hard to argue with. Overall I was impressed."], ["Mike H.", "Nasser runs a tight ship with a friendly staff and excellent, fresh food.  Thanks!!!"], ["Nick G.", "The food, and SERVICE was amazing... If you go here, you must try the fries!  There was confusion around our order, but EVERYONE there made it MORE than right! Thank you for a great experience!!"]], "Sababa Mediterranean Grill": [["Colleen R.", "Out of all the fast-casual Mediterranean places in Columbus, Sababa is definitely my favorite. The process is pretty simple - Pick your base, protein, veggies, and sauce. I always go with the greek chicken salad or bowl. The brown rice with lentils has a lot of flavor so I would recommend that if you are getting a bowl. All the veggies are really fresh and crisp. I love that I can get diced pickles in my salad! Whatever you are getting, top it off with the house sauce and you can't go wrong. The brown to-go containers are very deceiving. I always think the portions are small until I'm actually sitting down and eating my meal. I usually struggle to finish a whole bowl. They give you a good amount of food for the price. Oh, and the spicy feta with pita is amazing. Definitely get that. You must stop here if you are in the area. Even if you aren't, Sababa is worth the drive to the east side!"], ["Taylor O.", "Second time here, and I am definitely a fan.  This is the \"Chipotle served\" style on Mediterranean food, and it works really well.  You get a nice warm welcome when you first come in.  They will start you off with small samples of their rice's, sauces and proteins.  You pick your base, the Lentil Rice here, I could take pounds of it home with me and eat it for days, I liked it so much.  Then your protein.  All of which I liked and it just made it harder to determine what I finally hungered.  Is that a good thing or a bad thing?  Finally, all the toppings and sauces you pick. Ohhh that house dressing is so.. so.. good!  mmm! mmm! mmm!  On my first visit, I had an awesome opportunity to try everything here.  I really enjoyed everything and there really wasn't one thing I didn't like.  One thing that stood out was the Baba, they got the smoky flavor just right for my liking.  I finally tried grape leaves for the first time, and loved them so much, that's the main reason I couldn't wait to come back a second time.  It was something new that I've never had before.  These are served cold and filled with rice and spices.  It's definitely something different.  The fries here are excellent as most fresh cut fries can be, but they're so much better with more of the house dressing to dip them in. :)  I really need to buy some of that to take home with me the next time I'm there."], ["Grant C.", "Fantastic Mediterranean food. Best falafel we've ever had!  We usually go in for the Greek chicken, cinnamon rice, and toppings -- then my wife & I split a mezze plate consisting of falafel, hummus, and tzatziki. We love coming in, always fast and friendly service."], ["Bryant M.", "Sababa not only makes me throw down all my stars, but also makes me want to give them all my money. It's that good. I mean... your food had better be pretty good when you have the falafel balls to name your restaurant after the Hebrew slang word for 'awesome.'I assure you, the name does not set you up for disappointment.Sababa is the latest brainchild of Johnny Baransi, who -- so graciously -- brought Mezze to our city and our tastebuds. So if you liked Mezze, which he no longer owns, you'll love it here. The food is Mediterranean + Middle Eastern, and Johnny makes everything fresh and from scratch every single day. Vegans, vegetarians, paleos, and GFers rejoice: there are countless, delicious options for you! Here's the scoop on ordering:1. Choose a base. There's hummus, salad, and two types of rice. I've tried everything except one type of rice that has vermicelli and is not GF. You seriously can't go wrong with any of them.2. Choose a protein. I'm a big fan of the chicken shawarma, and the falafel (which is made fresh to order) is my favorite in the city. 3. Go crazy with the toppings. The veggies here are no afterthought; they're outstanding. Some of my faves include: kalamata olives, Israeli pickles, banana peppers, and feta.My order usually rings in around $10, and I always have leftovers to take home. I think that's a total steal for such high quality, fresh food. Add on top of that the stellar customer service, and Sababa is a homerun for me. Sure, it's a bit out of the way, but this food is so craveable -- it's worth the drive."], ["Stephanie P.", "I am totally going to start following Bryant around since he keeps finding awesome places like Sababa. Sorry in advance about the stalking!After the fantastic Yelp event here this past weekend, I brought my husband to Sababa last night. Johnny was working the counter and greeting everyone. He was also handing out samples to every person who answered \"Yes\" to his inquiry about whether they've been there before. Happily, there were a lot of first timers coming in last night. I ordered basically the same thing I had on Sunday, the husband had the chicken shwarma on a pita. We also grabbed an appetizer of the super tasty hummus. I stuffed my face of extremely good food and watching Johnny work the crowd. He never stopped moving, explaining the menu and handing out samples. This is one of those places that has something for everyone, feeds you well and is super affordable. I am happy that it is so close to my house because we will back often."], ["Gwen W.", "Johnny (owner), and the staff, are all about one thing it seems: Customer satisfaction!! Not the type of business that relies on profit as their main motivation. Sababa has pleasing the customer front and center, profit margins are not a main point that's stressed. This is why they're so damn good! If you build it good, we will come.My first interaction with Sababa was at a Yelp Elite event Sunday evening. I fell head over heals for their food, so I went back on Tuesday! This time, I knew exactly what I wanted. Salad. Add Chicken Shawarma, pickles, giant tomato and cucumber chunks, crumbled feta cheese and a spread of their house dressing. So freaking good. SO freaking good. The meat was just as juicy as the last time. And the side of fresh, hot, lightly seasoned fries stuffed me. And I still have half off the dish left :)"], ["Tammy A.", "I had this place bookmarked for a while so I wanted to visit it so many times. My friend even told me how great it is. This place used to be a Steak Escape and how I would know that is my sister would come here all the time. I'm assuming she is still coming here even with the name change because my family loves Mediterranean food being brought up with that food in our culture.Let me say I first came in clueless as to what the menu was like and it took me some time to think about what I wanted. I let several people go in front of me as they were coming in just so I could think about what I wanted. Let's just say I want my first experience to be good that I will want to come back no matter what the situation is. I saw Yelper Greg and it looked like he was enjoying his meal. Finally, I make up my mind within 20 minutes and say let's just go with a simple salad. Although I asked for gyro meat inside I don't mind I got the mild chicken. When your a clueless customer anything sounds good as long as the restaurant has left a good impression on you from the service to the food you receive. I was pleased with the service as the man working there apologized for my wait even though I did it purposely to look through their menu and give myself some time to understand what I really wanted.The atmosphere is like a Piada or Chipotle fast and you pick you base of rice, salad or pita . Next you pick your protein of gyro, greek chicken, chicken shawarma, falafel or veggie. You then choose your toppings and sauce. When you pay the dessert is on the side of baklava. Someday, I will learn to make baklava myself so that I don't have to buy it at a restaurant not that I don't like it there. You have your choice of fountain drinks, bottled water, iced tea or San Pellegrino. So you definitely have a wide array of options available to you. I highly recommend this restaurant if you want fresh Mediterranean food. I know I'll be coming back here soon!"], ["Greg B.", "Cleaned my plate!   This was one of the best gyros I've ever had.  Great food, and super friendly staff."], ["Annette F.", "Love! The owner is the nicest, most welcoming guy. He really makes you understand what they offer and lets you try anything. All of the ingredients are fresh and have great flavor. Similar to Chipotle style ordering. Lots of options. Wish it wasn't the only one!!"], ["Siobhan G.", "I finally got to try Sababa last week and it was deelicious! I have heard so many good things about this place from all my friends and it definitely lived up to my expectations. I am a little sad though that there isn't a location closer to me, I'd be there all the time! This place is also a \"chipotle style\" - choose your pita/bowl/salad, protiens and veggies. There are a ton of veggies, cheeses and sauces to choose from and they were all extremely fresh and tasted great. I would highly recommend trying their house sauce. I went with the pita even though I was warned it would be messy! I managed to eat almost half of it before it fell apart in the bowl and then I switched over to the fork and guess what - it tasted just as great :) Their french fries are a DEAL. $3 for a huge portion and they have a greek seasoning (kind of like a cajuny meets Lawry's Season Salt mixture) make sure you ask for this! I loved their  spicy feta as well (not sure if they charge extra for this or not).Anyhoo... Sababa you are far away, you are also yummy so I'll definitely be back!"], ["Matt W.", "I really do like this place. I need to say that up front because I do have some criticisms, and I don't want to give the wrong impression.Set up in a former Steak Escape in a little mini-strip mall on East Broad, Sababa is the brainchild of the family that used to run Mezze, and they've applied a lot of the same formulas to create a \"Chipotle style\" approach to Medditerranean cuisine.One interesting twist is that instead of setting prices based on protein, it's based on the style you want it served in. The cheapest option (unsurprisingly) is a Gyro, but you can also get your meal served over rice, as part of a salad, or in a big bowl (well, OK, it's technically a rectangular take out container) of hummus. That last one was a neat option for me on a day I was really craving some extra protein, but you get pretty good value with any of the options.You get your choice of proteins (Gyro meat, chicken, Shawarma, or Falafel) in the spice level of your choice (I found the \"Hot\" to be flavorful and spicy, but not too aggressive) and can add your choice of various veggie toppings or order sides to go with.Things are prepared right in front of you and generally put together very quickly, with things like falafel or fries being dropped to order. It's a good fast casual option, and everyone I've talked to there has been very upbeat and friendly. (After just three visits, I'm getting a warm \"welcome back!\" when I come in!)So where are my problems? Mostly in the pricing.. The base prices for entrees aren't terrible, ranging from $6.75-9, but then you run into a $1 upcharge for feta cheese, and a separate $1 upcharge if you'd like olives.Those are both staples of the cuisine, so why not just bump the prices of dishes by a dollar and make them regular options? Or offer a $1 upcharge for both?Sides are also oddly expensive - When you pay $7 for your gyro, for example, it's a bit daunting to pay another $5 for a side of fries or hummus.A tray of falafel for $4.50 isn't as bad (especially since you get a half dozen falafel to the order, but on the other hand I could just ask for double protein on my entree and have just as many falafel added, and save myself a couple of bucks.The offer of a 3 for $9 plate for appetizers isn't a bad solution if you're going in a group, but it's not really friendly pricing for a solo diner. Maybe they could look at offering half sized sides, and leave the larger portion as stand alone items?Regardless, I obviously think the food is worth going back for, and I do encourage you to check it out - just keep in mind that you may end up dropping a few more dollars than you would at some of the other Gyro shops in the area."], ["Bethany K.", "Not sure what to eat for lunch.... check yelp!Sababa is part of the new trend similar to Subway and Chipotle... pick your base and add the extras.  The difference between Sababa and the rest, Sababa is FRESH!  They make the falafel fresh right in front of you, and the rest of the ingredients are fresh as well!  The house dressing is AMAZING!I can't wait to try more of the menu.. I hope this restaurant does very well, and continues to expand."], ["Susan R.", "I don't go out to Blacklick often. Or at least, I PREVIOUSLY DID NOT go to Blacklick often, because Sababa is so dope that I now get out there every chance I get.When you walk in, if the owner's there, he asks if you've been in before. If you haven't, he feeds you with samples--meat or falafel, sauces, rice, so many tasty things. And everything is tasty. Everything. I don't even like falafel but I LOVE his falafel. (That sounds vaguely dirty but I'm rolling with it.) It's full of real chickpeas and moist and herbaceous and almost creamy in a great way. I also love every meat option. Gyro meat is great. Chicken is great. BOTH CHICKENS ARE GREAT. It's really to the point that I can't even decide which one I like best because they're so good. Their fries? Also good, which you wouldn't necessarily expect because it seems a bit of an outlier. They are crispy and browned just enough to be extra tasty and you can get toppings (FETA FRIES, HELL YES). I crave this food, full stop. So much that I kind of wish they had a sampler platter so I could just get a little of everything, every time. Because I would, and then I would roll myself out feeling so full but happily so."], ["Antonio T.", "Being from The South, one of the main things that I look for when I visit different restaurants is whether or not the food is well seasoned. This place definitely does not disappoint. To begin, Johnny is one of the best owners that you will ever meet. He was able to answer all of my questions and allowed me to sample almost everything on the menu before I made my purchase. All of the food and protein options available are very well seasoned and all of the other remaining ingredients are fresh and at the white church. I'm really enjoying a lot of the restaurants popping up in the city like Chipotle, Fusian, Bibibop and now Sababa, that allow you to pick and choose your ingredients and serve them to you almost instantly. I can honestly see this place opening many different locations throughout the city but, as of right now the only one is in Blacklick, which is close to me so I'm extremely happy. Once you have the opportunity, make sure you go and visit them soon. You can thank me later"], ["Gus W.", "My buddy and I saw a 'Coming Soon' sign for this place a couple months ago in the old Steak Escape spot on East Broad going toward Blacklick and were eager to give it a shot, since we love gyros, falafel, and all that jazz. It looked almost complete, but I don't think they opened until the past two weeks. Well, that's when I started seeing reviews pop up on here, so I knew it was time to check it out. Do you like Mezze? If so, then you will love this place, since it's almost entirely the same; all the way down to the taste and shape of the falafel. As for me, Mezze is one of my favorite lunch spots in Columbus, so I instantly fell in love with this place. The owner/manager was super friendly and offered everyone free samples of the meats without them asking. We didn't have a lot of time, so we opted for the gyro on a Greek style pita (Yes, they have Middle Eastern style just like Mezze). This place is essentially a Mediterranean Chipotle where you pick our your base (pita, rice, salad), proteins, toppings, and sauce. You can add olives, feta, and/or spice it up for a little extra (Mezze?). I went with the spicy sauce. Unlike Mezze, you go down the line picking out the veggies and toppings you want on your pita or bowl, just like in Chipotle. I ordered falafel along with the gyro, and the gyro was way more filling than I thought it would be, and I had to muscle down the falafel, which are served with a thin hummus. Everything was absolutely delicious. My buddy ordered the same thing but had fries instead and thought it was great as well. He made a comment though that I had to agree with saying that if you blindfolded him, he wouldn't be able to tell the difference between Sababa and Mezze. To me, this is a good thing, since I love Mezze, but a bad thing for Mezze, since this is a bit closer to my work.The only issue I ran into, is that they don't offer foil or a piece of paper to wrap around the pita to make it easier to eat, and the house sauce and hot sauce are both pretty thin, and it made a mess everywhere, including my shirt. Be prepared! That is my suggestion to them, and they should really think about it! Parking is super easy to find, since the tiny strip mall they're in has plenty. If you're a fan of Mezze and live on the East or Southeast side, then you'll find yourself having a very similar and tasty experience at Sababa. As for me, I'll be back often (so sorry, Mezze!).EDIT: Apparently this is owned by the same guy that owns (owned) Mezze which makes a whole lot of sense, but why change the name if you're doing the exact same thing ?? I'm assuming he must not be the owner of Mezze anymore, because that makes no sense."], ["Greg W.", "Chipotle Greek food sums this place up in terms of both quality and style.My personal favorite is the white rice base with the gyro meat, with a close second being the hummus base and chicken. One of the other nice touches is you get to pick a level of heat with the sauce they grill your meat in. There are three levels, so if you prefer a spicier meat, go for it. While I typically prefer spicier foods, with the gyro meat I like to keep it on the more tame heat, because it lets me focus more on the flavor of the meat. I like to do double meat too, but you'll get ample food regardless. Out of the five times I've been there, the owner has been there three of them, and he's always very fun, polite and personable. He loves the food and takes it very personally, and his passion shows.The only two negatives that I've had can hardly even be called that (or even their problem). Firstly, lunch time gets VERY busy. If you're not there by 11:30-11:45, don't bother unless you have a lot of time on your hands. A lot of local professionals pack this place because the food really is that good. The other is the parking. There just isn't much of it around that lunch time, once you factor in all of the other businesses in the strip."], ["Ryan P.", "This is my favorite place to eat!! The gyro is fantastic! I have spent a long time trying to find a place to get a great gyro and I finally found it at sababa."], ["Linda A.", "I'd give this place more stars if I could.  I was doing a project for the Nationwide Children's clinic across the street and at lunch time I found this place via Yelp.  I'm really glad I looked because otherwise it's pretty much Chik-fil-a and that kind of thing.  I had a gyro salad.  This sounds pretty basic but the gyro meat was FANTASTIC.  Tender, and so tasty.  I noticed the owner looking over at me as I took my first bite.  I gave him a thumbs up and he nodded like, \"I know, right?\"  Lots of folks there enjoying their lunch.  You go through the line kind of like Subway.  They are very generous with the items they put on your salad or whatever you choose.  You really need to go to this place.  I told the owner that he needs to open one in Nashville.  Awesome Mediterranean food.  I'd go back in a heartbeat."], ["Sarah K.", "Sababa has the best falafel, hands down! At most resturant it tastes like hay, but not here. It's made to order, which requires me to wait on my food, but it's completely worth it. As a pescatarian, Greek can be a challenging food type, unless I want to buy a veggie pita or hummus. Not anymore! I've been here twice already even though this location has only been open a few months. I've gotten the dip trio once and the fire feta dip only on my second visit. It was amazing as well. Pass on the baklava though. It's good but the portions are small for the price."], ["Sara D.", "I started with a pita, got the medium spice shawarma, added cabbage salad, banana peppers, red onion, lettuce, cucumbers, and their Greek sauce. Added a side of grape leaves! Everything is delicious! Fresh, great flavors, great texture.... tastes like you expect... fabulous! Clean place with great recyclable packaging. Very friendly and helpful staff. Will definitely go back. Great impression made in the 5 minutes we were there... quick too!!!"], ["John W.", "This is an excellent idea for a restaurant, it is like a Chipotle for Greek food. All of it was excellent. Great price for what you get, we had leftovers for another meal the next day."], ["Anna H.", "Love:  Friendly owner who goes over and beyond for customers, perfectly cooked falafel and hand-cut fries, and excellent white sauce (\"house sauce\").  Don't Love:  They aren't on my side of town.We had a wonderful early lunch yesterday here after bookmarking it due to great reviews.  By the time we left around 12:15, the line was to the door.  So glad they appear to be doing well shortly after their grand opening. I think it helps to be in a busy shopping area and near a hospital.We got free samples of the dips and pita along with our orders.  I had the salad base with falafel and veggies.  My daughter had a gyro with lamb.  All wonderful and reasonably priced.  The dining room is cute, clean, and trendy.Right before we left, we heard the owner (nicely) correct someone's mispronounciation of gyro.  Thank you, sir, it needed to be said.I shall return."], ["Aaron B.", "My first time here the staff cooked up samples of all the meat and the different types of rice to let us try prior to ordering. That kind of service speaks volumes.      The food is fresh and delicious. Service is alway outstanding. Stop here every chance I get. Portions are huge! Thank you!"], ["Kelsey W.", "Fantastic food and fantastic service! I can't wait to go back! We were new customers and they helped us make he best meal for us and we're happy to do so. Definitely helps that we had a coupon :)"], ["LeeAnna S.", "This place was great!  A mediterranean chipotle!  (Slightly pricier though)I got a veggie rice dish and we got some feta dip as well and it was very good and enough to make 2 meals.The owner was there the Friday that we went and was so friendly and fast and accommodating.  Can't wait to go back!"], ["Ashley C.", "Great authentic food but a little pricey considering it's a cafeteria style line and get your own drinks. It seemed a bit understaffed the day we went since one girl was in charge of the bulk of the beginning of the ordering process with a long line on a Saturday around noon. I think the oil was a little too hot bc the outside of my falafel was cooked good but the inside was a tad undercooked. There's no kids menu. One order of fries was big enough for our family of 5 to share. With our Groupon and additional costs, it was $45 but I left feeling over indulgenced."], ["Adam L.", "Its essentially Chipotle only Greek, but the Greek fries are amazing but perhaps with a bit to much Feta Cheese, and the ingredients are hella fresh. The atmosphere could use some work though, contemporary greek chill music perhaps. It seems family owed so theres a nice local flavor there. First,Chipotle, then Piada, and now this. Surely someones making a Jamaican street food location? Or at least afro-cuban? Just a thought. Oh and its pretty filling for around $15-$20. I wouldve also liked to have seen a bit of Uzo being served as well. Oh well. Cheers!"], ["Ali H.", "I had no expectations coming in the doors here. I was pleasantly surprised with the friendliness of the staff. I am very loyal to a particular greek place on Hamilton Rd.  Sababa has made me want to explore my options a bit.  It was so good. My dining partner enjoyed their meal as much as I did. I will say I thought it was a little expensive but the amount of food you get make is worth it. Plenty of leftovers for your next meal.  I would get the rice without the lentils next time, I felt it had more flavor and married with the other flavors better. We can't wait to go back!"], ["Angela M.", "My husband and I stopped in for lunch on a Monday, and the experience was amazing!  The staff was exceptionally helpful, offering samples of the meats, rice, and house sauce before we placed our order.  The hard part?  Deciding what to pick!  I went with the gyro, my husband picked the Greek chicken.  Everything was delicious, I am looking forward to another visit just so I can try a new combination!  One word of advice: go light on the sauce.  It is well worth the trip and for the price range to get fresh, healthy Mediterranean food!"], ["Anjelo P.", "Mediterranean version of Chipotle! Love it. Price is comparable and the product is worth it! Had a gyro with spicy feta dip and pita - Found a new favorite spot! Service was excellent. Friendly staff that engaged customers in casual conversation. Friendly atmosphere. Five stars!"], ["Mike S.", "We are becoming regulars.  Great shwarmas and gyros.  Hummus is great too.  Hummus for the base of the bowl is great and worth the extra money.  Just had baklava for first time.  Very good.  Highly recommend this place."], ["Ryan M.", "Amazing!  My wife went to pick up some food with our three children and John, the owner was there and walked her through the options, made suggestions and even helped her bring the food out to the car.  Great service can make up for lackluster food, but in this case the food was amazing. Fresh ingredients and full of flavor. This was a big win for everyone in the family.Thanks for great food and a great experience. We will be back often!"], ["Carlo M.", "Delicious! Heard about this place so thought Id give it a try. I was pleasantly surprised by all the selections. The chicken flavored with curry was amazing as was the lentil rice. The falafel was a little dry but the taste was still good. There was also a nice array of additions to go along with your order (though feta and olives are not free).We were greeted by the owner who let us sample the meats and rices to help us decide what to choose. Very friendly and he really made us feel at home. Milana was also very helpful in describing all the various sauces and toppings! The entire atmosphere of the restaurant is amazing and makes me want to return and try all the other selections.Highly recommend! We'll be back for sure!"], ["Carol S.", "I am a huge Mezze fan and everyone has told me that Mezze isn't the same as it use to be since the original owner is no longer there. I never had the chance to experience it when it was owned by him. So when I heard that he was opening his own place again, I was thrilled to go and try it. I was really excited to see all of the great reviews about the place too. However I was very disappointed. I ordered the chicken with rice all of the toppings besides pickles, feta cheese, house sauce, and I also asked for spicy. I took a bite and I did not taste any spice, I actually think they forget to add it. It wasn't very flavorful to me. Everyone that works there are very friendly. They were very helpful to everyone who had questions about their menu and their food. They even were allowing people to taste things off from their menu before they ordered. I did like that.Will I be going back? Probably not anytime soon...."], ["Lauren M.", "This place is almost a five star review for me- and I have a feeling that eventually it will be. I have been here twice now and feel ready to comment. I love the food, and I love the setup. However, there are a few kinks that need addressed before this place will really be fluid.On both visits I have ordered a pita. On the second visit I was presented with a size choice- a smaller thicker pita (Greek I believe) or a larger thinner pita (Middle Eastern?). I am not sure if this is always an option, as this has not been consistent. I'm also a little disappointed that they aren't made from scratch- but I think I've been getting spoiled by a shop near my work. After you place your order for a pita, you turn the corner and order your meat. Both visits I have ordered chicken- my husband has tried the gyro. I believe they have two different types of chicken- one with garlic and oregano and another with curry. However, I am not clear on this. My husband mentioned that it would be helpful if they had some sort of sign or label denoting choices all throughout this process. This is also the point that you need to speak up if you want spice added. I believe they have three levels of spice- I have only tried the mild.  The first visit this was offered, the second it was not.Next are toppings. They have an awesome selection, but again, nothing is labeled. Most of it is easily identifiable- but if you are new to this type of food maybe not. The house sauce is delicious, neither of us have tried anything else. I find this place to be a MUCH welcomed addition to our neighborhood, and plan on being a weekly visitor. I really hope the little kinks are streamlined soon, as the food is worth coming back for, and often.I'm not sure if the lack of signage is an attempt at simplicity or if they are trying to  create a more upscale environment. It would be helpful to have more guidance or more consistency then is presently offered. Asking questions would also be much simpler if the music was not so loud you cannot communicate efficiently with the staff.Also noted:They also have two varieties of rice- but they are not labeled anywhere, and I cannot remember the names."], ["Majida Z.", "It was ok ! it's a take on fast food middle eastern style the chipotle way same type of set up"], ["Jessica V.", "Do yourself a favor and eat here. Not only is the food delicious but the man that owns this place is awesome as well. Such a great atmosphere and so welcoming. Three of us got there about 30 minutes before closing and I didn't feel rushed at all even though we finished after closing time. This was my first experience here and I got the gyro salad and everything about it was amazing. It was juicy and seasoned perfectly. The lettuce and the other veggies I got on top were fresh and flavorful. One cool thing about this place is the \"Chipotle\" style ordering so you can get everything or nothing on top. Whatever your little heart desires. I can't wait to go back and try more combinations of flavors."], ["Tyler D.", "Just had an Amazing experience!  The food is fantastic and the customer service is outstanding. The lady that waited on us \"Kara\" should be given a raise.Everyone go here now!"], ["Evan S.", "We waited for this place to open and then gave them a few weeks to get the kinks worked out. I am SO sorry we waited! The food is fresh and full of flavour. My wife and I each got the pita wrap (mine with falafel; hers with chicken). Loaded up with veggies and kalamata olives (mine only), added an order of fries (great!) and stuffed grape leaves (wow!), but would have had plenty of food with just the pita wraps. The pita wraps are big (think Chipotle burrito), and you get to customise it the way you want it from adding spice to your protein, to selecting your veggies and dressing. The fries are like something from the fair (step up from Five Guys). The grape leaves were tender, full of flavour and delicious. And don't get me started on the baklava! Yum!Johnny (owner) is constantly offering samples. He wants you to know what you want (or what you will come back for next time!). He truly wants to offer great food to his customers. We are lucky to have something like this come to the Reynoldsburg/Blacklick area as opposed to the bland chains that keep popping up. So good we took the kids 3 days later and it was a hit!Love supporting local businesses that are bringing great food to our community."], ["tracey y.", "I stopped tonight and got take out. Two pitas with grilled chicken, various toppings and sauces. Fantastic! meat was tender and flavorful, sauces added the perfect balance of flavor.The best part was the falafel- crunchy and so so good, with a dipping sauce. Everything is made I front of you Subway restaurant  style , with fantastic middle Eastern taste! Owner is very nice and welcoming,   We will be back!"], ["Steve C.", "It's a Mediterranean Chipotle! House sauce is good, as is the lentil rice. Balakava was tasty, will return!"], ["Charisma D.", "This place is amazing! The customer service and food are both outstanding. Everyone that enters is immediately greeted with a hello and asked if it's their first time. If it is, you're given a freshly cooked sampling plate of all the meats on the menu and then walked through what each is and how to place an from the menu if you're confused. So glad I stopped here."], ["Stanley L.", "This is one of the friendliest places I've ever been in awhile. The owner was on hand when I visited. And the concept is very simple and en vogue, a Chipotle for middle eastern food. I was a bit overwhelmed by all the choices at first but the owner sensed my confusion and immediately made a sample of all the meats for me to help me choose. The sample itself could've been my whole meal!!  Everything was delicious and I decided to get my boss a salad with all the Mediterranean goodness and a falafel on a bed of hummus. My boss called me immediately and asked about the most delicious salad he's ever tasted. My falafel was delicious as well. The only thing is that there were parts that might have been too hard for my teeth and it felt like they were cracking. Also, it bothered me a bit that I saw a fly buzzing around in the restaurant. The service was excellent the food delicious. I really wish them great success in trying to scale this business across the country!!  I would love to have a branch in LA."], ["Kate S.", "Food was excellent and the people who worked there were awesome. He allowed us to try free samples of the meat since it was our first time eating there and it really helped give us an idea of what we wanted. Felt the food was super fresh and well flavored."], ["Derek U.", "Fantastic food! I got the rice bowl (house rice) with gyro. It was amazing! The owner, Johnny was very nice too! We will definitely be back!"], ["Brendon P.", "So maybe it was covered when I wrote this review, but they totally have romaine lettuce. This place is one of my favorites, I go a couple times a week. Last time I was there, I got great service from Cara!"], ["DeEllis W.", "Awesome place to ate. The only place I go for pita's.\\"], ["Tony D.", "An \"Awesome\" experience! Dee-licious!! Very fresh and a great price for Homemade Mediterranean food!"], ["Therese S.", "Just stopped into Sababa with a friend for lunch.  We both ordered the falafel pita and it was absolutely delicious! Ordering was easy and you get to pick everything you would like on it.  Johnny the owner was very friendly and made us feel welcome and happy to be there.  He offered us a sample of the two different styles of rice, and of the dips available. We will definitely be back!! Loved this place!!"], ["Michael F.", "I would just like to start off buy saying me and my wife were on our honeymoon for two weeks and we stayed at the Residence Inn by Marriott Columbus Downtown have to say they people were really friendly and catered to all our needs on our second day during our what was ment to be the happiest time our life turned into a nitemare thanx to your resturant i have never been so disrespectd in all my life your staff have no customer skills and your food was down right disgusting to cut along story short we got food poising my wife ended up in hospital for seven days and i was that sick at the hotel i could not go and visit her thanx again stay from this place thats all i can say on the matter"], ["Kelly L.", "This place is AWESOME! It's pretty much the Mediterranean version of chipotle and worth every dollar. It was my first time here and the owner was fantastic about offering samples and/or explanations of what everything is for those who might not be familiar, even at noon during a busy Friday lunch. My only complaint is that I wish it was closer to where I live! Put one of these in Hilliard, please!!"], ["D G.", "Super impressed. We're in town (from the West Coast) for only one night and the guy at our hotel desk raved about Sababa, so over the crazy-busy highway we went to try the food. Outstanding. The shwarma was spiced just right, the veggies were fresh and crisp, the pita warm and soft. And the service was outstanding. I'm hoping this concept moves west in a hurry. I'm a fan!"], ["Mandy G.", "Super yummy! My boyfriend and I stopped by for dinner; he got the lamb and I got the Moroccan chicken, both in a rice bowl. We were both very happy with our choices, and the owner was helpful and friendly. It's definitely going in our regular casual dining rotation!"], ["Mark A.", "Great service; very friendly. Excellent options for all diet types. Good baba ganoush. Mediocre humus. Lots of food for the price."], ["Meghan T.", "All of the food looks amazing! We had a rice bowl in a pita and they were awesome got the curry chicken and gyro meat, both a great choice!"], ["Katie D.", "Found this wonderful place with my mom today!! Great food and wonderful service! It's like a chipotle for Mediterranean food! :) so tasty- will for sure be back... This week."], ["Stephan N.", "Great fresh food. Amazing gyros!!"], ["Lesley M.", "Phenomenal food and service! There is no better place to go for great service and great food. Johnny is one of a kind. I highly recommend either chicken options or hummus. Extremely fresh food with warm and inviting atmosphere."], ["Matt S.", "The food is fantastic! I stopped in for lunch and got a salad with both the Greek and Middle Eastern styles of chicken as well as just about everything else. Both chicken types had excellent and distinctive flavor and everything was very fresh. The restaurant itself is very clean and modern-looking and the staff is very friendly and helpful. I wish it was closer to Hilliard so I could go more often!"], ["Tiffany D.", "Maybe we caught them on an off day (I hope so) because the food was just average at best and the employees were not helpful at all. When I asked questions I was given minimal answers. We were upcharged without being told something was extra. We may revisit but I'm not totally sure about that as again the meal was run of the mill. Crazy Greek is leagues above this restaurant."]], "Brassica": [["Brent H.", "The Short North has a wide variety of quality sit down restaurants, yet the fast casual options were limited for those that wanted great eats without the heavy grease. Chipotle, Bibibop, and Piada are all good once in awhile, but you want to support something locally as well. Luckily, Brassica has filled that void with Mediterranean cuisine that both looks and tastes appetizing. One of my friends in the Short North Running Club opened the place, and invited me to try out Northstar Cafe's newest spinoff.The chalkboard menu is nicely laid out with an option for pita or a salad with plenty of topping options for vegetarians and non along with a professional staff that is very knowledgeable. I ended up getting a pita packed with falafel, hummus, and an assortment of tasty side veggies. What impressed me in particular is that they had both a house dressing mixed in with the greens to give the food authentic flavor. Also, there is a special sauce that are a great dip with the Brassica fries seasoned with sumac. Moreover, for those that choose to dine in, they have a brass ring that holds the pita sandwich nicely together and classy wood trays that match the restaurant decor.Hands down, Columbus is a beer town that loves its microbreweries. Brassica shares the passion for craft beer lovers and has a nice local selection that pairs nicely with your pita/salad. Seating is ideal for couples at Brassica, so be sure to bring your date or significant other for a casual and reasonably priced dining experience."], ["Emily L.", "So, I thought about getting a late snack. I did. I went to Brassica because I enjoy a tasty hummus and pita every so often. This place is quite divine. The intimate space and seating, mostly wood, looked simple and organic yet very elegant. This restaurant has a lovely, romantic appeal with dim lights, a red brick wall, and glass-looking paintings. I especially appreciated the wall painting of a pink brassica! I like that the restaurant used it as the inspiration for its name.The wall menu, a chalkboard, by the entrance, lists the choice of pita salads, sandwiches, and bowls. The food sits behind a glass counter where a server scoops the vegetables, hummus, and sauces to create our to-go order. The pita is whole wheat and tasty! That is amazing. The hummus has a creamy texture with a satisfying olive oil taste. The falafels taste crisp and tender, which I love and enjoy with the hummus. Anyone who enjoys Mediterranean food should come at least once. I find this place a mixed purpose for a date, a friend, or family members. Whatever the occasion, Brassica has friendly people who serve delicious, light meals in a simple, beautiful setting."], ["Lea P.", "After two visits, I'm ready to say, \"Yea Brassica.\" Or \"Yay Brassica.\"I was very unsure the first time I came. I was unclear on what exactly was supposed to come with what. Rather than a buffet-behind-the-counter that other assembly line eateries constitute, this felt more like a \"Choose Your Own Adventure\" without the page numbers. I ended up with food on my plate, and it was pretty good, but I wasn't sure whether I had been entitled to more veggies (when they said \"toppings,\" did it mean the proteins or everything, for instance?) or why some of the veggies came before the sauces and some came after. I was letting friendly the employees guide me with their \"Would you like...?\" offers, but it didn't keep me from feeling a bit puzzled about how that meal ended up in front of me.So it took a second visit to get all this down. That's often the case with assembly lines, before you know what your food options are. Now I understand that the rice and lentils are supposed to go in the salad (but why? where is the rice and lentil side? can we not have them in a sandwich with hummus?) and I understand that the veggies are all really tasty (not a bad one in the bunch, but I think the weakest were the \"spicy\" carrots and the strongest was the marinated eggplant).Now that I'll be ordering with a little more confidence, I think I'll enjoy the meal more, but I believe I need to work out the flavor combos a bit better, too. I asked for practically everything but the kitchen sink on my salad, and I don't think it really ended up tasting like a salad so much as a bunch of sides all in the same dish. There was no blending, but I'm also not so sure I wanted these flavors to blend. It was like going to a party with a lot of fascinating people who will all talk to you but not to each other.The fries were awesome. I think what was most awesome was that they weren't trying to mingle with the other parts of my meal.Now that I understand Brassica, I look forward to enjoying a lot more of Brassica, but I'm just hoping that at some point I find that combo of food that actually works together."], ["Jillian M.", "All the good news you've heard about this place is true. Came here for lunch on a weekday with some coworkers -- we got there at 11:10 and we were the first in line. By noon, it was slammed, so get here early! There are already a ton of positive reviews for this place, so here are a few of my notes in bullet point style:* Are you a vegetarian or just a lover of all things veggie? This place is for you! I had the brisket, but there were so many delicious veggie toppings on it that I could barely taste it. Get the veggie option -- it's cheaper and just as good!* The iced tea was just ok... it had a weird aftertaste, so go for the lemonade or soda instead.* This place is a bit cramped around the drink station/checkout area. Come early or at an off time if you are looking to dine in.* The fries were good, but not really worth the price point. The pita was more than enough for me to eat for lunch. No leftovers, but also just the right amount of full. *Get the 'hot' cilantro sauce. It's not really that spicy, and it is SO GOOD!* They have a few local draft beer options too!This place was delicious, and I didn't even get to try all of the veggie toppings because I was running out of room on my pita. I had the baba on mine, so I'd love to come back and try the hummus next time. I would not hesitate to recommend this place to others, or take guests from out of town here for an affordable meal! I WILL BE BACK!"], ["Nk C.", "Atmosphere- very young and fresh. I like the materials/finishes that they used. The register area can get really congested because the self serve drinks are all in that area. Sitting is limited. They do have a standing bar area, so if you don't mind standing, go for that. Service- A. You can get in and out in 10 minutes. Food- the pita option can get messy so I opt for the salad option. The flavor consistency is good and the eggplant is consistently salty (what's up with that). Brisket has too much fat for me. The lamb bacon is okay and the real winner is the chicken. My advice- get a little bit of every toppings except for the eggplant if it's your first time. You can get your dressing on the side, which I highly recommend. Z'hug and special sauce is worth a try. This place is good for a fast meal."], ["Arvid Y.", "I'm sorry Bibibop, i've cheated on you. There's a new fast-casual restaurant in my life and her name is Brassica. She's healthy, easy on the eyes, classy, but still very approachable.There are a few Mediterranean options in the Short North district (Firdous Express and The Happy Greek) but this is the first fast-casual Mediterranean restaurant in the area. As compared to other fast-casual Mediterranean restaurants (Sababa and Mezze), Brassicca kicks it up a notch in terms of ambiance and ingredients. It's not surprising that Brassica shares the same ownership as Northstar Cafe. The interior design of the restaurant, the attention to detail and food execution is top notch.The restaurant is visually pleasing with its stainless steel assembly line, marble countertops and brick walls. The engraved wooden trays and circular metal pita holders also add some class to this \"fast-casual\" dining experience.From a pricing standpoint, it's a bit more expensive than other fast-casual eateries, but not by much. Wraps start at $7.50, with salads being an additional $2. The portions are also fairly generous.What sets Brassica apart from other Mediterranean restaurants are the ingredients. Where else can you get toppings such as pickled cabbage, sweet beets, cukes, marinated eggplant, jalapeno cauliflower and roasted carrots? Combined with your choice of 5 different sauces and cheese, the combinations are endless!The freshly baked whole wheat pita are amazingly soft and fluffy. So far i've stuck with the brisket as my protein of choice. It's tender and flavorful. With such quality ingredients and attractive atmosphere, I don't mind spending a few extra dollars for this dining experience. And the love affair continues..."], ["Bryant M.", "I wrote an email to Yelp CEO Jeremy Stoppelman to ask for a sixth star to give Brassica......No, no I didn't. Because that would be insane. But you get it -- hopefully that dramatic intro proves how much I love the newest concept from the Northstar folks. It's no secret that Northstar (the ShoNo location to be exact) was my favorite 10 years ago when I landed in Columbus and continues to be my favorite today. Maybe it's their clean design... or maybe it's the lovely staff... no, it's definitely the picture-perfect food... wait, it's really how the whole experience is stellar each and every time. And if for some reason it falls short, the staff is proactive and empowered to make it right. Well take all that and apply it to a fast-casual, vegetable-heavy, Middle Eastern restaurant -- and that's Brassica.The first time I walked in, I was mesmerized by the interior. Maybe it was because I was so intimately familiar with the former tenant (RIP Betty's), but this place went through a complete overhaul. Lots of wood, green tiles, and gold everywhere. It doesn't look like everywhere else these days, and in the words of Martha Stewart, that's \"a good thing.\" Sure, the space is small, but they really make fantastic use of what they have. It's like the TARDIS in there. When it comes to the food, it's fast-casual cafeteria-style. I refuse to call Brassica the _____ of Middle Eastern. First, I hate that place (gasp!); second, I think it's insulting to every other restaurant who simply has a similar style of serving. Ordering is simple. You choose:A) A sandwich, made of homemade pita (that's literally made seconds before you walked in)B) A hummus plateC) A saladNo matter which option you choose, you'll load it up with a selection of: hummus, baba, rice & lentils, protein (lamb bacon, brisket, chicken, or falafel), veggies, and sauce.About those veggies... These are not fillers. They are the star of the show! Please allow me to fanboy for a minute: On the shelf at Brassica is a small display of curated cookbooks, which I'm taking to be a sign of inspiration. Several of the books are from the famous chef, Yotam Ottolenghi, who is Jerusalem-born and owns several Middle Eastern-inspired restaurants in the UK. Ottolenghi makes vegetables sing like no one else I know, and I had the best meal of my life at one of his spots in London. So, yeah, I lost my mind when I realized the Brassica-Ottolenghi connection. And trust me, the veggies here don't disappoint. Beets, red cabbage, carrots, cauliflower, cucumbers, eggplant--all beautifully, expertly, and deliciously prepared. And you can add them ALLLLLL to your meal.When you near the end of the line. It's time to make three important decisions. Let me make them easy for you:1. Would you like a side of fries? YES. The fries here are seasoned and cooked perfectly. Some of the best in the city.2. Would you like a side of special sauce? YES. Put it on everything.3. What would you like to drink? There is no answer other than BEET MINT LEMONADE. Trust me on this one. If you can't tell, I'm in love with Brassica. It has already entered my regular rotation, and I crave it so much that I'm willing to play The Hunger Games: Short North Parking Edition just to eat here. TL;DR Brassica is the latest concept from the same people as Northstar. It's fast-casual, Middle Eastern-inspired, with loads of delicious veggie options. Everything is fresh and from scratch, and it's an easy 5 stars."], ["Gus W.", "I've never been the biggest fan of Northstar Cafe, but they've rolled out a pretty brilliant new restaurant in Brassica. The concept itself, fast casual, isn't new, and not even fast casual Mediterranean (see: Mezze and Sababa), but the ingredients are just so much different than other places, it's definitely worth noting. I can see how the lines can get backed up out the door, since the ordering counter is right at the entrance, and the manager that runs it has been giving his spiel about the place to everyone that hasn't been before. I get it. It's an assembly line. Everything's ridiculously fresh. I passed on the story, but I'm kidding, he really is a very nice guy! I imagine the lines will go down after a few weeks, or they'll at least be quicker at moving people through.For my meal, I had to try the sandwich right off the bat, and I went with the brisket, even though both the chicken and glazed bacon looked amazing. There's so many different toppings here like pickled cabbage, sweet beets, onion straws, and a cauliflower/jalapeno mix (which was surprisngly awesome) that it's hard to not have your dish overflowing by the time you get to the end of the line. The house sauce and jalapeno sauce were both awesome, and even though I had all these ingredients in my pita, it held together throughout the whole meal. This may be the only time you ever hear me say this, but I think liked my girlfriend's salad with the chicken shawarma even more than mine. The chicken was amazing, the salad is very fresh with lemon and salt added, and the bottom of the bowl is lined with lentils. It was huge, and she couldn't finish it, but I smashed the rest of it the next day. It was still just as good. There is a $2 up charge for a salad, however. I guess the lentils are that expensive? Don't know.The fries were delicious, but I'm not sure if they're worth $3.50 for the amount you get. I can get really good fries at places like those at Sababa and Mezze for less than that with double the portions. Don't expect to really split this with someone if you're hungry.I was behaved and only ordered the sandwich and the pita, but it really took all of me to not try the falafel and hummus, since they looked so good. I'll definitely be back here soon, and it's really nice to have a fast casual place in the Short North other than Chipotle."], ["Cristin S.", "This place is a great fast casual concept! They have so many different options! I love that there is more than the standard lettuce, tomato, hummus offerings. I really loved the special sauce! I wish I would have gotten it on the side so I could have controlled how much I put on. The only reason I am taking away a star is they were out of brisket. I really wish I could have got the brisket pita with the delicious sauce! But I will certainly be back!"], ["Siobhan G.", "Just went here for the first time tonight! I have been excited to try Brassica. Anytime there is a new, quick, somewhat healthy option that is delicious - my day is made! I loved the decor and lay out. It's a really cute place, even the way the food was presented was clever and pretty. Brassica is not trying to reinvent the Chipotle wheel, they are just adding a new flavor to it. You can choose between the pita, salad or hummus plate. Then you choose your meat - Chicken Shawarma, Brisket or Lamb Bacon. The Lamb bacon looked incredible, I really want to try this! After your meat you start down the veggie, cheese, sauce and dressing line and they really have some neat options here. I don't usually like eggplant but I actually really enjoyed theirs. The fried jalapenos and onions were also delicious and added a nice little crunch to the salad I ordered. Also, make sure you try the spicy carrots those were slammin! The only complaint I have is my salad was a little salty. I am not sure if it was the lentil mixture they put on or another veggie I chose but I think it could have done with a little less salt. The portion size was also really big. I wish there was an option to get a smaller salad that was a little cheaper. I am not sure why the salad is priced $2 higher than the pita? However, for how fresh and flavorful all their ingredients are I am ok with it being a little more expensive than other quick service restaurants.They have a bunch of different sides that all looked so good I had a hard time choosing one. I ended up trying the Brassica Fries that are served with their special sauce. Oh baby.. those were tasty! The special sauce is also really good, went great with the Cajun spices on the fries. They have organic sodas for their fountain drinks, I had the diet cola and thought it was pretty good. They also have juices in a little fridge and I am wondering if they make the juices themselves or get it from somewhere else nearby? Tip - Find the little red hot sauce by the drink station and put it on ALL your food. It's fantastic! I'll definitely be back soon!"], ["Sam P.", "Brassica is awesome and I'm pretty sure that we'll be going there often. Before getting to all of the reasons it is great however, I'm going to list the two negatives. Then I will join in what appears to be a swelling chorus of praise. 1. The salad option costs an extra $2. If you're not paying attention, you may overlook this fact. It's also unclear WHY there is an added cost. It doesn't make sense based on the overall model and I hope it changes. 2. Seating is going to be an issue. There's a little bit up front and a little bit in back. Once word gets out, it's going to be packed during peak times. And, oh is word going to get out. The food here is delicious! The ingredients are all flavorful and of high quality. Start with the pita. It's baked fresh, which if not obvious from taste alone, is confirmed by the very prominent oven up front. You then get your pick of ingredients to fill it. Either  hummus or baba ganoush can be smeared on the inside prior to the meat options. Having only visited once thus far, I can affirmatively say that the chicken is great and the others (brisket, bacon, falafel) LOOK great. Next, choice of veggies and sauces. The pickled red cabbage and cucumber & radishes are both nice additions and provide a great tang. I skipped the beets, not being a beet man myself. You can choose from a variety of sauces as well. The house sauce is quite good, but there are other options including tahini and red pepper sauce. Also a hot sauce. Then more vegetables! Cooked eggplant, and sweet and spicy carrots are options. I didn't try them, they kind of came as a surprise because I initially expected that all of the vegetables came before the sauce options. Also offered is a cauliflower and jalapeno combination. Get it! It's really really good and provided a great flavor that tied everything together quite well. We didn't try the fries or other sides. Nor did we get a soda. I might have gotten the latter had I realized that they have a variety of interesting options. There's always next time. And there will be a next time. The food is perfectly executed and I'm sure that we'll be back soon. My dining companion proclaimed with no hesitation that Brassica is hands down her favorite restaurant in the Short North."], ["Zeb L.", "One of the best places I've visited in Columbus. Brisket and fries are not exactly traditional Mediterranean fare, but they're delicious, so what does it matter? Furthermore, they mix perfectly with hummus and all of the other fare offered by Brassica. Lines are going to be a problem with this place, but I can't fault a place for being both popular and good."], ["Anna S.", "After my first trip, I already know that I'm going to be obsessed with this place.  Went here after yoga last week for a pseudo-healthy takeout dinner and ordered a chicken bowl.  And I totally geeked out over the amazing veggies.  Roasted carrots!  Shredded beets!  Cauliflower salad! Yum!  Additionally, the chicken was tender (thigh meat) and spicy and the baba tasty. Lastly, I nabbed a pink mint lemonade and while it was super tart/sweet, it was quite enjoyable after I added some water and ice.   I can't wait to come back and try the falafel and the lamb bacon.  A great addition to the SN!"], ["Rami M.", "Brassica is awesica.  Everything about it is amazing: the customer service, the organization and layout of the restaurant, and of course, the food.  I got the salad, with pretty much every topping (meat and veggies) and every sauce (and hummus).  Everything was top notch.  The lamb bacon was probably my favorite (and most unique) component of my dish, but the brisket, falafel, and chicken were also great.  My favorite veggie was probably the carrots (perfectly roasted and sweet), but I also loved the cauliflower, eggplants, and beets!  I think the next time I go, I'll choose only one or maybe two meat toppings.  The drinks are also great- I got a beet lemonade and it was so refreshing!  I do want to try the fresh pita next time (and there will be many future visits!)!"], ["Sara C.", "*sniff sniff*  What is that smell?  It's not the Mediterranean spices (that's just leftover in my sweater)... it must be hype!I had a lunch meet up here a few days ago and have to say -- the people watching here is stellar.  I had a pita with baba and the glazed bacon, various vegetables, and tzatsiki sauce on the side.  I also tried the mint lemonade.  I think the combination that I had was too much together -- there were a lot of strong flavors with the pickles and the glaze and the eggplant so I ended up mostly picking it apart with a fork.  Based on the rave reviews I was expecting to be blown away by the bacon, but I wasn't.  The pita was the best part of the sandwich, though I might go with the salad next time just so I can separate out the flavors (though I'm not a fan of the upcharge for lentils).  Maybe I'm just too pessimistic about some of the recent additions to the Columbus dining scene (chorus of \"yes, you are\").  It is definitely a bit pricier than some of the other fast casual options available, and I'm not too keen on dropping $13-15 on lunch very often; however, this place seems to appeal to plenty of other people, and I'm sure there will be lines out the door for quite some time."], ["Hua R.", "This place is amazing!! Gives off a great vibe as soon as you walk in, not to mention the wondrous aroma from those Mediterranean spices.Best option/deal seems to be the \"sandwich\", a pita with your choice of babaganoush or hummus to be slathered inside; then choose a protein - the brisket is awesome! followed by a wide selection of artisan prepared veggie toppings - I really liked the jalapeño cauliflower, pile on as many veggies options as you want; finished off by your choice of sauce - I highly recommend the z'hug, it's kinda spicy & oh so good! How are you gonna wash it all down, why the beet mint lemonade of course.. Beets, Bears, Battlestar Galactic Seating can be an issue, so beat the lunch rush or dinner crowd, and grab a spot to nom-nom-nom. Watch out though, this place is addicting.. enjoy!"], ["Amanda G.", "I was invited by management to dine at Brassica again this week.This time we went in for dinner, around 5:30 - just beat the crowd! I ordered a salad bowl with chicken and lots of fixings - I would recommend the cauliflower and jalapenos. It was really good! The chicken was seasoned perfectly: warm, slightly smokey, a little spicy. My boyfriend ordered a hummus plate with brisket which he enjoyed as well.We waited quite awhile at the counter as the couple in front of us ordered falafel and they had to make more. The running-out of falafel seemed to cause a bit of confusion/congestion in the line for both the customers and staff. Though I am happy to report that the flies that pestered us during our last visit were gone.What else did I notice this time around?A noteworthy point about the menu. While I initially likened Brassica to a Chipotle-style system, the pricing system is slightly different. At Chipotle, you're charged by the protein, whether its assembled as tacos, a burrito or a bowl - all toppings are included (except guac). At Brassica, you're charged by the protein - but there is an $2 up-charge for a salad. Also, as we were told last night, if you order the hummus plate instead of a pita or a salad, you don't get the full selection of toppings - but you do get a piece of pita bread.Overall - again, I think Brassica has good food, but I it's not my first choice for quick and delicious Mediterranean."], ["Jen R.", "What a cool place! Have heard so much about it and was in the area on Sunday. Stopped in to see what all the hype is about and left extremely satisfied. I wasn't really sure what to expect. It's kind of like a Chipotle concept for Mediterranean food, which is awesome. Everything behind the glass looked so delicious. My hubby and I split the baba (one of my fave foods) and a brisket sandwich. I requested my sandwich be filled with more baba and a ton of yummy veggies and sauce. Everything was very fresh and flavorful and the brisket was really tender. The homemade pitas were delicious and also stayed together without crumbling under the weight of all the toppings I filled it with. Can't wait to come back and try the same ingredients in a rice bowl or on a salad!"], ["Serena H.", "I've been here twice in a week.Essentially its a chipotle styled Mediterranean joint. Great quality ingredients. I swear your mouth will be watering before it's time for you to pay. I suggest getting the pita sandwich with the chicken and add everything. You heard me right, EVERYTHING.  Personally I think the chicken is much more flavorful than the brisket. 10 bucks and your stomach will thank you.This is a great place to take visitors from out of town...kinda funky, delicious food, quality service, and in the heart of the short north. I suggest hopping over to Jeni's to top off the meal just right."], ["Stephanie K.", "I was pleased to see the owners of North Star were opening a restaurant with prices that are much more reasonable than those found at Norh Star.  I was also pleased to find that the food is better at Brassica too!First let's start off by warning you that there is no signage when you try to find this place. I don't get this stupid hipster trend shared by the likes of places like Fox in the Snow Cafe. You want people to spend money at your establishment right? Then help them find the front freaking door. The Mediterranean themed food here is quite good. I had the falafel hummus plate. Really tasty stuff. The Brassica fries were nice seasoned fries served with a delicious homemade ketchup. The serving line to get the food was kind of not well thought out. Tiny trays of brass and cast iron showcased the ingredients in mini quantities of like a cupful. There was a large line because these trays emptied quickly with each customers order. I appreciate preparing food in a fresh manner and in batches, but they really should just have large vats of food to help out with the wait.The restaurant itself has space issues. It's smaaaaall. People were bumping into each other left and right.Decor is hip and modern with touches of wood, brass, and marble found throughout."], ["Katie B.", "As a millennial, I must admit I love these fast casual places where I can build a meal right in front of my face.  (Bibibop, Moe's, Pizza Cucinova, etc).  What's better is I popped in here for a late lunch so it was mostly empty except for a few tables.  I got the hummus plate with half hummus, half baba topped with brisket.  My only hang up was the brisket was a little salty and  I could have used a little more pita to mop up the generous helpings of hummus and baba.  All in all the dips mellows out the salt of the brisket and I was there for a \"light\" lunch so fewer carbs on the plate was probably a good thing.  I really wanted to dive into some of the other toppings, but that will have to wait for trips 2-999.  I cannot wait to try more of this bright, fresh , menu!"], ["Jamie S.", "Delicious fast, casual Mediterranean concept. Similar to a chipotle style where you choose from salad, pita wrap, hummus plate etc and choose your protein and veggies. I had the hummus plate with chicken that was seasoned to perfection and I also got a side of pickled cukes and radishes. Delish!"], ["Brutus D.", "New favorite place in the Short North for a casual-yet-very-delicious meal. Ironically, they beat out the Northstar Cafe for this honor. The pita breads are out of this world! And both the meat and vegetarian fillings taste as good as they look on the display and on your plate.Hopefully, they'll get a sign outside sometime, so people notice it and they get enough business to be around for a long time, because I definitely hope to keep this in my regular rotation for years to come."], ["Carrie F.", "This is my new favorite restaurant in Columbus. The food is fresh and amazingly delicious. The pita is warm and soft, the meat is melt in your mouth good,And the toppings and sauces are interesting and diverse. Sooooooooo good, don't wait to try this place!!  Ps. Please open another one soon in clintonville, I want brassica all over, just like northstar (-:"], ["Jason O.", "I absolutely have to give this place five stars. I've been to Brassica twice and have tried a large amount of the line items. Everything is delicious! Very cool and unique concept. The prices are a little on the higher end, but I consider it worth it for how good everything is."], ["Lane B.", "This is my place.There's such a variety of toppings that, although the menu is small, everything is entirely customizable. I'm not a meat eater, but from what I've heard the bacon is unreal. All the vegetables seem fresh and crisp (and are definitely delicious) and the pita is baked at the front of the restaurant so it comes out hot.I naturally opt for the hummus plate because it always yields leftovers in my case. It's also the perfect consistency and prepared with all the right spices.I've seen a few complaints about the prices but in my experience, I think what I pay is very fair.My only problem is deciding between regular hummus and the baba, which is also to die for."], ["Cortney L.", "The food was all fresh, delicious, and organic.  However the staff is slow and getting adjusted to working the new restaurant.  I hope the service gets better because the food is great and the interior is beautiful."], ["Shivang P.", "The people who created the hugely popular Northstar Cafe and Third & Hollywood have done it again with Brassica! A higher end, fast-casual, Mediterranean place, Brassica has delicious, clean, and well-seasoned food--not surprising for a restaurant that makes their own pita bread right in front of your eyes. All the components of their food taste fresh and are thoughtfully created. Brassica is the name of the genus to which common foods such as broccoli, cabbage, cauliflower, Brussels sprouts, and kohlrabi belong. Some of these are also incorporated in their salads and sandwiches. Not only does one notice the fresh pita bread baking, but also the attention to detail in the design of the restaurant. There is a very profound and exquisite dichotomy in design. The kitchen half of the restaurant has very vivid colors, sharp lines, marble structures and countertops, bright lights, and an openness that highlights Brassica's cleanliness and professionalism. This contrasts the warm and inviting dining area which is composed of beautiful wood, soft yellow lighting, spherical and circular decorations, and brass--a creative and thoughtful play on the establishment's name. I highly recommend going to Brassica, then going again and again and again."], ["Natasha F.", "Absolutely amazing!! From ingredients to presentation, everything was spot on!  So happy to see they care about sustainability with eco friendly utensils, cups and packaging of the food..  Can't wait to come back again!"], ["Johaun C.", "Assuming Brassica works out a couple we-just-opened kings in the coming weeks, I don't see how this place will be anything short of a rousing success and welcome addition to the Short North dining scene.  I had yet to find a legit pita place until now.  These are not your typical wholesale pitas that are grilled before serving--these are fresh, baked to order, pitas that will blow you away and make you wonder what you've been eating all these years at other mediterranean joints.  For your parents, this place totally fills that niche for a quick, top quality, and healthy place to grab a meal with the wee one(s) AND be able to have a draft beer without breaking the baby budget.  Then just walk over to Goodale and let the lil ones run off that energy!One of the aforementioned kinks: service couldn't keep up with the dinner rush, so the chicken shawarma and brisket weren't available.  I got the honey bacon pita sandwich with pretty much everything.  I think it was really good?  I can't remember because it was gone in like 10 seconds flat.  Fries are great, definitely get em with a side or two of their sauces.Also, you will notice how much thought went into some of the finer details in Brassica (notice the real brass sandwich holders, the well made stools, etc.).  This didn't take away from an overall awesome dining experience, but what has to be the most expensive/beautiful trashcan ever also has the smallest, pretty dysfunctional openings forever.  Trying to dump waste/recycling takes a bit more dexterity than your typical dump routine.Will become one of my Short North staples."], ["R T.", "Amazing chipotle style Mediterranean food- my new favorite in town. Great Falafel, great toppings, awesome sauces and some of the best seasoned fries I've had. Docked one star for limited seating and no high chair/ booster."], ["Lauren O.", "Loved Brassica! I've been following then on instagrams for a while but we finally got a babysitter and came for dinner. The food was amazing. I had the chicken pita with baba and all the veggies with the special sauce. My husband had a brisket pita. Both were amazing. The fries were very food as well as the pink lemonade. The staff was great and answered all our questions."], ["Mike W.", "Great addition to the short north. A fast casual Mediterranean experience. Food was excellent and space has classy appeal. Staff was very friendly and helpful with suggestions. Try it out!"], ["Jason B.", "Absolutely delicious! Mediterranean meets chipotle. As a vegetarian I appreciate the tasty options. With each bite, every topping I had on my falafel salad tasted better than the one before. My boyfriend, who isn't a huge fan of this type of food, was impressed with his chicken sandwich. However, like chipotle, he wished he would have gotten a salad so he could have mixed it up (all the ingredients were together in the sandwich similar to how they are lumped together in chipotle's burrito). Cannot wait for my next trip. Highly recommend!!"], ["Kristen G.", "Delicious! Pita bread is baked in front of you. You can make your own creation such as a bowl or pita sandwich. I got the falafel salad. Boyfriend got a chicken pita. You can tell they pay attention to the details in flavor and presentation. They are also very polite in describing your choices! Many vegetarian and vegan options. Priced well! This will be a favorite the next time we visit Columbus."], ["Courtenay B.", "I went to brassica for lunch with my family. We had an incredible experience.  The servers were friendly and helpful, while the food was out of this world. Fresh fresh fresh. The babaganoush is amazing.  So was the falafel. There was literally not one thing that was delicious on their menu. I tried all of the sides. The spicy cauliflower is unbelievable.  I will definitely be back for more. This is definitely a place better for lunch than dinner. Also..another plus...they use 100% recycled and also biodegradable  cups, utensils and napkins"], ["Wes S.", "Really good Middle Eastern \"fast food\" via an assembly line. But trust me, the presentation is top notch and the food even better. I had a hummus plate with beef brisket and pita. My partner had a veggie salad with chicken. Both were phenomenally good! The staff was very friendly too."], ["Haley D.", "The food is outstanding. There isn't a lot of seating which is expected for the area but the benches out back are actually impossible to sit on and would be great extra seating if they weren't made with a razor blade-like edge that sticks straight up."], ["Maureen H.", "Ok, so this place has a very nice atmosphere, fresh ingredients and......extremely high prices! $32 for 2 people for lunch!! Soggy small sandwiches, fries and drinks...beware, prices are off the charts! Soooo disappointing. OFF the list!! Could have hit a lot nicer place and got more for my buck elsewhere! This girl know here lunch spots in Columbus, this is Not one of them!!! Stay away if you don't want to pay!"], ["Danny R.", "I'm not really into Mediterranean food but this place has executed their menu perfectly and the design is outstanding. Definitely try this place out it's Chipotle style so you should know what to put together."]], "Little Lebanon Bistro & Bakery": [], "Mazah Mediterranean Eatery": [], "Loops": [["Thuy S.", "Their chicken gyros are so yummy. Add an order of fries and it's magic in your mouth."], ["Dee L.", "Is this a chain? The place feels, looks, and acts commercial and mass-produced. Assembly-lined food, impersonnel service, and sterile ambiance.  It's a real shame, because the concept is awesome. The Fire Feta and Clark Street gyro equal gyro-versions of sausage pizza and philly cheese steak.  Avoid the Cream of Chicken Rice Soup - nothing but cornstarch."], ["Paul F.", "I'm less impressed than I was.  My hot dog buns were stale and fell apart as I was holding them.  And the smart-ass behind the register had the nerve to question my prononciation of \"hummus\".  That's okay; no tip for you."], ["Chelsea W.", "Loops is great if you are in the mood for some greasy, quick food. The french fries are to die for!! They are so greasy and crunchy and covered in some delicious blend on parmesan and herbs.Other than that, the gryos and wraps are A-Ok. The hot dogs are good. All around just a good place in a convenient location. The rice pudding is really sweet and yummy!!The staff are super friendly and accommodating. If you call in an order to pick-up, they'll have it ready for you in 5-10 minutes!Plenty of parking off of King Avenue. Try Loops for a quick lunch!"], ["Michael J.", "The Greek gyro was very good, but the hot dogs did not sit well in my belly. The gyro rolls are very good too. Overall, not bad for the price."], ["Angela Z.", "I hate to be so cliched, but based on my first experience, Loops! really earned a solid 3.5 stars and not exactly a 4 rating, but I'm feeling generous...I had the chicken Feta-Fire which is described as \"tossed with spicy feta spread\".  Altough it was tasty, there was nothing \"spicy\" about this feta spread.  Positives:--Great looking, simple menu with tons of choices and I am looking forward to going back to try some other things.--Delicious and extra bad for you friesNegatives: * The food took FOREVER today--during a lunch rush.  I realize this could be an isolated incident and hence my generous rounding up of the star rating :D *  Although my chicken 'gyro' was good, there is a strange, fishy aftertaste.  Not sure if it was the spicy feta spread or the tzatziki I added.  Weird.[on another note, there was a very snarky woman who tried to take over the entire patio seating before even ordering her food--which by the way, didn't come until my party of 6 was almost finished eating]"], ["A L.", "This place is solid. Delicious gyro. Delicious chicken parm sandwich. A variety of sandwiches and pitas. Something to please everyone. Not crazy about the poppy seed dressing on the cole slaw, but otherwise this place is a good fast option."], ["Nate H.", "Fast food greek, with a twist.  I got a steak classic with feta.  Not too bad.What will keep me returning are the fries.  These fries are truly from Mount Olympus.  These fries taste like Zeus commanded Hermes to gather up all of the top-notch potatoes from Earth, drop them off at Hephaestus's forge for cooking and after being deep-fried Aphrodite grooled over the entire batch."], ["Tina G.", "YES!  THE FRIES ARE AWESOME!  The place is super clean.  It takes awhile for the food to be ready (10-15 minutes).  If there are too many people in the lobby you'd have to really listen for your Ticket # for your order.  The seating area seats about 50 maximum. The Spicy Gyro Roll is favored better than the Buffalo Gyro Roll for me!  Love the Hotziki sauce that comes with the Spicy roll. Boyfriend got the Kronos.   It was loaded with chicken and gyro meat.  I suppose you need to request lettuce, tomatoes and 'ziki sauce to balance the meal.  But he loved it as it was.  I took a bite and thought it was good, too!But again....The FRIES are DELICIOUS!  Super crunchy with what seems like they sprinkle a parmesan garlic salt on them!Will go to Hellas up the street soon!  I am still pretty partial to a certain Whitehall Greek restaurant (The Mad Greek) that has a fantastic Gyro and Gyro Salad."], ["Kayleigh A.", "DELICIOUS- I'm not a huge gyro fan, but if I am going to have one- it better be from Loops.  I also love their hot dogs! It is a Chicago-style eatery with fast and friendly service."], ["Jonathan S.", "This was my first time here. I loved how the menu was so simple and everything was reasonably priced.  For 6 dollars, I got a classic gyro, and it was more than enough to fill me up.  Though this place had a fast food feel, the quality of the food certainly was not.  Many greek restaurants tend to make the gyro meats too salty, but the thinly shaved meats served here was flavorful, not salty at all.   I also got the fresh hummus with warm pita.  For 3.95, I ate that hummus as appetizer for the next couple of meals.  Pretty good hummus,  though maybe it would've tasted even better if it had a hint of lemon.Overall, yum! Next time I will try the spicy roll!"], ["Angie P.", "This place is A-OK. Simple menu but tasty. The interior decor is pretty shitty though...but what do you expect? I got the Greek Town gyro and it was pretty loaded up with sauteed onions and peppers. I was happy they weren't stingy with that. I'm also glad that they carve their own meat rather than having pre-cut slices. It tastes better this way. Oh, and their fries are SO GOOD. This location isn't near where I live so I can't imagine going more than once every so often, but, I'm glad I did try something new."], ["Lynn H.", "Feta fire! This is one of my favorite things. Try it on the pita nachos. The fries are awesome. Only negative is that the last two times I've tried to call ahead for carry out no one answered the phone."], ["Christiana C.", "I love me a Dirty Frank's dog, but give me Loops any day.  Loops has a really great Chicago dog.  And those fries!  Those fries are like an angel.  I can't just get a dog since tasting those fries.  I must combo it.  The interior doesn't inspire staying for hours on end but it is clean and fast and there is definitely a place in my life for that.  Additionally, I love the theme of a Chicago el station.  It's adorable and totally works with the product.The service is pretty fast...I don't think I've waited more than 10 minutes for an order and this place is almost always open and never crazy busy (at least when I've been there). Take out is super easy too if you are on the move.  It travels well.  I've actually had the boyfriend get carry out the nights I have to stay late at work.  Loops to me is the diamond in the rough hot dog place I've always dreamed of.  And it can be yours, too!"], ["Adam L.", "The FRIES are AWESOME!!!!!!!!!!!!Also, I really like the buffalo chicken wrap. The Fries are AWESOME!!!!!!!!!!!Gyro is good too. THE FRIES ARE FREAKING AWESOME!!!!"], ["Rob W.", "Some of the freshest Greek food I've tasted and the fries are AWESOME!The owners are really friendly and the staff is great!Even if you have a gluten or dairy allergy they'll make a gyro on top of a bed of fries and you can get the fries seasoned without the parmesean cheese. I've definitely a regular there!"], ["Allie L.", "Eat a Loops if only to try their fries. YUM! I usually get the gyro (also good). They make the food on the grill right there and there are TVs if you're waiting. I don't really like eating INSIDE Loops. It's a bit bright/stark and usually there are people waiting for their food staring at you while you eat."], ["Marshall S.", "I really liked the food but they could honestly use less meat in their gyros (hard to believe, right?)."], ["Christopher G.", "Not a Windy City native, but have been there a dozen times or so. Ive gone to Loops about 4 times now, and everything is de-lish. Gyros are off the chart...lots of meat and fantastic Tzaziki sauce with a perfect garlic balance. Their Chicago beef sandwich is on point too. Even the dogs replicate good Chi-town grub. We will be going back."], ["Matthew B.", "Yay, I AM a fan of Loops! It's not my favorite gyro in Columbus, of course- that's a throne I expect Apollo's will occupy long after good sense has proven me wrong thrice over- but Loops is far better than merely serviceable, and has some real gems on the menu to boot- and I've only been there twice, so there is undoubtedly a gem or two left undiscovered!First, let's get it out of the way: Loops is not perfect. Its atmosphere is a bit too far gone on the sterilization kick, all bleach white and polished chrome and... eck. Too bright, too clean, too unnatural. And am I mistaken, or are those giant televisions ALWAYS tuned to sports? Even CNN would be an improvement once in awhile!Anyways, here's what I love: the fries. Oh God- the fries! Spiced, crunchy, piping hot- damn near fast-food fry perfection. And then there's the menu item I can't get past: the gyro nachos. This is basically your standard gyro meat and gyro fixin's salad with pita chips to eat it with, but with a spicy tzatziki for that extra oomph towards the pseudo-Mexican (I guess). All in all I'm pretty excited when I have cause to be in Grandview for lunch with all the great options around- but more and more my choice has been Loops. Yum!"]], "Aladdin's Eatery": [["Wendy D.", "I come here every few weeks or so and almost never have any complaints. They have awesome vegetarian options, all the meat dishes I have had have been good too and the prices are fair. I even got my birthday cake here one year (tiramisu) and it was amazing. My only real complaint is that a couple of years ago I got a salad with char-grilled tuna and the tuna was awful, dry and tasted like old socks. I let it go and forgot about it until yesterday. I ordered the tuna pita and immediatly remembered the last time I had tuna at Aladdin's. It was just terrible. I ate the veggies and pita and left the chewy-rubbery gray tuna peices in the wrapper on my plate. I'll still go back eventually I'm sure, but definetly not for anything with tuna.Oh and actually one small thing that kind of got to me last time was that they sat us in the front window table (awesome), but then the manager came out at conducted an interview at a table across from us. I could hear the whole thing. It was hard for me to have a conversation and was probably nerve wracking for the girl being interviewed. The whole place was empty...why seat us there??"], ["RB B.", "Ok, but nothing great.  Food was pretty ho-hum...standard Hummus, falafel and baba.  Annoying that they charge for extra salad dressing when you order a salad, and super annoying that they charge for hot sauce.  Really?  Hot sauce?"], ["Rico J.", "Just had this place for the first time and LOVED it! Relaxing decor and a great menu with refreshingly unique food. Ill be back for sure!!"], ["Ha H.", "Authentic; also dishes taste the same time over time.Lot's of healthy options.Easy to call in for a take out, which is what I do 80% of the time.Long time fan.High Marks!"], ["Liz M.", "This is already my favorite restaurant in Columbus!  Everything I have tried here is amazing: kibbie, mujadara pocket, chicken curry roll, lamb rolled.  The meat dishes are perfectly seasoned, and all of the veggies are fresh!  The restaurant and bathroom are extremely clean, and the servers are very friendly.  They have extensive vegetarian options and even carry vegan desserts!!"], ["Jim P.", "Awesome food. We had hummus, Baba, Falaffel, some spinach-pita-feta thingy.. Sheeshkabob ( I butchered the spelling I know), had a guava smoothie, everything was just wonderful and service was great!"], ["Amanda B.", "If I had to sum up Aladdin's Eatery in a sentence: Delicious, healthy, and often locally-sourced food that isn't too expensive.I've gone there a few times, and my favorite dish by far is the Arayiss Pitza- crispy pita topped with fresh, flavorful hummus, ground meat, tomato, and pine nuts. The hummos plate is another great option for an appetizer, or if you're just not terribly hungry. The only dish I've gotten from Aladdin's that I wasn't particularly fond of was the chicken schwarma rolled- the chicken was a bit tough and the sauce was somewhat cold, and it overall just didn't rock my socks. But other than that, pretty much everything I've tried from here has been a win.If you can, leave some room for dessert. They always have a big selection of gourmet cake (one slice can easily be split between two people) and local baked goods. A rocky road bar and some hot tea at the end of a meal always makes me a happy camper.The service at Aladdin's has always been friendly, but not fawning, when I've gone. It's got the air of a nice restaurant, but not so fancy that you'd feel uncomfortable dropping by in jeans and a tee shirt."], ["Scott B.", "Although the ingredients were very fresh and everything seemed well-prepared, the flavor was not exactly to my liking, a bit oddly sweet. However I would have probably been willing to try other dishes here if the service had not been so poor. Drink refills were conveniently not offered on sodas/tea until everyone was well-finished eating and coffee refills were not offered at all. The waitress was extremely inattentive and absent most of the time, we had to go yell into the kitchen to order dessert. Then, adding insult to injury after all that work the dessert portion for the price was exceptionally miserly. I was not impressed. At all."], ["Savannah F.", "Service is usually just okay, but I love their food. It is reasonably priced, and they have so many healthy options. The chicken is always tender, more so than most restaurants I've visited."], ["Caitlin W.", "Just a quick update.  Went here again last night.  The hummous was terrible and the baba was way better than before.  The grape leaves were wonderful.The portions have decreased in size according to my memory.  This is probably a good thing.  The prices have not decreased.  This is not the best thing.On the other hand, the service was great."], ["Rachel C.", "I came to Aladdin's with high expectations.  I love Mediterranean food, and the nearby Lavash was very good, so I absolutely expected Aladdin's to measure up as well.  Instead, I found meh food and terrible service.  I'm not planning on returning, at least not to this location.THE PROS:a relatively nice interior.ease of access-close to campus and right off high st.THE CONS:this was honestly the worst service I think I have ever experienced.  I went with a college-aged friend on a busy evening (Aladdin's was one of the only restaurants in Clintonville with power) and the waitress helped two larger parties that arrived after we did before venturing over with a menu. we then got our food significantly after the other tables.  water was refilled sparingly, like they needed to conserve it.  lastly, as she was setting our food down, she caught herself, and switched my friend's plate with mine.  we had both ordered wraps, mine a vegetarian hummus/falafel combo, his a traditional gyro.  i took a big bite of the wrap and found that she had placed his gyro in front of me.  i'm vegetarian, and i was very unhappy. we had a two person table, and i feel that if she wasn't sure which one of us had ordered which dish, she should have asked. i think that we were profiled as being unlikely tippers and treated as such. this turned into a self-fulfilling prophecy, since i think she got about 10% off each of us.the food was not terrible, but it was definitely over-hyped.  i would much rather go down the block and eat at Lavash, which has food that is at least as good or better, where the owner personally comes out and socializes, than eat at this overrated chain.the dessert selection was slim and extremely Americanized; think large cookies and cheesecake that actually had American flag toothpicks stuck in it.After I commented on the lousy service to some friends, they said that they had similar experiences at this location, so I may be persuaded to give Aladdin's another try somewhere else, but the Clintonville store has lost a customer that was very eager to be impressed."], ["Christiana C.", "I don't know what's been going on with Aladdin's lately.I used to go there once a week and it was always a really good experience.  Lately, the portions have shrunk and the prices are the same/a little higher.  I keep getting charged 12 for a plate of hummus and 1.50 for side veggies.  Um, what?   Allow me to wax nostalgic about the Good Ole Days, because Aladdin's didn't used to do me like this.But!  Their wait staff is still always good times.  I usually see the same people and I like them a lot.  They're very helpful and attentive.  And the food is still some good Mediterranean eating."], ["Emily U.", "It is very delicious! Have been coming here, well, for a LONG time. Has it been 10 years? Consistently yummy.  Lots to choose from. The lamb is divine- moist and tender. Great selection of fruit and veg smoothies. And, well, there is the cheesecake selection! :) Cheap if you want just one thing (like a pita), no sides. Only complaint is that we had MINIMAL waiter service on our last visit. Lots of empty water/coffee time that was unfortunate. And we were ready to order for 10 min before it was taken. I think it depends on where you sit."], ["Briden S.", "Honestly I have never really been a fan, to me it feels like a fast food Med food, and it just does not sit right with me. I can never find anything appetizing to me besides some hummus. Maybe it is because I do not fully understand all that goes into the food, but I have had great Mediterranean food before and this just does not cut it."], ["Mitchell T.", "I have always enjoyed Aladdin's and yesterday's late lunch was no exception.  My lentil soup was even better than I would have expected and my Aladdin's combo plate was delicious.  The meats were prepared perfectly and I loved the rice.  Grace was my server and she offered a great combination of great service and friendliness.  I will certainly save room for dessert on my next visit which I am sure will be soon."], ["Peter D.", "I appreciate the ease of parking here, campus is always a pain in the A.Anyways, the inside is pretty and I really like the hanging bowls that decorate the ceiling. Our server was a total slacker, failed badly at drink refills and mumbled the whole time.Food was great though. Hummas was very filling, and I got a chicken..... wrap... thing. Can't remember what it was called unformulated but my GF liked it more then her schwarma which she really likes."], ["E B.", "I had the lentil soup which was good. But this was offset by the cake I had for dessert.I was a combination of dry texture and sogginess from being thawed."], ["James W.", "Stopped in here on a Saturday night. They have a massive menu. Started with a side salad with the house dressing. Delicious! Had a chicken Schwarma(Just ok). The person I was with had the Chili Lentil soup(Great!).  And something with a sfiha sound to it. Which was also delicious. And dessert of Heath Bar Cheesecake(nothing special). The major thing bringing down this establishment is the service. Was horribly slow.  My glass of Diet coke sat empty my whole meal. The waitress brought out our soup and salad with the dinner.(I HATE this) And was just generally slow. There were only about 5 tables in house and 2 waiters.Food=GreatSelection=GreatPricing=GreatService=Poor"], ["doreen w.", "This place loses a star because the service is consistently inattentive and mediocre. I guess that is irrelevant since they lace the hummus with crack and i found myself waiting outside five minutes before they open to get my fix."], ["Amanda D.", "Hummus here is great"], ["Kevin T.", "The Flavor Saver Special and a nice fruit smoothie. That says it all. Aladdin's is a great place and the service has always been wonderful!"], ["Robert B.", "Yummo! The food here is awesome. I love the vegetarian platter. The chili and salads are also excellent. If you are in the mood for desert this place has variety of gourmet cakes to satisfy even the most complex of palates."], ["Jaynie M.", "My husband and I used to come here a lot. We started coming because they had buy one get one coupons they would publish in a quarterly book we could pick up at a bookstore. They stopped putting their coupons in the last 2 quarters. We like the food and the staff is great, but the coupons really helped. We want them back! :)"], ["KC M.", "Great food you can feel good about eating - but the service at this location is very spotty.  Our server seemed terribly distracted, and with only about 5 tables in the whole place, and two servers, we still waited almost 10 minutes for our soup, and had to wait until our server went to another table twice to get them items before he gave us our checks.  Not good service, by any means, and it's not like they were busy.  Ah, well, the food is great, like I said - but I think I'll stick with takeout."], ["Jen D.", "I really like this place. The staff have always been really friendly and the food is delicious. ...and like Justin said, their hummus is really good."], ["Emily A.", "Quality ingredients, a big selection of vegetarian food, and a nice little atmosphere.  Decent service.  Wonderful pizzas!I'd agree with another poster that food can be a little bland, and you can get more food of equal quality for less money elsewhere.  I used to go the Aladdin's in Lakewood, Ohio (Cleveland) and I remember it being spicier or less bland than the one in Clintonville, but maybe my taste buds have just evolved.I would give 3.5 stars if possible for a good vegetarian-friendly place."], ["Bryant A.", "this place is awesome. the atmosphere is small, but clean and the staff is friendly. the reason why i mention this first is because i had eaten at lavash which is down the street and its very cramped and noisey times. the food is great. all the meats are well cooked and seasoned. i recommend sticking with the platters. they have more to offer your pallette. ive been here a few times already and between my wife and i all the dishes we tried were delicious. dont get me wrong, lavash is awesome as well and ther platters are huge, (although pricy) but this place is more chill and a great place to take a date or in my case, my wife. lavash gets really crowded quickly and sometimes families come in with boat loads of kids. though they are cute, they are noisey and it dampers the experience. i  am originally from brooklyn nyc, born and raised. i have tried many middle eastern esque restaraunts. this place is up there with the best."], ["Emily H.", "Great Middle Eastern/Mediterranean food in a cute, tiny space in Clintonville.  I've visited several other Aladdin's locations, and have always been pleased with the food, service, and decor.  My go-to dish is Jasmine's Favorite, a combination of peas, carrots, green beans, kidney beans, chickpeas, onion, parsley, and rice.  The fatayer plate, the soups, and pitas are all also delicious.  They also have an assortment of smoothies and natural juices - I recommend the delicious and thick mango juice.The reason I most often visit Aladdin's, and I'm surprised no one has mentioned it yet, is the desserts!  They have an enormous glass case at the front counter which is usually filled with 5 or more varieties of cheesecake and 10 or more cakes.  There are seasonal and year-round favorites - both chocolate and non-chocolate varieties, sure to please everyone.  You can even order a whole cake for a special occasion with a little advance notice.I would definitely recommend any of the Aladdin's locations.  This particular one has limited parking, but there is one in Grandview with a larger lot.  Definitely give it a try - and leave room for dessert!"], ["Max T.", "Very good Mediterranean food, and a great lunchtime destination.  This ISN'T Greek, so don't expect standard gyros, but there is some general overlap.The rolled pitas are great - very thin pitas cooked to near-crispness, with good quality meats & other fillings and topped with one of Aladdin's sauces.  Their garlic sauce is the best, but be forewarned, it's VERY strong.  Depending on your appetite, the rolled pita may not be quite enough - augmenting with a hummus appetizer normally does the trick!"], ["Erin B.", "Trippy, weird and great. Try it."], ["Paul F.", "I stopped here to have lunch but the menu was so much different than Pita Hut -n- Grill, I decided to skip it and go a few doors down to try Lavash Cafe.  I'm sure there's nothing wrong with Aladdin's but...."], ["J R.", "Love their hummus."], ["Cat F.", "I've always enjoyed this little gem of a restaurant.  I like the flavors, although they're more mild than I usually prefer.  I enjoy the hummus and the vegetarian dishes, but the kebabs are also good.  I've always had good service, too, even when we've sat and lingered a long time over our meal."], ["Susan H.", "I love Aladdin's Eatery!  Quiet, quiant Clintonville establishment with GREAT food, LOTS of choices, quick service, good prices.  Hubby & I went there just to try it out and were very pleasantly surprised.  We've been here a few times and try something different every time - the menu is huge!  We've never been disappointed.  Highly recommend it - AND save room for homemade FABULOUS desserts.  And if you eat too much, take your dessert to go."], ["Tracy B.", "food ok, but very am concerned with possible very poor treatment of staff. people should be  treated well,  especially in this economy."], ["Erin R.", "aladdin's has always been dependable to me since i grew up in cleveland and hit every aladdin's in the metro area, it seemed like. i have my favorite things, and i know that most of the time they're going to be exactly what i am looking for.went back last night for dinner with a friend, and besides the fact that people who came in after us were seated before us because our hostess disappeared, it was the same goodness i've come to expect. last night we split hummus, even though i am much more of a baba ghannouj fan. theirs is excellent. i could probably eat it every day - similar to my feelings about guacamole. the hummus was good, my only issue is that restaurants NEVER give you enough pita. i understand conserving and not wasting it, but man. i could stand to not eat hummus with a spoon.as an entree i had the aladdin's kabob last night. in the past couple of years i've noticed they've added pickles and turnips to their rolled sandwiches, and i LOVE IT. so much better than the old green pepper and/or cucumber and tomato only. i have never heard any complaints about the rolled sandwiches.i've also had soups, the fattoush salad, pockets, some of the pita pizzas and the kibbeh, and i'm into all of them. the falafel isn't my all time favorite, but it isn't one of my all time favorites as a food anyway so that might be why. aladdin's knows how to do mediterranean food that isn't making me go broke. in hobo economy, i can appreciate that.service at this location has been kind of all over the place - the past few times i've been there have been conflict-free, but i do recall a couple of instances where they got weird about splitting a check or handling a large group. still a dependable neighborhood place, and a restaurant chain that i've been into since high school."], ["Shelley S.", "MMMMMMmmmmmm...I don't even know what I ate here, it was a baked-something with spicy chicken and scallions and peas inside. All I know was that it was fabulous and delicious & I already want to go back. Also, this is random, but I really liked the quality of the lettuce in my salad. Very tasty."], ["Sheren H.", "i used to live at the olentangy village's the cove.so aladdin's was just a couple of steps away.great pitza! and unique drinks"], ["Kenley M.", "Aladdin's serves quality food, fresh juices, and desserts that are hard to resist.  The menu has lots of options from hummus to chili to kebabs to mediterranean pizzas.  While the food is prepared consistently well, from fresh ingredients, I sometimes wish it were a little spicier, or had a little more garlic, or olive oil, or something.  I generally get good service there, and have been many times.  They are happy to accomodate special orders, like adding cheese to a vegan soup.  The main drawbacks for me are price and portion size: while Aladdin's is by no means an expensive meal, you can get more for your money elsewhere in Columbus."], ["Jessica G.", "I love this place.  I usually eat at the on in Bexley but it's not in Yelp.  Great for vegetarians (I'm vegan and have lots to choose from). The service is friendly and competent.  It's fast for lunch.  They serve wine and beer.  The lentil soup is awesome. I order the mujadra pocket every darn time because I love love love it.We take my niece and it's kid-friendly, but I don't think they have a separate menu."]], "Shish Kebab": [["Dawn W.", "I love love love Cafe Shish Kebab. Upon entering, you are pleasantly surprised by how beautifully decorated the dining room is. White table cloths, pleasant lighting, friendly staff that welcomes you like an old friend. I think this might be where some of the disconnect comes on the prices. Typically, we expect ethnic places to be, well, let's just say less than beautifully appointed, therefore we expect lower prices. I think it should be noted that Cafe Shish Kebab is a full service restaurant, not the typical strip-mall restaurant with harsh lighting and wobbly tables.For me, I don't mind spending a few extra dollars to enjoy a wonderful meal in a fabulous setting.I have had the opportunity to travel to Istanbul so I have first hand experience of how wonderfully fresh and delicous Turkish food is. Cafe Shish Kebab does not disappoint. They have an extensive list of mezze (what they call appetizers in Turkey) both hot and cold. My least favorite of all is the pinto bean mixture but my favorites are the cacik (yogurt and cucumber - similar to Greek tzatziki), stuffed grape leaves and tabouli.The entree list is just as extensive, but I can't seem to stray from any form of kebab. Perhaps when the weather gets cooler, I'll be tempted to venture into some of the full entrees like stuffed eggplant, moussaka or some of the delicious sounding stews but for now, kebabs are my go to. If you love kebab or are new to Turkish food, do yourself a favor and go either one of the kebab samplers. There are 2 on the menu, one option is a pick 2, the other option is pre-determined 4 kebab sampler.My personal favorties from the Cafe Shish Kebab menu are the Shish Kebab (marinated cubes of lamb), Kofte (ground beef and lamb), Donor (essentially gyro meat - beef and lamb cooked on a rotisserie), Adana (ground lamb). My next trip I plan to try the Spicy Beyti. I have never tried any of the chicken kebabs so can not comment. I can and do cook chicken about 4 times a week so I rarely order chicken when dining out.All kebab dinners come with a deliciously fluffy, slightly seasoned, white rice and few grilled vegetables (peppers, tomatoes) and of course, all meals are served with delicious complimentary pide bread (oh how I wish they would make the Turkish pizzas, also called pide, from this mouthwaterning bread) and served with a wonderfuly flavored oil based dipping sauce.If you like a little extra kick, be sure to ask for a side of their not-over-the-top hot sauce to drizzle over the bread, kebabs or any where else you'd like to slather it.As I'm not a dessert fan - I have nothing to add to this but I do enjoy ending the meal with a Turkish coffee.Service is attentive but at times a bit \"slow\" by American standards, but for lunch you can still get in and out in under an hour. A full service bar is a nice touch, as is Turkish imported raki (called Lion's Milk because of the milky color it turns when served over ice which is traditional in Turkey), similar in taste to ouzo or sambuca it is meant to be sipped throughout the meal. You can also order Turkish beer (Effe if recall?) if you aren't a fan of the anise flavored raki.Two thumbs up for this fabulous little gem!"], ["Danielle F.", "I am not very familiar with Turkish food, so I have no idea if this is what Turkish food is supposed to taste like. But I can tell you, the food is incredible.First of all, if you have a chance, go for lunch during the week. They have an incredible lunch special. You get your choice of appetizer, entree, and the house dessert of the day for about $10. I calculated it out, and if had ordered what I had for lunch yesterday straight off the menu, it would have cost about $24. My check was $10.62.This restaurant is in a strip mall. It's called \"Cafe Shish Kebab.\" I walked in expecting a cheap little kebab place. I was pretty surprised to see the really beautiful, elegant, high class atmosphere. It's truly beautiful inside.I think I've been to Cafe Shish Kebab four or five times, and I've always left happy. First of all, as pretty much every other reviewer has mentioned, they serve killer bread with an incredible dipping sauce. I usually take it home with me, my grandfather was a huge fan of the bread leftovers!!I have tried their Chicken Lemon and their Lentil soup. Both are excellent. The kebabs, stews, and the Sultans Favorite dish are all great. The desserts are wonderful. Yesterday, the house dessert special was almond pudding. I loved it.The service is always great. They are very nice. Thinking back, I think I've tipped on average 30-35% there because of how exceptionally pleased I've always been.Their turkish tea is also delicious, comes with free refills, and is served in beautiful tea glasses.I highly recommend this restaurant. However familiar you are or, like me, aren't, with turkish cuisine, you will find something you are comfortable with (be it as simple as kebab or a salad). And it will be delicious."], ["Judy C.", "Bread is amazing! Warm, fresh, toasty, and tastes delicious with the sun-dried tomato dipping sauce. Don't be shy about asking for more - they'll continuously oblige. Coming here is worth it just for the bread.I usually get the kebab combo with the chicken adana & regular (lamb) kebab. Comes with rice pilaf and a side of veggies. Chicken adana is my favorite - tender, spicy, and flavorful. The restaurant itself is very nice and classy inside which makes for a pleasant dining atmosphere. Service is attentive too."], ["Courtney A.", "Decent Mediterranean place that I would definitely support if I lived here - Turkish pride! We got the Adana Kebab, some cigora borek and bayti - the last was absolutely the best. Good spiciness to the lamb and nice flavors. Owners were very kind and I even got some free tea as we waited. Some of the entrees seem a little pricey, but I'll be back!"], ["Matthew Z.", "Slightly on the expensive side if you're grabbing a quick bite. However, the food is delicious, and it's unique enough that it's worth the visit.I was there during lunchtime on a Saturday, and it wasn't too crowded.  (I believe there was a Buckeye game that day, which probably had something to do with it.)  The service was fast, and the pita bread was scrumptious.  I ordered some lamb with rice, which had a rich flavor and good texture.  The entree portion and taste is on par with the other Mediterranean/Turkish restaurants in the area.Overall:  It's a nice place.  Give it a try sometime."], ["Morgan D.", "Shish Kebab is kind of the new buzz word with people I know. I got a chance to check it out for myself on Sunday when I attended a birthday dinner.I'm the kind of person who must find an online version of the menu before going in; I like to know what I'm getting into. I was excited to see all the vegetarian appetizers, hot and cold. They also have three veggie dishes, but they were pretty much all cooked vegetables, and for fear of mush stew, I strayed. I couldn't decide which appetizers to gorge on, so I made a meal out of the sampler platter (hummus, Patlican Salatasi, Yaprak Dolmasi, Ezme, Kisir, Pilaki, Haydari, and Soslu Patlican). I'm familiar with...hummus. It took me a while to figure out the rest of what I was getting (Babaganoush; stuffed grape leaves; a tomato, onion, and pepper mix; tabouleh; pinto beans; Turkish yogurt; and chopped eggplant). In addition, I ordered a side of cacik. I love cacik and was excited to go to Shish Kebab for that very reason.The sampler plate was enormous, embarrassingly so. And it came with no carbs - no pita bread, no rices, nothing - just spoons and maybe 4-5 slices of tomato. On the sampler plate was cacik; please note that cacik is not listed under the sampler section of the menu. Alongside my giant sampler plate was a cereal bowl filled with more cacik. Oh my. I do have a way with ordering, don't I? I looked enviously at the swordfish skewers next to me. Needless to say I boxed a large portion of this meal, a very large portion.The babaganoush was the best I've had. The hummus was alright, not much to talk about. The stuffed grape leaves were decent, but I've had better. The eggplant was doable. The tabouleh wasn't very good. I passed on the pinto beans. The tomato/onion/pepper mix was nasty, nasty, nasty.Thank goodness I liked the cacik. I'll probably be eating it for the rest of the week.I also snuck a bite of swordfish, which was delicious.While the food (my food) was subpar, the service was the greatest! I loved our thick-accented waiter. We were a large party, so he broke the checks up by heads of household. All night, when someone would order something, he would respond with the check holder's name: 'You are Ted? No, no, you are Paul? Jim? Ah, yes, Jim.' The waiter made personal recommendations including what was apparently some fantastic wine, and a very good light Turkish beer. Our waiter had a backup team of 3 women who helped with drinks and sides and made sure we were happy all night long.And when it came time for cake, the house lights went down, the best rendition of the birthday song I've heard came on, and the staff waltzed our with chocolate covered with chocolate. Mmmm.That's another thing. The music here was excellent. When we came in, they were playing the theme from The Godfather, which really set the mood. Then, I heard a Turkish version of Hotel California, then Tom Waits. Variety is the spice of life.At the end of our meal, the waiter presented us with gift cards. I'm not sure if we got them because we were such a large, easy going party or what, and I'm not sure how much is on them, but they definitely know how to keep customers coming back. Next time I'm there, I'm flexing for the swordfish."], ["Stephanie B.", "What's not to love about a Kebab? My boyfriend and I spotted the name of this place driving down Bethel Rd. one try, and decided to try it out.And after reading everyone else's reviews, I think I need to give this place a second try. I liked it, it just wasn't the best.We drove up here one evening and they were closing in about 45 minutes or so. They welcomed us, though, and we received very kind service. We were about the only people in the place, and we kind of got the feeling that they were waiting on us to leave so they could be done for the night. Having worked in restaurants, I know what that feels like to just want to go home, but it was a little weird having them sort of loom over us.Anyway, it was a very cute and posh looking restaurant. Seeing where it's located in the strip mall kind of location, you wouldn't think that it was so elegant inside. But it was quite sophisticated. And parking would never be a problem - always a plus! They even have a quaint outdoor patio, although sitting there would only really give you a view of the parking lot and the rest of the strip mall.Since it was so late, I felt quite rushed to order, and just picked the Chicken Kabab, because it was one of the few dishes I saw on the menu that didn't include lamb, which I don't eat. But I didn't really get a good look at the menu. It seemed to offer quite a bit, but I wasn't sure what everything was as it was entirely new to me.Our food was brought out quickly, and it had a very nice presentation. Now, I don't know much about Turkish food, so I can't really say how it was supposed to be. But it was tasty, just kind of dry. I literally just had huge chunks of chicken on my plate, surrounded by huge chunks of vegetables. All good, just not really what I expected, and I wished there was some kind of sauce to drizzle over it or dip it in. Maybe I just ordered the wrong thing, or maybe I should have ordered an additional side or sauce, but I didn't really know anything about the cuisine and as I said, we felt rushed. The wait staff wasn't exactly helpful, but they were very polite.I had to get a to go box because there was so much food left over, and we kind of ended up eating in a rush because we didn't want to make them stay open for us, because by this point, we were the last people in the restaurant. Even though they weren't closed yet, I think they might be used to people clearing out early so they can get a head start on closing up shop.I didn't pay, but the prices seemed reasonable for a nice dining experience, about $15 per person. When we left they closed for the night and locked the door behind us. It all seemed to happen very fast.I liked the place, but I've been to places that are still quite accommodating even when it's close to closing time. But here, I just felt like they couldn't wait for us to leave the whole time. It was somewhat uncomfortable.Nevertheless, we really should have come at an earlier time, and I think I need to do a better job of reading over the menu. Those things were definitely my fault.  This place deserves a second chance.  I'll definitely try it again."], ["Tabitha T.", "NOM NOM!This place is pretty classy looking. Nice wrought iron gates and a big patio. The inside seemed pretty, but being a Friday night it was really crowded. We sat on the patio to take advantage of the relative quiet and fading-summer warmth.The first thing they brought out was a delightful sundried tomato dip, which we demolished using great slabs of delicious fresh bread. They nicely brought out more dip without being asked. I could have just eaten bread and dip for dinner, it was so good. But then I had my lamb shish kebab and it was pretty much the best thing ever. Super tender and flavorful and the rice was buttery deliciousness. The veggies that came with it were not too exciting in comparison - some green beans, bell pepper, and celery.The waiter was friendly and attentive. They have a pretty big food menu and a nice, equally big cocktail menu. The food was reasonably priced, in the $13-16 range for entrees - not a cheap place to eat, sure, but not overly fancy-expensive either.I'd definitely go back. It's a little gem in a strip mall. (Then again... strip malls typically are the places you find hidden gems. Note to self: visit Bethel Road more often!)"], ["Sam K.", "Bread!! I love their bread!!! It really is a gem of a place (in Columbus's quintessential strip mall of course). Dark wood panels, wonderful service, and reasonable prices. I was kinda bummed out that the grape leaves weren't ready for dinner yet (we got there at 6:30pm), but my other choice reminiscent of a turkish mozarrella appetizer was awesome. I forgot the name it, but it's easy to spot on the menu."], ["DARRELL W.", "I've had dinner here twice and the grilled Shish Kebab is excellent!  The best I've ever had.  It's always been perfectly cooked; tender and juicy and the right amount of flaovr. We also love the calamari. This last trip, I had the Mixed Grill, which, for a meat lover like myself, was a dream come true!  It was 4 types of meat with meat on a bed of meat. I gave it 4 stars because, although the prices are reasonable, they are slightly on the high side.  It's the best Mediterranean I've ever had and will definitely go back there for dinner."], ["Evan H.", "One of the best parts of living in Columbus was discovering Turkish food.  The food at Shish Kebab is incredible!  My favorite dish is the shepherd's pie.  It is not at all like the shepherd's pie that you would typically think of; this is tender, spiced lamb sauteed with onions and peppers in olive oil and is served with rice pilaf.  My wife's favorite is the mixed greens salad, which is perfectly dressed with lemon and olive oil, with grilled tilapia and a side of baba ghanoush.  She says the baba ghanoush is the best she has ever had; it is garlicy and silky smooth.  The hummus is also excellent.  Each meal is served with Turkish bread and a sun-dried tomato and olive oil spread.  The bread is pillowy and delicious.  I always have to stop myself from eating an entire meal's worth of bread alone.  They always had an excellent weekday lunch special where you could get an appetizer, entree, and dessert of the day for like $9.  It was an amazing deal for what you got."], ["Jenny G.", "We had an early dinner here today, ordered babaganoush, spicy beyti, and doner kebob. All very good, doner is actually the one of the best we have had. Wish they had a hot paste available upon request though. We will be coming back again."], ["Nicole B.", "I was lucky to travel to Istanbul a few years ago. The food there is amazing, so when I came back to Columbus, I searched for a Turkish restaurant that could match that experience. Shish Kebab is damn near perfect in that quest. The lamb and chicken shish kebabs are fantastic! Definitely my favorite thing on the menu. My body is screaming for it as I type this. The service is excellent, the atmosphere is OK. It's a large room that doesn't offer much intimacy, but once you start eating the food, you forget everything around you."], ["Susan V.", "Thought it was pretty good.  Bread A plus. Lentil soup C-   Shepherd's Casserole CSteak kebab B.  Would go back for lunch when prices are lower."], ["rafe h.", "Great deal great food"], ["Dave M.", "I've eaten at Shish Kebab Mediterranean Grill and the former Cafe Shish Kebab on several occasions. The food is absolutely wonderful, well seasoned but not over-powered by garlic. Any of the kebab dishes are awesome. I often get the mixed kebab grill and take half of it home with me. Their yogurt sauce is excellent. We usually end up ordering the appetizer sampler as it's too difficult to limit yourself to just one item."], ["L. M.", "I've eaten in the restaurant where the dish with the smoked eggplant puree was very tasty. But carryout is a different story. The food seemed to be prepared at different times, so some was cold while other dishes hot. Aftertaste (freezer burn?) to many of the dishes. And when I got home without one of the items we'd paid for, I was told curtly that we could drive back to pick it up. Really? So then everything we'd ordered would be cold?"], ["Chip B.", "This is a hidden gem in Columbus. In an unassuming strip mall next to a BW3 and cheap Chinese place, you would hardly expect to find a place with as nice a decor, really nice wine list, and fantastic food. The menu is a rather typical middle eastern affair consisting of kebabs, hummus, tabbouleh, baba ganoush etc. The food in general is always excellent. It is one of these places that does few things, but does them exceedingly well. Mix that with great service (I have never encountered poor service as others have mentioned) and you have a 5 star value win. My stand out favorite is the spicy beyti kebab. Other kebabs are excellent as well; simply prepared, well seasoned, and with quality meats. Their bread is home made and addictive. It is one of those things that makes you wonder what have we lost in our modern Wonder Bread world when old fashioned breads like this exist and are light years better. Served with a sun dried tomato, rosemary, and olive oil dip; I could make a meal just out of the bread and dip. Another favorite is their cold bean appetizer. This is simple peasant food in all honesty, but the hearty mix of beans and herbs and vegetables is a rich and \"clean\" feeling dish. This place serves what food should be: simple quality ingredients, a good mix of meat, vegetable, and carbs, basic preparations that are time tested and classic. If we as Americans ate like this every day (you know, unprocessed foods with fiber that were incredibly tasty) we would be better off as a country."], ["Julie P.", "Yet another gem on Bethel Rd.  Seriously, if you need to eat in C-Bus, just get on the corner of Bethel and Reed, spin around, and point.  Something is bound to be awesome.Shish Kebab has been on my radar for awhile now, and I'm so glad I finally got to try it out. It sounds totally cheesy, but this is a surprisingly classy place.  It's definitely perfect for a date or a celebration dinner, but you won't feel out of place coming in jeans with no preconceived notions, as we did.  The service was very attentive and professional; I get the impression they run a tight ship here.  Of course, I can't forget to talk about the food, which was amazing.  Husband and I took a risk and each tried some Turkish booze.  I had a glass of Turkish red wine and he had a dark beer, Efes.  Both were fantastic.  Like others have said, you get beautiful bread (leavened) with your meal and a sun-dried tomato olive oil that is pitch-perfect.  We ordered a side of Cacik, their homemade (read it: homemade) yogurt with cucumbers, dill, and mint.  I have to say, I am really, really, very into yogurt, which is kind of weird, but yeah, I dig it.  This yogurt is hands-down the most delicious thing I have ever had. Seriously creamy, not runny or watery, cools your mouth and cleans your palate without leaving a fatty mouth feel.  This is yogurt of my dreams!  I think I have a problem....Also ordered lamb and okra stew and the doner special, which is sliced gyro-style lamb and beef with an eggplant puree, green peppers, and tomatoes.  The lamb stew was very well made, with a nice balance of flavors and adorable little baby okra that was not at all sticky.  The doner kebab was nice, but the real star was that eggplant.  Imagine the creamy texture of hummus with the smoky flavor of baba ganoush and you have this little plate of awesome.We ended the meal with Turkish coffee and tea, which, while not the best of either that I've ever had, was definitely very nice and beautifully presented.I will surely be back here very soon!"], ["Paul F.", "My first impression of Cafe Shish Kebab was WOW, this is a really nice place.  The whole place was decorated in wood (don't know what kind) and that includes the bar area.  It is very, very nice.Cafe Shish Kebab was a great meal, even if it was a little expensive for a weeknight.  The first thing I noticed was the bread.  Instead of pita bread which I was expecting this was more like a regular loaf.  And it was great, quite possibly the best bread I've eaten in Columbus.  Then I had the lamb chops which were accompanied by rice and vegatables.  The veggies included a tomato wedge, a green pepper wedge and green beans, onions and carrots.  The lamb was extremely tender, just great.  I also had a glass of reisling.  Aften dinner I had a bowl of rice puddling for dessert.  This was a truly great meal.  But at $39 including tax and tip, it was expensive.  But hey, you only live once.  lol"]], "The Olive Tree Mediterranean Cafe": [], "Yanni's Greek Grill": [], "Firdous Express": []}