{"Los Guachos Taqueria": [["Jessica P.", "The Jamacia is to die for! The pastor was alright honestly coming from the bronx and being accustomed to the pastor there this was a bit less flavorful and a bit more dry than I prefer, but it was still good. The cheese nachos were good too but nothing too special. I would like to try their other dishes sometime."], ["Amy W.", "Los Guachos has the best al pastor.  The meat is cooked on a giant spit with pineapple above.  Anything served with the pork will have slices of pineapple on top.  I usually get mine as tacos but have also tried the huarche which is a thickish corn meal slab topped with meat, beans, and sauces.  Everything is great.My husband like the volcanes where they make the corn tortillas crispy and add cheese.I recently tried the new spicy shrimp taco--take the \"spicy\" in the name seriously.  I like spicy, but I could not handle this.  We tried to go tonight (Sunday) at 8 pm, but there was a huge line.  I think the recent feature on the Food Network channel is paying off.  We will have to call our order in ahead of time i the future."], ["RC C.", "Go on Monday Nights after 4 pm.  It is BOGO taco al pastor night.  Making the price only $1.50 for two tacos. The best in town."], ["Shuo F.", "The restaurant is located in a tiny little strip mall. I didn't even see the name of the restaurant until I was parked in front of it. When I walked in the decor and the atmosphere felt very authentic. I haven't been to many Mexican restaurants, but the food here was the best Mexican food I've ever had. I only had the al pastor gringas and the ingredients looked and tasted very fresh. The hot sauce they had on the table is amazing! I kept piling it on my food with every bite. It had a strong kick, yet does not overpower the taste of the food. I'm drooling just thinking about it. We will definitely be back! I only gave this place 4 stars because the lady at the register was not very friendly, she kept giving us the b*tch face. Maybe she just had a long day?"], ["Sarah J.", "Holy Guacamole!!! This place is amazing!!!! We went for dinner for the first time on Monday. We did the buy one get one free tacos (ahhmazing) and ordered the $3.00 chips and guacamole special. Our food was flavorful, fresh and tasted authentic. We are already thinking about going back again this week!!"], ["Cameron L.", "Here's what you need to know. The food is great, and if you like delicious tacos, then get the el pastor. They have two sizes of them,  small and large. They are priced accordingly. They tend to be busy but thats how you know its good. Of course your taste buds will understand the wait is worth it.  A quick scan of the crowd should validate how wonderful the food is.  Im writing this review as I wait for takeout order of the special taco and el pastor, everyone is happy to be here. Your welcome."], ["Ty W.", "Looked up some places for authentic tacos on Yelp and came across Los Guachos Taqueria. I was in the area, so I decided to check it out. I order four tacos to go. After I noticed a few of the folks behind me order and pick up their food, I decided to go to the counter to inquire about my order. My box was sitting on the counter; they never called my name. That was my first issue. Second, the tacos weren't that great. Perhaps the experience is different when you dine-in. I just wasn't impressed, which was a shame since I read so many amazing reviews about this place."], ["Laurie A.", "Finally. I found a place that makes fish tacos as good as I do (not bragging, just fact!) :) My daughter had the Torta Al Pastor & saiid it was like heaven in her mouth. My son had the Taco de Lengua & the Taco al Pastor, & my husband - three Tacos al Pastor. I too had the al pastor and the grilled fish taco. Everything was fresh & perfect. Even the kids meals were over the top excellent. We were the third order just after opening & I thought they took a little long, but it was so good we didn't care. If you are even just driving through Columbus like we were, it is worth going a little out of the way for. :)"], ["Vania C.", "Forget Chipotle, Los Guachos is where IT'S AT. This place is the bomb - huge portions, huge fillings, all for a small price. I ordered the Burrito Vegetariano for $5.95 and oh my goodness, I started struggling half-way through because there was just SO MUCH. This burrito was my Mount Everest. I am so surprised, proud, and disgusted at myself all the same time because I SOMEHOW managed to finish the whole thing. I don't know how, but I did. The burrito also came with fresh tortilla chips, guac, and complimentary spice/lime sauce. The best part, however, is the melted cheese that envelops the entire burrito and slowly mixes in with the peppers and beans and salsa as you cut open your burrito. Everything is wrapped up perfectly in a warm soft tortilla shell...yes, it is quite possibly the most memorable Mexican burrito I have ever had in my life. Also, service is super fast. My friends took me her around noon time and we waited in line for maybe 2 minutes and all got our orders within 5 minutes. The servings are, again, HUGE. I must emphasize this because do NOT underestimate the portions. If you're a girl, I recommend splitting an order with someone because it was just too much .For dudes, you might find this the perfect meal before a workout (or maybe not...). Definitely recommend come here and ordering their tacos and/or burrito - it beats Chipotle by far.I'm actually glad Los Guachos hasn't opened in New York and/or Maryland yet, otherwise I'd be dying from food coma every day."], ["Kathryn C.", "I've been doing a \"taco tuesday\" with some coworkers to try out all the taco/mexican places in town. We were hesitant to go to Los Guachos (no alcohol and we wanted margaritas) but wanted to go based on all the reviews and pictures. Sadly have to say that we were not impressed. The prices were great, loved that they had extra stuff on the table and enjoyed the actual place. But we were not that impressed with the actual tacos. They weren't bad, but we we under-whelmed with the actual flavor.Maybe it was the day we were there, but really wish we enjoyed it better. Might try again in the future, but won't go out of the way for it."], ["Calvin C.", "It's all about the gringas. Came here on a friend's recommendation that this place has the best Al pastor in Ohio. And he's from Mexico who runs 5ks so that he can eat more pastor so he must know what he's talking about, right? I think he is. I got two and then ordered a fish taco, a veal head taco and a sudera (beef). All of the tacos were good but once I bit into the gringa, I wish I had ordered 5 gringas and nothing else. The gringas are a flour tortilla with vegetables, cheese and shaved Al pastor. The Al pastor is roasted on a spit which you can see when you walk in. It has amazing flavor and some crisp from the roasting. Blended with the cheese and vegetables, you get some amazing flavor. We got our food to go but when we walked in, all of the tables were filled with people so you may have to wait a bit if you want to sit. After trying it, they probably do have some of the best Al pastor that I've tasted."], ["Elizabeth K.", "It must be the fact that I've been so deprived of real legit tacos that I'm actually giving this place a 4. If I have to compare it to the options that I have back in LA, Los Guachos wouldn't stand a chance! But to be fair, I won't even go there.Los Guachos are famously known for their Al Pastor. It's the same exact meat, but I preferred the Al Pastor on my nachos than the tacos. Al Pastor Tacos: The tortilla's flavor is too strong and it overpowers the taste of the meat. It just didn't seem to mesh well for me. And dare I say it? The Al Pastor wasn't greasy enough! I just laughed at the amount of pineapple on the taco. It was cute. A thin shaving of pineapple. Carne Asada: The asada was extremely bland. It had no flavor whatsoever. Good texture, though. Nachos: Good portion. The ingredients complimented each other a lot better than the tacos. I was actually able to enjoy the meat!Chicken Torta: I had NO expectation for this because all my hope was in my tacos. After being utterly disappointed in them, the torta was the saving grace of this meal. AMAZING! Chicken was tender, moist & seasoned deliciously. Avocados were perfectly ripe too. The service was great. The woman up at the cashier was helpful & gave plenty of recommendations."], ["Stephen P.", "Went for the first time yesterday - amazing! Will head back today. It's quick, but not fast food. I had never had al pastor tacos before, so I was a little intimidated, but ended up having a great experience.I would recommend reading over their menu online prior to stopping in; this way you can familiarize yourself with all of their different offerings. I chose 2 al pastor tacos and the al pastor juanas. Both were excellent!If you're taking carryout, they put all of the side veggies and sauces in the bag for you. I really like when places do this, as I love all the extras. It was nice not worrying that I was missing out on something. I also hate when places give you the bare bones at carry out, forcing you to stock up before you leave. No worries about that here.Probably headed back today for dinner! I highly, highly recommend this place. I'll be back quite a bit!"], ["Cheli C.", "Went here yesterday. The place was packed. Very hot. I was excited to try this after all the awesome reviews. The fish taco was very good. Probably a 4 of 5. The Al Pastor was good, but nothing as good as the hype. 3 of 5.  The food was nice and fresh and the prices were excellent.  That being said, I wouldn't go out of my way to go here. If I lived nearby, I'd come on occasion. Just nothing close to the hype. I'd go out of my way for the fajitas at Señor Tequilas on Hard Road if given a choice between the two every time."], ["Tiffany C.", "Gotta take this here update review down a notch star wise, Kiddos. I hadn't returned to Los Guachos in quite a while, but I remembered now why I frequent the other joints popping up everywhere. Los Guachos may be the first to offer great and authentic Al Pastor tacos in the central Ohio region, but they need to step up their game if they wish to continue contending with new creations like HAAS, Charritos, and the plethora of trucks starting up in the region. First off, the cashier totally did not want to be there, and rushed us.. BIG time. It was borderline rude, and there was no line. We were the only ones there. Even the cooks had to yell for her when others came in, because she was nowhere to be found.The past two times I have came to Los Guachos the meat is overpowered by Onions and cilantro on just about anything you order. As I sat there enjoying my Lengua Torta.. comparing it to others in the area... everything was spot on perfect, and cooked to perfection, but the onions just killed it. I even overheard people ordering and asking for no Onion and even remarking they put too many on previous times. Why so many onions? WHA-Y!?The husband remarked that the Al Pastor on this trip was very skimpy, and extremely dried out. Perhaps you have to be here during the rush to get fresher meat on your tacos, but Los Guachos left us a little unimpressed this time. The review is 3 1/2 stars, teetering four... it's a decent sit down place for tacos and street fare, but they need to step up their game. It's not a one man's Taco world anymore in C-bus."], ["Brianna M.", "I cannot believe that I've never heard of this place until tonight! There's a reason why this place is rated so high. It's Mexican at its finest, the absolute best I've had in Columbus. I knew I was in a happy place when I saw the glorious spinning cone of marinated porky goodness. My friends highly recommended the gringas, basically a flour tortilla taco with the al pastor pork, cheese and a little shaving of pineapple. This is for real the best thing I've eaten in a while. Super fresh, simple, cheap and delicious. I also ordered 2 chicken tacos. Those were unimpressive and a little dry, in fact. If they weren't so dry this place would have easily gotten 5 stars. There was a plentiful sprinkle of cilantro and fresh onions on everything. On each table are bowls of limes, spicy marinated onions, red sauce and cilantro sauce. Oh, and they have that addicting and delicious Jaurritos pop! The feel of the restaurant is causal and open. It was super busy when I was there, full of people happily chowing down. They have a pretty extensive menu to please even the pickiest people; there's tortas, tostadas, tacos, burritos, quesadillas...everyone can find something they like! I can't wait to come back and try something new. Whatever menu item I choose  it's definitely gonna contain that awesome al pastor pork!"], ["Kaoru M.", "I think this is one of, if not the best place to get some tacos in the city of Columbus. I personally prefer their gringas (soft taco with al pastor style pork, grilled pineapple, fresh cilantro) and torta (very similar to a panini). When I come here for dinner, at least half the customers seem to be Hispanic folks, so I assume they're pretty authentic. Doesn't matter either way though, the food here is way better than anything I've ever had in Mexico. A couple points of caution however. First, the parking lot is tiny, and there's limited seating inside. Their other location on the East side off of Morse & Cherry Bottom is more accessible for those on that side of town. Second, they do not serve alcohol, at least at this location off of Bethel & Godown. If you need a margarita or a Corona with your Mexican food, you can just eat here then hop across the street to the Winking Lizard for your boozing needs."], ["Melanie A.", "Went there for lunch this past Monday. Ordered tacos al pastor, as usual, and was charged full price for all of them. Asked if the BOGO al pastor wasn't the special on Mondays anymore and the cashier said \"yes, after 4 PM, like always.\" Not sure if the Gahanna location changed, too. I'll try there on my next Monday off and find out."], ["Susan R.", "I gotta be honest. Even though Los Guachos is supposed to have the bomb al pastor... I liked the al pastor at Hass better. So did my husband, who actually ordered it (since I don't buy meat for myself--just took a nibble to compare).The upside to Los Guachos is that they're open late, in case you want tacos and it's past ten or so. I find their tacos to be so-so. My burrito was also so-so--pretty unmemorable.The menu is pretty authentic, but the execution could be better.I also find their dining room to be super weird. I mean, okay--I'm used to eating in actual Mexico, and the big, ornate wood furniture wouldn't really be totally out of place in a sit-down restaurant there . . . but most taco places in Mex aren't sit-down restaurants. I'd be more comfortable in a less froofy dining room. Which... this wouldn't matter at all, if their tacos were the most amazing, I'd eat them sitting on the floor or on a throne made of ebony or on a chair made of nails, but they're not amazing.PS: If you can't do habaneros, don't eat the chunky salsa from the bowl that's on the table. I did that once and I think I almost died."], ["Felix F.", "I've seen a lot of tacos in my life and I must say this place is right up there with the best of them. If you're  looking for authentic tacos in Columbus, this is the place to go. I would recommend the Al Pastor and Lenguas, but you can't go wrong with whatever you pick."]], "Local Cantina - Grandview": [["Douglas G.", "I enjoyed the local cantina! We went on taco tuesday and got the two dollar tacos and they were delicious! I got the shrimp, americano and a beef one and they would all be on my list to get a second time! I really enjoyed them.The coolest part was the chips and salsa though. They are in a big bin in the corner, as is the salsa and you self serve them as much as you want! Very different and neat."], ["Desiree S.", "Taco Tuesday is a great way to bring in business and business is what they had. My group of 4 got there about an hour after opening and the place was PACKED. It was about a 10 minute wait for a table but it was worth the wait.The group ordered a pitcher of The Mustache Ride margarita which was 90% tequila and fantastic. The taco's seemed hit or miss for the group but overall I'd say we would definitely go back again!"], ["Michael U.", "This is crazy good.  There is one opening super close to me on South High Street so I wanted to give it a shot before I got to excited.  Now I'm super excited.I was surprised at how CHEAP it is.  Delicious margaritas 4 bucks.  Guac 4 bucks.  All you can eat chips and salsa FREE.  Big quesadillas 6 bucks...you got the idea.  Oh and it seems like a killer happy hour and Taco Tuesdays!Great service, delicious food, nice atmosphere...I'm in."], ["Gus W.", "This Local Cantina location is right in the heart of Grandview, so if you try to visit during prime dinner hours, you're probably not going to get a parking spot. Luckily, that was not the case for me, as we went there Sunday afternoon, and the place was basically empty. The only other Local Cantina I've tried is the one in Gahanna, and the Grandview spot is just not as good. Besides the fact that there's less space, which is not something they can control, the service was just not that great. Like I said, it was empty, so they really didn't have a whole lot to do at the time.We were looking for a quick meal, so I just ordered some tacos, and my girlfriend had the Monterrey quesadilla. I just wanted to grab a few chips and some salsa for a snack, but the chips were pretty stale and not very appetizing. The food came out fairly quick, and the BBQ beef brisket tacos I had weren't nearly as good as the Gahanna location's. The grilled chicken taco was pretty tasty though, and I really like their homemade hot sauce they have on the table as well as the other two hot sauces as well. The quesadilla was pretty much what I remembered from the other location, and it was really good. I'm not sure what they do to it to make it so damn crispy, but it's like I'm eating a giant stuffed tortilla chip that's just slightly soft with gooey cheese everywhere. Yum.This would be a spot I'd go to again but really only if I'm in the area and walking around Grandview Ave. It provides a quick spot for some good craft beers as well as quick eats, so maybe this one mediocre occasion doesn't speak for the place. I'm sure I'll give them another shot, so we'll see."], ["Stephanie P.", "After it started pouring rain, The Boy and I bailed on Digfest and went looking for a place to eat. We both had a craving for tacos so we steered to Local Cantina. We have had some hit or miss bouts of service at the Gahanna location. I am happy to say that we had no issues with the service here. Our server was friendly and prompt. The Boy went for a couple of tacos and I opted for nachos. The nachos were fantastic! Just the right size and completely covered in cheesy toppings. The Boy devoured his tacos and placed a second order so they must have been tasty. We will add this Local Cantina location to our Grandview restaurant rotation."], ["Kristen K.", "The boyfriend's and my absolute favorite place in Columbus. From the blood orange marg to the tacos (cantina fish and avocado BLT please) to the endless supply of chips and salsa, it can do no wrong. Always a good atmosphere and a good time. It's a smaller space, so I know people complain about the crowd or wait at times. But seriously, take a breath, have a marg, and just remember that in the end, the cantina fish taco is ALWAYS worth the wait."], ["Robert H.", "One thing that we should all be able to agree on is that Mustache Rides at Local Cantina are great.  This was my first time stopping at the Grandview outlet, and it more than lived up to my expectations.  Yes, it is smallish, and yes, it is in a suburbanesque strip mall, but it is still freakishly awesome.  The servers are friendly and are happy to bring margaritas and tacos to you wherever you are sitting.  I mean, who could ask for more than that?They have outdoor seating, which allows you to watch the action in the parking lot, which is actually pretty interesting.  There are several businesses nearby, including a coffee shop and a Mediterranean place, which offer ample comings and goings to observe.The mustache ride margarita -- the house marg -- is cool and smooth.  It pairs well with eavesdropping on the natives while they lament their first world problems.  Fun times.  One of my hobbies is trying to make these margs at home.  I have yet to master it, so I'll keep coming back for research purposes.The tacos are also fantastic.  Today, I tried the BLT taco for the first time.  It may be my new favorite.  Bacon, lettuce, tomato, avocado...  so good.  Did I also mention that the tacos are pretty cheap.  Bonus.Rock on, Local Cantina."], ["Christina G.", "Came here with my friend who lives right down the street so was a quick walk in the nice spring weather. We got seats at the bar and proceeded to load up on the self serve chips and salsa. So convenient and also dangerous at the same time. We got guac and queso too, generous portions and tasty. Probably didn't need to order any more food after we binged on chips but everything was so reasonably priced I had to! My friend also couldn't stop raving about what a great deal their taco Tuesday's are ($2 tacos). We got some nachos, chicken flautas, refried beans and corn soufflé. Everything came out quick and was hot. Really have no complaints about the food except I was so full I had a hard time finishing anything! Drink wise I got a house margarita and then the blood orange margarita. Nothing special about the house one, preferred the blood orange. Down time in between drinks was a bit long, bartender could've definitely had at least one or two more rounds on the tab if he was more aware. I really like the vibe of this place, low lighting good music playing (black keys album) and a decent Thursday night crowd. Would love to come back next time I'm in town!"], ["Natalie C.", "Servers don't know the concept of teamwork, tacos are greasy, lack of training is evident. Saw bartenders taking shots behind the bar and then were unhelpful when we were trying to find our server, who in turn didn't really know what she was doing."], ["Karin G.", "I love the setting - a fun mexican restaurant with a big bar and garage door that opens on nice days.  I love the get your own chips and salsa.  And I also love their specials and drinks.  I just don't quite love the food.  It's just ok.  But everything else makes it a worthwhile experience."], ["Yasser A.", "Yummy ! worth another visit  I'll come back."], ["Brian M.", "The staff is great.  The food is delicious and the beer is cold.  Great place to stop for quick eats or a nightcap (or 5).  It's busy with good reason.  They do lots of things really well.  It's not fine dining but doesn't claim to be either. If you haven't been here, you're missing out."], ["Katie B.", "Favorite Grandview bar! Favorite fish taco in Columbus!  Local Cantina is such a little gem!  Self serve chips and salsa is nice and spicy. Their queso fundido rocks! Like I said, cantina fish taco is where it's at.  If I have to pick a second it's the fajita chicken taco.  The only one I wasn't impressed with the the BLT taco because it was so sparse/small, but no less tasty. They have a great, ever changing beer list, fun cocktails, several margaritas (of course) and skeeball!"], ["Lindsay V.", "I went on Tuesday night aka $2 taco night!While we waited & admired the cool decor & lighting, we grabbed chips & salsa which had just enough zest & flavor for my liking. The server suggested the blood orange margarita add jalapeños...I love jalapeños & this drink didn't disappoint on flavor. It was hot, yet sweet. Kinda weird, but in a good way. The guacamole was also really good, but I wish they had a bigger serving for the price. The tacos were decent, but after the 2 Margs, I kinda forgot which ones I ordered (oops). I'll go back again especially when the patio is open!"], ["Nicole S.", "Service was horrific. Waited about 5 minutes for a table of 5 - 2 adults + 3 kids. Waited 5 minutes for menus. Ordered within 10 minutes and that was the last time we saw waitress. Literally. I had to walk to the kitchen to ask for two glasses of water. Wasn't even our waitress that brought them. Seriously some of the worst service we've had. As for food - kids meals were eh. Pretty average. Avocado BLT and Cantina fish were the best tacos we had. Baja shrimp was boring and the carnitas was an oily mess. Chips and salsa bar was nice but the quest was dried and so thick and chunky it seemed as if it had been sitting around for days. Again had to walk over to get our bill. Seriously. Don't waste your time here. Hit Hass, Los Guachos or taco loco for much better food and service!!!"], ["Arvid Y.", "I just visited Local Cantina for lunch and I really enjoyed it.The combination of tasty tacos, decent draft beer selection, fair pricing and a self-serve chips & salsa station make for a positive experience overall.Like others have mentioned, the fish tacos are good here. I tried both their fried and grilled fish tacos, both were excellent. They are served with a \"jalapeno slaw\" and \"chipotle cream.\" A little too much sauce, but extremely flavorful nonetheless with a good balance heat, sour and sweetness. I was a little less impressed with their chicken \"truck style\" taco, which I found bland.Maybe the tacos are a bit \"Americanized\" with chopotle sauces, but they are still very tasty. I'll be back for more. It's a pretty low key and casual atmosphere, which is another draw of the restaurant. They have a big bar area with a couple of TVs to watch the game. A great Mexican option in Grandview!"], ["Danny R.", "Walked out before even ordering. Staff was uninterested. Not engaging. Didn't even finish half a our drinks which took 30min to get. I'd recommend avoiding this place period."], ["Amber S.", "Stopped here after seeing a movie with friends. One of them had raved about the happy hour deals and while we were too late to take advantage of them we still wanted to check the place out.It was a busy weekend evening and the only line I encountered was for the ladies rest room. Service was good and our wait person came over to check on us often but not so often as to be annoying.in addition to our drinks we had the chicken flautas, jalapeno poppers and unibrow poppers. The chicken flautas were unmemorable, and the jalapeno poppers were served hot. I wasn't adventuresome enough to try the unibrow poppers but those in my group of 4 who did said they were not for the faint of heart."], ["Sheri S.", "Mustache ride margaritas $5 at happy hour are classic and Delicious! Has a great patio and very clean food on the menu! $3 drafts at happy hour also! Service is great and they have a huge selection of whiskey and bourbon!"], ["Emma O.", "Service was pretty terrible. Our group of seven came in around 1030 on a Friday night. Although the place was pretty dead, it took our server forever to get to us. She seem more concerned with chatting behind the bar instead of doing her job.  And when she did she was rude. The boy asked her for some ranch dressing and when he still had not received it after 15 minutes he asked her again. To which she replied \"I can't just go and get it. I have to wait on the kitchen you know.\" Woah. No one was irritated or attacking her and she instantly flew into defensive mode....then brought the ranch out five seconds later....yeah. My shrimp tempura tacos were not bad just slightly small for the price. Overall I would say the food I had was okay, but not worth baring the brunt of basic biddy's bad attitude."], ["Katherine M.", "I've never had such polarized opinions on different aspects of a restaurant experience. Local Cantina in Grandview has TERRIBLE service. I'm always willing to give businesses that I believe in a 2nd try.. and maybe even a 3rd... and in this case a 4th. But consistently the service is just horrendous. Slow, forgetful, slow, inaccurate, slow, unresponsive, slow.... So why do i keep returning you ask? The foooood!!! It's great! Trendy micro-taco establishments are all the rage now apparently, so since I can't escape it I'm going to embrace it. And I've never been disappointed in the food. I think the prices are fair too, in comparison to like-establishments. The mushroom quesadilla is actually my favorite, and the self-serve chips & salsa, I mean come on... DUH what a revolutionary concept that should have been implemented when Mexico was founded. Another reason why the staff has no excuse to suck -they're not constantly running back and forth serving tables their complimentary chip refills. The queso is amazing - it's the white kind for those of you that are biased. Skee Ball too! Strong margs. Negative points for taking the mustache fad a little too far, but otherwise I'm a fan. Definitely check it out next time you get the itch for Mexican, but come with ppl you like bc you'll probably be there a while if the service hasn't improved."], ["Nathaniel K.", "Best tacos! Need I say more?I've been here a few times now, and the food is consistently high quality and tastes delicious! I'm a big fan of their chips and salsa: some may complain that it's self-serve, but that means that I can get refills exactly when I want to, so I really like it. Plus, I think their chips are great and the salsa is fantastic (and they seem homemade, but you never know...). Their beer list is huge and consistently has tons of beers I've never heard of, even if the breweries are familiar, which is great! They're happy to give you samples if you are unsure about a beer, too. Our server was friendly, albeit not the most attentive and somewhat slow, and if the service was improved I would be hard-pressed not to give this place a five.The tacos are just amazing, and they have a way of integrating flavors into unique combinations that excel in execution. The decor is a smattering of different styles, but it works in an eccentric way. I've been meaning to try their margaritas, but I just can't pass up their beer selection!"], ["Kerri K.", "Decent mexican restaurant with good tacos and a great atmosphere. I only give this a 3 because while the tacos were delicious I couldn't help compare them to Bakersfield's tacos. The tacos here were cheaper and you didn't have to pay for salsa or wait in a long line for a table."], ["Adam L.", "I want this place to be awesome. I really do. First the great things: 1. A fun atmosphere. 2. Chips & Salsa Bar which encourages me to eat a buttload of chips. 3. Service has been great. Staff is friendly and remembers us when we're there. 4. Solid drinks. Margarita's are on point, decent specials and interesting selection. Now the Frustration: 1. Every time I've been there, my party is frustrated about the quality of the food. Mexican food is classically easy to produce, but somehow it ends up being sub-par. The taco shells are - somehow - bad. I think they'd be better if they'd just snag some off the shelves of Kroger. 2. Their version of queso is the least appetizing I've ever had at a Mexican joint. I'll continue to give this place a shot, wish it was better and hopefully it will change."], ["Paul F.", "What a great meal!!  I couldn't fnd a thing to say bad about this place.  It was easy to find; right in the middle of Grandviews litlte shopping center.  And there was plenty of parking, all for free.As for the food, everything was just great, from the chips to the drinks.  I started with the chips.  They were thin and crispy and the taco sauce was very good.  I then ordered three tacos: one carnitas, a tempura shrimp, and a brisket.  And they were all just great!   I also ordered a regular margarita, heavy on the salt.  It was delicious.  Maybe the best one I've had.  And my bill was reasonable; $15 before tip.  It's nine o'clock and I feel like going back over and doing it all again!"], ["Gabby S.", "Seems to be always busy but tacos and margaritas a really good. Highly recommend the veggie taco!"], ["Sylvia R.", "We ate here on a Sunday late afternoon. Totally underwhelming. Plastic menus were sticky all over.  Service was awful considering they were not busy. Sat at the bar and ordered nachos to share. Bartender brought nachos but we had to later ask for plates and napkins. Then had to ask again for silverware. Nachos were fine, margaritas were decent but tiny. With so many other places to choose from offering the same experience we will not be coming back here anytime soon"], ["Joseph W.", "Very disappointing. Had high hopes for the bufallo chicken nachos and steak burrito, but ended up being a 100% let down. Burrito smelled and tasted awful. Steak tasted old and dry. Buffalo chicken dip..which is hard to screw up was abysmal. Tough, overcooked, nasty chicken with slimy cold and saturated chips. Never again."], ["Twila K.", "Total dive. I feel everyone around me right now is trying to get over last night's hangover. It's a bit sticky & the bathroom is lit up like I imagine a brothel would be. There is a hand drawn sketch on the back wall of the bar. Hubby and I aren't sure but it may be pubes... anyways, good beers on tap although not worth $6 each. Amusing place but won't be back."], ["Liz M.", "A-OK absolutely! Fun atmosphere and cool decor make this place good for groups and after work hangouts. I stopped in after a meeting on night around 8pm and it was pretty dead. Although, it was a Monday. It was seat your self and self serve chips and salsa from a bin on the outside left of the front door breezeway. The chips are not kept warm, the salsa was pretty good. I ordered the taco salad with fajita chicken. It was OK. a salad served over chips in the same type chip bowl you get from the self serve station. The salad was not bad at all. It was fresh. Just not fabulous in any way and I'd likely not order it again. My friend had a couple tacos and said she would not order the veggie taco again, but said the chicken was good. Overall, we had a fine time at Local Cantina. I have a friend who just loves this place for their margs, but seeing as it was Monday, I wasn't planning to try one. Am I rushing back? No. Would I suggest it? No. As long as El Camino Inn exists, there are no other Mexican restaurants for me."], ["Abigail S.", "I love this place! You can't beat the Cantina Fish taco and free chips and salsa. The rotating draft list is usually pretty good too. Only giving it 4 stars because service can be pretty slow when sitting at a table. Any time I've not been happy with something they always correct it."], ["Allison S.", "Oh man, the three dollar tacos are delicious...especially the Baja Shrimp. Ice found that once you  sat down and gotten your order in, service is quick. You just can't beat how good these tacos are for the price."], ["Crystal P.", "When I'm not stuck living at my own bar, you will find me here. They have the best chorizo that I've ever had! The staff is full of super friendly people and the draft beer selection is always on point. Love this place!"], ["Andrew G.", "Great place to grab a beer! They have a decent selection and chips and salsa are free! There margaritas are good, but their other mixed drinks are just okay. The food is nothing special, but cheap and fast so that bumps it up a notch. The reason that this place gets a 4 star instead of 3 is because of the neighborhood. Clintonville needs some bars and Cantina is bringing a decent bar to a great neighborhood."], ["Walt S.", "First stop at Local Cantina in Grandview was a winner. The visit happened to be a Saturday and around 2PM.  What I learned was Local Cantina has a weekend brunch menu that runs from 11AM - 4PM.  What I liked a lot was it was huevos, Huevos and more HUEVOS!  But first the location and place.Local Cantina is a bit hidden and parking on a Saturday was horrible.  So what's new for Grandview if you're not parking near the theatre.  I managed metered parking quickly and strolled over.  So I'm okay with that.  Just a door past Aladdin's, Local Cantina (in this humble marketing whiz' opinion) needs a logo upgrade.  It's name is the logo and you don't see it,... even with a sandwich board on the Grandview Avenue sidewalk.  Look.  FInd it.  And go.Inside it's restaurant and bar which I liked.  Big enough bar to handle, I'd say 20 - 25 guests comfortably.  Plenty of tables, too.  I chose the bar.  A big barrell of corn chips with salsa is a freebie.  Muchas gracias, Local Cantina.My order was for huevos rancheros, home fries and some queso (for my chips).  Out came two sunnyside up eggs on corn tortillas, potatoes with spicy cheesy drizzle.  All good.  Way good!  The prices are not bad for the brunch and there are at least 6 - 7 huevos creations.Next time I'm in the neighborhood I'll swing by Local Cantina for tacos - good looking selection.  And a marguerita.  There will be a next time, too.  Mi nombre es Walter y yo soy un YELP'r."], ["Claudia F.", "Food here has improved since I last ate here. Service was also wonderful. I like it here now. I like the top shelf margarita. Will return for drinks, food or both"], ["Sarah G.", "Epic fail.  They are definitely living up to their \"bad service\" signage on the front window. Went today to try the brunch, and could not have been more disappointed with everything from the service to the food to the temperature in the restaurant.  It is no exaggeration to say that we were shivering with our winter jackets one. Our drinks took about 15 minutes to arrive, and the food took over 45 minutes.  Once it did arrive my huevos rancheros weren't even lukewarm. My friend's chorizo skillet was a bit warmer, but it definitely tasted as though it had been sitting under a heat lamp. Informed waitress that dish was incredibly cold, and instead of re-firing the dish, they stuck it in the oven. By the time I receive my dish, my companions had finished their meals.  The waitress asked if it was any better, to which I let her know it wasn't and she removes the dish. She did ask me if I wanted them to make me a new one, but since we had already been there for over an hour I told her no. Our bills arrive split incorrectly (only two bills, three diners so not rocket science) with the huevos rancheros (of which I had three terrible bites) was still on there. During the nearly hour wait for our three meals, they were out of salsa, and as we were leaving they were out of chips. I could forgive bad service for good food, or bad food with good service but I can't forgive both. Next time I want a fish taco I'm heading to Bakersfield."], ["Heather N.", "I was not feeling this place. I feel there are better restaurants out there that give a better product of Mexican street food. Maybe this is a place is for a younger crowd and I am getting old. The best part of my experience was a Blood Orange margarita,  though I didn't end up finishing it due to the sweetness. As for food  I have a Quesadilla  that I could have made at home. Prices seemed high and I feel I could have gotten a better product a a food truck. Service seemed slow and I got this overall feeling that the server didn't care."], ["Allysa M.", "LOVE Local Cantina!  The food and drinks are excellent and $2 Tuesdays are my favorite days to go!  The salsa and chips are self serve so you can have as much as you want, when you want it.  You don't have to wait for your server to bring refills which I love. The Migas and Carnitas tacos are fantastic.  You can't go wrong with their queso or their quesadillas either. As far as their margaritas go, the Mustache Ride, Blood Orange and the House are all great choices. The only thing to watch for is the wait.  It is extremely small inside so coming with a group of 5+ could be difficult. However, this is definitely one of my favorite happy hour spots in Grandview!"], ["Anna H.", "Still our go-to place and I heard they now have Peroni on tap.  Whoo hoo!I now strictly get the fish, and the shrimp tacos.  Just delish."]], "El Tacoriendo": [], "Tacoriendo Movil": [], "Taqueria La Super Torta": [], "Nada": [["Jasmine J.", "This review is for Nada's happy hour. I sat at the bar on a Friday evening. Bartender Stephanie is great. Happy hour selections are minimal but of great quality."], ["Gina A.", "I have joke that there is a taco bubble in Columbus.  Taco trucks and several bars that feature tacos heavy menus.  Nada is a bright star among the taco joints.  I've eaten tapas and tacos here.  The spicy macaroni and cheese is a favorite.  Their guacamole is good.  This place does flavor awesomely."], ["Scott B.", "My wife and I had heard great things from our children about Nada and we were excited to experience the place. When we entered the restaurant, there was no one at the host stand. No big deal.....There was a young man talking to a group of young ladies at the bar. He looked at us several times, but no response. We were about ready to leave when he finally came over to us and asked us if we were here for dinner. We replied yes and he sat us at a table. Our waitress came over to us and took our drink orders. We ordered the Nadarita and my wife had  the blueberry drink. Both were great . We also ordered the guacamole with chips. Both were very tasty! I ordered the shrimp tacos for dinner and my wife ordered the fish tacos. The order came very quickly and we both enjoyed the tacos. The combo of shrimp, avocado, arugula, and lime was amazing. The tacos were temperature hot and wonderful. Our waitress though never explained to us the sauces on the table so we were clueless. After dinner, I saw the couple next to us looking at a dessert menu. Our waitress never offered us the dessert menu so i had to ask for it. We shared the chocolate cake with the banana foster ice cream. Very nice. the ice cream was very good. The cake was a chocolate lava whic is always nice. The decor in the restaurant is exquisite. Very lush. The food was excellent. For what we paid, I thought that the service could have been more personal. We really didn't feel like we were appreciated. Not sure we will go back which is too bad."], ["Amy F.", "I'm a sucker for good Mexican food... and Nada had me at Hola.I've eaten here three times now and each time I've thoroughly enjoyed my meal. My favorites: - The Salsa Tasting Trio: The chips are light, flakey and unlike any chips I've ever had. The salsas = amazing! - The grilled salmon tacos- The carnitas tacos- The pastor tacos- All of their margaritasI'm pretty sure that once I make my way through the rest of the menu, the entire menu will be listed as my favorites. Everything is fresh and flavorful. The service is always great as well! Today, we stopped in for lunch and Griffin was our server. My friend has an allergy to onions & peppers that made it hard for her to order from the menu. Griffin had the chef prepare a special batch of guacamole for us that had no onions or peppers. It was delish! He also helped her to create an order for tacos that weren't on the menu so that she could enjoy the Nada flavors without any worry of an allergic reaction. We will definitely be requesting Griffin to be our server when we visit Nada again. He was the sweetest !The Atmosphere is funky and fun, but the bathrooms are probably my favorite of any restaurant. My next visit will be for brunch after seeing the pics of the pork belly & fried egg taco!"], ["Carol N.", "Came with my husband and a friend for a late lunch after my husband had a good first visit and after reading all the positive reviews. We were not disappointed and this may soon become one of my favorite restaurants. The place wasn't busy for lunch on a Saturday when OSU football was away and the Jackets didn't play until later so we were immediately seated. The hostess was more than willing to accommodate my request for a booth to place my daughter's car seat, and offered a sling but I declined. Service was quick and attentive, taking time to describe the ingredients and offerings. Each of us ordered 2 tacos and loved all the flavors. I had the pastor (perfectly spiced and delicious) and arrachara (my favorite; sirloin cooked perfectly with fresh avocado and spicy salsa), husband and friend had the barbacoa. We split the 3-salsa sampler and had to get another basket of chips, they're so good! I also had the tequila mule which was excellent. Had to wait a little longer than normal (for it being completely dead) to get our bill but we will definitely be back!"], ["Anneke M.", "We hit this place up after a Clippers game, and had a great experience.   Our server was super pleasant, and wasn't afraid to show his personality beyond the standard politeness of a good server, which I always appreciate.  Margaritas and chips and salsa were great, and our friends had a blueberry cocktail whose name escapes me, but was also delicious.   I had the steak tacos, and my dining partners had salmon and chicken, which they also raved about.  The fact that it's a *little* pricier than I'd like given the fare is the only thing keeping this place from getting five stars. That being said, it is in Arena, so everything is going to be priced a little higher than my normal stomping grounds in Clintonville."], ["Gus W.", "Watch out, Bakersfield, Nada's here and contending for the top trendy, upscale Mexican in town. Actually, forget Mexican, this place is just snazzy in general. We were there on Saturday for lunch before most of the customers started filing in, so we got to get a good look at all the interior and funky decor. The girlfriend and I loved it.Our server, and I forget her name, was super helpful and enthusiastic in going over the menu and making recommendations. She was a bit slow at times with the refills, especially since it wasn't busy at all, but I can forgive her for that, because the food was incredible.I decided to leave the pastor tacos for the girlfriend and went with the bacon and egg (pork belly) tacos. In the meantime, we got the guacamole, and it was delicious. My girlfriend liked it more than Bakersfield's, but I'd say they're about on par with each other. However, the homemade chips may have a slight edge here. They were awesome, and I like the fact that the guacamole actually comes with salsa as well.Our food came out pretty quick, and I was not expecting an over-easy egg on top of my pork belly tacos, but I like where their heads at. As soon as I folded it up, the yolk spread out all over the pork belly, combining with the pickled peppers and onions and diablo salsa, forming an incredible taste sensation. The habanero salsa on the table was combined with carrots to form a bright orange color, and it was fantastic on the tacos, giving them a huge kick. My girlfriend now wants to make it at home, because she loved it so much. She was also a huge fan of her pastor tacos.Along with the tacos, we split an order of Mexican mac 'n cheese, and I'm a huge fan of anything with roasted poblano and jalapenos, so that was a winner for me. I thought the two tacos wouldn't be enough food, but I was pretty full by the time I started eating mac 'n cheese and really had to muscle it down.The pricing here is my only gripe. You're going to pay more than you would at Bakersfield, and you're quite far from the trendier area of the Short North. However, I feel the tacos at Nada are slightly bigger and edge out what I had at Bakersfield but only slightly. I'm not sure how busy this place actually gets, but I doubt you'd have to wait nearly as long as you do at Bakersfield. My girlfriend officially loves this spot more, so I'm sure we'll be back, and that's not a problem here, since I thoroughly enjoyed the meal."], ["Breanna B.", "A nicer take on Mexican fare - Nada fancies it up. Their guacamole is hella good. Seriously, eat it with the jicama. It's the perfect fresh crunch to go along with the guac. Always order the double ($12).A margarita is a requirement, I kept my order basic with the a classic 'rita, salt on the rim. It comes in a high ball glass and one lasted me through dinner.Baja battered fish tacos were my meal of choice. $15 gets you 3 hearty tacos with corn tortillas (no sides) but I was full to the max after that meal. Loved that they paired it with some guacamole. I haven't had that with fish tacos in the past and it's a good complement to the overall flavor.The decor is all intentional with little surprises tucked inside the seemingly elegant wallpaper and fabrics. It's like an adult version of the game, \"I spy...\". Plus, their secret party room is unreal. I'd book that for a birthday party or bachelorette in a heartbeat."], ["Douglas G.", "Went to Nada today because my lady is seriously obsessed with tacos, and it was some seriously good mexican! We went for brunch and it was unique/delicious.I ordered the eggs benedicto, with crab + avocado holindase sauce and it was teriffic and very fresh. I did not taste as much crab as i was hoping but that was perfectly fine. My lady got the egg and pork belly tacos, and she was the winner. They were some of not only the best breakfast tacos but tacos ive ever had in general! So good.The portions dont look that large when youre served but thats deceiving, i was very full and satisfied when we left. We also got the guacamole to start, and it was as good as id expect from a restaurant like this.Its a pretty nice environment, not your run of the mill mexican restaurant but a little more up-scale and i enjoyed it! A good change of pace. But be careful... They have pretty fair prices but with a couple drinks and sides we racked up a pretty nice bill in a pretty quick time!"], ["Donna O.", "Nada es muy bueno, and a great place for whatever you're looking for in an upscale setting. Dark wood, low lighting, backlit bar separated from the main dining area, semi-open kitchen, tequila on tap. Both the setting and clientele are, as fellow diner Lori put it, \"very nouveau-Short North.\" (I have another term for this, but she is much better at polite wit than I am. Ahem.)Anyway. We made a reservation for 8pm and were seated quickly by a rotating staff of hosts. Our server, Molly, was friendly and answered our questions and made suggestions for combinations. The tacos come in threes, and they are mix and match - the menu is a little confusing, as prices are listed for three-of-the-same rather than a la carte. There are also non-taco options.But, back up to the appetizers. We got the salsa trio and of course, we ate all the chips because no matter what you tell yourself, once the chips appear, it's nom time. The salsas were delish! Most especially the habanero salsa - hot, spicy AND sweet. I'd eat that with a spoon, no chips required (and to be honest, I did dip my spoon in a couple of times, just 'cause).I ordered the pescatarian options - shrimp, salmon and Portobello mushroom tacos. The shrimp taco came with arugula and a chipotle aioli, and with a little dab of the habanero salsa, was pretty darn close to perfect. The Portobello taco was also great, and all of its ingredients gently enhanced the flavor of the mushroom - which I like. The salmon was cooked to near-dryness, and overcooked salmon is extremely pungent. There was no way I could even consider a second bite. However, two tacos paired with chips and salsa are plenty to fill you up at Nada. They were happy to bring more habanero salsa for us, and refresh water and drinks regularly.Drinks - they do have the aforementioned tequila and all associated drink combinations. They also put tequila in the sangria, which made me sorry I'd ordered beer. The cerveza here is all bottled, gotta save those taps for Mexican gold!Overall, it's a great upscale experience that won't break the bank, staff are efficient and friendly, drinks strong, and the food is good. It's worth making a reservation in order to check it out."], ["Catherine J.", "A-OK, in the best way!The Arena District needed a restaurant with a little more flair than the chainy offerings that have haunted the area (not that chains are bad, and I know this isn't the only Nada -- but I think you know what I'm saying). I think Nada mostly delivers on a promise of something different. Tacos are fun, and everyone loves guac. The cocktails are imaginative. The interior is festive and feels upscale. I enjoyed my tacos and the plating. It was the perfect stop before catching a show at the LC Pavilion. Good for groups, too.I was initially annoyed when I heard people complaining of the price here -- you can't compare Nada prices to a taco truck when you consider the full waitstaff, gorgeous and creative interior, and location. Apples to oranges and all that. However, after visiting, I did have a little bit of sticker shock... cocktails felt a dollar or two too high for comparable restaurants in Columbus. I'd agree that other fun full service taco restaurants are significantly less expensive. I'm sure Nada sets prices at what they need to be to cover costs and still be profitable, but it's just a bit spendy to do on a regular basis.So, Nada won't be where I think to go if I just want a fun taco night, but I am happy to make this a stop before or after attending other entertainment in the area."], ["Emma L.", "Nada is definitely a welcome (and much needed) addition to the Arena District. Bf & I decided to try Nada for a fun boozy brunch. I was already familiar with the prices and portions before walking in so I was prepared to spend a bit more than the typical brunch. I made a reservation via Open Table (through Yelp), called an Uber and we were on our way.The building exterior is really gorgeous and I'm obsessed with the red stained wood. It smelled over-the-top smoky, which I didn't like but once we got inside it was fine. The interior is well done and suitable for groups large or small. We got lucky and got to sit in the semi-private seating at the back of the restaurant, perched a bit above the main floor so we could spy on everyone.Every host and server we interacted with was top notch. Friendly, helpful and the right amount of conversational.We started with Chips, Salsa ($2) & Guacamole ($7). The chips are thicker and a little greasy, but I was into it. Unfortunately we must've gotten the bottom of the barrel because we had tiny little miniature chips. The guacamole is very good and I love the slices of jicama they serve with it. I would like about 12 of those instead of 2. For our mains, we each ordered Barbacoa tacos (2 for $10) and split a side of Mexican Mac & Cheese ($8). Everything was so so tasty and I liked the tacos much more than I expected (there weren't many veggies and I usually load it up). Honestly we couldn't tell the difference between the regular and the spicy, maybe they forgot one was supposed to be diablo style? At first I was afraid we wouldn't have enough food (he's a vacuum) but we had the perfect amount. Also, the Mac & Cheese was addicting, I could have slammed my face into the bowl, but I'm a lady. Ah, yes, the cocktails. We ended up on a little tour around the cocktail menu and loved every. single. one. Run down:- Bloody Maria ($7): Bloody Mary with Tequila. Great twist on a standard. - Sparkling Grapefruit ($7): Small, but tasty. Sweet, but not overly so.- Tequila Sunrise ($6): Thought it was weak at first. Nope, just well made.- Peach Fuzz ($6): YUM THIS TASTES LIKE VACATION GET ME ON A BEACH- Velvet Underground ($8): Most interesting cocktail of the bunch. Sour, but I kept wanting more.I definitely can't wait to brunch here again!"], ["Barbara W.", "Came for happy hour. Left happy! Yes, it is pricey. Keep in mind this is all fresh, drinks are amazing. No complaints about anything. We left full. Four people $78. Just know before you go, you are not buying rice and beans :)Highly recommend queso. Sliders were great but spicy and  although I'm not a fan of spicy because I have a sensitivity, everyone else thought they were mild and delicious.Hoping to go back and try brunch."], ["Susan R.", "I'm wavering on whether to give Nada four or five stars. It's a solid five star experience: great food, great drinks, beautiful restaurant, and our server was awesome.It's just. It's really hard for me to pay $15 for three tacos, no sides. Yes, they were good tacos. No, they weren't significantly better than $1.50 tacos from a good taco truck. And while I understand that Nada has bills to pay that a taco truck clearly doesn't have, I also feel like the food should be elevated enough to reflect that and give me an elevated experience.(Also . . . I mean, just saying, you couldn't throw some rice and beans on the side? I don't think a cheaper-yet-still-delicious food even exists.)Maybe I'm too simple; maybe other people put enough stock in being able to eat in a beautiful setting instead of at a picnic table outside a beat-up truck that they want to pay that much for tacos. I'm not EveryYelper, for sure.I can see myself going back and having a cocktail and some chips and guac on a night when things are slow in the Arena District (because for real, I'm not trying to be anywhere near Arena when there's a game or a concert or a confluence of bros getting their Friday night on). The tacos were good, but not good enough for me to lay down that much money for them again."], ["Amanda G.", "Visited Nada for Restaurant Week and really enjoyed it! They have (July 22-July 25) a $20, 3-course prix fixe menu and it is a slammin' deal. What I ate:1. A big 'ol Nadarita (not included in the $20 deal)2. The warmest, crispiest chips around with some spicy salsa3. A cup of Mexican Mac N Cheese that made me want to cry tears of delicious joy4. 2 tacos that were stuffed with tender grilled white meat chicken and all the fixings5. CHURROSI mean, that's a lot of food for $20. Good food. Don't come here and skip the mac and cheese. Seriously. You will be mad if your friend gets it and lets you have only a taste. IT'S NOT GOING TO BE ENOUGH. I also sampled the barbacoa tacos which were very saucy. Almost barbeque-y. They were delicious. So was the flan. Really, everything I put in my mouth was a treat. I'm excited to come back!"], ["JaMalle F.", "My experience here for dinner the other day was absolutely wonderful. My friend and I were kind of hoping we would stop somewhere cheaper, but the quality ended up being worth MORE than the price we paid. Starting off with the easy stuff, our waitress Sophia was highly attentive and informative. She helped me make the right beer choice, and I was not disappointed in my Stiff-Arm IPA in the least bit! The set up of the restaurant was really classy. I felt positively important just from eating there. It reminded me of how grand the Cincinnati location was last I visited. I ordered Papa's Ceviche as an appetizer, and it was delicious. The fresh seafood flavors were pronounced at the beginning but it was capped off with a nice spicy finish. Very balanced. I had the pleasure of trying  both the veggie tacos and the baja fish tacos. The former was very savory with mushrooms and cheese while the latter was fresh yet not too strong of a flavor. I was highly satisfied and can't wait to go back!"], ["Arvid Y.", "Nada is a new addition to the Arena district restaurant scene. It a modern, dare I say \"upscale\" Mexican restaurant that's been successful in Cincinnati for quite a while now.My first impression after walking into the restaurant was \"wow.\" The interior is modern and luxurious with an abundance of warm lighting and wooden trim. The atmosphere is both classy and cozy. The bar area is particularly impressive with illuminated liquor bottle cabinets and hexagonal mosaic tile backsplash. Fist bump to the interior design team.The food was good. We sampled a variety of appetizers and I pretty much enjoyed everything. The guacamole was fresh and the queso was tasty. However my favorite appetizer was the habañero \"kreeper\" salsa. It's truly addictive and is a must-try if you enjoy spice. It comes with the salsa tasting trio, but perhaps you can just request it with your regular chips and salsa.I ordered the grilled salmon tacos, which came recommended by the waiter. They were excellent - moist and full of flavor without being too fishy. The cilantro and chipotle crema complimented the fish nicely, adding a bit of heat and sour. $19 is a bit steep for fish tacos, but it does come with 3 good sized tacos and you are paying for the atmosphere as well. I believe the pricing is less for lunch.I was very impressed with the service, especially since they just opened 2 weeks ago. The staff was on point and there were absolutely no hiccups. My water was refilled countless times and they somehow managed to flawlessly separate the checks for us individually. I had a great first impression of Nada and I will definitely be returning. The only downside I can see is the parking. There is limited street parking, but there is a parking garage close by. It is also on the pricier side for Mexican food, but as I mentioned before, you're paying for atmosphere as well."], ["Mike G.", "Rolling into Columbus right on the heels of LaRosa's Pizzeria is another Cincinnati favorite called Nada.  It's a brand new restaurant that just opened Saturday and I'm glad to see them here.My short review first:\"Mexican\" - Contemporary - Eclectic - Cool - It's Downtown - Trendy - Upscale - Chic-ish - Delicious - They Charge For Chips And Salsa - Odd But Cool Men's Room Diorama (not telling what that's about....sorry).And now my full review:This is a cool new spot in the Arena District.  I came here for lunch today not having a clue what this place was about other than it's \"Mexican\".  I like it.  It's cool looking with a very contemporary feel to it.  It's trendy but not over the top.The food was very good.  They have a moderate sized lunch menu with plenty of variety for most any taste.  I opted for the Baja Fish Taco entree which gets you two tacos.  I also got a side of Black Bean Puree.  The tacos were really good with crispy breaded fish, lime cabbage, guac and cilantro and I'd certainly get them again.  I have to give special kudos for the side dish I ordered.  The side dish, you ask?  Yeah, the side called Black Bean Puree.  I really, really enjoyed this dish which is a blend of black beans, tomatoes, onions and rice topped with Queso Oaxaca.  It was good, so good in fact that I'd go back for a big bowl of that alone.  The only thing food wise that I'm not crazy about is that they don't give you free chips and salsa like every other Mexican restaurant in the universe.  They have them but they charge for them.Their Nadarita is their version of a margarita and it was also pretty good.  Think standard margarita with a slight fruity taste to it as opposed to tart.The service was also impressive.  Ashley was very nice and had the right balance of attentiveness without going overboard.   Jarrod the GM also stopped by to make sure everything was to my liking.  It was.  I'm saying this is a 4 1/2 star place and I'm wanting to go back again and try some more things.Anyone with me?"], ["Karen M.", "Nada...can I just say how much I loved this place? I went for our awesome CM, Bryant ' one year anniversary party (thanks again Mike G for setting up).  The place is beyond gorgeous...probably my very favorite setting in all of columbus. I mean...the bar area where we sat was cool casual and comfortable and the dining room was so modern and chic. I loved the wood walled \"arched\" entry to that room. So dramatic and beautiful! The the private dining areas, especially the \"birdcage\", I could live in there. And the bathrooms...totally cool...can your decorator please come do my house?I ordered three tacos. At our server, Adams recommendation,I ordered the pork belly and salmon tacos.  I also ordered the fish (I think cod) tacos. Let me tell you...the fish taco was very good but the other two beyond delicious! I mean totally over the top so good! I loved them and can't wait to go back for more. We also had chips and salsa and guacamole...all very good as well, especially the guac. Someone ordered soup...pumpkin or squash that looked really good. I would like to try that too.The service...these guys really went all out to take care is us. And I don't think it was because we were a group of yelpers. They all, especially Adam and Molly, seemed to genuinely want to take care of us and make everything perfect, which it was. In talking with Molly after most of the group was gone, I learned of the restaurant's customer service philosophy and hiring practices. I was super impressed as I know there have been times when a mediocre meal becomes something entirely different just based on the service...these guys really seem to have it together.Looking forward to my next visit...Hope it's soon!"], ["David W.", "I'll cut to the chase: the food is really good, but it's expensive for tacos. However, the better taco places are NOT places you can go for a client meeting (Junior's, Condado, Bakersfield, La Poblanita). So I like it if it's a professional lunch, especially the fish tacos and the salsa sampler which is amazing, but if I want really good tacos for not a lot of money I'd likely go somewhere else first. Since there aren't a lot of good options in the Arena District, this is a fine option and I hope they keep doing their thing."]], "Fiesta Jalisco": [], "Charritos": [], "Phatt Taco": [], "Los Potosinos": [], "Casa Hacienda Grill": [["Vel E.", "By far the best Mexican food i've had in ohio. I'm from Connecticut and there's some killer Mexican food out there. So for the last seven years i've been disappointed in every place since moving out here. I've been here twice and it was excellent both times. Great service. Extremely fresh and bold flavors. It has a homemade/handmade feel that other places don't have. You get a ton of food for a great price. The decorations are beautiful. Not a thing i would change or tell them to do better :) we drive 30 mins to get there because there's nothing that can compare!"], ["Kasi Z.", "This is a pretty good Mexican restaurant, but not the best that I've been to. I got the fajitas and they were pretty good, but their tortillas are very thin. They were different from any other tortillas I've ever had at other Mexican restaurants. I wasn't the only one who was not a fan of them. So this is an alright place for some Mexican food, but I'm sure better options are available."], ["Michel O.", "It's all about the food and the food is incredibly deilcioso.We sadly missed La Hacienda when it closed and only recently found it's replacement, Casa Hacienda Grill. Casa Hacienda Grill has an extensive menu and excellent food. For starters, we loved the bean dip w/ slaw served with the complimentary chips. The chips were good too. I ordered a Burrito Relleno wo/the Spanish sauce. It was much larger than I expected. It  was different but delicious. The relleno was an omelet-style, egg-wrapped mild green pepper and tucked neatly inside of the rice and bean burrito. I am a fan of fried chili rellenos but this was an interesting style that I've not had before. I am looking forward to trying the Mole Enchiladas and a Margarita on our next visit and my next review."], ["Celinre S.", "Increíble recosimos  sabrosos!!!First being of Mexican decent it is always very difficult to eat Mexican food outside of our home. Second being from California we have some incredible authentic homemade food.  So with that being said our experience was 100+% Off the chart with the quality of the food, the flavor is so good and so  close to homemade favorites. The staff are so welcoming, friendly and gracious. Typical Mexican hospitality. Mi Casa Es Su Casa atmosphere.  The servers are pleasant and food wait time is timely.  Your food is plated neatly and arrives Hot. The presentation of the food is perfect, hot and generous portions.   I cannot say enough about the  food, service and establishment. It's decor is typical Hacienda interior designing like you would find in Mexico. I would definitely recommend this restaurant to anyone who wants a great Mexican food meal.  You will not be disappointed.  I can't wait to share my experience with my restaurant in California. Bien provecho!!! Muchas Gracias Casa Hacienda.  Bien echo"], ["Kathy T.", "We've been looking for great Mexican food since we moved to Columbus - this is it.  It's not Tex-Mex, it's Mexican food done very well.  Prices are great and it has all the things you want in a good Mexican restaurant.  Good service, friendly staff too."], ["Greg S.", "Great spot with authentic food. What service lacks they definitely make up in friendliness. Definitely recommend this spot and will return."], ["Heather N.", "This place has some pretty outstanding Mexican and Tex Mex food, here is what sets them above the rest -Homemade flour and corn tortillas, they are light and perfectly soft. -Refried beans and slaw with your chips. Such a refreshing addition to the plain old salsa and chips. The salsa is not bad either -Huge portions, though I normally finish my meal because the food is that good. -Extensive drink and food menu. This place has so many food and drink options, everyone is bound to find something they want. Decisions, decisions, decisions! -Check out the tile work, great colorful atmosphere. Don't miss the tile work in the bathrooms too!"], ["luna o.", "I am so excited. We are sitting here eating dinner and this is by far THE BEST MEXICAN FOOD in Columbus!!! So glad we tried it..The staff was nice and the food was excellent!! Horahh...Been in Columbus for 7 months, originally from California. We will definitely be back here!!!!"], ["Mollie F.", "Pollo medio was very disappointing. However my dates molcajete seafood which was amazing!!!  The service was not great and the place was somewhat dirty. I wouldn't come back."], ["Shannon M.", "My mom and I are Mexican food addicts!  We are always looking for our next favorite spot.  And we're pretty picky.  Found this place on yelp and saw all of the good reviews, so we went to see what all of the hype was about. Uuummm.... yes... we LOVED their food.  The chicken is suuuuch good quality. .got the sampler appetizer. very yummy.  Guacamole is the best ive had.  Rice is the best ive had.  Honestly,  there wasn't one thing that wasn't fabulous.   We loved that they used shredded cheddar on their nachos. So good!!!!!!!!  Can't wait to go back."], ["K K.", "Great food but they do not honor the coupons that can be purchased (Groupon, restaurant.com) from other sites as stated.  They create exclusionary rules that you don't figure out until you get to the restaurant and see their paper sign posted.  For example,  the Groupon is only good for Monday-Thursday,  which was not stated in the Groupon fine print.  Disappointing."], ["Liz M.", "Pretty much awesome! It starts off meeting the super cute host, an older gentleman who has a great mix of english and spanish and is super gracious. It's clean and has that fun Mexican restaurant feel with outdoor style decor. Chips and salsa and beans as well as waters arrived first. Great super thin, crisp, hot chips with either a so-so salsa (definitely good enough) and yummy beans and slaw. Both work well. Our server was prompt, sweet, personable, and helpful. Overall, great.We were there for lunch and they have a lunch menu with smaller (still huge) portions and smaller prices. Upon receiving the check, I told them thy should charge more! Most everything was $6-8! I got the carnitas and they were delicious and came with amazing homemade tortillas. All of the entrees come with the fresh tortillas so, I would suggest ordering an entree. Brian O. got the chimi and really enjoyed it. Cleaned his plate actually. From the time we sat down to the time we got our check was 30 minutes. So if you're in a rush it's perfect, but you can be as leisurely as you like. I highly recommend this place and can't wait to go back and try 10 other things I saw on the menu that sounded good!"], ["Robert H.", "Come here for the best flour tortillas in Columbus.  Homemade and absolutely amazing.  They get a fourth star for the tortillas.  I have been here a couple times.  Most recently, I tried the mole enchiladas, which were a good pick.  The cinnamon in the mole gave the dish an almost breakfasty quality, which was nice, and the accompanying rice and refried beans did their job well. I'm not sure what it is about the interior of this place, but it seems rather sad and cold.  Perhaps it is a lighting issue, because the tile and paintings and wood benches should feel warmer.  I also have a beef with the cocktail menu: it has no prices.  There is a pretty strong price-quality relationship with tequila, in my experience, and it is hard to pick a winner off their menu.  But the staff is friendly, the food is decent, and the tortillas are crazy good.  Crazy good."], ["Jed H.", "Great Mexican restaurant.  My wife and I eat here often.  Always enjoyable.  Great affordable food.  Great atmosphere.  Worth trying."], ["Mrs L.", "This place had better flour tortillas than the ones my friend hoarded in Porto Nuevo. (Troy, you know who you are!) They are paper thin and delicious. I'd love to meet the woman that makes these so I can learn!  We were just driving through on our way to Indy and found this on yelp. So glad we did. The building, the music and the food took me back to vacations in Mexico and my Nana's kitchen.  Seriously, how can a place this authentic be in Ohio? We got chile verde, mole and a simple combo plate. I can't wait to drive 3.5 hours to come back!"], ["Beverly R.", "Having grown up on homemade Mexican food from Toledo, I have struggled to find good Mexican food. This is just like the food I grew up with. Amazing! One of the best places in town."], ["Nijole T.", "FINALLY I have found my go to Mexican in Columbus!It was a long and hard journey and I was really about to give up but after hearing so many good reviews about the Casa and being in the area we gave it a whirl!I am a lover of refried beans and LOVE how they bring you a plate of them with slaw and salsa for starters!I have to admit I ate 4 plates of of the beans and a ton of the salsa before we left but it was that good!Everyone agreed this is the freshest and tastiest salsa we have ever had, as well as the beans, no cans or lard here!I got the fajita taco salad which was very good and my husband and son the combo platter which for once was really worth it!They got a chimichanga, chalupa (needless to say blows taco bells away) and burrito, each were big, and very very good, my husband had it with steak and my son with chicken, both were very tasty.Their spanish rice is also among the best, no dry, flavorless heatlamp grains here, it was fresh and yummy!The prices are fair and they have an awesome dessert menu (fried ice cream, churros, fried apple burrito, I want it all!) but we were  too full and will have to be back!Service is very friendly and fast and the decor is elaborite and clean, nice place for the family and a great meal!"], ["Allison H.", "Many more visits to Casa Hacienda have warranted another star! This is my go-to since it's conveniently located for me and I've liked everything I've ordered. It helps that the kids love it too, so it's an option when we don't feel like cooking for all four of us.The shrimp enchiladas have become my favorite dish here. Didn't like the tortilla soup, but there are enough other things I love to even things out! Service has also been excellent every time, whether they're busy or not."], ["Shaun H.", "I've only eaten here one time after a suggestion from a friend but it was by far the best Mexican restaurant I've eaten at.  They are quite busy so we did wait a little while, about 10-15 minutes for a table on a Saturday evening.  I got the shrimp fajitas and they were amazing, especially the actual flour wraps, which tasted the best I've ever tasted, I think they were homemade or something.  My girlfriend loved her dinner as well.  The beans and rice were delicious.  We've been El Vaquero regulars for years but I think this will be our new go to place when we decide we want the best in Mexican food here locally."], ["Emma L.", "Found myself in this area of Columbus while running some errands on a Saturday. Bf loves Mexican, and we're always looking for new spots to try. Casa Hacienda is highly recommended on Yelp (4 1/2 stars!), so we had to try it. The outside looks a bit creepy. I don't know if it's the location, the decorative bars on the windows or what. Once we walked in I felt MUCH better. The decor is over the top kitsch, but fun for a place like this. One thing I did notice was how clean it was. The place seems huge and there was no dust on the (fake) plants or visible grease in the kitchen, floors were swept, bathrooms were spotless. Our server, Roberto, was friendly and on top of it. Kept our glasses full without being buggy, which is sometimes rare for restaurants like this. Much appreciated!I ordered the Burrito Carnitas ($11.50), which oddly did not come with carnitas, but your choice of chicken, steak or pork. I went with the chicken and it was pretty delish. The flour tortilla burrito had grilled onions and peppers and sides of Rice, Refried Beans, Sour Cream and some surprisingly good Guacamole. The only thing I was meh about was the cheese on my burrito. I had hoped for melty white queso sauce and got melted shredded cheddar instead. Still, really good.Bf had an order fail. He got something with rice, chicken and mushrooms in a red sauce ($10.50). Oddly, there was a lot of celery in his dish which really overpowered it and made the whole thing taste a little off. He was definitely a fan of my burrito though...One kind of nice thing about Casa Hacienda is that they give you a little plate of beans and slaw to accompany their spicy salsa and chips. It was nice having a little variety to start the meal, though I did feel like the slaw was a little bland. I don't think we'll ever go out of our way to visit Casa Hacienda again, but if we're in the area I think we'd give it a second try (and both order the Burrito Carnitas!)."]], "Rancho Alegre": [], "Chile Verde": [["Robert S.", "We were referred to CVC several times since I moved my office into the area. After discovering Lido's Pizza mysteriously closed, my wife and I were forced to scramble to a new location during her lunch break. Chile Verde was in the same shopping center.While the service was OUTSTANDING, the food was... well... odd. My blue chip nachos had a \"spicy ground beef\" on it that made me sick. I LOVE spicy food, and was thrilled to see plenty of jalapenos all over it. But something about the spicy meat just made me feel ill. It was also covered with black olives, which I don't like, but that was my fault. My wife got the lunch soft tacos and paid extra for \"Fajita Chicken\". She typically loves Fajita anything, but really didn't like the chicken. She felt it was overcooked. The atmosphere was just fine, and as I mentioned before, the wait staff was awesome, attentive and polite. They earned the two stars, the food lost 3."], ["Jeremy H.", "I'm going to give this place a four...it earned a five during my first trip and went steadily downhill from there.  However, it is my favorite place to get non-Chipotle Mexican food, Los Camperos being my second favorite.  As others have mentioned, the chips and salsa are free and amazing...you really have to pace yourself or you'll fill up on the warm hot corn tortillas (gluten free for those with celiacs or allergies) and the fresh chunky salsa.The food is really good as well, so far I've had the fajitas which is enough food for two, the BBQ fajita burrito which was okay, and a few of the other items.  My wife and one of my daughters are both allergic to wheat so they can't have the regular flour tortillas...here they will substitute any flour for a corn if you ask, although they may make it slightly different.  If it doesn't come with sour cream be warned it will cost you $1.The fresh hand squeezed lemonade here is outstanding, they could teach Hoggy's a thing or two about making lemonade.  My first trip here I got free bottomless refills, I love it so much I took a glass home.  On my second trip a week later I was informed that the lemonade/limeade does not come with free refills...bummer since it costs $2.50.  I tried the limeade and it wasn't as good.  On my third trip I got the lemonade again, the first time it really was worth $2.50...best lemonade ever, however, my last trip it tasted a bit sour as if the fruit was slightly bad, no amount of sugar could fix it.  If you pay $2.50 for a lemonade you want it done right.  The manager did nothing about it but switch me to the pink lemonade from the fountain for free.  For this they earn a solid 3.5 stars but I'll give them four for now."], ["Raquelle Z.", "If you have read my reviews in the past, you might remember that I love good Mexican food. My question to answer this meal was can great Mexican food be found in Columbus? Chilie Verde did not disappoint. I had a 3 flavor combo of a shredded beef enchilada,a chili relleno, and a crab cake. Everything I tried was delicious and their was plenty of it! My raspberry margarita was very good although I think the $9.00 price was too steep to enjoy more than once! I would return next time I crave Mexican food in Columbus."], ["Tory R.", "I came here with some friends...hadn't heard about it before. The service was really really good! There was about 6 in my party on a busy Saturday evening....but everything was really good! I had the chile rellenos. You can get one, two or three of the rellenos....and I'm glad I only got two because I was STUFFED! One of my other friends got the chimichanga and it looked divine! I'll try that nex time! The place is really cool and they have a waiting area where you're served chips and salsa while you wait (if there is a wait). I thought that was neat. Will definately be back!"], ["Megan D.", "Friends of ours suggested Chile Verde months ago, but we just got around to checking it out. So glad we did! Our server was very nice, though a bit hard to understand a few times. The margaritas were fantastic and very fresh tasting. Husband had enchiladas estancia and enjoyed them, says it was flavorful and filling. I had the bbq fajita burrito and loved it (bbq and queso are two of my favorite things). Would have liked a bit more chicken, but the veggies were delicious, too. The pinto beans were some of the best I've ever had. Looking forward to to visiting again, hopefully sooner rather than later."], ["jax f.", "I really like this New Mexican food, fast service also. Good drinks. My mother who lives in California loved it."], ["Adam H.", "Holy Hot Sauce!I was recommended to this place by a colleague on a business trip. It was outstanding, muy bueno! I would recommend getting the sauce sampler and trying all the salsas, cheeses, and meats before you order. It was fun tasting them all too. I ordered the blue corn enchilada with the spicy ground beef and then another with the pulled beef. I loved them both but I would definitely get the pulled beef again! Its texture was better and didn't make you feel like you were eating mush. Washed down with a Corona and your dinning experience is complete! The decor and service was good so there is no reason to not get in a little fiesta!"], ["Catherine J.", "Yum! Looking for a place with lots of flavor, hold the heavy? Come to Chile Verde! It's not \"Mexican\" food... I'd venture to call it \"Bistro-esque in the New Mexico style.\" You can get the usual American-ized Mexican fare, burritos, tacos, fajitas, but it will be a flavor powerhouse and not smothered in grease and oil. However, I ordered from the \"Chef Specials\" section of the menu, and I will probably make my choices here again. I got \"The Santa Fe\": a cumin festival with chicken (or shrimp, or both if you choose), black beans, and corn served on a bed of rice, accented with some fresh chopped tomatoes. Overall, this is something I feel like I could make at home, but in a good way. I can't wait to try to make it at home! It's inspiring like that. Next time I want to try the crabcake.This place has been here for a long time-- a testament to the quality of the food and its following, I think. On the other hand, I think this joint could update the decor a little bit. It's not bad at all, I just think the quality of the food is such that the business owners could benefit from giving it a more modern, bistro flare. I'd hate for anyone to mistake this place as just another Mexican joint (which, it's not... it is decidedly 'north of the border' and doing a great job!). Oh, the service is spectacular, too. The waiter used my table mate's first name when returning the bill, it's a nice touch.Everything feels like higher-end dining except for the casual decor and the flatware."], ["Jeff M.", "Things that were great:- The house salsa- The portion sizes (ok, maybe TOO large)- The prices/valueThings that were ok:- The veggie fajitas (good, but generic and oily, no corn tortillas, no guac)- The service (it seemed like a pretty basic friday night was chaos for the staff)- The location (I almost feel bad for them)Things that were bad:- The decor- The noiseSo overall, really solid for the area, but definitely *NOT* authentic mexican food. It fits the Ohio suburban clientele well, and I think it could be a 4 star place is they fixed up some of the awful look/sound of the place."], ["Cheri Y.", "I think the margaritas here are good.  But the food is a whole other story.  The waitress told me that the chef cooks the beef twice.  And it taste just like it has been cooked twice!!! She thought she was tellin me he was some great chef bc he does this?!  If I wanted leftovers I would just ask my hubby to cook lol"], ["Mark M.", "Outstanding Mexican cuisine!  I had lunch there yesterday, Steak fajitas, and there was enough left over for my lunch today.  Excellent food, reasonably priced, tons of ambience - note the portraits of Mexican Masked Wrestlers while you are there.  Charming place!"], ["Ariel B.", "Alas, it breaks my heart to see other yelpers calling this authentic Mexican food. Please god, if you want authentic Mexican drive the extra mile down bethel to Los Gauchos where you will find the epitome of authenticity as far as Columbus has it to offer. The reviews made more sense to me when I realized that few of the authors proclaimed a love of anything other than a taco or burrito-- key lay person terminology for \"I think I know Mexican food\". Try a \"gringa\" or a \"torta\" and then describe to me in detail the deep spiritual feeling you unmask when a good el pastor melts in your mouth and I will praise your good taste. Take your less adventurous friends here when they want to pretend to be eclectic in their gastronomics.Enough of my rantings, this place is decent and they do not necessarily market themselves as being a mom and pop mexican place. They have found their niche in the community and definitely know their target audience which I can respect. They also have very friendly staff which are usually local students who bond well with their clientele."], ["Myra E.", "We love this place. The chips and salsa are so good and fresh. Make sure to go here when they have fresh green chilies. So good!"], ["Andrea B.", "I consider this place a stand out in Columbus. I'm not going to worry about classifying the cuisine like some other yelp reviews do here. Who cares! It is just plain good. Margaritas are delicious with just the right balance of booze mixed with tart lime and sugar. Good to find in a day and age when everyone wants to use the bottled mix of green sugar water just to save time. They do a nice job with salsas and sauces overall. I recommend telling them if it is your first time there and they will bring you a sample of sauces to try before you decide on what you want. This place is tucked away in a strip mall, so don't think you are getting anything fancy by way of ambiance. Still it would qualify as pretty average in my book."], ["Diane N.", "We dined at Chile Verde last night for the third time. We first enjoyed dinner here in September with a few friends and were blown away by the delicious food. We had to go back. Chile Verde's salsa recipe is AWESOME and the fajitas are delicious. My husband and I always split the fajitas (they are plenty for two people). We haven't enjoyed the margaritas yet but plan to one of these times. I highly recommend Chile Verde to anyone who is a fan of traditional Mexican or New Mexican cuisine."], ["Kate D.", "Always consistently good.  Splurge on the RepoSado tequila Margaritas, excellent.  Crab cakes were ok, but the BBQ grilled steak burrito was yummy.  Kids enjoyed their meal, and service was friendly.  I even saw a server chase down a customer, stopping traffic to take them the leftovers they'd forgotten at their table."], ["Rae W.", "Food was very fresh and tasted great !! Server was prompt and pleasant. It's worth your time to go if you like Mexican!!!!"], ["Eddie Y.", "I'm hesitant to give 5-stars. I'm nearly there.. nearly.Having been there twice, having two good experiences, with two different dishes, I must say this is my favorite Tex-Mex place. And I'm not really a fan of this cuisine.The Chimichanga Carne was my first dish there. That mushroom merlot sauce really is something different. It brings a touch of lightness and some interesting cross-culinary flavor. Round two, on another day, way the Ground Beef & Bean Burrito. Tasty indeed.A great place for Tex-Mex. What would tip me over to 5-stars would be the introduction to at least a few, more authentic Mexican dishes."], ["Tom P.", "It's a solid restaurant, however judging by the rest of the reviews I was expecting better. The fajitas were just average and same with the chili relleno that my wife ordered. The margaritas are fantastic, but the salsa is nothing amazing.It's a pretty overhyped mexican restaurant."], ["Customer R.", "At first visit, I had no idea what to order so the server offered to bring me out a tray of meats and sauces to try! How awesome is that?? Needless to say, the meal that I chose was absolutely yummy!Only down-side is that they don't have a full bar. Up-side is, they offer a great selection of margaritas made with different liquors. I wish I could remember what I got (visit was a month ago) but the pitcher was good to the last drop."]], "Exotic Latino Grill": [["S M.", "There are a lot of hit-or-miss dishes on their menu. But if you get the right ones, you're going to be impressed. I absolutely love their empanadas, which come in a fried dough that has just the right touch of crispiness and sweetness. I highly recommend any beef dish as well, as the beef they're using is extremely tender and has a great slightly-sweet marinade.For some reason, they thought it made sense to grill my quesadilla with the lettuce and the tomatoes already on the inside. Why would you do this? It was positively disgusting. My quesadilla could have been good, but all I could taste was this warm, floppy, greasy, stringy lettuce shitting up the entire thing. Get the Baleada instead. It is almost the same thing, with delicious and flavorful beans instead of the nasty \"cold\" ingredients. It also comes cheaper. In fact, you'd be remiss to miss out on it if you ordered from here. It is simultaneously one of the most delicious, filling, and cheap items on the menu. The tortilla is thick, floury, buttery, and slightly browned, and the baleada comes packed with gooey cheese and plenty of the aforementioned tender beef.I have to strongly advise against the tamales; instead of wrapping the tamale in a corn husk, it is coated and fried in a greasy corn slurry resembling polenta or grits. The corn coating completely overwhelms the flavor of the tamale, and it's so greasy and unseasoned that it hardly tastes like anything. The inside wasn't any better though - the chicken was dry, and its marinade's taste resembled Campbell's soup.The plain arepa was just okay, but for the most part it didn't taste like anything, it lacked salt, and it wasn't worth what I paid for it. It's just a boring little grilled piece of corn patty, so be sure to splurge for the cheese and chorizo if you expect to get anything good out of it. To end on a positive note, there's the fried banana/plantain dishes. Fucking phenomenal. I got a special mixed up with soft chicken, flavorful and crispy sausage slices, and decent Spanish rice. The sweetness of the plantains works surprisingly well with the mix of meat, rice, and veggies, and the thing adds up to at least a pound of Latino spice goodness.I've definitely eaten from better taco trucks, but El Manantial can provide a great meal, especially for the experienced customer. I'd suggest staying away from the common crowd-pleasers and getting a sampling of the South American cuisine that they have to offer. They've figured out the latter, but the former is just cringe-worthy."], ["Alex D.", "I went there at 2:30 on a Friday and ordered a steak burrito. I had heard great things about this place. After getting my burrito I start eating it. Every single peice was fat. So much so that I had. Pile of steak before I was done with it. The hot sauce was good. But the burrito was so bad I threw it away. and I'm not one to normally waste food."], ["Adrienne C.", "Our friend insisted that the 4 of us try this place saturday night.  We were very skeptical because it's a food truck in a part of town that we don't usually venture to, and drive-through taco bell on the way home seemed much easier...but thank goodness for being open to new experiences. It was AWESOME.We ordered the chicken baleadas (1 $3 order comes with 2) and they were super toasty and super tasty! Granted we had to wait 15 minutes while they cooked our food, but there were only 2 women working in the truck and it was 4:30AM....the women were very good-natured and friendly, even at that hour! I can't wait to go back for a sober lunch or dinner one of these days and try the steak baleadas!"], ["Jack E.", "Great food great price. All taco flavors are rarely available - but they are all delicious. Paella rocks the block party.EDIT - I changed the review from 5 to 3 start on 2014.11.04.I think they got new owners or something. Faces are familiar, but menu and food have changed.New Arepas suck. They were freshly made before. Now it's some kind of deep fried hot pocket thing. Tacos are much smaller and look rather apathetically made. Such a bummer. I can't see going back."], ["Keith D.", "I eat here often. Well, I did eat here often. I ordered 15 dollars with of food, got a 5 back, so I took a one from the wallet and tipped them. Another guy and a couple ordered after me.Typical stand around, wait, while they cook to order. Then she comes up and says \"burrito\" and the guy who ordered after me sheepishly steps up, turns to us, and says \"you didn't order burritos did you?\" and I said no. Not that it is a strike, but come on. First come, first serve. It made everyone look around like what is up?So I finally get my order and I say \"can I have more of the red sauce than green\" Why? Because I was there not 2 days earlier and it was awesome. Truly hot. That woman had the nerve to open the box, look at what was in there, and say \"you have enough.\"YOU HAVE ENOUGH. Yep. That was actually said to a paying customer who tipped preemptively, got shafted on service, and requested more salsa. I would have paid for it! Or, given back the green ones which I don't care for. Guess what? It was not enough. It is 3 little red salsas for an arepa, empanada, 2 tamales, 3 tacos? The green ones went unused.The food is still good, but I will be hard pressed to be back with that type of response and attitude. I hope someone tries to orders a lot of food and is willing to pay for it and she tells them they have enough. Unacceptable."], ["Mark M.", "This place might look a little sketchy, but don't let the looks fool ya! This place is really good! Best burrito I've ever had!! Good prices too!"], ["Lisa D.", "Went there last night around 8:30 with 5 friends - everyone ordered something different and everyone was happy with service and food. Wait was not that long, but only one group was in front of us. I ordered arepas and empanadas. The pineapple and cheese arepa was delicious!  I give them a 4-star instead of 5 only because one of the sauces they gave us was still frozen. This is a food truck - and for a food truck it is excellent and offers a unique menu I haven't found elsewhere."], ["Luke H.", "Fantastic, and incredibly affordable. You may wait for a bit, but it's most definitely worth it. I walk over a half-mile relatively often to enjoy this treat, and the 14-0 beer shop next to it always has amazing deals as well. Can't stress this enough; this place is worth a special trip."], ["Michael U.", "I stumbled upon this truck about 6 months ago and got both the burrito and quesadilla.   They were so delicious I needed to go back.  Unfortunately I forgot where it was.  Until last week.  I found it again and, of course, went back.  They have a very dedicated clientele.  The food was as great as the last time."], ["Justin E.", "Amazing! Driven past it everyday on my way to work and finally tried it. The burritos are unreal, I also tried the Perros Columbianos based on yelp reviews and it was unbelievable. Can't wait to go back and try some other stuff on the menu. One thing you can expect is, that they're menu is based on what they have available so sometimes they might not have menu items but thats a minor problem because I'm confident everything on the menu is good. A Columbus must try."], ["Brian D.", "I wanted to like El Manantial I really seriously did, I love food trucks but I just wasn't impressed with my food when I ordered. That being said,  a taco truck that is open 24 hours a day, in a neighborhood that you can go to with out fear of being attacked is always a good thing. I will give them props for using fresh ingreidiants. When i ordered that Baleadas the lady working behind the counter gave me two huge ones and for the price that can't be beat. Also she hand rolled the  tortilla right there and fried it on the griddle in front of me. the Tortilla was the best part. The steak tasted a bit off, to much grease or a strange seasoning. I'll be giving you another shot, soon I believe. Also its worth noting that this truck is currently located near the intersection of Hudson and Indianola at the 14-0 Carryout. Just look for the UDF you'll be in the right place."], ["Joshua R.", "Place is awesome, open till 2am. Got the baleada w/chicken.  Would recommend to all"], ["Mindy W.", "I was so excited to try this cart, particularly when I saw their diverse menu options. Alas! No empanadas, no chicharrones. Why!? I was very disappointed, as the thought of a chicharron taco was making me salivate. Their only options were tacos, quesadillas and tortas. Meat options were steak, chicken and al pastor. This was very disconcerting as they had a very large menu that included far more than these paltry options. I opted for an al pastor taco, al pastor quesadilla and chicken taco. I was literally shocked when he told me I owed him $18.00 for three items from a taco cart in the parking lot of a convenience store. My jaw may have hit the floor. I handed over my cash as I though \"I only ordered three items, right? Did I order more than three items? These better be the best *$**@*@#&*@ tacos and quesadilla I have ever had.\" They were not the best. They were not even good.The taco base price was $1.50. That means I spent $3.00 on tacos. Was the quesadilla $15.00, or were the toppings they gave me worth $9.00? You see, I made the mistake of saying yes when he asked me if I wanted everything on my tacos. These tacos were fit for any gringo who's never had a real taco. They were piled with cheese, lettuce, tomato, sour cream and onions. What happened to onion and cilantro with a slice of lime? This math really isn't adding up, and 24 hours later it is still confusing and offending me.The meats were greasy, gristly and flavorless. The quesadilla was so soggy with grease it was inedible. The tacos I can't really judge because all I tasted was the plethora of toppings.The 14 year old who was handling the window was rude and not at all helpful. I asked when they have empanadas and chicharrones and his answer was \"sometimes\" Seriously? \"sometimes\"? He came back to me a few minutes later and inaudibly said  something about some Wednesdays when so and so mystery woman brings the something or another (i.e. authentic food, I hope?).I will come back here on a Wednesday with hopes of trying their empanadas and chicharrones, but I can't say that I have high hopes. The food cart scene in Columbus is thriving, and there are just too many good places with good service to waste time and money going somewhere that doesn't impress."], ["Danny F.", "Some of my favorite Latin/Mexican food in town. Great for a drunk bite to eat after the bars."], ["Luke T.", "Went here today on my way home from work. No fish tacos! What is up with all these trucks not having fish tacos? I tell you what, the freakin trucks in Tampa and LA have fish tacos. El Manantial Latino even serves fish! Break apart some of that damned fried fish and put it in a flippin' taco shell for me, already!!!Okay, so end disgruntled, lack-of-fish-tacos-rant.  Aside from that, there are only a couple of vegetarian options, and the menu as a whole is somewhat limited. Five types of meat for tacos, a few specialty dishes, etc.  I ordered the Hawaiian empenada (cheese and pineapple), and an arepa con queso.  I ended up with a cheese empenada. Both were delicious, but neither was served with any sort of sauce, as pictured. The arepa specifically would have benefited from some avocado, jam or something.  Still, it was quite tasty and quick. I will probably return eventually."], ["Samir N.", "This place is definitely worth a visit.  The empanadas are unlike what I am used to and that is A-OK with me.  They were fried but not terribly greasy.  The location is in a rough neighborhood, but I do not remember feeling unsafe.  If the girl can man the stand by herself all night, I am sure I can be man enough to order from her.  I wish I were hungrier so I could try more things."], ["Lauren S.", "We've been there twice now, both times got the cheese arepas with rice, beans, and salad on top; the cheese-and-pineapple empanadas; and plantains. All was delicious, fried without being too heavy, and with fresh toppings and salsa! We also added the shrimp tacos this time, which were yummy as could be - a good grill flavor. There's not much tastiness in our direct neighborhood, so we're thankful for this truck! It smells wonderful just walking up to it, too."], ["Matt W.", "This is one of Columbus's finest taco truck. Street food at its best. Very clean \"kitchen\"  nothing fancy on the outside."], ["Mander I.", "Love, love, love the chicken tacos and arepas from this Columbian taco stand! Cooked fresh for you! The only danger is you get a hankering for some melty cheesy arepa- you fight your way through the scarlet and gray minions only to discover the truck missing! Weep. But it it makes it all the more serendipitous when you return and the little yellow truck is there shining like a little Columbian ray of sunlight, taco scented sunlight."], ["Ravi R.", "Simply amazing. The staff is friendly, the food is fantastic, and the prices are a steal ($2 for an empanada that's half a meal)! Whatever reservations you may have about a food truck parked in front of a gas station, get over it and try this place out for yourself."]], "Bakersfield Short North": [["Kevin W.", "I enjoyed the vibe... We didn't eat, but the wait staff was attentive and the drinks were good. My friends and I will be back!"], ["Beth M.", "Went for the first time tonight.  Food and service were both amazing and the mole tacos were the best I've ever had! The guacamole was delish and had something special about it.  Can't wait to go again!"], ["Kelly L.", "Probably the best tacos in Columbus.  Love everything about this place.  Very friendly servers and great food.  The drinks can be a little pricey but other than that, everything was great."], ["Ed I.", "Great space. Good beer selection.  Loved the tacos. At $4 each inexpensive enough to try and all very very tasty."], ["Lukus T.", "I've been here several times and it is always a good time.  the food is good (try the cochinita), a boot of PBR is cheap, and the location is perfect for people watching in the short north.  this restaurant has been highly reviewed, and rightfully so.  let me just point out some of the small things that keep me from rating it five stars.first of all, and most importantly to me, is the value for the dollar is pretty depressing.  the tacos are $4 each and really quite small... two or three bites a peace.  the salads are a decent portion, and they even took the liberty of splitting one for me and my buddy.  so that was nice.  the teleras also are a decent size.  the house margaritas are nice and fresh but again your dollar won't get you far here.  I always just stick with my PBR (literally served in a boot).we ordered the grilled short rib taco (their version of the asada) and it was more fat that meat, but they were more than happy to swap it out quickly for another taco.  the manager stepped right in and talked to us as well, and the whole situation was dealt with very nicely.  this may have been a fluke but I'll stay away from that particular item in the future.also chips and salsa isn't complimentary which I find somewhat annoying.... all that aside though, this really is a great addition to the neighborhood and highly recommended to visitors and townies alike.  four stars."], ["Gus W.", "I guess I'm a little late to the Bakersfield train, but that's because every time I've gone there I've been quoted anywhere from a 2-3 hour wait. Is it worth that wait? No. Is any restaurant worth that wait? Hell no. Maybe if I was one to plan ahead of time and head over there around 6 to put my name in and come back around 9, it would be fine, but I'm not. Luckily, after getting my eyes checked on Saturday, I decided to try my luck, and to my surprise, the girlfriend and I didn't wait at all. It was around noon, and the place was starting to get packed pretty quick after we sat down. You really do need to go on and off night or get there early for lunch (or maybe late for lunch).I wish this wasn't the case though, because we had a pretty great meal. Their chips are fantastic and so is the guacamole. Some of the best I've had, and I eat Mexican.. too much.I had the braised pork, pastor, and short rib tacos and enjoyed all three of them. The smokey red sauce on the table was pretty tasty, but the tacos really didn't need them in my opinion. I'd say the braised pork (Cochinita Pibil) was my favorite, but the other two were cooked about as perfect as they could be. I do wish they doubles up on the taco shells, because they did start to rip as the one got soggy, but that was my only complaint.They have some decent beers on tap, nothing extraordinary. My girlfriend tried the Rose Sangria and liked it (I wasn't a fan), but she said there was no way she'd be able to have more than one. It shouted heartburn waiting to happen.Our server was very nice and went over everything on the menu with us. Even though the place started to get pretty busy, we never felt rush or neglected in any way.Overall, I had a great experience here and will definitely be back, but it definitely won't be on a Friday or Saturday night."], ["Liz M.", "It has been a VERY long time since I've take a bite of food and had the compulsion to spit it out. Thanks for that, Bakersfield. We went on a Sunday. It was busy and loud. Service was fine, although I didn't really appreciate her obvious upsells. Chips and salsa we REALLY good. I go and order just that. They serve a green salsa that's just the right heat and a little salty. Chips were super fresh. Yum! Don't even bother paying extra fro guac or queso. The tacos were just not good. I had the corn, chile pork, and shortrib. First, I did not know corn truffles was basically corn mold. So, that was a shock as I was imagining yummy fried corn fritter bonbons. Regardless it was a total grease bomb along with my other two tacos. The chile pork was so greasy it dripped down my face and hands staining them orange, like a child whose parent didn't supervise them with their kool-aide glass. Just really disappointing and expensive and needless to say, my intestines did not thank me.  Also, I noticed a framed photo by the front window of a gas station style sign with the lettering you can slide in basically saying the Short North has made it because we have a Bakersfield. Well, I strongly disagree and thinks it is a weird thing to create for a wall hanging. I wish I'd gone to El Camino Inn and I will not speak of Bakersfield again."], ["Casey W.", "I really enjoyed Bakersfield! A friend and I stopped in one afternoon for some drinks and tacos. We split the guac and chips and boy is their guacamole good! I could eat it for days. Their margartias...wow. Honestly phenomenal. I could drink them until the cows come home.I got three tacos. The short rib taco was so great! I would get it over and over. The pollo rojo was great as well. I wasn't a fan of the fish taco. The fish was cooked nicely, but the slaw on top of it was overpowering, messy, and abundant (probably to cover up the lack of fish).I will be coming back though, I'm excited to try more."], ["Megan V.", "5 Simple Rules for Eating at Bakersfield:1) Start scouting for parking before you leave your residence. As with most locations in this area, parking can be tricky in the Short North.2) Go on an odd day of the week at an odd time. Primetime on the weekend can be difficult to find a table. You may have a 2+ hour wait. Been there, done that. Not entirely worth it. Fear not! Go on a Sunday at 8 p.m. We went and had many seating options, but decided to hang at the bar. Quicker to get your margarita! 3) Since you may be sitting at the bar, you are required to order a margarita. Margaritas are served in a mason jar, which is always a cute touch. They are fairly strong so one may be enough. They are pretty yummy so you may order a few.4) Once you've had a few margaritas, you probably should eat something. So what should you eat? Order some chips. Yes, I said order. Chips and salsa are going to cost you $3, but they are well-worth your bucks. You get two varieties of salsa - one is green and mild, the other is red and smoky. And, those chips are pretty darn tasty too! They give you more than enough for sharing between two people.5) Finally, when you start to get serious, you'll want some more substantial food. Get the tacos. They have a nice selection of choices. In my opinion, the fish taco is the best. But, honestly, I can't complain about any of the tacos. Good stuff!"], ["Mark B.", "I visited Columbus from Portland, Oregon this month, and decided to meet up with old friends over some (upscale) tacos.  I had arranged, with the manager, Mischa, to hold a table for 15 people.  Upon arrival, she greeted me with a warm smile and advised our table would be ready shortly.  She was very professional and attentive to my needs throughout the entire process, corresponding in a timely manner via email with an immediate response.  The food was a pleasant surprise, as I live in a foodie's paradise in Oregon.  I tried the following:Fish Taco - super solidPastor - One of the best I've ever hadCochinita Pibil - UH-mazingRajas - Spot onQueso (add chorizo) - a notch above goodThe only thing I hesitated upon giving 5 stars, was the fact that they were blaring country music at ear piercing decibels.  The only thing I hate more than country music is said music at ear piercing decibels.  I, however, realize that some people like that sort of thing, and the place was super crowded, so it's not fair to ding over something that is my personal taste."], ["Jen K.", "Busy busy, younger crowd.  Trendy spot in the short north.  The regular marg was very good.  I have been here once before for tacos and they were very good, better than Condado and almost as good as Nada-the in between spot!Definitely a fan!"], ["Ashley H.", "I've been to two different Bakersfield's, Columbus OH and Charlotte NC. They seem to prefer stand out locations on happening street corners. The Columbus location is in Short North, and it seems to fit in well! I always love how they keep the windows (almost garage doors) open so that you get more of a patio feel.The ambiance of Bakersfield is really neat. Everything is Western with a cool modern twist, from the menu to the music to the old B&W movies playing on the TVs. Now what's really important, THE FOOD. Hands down favorite tex-mex food I've ever eaten. Please come here hungry. Try everything. From the chips and salsa (the verde is my favorite), to the Johnny salad (the apple cider vin is to die for), to all of the various tacos they offer. They make the tortillas in house, and it's one of those places where it really makes a difference. The tacos are rather small though, and a la cart, I normally eat about 2-3. Oh! And make sure you try the margaritas, salt on the rim and an extra lime."], ["Shruti S.", "So many reviewers spoke about the Cochinita Pilbil tacos, which I could honestly care less about, but thank god for the person that mentioned the one with the pork belly...that one was utterly delicious! Also, thank god we picked up the spicy margarita- I ordered a pitcher for the two of us. And while I would not recommend that as a Monday night dinner choice, I would not second guess it for our dinner! Guac was more lemony and more chunky than I do it. But it kept us going with that pitcher.The server who helped out was utterly sweet, and I feel terrible for not remembering her name."], ["Jen R.", "I've been in here a couple of times. The guac and queso are so amazing that I have only tried one taco :) It was pretty good. Only 3 stars because of the service I've received. Not very attentive at all and I've never gone in at a busy time. Just found Condado a few blocks north, so will probably go there from now on."], ["Mandi S.", "I am a fan of Bakersfield! We arrived around 1 on a Saturday & had about a 5 minute wait. Not bad, but odd for the places I frequent for lunch. We were seated and our server came up immediately. I knew I wanted a margarita, my fella wasn't so sure (he is an IPA man through and through). However, our server was very helpful and found him a good beer. We ordered the chips with queso and black beans. It is not your run of the mill creamy queso, but it is SO good.  We also got 4 tacos to share, Mole, Pastor, Fish & Short Rib. Our favorites were the Fish & Mole. The bar is very cool looking, wood everywhere, which I love! The lighting is nice and they have windows that open 100%, however it was a hot day so they were closed. I will go back to Bakersfield, but perhaps always for lunch.  I am not a fan of large crowds and long waits."], ["Andrew W.", "Open, fun and friendly.I was Bakersfield this past Friday and stationed myself at a table with a close friend for at least an hour and a half and had a great time! A couple of yummy margaritas, bottomless chips, black beans and salsa verde -- where could we go wrong!? Not to mention the delicious papas I had (kinda like a taco salad). It really made for the perfect lunch.Not to mention our server...she was absolutely phenomenal. She seemed swamped with tables, but my drink never reached the bottom before I had another waiting on the table and our chips were always bountiful. The one consensus on Bakersfield it seems though is to just pass on the tacos. We were at a communal table and, true to what others have noted, the tacos are pretty tiny.I say, go for the margs, try something other than the tacos and enjoy!"], ["Colleen R.", "I really enjoyed my experience at Bakersfield! I met a few friends here after work on a Wednesday evening around 5 PM. When we walked in, there were only three other people sitting at the bar. By the time we left around 6:15, it was packed. If possible, come around 5 or 5:30 for no wait! Now, the important part of the review - the food. Mexican food is my absolute favorite, and I want to kick myself for not trying Bakersfield sooner. I started with a margarita. It was really fresh - no sweet and sour mix here. We shared the chips with guacamole and the cheese dip with chorizo. The guacamole is very chunky, so beware if you prefer a smoother guac. I loved all the huge chunks of avocado and the acidity from the lime. It pairs really well with the salty tortilla chips. My bf loved the cheese dip with chorizo. The chorizo was a little sweeter than I like, but the cheese dip itself was delicious and creamy. It's not the artificial, smooth white cheese that you would get at other Mexican restaurants. The cheese dip had some texture which I actually really liked. I ordered three tacos - the al pastor, short rib and mole. All of the tacos tasted great. It is obvious that they use really fresh ingredients. My favorite was the mole. I would like to try a few other tacos when I go back.I would highly recommend Bakersfield! I'm looking forward to going back and working my way through the menu."], ["Lauren B.", "I have always enjoyed Bakersfield.  Appetizers and tacos have been great.  They changed their Pastor taco and the meat is pretty chewy now.  I wrote to them and never heard back.  We had to throw our tacos out because they were so fatty.  A group of us ordered tacos from there last week and the same thing happened...the short rib was so fatty I ate half of my order.  This used to be my go-to place but I'm not sure what happened."], ["Brittany S.", "Update! I spoke with Mischa, she is the GM and was very nice! We spoke about what happened and she was very apologetic. I plan on going back to give it a try (without coming in contact with the one bartender if she is still there..) Will give new update after visiting again. First time ever going was tonight.. I was the dd for my boyfriend and a few of his friends - we decided to check this place out and I wouldn't give one star if possible! The bartenders were rude. I understand they're busy, I use to be a bartender myself. But when I ask for our tab to be closed and the bartender responded with \"I\"ll get to it\" in a very rude tone. I asked again shortly after and she said \"k\" then went and made drinks for a group of people and called me a \"twat\" (who uses that word? Anyways...).. 20 min later was able to close out and leave. WONT be returning. And someone needs to tell that bartender to change her attitude! Tall girl with short blonde hair.. If I treated my customers like that at my job I wouldn't have a job."], ["Hua R.", "The tacos are amazing!! I've run the full gamut and tried every taco on the menu -- favs are Short Rib & Cochinita Pibil. The only thing better than the tacos would be the music playing -- Willie, Waylon, Merle, Johnny Cash, and some CCR. Great joint to have a few drinks, eat a couple tacos, and just hang listening to some good tunes.What's preventing the 5th star you may ask..? Well the $50 pitcher of margaritas; plus the chips & salsa/queso - you've got to order chips, the salsa comes in a squeeze bottle, queso is more like bean dip."], ["Justin B.", "Let's talk about what it is you want, reader. Want delicious margs? Go to Bakersfield and you won't be disappointed. Want to drink those on a patio? Go to Bakersfield and look good chilling on a nice patio. Want delicious tacos? Go to Bakersfield and you'll feel pretty good about your pick. Not great. Pretty good though."], ["Chris S.", "This was a really strong visit with my daughter.  The food was just the perfect size for a lite dinner.  We have the cheese dip and it rocked as well as the tacos we had.  No complaints, the wait staff was strong and informative. Another great spot in downtown Columbus."], ["Jack M.", "Shit experience. We were approached and ID'd twice. Two different bartenders who clearly felt the need to inconvenience guests. Unprofessional and disappointing."], ["Erica R.", "How have I not already given this place a review?  My friends and I are OBSESSED with Bakersfield!  The tacos are SO good and they have the best guac in town!  You can't go wrong with a margarita or a sangria and I love the classic country theme.  We have had lots of fun nights here and always had great service!  Plus it is right on the C-Bus line!"], ["Katherine M.", "When you secretly love Mexican food but you're too pretty to admit it.... Come to Bakersfield! This is the place for you - drinks are light so don't worry about having too much fun, and you'll likely lose a few pounds from standing around waiting for a seat and emptying all of your cash out of your pockets into their register. The tacos are actually awesome - 2 whole bites of awesomeness. Actually about one and a half because you'll lose the residual as the corn tortilla crumbles in your hand. It is nice that they leave squirt bottles of salsa on the tables to use at your unrefrigerated convenience. I think the queso is baked, which sounds potentially awesome but it's lumpy and sticks to the bowl everytime. In all honesty, I do love the skinny margarita because it's straight tequila and lime juice so you know you're getting actually what you pay for and I prefer my drinks more strong/sour than sweet. Though the service has been mediocre at best, usually messing up at least one item on the bill, I guess it's succeeding as one of the newer short north hot spots. And although cynical, I think Bakersfield will continue to improve in service and quality when the hype starts to die a little bit. At least I hope it does because living just a block away I would come here all the time if they could handle the crowds better and keep their prices under control. And maybe put chairs out on their patio? Just a thought..."], ["Michael M.", "Deliciousness! Everything from the tacos, the Johnny salad, spicy margarita and the fresh GUAC was perfect. The waitress and manager were also fantastic. Oh yeah, it was spacious and you don't feel rushed."], ["Jillian M.", "I came here with a group of about 7 or so people on a weekday after work. Cool atmosphere, and I'm a sucker for a place with those industrial roll-up windows that make you feel like you're eating on a patio (but inside!). Magnificent 7 was playing on the television, Johnny Cash was playing on the speakers, and Wild Irish Rose was the shot of the day; definitely consistent with the message they are trying to convey. Our server was very attentive, and everyone got exactly what they ordered. I had the short rib taco and the pastor taco, and we all shared some chips and salsa. I'm assuming the salsa was a salsa verde, as it was green with a lot of cilantro. I typically prefer the traditional tomato salsa, but I'm pro cilantro and it had a great flavor. Watch out though, because that heat will sneak up on you! Both of my tacos were delicious, and the short rib was tender and flavorful. I had a house margarita, which was strong and tasty, and not syrupy sweet.Overall, I would say that this place is worth checking out. I think that the prices are reasonable ($3-4 for a taco) but you might end up spending a bit more than you expect if you want to walk away full. El Camino has cheaper tacos, but less variety. There doesn't seem to be any discernible happy hour, so that was a bummer, but the prices are affordable enough that you could come here after work and spend less than $20 for a few drinks/tacos. Until it's been open for a decent amount of time, come here on a weekday and avoid the weekend madness."], ["Nicholas S.", "Staff, food and atmosphere is amazing. The staff is beyond friendly and are always willing to go above and beyond to make sure you are happy. The food is fantastic, with my favorites being the Johhny, the Chicken Chorizo tostadas an the hongos tacos."], ["Shea H.", "First, let me talk about the staff.  Very awesome group of people.  We happened to have an exchange with about five people and each one of them were really nice.  Our waitress, Rachael, was wonderful.  Very cool and fun to talk to.  Now the food... eh.  Tacos were crazy small.  I really couldn't believe it.  I was initially impressed that the tortillas were made in house, but now I know why--- you can't find tortillas that small any where else.  And they ripped apart when I attempted to bite my tacos.  This, boys and girls, is why many establishments will give you two tortillas when serving corn-tortilla-tacos.  Because they fall apart.  I mostly liked my vegetarian tacos... I think they were missing something... maybe some fresh pico de gallo or something.  Other than that, they were okay.I had the guacamole.  It was tasty.  A little overly chunky (and I usually love chunky guac) but good.  I also tried the queso... it was interesting.  Not bad.  Just different.  My honey got the short rib sammy and raved about it.  I can't lie- I tasted it, it was deeeelicious (sorry to my beloved cows).My margarita was delightful.  It reminded me of lemonade... very very good.Overall, with a little expansion in the taco-size and taco-options arena (maybe some more veggie options-- the current options are a little boring), I think this place could be awesome.  Just needs a little work."], ["Rakesh M.", "This was my second visit. Again a heavenly treatment. Sorry I didn't get the hostess name, but she took care of us very well. The first drink was on the house(since I wrote a good review last time) but the review is not clouded but it. We ordered the same papas and rajas for food. Again no comments on the food. Very delicious!!! This time we had a craft cocktail which in my opinion was very good. I like my cocktail which has more of a liquor taste than sugary flavor. The bartender made sure of it I guess. Thank you again for this wonderful experience!!!"], ["Abby L.", "I've been here three times already and would definitely keep coming back. The tacos are decently priced and service is always fantastic. I've had all the tacos before, but my favorite one is the short ribs taco. The flavor is good and it's perfectly juicy. Each taco is $4, a good sized portion would be 2-3 tacos per person. The pastor was good but nothing special. The fish is good as well, but not the best I've had either. The guac and chips are phenomenal. They're guac is one of the best I've had. I've also had their queso before, it's good, but the guac is definitely better. The queso texture gets a little odd after it cools down a little bit. Their margaritas are fantastic as well and come in little mason jars"], ["Mark H.", "On a scale of 5 from best to worst, this is how I rank the items at Bakersfield:Margaritas, Chips, Service, Tacos, Parking.Really, the margaritas are a slam but watch your drinking because they are typically strong!  The chips with anything are also really tasty.  Service is typical but nothing to write home about.  Tacos here are subpar for the price and the fact you can get so many better street tacos anywhere else (Los Guacho's anyone?).  Add in the poor parking situation near Goodale Park and it's only a good place to go when there's not an hour wait.Tip: It's not worth the wait but it is good...more like a 3.5."], ["Sara C.", "I'm not a huge fan of Mexican food generally (and my benchmark is a fantastically sketchy hole-in-the-wall place just outside LA county called Molca Salsa), but I saw Luke's rave review of Bakersfield and figured, \"Well, it's just down the street, might as well give it a try.\"  So Lea P. and I met up last Gallery Hop to check it out.It was already pretty crowded when we arrived around 5 PM, but we were fortunate enough to be seated almost immediately, near the windows at one of the whiskey barrel tables.  Now, about these tables.  They look really cool.  I just don't understand how one sits comfortably at them.  I ended up sort of sidesaddling the barstool in order to feel like I was close enough to the table.  And where do you hang your coat?  Your purse?  I suppose I could have sat on my coat and held my purse in my lap instead of just shoving them between the table and the window.We started off with an order of the chips and guacamole, and that was pretty much the highlight of the experience.  The guacamole was fresh and chunky, and the chips were still warm.  I was looking forward to trying the ginger beer, but that was no longer available when we asked.  I'm not sure if we were giving off a \"don't bother us, we're eating guacamole\" vibe, but it took a while to flag down a waitress to place our food order.  I ordered the corn chowder and one of the short rib tacos.  I wasn't terribly impressed by either; the flavor of the corn chowder was fine (not too spicy), but it was only moderately warm in temperature.  I think I had Kogi expectations of the short rib taco, and though it was fresh and nicely presented, I wouldn't be in a hurry to order it again.I'm sure the place will do well in the Short North, as it's got that hipster trendy drinky drink vibe, but this is not really my scene.  It's quite funny to me that the place has Bakersfield in its name, as I have driven through the town far too many times on my drives from Central to Southern California, and between the sprawling factory fields and the dairy farms you can smell from miles away, it's about the least hipster and trendy sort of town there is.  Probably more of a 2.5 stars for me, but the guacamole is really good.Update: A couple of different folks from Bakersfield reached out to me via Yelp to address some of the concerns I mentioned in my review.  They did a great job of communicating in a professional manner, and that counts for a lot in my book!  It's still not my scene, but I'll definitely be considering a second visit sometime in the future."], ["Tabytha A.", "Food was pretty good, chips and salsa were a little pricey, since they are free most places. I had a pollo roja taco, and it was very good. Salsa and condiments were good, the music is theme-appropriate, but a little loud for conversation. Overall a pretty solid restaurant. It was rainy when I went, but the patio is always packed when I've walked by on nice evenings. Might be a good later-evening spot. Pretty good beer selection, too!"], ["Kyle L.", "Easily my favorite place in Columbus to get tacos. Everything from scratch, amazing fire roasted salsa, and a perfect house margarita. One of my favorites are the fish tacos with the citrus slaw. So delicious, light, and filling. They also have some of the best salsa I've ever had. They fire roast everything according to one of the servers. I generally order some with my meal and then some to go. I snack on it throughout the week. Great price points. I often go here for dinner before going out. I have never had a bad meal. Always packed on the weekends so I've been going here for lunch more often. Parking garage on High and Hubbard but there is also street parking if you can find it. I highly recommend anyone who appreciates well made simple Mexican food to check out their tacos. Again, fantastic salsas both red and green. Just one of my overall favorite places to eat."], ["Monica B.", "The food was decent but the service was unbelievably bad. It was difficult to get the waitresses attention and she was trying to push us out by giving us our check before asking us if we were done! The food does not make up for how terrible the wait staff was. We did not feel welcome in the restaurant. She even tried to take my friends seat for another table when she was in the bathroom!!"], ["Rose G.", "Bar is full of yuppies. Services is terrible. We got skipped at the bar twice for people who looked more \"upscale\" so I took my money elsewhere and I will not be returning."], ["Robert C.", "The food is surprisingly delicious. They only have one TV that constantly plays some old western movie, so don't expect to watch a game while you're there. Generally a great location and good quality food."], ["Gabe O.", "Friendly bartenders, great margs, and really legit food. Solid tunes and energetic feel to boot..."], ["Walt S.", "When the situation is FOOD vs SERVICE (and food is great) - go back for a second helping.  That's just what I did with Bakersfield Short North.  I'm so glad I did.     A buddy of mine met me there on a weeknight around 7:30PM.  Bakersfield Short North was busy busy but we got a table pronto.  We even met the restaurant's night manager, Alex, who is a cool cat from Cincinnati and loves the job he's in.     The menu played out perfectly.  Chips & queso with the add-ons of beans and jalapenos came out hot and tasted great as a run-up to a light, tasty taco dinner.  The individual size tacos (soft-shell and 6\" in size - nice!) were; Mole, Fish, Conchita Pibil, and Short Rib.   The variety was mouth-watering and each tasted great.  We had our fill of three each and still had some chips & queso left over.     Service was excellent.  Our server kept our non-alcohol drinks filled, didn't over stay visits but was always near enough to where we felt comfortable.  I had a great time and with tasty food edibles.... terrific.   And THE SEARCHERS was on the HDTV (in case you're a John Wayne fan which I am - fun fun fun).     So... GO to Bakersfield Short North.  I think if you like mexicali foods and a warm, inviting atmosphere then it's a no brainer."]], "The El Camino Inn": [], "Condado": [["Eliza D.", "I really like this spot. The food is awesome and the wait staff was super nice. I love that you can build your own tacos and that they offer hem street style. The menu doesn't reflect it but you can get soft corn, but be prepared that they do not double up on them California style, so your taco will fall apart. The only real downside besides fall apart tacos, is the noise level. I feel like a granny saying this but we literally couldn't hear anyone at our table when they spoke/shouted, It was that loud. So we all basically sat there in silence eating. No Bueno. Your guests want to talk about your food and what's new with their lives. For that reason we glance inside when wondering if we want to go in. If it looks like a slower time it's a yes. If it's madness, no."], ["Angie P.", "Not bad, not bad!This very much reminds me to Barrio in Cleveland but Barrio was sloppy and the tacos were pretty much impossible to eat.My server (I wish I could remember his name) was so friendly! He recommended their pineapple guac and I'm so glad he did. It was delicious. I opted to make two tacos by checking off what toppings I wanted and they turned out delicious. Their margaritas are also great.I'll be back!"], ["Claire D.", "Despite my 3 star rating, I visit Condado pretty regularly because it's within walking distance of my apartment and the atmosphere is pretty nice. Also the tacos are pretty substantial portion sizes, so I can get a meal for less than $5 typically. I usually go for happy hour, which is from 4pm to 7pm, so you can actually eat at a normal dinner time (rather than your typical super early happy hour) and still get a fairly good deal. Note: You have to sit at the tall bar tables to be eligible for happy hour prices. You can't sit at the restaurant tables.Condado is known for its tacos. There are pre-set options, but I usually build my own because they're the same price and you can get exactly what you want on your taco. Each table is given paper checklists and you go down the list and check off what kinds of tortilla/wrap/bowl, meats, cheeses, veggies, sauces, etc. you want.Last time I went to Condado, I got a flour tortilla with thai chili tofu, red cabbage, jicama slaw, tomatoes, queso fresco, and chipotle crema on it, along with a prickly pear (\"tuna\" cactus) margarita. The tofu was fried and was coated in a very sweet, yet spiced sauce. I've been pretty disappointed by Condado's carnitas, which has been pretty wet and flavorless, rather than the greasy pork-filled goodness you'd expect from your carnitas. The tofu had a good flavor, but it was definitely reminiscent of bastardized American Chinese food (think sweet and sour sauce). I also got homemade chips, queso blanco, and guacamole on the side. The homemade chips were fried in-house and salted to perfection. The queso and guac were pretty standard (nothing too special, nor bad enough to complain about).The atmosphere is lively, but I've never had to wait for a table. I almost always see other grad students in my OSU program when I go to Condado (I think because of the location?), so it seems to be a popular place with a lot of regulars. Expect Condado to be more restaurant-y than bar-y like some other Short North taco places Bakersfield. The Dia de Los Muertos street art on Condado's walls adds to the artsy/alternative feel and it reminds me of some of the murals when I used to live in the Mission district of San Francisco.TD;LR The tacos are fusion/alternative and not traditional Mexican."], ["Kristin C.", "This place had fun, affordable tacos of a decent size with cool combinations of ingredients.  I hear their happy hour is amazing, but everyone has discovered it so word is it is almost not worth it.  It can get a little loud in here since it has a huge warehouse feel to it."], ["Gwen W.", "Nothing to brag about. Unfortunately, not even worth TALKING about :( Too bad, too. Several things that were off, leading to the one star. But first, the positives. I do like the decor of this joint. I'm a big fan of wall art - especially graffiti. So yay for that. The long communal tables are always a hit for me. The more meeting new people, the better Timing and taste were the major low points for me. First off, it took the servers way too long to get orders. They wanted to spend too much time explaining the concept of this establishment, rather than just letting us figure it out, and answering questions if anyone gets confused. Almost 35 minutes? Really?What'd you order, Gwen? Chips and Salsa Verde to start. The chips weren't bad. Basically, fried slices of flour tortillas. The salsa, however, did not get the same respect. All I could taste was sweet sugar. No tomatillos flavor. No spices. Just green. I decided to make my own tacos, since that's what a majority of Yelp Reviews suggest. One House Made Chorizo. And a Chicken. I couldn't get over the chorizo's metallic taste. It was very pronounced. Not good at all. No sausage taste :( The toppings on that taco didn't help to hide the taste. The grilled chicken was ok, in comparison. Nothing spectacular, but I could taste a hint of the protein. The extremely mediocre taste did not leave a lasting impression."], ["Michelle B.", "Hands down, my favorite taco joint in Columbus. The service was pretty mediocre at first, but I think our bartender just needed to get caught up. Once he did it was all good. The menu is slightly confusing when placing your order, but they'll walk you through it. They also gave us some suggestions. You can keep it simple or get a little exotic with your fillings and salsas. You've got to try the ones with the flour and hard corn tortilla- stuck together with either warm queso or guacamole. I was seriously day dreaming of it at work yesterday. I've got to get my Condado fix soon."], ["Gus W.", "I had the awesome opportunity to try Condado tonight, and the atmosphere and food was fantastic. They aren't quite done with the decorating, but the place looks fantastic so far. They have plenty of great draft beers and high-end liquor behind the bar to let you know that they mean business in the Short North. You get to create your own tacos or choose from pre-made favorites that were put together, and all of the options that we were able to try were delicious. The chorizo and brisket were fantastic, and their sauces were so tasty. Considering this was a soft opening, the service was pretty stellar, and our server in particular had a great understanding of everything on the menu, We were able to meet the owner and manager, and both were able to take time to chat with us about everything on the menu, and their ideas for the future of the bar.I expect this place to be a new favorite in the Short North scene and draw a good amount of attention from Bakersfield and many other bars in the area. By the time we left, the restaurant was packed, but everyone seemed to be enjoying themselves knowing it was their first real night in service. I could see this place being a great hangout late at night or being a spot where Short North goers start off with a good meal before they get the chance to explore the rest of the neighborhood. This is another great step in connecting the Short North to the South campus and should draw a great following in the weeks to come."], ["Christopher L.", "I've been here a few times and usually have a 3.5/5 experience. Last night was by far one of the worst experiences I've had. To their defense, there was 9-12 of us last night and a few people joined a little later. However, simple customer service isn't hard if you take the time. We sat at a table that was never cleaned off. The waitress was able to reach over me and pick up the previous tables receipt but ignored the dirty dishes and cups right next to it. Food and drink arrived late and the waitresses had attitude toward a few customers.  I went to the restroom and saw both waitresses on their phones in the kitchen so the whole, \"we're busy\", excuse couldn't be usedAt the end they weren't able to split up the checks. The manager, who was very nice but kept trying to justify the terrible customer service, told us if we can write on a piece of paper what everyone got and owed from the receipt, he would be able to run separate cards. Then, he offered everyone  complimentary drinks which Turned this 1/5 to a 2/5. Look, I get it... Sometimes these situations occur, but again, customer service is big in my opinion and it was subpar in this ONE experience.  I will definitely go to Condado again and will follow up.  Basically the only Patio in short north."], ["Zach O.", "My friend and I decided to visit this small business in the Short North because we were feeling like Mexican food, and had plans for the next day, so the \"typical\" option just wasn't going to sit well on the stomach! Note - if you don't like \"hipster\" style places, this isn't the restaurant for you!Upon walking in, we stood there and waited for about 5 minutes before a server came over to greet us. Except, it wasn't a greeting. It was more like getting seated by a mime. Total silence. In addition, we went right at dusk, and this place was very, very poorly lit, I could barely see my order form (more on those below...). We were seated at our table and looked at the menus we were handed. They were drink menus. And while extensive, we had no clue how to order food. The teenage waitress finally came over and explained that you must use these \"scantron-esque\" forms to order food (see pictures). A long order form that basically makes the customer do the work of the wait staff. You mark what you want, what you want on it, how many you want, and give that to your server. Okay. Individual item ordering, I kinda liked it. As opposed to most other places, that you have to order \"meals\" (of which sometimes I don't want the full meal).For my drink, I ordered a banana margarita and expecting it to taste horrible. To my amazement, it actually ranks as one of the best margaritas I've ever had! The only disappointing part was that it was $7 and came in a small mason jar, half filled with ice of course.I ordered 4 tacos (more than enough for the starving customer), and my friend ordered 3. We waited over an hour for the tacos to be made and brought out, which was absurd. But before that, we had some chips and queso. The queso dip was awesome, really thick and very flavorful. The chips were the exact opposite though, they were horrible. Over salted and over fried. Not to mention we pretty much got a basket of crumbs from the start. But, this is a matter of personal taste.The tacos were indeed amazing, as all the other reviewers have noted. Full of flavor, and I have some comments on the ingredients. The plain hard taco shells will fall apart with something runny (sauce, salsa, etc.). I had a shrimp taco that had only two pieces of shrimp. The pineapple salsa is a must try. Get cilantro and onions on your taco, it adds a light, airy flavor that just makes all the others seem bolder and more flavorful. And all the meat is good, I tried each one, and they were all awesome, unique in their own sense.The worst part of the whole experience, the young waitress that came over to clear off our table halfway through our meal, took the plate that was under my taco, out from under me, while I was holding and eating my taco! I just sat there, face full of taco, looking around, before using the chip bowl as my plate (you do need one as things tend to fall out, that's not a knock on the taco though). Also, I ordered a side of sour cream (since everyone skimps on the sour cream), it cost me a dollar, and I got a teaspoon full, which rubbed me a little the wrong way.TLDR - good experience. I'd go there again, and I'd recommend other people give it a try. Go for the food, but don't expect good (or even decent) service. If they had a drive thru, it'd be perfect."], ["Jonathan B.", "People kept telling me about this place but I kept dismissing it because of the location. I don't usually go looking for food north of 5th Avenue because I'm a snob. \"Have you been to Condado, Jonathan?\" they kept asking, \"It's better than Bakersfield.\"I have now been to Condado three times in the past two weeks, and as I type this review I am wondering how long it will be before I next sink my teeth into a double-decker Ju-Ju taco overflowing with delicious pulled pork and fiery habanero sauce, or a Sweet Lucy taco filled with fresh guac and thai chili tofu. There are 26 different ingredients to choose from so I have a feeling it won't be long before I'm back in a stool at the Condado bar, sipping a refreshing margarita and digging into a basket of the best gourmet tacos in Columbus."], ["Tada Y.", "Condado is a solid addition to the Short North taco scene. The ambiance is unique with a variety of table settings from booths to traditional tables and high tops. The food menu can be a bit confusing your first time around, but servers will likely help you. I am a huge fan of their taco options that have both a hard shell and soft shell with queso. While these options add $1 to the price, they also add some premium toppings even with meat, so I find it to be well worth the price. The tacos are also much larger than tacos you will pick up almost anywhere else in the short north. I'd recommend just getting two and maybe a side - it'll be more than enough. The drinks are fairly good and I will say service is fair but nothing to write home about. Bottom line - definitely check this place out for the tacos."], ["Aly S.", "This place is a gem! Love the open airy feel inside. The tacos are wonderful. One was enough for me, I stuffed it with lots of goodies. Just pick what you want, how can you go wrong?! The guacamole was ok, I prefer mine chunky and this wasn't. The margaritas were great! We really enjoyed having a casual and affordable dinner here!"], ["Amanda G.", "YAY! Condado totally met my expectations. Here's what you need to know:1. Margaritas are awesome. They use real fruit puree in the flavored margs and they are simply delicious.2. Order chips and guac and try your hardest not to eat it all (this will take some serious self control) and save room for at least two tacos3. TACOS! Brisket. Tacos. I mean, seriously. So freaking good. Tender and savory and everything you want a taco to be. Also: Chorizo! It's spicy and when you put some of that creamy chipotle sauce on it- your tastebuds will sing and dance. Also they have a million different ways to DIY tacos which is a lot of power for the average diner. Ask your server about some good combos or get the daily special if you're feeling overwhelmed."], ["Goose R.", "3 to 4$ tacos. Soft shells and hard and both. Hard shell is the closest to an authentic deep fried Mexican taco. Not that Taco Bell stuff. Good fillings include but not limited to. Shrimp. Tofu. Grilled chicken. Pulled pork. Shredded beef. Some sauces to pick from. I got the hottest one. The ghost pepper. It was not hot. No salt shakers. Happy hour has 1$ off tacos and half prices margaritas. Margaritas are 5$. Not bad. Noisy. Big place"], ["Bailey M.", "My girlfriend and I went tonight and had a great experience! The waiter was super helpful and really nice and the food was delicious.We created our own tacos and liked all of them but we think the pulled pork was the best. The margaritas were really good too. We got 2 different flavors to share: peach and banana. The banana margarita was surprisingly delicious! It sounds strange but definitely worth it. Peach was good as well, but if you like banana just trust me and get the banana margarita :)"], ["Briden S.", "Okay may I just say I am going to become a regular here. Good job! I am picky when it comes to my tacos! And I have been to many taco places here in Columbus. This hits the ball out of the park. Let's call this the dirty franks of tacos! 1. First visit: walk in, yes it was a beautiful galley hop Saturday night, so it was very loud and busy. With that it was overwhelming and nerve racking. The host was very nice and took my name and also offered the bar. (I prefer the bar because it's faster and more attentive service). We get this guy who is busy yes, but very nice and helpful. We are newbies here, he could tell. So ordering is different, it's like a sushi place were you write down what you want on a piece of paper. And you Build your own taco. Now they also give you options for those of you that don't like that kind of thing. But what I made myself was amazing!!!! I don't think you can really manage to mess it up. So yes it was amazing, and the service was prompt and welcoming. PLUS they were really busy, so for that they for a little behind, but they recognized that and gave everyone free salsa and chips. That same night was my birthday and the bar tender was very generous with his service. Grade A customer service.I really enjoyed everything about this place! Keep up the great work, I hope you stay around for a while. I can't wait for the street corn."], ["Antonio T.", "Well.....the concept is very good. It reminds me of a place that I used to visit in Atlanta called The Great American Burrito Company which was a build-your-own burrito place that had every topping that you could think of. I also thought it was VERY economical. I mean, where else can u get a decent meal for under $10? With that being said, my only disappointment was unfortunately, the food. Maybe it was just my selection or maybe they were having a bad night, but everything lacked distinctive flavor. It all kinda tasted the same. And I'm used to flavors that \"pop\"! The chicken could've been seasoned and chargrilled, and the pulled pork and the brisket should not have tasted similar. The dishes just lacked a uniqueness that I expected."], ["Brianna M.", "Businesses where you can choose my own toppings are really starting to flourish in Columbus and I couldn't be happier. Condado could have made their place like a taco Chipotle/Piada/Bibibop, with a line of toppings to choose and open seating. I am SO happy they didn't. I love that I can get a $3 taco with a ton of toppings with a full bar and table service. It made a delicious meal into a nice dining experience. I ordered 3 tacos: pork, chicken and portobello mushroom. The pork was great, the chicken was good, but the mushrooms were AMAZING. I've never had mushrooms in a taco before. The way they cooked them made them taste almost meaty. Big ups for the pineapple guacamole, too. My friend, a big Mexican food lover, just kept saying \"my life is ruined...in the best way possible!\" With so many ways to customize your order, you could come in every day for a year and never eat the same thing twice. I love that novelty! Plus, they have a full bar and great taps. I had a margarita with prickly pear flavoring. So delicious without being crazy sweet. They really put a lot of time into decor and atmosphere. It was pretty dim inside with incredible murals covering the walls. There was a range of seating, including a large high top table with connected stools. Here's where my only complaint comes: it's so loud in here! I understand restaurants can get loud during the busy dinner hour. But those aforementioned high top stools? They squeak like crazy, just adding to the high volume. Still, it was not enough to take down the star rating for me! I seriously cannot wait to come back. This will definitely be on my list to take out of town visitors to impress them!"], ["Maggie B.", "Man! These tacos were amazing! I want one again just thinking about them. They are giant and oh so delicioso! The prices are super reasonable as well. Love the Dia de Los Muertos theme. It is perfect for this casual taco joint. In fact, it was the skulls on the window that caught my eye. We started with the queso which was good but could have used some more spice. The ordering system is a bit stressful if you are worries about the perfect taco but every taco that we made was so good that I'm not sure you can really go wrong. They also have some suggestions of combinations. You start with a shell or a combination shell that has some items included. My favorite was the Goody Goody. The \"crunch\" and the guac in it make an amazing combination. The peezler was a close second with refried beans between the soft and hard shells. The chicken was tasty. The Brisket was good but very flavorful so beware when adding toppings. The ceviche was bright and fresh. Everything was amazing and I can't wait to go back. Wish there was one in Cincy!"], ["Dani G.", "I only came here for happy hour but the margaritas were good and very well priced, at least during happy hour. I also had the chips and queso. The chips were light and airy which was perfect and the queso was very good as well. A little pricy at 8 dollars by they did give me a tub to put the extra in along with a fresh bag of chips."]], "Abuelo's": [["Taylor O.", "This place can be hit or miss with service.  It's usually good, but on those busy nights, which they do have many, it can lack a little.There's both indoor and outdoor seating, a nice size bar off to the side.  Drink orders do tend to take more time than expected when it's busy.  But for a place that sells a lot of margaritas, everyone is ordering drinks.I've always had good food here, but I haven't really wondered off the path or trying different things since for some reason I usually tend to get the same two or three entrees when I visit.  I like their salsas and dips, however the chips can become soggy/oily and a little too brittle sometimes, yes I'm being picky on the chips, I like em a little thicker, but that's my personal preference.For a chain, this place is pretty good.  I find Tex Mex and Mexican places can be really hit or miss on the quality and taste of the food.  It's always been good here, but I think there's places they could make it better."], ["Kelly R.", "Abuelos exceeded my expectations.  I had never been to Abuelos before visiting Columbus, even though there is one in Cleveland, where I live.  I went there for dinner, and the place was pretty full, and since I was dining by myself, I opted to sit at the bar.   I ordered a Sangria, and the Chicken Fajita Platter.  Shortly after ordering, the server returned with a basket of fresh tortilla chips and 3 salsa choices, mild, spicy and sweet.  All were yummy!  My entree arrived a short while later, sizzling hot, more than ample portion.  The sliced chicken arrived atop onions and bell pepper on a sizzling cast iron pan, accompanied by pico de gallo, guac, sour cream, cheese, pinto beans and mexican rice, along with warm flour tortillas.  All-in-all, this was a great meal and I will definitely return to Abuelos!"], ["Mindy L.", "Love this place! I moved here a couple years ago and wondered if I'd ever find a Mexican restaurant I liked. I know its a chain, and that usually turns me off, but the food here is so good and the service is great.I've been here twice in the last year and both times we walked right in and sat down. Once on a Friday night and once on a Saturday night. The restaurant was busy, but the service is so good the tables turn over pretty fast.For me, the chips and salsa make or break the Mexican restaurant. They're not as good as Chili's but they're really really good. Light, crispy chips served warm and a selection of salsas for dipping. I highly recommend the queso. I told my husband I considered crushing up the chips in the bowl and eating it like a soup, haha! The fresh guacamole was really good too and I hate avocados! My husband and son are picky, and I'm picky about my Mexican. It's a unanimous hit!"], ["Jessica A.", "I love good Mexican food. This was mediocre. The service was awful. I understand it was busy but the amount of mistakes made in our party was crazy. And when the manager brought over another waiter to help he took a drink order and then never came back. My boyfriends order was incorrect, not even close to what he orsered, so he had to wait for his food while everyone else started eating. I would not recommend this place to anyone. There are far better Mexican restaurants. I think the only good thing I can say is the interior of the place was nice."], ["Tim B.", "About 30 years ago, my family started eating Mexican food every Easter. No one felt like cooking, so we went to a place on 161 called Chi Chi's, because it was open and close by - and a Browning family tradition was born. We thought it was pretty good then!  I probably wouldn't love it now, but I won't speak ill of it. Chi Chi's was like an alcoholic aunt. You recognize that she has problems, and she's a little embarrassing, but you love her anyway. It's a bit tricky now, though, since most Mexican places aren't open on Easter. Even though I mostly avoid chains now, I do have a special place in my heart for Abuelo's. Mostly, I really like this place. The guacamole is fresh, you can get a decent margarita without any sour mix, and the food is pretty darn tasty. But I would be an irresponsible Yelper, if I didn't warn you all about the ribeye. Abuelos makes a big deal out of their prime rib. I've had it a few times, and it's pretty good! But...the ribeye. It's partially my fault for ordering a steak at that price. I should have known it was too good to be true. Do you remember Ponderosa? I'm not saying that you shouldn't go to Abuelo's. I think it's a terrific value all in all.  Just don't order the ribeye. And the new Do It Yourself POS system is pretty tacky.I think the family is going to Abuelo's this Easter! Unless a new Chi Chi's opens up."], ["Sara G.", "Even though the website says they are open until 10pm, apparently, they close at 9pm. It would be nice if the staff let their customers know this when seating within the last hour (especially when the restaurant website, and this website say 10pm. What restaurant at Easton closes at 9pm? One that isn't run well, or doing well!"], ["Naiying C.", "Just average \"mexican\" food. Their Queso Flameado Supremo is interesting, it's flaming cheese and the only memorable item in the menu."], ["Samantha J.", "Place was super good! I love the interior and the food was pretty decent. I ordered one of their oversized platters expecting to take some home for dinner later.  It cost around 20$ just for my food. For the amount I got I think 15$ would have been better. I was not a impressed but some of the burritos/ whatever they're called. But I believe with a plate like that you take chances. I would go back again but I would order something smaller and not a catch all for burritos."], ["Brian H.", "Was our first visit and I was fairly impressed. The chips were thin and crisp and three salsas all had good flavor. Shared chicken and steak fajitas with sides of rice and beans. Chicken was bland but steak was flavorful and cooked perfect. Server was nice but wasn't over friendly. All and all it was a good dinner and I would return again for a visit in the future."], ["Antonio T.", "Abuelo's is a smorgasbord of good Tex-Mex food! I can't say it's the best Mexican place in Columbus (that belongs to someone else) but it's DEFINITELY in the Top 5! The thing that sets it apart from almost everyone else is the size of the building and the menu. There are sooooooooo many things to choose from and from what I could see from the plates around me, they were all well prepared, presented and good! It's not too pricey, especially for someone like me who doesn't drink alcohol, and it's location makes it second to none. Warning: Make sure you do your shopping before you eat here because afterwards it's nap time!"], ["Corey Tess T.", "Stopped in here after work with a co-worker for drinks and dinner. We sat in the bar, which is your classic Mexican decor...  we've been here twice for after work drinks.. the first time the server was pretty cool, the second time we got a very clueless server who seemed to have no sense of timing at all..The menu is pretty standard stuff... I had the Juarez which is pretty much your standard mex combo with enchiladas and a taco.. everything is way too much food.. and i am terrible about taking left overs home and never actually eating them.. or packing them up and then forgetting it on the table..I like the SKINNY MOJITO they have... try it...  They have two sizes of guacamole too...  the first time we inadvertently got the mondo size.. which was way too much for two people...We got lucky twice with parking but this place is usually pretty hectic because it is in Easton Center.. so keep that in mind."], ["Jess R.", "Came in with two other people around 7:40 on a Friday. Spotted a few empty tables, but was told it was going to be a 20 minute wait. We waited, and watched the tables stay empty. When I inquired, they said that they were indenting on seating earlier parties...When it was finally our turn, we were shown a table right near the front. Asked for a booth after spotting two empty ones, and moved. Really, our waiter was fine. It was the food that was the problem. I'm pretty sure my steak quesadilla was made with cheese whiz, and the gf's grilled chicken fajitas tasted and looked eerily similar to Tyson's pre-cooked chicken strips on top of a mountain of sort of cooked onions with peels on them. Not a pepper in sight! Had the tum runs after, should have stayed at Bar Louie and downed another flatbread over a $3.25 draft during Happy Hour."], ["Jamie D.", "Food is ok, but has been slowly getting worse over time. The service has been marginal and now has deteriorated as well. We used to eat here often when coming to Easton for shopping. We will no longer return."], ["Brittany N.", "Amazing mexican food. I got the Durango burrito and it was amazing, shredded beef. It came with rice or re-fried beans (get the rice) and some guacamole and I chose the potatoes that came with it, I forget what they are called but they have cheese and stuff, so good. The server was one of the best servers I have ever had, he was so great.I was obsessed with the salsa and chips. So delicious. You can tell the chips and salsas were made in house. The green salsa was my favorite, my friends each had a different favorite of the three. Love that green salsa.Great atmosphere. Love the murals painted on the walls. Everyone is so friendly. I love it there. Prices were great on what we got. Some stuff is pricey but two of us got the Durango burrito and the third person got something similar for vegetarians and the bill was only 30 or so for three people. Amazing deal. So price-wise it depends on what you get. Next time I am going to try the more pricey dishes because I am sure they are worth it.Overall very positive experience. I am from a rural part of Ohio so I guess I am used to the crappy chain restaurants and very few gems here in Boardman, but Columbus seems to have all the good food. Next time I am in Columbus I will be eating here. :)"], ["Lucy D.", "If you find something you like here, stick with it and don't stray too much because it's hit or miss with some things. Service is always quick, but the food has ranged from terrible to awesome. (I guess it just depends on who is working.)Their darker spicy salsa is awesome, but if you get take out they won't include it unless you specifically ask.I've got a 2 year old that has a very small rotation of food she will eat - beans, rice and taco meat being one of three meals. Needless to say, we frequent this place multiple times per week. Despite the fact that I have spent hundreds of dollars here each month for the past, ah, three months, I've yet to have a server recognize us (even though we've gotten the same people multiple times.) However, they're all still pretty good at what they do, efficient and friendly. The margaritas are pretty good, and the chips are awesome, especially when you get them fresh and hot. Best deal on the margaritas is either the pitcher or the \"Mucho\" size during happy hour. The bathrooms are disgusting and I always try and avoid using them if at all possible because every time I walk in I feel like I'm going to die from the smell. It must be seeped into the walls. It's horrible. Despite the misgivings I have with this place, it's close, and in our regular rotation. You'll either like it or hate it - if the food was more consistent I would probably give it a 4 star."], ["Michelle S.", "I'm usually picky when it comes to where I eat Mexican food....I do like authentic places but I I have to say I really like the fajitas here. It's probably not the real authentic taste you're looking for but it doesn't mean it can't taste yummy.Good drinks too but I guess it depends on the bar tender working that day."], ["Katie R.", "Used a groupon with the boyfriend. I got the grilled chicken sandwich and he got the steak burrito. My chicken is always fresh and large. He loves the burrito. Our waitress Neely today was awesome!!! Super friendly. My only complaint is that it's pretty cold in the winter because of all the windows. Those poor waitresses must be freezing in there tiny tank tops. LOL."], ["Phil G.", "Hands down one of the best Mexican restaurants in the Columbus area !Their chips are great and they bring you variety of salsas to try for free.  Though the house salsa is the best of them IMO.  They have a new appetizer called a \"Jalapeno Fritter\" which is a smooth mexi-cheese(queso fresco perhaps?)mixed with mild jalapeno pieces fried in a light crispy batter.  Delicious and ample amount serving for 2-3 people and affordably priced.  Think tasty hush puppies but not as heavy.Like another reviewer has said, the Bacon Wrapped Shrimp are great too.The usual \"go to\" for myself here are the enchiladas.  Especially the shredded marinated beef, which is very flavorful and the cheese filled one(awesome cheese).  The chicken one is just okay and not too flavorful, so I don't order it anymore.  The rice is light and has a great flavor/texture.  The atmosphere and layout of this restaurant is really cool.  The paintings and dome in the the middle of the building make it very interesting.Service has always been good even when it's very busy.The meal prices vary from moderately priced to flat out cheap.  In other words you get your money's worth.  If you want to have a steak your going to pay the going rate.  If your going to eat enchiladas/burritos/tamales it's going to be quite inexpensive."], ["Carroll L.", "Enjoyed the food and atmosphere. Service was a bit erratic but over all a good lunch."], ["Mel C.", "What can I say about Abuelos?  If you love Mexican food at a restaurant that hooks it up, then Abuelos is your type of restaurant. I love Mexican food, but never a huge fan for branded Mexican restaurants. I prefer your hole in the wall, drive thru, and fast food type Mexican food that you find in San Diego or even LA. That being said, I have to say the overall taste of the food is just okay.  I tried the chicken and fish fajitas. My meal was decent, still satisfying, and the portions were huge. The rest of our group got everything from steaks, enchiladas, tacos, and seafood.  By the looks of it, everyone else's meals were hooked up too. There's a huge selection on their menu so finding something to settle on isn't too tough.  The dessert menu is also extensive.My only issue has to be with the service. The crew here is very nice, but took some time to take our orders and even longer to serve it. They serve baskets of chips while you wait for your main dishes. Our group had their chips refilled at least 3 times because the food took that long. Plus, their chips are so light and addicting that you can't help but kill it while you wait.Even though I'm not a huge fan of this type of Mexican food, I thought that the waiters and waitresses were great. The food portions are huge, priced fairly decent, and taste is probably what they are striving for.  Our meals probably could have been served faster in my opinion."], ["Tory R.", "Yum yum yum!!!!! That's the best way to describe this place! I'd never been to this particular Abuelos location until a week ago. I was very happy with the experience!When we walked in, we were seated quickly and greeted by our server. The decor of the place is really neat with lots to look at! I got the Matadoro (I think it's called)...which had a cheese enchilada, beef enchilada and a chile relleno. It was pretty much amazing! Comes with beans and rice (as most Mexican dishes do). I had a sangria swirl and it was very tasty! Good atmosphere, great food and not too high pricewise! Will definately go back!"], ["Jessica H.", "Wow - stopped in on Saturday to grab a bite.  The greeter was very nice as was the GM.That's where it ends.  Inside, it's not as nice as one expects from the outside.  It seems a little tired.  A big box room, no flow, and stuff stuck in it to break it up.  The bartender was a not nice person.  Snippy, nasty and vaguely judgmental.We ordered one margarita to sip on while we waited.... it was pretty much all sour mix and cost close to $8.  It tasted really bad.  A simplistic evaluation, but there is nothing more to it than that.  We talked to the GM, after I paid, and he said it would be taken off at the end of the night.  We'll see if it's off my credit card."], ["Stacey R.", "Love Abuelo's interpretation of Mexican food.  Favorites include the enchiladas, chimichangas and fajitas.  Highly recommend.  Service can be hit or miss, but the food is delicious, the price is right, and we usually do not have a long wait for a table.  Best fit for our family for Mexican food in Columbus."], ["Angela H.", "This place is alright. The staff and service were good, they kept our drinks filled and replaced the tortilla chips without being asked too. The food was what we had the biggest problem with. We ordered the Chile Con Queso dip and it had a pretty good flavor but it was VERY runny and dripped everywhere. Same problem with the salsa; it was a runny mess.We ordered The Monterrey and The Grande. We both agreed the taco was fine, nothing spectacular about it though. The chile relleno was disgusting (we both had never had one before though). The enchiladas were all squished down from being covered with too much sauce and cheese, and there wasn't much chicken, beef, or filling inside the enchiladas.Abuelo's is an okay restaurant, but with the wide variety of Mexican restaurants out there we probably won't be back."], ["Ken L.", "Slow service in the bar area. Host who didn't want to give us a table because it was 9:01 PM.  Forced us into a booth in the back of the bar.  The 1800 margarita was average at best even though it's one of their specialties.  Had been several years since I was in here. It has slipped a lot. Probably my last trip.   Easton has too many good places to waste your time at this restaurant."], ["M L.", "I like Abuelo's very nice and classy atmosphere, servers are courteous and you can defiantly tell it is a \"corporate chain restaurant\".  We had their queso dip and was good and different. Everything I have tried here was good and different than your traditional authentic Mexican restaurants. Tried out on different occasions several of their drinks, I like that they do infused fruit in some of their drinks as well. Every time I go to the Easton Mall I try to stop in!"], ["Keith B.", "I've been here several times, and the place has never ceased to amaze me. The food is standard mexican fare, with the occasional \"chef special.\"Despite the other reviews, I've never had a bad experience here - lunch during the week, dinner, crowded, empty - it's always been good. Sometimes the wait was long, but you can't blame them for being crowded.I always get the Patron margarita with my meal (it's hard to fuck that up) - and I mix my order up every time, and it's always been piping hot and delicious."], ["Doug R.", "They have a good sized menu and I believe that is what may have hampered my experience.The overall restaurant is typical of the large national franchise. This is not an indictment of large national franchises but it does mean a consistency with a more bland taste to the food.My choice of the Steak Chimichanga was probably not the best selection, but it was okay. The servings are large portions and I did not finish my meal. I did, however, see other selections I would rather have had, but this was after my selection.Once again this is a good restaurant and typical of national chains, but it does not compare to the small Mexican style, Mom and Pa restaurants I have been to over the last several years. In fact it seems those are becoming the only authentic restaurants lefts. That is if place like Abuelos does not kill off the small places in the future."], ["Beka H.", "Ask for Jamie.treated us so nicely!"], ["RB B.", "I'll make this short and sweet...I love this place!  Food is good, prices are right.  Can't go wrong with the enchiladas.  I live out of town and have to get here when I'm in Columbus."], ["Donna T.", "Almost as good as DonPablos in Mpls. Best enchiladas I've had in Columbus."], ["Keith A.", "This is not the Abeulos I grew up loving. The food is mediocre and bland.  It seems the spiciness had been toned down for a Midwest pallet which is disappointing.  I had trumpeted the place over and over again to my wife, who having little tolerance for most things spicy, thought it was underwhelming as well.  Would not recommend to anyone who wants authentic Mexican or TexMex food."], ["Alisha S.", "Very Allergy Friendly Restaurant! Our kids have gluten and dairy allergies so eating out is hard for us. Alot of times we feel like a nuisance when we ask questions and sometimes we don't feel confident in the answers we receive from people. The manager at Abuelos (his name was Oscar) came out to talk to us and was very knowledgable about which foods we could and couldn't have. He seemed to really know and we trusted him. And he didn't seemed annoyed or bothered-- in fact he seemed happy to help. He said that he would check in with us and make sure everything was right and he did! We couldn't have their salsa (it has flour in it as a thickener!) or regular chips so they made baked chips and we ordered some guacamole for them. When the waiter brought out the guacamole it had a large, fancy chip sticking out of the top for visual appeal. The waiter appeared out of nowhere as the waiter was setting this down on our table, whisked it away and informed the waiter that we couldn't have that one because of the chip. He came back with a new one a few moments later. We thought the food was very good. We didn't really like the taste of the baked tortilla chips but were still happy to have something. I'm sure their regular chips are much tastier. I got the tacos (using corn tortillas) with black beans and rice. It was really good! And a bargain at only $9.00. My husband got a steak with seasonal vegetables and rice. It was delicious as well. We really enjoyed the vegetables, rice and black beans. Delicious!"], ["Rae W.", "Loud, slow service, food was meh."], ["Nijole T.", "After coming here on a saturday and finding I would have to wait an hour i left to return  the next day hoping to have found some really good mexican food in Columbus. It had to be good being that full and looking so nice. Well the next day we were the only ones there for dinner, very strange. Sure it was only 6pm but still. I ordered the fajita salad, my son the tacos and my husband 2 platters so we could all sample their, tacos, chimichangas, burritos, and their sides. I was really expecting more and better quality for my money. It was not bad, but not good. It costed more than other mexican restaurants and I can not understand why, the portions are small and the food especially  the sides are not good at all. I am always a fan of the rice and beans, both were gross. Sadly, I will not be coming back to Abuelos."], ["Valissa W.", "If I were to have a conversation with Abuelos, it would go something like this:me: Abuelos! You are so beautiful, I love your faux patio and the colorful murals.Abuelos: Well yes, I am a part of Easton. Therefore, I rock.me: Can I get a table?Abuelos: You must first wait hours and hours. And then it will not be ready.me: Ok, well, I'll be at the bar with the overpriced premixed mojitos until then.Abuelos: You will eat corn chips while you wait.me: But I'm allergic to corn.Abuelos: Corn chips!!!me: Can I have flour tortillas with the salsa instead?Abuelos: Fine. But you must wait even longer now so that we can hide kernels of corn in your spinach enchilada. me: *sigh* Ok...."], ["Matt W.", "I went over there last night for dinner. While I agree the restaurant itself is beautiful, and the servers are polite and attentive, the food itself was deeply underwhelming. Our table shared an order of Guacamole that was fresh, appetizing, and probably the best value we got at $3 for the plate. The chips and salsa were no better than average, and of our entrees, the two enchilada plate came with tiny enchiladas drowned under a lake of bland sauce, the 'patatas chiles', which I thought would be a take on patatas bravas, turned out to basically be box quality mashed potatoes with perhaps a half of a jalapeno pepper diced on top and some melted cheese, and rather dead refried beans, while the steak & shrimp plate my friend ordered was remarkably small for the price considering the competition immediately nearby.Prices weren't terrible for Easton, but to be frank I could have gotten the same (or better) quality food at any of the Mexican restaurants around town and paid $2-3 a plate less."], ["Kelly R.", "Their sangrias are amazing and the dos equis amber's are cold and delicious. HUGE portions, you can share with someone and still leave full. If you aren't a huge fan of super spicy, this is your best bet with Mexican food. They will ask you how spicy you want your food and they actually do what you ask. I like their queso sauce as well. The ambiance is very cool inside, I've been in a few that have waterfalls, so was disappointed that this one did not. But I love the high ceilings and the wait staff :)"], ["Matthew T.", "I love this place with their new menu."], ["Mike H.", "Definitely super corporate chain feel which would be on par for Easton but I have to say that the food has good flavor.  I try to order a chile relleno every time I get Mexican/Tex-Mex or however you prefer to call it.  I have to say that it's the best relleno I've had so far.  I'm not sure how authentic it is but it tastes good.I'm kinda sick of talking about the authenticity of Mexican cuisine anyway.  Who cares.  In America it's a mixture of Mexican and American Southwest cuisine I guess.  I don't even know what that means!  What's the difference?  Plus I'm sure Mexico is a big diverse country, I'm sure the food varies quite a bit within the country.  Who knows, I'm not a food anthropologist.Anyway, our service was bad.  The plates were not cleared from our table when we were done.  At first I thought he was doing the proper etiquette thing by not clearing plates until everyone was done, but that wasn't it.  I've been there a few times and never had this problem so I can give them a pass.  Maybe a new guy."]], "Hass": [["Basima A.", "Okay; I'm crazy about fish tacos and have been actively trying to find some as good as the ones we had while on vacation in Mexico...  FINALLY!!  How did I not know about this place until now??  We ordered the fish tacos and then some shrimp ones too.  Both were FANTASTIC!   I mean, seriously, exactly what I had been craving.  I can honestly say these are some of the best and most authentic tacos I've had in Columbus.  Yum!"], ["Lauren A.", "We visited Hass per several recommendations. All in all, great tacos but crappy service. I would recommend you try Hass at least once.(1) Service -- Service was definitely not up to par. To order, go up to the register, place order, take a number, and then wait for your food to be brought to your table. They have a pretty quick turnaround, and we weren't waiting a long time for our food. The woman taking my order rushed us and had a really bad attitude. I went up a second time to order a couple more tacos, and she acted like I was interrupting her, like a child or a nuisance. Fix the attitude, and I'd gladly come back. (2) Taste and quality -- Taste and quality was ALL there. I highly recommend any one of the tacos. The food was extremely fresh. When you order, keep in mind that tacos are at least $2 for one. I would recommend getting one of each taco and then going from there to see what you like best.  The only thing I wouldn't recommend is the steak burrito (I cannot attest to any other kind of burrito). Although it was fresh, the taste was bland.(3) Space -- This is a come as you please establishment. When you go inside, there are several high top table with stools and regular tables (fit up to 4 people, but I'm sure you could push them together to accommodate your party). I think Hass is great for families with children, casual dates, big groups, and for those who want to eat alone. You go up to the register, order, and wait for your food to be brought to you. When you're done eating, take your dirty dishes/tray to the trash.Side note: I noticed that a lot of people were ordering take-out. I think that's what we will do next time."], ["Kevin K.", "We had a bad experience. Drove to this place wanting some tacos. Waiting in line we knew this was a bad choice. Cashier argued with the couple ordering. Wife ordered, I started my order, the cashier walks away from the register. Comes back I start again, cashier again repeats order from people before us. Finally we complete our order, gather our chips and salsa, and drinks, find a seat and wait. Half an hour later, the order before us, goes out the door, the order after ours goes to the table with family with three kids. Our papa, fish taco, shrimp taco, al pastor taco, nowhere to be seen. A few minutes later our food comes out, 40 minutes after we order, I checked our receipt. Papa caliente was good, wife enjoyed it. My taco al pastor had one piece of meat, tasted like the cilantro, shrimp taco was breaded fried, menu showed unbreaded shrimp, it was very good. Fish taco was left uneaten, I could not get past the fish smell. I was so excited about the reviews of this taco.  I wanted to like this place, service was rude, food was average, cost was high for what we got. $9.99 papa, $2.50 fish taco, $2.99 shrimp taco, $2.00 al pastor taco, $2.00 chips, $1.00 salsa, and $2.00 diet Pepsi. I hope it truly was just a bad night, we will not be back."], ["Danielle J.", "Amazing little Mexican place with plenty to choose from! The pork is cooking right in front of you at the register and it's so delicious! I saw this on Yelp when I came into Columbus for the weekend and I had to try. Brought the whole family! I tried every taco between my boyfriend and I. My favorite was the Carnitas ones. Completely stuffed and topped off tacos! Couldn't have been happier with this place, service was on point as well because the guy behind the register knew the whole menu by heart and explain every inch of it to us. I love taking people to places like this, they are always impressed with my choices and I have Yelp to thank for that. This place is a perfect example of somewhere you can pull from Yelp and impress the whole family! I recommended pretty much everything on the menu. Especially the pork!"], ["Garrett S.", "I must admit that I haven't actually eaten here, but that is because they were closed.But when your online listings (Yelp & Google) and your own front door say that you're open until 11pm, you really shouldn't be closed 30+ minutes before that. (And no, it wasn't a holiday or even the couple days before or after a holidays. And even if it had been, you should have a sign on the door anytime your varying from the hours you have posted on your own front door.)"], ["Antonio T.", "Since I've been here in Columbus. My choices of Mexican restaurants have gotten increasingly better with every outing. At first, I discovered El Tacoriendo and fell in love with the authenticity of the place. Next up, I found out about Los Gauchos Taequira and that was my favorite for about 3 weeks. That journey continues as just recently I discovered......Hass. Think of it as Los Gauchos with more seasoned food minus the peppers and onions on the table. Larger space, smaller menu, and slightly more flavor all lead to a wonderful dining experience"], ["Michael M.", "This place may have been having a bad day when I ordered food, but this first visit to Hass is not going to change up my routine. Los Guachos still reigns as the best taquieria, followed by the Taco Loco. I don't explore the Eastside as much compared to the west side of town so maybe there are taco trucks on the east side better better or as good and I just haven't found them yet.I went ahead and ordered the burrito Hass with Pastor, and well everything tasted good nothing was outstanding or different compared to some of the other businesses I named. Also the meat had too much gristle that was inedible and made it harder to enjoy my burrito because the last thing you want is to pullout something you just got done chewing on from your mouth. Even the gristle is something I would let slide but I took my order to go and the salsa cups that they use are very small to begin with and both of the salsa cups were filled up about halfway meaning for a good size burrito, I only had about an ounce of salsa for the entire burrito. It's little things like this that might make somebody not return especially when there're other taco places that are more convenient for me and are better.I will give this place another try but just not anytime soon. The only real positive I can give this place is the layout of the seating, big ample space and plenty seats unlike Los Guachos which is extremely cramped at times."], ["Mary B.", "Stopped by after seeing good Yelp reviews. This is a fast causal mexican restaurant.  Grab a few different tacos, quesadilla,  burritos without breaking the bank. They serve beer and margaritas too. I ordered a margarita and it wasn't too sweet and rather delious. We ordered queso dip, salsa and chips while we waited. The queso was really runny but had a slight kick of jalapeño.  Not my favorite but the homemade chips made up for it. I got the shrimp tacos. Lightly battered and fried shrimp with a crunchy slaw and a creamy sauce. It was amazing and a must try. The service here was excellent and helpful since it was our first visit. We will be back for sure."], ["Fred B.", "ARE YOU FU##ING KIDDING ME...?!?  HOW HAVE WE NEVER BEEN TO HASS...?!?  (thank you, Tina!)OMG it's so good.  Every one of the 4 meats we tried - carne asada, carnitas, al pastor and fish were all absolutely delicious.Most great taco places do 1 kind of meat very well, and others decently.  HASS does all of them incredibly well.We ate their meat in tacos, burritos and tortas - all great.Maybe the best $5.99 margaritas in town.Excellent.  Delicious.  Wonderful.  I'm stuffed from all we ate, and I'm already thinking about the next time we'll come back...!"], ["Vin R.", "Once again, the best Columbus ethnic food is found in random strip malls.Hass is no secret to foodies, but was a pleasant surprise for me as I rarely venture outside of 270 when dining out. My wife and I split several tacos--our favorites being the fish taco and carnitas.  A rarity for us, we actually finished our entire order in one sitting."], ["Zach T.", "This is one of the better taco places in the city. Al pastor is my favorite kind of meat, so I judge all my tacos off of that. Personally, I think Los Guachos has the best pastor on the city, but this place isn't too far behind. The meat itself is well seasoned and has a nice texture to it after they throw it on the grill. One thing I didn't like was that the pineapple comes diced. I prefer having a nice big chunk of pineapple, but to each their own PPP. Besides that tho the taste is on point. These tacos are kinda pricey tho ($2 for al pastor) which also knocks it down.  I will say tho that I liked the horchata here a lot more than Los Guachos, so be sure to order a cup of it!  Finally, the salsas here are also pretty good so experiment with those. Happy eating!"], ["Gwen W.", "I organized a Yelp UYE at this joint last night. It's had been a several months since my last stop in here. The food hasn't changed. But the actual strip-mall space that Hass was occupying is now bigger. Hass has aquired the shop space next door. They've knocked down the dividing wall. This was the perfect move, in my opinion: It's so much bigger of an eatery, now!! For our UYE, Hass was able to set up several four-tops; a giant, long table so everyone could chat!! The management was awesome, too! The GM gentleman was great: hilarious, sarcastic, knowledgeable out the store's water source **hehe**!out orders where brought out pretty fast, considering the place was full with hurry patrons. Oh, and yes, the food was tasty (as always)! Great flavors. I tried their fish and shrimp tacos. The light batter was nice and warm. The ocean tastes did not taste like freezer - prefect. A personal favorite was the sauce lightly squeezed on top of both tacos."], ["Arvid Y.", "I visited Hass last week for an UYE organized by Gwen W. I live in the Arena District, so driving past the I-270 Outerbelt to get to Hass is quite the trek for me. Even after factoring in the long commute, I still left impressed .  Since moving to Columbus, I haven't had the chance to try many taco joints. However, I can safely say that the tacos at Hass are some of the best i've ever had. I haven't tried Los Guachos yet, but these ones are comparable to the awesome tacos I had at El Tuzo Taco (taco truck).A combination of great taste and fair pricing make these tacos great. Each taco runs about $2. They are good sized with plentiful toppings, but you will still need to order 3 to 4 tacos in order to be full. I tried the chorizo, al pastor, shrimp and fish tacos. My favorites were the al pastor and fish. All the ingredients tasted fresh and the meat was well-seasoned. I particularly enjoyed the pineapple and avocado sauce in the al pastor. Despite all the toppings, the consumption of these tacos were surprisingly mess-free.    My other Yelp colleagues were a little less impressed with their Bronco Burrito. They thought it was \"missing something\" and they ended up drowning their burritos in hot sauce. I also sampled their mini quesadilla, whicc was just okay. My advice would be to stick with the tacos. Overall a very solid taco joint. $9 and change got me 4 tacos and a beer. The only negative point is their location and how far they are from my home."], ["Staci R.", "Excellent shrimp tacos. Who am I kidding everything I've had at Hass is delicious! Authentic and affordable."], ["Neil B.", "The tacos are really good, but the service and atmosphere is a little lacking."], ["Gus W.", "Why is this place not closer to me? Not remotely close for that matter. When my buddy said he was going to watch his nephew play hockey at Dublin at 10 in the morning, I jumped on that opportunity to kill two birds with one stone: go to Play It Again Sports and check out Hass, since they're in the same plaza. We're both huge fans of authentic Mexican fare, so I knew he'd want to try it.Wow, the tacos at this place are amazing, particularly the pastor tacos. The meat is cooked on the spit perfectly, and they give you a lot of it with a nice green sauce on top along with pineapple, onions, and cilantro. The red and green sauces on the table were delicious as well. I also got a pastor quesadilla, which was pretty good but incredibly small. I loved the taste of it, but I don't think I'd get it the next time. It was the same price as the tacos at $1.75, but as soon as you add meat to it, it bumped the price up to over $3 when it was literally the same exact ingredients as the tacos plus cheese but with less meat. They even use the same small corn tortillas to create it. You're not foolin' me! Lower the price or make the quesadilla bigger.Anywho, I'll forgive my minor gripe, because the meal tasted so good. This place needs to expand closer to downtown, or better yet, my street, so I don't have to make the 20 minute drive every time I want these awesome tacos."], ["Katye M.", "I've been here once and it is now one of my favorite Mexican restaurants in town! Location is a little out of the way and is tucked in a plaza, but it's worth checking out. They have a larger place than expected -- some \"bar\" tables and some short tables, with maybe about 20 tables in all. The employees were very nice. You order at the front and then they bring out your oder to your table."], ["Shuo F.", "After seeing many great reviews of this place, I had to come and try! I ordered four al pastor tacos and a Burrito Bronco. Both tasted amazingly! The taco is topped with pieces of pineapple which brought out the savory seasoning of the pork. The burrito is big and it's not so cheesy that it covers up the taste of the rest of the ingredients, like other places. The burrito is super rich and makes Chipotle burritos look like something ordered from Taco Bell. Also, I love that they grill the tortilla after everything is made, it only adds to the taste.  I think what I had was much more flavorful than Los Guacho's.The service was minimal, but everyone was very polite."], ["Ryan K.", "Ah Hass, I met you during a Yelp elite event and from there the fondness has grown. Here you'll find delicious Mexican food and at a price that your wallet will declare is 'nay but a scratch.' Since that fateful first visit I've been back on several occasions for either lunch or dinner. It's really hard to go wrong with their menu. The burritos are fantastic (the Hass one in particular is worth a try), the fish tacos are an obvious go to, and lastly another favorite of mine are the Al Pastor tacos. As you can see from some of the pictures posted here despite the reasonable price you get food that looks excellent, has a varied and delicious flavor profile, and the ability to mix and match a bunch of different items via their a la cart style ordering.The atmosphere at Hass is also pretty cool. It's clean but casual and they'll sometimes have a soccer match going on their big screen for you to enjoy. The staff is very courteous and all in all the place is a fantastic experience. I'd suggest giving this place a try as soon as you're able."], ["Tyler S.", "I love this place. It is a gem for the area that it is in which is a bit like retail/chain madness. If you go here, order tacos. Don't roll the dice on a burrito or on any other menu item, they are known for tacos, so order tacos. If you don't like tacos you are crazy and shouldn't come here anyway. The guacamole is expensive but delicious. The margarita's were pretty on point as well. The staff is nice and friendly and it has a very family centric vibe going on behind the counter. I go here once a month."], ["Naiying C.", "We tried the cactus taco and I thought cooked cactus would be mushy but it wasn't! it's worth trying if you are curious.Also had the burrito hass with pastor and I'm pretty sure this 6.99$ burrito weights 1 lb.! It's the heaviest burrito I've ever held. What I liked: the slight crunchy tortilla, yellow rice option and the avocado sauce that came with it. What I didn't like: toward the end of the burrito got more and more salty! It made me super thirsty at the end, too much salt. P.S- the interior is quite nice!"], ["Munch B.", "Awesome place. Nice food,margarita . Got to try burrito hass and taco verde(cactus with onions and potato.."], ["Rachael B.", "This place is great!  I pass this place a lot and finally tried it. Now I'm mad at myself for waiting so long. I'm happy to have 3 favorite places to eat at in this parking lot now.I like to order the tacos to go, expect some extra wait time because everything is fresh.  My husband & I were served nachos while we waited and they were awesome! It was a pleasant surprise but I don't mind waiting for good tacos. Nice menu selection that isn't overwhelming. Gordon Ramsey would be proud!"], ["Justin J.", "Absolutely delish.  Well presented and flavorful.  I will be back here at some point, but it is definitely top 5 in Columbus.I ordered to go which I picked up within 10 minutes.  Prepared quickly and still presented well.Fish and chicken tacos were the choice.  The guacamole salsa on top is very good as well. ."], ["Ram H.", "This place is very authentic and has excellent Tacos and Burritos.  The owner takes the time to explain the various foods and makes you feel at home.  It is very simple so don't go in expecting a fancy place, just great food.  It's no problem to bring in kids."], ["Michael N.", "We had tacos Al Pastor and the Burrito Pecheron. The tacos win. Hands down. Burrito was good but no match for the tacos! And loved the hot sauce in the mustard bottle. Milder but tasty!!"], ["Chris T.", "Great lunch spot for me in Dublin just off the freeway. Quick service, you only wait as long as it takes to cook your tacos! The burritos are really good too. They can be similar to size and construction as Chipotle, but have the extra grilled taste and crispiness (sp?) to the shell. I wish they had some sides or chips, but that just gives me an excuse to order an extra taco, which is fine by me."], ["Jennifer E.", "My husband and I just found this a couple weekends ago, and wow. We actually went back the next day so we could try more items on the menu.This place is very much like a taco truck and do not expect the normal Americanized Mexican food choices.  So far we have tried the majority of the Taco variations - the al pastor is by far the best, with the pollo a close second. I really enjoyed the fish taco - though we have yet to try to shrimp taco due to a newly discovered shellfish allergy. My least favorite is was the pulled pork - just not at the same level as the rest of the tacos. The taco verde (cactus and potatoes) was a really delicious vegetarian option. The quesadillas are fantastic as well. I personally wasn't too impressed by the Lorenza, but my husband thoroughly enjoyed it.Pretty much there's not much you can go wrong ordering. We have yet to try all of the menu choices, I think the Papa Caliente is the next on our list to try. I would have to say this is probably the best food I have had so far this year and have already started recommending it to all of my friends."], ["Matt V.", "Wow! The food here is so fresh, and so delicious. The tacos are fantastic. The salsa has great flavor and just enough heat. The burrito is huge, and delicious.The tacos are on the small side  - expect to eat at least 3-4 for an adult. Try the fish taco. You won't be disappointed.I'll be bringing friends here often."], ["Katherine B.", "Mmmmm. So good.I had a burrito logo with al pastor and pinto beans. It was a little heavy on the beans but I think that is just me....they are the first beans I've eaten in about three years. So probably most would find it perfect. My husband had Papa Caliente.....loved it.We will definitely go back....and pretty soon, too. Can't wait to bring my sons here next time they come home!"], ["Maureen O.", "cheaper than Los gachos. simular culinary gist as los gachos. I got the fish taco, shrimp and el pastor. garnished with radish and pineapple. it was good.the setting was subpar. there was food on the floor and the tables were not wiped clean. the lighting was overhead fluorescents which I'm pretty much always against if at all possible and were bleh and made it easy to see the dirt. we were there at the end of the day where they literally hosing down the stainless steel hood and grill. like, literally, with a garden hose. I'm sure this is typical protocol but I'd rather be in the dark about such procedures b/c I'm a squeamish wimp.best part was the name which is reminiscent of the college friends I went with- one who's nickname was hoss. food was fine, price was better but won't be back."], ["Dan B.", "The most authentic Mexican food I have had this side of the Mississippi River. Wait, which side of the Mississippi am I in . After 30 years in California it has been hard to find authentic Mexican food. They have it here. The tacos are the real deal and delicious. Service is very friendly and the prices are good. When back in this area, I'll be back. Mui sobrozo!!"], ["Holly C.", "First of all, the tacos here were delicious!! I like that for some of them, the tortilla is pan fried/grilled a little bit to give it a nice, crisp texture.I tried each of the tacos: carne asada (beef), al pastor (marinated pork with bits of pineapple), carnitas (pulled pork), pollo (chicken), fish, and shrimp. There is also a taco verde option which I assume is vegetarian, but we didn't get that.My favorites in order:  al pastor, carne asada, pollo, shrimp, fish, and carnitas. I probably wouldn't order the carnitas again because everything else was much more marinated and flavorful than the carnitas one, which I unfortunately ate last so it was a bit anti climatic. Everything else was so good though. The meats are tender and juicy. I didn't try anything else, but the horchata was awesome! It's a nice little family owned place, and the owner was so friendly when we walked in. They've been open for about a month now, and he didn't recognize us so he knew we were first timers. He chatted with us about the menu and recommended that we try the tacos first. Guys, it's service like that, that will keep your customers and patrons. I bet that everything else on the menu is great as well. I saw that they serve alcohol too, for those that want to enjoy a drink or two with dinner."], ["christin b.", "Just came in for some tacos before heading to work. This place is new and have been wanting to try it for awhile now! I got al pastor (pork), carne asada (steak), and a fish taco! They were all so good and filled with goodness! When you first sit they give you a lil bowl of beans with bacon. It's really tasty. My favorite taco was the al pastor! It had such a good flavor and it was topped off with a mango salsa!! Yummy!! My new fave! I most definitely will be here again!!"], ["Mailin Y.", "Awesome tacos. Carnitas and fish taco were a highlight. Great margarita. And Israel, the owner, was super friendly and helpful. Will definitely come back. Rivals anything in LA."], ["Russ F.", "Great Mexican food . . . fresh and flavorful . . . and fast service.  The downside is they have no air conditioning (or if they do, it hardly works).  Eating in sticky heat may be the ambiance of Mexico, but it takes your appetite away.  For take-away, however, I'd recommend this restaurant!"], ["Jason K.", "Went in for lunch to grab some tacos. I ended up trying both the carne asada and the carnitas taco, as well as a quesadilla. Things were tasty overall but this wouldn't be my first choice for Mexican in the area. Chips and Salsa were good but they cost extra."], ["Toni C.", "The best fish tacos! The environment is nice and everyone is very friendly! One of my favorite places for Mexican! I highly recommend it!"], ["Paul F.", "Second trip and it was better yet.  The owner is just a peach of a guy and whether he remembered me or not, he sure acted like he did.  Wifh he was a little closer!"], ["Joel S.", "The food was fantastic but one of the guys who came around to see how everything was made a fat joke at my expense. :~( I didn't put him in a Camel Clutch and break his back like the Iron Sheik would have. I chalked it up as \"lost in translation\". I have since gone back and no one has called me fatso or anything.The food is really good."]]}