{"Moshi Sushi Bar": [["Carly W.", "My husband and I tried Moshi Sushi last night for the first time. We have just moved to the area and have been busy sampling the abundant food options. A friend accompanied us to the restaurant, which was crowded and noisier than I would have imagined for such a small place. I would give the place 3 stars, except the scallop roll saved the day and warranted the 4th star. The rolls are small, about the diameter of a quarter, and only six pieces. The spicy tuna roll was full of flavor, though the spicy salmon I found bland. The rainbow roll was about as average as possible, but hot damn, the spicy scallop roll was out of this world. Fresh, decadent, and unbelievable umami. Miso soup was okay. The house salad was teeny, but the tropical miso dressing shined like a star on the palate. We'll certainly return to try more options (and more spicy scallop rolls, good lord the spicy scallop rolls....)."], ["Allison B.", "Maybe tonight was just an off night for this place, but my husband and I left disappointed. The servers were polite and friendly, but they looked extremely harried- constantly running- yes, I actually saw one running- back and forth. We were seated right away but told that the kitchen was backed up- 25 minutes for food and 45 minutes for sushi. I don't think ours actually took that long, but the table across from us really did have to wait a long time and complained. The atmosphere was nice- we chose to sit inside but the patio looked especially pleasant. Now for the most important part, the food:House salad- small with a miso citrus dressing. Would not recommend. Spring roll appetizer- this consisted of one skinny spring roll cut into four pieces. The inside was very processed looking. The dipping sauces were good though!California roll- standardly delicious. Yum!Trio tataki- the fatty tuna was excellent, white tuna was good, and Kobe was fine. The fish was very fresh and we would highly recommend this!Beef yaki soba- I did not care for this at all and my husband had them remove it from the check. I think this was a personal preference though and was grateful that they removed it. My husband thought it was rather bland but ate his portion with some spicy mayo added. Overall, we noticed that most people got sushi, and the sushi was our favorite part of the meal. Other than that it was too expensive for the meh quality appetizers and entrees. We have not yet found a Japanese restaurant that we really like here in Columbus, but we won't be going to this one again."], ["Monnie S.", "Always a reliable for lunch in Bexley. I'm not a raw fish sushi fan, but the vegetarian options are delicious. Aside from sushi, the rest if the menu provides many great options. My favorite entree choice is teriyaki salmon. lunch pricing very affordable."], ["Daniel B.", "Good but over priced sushi.  Not the biggest rolls either.  The taste is top quality,  though.  I like to go on Mondays and Tuesdays from 5-6 as they have 1/2 price sushi"], ["Tammy A.", "My sister first introduced me to this place. I liked it a lot after my California roll. We usually get the food to go when we come here. I will update this review once I have actually eaten inside the restaurant to get the full experience and service of Moshi Sushi."], ["James B.", "First time and was impressed with service and food. Had the cold tempura udon and it was great. The appetizer of dumplings, I would call gyoza was very good. Would recommend to anyone"], ["Raul A.", "Great service. I sat alone at the bar (forever alone, LOL) and got to watch TV, mess with my phone and watch the sushi chefs.My sushi was excellent.  It's a tad pricey but I ordered 2 of their signature rolls, so that's expected.  I also enjoyed some saki on the side.  I'd definitely visit again if I'm ever in town."], ["Shea H.", "I was getting my car serviced nearby so I walked here to feed my famished belly.  I walked in right before 2pm, forgetting that some restaurants close after lunch time.  I was told that I would need to get my order in quickly but, for some reason, it didn't dawn on me that I might be holding everyone up.  I put in an order for udon and asked if it might be possible to have the shrimp replaced with tofu.  They obliged and maybe 10-15 minutes later, my order arrived.  The waiter even brought me some extra spices that he recommend I try.  The noodles were delicious.  It was mid-noodle that I realized that no one else was in the restaurant and the employees were relaxing and cleaning.  Crap-- this place is closed, I realized!  Well the staff, in no way, made me feel rushed or unwanted-- which I thought was very nice of them.  Outstanding service and really delicious food!  Go get some-- but check the hours of operation first :)"], ["Sara C.", "It was my birthday again last week, and it had been a few years (unfortunately) since we'd treated ourselves to Moshi, so we set out to Bexley on Tuesday evening.  There's no getting around the fact that the entrance from the interior parking lot is going to be a little awkward, but we were quickly welcomed and seated.  On Monday and Tuesday, basic sushi rolls are half off, and many drinks are just $5.  The boy ordered the usual Berry Blossom, which now comes in a short stout glass with diced strawberries and a berry skewer.  The restaurant offers a free sushi panini on your birthday, and since we hadn't tried it before, this was an opportune time.  We were both a little skeptical about it having read the description in the menu, but after trying it, we are definitely converts.  The crispy rice, the flavorful salmon, the avocado -- the blend of ingredients was unusual but the flavor was great!  For dinner, we went with sushi -- a Philadelphia roll, a spicy tuna roll, an eel roll (all half price), salmon nigiri, and splurged on the Scarlet Craze.  The basic rolls were good, the salmon nigiri was exceptional, and the Scarlet Craze, though it carried a hefty $17.25 price tag, was worth every penny.  Taking into consideration the happy hour specials, our bill came to about $55 including tip.We have been to quite a few sushi places in Columbus during our 3+ years here, and Moshi is the best of them when you take into account the quality, service, and ambiance.  We have never felt snubbed or condescended to here; the service is polite, attentive, and cheerful.  Granted, prices are a little more than we can afford, but that makes the occasional trip to Moshi even more of a treat."], ["Mark K.", "This is a decent sushi place, but seems to be more about location and decor than stellar food.  I mean, it was fine, but not great, and for the prices I would expect great...My sweetie and I shared several rolls and an app, the seafood spring roll.  The spring roll was fair, but almost egg-rolly and incredibly small.  The spider roll was very good.  The California roll was good too.  The spicy salmon roll was meh.  All ingredients seemed fresh, but nothing really leapt out and the rolls were pretty small.  We stayed away from their specialty rolls because- wow!  I don't expect a cheap meal when I order sushi, but the prices are steep for what you get.Service was slow, but otherwise friendly and helpful.  This was odd since they were barely half full.Hey, at least Jeni's is right next door for dessert..."], ["Jared E.", "I figured I'd write an update since I've been here more so many times since my last review and haven't updated.  Wow, what a wonderful night in Bexley it was.  It was a cool 78 degrees and I met two of my good friends for a Sunday night sushi dinner, sitting down on the patio at 7pm tonight.  As always, everything was top notch and just as perfect as it gets.One thing I love about their sushi here, and each time I come back I remember, is that they don't *overdo* the rice on the rolls.  There is always just a thin layer of rice--it's all about the main ingredients here, ie, the fish.  It's always fresh and served cold like sushi should be--and tender, it just dissolves in your mouth, you never have a \"chew, chew, chew, spit-in-to-napkin\" episode when you eat the rolls here.  It's truly amazing.I started with a tempura appetizer and some hot sake.  I later switched to a healthy pour of really good viognier and had the crab/seaweed salad which is definitely 2DF (to die for).  For dinner I had a spicy tuna roll, california roll and a rainbow roll.  The rainbow roll here is absolutely the best I've ever had.  So much care and pride is put into the sushi here--it's nothing but a passionate art, and I almost feel guilty eating David's (the sushi chef) creations because they are so perfect and beautiful.The couple I ate with tonight are also regulars.  I've taken others here before and people often complain about the wait for the sushi.  Well, what you wait for is what you get.  And, what you get is good.  Enjoy your company, order some non-sushi appetizers and kick back with some sake, a house cocktail or a great glass of wine and just relax."], ["Stephanie P.", "Stopped by this place after a family outing. The service was extremely slow. We just ordered basic sushi, California Rolls and Miso soup and it was a forty minute wait. The food was decent but didn't outweigh the wait after a long day."], ["Luan N.", "S=Subjective O=Objective A=Assessment P=PlanS: I was quite hungry and lonely on a cold Friday night. Decided to take a quick escape to Bexley to elevate my mood with some chill beats and tantalizing food. Japanese cuisine is my comfort food, but I wanted a bit of a twist to keep me guessing and my heart pumping. I seated myself at the bar. The setting was lounge/contemporary.O: Temp 97.8 P 101 Food: Sushi panini $8.95           Trio Tataki $14.95           Kobe steak salad $19.95           Tuna nigiri $2.75           Salmon nigiri $2.50A: I thought the plating and presentation was unique and well done. Service was excellent. Kobe steak  was blow torched in front of you and the truffle vinagrette dressing was a pleasant surprise. The sushi panini was just unreal. The crispy coating on the outside with the delicate melt in your mouth salmon on the inside was my favorite dish of the night. I ordered the nigiri to gauge the freshness and quality of the unadulterated fish. To be honest, was not the best showing, and overshadowed by the other dishes. But will mention, this also holds true for my fave jap fusion restaurant in Chicago, Macku. P: My Category A recommendations- I would try the starters and entrees. There are quite a few twists to the classics which you will not find anywhere else. And don't forget the sushi panini! Looks like 1/2 price sushi on M,T 5-6:30pm"], ["Ryan S.", "Always ask for belly. It's a chef's secret. The bartender makes a mean manhattan -- perfect for the end of a long day. David has brought a gem to Bexley, play your part and come admire it."], ["January B.", "My boyfriend and I are not from Columbus and stumbled into this restaurant after eating at Jeni's Splendid Ice Creams next door. We were expecting just a regular Japanese reasturant but got much more.The non-sushi menu is small but impressive. They have taken a lot of non-traditional Japense items and reimagined them to fit their restaurnt. For example, they have Japanese fish and chips (served with sweet potato chips)!We had the most unique and impressive item on the menu, the sushi panini. It's two \"panini slices\" of rice that is panko-crusted on one side and has nori seaweed on the other. In between that, for the \"sandwich filling\" is creamy avocado and your choice of fish, we went with salmon. It's served with a sweet soy dipping sauce. Talk about delicious!We also had the seafood spring rolls, chock full of fish and served with a sweeter chili sauce and a wasabi mayonaise. This was less impressive, we felt like the filling was a bit dry and could have actually used more vegetables in it.We also had what we called their fancy miso soup, which had spinach, scallions, and clams in it. It actually has A LOT of clams in it, enough that we just split a bowl and we both had about 3-4 mussles each! The price was only $4.50 for the soup, which was very fair.Overall, we enjoyed the food and felt the waitstaff was very nice and apologetic of the wait. We would have liked to try the sushi, but wound up falling in love with the sushi panini, so it all worked out! We will definitely go back again if we're ever in the area.Important note: It will serve you better if you make a reservation before going. We went on a Sunday evening around 7 PM and had to wait about half an hour before being seated. We were then told that sushi would take about 45 minutes to be served, due to all of the carry-out orders and other customers in the restaurant. We ordered off the kitchen menu instead and didn't have a long wait at all."], ["S L.", "I came here for lunch a couple of weeks ago with my boyfriend's mom.Great food, but very slow service. I wouldn't come here if you have less than an hour or two for lunch.My tempura and chicken teriyaki were delicious!"], ["Roab P.", "Expensive for what you get but the quality and service is some of the best in columbus for sushi.The lunch bento box it the way to go for a sample of everything."], ["Ralph B.", "My wife and I started you for Guiseppi's, but it was so crowded, we left.  We had driven by Moshi, and like sushi, so thought we would try it.  It was pretty full, but we got seats at the sushi bar.It was a cold night and we were surprised to see hot pot bib bimmbap on the menu.  Actually there are several interesting options I wouldn't have expected.We started wit edamame and the bib bib bap.  The edamame was good, the bib bim  bap outstanding.  We followed these with three rolls and some fresh salmon nigiri.  All were good quality, not large but nice presentation and seemed very fresh.On a suggestion, we tried the tuna panini.  Really interesting and pretty good.We will definitely go back.  Everything was good and there are lots more to try.  I would readily recommend it to anyone."], ["Wallace K.", "Weather was so bad on Valentine's day, my girlfriend and I, residents of Bexley, canceled our dinner reservations up at Polaris. We decided to take a chance to see if we could get into Moshi since it was down the street from our house. They found a way to get us in with almost no wait, as busy as they were. (We should have just made our reservations there!) We are repeat customers so we knew to get the spicy tuna and spicy crab paninis. We had a combination of rolls that were delicious. After this experience, I realized I was overdue to post a Yelp review in their favor. So, I came here and I read some comments that it is pricey as a complaint. It isn't cheap, but it is not that bad when you are talking about quality sushi and other great eats. My suggestion is, that if you are looking for cheaper high quality sushi, check out Moshi's happy hour specials on Monday nights, or if you just want cheap, go to Kroger. Every time I have been there the service and food have been top shelf. I love the decor, and my girlfriend always pops a smile when I say, \"Lets go to Moshi\"Moshi is now on my top ten list of restaurants in Columbus, and definitely number one for sushi."], ["Bethany K.", "My husband and I have dined at Moshi several times...  It was quickly becoming a favorite until this past evening.  We had to wait for a table, which was fine because we didn't make a reservation.  Once sat, that was it...  Nobody acknowledged us..  We didn't even get water.  After about 20 minutes (they were busy, so we waited longer than we usually would have), we got up and left.  A server said, 'thank you'. I'm pretty sure we wouldn't have ever been served.  :-/"], ["Angi K.", "Cute place with good sushi. The rolls seemed slightly small in size for the price, but the food quality and taste were great. Highly recommend their tuna roll."], ["Christina K.", "So to start, I can't say that I can give the best sushi review since I don't eat fish, but we stopped in here between Jeni's ice cream tastings for dinner. My coworker, who does eat fish, had no complaints. I had the veggie roll, a house salad, and the avocado roll.All were good, standard, and at happy hour prices, couldn't be better. The service was super attentive, the place is nicely renovated/decorated, and cozy. I saw the chef going around tables and waving at people and customers giving him props, so it seems the type of joint where people come back often.Parking is in the back!"], ["Irina D.", "I was waiting for AAA to come start the car on a parking lot across the street, so I took a carry out.  The service is very friendly.  I ordered Rainbow Roll, it contained six tiniest pieces, two of them covered with shrimp rather than raw fish.  It was done nicely, very fresh.  I was surprised by the size, so now I looked up Raibow Roll, and it contains at 8-10 pieces, not six and not a single image of Raibow Roll anywhere showed shrimp as cover, all of them had fish on top.  So I imagine this place is somewhat overpriced or cutting corners comparing to places I normally go to."], ["Dennis L.", "Moshi has been on my \"restaurants I want to try\" list for a really long time, so my hopes were pretty high.  Maybe too high.  The initial impression was good, as the tiny restaurant has interesting art and fixtures, and the glasses are neat, but it went downhill from there.Mostly, the food here is just overpriced.  My wife and I paid more than $36 for five little pieces of nigiri, three unusually small rolls, and two bowls of miso soup.  At most sushi places, when you order a combo, as I did today, you get both miso soup and salad, but here you have to choose.  I had to pay $2.50 extra for my wife's soup, even though the two rolls she ordered were more expensive than my combo.The food ranged from average to no good at all.  My nigiri tasted almost exactly like it does at every sushi place from Columbus to the West Coast to Tokyo, which is to say, good.  My wife said her banana roll had no flavor and was like \"mush,\" but added her O-H-I-O roll was good.  I was hungry again less than two hours later, and I'm a light eater.But I'm not coming back here.  Not when Akai Hana, Mr. Sushi, Edamame, Tensuke Express, etc. etc., are all in the same city."], ["Iris C.", "This is another sushi bar that I tried while on a Food Hop. The entire group really seemed to like it. I loved the atmosphere and the music playing was great. Kind of a mix of current CD101 type stuff and 90's hits. I loved the sushi panini! Totally unique and really tasty. The service was fantastic, and I'll be honest, they won me over with their Andy Warhol appetizer plates."], ["Corey G.", "Great sushi.  Great location.  Staff is fantastic...service can be a little slow.  Love the patio."], ["Andy W.", "Since I usually get take out, I'll rate that experience. They get the order right about 50% of the time. They can do different things in the kitchen with special request depending on who answers the phone. Food is adequate by the time you get home and eat it...which is always 20 minutes longer than you were told it would take."], ["Ashley M.", "I just waited over an hour for my sushi.  Apparently they lost our ticket, and then didn't bother bumping our order up once they 'found it.' We complained to the manager and the server and managed to get 20% off. I was disappointed by the service. The rolls were decent but not sure they were worth $18 each and the wait.After my friends and I paid $20 each for our sushi appetizers, we were still hungry. We went down the street to grab a pizza. I wish I were kidding."], ["Andrew C.", "I'm a regular here.....especially for their lunch special.  Love everything i've ordered here and everything seems very fresh."], ["Eugene M.", "Went here last night with a few friends from work. Pretty decent selection of sushi and sashimi for Ohio.I got a dragon roll and spider roll which was very delicious and highly recommend the spider because of how fresh the crab tastes. The scallop roll is pretty good too.The decor is very elegant and upscale with very friendly staff.As far as pricing goes, it's fairly average for sushi except a few rolls are priced around $17 which is a bit high.Overall good experience and highly recommend if in the Columbus area."], ["Steve S.", "My wife and I love Moshi Sushi. Their lychee martini and mojito are great. We get lost of sushi, all of which is great. We particularly love their salmon and the shrimp tempura roll. All the servers are very friendly."], ["Jeff P.", "This is definitely the best sushi I've had in Columbus.  The fish is fresh and tasty, but portions are a little smaller.  However, I am fine with quality over quantity.  The edamame was tasty and the miso was delicious.  I love the quaint decor in this little place, but it does get crowded very easily."], ["Ariel B.", "The construction of the sushi at Moshi is absolutely beautiful and delicate-- the prices and flavors are not. I am always excited to try new sushi places on the outskirts of Columbus as I am constantly looking for hidden gems to frequent. Though Moshi is good, it was not worth the extra drive to Bexley for what it was. I would have given them another star as I did enjoy their drink menu, but was simply disappointed at the lack of diversity in some of their rolls. If I lived down the street I am certain I would probably return every couple months out of convenience alone. I do give them credit for knowing their audience as the menu certainly would suit the general customers of the area, but true sushi connoisseurs would ask for more. This review is based on a trip I made there a while ago, and I would happily change my tune should I wonder by and have a different experience."], ["Diana S.", "As far as sushi goes in Columbus, it's one of the best, and it's fairly priced. For 2 persons, we ordered 2 miso soups, the grilled calamari appetizer, jmynt roll, rainbow roll, spicy tuna roll, and paradise roll (total 53.00). We could have used one more roll or appetizer, but we were still satisfied. The sushi rolls I had were on par with Haiku. The large rolls are smaller than most large rolls (but they cost less than most large rolls), so you need to order more rolls than you normally would, which I sort of like so that you are not stuck ordering and eating one massive plate of the same thing. In my opinion, Haiku has mastered (ALL OF) their appetizers, and Moshi still has a little work to do (grilled calamari).  It was good and fresh with excellent accompaniments, just no Haiku (maybe a tiny bit overcooked). We ordered take out, and the server was very helpful on the phone when asking for recommendations, the food was ready on time when I arrived, and the staff was friendly when I came in to pick it up. All in all, a great experience, and I will definitely return."], ["Raeanna O.", "I'd been meaning to try Moshi since it opened, but never quite made it...I went for lunch, and must say I was not that impressed. There were two other tables in the restaurant, and our server was flighty, at best. She approached the table after we had sat there for 10 minutes to ask about drink orders, and when we stated we were sticking with water, she walked away without asking if we were ready to order or if we had questions about the menu. Once we had our questions answered, service was relatively quick, however, when I pushed a plate to the side of the table, she ran across the room to remove it, leaning across my sushi plate without saying a word, her shirt nearly touching my food.As for the sushi, I can see what other reviewers were saying about small portion sizes for the price. Initially, I thought $9 for two rolls was a decent price; however, I didn't realize the rolls would be the size of nickels in diameter, and the flavor was average, at best. The tempura roll was especially salty. My friend ordered her roll without wasabi, but was not pleased to see large gobs of wasabi within the roll. Additionally, her roll was $11, and she received five relatively small pieces for that price. When the server returned to our table to ask if we'd like anything else, my friend said, \"No, but...\" and was left hanging as she was hoping to inform the server of the wasabi error.Needless to say, I doubt I would return here. The nicest thing about the restaurant is the decor, and that is usually free. With several better establishments in the Columbus area, I don't see any reason to go back."], ["Patty B.", "When they first opened this was easily one of my favorite restaurants in Columbus -- awesome food and attentive service. However, I have been less impressed on my last few visits over the past year. Their sushi is among Columbus's best IMO, albeit a bit pricey for the quantity. I used to really enjoy most of their non-sushi dinner items, but the samplings that I've had from their non-sushi lunch items have been underwhelming. And there are some servers - although not all - who seem a little discriminatory towards solo diners (e.g., rushing you out by bringing the check right after serving your food, and without asking if you want anything else, and before delivering the check to groups who were served long before you; refilling the water glasses of the tables around you but not yours; seating you at the bar without checking on your seating preference, when the restaurant has several empty tables throughout the time that you're there). And no, the restaurant was not full or approaching rush hour during those times. I will probably be back sometime for dinner when I feel like I deserve a splurge, and I will hope that their food and service is what I fell in love with when they were the new kid on the block."], ["Andy P.", "The sushi is much better than a majority of the sushi bars around the Columbus area. The fish is very fresh and no roll is ever pre-made and the sushi chef's use nothing but the best pieces of fish. One of my favorite rolls is the Jmynt (pronounced jay-mint) Roll is a shrimp tempura roll with cream cheese and is topped with spicy crab salad.Another favorite of mine is the O-H-I-O roll. The dinner platters tend to be a bit pricey and the serving sizes on some of the entrees could be bigger. The atmosphere is relatively modern but I do not feel that the entire decor really flows well together. It is very laid-back and casual but by no means is a come in your sweatpants atmosphere.As stated earlier, it is definitely one of the finer sushi establishments in the Columbus area. I would recommend it to my friends."], ["Sandy M.", "I can't give the proper review a sushi restaurant deserves right now since I can't eat any fish right now. However, as a restaurant in general, Moshi Sushi is a great find. The ambiance of he restaurant is cozy yet modern; the staff are extremely friendly and helpful and the food is tasty. And, from 5-6:30, they have Happy Hour. Traditional rolls such as CA, spicy tuna, futomaki, shrimp tempura, avocado, etc. etc. are 1/2 price, which is $1.75-3.50 a roll! It really is a great deal. Plus, Bud and Bud Lights are $2 and the sake is $3. Really really good deal for a Japanese restaurant.Although I was curious about their sushi, we trekked it down to Moshi for their sukiyaki. We saw their menu in a local Columbus magazine and my husband went gaga for the prospect of having great sukiyaki with KOBE beef! Although the price of the dish seems hefty ($27), it had lots of filling and satisfying ingredients such as onions, nappa cabbage, mushrooms, scallions, tofu and udon noodles. It left both of us very satisfied. The presentation of the dish was great. It came in a casserole pot with all the fresh ingredients on top of a portable stove. The fresh meat was arranged around the marinade/broth in a very aesthetic manner. Once the broth started boiling, we dunked the beef in the sweet broth and savored every bite. I thought it was very good but my husband really wanted it in true Japanese fashion with a raw egg to drop into the broth. We figured it may be because of the risk of salmonella that they can't do this? All in all, the meal was good and the entire experience was great. However, I want to come back here when I can eat fish so I can give a true review that a sushi restaurant deserves."], ["Andrew S.", "dont see what the big fuss is all about. your pretty much paying for the location here and the owners rent. We (2 adults) ordered the 14 dollar roll and the 18 dollar roll expecting great things (sorry i dont remember the name and the website menu is all fuzzy). first off the 18 dollar one was a piddily 6 pieces, the size of half dollars, nothing big at all. and the taste was nothing to write home about. the other 14 dollar roll (sorry cant remember the name, was fried) was ok, but again the size was terrible. it was as big as a quarter. we also got 2 cheap rools , philadelphia and salmon, which were ok. We actually ordered another roll after all of this bc we still didn't feel like we had eaten dinner, which never happens to us when we get sushi. the reason i am giving it 2 stars is because the service was decent. i guess i am forced to go back to other subpar sushi places in columbus even tho those places arent the greatest either. but there at least u get a roll bigger than a pocket full of change. to sum up, moshi either needs to cut down the prices or increase the size of their rolls.chabba"], ["michelle k.", "i stopped by moshi sushi for dinner on a thursday night. i think moshi is the best sushi restaurant in columbus. the interior is clean & modern. the staff are friendly & the owner takes his time to walk around and speak to the customers. that's customer service. we ordered some sashimi and the seafood was fresh....the yellowtail was awesome. we also ordered the jmymt which is apparently their number one seller (i can see why) and the hurricane which is really light and fresh.alot of sushi restaurants are too heavy handed on their sauces but it was perfect @ moshi. you MUST order the sushi panini.  i know it sounds weird but damn it's GOOD. i can eat that all day long."]], "Akai Hana": [["Adam K.", "I visited Akai Hana 10 years ago at least two times, back when I was a sushi novice, just getting into trying new rolls, plain old sashimi, and of course, the good ol' nigiri \"special\" rolls.  I remembered thinking it was \"just okay\" back then, but what I remembered most was that I felt like it was \"very gourmet,\" but honestly couldn't remember why I thought this way.  After hearing more people talk and converse online about how it's \"the best sushi in town,\" my wife and I decided to check it out instead of going to one of our Columbus favorites (Sushi Ko or Sushi Ronin).  MAN, were we disappointed.So the \"gourmet\" thing I remembered?  After seeing the first rolls come out, I remembered why I thought this way - SO much sauce added to these things.  Service was fine, but they put a shit load of rice in their rolls, and it seemed as if the rice was a bit on the large side.  So either it was old, over-cooked, or over saturated.  In either case, one of the rolls had SO much rice on it, there was barely (and I mean BARELY) anything inside the roll.  One of the more expensive rolls we ordered was the Dynamite roll and we opted for crab.  I had no idea it was going to come out as a small roll with a ton of rice, and then crab - fried to death, with more breading than you can imagine - sitting on top of the meager \"special\" roll.  I also felt like their Sake selection was on the light side.  I don't need sake out of a wooden box (not to mention, they were out of one of them anyway).  I just want plain old, good sake that I can drink out of a shot glass... and then I want more.  Bottom line here, they get 1 star for pretty good service and another star for the \"okay\" ambiance, but it's nothing to write home about.  If you're looking for good sushi with lots of choices at a fair cost, check out Sushi Ronin in Dublin or Sushi Ko at Crosswoods in Worthington.  If you're looking for cute sushi with eyes made out of peas and horns made out of carrot straws with tons of rice and rationed fish, check this place out and write a review similar to mine after dropping $80.  Akai Hana is either living off their long-standing \"top rating\" or it has some sort of cult following that I can't understand, but in either case, they're clearly skimping on quality, hoping no one will notice."], ["Kaoru M.", "Akai Hana is probably your safest bet for Japanese food in Columbus. Their menu is mostly authentic, but they don't serve some of the crazier Japanese dishes that might otherwise scare away a novice. If you're not very familiar with Japanese food or sushi in general, this is a good place to start.That, along with the fact that it's located next to the only Japanese grocery store in town (Tensuke Market), makes this restaurant pretty busy. I've encountered wait times as long as 1 hour for LUNCH! If they had the space for it, this restaurant definitely should try expanding.If you come here for lunch, their daily lunch special is pretty neat. For around $11, you can get your choice of grilled fish or tempura along with california roll, dumplings or spring rolls, grilled meat, marinaded seaweed or octopus, miso soup, rice, and salad. Definitely very filling."], ["Dan L.", "All I can review here is the sushi, because that's all I had. They do have a full menu though, and some of the stuff other people got looked pretty fancy-delicious.We just ordered a few rolls and individual pieces of Nigiri at the sushi bar. They've pretty much have every kind of sushi you can think of so you're sure to find your favorite. While salmon and tuna are common orders for me, I also got some tako(octopus) and surf clam which were some of my favorites. Be adventurous and order a lot!"], ["Rebecca S.", "My boyfriend and I aren't from Ohio (Alaska and Minnesota) and were worried we wouldn't be able to find reasonably priced sushi that still delicious. We were pleasantly surprised! The wait was a bit long (45 minutes for a table) but definitely worth it. The Dragonfly, Rainbow and Red Dragon was what we ordered and we couldn't decide which was tastier. The staff was very friendly and I loved watching them hand roll our food while at the bar. It has quickly become our favorite sushi bar!"], ["Eileen A.", "Love the food and atmosphere. Place was crowded which is a good sign. Fresh sushi and delicious ramen. The bulgogi was also amazing!!"], ["Amber S.", "Small restaurant in a shopping center that may have the best sushi in Columbus, but they're aloud to be in a shopping center, because the food is fantastic. The service is great, the sushi is amazing, the prices are decent. The hot saki is very good. It is also nice for a group, they have a private room that comes with good service. I make reservations because if you don't on a weekend, you will end up waiting."], ["Sherman C.", "What can I say more! Extremely authentic Japanese Food! I had been there several times and every single time I came out their restaurant with great satisfaction in my belly. I particularly love their Spicy Scallop Sushi, some spicy mayo plus big fresh scallop. This combination is DIVINE! Aged-Tofu is nice for appetizer! Other dishes are great as well! Can't complain! Great customer service! All of the servers are Japanese lady, they are very polite and friendly! Highly recommend to anyone who loves Japanese Food and great customer service!"], ["Michelle S.", "I would have to say this is my favorite sushi restaurant in Columbus next to Edamame...but those are comparing apples and oranges with completely different styles. Both delicious. Edamame has creative and more Americanized sushi whereas Akai Hana is more fresh and authentic...anyway this is about Akai Hana so back to my review.4 stars for good service, the staff is always helpful and friendly no matter how busy they are and  most of the food is good, what keeps it from being 5 stars is because a lot of things didn't really \"blow\" me away.Their ramen is good, soba noodles with fried shrimp is good (but who could mess that up?) love the dynamite roll, jalapeño roll, scallop roll, and I think the yellowtail roll (forgot the name). Can't go wrong.The bibimbap and sukiyaki is okay, I've had better.But yeah, this place is definitely for sushi lovers. Now I'm having cravings!"], ["Erin N.", "This is by far, the best sushi in Columbus. Yes, I know how that sounds, but it's so true. Unfortunately for me, it was the place I discovered I loved sushi, so when the craving hits, no other place will do. If you're going for the first time, a call ahead reservation will be helpful, especially if you plan on going during dinner hours on a weekend. For sushi lovers, I recommend the spicy scallop roll, rainbow roll, and for you eel lovers, the Buckeye Roll.For sushi beginners, the Harvest Roll is amazing. Yes, there's no actual meat in there, but the roll is wrapped in rice paper, so the texture is more mild. If you're a little more adventurous, go for the Red Dragon. It's shrimp tempura inside, and salmon on the outside.For non-sushi folks, the bulgogi, ramen, or grilled tofu are also great bets.Now, appetizers. Guys, you gotta try Negima Yaki. It's life changing. Thinly sliced beef wrapped around scallions, cooked, and covered in a light sweet/salty teriyaki sauce. SO. GOOD.I really don't have anything bad to say about this place, because I've never not thouroughly enjoyed each visit!"], ["Niheala R.", "My husband and I go there often. I highly recommend the scallops!!! They melt in your mouth. We also get the dragon roll. Nice combo crunchy tempura with tuna that is sinfully good. I could eat there once a week. Or twice or maybe 3 times."], ["Amit I.", "Nice setup. Food was ok but I was disappointed somewhat as its looks more promising. The 5 stars reviews are way out of range and justification. 4 is \"maybe\" when nothing goes wrong but 3 is truly the level of restaurant. Whoever give 5 never visit restaurant other than McDonald level....."], ["Olivia D.", "I have eaten sushi all over Columbus and Akai Hana is the best! The regular rolls are just as good as the specialty rolls and very well priced. The staff is incredibly helpful, the atmosphere is heavenly, and I want to eat this sushi for the rest of my life.  I recommend the eel roll, spicy shrimp, and spring rolls.Only thing I wish they had is calamari!"], ["Tiffany C.", "We ventured to Akai Hana for a dinner date with some friends. Akai Hana was very cordial in accommodating our slightly large group, which by the way they take phone reservations, which are great on a Saturday evening, because this place is hopping!Our waitress was extremely nice and extremely helpful to those in our group who have never had the pleasure of eating sushi or sashimi. She was also well spoken and didn't rush us when it came to ordering. I can't remember everything our party got, but I will tell you... the Dragon roll.... Yes, I know it's americanized, but it was the BOMB. It was so good. Definitely worth a try. Something I will note, and I don't know if this is traditional, or not, because I'm no sushi expert by any means, but the pieces of sushi (not the rolls) have small traces of wasabi under them. A total surprise factor for those who may not treasure the taste of wasabi. It's almost like a joke to watch those unsuspectingly munching into a nostril inflaming surprise. Overall, the fish was of good sushi quality. The Sashimi we ordered was like butta'. It just melted in your mouth, so definitely some pluses towards that. Akai Hana's pricing might make some cringe, but for the options we have in Ohio.. it's unfortunately the price we pay for not being directly on a coast."], ["Tony S.", "Wasn't impressed by this place. Came here with a large group of 12, service was moderate, not good not bad. I tried many things from my friends, but I can't list everything because I don't know what they were. Ordered the honey roll, didn't taste the craw fish, and couldn't tell the salmon was smoked. Also ordered Wakame and sadly was my favorite part, but it's pretty hard to mess up seaweed in sesame oil.If you think cream cheese and spicy mayo makes good sushi, then this is probably the place for you. My date's roll came with some intricate sauce display, was interesting, Mine was just a normal looking roll. But overall for our table I can say the presentation was sloppy. One dish, what i believed to be a roll, looked like just a giant ball of spicy mayo rice fish and more spicy mayo in aluminum foil.My friend next to me ordered a soup entree, couldn't tell you what it was, but I would never order it. Comparing it to a good bowl of pho, the broth was comparable to watered down Swanson. Not to say anything I tried was bad, but overall the experience was boring, dull, and the food plain.Last me and my date felt a little nauseous for 24 hours after the meal. I rarely get sick, and had to drink plenty of water to prevent from upchucking. It didn't influence my review and I can't know for sure if the restaurant is to blame, but since we both had the same symptons, I do think it was from their fish or something else."], ["H C.", "Have been here twice and was happy with what we got. It's a really nice Japanese restaurant actually run by Japanese people, with both authentic and Americanized Japanese food. Might not be as competitive in other cities with a bigger Asian/Japanese community, but definitely better than other fake Japanese restaurants here in Columbus. This is Ohio after all. Will come back more."], ["Thomas L.", "This place has the best sushi in Columbus hands down. The service here is always top notch and the food is a step above that. I have been here multiple times and I have never had anything that wasn't delicious I would give a recommendation as to what to get but I don't want to retype their whole menu."], ["Andrea L.", "My suggestion to conquer this heavenly excursion through delicious Japanese food is to come with friends. There are simply too many delicious options to choose from- and hard to pass up at that. Not to mention the option to substitute brown rice in any roll! The presentation is spectacular and every time the waitress would come around with another roll I couldn't contain my excitement.The nigiri here is delicious, but they also feature tons of specialty rolls that can get pretty fancy- so I'd suggest ordering at least one of these when you come here. Or 5, whichever. My favorite roll was probably the Buckeye. That topped with the eel nigiri made for an unforgettable Japanese experience.I also got the spicy scallop roll which was an explosion of spicy mayo sauce. If you're not a fan of mayo like me, I wouldn't recommend this one. I hear there's a pretty big weekend crowd- understandable, it's probably the best sushi around town- but we went around 9 on a Friday night and it was pretty empty. Well worth the wait!"], ["Kazz Q.", "Awesome bento selection and very authentic Japanese cuisine. This place is worth driving to for a day trip to Columbus. So far I've tried miso soup, salad, Japan special bento, nigiri sushi, and the special lunch box. You get a really filling meal of different dishes in one nicely presented box.  I've had Japanese food in Cleveland and Columbus and this one is the best overall for the wide variety of authentic real Japanese food, consistent quality and quick service."], ["Mackenzie F.", "Everybody raves and raves about this place.  It's fine I guess, but not great.  I've had the shumai, vegetable tempura, and spring rolls, which were all ok but nothing memorable.  The sushi/sashimi/maki is really what brings it down to 2 stars.  Too much rice on the maki rolls, and not enough fish.  Chirashi was not great-- fish didn't look/taste all that fresh, and the rice in the chirashi was a bit water-logged and super sweet.  Side note, I ordered the \"deluxe box\" option for sake, and I think the server thought it'd be nice to give me extra... so the box just sat in a puddle of sake, and every time I went to drink from it, I would get sake everywhere.I like Wild Ginger in Hilliard a lot more."], ["Shuo F.", "I've been eating here for years!  I can't believe I never wrote a review for this place -__-;;  Akai Hana is located in the same plaza as Belle's Bread and Tensuke.  I'd have to say that Akai Hana is probably the best sushi place in Columbus.  The restaurant is spacious but always packed, so remember to make a reservation if you don't want to wait.  Their chefs are very skilled and could make anything taste good!  When I go, everything looks amazing and I always end up ordering more than I can eat!  My go-to dishes are Ramen, rainbow roll, and spicy scallop roll.  I'm only giving this place 4 stars because I don't think their Korean selections are as good as the Korean restaurants around Columbus."]], "Sushi Ko Japanese Restaurant": [], "Edamame Sushi & Grill": [], "Haiku Poetic Food & Art": [["Lea P.", "I never expected that the first time I ordered something other than sushi here would be my favorite visit. The sushi is pretty solid and the specialty rolls creative, but I need to give a shout out to the bonzai udon noodle bowl. It's a huge, hot bowl of noodles and veggies, and it set off my sashimi appetizer wonderfully.The other thing I most love about Haiku is just how goshdarn pretty it is. Whether you sit inside or outside (weather permitting), the space just feels like its name, like a haiku. Don't ask me to elaborate; just notice it when you're there.The parking situation is much more favorable if you go at lunch. Drive on in to the private parking lot and get yourself a spot. I came for dinner on a Tuesday night, though, and didn't realize there was a valet until it was too late. I can understand it on a busy weekend night when the parking lot overflows, but it's more than a little annoying to hand your keys to someone and watch her drive it five feet to the parking spot.As I said above, the sushi is good, but even while looking at the menu now (which is usually good for sparking my memory), I'm not recalling which specific rolls I've had. The white kamikaze, maybe? I know I had something with sriracha once. It comes out looking as pretty as the restaurant, and you're unlikely to be disappointed. You just might not remember what you had a few months later."], ["Lisa P.", "So I've been wanting to try Haiku for a long time and today I went for lunch with the coworkers. I was underwhelmed and disappointed.The decor is typical sushi place decor. Low lighting, instrumental music, etc. What turned me off a bit was the smell. It smelled sterile and weird but we were the first ones there when they opened so maybe they had just cleaned. Anyway, it's clean and overall a fine space.For lunch, they have complimentary soup and salad. The miso soup was ok and the salad was great with a soy-based salad dressing. Each of us got sushi rolls. I had the High Street roll with cream cheese, salmon, tuna, avocado and spicy mayo. All of my favorite things in one roll! It comes out in six pieces so not a ton of sushi, which was disappointing and quite frankly, overpriced. They were big pieces though with real pieces of fish and it was very tasty. I paid around $15 with tip so I guess it wasn't that bad for soup, salad, and sushi. I guess after hearing all the rave reviews, I was just expecting more."], ["Nate M.", "I am a server and I hate \"professional Yelpers\".But man... I've been to Haiku twice now and it has not beed good either time.We were the ONLY people in the restaurant and it took a solid 5 minutes for our server to come to the table. I hate to be that needy but five minutes feels like an eternity when you are literally the only two people in the restaurant.Our server was adorably pleasant, but the shoehorned \"my loves/my dears\" was... offputting. She was so sweet, and I love hippie-hearted people, but... Yeesh. None of that really affects the rating more than a half star though because I'm not an asshole.The food is what merits the low score. Bland spring rolls, the eel was not great, and they were small portions. I come from a city of 40K people and we have a Japanese sushi place that blows Haiku out of the water. We won't be back."], ["Ry M.", "This place is lovely and so delicious. Staff is so friendly. Of course they operate next to the Union Station so maybe the kindness and courtesy is just average. Regina George is a saint compared to union. Anyway, they have high prices but the taste and service are there to match. Plus those little candies they offer after the meal are awesome. Should try to get a job there. Hmmm"], ["Trina T.", "Very sheik place where the prices are very nice and affordable. The scenery inside is very nice and especially for couples.  I really truly enjoy the atmosphere and I think it is a good place for friends, family and even married couples. There's a variety of foods to choose from sushi to soup and salad to noodles to yum yum dim sum . The staff was very polite and friendly. Service was ten on ten. I went late at night so it wasn't too many people in the restaurant so that made it even better. There's parking on the side of the building and valet for $5. The patio outside looked like a Japanese garden. I loved the seating but of course, this isOhio and it gets cold quite quickly. I do think that if it was warmer, the seating arrangements outside are to perfection. It is located in the heart of the Short North. On some days, I was told that there's love entertainment like spoken word poetry or music so I'll have to come back for that. I plan on coming back again soon."], ["Gus W.", "I'm a huge sushi fan, but I'd never been to Haiku. I'm in Short North all the time and have been to just about every restaurant surrounding this place, but for some reason, I just never gave it a shot. Well, I was craving sushi the other night and as tempting as Akai Hana is every time I want sushi, the girlfriend and I decided to try something new. It was pouring raining and thunder and lightning, so we had to deal with that walking from the Hub garage. Note: It costs $5 for valet parking in the parking lot next to Haiku; although I'm not sure why, since they don't do anything. It'll cost you less to just park at The Hub parking garage right across the street.I always knew they had a huge patio, and it's partially covered, so you can actually eat out there during the rain, but I had no idea how large the inside of the place was. We were seated at a table toward the back, and our server was incredibly nice and helpful. I started off with the hot and sour lobster soup and a spring roll. The broth of the soup was pretty tasty, but the lobster pieces were pretty small and didn't add much to the dish. The girlfriend and I both liked the spring rolls.For the main course, we went with with two of the specialty rolls and a spicy tuna roll. One was the Urban Meyroll (so clever), and I forget the name of the other, since it's not normally on the menu. They all were really good and fresh. The spicy tuna roll was one of the better ones I've had in Columbus, and the salmon on the other rolls was great as well. As far as the sushi alone, Haiku way exceeded my expectations.This is a great place for a date, and all of the employees I encountered, were very nice and welcoming. The pricing is pretty standard for a sushi restaurant and great overall for the Short North. My only wish is that I had known to come here sooner, but we will definitely be back."], ["Maggie M.", "This place has great patio space in the heart of the short north. They also frequently have live music inside. The food is always very good  the restaurant seems clean. I love their sushi and their general tso chicken. Shareable entrées. Slightly pricey."], ["Nicole H.", "When I came here we had the rainbow roll, high st roll, and the short north roll. I forgot to take pictures, but they were all pretty good. My least favorite was the short north roll, but they were still good. I'm not sure I will come here again only because the parking in Short North is annoying and there are so many other sushi places. But still good!"], ["Sarah D.", "We checked this place out while in Columbus this weekend and I am a fan of the food, just not the service. I think had the service even been average, I would have bumped this review up to four stars. We sat at the \"garden table\" which was set below ground which made it really fun to climb into in my dress but I did manage it! I wonder if this particular table is part of what made the service slower - it seemed difficult for the servers to even pour water as they were basically climbing over us to do so. There was at least a 30 minute wait between any type of service, even water refills, but luckily we had a large fun group so the wait wasn't painful at all. The food, once we got it, was all very good. We had edamame, seafood salad, an assortment of sushi, and the chicken pad thai. I also enjoyed the glass of wine I had and they had a normal list of wines, cocktails, and beers. Everything was on point but nothing really blew me away. The highlight for me (unsurprisingly) was the \"crunching buckeye roll\" which was eel with pecans. They do have a really lovely patio and the weather was absolutely gorgeous. I actually didn't set a foot inside so can't comment on the interior decor! Oops. I am told there really is art everywhere though. Parking seemed to all be paid lots - valet, metered, or garages. This is on a really neat strip of mixed use stores and restaurants - similar to the new developments right off the Beltline here in Atlanta."], ["Kelsey R.", "I've been to Haiku a handful of times over the past ~7 years, and it can be hit or miss. However, my sushi this evening was exceptional. The High St Roll was okay - not nearly as flavorful as I would've expected for what was in it - but the Harvest Roll was so phenomenally good, it blew everything else away. Seriously, you won't regret ordering it. I was uncertain if I really wanted squash on a pleasant summer evening, but it was not what I anticipated & exceeded what I thought I could have in terms of vegetarian sushi. Five stars for the Harvest Roll alone.Additionally - the patio is such a nice atmosphere in the summer. We went early enough that it wasn't crowded and loud, late enough that it had the summer patio, perfect for relaxing at the end of the day vibe."], ["Marta S.", "We had calamari as appetizer and then went for a sashimi and sushi platter for two. Generous portions, really filling. The calamari were okey but the sushi was really good."], ["Monique L.", "Just wow. I am from out of town and researched sushi places on Yelp before selecting one. I eat A LOT of quality sushi and know my stuff so I was looking for quality reviews vs. price. I landed on this place, loaded into a cab, and headed out solo. It was raining out but the outdoor area looked really nice. I headed inside and asked for a table by the sushi bar. My server was great. Proactive and offered up good suggestions. Didn't make me feel awkward for eating alone. I ordered some rolls, salmon handroll, and eel,Uni and toro. Toro was listed as market price but I decided to go for it. Started with the handroll which was just plain nasty. The chopped salmon looked more like tuna and had a very off flavor. The salmon was ok so I moved on to the toro. Holy freaking yuck!! I've had sweet fatty melt  in your mouth toro many times and this was plain CRAP. Color was gray, texture was chewy and flavor and smell was straight up something you would chum the ocean with. I passed on the second piece I ordered and politely told the server that it didn't taste quite right. When he brought my bill he said aloud that he removed the toro and the main sushi chef heard this. He yelled \"what?? Toro is good!!\". I said no disrespect but I did not like it. He then grabbed a hunk wrapped in paper and shoved it at me yelling that is WAS good. The place fell silent and people looked at me. I said again I did not mean any disrespect. He then cut a piece, put it on a plate and threw it towards my at table. I said no thank you and he just kept yelling. I told him I would be leaving soon and again no disrespect. Many of the staff there came up as I left to apologize for him. Very strange and very unprofessional. If I was some ass just ordering crap I might give him a break but come on. I dropped $70.00 just on my own. I will never be back and will tell my whole huge company about this.I'm a foodie and people know it. Take some Midol old sushi guy. Im only giving 2 stars for the server and killer seafood soup. Sushi was a joke!"], ["Joyce X.", "Haiku really seems like a Spring/Summer place where people can sit outside on the patio and people-watch.  I went for the first time for a company's new-hire dinner in the winter and it was pretty empty.The service was ok.  Our waitress was really friendly, but all of our food came out at different times.  One person in our party didn't receive his food until the rest of us finished eating (he insisted that we start without him so our food didn't get cold).In terms of the food, I can only comment on the sushi roll that I ordered, which was the Three Amigos Roll (tuna, yellowtail, eel).  It was good, but a small portion for $13.50.  In general, everything on the menu is kind of expensive.  Almost $16 for some General Tso's?  You could use that for a decent steak elsewhere.Maybe I'll try Haiku out again in warmer weather, but I left unimpressed."], ["Leyla H.", "Nice outdoor seating with a Japanese style garden and pond. The portions were large and the happy hour makes it all even better!"], ["Kevin M.", "Great sushi as always. Sat on the patio due to nice weather and ambiance was great with the waterfall."], ["Amber S.", "Not thrilled with Haiku at all. The service is fair, the taste is the same as Kroger (not too bad), and it is very crowded. It's the spot where my husband and I had one of our first dates, so we'll go back BUT if it weren't for that, we would be visiting another sushi restaurant and staying away from Haiku."], ["Marc R.", "Amazing. Excellent food. Excellent service. Excellent atmosphere. Never had a bad experience here. Try the tofu lettuce wraps, Tao Tofu ( all crispy ) and the Yama Yama Roll. Can't go wrong!"], ["Lori S.", "I've eaten at Haiku several times and I've never had a bad experience.  First, if you can sit on their patio, do it - it's charming, with a waterfall and koi pond running through it.  The food is delicious and there is a lot of variety.  On my most recent visit I had the hot and sour lobster soup, which was very light and tasty (not thick like the usual hot-and-sour Chinese-style soup).  I had a sushi roll and some dim sum, all delicious.  There is a lot of good sushi in Columbus (although Akai Hana is my favorite); I recommend this place."], ["Tabitha F.", "My haiku tribute to Haiku:Mediocre rollsGreat white tuna sashimiTry blushing geisha"], ["Christopher L.", "I went on a double date here on the first 70 degree day of the year and we all agreed it was one of our better restaurant experiences. The food and drinks were great but what made it even better was our server, Chris. From start to finish he was entertaining and very customer oriented. The patio scene was also plus. Overall we had a 5/5 experience here."], ["Sara B.", "I like Haiku a lot. The sushi is always at least decent, albeit a bit on the expensive side. The tempura  is good, as are the appetizer soups. The shitake mushroom appetizer is Great (with a capital G) and the lo mein is solid. I like that I can come here and have a full sushi menu as well as an array of other hot foods. One of the best things about this place is the patio, which is totally lovely, and you can get happy hour specials ON THE PATIO during the weeknights."], ["Rachel K.", "This is my husband's favorite restaurant. He loves the sushi and if given a choice always wants to go here. I also enjoy it but am always disappointed with the lack of variety in the menu. The interior of the building is nice, well kept but the food is nothing to write home about. Decent but limited."], ["Zack M.", "Super hit or miss.Cool patio is the upside.This place is all about the company you bring.Spend sushi-money at a proven sushi joint.Haiku is second rate food.-Z"], ["Karin G.", "I honestly think that my my opinion of Haiku changes with what time of the day I visit.  The first time I went, our group arrived right as the Saturday night band was getting ready to play.  It was a hopping place at that point, so we started with drinks at the bar in the back.  After one round, we were finally seated and were enjoying the live jazz music.  (You wouldn't expect sushi and jazz, but it works!)  I think with the buzz from the alcohol, the fun, relaxed atmosphere, and the good sushi, the overall experience felt really incredible.  The second time I went was late in the afternoon on a Saturday.  We may have been the only ones in the restaurant and there was no music.  The sushi was good, once again, but that's it - just good.  We still enjoyed the atmosphere and the service was quick and friendly, but I just wasn't blown away like I thought I was the first time.  Also, the way they cut our rolls, the pieces were too thick.  So, I've had better sushi, but it's a fun place to come to - especially if you can make it here while the music is playing.My favorite - California Roll: $5.50"], ["Rachel R.", "As a short north resident I find myself heading to Haiku for the patio and atmosphere, as well as the pad thai.  We called on Saturday at 6 to put ourselves on the reservation list to sit outside and were told we had to physically be present to make such a request (STRANGE). After hanging up the phone and walking over, we were told there was a 45 minute wait (no problem).  We gave them our phone number and asked them to call us when our table was ready and headed to La Fogata for a drink.  The rude staff advised us to not leave Haiku while waiting for our table, and called us 45 minutes later asking \"if we were even there\" in a very impatient manner. We decided to dine elsewhere.We will not be back to Haiku unless they get a more sophisticated staff as well as reservation system.  Go to LemonGrass or Basil.  Don't take reservations if you don't know how to manage them."], ["Bridget M.", "I got a mixed green salad which had obviously been dumped out of a bag with little effort and tasted like a flipflop.My pad thai was extremely fishy. I'm sitting here now wondering how quickly I can leave but our server is nowhere to found."], ["Anne H.", "I have been here a couple of times, but I forgot how good the quality of the sushi was, not to mention the quality of the rolls.  They are also very large - we ordered based on the size of typical rolls and ended up taking some home.  The service was exceptional - Chris gave us fantastic recommendations and was highly attentive.  This is, without question, our favorite sushi restaurant!"], ["Amanda W.", "Waited about 10 minutes to get a drink order, then the excuse \"our kitchen is so busy\" with hardly anyone here, and waited forever for pah Thai. Everyone else was done eating their sushi before my plate even arrived. My son's vegetable fried rice had cold vegetables and the spring lily drink I ordered was so not worth $9, when it was gone in a swallow. Still waiting for our waitress to bring boxes for my my uneaten food and a check so we can roll out. NEVER coming back here."], ["Kelly Laine A.", "I've been to Haiku probably 20+ times since I've lived in Columbus. It's always perfect. To be fair, I have a few friends who don't love it as much as I do, but I can't see why. Awesome service (Sunny is the best server in the world), consistently fresh sushi, a cozy environment and a soothing vibe. I'm a lifer. I recommend: Mixed green saladHigh street rollShort north rollSalt and pepper calamari Xx"], ["Corey Tess T.", "Honestly, I judged this place the first time based on people saying it was amazing sushi. Now that is not really true for a sushi lover - BUT its not horrible and if you go with the expectations of some great cocktails, a cute atmosphere and some tasty food - you will have a good time.I found that when I did more of the classic rolls, miso and some dim sum style items, I enjoyed the place more - I am usually a sashimi and nigiri eater - but that is not really what you want to have here. I would recommend trying some roll classics like the spicy tuna roll, the spider (for something cooked if you like that) and maybe even a phili roll for those who like something tame...  the butterfly roll was actually not bad.The drinks are strong. Which can be a good thing. :)"], ["Katy H.", "Went here after a long work day and had a relaxing experience and a great server! Sat outside on a fall day next to their little waterfall and it was just delightful. The harvest role was my favorite, and for those of you that are vegetarians (or not, I just like tempora squash) I highly, highly recommend! Server was also above and beyond kind and attentive."], ["Shayna B.", "Went there mid week for a friend birthday and it was pretty quiet which was actually nice. The cocktails were great and memorable. The Lychee martini is great with actual Lychee fruit in the cocktail which is a nice touch. The Asian old fashioned was also pretty good. The sushi was delicious. I will go back to sit out and enjoy the patio another day."], ["Michael S.", "We chose Haiku to have dinner for our 15th anniversary. It was a wise choice. The food was perfect. The service was perfect and the atmosphere and ambiance were perfect. I would not hesitate to to go back again. And if you are in the Short North do yourself a favor and go here."], ["Brieanna H.", "I'm sad and annoyed to write this review. I have been to Haiku many times since it opened, and they have all been okay. It was never my go-to sushi spot, but if I wanted sushi in the Short North or to enjoy a beautiful patio when the weather was nice, I would dine at Haiku. But after last night, I doubt I will return.My boyfriend and I had reservations at 8:30, and we were seated immediately upon arrival on the patio, as I had requested. It was about 10 minutes before our server came to take our drink order, which I didn't care for, so the evening was already off to a rocky start. We finally got our drinks another 10 minutes after we ordered them, so that made it 20 minutes with no drinks. It doesn't matter how busy you are, that is unacceptable. We ordered our food then, and began to drink our saki. The cold house saki was decent, but the hot house saki was better, even in the heat. So we finished our saki, and for another 10 minutes we had no drinks. During this time, it is not just that our server didn't check on us, but I didn't even see her on the patio. Eventually, she came out to give the table next to us their drinks, and I was able to flag her down to order another round as she was on her way back indoors. At this point, it had been a half hour since we had ordered our sushi, so we decided to ask about it because we were supposed to meet friends at 10:00 in the Arena District. Our server came back out to attend to another table, and when we flagged her down to inquire about our dinner, she gave us a laundry list of generic excuses in the manner of a more attentive, better server at an actually good restaurant reciting the daily specials: \"It's a Saturday night; we have a full house; it feels like Gallery Hop; I put your order in, so it will come out in due time\"; etc. She did not, however, have a specific time, and she did not even offer to check. At this point it was 9:45, and we told her we just wanted our check because we had to meet friends in 15 minutes. She apologized and left. Maybe 5 minutes later, as we were contemplating what to because now we had only 10 minutes, a man who did not identify himself, but who I suspected was some sort of manager, apologized and asked us if we wanted this plate of sushi that he was holding. I appreciated the gesture, but I wasn't thrilled by the idea of quickly eating a random plate of sushi. It was also very clear that this was absolutely not our order because the beef dish that my boyfriend, who is allergic to shellfish, ordered is not being offered to us along with the sushi. We thanked the man but reiterated that we had to meet friends at 10:00, so we would rather just have our check. He apologized again, and, to his credit, said that he would discuss the situation with the staff involved. I think this is a very good move because based on other Yelp reviews, this sort of experience seems to be pretty common. I don't believe that makes it acceptable, though. Then our server came back out with what we thought was our check. Half right! Hilariously, it was also our second round of drinks! It was nice that they came out, and we drank them, but it was now 10:00, 15 minutes after we had initially asked for our check. I'm not sure why we were still served and charged for drinks that we had ordered 20 minutes ago, especially considering that we told our server what time we were supposed to be somewhere else. Every other time I've been in a situation similar to this, the server has made an effort to help us get where we need to be on time. I'm not sure if this is obliviousness or blatant disregard on the part of Haiku, but I don't really think it matters. The result is still the same. Closing thoughts:1. Obviously, lovely patio, but not worth the headaches that one must endure to experience it. It's hard to enjoy a patio without a drink.2. Our waters were never refilled, so this might not be a good place for nondrinkers, either.3. Haiku is not the busiest restaurant in the city. How are other busier restaurants able to maintain a high level of customer service and Haiku is not?4. If you tell your tables that the reason for their long wait is due to a crowd, then maybe you should actually look busy instead of disappearing for long periods of time. Haiku no longer really attempts to be great. It is a well-known restaurant in a desirable part of the city with a beautiful patio. Is that enough for you? It is not enough for me."], ["Helen S.", "I came here on a Friday night with a group of 6 for dinner. We each ordered a roll and split with each other, and tbh I don't quite remember what we ordered. Sushi rolls tend to feel kinda similar after awhile if you have multiple options. Most of the rolls were pretty pricey though, especially for a place that is more trendy than authentic. Harvest roll was the only one that stood out for me, since it was the most delicious one of the table (in my opinion) and also the cheapest one that we ordered ($8.50). I would probably come back to order 2 of this and just feast."], ["Emily L.", "I went here with my work group- over 20 of us! I have been here before but not with this many people. The waiter was VERY accommodating and patient with us and even split ALL our checks ( we all know how hard that is to find). The food itself was delicious as always. I had edamane and avocado with cream cheese roll and it was great! I would definitely recommend this place for anyone, and groups!"], ["Maria R.", "Great date night! Came on a Friday around 8 and was seated in about 15 mins. Can't get ENOUGH of the food! The service was great too!"], ["Robert P.", "I've been several times now and the food is amazing. I've only ever ate on the patio, which offers both ambience and the experience of High Street people watching, but the dining rooms seem nice enough.  It is definitely an expensive night out, but well worth it and I can't recommend it enough for a special night."], ["Rachel K.", "Exceedingly mediocre. I came here expecting poetic food and the best I got was terse prose."], ["Adrienne C.", "haiku butchers japanese food. they should name themselves something else so customers don't get tricked into thinking they're entering an authentic japanese restaurant. I would be more forgiving if they marketed themselves as \"fusion.\" the rolls have way too much rice and it makes you feel heavy and lethargic after the meal - a sensation that should never follow a sushi dinner! definitely check out Kihachi or Tensuke Express if you want real Japanese food.pro: nicely decorated outdoor patio area."]], "Sushi Ting": [], "Tensuke Express": [["Rami M.", "Wow, I'm glad I visited this place for some real Japanese food.  I will definitely be frequenting it more often.  This was my first ramen experience, and I ordered the shrimp tempura ramen in a miso broth (you can choose from a selection of four broths: I just remember miso and a pork broth).  The cashier helped me select my dish, I paid, and was given a buzzer to notify me when my dish was ready.  After 5-10 minutes, I was enjoying my delicious, steaming hot ramen.  I can't wait to try other dishes."], ["Kristina I.", "Love Tensuke so much. Everyone who works there are so efficient. They take your order and then get it out to you pronto! No matter how busy. It is the best find in Columbus, super close to campus and downtown. Worth the drive. Everything on the menu is fresh and delicious and flavorful. And once you're done eating you can spend sometime in the market right attached and grab some of your favorite foreign treats for decent prices too. I stock up on my hii-chews whenever I hit Tensuke."], ["Liz L.", "This place is great for quick Japanese food! And :gasp: is not one of those fake fusion places that sell you watered down \"ramen noodle soups.\" The place is connected to the Japanese market, which is wonderful because you can grab lunch and finish your shopping all in one go! The food is reasonably priced, and the menu allows for you to choose from a wide variety of rice or noodle dishes. I ordered the pork cutlet over ramen, and a side of gyoza (dumplings). The ramen was good, but not the best ramen I've ever had. I must say, I've been spoiled coming from a big city where ramen places/Japanese restaurants are abundantly around. The gyoza was also tasty, but then again it's just fried dumplings. I would definitely go back again just to try the other dishes and fulfill my Japanese food cravings, so don't let the 3 stars fool you! It is still a good place to eat fast Japanese food!"], ["Yukako F.", "I guess I set my expectations too high for Tensuke and Tensuke Express. Hearing from other Japanese that Tensuke has 3x as much as our local Japanese grocery store, I was surprised in a negative way with the size of the complex. To get into Tensuke Express you need to go through the main (or in other words the only) entrance to Tensuke, which when I went in was too crowded. As it was a Saturday afternoon, and the market being famous amongst the Japanese community, I guess that's fair.You need to wait to be seated, and it seems that there's always somebody looking over the hall at the entrance of Tensuke Express so there shouldn't be such a long wait. After being told which table you're getting, you'll place your order at the counter in the rear corner. They give you a beeper that tells you when your meal is ready, just like those restaurants in the service areas on the highway.I got myself menu no.2-B, Soba with small Spicy Shrimp Tendon and green tea, altogether under $10. Considering the average price for Japanese dishes normally seen in the US I think this is quite reasonable and close enough to what you would expect as average pricing in Japan. The Soba was nothing surprising, an average tasting Soba with sub average amount of toppings (compared to those in Japan) but taking into thought that you're getting this quality here, not in NY City or LA or those fancy places where you can find tons of Japanese restaurants, I'd give a 4 stars.The only thing that really disturbed me was the service. I would expect to see an employee training session take place when there are no customers waiting for an order to be taken, let alone an argument between employer - employee. Also it was late afternoon around 3:30 and the seatings were light, and I saw couple of empty tables and many people ordering take-outs, so instead of taking the bar counter seat that I was initially guided to, I took one of the close by empty table. The lady looking over the hall ran up to me asking if I was alone and insisted on myself taking the bar counter. It made no sense to me seeing so many available seats but I took the suggested space at the counter, took out my cell phone and opened up my Yelp app, and now the lady gives me a table seat, saying that one would be OK because \"it can be moved\". Man, that made no sense AT ALL.I'd give the food a 3 star if this was Japan however giving 4 regarding the location, but taking away 2 for the service and adding 1 because if I don't I'd feel bad for myself driving more than 3 hours each just to get here."], ["Jamie P.", "Great food! I went on a Sunday and there was a long wait, even for a party of one! I was able to waste some time in the market while I waited for a spot in the restaurant. I had the pork ramen and the soba noodles, both were delicious. I prefer the soba, but this place beats any other I have tried. Definitely recommend, perhaps on a weekday when they aren't quite so busy. Or takeout :)"], ["Jackie H.", "I love udon noodles, so on my first visit here, that's what I ordered. However, I'm not a big fan of the seaweed, so on my next visit I ordered ramen.Their ramen is SO GOOD.  So good I've actually sorta gone on a \"ramen diet\" by stopping by about 4-5 afternoons a week. I've actually only tried their tonkotsu (pork) ramen...creamy and full of flavor, just lovely. They have a few other broth flavors that I'll one day try, but for now that pork broth is just too good to stray from!Mini bowls are nothing fancy, but they're a nice companion.Price is great!"], ["Devan A.", "I love this place. Whenever I'm missing Japan I always go here for ramen. It really is the best kind of comfort food. They have a lot of other good food as well and it's attached to a little grocery like store. It's the only place I've been able to find calpis in cbus so far. I only wish they carried peach flavored calpis. Oh did I mention you can eat the food bought at the grocery store in the cafe?"], ["Holly C.", "I moved away from campus and live close by now. The sushi here is consistently good, whether you order it to go at the counter or pick it up in the frige. My favorites are shrimp tempura, spicy shrimp, and spider roll. The cafe has delicious choices as well. I'm personally not a huge fan of ramen or udon often, but I love the curry rice with beef or pork katsu! There isn't a huge selection if you come here often and like a wide variety of foods, but it's got all the staples done well!"], ["Madison R.", "This is the first Japanese food I've eaten outside of Japan/Hawaii/California.  Considering it's a Midwest Japanese restaurant with \"express\" in its name, I didn't have high expectations.  The gyoza were ok, but the curry ramen we ordered tasted too watery/light, and the tempura on the spicy shrimp was soggy.  Price was fair.  We might return to try other things, but I'm hopeful we will find a better Japanese restaurant in the area."], ["Diana P.", "This is a 'go-to' place for me when I'm not sure what I crave for lunch or dinner.  You can never go wrong with their udon & rice bowl combo.  They've increased their price little by little over the years.  But my tastebuds have become accustomed to their food already and I can't stop now lol.  Their takoyaki, dumplings, chicken karage are all good sides in addition to the combo, if you are feeling extra hungry."], ["Mark L.", "\"Express\" is an appropriate name for this place. Everything comes quick, cheap, and easy. The food is good and will leave you satisfied, but I can't stress enough: don't expect to be blown away.Most meals come in the form of soba, udon, or ramen bowls. Of the three, the ramen broth was my favorite. The shrimp tempura is delicious and juicy. The curry rice is simple but delicous and savory comfort food. The tonkatsu is nothing special, and the potato croquette was pretty basic. The takoyaki was huge and had generous chunks of octopus in it, though if I could, I would recommend they add Japanese mayo as a topping. It seems that is the deciding factor between an ok takoyaki ball to a delicious one.Take this place for what it is (a food court or fast food type place), and you won't be disappointed and may be pleasantly surprised."], ["Adrienne C.", "I LOVE THIS PLACE! probably come here at least 3 times a month. i was floored when I first discovered the place a full year after I moved to columbus - what a waste to not have found it sooner!! especially as a grad student, it can't get any better than super fresh, super fast japanese food at a ridiculously low price. there should be a Tensuke express in every college town. even in comparison to nice japanese restaurants, their fish quality is excellent for the price ($4.75). I personally love their salmon crunch roll, as well as their udon + tonkatsu combination (combo 1d i think?)  I'm guessing that when i finally leave columbus,  Tensuke will be what i miss the most."], ["Michael C.", "Really neat store and a great restaurant/cafe.  The store has some of the best - and most unique - fish you will find in Columbus.  They also have a deli-inspired section where you can pick up freshly made sushi and bento boxes.  The restaurant in back does some great ramen but be prepared to wait for a seat on the weekends.  The wait is well worth it!"], ["Zain K.", "Fair or otherwise, I judge a Japanese eatery by its sushi, and I think it's fair to judge a sushi place by its chirashi.  That said, the chirashi here was lacking.  For $12 at lunch, not including soup or salad, I expected my bowl to be reasonably substantial, and that simply wasn't the case here.  There were only a couple of unimpressive (in size, texture, and flavor) pieces of each of three different cuts of fish (not including the fake crab, which doesn't belong in a decent chirashi), along with a piece of hokkigai, a little salmon roe, and a reasonable amount of preserved squash, cucumber, and gari.  Given that this place is self-service, and that the dinnerware and cutlery are disposable, I don't feel I got my $12 worth. Then again, this was my first chirashi experience in Columbus (actually, this was my first meal upon moving to the city), so I may have to come back to this review after obtaining a local basis for comparison..."], ["Kyle H.", "Excellent ramen, timely service, and good value for the money. I usually order shrimp katsu ramen in shoyu broth...consistently good and always hot. The sushi and Bento bowls available at Tensuke Market are also solid and can be eaten at Express with a paid sticker."], ["Stephanie K.", "I came here during one of the sales.  They were offering pork cutlet  curry rice  and beef udon on sale.  I got the pork cutlet and curry dish.  The pork was deliciously fried and served next to a bed of rice and curry sauce.  There was also a small amount of pickled radish or something on the plate.  Yum!Only a week later I was back and got the Pork Kimchee Udon.  Ohhh my gawwd it was so good!  The udon was that perfect chewiness that I love.  The broth was bursting with flavor.  Pork, kimchee, fish cake slices, half a hardboiled egg, and shredded seaweed were also found in the soup.  I definitely am coming back for more of their noodle soups!This small restaurant in the back of the Tensuke grovery store, can get pretty packed during the weekend or during one of their sales."], ["Kaellen C.", "This is hands down one of my favorite places! Great Service and great food! I don't think I could live too far away from this place. I could eat here everyday but I'd be broke :) ."], ["Erick V.", "If you are craving for ramen-Japanese style this is the place to go. Great service. Great price and amazing soup! Nice place to go to during cold season!!!my favorite."], ["Matthew S.", "Wonderful little diner attached to the Tensuke Marketplace. The food is reasonably priced and the atmosphere is okay, if just a bit too crowded. There is also a a large saltwater tank in the middle full of beautiful sea critters, which is pleasant to see in such a small restaurant. Although we haven't sampled everything on the menu, we have never left disappointed and always make a point of stopping for lunch when in the area. The unagi dishes (eel) is some of the best I've ever had, and the udon and ramen bowls are perfect on a cold day.If you are craving very delicious Authentic Asian food and are in the area then definitely give this place a try. The space may be crowded and a little chaotic with the market crowd passing through, but a meal here is well worth any minor inconveniences that may provide. 4 out of 5 stars."], ["Lindsay D.", "This place has made me so incredibly happy. The food is excellent, very afforable and worth every penny! The only reason I can't give it the full 5 stars is because their vegetarian options are kinda limited. Most of the dishes have some form of meat or are made in a meat broth. Since I'm not a super strict veg, I decided to let some of those things slide due to the fact the food was just so good. They did have a few tofu options in their pre-made bento boxes, but most of those were sold by the time we got there. When I saw takoyaki on their menu, my inner 17 year old otaku screamed in delight. I've always wanted to try those little fried balls of octopus and dough. And they were totally worth it! Of course, I don't have anything to compare them to, but fffffff! I think I will regularly be convicted of breaking my vegetarianism for those. If you're not bothered by the octopus part, you MUST try these!The price is one of the best parts about it, as well. A meal for two with leftovers for about $16. That's pretty hard to beat. And if you're in to Japanese foods, you can always check out their grocery store while you wait."]], "KISSHO Asian Bistro & Sushi Bar": [], "Royal Ginger": [["Paul F.", "This USED to be one of my favorites.  Until they effectively raised the prices on the premium rolls and made it so confusing that I ordered one that wasn't part of the specials.  And the they hired a \"sushi chef\" who couldn't hold a knife.  Oh well, there are a lot of other restaurants."], ["Ashley S.", "The food was great. The only reason I didn't give it 5 out of 5 stars is because they said it would be 30-40 minutes and it took an hour. I do give them some slack since its a Friday night. But the food was great!"], ["David W.", "Wife and I have been looking for a really good Asian restaurant since Lai Lai Asia kitchen shut down a while back, and hate to say the Royal Ginger Polaris is not it.We had the Buckeye Triple Delight that was tasteless, and consisted of several pieces of dried chicken, 3 shrimp and NO beef although they advertised as containing it, along with an order of the Mongolian Beef.  We also had an order of the chicken on a stick and the house fried rice.The Buckeye Triple Delight gets a 1 rating as does the chicken on a stick.  The Mongolian Beef was really good and gets a 4.  The rice was different and we thought it was ok and gets a 3.  The service was average, the facility dark and just ok, and the value was less then average.  Overall I feel generous in rating the experience a 3.  By the way, I'm not a sushi person, but I did notice that they had a very large sushi menu for those who might like that fare.Will we go back?  No, we are going to keep looking for a really good Asian experience."], ["Mia A.", "I loved, loved, loved. My friends and I ordered Crispy red snapper, Royal ginger peppercorn chicken and shrimp, and some rolls. we enjoyed everything we ordered, but crispy red snapper was seriously the best thing I've ever had. We all loved it, I would definitely come back with my other friends so they can try it."], ["Piyali F.", "If there's one thing I strongly dislike, it's 'behind-the-scenes' comments from waitstaff or managers from a restaurant or other establishment. If you can't say it in public reply to my review, don't say it at all. This morning I found this message from the waitress in my inbox: \"You should not have brought in outside food to eat.  I was letting you know respectfully.  It is classless and disrespectful to do what you did.  And as for the specials not being offered, take that up with the owner.  I was very pleasant and accomodating to you and your parents.  Maybe you should look at your actions.\"No, Amy G., eating a bite of a special cake that your mother brought for you to taste before you left town is NOT in fact classless or disrespectful after we've just paid in full for an entire meal for four people in your restaurant and we are literally one of two tables in the entire restaurant. What is even more absurd about this is the fact that nobody cared but you, not even the owner. Thanks for taking it upon yourself to correct this great classless injustice. What is disrespectful is poor customer service followed up by rude private messages. If you can't take the heat, don't read yelp reviews."], ["Kyrsten F.", "Okay, I'm going to be honest about the bias in my star rating: I used to work here. But I've also had a LOT of experience with the food at this place. The food is so SO good. These people are serious about using very high-quality foods, no MSG and all that jazz. They deserve praise for taking Asian food in such a positive direction.    I read people review that this menu is \"Westernized,\" which it is, but all Chinese food in America is Westernized. There are simply very few ethnic restaurants that are willing to shock their customers with all those yummy \"leftover\" animal parts in order to stay authentic. But that's fine. This place serves America's favorite stuff in China's best sauces, and it's awesome that way.    This location strives to do their best for customers. It is really quite difficult to please everyone when it comes to Asian cuisine. There are those who walk in, see how nice the dining room is, and still insist that they are there for a five dollar meal like they're at Panda Express or something. And then there are those who come in for the best Asian food around, and those are the people RG's really trying to target. Not that the food isn't reasonably priced, because it certainly is.    I love RG's sushi. If you haven't tried the Lane Avenue Roll, which is a deep-fried roll with lobster salad and asparagus on the inside, topped with a whole lotta avocado and sauce, you are seriously missing out! The sushi chef's at RG do a fantastic job. If you are able, go when they are not having a half-price night, and the chef will have time to dazzle you with sushi arrangements.    As for the rest of the menu, try the duck fajitas, the peppercorn sauce (if you like spicy food), or the Thai red curry. In all my time working there, I've never had any dissatisfaction with those dishes. Pro tip for the Thai curry: they tend to make it mild unless you specify you'd like it spicier. If you find they're not challenging you enough spice-wise, you can always ask for some chili oil, which you should anyway; it's addictive.    The service at RG is usually 95 percent spot-on. They treat customers to a fabulous experience. If you haven't been to RG yet, you should certainly stop in!"], ["Aidan M.", "Great service, food was very fresh and service was fast. Best Asian food and sushi place in Columbus would recommend to a friend."], ["Christopher P.", "I slept on this place big time!  I live right around the corner but never thought to try it until I saw some of the reviews on this site.  I remember years ago this building was a Hooters that my bro's and I would frequent...now turned into a really nice fusion restaurant.  Low lighting and lots of large booths makes this a nice date spot.  They have a full bar with tv's also.  I started off with the hot and sour soup....it was so delicious!  I strongly recommend it...best I've ever had.  I tried several specialty sushi rolls that were excellent.  Had a very interesting curry dish with lobster, scallops, and shimp that was unlike anything I have tasted before.  Loved it.  The drinks were pretty good.  Oh and not to mention..... CHOCOLATE FORTUNE COOKIES!  I was super excited about those lol.  I was very impressed overall with the menu and decor of the place.  Royal Ginger is added to my go to spots for Asian cuisine for sure."], ["Tiffany C.", "I'm leaning more towards 3.5 stars, but I'm feeling extra generous today.Royal Ginger was A-OK plus some, but by no means extraordinary. I would gladly step foot here instead of Sushi En after a terrible experience there, but the authenticity of these Fusion joints popping up everywhere proves to be questionable. OK, let's start this thing. Royal Ginger has taken over the shell of some recently dead restaurant, but they have made the inside quite pleasant and enjoyable to look at. You get a nice dark feel for a date night. They also have granite-esqe table tops. (WOAH!)The service here was not memorable. It was neither bad, nor excellent. Alcoholic Drink prices here are freaking ATROCIOUS. The plating here is gorgeous. Someone in the back is trying to impress.Think about how many times you've went out to a sushi place after the pictures looked phenomenal and then you get your plate and it's BORING. Well, Royal Ginger at least surpassed my expectations on that aspect. The Vietnamese Summer rolls we ordered were.... Alright. There was some herb in there just throwing me off, but the rest of the ingredients were good and the spicy duck sauce was the BOMB. We ordered a few rolls including some specialty ones, and everything was good and the quality was decent. I would highly recommend just their basic rolls above their specialty ones. Deep fried just doesn't do it for me and I found my husband's Rainbow Roll standing out above, because of the freshness. You'll probably leave stuffed and your bill will be typical of sushi dinner pricing, but on the moderate scale as opposed to the higher end range. This place is not the greatest in the area, but it is not terrible, either. Check it out."], ["Michael O.", "I had the Mars Roll, and thought it was just ok.  My date had the Triple Buckeye, I think it was called, and both of us enjoyed that.  This was our first time here, so would try again."], ["Lisa F.", "I suggested Royal Ginger on Polaris to a friend as they have 1/2 price sushi during happy hour , and usually doesn't look crowded (after 5:00 PM) when I pass by there, which is often. This is my second visit here- first visit was just ok, service wasn't that great but went again because of the reviews and the \"sushi\" special. We were unaware that they only had happy hour on Mondays and Tuesdays. The hostess which also ended up being our server came back after a long wait to bring water and then again after to take our beverage order- this is when she told us about the happy hour. I order a glass of wine off the menu as well as my friend who ordered a glass of Malbec wine , the server told us that she will have to check with the bar as the sometimes don't have it- she returned and they didn't have it, probably shouldn't be on the menu if it's a sometimes item that they carry . So she asked for a cup of decaf-hot tea - there seemed to be miscommunication on this so we requested a decaffeinated tea bag, she brought out a tea bag to show and apparently they do not have decaf tea, so she just stuck with water.We ordered edamame to share to start- it came with just a little plate to put the discarded pods on and no serving plates (I do like to have one for soy sauce) I helped myself to a couple of plates at the little table by the host stand as I didn't see there serve to ask. I ordered oshinko sushi and my friend ordered lettuce cups.  Lettuce cups came out after a bit but no sushi-  it took 10 minutes before the manager came out and apologized that they did not have that type of sushi, ok fine I ordered a California roll. (We did explain our disappointment about everything thus far in a really nice way- he said the menu will be changing and they aren't ordering some inventory.)Now her lettuce cups are not only cold but were so sweet they had to be drowned in soy sauce and it only helped a little. The California roll arrived- no chopsticks or little sauce tray /ramekin to mix wasabi and soy in- I got up once again and got a little plate to use. The roll was ok as a plan B but honestly the California roll you can buy at Kroger is better. I then ordered the chicken satay it was so tough like jerky, gristly and flavorless, almost like it wasn't fresh- I could not eat it. Throughout our evening the service continued to be quite slow and the manager never offered any kind of compensation- a return visit discount card / free app etc... I have college students working in restaurants- I understand having off nights- but as a manager you should offer some kind of restitution to invite your guests back to have a better experience.  When we left there was a van now parked so close behind my friends Jeep that she could not get out of the parking spot no matter how many times she tried to maneuver her vehicle she had to finally go inside and ask if they could help find the person to move the van -the manager said \"oh, I will take care of that right away\" because he apparently knew who the van belonged to and it turned out that it was one of his employees. The parking lot had plenty of empty spaces- couldn't he have parked in a different spot as to not block a customer in?"], ["Amanda G.", "On a whim, stopped by Royal Ginger for dinner after a movie one evening. So glad I did!! The menu was huge and offered tons of tasty sounding options, and the food was fantastic (as was the service). We had the Asian Fusion Roll to start, which was incredibly tasty, and my Cashew Double Delight was fantastic. The veggie combo in the dish was wonderfully unexpected (mainly red bell peppers and butternut squash), and the brown sauce had great depth and flavor. The roasted cashews really made the dish, and I have ordered it again since my first trip. My hubby had Wok Glazed Ginger with chicken, and he also raved over his dish. Not your typical Asian fare-- definitely a step above! The server was courteous and very helpful, but I was sad that the place was pretty empty when we ate there. Perhaps more fans order take out? Highly recommended!!"], ["L. B.", "I ate lunch here Monday with my husband.  I ordered two lunch rolls, the Columbus roll and the eel avocado roll.  They both were pretty tasty, though not the best sushi I've ever had.  For $7.99 (includes a bowl of miso), I thought it was a good deal.  Hubby ordered the Asian Grilled Chicken with the fried rice.  He liked it.  I tasted the rice and it was delicious.  The service was great and I really like the chocolate fortune cookies!  I don't know if it's the times we've come here, but they never seem very busy.  That concerns us.  Overall, a good experience."], ["Josh E.", "Amazing pad thai and the dumplings are seriously tasty. No idea what the sauce is but its so good"], ["Zach W.", "I've eaten sushi in almost every state and 4 different countries. BEST SUSHI IN COLUMBUS."], ["Moses S.", "Pro tip: at your first check in, you get a free appetizer!Pro tip2: the hot tea is not free, so unless you want to spend $3 on tea, just go with water.I got the sushi combo for lunch.  I had a choice of three items for 10.99 and it came with soup, so I was totally on that! I had yellowtail, white tuna, and eel with avocado.Everything was fresh, and what was interesting was that the sushi rice was warm while the sushi was cold, so I really liked that juxtaposition. Not sure if that's the way it's supposed to be, but I liked it. the Avocado was really rich and ripe, so I was happy about that.Other than the tea issue and the waitress rushing us/not really understanding our orders, I thought it was a better-than-most eating experience!"], ["John W.", "Just adding another round of pics.  Had the Mars roll and spicy scallop roll this time and my friend had the 18 pc sashimi dinner.  Outstanding freshness and presentation one again!"], ["Brian J.", "First off, the sushi here is ridiculously bad. If that's what you're into, go somewhere else! I work nearby and have come here on many occassions, and while their entrees are generally delightful, sides and service are lacking! After four or five sub-par visits, I've decided there is little reason to visit again."], ["Myranda W.", "This is probably my favorite place to eat. We come here almost on a regular. Steamed duck dumplings are a must- the hoisin dipping sauce is phenomenal, I won't come here without ordering them.You won't find better sushi anywhere else in this area. This is definitely a great place to take sushi newcomers. Some of my favorite rolls- Christmas roll, Calamari roll or Double Crunch roll. They are beautifully plated and always fresh. Any of their hot teas and even their Thai iced tea is amazing!"], ["Scott T.", "I have been here a number of times now and have to say that I am well pleased. The fried rice is excellent and the chicken is nice and crispy every time I go. The insider decor is nice and the service is attentive and expedient. The only thing I have against the place is that the prices are a bit high, even for lunch. With that said I will probably come back in the future, because there are few other establishments that make decent Chinese food in the Columbus area."]], "Kihachi Japanese Restaurant": [["Khan Z.", "Went there twice, other things are quite good, but the steam duck with sake, OMG, is just mind-blowing bad."], ["George Y.", "If you want a california roll, shrimp tempura, or some cook flipping scallops in his chef hat benihana style, then this is not for you. Kihachi offers unique (or to the Japanese patrons, authentic) tapas sized Japanese dishes in a somewhat hidden, nondescript strip mall on the northwest side of town.Wonderful little place with normal table seating, a bar, and tatami mat rooms. I've been here twice and I'd take a tatami rooms anyday because it gives you a chance to relax, sit back, eat and really enjoy the food and company in a private space. Since the dishes are somewhat smaller, we ordered quite a bit. They were all very tasty, and the ones I can recall are the mushrooms stuffed with shrimp, the fried rice ball in broth and the grilled mochi for desert. You need to be adventurous and avoid the traditional stuff, no other restaurant that I know of in Columbus serves what Kihachi serves. And the menu changes, based on what ingredients the chef has purchased. They can make rolls, nigiri, etc. but that's not what has made them famous.Service-wise our waiter was pretty attentive. He was caucasian and spoke Japanese. He helped translate the entire Japanese menu for us (the menu had about 20+ items on it). Now realize that you may not come out of Kihachi stuffed like you would coming out of Hometown Buffet. And Kihachi is definitely pricier then your normal Japanese restaurant. But if you're willing to go beyond the california rolls, then definitely check this place out."], ["Brady S.", "Had the soba with duck and fried oysters; wife had grilled salmon and veggie tempura. Both were good dishes and the service was excellent."], ["Olivia Z.", "7 pieces of 2cm*2cm*0.3cm eel cost 16 dollars. I think it was pre-made, and the flavor was the same as ones in supermarket. The service was the worst. Dishes here were innovative and good looking, but I do not feel the quality is also first-class. Small portions usually made customers feel special. The service here \"amazed\" me. I made a reservation at 7:30pm and still spent at least 10 min standing at the door waiting to be noticed."], ["Jurgen J.", "Kihachi is one of the better authentic Japanese restaurants in Columbus. Prior to dining here, i have prepared myself for the long wait of food. One of my friend told me that he waited over an hour the ramen. And his claims were all valid. I waited on average 30 minutes between courses, i order around 6.The meal started with the fluke sashimi and fish liver. I've never had the fish liver before, but it's good. It's a texture is soft and rich, but a lot lighter than duck liver.The second course was steamed duck with sake. It is served with soy sauce combination and wasabi blend. The duck was perfectly cooked and the wasabi blend (i think it was wasabi and mustard) added extra flavor.then another 30 minute wait.....The third course was the pork cheek. This was the highlight of the meal. It was delicious. juicy and so flavorful.The forth course was braised sea eel. This one was one of my least favorite. It was basically unagi, braised with eggs and vegetables. The braising reduces both the texture and the flavor of the unagi. It was really bland.The fifth course was the beef tataki. This one is classic dish done well. The beef was really fresh.The sixth course was one the rice with the. It was ok. In conclusion, some are good, some are bad. If you really want to try this place just remember to eat something first and research what to order. If the wait is not such a pain, i would be going to this place more frequently."], ["Ariel B.", "Authentic it may be, but the service is not, and the food is just okay.I had two fellow foodie friends in town this weekend and had eagerly awaited such an opportunity to go to the much revered Kihachi. Maybe all the hype that has spun off from Anthony Bourdain's praises has shrouded some peoples eyes from the reality of the experience. I am also willing to admit that we may have gone on an off night. However, this time, Tony, I disagree.I am not a boring eater. I am an exciting eater. I will eat anything, and I will often like it. I eat a ton of authentic Japanese, Korean, Thai, and Vietnamese food as they are my absolute favorites. I even like Durian for god's sake!The experience started out pleasant with reservations and a tatami room, stepping in after leaving our shoes outside. Fifteen minutes go by and water is served and menus materialize. Another 15 minutes go by and the waitress comes to take our orders. She asks if we want to specials in English and acts annoyed when we says yes. She then storms out of the tatami room and does not return for another 15 minutes during which time she hurriedly explains the specials in English. At this time we are still excited about the food. If Kihachi was packed or we were slurping back sake I would have easily forgiven these time delays. We proceed to order baby octopus, fermented squid, some fatty tuna, some giant prawns, and multiple other items on the menu including two fish specials. The waitress is incredulous of our selections and asks us several times if these are the things that we would like to order or would we rather have something else. Hello? I think I know what I'm ordering.Another 50 minutes go by and the waitress at long last brings the dishes-- all of them at once. Not one at a time and not appetizer before entree. Yes, it is all edible. Yes, it is all pretty, but so are the things that you can get at kroger's sushi station or fish section. That doesn't mean they always taste good. We eat almost everything, but are left wanting more and not in a good way, hoping that every bite would fulfill all of our expectations and make up for the service which verged on insulting.After all of this, the plates are cleared and we patiently wait another 30 minutes for our bill and are not asked about dessert, drinks, etc. Essentially we are ignored. Then come the bill. Behold! There is an extra charge for the tatami room. We did not ask for the room ahead of time or at arrival. We were also not told there would be a charge for the room. We were seated in the room despite the fact that there was space at regular tables. Ugh. Kihachi I want so badly to love you, why do you do this to me? I won't be going back. :("], ["Ozzy C.", "I'll start with the only negative I can think of. The service is slow. If you want faster service here, be from Japan and speak Japanese. If you're like the rest of us though you can still sit at the bar and have one of the most authentic Japanese dining experiences anywhere, let alone in Columbus, Ohio. The fish is killer fresh the tofu homemade. The uni preparation is to absolutely-samurai-sword-yourself-in-the-stomach for. Two words: tuna collar. Do go with an open mind. Do try a bit of everything you haven't heard of. Don't come when you're broke. Don't be afraid to enjoy something new. You just might feel like you're in Kyoto and not next to a billiards in a shopping mall in Ohio."], ["Jason M.", "Every delicious food will be ruined if waited more than one hour. twice."], ["Christine A.", "Do not mistake Kihachi for a Japanese steakhouse or a sushi bar.  Think of it more like Japanese tapas.  The 'tapas' menu is extensive, hand-written mostly in Japanese and cryptic English.  The daily specials are written only in Japanese with prices next to each item; the waitress pointed to that menu and translated everything for us verbally.  Everything was delicious.  We especially liked the duck dish and the wasabi marinated pork.  Not only did they taste good, the texture was lovely.  The blue toro sushi roll was pretty good.  My cousin got a noodle soup (not sure which exactly).  My mouth is watering thinking about it.There was something along the lines of \"fermented pork\".  If you get past the saltiness, it was actually pretty good.Definitely an interesting experience.  Make it more interesting and reserve a tatami room in advance."], ["Lori P.", "I have been hesitant to write this review.  I am a foodie, and want to love this place... I will keep trying to love it, but I am not there yet.I have traveled all around the United States and lived on Maui for a few years, so I have tasted some food.  I love Asian food, so I was very excited for the reviews of this authentic Japanese restaurant.  I actually heard about this place from a friend of mine in Michigan who saw it on No Reservations and wanted to drive down here to have dinner there.  I told him we would check it out first.  I was excited for an adventurous menu, and even one I couldn't read, and that is just what I got.  I went there with my parents who are also adventurous eaters, and we ordered whatever the server told us to get.  Honestly, we couldn't really understand her, so we weren't too sure what we ordered, and I can't really remember now.  Nothing was memorable except the check and the slow service.  It was not crowded, but took almost 2 hours to order, eat and leave.  This seemed like an excessive amount of time.  The food was just OK, but not a good value for the price.  I will go back, as I believe in the rest of you who find this place amazing,  but so far, I am yet to be impressed."], ["Lauren H.", "So far, this is the best Japanese food I've had in Columbus. This is not a steak house. This is not a sushi bar. This is small, elegant plates served in an authentic atmosphere with tatami rooms.I don't recommend Kihachi for the non-adventurous eater. For starters, the menu is (hand!)written half in Japanese, half in rather cryptic English, so you're exactly sure what you're getting. But when the food arrives, it's gorgeous, employs plenty of umami, a lot of finesse and little fuss. This, to me, is the essence of Japanese anything.It's a little pricey, but well worth it for the amount of attention and care put into every plate. If you want gallons of food for your dollar, go down Sawmill to Genji (another fav of mine, but for completely different reasons). If you want an elegant dining experience, irasshai!"], ["Chris W.", "Overpriced medicore food with disinterested service.Edit: and it just doesn't improve in later experiences.I've seen better places than this go out of business.Save your $, go down the street to City Bar-B-Q"], ["Bob T.", "Simply outstanding.  All of the dishes have an attention to detail that exists in few restaurants nowadays. The entire staff is always friendly, helpful, and truly take pride in what they do. Bravo!"], ["stephen s.", "Here's the thing about KihachiThe main focus of the restaurant is appetizer.Does it mean that the main courses not good ? No, they are great.It just means that the chefs will serve all of your appetizers first, one by one, before they cook your main course and that is why sometimes it took so long for your food to come out. Imagine this... you came with your friend, you decided that you just want to eat the main course, but your buddy ordered 3 kind of appetizers and a main course. What will happen is you have to wait for your friend's appetizers to be served first before your dinner came out and... there goes an hour of waiting for you. Therefore it is recommended for you to share the food or order for the group so that nobody have to wait for too long. Maybe the idea of sharing food is strange for you, but in Asian culture we usually share food with families and friends. Considering Kihachi is an Asian restaurant, maybe you should try to share the food. So here is my suggestion:1. Come in a small group2. Preferably go there on Monday to Thursday3. Share the food/order for the group4. Sit at the bar that is the best seat in the house5. Have fun, enjoy your food while chatting with your friendsLastly, I often eat in Kihachi, based on my past experiences, the food does not take that long to come out. The last time I ate there, I came at 6 p.m, we ordered 7 appetizers with 2 entrees and we finished in 7.30 p.m. Which is not bad considering the amount of our orders. In my opinion come here if you want to spend time with your friends while having great food.  p.s: if you want to know my opinion of Kihachi food, please take a look at my past review of Kihachi"], ["Allyson L.", "Kihachi is high-end Japanese. Don't go here expecting to get egg yolk sauce and fried rice. It is an exclusive place that serves only high quality sushi and well crafted Japanese dishes. The place fills up quickly so it is best to get reservations. Also be warned that it is expensive. The last time we went there we dropped a couple hundred dollars for 3 people (business expense). But it is worth it. The service is slow but you are meant to take your time and relax. This is not an in and out place. The decor doesn't match the price but the food does not disapoint. I definitely recommend it."], ["Neal F.", "Holy crap one of the best culinary experiences of my life! I'm pretty sure we will be seeing it on No Reservations with Anthony Bourdain this spring!*****update*****This restaurant is reservation only!! Just a heads upWent to kihachi on a rainy October night with a good friend of mine. Once again I was blown away. We sat at the counter and ordered the omakase. Usually omakase must be ordered 2 days in advance but chef put together a nice collection of dishes for us. Monk fish liver, salmon roe with pickled radish, sashimi, miso marinated pork belly, tropical tuna and scallion roll. Everything was perfect. We paid around $75.00 a head really not that bad considering the caliber of food and the level of one on one time we spent with the chef. Make a reservation and go. Treat yourself."], ["Keith M.", "My boyfriend read about this place somewhere and had been trying to get me to go for months.  We finally went last Saturday night and it was one of the best culinary experiences I have ever had!We ordered the chef's special, which you must make reservations for in advance.  It is truly the most authentic Japanese meal I could imagine.  This is far removed from sushi or Japanese steakhouse fare.  Apparently the chef's special is as expected, different every time.  Our meal consisted of 9 courses with an average of 3-5 items on each plate.  I couldn't even try to describe them all but I will point out a few highlights.There was a plate of sashimi that included some delicious fishes I had never had before at any sushi restaurant.  There were two soup-like courses that both were delicious and delivered completely different textural experiences.  One course had a sushi-like preparation of two kinds of Kobe beef seared over rice with a wasabi mustard... probably my favorite of the whole meal.  I ate a full prawn for the first time, antennae and all, and had my first experience with geoduck and abalone each of which were prepared very well.Overall a phenomenal experience I would definitely go back for again and again if I could afford to."], ["Michelle M.", "This place blew me away. Yes it's a little far from my downtown stomping ground, and yes it's in a strange strip mall, but the CRAVE article convinced me to try it.The restaurant has several seating arrangements: bar (the food kind not the drink kind), tables, and low tables (where you take your shoes off and sit cross legged). At first I was disappointed to be seated at the bar but it ended up being the perfect spot. My boyfriend and I watched in awe as the chef very calmly and efficiently turned out order after order of the most beautiful dishes I've seen. Everything we got was absolutely amazing. I ordered the mushroom and shrimp tempura and the udon. My boyfriend ordered duck, their version of beef carpaccio, and tuna tar tar. And let me just tell you about the wasabi. We watched as the chef ground it from a root that still had living shoots on it. I will never be able to eat any other wasabi again. A truly amazing gem."], ["Don B.", "My wife and I took her two younger sisters to Kihachi last night to celebrate my birthday and introduce them to the experience. All four of us have traveled internationally, and while we are not hardcore \"foodies,\" we do enjoy nice meals and appreciate quality. We had been here once before, in December 2010, for our anniversary and really enjoyed it then also. From the opening dish of sea urchin, sea cucumber, and another tasty treat I didn't catch the name of, my sister-in-laws were in love. We had ordered the Chef's Choice, which must be reserved a couple of days in advance, so each course was a surprise. The chef continually made us ooh and aah with his presentation and the food itself left us often speechless or uuummmming our appreciation. Just some highlights: soft shell crab, the best sashimi I have ever tasted, duck with a dab of hot mustard, fresh water shrimp, and the finish: Hawaiian Blue Prawn with black lava sea salt. All wonderful. As many other reviewers have said, this is a traditional Japanese restaurant. I read the reviews mentioning service issues and didn't really give them much mind, but my wife was a bit irked last night. Her tea was only refilled once and she had to ask several times for water during our nearly 3 hour stay. The rest of us ordered alcohol, and we were fine. I am willing to deal with some service problems when the rest of the experience is as great as it is, but some of you may be more concerned about that. Having ordered the Chef's Choice, which is very pricey $400 for four of us, and ordered off the à la carte, I would recommend just ordering à la carte items. You can save some money that way. Order a variety and be adventurous.On the other hand, the Chef's Choice exposes you to items you may have never heard of or thought to try, so that should be part of the consideration. To sum up, my wife is perturbed by the service she received but is still willing to go back, and I think the food is so wonderful I'd serve it myself and drink water from the tap if they made me. One last note, sit at the counter. Watching the chef use his knives on fish is like watching an artist paint."], ["Danielle F.", "I have been to Kihachi twice. I was sent with high expectations - neither time was I disappointed.I had similar meals both times. As others have stated, the focus is the appetizers - the appetizer menu is considerably larger than the entree menu. The entrees have large portions and are not that expensive ($8-20 - very affordable). The appetizers and desserts, on the other hand, are very small, pricier, and while the entrees are good, the appetizers and desserts are what really impress.In my two trips, I have tried their edamame, press box sushi (two kinds - a mackeral and snapper), abalone sushi, and tempura vegetables.The edamame is incredible (being so simple, I'm not sure how it was so much better than any edamame I've had anywhere else, but it was somehow a cut above). The abalone was not great - it was just too chewy and without a lot of flavor (characteristic of the dish, not the chef). Tempura vegetables are pretty standard, and these were too - good, nothing extraordinary. The pressbox sushi were highly recommended by a professor, and they exceeded all expectations. It has been to long since I had them for me to attempt to describe them in any detail, but I will say they are pressed with citrus - which really adds something special. The pressbox sushi are in the \"specials\" section of the menu - written only in Japanese - so listen when the waiter is describing them.I've had two entrees - teriyaki steak and a small bowl of sashimi with rice. Both came with miso soup (delicious) and a small salad with a delicious house sesame-based dressing. The steak was a generous size, and very tender. The sashimi was also excellent.I've tried a few of the desserts. I highly recommend the herbal mochi. Mochi is a rice dough, in this case filled with a (sweet) bean paste, wrapped in a banana leaf, and grilled. If you haven't tried mochi, no description will really suffice to describe it - I highly recommend trying it. They offer three kinds of mochi for dessert, the herbal was my favorite.As others have noted, the service is not impressive. Planning on being proactive / slightly aggressive about drink refills will be to your benefit. Do not come here if you are in a rush. This is a place you make time for, schedule in advance, and enjoy as the focal event of the evening. Do so, and you -will- enjoy it. :)"]], "Kona Grill": [["Alita R.", "I've given this place more chances than I should have and I've been disappointed every time. The first time I went, they would not seat us even though we had reservations and the host over the phone said it would be fine if we showed up a little late. My friend was upset about it and asked to speak to a manager. The hostesses were laughing at her for this. The second time, I ordered the lobster mac and cheeseburger sliders for my co worker and I as a carry out order. The Mac and cheese was very dry and flavorless and my co workers burgers were practically 100% raw. She ended up having to go back not once, but TWICE, because her fixed order was raw as well. She ended up getting sick because of it. The third time, I dined in to try their sushi which was the worst I've ever had. It wasn't horrible, but I could've gotten better sushi from Kroger and paid less. The service was also slow beyond belief and they weren't even busy."], ["Christy C.", "I cannot say enough good things about this restaurant! We were greeted promptly, drinks, appetizers, dinner and dessert was fabulous. Manager checked on us several times and our server was attentive and had excellent recommendations. Loved the ambiance and view."], ["Anı T.", "the food was outstanding and with the price range there are expectations. when my dad and i first walked in, i fell in love with the interior design. but when i walked up to the front desk. i asked if there was any room and one girl said \"yes, at the sushi bar,\" and she pointed. i went there, and no one followed to guide us and i was full. thats minus one star. i had to go back for more unhelpness and finally got the high topped tables. later i got confused at what they were focusing at. they have a sushi bar, a dining area, high tables, a bar and an upstairs dining area. btw, i love how the bar faces the windows looking outside bc then i doesnt feel so closed in, but i dont understand why there are so many tvs. are you a sports restaurant or something. it distracts people. i saw people watching the tv more than actually talking to other people. also, the music did not fit the place and it was too loud for me to comfortable hear what my father was saying. they were playing songs i would gladly listen to by myself, (passion pit, adventure club, the neighbourhood, etc) mostly alternative but even if you could pull of that music in the restaurant, it still was too loud. i could see the speakers and it was half way down the room facing the floor. im no expert but it would seem to be a better idea to put it at the very top corners so its background noise. theres already enough noise coming from the people in the restaurant, why add to it with loud music. thats the other minus star. but like i said, i dont understand what you are trying to focus on. you seem like a sushi sports bar teen music dining place. then you have a giant fish tank in the middle. maybe im being a little picky but it doesnt make sense to me. the food was worth the money though. my father and i got the salmon, bbq flatbread and a name that has slipped my mind but it was a cucumber, eel, avocado roll. they were all impeccable."]], "Restaurant Tora": [], "Tai's Asian Bistro": [["Paul F.", "This was my first trip over here but I'm sure it won't be my last.  It's a pretty new, and pretty nice place.  And the employees work their asses off to keep it looking like that.  I was there just after the lunch rush and a couple of employees were cleaning the the chairs and tables from top to bottom.For my lunch I had orange peel chicken and fried rice.  The rice was fried with onions, carrots and peas and the chicken was all white meat with a little spice added.  I noticed the the also had chow fun which i dearly love.  Next time!"], ["Andrew W.", "I want so badly to love Tai's; especially since everyone raves about it...but the only word that comes to mind is 'overrated.'When I recently went with a friend of mine we had both been talking about how we couldn't believe it had been over a year since we had been to Tai's and why didn't we go there all the time!? Upon receiving our food; however, we remembered. It's just not that great. Everyone in the city rants and raves about Tai's and I just think there are so many more delectable (and cheaper) options in the city.Not only is the food pretty \"Meh,\" but when we had some questions about the menu, there didn't seem to be a soul in the restaurant who could answer our questions. Tai's is definitely worth trying (because it seems to be a local favorite), but if you ask me...there's better Asian food out there."], ["Josh S.", "Worst boba tea and pho in town.Everything else taste great except the Pho and the Boba tea. Be aware"], ["Xiao M.", "The customer service was poor before I received my food. While eating my pho (beef) I found something very disturbing & immediately showed a worker there to get a refund. She never apologized to me, only asked what else I wanted. It was very upsetting."], ["Welly D.", "First experience. It was very busy for 8:30pm on a Sat. I had decent hopes for this place based on the reviews.  I ordered the veggie lo mein & husband ordered the firecracker chicken. The food was piping hot &  the portions were generous. Each dish could have fed 2 adults. We pretty much only ate half of our meal. Here's the thing, the food was very bland. I added soy sauce to the lo mein & that even seemed watered down a bit. The veggies were sparse with loads of onion. The firecracker chicken wasn't spicy at all, it had a vinegar base with a hint of sweetness. If your looking for a hot, massive volume of food on the cheap-then you've found your place!"], ["Candace M.", "I think my honeymoon phase with Tai's has officially worn off.Went yesterday and ordered the pad thai and crab rangoon.First, they lost our order ticket, so people who came in after us had their food before us. Then there was some confusion about why we were still waiting, until it was determined that the ticket was MIA, and our food had been ready and sitting there for a while. That was a slight setback, but forgivable. We got the food home, and I wasn't enamored. The crab rangoon was really good, though I wish there were more than 4 of them. The pad thai, on the other hand, left a lot to be desired. It didn't taste like pad thai at all. It had none of the sweetness associated with pad thai; it tasted like delivery lo mein. My boyfriend, who ACTUALLY got lo mein, liked his. Overall, it's convenient, relatively inexpensive, huge portions, and nearby. But at this point, it's just average in my book."], ["Tiffany W.", "A good place to get cheap, Thai/Asian food, in big portions that taste reasonably good. Although the restaurant is usually packed, I never have to wait too long for my meal. Two dishes I usually go for here are the pad thai and pho, which were fairly decent, nothing over the top or amazing though (which is fine, because that's not why I come to Tai's). I almost never finish my meal and end up taking some back. I like the Lane Ave. location, as it's pretty convenient if I come from campus."], ["JJ S.", "Very cheap prices for the amount of food you get!! Yes, it may be a little greasy depending on what you ordered but there are always healthier options on the menu. I recommend the Saigon rice noodle salad. It comes with a large bed of lettuce with cold noodles and protein of your choice! It comes with a light sweet and sour salad dressing which complements the salad very well! The salad is quite large and I always have a hard time finishing it. This is a must try! My other favorite dish is the Singapore noodle. One thing I like about Tai's is that they accommodate your taste buds; you can make this dish spicy. It comes with chicken and shrimp (they are not stingy on the amount of shrimp they put in the dish). Prepare to have leftovers for lunch tomorrow!"], ["Tod S.", "Last few times the food has been pretty weak. Undercooked beef is fine but not with such low quality meats."], ["Brian H.", "This place has gone downhill in a hurry.  The only dish that even seems edible anymore is the Pad Thai (which is not enough to make up for the \"chicken\" they serve in many of their dishes).Every once in a while, I crave General Tso's (or whatever they call theirs) or an order of Orange Chicken.  Now, I no longer expect anything but crappy quality, breaded chicken in those dishes from anywhere other than J.Liu or Molly Woo's, but whatever they're now sourcing for this \"chicken\" is a joke.My wife and I have been going here for years.  Her mom has also been going for years and they are in the same boat.I think we've essentially sworn this place off as a family, and we've now resorted back to eating at Fortune on Olentangy and Hunan Lion on Bethel.  They may cost more, but I simply cannot eat whatever garbage Thai's is serving up these days to keep their prices low."], ["Brandi H.", "I had been on the hunt for GOOD chinese (I know it isn't chinese, but I can't distinguish between one brown-sauce and veggie dish with rice from the other), and was elated when a friend took me to Tai's a few years ago. Before that, I had been sampling the many asian cuisine putting-food-in-your-face-spots on High St along campus, and had not had much luck in replicating my favorite places back home.Then a blessed friend with a blessed car drove me up Lane Ave to the end of my search. Tai's is clean, it's open, it's nice, and man, is it good. The portions are HEAPING and for $7, I have three meals. Even if I'm allowing myself to go to town and eat more than I should, I can't finish the whole plate, no matter how hungry I am. Annnd this is a beautiful thing. I like to divide my entree by the number of resulting meals and make that the price tag (it alleviates the guilt of eating out) and at Tai's, you get the biggest bang for your buck out of any of your casual dining joints.I haven't tried the sushi but I hear nothing but good things. I tried the Homestyle Tofu recently and it is chock full of fresh veggies and a ton of sauce, just like I like it. I've always enjoyed the over dramatic sports team pictures on the wall from area high schools and OSU (no one holds a bat like that, lady OSU softball player).And after they renovated awhile ago, I can't get over the random-as-eff, humorous tiki/Easter Island fireplace dominating the wall.Tai's - the key to your cravings for all things rice, seaweed, and tiki."], ["Helen S.", "They cater Tai's at school all the time, and it's decent. It's still greasy and unhealthy, but sometimes it's just what you need, so when it's free at an event then why not. I also heard that they have some kick-ass chow fun, so I came here the other day in person to explore this.I ordered the Sichuan chicken chow fun and that was good. Not amazing, the flavors were good but it was in desperate need of less grease and more veg. I also tried bf's regular chow fun, which I didn't like as much flavor-wise but it had more veg, so I ended up stealing most of the vegetables from his plate. Their eel bowl however was upsetting. It was such a teeny portion of eel on an enormous bed or rice and lettuce :( No me gusta.Overall, Tai's is solid. What they have going for them is huge portions of food for low prices (my chow fun lasted me for two more meals and it was under $10...). It's not my favorite but I would return.P.S. their tiki drinks menu looks bomb...would like to try"], ["Andrew Z.", "Tai's Asian Bistro has never done me wrong. They have huge portions and are pretty inexpensive. Everything is usually about $7 and for the size you can't beat it. It's always pretty busy when I'm there but that never seems to affect how long it takes, always very quick. The sushi isn't the best in the city but it's good and again, for the place it's always just right. The miso soup is huge, the salad is gigantic, I definitely make it a point to get in here whenever I can. They also have great beer prices too, I think it's $10 for a bucket of 5 beers if I remember right. Might only be during games, but still not expensive during other times. Was there the other day for takeout and I got lettuce wraps, Dan Dan noodles, and orange chicken. Huge portions and all for only $22. Made for lots of leftovers too. Also the pad tai is always good and large. They have a covered patio for outside dining on nice days. Check them out."], ["Jen T.", "I haven't been to Tai's in a while, and I probably will go back, but I will be a bit more selective about what I order.The pad thai is a definitive favorite at this place, but I was in the mood for some orange chicken, which I've had before.  In the past, it was pretty standard chunks of chicken (processed chicken in typical Chinese restaurant fashion), but this time it was WEIRD.  I have never seen chicken pieces in the shape of something that looked like skinny ginger roots.  Maybe a lot of the \"offshoots\" were just breading, but appearance-wise, it was kind of unappetizing.I went to the restaurant prior to the dinner rush (5:30) because I know how crazy this place gets.  It wasn't very busy yet, but it took a long time to prepare my meal.  There was a dad sitting near me who brought in his two boys for dinner before heading to a gymnastics class, and by the time they all got their food, the boys had 5-10 minutes to wolf down their dinner before their class started.  I could perhaps understand the lack of order turnaround time if the place was super-busy, but it wasn't.Also, I sat on the patio.  I needed to ask a server to wipe down the tables.  I think this is an area that should be regularly tended to, regardless of how busy the restaurant is.  The server seemed a bit overwhelmed to have to tend the patio area by herself.I'm not sure why portion size is mentioned in so many reviews--I think this is \"par for the course\" when I order at a Chinese restaurant.  I'm typically glad to have leftovers, but I'm unsure if I will eat my leftovers from Tai's this time.Tai's, if you read this message, if you've changed vendors for your chicken, please consider changing back.  And yes, while you are a well-visited establishment, consider adding a few more staff to maintain the cleanliness of the dining areas and give wait staff a bit of breathing room so they can tend to customers and not look so rushed.  While I understand this is \"fast casual\", you should always offer customers the best service experience.If you're in the mood for orange chicken, stick with Sun Tong Luck.  And maybe just stick with STL in general--good food, and more importantly, excellent customer service.  Helen pays great attention to her customers and her establishment."], ["Holly C.", "This place has gotten pretty busy nowadays! Their food is ok. I've heard of people getting food poisoning before like years ago, but I've never had any problems. They've also renovated to be bigger and nicer compared to what was there before. Their pho isn't bad, but it's not great. It's good if you want something noodle soup-y. My friend had the sushi, and she liked it. I've never personally tried any, but I might next time. It's a solid choice for food options around the area, and it's never that packed where you have to wait for seating."], ["Maxy F.", "This place is great. Their sushi is fresh and I've tried a few other dishes. I love the sushi here!!Great for carry out. They stay busy, so you can tell they are doing a good job.I definitely recommend this place to anyone in the area!"], ["Christie H.", "Decided to stop by Tai's while in the area for dinner. I ordered the pad thai as per the suggestions here on yelp and I have to say, I'm really disappointed. The pad thai tastes like nothing. It has no flavor at all. They certainly gave me enough for three to four meals but I probably won't even bother with the leftovers. I tried to amp the flavor with a squeeze of lemon and that didn't even help. It doesn't resemble the flavor of any other pad thai I've ever had."], ["Brandon Heights Yelper S.", "My favorite Thai place in Columbus. The dining room works, but I think carry out is the way to go here. I like the chicken lo mein and honey chicken. For an appetizer, you can't beat the pot stickers. However, the place can get disorganized and overwhelmed with orders at peak times. Be clear about your order and try to be assertive but polite when you go to pick up. Hopefully, the throughput problem will improve soon (but it's been this way for years). You have to be patient and persist through the difficulties that can arise in trying to pick up an order at times."], ["Dru B.", "Order from this establishment multiples and absolutely love the food. I usually get the chicken pad Thai, spring rolls and pot stickers. They give you extremely large portions so if you eat small then one order can be a meal for two people. Easy way to save money but they keep their prices reasonable.The staff are extremely friendly and will crack jokes. They are generous with fortune cookies and can quickly make anything even if you add it late. Can't say anything bad about this place except STAY OPEN LATER! Haha"], ["Candace L.", "Tai's is always busy! I'm rating them a 4 for the fact that their service is good, your order is cooked at a reasonable time, always fresh and hot, large portions, and if you're eating in, they'll bring out your food to you. In terms of flavor, I'd give them a 3. I've tried a few of their menu items including:Sushi, Chicken with garlic sauce - Sauce is very sweetChicken with broccoli, Beef Pho - Broth is tasty, beef is cut way thicker than used in traditional pho, Orange Chicken - Perfectly seasoned/fried with great flavors."], ["Andrew B.", "Good service, lots of space. The food was just okay though. My General Tso's Chicken was pretty sweet, kind of soggy, and not very spicy."], ["Lindsay D.", "You walk in and find yourself met by not only the aromas of Asian cooking, but a healthy side of business casual office perfume and freshly sweat-drenched frat boy. The place is more college cafeteria than restaurant, but that's just fine, you popped in for a quick lunch. The menu is filled with tons of cheap options, but almost too many options. You wonder just how well they can get a mix of Americanized \"Chinese\", \"Korean\", \"Thai\", \"Japanese\" and more. A little too good to be true?That's right. You know that old saying, cheap, fast or good; pick two? That overwhelmingly applies here. Its very cheap and served very fast, so it inevitably lacks in the 'good' department. It's not horrible by any means, just kind of...alright. The dishes are huge, easily providing 2-3 meals afterwards. The veggies were ample and seemed fresh. The crab rangoon was pretty awesome (but you only get 4!)My problem with this place? The flavor and the tofu. The dishes are either spicy hot or bland with very little in the middle. My first time around, I ordered General Tso's tofu. I like a little spice, but after too much, I just become a wreck of nasal discharge. It wasn't long before I hit that threshold. And the spice was just spicy by itself. No savory flavor backing to even it out. The second time around was the Homestyle tofu. Again, just kind of...blah, like they just used a splash of soy and that was it. As for the tofu, they - unfortunately - reinforce that stereotype of it tasting like a bland sponge. Tofu is supposed to absorb the flavor of whatever you cook it in, but it has to be drained first. To me, it tastes like they just cut it up and toss it in. The pieces are juicy, yet flavorless and never really take on the taste of the dish. Even after reheating, the tofu is just chewy and bland. I'm sure if I ate meat, I'd enjoy more of their food, but I don't. Overall, I want to like Tai's because of the price and the portion size, but the delivery is just...blah."], ["Johaun C.", "I really think Tai's 3.5 rating is a result of yelpers ordering the right--or terribly wrong--dishes.  Granted, I haven't been back here in a while, but when I frequented this place religiously, I had the benefit of having my friends point me in the right direction (back then, they didn't offer sushi).  That brings me to another point, people: if you're gonna get sushi, do it right and go to a sushi joint.  While one could totally argue that sushi falls under the \"asian bistro\" umbrella, respectfully, I would beg to differ as sushi is so profoundly different compared to typical rice and noodle dishes.Anyways, back to my point.  Actually, I have two of them:  Dan Dan Noodle Bowl and Sichuan Chicken Chow Fun."], ["Ashley C.", "Do NOT order their curry tofu. There's a reason it was the last thing listed on the menu. Bland, blah, bad."], ["Lea P.", "More cafeteria than café.More dining hall than diner.More mess hall than... well, there was mess, too. Entire sushi bar littered with litter that never got picked up during the 20 minutes I was there. And sure, they were busy, but it made me decide at the last minute to get takeout instead of sitting at the bar surrounded by someone or something's remains for a whole meal.So when you go in, it's like swimming north up the Sea of Japan. You have Chinese food on the left and Japanese food on the right, with separate registers, menus, and preparation areas. Hopefully, you aren't craving lo mein with a side of edamame because the place is not set up for such mingling of cuisine. You've got signs for Japanese beers, a large flat-screen TV, and a pair of random katanas behind the register on the Japanese side.I couldn't help giggling at them every time my eyes drifted up that way. It was like this meager attempt at authenticity in the midst of the Asahi-scented undergrads making sure they have enough grease in their diet.I ordered from the Japanese menu -- sushi and tempura. The wait was probably about 15 minutes, during which time I saw a lot more beer than soda get pulled out of the big Pepsi fridge and learned what it smells like when you're cooking about four different kinds of Asian food in one closed-in space.The service I received was good. The woman who took my order was somehow able to keep track of a variety of customers. The order goes to the cooks, and then they give the prepared dishes back to her. She matches them with the orders, put them together as needed, and brings them to the customers. No idea how the non-takeout is organized.I brought it home, and the sushi (rainbow roll, to be specific) was actually pretty good. I mean, I'm not writing home about it, but it was comparable in quality to what you might find in the Whole Foods fridge (the one on Lane, that is -- the one in Dublin is much better for sushi) and was a couple of bucks less expensive and a lot fresher.The tempura, however, was oily, oily, oily. The veggies inside were good (especially the sweet potato), but there was nothing light about the batter. I can feel it settling at the pit of my stomach even now.In sum, I might return for sushi. The price makes it worth the wait. I would have to think twice about getting anything cooked here, though, if oil is involved."], ["Jina P.", "Even though their food is not authentic asian food, I still like their food a lot. Big portion, tasty, cheap, fast. It can't go too wrong I guess!"], ["Hope W.", "It was crowded when I went, and having food served to your table seemed to be chaotic, but the food is great.  I had the cucumber salad with chicken.  Yummmm. The pad thai was also really tasty."], ["Alex F.", "This place is a gem. A diamond in the rough. l was beginning to think that you could not find fresh veggies at a cheap Asian restaurant but I was wrong. This place does so much business that everything tastes like it was just bought from Whole Foods down the street. Everything I have tried is super fresh and tastes great. The portions are insanely big, easily splittable, and they have a sushi bar with a decent alcohol selection. Yes, as other reviewers stated, the line can get long and full of college kids but it is worth the wait. They let you customize your order to your liking and always oblige little requests such as extra rice or sauce. Honestly, I have yet to find a better \"Americanized\" Asian place in Columbus."], ["Keith D.", "After having \"incidents\" at nearly every other university-district asian-food eatery, (Toilet, I apologize for being inebriated enough to purchase Number 2 eatery on a gameday), this is the best in the area. The portions are generous. They are really heavy on the rice, so your meal feels like a 5lb weight, but even ignoring the rice-weight, they give plenty of meat/tofu/toppings/sauce for the price. It is quick and tasty. Sure, probably not the healthiest, but nothing that will leave you hating yourself later that evening. (Or wishing death like some of the previously alluded to meals round campus) My only knock is that they do not have the spice down consistently. I can take all the heat they will give me, and if I order a spicy dish, I would rather be pouring in sweat with endorphins kicking in exclaiming \"Woooooo\" while airing out my burning mouth. This has never happened here, but I have had good spicy meals. Other times, their \"hot\" logo is simply for show. Still, a great place for asian food, and the only one I get on a consistent basis in the university area."], ["Sayak R.", "Very good food and the portions are usually humongous. I tried the Pad Thai, and they serve it with pieces of lemon. The taste was really great, and I ate the leftovers next day at lunch."], ["Jamal L.", "The food is good and the portions are great. But awful careless service is what you get in return. This is the third strike for Tai's. Good luck getting your food if you place a carry out order."], ["Mansi R.", "i miss tai's ever since i moved out of columbus! everywhere I go, I try to find a replacement for this place but i am yet to succeed. The food is as good as it gets for a take out chinese restaurant. My regular order was the kung pao chicken and chicken fried rice (for my husband). Loved it! WE have also tried the tai's chicken, pork fried rice, dan dan noodles, singapore noodles, pad thai...and all of them are quite yum. The quantities are also large - usually will last for at least two meals even if you are a big eater. it took us two years in columbus before we discovered this place. dont let that happen to you - go try this place now :)"], ["Alex C.", "In terms of the food, this is probably the most authentic Americanized Asian food I have here in Columbus. Their fried rice and lo mein noodle are as delicious as the one from my home town. Others such as pad Thai, Cantonese chow fun and Chicken cashew are also my favorites.As a grad student, the price and the size of meal they provide really save my pocket. Luckily, my office/lab is very close to the restaurant so I usually go there and get one meal for my two-day lunch.Now they even have mini Jazz music band performing on Friday evening (not sure if it is every Friday). At least I have seen them a couple of times. I really enjoy the food and music there. Since last year, they have expanded their business with a Japanese food section. I have tried a couple of times (katsudon, soba). Not a big fan for it, but their origin Thai Asian food definitely can win 5 stars from me."], ["Emily M.", "Hands down best Chinese in Columbus. Note-not authentic but American Chinese :) I am never disappointed with any dish. Last night I decided to try something other than the pad Thai (my favorite and gives you plenty of leftovers!) and went for wonton soup and potstickers. The soup was so good and I could tell the ingredients were fresh. The dough of the potstickers was a little thicker than what I prefer but still tasty!"], ["Ian R.", "This place has really cheap food but sometimes it leaves my stomach feeling off or odd. I really enjoy the food and their patio, I just can't get past having my gut feel twisted for the rest of day."], ["Christopher G.", "As mentioned, its a dining hall experience, with a loud bustling kitchen. While the food is good (typical *Americanized* \"Chinese fair) portions are large and ingredients seem fresh. One recurring problem Ive had, is I always order an egg roll, and nobody in the kitchen \"looks ahead\". Invariably, I watch my completed meal sitting on the counter getting cold, while they start the egg roll. After they serve 3-4 people who came in after me, my meal is ready.And Im not sure they should even have a sushi bar in there...I tried it once, and nothing seemed fresh. Observations since then, show little or no patrons, thus, methinks the ingredients are made up in the morning, and just sit there waiting to be served. A fast turn around (more business) might make for fresher offerings."], ["Katye M.", "I've been to Tai's Asian Bistro before and have enjoyed it, but yesterday was the first time back since they expanded into the space next door by adding a sushi bar. I have now found my favorite place to get sweet potato sushi! The sweet potato sushi isn't just sweet potato, but it includes fried onions and what tasted like cream cheese... It was very good!  I also had the avocado roll, which was also yummy. I'm glad Tai's is near my job... I've already been back! The only way they could make it better right now is if they streamlined the ordering process.  Right now you have to order at a separate counter for the sushi bar."], ["Brian W.", "First off, I hate chinese food!Me and a few friends went here for lunch, I figured I'd settle. I ended up getting a Teriyaki chicken with veggies and rice. ( Asked for all white meat as well ).  Expected your usually piles of gristle, but when the food came, I was very surprised!It was very good!!I don't do Sushi, but the wife said it was awesome!"], ["Jared E.", "Here goes:  there are too many asian places to eat in this town, and too many of them are better than this place.I met a friend here for lunch today, knowing nothing about it.  I got pad thai and some crab rangoons.The pad thai was just not good.  The noodles were overcooked to the point that the entire dish resembled a plate of jello--they just kind of all mushed together and turned into goo when I put them in my mouth.  They were also very oily with little flavor.  I scanned some other reviews when I got back, and YES it was a HUGE portion.  For me, however, I opt for quality over quantity.  This place was packed though, and there seems to be a huge following at this place.  Both in terms of people and in huge-ness of the people who eat here.  But, we're Americans and taste doesn't matter as long as you are served a family size portion at a low cost.I also didn't like the crab rangoons.  These are one of my favorite American-Chinese goodies, but these things were not good.  To start, they were cold.  They also just didn't taste good--the filling had too much imitation crab and too much of an onion flavor.  They also were \"hard\" and had an oily taste which means that the fryer oil needs to be changed and they are not frying them at a high enough temperature because they have spent too much time in low temp oil soaking up grease.  The sweet and sour sauce served on the side was also bad--tasted just like corn syrup with neon orange coloring.  I tried to make crab rangoons at home once, and they turned out awful, and these rangoons at this place reminded me of my homemade ones only worse.I can't see myself returning here.  The food wasn't even \"okay.\"  I was really hungry too, and this meal left me disappointed and upset that I wasted a full stomach on bad food.  But, of course, if you are in to HUGE portions and you don't care about quality, hit this place up.I just hate being disappointed.  It is 70 and sunny and it's only March 12, so the weather is helping to counteract my sadness at how this place ruined my lunch."], ["Stephen P.", "I have warmed up to Tai's- I wasn't very familiar with chinese food, so I would get quite intimidated when ordering it. However, Tai's has a large, simple menu with good food descriptions. The sushi is great, and so are the entrees. I like the lo mein and the sweet and sour chicken- and the portions are huge. An entree can last me 3 meals easily! And it's very cheap. The lo mein combo is $8- can't really beat it.If you are in a hurry, you may want to call ahead. Sometimes when it gets busy (and it almost always is, at least the times I go) you can wait 10 minutes or longer on a take-out order. If you have a 30 minute lunch break calling ahead would definitely be best.All in all, definitely a fan."]], "Fusian": [["Ying X.", "Columbus really has the \"Chipotle-style (insert food)\" thing down! Fusian is only one of the many places around town that boasts a design-your-own-order theme, and it certainly brings a new level of fun to casual sushi! I've only been here a couple of times, but service has been consistently fast and friendly every single time! The process is four simple steps. Choose your wrap/rice (seaweed vs. soy and white vs. brown), choose your protein, choose your veggies, and chose your sauces/toppings. You can also opt for different types of protein (i.e. half salmon, half yellowtail), although keep in mind that they'll charge you for the price of the more expensive option.The quality of the fish isn't too bad either (not amazing, but definitely not old or fishy), and you have a good selection of toppings/fillings to choose from (avocado, cucumber, cream cheese, etc). I never thought that sushi could be a fast food, but Fusian has not only proven me wrong, but also convinced me that it is a brilliant option for fast food!"], ["Lin H.", "I'm really happy with my experience at Fusian! Like everyone else has said, it really is a Chipotle-style for sushi rolls. I enjoyed building my own tuna roll, and found the staff to be helpful when I told them I'd never been there before. One thing I do think they need to improve on is their presentation of food. Honestly, the display layout is just not working in their benefit. It is similar to Chipotle or Piada, but with sushi ingredients it looks meek and limited in options. Also, the way the ingredients were prepared was not appetizing. For example, the green onions were long and cut into 3-4 inch bits and looking wilty, and the avocado was already cut, sitting in the open, and browning. In my opinion, the green onions would look much better if diced up and it would be very impressive if the avocado was cut in front of you. It's the little things that count, essentially!"], ["Jason W.", "Sushi made to order \"chipotle style\".  Sort of an odd concept and not what I expected under the heading of asian fusion.  Everything was nice and fresh and tasty though.  I had spicy tuna and it was very good.  Side of seaweed salad was just OK.  On-par quality wise with the kind of sushi you get in a good grocery store.  The agave flavored ice tea drinks were very good."], ["Jen T.", "I love this place.  Keep in mind that it's not a full-on sushi bar; they have a short menu of wrap, protein, veg, and sauce (think:  certain other fast-casual Mexican joint with the same concept :) ) and the idea is to get people in and out the door quickly, which makes perfect sense on a college campus.Conveniently located about a block north of the Campus Gateway, this is a great spot to grab a quick meal before seeing a movie.  My bf and I were there on a Monday night during OSU's summer break, so the place wasn't very busy.  We moved to the front of the restaurant and ordered our food right away.  The people behind the counter were attentive, although perhaps not as informed as one might like--we asked if the tofu was organic and they didn't know.  We also tried to find out the health benefits of seaweed vs. soy wrappers, but didn't have any luck with that question either (although, asking similar kinds of questions at a Panera, McD's, etc. would probably yield the same result).  However, the staff was able to tell us what paired well and what was popular with the ingredient of the month--mango.  I definitely like that they have a rotating ingredient to mix things up a bit.Just like the restaurant-I-won't-name-because-it's-so-obvious, you pick out your wrap, your protein, your veg, and your sauce.  You can choose to do different combinations of protein, veg, and sauce on each half of the roll if you're looking for a bit of variety.  The end of the line also involves selecting toppings like tempura and sesame seeds.Prices range from $7-$9 per roll depending on what protein you select.  I like to fill mine with several kinds of veggies, which makes the roll plenty full and one roll ends up being enough.I love watching the preparation of the rolls--from the assembly, to using that fancy cutting machine, to applying generous globs of spicy mayo and sweet soy sauce.  The final product is a brightly colored combination, and I think, a feast for the eyes (although, I suppose they could go a tad lighter on the sauces).The dining room itself seats ~50 people, with a mix of small tables for two, to larger rectangular tables intended to seat 8 or 10, so during peak times, be prepared to share one of these large tables.  The decor is kept simple, sort of a modern industrial look with concrete tables and contemporary chairs and benches.Upon exiting, you'll notice that Fusian has different bins for composting, recycling, and trash.  At a Yelp Elite event, we had the opportunity to talk with the creators of Fusian, and they felt that being environmentally responsible was part of their mission.  I appreciate that businesses take extra steps like this to be good environmental stewards.As of this posting (May 2014), this is the only Columbus location, with stores in Dayton and Cincy.  I think the concept could do well elsewhere in Columbus, should they decide to expand.  I don't live near campus, but was in the area for a movie, and I was very much looking forward to a quick, affordable dinner here.  I'm sure other neighborhoods in Columbus would also delight in such an opportunity."], ["Shea H.", "FINALLY got a chance to try Fusian.  It was good... I liked my rolls.  It's just that, I thought the rolls were really expensive to be a fast-food, college-student-run, fake sushi shop.  Four rolls cost about $30 and two of the four rolls were veggie-based.   Mind you, this is a make-your-own-rolls type place... so your meal is not guaranteed to be good.  I don't know what foods compliment each other in sushi-world.  And there were no recommendations on the menu or in-person.  The price pretty much ruin the meal for me.  I couldn't even focus...I just kept looking at the menu and the receipt wondering where I went wrong. Oh- and my rolls fell apart.  Even with the use of a rolling-machine, my rolls were still poorly made.  And Fusian offers no brown rice.The sushi-makers literally looked like they rolled out of their dorm-room bed and came to work.  Wrinkled clothing.  Messy hair.  I suppose that I should just be grateful that they used gloves.And hard-as-hell seats throughout the restaurant.  Narrow walk ways, I would have to stand to the side and wait for others to pass or vice versa.Good luck with parking.  Street parking can be hit or miss.  There's a garage not very far away, though.  Maybe costs a dollar? I can't remember.I wouldn't recommend this place."], ["Chelsea J.", "Hi. My name is Chelsea and I am absolutely addicted to sushi. Haha. No but seriously, let me tell ya, this place is IT. The vibe is very organic/natural. The ordering is chipotle-esk, you go through the line and get your rice, protein, veggies then top it off with your sauce and garnishes. Loved it. The veggies (asparagus, avocado, peppers carrots) are not extra--so pile it up-- but the meat you choose is the price point. It will take you from $7.50-9ish. Very affordable, and I was nice and full after our visit. Fusion gets a.... THUMBS UP :)"], ["Maribeth B.", "Not even close to real sushi. Made me really sick. They add unnecessary ingredients to the food. Why do I have to get my seaweed gluten free?! Why is there gluten in seaweed?!"], ["Michael S.", "Genius concept. Create your own sushi with a Fusian twist. Wonderful staff, great prices (roughly $7-10 per roll), and a relaxing atmosphere makes returning here an absolute necessity. If you're in Columbus, GO HERE!"], ["Matt K.", "Esther C. stole my line!\"It's like Chipotle for sushi!\"That's exactly the way to describe this place as far as the decor and the experience. I guess food quality is something that would really depend on your feelings about Chipotle, but I thought my roll was fine for something that was made to order relatively quickly.Usually when I eat sushi, I'll put away several rolls. That makes this spot good for me for a lunch or snack, but not beyond that. The pressure is on you to create a good roll, but that's part of the fun. Also, they had Mexican Coke with real sugar."], ["Nicole A.", "From UD to OSU, I love this place! So fresh and fun! The spicy mayo and crunch toppings perfect my sushi roll! Love being able to pick whatever I want on it."], ["Gina M.", "I love sushi, but I never get too adventurous with it, so Fusian is a great option. It's cheap, it's fast, and it's not intimidating for new comers to sushi. They also let you load up your roll with as many veggies as you'd like which is great! Every time I've been, the service is great, the food quality is great, and it's very clean. The campus location is a bit inconvenient to get to (very little parking) but otherwise Fusian is a great choice!"], ["Emily L.", "I have recently become a big fan of sushi, and as I am a strict vegetarian ( YES that does include NOT eating fish), this place is a WIN! since at some sushi restaurants I have gotten sick since they have made the  veg sushi on the same plates/ areas of sushi with fish in it, I love that you can see them making the sushi right in front of you. You walk in to a place that looks just like chioptle. You place your order of type of wrap and rice then you just go down the line of what you want to add in. It has interesting adds that you normally wouldnt see at a typical sushi place such as beef, chicken, and tofu. It also has a wide selection of vegetables to add in ( asparagrus, green peppers, red peppers, onions etc) . You can be in and out of this place in 10 mins tops. Also its REALLY well priced, I can get a 9 roll sushi for $6.00, and its large too!"], ["Kenny Y.", "I do like the concept of this place.However, in order to make rolls efficiently, Fusian's sushi rice is prepared in a way such that it is particularly sticky and easily molded.  By doing this, the sushi rice tastes somewhat stale, kind of like the sushi you would get in a college cafeteria.  Also, they don't add much fish to the rolls, such that you really taste more rice than fish (unless, of course, you pay extra for double fish).  As for the price point, I think it's pretty reasonable.  Get a lot of extra veggies in your rolls to make it worth it.If I was a student here, I might come here for quick, customizable, cafeteria-like sushi.  But as a visitor to Columbus, not really worth it."], ["Holly C.", "Why wouldn't you like what's essentially a sushi cafe where you can order sushi to your liking as if you were at a Chipotle? If you're a sushi fan, this is definitely a place to check out. The prices are reasonable, and you get a lot of different choices. The variety is what keeps food from being boring and you can enjoy a variety of combinations every time you go. Whenever I'm in the campus area, I like to stop by because I prefer cooked sushi so I get the steak or shrimp as protein, fill it with assorted veggies, and get sauce drizzled on top or on the side in a cup. Certain toppings or additions are an extra charge so be sure to pay attention to that. I love adding masago (+$1) to top it off. It creates awesome texture and flavor!"], ["Lindy K.", "I was really excited to try sushi in Columbus, particularly a place rated so high...but I really don't  understand the high ratings.  Maybe this would be a good place for people who haven't ever tried sushi and are kind of nervous about it? Or don't actually like sushi. I don't know. Nothing seemed particularly fresh-which is pretty important for sushi. And nothing was particularly flavorful or interesting. You can get better sushi at the grocery store for pretty much the same price or cheaper. The place is clean and the employees were nice, but since this rating is for the food, my advice is to pass."], ["Andrew W.", "Fusian can be described as nothing shy of...nifty! More and more I see stores branching out into \"Chipotle-style\" restaurants, but I never thought I'd see the day where we had made-to-order carryout sushi. The restaurant is bright, the people are friendly and the food is tasty, what more could a young ingenue ask for?Every time I go into Fusian, a smile is immediately put on my face by the awesome employees -- not to mention the prospect of a tasty meal. There's a myriad of options when it comes to picking your fillings and (my favorite part) seasonal veggies! Yum-o, indeed. If you're looking for a fast, delicious sushi entree; Fusian is your place. Is the sushi going to be gourmet? Nah. Are you going to be enjoying your sushi within five minutes of walking into the store? Probably. Will your taste buds tingle and will you be left satisfied with a fresh, locally sourced meal? Definitely."], ["Lea P.", "This is gonna sound weird, but the more I come here, the less I adore it. Weird because if that's the case, why do I keep coming? I guess because I want to get back what I remember from my first few visits.I was first at Fusian for a fabulous Yelp event a while back and was anxious to return and rate it on its own merits. The concept is terrific: build your own sushi roll out of adequately fresh ingredients, including but not limited to raw fish, and embellish it with a selection of toppings. Have it made to order, have it fast, and have it cheap. What's not to love?For starters, not all ingredient combos are fabulous together. I find as a \"seagan\" i have more options here than I have at Chipotle or Bibibop, so I get something different -- sometimes radically different -- every time. And they aren't always awesome. Since I've never had a disappointing combo at those other types of assembly line fast food joints, it would be great if the same were possible here. I could get a five-star sushi roll every time I came here, but even I have a tuna-avocado roll limit when the options are so close to infinite. If I stick to the same thing, it should be because that thing is that great, not because the alternatives aren't.So I'm not really a fan of the shrimp for the sushi, I think. Have yet to be impressed with the sides I've ordered. The miso soup, for instance, is not very flavorful; I've put soy sauce in to jazz it up. The seasonal veggie is hit or miss. Right now they've got bean sprouts there, and those could potentially be spiffy with the right combo, but last fall's sweet potatoes? Well... as I said, I get experimental here. And those things did not belong in my roll. They might have belonged in someone's roll. But not mine. Finally, I'm not crazy about the soy wrap. They recommend it for sushi beginners, but I don't think it's going to \"wrap up\" any sushi converts, honestly. I found it bland, with a texture that did not allow easy teeth-sinking-into like seaweed does.I'm gonna keep going back, though. Because it is entirely possible to get an A+ roll out of the place. The problem is that I've only done that by playing it safe, yet playing it safe is not what a build-your-own place is designed for. And I'd need to admit that there's still something *fun* about building your own. And the price justifies the risk when there's fun involved."], ["Victoria N.", "Restaurant is nice and inviting. Everything is fresh and menu is self explaining. Everyone that works there is nice and kick ass! My boyfriend makes me come here everytime he visits from Terre Haute, Indiana. I do not complain. He loves to talk about how amazingly good it is for so cheap!! Even for a big guy like him who needs two rolls. He thinks there should be a Fusian in Indiana."], ["Eliza D.", "Meh. I used to come here because I dug the chipotle style pick and choose setting and the rolls ended up being decent. Hadn't been in to visit for at least 6 months which should be a sign that it was so so. The guy greeting us was scratching his beard with his gloves as we walked in and seemed totally offended when I asked him to put clean gloves on. The carrot and ginger salad was a mess. Wilted lettuce and watery dressing. The miso soup was bland.I love the idea and I love that they employ college kids who need work but I won't be back again. The price to quality isn't worth it."], ["Brian F.", "I really enjoy this sushi spot with a cafeteria style feel to it.  I've been eating vegetarian these past few weeks, and Fusian has some delicious tofu that hit the spot.  I went with the Soy wrap also and most of the veggies.  Mango is an option this month which I would highly recommend.  I opted for wasabi mayo, sweet chili and tempura crunch.  I later decided to grab some wasabi on the side (free of charge) which pleased my chili-head side.  The sweet and the spicy go together so well along with their vegetables, which taste very fresh to me.  Mad Mex used to be my go-to place before Monday movies, but, now that they don't have Monday happy hour, it looks like it's going to Fusian from here on out.  It's delicious, affordable, has a clean interior with helpful employees."], ["Mike B.", "Wasn't quite sure how I would feel about this style sushi, but I'm not necessarily a fan, even though I don't \"hate\" it. The quality of the sushi itself is poor, that's just in comparison to real good sushi, which is what I'm normally looking for. If you don't consider this sushi, and consider it a \"rice roll in seaweed wrapper with mixed vegetables and proteins\", then I would call it at least average. It's still less quality then the bento sushi that Tensuke off old henderson road sells.It's not even so much the quality for me, but more the complete lack of regard for the fish IN the sushi. I got a good look at their trays, and that fish was shredded. Even the lowest level 7-11 grab'n'go sushi in Japan still has expertly sliced fish."], ["Matthew E.", "This place is slightly less selection and quality to picking up pre-made sushi from the grocery store. Rice needs a bit of work but vegetable options were fresh and diverse. Very limited fish options (tuna, salmon and smoked salmon). Don't recommend unless you need a mediocre speed roll."], ["Greg W.", "I don't like sushi, I don't like sushi, I don't like sushi...at least this was the mantra that I kept repeating to myself before attending the Yelp Elite event at Fusian.  Fair warning, that is where my first experience with Fusian was from, but since then I've had a few others.  In fact, I bought a second roll that same night to put in the fridge for lunch the next day!The atmosphere is really laid back and cool; not so much an upscale hoity-toity place as trendy and relaxed.  It fits in well with the entire area it's located in.  I still haven't branched out too far into the realm of different types of rolls, but what I have tried, I've liked.The prices are reasonable (around $8/roll) and you're able to choose exactly what items you want put into your roll.  I'm a fan of smoked salmon, avocado & cream cheese in a seaweed wrap.All in all, Fusian has become my gateway drug into trying sushi at multiple other locations around town, and I can't say that I'm upset by that."], ["Catherine J.", "Fusian is doing everything right.This is not really in the same category as a typical sushi restuarant. Rolls only, with relatively limited options. But! The beauty is in these limited and customizable options. With a curated list of ingredients that you can combine any way you'd like, the product stays fresh, filling, and price-appropriate.Seriously dudes, these rolls are huge.The space is sleek and modern; perfect for catching a quick lunch with a friend. The layout is optimized for maximum seating with minimal feeling of crowded-ness. The space manages to feel light and airy even crammed with fellow nommers.Chipotle style rolls, with some machines to help with pressing the rice and cutting the rolls. Choose your wrapper (soy or seaweed), choose your fish (if using) and other veggie innards, then choose your drizzle and/or other toppings like flakes and roe. Great fast sides available like edamame, seaweed salad, and miso soup. I liked my miso, but my dining mate found it too \"bready.\" Maybe down the line, I'd like to see brown rice as an option, too.I should note that I visited the Cincinnati location over a year ago, and I've been dreaming of a Columbus location ever since. It was an experience that really stayed with me, and I'm happy to get my fix nearby!"], ["Patri S.", "Best place for sushi. Love it"], ["Luke T.", "Sushi done chipotle style. Basically, if you want to get into the restaurant biz these days, you just think of a food and do it the way chipotle would, and bam! Successful restaurant. When you do sushi chipotle-style, you end up with weird things like chicken and steak rolls. The only raw options are tuna, salmon and yellowtail. Smoked salmon is listed under raw, but I'm pretty sure that's not a fish. In fact, I think it might be smoked. Choose a wrap, a protein, some veggies and toppings and you're done. You end up with about two rolls for $6-9; not bad. They have some fancy roll cutter that does the cutting for them, which is kind of lame. And, like chipotle, they should serve beer!!!The roll was just fine, decor is clean like you'd expect from chipotle imitators, workers wearing Columbus shirts. The manager came up and interrupted me while I was taking the only bite where I tried to eat a piece in two bites instead of one so that was a messy embarrassing moment lol. I could come back, but for sushi, I think I prefer the real thing."], ["Brad S.", "Of the two choose-your-own-adventure sushi spots in town, I prefer this one.  There's more variety of ingredients, both to go in the roll and on top (love the sauces!), and I think you get more for your money here too.  For about 9 bucks, you get a 10-piece roll with nice quality fish, tons of veggies, and delicious topping sauces.  It's miles better than grocery sushi, and approaching the quality of some sit-down sushi elsewhere. The decor is fun - I love the variety of tables available, it makes things seem much less sterile than they could have been in this part of campus."], ["Zain K.", "This place is pretty fantastic.  It's basically the Subway or Chipotle of sushi roll places (okay, that doesn't do Fusian justice at all!), in that you pick your wrap, protein, veg, sauce, and toppings, and it's rolled, cut (I want one of these machines...), plated (or boxed, more accurately) and served by friendly staff.The prices are a little lower than they would be at a typical sushi restaurant, and you're not bound by preset concoctions (for which reason I rarely eat rolls at sushi places), making this a win on at least those two counts."], ["Matt W.", "I like it!As you've heard from just about every review, it's \"Chipotle-style\" techniques applied to sushi. You choose a wrap base (maki or tofu), protein (or tofu), veggies, and sauces. The roll is completed, then you can grab a drink and several pre-made sides.I went with a tuna roll, tofu wrap, carrots, cucumber, avocado, jalapeno, and some sweet chili sauce. Yum. I also liked the carrot & ginger salad, but it's basically just a green salad with ginger dressing. I was hoping for something where the carrot was the primary ingredient, not just an accent.Prices are pretty reasonable, especially if you're just getting the roll, and the staff were good about letting me figure out what I wanted without rushing me through. My only complaint is the location - they're tucked into the side of one of the Gateway buildings, and it's a little awkward to find them or park if you're not already looking. Still, if that's the worst thing I can say, they're in pretty good shape."], ["Keith B.", "Chipotle sushi!I had reservations about this place. I was expecting to leave with that \"I just swallowed fish oil pills\" in my stomach feeling, and having mediocre sushi rolls.I was wrong.$6-9 (or more, depending on ingredients) for two rolls. Not bad! And you can do half and half for your meats (and yes, for you \"non-sushi\" folks, they do veggie, chicken and steak sushi).I like the idea because they have a few items I don't think about ever ordering when I go out for sushi. I never think to \"build my own\" roll, but they take the hassle out for you, and make it a fast process.So, it's sushi, Americanized. Streamlined. Efficient. You pick, they build, they roll, machine cuts, and you pick your sauces.The only downside is the location. I seldom go to South Campus Gateway for anything, and the \"build your own roll\" may not be enough to drive me back-unless a friend insists we walk down there from Clintonville. Who knows!"], ["David M.", "Love Fusian. As a fellow UD grad, I'll always choose it for my sushi. Staff is kind of overly friendly/hipster-ish, but the sushi is amazing, as well as the spicy edamame."], ["Edie D.", "The first thing you see is a card with all the vegan/allergan ingredients...which is so amazing!  So many restaurants that have a \"heathy\" image have no clue what they are feeding you and have to go look for a huge, dirty binder to let you try to figure out if you can eat something.  But they blew it so sadly by titling the card, \"Are you a PICKY eater?\"  Please tell your management on high that people who might die from exposure to an allergan are NOT PICKY!  Picky is when you will eat strawberries but not raspberries....not when you are trying to enjoy a fun meal out with friends...and not ruin it by having the squad come. Recovering from that little slap in the face, I gained a brand new understanding and appreciation for sushi.  I can't comment on it's artistic quality, but it did taste wonderful and was very reasonably priced.  The decor is almost too cute and missed the mark slightly by not having any sound absorption.  It was very loud, even without loud music playing.  I was there on a Friday night at dinner time with lots of groups of students enjoying each other....so it was fun and energetic, just hard to hear your dinner companions."], ["Diane R.", "I decided to give this place a try after I read the Yelp reveiws. I'm glad I did. Great concept- pick and choose your vegetable, brown or white rice, protein and sauces. I travel 11 states and never ate at a sushi fast food restaurant where you could custom order. I felt out of place because I'm a older woman and I was surrounded by a lot of young students but I ordered to go and took my dinner back to my hotel. I ordered two rolls and I could not even eat the second roll because it was way to much food. Definitely will come back to the Fusion when I'm back in town."], ["Tiffany Y.", "Yes, it's Chipotle style. Yes, it's pretty cheap. But my love for sushi makes this place seem rather sad. I mean, good for them providing students with fast service, choose-your-own-ingredients sushi! But I'm no longer a student and I'd rather have my sushi handled properly. I can see myself enjoying Fusian for a busy work day lunch. But, other than that, I don't think I'll visit again."], ["Elizabeth S.", "Amazing!!!!  Although my osu days are behind me, I go up to campus from the burbs at least once a week.  Really nice kids working there.  Food is made to order and DELICIOUS!!"], ["Molly M.", "Although fish was not fresh, tastes pretty good with crab meat. It is a little pricey to me at least, but I love all these chipotle-like restaraunts that are evolving"], ["Lisa G.", "I have hated sushi all of my adult life.  I have tried it in San Francisco, Honolulu, and a few places in the Midwest.  It always reminded me of being smacked in the face with a wave.  It just had a nasty seaweed and bait smell and taste to it.  And then I tried Fusian.  What a difference soy wrap and non-seafood filling makes!  I would go to Fusian every day if it were closer to my house.  Great stuff!"], ["Jasmine M.", "Not \"real\" sushi, but delicious nonetheless.  I got the surf & turf and boyfriend spicy tuna, both were huge and yummy!"], ["Allan W.", "HOLY HOT SWEET MOLEY! This place is so good it will make you wanna slap your mama. Seriously- don't bring your mom here- you'll end up slapping her. It's innovative and fresh- will most certainly return."], ["Scot A.", "Sushi has never been my favorite food....until now!   Now I'm stuck coming here as I am so totally addicted to the stuff.  It's healthy, not expensive and a great way to get a meal fast.  Scot Abplanalp"]], "Rishi Sushi Kitchen & Bar": [["Jen R.", "I was so excited when I heard the owners of Moshi (my favorite sushi in Columbus) were opening another restaurant featuring asian bar and comfort food. They serve a lot of items that you will find on Moshi's menu (sushi panini!!!!!) and many many more that you won't. It's too hard to pick one star of the show but some contenders (aside from the must try sushi panini) are their ramen (warm, hearty goodness) and their burgers (so big, you need a strategy to consume without embarrassing yourself in public). The atmosphere and location are perfect (colorful, trendy, and right on the corner of 3rd and Long). I usually come here if I'm meeting someone out who has never been here or prior to heading over to Moonlight Market on Gay Street. Conveniently located around the corner from Spoonful Records as well :)Minus one star for lackluster (and sometimes downright bad) service. But, sometimes it's spot on."], ["Beth S.", "Because Tuesday afternoon in the service industry means days off for most people who work in that area, Boy and I stopped here while passing through downtown on my day off. Had heard from a friend about her visit here so I wanted to see what they turned the old Fleur champagne bar into. The dining room was a little cramped in the long stretch that they had between the alcohol bar and sushi bar. I just wonder how much use the upstairs seating gets...Our server Vanessa was very pleasant and conversational. We started with Edamame hummus. It was pretty bougie... Boy made fun of the 'gluten-free' rice stick things & I agreed that the cucumber sticks could have been fresher. I had a wedge salad and Boy got ramen soup. He said the soup reminded him of what he'd eaten before in an airport in Korea. My salad was a salad. Considering portion sizes, they seemed on par to something you'd typically find in the city, where people don't want to take carry-out boxes back to the office.My only advice would be to make sure that your umbrellas go up on the patio. Nothing says \"we're closed\" like a row of closed umbrellas on your patio on a gorgeous August afternoon in the city!"], ["Anna L.", "I have been craving some good ramen since being back in Columbus. I had realized that since I've moved to the Midwest, I have yet to have ramen with a soft boiled egg!  Looking at pictures and reading reviews of Rishi Sushi, I had high expectations for this place. Was I finally going to find ramen equivalent to what I had in Los Angeles & San Diego?! I was about to find out....Parking was unexpectedly easy, and I was able to park right in front of the restaurant with the metered parking. Coming in on a Tuesday night, the place was not packed. I ordered shrimp tempura sushi for a starter and it was excellent! The roll seemed smaller compared to other rolls with similar pricing at other restaurants though.Moving onto the ramen. I never had ramen served in a stone pot before. They have usually been reserved for my Korean rice dishes. Judging the presentation, it was sloppily thrown together. I couldn't even find the eggs at first! They were flipped over making me lose the yolk. When I took a bite into an egg, it tasted like pure alcohol. I was not what I expected in my ramen, and at this point I was already feeling over it. Noodles were over cooked and felt like I was eating baby food. There wasn't much right going on with this ramen, though I did enjoy the pork and its tenderness. Because this ramen was one of the saddest I've had in a while, I didn't even feel the need to finish it. Overlooked noodles really ruin a dish.I was disappointed, and I am still in search for ramen that reminds me of home."], ["Gina M.", "I was SO excited for Rishi, and unfortunately I was disappointed with my visit. It was my first pick for Restaurant Week 2015, and sadly it didn't live up to expectations. For $25, they had a 3-course special for restaurant week, which seemed like a good deal. I gathered some friends and headed over to Rishi around 7:00 on a Tuesday. We sat out on the patio because the weather was nice; I was pleasantly surprised to see some open tables there. The patio was a good idea until the umbrella for the table fell over and almost killed me. But I can't be mad at them for that, I'll say blame the umbrella directly. But anyway, after the umbrella attack, the server came back to take our drink/food orders, and I chose the 3 courses from the restaurant week menu. An appetizer (salmon sushi panini), a regular sushi roll (California), and an entree (pork ramen). A friend I had with me is a vegetarian and does not eat fish. She wanted to order the chicken teriyaki and replace the chicken for tofu. The server said that was not an option so she requested all veggies in a teriyaki sauce. When her food came out, I was shocked to see a pile of rice with 4 slices of sauteed pepper laid over it, no sauce. Then they brought out the chicken on the side with the sauce on it... Needless to say, it wasn't what she requested and they weren't very accommodating to our vegetarian friend.After our party of 4 put in our orders, we waited for probably 30 minutes before our appetizers were brought out. At this point I was very hungry and hot from having to ditch the shade of the umbrella, so I really enjoyed my sushi panini. One positive note about Rishi is the originality of this sushi panini magic! It looks cool, it's fun to eat, and it tastes good! I would definitely have one of those again. Unfortunately though, the good food stopped there in my opinion.Our sushi was brought out about 15 minutes after our appetizers, and my sushi roll was about half the size I was expecting. It was totally average, nothing special to report. In fact it almost reminded me of the little sushi rolls you can buy from Giant Eagle... not something you would get from an authentic sushi restaurant.On to the entrees, we received those 20 minutes after sushi (we've been here well over an hour at this point if you're keeping track) and I was not impressed with the ramen I had been so excited for. Granted, it might be me, I might just hate ramen, but I thought it was incredibly salty, and it tasted almost dirty. I was expecting a clear broth similar to wonton soup, and the broth was almost more of a stew with a thick, goopy sauce. The pork was fine, but it was very fatty and not very flavorful.Our server did apologize several times for the food taking a while, but if you can't keep up with a full house knowing that it's restaurant week, then you need to re-evaluate your staffing. A party of 2 who came in after us were told that it would take over an hour just for sushi... that is not acceptable.To sum it all up, I was attacked by an umbrella, ate some average sushi and some goopy soup, and my vegetarian friend went home hungry. But I had some time out on a patio downtown with friends so it wasn't a total loss!"], ["Pam F.", "I've only been here for lunch a couple of times, but looking at their full menu, I definitely want to try dinner sometime. The waitstaff are very pleasant, and they have both al fresco and in house dining. The edamame hummus is quite good, as are the Mahi Mahi tacos. Absolutely loved discovering the Sushi Panini!!!  They are to die for, although must be shared because otherwise, I think I'd go into a food coma if I ate all of them (and this is just an appetizer). Plan to go back for one of the Ramen bowls, as the ones I've seen served to others look really good."], ["Shash D.", "I love their Wine drink specials on friday and saturday night. Sushi's are fantastic. Their pricing is very reasonable and great ambiance!"], ["Chloe P.", "The food was amazing! The sushi is very high quality , as well as other entrees such as the Mahi tacos. The server was also very nice/great service. Would recommended this 10/10"], ["Lindsay G.", "My husband and I just had a really great dinner at Rishi!  I'm kicking myself for not going sooner. The ambiance is spot on: contemporary, vibrant, inviting, and clean.  We were greeted by a very friendly hostess, as well as the smiling bar tender as we passed, and promptly by our server, who rocked it out from start to finish.  He was prompt, attentive, cheerful, and most of all informative.  He provided helpful information on the sake menu (I never remember what I like, am I alone?!) and described one of the special so well that we decided to take a risk and try a dish we have certainly never tried before.  We started with a BEAUTIFUL and quite tasty presentation of conch, sashimi style.  The protein was thinly sliced and fanned out along the conch shell itself along with an orchid.  It turned out to be delicious, and to make things even better, when we asked the silly question if we could keep the shell for our preschooler who has been asking if someday he can hear the ocean in a shell, he gladly accommodated us by cleaning it out and putting it in bag.  The things we do for our kids!We also tried several other delicious things on this visit.  The sushi was on point. It was all fresh, innovative, and delicious.  What stands out to me is an appetizer we ordered called \"sushi panini\" which is rice patties acting as bread, coated in panko bread crumbs, and fried in a pan with your choice of filling; we went with tuna and I'd recommend you do the same.  I look forward to returning with my friends sometime soon.  With 3 different palates and food restrictions, we have trouble finding a place we all like. While neither of us ordered ramen nor burgers, their presence on the menu makes it easier to please a crowd.  Can't wait to return!"], ["Rachel W.", "I am not a sushi person, but have had burgers here 3 times now. They have this burger (I think it is called Morning something) that has a fried egg and some other shredded veggies on top. It comes with fries. It is really good, though stacked super high and the bun is high too, so don't get it if you are trying to appear neat and tidy/impress your boss with your manners.I have always had good service here, and the interior is really cool. Modern and with the whole wall of windows to watch traffic and people on 3rd, it is a nice place."], ["Arvid Y.", "3.5 Stars.I enjoyed the food and drinks at Rishi, but I was not enamored enough to award them 4 stars. Everything was good, but not great. The interior is clean and modern, but somewhat cold and impersonal. I do like their concept of Asian fusion however. I don't think i've ever been to a restaurant that serves sushi, ramen and burgers all on one menu. Whether they do all these things well remains to be seen, since I only ordered sushi.We ordered the sushi panini to start off. You get a choice of spicy tuna, salmon or crab. We picked tuna and enjoyed the dish very much. It was actually my favorite dish. The crispy panko rice added some much appreciated texture. It was like eating a deep fried sushi roll.We also ordered two sushi rolls to share: J-mynt and Mr. Kim rolls. The names are pretty random. The rolls were just okay. I think the habanero salsa on the Mr. Kim roll overpowered the actual taste of the fish. A pet peeve of mine is overly dressed rolls. But for people who like spicy sauces on sushi, this may be your place.Another reason for the 3.5 star rating is the price to quantity ratio. Even though there are 7-8 rolls per order, the portion size is still on the smaller side. At $14 an order, it may not be the best value. However, their rolls are half-off during happy hour, so you should visit during those times.Rishi's drinks were actually surprisingly good. My friend ordered an Oasis, which she enjoyed. I didn't take a sip, but she said it tasted very \"coconutty.\" I got the Peaceful which was a whiskey-based drink resembling a Manhattan. It was delicious. The fact that it was garnished with a piece of waffle was also neat, unfortunately the waffle tasted a bit stale. Overall, I had a good first experience at Rishi. I wasn't blown away, but i'll be back to try their ramen and burgers (probably not at the same time)."], ["Andy P.", "VERY price for sashimi or nigiri. Just ridiculous. BUT...ramen is amazing. I've had beef and seafood, and they are worth the effort of finding parking. In this downtown eatery. Beer could be colder, medium selection of wine, and sake selection okay at best. Of the salads, LOVE the beet salad with the vinaigrette over fresh pear cubes. This was my second trip, and there will be more, but not to buy sashimi or nigiri."], ["Sara S.", "just ok. Overpriced. This is the only sushi restaurant walking distance from our house downtown Columbus, so we'll probably be back but I wish there was another sushi place with more reasonable prices."], ["John S.", "Great happy hour specials, if you like sushi rolls.The regular sushi is quite good, too.Great service and great cocktails, including one that has a waffle as a garnish - which was really good.I've been here more than once - rasing the rating! :)"], ["Moriah G.", "Something for everyone! Personally, I love sushi. I know not everyone does but I could still bring a friend to have a burger, some loaded fries and Golden Eggs and Ham. Worth trying!"], ["Richard P.", "Rishi anchors a quiet end of Downtown from a dining standpoint, just north of the end of the Gay Street commercial strip.  It's a welcome addition, open relatively late (11PM) on Friday and Saturday nights, which is nice if you happen to be downtown and hungry, as we were.  They have valet parking right out front, but honestly folks, this is Columbus, Ohio - as long as you're willing to circle the block a couple of times, there's plenty of on-street parking.  It's not like you'll have an epic search for a space like in Philly or NYC.The restaurant itself has a young, hip vibe, although that doesn't mean you'll be out of place if you're not.  One word of warning - avoid the uppermost end of the lower floor in the winter - the staff walks in and out of the doors at that end, and you will freeze when the cold air comes through the doors.The menu is roughly broken into three things - sushi, burgers, ramen.  Echoing Shuo F., this is Asian fusion food, not traditional dishes.  So as long as that's your mindset, it's a pretty decent meal.  My burger was topped with kimchi, Korean doenjang bean paste, and accompanied by truffle fries; basically a burger with an Asian spin, the same way the Crest would give you a burger with a Middle Eastern spin.As for the ramen, how pleased you will be with it will largely depend on your yardstick.  If you're looking for traditional ramen like you would find at Minca in NYC or Yamadaya in LA, this is not your place.  If you're looking for a nice bowl of wavy noodles in soup, it's pretty solid, especially on a cold winter night.  The broth is rich and flavorful, and shows that they care about the way they cook their food.As my wife said, \"It's 11PM in Columbus, Ohio, and I can get a bowl of 'ramen' downtown.  What is there to complain about?\""], ["Lauren L.", "It really saddens to me write this. I have been to Rishi a half a dozen time, and my partner loves the ramen but this visit was absolutely ridiculous. 4:15 on a Tuesday, for at least 30 minutes I was literally the only person in there. I helped myself to a seat at the sushi bar, and was handed menus (not even happy hour menu, when happy hour started at 4:30) as the server was walking away, without an introduction or anything, I had to yell out can I start with a crab salad please? About 5 minutes later the sushi chef hands it over the glass to me. After I had finished my appetizer, and after about 15 minutes of me looking around and making awkward eye contact with the sushi chef, who was patiently waiting for my order, he said \"uh are you ready? Uh okay here I'll just take it.\" He then proceeded to ring a bell and yell up to the two servers upstairs talking. A server came down and looked at the paper I had handed the sushi chef, went to the computer, and just like that was gone again. I would have loved a glass of wine with my dinner, but was never asked if I would like anything....fast forward about 6 minutes..the sushi chef tries to reach out and hands me my sushi. Never once did a server come over to ask me if everything was good, if I would like anything else, or even fill my water glass. About 7 minutes after I put my chopsticks on my plate indicating I was done, the sushi chef again looks at me and asked if everything was ok. I proceeded to tell him it was fine, but I was waiting on my server to ask for a box and my check. Again, he had to yell to someone (a third person, not the one to lay menus or ring my food in) who gave me a check and boxed my food. I didn't even bother to order dinner to go for my family as I had planned on doing. Top 5 worst dining experience I've had, server wise. The food was mediocre. Waste of an hour of my time and $20+. And for that alone, I will not be back."], ["Lea P.", "I happened to be searching for a business that previously existed at this address when I saw the \"coming soon\" sign a couple of days ago. Sushi. Coming soon. That's even better than what I was planning to find. I'm so there.Rishi had their grand opening last night, and I came in for lunch today. It's a beautiful space, very classy. They do sushi, yes, but also ramen and Asian-inspired burgers. I was here, of course, for the sushi. The hostess asked if I had a preference between the sushi bar or a table. I didn't, so she went sushi bar. It's their first lunch open, so while it was pretty empty at 11am, they probably couldn't know how busy they'd get in an hour or two. The sushi chefs said hi as I sat down, and my server Phil was over very soon to give me a rundown on the restaurant: they get fish in three times a week, so it's very fresh; the ramen is made with a two-day preparation process (that means nothing to me, maybe it does to more frequent ramen eaters); and baked goods come locally from the Angry Baker.I decided to go simple and just order the Sushi Lunch, which is a tuna roll and five pieces of nigiri. I got a seaweed salad starter and a cup of hot tea.The tea came with two tea bag options, genmaicha and sencha, both green types, from a brand I hadn't tried before. The genmaicha was good, and Phil was attentive with the extra hot water when I got close to the bottom of the cup.The seaweed salad was tasty, with grapes mixed in.The sushi was definitely worth coming here for. There is an extensive list of specialty rolls I look forward to trying, but for today I was content with the basic lunch. The fish was definitely fresh, and the salmon in particular felt like silk in my mouth. While the sushi chef was preparing it, he asked me over the counter whether I wanted wasabi inside the nigiri. This made me happy -- so many places in Columbus just put it in, and I'm not a huge wasabi fan -- I said no, I'd prefer it just on the side, and thanked him for asking. He said it is normally put in there; I don't know if folks sitting at tables would end up getting the same offer/question.Mid-meal, Phil came over to check on me and asked if I needed anything else. Actually, yeah... the lunch was supposed to come with miso soup, I thought? He looked upset with himself, apologetic: You're right, he said, it was, and he had forgotten to mention that they didn't have the miso in yet. It was his fault, and he'd see if there was anything else he could get me. A minute later he offered salad, which sounded fine to me. Brand new place, there was bound to be a slip-up, and this was it, but the handling is what matters, and that was hitchless.\"Servers,\" said the sushi chef to me jokingly with a wink when he walked away.The salad was a simple one with a very nice dressing. I'd have preferred it before the sushi, and it was a little redundant since I'd had the seaweed salad, but it was an appreciated consolation for the missing soup. I look forward to having that soup next time!The location is split into several spaces: the sushi bar, the booze bar, and two table seating areas, one on the main floor and another up the stairs to a loft-type area. The decor is chic and modern, and there is a large flat-screen TV on the wall behind the sushi bar, tuned to Fox Sports while I was there (boxing and then poker were on). Everyone I interacted with was super-friendly and interested in providing a good meal and experience. I can't wait to be back."], ["Shuo F.", "This is a very modern two-story restaurant with an all-glass side facing the street. I sat on the second story, which was very dark (it was later in the evening) even after the waitress turned up the lights and lit the candles.As for food, this is an Asian fusion place so I'm looking for more interesting dishes rather than authentic cuisines. For appetizer I had the salmon sushi panini, which is basically a spicy salmon roll wrapped in breaded rice patties. This was actually super good! I think I could just order 10 of these to eat!  For entree I ordered the Rishi burger, which is a 7oz burger patty topped with truffle mashed potatoes, bacon, a sunny side up egg, and brown Japanese curry. The burger also came with a side of truffle fries. The presentation of the meal was very nice. A big juicy burger was placed in front of me and they had to give me plastic gloves to eat the burger! However, the burger lacked flavor. All I could taste was the Japanese curry. At least the meal was filling, but definitely not worth the $14.Overall, I think the restaurant had some good ideas for their menu items. That's a plus since it's a fusion restaurant, but the burger I had lacked flavor and was overpriced. I may come back later to try their ramen."], ["Holly C.", "I think of this as Korean, Japanese, and Asian fusion place. The loaded fries appetizers were very good - the kimchi was on point! Seriously though...anything that had kimchi on or in it was so good. Keep in mind that I really like ripe and flavorful kimchi. The oysters were fresh and didn't taste fishy, and the two nigiri pieces that I got - uni and masago - were fresh and tasty. I really enjoyed the spicy crab sushi panini, it's quite innovative, and who doesn't loved fried sushi? My friends thought their burgers were fine, and I had a few friends that thought the ramen was just okay. I tried a little bit of the ramen and wasn't very impressed. It's lacking a depth in the broth of traditional Japanese ramen, but keep in mind, this tastes quite fusion to me. The passionfruit creme brulee could've been a little thicker in my opinion, but that's my personal preference. Overall, I'd say...try the sushi, appetizers, oysters, and kimchi - they were all very good!"], ["Eliza D.", "I struggled with giving this place two stars versus three. The food was certainly good (not great) especially for columbus, but the service is terrible. For starters, our waitress took the pencil off our table and we had to wait until she came back to see if we were ready before we could even begin. She also repeatedly tried to take our unfinished food and box it up even though we had only been eating for 10 minutes. If the staff aren't gossiping in corners they are running up and down the stairs and almost took me out when they didn't see me going up them. The table behind us only got half their order because the waitress \"forgot\" to enter it in. The tables are glossy and the busboys clean them with windex. It's so strong that I couldn't smell anything else when the tables around us were cleaned. Windex sushi is really gross, FYI. I would highly suggest they find an eco friendly alternative. The food was decent. I'd go back if it weren't for the above mentioned."]], "Kooma Sushi": [], "Tai Tiki": [["Meredith R.", "Just met two of my girlfriends here for lunch. It's in prime location, beautiful decor, nice staff. My friends and I were literally the only three people in the restaurant and, unfortunately, the service was so slow (and our order was messed up). The sushi itself was good - not the best that I have had - but good nonetheles. The drink menu sounds delish as well as the other items on the menu.I realize that they just opened on Monday and they are still working out the kinks. I think that it has great potential and will hopefully start thriving as word of mouth gets around."], ["Raymond S.", "Ordered the pineapple shrimp and volcano role. The shrimp was nothing more than super generic sweet and sour shrimp with no flavor other than sugar. 8 pieces of jumbo shrimp just drenched in sugar. The volcano role was just ok...really I already forgot what it tasted like"], ["Bianca M.", "We went for the luau today (8.30.15), everything was great and the staff was on point!  Very friendly and it looked like they all knew what they were doing.I usually don't eat meat but made an exception bc it was all included in the price($19.99). The chicken egg rolls were some of the best I've ever had in Cbus and the crab puffs weren't lacking either.  They really aren't set up for a buffet style meal but they made it work. The sushi was fresh and delicious and the sauce they put on shrimp/pineapple skewers was amazing.  They didn't have too many different items but everything they had tasted great, better to do a few things well then a lot of mediocre items.  First time for roasted pig and I have to admit it was very tasty (salty/sweet).  I did not get to try one of the signature drinks but will definitely go back for that very reason.  I have to add it made me long for the days when Khaki was around."], ["Deanna D.", "Excellent place for a fun dinner out. Loved all of the Hawaiian drink choices. The sushi was very good! We also had the pork shank with risotto & it was excellent! I will definitely be back."], ["S. M.", "I'm struggling with this review. I'd like to give a solid 3.5 stars but I'll round up to four. Pros: the decor is nice, I was expecting more of a Kahiki type atmosphere but this is more refined. Two of the dishes were very good (shrimp pad Thai and the 1/2 and 1/2 roll); the ahi tuna poke was ok but nothing like what you get in LA but still pretty good. The service was also very good. Cons: I hated my drink and only took about two sips of it. I think it was called the island itch or something like that. It tasted like cough syrup yuck! My bfs piña colada was better but average especially when the drinks are around $10 each. It's all around a little more pricier than I was expecting. Probably not a place I'd pick again for a weekday dinner."], ["Annie M.", "So excited for this place to open, but food was mediocre at best  The atmosphere was gimmicky and borderline tacky. Especially for the price. I'll be surprised if this place last more than a year in this location."], ["Rachel K.", "First time trying Tai Tiki yesterday for dinner was excellent! Happy hour was until 7pm (even on a Saturday?! Awesome!) And our table tried crab puffs, egg rolls, and coconut shrimp. They were delicious! Complex in their layers of flavor and cooked perfcectly.  I also personally got the Indonesian Lamb and it too was cooked to perfection, and so delicious. My only qualm would be the service was a little slow but even then our server was very nice, accurate with our orders and checks. Will definitely be going back!"], ["Dan T.", "Interesting drink choices, great atmosphere. The food was delicious. Overall a little pricey but that's to be expected for the short north area. Will definitely come again."], ["Matthew C.", "Needs more Tiki. This place goes out of their way to compare themselves to the legendary Kahiki but it has none of the Polynesian charm."], ["Ryan S.", "If your idea of Asian food is Panda Express then I am sure this place will suit your taste but for those wanting anything remotely authentic, you need to look elsewhere.  The inside atmosphere is fine and the drinks were fresh and likable, if you are into sweet fruity drinks.  The major problem with this place is it is one dimensional, dumbed down food - lots of fried chunks of meat with boring vegetables.  The short north should be about the arts, creativity, the latest trends, etc.  Instead of bringing something of the like to the neighborhood that celebrates this uniqueness I feel as if this place offers suburban strip mall food in a nice atmosphere with high prices.  To be fair they do offer a selection of steaks and fish which no one in our party selected."], ["Rick R.", "Had a drink there and it was quite good. The bartender suggested the Mai Tai and it was delicious. The atmosphere was very cool. Kind of Don Draper meets industrial. Didn't eat but will next time."], ["Mike R.", "The general tai's was really good and plentiful.  The ahi tuna wasabi was fantastic, if a bit pricey. The aloha porkie, a huge pork shank with risotto, is as good as it gets. We also had the spicy 2 in 1 roll as well as the snow white.  Both were great.  The shrimp fried rice was ok, but I'm so used to drowning it in sugary junk that I forget what it's really supposed to taste like.  The ambience is great and I've found the service to be impeccable."], ["Yonina H.", "Pros: quick service, good variety of dishes, fresh ingredients, pleasant interior.Cons: over-eager staff, sake in a wine glass??, too much cream cheese in maki, skimped on the avocado, weirdly cut sashimi, over-priced. Please, don't clap at me that I've cleaned my plate.I'll be back to try the Polynesian cocktails, but I'm more likely to go down to Nida's if I want affordable sushi."], ["Katie L.", "I really enjoyed everything about my experience at Tai Tiki. The inside is beautiful with open windows to allow fresh air and a nice view of short north. They have a wide range of drink choices and great cocktails! The ahi tuna poke appetizer was AMAZING, just the right amount of kick. The service was great, they were friendly, knowledgable about the menu and attentive. Will be back again soon :)"], ["Todd H.", "Ate dinner yesterday here with my daughter. The presentation was a 10. Service was a 10. To be frank the food while looking awesome was very underwhelming. The appetizer sampler was ok, but after that it went downhill. I had the pork shank and it was very blah almost no seasoning of any sort. Very overcooked and had sat in a warmer so arrived warm at best. My daughter had the pineapple chicken ...had sweet and sour chicken at a cheap takeout place? Then you had this....but cheaper.  Tried the bread pudding and it was weird a wafer and some crunchy bits were there to try to give a bit of texture but ultimately failed. There was a strange bit of spicing that tasted very savory instead of sweet...could have been used on the shank. The caramel ice cream tasted freezer burned. If I had to guess I'd say that very minimal scratch cooking is done and most likely all the proteins come frozen."], ["Alex M.", "Had lunch there and overall it was a great dining experience. The drinks my mom and sister both ordered looked very fun (one came in a pineapple, the other utilized dry ice for effect). We ordered 4 different rolls and some pad Thai. The rolls all came on the same plate but the server was able to tell us which roll was which (I recommend the 007 Octopussy). The pad Thai was delicious too. Finally, dessert. We ordered the peach meringue cake and bread pudding. The cake was very good but the bread pudding was out of this world amazing. Service here was spot on. Overall, if you enjoyed the old Kahiki restaurant and are looking for a go-to place with fun drinks and tasty sushi then this is your spot in Columbus. I will definitely be back."], ["Sam B.", "Had the Zucchini Chicken. The green chile sauce had just the right amount of spice. Staff is super nice and so are the owners."], ["Pat A.", "I have been there twice and it was wonderful each time.  We loved the sushi and pineapple/shrimp.  Chef Thong from old Kahiki made a menu that spawned so many fond memories of Kahiki celebrations for my family.  Kudos to all the wonderful staff and especially the kitchen staff who prepare so many memorable dishes."], ["Steve B.", "Just based on your responses Raymond,  your customer service skills are dreadful. The manager should be ashamed of your actions. If need more data of this - see previous responses. Quite frankly, the idea of reviewing a security camera to investigate a matter of food diligence is absolutely absurd. The better response to my review would be accommodating; not damning and questioning the integrity of my response.  Unfortunately for the restaurant and you, people read this on a hour by hour basis."], ["Jordan B.", "Had a spicy tuna roll as an appetizer which was tasty, albeit comparable to what you would get at Haiku or Lemongrass. Will try a specialty roll next time for sure. The Shrimp Pad Thai was awesome, and my \"Head Hunter\" cocktail was strong and fruity. Service was friendly and attentive and the interior cute. Will definitely be back for happy hour."]], "Lemongrass Fusion Bistro": [["Ben S.", "Lemongrass in the Short North serves big portions of Asian food. I ordered the Pad Thai, which can be customized to your preferred spice level (medium spice was not really spicy in my opinion). It tasted fresh and was delicious.I also got the Lemongrass Soup, which I found delightfully spicier than the Pad Thai. It had really fresh pieces of veg cut into it as well as shell pasta.The only thing I didn't like was the appetizer I chose of pan-seared veggie dumplings. They didn't really resemble what in my mind is a dumpling - they looked more like a potato pancake. They were sat in carrots strings and a ginger soy sauce and according to the menu were stuffed with chive.  Overall the place is somewhere I'd return. It's one of those places that has good food and friendly service, but is not decked to the 9 in terms of decor and appearance. It was clean though and the hostess was super friendly, even checking on us during our meal to see how it was. The waitress we had was nice and kitchen service was super fast on a Sunday late afternoon."], ["Ness S.", "We've been to this place a couple of times over the last few months. The first time I went with a lot of expectations because we had heard good things about it, and was somewhat disappointed. The decor does nothing for me. The colors are a bit gaudy and not particularly pleasing. The restaurant itself looks a bit low brow although I wouldn't mind it if the food were great. We ordered the monsoon shrimp and the pad Thai, as well another noodle dish with chicken. The pad Thai was okay (I've had better even in the Columbus area) and the monsoon shrimp was pretty decent. The servers were  friendly and competent. So no complaints there.All in all this is a decent joint with average to above average food, but not comparable to the better ethnic restaurants in the Columbus area."], ["Yen D.", "Came here early August for my sister's birthday dinner so I cannot say that my memory on all the dishes is up to snuff. The service was incredibly sweet and polite, food was decent- some of the flavor fusions complimented my taste more than others (I remember being pleasantly surprised with the fish, not as much with the duck), but overall I was happy that I brought the fam here and everyone liked their food. Presentation of the dishes was also beautiful. =] This review is really for the dessert. Specifically, the fried plantain. (I'd like to note that I'm impressed that even all the way out in Ohio, Lemongrass used actual plantain as opposed to regular banana/baby banana which has the tendency to be more mushy and lack the slightly denser bite and tang.)Mother. Of. God. Okay so I'm from the bay area where fried banana/plantain for dessert is on the menu at many an Asian joint. Some with ice cream, some with other dipping sauces, some with drizzled condensed milk....yea whatever. I have NEVER, EVER, EVEERRRRR had it crusted with coconut flakes (and maybe some other semi-fine nut meal?) and fried before. I'm not sure why no one has ever thought to do that at any of the spots I've been to yet, but damn was MY MIND BLOWN. Even my mom who loves fried banana, was super impressed, and she's from the motherland! O.o Real talk, lol. Pretty sure that because the \"batter\" for the plantain had all that fragrant coconut oil in it already (as opposed to a more high-water content batter), the whole confection stayed suuuuuuper crispy for as long as it could stay on the plate. Before we devoured it.So. Good. Seriously guys, do it."], ["Farrah F.", "I'm up in Columbus for the weekend to visit a couple friends between rotations (and because I've never been here before)! :] It was a little past 9 p.m. by the time I finally got here, so my friend suggested Lemongrass since it was still open, and because we were in the mood for Asian [fusion] food. This definitely fit the bill! :DWe were seated very quickly. Pretty much everything on the menu sounded amazing (it probably didn't help that we were super super hungry), so we ordered...the Chicken Sate as an appetizer, as well as a Chicken Pad Thai and the Lemongrass Roll (spicy tuna roll topped with fresh salmon + smoked BBQ eel), and the fried plantain dessert (coconut + sesame-coated plantain, fried + served with coconut sorbet--I think the sorbet was subbed with vanilla ice cream[?]) for dessert! We finished everything off, and all the food we ordered was absolutely delicious. The only thing I would have changed would be a higher plantain:ice cream ratio. (4 pieces vs. 1 would have been glorious. I would even have taken just 2!)This is on the pricier end of the spectrum, but since my friend and I are technically \"homeless\" at the moment whilst on 4th-year med school rotations, he's stopped caring about student debt, and since I'm not really paying for cost of living this year, that was less of a factor.Service was very prompt and friendly. Our server came back often to refill our water and check up on us, and struck the perfect balance of being attentive but not intrusive (although he was super good-lookin' so I completely would not have minded the latter, har har har). But I digress.Overall, great place to go if you're craving good food! :] If you're vegan/vegetarian (I'm not, but noted it on the menu), they have plenty of different options to accommodate dietary restrictions! If I lived around here, I'd definitely be back for happy hour to stuff my face with sushi!"], ["Jeff S.", "A great fusion place! Everything we ordered was extremely tasty. The soups are great and the appetizers are delicious. The sushi was fresh and full of flavor. We will be returning to this little gem in the Short North."], ["Tara H.", "Love the food, service from the staff, great atmosphere with family and friends.Also fantastic place to have birthday parties and other events!"], ["June K.", "Needed an Asian fix during a long convention and came across this on Yelp. My friend and I stopped in for lunch. The restaurant is nicely decorated, good artwork on the walls. Nicely stocked bar. It was a Sunday afternoon, a bit late for lunch. As some Yelpers have noted, not too many customers.I had the scallops over scalloped potatoes as an appetizer. The lightly coated and perfectly cooked scallops were delicious with the gravy of the scalloped potatoes whose creamy texture was offset by the crispy potato sticks, all garnished with green onions. Though a bit heavy, it absolutely delicious.I was debating between the Kimchi Noodle with Beef in Broth and the Pad Thai. I opted for the Pad Thai due to the rave Yelp reviews. They ask how hot you want the spice level. I asked for 4 of 5. The shrimps were fresh and perfectly cooked as well. The flavors were great but as mentioned above, think I might have enjoyed the flavors more if I hadn't ordered it too spicy. Recommendation would be to get 2 or 3 and ask for Siracha or hot sauce on the side. My friend had the Hawaiian spiced vegetables over rice instead of noodles which they were happy to accommodate. She loved her dish.We were both stuffed but when the waitress mentioned sticky rice and mangos for dessert which did not have any dairy (she's lactose intolerant), we had to have dessert. Hence I ordered the coconut fried plantain that came a la mode. OMG, scrumptious!! Do yourself a favor and don't skip dessert!The food was great and our waitress phenomenal. My tonic water was ever empty. She kept bringing refills before I was even done. Very sweet. She made our experience just so enjoyable.Everyone in or visiting must stop by. It's a nice little walk from the Convention Center too. But if you are driving, parking is next to impossible so do yourself a favor and spend $5 and park on W. Russell. Take a left turn at the corner street where the restaurant is on High (restaurant on left)."], ["Maurice H.", "I have recently moved to the short north and since I work downtown I thought I should finally give it a visit during lunch hour. Lunch menu is very sizable, and reasonably priced. Service was great. Kayla was very attentive with a big smile, and based on her recommendation I tried the Chicken Pad Thai which was very flavorful. She kept my water glass full. I will definitely be back here again and looking forward to checking the happy hour."], ["Erin D.", "Oh wow, why has it taken me so many years to get here? The lunch menu was pretty sizable and I was torn but ultimately went with chicken satay w spinach and rice.The sauce. This is the best satay I've had. Not overly peanut flavor and not uber heavy.My lunch mates went w scallop appetizer. 2 beautiful scallops on scalloped potatoes. It appeared to rival the scallops on dinner menus. I felt a bit envious and looked more delicious than my recent meal at Guild House.Then the zucchini dish with chicken. The sauce was commented as amazing and super large portions.Cannot wait to come back!"], ["Kevin W.", "I've eaten here several times, and the service is always fabulous, whether I'm dining with one friend or at a party with 20 people. Great seafood and sushi. One of the best restaurants in Columbus!"], ["Donna O.", "Lemongrass is a classic. They've been around since sushi and Asian fusion were brand-new and exotic, and they are still executing great pan-Asian cuisine in the heart of the Short North. Their entrance allows a full view of the narrow but deep interior of the restaurant, and the hosts are warm and welcoming. Seating is ample and sitting by the big windows in the front gives a great view for people-watching. Or, you can move to the bar for a more intimate feel (and great drinks).The portions here are ample and are a great value for the price. Lots of fish and seafood entrees in addition to a large sushi/sashimi menu. While Lemongrass' menu has plenty of coconut milk and gentle flavors, the kitchen can change the spice level to suit your taste. The Spicy Hawaiian Duck and the Seafood Basil are especially good, and unique to Lemongrass. This is a great place to dine in the Short North."], ["Martha G.", "Went here for dinner tonight with some of my coworkers.  We were seated immediately and seen right away by our friendly server.I ordered the New York specialty sushi roll and chicken pad thai.  the other girls ordered the avocado and almond roll, the dragon roll and the spider rolls.  I was able to try the avocado and almond roll which was different, but very good.  A raspberry riesling was ordered, but I wasn't a big fan.  I did order the grapefruit cosmo which was pretty good!The pad thai that I ordered was ok, but not the best pad thai I've ever had :-(  I've had better back home in D.C.Sushi here is pretty good, but pad thai may not be their strong suit."], ["Scott J.", "Food is tasty but bar service and hostess/management is the worst I've ever experienced. Our server was great but constantly harassed by the hostess/manager. This women actually interrupted our server while she was taking our order. It took 30 minutes to get a beer. Spicy tuna roll and Lemongrass Trio was tasty and well prepared. Unfortunately the food and prone location cannot overcome the poor service and management."], ["Aron Y.", "We dropped by Lemongrass for dinner one night during our week-long conference. Asian fusion might not be the first thing that comes to mind when you're with 2 Indians and a Bulgarian but it seemed like a safe option for all of us. Actually, we didn't have much of a choice.We approach the place to simply take a look at the menu. But before we could even get to the menu, an Asian lady suddenly popped out from the front door and yelled \"Hello! Come in come in!\" and just shoved us in. It was a total ambush!!! I'm Chinese and I've never been ambushed like this before. So we found ourselves walking towards a table before any of us realized what was going on.As for the food, they were mehhhh. The Pad Thai was only so-so. I didn't think anyone could mess up Pad Thai but this one was below average. We ordered some Veggie Dumplings and a Dragon Roll but both were kind of mehhh as well. Our waiter was really nice but the kitchen switched up our orders and the level of spiciness, put peanuts when we especially said not to, etc. Not too bad overall but not that great either."], ["Mehul A.", "This is the BEST asian food I have ever tasted. Plenty of vegetarian options!!The portion size is jussst right, in such a way that it fills your tummy, satisfies the hunger, but leaves enough room to tempt you for dessert!The entres are packed with flavor. Simply Excellent! Try the Choo-Choi Kabob and Spicy String beans.The almond cream cake is to die for! Also in Summer they prepare a special seasonal mango dessert which the Chef served us personally :D"], ["Jonathan S.", "Went here for lunch one day.  Was excited to try the menu as it seemed great.  The staff was friendly and seated us.  Took our order in a standard time frame.  Then the wait began.  45 minutes after we ordered, we decided to leave as we were on standard lunch.  The wait time was completely unacceptable.  If they expected the wait to be that long, they should have said something.  I will never return here again and can't recommend it unless you have unlimited time for lunch."], ["Amy S.", "Birthday dinner! Tried the monsoon tofu even though im not a fan of tofu.. Their Miso soup has great spices and flavor the texture was cooked to perfection!!You should try it! Would not recommend the sushi there!"], ["Srebs T.", "Wait.. this place is still open? Why?"], ["Kyle F.", "Lemongrass won out on the most excellent end of the rating scale not only for their food but also their customer service. Their food is impressively crafted but more than that, our customer service experience was beyond stellar. Our waiter (Matt I believe his name was) gave us his honest opinion on the various dishes and wines and even brought us something else when my wife found something not to her liking. All the staff was attentive to our needs and friendly too. We will visit again and hope to have more good food and just as excellent an experience with another member of the talented and friendly Lemongrass staff."], ["Scott T.", "Thought food was really good. Service handled well. Food came out very quickly. Very large gluten free options."], ["Mark S.", "Very nice sushi rolls. Love the Lemongrass especially. Great service from friendly, hospitable and dynamic youngsters. Price wise in line as well. I would recommend this place all the time."], ["Aklilu A.", "Great scenery, love the atmosphere and the servers are great. If seafood is your thing, then this definitely the place for you. The best biscuits I've ever had, and the lemongrass soup goes perfect with the biscuits. I've been here before and had great sushi as well, the duck sauce is a bit different but other then that, it was a great experience."], ["Kathryn D.", "Great service, great food, great drinks! I got the Lemongrass Trio- it was absolutely delicious. The appetizer sampler was great as well. Fully recommended!!"], ["Keida M.", "I am afraid people are gong to start thinking I am a xenophobe reading my reviews on local Asian Cuisine.  I can assure you I am not, I have family in Japan, a Japanese sister in law, lots of Asian friends, etc...This being stated, Lemongrass Asian Bistro was pretty much a disaster.  It began with the first step in the door, my nose was assaulted by a cheap rose scented candle, about a foot tall and billowing smoke into the restaurant.  I immediately felt that I was head dunked into my grandmothers undergarment drawer.  Not fun, and TOTALLY inappropriate for an establishment serving food.  Someone needs to inform the owner that your taste buds are 70% dictated by your sense of smell.  Considering I am not a deer looking for the Park Of Roses for a rose buffet, this is awful.  What made the situation crazier was that we were sat next to the Kardashians cousins from Grove City, and the gal was wearing her OWN batch of floral hell.  So needless to say, the whole experience was set to the backdrop symphony of cheap toilet bowl cleaner smell.  Fuck!The lone bright spot was our waitress Samira.  She rocked, and knew the menu well, and was sweet and attentive.  If you go here, I recommend starting off with her!The food was an identical experience to Basil and Nida's.  Meh.  Ok, not competitive with mom and pop Asian joints, and twice as expensive.  We started with spring rolls.  They were good but small.  The sauces were nice, and the presentation was pretty.  Then the fried dough with satay sauce.  This was the winner.  It was basically a fresh donut with peanut sauce.  Simple and tasty!  The entre was a TOTALLY overpriced modest plate of vegetarian curry.  The food was tepid temperature, and I cannot remember what it tasted, or even looked like.  At $15, this is a travesty.We didn't bother getting drinks because we have fallen pray to this a hundred times.  It will be a weak uninspired $12 cocktail...Also of note.  White plastic chairs.  Seriously?  Christ, they have nicer plastic chairs at the Blood Bank in Clintonville.Honestly, even if the food were terrific, the scented candle fiasco would cause me to never set foot back in this place.  Lemongrass is the type of restaurant that would have maybe competed in the 80's when Mark Pi's at City Center was your \"Asian\" experience, and 55 On The Boulevard or La Scalla were your only places to go for prom dinner.  Columbus has advanced light years in the past 25 years, and Lemongrass doesn't even compete with the Pho place in the North Market.Despite what someone may think, I really don't get much pleasure out of slamming a restaurant.  I am well aware that this could be someone's dream.  If someone was sweet enough to cook me a meal, I would be a graceful recipient.  That said, this engagement is costing me my well earned money, and when I pay for a product, I am now investing.  A business owner should always keep this fact in the back of their mind as a driving mantra.  Verdict:  Something more inspiring needs to inhabit this prime location.  Just keep Samira when it changes!~ Keida Mascaro"], ["Victoria N.", "Suuuuuupeeeeerrrrr impressed. My mom and sister LOVVVVEEEEE the pad Thai. They are regulars here just for that dish. I always go with the sushi, and today I had the best roll of my life here at Lemon Grass. I got the dragon roll. It was amazing. I recommend it.The waiter and managers were really nice, too! Great service on top of a great lunch!"], ["Julia C.", "Lemongrass is fabled among the regulars at the annual TNNA trade show in Columbus. I have never made it to the restaurant myself until this year, but now I will add it to my must do list for any opportunity I have to be in Columbus, right after my obligatory visit to Jeni's Ice Cream. The food was fresh, fully flavored, and perfectly cooked. The owner visited tables throughout the evening to make sure everyone was delighted with their experience, and the staff was helpful to newbies and Thai experts alike. The noise level was a little loud, which is why this isn't a five star review: a small discount in an otherwise perfect meal."], ["A M.", "The food was amazing and our server (I wish I could remember his name) was outstanding! My friend and I asked for his menu suggestions and he did not disappoint. He was attentive & fun! I would definitely recommend Lemongrass Fusion to others."], ["Maddie O.", "Service, food and drinks were good. Not great but good. Everything came out quickly and it has a great atmosphere. I only had sushi- which wasn't the greatest in the world but I'm eager to return to try something else."], ["Shayna B.", "I didn't actually try the food, so this review isn't useful for that. Just sat at the bar to have a few drinks. The bartenders was super friendly and they made great cocktails. Next time I will go back for food."], ["Mona G.", "I ate here last night with a large party. Excellent FOOD! I ate every morsel of the Sole! Tonight I had Monsoon Shrimp! I give both dishes a \"6 Stars\". Jessie our waiter was very friendly and attentive."], ["Sam W.", "The food was very overpriced for what was delivered. I got the tuna tartare appetizer and was underwhelmed. The tuna had no seasoning on it, and the mango was under ripe to the point of being hard and tasteless.The pad thai, which got great reviews from other yelpers, was decent but my shrimp were VERY overcooked. For half the price I would rather have Tai's Asian Bistro pad thai (on Lane) any day. Our server did a very nice job and brought out some new shrimp, which were better but still a bit rubbery.My girlfriend got the Trio. The sea scallop was very good, and was the only protein on her plate that was not overcooked, but she only got ONE scallop? Crab cake was mushy and didn't have much crab. Not worth the price of the food. Our server is the only reason I'm giving this a 2 star review and not one star."], ["Michael G.", "When they tell you their \"fusion\" is Asian and Midwest, take that to mean \"Thai food done badly\"."], ["Larry S.", "Excellent pad Thai. Good portions, and efficient service. Bustling on a Saturday night - half restaurant, half bar."], ["Rusty S.", "Great first generation Asian bistro.  Crab Rangoon is actually seafood and not just a mouth of cream cheese."], ["Doug S.", "Great Pad Thai, one of the best I have had. I highly recommend it. The Lemongrass Soup is very tasty. The service is good and the neighborhood is fun to walk around. Lots of art galleries."], ["Teddy C.", "Delicious New York salmon sushi rolls, also the spicy tuna rolls were great. The pad thai was served with crispy fresh vegetables and not very spicy, since I only got the hot level 2. And I always like the mai tai's she makes."], ["Ali B.", "I can't remember the name of my meal, but it was a curry-type tofu and green bean dish that was well seasoned and spicy. The food was delicious and my waitress was efficient, helpful, and timely. They have a wide selection of vegetarian options, all of which look very delicious."], ["Dave J.", "Fantastic!  They immediately accommodate d our large group of 14.  Friendly attentive service and the food was remarkable."], ["V H.", "My sister suggested this place for lunch and I must say along with atmosphere, the food was really good. I ordered the tofu pad Thai and shared the supreme roll and Dragon roll. I didn't care for the sushi compared to sushi I've had in Japan, Hawaii and San Francisco. But in all, it was great service and yummy food! I don't recommend level 3 of you're not an avid spice eater."], ["Kristi H.", "Probably the best Pad Thai I've ever had!  If I lived in columbus, this would be my go-to for Asian fusion.  Nom nom!"]]}