{"Nida's Thai on High": [["Kelvin Q.", "Soo SOO good. Food is fresh and service is top notch. I had the Sriracha Fried rice with beef. And also a Thai chai tea. Both were delicious. They also serve sushi. Although I didn't have any the chef seemed to know what he was doing. Price is not bad and definitely worth it. Will be returning."], ["Whitney H.", "I was really disappointed because it's not all Thai - it's more of an Asian fusion restaurant. I took my friends here and none of them really liked their food or the price they had to pay for the dishes. I unfortunately have to agree. If you're looking for authentic thai, don't go here."], ["Domenick D.", "The good:  The rice and noodle dishes are all very tasty.  The larb is actually delicious.  The interior is clean and modern.The bad:The curry dishes are abysmal.  They're just totally unlike the same dishes as every other Thai restaurant, and not in a good way.The ugly:The service is beyond bad.  My coworkers insist on going here, so I've had many experiences with this sad excuse for a restaurant.  In one experience, one member of a group of 8 showed up 15 minutes late.  He was told the kitchen was closed and he could not order food.  At the time, we'd just put in our own orders, so presumably the kitches was NOT closed.  So he went across the street to the White Castle and got a few sliders, and came back to sit with us.  They then told him that he couldn't eat White Castle in their restaurant.  So he stood outside in the freezing cold eating White Castle, then once finished, was allowed in out of the cold.  Wow, thanks for the service.  The second bad experience happened last week.  We all ordered, and then wanted dessert.  They told us the kitchen was closed and we couldn't have dessert.  Perhaps these assholes don't understand how restaurants work.  The kitchen is closed when the last person you sat decides they're done eating, not when the clock strikes 9.  If you don't intend on preparing my entire meal, don't prepare half of it.  A third bad experience was that we had a large party, and needed another table.  The restaurant was largely empty except for one other table next right next to ours.  They could see we needed a table, so they graciously offered to move to help us.  After this happened, some surly wench came out and berated us like children for messing up her perfect seating arrangement.Anyway, I'm never going back to this joke of a restaurant.  If you do go, do yourself a favor, and don't order one of the baby-puke curries.  They're shit.  They're not nearly as bad as the service, though."], ["Emma S.", "I LOVED Nida's. My guy and I have been dying to come here for forever and after getting myself a nice little job promotion we decided it would be the perfect time to go and celebrate.The space is smaller than I thought it was but so warm and unpretentious, but I'm definitely glad we came early on a weeknight. We were seated at a comfortable corner booth against the wall and next to the window of the bar (which is great for me because I'm a big people watcher). Our server was a little shy but made good recommendations and was extremely friendly and prompt. The guy and I each got a drink, started with the fresh spring rolls (my favorite), then I chose the Ka Prow Ped (a duck stir fry) and I was so impressed I don't even remember what my boyfriend had for dinner. It was easy and totally worth the small bill of $50. It was everything I expected it to be and more. I can't wait to come back!"], ["Katie B.", "Start with the spring rolls! So delish. I could eat the pineapple fried rice everyday. Good service too! A cute and trendy restaurant for a quiet meal."], ["Claude S.", "On the off chance of discovering a new restaurant, we found this place tucked close on High Street. Overall the food was terrific, we began with appetizers of Thai Fresh Spring Rolls & Chicken Satay both items were excellent and will try them again. On our main course we had the Gang Dang with the red curry sauce and having it medium spicy was the perfect choice and the Pad Phong Karee which perfect spiced as well and quite flavorful with the soft shell crab and yellow curry. I really don't understand some of the comments about this place, the price is comparable to many Thai restaurants I've been to and in some cases considerably less. The food is pretty authentic, I'm not quite sure what the expectation is from some but ordering cheap Thai food in a Chinese restaurant shouldn't be your benchmark. Thai food can be quite spicy, the rule of thumb is ask your server to dictate a numerical value with 1 being close to \"Milk Toast\" and 10 being the \"Sun\". If you order 1 and its still too spicy than send it back, no need to ruin your meal with an over zealous chef with a heavy hand."], ["vadim d.", "It was a place I liked until tonight. It was two of us and the guy who was responsible for the guests denied to give us a table that we wanted. The place was half full so it was quite unreasonable for the restaurant to have such unfriendly attitude. Nida's was a place we visited frequently - not anymore. Nida's, You just lost a good customer. May, 29, 7 pm. Talk to your greeter and kick his ass."], ["Rebecca H.", "There was nothing about this place I didn't like. The place is cute, huge windows in the front they open in the summer and very friendly service.The Pad Thai was out of this world and everyone at the table loved their food. Better than any of the Thai places I've been to in Madison, WI."], ["Liz M.", "Having worked next to a Thai restaurant for 7 years, I never really had the need to seek out thai food. Now, having moved, I wanted to try Nida's. We met some friends for happy hour. Their happy hour specials are decent. Discounted apps and drinks. I really enjoyed the Thai Iced tea (not on special). Our waitress was nice and explained things as needed. I ordered my favorite Tom Kah Gai soup. The guys ordered sushi and my friend got a curry and we got some apps. The sushi was fine, the edamame was fine, the spring rolls, were fine. The Tom Kah Gai was lame. It was very thin broth, barley any veggies, and not much galanga or lemongrass flavor. It was very delecate comapred to what I am used to. So, therefore, I was disappointed. Plus it was $7.50 (or something like that) and I just didn't think it measured up. In the end everything was OK, but I'll just go back to Nong's for my Tom Kah."], ["Sean S.", "I'll start by saying I like Nida's. I really do. The problem is......well......there really IS no problem, but having said that, there really is nothing extraordinary about the experience here either. It's pretty \"middle-of-the-road\". It's been a while since I had been to Nida's, so I suggested going last night. The Gyoza (pork dumplings) were very good and cooked properly. (You might be surprised how many Asian restaurants I've been to in Columbus that serve overcooked, rubbery dumplings. It was refreshing to get some at Nida's that were soft and well-seasoned.) The only down side to these was that I wished there were a couple more on the plate. After having the dumplings we shared a sushi roll called \"The Heart Attack\", which was an Americanized deep-fried sushi roll with spicy tuna and jalapeño. While not authentically Japanese, it was delicious. For my entree I chose the Chu Chee Duck, which is grilled duck in a coconut milk red curry sauce with bell peppers, crispy basil leaves and white rice. Before I go on to point out the negatives I should mention that you could put coconut curry on a rubber tire and I'd probably eat it. Oh, I will indulge......but I digress. The flavor of the duck and curry was delicious. My problem was that there wasn't enough duck due to the amount of cartilage and bones that were in the meat. I wound up spitting most of the bites of meat out due to the pieces that were inedible. My other issue was with the level of heat I requested. When asked how hot I wanted the curry I specified \"medium\", but there was almost no heat whatsoever. The person I was with specified that he wanted his curry hot, but he said that the coconut milk's sweetness overpowered any heat that may have been added to the dish. While we were both a bit disappointed with this, it wasn't enough to make it a bad experience.Nida's is a bit on the cramped side. If you go on a Tuesday or Wednesday between 7 and 8:30 you're bound to get a table quickly. We went on a Friday night at 7pm and we waited about 30 minutes, which wasn't too bad, but since all of the seats at the bar were taken we decided to get a text message when our table was ready and walk around the Short North. If you're looking for Thai food with a nicer, less-cramped, cozy atmosphere try Basil which is just a couple blocks north of Nida's. Both have good food, but neither is extraordinary."], ["Dublin B.", "I bit pricey but the sushi was good quality.  If you're in the area it's worth it."], ["Emily D.", "Just had my first experience here and it was delicious!!  Happy hour means $2 off wine, which helps convince you to get something that will pair well.  Had a vegetarian dish and the tofu was perfect. The meals are beautifully presented and the ambiance is a good mix of fancy and casual. It really was exactly what I was looking for in a birthday dinner."], ["Al H.", "This is truly a case where I wish Yelp had half stars because I think Nida's sits at a solid 3.5Let me start with the food and service because both are excellent. The place is fairly small but they have plenty of servers for the space and our experience was generally really good. On my recent trip I ordered the sriacha fried rice and again it was excellent! Everyone loved what they ordered so it went great. Normally those two things are enough to earn 4 stars but there are some oddities that irk me about Nidas:1. Only 1 free refill on drinks (what the hell is that?) and no refills on Thai coffee or tea.2. Gratuity added to parties of 5 or more, sort of a weird number to be locked into if the service isn't great3. $17 for fried rice with 2 meats, now I know this place is a little higher-end but at a place like Tais Asian Bistro you could get a double portion of combo fried rice for under $10 and the quality is very similar. I generally felt that the prices were a bit too high for what you were getting.But I digress, Nida's is still a great spot to grab dinner with friends."], ["Bryant M.", "Want good Thai in Columbus? Then Nida's is your place!A friend and I showed up for dinner on a Saturday night, and although they were busy, we were able to find seating at the bar. The bartender was super-attentive and extremely friendly. Our drinks were strong and delicious, but I found myself still wanting to run down the street to Mouton.My friend got sushi (Spicy Thai and Heart Attack), and here are her thoughts:\"It tasted fresh, and filled me up without being heavy. The Heart Attack had fresh jalapenos that made a ton of difference. In the Spicy Thai, the spicy mayo was good, and the whole roll had a good blend of flavors. 3.5 stars.\"I had Pad Thai, and this was definitely the best I've had in Columbus. For me, Columbus is kinda lacking in the delicious Asian department, but Nida's is a real winner!"], ["Danielle L.", "My fiancé and I LOVE Thai food so naturally we had to hone in on a place moving to Columbus. Nidas has excellent service and the food and drinks are amazing! The pad Thai and the Pad Thai woon sen are our favorites! We have also tried the Gang kua curry which is a sweet and spicy place curry. I have only tried one of their drinks, the lychee martini and it was super yummy! I notice some people say this place is pricey but I feel like it's pretty standard for Thai food and well worth it."], ["Sarah S.", "My boyfriend and I went there for the first time on New Year's Eve.  Love the atmosphere and the decor.  I'm a sucker for exposed brick walls.I got the Pad Kee Mao with tofu and it was delicious.  Not too spicy with nicely cooked rice noodles.  My boyfriend got the Chu Chee Tofu and said he really liked it but wished that it had more curry paste.  The service was fantastic. We'll definitely be back again."], ["Joe I.", "Staggered down here for Thai when I was in town for a convention at the nearby convention center.  Had to wait a bit for a table due to how busy it was, and the food was sorta slow coming out of the kitchen, but it was worth it.  I ate every freaking morsel of my food, and a some of my two companion's food as well.  While a touch on the slow side, the server was very friendly, and got everyone's order perfect.  I had a curry which she recommended, and it was outstanding.  I would come back here in a heartbeat if I lived in Columbus."], ["Shelley O.", "I'm new to Ohio having just moved here in March.  I've been searching for a great Thai restaurant and this one fills the bill.  The Crab Rangoon had the most crab filling I have had in years bar none and the Pad Thai was excellent.  I will be back again and again....the staff is fabulous!"], ["Lea P.", "Such a lovely place. It was hard to find fault with it. We had a party of five and lucked out, snagging the table by the window, practically the last table in the restaurant. I had the seat facing the door, and for most of the meal, I was busy trying not to feel bad for the people who had to wait.Our group included a gluten-free person, and both she and I (with my complicated diet) were able to find plenty to choose from, all clearly labeled and described in detail. The server was helpful with every question we asked -- giving us a \"probably\" answer, going into the back to make sure, returning with a \"yup, right the first time\" confirmation.I don't remember what everyone ordered, but it was a huge variety -- from animal-free to carnivorous -- and no one had a complaint. I know that for my part, I ordered a sushi appetizer and a Thai tofu curry for my entree. I know that the sushi hit the spot and the curry hit even more of them. I know that we passed around glasses with interesting-sounding drinks that didn't taste nearly as strong as they felt. I know that some plates were eaten clean, while others were so weighted down with food that there wasn't a hope of finishing them.I'd like to come back for lunch some time and take advantage of the lunch prices for this great food."], ["Hanna N.", "Delicious! The Pad Thai is out of this world. Can't beat it. Also, fresh spring rolls are so good! My boyfriend and I love it here! We could eat here everyday!"]], "Thai Mango Asian Bistro": [], "Thai Paradise": [["Amanda A.", "I had the orange chicken and fried rice to go. The service  was very fast and the food was good. I was hoping for a little more spice in the orange sauce but that seems to just differ based on individual recipes and restaurants. The staff was very friendly and the place has a nice atmosphere if you decide to dine-in."], ["Curtis L.", "Great food and selection. Friendly and clean!"], ["Heidi Y.", "I ordered take out Singaporean Noodles, Drunken Noodles, and Yellow Curry. It takes me 15min to drive there, and my food was ready when I arrived. The meat to carb ratio wasn't something I expected, with a lot more protein than I usually see on similar dishes. This was a nice change up. The curry was the tastiest dish that I ordered."], ["Tommy C.", "This was my first time eating here. The atmosphere is pleasant and the wait staff is very polite. We started our meal off with the Blanket Shrimp, it was ok nothing that jumps out at you that would make you have to have it again. We also, had the Lychee Sake it is has a floral sent to it and is very smooth. If you are turned off by the burn of alcohol this is perfect for you there is absolutely no burn as it goes down. For my main course I had the Pineapple Curry. It was very good and I would have it again. My fiancé had the Drunken Noodles which was over the top good! I hope go back just for this dish!! Her brother had the Island Chicken which was very good and just under the Drunken Noodles in the flavor department! So as for my first time there I will absolutely be making another trip there! I would recommend to anyone that is in the area or even travel to try it!"], ["Monica S.", "Drunken noodle, definitely my go to on a weekly basis. Everything is so fresh and well balanced, portions are great for the price too!"], ["Sheri T.", "Everything I've had here is delicious!   I eat here about once every 3 weeks; my retired husband, the spice freak, eats here at least once a week.  Calls me at work to rub it in.  I love that they'll adjust spice level upon request, and it's always perfect.   Ok...the salad dressing.   I'm sorry, I lick the plate.  It really is that good!  Comfortable and friendly.Khob Khun Ka!"], ["Carla B.", "Husband and I went went after hearing about the coconut soup...did not disappoint!  Several Thai dishes later,  we were quite satisfied!"], ["Cher W.", "This is a great place to eat!  Wide variety of choices for any palate.  Has the drunken noodles- absolutely my new favorite.  Also had the Tom Kaa Gai soup-very yummy!  The others with me had the chicken with peanut/coconut sauce (rich!) and island chicken.  Another great dish.  Hubby tried the fried tofu - great with the sauce.  Was so good we had no room for dessert which sounded so good."], ["Tessa S.", "My husband and I had a fantastic meal and dining experience here. I found out about it from a restaurant.com coupon and decided to check out based on the great reviews. We were not disappointed. We had quite a feast, too!  For starters, we got both the crab rangoons and the lettuce wraps. The crab rangoons were nothing like I've had before. They had cheese inside and the dip was a sesame peanut sauce. Definitely different than what I expected. Honestly, next time I dine there I won't get them again because I want to try the other appetizers instead. The lettuce wraps were awesome!  My only suggestion would be to have more lettuce with the dish. They gave two lettuce leafs and TONS of filling. They were still very good, but a little messy. Really, that is a meal in itself!"], ["Amanda B.", "My dining in experience was far better than my partner's take out experience, but it won't keep either of us away! I went during the day w/ work friends. Had the drunken noodles from advice on yelp. Delicious, but I'm not a noodle fanatic. I look forward to a more vegetable-based dish next time."], ["Hua R.", "True diamond in the rough, you'd never expect the food inside to be so good simply based on the strip-mall storefront.  Really nice place, a family favorite as dine-in or take-out.Love everything that I've tried, huge fan of the curry (Panang is my fav) and the Island Chicken (just thinking of it is making my mouth water!).  They do a nice spin on Chinese food too, the General Tso's Chicken is different from any other place, but in such a good way.  Check it out, you won't be disappointed."], ["Harry G.", "We found ourselves in Columbus with a taste for Thai. This one had good reviews and wasn't far away so here we went.  We started with the Tom Yum which was in a word YUM. Our entrees were the Pad Thai and Drunken Noodles. Both were excellent. The server was pleasant, friendly and competent. We will be back."], ["Daniel M.", "I love this place. Their chicken lo mein is excellent and their fried wontons are very good as well. Everything else my family has gotten from here has been good too, never ever had a bad meal. Seating inside is sparse but we always order to go. I recently had my tonsils out (horrifying experience) and the only thing I could stomach was their wonton soup. I highly recommend this place. I also knew the owners son in high school and they're such a nice family"], ["Michael E.", "When my wife and I want Chinese we go to Thai Paradise. The food is always fresh and made with quality ingredients. I appreciate the chicken is white meat and not mystery meat. The spring rolls are crispy with fresh crunchy veggies on the inside. Their wait staff is friendly and on top of any request.My only complaint is their concept of time. If you are picking up and they tell you 15-20 minutes give them half an hour. I will say that they always offer a complimentary drink while you wait."], ["Ian M.", "A local favorite of my family, we go there often. The food and service are always top-notch & consistent. I love the garden roll, the garlic pepper calamari for something unique & spicy, and the Pad Thai is simply perfect. They have something for everyone here, some chinese choices are available if you aren't into Thai, even the kids meals are fantastic values with all white meat chicken. You'll be glad you chose to eat here, but get in early, the tables fill quickly in the evening... Take out is fast and convenient option as well."], ["Rebecca R.", "Five stars! The meter just wont go higher! From apps, to entrees and service, the whole experience is just perfect!"], ["Carmen F.", "The food is really good.  The drunken noodles are delicious!  If you like spicy they can do it right.  The wait can be long so be prepared.  Also check out restaurant.com for a discount."], ["Luke M.", "First time we went the food was delicious. Hot n sour soup was tasty, triple delight was great. Went back the following week and had the General Tso's chicken which wasn't very good. I'm talking worse than the Walmart offering. We'll try it again to see if they just had an off night."], ["Adam R.", "After moving back to Central Ohio from Seattle, WA where my wife and I lived for ~6 years, we were very pleasantly surprised to find quality Thai food in the suburbs! The wait staff is always pleasant and the service has been excellent every time we've gone there. If we're feeling like having any sort of Thai, Chinese or Vietnamese food, we roll to Thai P. They have excellent dishes, spicy if you want it to be, and offer vegetarian and vegan options, too."], ["Michelle M.", "This was our first time here everything was great! Had the Crab Rangoon, mini egg rolls, Drunken Noodles with chicken & General Tso. Veggies were so fresh, loved the spices in both dishes.  Beer & wines were really good too. Best Asian food I've had on this side of town! Great service by Monica too! You've gotta try it!!!"]], "Thai Grille": [["Helen W.", "I just want to make note. I ordered a pad Thai to go with an extra order of tofu, and they didn't put any tofu in it, and I paid for it...I'll review this later when I'm not so upset about this. Luckily this time the order didn't take half an hour...but the order was wrong."], ["TJ R.", "We've enjoyed every meal we've had here. Their specialty dishes are unique from most Thai in Columbus. Their wine selection is good."], ["Rachel M.", "This restaurant is amazing!!! The summer rolls and chive pancake appetizers are out of this world!!! Lots of options for vegetarians, too!!!"], ["Joshua S.", "This is my wife's favorite restaurant. The place is very clean and the food is great!"], ["Reston A.", "Nice little place in uptown, good location, good size, decent menu, solid Thai food. Had the pad c-ew and it was delicious. Rest of the fam had pad Thai, and were less impressed. I tried it and agreed. The sauce was too salty, but that could have been just a bad day. It was by no means bad, but we had just had Thai from the place at the north market, so our standards were high! If you like your food spicy or hot, make sure to ask, they don't make it hot automatically (which is either good our bad, depending on your tastes). Our server was nice and attentive, very personable. The only thing we didn't like was how cold it was. No double doors or airlock lets a lot of cold air in, so you might find you want to leave your coat on! All around good experience, would gladly recommend!"], ["Tanya P.", "This place is very quaint and has a very comforting atmosphere. I ordered the 3 free ramge chicken wings an appetizer which were perfectly cooked and the honey glaze was awesome.For dinner I don't remember the name of what I ordered but it was a chicken, vegetable,  wide flat noodle and basil dish that had just the perfect amount of sauce. I asked for the level 3 spicy.  I was very pleased  I paid more to add shrimp - totally worth it. I will be coming back"], ["Steve P.", "This is a somewhat-hidden gem in the Westerville neighborhood. If you know where the Good Vibes winery is, it's right behind it. We arrived around 5:30 on a Saturday night and it was not busy at all. We were sat right away, but it was clear by 6:30 that business picks up nicely during dinnertime. I'd say it was a family/college student crowd. But the ambiance and atmosphere is what I would hope for a small Thai restaurant good for a date. Very relaxed a no-pressure atmosphere, at least when we were there.The waiter was attentive and our waters were filled almost always. They have wine and beer if that's your taste. We started with the spring rolls, which although a small order, were very tasty. I could have eaten the entire appetizer easily, but I shared.My wife ordered the Thai-fried rice with tofu and I ordered Pad Thai with tofu. Both plates were SO good. We each tried each others'.I don't actually know how we've gone this long without finding this place. I can't wait to go back! Very good food and I love the location and atmosphere!"], ["Mark K.", "In the mood for Thai and sorta nearby, I headed up here.  It's a small place right in the heart of Westerville.  Parking is rough but there's a city lot just north of here.  Service was very good, the atmosphere is nice; prices were higher than I expected for a college-area place.However, the food is worth it.  I had a ginger ale- I'm a sucker for fresh ginger ale.  It was, as advertised, spicy not sweet.  But it was very subtle, and I was hoping for more punch.  Expensive for its size and I wouldn't get it again, but nice to see as an option.I started with the chive pancakes.  Not really pancakes, though the batter is slightly reminiscent of them.  No, it's a flat dumpling, seared to perfection and chock full of chives.  I loved them.  So good that the sauce on the side was superfluous.Next I had the beef curry, which was great.  The beef was pretty tender, and meshed well with the plentiful mix of fresh vegetables and the curry sauce.  Add a bit of rice to sop up flavors, and you have an amazing stew, great on a cold day.  There was some spice, but not enough to overwhelm the other flavors."], ["Lisa D.", "Thai Grille reminds me what I miss living in NY with neighborhood authentic fair instead of a sea of chain restaurants. This is a tiny little gem in Uptown Westerville. Family owned and as authentic as possible. The place is small, so there may be a wait. Food takes a little longer to prepare than impatient people may willing to wait..but it's worth it. Some of favorites are Tom Yum Kung soup..spicy and so good. Tofu curry is amazing. Everything I have tried is delicious, fresh, simple and authentic."], ["Dawn C.", "I ordered out to take to my hotel, and the reviewers aren't kidding, the food is delicious. I had the pad kee mow, which had very fresh veggies (zucchini, carrot, peas, green beans) with chicken, egg, and wide rice noodles. If you don't like spice, note that even the mild has some heat to it. I will be going back while I'm still in town to get the same dish again!"], ["Maryanne S.", "This place has VERY BAD BUSINESS PRACTICES. I will never purchase anything from here again.To make a long story short, the business owner made us pay for a burnt and disgusting app that we sent back to the kitchen. We sent the item back (which is rare for us), and the item was still on the check after lunch was finished. Of course, we were not going to pay for it. The owner told us that we had to pay for something that we did not eat. We refused. THIS IS WHEN HE CALLED THE POLICE on us for refusing to pay.Needless to say, this was a big to-do that didn't need to get to this point. Because of the law, we ended up having to pay the $6 for the app. We have spent HUNDREDS of dollars at this establishment (the owner recognized us from previous meals), but we will no longer bring one penny to this place. This $6 cost him a lot of business.Please do not support business owners like him."], ["Tim D.", "Most awesome fresh Thai food.  Bit pricey..portions could be bigger - but the food is really well seasoned..probably some of the best Curry in Cols.   Ask for it extra spicey -if you like real Thai as they go a little light in general.  fresh veggies always, solid to say the least. great date spot...stay away from door tables in winter"], ["Tiffany M.", "One of my absolute favorite restaurants! Love their Pad Thai and Pad Kee Mao. This place was originally recommended to me by a lady from Thailand that claimed their food was the most authentic Thai food in the area. I have not found anywhere in Columbus that compares! Service is a little slow at times but the staff are very friendly and the food is so worth the wait!!"], ["Cherie R.", "My husband and I enjoy Thai food - and I'm always a little leery of trying new Thai places because of the prevalence of nuts in Thai food.  But I REALLY wanted to try this place out!We came on a Saturday night, and it was hopping - unfortunately the kitchen was down to one chef, so they were a little slow, but they apologized profusely for the wait.  We had the spring rolls, pad thai, (nut free), and pad see ew.  They took my nut allergy into consideration (much appreciated!) when taking our order.The springs rolls were good, but I felt a little overpriced for how many received.  The pad thai and pad see ew were very good.  My husband feels that the pad thai is better at Nong's, but I said I'd have to do a side by side comparison to decide if the pad see ew was better or not.  :-)  In other words, it was very good."], ["Russel Y.", "Stopped in here the night before Valentine's Day.  Got a table right away.  Everyone is right, it is a small restaurant with limited seating but it is cozy and the wait staff is efficient and friendly.  Got the Massaman curry, which has beef on the menu but I substituted chicken (the way to go), and it was outstanding.  I will be coming here for lunch to try all the curries.  My wife had the Pad Thai and it was also very good (I prefer the Pad Thai I make, so it is a tough sell for me).  The serving size was very generous as well."], ["Jerod B.", "My wife said it was the best pad thai ever!  Very fresh and delish.  Absolutely loved the food. It is a little place in westerville that delivers big.   I suggest you give this place a try."], ["Michaela W.", "The pad thai, pad see ew and pad kee mao are delicious. The ingredients are fresh and the service is excellent. My favorite Thai food in Columbus!"], ["Sarah B.", "We'd been wanting to try the restaurant for quite awhile now and finally decided to have it this evening as takeout. I'm a big fan of Thai as is my boyfriend and we're always on the lookout for new places to try. I found the menu online and we ordered from that. Word to the wise, prices have gone up on some entrees by a dollar. I got the tofu pad Thai, and the boyfriend got the crispy pork. We ordered the chicken satay as an app, but due to a mix up, they gave us chicken pad Thai instead. The crispy pork was a bit of a joke. There was nothing crisp about it, and it was dry from what appeared to be over cooking. Not very much in the container as well. The side of rice didn't fill up the standard Chinese style takeout container; it came to about the halfway mark. It truly tasted like something we could have made at home - all for $16. The tofu pad Thai was better, but if this was the first time having tried tofu, I'd have been turned off of it for good. The tofu actually was burnt on some of the edges - pretty amazing. It was tough to chew. The sauce used was alright, but on the sweet side, which I thought was unusual. The portion size was good. The price was reasonable at $12. I also got a Thai iced tea, which was pretty flipping tasty. That was the best purchase that we made at $3. We didn't try the chicken pad Thai - boyfriend tried a piece of the chicken and was singularly unimpressed. He reported that it was so over cooked that it was sticking to his teeth. All in all, a disappointment. Maybe it was an off night for the restaurant? I don't know that we'll try it again, simply for the fact that it totaled up to $45. That's pretty expensive for another test run. So far, the best Thai we've had in Columbus has been down at the North Market. Maybe you'll have a different experience!"], ["Tna M.", "Wanted to go for a long while due to the vegan accommodation. Big time disappointment.  Amazingly overpriced. Not impressed."], ["Steve H.", "Loved the beef curry. Very rich. The coconut milk, cashew, avocado, sweet potato all pair well together. The peas and beans help to cut thru the richness a little, beef and chicken were both tender"]], "Erawan Thai": [], "Taste of Orient": [["Jeffrey W.", "They have some amazing dishes, however if you're not open to trying new dishes because you aren't familiar with it. You'll get stuck with the crappy stuff."], ["Emily S.", "I ordered Taste of Orient via Yelp this past weekend and experience an A-OK meal. After reading the Yelp reviews (and seeing the pictures...eek!), I was a little nervous. But they also seemed to be the only delivery Chinese near my location with at least a few positive reviews, and I was craving dumplings, so I took the risk.I ordered the edamame, the pork pan friend dumplings, and a veggie roll. My total came to be about $10.50, right above the delivery minimum of $10. They also have a $2 delivery charge.The edamame was delicious (though I'll admit it is hard to mess that up). The serving was large and the edamame was cooked to perfection. It tasted great dipping it in the red chili pepper sauce for the dumplings as well. The veggie role was a little disappointing. It was small and smashed from delivery. The flavor was good, but the spring roll wrapper was definitely overcooked and practically fell apart when I bit into it. Finally, the dumplings. I am a huge dumpling fan. The ones I ordered from Taste of Orient were standard, probably very similar to something you could get in the freezer section at the grocery, but the added red chili sauce to dip in spiced them up a bit. The only con was that the dumplings stored at the bottom of the container ended up being slightly soggy when I got to them. Not the biggest deal, but it is definitely not how I prefer to eat my dumplings.Overall, delivery was easy and quick (about 30 minutes). When I placed my order with Yelp, it didn't give an expected time, but I was surprised at how quickly it arrived (I was expecting an hour or so given other Yelp reviews).If you are looking for some quick and easy Chinese to fill a craving in the OSU area, check this place out. If you are able to order or go somewhere else, I would recommend choosing that second option."], ["JR G.", "Have had mixed results from this place. Dreadful American Chinese, but pretty tasty Thai curry. Wife likes the Hibachi. Delivery was quick."], ["Zeb L.", "Awful, just awful. We ordered from here once and it showed up 45 minutes later than when it was supposed to. Opened up my lukewarm container of Pad Thai, which had been drowned in regular soy sauce. Perhaps they had done that to disguise the nonexistent flavor of the vegetables, which had clearly been consigned to the back of a freezer for far too long. I'm confident that I could have gotten better Pad Thai by going to the grocery and buying a microwaveable meal. Avoid, avoid, avoid."], ["John M.", "1st time here & owner was really cool. Chicken was fresh unlike other places I've been. Didn't have a wow factor but it was good. My dude ordered the hibachi steak and it was delicious!"], ["Mark K.", "Needed a quick lunch before a hardware store run, and felt like Chinese.  This popped up close by.  It's a nice little Asian place, nothing fancy, bigger than expected, with decent food.Service was good.  You order at the counter and they bring your food to the table, at least when it's slow.  Several people brought stuff out or checked on me, which was nice.  I had crab Rangoon to start.  Pretty average, mostly cream cheese. I didn't expect much, so I wasn't disappointed.  Then I had combo pad Thai (not actually on the menu, but easy enough to do.)  A solid rendition, but nothing particularly amazing.  Big portion, fairly tasty, plenty of meat, lots of sprouts and crushed peanuts on top.  Could have used a few more veggies.  Heat built as I ate, but it wasn't overwhelming.All in all, a decent place.  Not on my usual routes, but I might try it again if I'm nearby."], ["Carl H.", "A chicken spring roll, steamed dumplings and Cantonese Chow Fun on a cold night.Fast, warm and awesome!"], ["Nicole O.", "Standard Chinese food.  I really love the Hibachi - it's always super fresh.  Why do I keep coming back?  They deliver and it's reliable!"], ["Wenfan C.", "Fast and convenient! I really love their Chines donuts, although their foods are a bit mixed up with various styles and more fast food-oriented."], ["Xavier V.", "My girlfriend and I loved the food because it was so authentic. A mixture of different cuisines that blend together perfectly. I love dumplings and theirs had a lot of meat which I thought were the best potstickers I have ever had. The chow fun was great and not too oily. The com suon was great. I just want to go back for more."], ["Courtney C.", "My housemates and I love this place. We order it almost weekly. I always get sesame chicken and it's pretty decent. Very large portions and it's pretty cheap. I really don't know of another Asian restaurant aside from panda on campus and sometimes panda is just too expensive. The only reason I gave it four stars is because it made my tummy a bit upset."], ["Laura W.", "Delivery took way longer than quoted, and with no apology.  Food wasn't anything special."], ["Sean J.", "Taste bad, and metal dish scrubber came out from my delivered dish. Will not recommend and never gonna order again from here."], ["Christopher G.", "Uhg. One of the most bland Americanized Asian joints ever. My Kung Pao chicken was not spicy, in fact, it had no flavor at all. And while the portion is large, it is mostly vegetables and rice...protein meats are scarce.The fried rice is sticky with no egg, and the egg rolls (which come right out of the freezer from a restaurant supply box into the fryer) are the worst Ive ever had. Yuck.Methinks the reason for its survival is location. Being in the University district, students who eat anything cheap, keep this business afloat. Not me."], ["Neil R.", "Not much to say about this place... Every part of my experience was Sub-par.  Started off with the delivery guy taking 55 minutes to get to my house and having to call twice before even finding my door(I live on high street).  Next the general Tso's chicken was HUGE the chunks were the biggest I've ever seen.  The taste was slightly puzzling that it didn't even seem like I was eating chicken.  Rice was rice. And the crab Rangoon was definitly over cooked and fried in really nasty grease.  Waste of $15... If I wanted a stomach ache I could definitly find better ways to get it."], ["Allison A.", "Crab Rangoon was mostly flat and dry (since I don't use the sauce) but the shrimp lo mein was good and full of shrimp. Surprising since most times you pay extra for shrimp and there's like five pieces on top."], ["Dillon M.", "Everything here is really good for really cheap so that appeases the destitute college student that I am. When the totalitarian boot of student loan debt goes to break my teeth on the curb, I hope somebody spilled Taste of Orient food where my mouth will be."], ["Sanchita D.", "This was the most god awful food I've ever eaten! I got chicken fried rice and the coconut curry Thai soup, and it was disgusting. The soup was basically water with chicken in it. The fried rice... Who knows what they put in it but it smelled like a dumpster and tasted even worse. I had to throw it away because it was so bad. I've never seen a place mess up FRIED RICE but Taste of Orient managed to do so."], ["Gary B.", "I've ordered from this place twice now. I had my food delivered and it came in a pretty timely manner. The food quality is moderate...I definitely would suggest the hibachi over the general tso for the record. My issue with the food as well is that they are very skimpy on the meat  portion."], ["Emily L.", "The selection here is huge. You have all kinds of Thai curries, standard Chinese dishes, and even Pho. I went with the Thai Green Curry medium spicy. It was really tasty. The sauce was light and spicy and there was a lot of veggies in the dish. The brown rice that came with it was cooked perfectly(brown rice can be hit or miss depending on the place). The portion size was huge and was enough for 2 meals. My boyfriend had the pad Thai and he just thought his dish was ok. One of the reasons I can't give more stars was because I ordered a combination(chicken, shrimp, and beef) and when we got home, my order just had chicken in it, but I was charged for the combination on my receipt. That is a big pet peeve of mine. I would try it out again because my food was tasty and the service was fast. Just make sure you check your order before you leave."], ["Rachel M.", "I get this food all the time. It's my favorite place to get delivery. Their lo Mein is so good. Never disappointed with my meal here. Super speedy delivery too. Awesome place, awesome food"], ["Carol C.", "This is the kind of restaurant that's more than really tasty Chinese take-out. In fact, it's really tasty Chinese, Japanese, Thai, AND Vietnamese take-out! The fare may not be absolutely authentic, and the word \"Orient\" may cause your more politically correct acquaintances to cringe, but any place that offers up your choice of four kinds of Asian cuisine is an uncommon find. Factor in the substantial serving sizes, overall quality, and bottom-barrel price points, and it becomes completely unique.My experience with Taste of Orient is entirely delivery-based, and began (like so many love affairs) the morning following a night of drunken debauchery. The craving for steamy, starchy foods was intense, but I knew I needed vitamin-packed vegetables to truly soothe my belly-beast. The answer? Vegetable Delight. Big branches of broccoli, sliced water chestnuts, crunchy baby corn, and mandolin-cut zucchini with a pretty zig-zag edge, all sauteed in a thick brown sauce that's more sweet than salty. Served with your choice of steamed or fried rice, it's balanced and filling without being bulky.But my favorite so far must be the Vegetable Lo Mein. It's an absurd amount of noodles, more than enough entree for two, so tightly packed that chopsticks don't stand a chance. Some people would disdain such a carbohydrate creation, calling it an unruly nest of soy sauce-shrouded starch, I say pass me a fork and make room for seconds. It's the best tasting Lo Mein I've ever had, a pasta so savory and salty I don't even mind that the veggies are an inconspicuous afterthought. Speaking of the best, you've gotta try the Egg-Rolls. Almost all of the appetizers are delicious, especially the crispy-creamy Crab Rangoon and assorted soups, but the Egg-Rolls are practically perfection. Savory, steamy, well-spiced fillings wrapped in a decadently flaky, crunchy crust - order extras, you WILL want seconds.I haven't explored the many Thai or Vietnamese menu options yet, but I get the impression that there isn't much room for failure. Every entree I've sampled has landed in the good-to-great zone, and the value per dollar is virtually double thanks to the epic portion sizes and leftover-friendly packaging. \"Order Once, Eat Twice!\" - that's my submission for Taste of Orient's unofficial slogan."], ["Kendell M.", "Really enjoy Taste of Orient.  They deliver which is the best part and it's usually fast.  I've ordered from here several times and usually get the Mongolian Beef with lo mein and the Hot and Sour soup (comes with egg roll).  It is always hot on arrival and they give you a lot of food.  Very cheap but delivery charge is $10 minimum. Can't go wrong with ToO"], ["Aaron A.", "Taste of Orient is one of my favorite options for delivery food. I often struggle to find something I like at Chinese places. I have had quite the opposite experience with Taste of Orient. I've been ordering from them for a couple years now and I have yet to try a dish I didn't enjoy.The egg rolls are tops. Order extra, you'll thank me later. All the appetizer type items are savory deliciousness. The entrees are pretty big, I usually have enough left over to make fried rice for breakfast with the addition of a couple scrambled eggs, nom.I've never been there, I have no idea where it is. The people on the phone and the drivers are cool though. Delivery time is always reasonable. There are good coupons in the Saver, our beloved University District menu guide. Save a couple bucks on those extra egg rolls I told you to order. So yeah, killer Chinese delivery that feeds me a couple/few times whenever I order, delivered in a timely fashion by friendly folks. Four stars."], ["Zane C.", "While I must admit that I've never ordered any entrees other than the Pad Thai, this dish in particular is delicious. The portion is large enough for me to get two meals out of it, and it has just enough spice to still be flavorful. They also have excellent spring and egg rolls, and I thought that their wonton soup was pretty good as well."], ["Alana H.", "After being on campus for five years and now in the Clintonville/Worthington area I can honestly say that I feel this is the best cheap chinese place around. Their food is always fast and the prices are definitely comparable to your common chinese places. The reason I like ToO is because I consistently enjoy every item I order at this place. Some chinese places have okay wonton but gross general tsos, or great crab rangoon but crappy lo mein. But I have found that this place has enjoyable versions of all of my favorites. I have tried a lot of their menu but my favorites are the wonton soup, the crab rangoon, and the pad thai [ask for nonspicy]. They have huge portions which I love, and they are always timely and friendly. I feel like Columbus has a sadly small amount of Chinese places, but I would definitely recommend giving Taste of Orient a try!I wanted to also say that, I'm not exactly sure why I gave this place four stars instead of five. It might be because it's so far away from my house now so I rarely get a chance to order it. They unfortunately don't deliver to my area :( :(. Also, I mean, it is just takeout chinese, which is what it is. So I guess you could, based on this babbling at the end, technically give it four and a half or five stars. The food is legit, man!"], ["Sudharshan M.", "Excellent Fried Rice, most of the dishes are sweet but the Spicy Thai curry and Mongolian curry is very good. Its one of the first choices for me and my friends when it comes to quick tasty take out food. Lots of options for vegetarians too."], ["Brittany L.", "My roommates and I used to order from Taste of Orient all the time last year. It wasn't until I decided to clarify with a gentleman over the phone that the marked \" vegetarian\" items on the menu are indeed vegetarian. Sadly for me, he informed me of the fact that the vegetarian general tso's tofu has chicken stock as well as shrimp stock in it. What a bummer that was to hear. Moral of the story- - - - -Taste of Orient does have good food, however, as a vegetarian of 12 years, I am disappointed to find out that they are labeling NON- vegetarian items as vegetarian. I have come to learn that this is common among asian restaurants. If there are no visible pieces of meat, it goes under the vegetarian section of the menu, (when it is usually not vegetarian at all). For all the non- vegetarians out there, dig in! I really did enjoy their food (before my sad realization), and I know my meat- eating roommates did as well!"], ["Bianca L.", "This place is exactly what you expect a Chinese take-out place to be.Everything is mediocre. The food, the service, the prices... but hey, sometimes that's exactly what I'm looking for. Actually, the service is usually pretty great. Deliveries can be slow but the employees are always friendly and helpful.I've ordered here at least two dozen times since moving to Columbus, and they tend to be a little inconsistent, but I'm never disappointed. Sometimes the food arrives much earlier than expected, sometimes much later. The food quality varies. I don't think they know how to make coconut soup properly, they use sweetened coconut milk... yuck. When you order a lot of food they give you a free two liter of soda. Sometimes they forget the chopsticks, but I've NEVER had them mess up an order or forget an item.They aren't the greatest, but they're my go-to place when ordering Chinese for delivery."], ["Maria M.", "I ordered general tso's chicken with brown rice and garlic vegetables to be delivered (through grubhub). It came within the estimated time and tasted pretty good, I even got two free rolls and two fortune cookies. The general tso's was good but that night my stomach felt verrry queasy. I thought it was something milk based that I had drank, until last night I ate a couple more pieces of chicken and the same thing happened. had to be the chicken, which is a shame, since it's in my fridge right now and I want it so bad. Maybe it's a fluke, but this was my first time ordering and I'm not sure I'm brave enough to try again, unless it's just more vegetables...."], ["Allison S.", "I am always looking for good delivery and these guys are definitely good. The appetizers are all delicious, and really enjoy their Pho. Delivery is fast and my food is always fresh and hot.I also really like that I can order all of my food online, which means my orders are always right when I get them.Definitely worth it when you have a hankering for take out and you don't want to drive to get it!"], ["Emily B.", "Think I've finally found my favorite Chinese take out in 'lumbus. And all the while, it was right around the corner from me. Staff is super friendly. The food sure quenches a chinese food hankering and they deliver for free!  Wonton soup is delish. Eggrolls, yum! Haven't tried the Thai, but a friend over for movie night quite enjoyed. And I just realized they offer Vietnamese too. Pho, here I come!"], ["Sarah C.", "Food is always delivered as hot, crispy, and fresh. Also delivery staff is always nice and reasonably quick.The food itself tastes mediocre, but I don't have any other better options as Chinese delivery places go.  I wish they have some authentic Chinese food, like stuffed eggplants, double-cooked pork, or Mapo tofu.  If this is too much to ask, at least I hope that they make their food less sweet. But, I love the fact that they have some OK to good Vietnamese options and great vegetarian selection. I simply love their Vietnamese  salad spring rolls -so refreshing.Don't order wings or meat on the sticks.  They tend to dry."], ["TradeMark G.", "Not bad!  We'd been looking for some decent Chinese delivery with a decent number of vegetarian options.  Taste Of Orient's reviews on Yelp are pretty varied, so we'd put off trying ToO until last night.  We ordered online, got a super friendly courtesy call to clarify part of the order, and even though this was during a big storm a super friendly delivery dude arrived with our food in under 25 minutes... impressive.  And the food was just fine -- pretty tasty lo mein, and the hibachi tofu was decent.  Everything was well-packaged in reusable plastic containers in a cardboard-bottomed bag.  I wish there were more vegetarian options on the menu and something other than tofu as their go-to meat replacement (like a wheat-gluten-based mock chicken), but there's enough choices that we'll be ordering regularly I'm sure."], ["Sean L.", "I ordered for delivery.  The food arrived within the allotted time. The items I ordered were the beef round pho, marinated grilled chicken on sticks, a chicken egg roll, and the steamed dumplings.  The portions are very large.  The beef that arrived with the pho arrived raw, almost cut like a carpaccio.  I assumed they just forgot to cook it but cross contamination with the other items in the container was a concern.  I threw everything in a pot and re cooked the items.  The ingredients were fresh, and the stock was tasty.  It was surprisingly good besides that minor hiccup.  The chicken egg roll was more like a spring roll.  It was over cooked and completely dry and small.  The dumplings were larger than traditional, and pretty tasty.  The chicken on a stick was extremely disappointing.  I was expecting grilled marinated chicken like satay.  However, it was breaded and fried, very greasy, and had a strange sort of unnatural texture.  It was dark meat, that was seemingly glued together, breaded,  and anything but marinated and grilled."], ["Katie G.", "My husband and I have ordered Taste of Orient a few times.  We enjoy the fried rice and Pan Fried Dumplings in particular, though I'm not the biggest fan of the sweet & sour chicken.  They deliver in a good amount of time (often under the estimated time).  We're going to have to make sure we order again so that we can tip the delivery guy that I forgot to tip tonight.  Oops!"], ["Jennifer H.", "We had been ordering from here about every week.  However, I think that we are going to have to stop.  There is no consistency.  I have ordered dishes twice and they taste wonderful one time and horrible the next.  Plus, the portion sizes have gotten really small.  For what is being charged, you should be able to get more than one meal.In addition, it seems like every time we order on a weekend I get a little sick to the tummy later in the evening, which is not cool.....Plus, after  being loyal customers for over 3 months weekly they insist on charging us to give our toddler a little bag of fried noodles with our carryout order.  That is just silly.  I think we will have to find a new carryout place......  boo hoo."], ["Luke T.", "Uuuuugh. I hate this review already and I haven't written it yet. I'm entirely steamed at this place, and I'll tell you why. I went in for the second time today, starving my pants off, and ordered a veggie pad thai. My order goes through at 5:29pm. I am the only person in the restaurant. I sit down and begin to flip through a magazine as I wait for my food to arrive. There are at least 3 men in the kitchen who appear to be doing cooking related things. Supposedly, curing my appetite is one of them.  5:39. No food. A few people start to straggle in. They sit at a table without ordering, they're waiting on more people to arrive. 5:45. I start to get upset. More people have showed up to join the earlier arrivals of the aforementioned group. I start giving the counter/employees/etc. wayward glances intending to signal my discomfort. 5:49 still no food. There are six people at the table across from me now, their entire party has arrived. They get up and begin to order. I stand up and make my annoyance a little more obvious. 5:50. My food is brought out to my table. Mere minutes later, the party of six begins to get their food delivered. Apparently one customer is not enough to bother with, but 7 = time to cook. I didn't hear more than 2-3 takeout/delivery orders come in the entire time. It's not dinner yet, you know.Could I have made a big stink in the restaurant, demanded my money back, threw a fit, etc? Sure, I could have. It might have saved me $7, but I would've had to look like an ass, whether justified or not, in the process. Rule No. 1 of Customer Service: The customer in front of you is ALWAYS more important than the customer on the phone. I shouldn't have to explain to an establishment that taking 20 minutes to serve the only person in the restaurant is unacceptable.  Instead, I make use of Yelp to share the experience with other would-be customers.Now for the reason I really, really, really hate this review. Despite all that, the veggie pad thai was fucking delicious.  Was it worth a 20 minute wait? Absolutely not. Can I squeeze out better than one star after the experience? Hellz no. Will I ever return? Unlikely, only out of desperation. Scenario: I am unbelievably hungry, my bike breaks down right in front of it, and I sprain my ankle as the front wheel rolls off. I have no choice but to eat at the closest place. Maybe then I give them another shot. Maybe.Another maybe: maybe you'll have better luck, and as much as I hate to say it, the food might be good enough to risk it."], ["Bruce L.", "This is NOT a real Asian restaurant, all food there is cooked mostly by American and Mexican, don't know how to cook real Asian Food, it is all in American Style.We ordered Hibachi Steak, and they gave us Shrimp, with some difficult to chew shrimp, also few vegetables and \"tons\" of white rice...Ordered the Green Curry Chicken as well, that where the UNCLEAN CHICKEN WITH tiny FEATHER attached on it, OMG!I want my money back!"], ["Nicole W.", "Not a lot of words to waste on this place. I am a huge fan of Chinese food take out and am cool with even settling with a mediocre meal that hits the spot.You will not find it here. Very *meh* food.  Though I was hungry, once I finished about 1/3 of the orange spicy chicken, I lost all motivation to continue eating...The food just really bummed me out.Why are there no good late night deliveries?!?!"]], "Bahn Thai": [], "Thai Lagoon Bistro": [], "Bamboo Cafe": [], "Basil Thai": [["Chris K.", "We stopped in last night for drinks and loved the place! We didn't get any food (saw a few plates go by that looked great!) but tried a few of the martinis that were awesome and very reasonably priced. The bartender was extremely friendly and helpful in answering a few questions about the drinks. I hope they expand the happy hour to Friday!"]], "Chi Thai": [["Mae W.", "Best Asian restaurant around. It is our go to for carry out and while it is a bit more expensive than the average Chinese carry out, the price is worth both the quality and quantity of food you receive."], ["Stephanie D.", "First time at this place. Its close to home, but it's really a place to eat with a friend. They do takeout, but I never order chinese takeout (i cook my own meals). So when my visiting friend was craving Chinese, I suggested we go there! I split the ribs appetizer with my friend, and it was decent, not great.I prefer Thai over Chinese, and I've been to a few like nida's, pho's (5 stars) on lane ave, Thai grille, and bahn Thai. I asked the server whether I should get the red curry or spicy peanut chicken. She suggested the spicy peanut. It was delicious and definitely had a creamy peanut sauce as well as peanuts in the dish. The dish wasn't that spicy though. Plenty of chicken! The vegetables were good as well. I had mine with brown rice. I love places that offer the brown rice option! It's a bit pricier than pho's, but the place is more upscale. For dessert, I decided to go with something different- coconut icecream, and it was great and fresh, no freezer burn. It had some coconut flakes blended in. Yum."], ["Adam N.", "I'm not as well versed on Thai food, but their Thai food has great flavor and definitely packs a good bit of heat. I love their Tom Yum soup!"], ["Lisa D.", "Pleasantly surprised! Noticed this place in a strip mall and decided to give it a try. This is place is decorated nicely and very clean. Started out with Tom yum soup. Good size portion on the spicy side...but that is the way I like it. Spring rolls were good size and delicious.  Tried orange chicken which was excellent. Everything tastes fresh...plenty of flavor. Will definitely be back."], ["Tony A.", "Not impressed at all.  Food was ok.  There was no sticky rice or green papaya salad; 2 staples in any Thai restaurant.    I felt hurried by the staff.   After an hour I was still dining with a friend and was given a take-out container.   There was hardly anyone else in the restaurant.   Plus side to Chi Thai is the decor; trendy and beautiful."], ["Michael C.", "Probably one of the best Chinese / Thai restaurants in north east Columbus / Gahanna area. Tasteful interior, not a typical Chinese take out! The owner is always there and cares about his business. Friendly service and a full bar with a few fun tropical drinks."], ["Liang G.", "Despite my reservations towards a Chinese/ Thai restaurant, this was a decent place for Thai. I had tom yum soup and chicken curry.  Can't complain.  Service was slow due to the crowd on Friday but the staff was very friendly,  would definitely return when I have a craving for Thai."], ["RB B.", "I've eaten here a few times.  The food is always hot and fresh.  The staff is great at accommodating dietary requests and spice levels.  Some of the best tofu dishes I've had!"], ["Sam T.", "Chi Thai is easily the best Thai food in town. Every time I come in the staff is welcoming and we are seated immediately. The menu has a large selection but the staff had great knowledge of the dishes and make great recommendations - my favorites are the lettuce wraps and black pepper steak. The owner is very friendly and always checks in to make sure the food came out promptly and cooked to order. It's a great restaurant for a large party or a quick lunch. The new online ordering is really convenient too!Would definitely recommend this restaurant to anyone"], ["Mike G.", "This restaurant was recommended to me by a couple of co-Yelpers some weeks ago and I finally got the time to go cross town to check this place out.I pulled into the parking lot of a sketchy looking, kinda  run down, suburban strip mall which was missing a third of it's tenants.  I wasn't sure what I'd find when I went in, but here I am in front of this drab looking place and I'm hungry.  So I'm giving it a try. Stepping into Chi Thai is a surprise.  It's not what you would expect from the outside at all.  It's really nice with a classy  upscale modern Asian decor.  Very warm and inviting.I got a pleasant greeting and was sat immediately.  The lady who waited on me was very professional, pleasant and efficient too.On Yelper recommendation, I got the Mu Shu.  I opted for pork.  I also got a bowl of Hot and Sour Soup along with a Mai Tai.Everything and I mean everything was excellent.  One of the best Mu Shu's I've ever had.  Hot and Sour Soup was very good and the Mai Tai was sweet and refreshing.It's a hike to get up there from my place but I'd definitely give them another go and would certainly recommend you go too."], ["John M.", "Some of the best Chinese food I've ever had, and possibly the best in Columbus. Service is great, food is great, and the restaurant is beautiful inside. Try the seasame noodles, they're the best.I have been going here regularly for the last four years and have yet to have a less than excellent experience."], ["Zeina E.", "Delicious food.  Great portions.  Great flavors and spices. Highly recommend the eggplant dish and the red curry with shrimp.  My husband and I have tried other thai restaurants however,  this one so far is the best."], ["Shaun L.", "Don't waste your time. We have been there 2 times now. Hoping that maybe the first time was a fluke. Not the case.  Dishes just don't taste fresh.  Worst Pad Thai I have ever had.  Service was fair."], ["Brian D.", "I'm a huge fan of Chi Thai.  Rather than engage in an analysis of how close to authentic the food comes, I prefer to just let my taste buds tell me whether or not I should return.  And return I do!  Chi Thai is hands down my favorite, white-tablecloth, Chinese restaurant in Columbus.The interior of Chi Thai belies its strip mall location.  I've had both business meals and romantic evenings at Chi Thai, and the interior setting and service accommodate both quite well.  I've also shown up on weekends in jeans and a sweatshirt and felt just as comfortable.Every dish I've had at Chi Thai tastes fresh, with sauces and spice that always strike the perfect chord.  The Gran Marnier Shrimp rocks!  I'm constantly torn between that dish and the orange beef or orange chicken (which can be spiced up to your liking!).  When I want to shy away from that which has been fried and sauced, I often get the Moo Shu chicken (I eat it without the sauce and pancake).  The flavor on the Moo Shu is fantastic with the chicken and sauteed veggies blending together perfectly for a taste sensation.  All of the chicken dishes I've had use high quality white meat (nothing unidentifiable or gristly).  I've never had any complaints about any meal I've eaten at Chi Thai.  The wife often gets the Pad Thai and loves it as well (I just can't cheat on Nida's in that department - okay, so I've had a few bites off of her plate and it rocks too).While the Northeast location is ideal for me, Chi Thai is worth the drive from other parts of Columbus if you're looking for great Chinese food that looks and tastes gourmet."], ["Jeff M.", "Cashew chicken was great.  Mindy was a very pleasant server with a great sense of humor."], ["Olamide O.", "Went in there for the first time and the staff were really nice. Ordered the honey wings and house seafood fried rice. The wings were really small and the fried rice tastes a bit bland. Gave it two stars because the staff and the restaurant itself is really nice but the food did not meet my expectations."], ["Ali K.", "I can't believe we lived in Gahanna for 12 years before we found this place.  Definitely the best Thai and Chinese food in town.  Never a wait time, great service and delicious food.  A little expensive compared to other Asian places but far superior so worth it."], ["Christie H.", "Ohhh yum! This restaurant knows how to do it right! My husband and I visited on Saturday for lunch. I ordered the Pad Thai and he ordered the Crispy Sesame Chicken. We were both blown away by the delicious entrees placed before us! 1. The lunch portions are HUGE! Easily enough for two lunches!! :)2. Everything was super fresh, and done so right. The pad thai noodles had that perfect chew, the sauce was not too thick, and the perfect amount of spicy and sweet.3. My husband raved about the Crispy Sesame Chicken! They bread it here, instead of batter it. It comes in small strips of chicken, instead of cubes, and it is lightly breaded and quick fried, so that you don't end up with an inch of batter around a small piece of chicken, and a mouth full of oil. All in all, we were very pleased!*One thing we didn't like so much (not that this will keep us from returning)- our waiter was very loud with our dishes- he clanged them around and made a TON of noise. It almost sounded like things were going to break while he was clearing the table. Yikes!"], ["Peter S.", "Great food at inexpensive prices.  Doesn't look like much on the outside but interior decor is very warm and inviting.  4 different entrees were all outstanding.  Definitely coming back."], ["Jessica H.", "Chi Thai now caters. {{Happy Happy HAPPY dance!}}Today, 4/25/11, Chi Thai catered a professional luncheon for 30 people.  Let me say, these are 30 people with pretty high standards - the APABA group, Asian Pacific American Bar Association.  Basically, an international group of lawyers for which that the place I work for hosted a monthly networking luncheon.From start to finish, Chi Thai was amazing -- I've had some catering doozies, complete with the food showing up 45 min late, cold, spilled or not to order...or unexplained delivery costs.Chi Thai, Steve and Dannie, were great.  They took a dry run in advance to ensure they could follow my directions and correctly banked on extra time to navigate the freight elevator.  They brought their own cart (per instructions, but no other caterers seem to).  They were on time to the exact minute.  10:30 am for an 11:30 luncheon.We had PLENTY and at a great price per head.  Basically, I was able to tell them how much I had to spend, the number of people and they came up with a menu to maximize my spend.  I was able to tweak things to accommodate vegetarians, etc before committing to the menu.  I did have to rely on Fax for communication, but I'm ok with that.  It got done quickly and efficiently.For 30 people we filled 6 chafers with food that had enough for some leftovers.White Rice and Vegetarian Vegetable fried RiceChicken Lo MeinGeneral Tso's ChickenShrimp with vegetables in a white sauceMa La String BeanVegetable Delight (white wine sauce, featuring seasonal Asparagus)Guests filled, I mean really FILLED, their plates and there were still leftovers in the serving dishes.  I always get a basic idea of what is left on guests' plates so I know what to avoid or substitute for in the future.  Almost every single plate was clean - that's unheard of at professional luncheons!Here were some of my guests' comments:Amazing lo mein, usually you get it and it is so chewyThe Vegetables!  obviously fresh and crispBest Shrimp everDelicious asparagusMy observations:Large chunks of white meat chicken in the lo meinGeneral Tso's had LARGE pieces of chicken, which means the breading to meat ratio is good.  Gorgeous sauce colorMa La String Bean/Green Bean - nicely done for an overall pleaser in catering, not too spicy, but enough to lend flavor profile.EVERYthing held extremely well in our chafers without overcooking, hardening or getting gummy from  the steam.The veggies had beautiful color.Co-workers who were able to eat off of the leftovers actually called to the front desk to compliment the food and find out who it was.  And these are folks who generally do not like or eat Chinese.I'm officially now sanctioned to keep Chi Thai as our main Asian Fusion affiliate for these kinds of functions.  That's quite a huge endorsement."], ["Molly M.", "Very nice atmosphere. Waiters and waitresses are very nice and beautiful interior. Although , food does not taste as pleasant as I hoped. I ordered the pad lad nar and yellow curry. The curry was good, but it was mostly filled with vegetables rather then the curry soup. The lad nar had an interesting taste. Was very sweet. And pad lad nar is similar to pad see ew just with lots of sauce and gravy, but the lad nar barley had any sauce or gravy. To me , it did not taste authentic"], ["Jennifer E.", "Probably the best Asian food I've had in Columbus... But still leaves something to be desired."], ["Stephen H.", "Always a delight. If I'm not making it at home, I go here or a little take out down the street. They have several very good vegetarian options and are always happy to customize anything, which is awesome. I highly recommend the pad Thai, the spring rolls and the kung pao tofu (add broccoli and onion)"], ["Carol S.", "Very beautiful restaurant & the service was good but the food..not so much. I had the Pad Thai and it wasn't very flavorful and the shrimp that was in the dish didn't taste very fresh. It had that it's been frozen in a bag for a long time taste. I also had a cup of their Tom Kha Gai (coconut chicken soup) and it didn't please me either. Way too sweet & the chicken was a bit too rubbery.I felt very disappointed that the prices were high for their dinner portions and yet I wasn't happy with what I ordered. I unfortunately won't be going back which is a shame because I live right down the street from it. I will just continue going to one of my favorites in Pickertington."], ["Mary Jane M.", "We ordered the pad lad nar and the yellow curry. We had the crab Rangoon for an appetizer. The staff was super friendly and really nice, we never went a minute without our drinks topped off! Overall the food was OK. The noodles in the pad lad nar was over cooked, and it seemed overly sweet. The yellow curry was actually really good! It was just disappointing that the green beans were so overcooked they were chewy! Overall a good experience, but definitely not worth the $40+ we spent. The crab Rangoon was pretty good, I liked that a thicker wrapping was used so it evened out the crab/cream cheese. That is expected though, what can go wrong when you deep fry stuff!"], ["Dan C.", "One of my favorites. Try the house fried rice spicy. They are very generous on sizes and content. Good and fresh. You will enjoy the food and atmosphere. Very clean. Nice owners!"], ["Michaelene K.", "Nice atmosphere. Did not know it was here until Siri found it for me!Crispy spring roll....very bland. Consisted of nothing bit cabbage.Tom Yum Soup....delicious! The best part of the meal.Szechuan Shrimp....fresh vegetables. Generous with the shrimp, which were large, plump & fresh. Horrible sauce.Will try again, but outside of the soup, definitely order other items."], ["Tina F.", "Initial impression: It's an upscale Asian restaurant with great decor and ambience. Not your typical Asian restaurant. One word to sum it up is \"clean.\" And that by itself says a lot. Service: The server was very fast to attend to our needs. He was also helpful in making menu recommendations. Overall he was dressed well, courteous and attentive.  Our meals came out quickly and they did not forget or make mistakes on any dishes. Food: All the dishes we ordered were freshly made and tasted great. They have such a large selection of items, it was easy to find dishes for everyone.Overall: It's a classy restaurant. For the quality of their food, the price is decent. It's accommodating for large groups and kid-friendly. Fast and attentive service. Location is convenient and there is plenty of parking. I would recommend this to anyone. I will most likely come here again."], ["Angie P.", "I may be in the minority here but I did not enjoy my food. My Pad Thai tasted off. I did enjoy the crab rangoon though. Overall, I feel like I wasted my money on going here."], ["Mark H.", "Very nice atmosphere. The menu is sizable with some out of the ordinary choices. I hope to return to sample other items and bump them to 4 stars!"], ["Regan F.", "Sizzling Rice soup is amazing!Also love their lettuce wraps & spicy Thai mix of shrimp, chicken, beef & veggies"], ["Sarah S.", "Great Pad Thai! Delicious appetizers! fun atmosphere.... highly recommend"], ["Gary K.", "Yes, I'm a fan... A huge fan!! Why it took me so long to try this place out - I don't know. It's in a strip mall of course, so it doesn't look like much from the outside... but when you walk in, what a surprise!! Very nice and elegant!! There is a very nice bar area with all the top-shelf brands!! A very nice wine selection, all of which is prominently displayed in a huge floor to ceiling cabinet. The gentleman that seated us was very nice and polite! Our server was also very sweet... we wanted for nothing the entire meal... water always filled without ever asking (one of my peeves). The menu offers more Chinese than Thai entrees. Of course I chose the Thai (Pad Lad Nar)and was VERY pleased!! Awesome flavor, spiced/heated just right (enough to make the nose run, but no tears... LOL). Can't wait to go again!!!"], ["Mark K.", "I've been here several times and never had a bad meal.  I think previous visits we've gotten Pad Thai, Mongolian Beef, and the Chi Thai Combination, among other things.This time, I had the Pad Lad Nar, various meats and wide rice noodles in sauce.  It was a huge portion, everything was tasty, and the service was great.  Sure, it's in a strip mall, but the inside is very nice.  There's an extensive Thai selection, and of course the usual Chinese dishes."], ["Dean M.", "I went with my parents, who don't eat Chinese food, and my in-laws, active Chinese food eaters, and everyone left incredibly happy. The service was fast and friendly and the environment was clean and comfortable. I am going to be making this my go to place for Chinese food especially since it's literally right up from my house! Seriously, not your typical quick service place. This restaurant is legit!"], ["Keith B.", "From the outside, I would never step in. From the inside, I'd never want to leave. It's such a contradiction!I came here for lunch one day with my coworkers. It's DELICIOUS. I believe I had the Siam Chicken - sweet, slightly spicy. The service was a little slow, but damn, that food was tasty and I want to go back!"], ["John S.", "I frequent this place often and have never been disappointed, food was always hot and excellent and service is always top notch. Maybe I can understand the negative reviews on their pad Thai  because my wife had it once and said it was nothing exceptional. Probably one of the very few dishes they don't do well, I have never ordered it so I can't comment.  Pad Lad Nar and  house combination are my favorite dishes here.  I would not hesitate to try this place if you have never visited, with the overall lack of Thai  restaurants in Cbus I think this one is one of the better bets to go with.  Would rate them an extra half star if I could."], ["Ravindran E.", "Ordered fried rice, tom yum soup and green curry . Fried rice was amazing but the rest were somewhat disappointing. I have never seen a greenest curry in my life. They have added some color instead of the original from ingredients. Looked scary and was not sure it was healthy. Taste was nice. Tom yum soup was very light to my pallet. Not spicy as you would get in Singapore or in Thailand."], ["David G.", "Doesn't look like much walking up; It's amazing inside. The staff is quick, accurate and friendly. Beautiful atmosphere and very good menu selections. I've been here for almost every occasion, the food is always great for everyone. I recommend the Pad Thai. Coming from a guy whole loves Pad Thai, this is some great Pad Thai."], ["Lisette T.", "We ordered tonight for the first time - takeoutt - because of the stars.  We orderedSesame Shrimp - didn't care for it although good size shrimp.  just didn't have the tanginess i'm used to.  very heavy with a soy sauce flavor.Sweet & Sour Chicken - Did not like this one at all.  The sauce is already mixed up with the chicken, so it was pretty soggy.  not as sweet as i like.Crab Rangoon - hubby said these were the worst crab rangoons he's ever had.  i just found them bland and would have preferred more filling.Thai Dumplings - thought i'd try something different than the normal pork fried dumplings.  these were dry and stiff.  i still prefer pork fried dumplings!Wonton Soup - This was my favorite.  This was really good & fresh.  I loved the wontons and even had some shrimp floating around.  Tasty.Spring Roll - couldn't find an egg roll on the menu, so ordered the spring roll.  tasteless.Moo Shu Pork -  came with \"pancakes\".  thicker than i've ever seen before, like a tortilla from the store.  too thick for me. the filling seems fine.  i'll eat those as leftovers tomorrow.So basically not my favorite Chinese so far in Columbus.  I've tried Joy Food and China Express and prefer them so much more"], ["Dirk K.", "Heavy food that seems better than it is.They say that any time a restaurant tries to straddle multiple Asian cuisines it won't get any of them right. Chi Thai is an example of that in practice. The food was better quality than the cheap, crappy Chinese food but it was really heavy and the flavours, for the most part, had that little edge of chemical-y taste to them.The Tom Yum soup was the best thing we had. It was a good, flavourful one but a little greasy and did not have fresh lemongrass in it (not that I expected it to, but the best ones do).Their special duck dish was bland and the brown sauce to go over it was the most chemical tasting thing we had.The General Tso's chicken was ordinary. Not bad, not good, really heavy.The Drunken Noodles were a bad example, tasted like a Chinese interpretation.It has a nice-looking interior, and I can't vouch for the wait staff. But based on quality of food alone this one is a pass. We went here because it is a lot closer for us than Thai Grille in Westerville, but we won't skimp on logistics for experience between the two ever again."], ["Mike H.", "I wanted to upgrade my review of this place.  I've been back since my initial review and have been pleasantly surprised with the flavor of some of the other dishes I've tried.  The Siam Chicken was really good.  I also love the hot sesame noodle appetizer with cucumber.  I had another kung pao style dish with chicken and peanuts that was really good as well.  I'm not sure if I would give their phad thai or sate another chance, but I will certainly be back."], ["Robin A.", "We eat here all the time. Take visitors for consistently good food and the noise level is relaxing snd we can actually visit with our dinner mates. We get a ton of takeout from here never disappointed"], ["MITCH S.", "Simply put it is one of the best tradional Chiinse restaraunts in town. Chi Thai is beautiful on inside. Portions are more than generous and food is simply great."], ["Polly B.", "I rate Thai restaurants with my favorite soup:  Thom Kai Gai.   It's the only Thai restaurant in Columbus that has a clue how to make it.  No one else even comes close.  Great Thai food!"], ["Melissa M.", "Nice cheap lunch with quick service.  Food was very tasty and I can't wait to go back."], ["Annie M.", "Out of all the places to eat on New Years Eve - we chose Chi Thai. Love this place. The food is amazing. We always get the beef sticks , pot stickers, crab ragoon....You can tell you are eating a high quality food. Always impressed.  The only thing I wish would happen is Chi Thai get a better location in Gahanna."], ["Holly G.", "11-24-2011  An adjoining sports bar has been added.  The last two times we have been there we had to find our waitress to get our bill...she was either texting or playing a game.  We will miss what Chi Thai was.  I can't see why we would return for lousy service in a noisy environment.Chi Thai is a wonderful place to have a meal with friends.  The attention to detail is obvious from the time you enter and throughout the meal.  I like being there.  The food is very good.  The servers are very nice and very efficient."], ["Paul B.", "My favorite chinese restaurant in town.  It doesn't look like much from Hamilton Road, you would think you were walking into any cheapo chinese joint in town, but when you walk through the door, wow!  Beautiful bar, white tableclothes and outstanding food to match.  I've never had a bad meal here.  And I've had a lot of the menu.  I would say any meal with shrimp is a winner, you can really taste the quality.  Spring rolls are fantastic, handmade not factory produced like most in town.  And Steve the owner is a fixture in the New Albany community.  I support local businesses which support activities but Chi Thai makes that easy.  The food is great."], ["Grant C.", "Good food with a broad menu."], ["Dave P.", "My son picked out the restaurant for his 14th birthday by visiting Yelp.  We were not disappointed.  Food, service and portion sizes were outstanding.  We will be back soon"], ["R Y.", "I am a picky Chinese food eater, and this is possibly one of the best ones in Columbus. The first thing you notice is the place is clean and decorated with taste, not like many Chinese restaurants. There is no tackiness, just class.I had the potstickers and calamari appetizer. The potstickers had a nice crust on them without being deep-fried, and the calamari was delicious with nice juicy bits of fresh jalapenos, onions, and red chilis.Our entrees were delicious. We tried the mango chicken, ginger shrimp, and black pepper filet mignon which was perfectly cooked tender. That was my favorite.The wine selection and full-bar selection is huge. I had some Singha Thai beer with my meal.Finally, the service was excellent. I shall return.........."], ["John G.", "Absolutely wonderful food."], ["R M.", "The food was okay, a lot better places for real Chinese food. The older man that works upfront was very arrogant and self-serving. Like he was doing us a big favor by giving us a table. We should have known when one place tries to serve difference variations of Asian food and fail in all of them."], ["David A.", "For carry out this place is the best in the area (I've tried them all!).  Food is well prepared, fresh, and good proportions.  I thought we were doomed to mediocre Asian food on the northeast side until we ate Chi Thai."], ["Doug K.", "I don't live in Columbus but visit a couple times a year. This used to be a place I always had to go but no more. Was here last Friday night and the service was awful. It completely ruined the evening.The food was good, but not as good as I remembered. Maybe it was because the service was so bad that we just didn't enjoy our meal.The waitress rushed us to order, then could not remember our order. In fact, during dinner she had to ask again what we ordered so she could double check what she had already served us. She asked if we wanted the leftovers boxed while we were still eating. I'm not talking not finished yet, but literally after about 10 minutes while we were literally still all chewing food. This was the worst warp-speed service I've ever encountered.Hopefully the management realizes this particular waitress is awful and they fire her. I'd like to try it again when in town, but not sure it is going to make my list again. Sorry"], ["David B.", "Very hard to beat... I had a spring roll, hot and sour soup, and pad Thai. The spring roll was perfection. Probably the best I've ever had. The hot and sour soup was excellent, I've only had better at a few places in Chinatown San Fran, CA. The pad Thai was great, less peanuts than most other places but the sauce makes up for it. Overall I can't say anything bad, so this place gets a 5!!!!"], ["Chris B.", "The decoration was beautiful and the booths are private.  I went to dinner with my boss and we were still able to talk without feeling like the tables around us could eavesdrop.I had the red curry chicken - it was actually a bit bland in flavor and spice.  She had a above average spring roll and great dumplings from the appetizer menu.  We both had amazing coconut soup.  I would go back for the soup, but not the other food.  I'll try it again but prices are a bit steep.  Perhaps a bit over priced for the quality of the food, but the ambiance is great for a date."], ["tracey y.", "My favorite for dumplings, noodles, mmm. Nice inside, waitress was clueless on how to pour a beer."], ["Sean D.", "Checked out Chi Thai for the first time last night and was Impressed .. Gorgeous Atmosphere , Classy Chinese and Thai restaurant .. Food was great and the help was amazing ..  We will be back with guest !!"]], "Ho-Toy": [["Mike G.", "It's called Ho-Toy - not Hoy-ty Toy-ty and it's one of the last of the old school Cantonese restaurants left in Columbus.  It originally opened in 1959 over on Town Street and then moved into the downtown Burger King space in 1980.  It's gotten a little run down over the years but I don't think it's all that bad.  I will echo Mark K.'s review that their AC must not be working right as the restaurant was a little warm but tolerable.Now the folks that run this place are nice enough and their service is fast and polite in the mid afternoon.  I found their prices to be acceptable for the quality and quantity that you get but I wouldn't call it a value place either. Their prices for lunch range from $5.95 for small portions to $9.95 for the large sized portions.  The most expensive dinners are $13.95 so prices are pretty fair.I've had their Chow Mein and Phad Thai (they have a decent sized Thai menu) and both were alright but I've had better.  There's nothing really outstanding about this place as far as quality, quantity and value are concerned - it's right down the middle of the road in every way.This is the type of place I'd revisit again sometime if I were in the area but I wouldn't make it a destination.  It's one of those places that are good but could be so much better.  Check it out if you want but if you don't, you're not missing too much...It's about 2.75 stars but a splash of soy sauce brings it up to about a 3"], ["Mark K.", "Sweetie and I have laughed about this name for years.  I finally made it down here yesterday, and it wasn't bad.  It's a very old-school, Chinese-American place: the menu includes the usual suspects, plus a pretty good selection of Thai stuff.  It's a little run-down, a little grimy maybe, but really not bad inside.  Much bigger than I expected from walking past.  And the sign deserves to be on the historic register.Service was good from start to finish: fast, friendly, but not intrusive.  I had crab Rangoon and pad Thai.  The Rangoons were super hot, with a \"crabby\" filling that was not just cream cheese and a few bits.  The pad Thai also arrived steaming hot; I had to wait to eat it.  It was a solid rendition, nothing outstanding but plenty good.  I had chicken in mine, medium seasoning, and it made this spice-lover sweat.  Or it might just have been the heat- maybe the AC was out, because it was a bit warm in the restaurant.  Anyway, everything was \"good not great,\" but good enough that I would definitely go back.  Prices were very good for lunch.  Pop is just in cans; disappointing, but should I really be drinking 3 Cokes with lunch?I want to give it 4 stars just to boost the ratings, since I think they are unfairly low, though it's not great enough for me to be \"a fan\" until I come back and see how other visits go.  But it is a very solid three stars, and I don't get the \"microwaved\" or \"food poisoning\" comments.  It's far better than a Chinese buffet for about the same price."], ["Bret B.", "Yeah, the place is old. I remember it from when I worked downtown in the early '90s, and it's still the same and it's still good. I hope they never change it. What's wrong with authenticity! It's a freakin' adventure folks. There are plenty of trendy, hot, foodie excursions you can take to beef up you Instagram feed. This place feels like a real-life adventure...back into time!Now for the important part. The food. I had the Hot and Sour soup. Kind of mild, but it looked homemade to me. Not the same brownish stuff with julienne bamboo shoots you get everywhere else. I think it was a chicken stock base with angel hair julienne carrots and lots of egg. The Fried Tofu app was freshly cooked. I had the Spicy Beef Salad. It was awesome. Well, but lightly seasoned lettuce, tomato, carrots, onion, and beef strips. I had a big pot of tea for myself. All for less that $15. For those complaining about microwave food, try ordering something other than General Fr3@king Tso's! (I've never had the GTC there, but you get the point. Order something original to guarantee it will be made fresh.)The customer service was great. The waitress brought the food, and left me alone to enjoy it. She checked on me once and made sure I was enjoying it. She cleared plates as I finished them. I left her the change from a $20 to thank her.I went at 1:30p on a Wednesday (today) and there were only 3-4 tables that I could see. The seating behind the crazy plastic curtains was as dark as an opium den. Perfect. Are you going there to have an enjoyable experience, or to be SEEN having an enjoyable experience? Save your posing for the Short North. If you want to drop names and be trendy, follow the crowd. If you want have an authentic experience, choose your own path. If you want to have an Indiana Jones Thai-Chinese dining experience, go to Ho Toy!"], ["Senekwa C.", "I love the food here I been coming here for yrs I come here once a week yay its a great Chinese place yummmmmmmmmmmmmmmmmmmy"], ["Sarah J.", "Typical chinese restraunt... nothing fancy decor a little outdated (I rarely ever see a chinese restraunt with good decor). Perfect for lunch carryout! Fast friendly service. Restraunt appeared to be very clean. I ordered the Wor-Sue-Gai lunch with fried rice and egg roll. It was good, satisfied my craving for chinese. Nothing spectacular, but decent, cheap lunch spot. For $6.50 you got a descent sized portion that left you satisfied. You cant beat it!  (Even though other restraunts outside of downtown usually give larger portion sizes)."], ["Steve G.", "Pros: .....umm I guess location would be why I've come here twice now. Yeah that's the only thing coming to mind. Cons: - the horrible cramps the meal is giving me- tastes like microwave Asian food fromWalmart- poor customer service- expensive for what you're getting- long wait for carry out (probably have to turn the burners back on)- Looks like a post-apocalyptic Chinese restaurant"], ["Michael M.", "Apparently the decor is dated, but it's very nice.  It was quiet when I was there.  Lunch time must be a big time for this place.  This is a little knook that I'll go to again."], ["Brooke F.", "It was pretty bad. It honestly tasted like heated up microwave food. The prices are good for lunch specials and the premade egg rolls are good, but I would not recommend it and i wouldnt go back."], ["Marley G.", "OK,  I don't get downtown often, but I love this place.  Weird.  Creepy.  Yep, that's it.  It's  like taking a walk into the past.  I always feel like I\"m back in the 1950s at Ho-Toy!  I had lunch there the other day and it was pretty good.  I liked the Thai chili soup a lot. Like others here, I have no idea how the place stays in visit.  Last week there were 4 sit-down customers (and a couple pick-ups), more than I have ever seen there. I've never had a problem with the service, except the bar is pretty slow. BTW, there was once a restaurant in downtown Mansfield with the same name.  I don't know if they were related or not. It was a nice sit-down place."], ["Lee J.", "Pros: Location, only decent Thai- Chinese downtown, nice staff/owners, fair price.Cons: Okay let's be honest the decor is old, everything needs updating but I understand that would be a huge expense for such a small business. I frequent this place for Thai Fried Rice, Orange Chicken, Sesame Chicken etc. It really is middle of the road but it does quench my craving for Chinese food. I would consider a better alternative but Mr. Lee's in the Commons/Mall area is definitely not that better alternative."], ["Catherine J.", "I was torn between a 1 and 2 star review, mostly because of the \"Eek!\" in the \"Eek! Methinks not!\" portion.  But, the food didn't kill me, so I guess there's that.This place legit freaked me out.I was staying late for work and wanted something warm-- something not a salad or a sandwich. I also didn't want to walk too far away. I remembered walking past Ho Toy on several occasions to other establishments, so I decided to try it, as it was just across the street.Before I ordered, I knew three things: (1) It's in a prime location, (2) I remember seeing this place ever since my family moved to Columbus in 1990 and (2) I've never heard of anyone going there, ever. Uhhh.... red flag?I ordered on the phone so I wouldn't have to wait. I used Yelp, read the reviews and I figured it would at least just be standard American Chinese. Because I was already a tad sketched out, I ordered a vegetarian dish. I'm glad I did, because when I walked in to pick up my order, the place reeked. It looked like it hadn't been cleaned since maybe before 1990. It was dark, dank, and stank.There were also these weird flower pots for sale all around, just as another yelper pointed out. They look like they'd been there since 1972, and came in all sizes-- miniature to large. What is going on here?The people who work there seem sweet enough, if a bit eccentric. The lady who took my order via the phone was super polite, though she sounded super stressed and busy when I called-- even asking me to hold (which I don't mind). However, this confuses me, because when I went in there for pickup, the place was completely dead. There was an older asian woman working the (empty) dining room when I walked in. If I have any reviewer-guilt, it's because these people seem so nice. But it's within their power to be better, you know? Clean the place up a little bit? Make a few changes to re-energize the business? I don't know if they don't care or don't realize what is really going on from the customer's view.I ordered the Vegetable Chow Mein, which was sort of a good and bad thing. Stupid, American me was thinking LO mein, not the chow mein. As soon as I opened my styrofoam carton, I saw where I went wrong-- but this dish is a little weird. There were veggies in a light sauce on one side, and then handfuls of fried noodles (seemed like the canned kind you can get at the grocery store) on the other. It was my ordering misstep, and it was fine, I guess. At least I ate fewer calories than slurping up wet, bendy, sauce-laden noodles... I mostly ignored the crispy things. Considering the crispy noodles were likely pre-purchased and there weren't a lot of veggies, I'd say this dish was a little on the expensive side at $6. I also got an egg roll for $1.25. It was okay.Picking up my order was equally weird. They didn't seem to have a system for carryout. The older asian woman didn't seem to speak English, but she directed me to a counter in the back, where I waited for a while for the woman from the phone to come out from the kitchen. Turns out my bag of food was already sitting on the counter, and Phone/Cook Lady just handed me the bag and told me to go back to the front of the store (where I was originally standing), and told the Old Lady the price of my order about 3 times, very slowly and loudly. I think Old Lady is deaf, because she just grabbed the ticket off the bag to see the price-- and we walked back up to the front. It just seemed like a lot of needless shuffling around and they weren't used to carryout orders. The place smelled so bad and was so dirty that I really don't think I could have stomached eating inside.I'm just really confused. This would probably be a good location for a really trippy indie movie about quirky, adorable, depressed people in quirky, depressed situations. Or at least a Rob Zombie movie. Yikes!"], ["David Z.", "\"Scary\" is the first word that I would use to describe a trip to Ho-Toy on a cold winter night, with \"disturbing\" being a close second.  Everything in this place has a stale feeling, and yes, that most definitely includes the food.I was craving Asian, but didn't want to walk or taxi up to Short North one night, and so I decided to eat something downtown. As I walked up to the restaurant, and debated internally with myself whether I wanted to find out if they were actually open or not, I decided to just give the door a chance, and, to my slight surprise, it actually opened.  When I walked in, I found a dark and empty dining room with no one inside, and a lone waitress walking from the back to seat me and provide me with a menu. The food is generic enough, so I tried a chicken and mixed vegetable dish.The chicken had a tough and chewy texture, like they had once been frozen for too long, and then left out to thaw for too long, while the sauce was heavy and flavorless at the same time.  The mixed vegetables actually weren't too bad, but honestly, I was just hoping not to catch salmonella.As I ate my food, the waitress then proceeded to mop the dining room, at least an hour before they closed.  Something tells me that they don't expect too many customers at night. So unless you like scary and disturbing food experiences, Ho-Toy is definitely a place to avoid."], ["Brian W.", "We continue to search for a good downtown Chinese take-out option since we moved to downtown Cbus a few months ago.  Ho-Toy is better than some, but I agree with other reviews, the place is a bit strange. First and foremost, I need to give them props for staying open until 7:00 on weeknights (providing me with a take-out dinner option near home), although it didn't seem justified based on my visit on a Friday night.  Second the food was okay, with no safety issues we could tell.That all said, we really wonder when you go in this place if they are actually still in business.  The decor is way worn and dated.  A single CFL bulb hangs nakedly over the bar, while the adjacent idle hanging fixtures sport outlet adapters (for plugging in what?). In short, not danger here, but my search continues."], ["Matt C.", "When I was a child, my parents took me to Ho-Toy and I remembered it being pretty decent. I must have been the dumbest child in Columbus.Let me preface this review by telling you dirty, unkempt restaurants don't freak me out. I've had fantastic meals in some terribly seedy establishments. Ho-Toy falls into the category of dingy restaurants, and unfortunately, their food matches the ambiance.First up: the egg roll. Before it came out, two maple syrup-style pitchers of hot mustard and sweet and sour sauce were placed before me. The pitchers looked in need of a good wipe down and made me wonder about the age and freshness of their contents.The egg roll comes out and it looks perfect. A perfect, sickly yellow that is. I bite in, and I will bet you anything Ho-Toy doesn't make their own egg rolls. Reason: I was only one of three people in the restaurant. When you get a fresh egg roll right out of the fryer, they are tongue-burningly hot. This one was warm enough to have been microwaved, but my tongue went unscathed. Also, the taste was familiar. Reminded me of the frozen egg rolls I used to buy as a poor, lazy college student.Next up: The Orange Chicken. Or should I say weird looking chicken pieces with a brown, tangy gravy. Let's say that term one more time: Brown, tangy gravy. We've now stumbled onto the least appetizing combination of words in the English language.Pretty sure the chicken came out of frozen food box. The vegetables and rice tasted fine, except that they were covered in, let's say it together, a brown, tangy gravy. (Shudder)In summary, the highlights of my meal were the can of Coca-cola and the fortune cookie. So if you love those two things, Ho-Toy is your jam. If not, go somewhere else or go buy some Kahiki frozen meals. You'll be glad you did."], ["Raymond S.", "Its your typical quick and cheap chinese joint. Nice for those that work around the state house to grab a quick hot meal. Decent amount of food for the price, I wouldnt mind goin back if i needed too."], ["Nick L.", "Ho-Toy isn't your normal Chinese restaurant. They don't actually have any of your 'standard' fried-chicken-tossed-in-a-sauce dishes like sesame chicken, but they do have General Tso's chicken and Orange Chicken, both of which I don't recommend.What they do have is good wor sue gai. The egg rolls (pork) are crisply fried to a golden color, and are almost always perfect. Moo goo gai pan isn't great. My dining partners give five stars to the chicken chow mein here, so if you like the dish, come here for that.I've come to this place several times before for lunch, since it's downtown. Parking spaces can usually be found on the metered spots on State Street or a couple of blocks away.Service is brisk and the dishes are brought out with metal covers on them, but the food is prepared pretty quickly.I didn't sample any of the soups this time, but the egg drop soup here is decent. The amount of food given is pretty decent for the price - but the Chinese is oftentimes bland to me. If you order some of the Thai dishes, you'll get a spicier kick.On this visit, I tried the Phad Pedt with shrimp. It was perfectly balanced between being too bland and too spicy. Had a nice tangy kick to it - basically somewhat like a spicy Moo Goo Gai Pan and the shrimp was nicely cooked with the tails on, which I like.In short, if you need somewhere to go for a solid lunch, give Ho-Toy some consideration. Don't expect fireworks, but they serve hot, fresh, reliable, and relatively cheap food."], ["Tom R.", "Now I understand the reviews of this place based on the décor that ranks somewhere between run-down and post-apocalyptic. The service is friendly and the food is decent. If  you order a Coke they will bring you a can which is something that I find off for this type of restaurant. It is located very close to my office so on night like this when I am working late, it is quick to run over and grab some takeout."], ["Leah A.", "Ate this today for the first time.  I had carry-out and when I went in I was surprised at the interior - it was dirty, old and not what I would expect for being in such a prime location and having been around so long.  There was a sign that the restrooms were $1 (ok, it is downtown) and they were selling dusty miniature flower pots (side business?).  I only saw one person in the entire restaurant eating, which seemed odd for the first sunny day in a long time in Cbus. It was 12:45 so not too late for the lunch crowd.  I ordered chicken fried rice but switched it for my boss's General Tso's because it looked better. I think that may have been a mistake - the General Tso's was about 4 pieces of chicken (I don't think it was all white meat) in a sauce with some vegetables. Nothing special.  The fried rice didn't have any mix-ins.  Overall I'd say my meal was bland. Next time I'll go with Happy Dragon on Livingston for downtown area Chinese."]], "Short North Muay Thai": [["Justin M.", "I've been going to Short North Muay Thai for approaching 4 years now and only wish I would have found it sooner in life.  You are taught the old school style of Thai boxing, and regardless of whether or not you want to fight, you are trained as though you were preparing to step into the ring.  If your only goal is improving fitness, it has that in spades.  I was 209 lbs when I started, and most recently weighed in at 153 lbs.   Kru Hope pushes you each class to be better than you were the hour or two before.  Going there is easily the best part of my day."]], "Thai Basils": [["Susan R.", "Nom!Went here not long ago with friends. I had really tasty tofu Pad Thai and the obligatory Thai iced tea. For a casual, inexpensive Thai restaurant, it really hit the spot.I also had a little taste of the chicken pho and it was pretty delightful. Now that there's a chill in the air, I'm going to have to go back for pho pretty soon.Service was friendly and helpful. While this isn't the most. amazing. Thai. ever, it's certainly a place that hits a lot of sweet spots among affordable, tasty, fast, and casual. It's the kind of place that you stop into when you want something easy and good."], ["Sara S.", "Tried this place recently. Not good. I don't know what it was, but there was nothing about it that made me want to return. I ordered the Pad See Ew w/Chicken and knew from the time I picked it up that it was not going to be good. (Funky smell in the car).Pad See Ew to me is such a simple dish with the noodles being the best part. The noodles were clumped together in lumps and there weren't many of them at all. They use carrot and chinese broccoli in theirs, which I am not a fan of. I love the fresh broccoli to give it a little texture. The sauce used did not taste like the traditional Pad See Ew sauce that I have had time and time again. The dish was dark brown and very bland.The wonton soup portion was great, but the soup itself was flavorless. I do not normally salt my food, but found myself adding salt until I could taste something.Maybe the other dishes are worth a return visit, but I won't be risking that."], ["Anna L.", "The air conditioning wasn't working on the hot summer day we went in :(but I still enjoyed the refreshing Thai Tea I had to cool me down!I had ordered the Pad Thai with shrimp during my visit.  It didn't stand out, and it wasn't the best I've had in Columbus, but it was good."], ["Michael M.", "This restaurant has been around for a couple of years but I just now have started to discover the restaurant on this side of town because I have started to work in Grandview. This place fits in perfectly to serve the businesses on this side of town because they're quick and well priced.   I do wish that they would put their menu online and make it more convenient besides posting an image on the Facebook page.Now on to their food, me and my coworkers ended up ordering most of the basic in classic Thai food items but we all agreed that they were all delicious and just a heads up for those people that like spicy food this place really does get some kick to the food if you ask for it. One coworker had the pad Thai with shrimp and she let us try and it was really delicious, Don't eat issue with the dish was that the shrimp seem to be those pre-cooked shrimp and they were really rubbery and not very appetizing. So I'll recommend to anyone ordering from here to not order shrimp as the meat for their dish. My other coworker and I both ordered drunken noodles, She had the beef which was really tender and very tasty while I had selected shrimp and while my shrimp were not as rubbery as the pad Thai shrimp they still were not great quality. I believe this place will be a regular lunch spot for us from now on seeing how close it is to where we work and they're large menu selection. Next time I get a chance I'm going to try their Pho and see how good it is."], ["Amy N.", "So what if it looks like it use to be an old Burger King?? IT TASTES AMAZING AND YOU CAN STILL HAVE IT YOUR WAY.... What to order: chicken pad thai beef pad see ew pad kee mow (if you like spicy) *** THAI TEA*** (I always get my Thai Tea with a little extra milk so its not as strong) these are the things I've tried. Everything is so authentic and flavorful. It's not watered down to fit the common Anglo-Saxon taste buds. (No offense people but a lot of Asian food in the area have been tweaked to fit to the American taste).  I've also had there tom yum soup which I wasn't a huge fan of because there wasn't as many ingredients as I would like, but overall it is all very good. The meals usually come with a choice of egg drop soup or hot and sour soup. I like hot and sour because it's more flavorful. The egg drop soup is safe, kinda equivalent to the American chicken noodle soup. SERVICE: beyond helpful. The two regulars who work there are so nice and welcoming. Ugh, I can't say enough nice things about this place. They really do deserve the five stars. and shoutout to the people in the kitchen who are throwing it down. It's probably the mom and pop who run the place and oh my god, you guys are amazing."], ["Arvid Y.", "My favorite pad thai in Columbus thus far. I've only lived in Columbus for about a month and Thai Basils is one the few restaurants that has already made it into my regular take-out rotation. It's the combination of great taste, large portions and convenient location that keeps bringing me back.Their pad thai is my favorite in the city. I usually get that and an order of Thai Spring Rolls. The portions are HUGE. Literally twice the size of Nida's for two-thirds of the price. When asking about Thai in Columbus, the almost universal response is Nida's. I like Nida's too, but the pad thai at Thai Basils is simply better. I've tried their drunken noodles aka pad kee mao, which is another good dish if you like a little spice. The service is friendly and food comes out fast. The restaurant looks like a former Tim Horton's, so keep that in mind before bringing a date. With that said, it's the perfect take-out spot."], ["Bryant M.", "If you're on this side of town and are looking for pho, Thai Basils will do the trick!It's in an old Tim Horton's, and they haven't changed much of the interior. Definitely don't come here looking for ambiance. But the place is clean, the people are friendly, and the prices are low. For a giant container of chicken pho, I think it costs about $7.50! They include everything you need for your personal pho party for one--sprouts, basil, cilantro, lime, jalapeños, chopsticks, etc. I'm no pho king, but I thought it was pretty darn tasty! The broth was rich and delicious, and the add-ins were fresh and plentiful. Unlike Bangkok, which I think is drive-across-town-worthy, Thai Basils should be taken for what it is--delightful, cheap Thai food that's great when you're in the neighborhood."], ["Gus W.", "Thai Basils is so close to my house, and yet it's on a part of King Ave that I don't frequent often or at all even. I hadn't even heard of this place until a couple months ago, but it's really changed the game up for me in my regular restaurant rotation. What's so great about Thai Basils? It's tasty, quick, and pretty damn cheap for the amount of food you get. The guy that works the counter is also very nice and super helpful whenever I'm asking about dishes on the menu or looking for recommendations.I'm not a big pad thai eater, so I can't comment much on how this place holds up to others in town, but I can say that the pad thai I had there, I enjoyed immensely. I've also had some of their curry dishes, mainly the red curry, and I would recommend getting that for sure (with beef!). I do wish they could make things a bit hotter, because I'm a fiend for spice!As far as other items on the menu go, I can't say that the smaller dishes like the egg rolls or crab rangoon have really blown my mind, but they're tasty enough for a quick meal on the go. You can call ahead, but you'd better have a menu on hand or know the menu by heart, because they don't have a website, and every time I've gone in, they've been out of menus. I feel like they should get on that. Also, the actual menu on the counter has a lot more options than what's on the board over the register, so make sure to take your time checking that out. The cashier is definitely knowledgeable, so be sure to ask him about any questions you might have. This isn't the best Thai place in Columbus, but it's a huge plus for the people on this side of town, so if you haven't been in, then I'd go check it out."], ["Serena H.", "I don't know if i should write this review as someone from Los Angeles or as a newcomer to Columbus, because perhaps in Columbus-standards for asian food, this place would garner a 4, but in LA standards probably a 2...so I'll give it a 3 to appease both parties on my shoulder.Yeah if you need your fix, like I did after not having Thai food for...oh my god has its really been 10 months???????????? Ah, flash back to the days of having like 10 awesome thai places within a 10 mile drive from home. At that point you get hella good food for hella cheap prices.BUT something Columbus does lack, as I lament to my family and friends back in So Cal, is good asian food. It is with great gratitude that my family has not disowned me when they hear that I just don't eat very much asian food anymore. Trust me though, I'm crying inside too. So I'll take what I can get!Good sized portions for a decent price of like 7-9 dollars for your simple pad thai.  I have not ventured out to try the other entrees because honestly if you can't make pad thai right then it's gonna be really hard to make the less common entrees right. But this place makes one of the closest I've had to decent pad thai here."], ["Zeeshan S.", "Another great Thai restaurant in Columbus. What once was an old Tim Hortons now serves up some great Thai food. Came here for lunch and got the Pad Kee Mao (drunken noodle) with beef. Excellent spice, generous portion. The lunch special comes with soup too and I got the hot and sour, pretty delicious. Overall a fast and tasty Thai spot and I'll be sure to come back again."], ["Michelle L.", "Not authentic. Very disappointed. I ordered the red curry. It was a thick glob of chicken (I asked for tofu) and frozen vegetables. My boyfriend got the pad tai. It was greasy and had no fresh vegetables. I will not return. Waste of $18.I will continue my search for authentic tai food in columbus."], ["Brian F.", "Thai Basils is a great no-frills place to eat or pick up your lunch/dinner.  I stopped in yesterday for the first time, and I was impressed with the prices and the food.  I ordered the sesame tofu, which was a first for me.  It was ready in about 6-7 minutes, and it was still hot when I got back to work.  They also threw in some free soup, which is awesome.  I ordered the Hot and Sour Soup.  I'm not a huge soup guy, but I loved this soup and finished the every last drop.  The sesame tofu was just delicious and really hit the spot.  I wasn't sure how it would taste since I'm used to eating chicken, but it was quite good and a nice vegetarian option.  The interior is clean and nothing special, but this is a restaurant you go for the food not the ambiance.  Lastly, it's a very casual atmosphere, and the employees work hard and are friendly.I'll definitely be back!"], ["Elizabeth S.", "great option close to me. The menu is available on facebook, thank God.  No idea why they dont have it posted online.  Springrolls were fine but nothing exciting, I got Pad Kee Mao and the flavor was good but the noodles were fall apart mushy and terrible.  I called in a phone order and wanted red curry and as it turns out, they have like 4 kinds.  The guy literally read me the menu over the phone and was super friendly and helpful.  Major points for customer service.  I would have given this place 3 stars but the RED CURRY SAVED IT.  Holy goodness - so tasty, spicy, flavorful and a giant portion.  I literally divided it up into 3 portions.  I think I ended up with the Gang Phed curry.  In summary: lame: tough to find menu onlinespring rollspad kee maoawesome: great customer service GANG PHED RED CURRY.  price - I ended up with 2 entrees and an app for like $21 including tip I think.  It was a LOT of food.super easy parkingI will totally go back for Gang Phed red curry and maybe branch out for a different appetizer."], ["Jonathon S.", "Solid food and clean restaurant. My wife and I actually sat in and ate. Plenty of seating and casual setting. Menu is full of all the staples. I had the chicken pad Thai and it was pretty good. My wife had the cashew chicken and loved it. Started off with the spring rolls and those were also great. Will be back to try other dishes."], ["JJ S.", "Just mediocre Thai food! I ordered the Pad Kee Mao with chicken and extra vegetables. The noodles were too greasy for my taste and the chicken was overcooked. The overall dish was more on the bland side in terms of spices. The service was quick! It only took 20 minutes for my food to arrive which I was pretty impressed since there were 3 people in front of me who ordered too. If you want a quick fix of food and do not want to wait in long lines, this is the place to go!"], ["Li S.", "I had the Drunken Beef Noodle and it was soooo good. Mild spicy with a lot of veggies unlike the traditional Chinese one. But real good!"], ["Kyle L.", "I recently moved to Grandview from the North side of Columbus. Sadly, Hunan House on 161 is now 20 minutes away. Feeling lazy and not wanting to take off my sweat pants so that I could be presentable to the general public, I opted to go with take out. 15 minutes, some Yelp reviews, and a Siri request later, I was on my way to Thai Basils to pick up my order with the comfort of an elastic waistband and no f***s to give. The shrimp pad thai is wonderful with a light sauce that doesn't overpower the subtle flavors of lime and peanut. Large portion size left enough for me to have a nice light lunch the next day. My only complaint with it would be the amount of shrimp (5 pieces) given the portion size. Understandable though given that it's under $8 for a huge portion of yummy noodle goodness. I also had the shrimp Tom Yum soup. It lacked shrimp as well and at almost the same price as my pad thai, I found that disappointing. Wonderful flavor with enough spice to make my nose run, which I quite enjoy in the winter months that wreak havoc on my sinuses. I would absolutely order the Tom Yum soup again, though I'd 86 the shrimp and save myself a bit of money. It's not worth the extra few dollars for three pieces of shrimp. The spring rolls are delicious. Light, crispy, and flavorful enough that I was able to forgo the dipping sauce. Mostly importantly, they are not greasy at all. Which allows you to taste the filling sans a burst of hot oil that burns the bejesus out of your tongue. I will gladly be giving them my business again and I look forward to trying more from the menu. Tasty Thai food, generous portions, and affordable prices. What's not to like?"], ["Sarah G.", "Better food than some other resto with Basil in their name and a lot less money! Not much ambiance but I'm here to eat."], ["Jessica D.", "Need a quick thai fix? Don't want to spend the money? Thai Basils is where you'll go.My curry chicken was ON FIRE. Thank goodness there was a soda fountain. The meal was  salty as well... but still edible.  The wonton noodles in my soup were floppy but the broth made up for that. Loved that fortune cookie, though.I would say stick to the basics here: pad thai, pad see ewe, hot and sour soup. All of those looked solid. But if you venture into the thai unknown, you might be taking a risk. But for $7 a dish, you can afford to take a risk.Although Thai Basils from the outside resembles a restaurant, it is definitely a take-out joint. We made that mistake and if you've ever been the only ones sitting in a cafe or restaurant, you make empathize with the awkwardness I felt.But then again, it's nice knowing you can get some thai on the quick and cheap."], ["Lara K.", "New job, new neighborhood, new eats. Checked out Thai Basils as it's pretty close to my office and was pleasantly surprised. The tofu pad thai was flavorful and generously portioned. Lunch comes with free soup - hot and sour or egg drop. I got the hot and sour soup - tasted great and really warming on a cool fall day. Actually quite spicy!My pad thai was great and way too much for one sitting, so I saved half for the next day. It warmed up wonderfully in the microwave and that cut the cost of lunch in half - so about $4.50 each day. You just can't beat that for a yummy pad thai lunch x 2.I'm declaring Tuesday to be Pad Thai Tuesday from now on. You'll find me at Thai Basils celebrating this newly invented festive occasion."], ["Brent T.", "Carryout Pho.  The soup comes with just broth and nice tender chicken (or beef or shrimp).  The Noodles are separate. Put them into the soup immediately, or they will block up.  Very fresh vegetables are packaged separately: sprouts, onions, jalapenos, scallions, cilantro, basil, lime.  Brown sauce and mind-bendingly hot chili sauce are included in small containers.  You make your own preferred mixture of Pho.  A single order is enough for two or three normal people.  $8.00 carry out.  Call in your order and it's ready in 15 minutes.  Love this place!"], ["Dennis G.", "My wife and I stopped in for lunch. I got Kung Pao Chicken and she got Gau Prow (sp?) Chicken. Very generous portions plus free soup thrown in. The chicken in both dishes was very tender and tasted great. We really liked the interior of the place and all of the big windows letting a lot of light in. The gentleman at the counter was very pleasant and helpful. While it wasn't the best Thai/Chinese food we've ever eaten, it was quite good for the price and we will eat here again."], ["A L.", "Best pad Thai in town. Delicious curries (you can ask for them even if they're not on the menu). Perfect Thai iced tea. Amazing vege spring rolls. Mediocre Chinese dishes. Stick with the Thai food and you'll be in heaven. Yum."], ["Kayleigh A.", "Thai Basil is in my usual stomping grounds so I thought I would check it out.  I wasn't a big fan.  I felt that their food was average though it was priced accordingly.  They seemed very under staffed.  We were the only two in the restaurant and our food took an abnormally long amount of time to come out.  The egg roll- which I think of as a staple in this genre of restaurant was not edible.  I was disappointed and won't return"], ["Laura B.", "Eat here...it's a hidden gem! Just had another fantastic lunch here with their Drunken Noodles and they are just so sweet and efficient. The family that owns it takes so much pride in their restaurant and the product that they create. I will continue to go here and keep trying different things for as long as I work in Grandview. The Pad Thai is also totally amazing!!!!"], ["Whitney S.", "This a great little place to get carryout or dine in a VERY casual atmosphere. Pricing is great IMO. The food is fresh and I've enjoyed everything I've ordered. My favorite so far is the red curry (Pad Priek Keing) and now I prefer it over the green. My bf got General Tso's and proclaimed it his favorite in the city. I've also had the Pho which is a good quick fix when I'm not near Lan Viet."], ["Marshall S.", "I was very impressed-- great menu selection and actually quality food-- not a generic east-asian fast-food joint."], ["Diana P.", "Loved the food. Dined in and the service was personal and fast. The thing that impressed me the most was that the ingredients were very fresh. The hot and sour soup is the best that I have eaten!  Will be going back. House LoMein is very good."], ["Jodi S.", "Everything is excellent. Huge portions for the price. Staff are helpful in making recommendations."]], "Basil": [], "Lemongrass Fusion Bistro": [], "Siam Orchid Thai Restaurant": [["Diana F.", "Oh man. This was the place that started it all: my love affair with Thai food. What can I say?First of all, if you consider yourself a spice champion, able to take on any flavors the chef can bring to the table, you've got to eat here. My mom, sister and I tried many Thai places all over Columbus, always ordering \"four stars\" or \"extra spicy,\" always haughtily chomping down the dishes, never quite spicy enough. THEN we tried Thai Orchid. \"Extra spicy, please\"\"Extra spicy? You sure?\"\"Yup, bring it on\"BIG mistake. We couldn't eat enough rice to alleviate the heat, our eyes watering and nose running from all the spice that was added. We were home. My recommendation:  Panang Curry with Chicken (Panang Gai)! The best I've had anywhere. And I've been to Thailand. The Evil Jungle Prince is also really good, and my Mom always orders this amazing fish entree I can't remember the name of. Try something new here, it will be amazing! They are very generous with the rice-- almost too generous. They have \"rice boys\" (as I call them) walking around with big pots, filling up anyone's plate who seems the slightest bit low on rice. Oh man, all I want is Thai Orchid now."], ["Adonis M.", "I haven't eaten there in ten years, not since I was in college, about a half-hour drive away.I am a self-described food snob who has eaten at most of the reputable Thai eateries in New York City.  And with that said, if my memory serves me correct, Thai Orchid is the best Thai I have ever eaten in the United States.If and when I go back to Ohio--for whatever reason--I will make it a point to go back to Thai Orchid.  I hope it is still as good as I remember it."], ["Suzanne L.", "Well, we just moved to the suburbs from the  Short North and I must say we were spoiled with the cuisine in the SN. We wanted some thai carry out and so we decided to try Thai Orchid. We ordered Pad see ew, general tso's chicken and the vegetable curry. All were just ok. The general tso's chicken was thin pieces of over cooked chicken. Really chewy, in fact I had to spit one out after I had chewed it for awhile and was making no progress. I even asked for all white meat and this is what they came up with. The Pad see ew was super bland, nothing to talk about. The vegetable curry was ok. Good vegetables in it, and once I had eaten those I tossed the rest. We ordered enough to have leftovers and there was plenty left, however, I have no desire to do this meal again so we threw the rest out. Won't be going to this place again. If you want good thai food, go to Nida's Thai in the Short North. For us, it is well worth the drive."], ["Terri R.", "My husband and I discovered this place about a year ago and we've been back about 4-5 times. The food is excellent. I've had the Thai chicken cashew, which is a bit spicy (just right for my taste). Its flavor is refreshingly different than your typical chinese restaurant-style cashew chicken;  the chicken is very thinly sliced and very tender. I also ventured in trying something called Panang Gai - you can get it with chicken, pork or beef; I got the chicken. At first, when they brought it out - it's served in a bowl because it's kinda soupy; it looked like a very small portion. But actually, once served over rice, it's actually a lot of food, and I had plenty to take home for my lunch the next day. But anyway, this was surprisingly very tasty and different than anything I've tasted - a bit spicy with curry and coconut milk and a sprinkle of chopped peanuts on top. Very good! One time, I ordered  Phad Key Mow, and it was way too spicy hot for me. I told them about it, they made a whole new dish for me without the heat, so they were very kind about that (even tho the menu states it's a hot dish,  so I should have asked for it to be mild in the first place). Also, this is a very quiet restaurant, so  it's a great place to have a nice conversation."], ["Ted D.", "All diners can be ordered to your specification and the service is always uber friendly. I agree a meal for two will run about $30 dollars but several of their dishes are authentic Thai. Plus on Friday or Saturday nights they will have a live piano player in the restaurant for mood. Not to my liking but to some to people it speaks to high quality."], ["Caroline C.", "I used to quite like Thai Orchid... and then I discovered the Bangkok Restaurant on Refugee which imo blows TO out of the water. Ok so TO is more refined, the decor is nicer, and it's in a decent location, and while the food is good, it just isn't as good. I don't like things terribly spicy, and TO is just too spicy for my taste even when I requested dishes be made a little more mild for me."], ["T O.", "Excellent food. As authentic as I have had, and servings are not too big, and not too small. Vegetables were fresh, seafood is my love, and the shrimp dish I had was fabulous."]], "Lee's Asian Grill And Noodle": [], "Westgate Imports Market": [["Koji Y.", "Service:People here is very friendly. I felt pretty comfortable from the first time.Food:Everything I've tried so far; Yum Woon Sen, Beef Massamun, Pad Thai, Tom Yum, Fried rice with tilapia, Thai tea, Mango sticky rice, are all excellent.Price:Quite easy to my wallet.Overall:I appreciate the quality of food for the price. I simply love this place. If located closer, I would go once a week minimum."], ["Tiffany C.", "I don't know why it's taken me so long to venture over to this beloved ethnic establishment in Columbus. I mean, I live so close I could walk here.Intimidation perhaps? Maybe some nervousness thrown in there?I don't know, but I finally took a chance and checked this place out.We stopped by on a very slow Sunday afternoon. There was nobody else in the place, other than the a lady restocking some produce, and the other workers. We took a sharp right upon entrance and made it back to the food counter where an older gentleman didn't really greet us. I believe he was more enthralled with the rerun of MASH on his TV, but it's cool. We weren't in a hurry and it gave us some time to look. I tried some of the dishes Yelpers recommended. Shrimp Pad Thai (Of course) Spice level 4Yum Woon SenWe got it to go and took it home to devour. There's about four tables in the whole place, so we figured we'd give someone else a chance to sit and enjoy. We live close enough that I couldn't see the food going all wilty before we made it home.   I hate to say it, but my husband was not impressed. My taste buds were more intrigued. I'm not a fan of Pad Thai in general, but I found it delicious and the spice level was perfect. I liked what the older gentleman said in reference at the counter \"Any level higher than five is like putting a lighted match in your mouth.\" Good comparison. Glad I took note.Yum Woon Sen was another interesting dish to me. Not a fave, but it proved to tantalize your taste buds with something a little more different. It's a sour/tart tasting dish, but slowly the spices just seems to do something, and you find yourself enjoying it a little bit more each bite. I agree with Mike G. Egg rolls? Delicious. So much fried 'Yum' in those tiny things. The market itself is interesting. There's a lot of really cool things you're not going to see at your local Kroger's store. Duck heads, Beef tongue, brains? Not to mention every staple required in a Asian food enthusiast's cooking pantry. Prices are good, but like others have mentioned... Might wanna check the dates, as some items were a tad bit dusty. It all around was a cool experience. I think we're going to stop back and just work our way down the menu. I'm glad to have this place in the hood. It's a real unique gem to Columbus for those looking to take a step away from the traditional Americanized food we all grew up with."], ["Donna O.", "People, I have met my spicy-food Waterloo at Westgate Thai. I love spicy food: the tasty-hot; not the numb-tongue, strictly by Scoville scale spicy. (Why eat something spicy/hot if you can't taste it after the second bite?) I'd worked my way through 614 Magazine's hottest foods in town list, so Westgate Thai was a must-try. Most of the time, I get softballed at ethnic restaurants - but not at Westgate Thai.When we sat down, the proprietor gave us menus and informed/warned us about the heat scale they use. \"Anything above five is like lighting a match and putting it in your mouth.\" CHALLENGE ACCEPTED.This restaurant is located inside Westgate Imports Market on Broad Street. There are 3-4 tables, huddled around a counter behind which are food photos and menu items. Their menu (they have table menus as well) is varied with lots of curry, noodles, Asian salads, and appetizers - all in large portions. Vegetarian and vegan dishes are plentiful, too.About that spice scale. One to fifteen, with five topping the limit for most American palates. I honestly thought they were messing around with the spice level for effect. The spouse had a pork dish, level three, and our friend Renee one of the meat-based salads at a less-spicy level.Thinking I'd be conservative, I ordered green curry chicken, level eight.But, let's back up and talk about the smoothies here. They're more like milkshakes than smoothies, a very creamy consistency paired with pureed fresh fruit. Definitely a drink spiked with sweetened condensed milk. I'm lactose intolerant and diabetic, so I might have passed on a mango smoothie had I known.ORDER A SMOOTHIE. That smoothie probably saved my tongue and lips from being blistered. It was my secret weapon for what turned out to be the spiciest as well as one of the most delicious meals I've had in a long time. Spicy, yes. Hot, yes. Searing to the nose, yes. The broth was perfectly balanced with green curry and coconut milk, and there were lots of textures and flavors of vegetables, all cooked properly before being added to the curry. All the flavors and textures came right through - I still cannot figure out one veggie -rind like a watermelon, inside like a tomato, tasted like a cucumber, size of a large cherry tomato. Not bitter melon, but maybe?WOOOO HOT. Usually, I'd forgo rice and I don't like to drink much with spicy meals but I broke after three or four bites, dumping all the rice into my bowl and taking sips of my smoothie when it got to be too much. Right on the line of pain / pleasure - sadomasochism, culinary-style. No sweating, no crying, but there was plenty of nose action and mouth-tingling goodness. And, by Jove, I finished that curry!We ordered sticky rice with mangoes for dessert, which was exactly the kind of thing one needs to settle down the stomach after ingesting an atomic bomb.(The answer to the QUESTION YOU MAY BE ASKING: A couple of blisters on my lip, and the next day I felt like my insides were being squeezed by a boa constrictor for a few hours, but nothing worse than that. Not even the issues which result from accidental lactose ingestion. I think my body was in utter shock and couldn't even.)We closed the place down (they close to diners at 7:30pm and shut down for the night at 8pm) before we were able to get a good look around the market itself. Next time, because we'll certainly be back. (Much like childbirth, I SWORE I would dial it back next time, but I'm already wondering if I could handle it again...)"], ["Naiying C.", "We had the Lad Na, Ba Boong, Yum Woon Sen and Pad Phirk Khing. All were very good! Lad Na- wide noodles with a delicious brown gravy sauce, choose any meat you likeBa Boong- we never had this dish before and it was surprising good. The noodle is covered in a creamy coconut sauce and you have to mix in the fish sauce, peanut and chili in yourself. Top with tons of veggie and a spring roll which adds interesting texture/flavor. SO GOOD! Yum Woon Sen- sour and spicy goodness! Pad Phrik Khing- crispy beans with beef (your choice of meat) Spice level goes from 1 to 12(or was it 10), I don't usually eat spicy so 3 was good, 5 is where I start feeling the spice but can still handle it. Definitely worth the drive!"], ["Marygrace A.", "Service was a little slow, the food was OK, and I expected better.After reading reviews for this hidden treasure in an Asian grocery store, I thought this place would be better.Tried the pad-thai with shrimp, and the lychee-mango-jello dessert.The server gave us the heat scale of American, Mexican, and the hottest, Thai. We chose the Mexican rating, and it wasn't very hot. The noodles were limp, and the dish lacked flavor.The dessert was pricey ($6), and included tiny bits of fresh fruit: young coconut, lychee, mango. And lots of green jello. All in a creamy soup, with ice. It was refreshing, but the ice ruined it - watered the whole dish down to a flavorless, gummy soup.Had my hopes up, but the wait was over 25 minutes for 1 dish. Would not return, unless with a regular who knew exactly what to order."], ["Annie B.", "You know how there are times when you eat somewhere and think wow! That was good! We should come back \"sometime\"? Yeah... I found myself thinking perhaps I should wander the market until I'm hungry again. Wondering if they serve breakfast. Considered changing apartments to facilitate walking here. It's that good.  It's in an Asian Market, it's small and awkward, though very clean. The ambiance is a big bag of who cares once the food hits your table. We had fresh spring rolls which are shrimp, basil, cilantro, and rice noodles wrapped in a rice paper wrapper. They are not fried, and taste like a crisp spring day. They are served with a sweet sour dipping sauce with crushed peanuts. I had the Pad Thai, at a level 2 spice. It was glorious, sweet, with a taste of sesame oil, balanced with citrus and peanut- best pad Thai I've ever eaten. We also tried the Panaang Curry at a level 3. Fresh beautiful veggies, a complex and balanced broth, and a pleasant heat with tender flavorful juicy chicken throughout- just lovely! Served with perfectly done white rice.  A note on spice levels: our order taker was very good at explaining it to us, it's a 1-12 scale, with 5 and above basically only for those who grew up with it. To determine your level ask yourself this: \"did I grow up in the Midwest with typical American cuisine?\" If you answered yes I'd go no more than a 3. 4 if you like spicy /hot food. We topped off this flavor explosion with Mango rice. This is glutinous rice with coconut milk served with sesame seeds on top and cut up mango. Whatever that pulls into your imagination, trust me when I say that mango sticky rice is proof that God loves us when it's mediocre. When it's done well (and it so was) it makes you believe that everything in the universe is  good, it's all going to be ok, and we are all in this together. I know it sounds like hyperbole but I really feel this way after eating this absurdly delicious treat. I cannot speak to the \"authenticity\" of this to traditional Thai food, as I am not from there, and have never been there. I have eaten a lot of American Thai food, and I can say with authority that of the Thai food I've had this was out of this world good, and was very much a stand out. I literally can't wait to go back and try other things...maybe for dinner tonight...."], ["Ashley F.", "Best Thai in Columbus! I could eat here everyday. If I did, I would probably graduate from the green curry, but it's just too good. The fresh spring rolls and mango sticky rice dessert are delicious as well. So many options for such a little place. Mmm the smell of warm Jasmine Rice...Handcrafted ingredients by an extremely thoughtful chef. She's the Thai grandma we all wish we had! Don't expect a regular restaurant, it's way more relaxed. Bring an open mind and you'll be back like the rest of us- can't get enough."], ["RC C.", "This little hole in the wall has a fantastic eatery inside.  Only five tables.  The papaya salad and pad Thai were wonderful. Very Authentic also.  Spice range 0-12.  4 or 5 on the spice scale will be sufficient for most."], ["Brianna M.", "I told my friend that I wanted to eat Thai food for my birthday and he brought me here. I was so excited to try it! Columbus' thai food scene is so hit or miss, but I truly believe that this is a real hit! It reminds me of the beloved and delicious thai place i frequented when I lived in NYC. It's tucked in the back of an Asian market, so you know everything is fresh and authentic. This place has a real family feel. The chef/owner? came to take our orders and asked us our spice levels. I decided on a puny level one just to see where the bar was set. For those who can't handle spice, don't go above a 1 or 2! My date ordered a crazy level of spice and he loved it. She isn't afraid to give you the heat if you ask for it! I definitely want to come back and try a curry next time. Very inexpensive and delicious food!"], ["Kimmie K.", "The best authentic thai restaurant in Columbus, OH.  Be aware! Anything above 3 is super spicy (1-12). A typical \"hole on the wall\" asian restaurant, but cheap and high quality foods! Owners are very friendly. Don't be scared to go in there. Just give them a chance. You won't regret it!"], ["Jennifer B.", "Amazing find!  Located in the back of an Asian market. Four tables. Fantastic food. Cook will adapt most menu items for vegetarians."], ["Spencer M.", "Was directed here by another foodie and when I checked out the location, I had misgivings. Took the wife and twins and could not have been happier; small, but personable. Got the Red Curry at level 6 (probably could've gone up a level or two) and the wife got Pad Thai while the kids munched on sticky rice. Delicious doesn't cover the taste; Super doesn't cover the service."], ["Zeeshan S.", "If you love Thai food as much as I do, this authentic Thai spot is definitely a place to check out. Situated in the back of a Thai market, their limited seating and handmade menu shouldn't scare you away. These little hole in the wall restaurants are fantastic and this one is no different. I tried the fresh spring rolls which were just about as good as anywhere I've had. Still a good roll though. Their affordable Thai iced tea was so delicious that I ordered a second! Tried the chicken pad Thai and it was amazing. Got it at a spice level of 4/12 which was the perfect level of spice. Got the yum woon sen and it was also delicious and perfect at the spice level of 4. I would definitely recommend this amazing Thai spot on the west side of Columbus!"], ["Karyn M.", "While the competition for good, authentic Thai places in the Columbus area is weak, this little joint is easily the top of them all. It's in an Asian market and setting is a little sketch, but the food and price is on point. Came here for lunch with a friend and got the shrimp pad thai and fried rice with tilapia and chicken. It was so good! The spiciness scale is a little weird; scale of 1-12 but anything higher than a 6, they said, is like lighting a match in your mouth. The pad Thai at 5 was quite spicy for me - and I normally eat things spicy. Fried rice was at a 4, and it was perfect. Spring rolls were like anywhere else. I can easily make spring rolls, so I'm not too impressed by them since they're quite simple to make. Thai iced teas were $2 cheaper than other places and delicious- not too sweet! Had the sticky rice and mango for dessert since I rarely see it on the menu around here. A simple dish, but I love it. I highly recommend this place and plan on returning to this little gem to try some of their other tilapia dishes and curry."], ["John V.", "I had fun here!  I'd shopped for ingredients here but never patronized the restaurant.  You feel like an insider sitting in one of the 6 tables.  Let it be said from he start, the food is very good.  But they are willing to do the BIG HEAT.  The server lady asked my friend how spicy he wanted and he settled on \"3\" with her advice (and he found it quite spicy for his taste).  I told her I liked quite spicy food and I wanted it as a Thai person would eat it.  She worked real hard to talk me out of that, and we finally agreed that my food would be a \"9\" on the scale of 1-10.  She checked on me 15x, as I ate it.  I smiled like I was totally used to such heat, kept my water glass full and ate it all.  Truth - it about killed me, but I ate it all and actually loved the flavor.  She never believed me when I told her it was just right, spice wise.  As I left, she said, \"Next time you come, you order \"10\", I give you \"6\".  Can always add heat\".  I thanked her for adjusting their scale to mine, and allowing me to preserve my reputation.  Go here!"], ["Tiffany B.", "I had pad Thai here once before and it was amazing. I just went back and ordered the same thing with a spice level of one. It is so hot my eyes are watering. My husbands is the same. I called to tell them to make it right. They kept insisting it was just spice level one. They said I could drive back there and bring it back for a refund. Screw that. I'm not wasting my gas and driving there again for their mistake. I'll be disputing the charge.  Bad customer service always deserves 1 star. Not to mention it smells God awful in there."], ["Natalie H.", "The food here is fantastic! My chicken pad thai was fresh, savory, spicy, and just as good as all the other reviewers said it would be. I'm already craving to go back again for more so I can try additional menu items. The service wasn't anything special or friendly, but it was adequate.  I would totally give it 5 stars for food quality, but the sanitation/cleanliness of the shop does have room for improvement. I hope the high quality food here continues to get the attention it deserves!"], ["Bryant M.", "I've been to Westgate Imports Market twice in one week, and I've walked out with exactly the same thing both times: dried Philippine mangoes and young Thai coconuts. Now that might seem like a short list, but both of these things can be hard to find in Cbus - especially at a good price and good quality. This is a fairly small market, but they pack tons of goodies inside! They have a good produce section that is really good fruits and veggies at fair prices. Not like the hit-or-miss items at Saraga. They also have a lot of the same items that other Asian markets have - frozen meats and fish, canned goods, sweet treats, and teas. In the back of the store is a tiny little restaurant with only 3 or 4 tables. I haven't eaten there yet, but I keep reading their Pad Thai is the best in the city! I'll definitely give it a try on my next visit. WIM won't be on my regular shopping list - I can't get everything there - but for great Asian goods, it's totally worth the drive. Btw, their young Thai coconuts make amazing fresh coconut milk!"], ["Jillian M.", "Truly, I would give this place 3.5 stars if that were an option, but I'd rather round up for the sake of supporting a unique small business. I live nearby, but it took me a while to get around to checking this place out. My first experience was when two of my friends/neighbors had several entrees from the restaurant at their dinner party. We raved over everything! I can't remember the four dishes that we tried, but I do know that one was the pad thai. Time passed, and I never got around to going in to check it out. About two months ago, I stopped in to take a look around and do a bit of shopping. First thing? This place kinda smells. Like, that 'coolers aren't turned up high enough' mildewy smell. I sucked it up though, as my curiosity pushed me farther inside. They have a TON of products, almost all asian things that I was vaguely familiar with. Their prices on dry soba, rice, and buckwheat noodles are 1/3 the price of the ones you would find in the international foods sections of major grocers, for the same brands! I walked away with noodles, canned coconut milk, and a can of green curry paste (that I later found out was SO SPICY I couldn't eat it. RIP curry shrimp). Upon inspection later, both my noodles and curry paste had been expired for several months. Does this matter? Probably not, but make sure you check the dates on the items you purchase. The produce selection looked a little wilted, but the prices were fair. I could see coming here if I needed a last minute item, or if I wanted one of the special items that you can't find elsewhere. I'm a little wary of the 'frozen' seafood. I will continue to come here because the prices are phenomenal, and I have to have that thai food again!"], ["Michelle N.", "First time coming here, ordered the shrimp pad Thai (spice level 5) and egg rolls. This is the best pad Thai I have ever had. I got it a little too spicy for me, spice level is 0-8 and the guy on the phone described a 5 is like having one match in your mouth.  Everyone was really nice inside as well."]], "Bangkok Grocery & Restaurant": []}