{"Green Lake Chinese Restaurant": [], "Hot Wok": [], "Mama Fu's Asian House": [["Eugenia A.", "Forgot how much we love this place! From a fast casual perspective, @mamafus is at the top of our list. They're new \"Black Market\" Vietnamese dishes are fantastic! I had the Vietnamese Vermicelli, with extra veggies and tofu. Taste was balanced and delicious. He had their Thai Basil entree, which is his stable favorite and very tasty! If you haven't been in a while, go back today! #yum #wine #beer #foodporn #vietnamese #thai #mamafus #yelpjax #jacksonville #mandarin #asian #delicious #foodie"], ["Tabitha B.", "First off the potstickers are FANTASTIC. I ordered the teriyaki chicken and it came out steaming hot, which is a very good thing. The teriyaki flavor however was not a normal teriyaki. It was a sweet teriyaki and tasted a bit westernized. It was NOT bad though. Tasted very good, it was just different.P.S. Bring a jacket this facility is freezing!"], ["Lora H.", "We first found out about this place from a friend and decided to give it a try because we were told that it was a step up from fast food Chinese, and good clean healthy foods.  We have never been disappointed when we have gone to the restaurant and this time was non exception.  They used fresh ingredients, nothing from a can, and make it fresh as it is ordered.  There are many different types of Asian cuisine on the menu for you to choose from, which makes it great for the family.  We happened to hit it on kids eat free night, so that just made it better!For this visit I had the chicken and cashews with white rice and I have to say that it was pretty stinking good.  Sometimes when I have gotten this dish at other restaurants it feels like the ingredients have been sitting around for a while, but Mama Fu's knows what they are doing.  The beans and carrots were fresh and bright and colorful and begged me to keep eating!  :)  I would highly recommend this restaurant for quick sit down service with fresh ingredients and variety to please the palate of almost anyone."], ["Linda V.", "We stopped eating at Mama Fu for several years but met a group of friends recently and I was seriously impressed. The food was great especially the chic in lettuce wraps!!  We love the pad thai but will try others things now they have improved their food."], ["Jill C.", "Last week I was invited to come try Mama Fu's Asian House in Mandarin. They are very conveniently located on San Jose near 295 and were pretty busy when we arrived, which is a great sign. We ordered our food at the counter and took a seat. We talked a little with the owner and found out that she recently did some renovations to the restaurant (she has owned Mama Fu's since January) to make it more modern. She has done a great job because they place is beautiful. I also love that you can see into the kitchen and watch them make your food. Everything is cooked fresh right there!For my entree I went with the Mongolian Chicken with Fried Rice which had sliced mushrooms,  fresh onions, and scallions. Wow, this plate looked fantastic! Everything was steaming and you could tell it was freshly prepared. I took my first bite and was very impressed. It was very delicious and had very distinct flavors. There was noting bland about this dish! I also really loved the fried rice. It had a taste all it's own and was different than others I have had. We were sitting there at the table commenting on how great it was, really.My husband decided on the Thai Cashew Stir Fry (Steak) with toasted cashews in a garlic soy sauce with carrots,  broccoli, mushrooms, snap peas, and red bell peppers. He was also in love with his dish. I took a little bite and was blown away at the flavor. Verdict: Loved it!We were really happy to be invited out because this place was amazing! While talking to the owner we found out that they also offer online ordering as well as a loyalty program ($10 credit for every $100 that is spent!) We were very impressed with the food and the prices are great (under $10). If you are in the Mandarin area, give them a try!"], ["Gina D.", "Really wanted to give 2.5 but not sure how. This is an ok place. It is the olive garden of Thai food. The basil roll did not taste like anything unless you put the sticky sauce. Not the peanut sauce typically served. The crab ragoon was not good. Barely any filling and you could tell had been sitting a while prior to sitting on the counter waiting to come to my table. The shrimp pho was warm and good for a rainy day. Not as good as a traditional pho but had some flavor. The service was good but at 630 pm one would not think they would appear overwhelmed. No napkins at table or given when food served. Good thing a spoon came with my dinner as we had no utensils as well. The place was packed though. Maybe just a bad night. Plus:  they have a large container with cut lemon and lime with tonges to help yourself. Please was also very clean. Sometimes the small things make a difference."], ["Charlie T.", "I usually go for their shrimp lo mein. They are usually fast and friendly. I haven't eaten inside, and always take my food out. It reminds me a lot of PF Changs, except it is not quite as big, but The food and atmosphere is very laid back. If you're looking for a good asian alternative go there."], ["Chuck L.", "Been here many times and never ever had a bad experience!!! From the Pot Stickers to Pad Thai it's amazing ... Tried the black market menu tonight .... Bangkok Green Curry Shrimp !!!! Holla, spicy but loved it !!!!"], ["J N.", "Food could have been hotter. Asked for extra broccoli did not get it. Could have had more chicken. Flavor was great."], ["David D.", "I thought I'd give this place a try because I received a coupon for delivery in the mail.  Their online ordering system incorrectly told me my address was in the wrong format despite my simple one-line house address.  I called to get it fixed and my call was answered \"hold please.\"  4 minutes later (I set the phone down on speaker and forgot I was even on hold) they finally picked up.  There was several more minutes of not-helpful discussion such as \"did you enter the zip code?\"  which I obviously had done.  Then I was connected with the manager Miguel who asked for my address which he said showed up in another state even though I'm only 3 miles from the restaurant.  He was unable (he didn't really try in my opinion) to fix my problem and his offer to have all my future orders placed via phone was unacceptable to me.  I'll never order here ever."], ["Jerry B.", "The prices were good fit the amount of food. I got the Thai basil with a side of Edamame. The Thai basil was good, though I had to add sriracha to have any heat. The Edamame was OK at best."], ["Pedro S. M.", "Today was much better than last time.  I think it was me partially and partially the cook. Maybe im hungry that is why the food is delicious.  Won ton soup excellent.  Egg rolls heavenly."], ["Jacob G.", "This store has been a frequent stop for me the past couple years and has recently changed owners so I thought I would give it a review. The food is always great and comes out as I order it. I have stopped in for lunch and I have rushed in before they close doors at night and the service is always great and welcoming. I have had the new owner stop at my table a couple times to ask how everything is going and she has taken time out of her day to just have normal conversations with my girlfriend and I while we are in the restaurant. I like that the owner actually talks to customers because it shows that she really care about the customers and fulfilling their needs, it also provides a unique experience that you don't get at most other sit-down restaurants. Overall this store will always have my business and I recommend it to people all the time."], ["Gabie R.", "My favorite dish I always get is the Vietnamese Crunchy Noodles with shrimp. I never get anything else although if I did it would be the pad Thai. I love all the vegetables thrown in the dishes! Great spot for kids to get something different than the usual."], ["Mandi M.", "Crab Rangoon, Pork Dumplings (steamed & fried) Chicken Lo Mein, Fried Rice, Chicken Teriyaki & Steak Teriyaki is the normal food for our family dinner when we visit or call for takeout. Everything is pretty good, although the last few visits the crab Rangoon has been almost empty, so we haven't ordered as often. Hopefully next order will be better!"], ["Deborah C.", "The menu being on the wall was a bit 'off' for me. I get the idea, but when deciding on what I want to eat I like to hold a menu in my hand and really take my time to look over it. When I asked for a menu the cashier pointed to the wall... Didn't like that too much. Other than that, the food options are great. I ordered the lettuce wraps and Thai coconut soup which I love. I'm sure to be back. Also, my food came out pretty quick."], ["Kate W.", "I don't get the chance to come here often, but there hasn't been a dish I haven't loved! I had Tom Kha last night and it was just heavenly. The cashiers are nice and helpful and the atmosphere is comfortable."], ["Tina G.", "Really enjoyed Mama Fu's. I went on a Friday night so it was pretty crowded and service was a little slow. But food was fresh and delicious."], ["Howard M.", "This restaurant used to be very good; however, since a change in ownership or management  it has really slipped in quality. After my last visit I got quite ill due to their low quality of food."], ["Tejan J.", "Some of the best fried rice I have ever had in my life!!! Very kind people and everything there is delicious"], ["Courtney A.", "The Pad Thai bowl is really good.  Although Old Siam at Jax Beach was amazing, Mama Fu's comes in 2nd best."], ["Tom B.", "I eat here usually once every couple weeks.  The food is definitely better quality than the local chinese joints shoved in every other strip mall but you will definitely pay a couple dollars more for the difference."], ["S K.", "One of our favorite fast food restaurants.  Great Tofu, Brown Rice, Great Taste....What's not not like?"], ["Nara W.", "The 'crispy' noodles were tough and obviously microwaved.  Veggies were decent but everything overall was bland.  Found 5 (decent size) shrimp in the dish.  It seemed to be a very americanized version of asian food.  I will keep hunting for a more hole-in-the-wall place with flavor."], ["Ian M.", "Have been here a lot of times, food and service is always good."], ["Alisa J.", "I have to respectfully disagree with Megan's comment about this being substandard.  I have eaten at Mama Fu's more than a dozen times.  I believe her bad experience was unfortunate, but not the norm.  I have eaten many meals at Asian restaurants in big cities, so I can compare the two.  The food at Mama Fu's is high-quality and fresh, but their model is quick-casual dining.  It is not exactly authentic, but my husband and I enjoy it for a quick meal.  I like to get the spicy green bean entree with chicken and a side of brown rice; my husband's favorite is the Pad Thai (I prefer to get Pad Thai when we go to a real Thai restaurant - it's just a little different.)  The Thai Shrimp appetizer is really good as well.  Give it a try, I think you'll like it."], ["C F.", "I love Fu's.  The lettuce wraps are awesome!!  Spicy General Fu is super.  Fried Rice with anything is great as well.  Always fresh, always hot, always tasty.  One of the Jacksonville's best fun places to eat."]], "Chef Chan Asian Cuisine": [], "Sun Sun Garden": [], "Peony Asian Bistro": [], "Wok-N-Roll": [], "New China II": [], "Hibachi Grill & Supreme Buffet": [], "Green Tea": [["Michael L.", "My fiancee is Chinese and I get a lot of exposure to really excellent Chinese food both at home and in restaurants in New York, San Fran, LA etc...when we visit her family.  Green Tea is very much on par with what you'd find in larger cities.  Even in Jacksonville I've had my favorites that ended up falling short to the quality and freshness at Green Tea.I haven't had anything bad here.  You can order without fear, I personally recommend the Mei Fun, Lo Mein, Wonton Soup, dumplings (steamed or fried)."], ["Alissa S.", "Green Tea has the best Chinese take-out that I have ever had in Jacksonville. Unfortunately, tonight the food wasn't as good as it normally is. The only issue that I had is that it was bland. Both the wonton soup and chicken lo-mein were just subpar and I actually had to add soy sauce to it, which I never do.Other than tonight's experience the food is usually really good. They are also friendly and fast."], ["Pedro S. M.", "Green tea has been around for years in the area.  The best chinese in all of jax.   Anything you order is good hot and sour soup the best.   Orange chicken and general tso excellent.   Chicken wings better than any chinese takee outee"], ["Jared S.", "Great customer service, great taste and great price. I'm visiting the area on business and tried this place opposed to others because of the great reviews. Did not dissapoint! Would recommend and I may return before I leave!"], ["Peter Y.", "After our first two Asian restaurant experiences here in Jax we were starting to think that good Chinese food didn't exist around here. However we found Green Tea and it completely changed our opinion. This place rocks. The food is excellent, the service is great and we have always left completely satisfied. The Orange beef is so good I have a hard time trying other things."], ["Morgan H.", "I really only order one thing when I go here....wonton soup....and the occasional  egg roll. It's the best wonton soup I've found so far in Jax so I'll definitely keep going back. The reason I'm not giving it more than 3 stars is for the sheer fact that I've not tried other items from their menu."], ["Cassie C.", "One of the best Chinese Take Outs in Jax! They are fast and DELISH!! We normally get the Lo Mein, Pepper Steak, and S&S Chicken along with White Rice and Shrimp Egg Rolls. Sometimes the Lo Mein is a little too oily so that is why I took away a star. Other than that, I highly recommend this place! And they deliver!"], ["Megan T.", "Another failed attempt to find decent chinese in our new town. I cannot believe people think this is good! I have had better in mall food courts!"], ["Bonny D.", "Love this place!! Food is always cooked to order. We've just about eaten our way through their menu and have found nothing that's not excellent! I wish I had a favorite to rave about. But, seriously.. IT IS ALL GOOD!The owners are friendly and always give a free \"something\" just as a thanks.They will make substitutions and cook something not on the menu if you ask!Love this local gem!"], ["Lauren V.", "haven't had a bad meal here! The Wonton Soup is awesome! And the pot stickers are gigantic in size too! Always fresh food. And they deliver."], ["Ceci S.", "I ordered from this place my first time after reading the reviews of how great this place is. After what seemed to be an hour, I finally got my food delivered. I ordered shrimp fried rice, orange chicken, general tsao chicken, and shrimp chow mein. What I got. Shrimp fried rice, 2 orders of orange chicken, and this shrimp cabbage bowl, oh and 2 sides of steamed rice. It didn't bother me that the order was wrong, these things happen, what bothered me was the fact that the lady argued with me after I called to let them know it was wrong. On top of which, they weren't busy. HOW does chow mein (this noodle dish I have gotten from EVERY other place I have eaten Chinese food place from) to a cabbage dish?! I don't know, maybe someone else can explain that. Next, she assures me she marked the dish that was orange chicken and not the one that is General tsao. Again, both look and taste exactly the same but apparently one is orange and the other is not. Pictures to follow!I will most DEFINITELY NOT visit this place again!!!"], ["John L.", "Come on guys, 5 stars for standard Chinese take out?  Are you kidding me?  It's pretty good for take out, but there are like 15 other places I've been to in jacksonville with the exact same menu, taste and quality.  Pretty normal for Chinese take out, nothing special."], ["Craig T.", "Best Chinese takeout in Jacksonville. There food is always fresh. They make everything homemade. True mom and pops place. Egg rolls are outstanding."], ["Kram T.", "Let's see...1.) Food is great!2.) Service is great!3.) It's always clean!Normally I go into to further detail but really it's a 123 deal here.We've never been disappointed in anything. Seriously, the previous reviews and mine are as advertised.The Mongolian Beef and General Tso's are very good and I use those 2 dishes as my \"indicators\" of any great \"strip mall oriental\".There is always a steady (and I mean constant) stream of regulars. Another great indicator of great \"strip mall oriental\". I do not use that phrase in a derogatory manner, it's just a simple fact of many restaurants of this type.I would recommend them to anyone, any day of the year!"], ["Scott B.", "Fried chicken is the best in town! The other food is about average for the price range."], ["Cathrine C.", "Such yummy Chinese food!!! My co-workers and I always order lunch specials which run $4.95+tax and come with rice (if you don't want rice, just ask to get extra meet or pay $1 more and get steam veggies). We always do delivery so it is a $10 minimum, but between me and other co-workers who love the egg rolls, it's an easy target to meet. The General Tso's chicken and Orange Chicken are super good! Definitely something to try when you go there even if it's common.The service and delivery are pretty fast, and they also save your information in their computer so it pull it up once they ask for your phone number. One of my favorite Chinese spots to eat at! :)"], ["Alyssa D.", "I LOVE green tea! Been going here for a couple years now. It's the BEST quality Chinese food I've found. Every time I get delivery they are ALWAYS ON TIME with very friendly service. Not really a dine-in place but you can. My food is always hot when I pick it up and they ALWAYS have my order CORRECT. Love this place and will continue to keep going."], ["Carl G.", "We've picked up from Green Tea 2 times the past month and it was excellent both times. First time we ordered chicken and broccoli and beef and broccoli combo dinners.  For a minimal upcharge, we had shrimp egg roll instead of pork and shrimp fried rice instead of pork.  The portions were huge.  The last time we ordered, we split a large chicken and broccoli, 2 delicious and crispy shrimp egg rolls and excellent shrimp fried rice, total cost $16.  The portion was large enough for leftovers feeding the 2 of us the next night. We asked for white sauce on the chicken and broccoli instead of brown and it was wonderful. NO MSG served here. Green Tea is definitely our Chinese pickup place from now on.  If the phone is busy, it's because it is sooo good. It's worth the re-dial."], ["Moni A.", "Awesome, friendly and fast. Spring rolls, egg rolls were yum! Very clean inside and they are always super busy."], ["Tina J.", "Love this place for Chinese! A lot of times when it Chinese it is very greasy and you feel so weighed down, not at Green Tea. Love the Singapore noodles and the fried rice but honestly everything I have gotten thus far has been good."]], "Panda House": [], "Rice Bowl": [["Tracy D.", "The name makes me think more of a Chinese takeout joint than what this restaurant really is. The food is surprisingly good and it's an amazing find for a gluten-free diner. The service was very good, despite it being near max capacity on Sunday at lunchtime. It is a fairly small restaurant, so I did not ask for a gluten-free menu thinking it didn't exist. When I asked a few questions, they offered one. I was really surprised at the number of GF options, including appetizers and numerous entrees, more than most restaurants. They have ability to specially enter GF on the order ticket as well.We ordered beef pad thai, chicken curry, and pineapple gai pan.  The chicken curry was my favorite, Thai style, which I had not had before.  It had a hint of spice (we ordered it mild for the kids) and it was slightly sweet.  It was phenomenal, and my kids and husband loved it too.  The pad thai was also awesome, which I had two kids fighting over.  Everyone liked the pineapple gai pain as well, with one or two claiming it was their favorite. My kids don't really like Asian food that much, so it was really outstanding for them to even want to be there.In addition to all of that, they are willing to make you anything they have the ingredients for, so you can customize at will or ask for something off the menu.  Prices were very reasonable with us ordering dinner portions, and lunch portions are even cheaper.  I've been thinking about the curry since and will be back there soon."], ["Jeana L.", "Food here was okay for me and not so much for my fiancé. We had the Orange Chicken Lunch with steam rice and clear soup, Duck on Rice, Chicken Dumplings, and Chicken Korean Noodles. We had the chicken dumplings fried as an appetizer. Tasted pretty good, hot and crispy. My fiancé had the chicken Korean noodles. He didn't really like it and said it tasted pretty bland. He was thinking it would be like Japchae, but not really. He was a bit let down, he still ate it though.My clear soup tastes like regular soup will scallions, onions, and mushrooms. Not the usual you'll see at sushi restaurants. It tasted fine and hot. The orange chicken was pretty good, but it tasted more like honey chicken with a mix of oranges. I liked it. Duck on rice looked pretty good. I expected the duck to be grilled which is what I'm used to, but I guess here they batter-fry it. Wasn't that bad and came with fried rice and mixed veggies. Pretty good. Overall, the waitress was nice and attentive. The fortune cookies were stale. Our bill came out to be about $45 (tax included). Be aware that when you order sodas, it comes in cans and not refillable unless you want to pay per can."], ["John R.", "Found this place on yelp. I can say the food is great and coming from a new yorker it 100. The waitress is very nice and is willing to make your  stay as pleasant as possible.  I'll be back before I head back to NYC . The place is clean and dose no smell like wo hop in the city. So come on down and surpot your local businesses. I did and I don't live here. The rice bowl it the joint."], ["Matt M.", "Late one night I walked in as they were cleaning up and smiled and asked to look at a menu for a hopeful return visit, instead the owner invited us to eat right then and there. After a slight protest from my son and I, she took down chairs at a four top and treated my son and I to a wonderful Asian meal. We started with pan fried pork dumplings served over a bed of lettuce that were light and flavorful. Next, she brought out steak Pad Thai and my son was in heaven, even insisting I give it a try which he never does. Then I received my plate of Basil Thai Chicken and had a mild panic attack, I forget to say very little spice. Do I tasted the dish with trepidation and while it did have a mild and flavorful spice, it never reached the point of lava and really added to the taste of the fish. The owner then came by to check on us and gave us her menu favorites and her background in cooking, which was impressive. As we left, both my son and I pledged to come back to try a few more dishes soon (like tomorrow).  Service was unobtrusive and skilled (wait, how did my water get filled).  Overall a great experience."], ["Aaron S.", "I can officially say that there isn't a dish in Jacksonville that I enjoy more than the Curry Casserole, it's simply amazing!  Service is always awesome and the food is quite incredible.  You owe it to yourself to try out Rice Bowl!"], ["Laure N.", "We went on a Sunday afternoon during a Jags game and they were still busy. And for good reason, it's great. We had a party of 5, service took a little long but I don't think anyone expected it to be busy when we were there."], ["Cynthia S.", "Amazing food. We came for lunch. Started with the chicken dumplings, they were wonderfully flavorful with a perfectly light wrap. I started with the hot and sour soup, it had enough heat to be delicious but not so much that it was uncomfortable with lots of Chinese veggies and chicken.  She had the chicken satay with a peanut sauce, great flavor and the peanut sauce was delicious. I had the chicken with red curry sauce and brown rice. It was amazing. Lots of vegetables and the chicken was sliced very thin and cooked perfectly.I would highly recommend this restaurant. Service was terrific."], ["Suzi R.", "Stopped in late night with husband and the in-laws. My in-laws lived in China for a few years and have pretty high expectations and a lot of knowledge about authentic Chinese. The food was good, not great. We had mapo tofu - they do not make their tofu in house (it's Jacksonville - but my mother in law did ask) and overall it was a tasty dish, but sauce a little gloppy and different flavors than this usually has. Also had Singapore mei fun - this dish is usually a lot more curry forward, which I like. It was good though, nice noodles, large shrimp and not too oily. I prefer the rendition at China Wok take out if that says anything. Basil chicken was probably my favorite, good basil flavor and you could detect some wok sear. We ordered these dishes spicy and they weren't. Their chili oil was not spicy either. I would return, but it's definitely not the authentic experience you might get at Peony Asian Bistro."], ["Cara M.", "I moved from Hawaii when I was a child and over the years I had come to accept that unless you were there Asian food was always going to be the Americanized, heavy, greasy stuff you expect from places such as Panda Express. Even hole-in-the-wall places that promised to be the authentic stuff of my childhood were mediocre at best. All hope was lost.. until I stumbled upon Rice Bowl. This place is delicious, plain and simple. I moved to Hodges a couple weeks ago, and living out of boxes I had been eating fast food for days on end. My mom decided to stop and get some Chinese food, at least it would be a change from burgers and fries. It was then that our lives changed forever. That was last week, since then I have been back two more times. I have had the fried rice bowl with shrimp - twice. The flavor of the fried rice is out of this world. The shrimp is huge and you can tell that it is incredibly fresh. Same goes for the Bang Bang Shrimp, which I just had for the first time today and will be sure to get again if not every time I go. The Korean Noodles with Beef is also awesome: perfectly cooked yam noodles, filled with crispy veggies and they don't skimp on the tender, flavorful beef. Yes, they are a bit pricier but deservedly so. The portions are huge, I always have leftovers. You certainly aren't going to be sacrificing quantity for quality. The staff is very friendly and I always feel welcomed. Try this place, you won't be disappointed!"], ["Dice H.", "Not really impressed. I've been twice and just couldn't get over how none of it tasted authentic. I miss Mr Chan's."], ["Kristin H.", "Wow!  I recently moved off of Beach Blvd, and after seeing so many positive yelp reviews, decided to try Rice Bowl.  A couple of friends and I had dinner there on Saturday night and we were seated right away!  The place was busy so that was a good sign!  All of us enjoyed our meals- it tastes very fresh and was quite delicious!  The menu is diverse and there is something for everyone!   I'm a vegetarian and the sautéed vegetables with fried rice were amazing.  Highly recommend this place, I will be back!"], ["T R.", "The food was outstanding! We had Bang Bang Shrimp which was the best I've had in Florida. Then we had shrimp and walnuts, OMG with fried rice. Will be back! Thanks for one of best meals we have had in a long time."], ["Matt W.", "This is my 1st review on Yelp. I check Yelp ALL the time as I travel every week and I use it to find a good place to eat. I say all of that to say this; I love this place. I have ordered a number of different things from here and everything has been incredible. EVERYTHING. It's always fresh. If you want a tasty, healthy meal get the chicken hibachi. Lots of chicken and tons of fresh vegetables also. Try this place out, I promise you will love it."], ["Virginia M.", "I enjoyed my dinner here the other night. This is a nice Chinese restaurant on beach boulevard. I had the honey shrimp, wonton soup, and chicken chow fun noodles. The menu is a mix of Chinese, Thai, and sushi so it can be a bit overwhelming, but there is something for everyone. I would return! The staff is also very friendly."], ["Stephanie A.", "I was happy to see a new owner at the old Mr. Chan's. I felt welcomed when I came in for a to go order. They do not have delivery yet but working on it. It's nice to see an Asian restaurant with a nice dining room. When it comes to chinese they are getting harder to find. But they are Thai, Chinese and Korean. A very diverse menu. I've had a lot of mediocre Chinese lately. We had the honey shrimp that my family loved! Very crunchy and not too sweet. The shrimp rolls were very good too. My hubby loved the seafood soup. Lots of steak on the steak dinner and not tough and fatty. I will say we enjoyed everything we ordered! The only reason for one star removed is no delivery yet. But they said they could make anything I want even if it's not on the menu. Very kind staff and extremely helpful. I will definitely be back!"], ["Tia D.", "Based upon the positive reviews I decided to give RB a whirl, it's a very easy drive from the Navy Base (Mayport) I arrived in no time flat eager to try out one of the superb dishes I read about here, It was hard to make a choice, so much yummy~ness to choose from, they have specials upon a board on the wall behind the cashier; check it out! Ultimately, I decided to go with the chicken drunken noodles, flat wide noodles with oodles of chicken and veggies, just a hint of spice but not enough to set your soul on fire via your mouth, I especially liked that as I am not a spicy food eater, the service was great & quick, I'm looking forward to trying out more of their offerings, get in there!"], ["Debbi C.", "After reading reviews on yelp we decided to get this place a try. The food was ok, but not as spicy as we had hoped.  My has been, my daughter and I all ordered spicy dishes.   None of them were spicy in our opinions.  We actually found the food to be bland.  We had a new waiter and he wasn't very familiar with the menu. When we had questions, he did go and ask the owner who was very nice and answered all of the questions so that he could come back and tell us.  We had large servings so we didn't finish all the food but if it is been a little more tasty we might have. Sadly, when we left we  received a phone call  the next  eveningFrom our bank saying that card activity was going on in Canada with our debit card. The only place we have used that card in a couple of days was at rice bowl.  We call the owner to let her know and she seemed very appreciative after she realized we were not accusing her. It was nothing special and a little high-priced to be take-out Chinese so we probably won't be back."], ["Erwin A.", "After seeing the reviews, we decided to try this restaurant out.  I had the Pad Thai.  Sadly, the dish was terrible.  It tasted more like Bad Thai.  I'm not sure what food these high raters are eating but this place is definitely not good.  We will definitely not come back."], ["Cat S.", "FINALLY, a good Chinese food place in Jacksonville!!! I tried so many places and was routinely disappointed until this place opened. Always fast, always tasty."], ["Shaun M.", "Food is OK.  Grease is the theme here.  I've eaten a TON of Korean.  Never have I had a greasy Korean dish.  The Korean noodles with beef were swimming in it.  Other than that they were good...shame.  Chicken satay says grilled on the menu.  I'm fairly certain these ended up in the fryer.  They were dripping grease."], ["Lierin G.", "This place is amazing! They clearly use high quality, fresh ingredients and the food is prepared with care. We had the bang bang shrimp, Korean beef noodles and the ginger chicken- all three dishes were delicious! I highly recommend getting take out because they prepare the food to ensue it is fresh and not soggy!"], ["Alan L.", "This place has changed hands a number of times over the years and we hoped it would be good again but were sorely disappointed. Way overpriced for take-out Chinese that is no better than any cheap takeout place you can find around town, but is certainly a lot more expensive. We had the sweet n sour chicken and a beef pad thai and neither were bad, but neither was very good - middle of the road Asian takeout at best and very far from even close to being the best takeout we've had - but about $5 per person more expensive. We saw no reason to return. At least it was hot and fresh. If the prices were a good bit cheaper I'd have given it maybe 3 stars to at least be average, but the high cost vs value drops it a star."], ["Janel B.", "Wanted to try a new.. Chinese place was cheng and Was bought over by new owner they  said they believe in fresh high quality ingredients. Owner was pleasant came and shared her vision. It's a Thai chinese Filipino mix..they use really quality ingredients and it shows.  Would definitely try again.   If u just want some chicken wings and fried rice this place is not for.  Would Def recomnend. The manager Eileen is so  sweet. She really wants to create a true fusion menu and not put out regular garbage chinese. Go there and try something different ur taste buds will thank u."], ["Rob S.", "After talking bout some asain cuisine me and the wife decided to grab some lunch at the bowl.. From reading the reviews I was thinking this was more of a take out place but it's actually a nice little restaurant.. I ordered the sweet and sour chicken and wife got the Mongolian beef.  My chicken was very good nothing super special just a good meal and they have a lunch special that like 8 bucks and comes with salad (lettuce with dressing) and fried rice.  The wife's Mongolian beef was amazing.  Probably the best Mongo beef I have ever had but they didn't offer a lunch special so was  15 bucks and came with fried rice..  The fried rice was good but not the best I have ever had but very good.  Service was very pleasant and food came out super fast..  Definitely found a good little spot to go grab some asain cuisine for a good price."], ["Shashank G.", "Why does this place have 5 stars?I don't get it...Even for a fusion , the strength of the different spices were not leveraged. And the entire menu feels bland, creamy. Really Rich.Tried it twice, thought I'd ordered their not so famous the first time. But anyway - very heavy food. Definitely for people who want to get a dose of fresh veggies served in cream/oil, and beautiful colors!For taste, not so much.Two stars!"], ["West K.", "Fast service"], ["Justin M.", "This is my new fav place to eat Asian food. Ordered #11 shrimp and hot garlic sauce....was amazing (pic attached). Shrimp were delicious and jumbo, all vegetables were fresh and rice and salad great. $8 lunch specials with rice and salad. White table cloth dinners. Love this place glad I stopped in. Lunch came out in 5 min."], ["Duong Anh P.", "4.5 is not a true rating.  Their foods in Asian perspective is just average.  The place is not very bright for having kids.  Their dish size are not a lot for the money compared to other place.  This may be the first time and also the last time I eat here."], ["Jeremy K.", "We really enjoyed this place.  I got the Seafood combination rice bow.  It was full of great seafood including lobster, shrimp, and scallops.  The flavor was tremendous, the spice level was right, and the seafood tasted fresh.  The staff was also really engaged and wanted to make sure our experience went well.  This was definitely a place we will be back to."], ["Finn E.", "First time here. Very clean, no food smell. Excellent food and service! Will be back!"], ["Heather K.", "This is  a true hidden gem on beach blvd.  My family when there for Easter lunch and it was amazing. I had the curry casserole and it was delicious. Don't let the name casserole turn you off. This dish is not your grandma's casserole. It comes out in a big stemming pot and inside is a delicious blend of coconut and curry, with tons of shrimp, chicken, and fresh veggies. It's the kind of dish that makes you want to curl up in front of the fireplace and whisper sweet nothings to it. ha ha"], ["Vason W.", "Best Chinese food in jacksonville hands down, I am a regular here , I recommend the general tso chicken @uberxwill"], ["Robert C.", "Excellent as usual.  Red curry chicken . Garlic chicken,sesame chicken and pork dumplings.  Yummy"], ["Rose H.", "Delicious bang bang shrimp! The korean noodles with beef was delicious as well.  We also got the red curry chicken. It was sweet and tasted more like yellow curry to me, but all fresh ingredients and very tasty!We will be going back again very soon!"], ["Iris B.", "After giving this place another chance, (and getting over the fact that no they don't deliver), this really is the best Chinese food on this side of town. Well worth the drive. I ordered the sesame chicken and was again surprised at the large portion. The chicken was well prepared and the sauce wasn't too sweet like at your typical Chinese food delivery place. I also really enjoyed the addition of fresh broccoli. The egg drop soup is amazing here, no weird carrots or peas thrown into it. Whenever I have that Chinese food craving again I will definitely be back here for pick up."], ["Harper G.", "Stopped by here for lunch because I was in the mood for Chinese and I had heard good things about it. I was not disappointed. I ordered the lunch special Spicy Sha Cha beef with an egg roll. The egg roll was hot and crispy, and not greasy. The beef was tasty and tender, the veggies were cooked well, and the sauce was flavorful and spicy, but not burn-my-mouth spicy. The service was quick, friendly and attentive. I'll definitely go here again."], ["Richard M.", "New favorite place. Found Rice Bowl a little over a month ago and can't get enough. Everything we've tried has been fantastic! Very diverse menu, should be easy for anyone to find something they'll like. Highly recommend the steamed sea bass. The staff is super friendly and do a great job recommending something really good to eat."], ["Malachy S.", "Great Thai menu items.  Chicken pad Thai, bang bang shrimp and yellow chicken curry were all awesome!"], ["Ketan D.", "This place is great. I have tried the Sizzling Mongolian Beef, and the Korean Noodles. Both were amazing! Well worth the drive from the beach for takeout."], ["Dan H.", "I just had the most amazing dish: the Korean noodles with beef. The beef was tender and juicy, with fresh, crisp vegetables, and soft yummy yam noodles. Get your own. This place is a must order, and will get my business repeatedly."]], "Silver Star Chinese Restaurant": [["Steven J.", "I'm disappointed in paying  $3.50 per glass of tea.  Its not bottled,  nor flavored.   The food, service and atmosphere are great; just overpriced.There are many delivery restaurants that serve better food for less."], ["Elizabeth L.", "Great food and now I'm super happy they make sushi. Really nice staff. They are always pleasant. One of our favorite places to eat. My favorite is the sesame chicken. Great prices and good amount of food."], ["Trevor D.", "We had Westside Dumplings, Shrimp and Leek Dumplings, and the Pork Shu Mai Dumplings. Pretty tasty! I'll definitely come back again."], ["Tien T.", "I've been twice now in the past week and both times-I was incredibly happy with my service and my food. I ordered dim sum-Chinese style tapas-and they were so fresh and delicious! You HAVE to try the crispy shrimp dumpling! XvThey're one of the only restaurants that serves dim sum (which is normally only served for brunch) and they serve it all day!!! Service was stellar both days, I can't wait to go back!"], ["Samantha P.", "Silver Star Chinese is my go to for authentic Chinese food. Like I stated before, I've been coming here for 10 years. They are consistent with the quality of food here. They have really great customer service and really yummy food! Although I have never had Dim Sum this seems to be the place to try it! Cheers and salutations!"], ["Justin D.", "Excellent place for Dim Sum in Jax since there are not many choices for this type of eatery.  It's a convenient drive from Riverside and has a fairly good setup considering how old the place looks to be.  The food was above average and the price won't break the bank.  I will be visiting again for sure."], ["Samantha M.", "We decided to try Dim Sum here in Jax and found this place via Yelp. Despite the mixed reviews, I was hoping my experience would be on the more positive end of things. Unfortunately, I am not able to say this was an experience I want to repeat. The ambiance is really lacking, the place was deserted and it is in a shopping plaza that's a little dreary. There were about seven guys just hanging out in the parking lot. It seemed odd. We had a friendly and helpful waitress and were immediately seated in a booth. We ordered several selections from the dim sum menu. The best thing I can say about the dinner was that the Sesame balls were pretty good. The Diet Pepsi was also good-not flat and not over-syrupy. That's kind of where it ended, for me. We tried the shrimp dumplings, which were very gooey, and some sort of beef wrapped in dough. It was so sticky and doughy I could not finish it. We also tried shrimp balls and shrimp rolls, which were very chewy and not exceptionally tasty. We ordered some sort of dumpling with greens in it but when we bit into them, they were half frozen, so we sent them back. As we were leaving, I happened to look down and see a little brown roach crawling across the dining room floor. I know we live in Florida and bugs abound everywhere, but a restaurant is really the last place I want to see one. I had to drop a star for the roach. I just don't do bugs. Compared to other dim sum I have had, this was pretty poor quality. The service was very nice, but everything else was lacking. We will look elsewhere when trying dim sum in the future."], ["Carlos C.", "This review is only for the dim sum experience. This place was the first in my effort to try all three of the places that serve dim sum in the Jacksonville area. I tried all of the dim sum offerings that I could eat (allergic to shrimp) to get an Idea of what is good here and I must say that I was quite underwhelmed. The only thing that was decent to me were the pork buns, even though they were room temperature. I asked if everything was hot and fresh and the guy said yes. LIES! The \"beef\" rice roll, (I put beef in quotation marks because it seriously looked like processed pork of some sort), had an unearthly slimy texture that I just couldn't stomach and not to mention, the \"beef\" that was in it had the same slimy texture as well. The sesame balls were delicious but I could only eat one because of the sweet lotus paste in the center.  This place didn't have a large selection like some of the other dim sum places I've been to in other cities but for Jax I suppose it's better than not having anything at all. I would most definitely return here and try their regular menu items and just order a tray of pork buns next time though. As for dim sum , I think I will just move along and try the other couple of places here in Jax and hope they are better. I may just have to stick to the excellent dim sum spots I've been to in Orlando since I go there so often. I gave silver star three stars instead of the two I would normally give an experience like this because honestly, their regular items looked pretty damn good and the servers were very polite and did an excellent job."], ["Richard P.", "We have tried Silver Star twice.  First time was years ago and we simply did not like it.  Plus it was quite far from where we live, so it just fell off from our radar list.  But recently, talking to a friend, we were convinced to give Silver Star another try.  Though it's not the best dim sum we've ever had (I mean, not even close), but we had a decent time at Silver Star.We ordered several dim sum dishes and compared each item against our in-town 'go to' dim sum place (Dim Sum Room).  And decided that both places have some good, some decent, and some really bad dim sum dishes.  But because Silver Star is so much further from us, that it is less likely for us to visit.But overall, until Jacksonville start to have its own Chinatown or at least several more authentic Chinese restaurants that serve dim sum, Silver Star would still be a good choice to go when you have a dim sum craving.  A few reviewers already mentioned this, but one of the worst dishes is their turnip cake.  Not sure what they did, but that dish definitely needs massive improvement.  But other more 'stellar' dishes are short ribs, tripes, and shrimp balls."], ["Jimmy P.", "My son and I ate dinner here with my parents.  It's been a long time since we last ate here (15 years or so ago maybe).  Nothing has changed.We started off with the chicken wings appetizers.  I love me some chicken wings!  For entrees, we shared the House Lo Mein, Szechuan chicken, and Fried rice.  We also ordered my Mom's favorite, Chinese broccoli.  I'm surprised how Chinese brocolli is leafy compared to the brocolli we're accustomed to.  The food was excellent.  Friendly staff too and the wait wasn't that bad.I have to try the Dim Sum.  Many of my fellow yelpers were talking about it.  Definitely next time!"], ["Kathy C.", "I have been on a dim sum kick lately.  For three weeks in a roll, been going to the two dim sum places I know of in Jacksonville.  Well, yesterday, we tried Silver Star.  I believe the last time we were here was like... 5 years ago?  I remember I did not have a good experience and therefore, never bothered to drive back to try again because it is far from where we live.Well, from reading reviews and a friend who told me that their dim sum was actually pretty good, we decided to give Silver Star another try.  I am glad we did because we were pleasantly surprised.  First of all, this is still Jacksonville, which still has a long way to go as far as authentic Chinese restaurants of various regions.  There just aren't that many options.  Silver Star to me, is \"A-OK\" for Jacksonville if not borderline \"I'm a fan\".There were four of us and we opted for all dim sum dishes.  We tried their sui mai (ok), friend shrimp balls (tasty), bbq ribs (ok),  bbq buns (ok), ginger and scallion beef tripe (tasty), bbq pork rice roll (ok), pan friend leek and pork dumplings (tasty), taro dumplings (ok), and the disappointing gold dumplings (too little filling) and turnip cake (just thin sad tasteless slices).So, yeah, a mixed bag on the food but again, for Jacksonville, where dim sums are extremely limited, it serve its purpose when you have dim sum cravings.  The service was nice.  Not just our main server, but the runners that bring us dishes and those that push the carts or walk around with tray full of dim sum plates, were all very friendly and attentive.  I would visit Silver Star more often if I live closer."], ["Nhi P.", "As an Orlando resident, being surrounded by so many delicious dim sum restaurants has turned me into a bit of a dim sum snob. So when my friend took me here for brunch, I was pleasantly surprised by the quality. It was great! Though the menu was lacking in variety, the quality of the food was comparable to Orlando in all aspects. They didn't have pork shu-mai and a couple of other staples, but the dishes they had were prepared perfectly and tasted super delicious. I didn't see any indication of the \"greasy\" qualities some Yelpers mentioned either since everything looked and tasted fresh!The staff was amazing as well. The host (and owner, I think) was super friendly and hands-on. He would be seating people, bringing food out, talking to customers -- he was everywhere! It's so nice to see such great customer service. I just have to deduct a star for lack of variety and the decor, which is fairly typical \"Chinese restaurant\" decor."], ["Jay M.", "My wife loves dim sum so we're disappointed that there aren't very many places around here. We are from Atlanta and it's so easy to find good dim sum there. We prefer the Dim Sum Room off southside. Their dim sum taste better as well as the chow fun. Silverstars chow fun seems bland"], ["K C.", "I had several items from their dim sum menu and especially like the sesame balls(tee hee) and the shrimp dumpling. Wonton soup was flavorful, daughter ordered the house lo mein which she raved about and was enough to feed two people. Definitely go back for the dim sum."], ["Sam B.", "My Chinese friends took me here for Dim Sum and everything was so wonderful. I took home some of the sesame balls. They were that good! I had some chicken feet - something I had not tasted in years. Loved it. The place was clean and the service was great."], ["Bre G.", "Very good, menu was very basic but the food was very delicious. The sweet and sour is a great choice and the pork fried rice was amazing, I love sprouts in my fried rice. You do have to ask about the dumplings, me and my boyfriend couldn't find them on the menu, but we would definitely recommend them. I love this place"], ["Alisa J.", "On our most recent trip, we were informed they were out of steamed pork buns, radish cakes, and stuffed taro (our three dim sum favorites) and had been for some time. Not sure what's going on but I can't recommend Silver Star for dim sum right now. Big bummer, these guys have historically done pretty well."], ["Shelly O.", "Always went to Seattle to eat DimSum and when we moved to Kings Bay took me 3 years to find this place it's an hour drive but oh so worth it"], ["Elizabeth L.", "Worst dim sum I've ever had.  We ordered a little bit of everything just to try it out, and hopefully satisfy my long standing dim sum craving.  Unfortunately,  the quality of the food was so bad that we hardly managed to eat even half of it.  The service was ok for the most part except we heard the staff crack a joke about us.  That was rude.  The shrimp in every dish was dry, ball shaped, and not fresh at all. Also, several dishes that had cheap pork in them also had this horrible tasteless gravy mixed in.  I tried to eat my food with a smile on my face, for the sake of my guest.  However,  when we left it was my guest who said make sure you give this place a negative rating so people know what they're getting into."], ["Jen K.", "I want to rate this place five stars. I do. Everything my husband and I ordered was delicious. It was during my third visit--when my mother in law was with us--that I learned that they still use MSG in their dim sum. I was so disappointed because I really enjoyed everything about my experience."]], "New China Restaurant": [], "Hunan Wok Restaurant": [], "China Dragon": [], "Blue Bamboo": [["Chich S.", "At first I was skeptical about this Asian fusion restaurant, but I was pleasantly surprised! The food was great and the wait staff was friendly and attentive. It's a bit out of the way but I'd definitely come here again!"], ["Jeff P.", "All I can saw is awesome! If you live in jacksonville, or just visiting, come enjoy! You won't be disappointed! Started with the duck wontons, loved the presentation and the flavors were spot on! Then on to the red curry chicken which had the perfect balance of heat, sweet, and still a great depth of flavor. To top it off the chef/owner came out and spoke with us for a few. Just overall a great experience looking forward to our next visit."], ["Evin W.", "Fabulous, unique & creative food, beautifully prepared & presented.  Great ambiance, friendly staff. One of Jacksonville's best restaurants. You realize this because while you're there, you don't feel like you're IN Jacksonville! A big thumbs up!"], ["Della L.", "Had dinner at Blue Bamboo this evening.  Had California roll, Fried GREEN TOMATOES a special tonight. They were Fried lightly with a panko batter.  VERY GOOD.  THE BEST I have had in the area. And the General's Chicken. Wonderful.  The Chief / Owner walked around and stopped at all the tables that had guest, asking how their dining experience was. It was a Very Clean Restaurant.  MODERN looking. If you get a chance give it a try.  The FOOD IS GREAT. Dress is casual."], ["David W.", "Dennis is the man and my wife and I dine here as often as we can.  The food is fantastic and imaginative with the freshest ingredients plus the service has always been stellar!We bought Dennis' cookbook last year and we have been trying our hand at many of the recipes and have had a great time testing our culinary skills.  Can't wait to go back and try something different from Dennis' repertoire!"], ["Chad W.", "Overall the food was exquisite, the ambiance was beautiful, and the service was impeccable.  I highly recommend this restaurant for adults who wish to have an elegant, scrumptious experience!"], ["Alan L.", "Went to Blue Bamboo with coworkers for lunch on 2/15/2010.  I even checked with the server before ordering the grilled chicken with sesame sauce.  When the dish came out it was nothing more than 3 pieces of completely flavorless boiled chicken swimming in a pond of thick brown sauce with some rice.  For $12 it is certainly the worst lunch from recent memory."], ["Sharon M.", "Popped in the other night & picked up their Panko Sweet & Sour chicken to go. My hubby & I were to share it so I was hoping the portion would be generous. I peeked into the box while paying & asked for a an extra portion of rice - the cup sized portion in the tray was not going to be enough for the two of us. I was more than happy to pay for the extra rice but they said it wasn't necessary, I thought that was nice. The portion of chicken was ample for two people & I was surprised to see the neat row of breaded chicken slices sitting next to the generous portion of green onions. The sauce came in a separate cup & I was happy to see chunks of pineapple floating around inside.After serving up the food onto 2 plates we still could have done with more rice & a tad bit more sauce & we are not big eaters.The meal itself was absolutely delicious!  I'm a big fan of Hong Kong style Sweet & Sour but this dish was a pleasant & unexpected departure. The sauce was thin & perfectly sweetened. The green onions were a lovely compliment to the breaded chicken & light sauce, the rice perfectly cooked. Overall, I'm glad we gave Blue Bamboo a try. My only reservation stems from the pricing - the 1 person portion that we shared between us was $17 - to go back & buy 2 portions next time would be double that which is a bit steep for take-out chinese IMO but to be fair, they are not a take-out joint..but a restaurant (which was lovely inside btw).We will definitely go back & eat in but stick to our local chinese for take-outs."], ["Ryan O.", "Back in town for one final appearance. I'd been dying to try the place and finally found the time. I'm not really understanding the \"Dressy\" notation as it is NOT an upscale restaurant. Don't get me wrong, it's very clean and very nicely decorated, it's just impossible to be upscale when you are located on Southside in Jacksonville and share a building with an empty restaurant that has a For Lease banner flapping in the breeze. I tried the duck wontons as an appetizer and, to my dismay, they weren't really wontons. The contents of said wonton were haphazardly thrown on top of a fried wrapper, that was not wrapped. They were OK, but just too much sauce and no where near enough duck. The over sauced mess became tedious after a few bites. For the main course, I went with the honey glazed ribs. Strangely enough, these were under sauced and devoid of flavor , not to mention they were accompanied by, wait for it, french fries? I thought the chef could have come up with something a bit more creative there. I understand the \"fusion\" concept, but the last thing anyone needs is more friggin' french fries. To be honest I've had much better Chinese in seedy holes in the wall in Manhattan, the kinds of places that make you wonder if those boneless spare ribs really do come from ally cats. Meh is an apt description."]], "Marco Polo Chinese Restaurant & Mongolian BBQ": [], "Golden Egg Roll": [], "Pagoda Chinese Restaurant": []}