{"Mellow Mushroom": [["Dane M.", "Was in town for work training. After 2 straight nights of crappy cold Mexican food (Moes and Barberitos, I'm looking at you) I decided to try this place out! On my walk the night before, I heard them doing trivia, and the vibe looked pretty cool.I made it in before Happy Hour. Place is sick! Keith was my server, and was SUPER cool. Introduced himself and asked my name and shook my hand! How often does that happen! I love Southern Hospitality! Lacie also helped me, and was extremely kind! Food was GREAT! They let me sample quite a few beers! Will definitely be back tomorrow to try some pizza!!!Highly recommend this place! Great food, great vibe, great service!"], ["Ivette M.", "I was stuck in at the Jacksonville Hampton Inn due to a rainstorm and I couldn't leave to eat dinner. So the front desk receptionist, Petra, recommended the mellow mushroom because they delivered only to the hotel. The House calzone  I had a was amazing...very likely the best one I've ever had.  I also had the Capri the salad which was good too.  Overall, great service and great food. I will be back! Food was so good I went back to the restaurant the next night with a coworker. We were so hungry we forgot to take pictures!! Signature mushroom soup - order it and you won't be disappointed! The only \"opportunity\" is the serving size. You can only get it in a bowl and if you eat more than half you might not have room for pizza...Hummus - fantastic, great clean and simple flavor. White pizza - exactly what I wanted even though I could only eat one slice.The service was impeccable. Everyone was so friendly and helpful I felt like family.I travel to Jacksonville about 3x a year for work. I will be back and next time I have to get a Tshirt!"], ["Annette A.", "While moving to Jacksonville, I was staying at Hampton Inn at Tinsel town and thanks to Petra [front desk], I discovered 'Mellow Mushroom'. Sheesh...This place should come with a warning, as it's the BEST pizza I have had in my entire life...Hands down! Simply PERFECT from the wonderful crust to the abundance of cheese [yup, I had them all :-]It was so darn good that it became a problem, as I found myself ordering pizza every single night [can yo u say 'intervention' ..lol].I frankly can't wait to order my Kosmic again."], ["Kenneth G.", "Great time at Mellow mushroom. I love the vibe of the space, service was great and the food was tasty. We really enjoyed he Mushroom Soup. We could not stop eating it. We enjoyed the wings. Although the Jerk Spices/Sauce was not my favorite. Chicken was very tender but wish they had a bit more of a char on them personally. Loved the Gourmet White Pizza. We added Pepperoni to the order. Very flavorful. I'm looking forward to having it for breakfast. There was a shift change and a slight delay for a refill on my Beer otherwise I would have given a 5 star review. Thanks for a great time."], ["Shawn D.", "Awesome staff sat at the bar after watching the martian at tinseltiwn. Beer was priced excellent served promptly in clean glasses will return! :)"], ["Federico L.", "This was my first time at any Mellow Mushrooms. This is a lovely restaurant, very nicely decorated, clean, lively and inviting place. Customer service was good as well, our waiter was very friendly, genuine and attentiive.The highlight of my visit to MM is what I believe was the best looking pizza ever. So well done, so colourful, things in place, overall a piece of art.Another highlight, they have a great selection of beers, they even have two of my favorite IPAs, Dog Fish Head 90m and Lagunitas.I visited this place on a rainy and cold night. The place was packed, so I wonder how busy it gets on Fridays and Saturdays.Pizza was good, so I would recommend to anybody."], ["Jim L.", "Disappointed with my meal.  I ordered the salad and it was small and quite salty. I tried the roasted potatoes. They were fried and salty too   Service was very slow. Not good for an hour lunch. I did not have a good experience.  management did not respond to my inquiry when I provide one as requested"], ["Ashley B.", "I love mellow mushroom.  The location is great.  It's to the left of Tinseltown movies.  Parking can be a bit of a challenge; but there is ample parking across the street and behind the restaurant.The staff has always been friendly.  The bartenders always seem very happy and upbeat.  Sometimes when you first sit down it takes a bit to get there attention, but once you do service is great from there on out.Food is always great!  They have happy hour 4-7 and a selection of the apps are only $5, plus $1 off drafts."], ["Tasha W.", "Epic Customer Service!!! There was a system issue and we notified Sean the mgr that we had not received our food yet. He worked with us until we received our food, refilled our drinks and was just sincere all the way around. Thanks for the great experience!!"], ["Hong N.", "Starting with appetizer , we got the bruchettas.  By far the best bruchettas we had. The tomatoes toppers were super fresh and the touch of balsamic vinegar was just enough. They gave us both white and wheat toast. Only thing is on the menu, the picture has the tomatoes on the toast already. The actual dish was was assembled in w hich we scooped our own tomatoes on top.We also had the special of the month. Pineapple express and the South of the border pizza. Pineapple express is basically Hawaiian pizza topped with the same tomatoes salads from the bruchetta. It was still pretty yummy. Of couse it came with the right about of balsamic vinegar drizzle.South of the border was ehh 3.5/5 . Not too sure what was happening . Got some chicken cheese jal3npino and cilantro. It wasn't bad, but it's very similar to other chicken pizza ?? Overall, I recommend going !"], ["Barbara S.", "Food is good, staff is nice, bathrooms are not bad. The only problem is they are so busy sometimes that it's very difficult to get your server/bartenders attention."], ["Jackie E.", "This place is amazing!! Friendly people and great food. This is my fiancé and I first time ever coming here and we will definitely be back! Our waiter Brian aka Sushi was great! He suggested some relishes beers and added chicken to my red skin potato pie and it made it so yummy! Then when we ordered some beers he suggested the beer sampler and it worked out perfectly! Thank you Brian aka Sushi! We will definitely be back!!"], ["Natasha D.", "I love this particular location. Ive been to 7 different mellow mushrooms and this one is high on the list. Service is okay because it's always busy here. But the staff is friendly. Food here is consistent. I always get the jerk chicken salad and it's large and amazing. Lots of TV's for sports viewing pleasure. Good crowd. Great location. I make this my first stop when I get to town for work. Good happy hour specials. The pizza is SO good. They're doing a great job!"], ["Joel T.", "I always like to sit at the bar when I come here Jerry(bartender) has been there over 13 years and his hospitality shows it! They are very friendly to say the least, and the food speaks for itself! Great beer selection and decently priced. Would recommend this for a family outing on the patio or a fun night of drinks at the bar."], ["Matthew G.", "Pizza is good but it's a little over priced in my opinion. The ambiance is a little on the loud side but what do you expect for a pizza place. They have a wide variety of drinks to choose from and the staff is helpful."], ["Lisa S.", "Delicious pizza and an amazing beer selection. Try the red skin potato pizza. I know it sounds strange, but thin slices of potato with cheese, lots of fresh bacon and a sour cream drizzle makes this taste like a loaded baked potato on pizza. Very yummy. Another favorite is the white pizza supreme. Better than a regular white pizza this one features fresh and sun dried tomatoes and grilled onions. If you like a more traditional pizza, all the regular toppings are excellent as well. This is one of my favorite pizza crusts around. So why not five stars? Simply because it is pricier than most pizza places I frequent. Definitely worth the price for the quality, so this is a 4+ review."], ["Walter C.", "Always impressed with Mellow's quality, and service. The manager on duty checked on our party of five at least 3 times during the course of our visit. The waitress was helpful and informative, and suggested appetizers, salads, and desserts. Another great thing about Mellow is their hours of operation. It's a great place to share a pizza with friends or loved ones, and continues to be one of my favorite places to eat."], ["Jean K.", "In town for business. Saw the yelp rating and stopped in. a lot of young adults (college kids?) Hanging out having a beer. Kinda reminds me of a bar in a college town. Music can be a little too loud. Outdoor seating can drown out the loud music a bit. Meatball trio was good!!! Worth ordering. And the pizza... Pretty thin (not totally thin) and the crust is crunchy and chewy! Yum! Flavor is fresh, not greased down. Our 14 inch is $20. There are slices available during certain time of the day (I assume during late night happy hour). Worth stopping by. Not child friendly but I am here at 1am so it can be totally different during the day. ;)"], ["Amanda G.", "The pretzels r the best!!! Get one of every kind. make sure you get one of each kind. there pizza is pretty good also but a bit pricey"], ["Amy S.", "I stepped into this Mellow Mushroom last night to order a pizza for take-out around 11:00pm and was surprised to see it still bustling with people and in full swing at that particular hour.  This was a good sign!I approached the counter and was warmly greeted by a smiling Amanda.  I asked about the \"Every Daily\" pizza (a pizza I use to order at a Mellow Mushroom in Mississippi) and she had not heard of it.  It was not one they had on their menu.  She told me they'd be more than happy to whip it up for me though if I knew what went on it.  Yay!  Of course I knew what went on it!  Pepperoni, Applewood Smoked Bacon, Chicken, and Pineapple w/ regular sauce, mozz cheese, and regular crust.  She said, \"Wow, that sounds good!\"  My respond?  \"Yes, yes it is!\"  I ordered the small (a 10\") which came out to just over $16.  She told me to have a seat and she'd bring it out to me in about 10-15 minutes.I took a seat at one of the tables and had a look around the place.  Everything was so clean and slick.  I counted at least 13 flat screens strategically placed throughout the restaurant...  no matter where you sat, there seemed to be a good view of one of the many televisions.  I noticed they had quite a selection of beers on tap at the long bar area (unfortunately, I was too far away to notice the names).  All of the employees (as busy as they were) were smiling and seemed genuinely happy to be working.At almost exactly 10 minutes, Amanda brought my pizza to me and opened the box for me to peek inside.  Ahhhhh......  perfection!  And let me tell you, it was just as tasty as it looked and just as tasty as the Every Daily I remembered from the Mississippi Mellow Mushroom.  Hubby and I devoured it as if we hadn't eaten in weeks!  LOL  A 10\" pizza may not seem like much, but they are so thick and have so many toppings, that it's the perfect amount to fill us both.I'll definitely be back to this location!"]], "The Capital Grille": [["Valerie W.", "Last night was my second time dining at capital grille and my first at this location. We were created by four hostesses, a bit much but I figured for a Friday night that could be normal. We had reservations for 6:30 as I hadn't eaten lunch and wanted an early dinner. Then, we were seated in a side room, we were the only people in the room for quite a bit but by the time we were leaving it was full. The waitress, Amanda, was very kind and did a great job. The manager also came around and introduced himself. I had the sushi grade sesame tuna which was great, but my boyfriends filet with truffle butter was perfection! Maybe we ordered too much as we shared lobster bisque(delicious) as an appetizer but also ordered the side of fries with truffle butter and corn with bacon. WAY too much food and most of it was boxed up and taken home but that just means more for later! All was tried though.The steak was my favorite out of everything but the corn and lobster bisque come in at at second place at a tie. Highly recommend this upscale restaurant in the town center as it is much nicer than most of the other options around it."], ["Michael J.", "A little overpriced for quality of steak you get. But overall great steak they go a little too heavy on the butter they put on the steak. Sides are great truffle fries and Mac and cheese a re great."], ["Lisa S.", "Went there for dinner. I had the lobster mac-n-cheese and lamb chops. Both were delicious. The service was also good. I recommend for date night!"], ["Danielle F.", "I was taken here by my boss for lunch. It isn't a place I would otherwise consider dining at, based on various reasons- one of which being the pretentious vibe and grossly overpriced chain food (under same ownership as Red Lobster FYI). That being said, I was hesitant but open minded. Our server was okay but again, pretentious vibe and I can't stand that. Anyway, we started with calamari and it was great and had a tasty crispy batter but dont expect marinara sauce, as this restaurant is too fancy to offer such a thing. My boss ordered a steak MR and it came out MW. It was painfully awkward to watch him wait for our server to come by and check on our entrees so he could inform her, yet she never checked on us. My boss explained the issue when she finally showed, after we all finished our meals. For a so-called 5 star restaurant, I was a bit surprised at that mistake. Fortunately my entree, scallops with mushroom risotto, was delicious and the sauce was light and flavorful. I would have liked more scallops (only came with 3) especially for the price. The creme brûlée and cheesecake was also very good, but maybe it was because the dessert was on the house.Overall, I had an okay experience but the service was weird and the atmosphere just wasn't for me."], ["K W.", "My husband and I celebrated our 17th wedding anniversary here.  When we found out we would be celebrating in Jacksonville, a dear friend recommended The Capital Grille and we could not have been more pleased with our experience.  The wait staff was phenomenal, the food was fantastic and we felt very well taken care of.  I recommend the lobster mac and cheese and any beef dish is going to be fabulous.  We are foodies, we are particular and this is probably the best meal we have had all year.  It was fancy without being stuffy and although the prices are up there, we found that the quality is well worth what you spend.  We really enjoyed this experience and cannot wait to visit again the next time we are in Jacksonville.  Wonderful...wonderful...wonderful!!"], ["Aja F.", "Always the best service and food in town. The bar is amazing- I love those stoli doli's"], ["Rich T.", "As it was close to Halloween, the spirits of fabled restaurants in my previous travels must have been waiting for us here as it only took one look to admire the grand presentation that awaited us. Dressed in a venerable dark wood paneling with high ceilings and filtered lighting effects that created life in huge oil paintings, I knew the names of half a dozen places in New York, Chicago, and Philadelphia where the Capital Grille could be a sister restaurant or a valued competitor.We were seated in the greater area, not far from the kitchen, and we were treated to a superb service from Scott, who happily went over the menu with us. Our choices were  naturally moving with menu of steak and we capitalized upon the experience by sharing plates to collectively gather the same experience. The menu was was easy to read and it demonstrated a huge wine list, which we indulged with a very good bottle of Pinot Noir that tasted like a superb selection with roots in Oregon. Dinner flowed in steps as we were cautious to enjoy the moments and the lightly marinated steaks and stunning desserts from start to finish with little details, such as the atmosphere and the side dishes, being well taken care of. We felt very comfortable with the experience and we attributed our splendid time to not only the place, but to Scott and Chef Kasey who made the most of it for us, as I am certain they will for others on a nightly basis.Departing into the mist of the later evening from The Capital Grill, I knew another spirit  had been welcomed by the others to haunt me in a smoldering tribute to my favorite style of fine dining."], ["Chris P.", "Always my favorite.  Always  Everything is excellent at every one I've been to.  Jax's rocks too"], ["Sheri T.", "Excellent place to celebrate your anniversary if you want the best service in town ask for AmandaThe food was wonderful the service was better and I can't wait to go back"], ["Gizelle A.", "But of course...they can't be rated anything below 5 stars! We actually went to try their Kobe burgers at the bar. We were on our way to a party, so a full sit down dinner wasn't in the plan and the special they have at the bar was just perfect! Until November 23rd you can get an out of this world Kibe burger (pick from 3 kinds) paired with a very generous top notch wine. Absolutely delicious! The burger comes with a side of truffle fries.  Loved it! Next time we will go for steak and actually get a table"], ["Reese S.", "Wonderful! Went here for our wedding anniversary. I had the sea bass and it was delicious!! Nice size and well seasoned.  My wife had the porterhouse steak and she loved it. It was tender and cooked perfect for her (medium). Once we arrived at our table it was decorated with a rose and small hearts. It was very cute and thoughtful. We loved this place. Our waitress was Lindsey and she was a doll!! We also received complimentary champagne and dessert. Yummy!!"], ["Stephen W.", "Absolutely the best anniversary dinner spot I have been to. They held the gift I bought my wife in waiting and presented it to her at the table. Also complementary glass of champagne and appetizer hit the mark. Speaking of Mark, he was our server and pulled out all the stops. His wine selection was en pointe and his food selection, delmanaco steak with balsamic vinaigrette was amazing!  Friends, Romans, Countrymen lend me your ears, stomach and wallet, this place is worth the price of admission. And just let them know a head of time it is a special occasion so they can make it extra special for ya!"], ["Robert S.", "Just wanted to comment on this restaurant.  Capital grille is a tremendous dinning experience.  I have been there twice and will continue as they have exceeded my expectations.  I recently took my wife for her birthday and it was a awesome expierence with awesome food.  I had the delmonico steak  and my wife the fillet minion with African lobster tail. You must try this!  You will not be disappointed.  Delightful.  They treated my wife with a birthday treat and it capped the night.  I highly recommend for any occasion.  Bob s"], ["Rick F.", "Excellent service and I want to thank Olivia who was one of our servers. I had the aged Porterhouse... and I have had better steaks. Asparagus Soup was interesting and bread was real good. Don't forget your wallet. Overall recommended"], ["Amanda K.", "Great for lunch meetings, happy hour and even dinner! The martini's are great and Brandi is wonderful to deal with for setting up events!"], ["Painted A.", "Food was good not great. Kitchen and bar very slow. Waitress did what she could. Valentines dinner so place was packed. Was a bit disappointed. Salmon was good, twice baked potatoes were only warm."], ["Greg F.", "A fine, upscale, expensive experience. All the food was good. My favorite was the au gratin potatoes ($6), probably followed by the Kona-crusted dry-aged sirloin ($45), and the coconut cream pie ($9). The asparagus ($6) was pretty good too. An Old Fashioned cocktail ($14) was also good. You can get half orders of most of the sides, and I took advantage of that. The setting is upscale, about as luxurious as any restaurant in Jacksonville. I was eating at the bar. My server tried hard to be friendly, though he didn't succeed in making me comfortable as well as the best servers I've had. It's about as expensive as any place in town. I spent $102. Other than the value, I like everything about Capital Grille, and I look forward to going back.Note to self for my next visit: Yelpers recommend the truffle fries and lobster mac and cheese."], ["Greg R.", "Just celebrated a late birthday lunch at Capital Grille.  It was my first visit there and I was impressed! It started with a table that was decorated with confetti just for me and a card signed by what seemed to be every one of the staff! Nice touch! Then a couple of glasses of sparkling wine! Everyone was very courteous and friendly. No stuffieness at all. The host changed our napkins from white to black to avoid lint on my navy blue shirt! Very nice...My wife ordered scallops and risotto after having a really good lobster bisque (with big chunks of lobster in it!). I ordered the bone-in sirloin with parmesan truffle fries. All the food was great! What set this lunch apart was the service. I asked for bernaise sauce,  but they didn't have any,  so they made me some! Then they took our picture and put it in a nice folder as a keepsake and as if that were not enough,  they brought us a nice plate of dessert! Flourless chocolate espresso cake with whipped cream and raspberries and a bruleed cheese cake with strawberries! And by the way,  the bubbly,  the picture, the bernaise sauce and the dessert were complimentary! We'll be for a special dinner soon!"], ["Dave P.", "The lobster bisque was filled with as much lobster as cream.  Amazing.  All three members of our party went for the bone-in steaks that were cooked to perfection.  No to-go boxes required."], ["Jacob B.", "Great food, great ambiance.  Very good place to go to for special occasions.  I had the Delmonico steak with balsamic glaze, my wife the Sirloin with Bleu cheese and caberbet reduction, and we shared the mozzarella app and twice baked potato.  We each had a Manhattan to drink.  All in all, everything was perfect.  No other way to put it.  I'd highly recommend this place to anyone."]], "JJ's Bistro de Paris": [], "Tapas Old World": [], "Matthews Restaurant": [["Maisha R.", "Around my father's birthday my parents came in town to visit. Having arranged an incredible culinary tour through Manhattan around his birthday last year, the pressure was on to take them to the best restaurants Jacksonville has to offer. I'd been told that Matthew's just had to make that list. I arranged for an early Friday evening dinner and when we arrived, we were the third party in the small dining area. We were greeted warmly upon entering by the hostess but we weren't impressed by our server who, although helpful, showed little personality or excitement about the food or our dining there. The meal started off great with the homemade focaccia bread and the olive loaf. Both were delicious. The chef prepared a non-dairy preparation of the escargo with prosciutto, which was fabulous! The veal and short rib meatball was good, but not spectacular and the scallop, which was baked in a puff pastry with pate was very unique in its preparation and even better on the palate. I had the pork chop with a bacon jelly on top which was tender and juicy to the bone. The brussel sprouts were lightly fried and the kale with onions was cooked well but the truffle fries were the worst of the sides that we tried.But, forget the fries, the real issue was that it took about 45 minutes for our main courses to arrive after we'd finished our appetizers. The chef came to the table to apologize, which was a nice gesture and she offered desserts on the house. The waiter then came out to bring a round of celebratory drink and strawberry sorbet for us and he tipped the tray and spilled the beverages all over the table and onto our clothes and purses. Sigh, it was a bit of a disaster. Everyone in the restaurant turned to look at us.I'm guessing that since most people love Matthew's, our experience was an anomaly. While the food was definitely excellent, it was the other issues that forced me to dock a few stars."], ["Joe C.", "A high quality, upscale eclectic italo-french restaurant that impressed my clients, and me.  The menu is filled with unique, creative dishes, and is not presenting \"standards.\"  There is a pasta section with 5 selections, and I actually had the most conventional of them all, a bolognese radiatore (though they were out of radiatore) though I gave their bolognese only a 3.5/5, It was serviceable and tasty.  I was intrieged by the Bucatini with vegetables and lemon zest, but was just in the mood for a sugo.  Their desserts expressed the same aesthetic as the rest of the menu, I had a Souffle with elderflower liquer in the souffle batter and a blueberry sauce.  It was perfectly executed and the flavors were very well matched.The wine list was extensive and on Monday nights, half price!.  Now that works for me.  We had a Gundlach Bunchau Cab (the last one), another Alexander Valley cab and cali chard which I don't remember!The owner, Matthew helped me out a few weeks afterwards when I needed a copy of the recipt.  He was courteous and a pleasure to speak with.  I would unhesitaingly recommend this restaurant to anyone interested in an upscale dining experience in Jacksonville."], ["Malik B.", "Amazing food and waiter had excellent knowledge of wines. Great atmosphere..We tried the Chefs Tasting adventure and it was awesome even though we asked for adjustments to the ingredients"], ["Mike B.", "We did the tasting menu here on Friday night with the wine pairing.  $125 a person and more or less left hungry.  The food was good and the wine was good, but what gives... give me a little more of some food please.  The service was decent, the waiter we had kept stumbling over what he was bringing us and was not very confident at all.  For the price I would have expected a but more."], ["Jacob B.", "Best service in Jacksonville, hands down. Very romantic setting. Pretty expensive, but not to the point where is unbelievable.  The food was great.  Not something that I can see myself craving, but it was really good.  Overall, you're definitely paying for the experience and Matthews didn't disappoint."], ["Lauren S.", "I went here in a group with 50 people so the service was rather slow, but I will not hold that against them. Serving a huge group is hard.For an appetizer, I had caprese salad. The tomato was slightly roasted and there was pesto instead of basil. I even ate the mozzarella, which I don't usually like.The bread is really good and the butter is SCRUMPTIOUSI had steak which was very delicious. For dessert I had chocolate cake which was good. If I am ever in Jacksonville again I will go here."], ["B M.", "I ate dinner at Matthew's twice in three days.  The first night I went with a co-worker. We agonized over the menu choices, but Brian helped us make our final decisions. The escargots in a cream sauce with shallots, mushrooms and spinach was divine. The pork belly was perfect, seared off and served with a sweet potato purée, a cardamom vanilla syrup and huckleberries. It was magic, the best bite of the night. We ordered the loup de mer (bronzino, a flaky sea bass) and the wild boar. Also fantastic. For dessert, we had a pumpkin soufflé with a creme anglaise sauce. The wine list is extensive. The second night we had a party of 24. We had a prix fix menu. Highlights were the salmon crudo, curried butternut squash soup, the scallops, the beef tenderloin, the pumpkin semifredo and the flourless chocolate torte. Everyone loved the food.Service is attentive and the food is delicious. I don't live in Jax, but I'm making a beeline for Matthew's next time I'm down there."], ["Rick D.", "Pavel and April were wonderful...... Rebecca and her desserts have set a beautiful stadard"], ["Don R.", "We have been regulars at Matthews for the past year.  Our last visit was completely unacceptable and Matthews simply does not seem to care about their customers.  Upon arrival we found no valet.  Our server had to be prompted several times to share the details of the chef's tasting menu.  Of course, the server did not memorize it and had to read it off from a cheat sheet.  The menu here is pretty stagnant from the viewpoint of being a regular customer.  Even though the menu barely changes, they were out of 2 items from their menu early in the evening (6pm).  I ordered the \"sushi grade Ahi tuna\" cooked rare.  It was so incredibly full of sinew that I could not cut through it with the sharp steak knife they provided.  I did return the Ahi and ordered the ribeye, cooked medium rare, which took 20 minutes to come out of the kitchen (long after my spouse had finished eating).  My ribeye was mostly medium rare except it was completely burned (not seared) on one side...so much so that I actually was able to cut the completely burned layer off and leave it on my plate.  The beverage service was inattentive, and the quality of check backs by the server was poor.  A manager, nor anyone from the kitchen, took the time to both verify the complaint about the tune and visit our table to apologize.  And clearly, no one was watching for quality control over my ribeye.  Most of the other items were plated sloppily as well.  I've tried contacting Matthews, but I can't get anyone to answer the phone during the time I am calling and I'm usually too busy during the evening. I would send them a message through their facebook page, but my message months ago never received a reply.  I can no longer recommend Matthews due to poor service, food and management.OLD REVIEW: I have to say that the food was absolutely 5 star, but there were some things lacking based on the targeted demographic.  First, it was absolutely frigid in the restaurant during our visit.  With entrees in excess of $50, I expect to sit in comfort while dining.  Second, the attentiveness of the service was spotty.  Our server was very professional, and appropriately friendly, but we had already eaten our appetizer before being offered a beverage, and a request for another piece of bread was forgotten and then still not offered to any other guests when finally brought to the table.  Still, the food was absolutely stellar, but we will not return when the temperature outside is cool and will request an attentive server (which is not an appropriate thing to have to ask at a fine dining restaurant).UPDATE:  We have been an additional 2 times since the first review.  They are very consistent in my assessment that the kitchen needs to taste food for seasoning prior to sending it out to customers.  We now know to ask for salt, but some dishes are literally perfect, whereas others are simply sans salt from the kitchen.  Of course, salt is critical to bringing out the flavors in most foods...so you be the judge.I'm also happy to report that the service was better on our 2nd and 3rd visit.  Ironically we have been seated at the same exact table on all of our visits, regardless of our request for a booth, and the temperature has been an issue during all visits.Another thing that stood out is that on both our most recent visits, the servers had to read the chef's tasting menu off from a cheat sheet.  This is a 4 Diamond restaurant, and reading specials off from a cheat sheet is something I don't expect to see.Finally, another thing I think shows a lack of care at this grade of restaurant, or any restaurant for that matter, is when they are out of menu items.  They were out of 2 menu items when we went the last time, and normally at this type of restaurant the menus for the small dining room would simply be reprinted to exclude the missing items so as not to disappoint customers.We have tried visiting this place on the spur of the moment, but beware that they are often closed for special events and they do not seem to update their hours with anyone, including their own facebook page."], ["Lizzy C.", "My husband & I chose Matthews for our annual Christmas date, as we were planning on seeing a play in nearby San Marco square after dinner/drinks. Upon entering the restaurant, we were greeted by a beautiful ambience. There was white, modern furniture, bright lighting & a beautiful bar with the different liquors show cased. Immediately, we knew this place was classy.We decided to sit at the bar & take part in happy hour, which is 5-7pm daily, with $5 select wines & $7 martinis. I chose the petit syrah (which was poured very generously), while my husband chose Duke Brown Ale, a Jacksonville home-brew. For food, we started with the cheese plate. Not really sure exactly the types of cheese on the plate but it seemed like a gorgonzola, brie, sharp cheddar & brie. This platter was a piece of art & came with crostini, candied nuts, a date, some grapes.  Following the cheese plate, we chose seared beef tips over country grits & buffalo calamari with blue cheese dipping sauce. The beef tips were cooked to a perfect medium & were so juicy. The calamari was spicy, but not over powering. My husband says \"this is the best calamari I've ever had\". Appetizers were priced reasonably ($6-$10) & the service was outstanding. Would definitely return. Also, for all of you Jaguar season ticket holders, there is a teal deal for Matthews...$20 off purchase of $50!"], ["Nicole W.", "Almost did not come to Matthew's because of some negative reviews. Decided to go anyway and we were extremely happy we did! Started with escargot which was absolutely delicious. I ordered the duck breast for my entree which was very good but this dish had an amazing duck confit bread pudding that was bursting with a ton of flavor! Also ordered a great side dish of Brussel sprouts. My boyfriend ordered the a duck confit curry pasta dish that was AMAZING! This was defiantly a great restaurant with good service. Although the Brunette hostess and bartender are pretty rude and unwelcoming. Overall worth the price!"], ["Brian W.", "Superb setting that yells classy that was matched by true proseesional service at every level accompanied by outstanding food. Had to fault this place, in fact i can't. I had Foie gras then Sea Bass & finished with Berry Souffle and each dish was simply first class."], ["Eric M.", "Visited Matthew's Restaurant for a dinner to honor a father-son textbook author team so we were in a private room.  The appetizers were pre-picked and delicious: tomato and cheese on a cracker, scallops, and steak (sorry, didn't catch the fancy names for them).  Good thing we' didn't fill up on them.  Had a choice of soup or salad and opted for the crab and corn chowder.  Very good!  Not too rich or heavy.  Perfect with their rolls.Had a choice of fish, vegetarian, and steak for the entree so went for the steak.  Not a huge cut but certainly enough and filling given the appetizers and soup that preceded it.  Very tender, even for tenderloin.  Others seated near me who had the steak agreed it was the most tender steak any of us could remember.  It was perfectly seasoned and served with a light red wine based sauce and potatoes.  Was really full at this point but there was still dessert.Dessert was either an apple cobbler (I love apples) and chocolate cake.  I opted for the cobbler but that was a mistake.  The apples were way too tart for a dessert.  Luckily, one of my colleagues wasn't going to eat dessert and ordered the cake just in case.  So she gave me her cake.  It was good but nothing to write home about.  A very-moist chocolate brownie (with no nuts) is a pretty accurate comparison.  But that wasn't really a problem since most of us were full after the entree and were just over-stuffing ourselves by that point."], ["Ron C.", "Awesome cheese and meat starter!  More than enough for 2. Great atmosphere and service !"], ["Jeremy S.", "OMG!  This place really stands out to me.  I've been waiting for a special occasion to go here and I'm so mad at myself for waiting.  Service A+, Food A+++, Atmosphere A+.  Hands down, this takes my number one restaurant in Jacksonville award.  I had a steak dish which doesn't sound very exciting until you ask the waiter to explain it to you.  Best steak in town hands down.  Marinated in herbs and spices that will knock your socks off.  If you don't feel like a formal dinner, sit at their bar which looked awesome and enjoy the live music.  Otherwise, enjoy their formal dining room which will make for one of the best meals you have had in a long time.  ENJOY!"], ["Lee H.", "This was our 38th anniversary celebration. Probably the best food we've ever had at a restaurant. The use of herbs and spices was elegant - powerful flavors laced delicately but not subtly with the main ingredients gave a learning experience as well as an incredibly delicious meal. We were overwhelmed with service, not only waited on by two people hand and foot, but informed by them at our every whim, answering our questions about the recipes as well as about the fresh ingredients. We ordered two salads, both wonderful, but the one made of fennel root at a major ingredient was not even close to anything we've ever had. The tempura fried olives \"for the table\" started us out, again something I've never even imagined, and ambrosia to the palate. Kudos to David and Nathan, and the crew of smiling chefs under Matthew's direction!"], ["Laini T.", "My husband and I went to Matthews for our Valentine's Day dinner, but chose to go a few days later so that we could enjoy a normal tasting menu instead of the abbreviated Valentine's Day one.  I am a huge fan of tasting menus and love to be able to try whatever the chef thinks are his best ingredients and combinations of the night.  In DC, these menus are everywhere, but Matthews is the only place we've found thus far with a tasting menu in Jacksonville.  They also have top notch service, down to offering both a light and dark napkin depending on your ensemble.We started off  with a very light course - I can't remember the word for the cooking style, but it was similar to ceviche, and featured a slice of a scallop and a bit of a white fish.  It was very tasty, but I was worried that if all of the courses were this light, my husband was going to be very hungry when we left.The next course was AMAZING - the best one.  A half of a fresh lobster tail, burrata, eggplant compote with three different caviars.  I've never had such delicious lobster tail - SO good.Next was a pasta course, with mussels, lumb crab, and a white wine sauce.  It was tasty, the mussels were very clean, and the crab was a nice touch.  Next was a swordfish and then, to be honest, I can't remember what came after that.  We finished with an olive oil pound cake with homemade ice cream which was fantastic.Every course was paired with a great wine which is likely why I can't remember the later courses as well.  We will definitely be back - this was a great meal and a great experience."], ["Jonathan K.", "Simply amazing.  Went with my daughter and our waitress was just awesome.  The food was incredible.  Definitely recommend."], ["David G.", "Pleasurable atmosphere and top-notch staffing. Not a huge fan of the brie, but the rest was a 10. Enjoyed our anniversary dinner, thanks so much!"], ["Thomas C K.", "We dined here on Monday, April 8. Overall a vey enjoyable dining experience. We both contemplated the Tasting Menu but felt that perhaps the offerings were not special enough. My wife, as a Starter, took the Hudson Valley Foie Gras which was simply outstanding - cooked to perfection - slightly crunchy on the outside and buttery on the inside - delicious! I took the Blue Fin Tuna which also was outstanding. For the Entree my wife took the Grass fed veal scaloppini which was sumptuous. I took the Skate wing turbo with a side of fried Brussels sprouts - outstanding! The meal was spaced appropriately and the service impeccable. Definitely a gem on the Jacksonville dining scene!"], ["Katie C.", "We showed up to Matthew's without a reservation, dressed to the nines for our anniversary date. Originally, the plan was to eat at Chart House, but when the night arrived, we wanted to try something new. We're just spontaneous that way :)As we drove down Hendricks Avenue discussing our options, I spotted Matthew's and remembered all the rave reviews I'd heard about the famous chef, Matthew Medure. We walked inside and were immediately greeted warmly by the hostess and the beautifully refined decor. Nothing too crazy, just soft lighting and creamy neutral colors that set a tone of relaxed, tasteful ambiance. We encountered zero snobbery about our lack of reservation and, after telling the hostess that it was a special occasion, we were treated as if the staff had been planning our anniversary dinner for weeks. Every staff member exemplified the fine-dining experience. One server even apologized for walking in front of me on my path back to the table after a bathroom visit! Before we ordered our food, our server presented us with complimentary glasses of champagne, and explained the menu in detail, including the tasting options. She was funny, gracious and very knowledgeable. We decided against the Chef's tasting menu, but I would like to try it in the future. We started our meal with the Escargot in a cream sauce that was warm, comforting and completely satisfying. I chose the Scallops, cooked medium, for my entree and they were rich and flavorful, while still maintaing the light and fresh quality I crave in seafood. My date ordered a steak, which I also tried, and we both agreed it was cooked very well. Dessert, as usual, was the most memorable part of the meal. Our server brought our chocolate souffle out piping hot with \"Happy Anniversary\" written on our plate in chocolate. She offered to take our photo which we loved. The souffle was decadent and bittersweet, exactly how I like my chocolate.As we were finishing up, we were given a card, signed by the front and back of the house staff, congratulating us on the occasion and thanking us for choosing to spend our evening at Matthew's. A very nice finishing touch to a lovely evening! I highly recommend Matthew's for any fine dining occasion. It is expensive, undoubtedly, and the portions aren't huge, but if you're looking for an impressive meal with refined fare and pleasant staff, then Matthew's delivers."], ["Virginia M.", "I had a very nice anniversary dinner here last week! It was my first time dining at Mathews. I had the steak along with escargot and their house salad. I finished the meal with a souffle. Everything was prepared nicely, I have had escargot before, but  it was different here, which I liked. They brought us some champagne and had a wonderful presentation for desert to celebrate our special occasion.  I would return, but next time I would try the chefs tasting menu."], ["Philip O.", "Worst Saturday night out in a long time! I went with a group of friends for a special occasion with high hopes for supposedly \"the best restaurant in Jax\". First off This place isn't big but immediately should of had at least double the staff to run orders and to keep up with the demands for drinks. We were in a group of nine with only two drinks a piece in three agonizing hours. Next the server forgot some of the apps and drinks. Bar drinks took at least 30 min to get not allowing us to have a few. over a hour and a half goes by, by the time everyone's dinner finally comes out. Three out of five beef tenderloins were ordered med rare and came out well done. They had to be remade which took another 25 min. At the end of the meal the server asked \"who is paying\" and was told it was separate checks. He got an instant attitude and said \"well that will take a long time.\" 30 min later we got out checks that were all wrong. The server was so rude and for such a \"fine dining establishment\" we should not have dealt with such an attitude. He said it was our fault for not stating in the beginning we needed separate checks. We will not be going back and are so disappointed with the managers lack of interest. What was supposed to be a nice night out turned into attitudes and overcooked food. Plenty of other places I would rather spend my money than Matthews."], ["Ayesha A.", "Amazing food, amazing service, amazing ambience!! Made reservations for a Friday night Birthday dinner! So glad that I chose Matthews. Our server Pavel made the experience so special. My \"Birthday Boy\" even received a card signed by everyone who took part in our dining experience."], ["Hilary L.", "While I haven't ever come here for dinner [the menu is on the pricey pricey side], I have heard awesome things about it. You definitely get your money's worth and this place has the reputation to prove it.What I can talk about is their lounge + happy hour.After getting an email about their happy hour, a few friends and I decided to check this place out.The decor of the lounge is very fresh, full of whites, mint greens, and tiny splashes of red here and there, giving it a subtle, sophisticated, modern vibe. You feel very cool sitting there next to the bushel of white ostrich feathers coming out of the over-sized white vase, sipping on a blue cheese stuffed olive dirty martinis [$6]. They also have some amazing bar food selections, including [my favorite] the trio of French Fry options... Truffle Oil Fries topped in shaved Parmesan Fries, Sea Salt + Vinegar Fries, and the Blue Cheese Fries. $4 a piece, or if you are extra friendly to the nice young bartender he might convince the chef to make you a sampler. If you are feeling fancy, aren't on a fancy budget, but want to check out one of Jacksonville's most luxurious eateries... this is a great way to do it!"], ["Wes J.", "Arrived without a reso to a full house 6pm on a Saturday night. We were able to be seated by virtue of a no show but i'd recommend reso's be the norm. We were very happy to learn that Matthew Medure has placed a Chef d'Cuisine permanently in the kitchen here. Unfortunately his name escapes me. This makes a huge difference in the kitchen, and not just in the prep and cooking but in plating and having an executive host to work with guests on their special needs. It just takes everything up a notch to have that \"chef/owner house feel\" back at Matthews. The result was a three course meal without a hitch and without a miss in delivery and taste. A special moment occurred when the Chef d'Cuisine was able to partner with my wife on her meal because she is a vegan. After a brief conference, her dinner was quickly addressed in a quality way and rather than steamed veggies it was both elegant and finely done. Equally important, big change at Matthews is the menu has been updated and changed. Also, the restaurant now promotes family style dining where they deliver somewhat larger amounts of the selected dish in a portion amount correct for the table size so that all  might be able to have some if they want to try it. Or if perhaps someone might want another portion because it was so good one couldn't resist. This has been a theme at other famous New York (and Los Angeles) restaurants like Tom Calicchio's Craft, has been a well received theme and makes the formal dining experience somewhat less imposing and fun. The combination of Chef d'Cuisine on site on an every night basis, the new menu and related changes of recipe and new offerings, and the family style but still fine dining experience make this the new hotty restaurant in Jacksonville."], ["Katherine P.", "Great fine dinning in Jax, especially if youre a food lover & a critic just like my hubby. My hubby told 1 of of the waitress that his ordered oyster had a bit too much of onions w/c the main chef kind of see it as an improvement 2 their menu. They gave us a complimentary shrimp ordered which was really heaven. This resto works their best & they love how u compliment or say what u really want to have in your plate. Place was a bit small but very romantic & classy. Would love 2 go back again."], ["C M.", "Mathews reputation raises the bar for expectations.  Our expectations were not met.  We ordered a specific cocktail and had to send it back because it was missing a vital ingredient.  Our server did not know the menu well enough to answer our questions.  Our appetizer was soggy and tasteless.  The entrees were quite good on the bright side.  The dessert rather lackluster.  We'll go back again to give it another try.  Just not rushing back!"], ["Bianca O.", "This is the definition of fine dining!My husband and I went here to celebrate our anniversary and from the first bite to the last our taste buds were thanking us.  The restaurant is small inside, not much seating, so make a reservation. The decor is very nice and upscale.  We decided not to get the fixed menu with wine pairings because neither of us are wine drinkers (though they do offer if without the wine).For our first course my husband tried the seafood bisque and I had a salad - both were phenomenal. I can't recall what we had for entrees (it's been over 6 months since we went - we have since left Florida) but whatever it was I know we both had to contain our grunts of approval. I DO remember the dessert (because isn't that always the favorite part of the meal, anyway?). We ordered the chocolate soufflé with creme Anglaise - DIVINE. I'm not even a huge fan of chocolate but after everything else we had tried I knew we could not leave that place without trying dessert and this was a chef's recommendation. It did NOT disappoint! The overall cost was about what you would expect to pay at a fine dining establishment, so I wasn't sticker shocked. All in all our bill came in under $100 (that was with tip and without wine). If you want a truly fantastic meal, in an intimate setting - this IS the place to go in Jacksonville. You will not be disappointed by the food, service and overall experience!"], ["Bernini Z.", "Again, as you can see from my other reviews here, 3 stars is very good, and so is Matthew's.Started with drinks at the bar and they were perfect.  The young Columbian bartender was awesome and can shake and mix.  Margarita, nothing to be desired, a martini of some sort for my girl was perfect for what she asked, fruity and not sweet.  That's a tough one and the girl delivered.Inside, service at the front line was warm and unpretentious, David was his name and he was fun to hang with.We did have to ask for bread, so his support server was good but not exact.  but we were there to have fun.The tasting menu with wine pairing was fair-priced, probably expensive by local standards.  One glaring flaw that made the food geek in me cringe and any chef worthwhile in the big game wouldn't have done this, so I will mention but not skewer him for it.   One course, a seared sea scallop was served sliced and would have benefited from maybe being served whole and could have been salted a bit on the inside.  They slices stuck together and to the shell, but the point here is they served it with heirloom grape tomatoes which were okay, possibly could be called bland and in a small plate environment had a squirt to them that outstretched the perimeter.  Still okay.  But the horror came later.Last, entree or main course was monkfish, possibly the best and most perfectly cooked I ever had.  Here's the rub.  Also served with the same color combo heirloom grape tomatoes.  This is such a mistake in the tasing menu world that I can only give a fine restaurant a pass that it was an oversight.The plating here should be re-examined..  Angnolotti should have been spread on a plate to avoid stacking in the bowl that caused sticking.The lobster, cucumber in broth was fantastic.  The peanut butter profiterolles were okay, a bit ordinary.  Wine pairings were adequate with a kenwood sparkler that surprised and a sherry that disappointed.  Matthew's was a very good choice and will go back when we are in Jacksonville.  Everyone was so nice."], ["Michael D.", "I dined alone at this outstanding haven for indulgent gourmets and winos and had an outstanding experience. Kelly O was the perfect server for a solitary diner as she offered generous insights about the menu. She knows her wine, too and does it all with genuine passion. The four plates I had were well-paced and, again, the server's perspective not only on the wine combinations but also about the relationship between the dishes was immensely helpful. The gracious hostess offered me a selection of magazines to read but there is no need, especially when one can read the wine list and learn quite a bit. I also observed how many other guests in the restaurant were simply having a wonderful time in an atmosphere that is neither too dimly lit nor overbearing. This is a place about balanced tones and exquisite food. Since my 18th birthday, many years ago, I have been fascinated with escargot (youthful food snobbery abounding). Over many years of restaurants, including a good tenure as a waiter, I have never tasted escargot this good. Also, the \"air-dried\" duck (they spend more of their life flying? I asked) was cooked to perfect reddish pink and full of the non-gamey richness. Bravo."], ["Sandy T.", "Matthew's was one of the restaurants I have been wanting to try in Jacksonville.  Since I was pressed for time, I chose to go to the bar area during happy hour.  The bar area is nice and nicely decorated.  I enjoyed the atmosphere.  We waited at our table for at least 10 minutes before someone greeted us.  It was awkward and it seemed like the bartender was the bartender and the server for the bar area.  He was running around serving food and mixing drinks attempting to do it all.  He was very pleasant and friendly.  I felt awful for him as several others just kept walking by with suits on, smiling at customers and not helping.  Mind you, this is all one hour into their 2 hour happy hour.  There were two tables filled with dirty dishes and the bar area looked like a mess with the strawberry box that you get from the supermarket right on the bar in front of where people were eating.  It just seemed incredibly bizarre for a supposed high class, expensive place.  You would think there would be more help during this busy time.  Just sayin...We ordered some drinks off the menu that were on happy hour special which were decent and ordered some food off the bar menu.  We had the Kobe burgers and Truffle fries.  Kobe burgers were amazing with melted brie on top.  Yummy!. They had their own set of  shoestring fries on top which were cold when they arrived at the table, but I didn't make a stink since the burgers were so delish.  The truffle fries came about 5 minutes after the burgers and they were good.  I thought they would knock my socks off too, but nothing to write home about.I will definitely come back to try it out for dinner, but hope that with the amount of money I spend on dinner the service will be top notch.  We shall see."], ["Jan H.", "I had dinner on Valentine's Day and the special Valentine's day menu was a disappointment;  small portions and very overpriced for the selection. Perhaps the regular menu is better but the Valentine's day menu left a lot to be desired."], ["Matthew C.", "Had very high expectations for dining at Matthew's this weekend (Saturday, January 29th, 2011).  Unfortunately, I was totally let down...mostly with the service.  We were promptly greeted and seated at a comfortable booth.  Our server greeted us promptly and I could instantly tell he was new or at least somewhat uncomfortable with the situation.  He didn't have the confidence of the other servers waiting on other guests and from there, things went totally down hill.  I have always wanted to visit Matthew's and when Groupon had the special $50 for $25, I snatched it up.  After I informed the server of the Groupon he quickly jumped into the \"fine-print\" that was no where mentioned in the Groupon either at the time of purchase or on the coupon itself.  He said it couldn't be used for the early-bird prix fixe and two full-size entrees must be purchased...so this meant my wife couldn't order the early bird (which she wanted) and I couldn't simply apply it to my $70 tasting menu selection.  I thought it was ridiculous and none of this mentioned in the Groupon.  It only gets worse...our server disappears for an unusually long amount of time.  We're getting hungry and my wife is 6.5 months pregnant.  Waiting, waiting.  Finally someone who appears to be a manager comes to our table with a bottle of Champagne apologizing that we haven't been greeted by our server...we had been greeted...just now waiting for him to come back.  At this point I should have said something about the Groupon but let it go.  I said that we had been greeted and it was fine.  Then he just said ok and left with the uncorked bottle of champagne and didn't even pour me a glass - what a tease. All in all - the food was excellent: beautiful presentation and extremely delicious...portions are extremely small though so don't expect to leave full.  But at a kind of place like this, the service should be top notch.  Our guy was far from it.  Avoid him if possible...he's the one with braces that looks about 19."], ["Dace G.", "My wife and I dined here a week ago for the first time.  We had a early 6:00 pm reservation time which is nice for us because we like to dine early plus you usually have the place to yourself.  We arrived about an hour early as we like to do for a nice aperitif.  They have some good Happy Hour specials so we enjoyed a couple of glasses of house wine which were excellent and my wife enjoyed a nice martini called a summer porch sling.  It was very nice and refreshing.  The bartender was great and talked to us whenever he had time as it seemed a little busy for 5 o'clock.  We watched him make many different martinis and each one was made with a special touch and care.  Highly recommend any martini made here!  We were seated promptly and on time at 6:00 pm.  There seemed a little confusion on who our assistant waiter was but they got it worked out.  Our waiter was great and very informative of the menu.  We were feeling really good after our Happy Hour so we were ready to order what we wanted which we did.  We ordered the cheapest Caviar on the menu which was $110!  It was amazing!!!!  Served with a variety of different items such as egg white, egg yolk, crème fraiche, and capers.  All were delicious!  My wife ordered the Foie Gras which was fantastic!  I ordered the Escargot which was very delicious!   We also had the maine diver scallops and the agnolotti.  The scallops were good but the agnolotti is was fabulous!  We finished off our meal sharing a chocolate soufflé which was great as well.  The atmosphere was very nice and romantic.  They even had a chefs table but it looked more like bar then a table.  I think you can request this.  They also have a free valet but not needed if you show up early enough.  You can park yourself right across right across the from the restaurant.  Overall service was great, food was amazing, and the prices were fair.  Having tried both brothers restaurants I would say this one is better on atmosphere for romance, service was slightly better, but prices were a little higher.  You'll have an amazing time at either so enjoy!!!!"], ["Beth F.", "We planned to attend the cooking class (which sounded fantastic) until it was cancelled. Instead we had dinner that night. That was one of the best meals ever. We had the tasting menu with wine pairings. The timing of the courses was perfect, the selections of wine and food excellent. When looking for one of the wines back in Dallas, we were told that it was above their price range! We will definitely return whenever we are in Jacksonville.Expensive and well worth every penny."], ["Natalie B.", "The food was beautifully prepared, seasonally appropriate and sinfully delicious! They procure a lot of their produce locally from Twinn Bridges. You can either select a tasting menu or a la carte. We went with the a la carte and selected the following:Amuse Bouche: Fried Artichoke w/Asparagus tip and extra virgin olive oil1st course: Panzanella salad (Hubby) and Blue Crab and Israeli Couscous salad (me)2nd course: Foie Gras w/Sweet Onion and Marmalade (Hubby) and Quail stuffed w/Foie Gras and Pork BellyMain Course: Beef Tenderloin w/truffled mashed potatoes, Roasted shallots and morels (Hubby) and Rack of Lamb w/Mushroom risotto (me)Cheese Course: Five selections, included a blue, goat, triple creme and one made with Guinness!Dessert: Souffle with creme anglaiseThe service was impeccable, unpretentious, and warm. We asked our server to select a pairing for the main course. He select an amazing Blackstone reserve that was a mix of six varietals. What can I say that hasn't already been said below?Wonderful dining experience that balances food and service. Both are the stars here.Tip: Coupon for $20 off available in Mint/Money magazine!"], ["Nathan S.", "Very well prepared food and a well thought out menu. Courses are actually fairly large, esp. if you are going to order a multi course dinner.Servers are very knowledgeable and very helpful when ordering.Decor is very clean and modern.Given the other culinary options in Jacksonville this place is definitely in the forefront."], ["Rebecca H.", "The food was very good, not mind blowing, but well executed.  We had the tasting menu.  The crab claw with brandy mousseline, salmon in perfectly steamed chard, hearty tenderloin with wild mushroom risotto and black shaved truffles, and a delicate turbot with cauliflower puree, it was all delicious.  The pacing of the meal was off, and comments were made to us a few times about how quickly we ate our courses, which was odd given we were there almost two hours.  I found it a bit rude, especially as our server had previously apologized for how slow our meal started.  Then at the cheese course things fell apart, the manchego was limp and flavorless, either a creamier or more robust cheese would have been better suited.  The spoon of honey with honeycomb was divine, I could have eaten a bowl of that.  The final souffle was underwhelming. I never tasted the promised cracked pepper and the anglaise was flavorless and watery.  Nicely presented, not worth eating. The restaurant is beautifully lit, elegant and understated.  The bar is a great date night spot, with a whimsical cocktail menu and reasonably priced tapas.  The booths are low, I felt I needed a booster seat!  On final review, the dinner was strong until dessert.  The service was mostly attentive and on task, but please refrain from voicing your perception about my dining habits unless I'm eating with my feet, and ask me how I would like my meal paced if you have concerns, don't assume.  I love fine dining, the week before I was at Chez Panisse, the week before that Absinthe, I like my food and will pay a lot for good food and service.  I would return to Matthew's if I were in Jacksonville again, but I wouldn't have five star expectations."], ["Leigh D.", "Literally, without exaggeration, the best food I have ever tasted. Service was impeccable!"]], "Restaurant Medure": [], "Bistro Aix": [["Paula S.", "Thoroughly enjoyed the ambiance, and the food. Started off with sharing escargot. Thought escargot was tender and not overwhelming with garlic. Menu had so many delicious items to choose from yet I had seem a pic of their Cesar salad and had to try it. Also had cup of their French onion soup. Both were wonderful but I will definitely get a bowl next time..... So good. My boyfriend had their rib eye steak cooked medium rare. The staff was very helpful and attentive. Definitely will return"], ["Tajira M.", "I'm not sure what I was expecting when I walked into the restaurant, but I felt slightly confused by the decor. Maybe because most \"bistros\" I've been to lately are either a little more modern or a lot more intimate, but something about the decor felt a combination of dated and somewhat muddled. The chairs made me feel like the knights of the round table were joining us for dinner, the bar had animal print stools, the lighting above the tables were like multi-colored disco balls minus the sparkle. It's just a strange combination, and on first glance, it made me wonder what the food would be like. But-for the good reviews, I probably would have been worried.  My advice: ignore the decor-- the food was great. I sat at the bar, and first I tried the Pinot Blanc, one of their featured wines. Smooth and light with crispy citrus notes toward the end. I'd picked the restaurant feeling like having moules frites, and was pleasantly surprised to see that escargot was on the menu. Why not?The escargot came out first with crusty bread. Seven tender snails in a light garlic cream sauce, topped with a crust of Parmesan cheese and fresh parsley. Seeing other photos, I was worried the dish would be too heavy or overly salted, but it was delicious. The cream sauce made it different from the typical butter and herbs, and it paired well with the wine. Both the bartender and the hostess (I'm assuming she was actually the manager/owner) were very attentive.The mussels and fries came out much larger than expected, which was a pleasant surprise. An inexpensive meal, I want to say they were $19 and the escargot was $9. The fries were crisp and had a nice time and salt flavor. The mussels had a great broth of white wine, shallot, thyme and garlic, with enough broth left in the bowl to sop up with bread or the fries. Lovely. I wasn't certain I would enjoy the meal, but I'm happy I gave it a chance. By the time I left, the restaurant was bustling. I did wish there was a tv to catch the end of the basketball game, but the bartender kept us updated with the scores. See pics."], ["Namir S.", "Have been back several times. I like the drinks and wine selection. I like the atmosphere and will return, but I can't say it's due to the food. Don't get me wrong, it's good, but not great. The feeling when you eat a good meal but you know it had 1500 hidden calories because it was soaked in butter. All in all, I'm undecided how i feel, but most people will like it."], ["Ekaterina C.", "We have been there twice. The hanger steak had a heavy salty sauce that hurt my stomach for 2 days and her veal in bone marrow was very salty. We did not have a great experience but the service was excellent. Our second return per the manager was much better. Peter our server was superb! The avocado tuna app was excellent! The bread is great as well. There were some flies buzzing around they need to take care of that! My shrimp tagliatelle was excellent and I don't ever remember a better Marinara sauce tasting so good. Deep flavor. Her filet mignon was too thin with very little flavor. Very small portion. The chocolate mousse was to die for in Jax! Overall experience was good the second time but still not worth the money. Great ambiance."], ["Mathew H.", "Fantastic food here, if you love food you should come here to celebrate it! They do classy upscale dining in a charming and local way. Great wine selection as well which is tough to find in these parts."], ["Joseph S.", "Came for lunch ... Ordered a grilled chicken salad. Chicken was COLD. Salad ... A head of green leaf lettuce. $13. Absolutely absurd."], ["Andi E.", "Just fantastic!I sadly jumped in for a quick lunch and wish I had been able to stay and linger to leisurely enjoy the atmosphere, the lovely menu and the amazing food and service.Smoked tomato soup was to die for, tuna tartar appetizer was wonderful and the roasted chicken was melt in your mouth flavorful and delicious.I was completely underdressed because I was leaving town right after so I will make sure that I'm up to snuff.  You know it's bad when the hostess is better dressed than you are ;)Really wonderful experience!"], ["Ryan S.", "Tonight the wife and I decided to visit for a date night and were very happy with the evening. The restaurant was a little on the noisy side but aside from that very pleasant. Staryed with the escargot and blue cheese chips. The escargot were fantastic. The blue cheese chips were very good the cheese was very fresh and the cream sauce was well balanced. The house made chips were cooked perfectly. I will say the gorgonzola chips at the bling rabbit were probably a touch better.For our entrée we got the grilled tuna and the fillet mignon.  Both were superb you could cut the steak with a butter knife (and I did at first due to a lack of steak knife lol). The fillet was cooked perfect to my liking. The au gratin that accompanied it was holy sh** good you must try it. The wifes tuna was amazingly flavored and cooked perfectly as well.Dessert was a little dissapointing as on their online menu they lust a bananas foster cake which they didnt have. :(  Instead we got the perfeteroles which were good but not amazing which could have been totally due to the fact I had my heart set on bananas foster. Over all very happy though they have definitely earned my repeat buisness"], ["Jay M.", "The following review was published under my byline in the Florida Times-Union on Thursday, February 20, 2014. This is an original, unabridged version of that review. This is also focused exclusively on the Le Bar section of the restaurant (formerly the Onyx Bar).It's regal yet comfy, sophisticated and silly with spasms of pop art throughout. There's some French and Asian décor cues, too. And a beat that doesn't stop, even when the music makers do.Le Bar is a dressed-up refuge for grown-up fun. The San Marco Boulevard neighbor and blood cousin to Bistro Aix puts on a good show in its style-forward lounge. But when it comes to the kitchen scene, Le Bar also manages to be flavor-forward. Its outstanding menu of small plates and handcrafted cocktails stands on its own, with items originating from its own kitchen and bar.If you're looking for full-service formality, look next door to the Bistro; Le Bar plates are for sharing. The French culinary influence is loud in clear in here--the proprietors call it \"French soul food\"--with a mature fromagerie and charcuterie board (four selections each) designed for mixing and matching. Begin your stay with a selection of three ($21) or five ($35).My lounging partner and I came for the small plates, any one of which will satisfy a light appetite as a main dish. They come to you in a variety of thoughtful French period china patterns.We began with the Sesame Tuna Tartare ($9), a collection of ahi-grade, tangy tuna bites in seasoned greens that melt in your mouth, providing a nice contrast against the crunch of the accompanying sesame crisps. More mainstream tastes will not be disappointed with the Truffled French Fries ($6), a healthy portion of golden-crisp, thin-cut beauties tossed in truffle oil and topped with shaved Parmesan and sides of ketchup and mayo. They were so good, our server caught us pleading for a second plate. More carnivorous types will devour the Deux Sliders ($8), baby cheddar cheeseburger twins fully dressed with secret sauce that made for a melty (and potentially messy) affair. Make no mistakes, though: the risk is worth the reward. That's a great segue to the Croque Monsieur ($8), otherwise known as not your ordinary ham and cheese. This creamy sandwich is best attacked with fork and knife, to fully enjoy the blend of gruyère, provolone, Parmesan and heavy cream spilling over the edge.While you won't find sweet treats on Le Bar's abbreviated menu, our server regaled us with tales of crème brulee, flourless chocolate torte, lemon cookies and Belgian cake. We pursued the latter, a volcano-like creation crafted of almond flour and dark chocolate, spewing sky-high a scoop of vanilla Working Cow ice cream with plentiful syrupy chocolate flows. It's ample for two or more to spar over with spoons.Those nostalgic for the gleaming Onyx bar, the namesake for this space the six years prior, will find it perfectly preserved in its new incarnation. These days it's churning out classic and sparkling handcrafted cocktails, before- and after-dinner drinks and local (Intuition Ale Works' I-10 IPA) and imported beers. Patrons also have access to the extensive and impressive Bistro Aix wine list.Le Bar is the place you go to impress a date or a client, celebrate the end of the working day or even larger affairs, with accommodations for up to 150. Or if you love the beat, you'll find live music three nights a week with DJs filling the rest.More than that, Le Bar is a see-and-be-seen lounge with food that likewise craves to be seen and savored. It's hip, glam, cozy and fun.Le Bar1440 San Marco Blvd., San Marco (adjacent to Bistro Aix)(904) 398-1949bistrox.comType of cuisine:Hours: Tuesday - Saturday, 5 p.m. to midnight; closed Sunday and MondayCredit cards: All major acceptedBar service: Full barChildren's menu: NoCatering: YesReservations accepted: Large parties onlyPrice range: Overall, moderate"], ["Johnelyn C.", "My boyfriend and I had dinner here for my birthday. He had called in early to let them know. They surprised me with a card and an amazing chocolate pudding with a candle. It was so thoughtful of them. Our meal was fantastic. We explored the menu and my boyfriend ordered things I've never had before. The escargot was amazing and flavorful. My boyfriend ordered the veal bone marrow canoe. That was interesting. I wasn't really fond of it. The Scottish Salmon was amazing. It was tangy and soft and flaky. My bf had the duck. He really enjoyed it. We had a really good time."], ["Crystal B.", "Worst experience! Wish we had gone to Orsay! First off I ordered something off the gluten free menu and was told it wasn't gluten free- even though it says it is. Then I ordered an appetizer and right as I was taking a bite a waitress comes and tells me it's not really gluten free. The manager comes over says he's sorry. Tells me he understands because his wife has celiac. He offers nothing for our troubles. Then we wait for 20 min for refills for drinks. The wait between everything was so long and rediculous. The silverware- cups, and plates all smelled like dirty dog too. No one refilled our water. The valet was the friendliest in the entire place. Stay away- for the prices this place is no better than a Chili's quality. - UPDATE---- got food poisoning from the tuna! Stay away."], ["Sharon C.", "OMG!  Food was so delicious!  French inspired menu had too many interesting items but wanted to order more.  To start, we ordered the house smoked salmon and mussels appetizers.  Smoked salmon was excellent and the mussels were fair due to too much onion.  For entrees we ordered hubby and I both ordered cassoulet and our friend ordered ravioli de mar. Small ravioli had a very delicate lobster sauce and it was very good.  Cassoulet was incredible.  The duck confit on the cassoulet was cooked perfectly and we are lovers of cassoulet ever since our French neighbor first introduced it to us.  Our neighbor's is best but this is a close second.  For dessert, our waiter Josh, recommended the profiteroles with a salted caramel fudge sauce.  \"Divine\" was the best word to describe it.  We all 3 wanted to lick our plates clean.  I highly recommend this place."], ["Catherine S.", "Swanky, comfortable place with a great menu. Our group, ready for a change of venue after 2 delicious dinners at BB's, wandered in and were promptly seated at a long wood table with royal, high backed chairs. The waiter, new to the menu, was not much help with recommendations but we ended up pleased with our orders. The mussels, served with toast points, were plentiful and tender. And the steak tartar - delicious!! My friends loved their salads, roast chicken and creme brûlée."], ["Elaine W.", "Our \"go to\" restaurant! They NEVER disappoint. The food is always fantastic, the drinks are definitely tasty and strong, the service is AMAZING! I highly suggest this place! We love everything, their filet mignon is outstanding, blue cheese chips are well seasoned and gooey, truffle fries are to die for, their oysters are so fresh. I always order something different when we go, so far I haven't found anything I don't like. I highly recommend them!"], ["Rich T.", "While I had heard volumes of praise for Bistro Aix, I wanted to see for myself what made this San Marco location different from other French style restaurants.What I found as a welcome relief from the crazy heat of JAX in the form of a busy and dark cafe that was separated into a curved service bar, open family tables, and booths with their own character.The large one page menu was standard for fine French cafes as it was well sized without clutter and frivolous notes. The darkness that prevailed in the cafe made it hard to read the menu, but our server was very good at informing us what was making the menu special that evening. In choosing the huge steak for two, we asked for a careful medium so as to take advantage of the true flavor while retaining the cooked element. With the passing of the tiny revolver plate escargot and the supporting salads, the moment came to us on this spectacular display of big oak board and this monster cut of beef was nestled on a bed of vegetables....As a former culinary/management student, I can appreciate the European style applications of high pan-seared heat with seasoned oils or the finesse of Southern barbecue  and grill methods...but the monster beef (that looked so inviting) had darker thoughts on the inside than my glass of Syrah....Oops!The return trip to the kitchen was done by our server, who then did the gracious offerings of free glasses of wine while we waited for better results. The manager on board came to us and apologized too. That was good to see.With the 2nd arrival of the monster beef, we noted it looked different, so we were on it without a second thought. Then we noted with the first slices that our plate for 2 had become a plate for 1.5 and that sections were missing...rather than going through the issue again, we used our forks to decide. Yes, it was a different beast and the taste abounded.Forgoing the coffee and desserts with thoughts of going to Aardwolf not far away, I recollected my previous experiences with kitchen mishaps...It seems to me that the usage of a temperature gauge is sometimes a missing tool of the trade here in Jacksonville, FL. Whether the chefs are deluded by their years of experience to simply \"eyeball it\" or the tool is possibly not being used, cooking times vary from the very best in the city to the basic food truck. I have returned no less than six plates in the past year with a polite message to try again. As we subsided in the wake of the good plates that were removed from our table, I knew that I would return to Bistro Aix to experience some of the other treats listed on the menu."], ["Amber A.", "Great service, food, and atmosphere.  However, It is disappointing the  beet salad preparation changed.  It used to be prepared in a way the tastes were all infused. Now, it's just beets layered on a plate with some toppings added and drizzled. It used to be one of my favorite dishes."], ["Becca L.", "The food is incredibly good and it is safe to say that it's in the top ten for restaurants in NE Florida. The atmosphere is warm and intimate and the seating is well-spaced and comfortable. The cocktail menu is one of the best in the city and I'm always excited to return as each trips seems to outdo the last. I would highly recommend this little gem for a memorable night out and a treat for all of your senses."], ["Jeremy C.", "I went here for the first time last Saturday and had a really great time. We were at a wedding reception so our menu was limited. I tried the steak frites, and the bone-in pork chop. Both were delicious and cooked to perfection. The staff was real helpful and quick with our orders. I only wish they served Fireball whiskey, and had more parking. Overall a good place."], ["Craig E.", "After 7 or so years of eating at this place, its time to add my review -:)  Bistro Aix delivers well-prepared, high quality, and sometimes imaginative food.  I have visited for lunch and dinner, have never had a \"bad\" experience, but I am put off by the noise and the parade of people who go there to be seen.  That probably has to do with the bar business, which attracts a certain clientele. Most recently, I had a business lunch with 3 other folks on a weekday, and ordered one of the specials - a pesto pasta with prosciutto.  It sounded like a great combination, and the pesto was nicely done.  However, the prosciutto was delivered in \"chunks\" of varying size and thickness and was chewy due to the cooking method.  So, an imaginative take on pesto that didn't quite live up to expectations due to poor execution.  One of my companions ordered the same dish, and I observed him leaving the prosciutto on the plate - in fact he wasn't particularly pleased with the dish and didn't finish it. That was the first time I've had anything at Bistro Aix that wasn't  up to the standard I would expect.Overall, the dinners at this restaurant have been very good and the lunches have been kind of  underwhelming - nothing special.  I gave it 4 stars - not because I'm a huge fan - but because the overall level of quality and service deserve that rating."], ["Ryan H.", "Pricey, but ohhhhhhhh so good. The chefs here know their food. Awesome food. Slightly unassuming on the outside, but certainly fancy on the inside. Our boss took us here for a team lunch. I'll certainly be back here on my own terms."], ["Aprill C.", "Incredible food, wine list, cocktails & decor. We were visiting from out of town & dined here at least once a day during our visit. It is very unfortunate how rude & nasty the clientele is here. To the staff, each other, everyone! A lot of entitled Northern Florida hacks who have confused their paltry earnings with living in a place that truly does carry status and decorum. Sad really."], ["Maribel B.", "Amazing food. Everything we had was very tasteful!We had: ravioli de mar (wow the sauce was amazing), the salmon was very tender, the ribeye for two (the best we have ever had) and the filet mignon. The service was good except for our wine was spilled while served and there was no acknolegement about it. It was not our server but one of the helpers. Will come back to test the rest of the menu."], ["Abby S.", "Good food, good service. Very loud in the lounge area (we ate at a tall-top table which was fine). Very busy, seems like a popular spot."], ["Stephanie L.", "Made special reservations for celebration of a very large achievement.  Asked specifically that a bottle of champagne be chilling at our table when we arrive.....that was not done.  After complaining about it was told that a special dessert was planned to compensate.  Yes the dessert was delicious but the word congratulations was wrote with chocolate to read \"congradulations\".  Food was decent but service could use a little help, didn't seem the waiter was interested in working until he realized we were there celebrating something special and sparing no expense.  Not something I like to see.  Also get a thesaurus or give spelling tests to employees,  just a little embarrassing."], ["Bree H.", "We went here for lunch and found it a little odd - a french name to the restaurant and yet all the meals seem to be Italian inspired.  The atmosphere was very nice, upscale and comfortable. The staff are very attentive (a little too much at times - they fill your water glass even if take one sip out of it - over and over again) My husband had the mushroom wood fired pizza and it was totally delicious. I struggled to find something on the lunch menu I would like and finally settled on the baked honey chicken. I must say I was quite disappointed - it had a somewhat odd flavor and was really quite tough considering it was baked. This is sadly not a place I would come back to."], ["Terri M.", "Great dinner last night!   We had fantastic service from Rachel, Kyle & Michael.  They were very busy for a Sunday night due to a concert but were very accommodating.  Party of 4 with no reservation and we were taken care of as if we did."], ["Maya C.", "A friend and I came here for cocktails after dinner. When we walked in, the place was mad busy. We told the hostess that we just wanted drinks and she led us back to the bar area, known as \"Bar-X\" (Get it? Heehee). We must've gotten there just in time as it was also packed and there was only one high-top table left available. So we ordered drinks and started looking around noticing how there was a nice blend of older/younger, male/female patrons when all of a sudden, the band was getting started. We saw them as we were coming in but we didn't think that the music would be as loud as it was in the small room. The music was good but we had to yell at each other to be heard. It would've been much worse if the music was bad. Not wanting to get sore throats or blown ear drums we paid and quickly left. As we were leaving through the main dining area, the aroma from the kitchen and everyone's tables made me want to do a U-turn but that will have to wait for another dining adventure."], ["Keisha R.", "I've been in here a few times now and the food is always great. The staff is very professional but also extremely down to earth. Don't forget to eat dessert... they're all delicious!!!!! The decor is so cute too... especially the bathroom. oh, and there is a gorgeous little garden area right when walk in. Great spot for photos."], ["Mark B.", "I just love this place. They are quite proud of their food but it holds up to the billing. Again I sat at the bar so I could watch the kitchen in action. On this trip I ordered the sheepshead with bussel sprouts and an app of tuna tartar. The tuna was cut brilliantly and the whole dish had a nice spice. The red onions really worked on this dish. The entrée of sheepshead was nicely cooked by the lone woman in the kitchen Sarah. She did the fish real justice. The way she worked that station was a joy to my eyes. As an aspiring chef I was in oh. Great job Chef and his staff but I really got to give a shout out to Sarah. You made the Bistro Proud today."], ["GT W.", "Short: The first of its kind French/ American twist restaurant in JacksonvilleLong: A fancier, low lit, trendier dining experience geared towards dates and special occasions, though the prices are normal enough to make this a monthly foray. Smoke salmon pizza always delivers. Steak frites gives you a rare taste of hanger steak/onglet steak that baffles all but the best butchers in the country. Sparkling Fench lemonade is a nice touch. Desserts can be gotten to go from a mini pastry window. Full bar for when you get stood up. Portions are medium. Over time, it seems that AIX has gone from \"OMG hype train\" to just a normal place indicating that Jacksonville citizens are becoming more experienced with real food or that AIX has not been updating their menu quite often enough.Good For: Date nights, Steak fritesBad For: Actual Aix-en-Provence style dishes"], ["Anna J.", "I never say no if someone suggests going to Bistro Aix. Great happy hour with fair prices (the martinis, $5 during happy hour, are my favorite in Jacksonville because they give you an option with the olives...anchovy, jalapeno, goat cheese, etc). The blue cheese chips are wonderful homemade, crunchy chips topped with blue cheese and a balsamic drizzle (don't even want to know how many calories they are). The tomato bisque and Caesar salad is my favorite lunch option. The bartenders are always busy during happy hour, so don't expect great service from them. The atmosphere is really nice...cool lighting and an open kitchen. Great place to go for happy hour and some appetizers, but the entrees are delicious as well."], ["Allan D.", "Such great service from Rachel, Kyle and Michael.  Very busy before a Sunday night concert, but they and the rest of the staff were fantastic as always.  Food and new menus changes also great."], ["Patricia Verrusio M.", "What an amazing experience once again...service, atmosphere, food, wine list,  live music, caring and professional staff.  I would highly recommend BistroAix to all our family and friends for a memorable evening.  Ever evolving and fresh - check it out!"], ["Keith B.", "This really a great place. Been here several times. The ambience is low light accented with stained glass globes. Menu is well rounded and the calamari is the best.  The servers are very attentive and knowledgeable of the entire menu/wine list. If you're from out of town I'm a local and recommend Bistro Aix."], ["Karen E.", "My husband & I have eaten here before for lunch and it was fabulous. This time we came on a Friday night with our 11-yr-old son. There was a large table next to us, I think 10 people that seemed to be couples. They had 2 men in their party that started out loud and only got louder. They were also cussing, dropping the \"F-bomb\" (as my son says) frequently. We complained to the waitress. Nothing. We complained again when we had to raise our voices just to speak to each other. She brought the manager over just as we finished our dinner. He moved us to another table for dessert and apologized. Nothing was said to the other table and we were not compensated for having to move. We won't be bringing our son back and not sure we'll return if they have no control over their customers."], ["Brian S.", "Consistently one of the best restaurants in Jacksonville.  Good menu good wine list and a fun place with good ambiance."], ["Mike Henry H.", "The parking around the restaurant is free valet. You have to tip the driver. The waiter suggested to get the ahi tuna entree medium rare. The fish wasn't fresh at all. The next morning I had the runs. Most likely it was because the fish was old. I ordered an muscle appetizer that was okay tasting. I wouldn't recommend this place to anyone. The prices are expensive."], ["Jen P.", "Dined with my family at Bistro Aix during the holidays. I highly recommend the escargot, and the ribeye for two. You won't be disappointed!Even better than the food though, was the service. Our server introduced himself to us as \"Joseph\". What a sharp & polite young man!  His description of the specials & menu items was so detailed. I've never had a server explain the menu like that before. He was so knowledgeable and so polite, and didn't seem to mind answering our endless questions (it was a difficult to please group).  Joseph also made us feel like we were his most important guests of the evening.  He payed attention to every single detail. From pulling out our chairs (so gentlemanly), to remembering our names. The entire group left the restaurant happy and making plans to turn this into a new holiday tradition.  Thank you, Joseph, for a wonderful dining experience!"], ["Selvira S.", "Amazing service. Great food! Sometimes the music can get bit too loud but it's very beautiful. It's wonderful for romantic dates."], ["Susan W.", "Probably one of the best meals my husband and I have had since wintering in this area three years ago. The lamb shank was superb, and what was even more outstanding were the accompanying vegetables and polenta. Finally a Caesar salad dressing that was just the right amount of lemon ie( lemony) Expensive, but worth it."]], "Magnificat Café": [["Rowena B.", "Great quiche!  Sandwiches were kid friendly and atmosphere was no frills."], ["Leslie B.", "Eat the quiche here. It's amazing. They always have a special of the day that doesn't disappoint! Today was bacon and brie and it was phenomenal. The potato salad is good too and the pasta salad is eh but the quiche is what you're there for. Wraps and sandwiches look good and are probably a healthier option but if you are looking for a decadent slice of authentic French quiche, this is the place for you! Run by a very friendly husband-wife team which makes for a very enjoyable lunch. Order at the counter and they'll call your number when the food is ready. They have both bottled and fountain drinks. Expect to spend about $10 on a generous slice of quiche, a side, and a drink."], ["Ryan H.", "Awesome little cafe. I've had numerous sandwichs here and haven't been disappointed yet. Really good. Fresh ingredients prepared to order. The pasta salad is really good too. A lot of neat things to try here. The outside sitting area is really nice as well on a sunny day. You can people watch and enjoy the FL weather."], ["Mandie M.", "I don't eat at Magnificat often, but when I do, there's usually only one thing that I order. You know when you go to a place and you just get stuck on a menu item, and no matter how hard you try, you can't help but keep getting it? This is how I feel about Magnificat's Curry Chicken Salad. I have tried other menu items, but this is my go-to at this business. They serve it with no bread, but with lettuce and tomato. The lettuce is cut so that you can essentially make a small lettuce wrap with the chicken salad. If you have gone to Cozy Tea and had their Curry Chicken Salad, it is very close to Magnificat's. Each place makes it just a tad different.   Normally, I get my food to go, but Magnificat has a fantastic location on Laura Street with the greatest covered patio. It's perfect on spring or fall days with a nice breeze. It is also a great place to people watch during Art Walk. This French cafe's typical hours are during the Downtown lunch rush. Don't go Downtown on a night other than Art Walk and expect it to be open."], ["Marty T.", "I have to give this place only two stars because, those of you that know me, know that if a restaurant advertises a (self-proclaimed) \"best in the city\" dish, they had better blow me away with their claim...So, being new to downtown Jax, I am still in search of a great burger, downtown.  When I found this place online and read that they claim to have the \"best burger in Jacksonville\", obviously I was excited to try one.  They also had some other interesting sandwiches on the menu too so my girlfriend would have something new to choose from as well.I looked at the menu and read \"half pound certified angus\" so I called to order and after ordering the burger, I was not asked how I wanted it cooked.  So, I asked were the burgers cooked to order or how are they prepared?  The response was (and this was my first red flag) \"well by law, we are only allowed to cook it no less than medium\".  Well suffice to say, being a certified food manager, I know the law and if you are advertising certified angus, you should be able to serve it rare if that is how the customer wants it.So, those of you that like quality beef, that is the little secret to knowing if a restaurant buys quality beef.  If the quality is not high enough, that \"law\" she recited is actually true.  Not if you are claiming certified angus should this be the case.But, I ordered it anyway and thought I'd give it a shot.  Well as soon as I got it home and popped the top on the styro, I immediately thought \"yeah, this definitely doesn't look anything like some of the \"best\" burgers I've had. :(The patty was flat (not half-pound looking) and charred black, the bacon was low-quality and greasy, the best part about it was the foccacia bun.  After taking the first bite, I found the patty to be completely dry and well-done.I'm sorry but this is the largest city in the US and we're talking about one of the most popular foods known to Americans... If you are going to claim \"Best Burger in Jacksonville\"... you better serve me a badass burger! Speaking of which, where is that food truck?!"], ["Mark B.", "I do go into downtown a lot for lunch. Living out near the airport if you want some good food you have to travel. So I noticed that Folio Magazines is having a dinner here so I tried to get the jump on things. Now I stopped in and to my surprise this place wasn't very crowded beening the middle of lunch time. This place is old and the decor shows it but it is clean. Looking at the menu I decided on the quiche but they were out so I settled for a soup an sandwich. I ordered the top round beef on rye and the carrot and ginger soup. Never thinking of or imaging carrots and ginger together it was pretty good. It was very smooth and to me could have used alittle more spice. The sandwich was abundant meat and tasty to but the cumin mayo really didn't do much for me. It was an odd taste to a typically normal sandwich. So I will give it another try soon."], ["Jeanne D.", "This is a great place to get a truly authentic, simple (but delicious) French meal.  I have been here three times now and I am a fan.  The quiches are exactly like what I have had in France, tonight I had a spinach and mushroom quiche that was great.  I have tried several of their soups and they were wonderful.  My dining companion tonight had a chicken sandwich with provolone cheese, chipolte mayonnaise and cheese flavored bread and she enjoyed every bite.  This is a good place for quiches, sandwiches, salads, and soups.  They are mainly open for lunch but they are open for dinner on Art Walk nights, and tonight they were open for a club meeting.  Magnificat Cafe is right across the street from the downtown library, the Jacksonville Museum of Contemporary Art (MOCA)  and Hemming Plaza.  If you are in this area at lunch time or for Art Walk, Magnificat Cafe is worth a try, maybe you too will think it is Magnificat!"], ["Laurie D.", "Magnificat is my favorite place to eat Downtown. It is usually only open for lunch, but it is open for Art Walk. I have only been here during Art Walk and I love sitting at Magnificat's patio and people watching. I was a little confused about ordering at Magnificat, but it really is very simple. Order at the counter, where you are given a number and then when your order is ready they call your number over the intercom.  On my last visit to Magnificat I had the quiche Lorraine which tasted exactly like the quiches I had in France. I also had the French Onion Soup, which was  a little rich with the quiche.  I often yearn for a quiche and Magnificat is the best option in Jacksonville to get a truly authentic and amazing quiche, I just wish it was a little closer to my house and had a parking lot."], ["Jim H.", "I am beginning to favor Magnificat Café.As noted by others, this is mainly a weekday lunch spot, specializing in sandwiches and quiche.  I have been several times and usually get the quiche, which is good, but that's not what I had today, so I'll stick with what I did have; which was the beef and boursin sandwich, the lead item on the \"sandwich\" section of their menu.The food was good.  The sandwich, potato salad and drink all for exactly $10.38.  The bread was fresh, toasted and crunchy French roll, the beef warm and pleasant.  The potato salad was very mildly mayonnaised (can I make mayonnaise a verb here?), with very small bits of green onion.  Not sloppy or greasy - calm and controlled.  This potato salad is not \"slap-you-upside-the-head\", but rather \"I'll-stay-in-my-yard-you-stay-in-yours\".  I can respect that from a potato salad.It was cold today (50 degrees), and the Tuesday after Martin Luther King Day, which probably contributed to the light crowd - I counted about 12 other patrons at 12:19pm, with room for more; and since it was cold, no one chose the outside seating.  The crowd did not seem particularly urban-hipster or tragically-cool, but rather middle-aged, gainfully-employed, re-provisioning for the remainder of their day.  Smooth jazz on the box heightened the since of calm and Alltäglichkeit I feel in this place.If the name of the place didn't clue one in, there are certain details in the décor that provide confirmation (forgive the pun) as to the catholic nature of this lunch spot and its proprietors: the text of The Magnificat hangs on the wall next to the menus, a crucifix and holy cards have located themselves on the kitchen wall, and a purple poster invites all to an upcoming Eucharistic congress in Jacksonville.  If you are not \"high church,\" do not let any of this prevent you from enjoying lunch here (as you most certainly will), rather, pursue the policy of quiche-and-soup ecumenism offered here."], ["Julie A.", "What? No one else has come here yet?I had their Ginger and Carrot soup. Either whoever was here last time wasn't working or they finally got the hang of things, it was much more tasty this time.To go with my soup, I ordered a special. Roast beef, mozzarella cheese, tomato, on a sundried tomato baguette with tomato mayo. Delish! The baguette was toasted, perhaps a bit too much. But other than that, no complaints!Down-to-earth service with a smile as usual. I love the lady behind the counter. She's very efficient and friendly."], ["Belle C.", "This is my favorite lunch spot in downtown Jax.  I almost always get the quiche lorraine or spinach & mushroom quiche with a cup of the carrot ginger soup.  They also have a really good crab cake sandwich on a croissant, and an interesting variety of other sandwiches, wraps, and salads that always sound appealing, but I keep going back to my favorites.  Everything is fresh, homemade, and reasonably priced.  You order and pick up at the counter, and service is always friendly and efficient.  This place is a gem!"], ["Hilary L.", "French food for lunch! It's just a shame they aren't open for dinner [as it is for most of Downtown Jacksonville dining].Magnificat Cafe is a remarkably good choice of dining during the lunchtime hours, Mondays through Fridays. If you are lucky enough to work in the area, you need to be eating here at least once a month, if not more. It's unique, its authentic, still feels home cooked and comfortable... tres magnifique! Top choices:The Baked Brie lunch. You get a small wheel of brie [not too small], a toasted baguette, toasted almonds, and a side. I often opt for a side of the French Onion soup, but there are other delicious options, as well [potato salad, pasta salad, chips]. This feels very European to me... eating a loaf of tasty fresh bread and delicious cheese? Yes. And to also feel like I am European, or in Europe on vacation at the very least? That's the best of all.The salads are great, fresh, and good portions. The Goat Cheese Caeser Salad is delicious, with goat cheese patties, romaine lettuce, toasted walnuts, tomatoes, croutons and Caeser dressing. The sandwiches are pretty unique, while still remaining in the comfort zone, offering anything from Roast Beef and Boursin to a Pate Sandwich served with grain mustard and tomato on a baguette to a Crudite Sandwich served with boiled egg and pesto mayonaise on a baguette.You can't go wrong with the Magnificat. The only problem this place gives you is trying to decide what to order."], ["Joshua O.", "My wife and I were passing by and I chose this cafe based on the eclectic menu choices. The detailed descriptions where mouthwatering. I was a bit disappointed overall. I had a roast beef with Boursin cheese sand which on rye, which came with a homemade garlic mayo spread, the beef was fatty, and overpowered any other flavor to be enjoyed. The ingredients seemed fresh but the sand which tasted only of the fatty beef. I had a homemade pasta salad as my side, which was oil based and with poppy seeds, and was rather delicious. My wife opted for the crab cake melt, as per the recommendation of the counter clerk. It was wretched, even though it was smothered in cheese tucked in a pita, it smelled violently like bad fish. My wife still committed, took a bite and it tasted even worse. I can no longer eat shellfish but never have I smelled \"fishy\" crab cakes. If we had not been on a schedule I would have insisted on another sandwich for her. She did enjoy her ceased salad and the dressing looked homemade and was tasty. There were some positives but overall the experience wasn't worth our time, or money. The cafe itself is quaint and tidy, had soothing tunes playing that inspired a pleasant mood. We ate inside which we thought was going to be cooler, however it wasn't. We may try again but in no rush."], ["Sean C.", "I've past this place a million times and always wondered what it was since it was always closed. When I finally discovered it was a french cafe and only open for lunch my gf and I went to check it out. I really wish I had checked it out sooner cause its awesome! The prices are good (all your typical lunch stuff is under 10 dollars) and the food is great. There is usually little to no line so you'll get your food pretty quick too. So far I have tried the quiche Lorraine and the Ham and Goat Cheese Melt. Both of these were super good. It sucks this place is only open for lunch during the Weekday as it makes it hard to visit, but if you can find the time, or work near downtown def try to make a visit sometime as this is a great little Jacksonville secret!"], ["Jacqueline R.", "It is cute but the staff is not too helpful.  The quiche was not properly cooked,  The lentil soup was good.  The hamburger my friend ordered was not great either.  I would give it two and a half if i could."], ["Amy D.", "J'adore le Magnificat Café!!! Translation: I love Magnificat Café!!! Their chicken salad croissant sandwich is amazing!!!"]], "Uptown Kitchen & Bar": [["Joy B.", "We had such a short amount of time to find a place to have my son's baptism brunch. It was Labor Day Sunday and everyone was off and the priest was avail to do the baptism. Trouble was finding a place on such short notice to accommodate 25 of us. Half the family was drivinging from the Southside to the Westside for the baptism. We decided on downtown,San Marco,Riverside or Avondale  to go after to eat. Trouble was finding a place. I emailed Uptown Kitchen and Bar and received a response quickly. The manager Chris said Sundays brunch are their busiest times but they would hold seats for us when it was our time. I suggested 12:30. I know primetime for any place. We are majority Filipino so of course we run on Filipino time. I told everyone that we must leave at 12. Chris said they would hold the seats but if we came late they would try there best to keep them. We got there on time and everyone got sat right away in our party. I have not been here to eat in years like 6 years. This place got a make over. It looks great. They have a bar now with a chalkboard wall. I love that no matter how trendy it is. We had the best servers. Shirley and Marleene. Super super sweet and attentive. Our orders got put in quickly. Our food came out fast and everyone was happy. I asked my family how the food was and not one bad thing was said. Everyone truly enjoyed their food. I had about 5 mimosas and it was refreshing and tasty. Majority of my family got the steak and eggs and they went on about how good it was. I so appreciate how they were able to accommodate my family for my son's baptism brunch on short short notice. Every other place I called just could not accommodate us. I get it I was expecting it. Yet Uptown went above and beyond and I am so grateful for it. All I wanted was a stress free time short sweet with some good comfort food. Oh yes my family did have a few beers and drinks. Thank you Uptown and everyone that helped make our son's baptism brunch a great time."], ["Heather K.", "Unfortunately I have to give Uptown 4 out of 5 stars. The good: fantastic grill cheese sandwich, awesome salad, and friendly staff.The bad: We were very slow to get our food. My husband got the burger, while it was good his fries were undesirable. They were the frozen type but what was strange someone else from my table order hand cut fries. They were very good. Why could you not use the hand cut fries as a side with your food and just eliminate the regular fries? It's very confusing."], ["Kim C.", "I thought I had already written a review on Uptown, but after talking to someone who was on the fence about giving them a try based on Yelp reviews, I realized I hadn't.I have been to Uptown Kitchen several times, and have always enjoyed my meal. I have only been for brunch, and hope to try dinner soon, but back to the brunch deliciousness! My most recent meal was a pimento cheese stuffed omelet with spinach, a side of gouda cheese grits and sourdough toast. I am not a fan of pimento cheese, but we were sitting at the bar watching it being made so I asked to try it. It was so creamy and yummy! The waitress said I could get it in my omelette so I did. I get the gouda cheese grits every time I go: they are that good. I've never met an avocado I didn't love and the avocado olive oil toast topped with egg and tomatoes is the bomb. Simple combination, but oh so good. The kitchen is open so I see the food being prepared and delivered when I sit at the bar. I've never tried the chicken and waffles, but they serve a lot and the plates are always overflowing with food. If you are looking for an awesome brunch spot, check Uptown Kitchen & Bar out!"], ["Morgan H.", "I have had Uptown Kitchen on my radar for a while now and was so glad to finally have a chance to check it out for lunch. After perusing the menu online I knew exactly what I was going to order when I got there. I was surprised at how easy it was so find the place b/c in all honesty one of the reasons I had never checked it out was b/c I'm not super familiar with the downtown area. Anyways, since I was by myself I opted to sit at the counter where I had a nice view of the kitchen. Everything seemed to run smoothly and orders were getting out quick. I selected the Fried Green Tomato BLT with fries. I was surprised by how big the sandwich was when it arrived and actually feared I wouldn't be able to hold it like a sandwich to eat it. But sure enough they know what they are doing at Uptown because it was perfect. Everything from the pimento cheese, the fresh bacon and bread and the 2 slices of perfectly fried green tomato....yum, just yum. I'm excited to come back and try their dinner now with my husband for a date night b/c I'm sure it'll be nice and just as enjoyable."], ["Brittany W.", "Amaze balls!!!! That's all I have to say...you must go and enjoy this heaven sent blessing!"], ["Michelle M.", "Revamped menu and renovated dining area. Uptown is much more than it's original incarnation.   The breakfast menu has expanded. My farmer's biscuit with fried green tomato, spinach and cheese was a vegetarian dream. The tang of the tomato was enhanced by the flaky buttered and grilled biscuit, the spinach was a glazed bright green cooked just enough to retain all those healthy vitamins without being raw. Although Uptown has changed drastically, they were still happy to dish up an old favorite that wasn't in the new menu for my daughter. Bacon, egg and cheese on ciabiatta bread with a crispy side of hash browns. It's the personal touch that always keeps us coming back. And the food--the food is the major reason we are repeat customers.If you haven't been to Uptown within the last two weeks, come on down and see for yourself what's up in Historic Springfield."], ["Jay M.", "The following review was published under my byline in the Florida Times-Union on Saturday, June 13, 2015. This is an original, unabridged version of that review.If you are a visitor to Springfield, the name Uptown Market might lead you to thoughts of an urban bazaar. Perhaps a farmer's market. Certainly not a spot for sophisticated, sit-down style foods.In March, the owners of the well-known breakfast-and-lunch destination finally set the record straight. Uptown not only got a name change, but an upgrade to dinner six nights a week, along with full-bar service.These days, Uptown Kitchen & Bar keeps the lights on late--until 11 p.m. three nights a week--with nine dinner plates ($12-22) and a well-manicured rundown of happy hour specials. The former deli counter has been repurposed as an urban-chic bar flanked by track lighting, flat-screens and a lineup of bottles that means business.The theme of Uptown's kitchen creations is classic Americana with some enticing streaks of fusion. While Southern influences figure prominently, as well as vegan and vegetarian plates, flavors are generally all over the map.We dived in to the Starters & Bar Snacks menu, for which some selections earn a small discount weekdays from 3 to 7 p.m. With the Fried Green Tomatoes ($5), you get four thick-cut, flavorful discs with a light breading and a tangy side of comeback sauce. While our server swore secrecy about its ingredients, a mild horseradish note was apparent yet not overbearing.The Pork Belly and Pickles ($6) gives you a square slab of barbecue-braised (of spoon-splicing quality) pork belly atop smoke Gouda cheese grits, flanked by a handful of old-world deli dill pickles. While you have a single belly to fight over, the creamy, buttery Gouda grits are the stars of this plate. On first blush, my friend called them mashed potatoes. Where I come from, that's solid compliment territory.We rolled on to entrees. I took a chance on the Veal Ricotta Meatballs ($15), which mercifully got tangled up with some delightfully dense bucatini pasta--spaghetti noodles on steroids--and zesty arrabbiata sauce. The pasta base was a great foil for the mild-mannered meatballs on top.My friend called up the Turkey Burger ($9), an expertly grilled, excellent red meat alternative with provolone, avocado and all the fixings. What makes this plate great is the fact you can upgrade your side for $3, from fries to Uptown's bubbling, gooey mac and cheese (available a la carte, $6). Make no mistake: unless you're a chronic calorie counter, you'll want to do this.Uptown won't wow you with visions of sugar-coated delights in a display case. Baker Ted whips up a limited menu of sweets that you'll find on the chalkboard against the far wall. In my world, there is not much better than a warm brownie paired with vanilla ice cream. Uptown's version ($3.50) is a humble horizontal arrangement, just sweet enough for one. My friend's Pecan Pie à la Mode ($5.95) was a rocky nut- and sugar-studded wedge of decadence that the sweet tooth-afflicted should not miss.Uptown's standard happy hour brings weekday specials from 3 to 7 p.m., including dollar-off draft and canned beers and wine, $4 well and $5 call liquor. Candoo Tuesdays roll from 7 to close with $2 domestic canned beer and $3 imports and crafts. WineDown Wednesdays keep the same timeline and bring $4 house red and white glasses.Since Uptown cut its teeth on early-day dining, the lunch scene here is mature. You'll find a variety of burgers, sandwiches, and salads. Five lunch specials (typically $11-13) change daily, and each weekday claims its own recurring lunch special, such as Taco Tuesday and Jamaican Jerk Chicken Wednesday.Uptown serves up a diverse menu of standards with flashes of flair that will please a variety of tastes at a reasonable budget. That's not a tall order for this very capable kitchen.Uptown Kitchen & Bar1303 North Main Street, Springfield(904) 355-0734UptownMarketJax.comType of cuisine: Modern American FusionHours of operation: Monday - Wednesday, 7 a.m. to 10 p.m.; Thursday and Friday, 7 a.m. to 11 p.m.; Saturday, 8 a.m. to 11 p.m.; Sunday, 8 a.m. to 3 p.m.Credit cards: All major acceptedBar service: Full barChildren's menu: YesReservations accepted: NoCatering: YesPrice range: Starters and bar snacks, $5-10; salads, burgers and sandwiches, $6-14; dinner plates, $12-22"], ["Brian S.", "This is a great spot!  I have a good friend who just bought a house nearby, so we walked over for a late dinner, then I came back the next day for lunch.  Good decision both times.The food (steak frites, then the Cuban) were both delicious.  The service was top notch, and the wine list (while mostly low price options) contained a couple of winners that were budget friendly.I will be back whenever I am nearby, and you should do the same!"], ["Amy S.", "We don't get to this part of Jacksonville very often, so to come here is out of the way.  If I'm going to go out of my way to eat somewhere, then it better be darn good and Uptown Market just doesn't do the trick for me.The atmosphere and feel of the place is really nice.  It's open and laid-back.  Very comfortable.  The cronuts are down-right awesome.  Although, at $5 each (not including tax), they just aren't worth it to me.  They now sell cronuts at Epcot at WDW and with tax they are just under $5.  A cronut that's more expensive than the ones at WDW?!?!  Yea... that just doesn't add up in my mind.  I expect to be price-gouged at \"The Happiest Place on Earth.\"  I definitely do not expect it at a local downtown market & deli.The biscuits with sausage gravy were the worst I've ever had.  They sausage gravy was perfectly bland.  Absolutely no flavour.  I was very disappointed because I had heard good things about all their breakfast items.  it's a sad day when the sausage gravy on the buffet at the nearest Golden Corral is better.  Service was also \"meh.\"  She was nice, but we rarely saw her.  Never did get a refill on my drink.  I hear there are other great things on the menu, but after this poor visit, it's safe to say I will not be returning."], ["Maya C.", "I hadn't been back here since the name and menu change and since my last review was not all that good, I wanted to go back especially since my fellow Yelpers told me that it is much better now.It was late when we got out of a Friday night's Suns game and my mother and I were hungry. I suggested we go here since they were still open and convinced Mom that it'll be good. We drove up Main St. and I found the place easily again. Didn't look too busy as I could see that a few tables were occupied but the bar area was full. We parked along the street and walked in. Kristian (I believe?) greeted us warmly and told use we could sit anywhere and came over with menus. Looking over it, some items stayed the same while others were gone. The first thing that caught my eye was the Deviled Eggs and Ham. I love deviled eggs and while I went back and forth over ordering them so late I ordered them anyway since I knew my mother would help me eat them. It looked fantastic when it came out. Four deviled eyes with deviled ham in the middle and piled up. One bite and I was impressed. The eggs themselves tasted farm-fresh and the filling was just right. I never had deviled ham before but I likened it to ham put in a food processor with some mayo I think. I ate this with the eggs and closed my eyes. I was really enjoying it. Mom enjoyed just the egg as she doesn't eat ham. For our entrees, She got a turkey burger while I got the Trout a la Plancha, Trout with succotash, carrots, and corn in a cream sauce with fingerling potatoes. OMG! I was in heaven! The veggies and the cream sauce made that dish and paired with the fish made up for the seasonings one would expect. We both decided on dessert so we ate half of our entrees and boxed up the rest. I saw on their chalkboard Blueberry Shortcake and I knew I was getting that immediately. The shortcake was about the size of a jumbo Grands biscuit with homemade-like whipped cream and blueberries in blueberry sauce. Love, love, love this shortcake. I believe that this was the best shortcake I've ever had. My mother got the Lemon Pound Cake and she liked it. I got a taste of it and it was phenomenal. We both ate all of our desserts. Kristian kept us laughing and was very attentive all the way up until it was time for us to leave. I'm glad I returned here to experience how different it is and now, I will definitely return again."], ["Tiffany K.", "I would give it 1 stars but I feel like thats extreme and I also take 1 star reviews not very seriously. So that said, I want you to take this review seriously because it seems on par with the most recent passive review also.I would not come back to this restaurants. The portions served was not filling. I got a (small) chicken pot pie with rubber chicken meat inside for $13. The KFC chicken pot pie is actually more filling than theirs with tender pieces of chicken.There was a bug on my friend's salad and the server was very slow to offer to replace it (she didn't even believe him..). The service and food was lacking for the price point. I feel like I paid just as much as I would at BlackSheep and BlackSheep tastes way better than this place. (Everyone's food was just not good either, except for the fries bc it seems like they just deep fried it out of a bag. We ordered more and they over cooked the second order... how?? Where's quality control for the food?)The service was also very slow, it seems like our server would rather chit chat with other people than serve us. There were 2 other tables and a few at the bar, so I don't see why it took 5 minutes for her to bring us our waters. I can see why it's empty for dinner. I'm just really disappointed because one of my friends raved about this place."], ["Jack B.", "I really want this place to survive and thrive, but I feel that they are maybe not focusing on the clientele in the area and playing to the people in Springfield. They seem to be trying to be more like other parts of town and it would be nice to see more items that were fresh and catered to the people and lives of those in Springfield. I can eat in Avondale or Riverside or San Marco and I know what to expect. Ordering similar items at Uptown Kitchen and bar, I was disappointed. The food was OK, but the portions were smaller and the presentation was really lacking. Great beer selection, and I know that the new management will turn this around and make it better. The managers have winning solutions in other parts of the city, so I am confident they will turn it around, but they need to make sure that the existing staff take care of the basics. Clean the counters, add some panache to a burger and fries, give me something more than I can get elsewhere in Jacksonville, make this place more memorable. Again, great beer selection and the owners/managers are there to listen to your needs, but I think the new outside managers can add additional ways of looking at solutions to make the place even better. We attended Saturday night at 9 and the place was almost dead, except for a few tables and a few patrons at the bar. Other places around town would have been packed. I hope they make it!"], ["Lisa S.", "I love the new addition of the Uptown Market & Bar. The bar offers a variety of local brews as well as full liquor. The bartenders, Mike & Matt, make sitting at the bar an enjoyable experience. The new menu offers some very delicious and reasonably priced sandwiches and appetizers. The cuban sandwich is one of the best sandwiches you will find anywhere and is made with pork actually cooked fresh on the premises. The po boy varies daily and I tried the fish which was also excellent. The sandwiches are served on a super-fresh roll that would make anything taste delighful. Do yourself a favor and try the gouda cheese grits. They are knock-your-socks-off amazing!"], ["Philip W.", "I've driven by this place for quite awhile and didn't realize it was open. I've been here four times now. Much to my astonishment is very excellent. I've had the smash burger twice I had the Thursday special which was bacon wrapped meatloaf which is totally to die for. And the last time I was there I had the pastrami on grilled rye. I love the homemade pickles. Of the three entrées I've had the pastrami was my least favorite. The pastrami was dried out but it was good. The smash burger was absolutely awesome and my favorite. I can't wait to try the other burger creations they have there too. This will be a regular linch spot for me and my workmates."], ["Jay C.", "Dirty stained menu, dirty table. Over priced for the quality of food and service. Not what it use to be.......... Sad really."], ["Ivy C.", "We waited 40 minutes for breakfast. When we received it, it was a poor representation of a breakfast. We ordered steak and eggs and pork belly with grits. These items do not require a lot of time to be made. The steak was cut up in 5 small pieces. Firstly, who cuts up a steak for the patron? Secondly, it looked like it was originally half of someones else's steak. It also was not that busy in the restuarant. The kitchen staff needs to tighten up. It's unfortunate that I have to write this kind of review but it was unacceptable."], ["Nick W.", "My wife and I have been coming here since Uptown Market opened, so we've had the opportunity to watch the owner/chef, Eddy Escriba, dial it in over the last few years, but NOW...They recently overhauled the whole dining room with a new look and bigger tables. They also added a full service bar to augment what looks like an amazing selection of their new dinner entrees! For locals, think Black Sheep of another color:High end entree ingredients with a moderate price point, but with a more casual, family friendly atmosphere, and a solidly different selection of dishes! With lunch 7 days a week, dinner Monday through Saturday, and a GREAT Sunday brunch, this NEEDS to be on your dining map if it isn't already!"], ["Ken P.", "I've only been to Uptown once before, but still impressed with the ambiance. Nice and casual, and on a good day, I can see how brunch outside can be an awesome time! I hear good things about brunch here, so hope to try it sometime.But tonight, came here for dinner with a group of friends. We met for drinks, then decided to stay for dinner. It didn't take long for us to be seated, so that was great. And our server was great - she answered questions about the menu and was great about keeping us informed on the status of our meals. As far as the food, we ordered the Deviled Eggs and Ham and the Pork Belly and Pickles. I tried some of the Pork Belly, which was tender and juicy. I really loved the Smoked Gouda Grits on the side. For dinner, I ordered the steak frites. Steak was cooked medium well. It was a little on the dry and tough side, however, but was still pretty tasty. The side of fries was pretty plentiful, though part of me wishes the size of the steak was proportioned more to the fries. But all in all, I left feeling full and satisfied! Will definitely stop by again. Try it out, Uptown Kitchen And Bar has something good going on!"], ["Gina R.", "If you haven't been to Uptown since their renovation you are missing out! Even as a Springfield resident I didn't formerly find a lot of reasons to go to Uptown but since their relaunch with full bar I'm there often. It's a great place to stop for drinks and the bartenders are all awesome. The new menu has a lot more good choices too. I could eat the awesome four grilled cheese sandwich every single day. Brunch is always a winner there too. Absolutely fantastic!"], ["Rodney M.", "Not as good for breakfast as it used to be, had the special, 2 dried up Canadian bacon, a bland banger, 2 eggs a tomato wedge cut in half, a couple of mushrooms, a spot of beans.  I'll stick to my bagel with smoked salmon next time!"]], "Fionn Maccool's": [], "The Blind Rabbit": [["Jenny R.", "I've been here lots of times with friends when we want a good beer and whiskey selection and great bar food. If you want to come here on a weekend, make a reservation. This is a popular spot and you'll have to wait an hour for a table. They have a good variety of craft beers, lots of different whiskeys to choose from and you can even get a flight of whiskeys if you can't make up your mind. With all this alcohol that is offered, there have been a few times I may have had too many but the staff is always so friendly and helpful. Their customer service is great, they're knowledgeable on their menu and are accommodating when they can be. My favorite menu item is their shrimp and grits. I love their peach habanero sauce, it's spicy, so beware if you have a low tolerance for spicy foods. I don't like grits but their goat cheese grits are delicious. My husband loves their burgers. They are pretty delicious and unique. This is the place we go when we want a burger. I've also had their fries, gorgonzola chips and poutine. The fries and poutine were ok, I like my fries to have more potato and their fries are lacking in that department. The gorgonzola chips were surprisingly tasty."], ["Pamela D.", "FINALLY writing my review for one of the best places in Jax to grab a burger! Time and time again I come to Blind Rabbit when I'm in the mood for a speakeasy style drink with a deliciously terrible-for-my-heart burger filled with creativity. Favorites include the Southern and the BBQ burgers.  All are huge,  and paired with a root or carbalicious side, you better have a huge appetite or be ready to take something home. Comfort foods mac n cheese, grits and house made chips are consistently excellent and a decent portion. I usually sit at the bar, which is always tended by a wonderful to look at and pleasant person.  Because of the heaviness of this cuisine,  I only visit when I'm mentally prepared to have some pretty serious comfort food with no regrets and plenty of time (food takes quite long to come out,  so enjoy the atmosphere and your stiff drink). They have started doing brunch here; maybe I'll check that out some time to switch things up. We'll see. Either way: Blind Rabbit is on my top burgers of Jax list and is worth its bite."], ["Kyle W.", "Always a great meal, but the experience is so much more than food. Great atmosphere, great people, the whiskey selection is legit. The specials are always so hard to pass up. Their shakes are top notch; thick and packed with flavor.    They support the local art community; a Shaun Thurston mural adorns the exterior of the building and there is a revolving installation of local art on the interior walls.    I have been a fan since they were rolling the city in their food truck and I will continue to patronize the place in until they kick me out.    The world could use more places that make you feel so at home."], ["Joe K.", "Thank you fellow Yelpers. I followed your reviews to the Blind Rabbit and was very pleased with the experience. I had the southern burger with southern potato salad and an I-10 to wash it all down. This is a good amount of food for the price so arrive hungry. This amazing burger was one of the best I've ever had in my life (and I've tried a lot of them). It's adventurous and surprising and a perfection of different flavors. It had a fried green tomato, Creole pimento cheese, peach habanero hot sauce, arugula, georgia cane syrup and pickled okra on a brioche bun. It's amazing.  The southern potato salad was light and the flavors were creamy and delicious. I can't wait to return to try their other dishes. This is my new favorite place."], ["Hayley B.", "Stopped in today for lunch. Delicious burger! Excellent drink options (beer and cocktails!) and service was good. Highly recommend the burger with a fried egg on top, and the Mac n cheese is amazing!"], ["Kelly H.", "This is a really awesome local spot!  Heather was our waitress and she was absolutely awesome!  Super nice and helpful, attentive and put up with our indecisive table!  I had the Holick burger with mac and cheese on the side.  I ordered it medium, but it came out more on the medium rare side which was the only complaint I had about the burger.  It's an extremely messy and delicious burger.  It had pork belly, arugula, tomato, over easy egg and lemon aioli on it.  The mac and cheese was really good with the panko breadcrumbs on top that added a nice salty crunch.  I tried some of my sisters french fries which are handcut and those were very good along with the garlic aioli she got on the side to dip them in.  For dessert I had the s'mores milkshake, which tasted more like peanut butter than a s'more, but it was still really good and came with a marshmellow and brownie on top and spiked with moonshine!  They have a really awesome happy hour for beer, which is what I was drinking.  All of their beers on their draft menu were $3.00.  Great selection to choose from ranging from lagers to pale ales to IPAs to stouts.  I will definitely be coming back here when in the area again!"], ["Nicole C.", "I'd heard good things about The Blind Rabbit from a friend who'd visited previously, so I was excited to have a chance to try it while in town for a Jaguars game. The concept of the place is great. The execution was a different story. The place was decently full for Sunday brunch. Our waitress brought waters and took our drink menu. Two of us decided to go for the spiked milkshakes (what a cool idea!), and the third ordered a cocktail. And then...we waited. And waited. My friend's cocktail came out in a glass with lip prints on it and she had to send it back. The milkshakes were still nowhere in sight. Then, 2 came out at once. But not one for each of us...The server explained theyd messed up in the kitchen and 1 of the milkshakes had no alcohol and the other had 2 shots. And it was our mission to figure it out. And left them both on the table. My milkshake...still MIA. In the meantime, our food had come out. My friend wasn't blown away by her waffle. Being a natural born Canadian, I wanted to love the brunch poutine, but it was just okay. Entirely too salty for my liking. My milkshake finally came out and the candied bacon on it was delicious but the rest of it didn't have me dancing in my seat. The other milkshake, which, in all honesty we couldn't figure out which had alcohol and which didn't, was left mostly untouched. The shining star of the meal were the waffle sausages, which I'm sad I didn't order myself!Slow service, mediocre food, disappointing milkshakes. I'm not sure I'd return next time I'm in the area!"], ["James F.", "Best bourbon list I have seen outside of Louisville. Highly recommended for just that. The food came out all at once, for a party of 6, which is a rare feat these days. Happy hour specials on beer, wine, and well liquor until 7 are a plus. I ordered fried green tomatoes for an app, and the Southern Burger for my entree, including pimento cheese and a fried green tomato. The breading on the tomato was crispy and delicious, adding a nice texture. The burger came out just right temp-wise. Service was adequate for a 4-5 star rating, multiple refills on water when needed, information and attentiveness above average. I'm not a fan of the TVs playing various sports. It doesn't jive with the ambience. Highly recommended location. Good beer, amazing liquor options, food was delicious."], ["Meredith C.", "Slightly embarrassing, but it speaks volumes about this place. I have been here 3 times in a little over a week. It's that good. Yes, it gets busy. Patience is a virtue and you should learn to have it if you want to enjoy amazing food. Honestly, the wait for food isn't even long. The servers for the most part are amazing-some are new and still learning so take that into consideration before you get frustrated. The chefs are inventive and absolute geniuses. I've had the Whiskey Smoked Burger, the Out and In, a bite or two of the Basic Boo and today I had the Steak and Eggs for brunch with a large St. Germaine carafe. I have no complaints. The Steak and Eggs were so beautifully plated I didn't even want to take my knife and fork to them. We sat at the bar and it has been my best experience yet. Anna was so pleasant and knowledgable, I'd be glad to sit there every time. If they have specials while you are in there I highly suggest ordering them. I almost didn't and I would be in taste bud purgatory if I hadn't.  Give them a shot and don't forget to tip the hard working patrons well. This is my new favorite spot in Jax and it isn't even close by.PS be sure to get a side of creole aioli for your fries!"], ["Keith J.", "This place serves FOOD, not health food, so if the thought of eating real food, turns your stomach or you have a weak heart, be warned...DO NOT READ ANY FURTHER!!!This was one of our many trips to JAX. My SO, myself and her girlfriend were in town for a weekend of fun. The night before, Friday, we were out late and we didn't get back to our room and to bed until around 4 a.m. We were up by 9 a.m. and promptly ordered breakfast to our room. Fell back to sleep for a few hours, woke up, started drinking again and spent the afternoon at the pool. Around 4 p.m. we all realized we were STARVING.  It didn't help the pool was right outside Ruth's Chris, which wouldn't be open for hours.I suggested we go tear into some juicy burgers and some whiskey. So we end up at the Blind Rabbit. This was my 3rd time here and I previously came here with a couple of friends and had drinks and dinner at the bar.  The place was always busy, so on this trip I made reservations. We arrived a few minutes before our reserved time were promptly seated. I ordered a High West Double Rye.  highwest.com/spirits/dou…. My SO took a sip, which is dangerous, because Jack Daniels tends to turn her into a Jackass, but a fun one...most of the time. She commented...\"That's some potent shit!!  I'm going to stick to my double shot of house vodka\"....puke!!  Well, even though I value her opinion, my High West was potent, but very good. Way better than any rot gut house vodka. Her GF had a Blackberry Lemonade, which my SO and I got to sample. They both loved it, I stuck with my whiskey.theblindrabbitwhiskeybar…For an App, we started with the Cast-Iron-Mac and Cheese. We were so hungry, we completely DEVOURED this dish is short order. Please reference the for mentioned day of drinking  and not eating. It was good and cheesy. We all commented we were hoping it would have been baked and have a layer of slightly burnt/crisp cheese on top. Even though it did not, we would all get this again. theblindrabbitwhiskeybar…For dinner, my SO had the Blues Burger, with fries her GF had the Helick Burger  with asparagus and carrots...she's kind of  health nut and I had the only burger I've ever had here...the Whiskey Burger with tobacco onions. Are you catching on? I like whiskey.Her GF thoroughly enjoyed her burger. We had to take her word for it, because neither of us got to sample it. My SO took a few bites of her Blues Burger and commented \"wow this really has a shit ton of blue cheese on it\".  My burger was perfect as it has always been. I got two bites and offered my SO a bite...I never got my burger back and quickly noticed her burger on my plate!! It was okay, because it brought happiness to her and that meant we would all be happy... :)I have to agree, her burger, well now my burger, had more blue cheese than necessary. If you really like blue cheese, then order this burger, if you only kinda of like blue cheese, say like in a dressing for dipping celery in at your favorite wing bar, then I would say to stay away from this burger.All I can say is try this place...great food and atmosphere!!!!!"], ["Tara B.", "I had a burger that was perfectly crafted to a medium temp. Beyond anything I could imagine there was a messy good time and the flavors a danced upon my tongue. The was so much I could only eat half. I will definitely be back."], ["Vanessa T.", "Went here for a tasting dinner with foodie adventures,  so got to try an assortment of things (6 course! )  the restaurant itself is very hip and modern, cool place to come chill. Now the food!: Fried green tomatoes - fried with crispy crust had a peach habanero sauce on plate sprinkled with goat cheese and corn tomato relish... Delicious,  great dish,  love the combo sweet,  spicy, salty,  crunchy Pork and fries-their take on fish and chips but with pork  belly... No just not my thing... To me a piece of pork fat that was battered and fried.... I just can't do it... Fries were however house cut and goodShrimp and grits - goat cheese grits,  plump shrimp,  with a sweet/spicy cream sauce,  with peppers and sausage..... Great flavors!! The shrimp were cooked perfectly... Loved this dishMr. Miyagi Slider - (they are known for their burgers and this did not disappoint!! ) I had never tried a burger here,  but hear they are so good!!  Kimchi  ketchup,  pickled Asian veggies... Sooo good!  It all just worked together... The patty tasted really good too.... I'll definitely come try a burger Duck empanadas - nice fried pocket of yummy,  duck,  mushrooms, onions,  sage, scallions,  served with a horseradish crema... Plated beautiful... Good flavor liked the horseradish sauce particular Cereal killer milkshake - tasted just like the sweet milk left over from your bowl of cereal.. YumGreat night and got great feel of what to come back to get more of!"], ["Ouida P.", "I really hate that it took me so long to come to the BR!! The food is DELICIOUS!! They have THE BEST fried green tomatoes I have ever had . . . and I love FGT so I've had a LOT!! The burgers are masterful, the grits are decadent, the atmosphere is grown-folks-ish, and the service is superb!! I LOVE THIS PLACE!! I have nothing bad to say . . . actually, yes, I do . . . they aren't a franchise so now that I don't live in Jax, I don't have BR near my home anymore. CURSES!!!Nutshell: I wish the rabbit could see so it could find its way to me!"], ["James D.", "Okay okay. This place has reviews to make you think they've got the cure. However The Blind Rabbit lacks in a few areas. I'll go through my experience step by step and you decide. I meet up with a couple of people and we belly-up to the bar before the party arrives for dinner. We are greeted by a pretentious bartender who scolded at the fact I ordered a well whiskey at a whiskey bar. It really bothered me that he would have an attitude about that. Not only that but he also screwed messed up my friends order or \"double makers on the rocks.\" Somehow the drink ended up with cola in it? The party arrives and we are seated. We have one server who is attentive and competent.. Well so we thought. After first ordering a round of waters (took ten minutes to arrive) and then a round of drinks (another ten minutes) we ordered dinner. My friends ordered the fish tacos, a variety of burgers and I ordered the pork belly and oyster sandwich. The burgers were great and the tacos were merely ok (hey it's a burger place). The oysters on my sandwich were super breaded and salty and the pork belly was kind of dry honestly. Overall I was kind of disappointed for a $14 sandwich. At the end of the day I will say this. My friend has a friend that works at the Blind Rabbit at the beaches. His friend even said the service sucks, especially the one in Riverside. Now when your own employees think you suck, that's bad! So here's the skinny, if you want a good burger and are okay with having a two hour dinner (due to slow service) come dine here. There are plenty of other places in Jax for a burger. However if you're confined to Riverside and have no way out and are craving a burger, check it out."], ["Heather W.", "The four stars are for their burgers. Whenever I get a meat urge I come here and get the bbq bacon burger and it's never a mistake. Cons- bad music, mediocre sides and overall 30 something basic clientele"], ["Marie F.", "First time in - was not impressed with the extremely slow service. Walked in with a fairly large crowd, but less then 5 minutes later most of the bar had left. Football game was over and some guy started this weird karaoke/guitar set? I would have walked out as well if members of my party hadn't already placed drink orders. Almost 20 minutes later and the only people that had their drinks are those that had ordered beers??? As soon as everyone downed their drinks we were out. (Friday Night)Went back for their Taco Tuesday's. I ordered the rum old fashion as I looked through the menu. My eyes kept going back to the southern pork taco. The other two people in my party decided on tacos as well and we all agree - they are freaking delicious!Another Friday is Riverside and I've already decided the theme will be Burgers and Bourbon. Planned on strolling through the area, so I knew I needed to get some food in my stomach before we started are bar crawl. Of course this was our first stop and I had to get some Knob Creek in my system after our party ordered maybe 2 of each burger and the unicorn in the group ordered wings. When we see our server bring over our food our mouths started to water. We ended up cutting things in halves and quarters and creating our own little buffet of sorts. Every single burger was cooked to perfection. Beautifully seasoned and juicy. But I don't f*ck with those chips. Somehow every time I get them, I feel like I have some leftover strange mix up batch. I bit into a chip and it's regular, then a chip is awesome, then one taste like sour cream, and then another tastes like salt and vinegar? And truthfully this place makes we want to be a carnivore. The burgers are like a meal and desert. The chips are just pretty decorations for the main attraction. Whiskey Smoked Burger and Classic Cheeseburger - my two favorites. Long review from a person that has given up meat but is craving a burger."], ["Hugh P.", "Whiskey Burger is great! And everyone enjoyed their lunch. From the fried chicken salad to the fish and chips. Great choice, we will be back again."], ["Mariana M.", "There are a few dishes I strongly recommend and some that I don't recommend.The fried greed tomatoes are always a must. I like them because of the goat cheese topping and sauce. It also has a good amount of breading. The burgers are very good. I enjoyed the blues burger, because it had the perfect amount of blue cheese (not overpowering). It is also very filling. I shared half of a burger and appetizer with a friend. It was a lot! I was not  the biggest fan of the fish tacos. They were okay, but they were not outstanding. For the sauces: the curry mayo is very interesting. I would recommend it if you like curry. The dessert  is too sweet for my taste. I could not handle the milkshake nor the bread pudding in a cast iron skillet (special)."], ["Ivy Z.", "The Blind Rabbit is one of those \"perfect\" go-to spots since they have great drinks, great food, and a lot of variety (so you can either get the same thing every time, or switch it up and still be interested). The environment is the perfect excitement level: not too rowdy, but still feel like you can be comfortable and relaxed. Make a reservation if you'll be going at a busy time (Thursday/Friday/Saturday).Drinks: The blackberry lemonade was delicious with fresh blackberries. Huge whiskey menu and lot of different fun options.Food: Get their fried green tomatoes appetizer!!! They are perfectly crispy and even convinced my friend who is firmly a meat lover. Their gorgonzola chips and mac and cheese hit the spot, but did not blow me out of the world. Definitely come for a burger.I know I will be back for the environment. There's something here for everyone!"], ["Imran R.", "First time here today, service, drinks, appetizers were all excellent! New favorite spot!"], ["Alison M.", "My first visit to The Blind Rabbit was for my birthday last year, with the sole goal being to drink ALL the whiskey, a spirit I had never tried.  Of course, when I realized how expensive whiskey actually was, I dialed that goal back to \"drink an adorable four-whiskey sampler.\"  Since I didn't even know if I was going to like whiskey, I asked the server to recommend some \"tier 3\" (read: cheap!) whiskeys.  I ended up enjoying two out of four of my samples, and the rest of the table enjoyed the other two, so that's probably a win!  Someday when I have lots of dollars to spend I will venture into tiers 2 and 1.  Someday.My second visit was for a book club Sunday brunch. The service was pretty spotty for what seemed like a fairly slow time, and we feared a couple of times that we had been forgotten for orders and then for getting our actual food. Luckily we had book discussion and arguments to distract us, and when our food eventually came out the wait was totally worth it.  I had the croquette madame, which turned out to be a bunch of different breakfast foods all thrown in a pile and was very strange but also delicious.  My husband went classic with a barbecue bacon burger, which he says was quite tasty and which came with very delicious fries, some of which I may have stolen.This place is just up the street from us, so we will definitely be back in the future (without a large group!) to try even more delicious foodstuffs and, someday, those whiskeys."], ["Leah A.", "This is a gorgeous restaurant with creative libations and very tasty food.  I started with their Front Porch Iced Tea which was a tasty, refreshing concoction of top shelf whiskey, moonshine, sweet tea, lemon bitters & freshly muddled raspberry cocktail over ice to wet the appetite.  This drink was fantastic!Next up, the Poutine.  I loved this appetizer.  It was made with hand-cut fries, pork belly, tasso ham, cheese curds, and gravy.  Perfectly seasoned and not too salty.  So far, the best poutine I've had on the east coast.  I will come back just for this.A must try before you die:  The Whiskey Burger.  To me, a perfectly cooked medium rare beef burger is almost impossible to get right in most restaurants.  This place got it right the first time.  Juicy and flavorful, nice bun to beef ratio, simple toppings that did not detract from the actual burger.  Generous portion and cooked to perfection.  I would order this again.Surprisingly delightful:  The Chicken Thigh Farmer Salad - a wonderful garden of fresh greens served with egg, celery, cucumbers, grape tomatoes, white cheddar cheese, red onion, garlic croutons and black peppercorn dressing.  So much going on here, but delicious!  Their rich, marinated, lightly fried chicken thigh served atop the salad put this dish in a league of its own.  Loved it.Overall, the service was outstanding!  They have a wonderful staff that was genuinely helpful and super friendly.  The staff made great recommendations on the dishes offered and I look forward to many more visits to taste the entire menu.  5 STAR FLAVOR!"], ["Mary P.", "Loved this place! I got out of work early, so I grabbed my mom for an early dinner. Best choice ever! It gets really busy on Friday nights but if you hit this place around 5, it's one of the best places to eat. First, we were served right away and our waitress was so attentive (probably because nobody was there but us). Second, our two old fashioneds we ordered were perfect and so pretty with the ice ball. Finally the food was hot and cooked exactly as we ordered it. Has to be the best burger in town. I ordered the bbq burger-a little heavy on the sauce and toppings but they make up for it with the juiciest, flavorful burger meat. You can't go here without trying the goat cheese grits either. They have a very strong savory/sour taste that anyone who enjoys bold cheeses will appreciate. The Mac n cheese left an underwhelming note on the tongue, but it didn't diminish the overall fantastic experience!"], ["Dawn A.", "4 stars - only because our service was lousy...but the food was unique and delicious! After reading some really great reviews about this place online, I knew we had to give it a try. The one thing I was dying to try was the Gorgonzola Chips...and they did not disappoint! However, I would recommend sharing with others, because it's a quite a large portion, 4 people would be great to share. They are very rich and tasty, and go well with a mixed drink or beer! Their cocktail menu was very unique and worth the price. I ordered the blueberry lemonade cocktail, which came served in a ball jar glass. I mentioned to the waiter I wasn't a fan of the mint and they kindly did light on the mint. And my husband ordered the Old Fashioned, and he was happy with it, and also to note it was chilled with a large ball of ice (very cool).  We ordered a burger, which was tasty, however, after reading about all different sauces on the menu, like 'spicy ketchup and 'bourbon spiked creole mustard', we were saddened the waiter forgot the sauces were requested...but again the service just wasn't that great. And many times our waiter was no where in sight to help us.The overall atmosphere of the restaurant was very trendy edgy vibe and the large bar area with many bar stools with beautifully framed mirror really gave it a laid back feeling. I'd love to go back again and try something different. Also I thought it was cool they also serve milkshakes...such as the maple bacon milkshake...until next time."], ["Allie A.", "After a few visits to the Beaches location, and a few after just opening up, I headed back to the Blind Rabbit for a girls night out dinner, and it's where I found my Blind Rabbit burger redemption. I hesitated writing my review before... there were a few dishes that just didn't seem up to snuff, but after a bit of time, and my perseverance, I'm so happy I've found my jam. We started with the Gorgonzola chips, and they were amazing as usual, and a friend ordered the poutine (and it was a pleasant surprise!) This time, the fries were crispy, there was a nice amount of cheesy curds and the gravy was perfect. I ordered the Southern Burger.... and let me tell you, this is where it's at! A perfect medium rare, with spicy! pimento cheese (a super generous and tasty slather of it) house-made pickles and a pickled okra, fried green tomato and arugula. Damn. This was the perfect flavor comb: the spicy hotness from the cheese, the tangy from the FGT, a little sweet from the pickles, and the buttery pepper flavor from the arugula.... OUTSTANDING. Our server was on top of it (and got a few good laughs from our ahem, girly convos.) It's going to be really hard to order anything besides this burger for me... unless....... man it would be killer to see a bison option here!"], ["Michelle M.", "If a rabbit were to have an upscale warren, it would look like the interior of this restaurant. Earth tones and sheer gold drapes together with deep warm woods and exposed dark red rafters make for a cozy dining room. A rustic barrel serves as an occasional table and bright, fresh flowers in mason jars enlivened the space.  The ambiance was my favorite part of the Blind Rabbit.We were one of three couples there so I was surprised that the service was not more attentive. It wasn't bad, we just seemed like afterthoughts once our food was delivered. Also, during happy hour I'm accustomed  to the servers welcoming you with a little blurb letting you know what happy hour means in their neck of the woods. She seemed surprised and a bit taken aback that I asked. Look, I'm no Rockefeller so my pockets are kind of shallow, if I can save a couple of bucks, that makes my meal taste that much better.Anyhow, the petite poutine didn't look petite but I'm not complaining. It was my first experience with the whole gravy, cheese curds on fries thing and I liked it. I hadn't eaten all day, so my enthusiasm may be tainted by hunger. The gravy was warm and flavorful poured over natural cut French fries. Loved the whole crispy meets savory gravy moment. My husband's burger looked great, the buns were buttered and grilled too. I had the chowder soup bowl. It was pleasantly chunky and the ingredients weren't mushy as if they were overcooked. It was a bit on the salty side as was the poutine but it was still good.  The couple behind me were enjoying the heck out of the Gorgonzola chips. Such moaning over potatoes!! Next time, I'll order a burger and the fried green tomatoes. Maybe that will knock my socks off. In the meantime, 3 stars for service and food. It was good but saltier than I'm used to. I tend to think someone is overcompensating when a dish is salty (kind of like men who drive Hummers, huge trucks or oversized SUV's to their white collar office jobs).Despite the inattentive service, I'd go back and try different menu items. Perhaps next time we will be the couple groaning in the booth saying \"It's just. So. Gooooooood.\""], ["Jo El S.", "*stands up*    \"Hello, my name is Jo El, and I am a Blind Rabbit addict.\"I admit it, I ate at Blind Rabbit THREE times last week. I KNOW, I KNOW! But it's that good!!!! Besides having a \"Happy Hour\" that lasts nearly all day ($2.50 Drafts from 12-7!), They have the GREATEST and most innovative burgers in town! With the winning combination of brisket, short rib, and ground chuck for their patties, how is a red-blooded American (who isn't a vegetarian) supposed to resist??? I have had 3 Burgers off their menu now: *Southern Burger: The moan-worthy delicious \"Southern Burger\" comes topped with a Fried Green Tomato, Creole Pimento Cheese, Peach Habanero Hot Sauce, Arugula, Georgia Cane Syrup, and Pickled Okra on an Artisan Bun.*Whiskey Burger; Smoked Onions & Mushrooms, Smoked Gouda, Five Pepper Jelly, Artisan Bun. The mushrooms REALLY make the burger. These little \"flavor sponges\" really soak up the smoky, savory juices and add another dimension of \"Oh my GOSH this is so delicious!\"*BBQ Bacon Burger - Applewood Bacon, Provolone Cheese, Sweet BBQ Sauce, Crispy Tobacco Onions, Bourbon Spiked Creole Mustard, Brioche Bun.The Southern Burger continues to be my favorite. The crunchy and tangy fried green tomato on top of an ultra juicy burger is a perfect marriage of flavors and textures. Move over Ketchup and Mustard, we're too good for you now. The fun continues by choosing numerous sauces to try with their french fries! Having graduated from the elementary blasé Ketchup, Blind Rabbit dazzles with the sauce choices of; Curry Mayo, Spicy Ketchup, Creole Mayo, Honey Mustard, Bourbon Spiked Creole Mustard, Tartar Sauce, Peach Habanero Hot Sauce, and Bourbon BBQ Sauce.The incredible Bourbon BBQ Sauce is my PERSONAL favorite!!! It's a MUST TRY!I have also greatly enjoyed the Fried Green Tomato appetizer at the Beaches Location (see other review for details.)My favorite place to sit at the Blind Rabbit is at one of the tables built on a raised platform alongside the windows. I like the elevated VIP feeling, the window watching, and the intimacy of the two-person tables. A enormous Shaun Thurston masterpiece is painted along the outside wall. Viewers are powerless to withstand taking a photo shoot in front of this amazing backdrop! I love you Blind Rabbit. If Peewee Herman himself asked, \"If you love it so much, why don't you marry it?\"I probably would! Now to go back and try that Blues Burger!"], ["Scott C.", "Went for the brunch this Sunday.  Excellent bacon infused whiskey Bloody Mary to start - jalapeño adds a bit of morning zing.  Had deviled eggs as.a starter which were a bit too mustardy.  For the main course had pork belly and easy over eggs on grits which was very well done - the pork belly is well worth a try.  My wife had the chicken and waffles which she really liked - the waffles had a great sweet potato cream cheese dallop on them - quite good.  Try the carafe of bubbly and St. Germaine - quite refreshing.  Service was a bit slow but very entertaining."], ["Leticia C.", "Food was good. Like the atmosphere. Ordered a burger which was juicy and good. Definitely will return."], ["Nick S.", "Great great great. Delicious. Original and sublime tastebud stimulation. Delicious ways to get inebriated like old fashion and blackberry lemonade."], ["Maya C.", "Let me just start by saying this. I miss the old Blind Fig menu. Changing the name to the Blind Rabbit to match the Beaches location also meant matching the menu and that menu a lot of the really great items are no longer served anymore, including the desserts.A group of us went in on a Tuesday night and found it to be kinda dead to our surprise. No matter, that meant more attention would be on our group. Sweet. We all get settled towards the back of the restaurant and pine over the menu, comparing what's still on it and what got the axe.I got the Front Porch Iced Tea, which contains a bourbon whiskey and moonshine. I never had either let alone together so I though caution to the wind and took a swallow. SOOO GOOD! The sweet tea, raspberries, and lemon bitters made for a good drink to have on a humid summer night. A friend highly recommended the Gorgonzola chips. I've had Gorgonzola before, but all I could think of were cartoons where characters had close pins on their noses when around it, like Limburger cheese so that made me think it was pungent. It's actually not and tastes very similar to blue cheese which I like. The cheese fondue with the balsamic glaze over a mound of housemade chips was the perfect appetizer.I finally settled on the Southern Burger as it sounded the most interesting. Pickled Okra, Fried Green Tomato, Creole Pimento Cheese, Peach Habanero Hot Sauce and Georgia Cane Syrup? Bring it on! The burger was awesome but the side of Tobacco Onions left little to be desired. It was ok but it was a big pile of fried onion pieces for one person to finish. I shared some Cast Iron Mac N Cheese with a friend and both thought it was good, not as amazing as our server made it out to be, just good. I think the five cheese sauce must've sunk to the bottom. I passed on dessert as milkshakes, ice cream, and brownies didn't appeal to me.I may be back to have the Shrimp and Grits again (one item from the original menu that was kept) but I do hope that they consider bringing back some favorites."], ["Samantha K.", "The blind rabbit is great and a HUGE upgrade from the blind or salty or whatever fig. To start, both the ambiance and the service are great. At 9:30 on a Tuesday night the bartenders were still very upbeat, friendly and helpful and there was still a decent crowd which is a good sign. The drink I had---blackberry mule or something or other--delicious. The burger. Omg the burger. The southern burger. Asked for medium rare and it could not have been more perfectly cooked. The fried green tomato on top was amazing. The garlic smashed potatoes on the side were equally as amazing. Hands down best burger I've had in a while. This is my new go to--very stylish but still welcoming and affordable. Two thumbs up!"], ["Chelsey N.", "We ate the gorgonzola chips, wings, and french fries.... Are were absolutely delicious. I had the blackberry lemonade and it was also amazing. The atmosphere is great. I read reviews about slow service. Not the case. Bartender was fast and super friendly. Definitely will make the drive back here"], ["Richard P.", "I am sure we'll be going back to the Blink Rabbit pretty soon.  Recently went with wife and two friends and had a great time at this establishment.  I am originally from Vancouver, and often crave a poutine fix.  Well, the Blind Rabbit delivered.  It's not a traditional poutine, but probably one of the tastiest I've tried outside of Vancouver.  I also really enjoyed their fried green tomatoes, a dish that is quite foreign to me until I relocated down to Jacksonville.For entree, I ordered the Whiskey Smoked Burger and it was pretty darn delicious.  Wife had the Holick Burger and it was awesome.  The restaurant looked very nice, our service was superb, and the food delicious.  So we'll probably be back soon, the next time I crave a good poutine or a gourmet burger."], ["Jerry B.", "Blind rabbit is definitely a good locals spot. The atmosphere is great, espically if your going with freinds. There whiskey selection is one of if nto the bigest in jacksonville. There food is a big spread of choices. The have great burgers and a lot of other amazing foods for the gastro lovers out there to try."], ["Chloe F.", "The stars are for the food. Amazing food, no doubt. When you go you need to ask for Ashley or Kevin, or the bartender Anna. But it's defiantly worth it, the food is amaze"], ["Samantha M.", "I am loving this spot now that they have changed names/menus. The food is delish, the service is attentive, and the cocktails are refreshing. I have tried the fried chicken salad-it's a winner. The chowder is filling and a great start to a meal. Also, if you get fries with your burger or sandwich, you get a TON. It gets crowded on the weekends for dinner. Luckily they notify you by text if you are waiting, so you can head down the street to window shop or get a drink at a local bar while you wait. I was kinda ho-hum about this place when they were the Blind Fig, but whatever they have done since the change to the Blind Rabbit is working well! It's one of my preferred dinner options on the weekends and a great place to get a decent drink. It's definitely worth a visit with a date or with friends. You're sure to have a good time and enjoy your eats in the process. Five stars."], ["Martha G.", "I have been twice to this location and both times I've had a great experience. The food and service have been top notch, and the atmosphere has been very conducive to a group gathering to enjoy food and have fun. I have had the Smokehouse Rib Eye Steak with garlic mashed potatoes, roasted grape tomatoes, crispy tobacco onions, and blackberry hot sauce; and the Southern Burger. Everything has been flavorful and absolutely delicious. This eatery needs to be on your \"MUST\" list."], ["Natasha D.", "I've been to this location once. It's ok. For a newer place it smells of bar rot already. I was in the industry for a long time and recognize that odor. It was 3pm on a Thursday and I was just doing a little exploring in the area. There was a yelp review that stated there was a happy hour until 7. Which wasn't the case. My well vodka was $5.25 and was terrible. The bartender seemed annoyed to even be waiting on me. Until I paid. Then she was chipper. I'm sure it's fun to gather with a group of friends. It was an odd time. I haven't had their food. But compared to the beach location, this place is nowhere near as good. The service at the beach is 10 times better. Again, I've only been once and maybe the timing was off. I may go again with a group of friends."], ["Eric M.", "Visited here on July 3rd and ordered the Number One Classic Cheeseburger and bowl of Crab & Corn Chowder. Let's start with the burger first. The burger was cooked to perfection. The thick patty was juicy and had an amazing flavor. It was well worth the $10. That's were the game ended. The crab and corn chowder needed something... like an overhaul. I'm not sure what went wrong here but the flavor was just lacking completely. So, zero stars for the chowder. I should have complained, but didn't. I guess the burger had me under a spell.Wait staff was helpful but not overly friendly. I would return for the burger or something new."], ["Jim C.", "We stopped in to try the Southern Burger which is trimmed with fried green tomato, pimento cheese, peach habanero sauce and okra pickles.  Side order choice was bourbon flavored mashed sweet potato.  The burger flavors just didn't blend for me.  Service was very good and I will give it another try."], ["Byron R.", "Hands down best burger ever!  Cooked perfectly and the sides were great.  Tremendous whiskey selection as well."], ["Jessica L.", "Maybe when we came it was a bad night but the service here is pretty horrible! The spiked milkshakes are amazing but the service ruined it for me. It took our waitress 20 minutes to come serve us then 30 to get our appetizers and drinks.I will most likely give this place a second chance because I loved my milkshake but probably not anytime soon."], ["Brett N.", "Why 4 stars? Because this was a solid post-game spot.   ---   ---   ---Ok, so I'll admit: I wasn't in the most cheerful of moods for my visit here. I drove up to Jax from Tampa during the wee hours of the morning, expecting to see a Browns win. Unfortunately, we not only lost, but were destroyed by the winless Jaguars, who as of this writing, have yet to win another game. Sigh.That being said, it's tough to mess up a burger with BBQ sauce and bacon on it, and the Blind Rabbit's was version was squarely in the 4-star range for me: not the best ever, but above average.The unfortunate part of our experience was that our server seemed to be fairly annoyed with our existence when we arrived. By the end of the meal, she'd had a change of heart and was friendly, but I'm not sure what her issue was early on. Maybe she too was a Browns fan? If that's the case, I can't blame her.The peach milkshake photos looked amazing, but unfortunately they were all out of peach. Damn you produce orderer!!Thanks Blind Rabbit... by the way, I left some tears on your floor when no one was looking. You can't lose to Blake Bortles. You just can't."], ["David P.", "Always been a HUGE Blind Rabbit Fan! Have eaten at the Beach and King St Locations, and eaten many of the burgers and other menu items! Unfortunately, far too often, including last visit, I left feeling disappointed and robbed. We went in for the Sunday Brunch and I ordered the Southern Breakfast, which included a variety of breakfast staples. When I recieved my food, the breakfast potatoes were luke warm at best, the grits were ice cold, along with the biscuit with gravy which was cool and rock hard, as if it was stale. I was hungry enough to where I ate some of it until I decided enough was enough and mentioned to my waitress, Ashley, who was extremely nice and friendly and good at her job, and tried to fix the issue. Ashley immediately brought me out another biscuit and gravy and order or grits, the biscuit being a little warmer while the grits were still ice cold. I felt like I was robbed for having to pay for cold food but Ashley did do a great job as waitress by at least trying. I have eaten the burgers plenty of times and absolutely love them! Stay away from the Goat Cheese Grits and stick to the burgers and you'll be just fine! I wish I could give more stars, but after the last couple experiences, I cannot give more than 3."], ["Amy R.", "What a great experience!  Don't let the surrounding neighborhoods fool you - this place is a diamond in the rough.  I don't like tomatoes but tried the fried green tomatoes because everyone else raved about them.  They were awesome!  The housemade peach habanero sauce is killer!  I also had the gorgonzola chips, which were fabulous.  Definitely recommend visiting this place if you're in the area."], ["Jon F.", "Pretty good, I had the fried green tomatoes, shrimp and grits and the brownie dessert. The grits were cooked perfect and the shrimp were big. The peach habenero sauce was great. The brownie was terrible.... Very dry and almost no ice cream on it. My friend had the cuban and it wasn't very good either."], ["Mike D.", "Great food and a cool atmosphre."], ["Adriana H.", "Hands down my favorite place to get a whiskey cocktail or to try a new whisky on the rocks. As far as good goes you can't go wrong but I love their wings for a quick appetizer with friends before a night out. Whether you're on a date or with a group this place is worth checking out."], ["Aaron S.", "So having a night restaurant hopping has turned out awesome!  Even after an hour wait, we still managed to get in the door.  I've been looking for a really good burger for a while, and the southern burger here is absolutely fantastic!  I mean it has everything you could ever hope for!  Gotta give this pace a try!"], ["Fred B.", "Great burgers.  Delicious, well executed, generous portion of fries.Good drinks.  Good salads.I always find it noteworthy when chef chooses not to put salt & pepper on the tables.  Kind of like they're saying \"F#%€ you... my food comes out of my kitchen properly seasoned already\".I agree. It is.  Blind Rabbit is a good value for what you get - generous portions of deliciously seasoned, properly cooked food.One of our new favorites in Jacksonvills."], ["M R.", "I don't know if they were short staffed when we went but the service was extremely slow.  The waiter seemed bothered whenever we asked for anything and was very cold.  The food took over 45 minutes to make it to our table, and the food wasn't worth the wait.  Maybe it was just our timing, but I won't be going back."], ["Ryan H.", "Love this bar/restaurant. The atmosphere is fitting for this area. The one at the beaches is just as good too. Half of the menu is dedicated to some good burgers. I had the BBQ Bacon Burger - Applewood Bacon, Provolone Cheese, Sweet BBQ Sauce, Crispy Tobacco Onions, Bourbon Spiked Creole Mustard, Brioche Bun - which was really good.Not typically a fan of onions, but they did not bother me on this at all. Would eat it again. I also had the mac n cheese and the Peach Habanero Hot Sauce (which is basically like buffalo sauce with a hint of peach). The waitress was kind enough to give me a small sample of each sauce to go in little cups. Curry Mayo, Spicy Ketchup, Creole Mayo, Honey Mustard, Bourbon Spiked Creole Mustard, Bourbon BBQ Sauce. All of which are really good. Certainly a place to check out whether you're in riverside or at the one in Jax beach. They are both good."], ["Jill C.", "I have heard nothing but good things about The Blind Rabbit, and I have had lots of friends tell me I needed to go there, so we did! They have 2 locations, one at the beach and one in Riverside. We visited the Riverside location since it was closer to home.We decided on the Poutine for our appetizer. For those of you unfamiliar with a Poutine, it is Hand-Cut Fries, Pork Belly, Tasso Ham, Cheese Curds, and Gravy....aka delicious! The gravy had a very nice taste and the fries were crispy.I got The Holick Burger for my entree. It had a Sunny Side Egg, Intuition Braised Pork Belly, Tomato, Arugula, Homemade Bread & Butter Pickles, Lemon Aioli, on a Brioche Bun. I thought the burger was very good, but it didn't really need the pork belly. I don't think it did anything for the burger and it wasn't very flavorful. However, the rest of the burger was great. I got mac and cheese on the side. It was very creamy and the topping was crunchy and flavorful.My husband got the Blues Burger, which had Maytag Blue Cheese, Caramelized Onions, Lettuce, Tomato, Homemade Bread & Butter Pickles, and a Brioche Bun. He has been craving a good burger and said that this one hit the spot! He got fries on the side.Verdict: Liked itWe really liked everything and were pleasantly surprised. We didn't try any whiskey on this trip, but  they have a very large whiskey menu for those who are interested. While the prices are not outrageous, they are a little higher than some burger places in town. Still, I think it is definitely worth it. We plan on visiting again soon!"], ["Matt R.", "Few places do rye whiskey drinks correctly, but these guys do. Seems like evening on the menu is interesting and tasty."], ["Franklin H.", "Top quality service from the moment we walked in the door.  And amazing restaurant with a menu to please just about every foodie.  Ask for Brad, his knowledge of foods is world renowned."], ["Jessie Z.", "We had such terrible customer service from the time we walked in. It ruined our entire time while visiting the blind rabbit. definitely will not be returning or recommending. But my milkshake was awesome."], ["Elizabeth M.", "After eating at the Blind Rabbit at Jax Beach many times and loving it, I stumbled across a Blind Rabbit in Riverside Saturday night!  It was wonderful!  I had the fried green tomatoes,  They were fantastic!  I had the fried chicken too.  It was yummy.  I am normally not a big fried food eater, but I am glad I tried these delicacies!  They had some of the local canned beers for just three dollars.  I also got to try the spicy margarita!  Watermelon puree and daytil peppers as a garnish.  It was ten dollars and served in a mason jar.  It was tasty.  The staff was wonderful just as they always are at the beach....now....which one will I go to next!?"], ["Erika C.", "Upon sitting down at our booth at the Riverside location, our waitress promptly took our drink orders. These came to our table in a reasonable amount of time. Our waitress, Ashley, was very friendly and accommodating. The catch of the night was swordfish and I ordered the swordfish tacos. To my dismay, the two tacos ($12) had very little meat on then (see picture). One of the pieces was under-cooked. I addressed this with the waitress and she expressed that this was, of course, not normal. The floor manager came over and explained that the fish is weighed in 6 oz. servings. He quickly walked away before I had the chance to say anything. I was concerned that this indeed was not a 6 oz. serving, but I didn't argue. The waitress agreed with me and offered to take the tacos off of our bill, and she apologized several times. I will greatly hesitate to return due to poor customer service from the management."], ["Kathy C.", "Ok, I am a fan of The Blind Rabbit.  The four of us (hubby and I + 2 friends) decided to give Blind Rabbit a try last night.  We walked away pretty satisfied and happy.  First off, the atmosphere was quite nice.  Dimmed lights, spacious bar area, nice booths in the back, nicely decorated.  Didn't hurt either that our server was one of the friendliest guys with a big smile I've ever met.And the food.  The food was tasty and delicious.  We had to try the three appeys that caught my eyes when reading reviews (main reason why I was anxious to try the Blind Rabbit) - Gorgonzola Chips, Poutine, and Fried Green Tomatoes.  The chips were a bit salty and heavy for my taste (preference, hubby really liked it), but it was delicious.  The poutine was not your traditional poutine, more of an 'elevated' version, but also delicious.  Fried green tomatoes = da bomb!  I don't think you can go wrong with any of the appeys we ordered.For our entrees, we had the Holick Burger, the Whiskey Smoked Burger, Shrimp & Grits, and Pork Belly and Oyster Sandwich.  Everything was boldly flavored and delicious.  I ordered the Holick burger and could not finish it.  It was huge (and messy, as expected), but I'd order it again in a heartbeat.  The Pork Belly and Oyster sandwich my friend got was very yummy as well.  Poor guy, he offered to let everyone try a bite and I think he ended up with only half a sandwich lol.  I guess the next time I come, it will be a hard choice between the Holick Burger vs. the Pork Belly and Oyster Sandwich for me.  Overall, we really enjoyed our dining experience and can see us going back again soon."]], "Ovinte": [["Richard P.", "My wife and I recently tried Ovinte for their brunch.  The food was pretty good.  We ordered the meat and cheese tray shared with two other friends.    I had their masa and ricotta pancakes and wife got the brioche French toast.  Mine was not bad, though nothing special.  My wife's French toast was really delicious.  The atmosphere was great though.  There was a live performance so we opted for outdoor seating.  Overall it was a nice experience.  It's slightly on the pricey side, but it's expected for an upscale restaurant at the Tome Center."], ["Marc K.", "this is a nice looking place that over promises and under delivers. the empanada  app looked like it came straight from the freezer at costco! really?"], ["Jamie I.", "This weekend started the festivities to celebrate my birthday this Monday. Those of you who have the day off from work, you're welcome.  Ovine has been on my list to try and after perusing the menu, my desire for a cheese plate meant a visit.Ovinte is located in the Town Center across from Tigerdirect in the old Original Pancake building. The decor is modern and comfortable with a large lounge area. A small parking lot meant I took advantage of the complimentary valet.My dinner date and I chose the patio since it was a nice evening and they have heaters outside. We were in a bubbly mood and enjoyed a glass of prosecco.  We started with the cheese plate and chose the manchego, aged gouda, and bellatoir. The plate came with local honey, grapes, Marconi almonds and toasted baguette. I died and went to cheese plate heaven. Maybe it just filled a massive craving, but damn, was it good. The bellatoir, a soft French cheese, was the winner of the evening.We then moved on to sharing bacon wrapped dates, crab cakes, and chorizo empanadas. I love dates and these didn't disappoint. The crab cakes were very good with little filler and the empanadas were crispy without being overly greasy.  For dessert, we had the homemade s'mores with a generous dusting of sea salt on top. Inside got crazy busy and was super loud. I'm glad we choose the patio. It allowed for a more quiet, leisurely dinner. If you haven't visited yet, I recommend it!"], ["Matt B.", "We have been here a few times and the atmosphere is really cool. The food is good but on small plates and the service has been really good. The only negatives I found are the don't have tea. Sweet or un. And when your the designated driver there fabulous wine and drink selection does you no good."], ["Melissa M.", "Amazing food. My first experience of tapas dining went above and beyond what I had expected! Very creative dishes. The cheese and meat combos you can try are amazing! The local honeycomb was a perfect touch. Thank you for a wonderful evening!"], ["Kamni G.", "I have had this place on my list of places for try for a while. So when we met a fellow yelper (Waheed) and made plans to meet up, we obviously chose ovinte! They do take brunch reservations but it didn't seem like it was necessary when we arrived. The hostess was amazingly helpful and patient. She never hesitated to refill the processco or let a water re fill lapse. She was there before you knew you needed her there. The food, now it was good but not amazing. I do adore their fries and they are yummy! With 4 stars, this place now moves into places to try for dinner list however not when st johns town center is at it's busiest. Give this place a try, between the friendly service, good food, live music, amazing decor... You may forget where you are and relax for a while."], ["Mahalie H.", "The food was amazing for my first time. I had the shrimp, scallop,  and crab meat crepe with a butter wine sauce. Then a meat and cheese tray along with a refreshing ginger beer cocktail. The atmosphere was very nice and unique. I will be visiting again."], ["Stephanie A.", "Very nice ambiance and a very creative menu. I love the small plates they offer. This way you can try many more options. The staff was extremely attentive. I found the music was good but could be turned down just a bit for better conversation.My husband and I really enjoyed our entire meal. We definitely will return."], ["Han L.", "According to our server, this is the only non-chain restaurant in the Town Center. Ovinte is a tapas restaurant that offers brunch on the weekends. I highly recommend this place for people who enjoy non-traditional brunch options, as it has several latin-inspired and latin-fusion brunch options. Although it doesn't apply to me, I appreciate the vegetarian and gluten-free options available on the menu. I had my first Michelada, here. *GUSHING* it's basically a bloody mary made with beer instead. it makes for a fine libation when you add a little hot sauce to it. yummayyy. Some of the brunch options are also tapas style, so you may have to order more than one item to satiate your appetite. As with other tapas restaurants, I recommend going with 3 or more ppl to maximize the experience. We ordered the tamale and the salmon plate. The tamale will definitely not fill you up. The salmon platter is great for sharing. It was served on a wooden board with capers, red onions, peppers, eggs, and bread. I liked the presentation of the foods. The ambience is great. It's quite contemporary, but inviting. In the center of the restaurant are sofas for dining and groups. There is also outdoor seating. I would definitely come back to enjoy the tapas during the evening. This would be a great place for gno."], ["Martha G.", "I love wine, hence I love Ovinte...it's that simple. However, since I wouldn't be a true Yelper without a longer review here I go. So why Ovinte? Well, first of all the wine selection is amazing. From their by the glass or half bottle selection of wines, to their \"Wine Emotion Cards\" where you preload them with $25 and you can sample as many wines as your card takes you from their wine emotion machine.  Its a lovely contraption that I would love to have at home, basically is like beer on tap, except its bottles of wine and all it takes is your little \"wine emotion card\" to serve yourself.Anyway, besides the wine, Ovite has a full bar for non-wine drinkers and great tapas selection so that you don't end up all liquored up. :-)  I expecially love their Cheese / Charcuterie plate, the crab cakes, and the\" Chorizo al Vino Tinto\" which is slice  spanish chorizo (sausage) served with grilled bread...yumm.In addition to the wine, and great food.  The atmosphere inside and outside is very relaxing and makes a nice stop after work, after a hard day shopping at the mall, or just as a good excuse to hang out with friends."], ["Diane A.", "Had tapas last night for dinner after work and became a fan of Ovinte at the St. John's towncenter. A good crowd was in for happy hour on a Monday. We had dinner consisting of tapas - truffle fries, seared scallops, shrimp, grilled bread slices, and ceviche. All the tapas were cooked perfectly and well prepared. We ended our evening with Limoncello bread pudding just to reminisce our Italian honeymoon & the constant indulging in limoncello. The ice cream on top of the bread pudding was a slight lemon flavor but not typical \"limoncello\" flavor that Italy is famous for. Service was great and we were greeted by the host staff and server. Food was priced well along with a great happy hour atmosphere. I'd come back often!"], ["Sumi W.", "I wanted to check this place out so bad since I followed them on Instagram. When I finally got the chance, I got the worst waitress ever! She double carded us, didn't know the menu items thoroughly, and didn't how to pour alcohol in a glass (spilled it all over the table)... Seriously who hired her? She belongs in the back washing dishes. With that being said I haven't gone back here and I even unfollowed them on Instagram. They lost two customers for sure. I'm still mad she double carded us. Who does that in a restaurant? That's for a store like Total Wine to double card us which would make sense."], ["Daisy D.", "We had walked into Ovinte one night to check it out, but the place was bouncing so we bounced ourselves right back to our car. Finally made it back with a girlfriend after work to check the place out. Grabbed a beer at the bar while I waited for her. We were seated on the porch. Very excited to see one of my favorite waiters from Orsay would be waiting on us.We started with an order of the Herbed Truffle Fries to snack on while we perused the rest of the menu. I ordered the Heirloom Tomato Salad special. It was a stack of gorgeous tomatoes topped with a goat cheese fritter. It was delicious. The tomatoes were dressed just right and the goat cheese added just the right amount of richness and tang. For our next course, I ordered the shrimp & grits and my dining partner had the seared scallops special. My plate was good, but I can't say it was amazing. It wasn't at all bad, I just think unfortunately I have a very high bar for making a serious impression when it comes to shrimp & grits because I've had it almost everywhere in Jacksonville. I tasted a bite of one of her scallops, they were seared perfectly and melted like butter on your tongue. As they should.For dessert we had an order of the s'mores and the limoncello bread pudding. Both were delicious and I've finally come to appreciate bread pudding as a part of my life. Didn't like it as a kid, but love it now. I would order the bread pudding again if I was sharing, but if I just wanted a little sweet treat to wrap up my meal, the s'mores are the way to go.Can't wait to take my husband back. He's been eyeing this place forever and we just haven't been able to make it work."], ["Katrice S.", "Ovinte may very well become me and my friend's regular meet-up spots for \"Girls Night Out\"!  When we walked we were instantly impressed with the decor and the lounge set-up!  Perfect for our girls night out gathering.  The atmosphere was very relaxing, the music was awesome, and our server was the best (Hi Hunter!)  This made for a wonderful dining experience.  There were a lot of things on the menu we wanted to try and lucky for us, the menu options are tapas and small plates.  This made it easy for us to share so we ordered a few different things to satisfy all of our palates, and we made sure  my friend got her \"cheese\" LOL!  Here's what we had: Cheese & Charcuterie Ofcourse, the cheese and fresh fruit were good but the honeycomb and Marcona almonds were divine!Herb Truffle FriesThese were my favorite!  I was gobbling them down like I was in a fries eating contest!   These shoestring cut fries were dusted with sea-salt, fresh herbs, parmesan, and truffle oil.....YUM!Bacon Wrapped DatesThese were amazing...they were so good we placed a second order of them.  The little mahon cheese surprise inside of the dates and the apple wood bacon did it for us!Chorizo Al Vino TintoAnother amazing choice!  The chorizo had a nice spiciness to it that wasn't overwhelming and the wine and herbs it was cooked in was heavenly!  It was perfect to dip our grilled bread in ...and fries. Empanadas de ChorizoThese were our least favorite of everything.  A little too doughy perhaps and not much flavor.  Pretty to look at though.  :)Moroccan-Spiced Pork SkewersThese were very good especially with the arugula salad!  The meat had the perfect blend of moorish spices.We all agreed Ovinte would be our new ladies night out meet up spot!  The atmosphere is perfect, the wine and food is amazing, and the staff are wonderful!  I can see this place becoming a favorite and I look forward to returning!Check out the full review with pics highheelsgoodmeals.blogs…"], ["Maxine M.", "I used their online app to book a table Monday night for my sons 19th Birthday.  They sent me an email an hour AFTER my 615 table time to tell me that it was canceled.  They also called while I was IN route  to dinner but  was using a map app so couldn't answer my phone. They blamed the table time app for allowing me to make a reservation. When we arrived we were told that they were closed for a private event  but if I wanted to come back at 9pm (3 hours later?) They would buy  us a drink. Thanks for offering to buy my 19 year old alcohol. We won't ever go back. I am also enjoying telling the 200 plus patients who come in weekly to my office how we were treated. I love when marketing works that way..word of mouth is everything! !  His birthday  was saved by J'alexanders! ! It won't let me give less than 1 star :("], ["Aaron H.", "We tried a variety of menu items all of them were excellent, the waiter was very knowledgeable and ready and willing to explain everything to us, it was a great date night experience for me and my wife. The bruschetta sampler was amazing, everything was very fresh and delicious!"], ["Allie A.", "A group of friends had been planning this outing to Ovinte for over a month, and this past Saturday we finally got together to make this it happen. We all know that Town Center parking can be a pain in the ass, but they offer complimentary valet, which is great. No driving around in circles and fighting with folks for a spot. Nice touch. Certainly a bit swanky on the inside, but I didn't feel it to be in a pretentious way. It's smaller than I would have thought from the outside, but plenty of seating, couches, tables and the patio has the same seating offering outside as well. There were 9 of us that met around 7 pm on a Saturday night and we were lucky enough to score one of the couch areas outside.... an upscale South Beach feel with the dark wicker, cozy cushions and huge umbrellas. Our server was excellent and hilarious, even when he walked into some crazy conversations we were having! He did a fantastic job of going through the menu, explaining the different wines to the group and was just an all around enjoyable guy. My boyfriend and I started with a cheese and charcuterie plate... we really wanted a broad range so went with seven options, four cheeses and three meats. The group ordered quite a few different things, including the sliders, truffle fries, pork skewers, clams, and probably a few I am forgetting. :) Cheese and charcuterie was great.... the boy loved the prosciutto and the platter also had spiced almonds and a honeycomb.  Everything was great and the possibilities for different flavors and varieties made for a great experience. Our friends enjoyed a few bottles of wine, and me being a beer girl for life, was pleased with the selection of craft beers. I also really dug the music that was playing: downbeat, dreamy electronic that sounded just like my favorite Pandora station. Very laid back, hip and chill. We were still a bit hungry after the platter. After taking in the scene and enjoying the company for about two hours, everyone ordered the s'mores for dessert and a few espressos. The s'mores were simple, but amazing. Just two grahams filled with marshmallow, with one side dipped in chocolate with a bit of sea salt sprinkled on top. Soooooo good in the melt in your mouth kinda way. There was no talking for about five minutes. :) The sliders our friends ordered looked incredible so we ordered them to go. Topped with sautéed onion and cheese, these little guys were cooked perfectly, and still had pink in the center. A lot of sliders I've had elsewhere can be a bit on the smaller side and overcooked, but wow, these were excellent. Overall, the food was on point, maybe a tad pricy for the smaller portions, but the vibe of Ovinte offered a lot to the experience. Will definitely return.Forgot to add on the first post: Although we did not have this particular server, my friends were adamant about mentioning Chelsea, their server from a different visit... they highly recommend asking for her!"], ["Robert P.", "You can't tell from the street but this place is fantastic. Great variety in the menu and loads of flavored you've never tried before. Only a few beers on tap but you're not missing anything with the great wine list they have.  The ambience is great and is the perfect after work spot. The patio is excellent as long as it's dry outside. A hidden gem!"], ["Leah A.", "I had a chance to meet the chef and try a sample of his amazing shrimp eggrolls @ The 4th Annual Slow Down with Slow Food First Coast at Intuition Ale Works.  All I can say is this was one of my favorite taste bites of the event.  If this is any indication of the rest of their food menu, I can't wait to sit down for a full meal here very soon!"], ["James Y.", "This is one of my favorite places in Jax.  The food is traditional tapas (small plates) but do not let that turn you off.  It's a great way to try several things.  I was most impressed with their very reasonable wine prices.   A bottle they sell for 55 is typically closer to 90 at other spots. I highly recommend the meat and cheese tray with a nice bottle of wine.  Follow that up with a piece of lemon bread pudding and you won't be disappointed."]], "The Candy Apple Café & Cocktails": [["Mark B.", "I went to the per opening festivities here before they opened. The place is a lot like willy wonkas candy land. I saw and was treated to some small tasting bits. Well today I took a wrong turn and ended up downtown and thought what the heck. I have read a lot of the reviews for the candy apple cafe and even entertained eating during my ventures downtown for artwork and Jaxon night market. They are normally packed and have live music. Today I stopped on around lunch. Never really eating here made the decision easy. I was looking at the menu and saw chicken cracklins. I had to question this and find out of they were just chunks of chicken or true cracklins. When my question was answered I ordered them quickly. Who doesn't fry chicken and eat the skin first. Me me me me. All the time and it is my most favorite pieces. They came out and were as delicious as I thought they would be. They added some franks hot sauce and some blue cheese drizzle to them and placed them onto a bed of slaw. It was a great dish in this southern heart. Not good for it but I haven't really done much good for the body either. I also asked my server and everyones else's bartender about their cornered beef. They make it and smoke it on site. I went with the reuben sandwich which came out very quickly. It was filled with real meat not the parts is parts slabs that are normally sliced and piled onto some bread. No but this one was real meat on rye toast with a fair amount of 1000's of islands dressing. It was a good sandwich and it made me want to remember it for the future. So like you are suppose to I ventured out across from the restaurant to the candy shops and had to buy some really bad for me stuff in a box. Oh yea I also had to sneak a peek at the chocolate factory too. The inner kid in my made so it's not my fault either."], ["Jay M.", "The following review was published under my byline in the Florida Times-Union on Saturday, April 18, 2015. This is an original, unabridged version of that review.For more than a century, Downtown Jacksonville's historic Seminole Club was a hub of recreation for Jacksonville's elite. Today, the rest of us can consume the storied building's charms--of the architectural and culinary kind--with its transformation into the Candy Apple Café & Cocktails and Sweet Pete's. The restaurant, retail shop and event space opened in December in the shadows of the Skyway, City Hall and Hemming Park in the urban core.Enter through the porch-wrapped front door off Hogan Street and you'll find a buzzing scene. Veer right to Sweet Pete's retail store, or beeline left to Candy Apple's dining room. Upstairs you'll find more Sweet Pete's retail and a windowed vista into the candy factory. One level beyond that are classrooms and event space.But let's venture back down to the dining room. With garish décor cues--crystal chandeliers, stripes and solids--the scene is a mashup of \"Alice in Wonderland\" and \"Willy Wonka & the Chocolate Factory,\" a multicolored menagerie of whimsical grandeur. In a nod to its heritage, black-and-white framed photos of downtown Jacksonville from the olden days ring the perimeter walls.The menu boasts of \"anytime\" brunch, lunch and dinner, with special dinner appetizers and entrees that rotate daily or every other day. My family tried it the Sunday before Easter, which coincided with Sweet Pete's egg hunt in Hemming and the Easter Bunny's arrival. As usual, we did a menu mashup of our own and began with two appetizers. The Artisan Cheese Board ($10 for two cheeses; $2 for each additional cheese) was a fun palette of candied walnuts, apricots, cranberries and figgy dip. Our featured cheeses were the creamy Georgia Red, tart and spicy Gorgonzola Piccante and buttery Point Reyes Toma.Angling for the sweet side of the menu, we tried the Candy Cherrywood Bacon ($6), three candied strips on wooden skewers atop mixed greens and gorgonzola crumbles. It was very tasty and a nice warmup for my sweet tooth, but barely enough for a couple to share.The Candy Apple Bisque ($5 for my half order; $7 for full-on bisque) was a mild-mannered mix of chunky tomatoes with a goat cheese kick.Entrée-wise, my gluten-intolerant wife had an easy go of the menu, with plentiful \"GF\" tags next to the gluten-absent items. She went for a half order of the Short Rib Meatloaf ($11; $16 for a full order), a beautiful presentation with tomato jam in a port reduction atop brown butter whipped potatoes and petite vegetables (in our case, green beans). The meat itself needed a pinch or two of salt to bring around the flavor, but otherwise it was a fine, substantial meal.My choice from the \"Anytime Brunch\" menu, the Rock Shrimp & Grits ($13), featured sautéed rock shrimp, a smaller variety, blended with grits from Alachua's Greenway Farms and finished with a chunky tomato and onion relish. It was a very creamy number on top of a brothy base, with nice zest provided by the tomato-onion garnish, which helped balance the flavor.You'll find dessert on another skinny menu, paired with craft cocktail and happy hour selections. Unfortunately, Candy Apple was fresh out of their signature gourmet candy apples ($9). Undeterred, I opted for a Banana Trifle Brûlée ($7). This oversized shot glass boasted layers of vanilla custard, banana bread and what appeared to be vanilla wafers, with a whipped topping. It's not sized for sharing but delicious sweet tooth satisfaction nonetheless, a classed-up banana pudding.Candy Apple also offers a full bar with craft (Intuition and Bold City) and crafty beers, 13 wines by the glass and 25 by the bottle, along with eight signature cocktails. Happy hours are Tuesday through Friday, 5 to 7 p.m. and feature discounted cocktails, house wine, Champagne, 2-for-1 local beers and food-beverage pairings.Candy Apple is a versatile setting for family brunch or lunchtime/after-hours getaways. Just save some room to browse Sweet Pete's across the foyer. It's a sweet addition to the welcome transformation happening in our urban core.The Candy Apple Café & Cocktails400 North Hogan Street, Downtown(904) 353-9717CandyAppleCafeandCocktai…Type of cuisine: French & Southern FusionHours: Sunday, 10 a.m. to 5 p.m.; Monday, 11 a.m. to 3 p.m.; Tuesday through Thursday, 11 a.m. to 9 p.m.; Friday, 11 a.m. to 10 p.m.; Saturday, 10 a.m. to 10 p.m.Bar service: Full barChildren's menu: YesCatering: YesReservations accepted: Highly recommendedPrice range: Appetizers, $5-10; brunch entrees, $7-13; lunch/dinner sandwiches and entrees, $8-17"], ["Katy S.", "Located in Sweet Pete's, The Candy Apple Cafe is a real treat.  We came in for lunch last Saturday.  There was a 45 minute wait, but it went by very quickly as we just shopped around the candy store while we waited.We were escorted to our table on the outside porch, which was the perfect atmosphere for a spring lunch outside.  Our waitress was extremely prompt and got our drink orders in right away.I must say, the food was incredible here.  I had the Candy Apple Bisque (which is basically tomato bisque).  I really enjoyed the block of cheese floating in it and the freshness of the tomatoes.  I also had a salad with pecans, goat cheese, and other veggies (can't remember the name) and it was very good.  My husband ordered the fried chicken, which I really liked as it was a breast with no bones and my brother in law really enjoyed his Croque Monsieur.Honestly, we all enjoyed everything we got to eat and had a really good experience.  A great experience in downtown Jax!"], ["Gaenor A.", "Very friendly and helpful staffNice interior decor but also nice to sit outside and have a drink whilst watching the world go by.Food was delicious and beautifully prepared, but on the pricey side.It will always be busy because of the whole concept of the building with the candy store as well, and at the moment there are not that many places in the city center where you can get a nice meal,but this is changing as more places are going to be opening.If you want to just drop in for a meal on the weekend then be prepared to wait as it does get very busy. A cool place to go and a great place to take guests"], ["Tiffany H.", "Went here last night after numerous people raved about it and I was not disappointed!! We had a fairly long wait and once we were seated it was a good 15 minutes before we were even brought any water. But they more than made up for it when they realized their error. Cocktails do not disappoint and I was so happy to see vodka drinks make with Titos-- my fave! The Bloody Mary was very good. We ordered the cheese tray appetizer and it was fantastic.. Great combo with fruit and candied nuts. It could have had more of the baguette slices. My entree I ordered the kale-quinoa salad.. Was really needing something lighter. It was wonderful! The kale was tender and had a fantastic dressing. I've heard rave reviews about the bacon Mac and cheese and their burgers. But they have fabulous vegetarian options too!"], ["Susan H.", "So, from the beginning- there's free valet parking. If you don't feel like your car is valet worthy & you have some extra quarters, you can park around the block & feed a meter. (I didn't know about the valet parking until I walked up!)When you walk up its a beautiful old building w/ a huge porch - think Charleston SC.  They seem to have kept a lot of the character that such an old building would have, great floors & staircases & molding around the doorways, Beyond that, it's like Willy Wonka decorated. It's adorable & whimsical. Perfect for creating atmosphere, lots of little touches throughout. As soon as I walked in someone greeted me & offered me a salted caramel treat. (Please & thank you!)Found my friend at a window seat, we had a nice view of the court house & park. It felt very metropolitan. I'm not sure if it was just loud from the different conversations but we had a difficult time hearing our server. And honestly, he didn't seem very interested in interacting w/ us. No eye contact or suggestions about the menu at all. He just mumbled \"do you have any questions about the menu?\" when he made it over to take our order. We ordered the sweet potato fries, which were very good! They're fried in tempura batter & come w/ an orange sesame sauce. Unusual pairing but it worked.I ordered lemon ricotta pancakes, which came out burnt and a good 5-10 minutes before my friends shrimp & grits. It was implied that I got a side w/ them (I was surprised & didn't think it did, but when the server asked \"what would you like on the side?\" I went w/ it. Imagine my surprise when I was charged for a side item on the receipt.) So I also got biscuits & gravy...which were also pretty dry & toasty. The biscuits had a light citrus/lemon flavor to them, and they were served w/ sausage gravy... It was an interesting combination, I wasn't crazy about it. My friend's shrimp & grits were covered in melted butter (at least 1-2 centimeters of standing butter over the entire dish) all she managed to eat was the shrimp. The food was ok at best. The service was a bit less so (we didn't get checked on after the meals were brought out, and it took forever to get the check.) The saving grace is the decor, and the dessert. On the 2nd floor you have a HUGE candy store! All of the employees in both candy stores were very welcoming & knowledgable about the products. There's a parlor with a nice view of downtown where you can sit, eat dessert, drink cocktails & play games. The 3rd floor is where they do classes & parties. It's an amazing space! Would def. consider hosting a group event here in the future...(for the candy/cocktails class for work groups or a bday party.) I would go back, but probably not for a meal.I'm glad that they're here & give some more life to downtown! And I love the whimsical dessert/candy aspect of it. Was pretty disappointed w/ the meal & service though."], ["Kendra B.", "My new favorite place in Jacksonville!! Came here looking for a \"fun\" lunch spot. I don't have traditional weekends so Monday was my Saturday, even on a Monday this place was packed. Side note, they have a valet right in front of the restaurant. We were seated right away and had a nice table. It was extremely cold in there but I have found that all Florida restaurants are typically cold and always bring a sweater. The ambiance and decor were incredible. We started with the Popsicle mimosas and they were so good. Very fresh tasting and didn't seem like they used 2$ cheap champagne. We then had the watermelon drink, can't remember it's name but it was so tasty.For lunch I had the petite Angus sliders and petite corn dogs. Both were amazing but the sliders were so flavorful it left me wanting more. When I come back I will be ordering the full size burger. The candy store is fun and packed with childhood favorites. We sampled the Carmel and it was Devine. They also have an amazing event space on the third floor that was perfect size for a birthday party."], ["Katie M.", "Had the short rib meatloaf and apple cocktail - both delicious. Also samples some of the chocolates - also delicious. Fun girls night out. Only complaint was with Valet. We pulled up at 8:10 and they said they weren't taking anymore cars because it was too close to closing.... They close at 10... We had 2 hours. A little confused but we ended up parking down the street."], ["Jean L.", "Been here 4 times and the menu hasn't changed much. I recommend a menu change.  It's a great place for lunch but can get real noisy with all the kids running around sweet pete's."], ["Jackie S.", "LOVE LOVE this place! The quality of food and cute ambiance  you get is well worth the price. Food ordered: Cheese grits were creamy and the right amount of flavor. The Hemming omelet was light and fluffy. Biscuits & Gravy were bomb.com Corned Beef Hash was good but reminded us more of a pot roast with an egg on top. Service: No reservations made and phone number was taken with a 10 minute wait. During the wait we decided to check out the candy store (which is awesome by the way). Never received a text for seating after 15 minutes but hostess saw us still waiting and quickly sat us in the outdoor seating. Waitress was nice and served us well. Food took awhile to come but how tasty it was we didn't mind. Note to future visitors: PARKING is limited so be aware. Don't get to excited and purchase prepackaged candy downstairs. They have a self serve with the same items in the candy store. =)"], ["Susan S.", "My good friend had out of town visitors this week and really wanted to wow them with a nice dinner to kick off their trip..she chose The Candy Apple Cafe, and we were very pleased.  The area of town is rough, and parking is a bummer..but as soon as you walk up to the porch, you forget all that and are instantly taken in by all the colors and decor..its really spectacular.While we waited for the rest of our party to arrive, we walked around the candy store..they have the most interesting fun items here..coconut curry cashews, liquor lollipops, chocolate covered potato chips, letters made of candy, gift baskets, and more and more..my head was spinning in a sugar high and i hadnt even sampled anything! When we all had arrived we were shown to our table..the colors and artwork and even the chairs are all so beautiful..we had a group of six and had a table with a banquette on one side and chairs on the other side..there was a large glass cherry in the center and we were surrounded by large windows and cheery paint colors..the linens are black and white checker print and the servers wear shirts that matched.We all took a moment to take in the drink menu first and decided on several different options that we later passed around the table for all to try..i personally had the Hogans Hero and it was delish..also at the table were a cherry pop, a hung jury, and a cowford punch..after all the tasting i enjoyed my drink the best! There is also a large variety of beers and wines available, as well as some happy hour offerings.Next we moved on to the appetizer menu where we found many different and fun options..for the table we had mini corn dogs, sweet potato fries, a cheese plate, and the star of the appetizer was the buffalo chicken cracklin..they take chicken skin and i guess bake it till its super crispy..then put hot sauce and blue cheese on it..it was a weird concept to read on a menu, but it was super tasty..while munching happily and sipping cocktails, we were all also deciding what our entrees would be, and it was no easy feat!  seeing that you can have brunch anytime was a game changer for most of us, but oddly no one went for it..at our table there was cornmeal dusted flounder, shortrib meatloaf, shrimp and grits, a reuben, a kale quinoa salad, a lamb special and for myself the sea bass special..the owner of the meatloaf was a little under enthused by it and left a majority on her plate..when the server, who was a bit lack luster, asked if she needed a box and she said no, nothing more was said, she never asked if it was because it wasnt good..everyone else really enjoyed thier food, and we all raved to each other..especially me..this sea bass was cooked perfectly with a light crunchy crust of some sort, and it was served on top of truffle whipped potatoes that were the best i have ever tasted..i rarely order potatoes when i go out to eat, because i had so many bad servings of boxed mush..this was NOT the case here..they were flavorful and amazing and served next to sauteed broccolini..all in all this meal was a hit!  I wish i had taken pictures of all the empty plates, scraped clean!As the table was being cleared and we were all in a full state of bliss..the time came that we all knew coming to a place with candy apple in the name would come..the server asked ..are you ready for dessert?  she had someone bring over an assortment of candy apples and advised us that they could all be sliced up for sharing..had i not been so full of my amazing meal, i may have partaken..instead we all opted to share one dessert, the chocolate torte with espresso buttercream..it was rich and velvety and sweet, perfect end to this wonderful meal..i will be back to try the fried chicken, the mac and cheese and also the brunch options, and probably to do some shopping in the candy store..cant wait to enter this place again..its like willy wonka and alice in wonderland all in one!!"], ["Jim A.", "Great place, the best escargot; it is done perfectly. Good drinks, great food. Love the music on the porch. Inside though gets very noisy, if they have a full restaurant not good for a dinner for two. Could not hear my wife talking."], ["M B.", "This is one of my favorite spots and we always bring our friends and fam when they visit. The food is great, especially the candy bacon, corn dogs, and the meatloaf. Save room for dessert! The Golden Apple cocktail is amazing!"], ["Jaye T.", "The decor is what strikes you first, so let's talk about that and also how I want to steal all of their furniture and light fixtures and walls and just live there forever. Wait, what? I mean... Uh... The Candy Apple is effin' adorable. It's cute, but not in a childish way and the bright colors of the furniture make a great visual balance against stark black and white floors. If all you wanted to do was live here, it's a great place. Five stars, done deal. If you want to eat here.... well, that's a different story.For the prices, I'd have honestly expected better food and certainly better service. I ordered the angus burger and it was a decent example of a burger... but I've had better at Five Guys and for half the price. However, I understand that half the cost of a meal out is the ambiance (okay, fine, sold) and service (well, let's talk about that). The downside of the adorable styling was that the restaurant itself was FREEZING. I get summer in Florida, but it was APRIL, so what the heck was up.This is a nit-picky thing, but I drink a lot of water, so it's kind of important to me: the water glasses are cute, but no for real, I'm an adult, where's the real glasses. As for the service..... Our waiter left (the restaurant; his shift was over, apparently) and didn't pass us off to anyone, so we sat, abandoned and ever-hungrier (never having ordered because he brought us water and left), for nearly thirty minutes before I flagged down the hostess as she was seating another table.The replacement server was fine, I guess, but fine doesn't make up for being discarded.To justify the prices and the meh service, their food needed to be fantastic and it really, really wasn't. It was fine and if you're hungry and don't want to wander farther from Hemming Plaza than line of sight, it's a fair choice. Overall, though, I'd recommend eating somewhere else, which is a shame, because it's *such* a cute place."], ["Nancy C.", "As of right now, The Candy Apple Cafe and Sweet Pete's is the ONLY experience in Downtown Jacksonville that is worth repeating time after time.This was our fourth time, we brought friends for the first time.........Wonderful food, wonderful staff........Sweet Pete's was like a venture into the likes of Disney World...............Just made for a great afternoon .  Thank you!!"], ["Ron E.", "Ok my 1st and 2nd trip to this place was within the same week.  Guess I liked it a lot.  Great menu, food, drinks, service, and of course candy. Listen to the servers suggestions and you wont go wrong.  Indoor and outdoor seating is available for those of us that enjoy the outdoors. Please save some room for a little something sweet.  Those apples are ridiculously good.  Take some time to explore the shop as there is a lot to look at.  I really like how you can watch them make some of their products. Kids and adults alike love this place!"], ["Lisa S.", "I really enjoyed the Candy Apple Cafe and will be back. The one thing that kept me from giving them a full 5 stars is the wait and \"pretentiousness\". We have tried to visit here sooner, but the long wait has discouraged us. When we went last Sunday for brunch we thought we were lucky as there were multiple tables open. However we were informed there would be an hour wait. Apparently all the vacant tables had reservations, a few of which were never filled during out entire meal. Fortunately we were able to sit at the bar and enjoy brunch. I tried the santafe crepes and they were amazing. My guest had the Duval omlette with biscuits and gravy on the side. Delicious. Also an honerable mention was the momosa, which was served mostly champagne and a splash of orange juice, just the way I like them."], ["Vanessa T.", "Love..Love...Love.... this place gets three loves from me, one for every wonderful floor.   I was just blown away by how incredible this place is.  I have been to the old Sweet Petes to take the kids to the candy making classes, which were always fun and the old place was really cool, but this new location......WOW!!  Right when you walk in its just beautiful......decorated absolutely playful,stylish just beautiful!!  Three levels of this, the top is a space for events...Weddings, baby showers, B Day parties.  The second floor, has a store to buy gifts/candy, the Dessert Bar- all kinds of wonderful goodies in here, then more event space.  The bottom floor is half candy shop, half restaurant.....both amaze..It was very busy on Sunday and we put our names in for a table then just wandered around, there is plenty to look at and people watch, there were a ton of people in there.  When we finally got our table we were starving, we ordered 2 apps: mini corndogs and sweet potato fries...both good, the batter on both of these was a light fluffy batter like tempura style.  For lunch we got Croquet Madame- the grilled cheese and ham sandwich with a fried egg on top, and ruben with fries...both were very good...i was really looking forward to the candy apple for dessert tho....they were out of the sea salt candied bacon so we went with the rocky road apple......it was heavenly, perfectly sour apple, creamy caramel/chocolate, crunchy pecans, and homemade marshmallows....we all loved it!I am so proud that there is a place like this in Jacksonville, I really loved it!"], ["Kelly C.", "I really really really want to like this place. But every time I come here, I never know what to order because their menu is so limited and everything looks so meh. It's really disappointing. Because I like the atmosphere and I like the location and the people are nice and it's right next to Sweet Pete's and the drinks are strong/good, I SO want to like this place. Sigh. Also, as a friend pointed out, they should have a menu that matches their theme. The only thing remotely candy apple-like is the candy bacon appetizer. Oh and sweet potato fries, which duh it's naturally sweet.Anyhow, yeah, I dunno if I'd go back unless other people wanted to go.  I would, however, recommend going at least once.  As I mentioned, the idea and ambiance is pretty neat."], ["Kristy A.", "It's official I LOVE this place. Total web redemption for Candy Apple for me!  My first review was based on trips in first week open and a couple weeks later.  Today was my sixth time there since opening. My friend and I both ordered items we found problematic on previous visits and new items to try.  We started with sweet potato frites and deviled eggs. I could eat the orange sesame cream that accompanies the frites on everything. The frites were tender and coated in a very light tempura. My favorite deviled egg was the spicy hummus and even my friend who first declined her share, once coaxed, loved it. We then moved on to entrees and sides that we had said we would not order again. I had the meatloaf with an extra side of greens and an extra of mac n cheese. My friend had the flounder. The meatloaf was juicy and perfectly seasoned. The Mac n cheese was creamy with plenty of fontina flavor and the fresh ground spice (peppery nutmeg?) was more pronounced than I remembered (that's a good thing).  Flounder was equally delightful. The greens were the best I have ever had. Not too salty with big chunks of meat. I mixed bites of them with meatloaf or mac n cheese for wonderful variations of taste.  The service was impeccable.  Just a tip -make a reservation for the sun porch. Hey Candy Apple does the sun porch have a name?  That would be a fun contest. Name the sun porch."], ["Jamie B.", "Love this place. It was our second time. The atmosphere is fun! It is a bit loud. If it's nice outside try sitting on the porch. Both times our servers were knowledgable and friendly. This visit was for my mother in laws birthday. They were so nice as to put a candle in the center of the Apple so we could sing to her then they removed it and cut it for us and brought it back. She loved it. I do have a complaint. Both times we wanted to try the caramel apple with bacon and they did not have it. Actually they only had the rocky road this time and it was right when they opened. I have reached out via Instagram to ask why. I would think since the Apple is their theme they would have all flavors available most of the time. The caramel for the apples I understand is made by Sweet Pete's. The food is amazing. I had the fried chicken and I must say it was crispy and perfectly seasoned. The collards were just like my moms with a nice smoky vinegar pop. The mashed potatoes were good...a bit thick but tasty. My mother  in law got the same dish but with fries. The fries are good but a little soft. My husband got the angus burger and loved it. Father in law went for the short rib meatloaf which was tasty. Our appetizer was the sweet potato fries man was that a good decision. They have a tempura coating and the sauce is so good!!!!!!! We are meeting friends there this Friday and can't wait to try something new. On our previous trip we had the chicken skins (just try them) and the corn dogs with beer cheese dip. We also had an old fashion with rock candy stick and a Seminole club. One last thing. I suggest reservations. Otherwise their is typically a wait! Have fun!"], ["Tracy D.", "We were really disappointed. We came for dessert and there are plenty of gluten free options at the candy store. There were two GF options on the menu at the adjoining restaurant. They were out of one so we had no choice at all. We had the sea salt caramel bacon apple for $9 and didn't love it.  Service was pretty good.  However, there were so few GF options on the savory menu as well that we won't be back."], ["Jerry B.", "It was like another world. I was first greeted by a willy wonka look a like at the door. There was a little bit of a wait so we tried to explore sweet petes and got lost in the ultra colorful, super sweet smelling building. The food ended up being very good  especially for the price. The whisky selection was top notch and I ate entirely to much chocolate."], ["Brittany M.", "\"A little nonsense now and then is relished by the wisest man.\" -Willy Wonka. This is just one of the many Wonka quotes you will find sprinkled throughout this whimsical candy store. Located on the first floor of Pete's Candy Shop is the Candy Apple Cafe. This cafe is fun, inviting and really does make you feel like A KID IN A CANDY SHOP! The cafe itself has a large variety of food including cheese plates, shrimp and grits as well as traditional brunch and lunch options. I highly suggest ordering the Rock Shrimp Crepe if you are in the mood to spice up your life! The only suggestion I have is the time management skills the staff portrays. I have been twice and the wait times for drinks and food were entirely too long each time. I suggest going if you have time on your hands and no worries in the world!"], ["Dennis D.", "I ordered the buttermilk fried chicken.  From the pictures I see its actual chicken pieces (drumstick, thigh, breast). The menu item did not say chicken tenders.  What I got were two kid size chicken tenders on top of cold soggy French fries and they forgot the gravy that goes with it.  Did I get the kids meal???!   I was really disappointed.  Did you all run out of chicken?  And it was my birthday!!!"], ["Stephen M.", "The food was good and I loved the atmosphere, however, our waitress wasn't all that friendly."], ["Erika C.", "The ambiance inside this large, old plantation-style house was whimsical and Wonka-esque. I had the sweet potato fries with the sesame dip as well as the candy cherrywood bacon.  The fries were thick and very good, but the bacon was excellent. The bourbon pecan waffles were good, but I didn't taste much of the bourbon in the syrup. The pecans were in the waffle batter. I feel that there are better dishes on the menu, namely the fried chicken that was on my friend's plate. Service was adequate as there were a moderate amount of people in the dining room. We didn't get a refill for our water and I ordered the 8 grain toast and out came the everything toast. Other than this, it was a good experience!"], ["Sandy G.", "Such a cute place!!  My sister and I took her boys to the toddler class to make cookies and toured the candy factory. They loved it!  Afterwards we had lunch on the patio. I had the turkey Reuben and it was delish. The turkey was fresh roasted an a marble rye and not overloaded with sauce. The kids menu is also fantastic. I will definitely be back without the kiddos to try some of their cocktails."], ["Martha G.", "Came here with friends prior to an event.  The restaurant and the adjoining candy store made me feel like I had just walked into Willie Wonka's Chocolate Factory.  The Victorian building is amazing and the décor is genius.I had the shrimp and grits.  The shrimps were rock shrimps and they tasted like lobster.  Yummy!  My friends had the Mac 'N Cheese with candied bacon, and the short ribs.  Everyone said their food was delicious.  The cocktails weren't  bad either. ;-)The only negative, and I wont ding them for this, is the parking.  Because of the location, a refurbished Victorian home, on property parking is limited.  However, there's parking on the street that surround the restaurant.I will definitely back to try other dishes and to continued to be amazed by the décor."], ["Karen L.", "Portion of the salad was a little disappointing, but my friend got a veggie burger and there was more than enough for the both of us. Very tasty food!"], ["Stephanie H.", "This place is over-hyped. The menu is small and honestly boring after the first 2 times of going. Daily specials would be a good idea."], ["B I.", "Very interesting place.It was not too busy and we went for brunch being downtown anyway.It was not busy but were initially told it would  be 30 minutes and we would have to sit outside. We talked to another gentleman because I didn't want to wait outside and wait 30 minutes and somehow We managed to get a table within five minutes there were plenty of tables open. The waitstaff was real nice and the food was maybe better than average.Decor was very nice.Looking to earn some brownie points with your wife and girlfriend take them here. All the females looked extremely happy,  most of the guys looked unimpressed and out of place."], ["Brittany C.", "The Candy Apple Cafe is a cool and fun place, and the food is excellent! I absolutely love the decor and atmosphere of the restaurant. I ordered the bourbon pecan waffle with a side order of eggs and it was delicious! The waiter was very attentive and helpful with any questions we had about the menu. It was my first time eating here and I will most definitely be back! I am rating four stars just because it took over 30 minutes for our food to come out while other tables that had come in way after us were getting their food. Other than that the whole experience was great!"], ["Teresa V.", "Food reasonably good but not as good as expected will give it a second chance but not thirdAmbience superb will consider more for dessert than dinner"], ["Justin R.", "Overall, the porch is perfect. The food is good, and the cocktails are bad.Despite overlooking a concentration of Jacksonville's homeless population, The Candy Apple Cafe porch could be among Jacksonville's best places to eat and drink outside.  Past the porch,  the decor parallels the decadence offered in the menu. As you walk into the restaurant, your eyes will be assaulted by blue walls contrasted by black-and-white horizontal stripes. Over-sized cherries punctuate the room with red. While bulky chairs, thickly framed photography and crystal-adorned chandeliers make the space feel crowded -- even when it's nearly empty. The room is full of interesting choices, and I assume Juicy Couture inspired most of the decorating decisions.The cocktails are not worth drinking. You're better off drinking from the beer and wine list. We found two cocktails particularly harsh. The Very Cherry Pop should include a diabetes warning label; it's insanely sweet. And the Cowford Punch shares a nearly indistinguishable resemblance to a screwdriver. If you're going with wine, the cheese board is curated at a good price point, and if you're going with beer, you won't be disappointed by the petite corn dogs."], ["Mark M.", "The short rib meatloaf was to die for. The deviled eggs were very good. I usually don't like sweet with my bacon -- but the candied bacon was tasty. First time here -- we'll DEFINITELY be back! The wife was equally impressed -- which ain't easy, TRUST ME."], ["Peggy S.", "We went for dinner with another couple. We love Sweet Pete's candy, and we were so excited to try out the Candy Apple! My expectations were low because it's brand new, and I was unsure exactly what to expect from their french & southern fusion description. Everything was delicious! Way better than I expected. I had a side of their mac & cheese and the arugula salad. I'm a mac & cheese snob, and I'm telling you it was great! The salad was super delicious, too. My husband and other friend got cocktails. Being 5 months pregnant, I sadly couldn't partake. One of the cocktails had rock candy in it! They looked beautiful and both guys said they were yummy. My husband got the meatloaf. It was tasty and really smoky. After dinner we strolled upstairs to the dessert bar where there were cookies and all kinds of ice cream!! Did I mention I'm currently pregnant? Hence the excitement for both cookies AND ice cream. I had to try both. I got a salted toffee butterscotch cookie (oh yeah!) and a small thai coconut ice cream. Everything was perfect and it was a truly wonderful meal. I recommend everyone try it out. If you thought the old Sweet Pete's looked like something from Willy Wonka, just wait until you see this place! The decor is so much fun and so adorable."], ["Rose L.", "We loved it. My flounder was great. Greens were the best I've had out!   Others had scallops and said it was fabulous. One had corned beef sandwich and liked it too. Waitress good.   Even explored Sweet Petes.......then got to meet him in person. Decor fun and different.   The only thing to say is that maybe after a bit of substantial profits they will do something about ceiling to help noise level.    Sooo loud. But i would bring someone there for a fun surprise."], ["Kathryn B.", "Absolutely delicious. Much-needed Breath of fresh air for the downtown Jax area. Warm and welcoming, yet hip and cool. Obviously family friendly with a dessert bar and the fun yet sophisticated atmosphere, mixed with a younger feel. Knowledgeable 20-30 something's would look forward to its eclectic drink menu, it's array of food choices from turns on great southern dishes to a beautiful Sea Scallops appetizer. Which I immediately ordered upon hearing the specials. They were so large, one was too undercooked for my taste. But they refired it and it came back a few minutes later - perfect! I also had the shrimp crepe. This was an almost unbearably perfect dish. I wanted to savor every single bite. No lumping flavors together here!! Each bite offered the taste of fresh rock shrimp perfectly seasoned with the spinach & creme Fraiche. I'm writing and dreaming about it the day after. The collared greens! Wow. Delicious! We had the butter lettuce salad which is perfect. Light w grapefruit and I'd prefer without bacon but the bacon makes sense. Salt and sweet. Beautiful. For dessert - surprised I wasn't as impressed due to the name. The apple layered tart(the real name I'm not sure of) was served cold. Very cold. My friends and I with about 50 years of restaurant experience between the 3 of us, thought it should have been served at least room temperature. But just because it wasn't our vision for this dessert so be it,  we enjoyed it as is. A chocolate tiered crisp dessert was the favorite of the two. My friend LOVED it. I thought it was good. Both desserts were served with gorgeous fresh berries and fresh whipped cream which finished both desserts perfectly. Lastly, our server was Chelsea. She was an exceptional server. Professional, sweet, informative, and efficient. An asset to this restaurant. Thank you for the wonderful time! We willMost definitely be back many times!!"], ["Angie D.", "Love the space with the big chairs and board games out on the table to play. The Thai ginger ice cream was such a clean fresh taste, I wanted more. I had a Dippin dot cupcake and could tell it was home made. This is a great spot for any type of hangout, date night etc."]], "Restaurant Orsay": [], "BB's": [], "Dwight's Bistro": [["Arable M.", "We truly enjoy the experience of dining at Dwight's. We always look forward to an evening out at Dwight's when visiting the Jax area. The food is amazing."], ["Paul M.", "We went on a Friday night; atmosphere was relaxed and comfortable with low volume background ballads.  Hostess set a 4 foot stand next to our table for purses and jackets--a first for us.  Starters range from $11 to $28, Salads from $8 to $11, Pastas from $19 to $22, Entrees from $29 to $39.  Service was excellent.  We know Lobstah (catch the Maine accent) from living in Maine and having a son who is a lobsterman.  We were delighted to find the Lobster Starter OUTSTANDING.  Mixed Cheese Starter was delicious with a surprise cube of honeycomb in the center.  We skipped the Entrée, having, instead, a Baby Spinach Salad and a Chopped Salad--both were very good.  We will go there again."], ["A. B.", "We visited Dwight's for the first time this evening, after hearing good things about it. Unfortunately, the food ranged from poor to mediocre.  The vegetables were cafeteria quality, the pasta sauce was tasteless, and the wine was grossly overpriced for the quality. Regrettably, the table service was terrible. Our server's manner ranged from unprofessionally chatty to pretentious and condescending. He failed to handle the most basic tasks in a professional or competent manner, from introducing the specials and menu items, to answering questions, taking orders, and managing the table (removing unnecessary cutlery and dirty plates, etc.).  It would be unfair to expect high-end service from what is merely an upscale, mid-range restaurant. However, competency, quality, and hospitality are basic components of any well-run establishment, and on these fronts Dwight's falls short."], ["Becky S.", "Dinner at Dwight's is always a mixed bag.  The food is always great -- but the service is usually terrible!   On our last 2 visits this has been the case.   You really can't go wrong with anything on the menu, I've enjoyed everything I've had here.   Their prices are a little steep for dinner/dessert/wine -- even their corking fee is higher than most high end restaurants at $20 per bottle.  Again the only thing that makes the prices hard to stomach is the crummy wait staff who seem to act like it is an imposition for them to wait on you.     I have heard that if you come and sit at the bar the service is much better -- usually by Dwight himself -- so I would recommend that if you've never been to hopefully avoid the service issue.    Definitely worth trying, just be prepared you might get a waiter with an attitude!!"], ["Monica S.", "Before Dwight add the additions of 2 rooms to this little hole in the wall spot, I had the fortunate and unique experience of having the entire restaurant closed down for our specific 'deep pocketed' party.Dwight himself made up an 8 course tasting menu each with a well thought out pairing of wine.  This, no doubt, was at incredible expense to the folks hosting this lengthy, delicious and intoxicating gathering, as Dwight's food is very eclectic and expensive!  (Sometimes it pays to know the right people!) There was no planned menu as Dwight just cooks what he gets fresh that day and is directed to create what he likes based on those ingredients spur of the moment.  That awesome creative mentality is still true today for Dwight's menu.  Although there are some 'staples', such as his renown Crab Cakes and Pan Cooked Foie Gras appetizers, I always order from the non-menu specials when I patronize Dwight's restaurant today. I know these are the dishes that will have been created with the freshest ingredients and most passion!  The service is always good here, the wine list impeccable and the food uncompromisingly eclectic and amazing.  Note:  Make sure you have your Platinum card when you go as Dwight's IS expensive.  Dinner for 2 could cost you well over $100.00 with aps and drinks. Don't even bother finding something specific on the online menu as a more amazing dish will no doubtably await you the evening you go into the restaurant.  But the menu will give you price points for that nights dinner."], ["Natalie B.", "Dwight's Bistro is indicative of dining gems in Jax. It is owned and operated by a chef and it's located in a very unassuming strip mall in Jax Beach. Like other hidden gems, don't be thrown by the location! It is all about food and spot on, smooth and friendly service. Upon entry, you are greeted by a quaint Mediterranean dining room and low lighting. Definitely make reservations as the place is space challenged :) We were greeted by our server who asked if it was our first time dining with them. He took the time to review the menu and provide recommendations. He also brought over delicious bread, made in house by Dwight himself.After his suggestions and our deliberations, we selected crabcakes for an appetizer. The crabcakes were meaty and barely had any filler. Considering my hubby and I are both Chesapeake Bay born, we are pretty picky about our crabcakes. These were some of the best I have had--lump crabmeat all the way! Our server brought over 2 bottles of homemade hot sauce, made by their bartender. It was a nice compliment to the meaty and sweet crab meat. For our entrees, my hubby had the filet while I selected the duck with a mango glaze. We must have been so excited about ordering our food that we missed the part when our server let us know our meals came with homemade ravioli! Chef Dwight makes this as well. It was a marcona almond ravioli, which was unexpected but an extremely surprising delight! Our entrees were generous in size. In fact, I brought a half of my half duck  home. The duck was rich and the sweet mango glaze was to my liking. Hubby's steak was prepared perfectly. Both our entrees came with a mix of seasonal veggies.Before I forget, the wine list was great. It wasn't a book in its size, but the selections were made by someone who really appreciates wine.The dessert selections were probably the least impressive of the meal. However the blackberry tort that we ordered was a pleasant way to end the evening.On our way out, we saw Chef Dwight, cooking away in the small kitchen. Love knowing that he was personally involved in the preparation of our meal!Now it is pricey. We dined here on a Groupon. However, I think it is well worth it for a special occasion!"], ["Celia W.", "I must post this. I never post bad things...but this must be said. I've had several people say \"go to Dwight's Bistro for dinner..they are great\". Not my experience. Several years ago, five couples from my neighborhood all went to a Christmas dinner together at Dwight's. One of our dear friends had a heart attack about 15 minutes after we sat down. There were two ER docs in our group. They immediately started CPR. My girlfriends and I all held hands and started praying. What does Dwight's staff do? 1. They never asked if they could help. We yelled for them to call 911. 2. They told us we were disturbing their other guests. One of the other guests was visibly upset by what was going on. 3.Once our friend finally left in the ambulance...the server (I use that term loosely) asked me who was going to pay the bill. We had a $75 bill for appetizers. I paid it...as I'm crying. Not once did they say hope all would be ok. not once did anyone ever call to find out what happened (they had our credit card info it wouldn't have been difficult to find us).Our friend died that night. Not that they caused his death in any way...but they absolutely made the situation worse. Worst treatment ever."], ["Caron B.", "Was expecting more. The escargot was good. The meals were unfortunately quite bland and we were sorely disappointed in the vegetables prepared as sides. We were served a quarter of a corn on the cob! How are we to be expected to eat this? I assumed that for $30+ a plate that we were eating in a fine dining establishment. I was served three jumbo prawn scampi style but they were just eh. The creme brulee was scorched although the custard was fine. I'm not sure how people have given this place such great reviews unless they've never actually experienced fine dining."], ["Matt B.", "I heard a lot of hype about this place prior to going. After dining there once, I find it overrated. I just don't feel that the price point is warranted. The food is really good, but not great. I like off the beaten path, but not a such at high price for a seemingly cheap location. I could deal with the prices if the place was located in a prime location at the beach, but not some hole-in-the-wall place in the middle of nowhere. Giovanni's or Mezza Luna are a better value, but if paying a premium for hidden gems is your thing, it's great."], ["Jeff H.", "Dwight's is one of those rare gems that is an owner/operator restaurant. The location is a bit off the beaten patch and in a little strip-mall off of Penman. The interior indeed has a Mediterranean flair with some beautiful tiling and a warm feeling. I will preface the review by saying my particular server was not what you would expect in a fine dining server. I was glad to know that this wasn't the norm since the table behind me had \"Chuck\" who was amazing. They have a very homey written menu with items that change.I started with the Escargot which was excellent. I selected a nice glass of Pinto Noir to go with it and it was very good. I ordered the Mixed Grill (Lamb, Quail, Fish, & Tenderloin of Beef). I really have to recommend this - it was perfection. I asked for a second glass of the Pinot because I was enjoying it and nothing else on the BTG wine menu jumped out at me. The East-Coast server came back and said they were out - and instead of asking what I wanted to replace it with said he would  bring something. He brought me one of the worst Shiraz's I've ever had. One sip and no more - again the bring and not ask and it was not much better. Their desert for the evening was Flan and had the caramelized top was consistency were heavenly!Again I want to emphasize the the food was wonderful and the only mar on the experience was this particular server. I'm definitely going back - ans asking for Chuck."], ["sovia l.", "Cari S. pretty much hit the nail on the head with her review.My fiance and I went there for dinner one night - no special occasion.  Just cause and we consider ourselves foodies and love trying out new places.  Plus we had a $30 Groupon coupon which nowhere near covered one person's meal.  Again, we were excited to go b/c of all the great reviews we'd read and heard.  Plus, there just aren't enough privately owned restaurants in Jax and so it's always nice to find a local gem.  I'll get to the point about the most important part of the meal - the food.  Not worth it!  You get fresh bread which was good.  We started off with the palm salad which I thought was really tasty but agree it's a little pricey for what it is.  For our entrees, my fiance got the sea bass, the special - it was a seriously small portion and it just wasn't a good piece of fish b/c it wasn't buttery like sea bass normally is.  The side of vegetables were ridiculous too - he too got the half cob of corn which we thought was weird.  It looked like bad hotel or buffet food.  And it was over $30.  I got the pasta carbonara - again looking forward to it b/c who doesn't love pasta - plus they make their pastas in house.  Another disappointment.  The pasta definitely tasted fresh - but not all that great and the carbonara was so greasy, you could the pools of fat.  The only good thing about this was the portion size for the money.   The second most important part of the meal, the service.  Horrible!  I seriously think our waitress was on drugs or something because she was totally out there.  She was really friendly - just wasn't with it at all.  It took her a while to acknowledge us once we were seated.  And we were so hungry we asked for extra bread while we waited for our entrees.  She didn't bring it out until much later in the meal AFTER we'd asked a runner to get us more bread.  So we had two baskets of bread taking up all the room on this small two top.  What really topped things off for us was that at the end of our meal when we got our check, she comped us the wine b/c we had to wait a while before she took our order.  We thought that we so nice!  Then we gave her our Groupon and credit card to pay.  Well, when we got our final bill, she had charged us for the wine even though she just said she was comping us for it.  We thought that was in really poor taste.  Oh, and for whatever reason, she gave my fiance two pens to sign the bill?!?  We enjoy fine dining and have no qualms paying the price when it's worth it.  It's not worth it at Dwight's - sorry."], ["Lisa P.", "The best in all of Jacksonville!"], ["Samantha C.", "My favorite restuarant in the area and a top 10 fav rest of all time. Dwight is always there to greet you and knows all of his regulars, including me (which I'm always an out of town guest). The filet, chopped salad, lobster appetizer, and sea bass are the best meals on the menu.  The crab cakes and palm salad as well as the veal are all acceptional as well."], ["dan c.", "I would give this 4.5 stars if I could. It's a dual-personality sort of place - mostly white shirted, professional wait staff with an occasional flake (see other reviews). Diners are either quietly enjoying a special meal out or they are laughing loudly at the bar after too much sun & chardonnay. Hard to figure out. But in our experience, the food has been consistently delicious and very solid. Not a lot of fancy or trendy options, but good. My steak was every bit as tender and flavorful as I've had at Ruth's Chris or other top steak houses. Salads are massive and pricy, which I don't understand, and not too different from what you can put together at home, so instead start your meal with one of the appetizer specials - always good."], ["Tim M.", "Extremely disappointed! We went with a party of five to Dwights as I had not been there in a long time. Was shocked when I saw the menu prices - prices were in line with a top New York City restaurant but the food or atmosphere (back street strip mall) was'nt. I paid $27.00 for a plate of 4 ravioli which were average at best. My wife and sister split an entree of crabcakes which cost $34.00 and UNBELIEVABLY they charged an additional $7.00 sharing fee. Lastly we brought our own wine as we often do and keeping with the overpriced theme of this place they charge a $20.00 corkage fee per bottle. Total bill was was (are you sitting down?) -- $309.00. Suffice it to say we will NEVER go back."]], "Black Sheep Restaurant": [], "Moxie Kitchen + Cocktails": [["Alenna B.", "So, wanna try a different on local cuisine?  Check out Moxie!  It's tasty and the atmosphere is cool...the only reason I gave 4 stars, it was a little noisy when we first arrived.  Hope to get a booth next time I sit inside.  Definitely plan on going back...want to try the outside sitting area!  Oh, and the calamari is amazing!! Must get that again!  It comes with bits of fried cauliflower and a very tasty dipping sauce...yummy!"], ["Jonny G.", "I had heard a lot of great things about this place, my wife and kids showed up with no reservations and sat outside with no wait.They have a \"Farm-to-Table\" approach so a lot of their ingredients are locally sourced.We did not get an appetizer, but my wife and I split a large portion wedge salad. We told the waitress that we would be sharing the salad and when they brought it out they had plated it on two plates for us.  It was a perfect portion size.The kids menu seemed to be made up of smaller portions of the main menu. Two of my kids ordered the flank steak topped with chimichurri and had a side of some fresh greens.  Cooked perfect and tasted great.I had the short rib, it was cooked perfectly, set on top of some very velvety mashed potatoes, and topped with shaved fennel, carrots, radishes, and a few herbs (dill, rosemary). All the portions were perfect, not too much not too little.Needless to say at this point, we were very impressed with the food.  I was just as impressed with our waitress and expect to be back soon. Bottom line: The atmosphere is great, wait staff is kind and courteous, the food is not cheap, but WELL worth it."], ["Kelli F.", "I loved the friendly service, flavors and knowledgeable people. Most folks don't choose here because they are vegan but I did and and they were very accommodating! Special menus!!! Amazing food and service thanks"], ["Susan S.", "I recently came here for lunch with my bestie, and we had a great time.  I will say that its on the pricey side, but you only live once right? Our server was very attentive, and also gave good recommendations..For starters we had the fried calamari with cauliflower and the pimento cheese toast..both were delicious! The presentation on the pimento toast was totally on point..We munched happily on those while deciding what to order for our entrees..She went with the crispy fish po boy and although it was good, she said there just wasnt much fish in it, and she probably wouldnt order that again..i had the scallops and grits..it was really good..i was told by the server to go with the whole portion rather than the half, and im glad i did..there was a nice amount of creamy cheesy grits and 6 scallops with green onions on top for a bit of a different flavor and crunch..overall it was amazing..somehow after having my leftovers boxed for me, we decided we had room for desert and i ordered the skillet cookie with salted caramal ice cream and she got a coconut cake..she thought her cake didnt have enough coconut..my skillet cookie and house made ice cream were the perfect end to this meal! we will def be back for a happy hour, the whole place is gorgeous and looks to have a nice outdoor area for when its not so hot"], ["Marjie C.", "Decided to have a late dinner date with my boyfriend on a Friday night.The atmosphere was great. Customer service was great. Our server was Devin and he was great with recommendations on what to get from the top popular dishes to his own personal favorite.Drinks: I ordered my boyfriend the Walk Don't Run. I personally didn't like it. I'm not a fan of anything bitter... haha. But he drank it. He's not picky. I ordered the Beez Kneez - with that being said, it has Gin which is my first time having Gin but this drink was so refreshing. It definitely hit me (I'm a lightweight!) Will be ordering it every time I visit.Food: OH EM GEE. My boyfriend ordered the filet mignon, medium temp... oh it was so tender, flavorful. He substituted the blue cheese bread pudding for mac & cheese. The mac & cheese was just enough for him to share with me. I really liked it. It had good flavor but it wasn't all that greasy which I loved. I'm a big mac and cheese lover. I ordered the short rib... again, so tender and flavorful. You just have to try it yourself!Dessert: I actually had room for dessert... and I don't regret it one bit. Boyfriend ordered the warm skillet cookie with vanilla ice cream. How can you go wrong with that? But what definitely made my night was the dessert I ordered: coconut meringue layer cake. Let's just say I want to order a whole entire cake for my birthday in the next 2 months... It was just absolutely perfect.Definitely coming back and trying other recommended dishes to update review."], ["Zach J.", "Can't believe how amazing the food was. Wasn't expecting it! Homemade soda was probably the best part. The moxie burger was probably the best burger I've ever had for sure. This place to me is original and that is what makes it delicious to me."], ["Emily S.", "Went here for our anniversary and everything was excellent! Service was especially friendly and the atmosphere felt like something you might find in an upscale lumberjack fantasy... in a good way.  We had the fortune of sitting in a large booth facing the open kitchen, where we were able to see endless streams of perfectly plated deliciousness. Their take on chicken and waffles was perfect and the scallops were a delight as well. Definitely would come again & highly recommend ."], ["Leslie B.", "After coming to Moxie over a dozen times and participating in their brunch for dinner birthday celebration last night, I have to change to review to a solid five stars! Although I still can't leave this place without spending $100 for me and my husband, they do have a regular and late night happy hour which is nice for the wallet!It's a very inventive menu which I originally thought was too inventive for picky eaters like my father, but he recently went and loved everything he ate! And I just have to mention the decor, the upstairs bar area and the booths to the open kitchen, it's just a fun hip place to be!Congrats on your successful first year Chef Tom!"], ["Angela Y.", "Scallops live up to their name. Drinks were delicious and stronger than they taste. Service was slow though. Don't expect to be anywhere if eating here. Great place to eat, drink, and hang out with some friends."], ["Daija P.", "Maybe we made the mistake of coming here on Valentines Day. No, it wasn't busy and we had a reservation so that wasnt the problem. The issue was that, being that it was Valentines and they had a specific Valentines themed menu, why not make it so that there is a more intimate environment? That was our only gripe. I will say that the staff is awesome! They even took our picture outside after dinner because I wanted to capture the moment haha. Now lets get down to what we ate! For appetizers we got the chicken livers. My bf loves chicken livers and they were a hit for him. This was my first time eating them and I must say, it was actually really good! They came covered in shreds of celery and dribbles of hot sauce. I ordered a cocktail (the name escapes me, but it was one of their popular cocktails. I remember I had 2 or 3, so it was a hit for sure lol) We both also had a wedge salad, not bad and for my main meal I had their pasta which consisted of tasso ham, tomatoes and some kind of sauce...not bad. I enjoyed it. And my bf had their scallop dish which was really rich. As for dessert, we ordered their skillet cookie with ice cream on top which was also really good. Overall we had a decent time. If we go back, it will definatly be for cocktails and chicken livers! I say give it a try. My stars are mainly based on the lack of intimacy for Valentines."], ["Steve C.", "Marnie the biz partner and I followed Tony here after a sales call at Brown Fertility nearby.It was a great experience, here's why: * Jai Alai IPA $4 each* My Short Rib dish was AMAZING! $25* Happy Hour Vodka $5.50 * Winter Salad $5 * Meat Loaf $5 * Seared Scallops $26* Add Shrimp $6* Bruce was our fine serverCheck it, Cabeza OUT!"], ["Sharon S.", "Due to a power outage at the Town Center, a group of us ended up at Moxie for burgers.  Our group was quite hungry, but decided we would suck it up and deal with the 30 minute wait time.  While we waited, a few of us decided to indulge in a cocktail.  I purchased the Walk Don't Run and it was pretty good.  After what seemed more like an hour, we were finally seated by the hostess. Since this was our Burger of the Month outing, we were all pretty much set on burgers. I decided on the Moxie burger with american cheese and bacon.  The burger really was quite tasty and included fries.  Yes it was tasty, however, I do not believe it was $15.00 tasty.I'm glad I finally got a chance to check out Moxie, but I won't rush back. If it had not been for the wonderful conversation and laughs, the wait would have made for an unpleasant experience. I understand the wait to be seated, but the wait for the food was way too long.  We arrived at this establishment shortly before 8:00 p.m. and left after 10:00 p.m. I've seen previous reviews commenting on the wait time and hope management will seek to correct the problem sooner than later.  Finally, they may want to consider including bacon as an option to their $14.00 Moxie burger rather than charging the additional $1.00."], ["Deprina G.", "I had an awesome experience when i first came here. The host could tell of ripp that i was looking for a plug and sat us in a both with a plug. Everyone was so nice. we were waiting for a friend to meet us and they didn't rush us with ordering. The waiter even took our picture for us and we dif appreciated it and left good tips. I had the Chicken and waffles. I swear I still dream of that maple whip cream tll this day!!!! its is served with a bread pudding made from waffle I mean this made my belly smile. I was already planning another visit before I finished my plate. after a certain time only half the store is open on a sunday night you can avoid all crowds"], ["Ryan H.", "I have not had the food here yet just a few drinks in their upstairs space. It's clean and trendy, but a little cramped especially if it gets busy. Service isn't or wasn't bad when I was there despite the bar crawl that was going on and it being shoulder to shoulder. I have to reserve this for another time when I can get a chance to actually try a meal there. Otherwise so far it's decent, but I think the prices here might be a bit inflated."], ["Susan H.", "The 1st time I ate here I was disappointed. I was so excited to try the chicken & waffles, and it wasn't what I was expecting or wanting at all. This time I went for dinner (last time was lunch) I stayed away from the chicken & waffles (maybe I'll be prepared enough to try it again next time!) we had the fried cheese curds for an appetizer (good by not great...what you expect for fried cheese) and I ordered the hand made gnocchi. It comes with braised oxtail, creamed leeks, roasted mushrooms & truffle oil- all things I love. It was amazing! The gnocchi was perfectly dense, and the braised oxtail gave it this perfect, salty broth. The creamed leeks offset some of the saltiness just enough, the mushrooms gave the dish some extra depth...and it is my personal belief that there can never be enough truffle oil. Perfect.And to make a delicious meal even better, I had my new favorite cocktail! I recently fell in love w/ the gin from the *relatively new* St. Augustine Distillery. At the suggestion of our server, I ordered a hand made soda (Moxi Crush- vanilla, orange & cilantro) w/ the St. Augustine Gin. It was fantastic...the flavors seemed to blend together perfectly. Loved it.I'm actually on my way back today. My husband wanted to go after he heard me raving about it...maybe I'll give the chicken & waffles another try :)"], ["Lilly C.", "I've eaten at Moxie several times. They have pork rinds that they make fresh in house. I've tried the pig legs which taste like chewy chicken. They have excellent cocktails with bars upstairs and downstairs. They have a great chicken & waffles. The burger is large, juicy and very flavorful. It's an eclectic menu with some interesting choices. Anything you choose with be delicious be prepared to be adventurous. They have an upstairs outdoor area that is great for drinks or dinner. The upstairs bar area is a great place to meet friends for a drink."], ["R. Thornton L.", "Overall, not a bad experience. I had been there before and thought the food was pretty good. This time it was more mixed. Kale with ham hock was excellent. Service was very good.  My guests's burger was cold, but French fries hot. Not really a made to order burger I'd say. Meatloaf was very good. Fried cauliflower was excellent - should be offered on its own!Great beer selection. Excellent wine selection. I really like the outdoor seating. If the burger had been hot, I would have given one more star."], ["Samantha P.", "The best \"from farm to table\" restaurant in JAX in my opinion. Stellar customer service, lovely set up and super fantastic private booths! Love, love, love Moxie Kitchen And Cocktails!!"], ["Toni B.", "The modern design of the exterior is really what made us decide to stop in here. After having dinner my boyfriend and I know we're going to be regulars. Our waiter was clearly new but absolutely wonderful, he was prompt, kind, and was able to give us information about the food. We ordered the PBR battered cheese curds, pig ear, and chicken livers for an appetizer, each one was amazing. The cheese curds were lightly fried and had a delicious \"beer\"taste. They came with the same sauce as the pig ears which I would liken to a much more easily edible crackling. The chicken livers were fried and dressed with a buffalo sauce, ranch, and shaved celery. We devoured every bit of it! For entrees I had the pork schnitzel which I cannot eve enough about, slightly needed and tender, it came with a 'redneck' risotto and homemade chow chow. Now I'm from the south, and I can honestly say this was the BEST chow chow I've ever had. The combination of all three really made this a savory and sour dish. My boyfriend had a burger which he added blue cheese and an edge that just would not be quiet about! Said it was one of the best burgers he's ever had. I also ordered a side of collards with ham hocks, again southern girl here, and devoured it. My boyfriend cannot stand dark greens and is basically allergic to the word 'kale' but we were fighting over these collards! For dessert we had a peanut butter mousse with chocolate exterior, soft peanut and chocolate crust drizzled with caramel and a side of brûlée bananas. The mousse was perfect, just a hint of a peanut butter taste with an amazing creaminess. This place was amazing, the atmosphere, staff, and food really couldn't get any better."], ["Jordan C.", "We were just here for drinks at the outdoor/upstairs bar. The venue was beautiful and modern."]], "The Brick Restaurant": [["Tiffany H.", "Hands down one of the best restaurants in Jacksonville. No doubt.I've been to The Brick for brunch and for lunch, and each time seems better than the last. The eggs benedict is a meal I swoon over in my head even weeks and months after the experience. They have several variations -- a tomato-mozz, spinach feta, etc. I love choices and variety so this in itself makes me extremely happy. The bloody mary's and mimosas are spot on. They do several different omelets and other brunch dishes that you'll be talking about for days.For lunch, they have a lot of excellent salads, the best (in my opinion) being the kale with grilled salmon. I don't know what they do to their kale, but I have never before or since had kale that was so tender, flavorful, and pleasant to eat. People and their bad kale jokes, be damned! Come to The Brick and see why kale is one of the best leafy greens you can get. The salmon is super delish and always cooked to perfection. Be prepared for a decent check, but it's truly not as expensive as it could be for what you get. A fantastic meal, very classy ambiance. If you're feeling underdressed, sit outside! Get in some people-watching on St. John's Ave, where you'll see hipsters and Ralph Lauren polos alike. If you've never been to The Brick.....do it now!!!"], ["Ouida P.", "I don't have anything but great things to say about this place. The food was delicious, the ambiance beautiful, and the service spot on. On our first trip, my hubby and I had the shrimp and grits and the prime rib sandwich. Both were delicious but nothing tops the shrimp and grits. Within a week, we were back arguing over who would get to order the shrimp and grits. The appetizer is the better deal and you should definitely get your shrimp blackened. We tried the larger portion and shrimp made a different way...we realized quickly, we needed to heed the advice of our first server. There's something about the flavor fusion with the portion size that just polished the equation of the dish. Don't get me wrong, the prime rib sandwich was very flavorful and certainly worth consideration. I think hubby had a sandwich on another trip as well. All DELISH. For me though, the signature (for now) is the s&g. There was also live music on one of the nights we went. I can't remember which night because I was probably s&g wasted by the time they started to perform. Nutshell: A great casual date night spot for grown folks craving...wait for it...shrimp and grits!"], ["Marie L.", "We love this restaurant; it never fails us. The service is always great and the food is not only delicious but consistent. They have the best Ginger Mojitos and best of all, they serve real food in until midnight on the weekend. We like the Caprese and the Poke Salad. The salmon (both types) is wonderful and the scallops are awesome. It does get really busy during peak dinner hours but they serve pretty quickly and move people out as long as they aren't campers. Although they turn over tables quickly, you never feel rushed.This is one of our favorite restaurants. Oh yeah, the patio is ultra dog friendly."], ["Linda B.", "This is our 2nd try here, just in case they having a bad day or something... The food just isn't that great here. Honey got  huevos rancheros and I ordered smoked salmon Benedict. The best thing I can say about my dish was that the poached egg was good. The sauce was very dense and thick, the English muffin was hard in spots, but didn't absorb the egg or the sauce. The salmon was very scarce, but that was ok since it was so fishy tasting. I order fruit as a side, instead of potatoes or grits. The service is still not great either. We saw the server to order, then waited more than 30 minutes for our food to be delivered, then she showed up afterwards to refill the drinks. There was no lack of staff. I do have to say the place was much cleaner and less dusty than the last time we were here. We were there at 3pm and the place was almost empty. I'm pretty sure we won't be back for visit #3."], ["Lab L.", "In town for a professional conference and a local recommended checking out the options in the Avondale section. The Brick was highly recommended. Great service. Great food. Highly recommend the crab cake appetizer (including a surprisingly delicious slaw), calamari, and the special flatbread with mushrooms and caramelized onions. My friends had a steak and the salmon salad. Both were very pleased with their entrees, too."], ["Lora H.", "We were in the mood for some late morning breakfast and had remembered a friend of ours who said that this restaurant had a great brunch service.  So off we went.  We were greeted with smiles that morning, and perused the menu to see what they had that was something unique that we probably could not have found elsewhere.  Needless to say we were not disappointed.  This place has a great brunch menu and I had to narrow my choices down to one of the Benedict offerings that they had.  (My plan is to go back and try the other one that was on my eenie-meenie-minee-mo list).  I ended up going with the smoked salmon Benedict and I was not disappointed.  The eggs were done perfectly, even to the point that I could have, if I had wanted to, rolled the yolk out of the egg on to my plate.  That may sound strange, but to me that is exactly how the egg was supposed to be cooked.  I licked my plate clean and wish I had another piece of bread to clean the plate even more.  It was a perfect helping and a perfect choice."], ["Morgan H.", "I personally think The Brick is great (however a tad bit overpriced). We stopped by here for brunch opting to sit outside since it was so pretty out. I selected the Biscuits & Gravy and it was delicious and a huge serving. I had no trouble finishing it all though :) I also had a mimosa (and bought one for a friend)....bill total $16 (for a breakfast dish that consists of 2 biscuits with gravy and 2 mimosas I think that's a little much). I will be back however b/c the service is good. And they have an awesome turkey sandwich on their menu."], ["Janna T.", "Awesome menu packed with unusual items like Kale salad with maple glazed Salmon, Baseball cut Hawaiian Sirloin and Prime rib poblano pepper quesadillas. Good happy hour pricing and Wednesday is ladies nite all nite long."], ["Elizabeth M.", "I gotta say that I wasn't wildly impressed with this place. The food was good, and pretty but nothing I would rave about. Our party got a few things so we could share and try out the variety but nothing really stood out. We got some calamari that was extremely chewy, so chewy that I felt like I was pulling a fruit chew away from my mouth. It was also fried a bit to long that it was very dark. When we mentioned it to the server he just said that its always like that, needless to say we sent it back and got the baked Brie. The Brie was pretty good. Came with fresh fruit and bread but again, nothing to rave about. We all had coffee and seriously we could not  figure out for the life of us why our server would not fill up our cups. He would fill it 2 thirds of the way and it got a bit on our nerves but we didn't complain because maybe its policy or some thing. The one thing that really did stand out were the grits. They were really good. Perfect flavor and consistency. The French toast was also pretty good but again nothing memorable or amazing. The variety of eggs Benedict was good and the food was good but I don't know, something just didn't rub me the right way about the service. Maybe I'll go back and give them a try again."], ["Jean L.", "Great place for breakfast.  This was my first time here and I plan on returning."], ["Chris G.", "Excellent service. Caesar salad was good, grilled mahi sandwich was very good."], ["John M.", "My margarita, lobster spring rolls, scallops, asparagus, wine, and bread pudding were great!  I even enjoyed the water.I, however, disliked the service that I received at Brick.  After arriving, I waited 20 minutes before a waiter came to my table.  It was annoying to watch half a dozen waiters walk past my table with no word of when someone might help me.  This needs to be fixed because good service is the reason why I do not mind spending a little more for a nice meal.  You can have good food, but it doesn't mean anything if you mistreat your patrons."], ["Justin N.", "Delicious food, amazing staff, and a great setting/environment. I will return. Has brunch consisting of juevos rancheros and home fries. Also had the Champaign mojito."], ["Morgan F.", "We have really enjoyed every experience we've had here. We have never had to wait too long for a table, and the service is efficient. We have tried multiple items on the menu and enjoyed them all. In the evenings some nights there is live music, which is nice. You can sit inside or outside. I would recommend this restaurant!"], ["Peter Y.", "A last minute decision to try this cool place turned out to be a winner. The service was exceptional but the ginger seared sea scallops were simply over the top good. We had a large party of guests and we spent much of our time with the, \"Oh you have to try this\"! Talk. Personally I really liked the quintet band they had. So much nicer than just another guitar band. Well done in every aspect."], ["Katy S.", "Hey brunch, hey!I'm a brunch freak and was happy to get a chance to sample the Brick during brunch time.  I love the set up of this restaurant with the beautiful brick wall.  Located in the heart of Avondale, this place is a visual delight.Based on Yelp photos I ordered the French Onion Soup which was absolutely perfect.  So cheesy and delicious on a cool Saturday.  I also hit up the Caesar Salad (also yummy) and washed it down with a Peach Bellini.Everyone at the table liked their meal.  My spouse got the Beef Carpaccio and really enjoyed it.  The dinner menu looked a bit expensive, but would be a great date night spot.  Very good experience!"], ["Jeff A.", "Brick continues to be one of my favorite restaurants in the area. I have been coming here for over 3 years and it is consistently fantastic. I love sitting outside on the patio in the evening. They never rush you so you can take your time and enjoy your meal and your drinks. It is a very casual but upscale environment. Our server Allison was great, we had such a good time there last night!"], ["Andrea J.", "I've always heard many great things about Brick - a hidden gem in Avondale. As a first time diner, I can definitely say that I was pleased. The restaurant itself is tucked away in cozy landscape accented with decorative lights and ambiance to match. If you know anything about the Riverside/Avondale area, you're aware that each store, shop, or restaurant has its own individual, yet unique, style. All of the menus differ in the area, offing items that cater to any palate. Brick's menu offers a variety of selections ranging from seafood to steak and chicken. I know that I am usually the hardest one to please in a crowd when it comes to restaurant choices, but when I looked at the menu at Brick, I was able to pick out multiple options that I knew I wanted to try. I started with the shrimp and grits appetizer which DID NOT disappoint. The grits were perfectly creamy, and the 5 jumbo shrimp were succulent. As our attentive server explained the appetizer portion, she described it as being enough for two people (it was) and mentioned that it had bacon and butter drizzle on top. The bacon was requested to be on the side, however when the bill arrived, there was a $2 charge for bacon. No big deal in the end, but it was something that sounded as if it were the slandered when ordering the appetizer, not as something added on. For the entree I ordered the maple glazed salmon with a jumbo baked potato - highly recommended!! The salmon was smoked, sweet but not too sweet, and was all-around delicious. My only thought was that the plate could use a little more garnish or greenery. The garnish provided on the plate was a tomato slice. I'm not a fan of tomatoes so I skipped on it, but if the taste of the rest of the meal was any indication of the tomato was, I'm sure it was amazing. The restaurant also offers live music. I'm not sure when this takes place. I dined on a Sunday evening and nobody was there performing. I'd love an opportunity to return and have the full \"Brick Experience\". As far as service goes, all of the waitstaff was highly attentive. Beverages were refreshed without having to chase someone down, food arrived in a timely manner, and management was on the floor conversing with guests as they entered and exited. This is certainly a restaurant that has won over a new loyal guest."], ["Cari B.", "The Brink is one of my go to restaurants for a casual dinner lunch or brunch . The staff is always friendly and knowledgeable bout the menu . All in all the food is really good . My last visit I was in the area for brunch and at the last minute had to change up where we had planned to eat and ended up at the Brick . I've had dinner/lunch several times and always been pleases with the experience but this was my first time here for brunch . Like all my other visits I was disappointed . I'm a french toast junky so I had to try that also ordered a side of bacon and cheese grits that wasn't listed on the menu but they gladly made for me . The french toast was delicious thick slices of Texas toast like bread with a side marinated strawberries and syrup . Simple yet amazing . The bacon was the perfect thickness and nice and crisp . The cheese grits fabulous , I want to say were the highlight of the meal but I don't want to down play anything else . Also had a strawberry Bellini which was to die for . After the meal I was quite honestly glad my other plans had fallen through and I got a chance to sample the brunch here . It's nice to have a neighborhood restaurant that's not just a one treat pony ."], ["James H.", "Ehh it's okay. Nothing special. Drinks took way too long and the food was not as listed. Crab cake didn't come with onion as told and the server forgot the sides. Home fries a bit cold. The poached eggs were way over cooked (they should be runny in the center). A lot of potential. Just needs better execution and attention to the basics."]]}