{"Athens Cafe": [], "Kabob E": [], "Greek Street Cafe": [], "Zodiac Bar & Grill": [["Tonya C.", "Some friends and I decided to check this place out last night... The food was pretty good, but the service was horrible!...our waitress was forgetful and never brought us anything we asked for...the only reason thru get 2 stars is because the food was decent..."], ["Bryson R.", "Their food is alright, but the bar is pretty great especially on happy hour... It's a shame they don't try to team up with the Volstead across the street and stay open later / offer drinks and hookah. It would be great to bar hop between the two."], ["Martina W.", "I work at the courthouse, so this is about a 5 - 10 minute walk from there. I'd say that it's worth it if you have an hour lunch. The staff can be a little rude at some times, but other than that, the food is delicious and reasonably priced for a lunch special. The 10 for 20 dollar deal is also a nice plus!"], ["Eryn S.", "I'm giving 2 stars because the meat was pretty tender and good. That was the only thing any of us enjoyed about our meals. My review would be a complete 0 if it hadn't been for that. Everything minus the tabbouleh and the meat was bland and tasteless. I can't believe how bad the hummus was. It was like they pureed some garbanzo beans and dumped it on my plate minus even tahini!! The service was slow and the waitress screwed up the orders. The atmosphere was nice but that's about it. I won't be back."], ["Cher H.", "Went during One Spark and sat at the bar. The ambiance was nice and the food was really good. Nice beer selection too. They have Dukes on tap. Looking forward to going back when they have a band on a weekend night."], ["Greg G.", "Did  the tapas gig with the Yelp deal...delicious!  I may have to go back for their $10 lunch buffet and use a Groupon!?!"], ["Julie A.", "Very fresh food, very clean restaurant. Place gets packed around lunchtime, but I am always satisfied with the quality of food here. During the week they have a lunchtime buffet ($8.75), but you have to purchase your drink (and optional baklava, which looked rather delicious) separately. The buffet includes Mediterranean food, such as pita and hummus and tabbuleh salad. They also have shepherd's pie, beef macaroni, and baked chicken. With my buffet, I ordered a cappuccino, which was very good. Service was good for the most part. There was one person who didn't smile, but they were still helpful. However, I have always left this restaurant with a happy and full tummy. Definitely check this place out."], ["Eric L.", "I work downtown in an office next door and always heard good things about this place.  Today was my first visit and my gyro was kind of 'blah' to me.  Tzatziki was bland, no feta cheese unless you pay extra, and fries didn't come out too fresh.  Maybe I'm too spoiled from a Tallahassee restaurant that I'd always go to.I'll give them another try since I hear their buffet is good from friends, but Adams St. next door will make that tough."], ["Josh F.", "Stopped by for a beer before art walk. Beautiful place with friendly staff. Price is reasonable. Check it out!"], ["Sean V.", "Great Mediterranean buffet!"], ["Benjamin W.", "Food was good for a buffet, service was good."], ["Paul I.", "Holy cow, this place was good. I was here for lunch on a workday. I am a vegetarian, and while the buffet has some vegetarian offerings, I decided to go for a falafel sandwich instead. And man was I glad to do that. The falafel sandwich was easily the best greek/Mediterranean food I've ever had. It's a pita, a layer of hummus, falafel, and topped with tabouleh, and that's it. And it's perfect. Definitely give it a try."], ["Andy L.", "2.5 stars - They've moved into a new location which is roomier, but I felt that the quality of the food on the buffet decreased a little....and maybe it's just me, but it seemed there were fewer dishes. Village Bread just passed Zodiac on my downtown lunch list"], ["Robert H.", "This place just misses the boat.  Tried it twice and was not impressed. Second time went in at dinner time asked for a Menu and was given a single plastic sheet and could not make heads or tails out of it since the Swordfish was cheaper then Chicken. I told them I am used to fresh fish and was advised \"don't\". That said I ordered the chicken kabobs. WTF not even on a stick or evidence of a stick through the meat. green pepper was  3-4 tiny slivers about one bite - not chunks. the chicken was good and tomato also to but the Couscous complete with a sprinkle of canned peas was tasteless. Pissed me off when regulars came in and ordered hors d'oeuvres from the back side of the menu that I had no reason to look for but likely would have been happier getting --- Overpriced--"], ["April S.", "Terrible. Waiter was asshole. Over priced for bland food. Horribly slow and incompetent. Pita was only thing edible but, come on, even a monkey couldn't mess up pita or couscous."], ["Pete J.", "Love it.  For lunch its great, because it's quick, it's a buffet.  Food as a good selection.  A little salad and little entre and you're set.  It's typicall full for lunch, but never had a problem finding a seat."]], "The Greek Village": [["ALex W.", "Amazing place with friendly staff and a great selection of food. I always say whenever I go in I'm going to try something new but I smell the lamb in the kitchen and I can't help but get a gyro. The desserts are really great too, I had the lemon cake and it was fantastic."], ["Jamie W.", "Wonderful family that own and runs this authentic spot. One of our favorites ever. Greek salad is large and fresh with warm pittas alongside  gyros are hot and yummy. Place is huge so a big crowd is no problem. Not in the best location as they sit back from the road but take the time to find them and you won't be disappointed."], ["Jasa S.", "Good food!Gyro soooo good could use more sauce and cucumbers but the sandwich is huge.Greek potatoes delishGreek salad pretty good..yummy fetaRice meal w chicken n shrimp is huge-hubby loved it.The feta-fabulous The ambiance is lacking-more like an old diner with picnic table type tablecloths. Has potential inside to be beautiful if redecorated Def casual."], ["Shannon K.", "So much wasted potential.  I finally made it to Greek Villlage for lunch today. The owners are super nice and the food is decent.  I am just not big on hearing a place has been open for 3 years and it seeming to be such a mess. Holes in cheap plastic tablecloths, a green patio that a little bleach would cure, huge runs on the carpet....yes carpet in a low key restaurant. I say low key kindly. If I walk in and am greeted by the owner holding a child while making food, it is definitely a low key place.  I prefer a separate lunch and dinner menu. If you offer appetizers at lunch they should not be as expensive as the entrees. I took the owners advice and got the Greek cheese for $7.99. She was kind enough to offer olive oil when she saw my disappointment when I saw the plate. Huge piece of cheese, two olives, one slice of cucumber, 1 slice of tomato, and warm pita (which was the best part of the dish)  The portion was very generous but that's about it. Hard to cut, not tons of flavor, etc. If your suggesting this and saying how wonderful it is, put a little thought into the presentation and ease of eating for your guest. Next up was the Greek Lemon Soup. Nice cup of soup, basically chicken and rice with a light lemon flavor. Then I ordered the gyro. I'm in a Greek place, don't really care for fries, can I substitue hummus for them, I don't mind if there is an extra charge. No, you have to buy the appetizer if you want hummus. I wasn't spending $7 for a side of hummus.Total bummer after hearing \"Authentic Greek Restaurant\". Once I saw the Cajun Chicken on the menu I knew it was a farce. The gyro came and was good but needed more of the sauce.I can have more but it is a dollar.Mind you I am here alone and I am calculating my bill to be about $20 at this point. Yes,please nickel and dime me. The gyro was fresh, generous portion, just way too little sauce and way too much onion.  When you precut an onion and let it sit overnight it takes on a ridiculously strong flavor and smell. I was going to order dessert but they were out of rice pudding and the dessert case was a mess. The cakes were not the least bit appetizing, one piece was even laying on its side in two pieces.  To sum it up, for a $26 lunch I will not be back. If they would spruce up a bit, it would be so much better. The food is fresh and portions are generous."], ["Lyds S.", "The Greek Village is right by the dollar tree off Blanding in op. It is not the easiest to see from the road, but it is worth the trip if you like Greek food. I went with family the other day and the service was good, as was the food. I had a beef/lamb combo gyro and added feta (if you like feta I suggest adding it). I did see someone suggest in a tip to order extra sauce and I think next time I will try to remember to do that. The gyro was good, but I personally prefer my food saucier. Overall a pleasant experience and the leftovers warmed up well in the oven."], ["Samantha K.", "Greek food is one of my favorite cuisines so I was excited to try this place when I discovered it near my job.On my first visit I ordered a Greek salad with gyro meat to go. I have to say I thought it was definitely overpriced. It cost $14, but was a big portion and came with pita and tzatziki. No grape leaves unfortunately though. The meat was pretty good, a little dry but still good. Loved their tzatziki sauce--super garlicky yum! Overall I enjoyed the salad, but from now on I order a regular gyro, or I get a side greek salad with a side of gyro meat (which ends up being more affordable with the same portion of meat and a smaller salad). Also, I love their traditional Greek lemon chicken soup. Very creamy and a great flavor. For just a couple of bucks I always order it to accompany my meal. All in all, I enjoy this place, but I would go there more often for lunch if the prices for their salads was better. I mean $12+ for a salad for a work lunch starts to add up! Add in a drink and tip and you're looking at a $17 meal for one."], ["John K.", "Shows promise, we arrived near closing time, did not feel particularly welcomed.  NO ice tea, which is cardinal sin in the deep south! Humus appetizer way too much garlic, still next afternoon, doing noisy cartwheels in my ample gut. Main meals range from good  greek salad & chicken steal to an absolutely delicious gyro meat diner and a jumbo sized gyro pita sandwich.  Worth visiting again, in-spite of early faux pas, waitress made the difference."], ["Gary C.", "First time here. Not a bad place but needs improvement. Seems like they had just opened. I was told that they are placing a grill outside so they can offer more items like grilled octopus, which is a personal favorite of mine. I will go back again and give them another try as they have potential to improve."], ["Brandon L.", "Best Gyro...EVER! The house gyro was AWESOME perfect bread and meat! Huge too! Recommend trying for sure"], ["Angela D.", "Great service. It's been quiet inside each time I have been. The food is great. I loved the gyro and also the lamb sandwich. The lemon soup is also very good. This definitely seems like a family owned restaurant which is fantastic!!"], ["Heather P.", "Started with a side Greek salad which was okay. Then had the village gyro (lamb and beef) the meat in it was delicious. It could have used less sauce and onions and more cucumbers. The fries it came with were good. Overall good food and it came out hot and fast."], ["Kat V.", "Gyros are pretty good. But I tried their other stuff and it wasn't that great. I wanted to try the lamb shank but the waitress said oh well that's like $22 and I'm like.. Ok fine I'll have something else. Later she was rude since she saw my friend only ordered coffee since he met up with me later. Overall there are other places to go. Usually empty here"], ["Vyacheslav C.", "Been here eating gyros. Not too bad food and prices but very simple interface inside. Dirty tablecloths and modest furniture. Reminds me the dining room in the USSR. It's not bad...but it could be better."], ["Tiffany I.", "We thought this might be a hidden gem but sadly, it's not. The grape leaves were clearly canned and flavorless. The gyro was pretty average. Nothing special. My husband got the meat plate and the chicken and pork were dry. The restaurant needs a serious face lift."], ["A S.", "True authentic Greek cuisine..This restaurant  family owned and operated.The Gyros are delicious."], ["J N.", "OMG Great Greek Food! They have been in the area for years are experts on Real Greek food. They are building a patio area that is going to be so nice in the Fall and Winter."], ["Christina S.", "Great food and the portions are HUGE, ask for Sasha she will take great care of you. The Spanakopita is a delicious start, we had two gyros and could barely finish them. The price for the amount of food is great as well."], ["Nelson Q.", "Excellent food! I really enjoyed the beef/lamb gyro platter, and the saganaki was good. Location is ok but this place is a hidden gem! Highly recommend you try them out."], ["Jennifer M.", "The hummus and pita were amazing for an app. Everyone but me got the gyros and loved it. I got the spanokopita plate and potatoes amd it was delicious.  It was not a place with atmosphere but the food was excellent."], ["Adam H.", "\"I've had better\" about sums it up. Bland boring basic hummus, weak salads, and tough chewy meats (both chicken & lamb) left my wife and I very disappointed. The final bill solidified our decision of no need to ever eat here again.I love Greek food; gyros, lamb, kabobs, z sauce, all of it. Unfortunately, this place just failed in all aspect on the plate."]], "The Southern Grill": [["Ka N.", "One of my favorite lunch spots! Cajun fish with red beans and rice, cabbage, corn bread is my go-to. Lots of food for a good price, comes with a drink."], ["Mehgan P.", "This place is so good! And the staff is very friendly! We got there 15 minutes before they closed and they took our order with smiling faces. The food was terrific! Juicy beef brisket and savory mac n cheese! The fish tank kept our attention until our food was served which wasn't long at all. We just loved the overall friendliness and atmosphere of the place!"], ["Rhonda S.", "This is our first visit at this location and I can say it will not go back. The pulled pork sandwich was good, the coleslaw was good, but the baked beans were probably the worst I've ever had.What bothered me so much was the rudeness when I asked to order from the kids menu. Not everyone asking to order from the kids menu are cheapskates. Some like me can only eat small portions of food at a time. To pay $10 for a sandwich and a side and only able to eat half of it did not make me a happy customer.I do not think this restaurant has a concern for pleasing their customers. And I have many concerns for wasting my money."], ["Jess M.", "Sooooo tasty. Eat the ribs. Or the pulled pork. Or breakfast. This was near our hotel. We were in jacksonville for 2 days. We are there four times. I wish it were 6 !"], ["Michael M.", "Pulled pork was good - brisket unexceptional, but prices reasonable and clean.  Breakfast can be ordered all day long, which made my daughters happy.  The smell of smoked meats and barbeque ehen you open the door smells amazing.  I am sure I just ordered the wrong thing."], ["B H.", "Joey Farrah is a game changer. The restaurant staff is professional and very organized. The menu is delicious. I recommend the BBQ omelet for breakfast and be sure to get the BBQ for lunch w/ beans and slaw for a side. Highly recommend!!!!"], ["Katie C.", "The Southern Grill could very well be a four-star restaurant, but I've only been once, and my experience more three-star. (Oh Yelp gods, why can't we give half stars!?!)Located just north of 95 on Flagler Avenue, SG strikes me as a prime lunch location for downtown worker bees. I immediately liked the homey vibe when I walked in, even the somewhat-out-of-place, giant fish tank in the center of the room, which otherwise looked like my grandma's kitchen. A chalkboard near the entrance displayed magical words like \"Collard Greens\" and \"Mac N Cheese,\" and these also comforted me. I grabbed a menu from the counter and WHOA, WAIT, WHAT? It was huge! Omelets, Pitas, Meatloaf, Kibbeh, BBQ Pork, Cubans, Pancakes, Burgers, Taco Salad... I mean, seriously, this menu was crazier than Carly Rae Jepsen.After 45 minutes, I finally decided on the Pulled Pork Cuban Wrap. The owner, Joey, came by to greet us and let us know they took orders at the counter, which was fine. (I just needed to sit for a second and digest that menu!) He also informed us the BBQ meat was fresh off the smoker, which helped me make my decision.Our food came out quickly, and my sandwich looked great, as did the side of Mac N Cheese I just had to order. My pal got the BBQ Omelet, and it was huge! My Mac N Cheese was, in fact, very good, and I'm known to be pretty picky about the mac. My sandwich was kinda just mehhhh though. The meat was nothing special and the cheese had that rubbery thing going on. Oh well, I still enjoyed the first half. My girlfiend's omelet looked good, but when she cut it open we saw it was WAY overloaded with meat -- seriously, like an egg blanket wrapped around a chopped hunk of pork, turkey, AND beef. Whoa.. for breakfast?? Get out the Tums. She said it tasted pretty good despite being a little overwhelming.Joey came back to check on us and we chatted for a bit about the Grill and Jacksonville at large. Although my food wasn't stellar, I liked the place and the owner and, with a giant menu like that, I can definitely see myself going back again. I'll stick to my usual Biscuits and Gravy next time though!"], ["Nick H.", "This is not a Mediterannean. It is more like \"Southern\" style food as the name reflects. It serves mostly bbq items.Breakfast is great here and a deal. I got the breakfast bowl with bbq corned beef, grits, egg, cheese and more. It was about 4 bucks and I had a side of hot coffee. Absolutely yummy.The hostess was extremely friendly and helpful. She navigated us through the menu items fairly quickly with great detail on what we would expect with each dish. I am a fan!"], ["Alex S.", "I love this place. I wish it were open later though.Every weekend I think about going there, and then I realize they close at 2.Must be nice for the staff, but can a brother get some PM BBQ?!"], ["Despina P.", "Great spot for lunch. I work within walking distance so this is a favorite of the office!I've never been disappointed. I've had anything from pork sliders to giant salads and everything is made to order and fresh.The place does get packed around lunchtime so it's best to call ahead if you can just get to-go. If you dine-in, go later in the lunch hour - but before 2:30 closing!The tables and booths are situated for optimal seating so there is just enough room for everyone. Standard southern fare is offered with daily specials and lots of BBQ. Everything is just like your gram would make it! It's great for a really filling meal.Just be warned, the smell of the food will stick with you all day - not that it's a bad thing - you just may have lots more cravings."], ["Sarah J.", "Visiting from Houston, I had to take the local Florida barbecue for a spin. Met the owner who delivered a special-made sampler plate of all smoked, no-rub meats and bottles of house made sauce. The ribs were the best part and I recommend the Hickory Sweet. Delish!"], ["Artsy X.", "The reduction in stars is for price--just a little high for a greasy spoon diner. That said: Egg and cheese fried up to perfection, yoke and white stayed a little separate, bacon thick and good quality. Ate here for breakfast. Definitely a greasy spoon. Tea: very, very sweet. I half and halfed mine. Menu: $8 breakfast combo plate, $5 breakfast sandwiches, which is a little pricey. Features: saltwater aquarium3 types of BBQ/mustard on tableMore than a dozen veggies on the board"], ["Reginald F.", "Breakfast bowl was great with the spicy sausage. Excellent mix.  Food was so filling that I couldn't finish my French toast which was great. Service was very nice & pleasant.  Felt like home."], ["Burger G.", "Our search brought us to the Southern Grill located at 800 Flagler Ave. This restaurant offers a variety of dishes which one of them is a burger and that is why we are here.Let's get right into the review, shall we. As you can see from the picture the burger arrived like what you expect the typical American burger to look like. It looked perfect.Just the smell alone coming to the table made your mouth water. I was shocked taking my first bite how good it tasted. It was perfectly cooked exactly how I wanted it. Everything tasted fresh, homemade, cooked fresh. I think we all were shocked how good this burger tasted. The size was perfect. Not to forget the fries, fitted perfectly and tasted great as well. The only thing that was missing was that shake to make it the 'American perfect meal'.  Which it had a wow factor to it, which I always look for, but other than that.  If you are looking for a great hamburger then this is the place to try, highly recommend it. Hmmm actually thinking going back for another one........P.S.  Love the staff in there, always helpful, even with special orders.  Just a great place.Burgergeeks.blogspot.com"], ["Ron C.", "Not bad. I had the breakfast burrito. I was expecting salsa and sour cream.  A little bland but overall good. I would come back and try a different dish."], ["Jay K.", "Nice little breakfast and lunch place.  Stopped in for breakfast while staying at a nearby hotel.  I had the pulled pork omelette, which was massive and tasty.  The pulled pork was tender and had a very smoky flavor.  They are only open for breakfast and lunch, so it is similar to First Watch or other such places.  They are located near one of the elevated train stations (as in, directly across the street) so it's accessible even if you don't have a car."], ["Bob S.", "Had lunch with a co-worker here yesterday.  When I worked downtown, this was a pretty regular stop for me at lunch.  The food is very good, and reasonably priced.  Order and pay at the counter, and they'll bring it out to you.  Parking can be an issue here, as they're wedged into a small lot with what amounts to an alley on two sides of the building.  There is some commercial parking nearby, but you'll have to walk (horrors!) a block or two.I -believe- they're open on the weekends for breakfast."], ["Cecilia B.", "This place is amazing. I have eaten both breakfast and lunch here. The food is fabulous. I ordered the turkey, bacon and cream cheese panini. It's a must have! I also ordered a tailgating special before a Jags game that came with pulled pork sandwiches to die for! Highly recommend. Great, sweet staff. :)"], ["Brian P.", "Breakfast and Lunch only.  Open 06:30 - 2:30.Solid Southern comfort food.  Lot's of your favorite sides to go with your meal.I had a fantastic Meatloaf sandwich with coleslaw.The red beans and rice with sausage look awesome.  I'll definitely be going back.Very inexpensive.  Credit cards accepted."], ["Julie A.", "Hot, fresh food, affordable, and great service.I came here yesterday with coworkers and I was pleasantly filled afterwards (and I still was for dinnertime, Haha). To my surprise, they have quite a few Middle Eastern items, but too bad they were not available that day. (What is the deal with food I want to eat being unavailable everytime I want to try it?)I ordered the meatball stroganoff with sides of tabbouleh, and hummus and pita. My meal came out pretty quickly and the stroganoff was piping hot. That tabbouleh was very fresh. Must have been made that day. They also added some cornbread with the meal, but unfortunately I was too stuffed before I could try it. You don't have waiter service, per se, but there was a lady who would come by time to time to clear our plates and ask us how we were doing. Very friendly, Southern hospitality."]], "Mandaloun": [["Tammera S.", "****** RESPONSE*********Sir, I love when management responds to reviewers. Yes, it was my first time. Mom and I are in Jacksonville often. Yes, I absolutely will try your restaurant again.Thank you!The 5 stars are for you responding."], ["Mylon P.", "Order: Side of hummus, and two chicken gyros with a side of lentil soupPrice: about $30Pros: Absolutely THE BEST tapas (hummus, grape leaves and falafel specifically), their Turkish coffee is amazing, they have wonderful outside seating, they happen to be in the same center as a different phenomenal coffee shopCons: The \"normal\" Greek food is only \"good\", sometimes the service can be pretty slow (especially sitting outside), lot of people do smoke outside towards that coffee shop so if you're sensitive then sit insideThoughts: I absolutely love the hummus here, it is easily the best I've ever had (short of this place in Tobago). In fact all of their tapas are phenomenal but I'm a particular fan of their hummus and grape leaves, they just do it so well. On top of that their Turkish coffee....oh my god....so stinking good. Top this all off with outdoor seating and this is a favorite spot to hangout for a while with tapas, friends and coffee.Unfortunately I've had several different entrees and none of them hit quite the same level of awesomeness as their tapas. It's not that its bad, it's just that I always end up thinking I should have just gotten more hummus. I'll also say that while I love outside seating the people at the coffee shop further down the way tend to smoke a lot so if you're allergic you may want to sit inside.Ultimately this place is AMAZING for tapas, and you should definitely go...just order more tapas rather than more food."], ["Alyssa P.", "We dined in around 4:30 or so think we were the only table there.  Ordered the hummus, calamari, and Chicken Kabob.Hummus - was ok; definitely not the best. The pita was really good and tasted homemade. Calamari - my daughter liked it a lot bc she said the batter tasted like mozzarella stick batter. I agree on the batter taste. Texture was chewy and sauce tasted like salsa, not marinara. For nearly $10, I expected it to taste better with more pieces. Shish Taouk (Chicken Kabob) - Dish was colorful, veggies cooked perfectly. Chicken pieces very tender and flavorful. They also removed the pieces from the skewers which made it effortless to eat. I can make very similar kabobs at home so for almost $15 I feel it's over priced and besides it's just chicken. The dish price is comparable with an entrée that contains seafood. Service was fine lol since we were the only table there."], ["Angelo K.", "Food is good. Server smells like a bottle of VODKANever stop by to the table HORRIBLE. Giving 2 stars beacuse of the Food. If they will fix the service this place will rock n roll!!!"], ["George I.", "My first time dining here was a delight. Both, my mother and brother, enjoyed this restaurant, as well. The service was exceptional, the food was remarkable! It has a fancy feel to it, a restaurant where you would have dinner and show at. We ordered the hummus, which was warmed up and served with pita (which our server kept refilling every 5 minutes)! It tasted a bit better than the hummus I usually purchase at Publix. Then we moved onto the main course. We ordered the mixed grill and beef and chicken shawarma. The mixed grill comes with 3 meats: beef, chicken, and lamb. We chose the seasoned potatoes on the side, which turned out to be exquisite. The meats in the shawarmas were excellently cooked and seasoned. I highly recommend this restaurant. It's a nice setting, excellent food, and you'll be thinking about it long after the meal is over."], ["Michael A.", "My first time at Mandaloun Mediterranean Cuisine was an overall positive experience. You really can't judge a book by the cover is the motto that I would use with this place. The outside appearance of the strip mall where this restaurant is located is deceiving because the inside decor is really well put together. The inside was very clean and nicely arranged. The ambiance created by red walls (#50shadesofgrey) mixed in with the fresh flowers at the table and slightly dimmed lights give a nice ROMANTIC vibe. I would really recommend this place for a date!The service that I experienced wasn't as pleasant as other reviewers may have experienced. My date and I went there around 8pm, and the restaurant wasn't too busy. But, I believe our waiter was maybe new or maybe they were short staffed at that time because the wait to get our order placed was pretty excessive (~20mins). There was also times where my glass of water stayed emptied for a period of time. HOWEVER, when the waiters were there, they were super friendly and nice. I would HIGHLY recommend the MIXED GRILL! Each one of the grilled meats were very TENDER and very well SPICED! If you are unsure of what to order, I would recommend this plate too because it gives you variety of different meats just in case you don't like one! I doubt that you wouldn't like any of them ;) The appetizer that I recommend is the COMBO PLATTER. You get to select different types of dips and items to use with your pita bread. I picked the Hummus ( very good! made from fresh chickpeas), Tabbouleh (very delicious-It was my favorite!!!), Labneh (tasted very fresh and it was some of the best that I've tasted), and Fatayer. I went on a Friday, so we got to enjoy a belly dancing show. The dancer was very good and interactive with the customers. She didn't seem to bother anyone by being able to see what customers wanted to interact with her. Very professional and good show. HANDS DOWN... YOU MUST TRY THE BAKLAVA!!! IT IS AMAZING!! I am not for sure if they make it freshly there, but it was the best tasting Baklava that I have EVER tasted!! I would highly recommend this place to anyone."], ["Jesse C.", "The owner was friendly but I guess they had to be. Food was great but kinda expensive for me $24 for 4 pieces of tiny 3in lamb chops.. Would be back for special occasions. Be careful when you change your sides within 2-3 minutes they'll still charge you even if the item has not come out of the kitchen :-) but if they mess up they make it up."], ["Sonia T.", "The food was great! I wasn't excited about the falafel but at least I can say I tried it. The hummus was the best hummus I've ever had. I was hoping the Fatayer was similar to a Spanikopita but it wasn't. It was ok. The service was superb and the main entree was perfection. The ambiance inside of the restaurant is very relaxing and welcoming. There were multiple door stop delivery people picking up orders there so I knew the food had to be worth it. The salmon was full of flavor and not overcooked. The vegetables and potatoes were perfect. The yellow rice had a lot of flavor but I like the potatoes over the rice. The mixed grill was tender but next time I'll order two chicken kabobs instead of the lamb. We usually love lamb but the minced lamb wasn't my favorite. The next time we're hoping to try a dessert."], ["Steve G.", "My wife and I have been here several time in the last few months.... for both dinner and the lunch buffet. It is my Top 5 list of favorite restaurants in JAX. We almost always get the Grand Mezze...  it's $60 for 2.... but OMG.... so much GOOD food... there is plenty to take home. And all the things you get in the Grand Mezze are great as left overs. The food is ALWAYS fresh.... you can tell. And the owner Pierre is ALWAYS walking the room making you feel so welcome. Service is great. The prices are good for what you get. One dish I tried on our last visits was their version of moussaka.... and they make it in a Lebanese tradition, which is different than what you will normally fin d at a Greek restaurant. It was amazing! Pierre will \"custom\" make pretty much make whatever you ask. For instance, my daughter is Glutton Free... and he made several 'refinements' to a dish she wanted to try... all with glutton free ingredients. He even had half way decent glutton free bread he served in a separate basket. Please do not let the (what I think) unattractive exterior of the building deter you from giving Pierre and the Mandaloun restaurant a try. You will be happy you did. As a side note... I like to walk next door and get a cup of after dinner coffee from the little cafe to the left of Mandaloun. Great coffee drinks, and its small and independently owned."], ["Vanessa T.", "Went here for dinner, we have been a few times and I really love the food, actually the whole experience.  Its tucked into a strip mall off Baymeadows the inside is decorated nicely.  The owner is always there walking around talking to people, making sure you like everything.  I think on fri and sat nights they have a belly dancer also.Now to the food.........its all so good!  We started with an appetizer of the combo plate where you could pick 4 different apps.......there are alot of options in the appetizer area, cold, hot, baked, salads, they have names that are probably unfamiliar also so best bet is to ask server to help in this area, but the combo plates are great to sample a few things.....we got meat pies, cheese/spinach pie, kibbe, and Fatoosh.....WOW everything soooooo good!  I really love the Fatoosh Salad, its a salad with toasted pita mixed in, its just so good....my husband who is a picky eater really liked all the apps.The entrees:  we got  Mixed Grill, which is three kabobs (lamb, beef, and chicken) and a side ( rice, potato, veggies)....the meat was marinated and cooked perfect.  Just perfect!!We also got the grouper which was in a lemon butter sauce...we both didnt really  like this too much, too lemony for our taste.We left stuffed and happy!"], ["Michael C.", "Located in a busy but non descript shopping center, this is an authentic Mediterranean spot in the middle of suburban hell.Lunch time offers a substantial buffet with several main entrees along with plenty of side dishes and a few deserts. The menu, which is available for lunch and dinner, runs the gamut of expected meals and of the several we tried, all were good.Service was friendly and competent and the owner came out to great several tables which we felt was a nice touch."], ["Brian S.", "It is hard to write a review about this place without writing something as long as War and Peace, so I will try to keep it brief.I came in thanks to Groupon, and was blown away by this place!  It is a great date spot (and one that I have in my arsenal to use soon), or just for a casual dinner.  Their wine selection was okay, but the food is the star.  Tabbouleh, homemade hummus, and/or grape leaves are the way to start, and everything after that is guaranteed to be a winner.  They even have non-Mediterranean dishes (like Chicken Cordon Bleu) for those who are not excited by exotic/delicious food.Stop in and prepare to be impressed!"], ["Rasha A.", "Terrible experience, I am not sure why people love this place! I bet it used to be much better than it is now because the food was so terrible I could not eat anything I ordered. On a good note, the desserts were actually good and were served to us on the house to make up for the very bad service and this is why I give it 2 stars."], ["Lynn P.", "We walked in with great music and belly dancer. Not the greatest service. We waited for a while for someone to come and give us water and took our orders. We waited a while for them to come and take our order for desserts so we decided not to get any. The food was edible. We got grape leaves and we were not able to eat it. Not sure how it was suppose to taste but I was so sour we  couldn't take another bite. I got the beef kabob and it tasted like any other beef. Nothing really special about this dish. My friend got chicken kabob and it was ok. We did however enjoyed the culture music and dancing."], ["Jenna G.", "They have the best hummus ever. It's a good Lebanese restaurant, not the best I've ever been but it's very good, especially for Jacksonville. Very child friendly which is great for my husband and I."], ["Anna H.", "Wow what a knock out time we had last night at Mandaloun. The usual suspects  (9 of us) assembled to test out the food flavors from Lebanon.  I can assure everyone this is far and beyond the usual \" Mediterranean\" food I have found in Jacksonville.  After we were seated our person of the night Casey served us water and quickly brought us Pita with dipping oil for the table.  The bread was fresh, warm and the oil light and salty on the tongue.  Just about that time Chief Pierre introduced himself to us, inquired if we had any questions about the menu and suggested we may allow him to put together a combination of many items family style for the group.  I found this a brilliant move since many of the diners had never experienced this cuisine before but it was voted down.  There are so many wonderful choices on the menu I was willing to let him decide.  I started with the Foul Madames a delightful combination of  Fava beans specially prepared with garlic olive oil and lemon juice.  This warm dish brought out all the flavors of the Fava beans @ $8.50 there was enough for everyone to taste test and still have extra.  Others on the line up for Mezz were the Falafel (6 pieces)   Crispy deep fried of ground chickpeas, broad beans, herbs, spices and tomato. Served with 1 side of tahini. Again perfect in every way and we shared. Hummus, Tabbouleh, Baba Ghanoush. and Grape Leaves we were all in, the the dishes were flying around the table to groans of delight.  When it came time for the entrees one of the owners assisted us in our decision, pronouncing the dish as it should be, explaining the heat, taste and flavors of what we were selecting.  This made life easy, what was not easy was the actual decision.  But here we go.  I am not going to bore you with all the ingredients, that way if this review sparks you go and try it.  Just know that nothing was left, there were 9 separate dishes and several converts to this particular restaurant if not the food.  Outstand dishes the Lamb, Veggies grilled, Beef Shawarma, and Mixed Grill.  Rice served with the entrees was probably the best tasting rice in any restaurant I have tried here.  Pierre continued to check on us through out the meal, which is pretty extraordinary.  Some brave souls ordered dessert to go.  I did ask it they could put together a small sampling of the dessert menu for us to share and they accommodated us immediately. This type of service is common in Europe and the Middle East not so much here in Jacksonville, so another 5 stars.  We were presented with 2 plates of traditional food stuff,  Baklava, Maamoul, Rice Pudding made with Rose Water,  what a new taste treat and Layally Beirut.  I was happy they did not serve the Tiramisu.  Is that on every menu in the world?  This is definitely a go back to restaurant.  Look at the website, get a group of good friends together and set off to be impressed."], ["Maggie O.", "Hummus is great and the wait staff was amazing.Didn't care for the sauce on the chicken Schwarma though. Nice quiet atmosphere."], ["Erika B.", "My husband and I went here for date night because I scored a $25 restaurant.com giftcard for $3. We were a little confused as we were walking in because it appeared that there was a DJ set up at the end of the sidewalk near the end of the building. Um, club Baymeadows anyone? We went in around 8:30pm, seated immediately but had to wait about 10 minutes before we were acknowledged for a drink order. After that, our service was vastly improved. We had two appetizers, the grape leaves and the spicy lamb sausage. Both were amazing. I opted for the mixed grill and my husband went with the fried fish. Both dishes came out fresh and extremely tasty. It was a fabulous atmosphere for a date night and we will definitely be returning! (Although, still extremely confused by the DJ and young kids all hanging out in front)"], ["Fina L.", "I asked the lady server if they have mussels and she walked off stating \"I don't know' Yes the service sucks, 6 king prawns medium size are ok but not worth $18...I finished my prawns with pieces of carrots & zucchini ...they forgot to serve my salad, they must serve salad asDessert...would not recommend!!!"], ["Sheldon M.", "The food was great. The ambience was nice. The evening entertainment (belly dancer) was a pleasant surprise. This is my first time there and had a great time with friends as I celebrated my birthday. Great experience and recommend for a couples date night or a small group gathering."], ["Danielle S.", "Great Greek middle eastern feel. I had the gyro and it left me disappointed on the flavor aspect. My husband had some sausage type thing that was delicious. The service was excellent and the place was very clean. I guess I just ordered the wrong thing."], ["Juan G.", "Excelent quality of food, service is outstanding , decoration according to the style, good prices.Higly recomended.My family became  frecuent custumers since the first day.We have been  to many middle eastern reataurants all over the world  and is one of the best. The cheff is from Lebanon."], ["Paul C.", "We eat here at least once everytime we come to Jacksonville.  The food & service has always been excellent except for this time. The food was very good on 11/26/14, but the service really slipped from our previous visits. Only one other table occupied when we arrived yet we waited 10 minutes for the server to come & take our drink orders. Then it took another's  10 minutes for him to bring the drinks & another  10 minutes for him to come back to take our food orders. I had the vegetarian platter which was very good. My wife had the red snapper which was also very good.  The others in our group also enjoyed their food, but not the service. With many choices in that area we will try another Middle Eastern restaurant on our next visit."], ["Ryan S.", "We dined here tonight on the recomendation of my sister in law and I have to say all the food is great. I will get to the 2 star rating after the food portion its a doozy.We started with the grand mezze and the fattaya. All was amazing but the baba ganoush was the star of the plate one of the best Ive hadThen went on to the mixed grill and 2 of the lamb kabob plates (cant remember their names one with chili spices one with eggplant) all were amazing.Now the desert the baklava was good but would have liked more nuts and the doozy was in the nammoura while very taaty like a honeyed corbread I chomped down and a huge chunk of a broken plate or dish baked into my cake amd cracked a tooth. To which I was told the were sorry and took 8% off my  check didnt even cover the cost of the dessert that was the culprit.  hardly gonna cover dentist cost due to their neglagence. I understand mistakes happen but really on top of it all was impossiable to get our watter refilled the whole evening except by another waitor named z he was pretty awesome. But our waitor was prettt bad had to remind him of everything even food to go boxes checks multiple times. Due to the service and a cracked tooth is the 2 star review. What started out to be a great dinner went seriously downhill."], ["G Race B.", "Hidden gem! Tucked behind BOwl of Pho in the Publix plaza, on the corner of Old Baymeadows Rd and Southside Blvd. Service -two thumbs up for all of the 3x I've dined here.  Food is excellent.  Everything that came out to our table seems to have been made freshly made. You gotta try the Tabouleh Salad! The Fattoush Salad was even Better!!!! OMG!  lol.Fridays and Saturdays, they have a belly dancer every hour from 7-9pm. Pretty CoolOwner was VERY friendly and accommodating!!!If you haven't tried them.. you've got to!"], ["Nat P.", "Worst service by far we ever had from a restaurant, my husband left disgusted from the treatment we received as an interacial couple. They made it very clear tonight that they will not service certain races. We were serviced thirty minutes after sitting down and that was only for our drinks. Interestingly enough a couple literally walked in and was serviced immediately. To top the icing on the cake when the young waiter finally brought the food to us almost an hour later... he nearly dropped the food on me, I watched the staff waited hand and foot on the other guest while my husband had to make several hand gestures to get some service. Our meal ended without getting asked for refills on our drinks nor did anyone cared to ask how was our meal. My husband and I are upper class people and have dined at the finest restaurants one could think of but never in my entire life have I felt so disrespected. Honestly I don't know what kind of business they're are running. My husband is a business owner and have never nor will ever treat a costumer in such manner. We are very subjective as to where we spend our money and NEVER EVER again will I dined at this restaurant.  FYI to the owners: if you are going to run an establishment under prejudice which is bad because this is the United States of America you should at least put up a sign stating so. As a proud American I don't think this restaurant should be running period on American soil...it is a disgrace."], ["Feema F.", "I eat at this place every time I am in JAX. The food is pretty authentic. As usual they hold back on some of the spices to please the american audience. Having leb heritage I can tell you this is as close as you are going to get in JAX. Owner is a super guy. I like the lamb kabobs."], ["Tiffany R.", "My mom always wants to come here because she likes the hummus and it's close by. I think the hummus is one of the only good things about this place. I almost always leave disappointed. The service is always slow and they're never very welcoming or helpful. The Last time we went I got steak kabobs and they were extremely over cooked, when I told the server he looked at me like I was crazy."], ["Summer S.", "OMG, checked in to a hotel and came straight here! Loved the music, the friendly hosts and the food is delish!!!  We had the baba ghanoush (I love when you can taste the smokiness), sambusek meat filled, mixed grill! The chicken was completely succulent, ask for the lamb as medium since they will assume well done, ground beef kabob with Roasted veggies.And the iced tea is perfecto. I love it when it's ethnic Bc so much more flavorful than just fountain or Lipton iced tea.I think while we are in the neighborhood we will be frequenting this place often! Sahtain!! :)"], ["Lolo C.", "Another great meal at Mandaloun. We took friends who had never eaten there and they loved it. Fresh, plentiful and reasonable. Pierre, the owner-chef, greets everyone and is most pleasant. Just a great place for Lebanese food in Jacksonville. We don't love the belly dancer but kids and some guys seem to love it."], ["Mike Henry H.", "The chicken shawarma wrapped pita was very delicious. I would come back just to eat it. The chicken soup tasted okay. The Fattoush salad was very unique and good. I would want to come back to try another type of salad to see what else I would like."], ["John R.", "This was a wonderful experience to be able to treat my wife to. The food was delicious and the staff was top notch. The waiting staff were friendly and made our dining experience something special. It was well decorated and very clean. My wife and I look forward to dining here again in the future."], ["Shayla G.", "This spot NEVER let's me down!! The food is always spectacular! Always fresh and flavorful. It has a nice ambiance and wonderful cuatomer servixe. I love the fact, the chef comes out often to see how you're enjoying the food.This is a must stop for me each time I visit home."], ["Krishna S.", "Have been here few times and will continue to go, this place is just awesome the food is too good, specially if you prefer veggies this is the best on south side of jax. The main chef is a friendly cook and visits the table often to know food choice and preference!!"], ["Shankara K.", "Review for the Southside location.DO NOT ORDER ONLINE. They claim that the website listed on Yelp (and that even has their address on it (mandaloun.com/florida.htm) is not their own!I made my order over the phone looking at their menu but was charged more than $10 more (order total a little over $35). When I came home and checked their prices and called them back, she asked me to go to another website where their prices are listed. And she was very very blunt in answering (and hung up saying \"whatever!\" in spite of having a cordial conversation). I wouldn't even consider dining in if this is their standard for treating customers!Deception at it's peak!YELP - You have the website wrong. The lady at the counter said that their correct website is mandalounjax.com"], ["Robert S.", "7 of us went for dinner April lst. We had an excellent waiter, the owner's son. He suggested food and we took him up on it. There was nothing we didn't like; even 2 kids liked it. Loved the tablecloths and decorations. We had never seen the pipe smokers on the patio. It was very interesting. Everything about this place  was a positive experience.........want to go again, all the way from NE GA....YES, YES."], ["Tom T.", "My wife and I have been to Mandaloun many times, though not as many as we would like. We have also been to many of the other Mediterranean restaurants in Jacksonville. Mandaloun is the best by far. My favorite is the sampler platter. My wife like the fetush salad.You will not go wrong or be dissatisfied with Mandaloun."], ["Marcus P.", "The absolute best! Amazing food and exquisite service! The chef even came out to answer a question we had about how the garlic spread was made. I'll be back on a regular basis!"], ["Jase H.", "I have been here a few times and the food is okay, a bit salty. The lunch buffet is worth trying to get a sense of the food. Liquid Smoke is used in the baba ghanoush. And, the cooks are very heavy handed with the salt. The pita bread is NOT made in-house.The servers are very helpful and friendly.The owners, however, are not that courteous. Be aware of their Groupon promotions. They add 18% to your bill before they take the discount. Also, their Restaurant.com gift cards are not allowed to be used on take out orders even though it does not state it. Same with the Groupon. You would think the owners would clarify their discounts. Adding 18% to your bill when using a Groupon is pretty shady."], ["Ersula O.", "delish delish delish delish delish....the end"], ["Brenda M.", "My husband and I are always looking for new places to try and he happened to stumble across this one while browsing the internet.  We had lunch there the food was absolutely phenomenal.  At first, the service was a bit slow, but then they were very attentive.  My husband is Egyptian and I am Armenian/Italian and this place had the best Mediterranean food we have eaten here in Jacksonville and the prices were very reasonable.  My husband had the buffet and everything on it was great.  He raved about how fresh the fish was.  I had the Chicken Shawarma which came with this garlic spread that was to die for!!!!  I even ordered an extra container of it so I could use it at home.  This is my new favorite place.  We will DEFINITELY be back!!!!!!"], ["Aarthii K.", "Went during the closing time of the day,  yet very satisfied with the service.  The chef was around seeing you how you liked the food. We had chicken kebab and kids menu. Everything was yummm.We didn't like the desert that we ordered and surprisingly the chef got us another coconut dessert. It was a real good find."], ["Valerie C.", "very authentic. lots of dishes I've never seen before. service was good. portions weren't the best for the price. the hummus was some of the best we've ever had. they gave us no problem with our gift certificate. I would totally return."], ["Christopher W.", "Delicious! Matter of fact, the saffron rice was my favorite part!Service was a bit slow though, so I dropped the 4 stars to 3."], ["Kathleen C.", "Delish!! Fresh food, great atmosphere....server a little slow, but hey it was a good time so I can overlook that. Highly recommend!!"], ["Seveen J.", "Loved the lunch buffet.  Plenty of choices.  Kebabs, fish, stuffed squash, humuus, taboli and all the usually favorites.What I appreciated was the seasonings were done so nice that my taste-buds popped.Service was great and personal. No one rushed us.  It was all good and tasty.  Yes I will go again.It was so good I forget to take a picture lol"], ["Caron S.", "Four solid stars. Three of us went for the lunch buffet and our verdict? It is DELICIOUS. Previously I loved Hala's lunch buffet (on University) but this seemed fresher and more flavorful. The hummus...oh, the hummus, it was thick and creamy (DREAMY is more like it). The baba ganoush was equally thick and delicious. Loved the tabouli, and I've had tabouli all around town (Karam's is my favorite, but Zaitoon's was great, and it's good at Pinegrove Deli, Whiteway Deli, Akel's Deli downtown, Zodiac Grill downtown, and the list goes on). The lentil soup was great and the garlicky fava beans were packed with flavor. There were a few meat dishes, which I didn't sample, and a rice pudding type dessert. The only area for improvement would have been the pita wedges. They were a bit dry.Service was a bit odd, as we had three separate people come over throughout the lunch. The atmosphere is cozy, and the location convenient with ample parking. Definitely recommend."], ["Carrie Anne T.", "My boyfriend and I went out to dinner here tonight for the first time and we were very impressed. We got the mixed mezze, shorba soup, and rice pudding. The mixed mezze included 6 mezzes. They were all delicious, the falafels were my favorite. I was excited to try the rice pudding, because I love rice pudding. However, I was a bit surprised when it came out cold. I've always eaten rice pudding warm. I still enjoyed it though, it was just a new experience for me. We definitely are planning on coming back again to try more entrees, but our first impression was very good."], ["Gizelle A.", "Updated review after many visits:Changing my score to absolute 5 stars! The restaurant is awesome on all fronts- atmosphere, food, and service! After that one first visit when I was impressed and my husband was still upset there were not gyros on the menu, we went back with the clear understanding that this is a Lebanese restaurant and not a gyro joint. Now that we accepted that, we looked at the menu from a very different angle. The service we get there is exceptional! The water is poured in the glasses before we even sit down. Plates and food is hot and delicious. Everyone is really kind! It's absolutely a top choice for us! ____________Original review after 1 visit:Solid 4 stars, to incorporate my husband's opinion (mine would be 5 stars). After our favorite Zaitoon closed and we had that one bad experience at Istanbul Grill, we have been on the hunt for a new Mediterranean favorite, so when I saw the Groupon for this one, it was perfect to try it. We were hesitant at first that it may be too low key/casual for us (we like the more fancy type places), but when we walked in a few weeks ago, we were very impressed! The environment is so cozy and authentic, clean and inviting. Unfortunately, that night they were reserved for an event, so we had to come back the next week...and that we did!Walking in, we were greeted by awesome smells from the grill cooking and some loud music and belly dancing - which ended up being perfectly nice and fun, given it was for 10 minutes (we are those weirdos who run away from live music..yeah..odd, I know). The dancer was very graceful, very tastefully done and it was really authentic. And then went back to quieter, still very nice, music after that.We are really particular about seating, but as soon as we walked in, I spotted a perfect table in the corner - loved that! We were seated right away AND brought water right awat, which is typically a pet peeve of mine (being left without water). I was already familiar with the menu - got the Spinach pastries appetizer (amazing!), the Greek salad (just as it should be), and Lamb Shish Kebab with pita breads to share. We were basically after wrapping our own gyros (have been missing those), which I realize isn't exactly a Lebanese thing and isn't exactly on the menu. So through our very own decision, we tried to change up the food from Lebanese to Greek :) Everything was absolutely delicious! We had a small challenge with getting the plates as super hot as we want them and had to ask for re-heating, but that was done promptly. I know the Mediterranean cuisine and I know this was authentic and well prepared food. My husband was looking for something that had a sauce and had some very specific ideas that just weren't on the menu - likely because what he had in mind was Greek and we were in a Lebanese restaurant. That was his only point of discontent - absolutely no reflection on the restaurant, just his own preference - menu variety for things with sauce. I guess we are still on the hunt for an actual Greek place with gyros, but I would definitely go back to Mandaloun. The service, food and environment were great at a very reasonable price. Well done, Mandaloun (and we are really picky..)!!!"], ["Robert C.", "Went here based on yelp reviews.  Was a little tricky to find, you need to go to the middle of the mini mall or drive around to the Winn Dixie parkling lot.Was a little pricey for what I got, but it was very good.  I did order take out, so maybe the presentation was off a little.  Would go back again to sample other items from the menu."], ["A D.", "Great 5 star food. The service was not as great. The chef was nice and stopped by to chit-chat which was nice. The rice pudding was awesome. Some vegetarian main course items would have been nice."], ["Claire L.", "This place was amazing! We went based on recommendations made by Folio weekly. We had a sampling of their most popular dishes including hummus, baba ganoush, chicken, beef and lamb. I'm a bit of a picky eater and I loved everything! I couldn't believe it! They use the freshest ingredients and keep things simple so the flavors are spot on. They had a wonderful belly dancer that entertained us through dinner. The owner checked in on us several times. Overall, great experience.  We will definitely be back to this spot! #fwbiteclub"], ["Meredith R.", "If you've been wanting to try an ethnic restaurant but are afraid of taking 'the plunge,' consider Mandaloun. The menu has something for everyone. The owner is a hands-on gentleman, clearly involved in all aspects of his business. He very genially went from table to table, offering suggestions. Having lived by Atlantic Avenue in Brooklyn -- an established middle eastern community -- I'm familiar with the cuisine, and zeroed in on what I wanted. My husband and I started with a combo platter mezze: stuffed grape leaves, a superb baba ghanoush, kebbe (which I didn't like, but T did) and falaffel. The appetizers were served with fresh and warm pita.As an entree I chose chicken schwarma, which was nicely seasoned and quite good. (I emptied the chicken from the pita pocket and mixed it with my accompanying greens, for a tasty salad.) T ordered filet mignon which was cooked exactly as ordered: medium rare.Mandaloun is a lovely local restaurant.  We'll certainly come back."], ["René T.", "this is definitely one of my favorite restaurants in jax! every time i get to eat here, it is a treat. my grandfather is from lebanon, and whenever he visits he always asks if we can go to mandaloun. it has become a tradition for my family to eat here when we are all in town together, and we have never had a bad experience. the atmosphere is nice and the food is amazing. we usually order a variety of appetizers to eat family style - hummus, tabbouleh, grape leaves, lebneh, falafel, and kibbeh nayyeh. these, along with the endless pita bread, are enough to fill us up for the night. i also love that the owner is always out walking around and talking to patrons. this extra personal touch really completes the experience."], ["Aubrey M.", "Everything was perfection. The service was genuinely nice and helpful. The food was deeelishhh. I couldn't pronounce the names of the entrees and they were so nice about it, even helped me learn a bit of Greek. I ordered the red snapper and my guest ordered lamb. Hummus was amazing. Everything was amazing!"], ["Marlon U.", "I subscribe to various \"coupon\" web sites so that I can try new places at a discounted cost. Thus, my reason for trying to Mandaloun, along with other positive Yelp reviews.  I went there for lunch today with a coworker who, along with me, was looking for a little change of pace for lunch.  Mandaloun is now on both of our \"return to\" lists!  It was a nice experience!      We decided to try the lunch buffet since we weren't exactly sure what to order off the menu.  I've had Mediterranean food before, but not enough to remember the dishes themselves, much less the names of the dishes. Getting the buffet was an opportunity to try several dishes.      We were not disappointed at all.  All the dishes appeared (and tasted) to be prepared fresh.  Sometimes buffet food seems to have been sitting out for a while, but not here.  The salad/appetizer offerings were very tasty (hummus, baba ganoush, fattoush, tabbouleh, moussaka, and make-your-own greek salad).  The main meat dishes were also fresh-tasting and well-seasoned (chicken shawarma, chicken wings, kafta meatballs and stuffed grape leaves).  There was only one dessert item (like a rice pudding), but it was good too!  And oh, I didn't realize there was a soup on the buffet so I went back at the end and tried it --- Lentil soup was very, very good.  I overheard a customer at the table next to us say that she orders the lentil soup to go on the way home from work sometimes.     The service was just ok.  But maybe that's because with a buffet we essentially served ourselves.  The bright spot was when the owner/chef came back and talked to every table to ensure that things were well.  With the Restaurant.com coupon ($10 off), this was a meal that was well worth it.  I will definitely be back to try some items off the menu that were not part of the buffet."], ["Maria V.", "Authentic and yumm! The combo mezze platter is a must. Good portion sizes. Service is prompt and friendly. Menu is easy to read--especially if new to Middle Eastern food. Staff is knowledgable about the food and welcomes questions--especially novice."], ["Shaun M.", "The most beautiful part of dining at Mandaloun is the food.  Chef Pierre understands quality and consistency.  It's all in the details.  The cook on the vegetables and proteins was ideal (nothing was overcooked or dry...chicken/lamb/beef), and the subtle blended flavors of the smoky baba ghanoush and silky hummus were delicious (served with fresh, lightly toasted pita). We also had perfectly crispy falafel and the same experience with kibbe.  The grape leaves were balanced (some people get crazy with lemon/tomato and they're too acidic), and the leaves weren't mushy or dripping oil.  I'm proud to have a chef in the city with this level of skill/understanding cooking lebanese food.  This is now my go-to spot when in the mood for this type of fare.  My only criticism would be the service.  It can be erratic."], ["Susan A.", "I haven't had such authentic middle eastern cuisine since we visited there. Everything was delicious and the service was excellent."], ["Hector G.", "Thank you Chef Pierre for a great meal and many thanks to your waiters as well. Great food great atmosphere. I will return to have another meal!"]], "The Olive Tree Mediterranean Grille": [["CB D.", "So effin' good..! The falafel here, is in fact, the best I've had. Today, I had the pleasure of the grilled shrimp :-D My coworkers were telling me about the food here for months now; I shouldn't have waited so long to get in here myself!"], ["Dean H.", "Greek salad with grilled chicken ... fresh and tasty.  Warm pita comes along side meditetanuan sides.Baklava crisp with just enough sweetness.   Turkish coffee well served.Friendly and helpful staff."], ["Ashley B.", "This looks like a hole in the wall place and as they advertise \"hookah\" from the outside, I was hesitant to enter for fear of smoke. There was no smoke however. It's a clean, plain-Jane, lil place. The good: The food is incredible. Tabbouleh is wonderful and full of fresh parsley and other herbs with just a bit of the cracked wheat. The hummus is smooth and just ever so slightly spicy with the after-taste. The falafels are dark on the outside with soft green (herbed) garbanzo filling. The potato salad has the slightest taste of mint and is very refreshing. The not so good: The pita left something to be desired, I think it's packaged out of a bag. I wish they served baba ganoush. The grape leaves are so-so. (This may be because I'm accustomed to having them served cold, but they heat them up here.)"], ["Annie F.", "Best fresh, fast delivery in San Marco! Never had a bad meal delivered which is hard to say for deliveries (nothing like soggy fries or cold pizza).  The chicken shawarma wrap, lentil soup, hummus, tabouli, gyro wrap and French fries are all tasty!  We'll continue to order delivery from here."], ["Anna-Marie W.", "The Olive Tree Mediterranean Grille sits south of downtown Jacksonville in the San Marco neighborhood.  Chad had eaten here before and liked it enough to take me.  We visited on a Friday afternoon, in between the lunch and dinner hour and they were still quite busy.  Besides their normal menu there is a blackboard at the entrance with a list of daily specials.I went with the Veggie Platter with falafel, spinach pie, veggie grape leaves, hummus and two sides.  I chose an extra side of hummus and the Mediterranean potato salad as my two sides.  It was a little pricey at almost $13 but it was a lot of food.My favorite part was the Veggie Grape Leaves with its tangy rice and spicy lemon flavor.The Hummus was delicious as well.  Creamy and spicy and served with a side of pita bread.The Mediterranean Potato Salad was good.  The addition of mint and lemon made it \"Mediterranean\" and it was quite tasty.  The potatoes weren't swimming in mayonnaise and it was seasoned very well.The Falafel was OK.  They were slightly dry but the side of tahini sauce made them a little better.Chad had ordered the Falafel Pita Platter.  Falafel was stuffed into pita bread and drizzled with a tahini sauce.  He also ordered hummus as one of his sides, the other was Mediterranean rice.We liked The Olive Tree.  It's nothing fancy.  It is more like a casual Greek sandwich shop with Gyros, Kiftah and Tabouleh.  This is the perfect place if you want something quick and authentic."], ["Jeniah J.", "I went here with coworkers. It was OK. The food wasn't exceptional. It wasn't bad either."], ["None T.", "I've been back three (or more) times since my first review. Food is lackluster and lacking the specialness I think it had when they first opened. They're not paying attention or purposely ignoring the quality of their food preparation.The oil they use for frying always taste old. The soups are over salty. They've lost their way.lklk"], ["Shawn M.", "I literally, seriously it started annoying my son, said a small \"Mmmm\" after almost every bite. The falafel platter with hummus and tabouli was great. I also had the pita with the chunks of the flavorful ground meat, I forget what it's called. My son had the blackened basa fish over a bed of tabouli. He said the fish was fantastic. I will be back. The people were very nice."], ["David T.", "Great good and EXCELLENT service from none other than the owner herself. The falafel was wonderful as was everything else. Highly recommended."], ["Rhea P.", "I don't understand all the hype about this place.  I have had better falafel. Mine was a little too dry actually.Sure it's friendly and casual, and the prices are great.  While it s filling, I can not say that it was mind blowing.  There's a superb place on university I much rather prefer."], ["John R.", "Great food, friendly service, no frills. If you want fresh food, skip the expensive places and come to what I would call \"the Middle Eastern family diner\". They have all the foods the other places have: kibbeh, falafel, etc.. The exception is that it's cheap, fast, and hot.  And the people who make it are friendly, another great plus.  No gimmicks, no hookah, no belly dancers, just great food at great prices. My one request would be that they open a little later, as I have to drive across town to eat there. If you read my my other reviews, you'll see that I can get quite harsh. Not this time!  We ate like kings!Give this little place a try."], ["Steven N.", "Super great food.. Good service,too. Prices are decent considering it's authentic Greek/Mediterranean food. I'd definitely eat there again..I got a gyro w a side of hummus and rice. All the food was pretty amazing:)"], ["Kurtesi N.", "Best Mediterranean food in town hands down . I had the falafel sandwich with a side of hummus and the Mediterranean rice . The falafel were really the best I have ever tasted you can taste the spices and it's served with a very nice home made sauce and they were fried perfectly , pita bread was nice and fresh also.  I had them at a few local spots here in jax but nothing compares. The rice I could tell was made fresh and I also liked that there was vegetables in it . Hummus very tasty and excellent texture . What made me happy the most was the service I got ordering and when I got my food very friendly family that owns it and will make sure you are satisfied . It's a must that you check it out !"], ["David B.", "Hands down the best falafel in town. I love this place and eat here multiple times per week. The falafel, lentil soup, and grape leaves are what I usually get, but I've never had a bad meal there. The family who owns it are extremely friendly and helpful and go out of their way to make sure you get what you want for your meal. If you are looking for good, affordable mediterranean food look no further than this local gem."], ["J J.", "Had the gyro platter which was rather bland overall. Also, the kibbeh appetizers were just okay. Overall, I'm not jumping at the bit to go back anytime soon."], ["Risa Y.", "You must go!! I tried Falafel Wrap with the side of Potato Salad and it was delicious. Only $7 and I was really satisfied. Staff were friendly, informative, and service was quick! I will be a regular if I lived here!"], ["Anna J.", "The Olive Tree is across the street from our office and is definitely an office favorite! The food is fairly priced, delicious and authentic, and the employees are very friendly. The restaurant itself is very casual (not the ambience you would be looking for on a date or anything), but its perfect for the quick lunch spot. The falafel is absolutely unbeatable -- the best falafel I've ever had! Additionally, you can alter the meals without any hassle from the employees (the side greek salad with chicken is almost as big as the large!). As far as greek restaurants go, they are very welcoming - not abrasive or rushing."], ["Abby A.", "Amazing Mediterranean food! I absolutely hate garlic and often have a difficult time eating Mediterranean food because of it. This is the first place I've been that has minimal garlic.Everything tastes fresh and homemade. The falafel was delicious and super crispy! I got the Mediterranean Chicken Sandwich and I would definitely order it again."], ["Don R.", "I have to say that my visit to day was a another lackluster one.  Is the food cheap, no.  Inexpensive?  Yes. The restaurant has a foul odor...a musty smell throughout.  I had the Mediterranean chicken pita with a side of hummus and fries.  Let's discuss these items from good to worse.  The french fries were hot and crispy with just the right amount of seasoning, so 5 stars on the fries.  The hummos was a good texture but relatively bland. It was moist with some olive oil and the pita bread served with it was cold and dry, so 3 stars on the hummus. The chicken pita was full of moist chicken with a flavorful seasoning.  Unfortunately, there was nothing else on the sandwich besides the seasoned chicken and the pita. If they were to add some traditional sauce, and maybe some mint, or lettuce and tomato, the sandwich would have been very good, but as it was served it's 2 plus stars for the moist chicken, bit total lack of cohesiveness as a sandwich. My husband loves taboulleh, hummus and grape leaves.  Unfortunately, taboulleh is not considered a side item as \"the cost of produce is up.\"  This is unfortunate as it just makes it more difficult for the customer to eat what they want without feeling stressed about ordering. Still, he ordered the grape leaves which were served hot and \"had an interesting texture\" with a side of hummus that received the same review as mine above. I have to admit that my greatest disappointment is to find yet another Mediterranean restaurant that has gyros with the bastardized gyro meat that is far removed from the traditional meat cut off the rotating skewer; like cheap lunch meat making a horrible gyro. I did not order it this time, but had it on my first visit and confirmed they still serve this inferior product (which is why I did not order).This is defintely an okay diner that serves passable food for the most part.  However, they could really be a little gem of San Marco if their food would reflect a little more passion and cohesiveness.  I'm still hoping for this place, but I'm unlikely to return."], ["Michael C.", "Basic sit down joint in the heart of San Marco. Loved the family that runs the place. Very clean. Wide variety of menu items. The homemade sauce was excellent, and my wife loved her falafel. I was only so-so with the shrimp I had, although my grape leaves were delicious."], ["Brentley S.", "Need fresh, inexpensive, fast, (pretty) healthy food? Look no further - no really. An order of piping hot falafel, they literally make it in front of you, hummus and an order of grape leaves will run you under $10. You can't find that anywhere else, not to mention the people are friendly and will answer any questions you have about their food. Also, you can order just the right amount of food for you.  If you'd like 4 falafels instead of 6, you got it! If you're going to a party and want an order of 20 you got it!"], ["Steven H.", "I had the falafel, hummus, and gyro. I don't eat much Mediterranean (not because I don't like it) but this has to be the best I've had. Great inexpensive, healthy foods!"], ["Emily V.", "Super friendly, family run and operated, this is a low key joint. I went with my parents. I had the falafel sandwich, and though I liked the falafel, I wasn't crazy about the peppers, I think they were, that were on it. The pita wasn't great. It tasted right out of a package. The hummus was ok. Not that flavorful. I really liked the spinach pie, it was homemade and really delish. The baklava was great too. So, hit or miss. Service was friendly, though, so I would probably go back."], ["Ariel T.", "This place is amazing! Best falafel and kifta ever! I'm a big fan of family owned restaurants. The owners are so sweet and friendly. All the food is made from scratch.  You have got to try this place. If you like Mediterranean food then stop in for lunch or dinner. The grape leaves and spinach pies are so delicious and fresh. Prices are very reasonable. You won't be disappointed. Oh and they deliver to the local area! How convenient is that?! Home cooked meal right at your doorstep..."], ["Mike C.", "The food is quite good and worth the stop. This diner has little to no ambience and counter service only but the service is quite good, with good value, and good food.   The Tabouleh and Falafel were out standing and the stuffed grape leaves and kibbeh were very good."], ["Dave W.", "Great Falafel.  Also very cheap.  You get what you pay for in terms of ambience.  As long as you stick to the Mediterranean fare, you should be well satisfied. I've had their grape leaves, spinach pies, kibbeh, tabouleh, and falafel, and they're all very good, the falafel being the best.  Help this business out.  It's sandwiched right between La Nopalera and Jimmy John's, and this particular space has seen quite a few restaurants come and go.  Its worth your money, and you won't be disappointed with the food."], ["Jeffrey F.", "Best falafel and tabbouleh I've ever had! The owners are extremely friendly and welcoming. Great restaurant for lunch or dinner! Caters well too!"], ["CHRIS X.", "No frills, solid basic Mediterranean fare.  Quick service for lunch."]], "Mediterrania Restaurant": [["Rahul C.", "We were looking for a Mediterranean eatery in jacksonville and we wanted to try this place upon the positive reviews. From outside its not that impressive but the decor and the ambiance inside is warm and cosy. We ordered steaks and calamari dishes, the appetizers were ok, but the steak was awesome the flavor and meat was really good, we decided that this would be our place for steaks only. Very friendly staff the price vs portions are very very good."], ["Cherish B.", "Our party of 7 arrived shortly after 7pm on Friday night.  Our server was very friendly, and the restaurant was maybe half full.  No one ordered apps, but we did share 2 bottles of wine while enjoying the bread and oil.Our salads came out fairly quickly, but our entrees took quite a while.  When they did come out, they were delicious.I had the Grouper Piccatta.  Lightly breaded, yummy sauce (could have used some of the bread to scoop it all up, side of spinach.  The spinach reminded me of canned, with some type of seasoning added.He had Lamb Shank with onions, tomatoes, pepper, feta cheese and capers.  One of the better lamb dishes he has had, he said.Everyone else seemed to enjoy their meals, as well.We ordered dessert, to-go.  Cheesecake Creme Brulee.  Rich and creamy, but not heavy.Strong possibility we will go back next time we are in town to visit family."], ["Peter Y.", "Very nice surprise. The strip mall this place is in is kind of run down but this little restaurant is a gem. Inside the decor is pleasant, the service very nice and attentive and the prices are reasonable. The soups we found a little uninspired but the entrees were excellent. From the roasted chicken to the roasted lamb, it was excellent all the way around. And as a surprise they don't treat their sides as plate filler. They were so good they almost stole the show from the protein. Overall, a very nice evening here at this little restaurant. We'll be back."], ["Kevin C.", "I've live here most of my life and have driven past this pass hundreds of times.  I had a guest in from out of town and he wanted to try this place out.  We stopped in and I was pleasantly surprised.  Loved the food and the service was great.  I will go back.  Oh, the Gyro platter is great!"], ["Doug R.", "Been eating here since the 80's...usually on a special occasion. Very good, very fresh, tasty, consistent food and side dishes. Best rack of lamb around, I skeptically chose the flank steak instead of the lamb the other night and was not disappointed.! The cheese that they light on fire (forget the name) is a great appetizer.  The restaurant is one of my top favorites in town."], ["Jim C.", "The best chicken  grill and potatoes in the city. Great service.  I now have lunch there once a week. The soup is always good  but  I liked the chicken rice the best.Get the  special."], ["Wanda M.", "The Greek salad and the bread along with the service was excellent. However the gyro was burnt. It was like they pre-sliced the meat, grilled it along with the pita and it had a grilled burnt taste.  The decor was adorable inside, however the exterior had much to be desired. I never judge a restaurant by appearance so this did not bother me. The menu offered a choice of other traditional Greek foods and pasta dishes which we may return to try. But if a Greek restaurant can't master a gyro, you have to think twice about giving it another try. If we return it will be only because we liked the warm reception from the staff."], ["Rich H.", "Excellent family owned place. Real Greek atmosphere (for Jacksonville). Great service, good food, some nice Greek wine. A good experience."], ["Katie C.", "Solid lunch in the Baymeadows Area. I love Mediterranean food and this spot does the trick with staples like Spanakopita (listed as Spinach Pie on the menu), Gyros, Greek Salads, and more. The atmosphere is inviting with red tablecloths and spacious booths, and the service is friendly and efficient. I opted for the Spinach Pie and while it was a very generous portion, the flavors didn't really wow me. It was overly mushy and filled with too much spinach. I could be biased though because the pastry part is my favorite component of this dish! Their tzatziki sauce is great and they give you tons of it with the Spanakopita, so that was a plus. I'd definitely go back for another go at Mediterrania Restaurant, but for now I'm leaving it A-OK."], ["Damon F.", "Best callimari!  This is a wonderful family owned and run restaurant specializing in Greek and Italian food.  There were so many things on the menu that my wife and I wanted to try that we were stuffed and had lots to bring home.  We ate the hummus, cheese flambe', and callimari for appetizers.  The callimari was not chewy at all and the batter was light and not heavy with grease.  They served it with a white sauce that was a refreshing change from marinara.For entrees we had the Greek Combo with grape leaves, spinach and feta stuffed filo, and an eggplant, meat and potato item.  Sorry I don't remember the Greek names for the dishes - but I remember that they all tasted fresh and delicious!  We also had a special that was seafood and pasta with a white sauce.  I'm looking forward to the leftovers because I didn't have room to do more than eat a scallop - but the scallop was tender and perfectly cooked.This is definitely a new favorite restaurant that I will come back to regularly."], ["Paul G.", "This is our favorite restaurant. Period. Great choice of Greek or Italian dishes, perfectly prepared. We are treated like family when we come to this family owned and operated restaurant. Great warm ambiance. A little Greek music playing. Decent but not deep wine list. Highly recommend."], ["Kathy C.", "Ok, maybe we ordered the wrong things on the menu... maybe my taste buds are just off... I don't know but whatever it is, we were very unimpressed by the food.The decor, the atmosphere, and the serve staff were all great.  Upon walking in, we were greeted warmly by the hostess and every server that we walked by.  The menu pretty much is even between the number of Greek vs Italian dishes.  We were craving Greek, so that's pretty much what we ordered.Saganaki - Not bad at all.  The server flamed the cheese and squeezed lemon by table side.  The portion is a lot bigger than what we are used to having in other Greek restaurants.  The taste is good, a bit salty, but good.Calamari - Lightly battered.  We were half-expecting tzatziki, I mean, Mediterranean restaurant and all... but it came with a mayo / chipotle type sauce.  But not bad.  We like how the squid is lightly battered.Minestrone Soup (came with entree) - Ok, this soup I did not get at all.  I can't really call it Minestrone soup... it was more like a weak tomato soup with loads and loads of bland & soft veggies.Chicken & Rice Soup (came with entree) - I liked this soup.  Not what I expected (which I thought would be a light brothy chicken, veggie, rice soup) but instead, a thick rice soup with chunks of chicken.  Almost like a congee from a Hong Kong restaurant lol... A bit salty though....Greek Combo Entree - The combo comes with Domaldes, Spanakopita, and Mousaka.  The Mousaka was the best in this combo, and it was just mediocre.  The Spanakopita was very salty.  And the Domaldes was just... terrible.  I had a bite of 1 of the 3 Domaldes and had to give it back to my husband.  I just couldn't eat it.  The grape leaf had a very strange taste, it was wrapped very loosely / falling apart and the filling was just bad.  Lastly, the tzatziki was so disappointing.  It was very weak, lacking the flavor you would expect.  Flank Steak - Ok, so when the server plopped the dish down, all my attention went to the GIANT PILE of... very dark, very green, very mushy looking (I think) kale.  I cannot, seriously cannot, imagine anyone's appetite being enticed by this very GIANT PILE of green stuff (unless you like green mush...)  The steak was a bit over seasoned.Ack, we really wanted to like this place.  It's been a while since we had great Greek food.  But this restaurant just fell short.  Overall, we found the dishes over salted and just... off.  Again, the staff was so friendly and the restaurant so cute. Maybe the Italian side of the menu is much better than the Greek? If we ever make it back there, we'll give the Italian a try...."], ["Susan P.", "Chicken lemon rice soup was good but lacked lemon flavor. I had chicken florentene it was very good. My husband had the veal rolentene, he said it was very good. Although I thought his was a very small piece of meat. The restaurant was on the cold side and if you needed to go to the bathroom, you had to go into the adjoining room which was pitch dark. All you could see was like a light at the end of the tunnel.  I was in shock the room was very cold and you could not see were you were walking. I don't think we will be back. Service was slow and I felt a bit over priced."], ["Don F.", "Great find. I had the salmon, Mom had a Greek salad with grilled shrimp, Susan and Bill both had steak. everything was cooked to perfection and really seasoned well. I'm In town until Saturday, sooooo I'm going going back for lunch because Chef Eddie is cooking his famous chicken soup, yummm."], ["Ryan M.", "Everything about this place is great.  The old world, small, hole-in-the-wall, family-owned atmosphere makes for a great experience.  The service was very attentive and genuine.We got the house wines, which were just fine.  The bread and oil were addictive.  Salad dressings (ranch and the really good oil and vinegar) were homemade with excellent, green leafy lettuce. The lasagna was superb!  Very very cheesy and exactly what we wanted.  The Italian Combo (lasagna, eggplant parmesan, and manicotti) was similarly amazing.  Lots and lots and lots of cheese, on and in everything.  The eggplant was nothing short of incredible.We are pretty critical on restaurants, but will definitely head back to Mediterrania!"], ["Lucas H.", "Very nice little place. Waitstaff was kind & accommodating. Minestrone was fine for me. Price was decent."], ["Jeff P.", "family Restaurant with good food definitely worth a stop"]], "Zoës Kitchen": [], "Tabouleh Cafe": [["Laytan G.", "I love this restaurant. The food is always fresh and delicious. The place is family owned and operated and they're always nice and considerate. I usually get the chicken salad pita or a gyro.  The wholly hummus pita wrap is also a really good vegetarian option. I've liked every single thing I've ever ordered,  especially the hummus and the Mediterranean salad. Everything is always made to order and they even make their own pita bread which is delicious. I eat here about once a week because its so good. Definitely give it a try if you haven't yet. If you're in a hurry,  I suggest calling ahead and ordering because it takes them about 15 min to make the food,  cause it's made to order."], ["Ilsa M.", "One of the best Greek gyros I've had in the longest while ! Will be back for sure ! Ingredients were fresh  and the pita bread was amazing . I would love to try more items on the menu ! I am so glad I discovered this place ! Don't be mislead by the location it is a definite must try !!"], ["Maya C.", "A wonderful place to get my Mediterranean fix and I was starving last night. It can be easy to miss as it's tucked away in the corner of the shopping center. It never looks busy when I drive by. Walked in I kept thinking to myself \"it looks different than before\". That's when I overheard the cashier/waiter telling his cousin that that the interior had been redone. Looks nice. Lots of Mediterranean/Middle Eastern decor, aside from the flat panel tv mounted on the wall with Judge Judy's show on. The floors were basic red-clay colored tile before and now they are I nice stone, sandy-colored tile. The tables are a mixture of outdoor and indoor tables. I think they brought their outdoor tables inside since it was at night. They sell their pita bread from a refrigerated case but I don't then selling or hookahs and other items behind the counter. It's a nice touch.Still starving, I ordered the Mediterranean Feast, which consisted of a lamb kabob, a chicken taouk and a kifta kabob on a bed of basmati rice with a Mediterranean salad. I also ordered a Tatziki dip appetizer. That was a lot of food and I could done without the app. I got it to-go and the wait wasn't long, maybe 10 minutes or so. They nicely showed it to me before they bagged it up and I was out the door on my way home.I tore into the Mediterranean Feast first. It was so good and smelled amazing all the way home. The meat skewers were seasoned perfectly. They gave me a lot of Basmati rice and I couldn't eat it all, but it was very good. The Mediterranean salad consisted of lettuce, tomatoes, parsley, mint, cucumbers, and onions in a house dressing. That made me feel less guilty about my entire meal. The Tatziki dip was more for two people than just one and it came with four pieces of pita bread. I couldn't eat it all, but it was very delicious.I hope that this place is able to remain open and compete with all the fast food chains popping up around it. The food is phenomenal."], ["Rick P.", "I've heard about this place and also asked around about it.   Finally got a chance to try it out.   I was not disappointed.  This is a tiny place tucked away in the corner of a strip mall but if you are looking for a Mediterranean fix, come here.  it is worth the drive and hunting for it.   I like gyros so that was one thing I was looking forward to.   The people there are very nice and very helpful.   The gyro came loaded with meat, tomatoes, onions cucumbers.  I had to eat the some of the meat from the gyro by hand before I could pick it up and start on it.   the tatziki sauce was very good and really accented the gyro.  you can get it with fries or a salad.  I chose the salad.  One thing I liked about the salad is that the main ingredient is NOT lettuce.   I've always liked the different other things that go in a salad.  I ordered to go, the grape leaves.  you can get them vegetarian or with meat.  I wish I would have got the waitress' name.   She said the vegetarian grape leaves are good but the meat ones (the ones I got) are to die for.  She told me how to warm them up so they would be perfect.   Probably better when they came out of the kitchen but the flavor was good, the tatziki sauce again, very flavorful for dipping.  I keep looking at the menu and seeing the meat pies.   they have spinach pies, greek cheese pies, halloumi cheese pies, Armenian meat pies.  Each of them you get 3 pies per order.    Good things to share with friends, for an appetizer, for just something to grab and enjoy.  the have a good menu with all types of wonderful dishes on it.   different kabobs, different sandwiches, you name it.  definitely going back.  I'm always up for Mediterranean fix and I found my new spot.   What's really good, not that far of a drive."], ["Sevan P.", "So sad. I was about to leave a 5 star review for the food tasting good...until I heard the owner make an ignorant political comment as I walked out. Terrible. I went from a huge fan to 'can't support those guys' real quick..."], ["Mollie K.", "This place was good. I enjoyed the food and the portion size was a good price for it. The customer service there was friendly and the place is a decent size. The food was fresh and it is family oriented. I never been to this place before but was recommended so I gave it a try and I enjoyed it. I will going there again when I am in the mood and looking for some Mediterranean food."], ["Betty R.", "So delicious! I've eaten here 3 times and have enjoyed my meal each time. The 1st time I had the Mediterranean Feast & everything was so yummy. It comes with 3 skewers of meat over Balsmati rice & a side Mediterranean salad. At most restaurants, I try to sub rice for another side because I don't like rice that much but I found myself eating every bit of the balsmati rice before I got to the rest of my meal. Yesterday, I stopped in to get a lamb gyro & a side Mediterranean salad. It was so yummy that I had to go back there again today even though this place is not on my side of town. It is so worth the drive. I had the Greek salad with chicken and an order of cheese pies. The cheese pies have both cheese & spinach. Once again I was not disappointed. I have enjoyed everything I have ordered from them. It's always so fresh and tasty."], ["Renée V.", "Best place for amazing gyros && sooo much more! I've taken everyone there and now they are just as addicted as I am"], ["Elizabeth D.", "The reviews have been strong for this little restaurant tucked into the J & J Central Plaza on Merrill so we headed in tonight. It's squeaky clean on the interior and family run. Several others were having dinner and a couple take-out orders were placed while we dined. Hubby and I both ordered the Armenian meat pies, he then had the traditional gyro and I the Zorba the Great. The meat pies came three to a tray and were just the right mix of meaty and fluffy pastry goodness - totally delicious on their own or dipped in tzatziki. Hubby gave the sizable gyro a 9.5 on a scale of 10 ; I appreciated that it came with a nice tomato, cucumber, light romaine salad. My Zorba the Great was great! A huge plate of food as you can see here; I certainly didn't need the meat pies, too. The salad dressing was just the right amount of spicules for the salad. The meat was seasoned well and you got just a hint of cinnamon in the rice. The owner waited and bussed our table and he was a very nice chap. We will definitely be back!"], ["Kayla N.", "Oh my gosh where do I start?! First off I don't know why some people commented on the decor.... Looked pretty Turkish to me which I expect- not over done, just subtle. The owner was friendly and took our order at the front and then instructed us to have a seat where ever we like (granted we were the only ones dining in). He did forget our order of babaganoush but good thing he did because I wouldn't have had any room to enjoy it. We saw several people who ordered take out and seemed to be regulars - a good thing! On to the food! My husband got the Greek salad and added chicken. Good portion, fresh, delicious! He finished his whole plate before I could snag a bite, another good thing! I got the falafel pita- no tahini add tzatziki (a big no-no, I know! But I'm not a fan of tahini, I'll probably give it a go regular style next time) with a salad. All of it was super fresh and super delicious. I wolfed it down! Oops The pita is on point as well, real pita. Not the super soft crumbly fake stuff some places serve. Straight up- reminds me of the pita my sisters would bring back from Egypt- real deal my friends! We also shared a iced mint tea which I thought was waaaaay too sweet but it satisfied my husbands taste so he enjoyed it. I wish I had time or room to try the Turkish coffee and baklava but alas that'll have to wait until next time! Don't hesitate- GO HERE! Devine!"], ["Nat P.", "Let me start by saying I love how the owner welcomed every customer, now that part is out of the way lets get to the food part. My husband and I drive over twenty miles to get to this place for their authentic Mediterranean flavor. The food is delicious, light grilled and always fresh. There are many Mediterranean restaurants to eat from in Jacksonville however this is  one of the ones that stand out the most. We ordered the Mediterranean feast and it was plenty of food I ended up bringing half of my plate home for later. This was my second visit and I shall return to further explore their menu as I haven't tried their hummus yet but I'm sure it's pretty good. Many compliments to the owner for being so humbled and appreciative of his customers."], ["Abaigeal P.", "Absolutely AMAZING meat pies! Love that you can purchase them in bulk and heat them at home."], ["Peter Z.", "This is a great little cafe not far from the Jacksonville airport. I stopped by for dinner. A lot of locals. Had the special: Mousakka. Was fabulous. Also some very tasty hummus and a small salad. All home made cooking. Very friendly service. I would definitely return for another meal!"], ["Devin A.", "It's been so hard to find a good Greek restaurant around Jacksonville, I had almost given up hope and relegated to the fact that I would have to visit two of my favorites (one in St. Augustine and the other in Savannah) to get a decent meal.  Luckily my fiancee and I stumbled across Tabouleh after a search through Yelp and Foursquare.The food was good and fresh (I had the standard Greek Gyro, she had the Lamb Shawarma).  The establishment was clean and well kept, and though it wasn't crowded, there was a steady stream of folks coming to get their food to go, which gives me hope this restaurant will continue to be around for the next time we crave Greek.  I look forward to returning and trying some of their other offerings (in particular the Kifta Kabob Wrap) in the near future."], ["Melissa B.", "Great food! The chicken kabobs are amazing.. The Greek fries are SUPER good too."], ["Cameron K.", "Delicious yogurt dip and warm pita bread. The fattoush salad with chicken was so wonderful. There was a wide variety of vegetarian and vegan options for my teen daughter. The service was also great and we were informed of the specials and about Wednesday's Vegan Special each week. My family will be back. I would be remiss if I didn't mention the buttery mouth watering baklava. Perfect ending to a great refreshing dinner.,"], ["Angela B.", "I really enjoy their Mediterranean platter. It gives you a bit of everything! Kibbe..hummus..tabbouleh...falafel.. Grape leaves...pita & tzatzizi sauce. Totally misspelled that but you know what I mean! Definitely check it out!"], ["Stephanie D.", "I recently discovered this wonderful hidden gem of Arlington.   I've dined on and ordered to go.  First the owners are fantastic. They greet you and check on you frequently. While trying to decide on a late afternoon snack, we were recommended the pies, which come 3 to a serving in 3 flavors. All are roughly hand size and perfect for sharing.  The beef is flavorful, the spinach is loaded and the cheese is outstanding.  We were told the pastry AND the cheese are housemade.  I ordered the falafel wrap and was not disappointed on a previous visit.  The hummus is about as good as any, if not better than most.  The salads, including the tabouleh are super.  I did a take out order of the beef shawarma wrap.  Fantastic is the only word to describe. Prices are 12 and below.  Don't expect fancy, but do expect great food and service. Oh and get the feta fries. A lot!!!"], ["Dave C.", "2nd time here, everything on the menu is fantastic. The service is slow or it would have gotten 5 stars. Gyro, shawarma all best in the area."], ["Pinky P.", "Great mom and pop Mediterranean cafe. I ordered the chicken schwarma wrap with the fattoush salad, and the wrap was just divine. The Garlic sauce in the wrap had such great flavor, the chicken was marinated well. The fattoush salad was really fresh and and had great flavor - lemony, garlicky, and a little sour from the sumac seasoning! My husband ordered the meat shwarma platter with the basmati rice and Mediterranean salad. He enjoyed it a lot, the only gripe was not enough meat. It's a good place to go with great prices. Definitely will go again"], ["Pamela D.", "Delicious, fresh Mediterranean food. You walk in and actually see the chef slicing meat off the skewer in the back, the baklava on baking sheets waiting their turn, and grape leaves being made; no frozen stuff. Their veggie grape leaves are very good, perfect balance of acidity..they have that hint of lemon I look for. The vegetarian ones are a little different because they have rice and chopped vegetables in them, which I was skeptic about because I do enjoy the rice ones but these were surprisingly good!  I ordered the good to go and was in the rush, but I should have, because I was so bummed when I discovered they forgot my garlic sauce :( Next time I check this place out I'm going to try it. It looks like they do hookah here, so I'll have to check this place out at might some time. I've been searching for this perfect combo; of that's the case here and the garlic sauce is good, I might just give them 5 stars! Looking forward to my next visit."], ["Philip K.", "Stumbled across this place on yelp and was pleasantly surprised.  Everything was very authentic. The gyro was fantastic...the pita was fresh and the tzatziki sauce (which is my favorite part) was a home run!"], ["Leah S.", "I had the Mediterian sampler. The food was good not great, however I suppose you should eat in. The portions going out to tables were large. With three tables seated, I waited 25 mins for food and I have to assume most of it was made ahead of time like the hummus tahbouli..and stuffed grape leaves. I got an extra peice of pita bread my total without a drink was 15.00...got home and opened the smallest box of food ever. Three stuffed grape leaves the size of my pinkie, one small falafel and one very small kibbeh...the hummus had a hugh ditch in the middle so it was very small same with tahbouli...Wallys Gyros on Cesery is so much better with normal portions and less expensive...very disappointed based on previous great reviews."], ["Jen C.", "I love this place and everyone I have brought here says it is the best Greek in Jax. Go for the lamb gyro... but you can't miss with the meat pies, Greek salad, or steak sack either. I'd eat here every day if my body didn't mind calories."], ["Sabrina G.", "I went in with a group for lunch and we all raved over our food. The Mujaddara was incredibly delicious with a very flavorful Mediterranean Salad. A friend had the tabouleh rider and another the falafel. We ended up having to get it to go, because it took just over 30 minutes to make. However, we all agreed it was well worth the wait. I can't wait to eat there again, but will call ahead if on a time crunch."], ["Landyn H.", "I'm addicted to this place! Best Mediterranean food in Jax. Quality of food and costumer service is outstanding!"], ["Ann C.", "We had dinner at Tabouleh last night and were very pleased.  Started with the sampler.  Hummus, tabbouleh,  falafel,  stuffed grape leaves and a small meat pie. I've never had better grape leaves!  For entrées we had both of their specials.   One was a vegetarian couscous the other Oozie rice with slow roasted lamb. The lamb was melt in your mouth delicious,  and the almond garnish have the dish a nice crunch. The vegetarian dish was eggplant,  zucchini onions etc. With a tomato chick pea sauce over couscous.  What a delightful find."], ["Rachael A.", "Delicious, consistent food, friendly service. Love the Mediterranean sampler, gyro, and their weekly vegetarian special is always awesome."], ["Andrew R.", "Super friendly people, super great food. I it's going to become my weekly stop now. Check this place out, you'll love it."], ["Jim N.", "I eat here about three days a week. Best middle eastern food in Jacksonville. Wednesday there is a vegan special, for example stuffed squash. The Veggie grape leaves are wonderful, but the best thing is the Addas soup. This is a somewhat spicy lentil soup with a unique flavor. The owners take great pride in this place. It is quite close to 295 on Merril road. Stop there on the way to the airport!"], ["Ashley H.", "This place is delicious. My favorite thing to get is the lamb gyro. So so good. It's also worth it to pay for an extra side of the tzaziki sauce. Also try the baba ganoush and the hummus. The service and food are well worth the price. Best Mediterranean food in this area for sure."], ["Connie W.", "Each here at least once a week...haven't found an item I didn't love....awesome humus and baklava..."], ["Phunk M.", "Food was fresh and so clean. Good little spot in Arlington where there isn't much to offer as far as fresh food goes. It's nice to see the locals get called by name. The chef knows them personally and knows what they eat. Pretty cool."], ["Minta C.", "Each time I venture forth to Jax from Fernandina, I search for a really great gyro, & I've finally found it! No more paper-thin, pre-sliced, bland pieces (what is that about? How can you say you serve gyros when you use THAT abomination?), no more vapid tzatziki; this was the real thing! Freshly-sliced pieces/chunks from a spit, plenty of tangy & garlicky tzatziki, plus lettuce, tomato, & onion in a fresh, soft pita. I asked for the \"salad\" instead of fries, because fries would be wooden by the time I got home, & expected to find a few lettuce leaves topped with a slice of tomato, as per usual, but WOW! Was I surprised! Instead, there was a large portion of a tomato & cucumber salad with finely-chopped parsley & a hint of mint, tossed in a lovely, light dressing. Can't be beat! I also ordered extra tzatziki as well as an order of hummus & was well-pleased with each. Even more, at first when I saw the pita accompaniment was not grilled or warmed, I was a little disappointed...but that was until I tried it. It was SO fresh it did not need the help grilling/warming gives older, drier pita! Now I know where I will head to pick up dinner each time I've been to Jax, on my way home from a day's excursion."], ["James L.", "So I've been on a greek kick lately. I've been trying out a lot of the places in Jacksonville. So Tabouleh was on my list. I went in just after the lunch rush ended. The menu is simple but they don't give many if any choices for sides, it's simply what comes with the meal, or the full sized entries. I wanted to get Tabuleh and Humus with my Greek Gyro, but apparently this was frowned upon?? So just Tabuleh, the Gyro was okay, took about 10 minutes to come out though with only 2 parties in the establishment.  I can't say anything was bad. But it was all just average, so driving 20 minutes to here again while passing a few other options isn't likely to happen. I can't say don't go. You should at least try it once, their food isn't bad it's just not great."], ["Danny A.", "Delicious! The Vegetarian Sampler appetizer was delicious and fresh. All the food is made fresh and not canned according to the owners and I can tell because it was hot and tasty. Free wifi is always a bonus too! Chicken gyro was very good, probably a 4/5. Would return to this place! Very authentic!"], ["Abigail B.", "We came here on Monday, and then came back on Tuesday, that's how good it was. It all tasted fresh, super delicious, and the owner was very involved with everything, which was a great sign to me. The interior is plain, and western in style, but you come to eat, not live. We tried the chicken shawarma, the wholly hummus pita wrap, the Turkish salad, the tabbouleh, the Turkish coffee and baklava. Everything was excellent, however the wrap was our favorite. The prices aren't at all bad, we would spend the same at a burger place. Highly recommend it!Ps: after reading the review about the cook, I kept my eye out for that, but didn't see anything worth worrying about. There's an open window to the kitchen, so there's no hiding, and everything inside looked pristine."], ["Steve P.", "Found this gem on Yelp just passing through. Best Middle Eastern cooking we've found outside of Cairo. Falafel and stuffed leaves outstanding, and leave room for the baklava. Ignore the ambience and just enjoy the food."], ["Francis C.", "Awesome Mediterranean!   Well worth seeking out, don't  come for anything other then good Mediterranean food!"], ["Tiffany K.", "IGNORE THE DECOR!!! This place is amazing. So amazing I started eating like a crazy rabid animal. You know that feeling when you're overly starved and you start rampaging for food? It was like I became a human being again after I finished my meal!!  The gyro was huge and had PLENTY of tzatziki sauce on it!! (Like tons. For example, I dipped my fries in the sauce that was in  my gyro...)I am so upset I didn't come in before. Despite the decor, the entire place was very clean and organized. The food was made to order and extremely fresh."], ["Firas E.", "I am from the middle east and Tabouleh food tasted like my mother's food if not better (sorry mom). I've been trying mediterranean food in every state I visit. Tabouleh is the best so far. I will drive the 2 hours again just to get their food."], ["Heather Z.", "Family owned restaurant. Great gyros & homemade hummus! Nice people."], ["Erik S.", "Great little place here in Arlington. The food is very good and made fresh. Prices are good for the amount of food you get. Definitely a place to check out at least once."]], "Bistro 41": [], "Choban Grill": [], "The Original Tunis Seafood & Chicken": [["Robert D.", "I've been here a few times when I'm in this part of town and the food is always good and plentiful. The gyros are the best I've had in Jacksonville."], ["Nyla S.", "I've heard a lot about Tunis recently but my boyfriend never wanted to go. So my relationship with this restaurant became a drive by. Finally he decided to say yes and we both regretted that we waited so long. I could only capture my food because everybody else dug in right away. The shrimp and wings were amazing, the shrimp was fried perfectly. My bf and I ordered the same thing but he got a side of fried oysters, they were really small but those were good as well. We will definitely be returning here. Sn: for everything to be made to order the wait wasn't nearly as bad as I thought that it would be."], ["Athena R.", "Best. Wings. Ever. Not the best gyros."], ["Mark L.", "Surprising for the area! Been there twice. We're headed back."], ["Mark B.", "Well I stopped in again today to tunis @ Regency. Mistake, this was not a good idea. Well for me at least but not my dog Missy. I decided to try the gyro again and it really was not good. The pita was stale and stiff the meat (I know it's kind of mystery meat) was just let's say fowl. I should have looked at the reviews but I thought I knew better. Maybe the other stores are better but for now I'm not returning anytime soon."], ["J D.", "The only items I got was an order of fries and hush puppies. The fries were ok, but i didn't care for the hush puppies.  The prices for the food are a bit high and the eating area was not kept clean. We had to check out the tables a couple of times until we found one that was clean.  This makes me question how clean they are in their kitchen. Even the parking lot was not properly groomed, especially for this to be a new business. There were weeds growing out of the cracks in the sidewalk and the signs were tattered and worn. Personally, I would not recommend this place."], ["Fred P.", "Best gyro in jax. That is all you need to know. Look past everything else, order the gyro meal to go and enjoy. That is all."], ["Bill K.", "Made a mistake and went here for lunch today. The place was packed and they only had 1 guy on the counter and o1 guy in back cooking. I was there for about 45 minutes waiting to order and get my take-out lunch order of 10 wings and a side of onion rings. When I got home with my order I opened it up to find 10 mostly burnt wings with way to much Buffalo sauce on them. The onion rings were mostly uninspired frozen onion rings, not much to say about them other than they were edible. The ranch dressing that came with the wings was good though.  One word of advice do not I repeat do not go here during the lunch rush hour, if all you have is an hour for lunch."], ["Cody Y.", "Prices are high, quality is low."]], "Hovan Gourmet Mediterranean Restaurant": [["Nicholas G.", "My two friends and I were in Jacksonville from San Francisco  for a conference staying by the Jacksonville landing. We decided to go out one night to and happened to come across this place prior to going out. This was by far the best meal we had during our entire five night stay. The food here so flavorful and reasonably priced. The three of us ordered a platter with four appetizers and when we asked to order more the very cute and funny server told us that we already were ordering a lot of food. We did not take her advice and ordered two entrees to share. Needless to say we ended up taking two full take out boxes of leftovers with us to the bar. This place has great food, reasonable prices and amazing customer service. The wine was priced affordably too! If I ever return to Jacksonville I would definitely return here."], ["Katie C.", "Thus begins my reviewing spree of restaurants in my new neighborhood! After hearing great things from numerous people about Hovan, I decided to check it out for lunch today. Falafel, gyros, grapeleaves, I'm a fan of it all, and Hovan delivers in an authentic and no-frills way. My lunch buddy and I arrived and stepped up to the counter to make our picks. My eyes were greeted by a bevvy of sides like hummus, tabouli, babaganoush and fresh fruit. I went with a Falafel Sandwich combo with tabouli and grapeleaves. My food was ready by the time I was done paying (a very reasonable $9!) and we headed outside to snag a table. The weather was fabulous and the leaves were falling on the bustling 5 points corner, making it feel more like a warm day in September despite the fact that we're inching into December. The falafel was crisp on the outside and flavorful, soft and warm on the inside, just as it should be. The tabouli was refreshing and crunchy, and I guess the grapeleaves were good, but I really just need to admit to myself that I don't like grapeleaves and stop ordering them. They just look so good! But yeah, they were acidic and mushy as usual, so I guess that means they were made well? All in all, the experience at Hovan was great. This is a place I've driven by a thousand times, and I'm so glad I finally went in and enjoyed it for myself. I'd highly recommend the falafel and a table on the patio to anyone interested in trying this spot out!"], ["Jim B.", "Delicious catering for our daughter's 1st birthday. Very easy to work with the friendly folks at Hovan. We got more compliments on the Hovan food than some of our more expensive catering ventures! Only wish we had more leftovers for clean up the next day."], ["Edward J.", "Good stuff"], ["Kim W.", "While doing a little shopping in the area, we found ourselves hungry. I checked this place out on Yelp, and the Yelpers were right. This place is great. I tried the falafel with some hummus on the side. It has to be the best falafel I have ever had. It is crispy on the outside and light and fluffy inside. So many are hard as rocks. A delicious lunch awaits you."], ["Mae M.", "We were told to check out 5 points because it was a tourist attraction.  We were hungry, so Anna and I checked this place out.  We actually just passed up a gelato place and decided to check this out because it didn't look totally deserted like the other restaurants around the area.  It's a small place, with some really friendly people.  I got the gyro plate combo (with 2 sides), and Anna got the grape leaves combo.  We chose the same sides - chick peas hummus and egg plant hummus.  They were both good.The service was superb.  They were very friendly and attentive.  They got our food out to us right away.  I'm a slow eater, but I managed to scarf my food down immediately.  It was that tasty!  The hummus (which came with a little bag of pita chips) was to die for!  I enjoyed my plate.We were actually in Jacksonville on business, and had to have a conference call in the middle of our meal.  The music inside was too loud so we asked the server to watch our belongings while we did our call in the outside patio of the restaurant.  They were really courteous and even cleaned our area up while we were working. If I ever return to Jacksonville, I will definitely pay this place a visit.  I totally loved it!"], ["David B.", "Mediocre food at a high price. Go to the Casbah if you want to eat Mediterranean food worth swallowing."], ["Hilary L.", "Good Mediterranean food is one of my favorite things and Hovan delivers.  Its a perfect place to go for lunch because the food is fresh, quick and affordable. I usually go for the Falafel Wrap meal [the falafel is always crisp and tasty], which comes with a choice of sides.   The hummus is a must-have for me, and its often the craving that gets me in here.  Hovan's hummus and baba ganoush is a little more acidic and tangy than most places in town and that suits me fine.  Make sure to save a little for an afternoon snack.The atmosphere is a little awkward on the inside, with most of the seating crammed along the side of the wall [essentially in a hallway] or all the way behind the kitchen, but the outdoor seating is great! It looks out over Five Points Point and you will definitely witness some interesting characters and clumsy drivers navigating the miniature roundabout.Healthy and priced right, this is the kind of treat you can afford both physically and financially."], ["Sharon Y. C.", "We just ate at Hovan last night. It's never crowded and always very good food and service. Very reasonably priced wine and beer. I really like their hummus and taboulli. My hubby usually has the lamb kabobs. Prices in general are very reasonable and we recommend it to friends who want a casual Greek meal."], ["Hunter B.", "I love dolmades/dolmathes and a good gyro. And now I also love Hovan Mediterranean Gourmet, because they did such a fine job with both of them. I'd like to return the favor with a very strong three stars. I'd give it four, but Hovan isn't an amazing place just shy of outstanding, five-star eateries (13Gypsies or Tento, for instance). The interior is all about plastic tablecloths and paper napkins; our sandwiches came in plastic baskets. It's like a fast-food joint with local art inspired by the Mediterranean. Actually, according to their website, Hovan is a small franchise chain found throughout the southeast that began in Atlanta. Thanks, Atlanta.Lackluster interior aside, Hovan puts together a fine meal, serves it up fast, and barely dents your wallet. That's why it should probably get four stars for knowing what it is and doing it quite well.I've had some nasty dolmades (looking at you, 3rd Street Diner -- how can you coat them with Hollandaise sauce?!?) and some amazing ones (Saad's in West Philly -- why didn't he start franchising?). The LDC and I agreed that Hovan's dolmades fell near the higher end of the scale. The tzaziki sauce had plenty of pep and wasn't as lifeless as it can be at many places. LDC's lentil soup was thick and yummy. She also loved her vegan Hovan Roll with hummus and tabbouli salad. My gyro was excellent. The meat was tangy, the sandwich arrived nice and hot, and the salad was fresh. Topped it off with a $3 Shock Top beer. Prices are reasonable compared to similar places.Hovan also has some shaded outdoor tables that seemed perfect for a sunny day lunch or dinner. A fine choice in Five Points. Recommended."], ["Matt A.", "This place was pretty good. I was a bit surprised at the prices, but the gal steered me towards a sandwhich that was in my price range. It was pretty good."], ["R. G.", "I've been here a few times and here's my overall opinion of this place.  It is alright but not noteworthy.  I'll go back to it, but I just wish a few things were different.      Pros:-They have some healthy options on the menu.-Good place to eat if you are a vegetarian or with a vegetarian.-Side salads are a good size and consist of romaine lettuce and several veggies.-They have a nice outdoor seating area that faces 5-points intersection and is great for people watching.Cons:-They seem a bit overpriced at $7 for a falafel or gyro sandwich (without sides).-The gyro meat is sliced very thin and the other toppings in the sandwich seemed to overpower the flavor of the meat.  -The lentil soup is watery and lacks enough spice.  -The service can be somewhat slow so if you are eating on a work lunch break and are short on time, get the food to go or you may be sitting for a little while waiting for your bill."], ["Andrea R.", "I get the same thing every time I come here.  I should probably switch it up, but the gyro is just too good to pass up.  I get it as a combo with Mediterranean salad and hummus.  The gyro wrap is enormous and half of it can easily serve as a meal.  The Mediterranean salad is chock-full of tomatoes, cucumbers, and olives.  I don't normally enjoy cucumbers but I love them in this salad.  The hummus is spot-on and is a far cry from any store-bought version.  The pita chips are nothing special, but I'll give it some credit for helping me consume the hummus!  The baklava is no different that what I've had in other places.  It is a messy thing to eat and is guaranteed to stick to the roof of your mouth, but it's delicious!  To maximize your experience, go on a day when you can comfortably sit outside and people-watch."], ["Dan M.", "I had the hummus and the falafel sandwich here, and they were great and vegan friendly.  My husband had the moussaka, and I have never seen him eat so much short of Thanksgiving dinner in my life.  I highly recommend trying out this place.  Although all food is not created equal here (my husband's meal was better than mine),  it is worth coming here to find something you may like."], ["Nara W.", "Excellent service, a tasty Mediterranean salad that was crisp and refreshing, surprisingly flavorful lentil soup, and it didn't break the bank.  Baklava seemed the standard store-bought, but overall this place has firmly made it into my list of dependably good five points eateries.  I'm looking forward to returning!"]], "Istanbul Grille": [], "Taverna Yamas": [["Elisa M.", "I stopped in on Thanksgiving,  and happy they were open.  had the gyro platter with blue moon draft. The flavor itself was really good.  The potatoes were kind of  big, basically a potato cut in half.  I would prefer them cut smaller but the portion size was excellent.  The pita bread would be better on the side rather than under the meat. I found it soaks up the potato and may juices making then soggy. The salad was included and  tasted fresh with tomatoes and cucumbers. My waiter was great, friendly and helpful. He even offered to move my seating so I could watch a football game.  There were 2 music scenes going on : main entrance had Greek style,  by the bar dance and pop. I decided to try their middle eastern tobacco with the hookah.  It was smooth and delicious. I highly recommend peach mango combo flavor.  They were sold out of the hookah's but sold me the one I had been using.  The manager was accommodating and wants to please the customer.  I recommend giving this place a try if even to leave constructive criticism so they can improve.  I enjoyed my dinner here and would definitely come back when I'm in town."], ["Brittany O.", "I ordered a meal with no dairy and no gluten.  My meal was brought out with cheese, Greek yogurt, and pita bread. The waitress took it away and removed the cheese, but left the pita bread and Greek yogurt on my plate, like it wasn't a big deal.  The restaurant needs to be more informed about food allergies.  I paid $15 plus got charged for vegetables that replaced the bread, potatoes, and yogurt.  Most restaurants aware of food allergies replace food with no up charge bc it's not something I choose to not eat."], ["Pamela D.", "Very cool, comfortable atmosphere. Love the outdoor seating on a breezy warm night. It's a little pricey, however the food is always yummy.My favorite things include the flaming cheese (mostly because I love cheese....and fire ;) ), grape leaves and the steak kabobs! They have a variety of hookah flavors if you're into that, but be forewarned: If you sit in the \"hookah area\", which is separate from the main dining room, they will only serve you bottled water. This is not something to get upset over, it's just a fact and honestly if you're from Europe it's the norm! I cannot praise the belly dancers and servers enough: The belly dancers are beautiful, talented women who engage the singers and put on a classy, fun show. Smile, clap and enjoy the show as napkins are flying and plates are breaking! In the midst of all this, the servers are organized and attentive. My only advice is to steer clear from the mixed martinis; they are watered down quite a bit. If you like a martini, get it dirty. This is a great place to hang out in a large group, check out some place different for once and spend a Saturday night watching the belly dancers, eating Mediterranean good and enjoying upbeat music with great service. Why not add a hookah in the mix; one time won't kill ya, right?"], ["Barron M.", "Went there for lunch on  Friday to try a new place. Walked in and thought it was closed because no one was around. Finally, we were seated and then the real problems began. Our waitress could not have cared less. She had no idea about the menu, what drinks they had, etc. The atmosphere was really dark and seemed like a good place to get kidnapped and wake up in an ice bath. Probably should have left on that note, but decided to eat the gyro I ordered because I am a huge fan. Unfortunately, this gyro tasted like Miley Cyrus fixed it, or maybe that's just because that was the music that was playing for 20 minutes. Anyways, just adds to the list of reasons I hate Southside."], ["Polly H.", "I don't understand why this place has bad reviews. I had a lovely time, food is tasty and the service is on point.Besides you are entertained by belly dancers and is family friendly."], ["Megan P.", "Gross!!! Food was tasteless! We ordered dolmades, pastistio, and the gyro platter. All, nothing to talk about again. My boyfriend ordered 4 crown and sprites...all watered down drinks and $9.00 a drink, for singles, that tasted like water. Our total bill, tip included because our large group, was $94.00. I had sprite to drink. Talk about a waste!!! Someone needs to go in and intervene asap or this place will be history. Should've known when we walked in and it was dead on a Saturday night. We WILL NOT BE BACK!!!"], ["Mai N.", "The concept of Greek Traditions is on point! The waitress was great. Giving it a 2 star due to the fact that our chicken kabob was not cooked throughly TWICE. Manager did apologize and comped 50% of our meal."], ["Michelle F.", "Came here with a group of friends who have come went several times before and loved it. Sadly I did not though. And they ended up having a terrible time too.  We had the rudest server who just kept throwingn up his \"I've been a server for four years so I know best\" card. He was awful. Rude and we never saw him after we ordered because he wouldn't give us what we wanted to order. He was just too awful and was so rude when we asked about why we had gratuity added when there was only seven of us. He did not deserve that tip. I've worked retail for five years and I know that if a customer wants something, you do what you can. Never going back."], ["Elizabeth M.", "This place is disgusting! Please do not waste your time going here. I went in with my husband and brother because they were open late and I saw the good reviews on here. First we were stopped before entering the restaurant through the main entrance and were told to go in through where the patio seating is. Okay.... Then we get seated and I felt like I was going to catch a disease just sitting in the booth. The booths were dirty and just filthy all over. Even with the dim lighting we could see the filth. My brother and husband said lets just get a dessert and go. So we waited 15 minutes for a server that never came. We ended up leaving. If the main dining room was filthy I can only imagine what the kitchen looks like. Yuck!"], ["Chris M.", "I went here on a Friday night for a friend's birthday party with a group of about 20 people.  The tables were setup nicely and the server did not appear to have any problems keeping up with such a large group, in fact the server was very responsive considering people in the party showed up at different times.  The lack of beer selection was a little disappointing and even more disappointing was having to describe what a Black & Tan was.  The bartender didn't pour it correctly and it ended up as a Tan with some Black.  My wife ordered a Reisling and was unable to finish it.  She loves Reisling and questioned whether or not she was actually provided with one.  The food, however, was amazing!  I had the snapper fillet (after having to send back the salmon fillet due to the server's error) and it was delicious!  A little heavy on the sauce, but delicious nonetheless.  I did appreciate the server owning up to his mistake and handling the situation professionally.  I attributed some of the confusion to the size of our group.  The hummus was really good and the pita bread was cut into several pieces which would be perfect for sharing.  I heard that the grape leaves were amazing as well.  I did not expect all of the dancing and all of the napkins being thrown around the restaurant so be prepared for that.  The staff did a great job of getting patrons to get up and have a good time though.  At the other end of the restaurant you will find the hookahs.  Many people were enjoying them at both inside and outside tables.  It was nice to have the separation though because you wouldn't have been able to tell that they were even there since you couldn't see them from the main restaurant. There was a DJ and some (mostly) fun lighting that made it feel like it COULD be a dance club at some point in the night.  The laser lights could probably be aimed a little different to avoid shining in the patron's eyes from time to time though."], ["Michael G.", "I don't know why I bother coming back. First of all, the hookah is disgusting. They use old pipes and the coals are instant light, so they have a chemical taste about them.The guy was nice and attentive at first, but after thirty minutes we didn't see him until we paid. Then came time to pay the bill...Figuring out the payments is ALWAYS impossible here. Always. The server charged the table for a beer we never had. The server swiped my card for another person's ticket and I had to pay more for something I didn't have. They insisted it was irreversible. They include 20% gratuity, which is because the severs aren't worth tipping in the first place. I'm usually a very generous tipper, as I know it's difficult to be a server on a busy night. A tip is a tip, not part of the bill. I didn't get 20% worth of service.Aside from the absolute abomination of handling payments and their sub-par hookah. The food is outrageously priced and it cost $5 for a domestic draft beer. I could go to any of the surrounding bars and have two for that price. Plus, water comes in bottles for $2.50 and you don't get refills. That's a 1200% mark-up on Zephyr Hills.Never coming back."], ["Marie F.", "I LOVE THIS PLACE. Great food, great drinks, and a great hookah spot that doesn't look like a psycho's basement. Date didn't double check movie times so we had over an hour to spare. We decide to have a few drinks before the movie. We are greeted warmly by several servers who give us great recommendations on drinks, food, and hookah flavors. And we've tried them all. -Variety of martinis ... perfect-Lamb ribs ... delicious (gotta come back for a full menu only gone through appetizers)-UFO  hookah (we were told it was a 50/50 hit or miss.. the taste reminded us of detergent... was then give a free reup of PASSION something? ... and it was a 100% hit!)Such a pleasant experience, can't wait to go back. Night and weekend staff are so much fun and knowledgeable. If you smoke Hookah and have not been here you are missing out!"], ["Misty S.", "HHhhmm...okay, I was kind of excited to go here for a friend's birthday because it was some place I'd never been and it seemed like a fun idea.I ordered a martini slightly dry.  What I received was a martini with Orange Vodka and olives.  GROSS!  I went to the bar and asked the bartender what she made and she said she made it with orange vodka, I told her I wanted a slightly dirty martini, those are made with regular vodka.  She made it over and yelled at the waiter that he put in the order wrong.Fast forward to the food...it was ok.  However, as I started eating, 6,000 napkins were being thrown in the air and landing all over everyone and into our food.  Kinda gross actually.  Then the belly dancer started prancing around and that was kind of fun to watch and see the people get up on the tables and dance.  I liked that part.However, wait for it....the bill came, holy crapballs!  TOTALLY not worth the price AND the fact that they slyly add the 20% gratuity, that you can barely read.In any case, I don't think I'll be back...but I'm glad we tried it."], ["Beverly H.", "Absolutely delicious food! Great happy hour prices. The only reason it has 4 and not 5 stars is because the credit card we paid our food with had charges on it that weren't ours once we got our bill in the mail. The cc company linked the breach to this place. I would go back but pay cash!!! Cash is KING here!! Also the staff was a bit odd."], ["Kristen E.", "This place is open late and although the dining room closes, kitchen stays open and you can order from the hookah lounge. More of a club vibe, but still decent enough to enjoy a meal amongst the billowy aromas of fake cherry smoke and interesting mix of clientele."], ["Stephanie T.", "So, while I was reading some of the reviews I agree with a few. The decor is outdated, a lot of the servers would benefit from being a little more professional. I think they are trying to put a front of being a nice, classy restaurant, but sometimes the atmosphere and reality is that it's a little nightclub-ish. The menu for me is way overpriced, but I go there for happy hour and then I'm not so disappointed. That's why I'm giving it 4 stars. I wouldn't pay the normal prices, but with 1/2 off drinks, hookah and most apps from 4-7; I will gladly pay $2.50 for hummus. I go there with friends after work and we all order a bunch of appetizers and a hookah and the drinks flow and we always have a good AND affordable time. A lot of my friends go late at night on the weekends and have a lot of fun. It's just not my crowd/scene around that time, but all in all it's a decent place if you know ahead of time what you're in for."], ["Jay J.", "Great service from a first time server. As a solo traveler dining out can be awkward, but I was at peace outside, and the \"Greek-ness\" of the food was top notch. Sweet family atmosphere, no rush, no pressure. I didn't delve into hookahs or any of the other things people are moaning about, but a good meal and a peaceful spot in a crazy city is well worth the 5 stars."], ["Rosemarie T.", "I have been to this restaurant many times and enjoyed the food and atmosphere.   We went last night  (Sunday ) and I was so disappointed in the food.   We had a group of 5 who got the Hermes shared dinner.   In the past, they gave you one of each appetizer for the number ordering. Last night you got 2 of each.  Also the meat was so over cooked and dry it wasn't worth eating.   Overall, a very disappointing food experience."], ["Mark H.", "It is hard to find food in the burbs of JAX past 10 PM, and after exhausting all leads, we ended up at Yamas, and that wasn't really a bad thing. If you've ever been to Acropolis in Ybor city, then you will find this place very reminiscent of your memories there. Loud music, napkins being thrown all over the place and belly dancers. Only difference is that the food isn't as good as Acropolis. We ordered 3 appetizers; hot pikilia, hummus and filet tips. All three were pretty good. The utilization of lemon on everything was a little abusive though, in my opinion. For this reason, I found the hummus to be the best of the three. We also ordered some white sangria, but they brought us RED. Not wanting to complain, we just took the red. It was decent, but nothing to write home about. Side note, I was going to order a Greek salad, but when I asked if it came with Greek potato salad, the waiter looked at me like I owed him money. He went back to ask the kitchen staff, and they said they had no idea what I was talking about and that \"salad does not come with the salad.\" I felt like maybe they were making fun of me a little for asking.  Either way, if you're used to eating Greek fare in the Tarpon Springs/Tampa Bay area, just note that Greek potato salad only seems to come with Greeks salads in THAT area, and not up in Jax."], ["Tim M.", "It is sad to see a good restaurant go bad. I love to go here for lunch and dinner,  but the restaurant is going downhill.  The tables are sticky, the decor is outdated, and the quality of the food has declined.  The only saving grace is the staff."], ["Ann M.", "I frequent this place because I love their tzatziki and pita bread, and also always get the same entree -- the original greek salad with gyro meat. They also have a nice comfortable outdoor seating section. I guess the salad would be sort of hard to mess up, just have fresh ingredients and we're good. However, each time I go, my boyfriend gets something different, and it seems like the meat is always over-cooked. He order filet mignon kebobs, medium, and it came out well done with chewy fatty pieces. Not so sure it was actually filet mignon."], ["Gary W.", "Not good at all.1) From the instant we sat down we were rushed to decide on drinks and dinner.  We decided on the Poseidon and ordered this for each person2) The appetizers were lackluster. The eggplant was tasteless.3) We expected to receive the Saganki next, it this was not served until after the main courses were on the table.  It was salty and small in portion.4) We specifically asked to not be rushed but all the food was served immediately after we asked not to be rushed.5) The fish, pork and chicken were all over done.  I thought I was eating a brick for the chicken.6) The wine was poor in quality.Don't waste your time, I will not darken the doorway at this place again."], ["Kimber L.", "fantastic!  We got there a bit early for the belly dancers and our waitress encouraged us to stay for it which we did.  We tried spanikopita(VERY good),  filet medallions (melt in your mouth), Salmon (delishious!) and lamb chops (done well but Lamb isn't my fav_others at our table liked it).The hummus was tastey.  We also ordered the dessert sampler..the ek mek was fabulous and the baklava was moist as it should be!Overall I loved it and will definately be back!!!!"], ["Michelle S.", "A good time, as always!  The atmosphere on a Friday nite is electric and loads of fun!  Food is wonderful, especially the lamb shank!  YUM!!"], ["Katherine M.", "I went here for a dietetic social so I got a deal and can't really rate for the price. All I had to do was pay $5 and I had access to a delicious buffet of Greek salad, spanakopita, hummus, tzatziki, keftethes, and chicken wings. It's hard to find good Greek cuisine but Yamas definitely has it. I was not a fan of the wings but the drinks were worthy of my attention. Most importantly, the staff was fun and our server got our group giggling when he'd randomly grab stacks of napkins and threw them up in the air to shower over us. By the end of the night, me and a friend joined in a chain of Greek dancing around the restaurant and joined in a quick dance on the table. Definitely try it. They'll have you yelling 'opa!' in no time."], ["Alexia K.", "I hate to only rate this place 2 stars as I have had some pretty good meals here in the past, but I have to after the meal I had today.  I haven't eaten at taverna yamas in awhile, and this was my first time coming here for lunch.  The hummus was good, but the chicken in my pita sandwich was spongy and looked like the weird chicken you find in a lot of frozen meals, not to mention that it was undercooked and still pink in some areas.  That's really dangerous, so I just can't overlook it.  I advised the waitress of this, but still paid full price for the meal.  At least the hummus and salad were good.  Just beware of the chicken.  Also, one other time I ate here there were flies everywhere inside and my friend and I were advised by the manager that this is normal because people open the door to come in and out.  Funny that in the other restaurants I go to, there are doors and no flies.  Interesting."], ["Heavi K.", "It was ok. Too salty for my tastes."], ["M W.", "This place is cool.They have family style Greek tables so you're sure to be cozy with whomever you're dining with and even those you didn't come with.As for the food I had hummus and pita which was good and not overly garlicky and the pita was pillowy and not too chewy.My entree was a gyro greek salad which had a good oil dressing.  The only thing different I would have wished for would be for the olives to not have pits.Overall good experience and food."], ["Teagues C.", "Went there for lunch and got the daily special of chicken, rice, and artichokes. The other person with me got the gyro and both dishes were awesome!! Definitely going to make this a regular on my list!"], ["Sebastian C.", "The food tastes great. However, it is really heavy! You will feel full after eating at this place. Almost too full! The people are really friendly and the it was really fun. They threw napkins in the air and smashed plates in accordance with the greek style. Cool place to check out-"], ["Rob A.", "I went here on Monday night and there were only a few customers in the restaurant.   Food was not the best.   We ordered the Hot  Pikilia , lamb ribs and Caviar spread. We were here before on a Friday night and I have to say the quality of food greatly differs.  The lamb ribs were chewy and slight burnt and so was the fried calamari that came with the Hot  Pikilia.  The caviar spread was so thinned out that it did not have good flavor at all.  I ordered the kids Chicken tenders and I thought they were the best among the rest we ordered. I wont be back during a week night here because of food quality but I will try this restaurant again on a Friday . . .  Although that there were only a few customers the night we visited the belly dancer came out and did a routine for us."], ["Erin B.", "This place is awesome.  We tried it after it was open for two weeks.  Hubby and I popped in there to give it a try after work Friday.  The place is the old Chop House and has been transformed on the inside with a great patio outside. We started with Greek salad which has awesome tomatoes and produce,a rarity for jax.  We got the hot and cold app samplers to split.  Lamb shanks were amazing, hummus, taziki, and grape leaves all standouts.  The staff was great, dancing and tossing napkins while belly dancer was making her way around the room.  The owner was great, jovial and passing out free shots.  They also have family style which combined with the fun atmosphere would be great for a bday or occasion.  Plus, the prices are great!  House Greek red wine is 4 per glass and is great table wine.  We need to support this restaurant in a location that has been numerous names, make sure it stays open!  Highly recommend this place!"], ["Janel S.", "I visted Taverna Yamas while vacationing in Jacksonville, after reading several extremely positive reviews.  I must assume that these reviewers have never eaten real Greek food before, or that I just went on a really bad night.  The food wasn't TERRIBLE, but for the prices we paid, I expected much, much more.  Pretty much everything we ate was bland.  The hummus and other appetizers were what I'd expect to get from a generic supermarket brand, not what's supposed to be a great Greek restaurant.  Luckily they were half price, or they really would not have been worth it. On the other hand, the seafood dishes were quite good, likely because the fish tasted very fresh.  The service also wasn't great, which was surprising, considering there were only a few parties in the huge space.  I wouldn't recommend this place to anyone looking for a great Greek experience.  I have eaten at many much less expensive restaurants with much higher quality food... but if you're going with a bunch of people and looking to have a good time rather than a fine dining experience, you could do worse."], ["Robin O.", "Based on reviews of places within a 5 minute drive of where I work (Southpoint area) I suggested this place to a co-worker and out-of-town colleagues, with the disclaimer that I hadn't been myself!  Thanks to all of you for such a find! Our server was friendly and helpful, there when we needed him but not hovering. The four of us shared appetizers of spanakopita and dolmades, and it was very apparent they were made in house and not canned/frozen. We were all jonesing for gyros. I was expecting a pita sandwich with maybe some fries that I wouldn't eat on the side. I got the sandwich part right... Warm, juicy, with plenty of tangy tzatziki and crisp onion, lettuce, and fresh tomato. The surprises were the generously portioned and exceptionally fresh Greek salad and the delicious lemony roasted potato wedges! I plan to organize an after-work Happy Hour here, as the half-price drinks and appetizers offer a cheap opportunity to sample more of the menu and atmosphere."]], "Wafaa N Mike Cafe": []}