{"Flavors": [], "Apna Restaurant Pakistani & Indian Cuisine": [], "India House": [["Kristina K.", "My mother's co-worker (who is Indian) introduced her to India House and she absolutely loved it. So when I offered to take her to lunch for her birthday, this was her first choice. The area is busy (especially at lunch time) but the restaurant itself wasn't crazy busy. The service was okay, our waiter was very soft spoken (my mother and I are not) and because we're weren't sure of the procedure (we saw people go up the counter to pay but he brought us our check for example), we were kinda of confused throughout.The food, though, was great. I'm normally very wary of buffets and when we first arrived the buffet was rather sparse and I was a bitter concerned. The second time we went up, everything was refilled, piping hot, and very tasty. We also loved the naan, super buttery and yummy. I paid about $17 (pre-tip) for lunch for 2, which is a great price for the amount of items we got to taste. The location isn't super convenient for me but I will be back."], ["Tara C.", "My husband and I went here when we were staying in Jacksonville overnight on our way to Miami.  We both have an Indian food addiction and it was really close to our hotel so we decided to check it out.  He had the non vegetarian thali and I had the vegetarian thail.  Everything was delicious, the portions were huge, and we had great service. The only thing I can complain about is that it was extremely cold in the restaurant and we had to eat with our coats on.  Even so, I'll definitely return if I'm ever in the area again."], ["Heather D.", "Had the vegetarian sampler and loved it! Enough food for 2 people. Friendly service. Wish they would open a branch at the beach!"], ["Amol K.", "Went there last night with my son. This was our second time. The first time the entire experience was pretty good. This time , while the food was decent, the service was very poor. The staff was less than courteous and repeatedly displayed a \"don't care \" attitude. So this place is off my list at least for a while. If you're willing to put up with poor service & less than acceptable attitude, the food is decent. However, this time around, the overall experience was rather poor."], ["Richelle S.", "We stopped off here on the way to Orlando. It is definitely going to be a favorite stop. Their chicken soup is the best we have ever had. We also had the maharajah thali which had a sampling of several dishes. Butter Chicken was excellent as were the appetizers of samosa and aloo poori. There was a big party ahead of us so we had a bit  of a wait. Worth every minute. Definitely recommend!!"], ["Wendy W.", "Wow!!! This by far was THE BEST INDIAN FOOD that I have had in Florida!  The medium chix curry my hubby demolished!  I had the Chicken Tikka masala, melt in your mouth tasty,delish oh my a little taste of heaven.  Pair that with the Garlic Nann.... Yummmm we were supposed to be on a diet and hubby was not supposed to eat carbs but he did.  The only little thing I ordered lamb samosas for an appetizer it came out with the meal, I was ambivalent I though the oil that they were fried in needed to be changed, makes sense I'm sure they do a booming business.  My hubby loved them all in all it was great wait the best part the bill was under $60 with drinks!!! Well 10 's!"], ["Ryan H.", "Not a big indian food fan although I don't mind the food I just don't eat it a lot. This place is good. Cheap lunch buffet with some solid food. Check it out. The cheese balls are sooooooo good. Really though this place is good. Give it a try."], ["Samantha M.", "Walked in to this place and BAM! I was hit in the face with all sorts of delicious smells and it was totally awesome. The service was great and the food was so, so, soooo good. We ordered the lamb curry and king's meal. Everything came out hot and delicious. The naan bread was fantastic. They give you chips and some dips as an appetizer and that was also very good. I already can't wait to go back and try everything else on the menu!"], ["Johnna-Mae V.", "This place is great!!! I haven't been able to find good Indian food anywhere so I was worried about driving 35 minutes for this place. Was worth it haven't had such good flavorful curry since I was in Singapore Indian district. This place is worth the drive and time"], ["Stacy L.", "Wow what a different experience! I came into India house after a TERRRRRRRIIIBBBLLLLEEEE experience at masala Indian cuisine on San Jose. The service was AMAZING!!!!! So helpful and polite. They helped me with my sons high chair and helped me because I had him and my items in my hand. Quick with the drinks and checking on me without being overly in your face. He was so helpful and assisted me with the menu. He gave me his opinion of entrees and i got what he suggested, which was delicious! I never worried about my drink not being filled. I wanted to try sauces but didn't know the names and he brought more. His name is Sudar. He seemed to be the only server and there was like 15 tables. He was fantastic!!! He was attentive to me and everyone around him. I was even more so looking at the service based on the terrible service i just received at masala. Would absolutely return. Would absolutely recommend. And sit with Sudar if he's working! He's great. This is my new Indian place in town. I'll be sure to tell all of my friends and family!"], ["Gregg R.", "Just a superb experience.  Perfect blends of spices, textures, freshness and tastes.  Among the best we've had.  Great staff too.  Can't say enough."], ["Domonic F.", "This was my first time trying Indian food. The only thing I have ever heard is that it's really spicy. So, I was expecting to have my tastebuds destroyed, my children and I Yelped India House along with many other places. We drove from Georgia just to enjoy something different and were not disappointed. The Naan was to die for, not sure what the chip type bread was but it was unique and my children loved the blueberry type sauce. I ordered the Maharajah plate and my head almost exploded. There was such complexity in the food I literally overloaded my tastebuds. My eldest daughter ordered Lamb curry she loved it, but was just sad that \"they killed a poor little lamb for such delicious food\". My middle child just couldn't stop telling all her friends what she had although I didn't know. All in all this place is Epic, I recently had to be fitted for a tux at Men's warehouse in River city. I made it a point to drive (what felt like 45 minutes) all the way to Baymeadows road just to get to go at India house. By the way the pistachio Kulfi...speechless."], ["B M.", "I have been a frequent guest at all three of the major indian restaurants in Jax (India House, 5th Element and India's Restaurant) and this one is definitely the best.The food is fresh. The staff is courteous and attentive. The weekend desserts are on point. The restaurant setting (compared to the other two restaurants) is more relaxing and never overcrowded, unlike 5th Element. If you don't eat meat, like me, then this place has the best options for veggie dishes. Don't get me wrong, they have plenty of meats as well. The variety on a daily basis is mind shattering. The buffet prices are all pretty comparable between the three restaurants with India's Restaurant being the cheapest. That being said, if you're looking for the highest quality indian food in Jax, hit up India House. You won't regret it."], ["Kathi T.", "Had dinner there last night with hubby...he kept saying \"wow,\" while shaking his head in disbelief at how good it was. \"It's like an explosion of flavors on my tongue,\" he described. I have to agree. Hubby is more well versed in Indian food than I am, but this is my new favorite Indian restaurant. We shared an appetizer platter of fried foods (not something we would normally order!) and almost didn't have room for dinner even though we didn't finish the whole thing. We then split the Kings Platter - so yummy!!! Two of the dishes were a little too spicy for me even though we ordered mild (the spinach and lentil dishes) so the hosts had a couple small batches made up just for me, and I now know to order \"extra mild.\" The Indian iced tea was delicious too. Yum, yum, yum! The chicken curry dish was our favorite. Also had the mullagatawny soup -we both loved it. We left stuffed AND took home leftovers. The service was extremely attentive and we just plain had fun there. Can't wait to go back and try some more!"], ["Roszetta D.", "My favorite Indian restaurant...  So, delish!!!  I highly recommend this place.  The food is great and the service is just as good."], ["Alex P.", "Great Food, great service, decent atmosphere. I like Indian and it met my expectations. Spicy hot might need to be a little hotter, but all the best flavors we're there on a good number of affordable dishes. Clean and modest dining space."], ["Needa H.", "We have been wanting Indian food for a LONG time and my friend and I finally went for it. We went on a Saturday and opted for the lunch buffet, so that we could try a little bit of everything, which I think is probably the best way to really introduce yourself to Indian food if you're not familiar. Everything was VERY good tasting. The servers and hostess were all very nice and attentive with your beverages and such. The only complaint that we both had is that the buffet food wasn't hot at all really (temperature wise). Nearly on the verge of cold actually. I think the food would have been even better hot. In fact I know it was because we went back for more Panteer and a new hot batch came out, and it was heaven! To be expected with buffets maybe, but I'll just order a meal next time."], ["Trevor C.", "The chicken tiki masala is the best I've ever had. They serve good portions and have a large variety of authentic Indian food. Out of the 6 local Indian places in SE Jacksonville, this has the best food by far."], ["Brian S.", "I was contemplating a dreaded \"bad\" review when I got here for lunch today.  Service started out poorly, but by the end of our meet, I decided that this place has a lot to offer.The food was fantastic--especially for a buffet (which I am not normally a huge fan of--and the service picked up eventually.I am looking forward to coming back for dinner in the near future, and recommend that you come here for lunch."], ["Sergio I.", "Absolutely impressive! Chicken Korma with rice and cheese naan is my go to Indian choice every single time, and I was very impressed with their version of it. Creamy, perfectly spiced and simply delicious. I will definitely come back! I am going to try their $8 lunch buffet so I can sample all the great stuff I'm missing out on."]], "Jacksonville Association of Firefighters": [], "Indian Fusion Restaurant": [["Liz T.", "We originally wanted tacos but the place was closed so we decided to try this place in the same plaza. They had some banners advertising lunch specials  in the window that made it look like a kind of fast food place but we were pleasantly surprised when we walked in and found a proper dining room waiting for us. There was a good food smell in the air that boded well for what we would get. We are vegetarians so I got palak paneer and DH ordered veggie korma and some naan for the table. I liked that their heat scale is 1-10 so you can really customize your spice tolerance. Our food came quickly and everything was really good. Nicely spiced and generous portions. We both REALLY liked the korma dish.The service was prompt and personable and we will definitely be back to try some other dishes. Back to those banners in the windows, they have several different lunch specials with really reasonable prices starting at $5. They also advertised a sampler lunch that lets you try three dishes and a drink for $8-$9 - we definitely plan to try that!"], ["Karly D.", "Large portions of delicious food. So glad to have a yummy Indian restaurant closer to home. Nice, friendly staff."], ["Sarah S.", "Tikka Masala soooooo yummy!!!! Shared with my one year old and she loved it as much as I did!"]], "Zesty India": [["Prag S.", "It is a just an 'ok' place. It is more like American Indian food place. There is not much Indian in there. Not much traditional India in there at all. If you are looking for more traditional Indian food look else where. The food is so-so hence 3 stars. When I go to my home country place, the least I expect is to speak in my (Hindi) language with the servers. But like i said it is more like American than Indian. Out service was good and food arrived nice and warm and on time. Well, we did have to go and ask for us to be seated while the servers stood and talked to each other."], ["M R.", "I saw an ad in Folio magazine for Zesty India and decided to visit this weekend.   There were four of us and we all had the lunch buffet.  The restaurant was clean and the waitstaff friendly and attentive.We all enjoyed the food, it was clearly labeled on the buffet and they offered a wide variety of choices.  I was particularly fond of the butter chicken and goat curry.  There were plenty of vegetarian options as well.  I'd like to return and try the \"street food\""], ["Alok D.", "Went there on a Saturday evening and was not at all disappointed....Had hara bhara kabab...paneer makhani and chicken biryani...it was the best paneer I had in a long long time...the decor is good and servers are always in with a smile...Definitely a go place when compared to other Indian places in Jax"], ["M K.", "Very nice and authentic indian food. Had veg food few times love malabar parantha, veggie platter , methi malai matter. Price little on higher side but worth the test."], ["Emmett B.", "Lots of vegan and vegetarian options. Been here twice and had great food both times. The staff are not experienced servers but the atmosphere is better than most Indian places. The wine selection is poor so byow."], ["Divya P.", "Great food. I would give five stars for food but it's too pricy. I ordered vada pav last time and the waitress forgot all about it. Upon asking she refused that I never ordered. Moving past, I only got one vada pav. Upon asking she said they only give one per plate. This is a lie because I have had two of them during my past visit. So I paid friggin 6 bucks for one vada pav. Not fair!!"], ["Shannon O.", "I like that Zesty India serves freshly prepared individual meals and plates instead of buffet style, and I'm willing to pay the difference. Not every diner chooses based on cost--some actually seek out flavor, menu novelty and overall experience. Stay strong, Zesty, and don't give in to the buffet crowd.Now, about the food: I thoroughly enjoyed the daily vegetarian lunch platter...and when they say platter, they mean it! An authentic-style stainless tray of no fewer than six different dishes, plus a generous basket of hot buttery naan. I think it was $8.95, which is a pretty terrific lunch price considering you get a wide array of aromatic, spicy, sweet and crispy all in the same meal. The menu had several items not found at every single other Indian restaurant in Jacksonville. Good for you, Zesty.The kitchen has definitely got it going on--but \"not so much\" with the wait staff. Our server was pleasant enough and got our orders right, but she seemed like she had never waited tables before. I'm sure this will get better in due course, and luckily, the dining room is small and not complicated so it isn't a real problem. The restaurant was very clean, nicely appointed, and a cozy size. Go, and be the change you wish to see."], ["Kristi V.", "They place my food on the next table for 5 minutes before picking it up to place it on our table. They only offered to replace it when I complained. All waitress seem to be on their first job. Food is not bad (hence two stars) but knowing they don't fix their mistakes and have no customer service, we wouldn't come back"], ["Sanij P.", "Food is Good but small quantity and very expensive. Not worth it. Nice decor. Do not recommend! Previous review dated when business was not even open. Hmm seems fake review"], ["Ch G.", "Very less quantity and service is very bad No indian food or its not indian style forget this restaurant"], ["Anu M.", "Food's good. The menu is certainly unique, compared to other Jax Indian choices. BUT, our server, though friendly, was disastrously incompetent. All tabs for our party of 6 had to be reversed and redone and took about 40 minutes to fix (this was at lunch on a workday). The place needs some trained wait staff and better management. Hope they survive the rough opening."]], "JaxMint Indian Restaurant": [], "Masala Indian Cuisine": [["Susan A.", "Been here twice now for the lunch buffet. Some of the stuff are too spicy for me as I can't handle spicy food too much. They have post-it notes as labels for the foods. It does the job, but I would love it if they added a spicy rating for each item, like a hot chili pepper as an icon and use 1-5 peppers so show the strength...idk, just a thought. This way I don't fill my plate with one of everything and only eat a few things cause the rest was too spicy, I feel bad for wasting food. Anyway, on to the food!!! After trying almost everything, my favorite things are the chicken tikka masala, nann bread and the rice pudding. That's it! Just 3 items that I love and I'm a happy girl! Shoot... I don't even need the meat, just the sauce and nann and I'm good. That's how much I love it. If you have nut allergies I would stay away from the rice pudding, it had some kind of nut in it. Customer service is okay, not super friendly but they get the job done. I come here to eat. It's a buffet, i serve myself pretty much. We were seated right away, water was always being filled, as soon as we were done with a plate they took it away and the check was brought to our table when they saw we were having dessert. I really like this place and will keep coming here for my 3 favorite things! :D"], ["Allie A.", "While I prefer some of the options in Baymeadows a tad bit better, if we are over this way, Marsala will do for my Indian fix. (Which has seemed to be a bit obsessive as of late.)I've been here a few times, and this last visit, we were meeting some friends on a weekend for an early dinner. We showed up maybe 2 minutes before opening, and a lady came to the door and let us know they weren't ready yet. We all looked at the time, and said, sure, no problem, we can sit outside and wait for 2 minutes... and then should told us it would be more like 15. That was a little off-putting, but we decided to hit up another restaurant in the strip mall for a few margaritas before hand. (And maybe an app too... we were starving!) That said, the pre-drinks and apps put a bit of a damper on our appetite, as we would normally order a bit more, but hey, thems the breaks I guess. A creature of habit, I order spicy saag paneer, and it was good. Spicy, spinachy and good bites of squeaky paneer. Service was on point after the initial interaction, and I would come back, if craving indian and on this side of town."], ["Jamie W.", "I first tried this spot with a group of friends for their lunch buffet.  For $8.99 you get AYCE and the buffet is full of amazing food.  It also includes small cups of chai tea.  The Naan is very good, although hard to keep hot on a buffet.  Everything we had was very tasty.  I tried the Chicken Tiki Masala, goat curry, and a few other dishes.  Some were a bit spicy, which I didn't mind one bit, but others were not so fond of the spiciness, depends on your taste level.  Service was a bit underwhelming.  They seemed a tad bit annoyed at our group size (10), but maybe they just aren't used to a large group during lunch.  Our drinks were kept filled, and plates cleared promptly.  Our family likes Indian food, and this will be a spot we will return to when craving this type.  Side note, they say that the coupon on Yelp is only good for dinner (it does not specify this on the Yelp app).  Not sure how long they will offer it, but hopefully we'll get to use it to try out dinner soon."], ["sherrie p.", "I like to come here for the lunch buffet 899 all you can eat everything you could ever want on the bar. Chicken tikka masala is my favorite it's available on the lunch buffet. Almost anything you can think of is available on the lunch buffet."], ["Ronald D.", "AMAZING, I was looking for a good Indian restaurant and saw this one on yelp with their deal and I am so glad we tried it. The food tastes incredible and the service is great. If you get spicy then be aware its spicy which should obvious.Coming back again for sure and can't wait to try their buffet at lunch too."], ["Mrs. Marisol R.", "I came in during the lunch buffet. It was good. I wasn't blown away, but I would eat there again. I do believe the variety available for the price, was a bit lacking, but what I ate, I enjoyed. I would always rather have quality over quantity. I did not eat any of the meat, only vegetarian. I'm not vegetarian, but I often forgo meat. What can I say??? This girl loves her veggies! The condiments were very good. I loved the coconut chutney. I've never had it before and it was a perfect respite when I bit into something extra spicy. One of my favorite dishes has paneer, but the paneer was missing. I don't know if it had gotten wiped out by the crowd before me, but even the couple pieces I found were very tiny, like the size of half a die, and dry. I must admit, I've been spoiled by Mint on Baymeadows. They have an elegantly decorated establishment, with a stunning display and variety. It's tough to beat.Masala's food was good, but the price, extremely stingy paneer and lack of options don't elevate it beyond a C+."], ["Mike R.", "Masala is one of our go-to Indian restaurants here in Jax.  Always a good crowd here, and always a number of tables of Indian patrons.  A good sign!My wife is a vegetarian, and Indian cuisine is perfect with lots of vegetarian options.The service here is attentive, kitchen turnaround is quick, and the food reliable and good."], ["Sam S.", "There is a lunch and dinner buffet offered in addition to the normal menu.  I tried the buffet which was very good.  The goat curry was the best in my opinion.  It was prepared in a traditional style, so the bones are included with the curry.  This just means you have to be careful when you bite into it.  I'll definitely be coming back again."], ["Richard H.", "This was my first taste of Indian Cuisine. The owner was very helpful in in choice of my firsr first dish. He recommended the Lamb Thalia platter. (Chef Choice of Chicken curry, Dal curry,sambar, raitha, Dessert)(Your choice of lamb curry lamb curry/goat curry/lamb korma)Although not my new favorite food of choice, I thought most of it was tasty. The Curry Chicken and Lamb with deliciously spicy. Plus The atmosphere was pleasant and a great selection of music from Indian artists."], ["Joe L.", "Wife and kids were out of town, found myself home alone (save for the cat and dog) so I thought I would spice things up and curry some favor with local establishments (sorry, could not resist). The crew was in DC visiting our oldest. On my last trip to DC, she took me to a great, upscale Indian place, and I have been unable, since, to get anyone listed on my tax return to go Indian with me. I took this opportunity to so do. Masala has been here a while, and there are a number of newer but firmly established places all within a couple of miles from my home. A quick review of Yelp led me to go with Masala for a take-away order of Nan bread and Lamb Korma. I have only two other reataurants with which to compare, so I shall simply say that the food was very good and reasonably priced. The nan bread traveled well, as did the Korma. The buffet looked very good and and I resolve to go back and try it as well. I popped in a few minutes early, and observed three table of patrons, all appearing to be of Indian descent, so I would guess that to be a favorable sign. The gentleman was pleasant and efficient, and my food came out right on time. Masala has been in it's currnet location for some time, and with good reason. Good food, good value."], ["Stacy L.", "Wow. what an experience here! I came based on reviews and received terrible service! Let me first say, I walked in and the food smelled AMAZING. I was really excited. I get seated quickly and they ask me how many, I said one and a high chair. And she, who she tells me her name is Julie, Julianna or Julia. She said 3 different names. Anyhow, we sit, I tell her id like a water and she brings two over and the high chair. I went to strap my son in and the high chair was broken. I never received a menu and never saw my waitress again. I finally asked someone for a menu. Still no one came over as I sat there waiting for service. 15 minutes passes, still no assistance. I finally get up and they run over asking what I need and I said I hadn't been helped I'd like someone's name that I can contact in regards to this. One guy hesitates and says his name is Eddie and then runs to the back and the other guy who says he's the manager, his name after asking for it repeatedly is Reedy. He tells me how they work like dogs and the food is hot and assumed I was going to the buffet. I have never been to this place. And I was not ordering the buffet. He started arguing with me I said I would write a review and speak to someone but wanted someone's name. I finally left. I get in my car and I strap my son in and the manager, Reedy follows me out to my vehicle and begins arguing with me! Then tells me he's going to take me to court because I'm writing a review and took a picture of my license plate! I have the entire thing on recording! I was absolutely blown away.This is truly insane and I'm appalled by the service. In other news I went to India house immediately after and they were fantastic! Wonderful service and the food was to die for. drive the extra 7 minutes and go there. This place is horrendous. If management reads this review, feel free to reach out to me and I will submit the video of your employee and his conduct.PLEASE REFER TO MY INDIA HOUSE REVIEW!!! They have amazing food at a great price and WONDERFUL CUSTOMER SERVICE!!!"], ["Geej H.", "I got takeout and it was delicious! A little bit pricey but the owner was very nice, the restaurant seemed clean and the food was very good."], ["Deb R.", "Pretty bad customer service. Which is my first impression of any restaurant. Indian restaurants are by nature not good at this. They never offered any water. When I asked, he curtly said that when customer orders drinks, we don't give water. What kind of reaction from a server is that? I'd have expected a polite answer for their own fault. Anyway, food wasn't that bad, but isn't good enough to trump bad customer service. I am definitely not going back as there are a plethora of Indian restaurants that would offer better customer service with equally mediocre food."], ["Sandra W.", "Service was awful today! My take out order was grossFood tasted like it was a week old. The place was very busy. I've been here several times before and usually had good experience. They have amazing naan!"], ["Jim B.", "I have enjoyed every meal from Masala. The menu features a wide variety and the food consistently excellent.      The buffet is amazing and provides the opportunity to try many different things at one sitting. I think that is the best way to enjoy Indian food.     Two of my menu favorites are the Masala dosa and the uttapum. I also like the sweet mango chutney.     The restaurant is always impeccably clean and the staff are friendly and attentive.     If you love Indian food or if you want to discover something new, this is the place!"], ["Jeremy K.", "My favorite Indian Restaurant in Jacksonville.  I love to go to both their lunch buffet and traditional dinner.  It is a little hidden away in a Mandarin shopping center, but worth the extra effort.  If you love Indian food, be sure to check out Masala."], ["Jennifer P.", "EXCELLENT food, and great service!  We've been a few times, but last night, I got something I didn't like, but it was my own personal preference of not liking the popular spice I didn't know was in it.  Even though it was nothing wrong with what they did, they insisted they make me a whole new dinner, leaving the spice out!  That's great customer service, in my opinion.Highly recommended."], ["Kat V.", "Have been here several times before, I enjoy the food, it's sometimes hit or miss. I've ordered tandoori chicken and it's been left uncooked, they took it off the tab. I have been here and enjoyed the buffet and recently it was really good. The manager was kind enough to make something special (because he wanted to) for my elderly friend who didn't eat spicy or sugary items. It was a chicken curry without the spices so nice! The customer service can lack since the men seem to be under a lot of pressure with so many people coming in. It's not that they mean to be rude, but sometimes they do need the be flagged down."], ["Elizabeth M.", "We walked in during lunch and were sat down immediately. We were waiting on my brother who would be walking in behind us shortly but trying to get drinks ordered would have been easier in a desert, seriously. So we basically had to flag down whoever we could and get drinks brought to us. The buffet.... what could i possibly say other than the naan was good. Even then the naan wasnt that great. Yes it was fresh but you can see parts that were burnt and then they slathered it in butter... oil? I dont know what. The goat is always my favorite to any restaurant that I go to but the trouble is getting through all the bone. My issue is that they litterally had only bones in the dish! They were straight up just bones, not bones with meat, they were just bones. When i asked if they could bring more out with meat they literally refilled the dish with more bones. What disappointment.  The gulab jamun (sp?) was good. But nothing really extraordinary. The jasmine rice was good. cooked well but you cant come here and get full off of just rice. The paneer chicken was pretty tasty but tasted too much like ketchup for me and the  tandoori chicken was sub par. I literally had to roll it in its own grease at the bottom of the pan so it wouldnt be so dry. I was also told that children three and under were free so why was i getting charged for my almost 3  year old who only ate naan bread? \"Its because of the food she wasted\" I was told. Bleh! what a bad taste in my mouth. Dont think ill ever go back to this place again. To many good places to eat on baymeadows to have to endure this place again."], ["Zachary H.", "Definitely the best Indian food I've ever had in Florida. The naan, roti, and all other standard dishes in Indian cuisine are perfect, the chicken tikka masala is probably my favorite entrée, and their samosas are my favorite appetizer. The staff are very kind, the atmosphere is pleasant, and the food is freshly prepared so it's not crazy fast but it doesn't take forever either. It takes just long enough to know that someone took a lot of care in preparing your meal. I always eat here whenever I visit my brother and his wife in Jacksonville, and I even plan to eat there tonight. Whether you want a whole family outing, a nice date place, or a peaceful, delicious meal for one, this place is for you."], ["Brian S.", "Found this little gem some time ago, and am hooked!  Their lunch buffet is just the right size for you to have a variety and not have you freeze up trying to make a decision on what to try next.Dinner was even better, and the atmosphere was surprisingly intimate while the lunch hour had exactly what you would expect for a lunch crowd.This place makes food that is to die for.  The service is a little taciturn, but they do a great job of making sure your needs are met and that proper attention is paid (without being obtrusive).My only suggestion: add a little more variety to the wine list.  My date for my most-recent visit is not a wannabe wineaux like I am, and was disappointed at the lack of sweeter varietals.  If that is the only suggestion I can come up with, that is pretty darn good.Oh, and if you are ever asked \"how spicy?\" be careful what you say!  You have been warned!"], ["Kevin C.", "Great food, prices and service.  First time visitor and I loved it.  I will go back."], ["Pam T.", "The service here is terrible. Went with a group of 4 people. We were seated and after 10 minutes no one had come to our table. My son asked a waitress walking by if we could get drinks. She just looked at us and walked away. Next time we saw her she was serving drinks at another table to people who had come in after us. After another 10 minutes with no service we left. No one stopped us to ask why we were leaving. Would not recommend to any one, if I am paying money for your food you could at least acknowledge we were there. Service is important to me when I eat out."], ["Jo H.", "Too heavily spiced and too much oil. Naan was good. A box of rice for my dish was regular white rice not basmati?!?"], ["Simply Indian Cooking ..", "We decided to try Masala for some south Indian food, based on a friend's recommendation.  Our intention was to try the a la cart menu but, upon arrival during lunch time we couldn't help notice the buffet.  We reviewed the buffet choices which included both north and south Indian choices so we decided to try it and were not disappointed.  The service has some room for improvement but, overall was positive dining experience."], ["Carla L.", "I have been coming to Masala since they closed Cilantro! (Which was years ago!) everything I've ever gotten has been amazing & the service is spot-on.. I love the onion pakora & samosas for appetizers.. The lamb Thali is a favorite weeknight dinner (only offered Sun-Thurs), and chicken saag & lamb rogan josh... And lamb vindaloo... Are also favorites. So much good food, it's hard to choose what to order!"], ["Steve S.", "Buffet was fantastic.  Lots to choise from. Food is delicious.  Is is an excellent value"], ["James B.", "Just got finished with another delicious meal at Masala's.  We had the chicken tikka masala and butter chicken with naan.  These are our traditional meals we order from this place, although we have had several other things from here. We have never had a bad meal here; if anything, this is my favorite Indian restaurant. The spice level is perfect, the interior is clean and the service prompt and responsive. There is a yelp deal going on now so take advantage of it; we will definitely be back soon."], ["Andrew M.", "This place is wonderful the food was excellent lamb Tika Marsala so creamy yummy will be back"], ["Foram M.", "I came to this restaurant after reading reviews on this website and think it will be better to update the reviews for this reauturant.  I came with my friends, few from pakistan and few Indians by driving 18 miles more. I telling you this because we know how indian food should taste like. I have an experiance that americans really dont know how authentic taste of few dishes shouls be. Order person: He was nice at first.  He typically forced us to get chicken lolipops as appetizer. I think it was okay. My friend liked it a lotMain course:  We ordered goat curry and lamb saag. These two delicacies are very famous and has a typical taste. It was aweful. Meat was not fully cooked. Lamb chunks were chewy. No taste in curry.  no salt at all. The saag was pathetic. I was very dissappointed. 2 teas, maincourse and appetizer was $52 plus 8 dollar tip. I didn't feel like it was worth it. Ambience: Waitress was staring at my friend a alot. Ambience and cleanliness was good. Tables are wobbly. Water that was served was not filtered.  I came to know that owner has branch in daytona beach too. I dont think I will go to that place and  waste my money. I recommend indians and pakistani people should not go with high expectations. I hope my experience will save your money."], ["Carlos C.", "Best Indian food in Jax in my opinion. I've been to every other indian restaurant and the food quality doesn't compare to Masala. I really love Indian cuisine and was introduced to this place by my friend Pathik, who is Indian, and insisted that the food here was pretty awesome! He was right! I've tried all the various curries they offer as well as other staple dishes. The garlic naan is the best I ever had and is a must order for me when I come here. We run through at least three orders of them per visit. The Samosa Chaat is amazing here as well. Hands down the best I've had anywhere. The staff are friendly but can seem a little awkward at times but that's no big deal. Service is always very good and the food is always hot and fresh too. The only reason I gave them four stars and not five is because there have been two occasions where I wanted to try their Masala Dosa but was told that \"the woman who makes it\" was not there that day. Maybe one day she will be there so I can give theirs a try. This is definitely my go to spot for delicious and authentic Indian cuisine."], ["Dmachop C.", "Good indian buffet and variety of dishes. Plus one for starters. Main course is pretty average with two sides and rice items. I see a lot of restaurants providing a single dessert for the buffet and this is no exception. No new special breads at the buffet and only one is Naan. Pretty packed on weekends, place seemed to be cramped but I would be proven wrong on weekdays.  Nevertheless, good lunch buffet that fills your stomach and worth the price."], ["Luka S.", "Good food and great service, curry was tasty and not too spicy. Place is very quiet and clean. Will deff go back again soon."], ["Ci C.", "I love this place and make sure to eat here once or twice a week.  I have tried other Indian restaurants here...but this is by far the best Indian food in Jacksonville!The naan is delicious, the garlic chicken and masala chicken are my favorites, and the curry is always very tasty.  I usually get mine medium-spicy, but medium is really good as well.  I tried the buffet for the first time the other day and was VERY pleased!  Everything was better than I thought it would be and I will definitely be going there for lunch again soon and bringing lots of people with me.A perfect spot to dine, if you are trying Indian food for the first time or have tried it many times.  You will love it!!"], ["Manish B.", "This was pretty decent Indian food, I am very picky when it comes to Indian food. Went for the lunch buffet after a business meeting down the street. It was fairly busy inside which is always a good sign. The buffet had a very good selection. Most buffet have limited amount of meat, there is always the standard tandoori chicken and usually one other meat dish such as chicken tikka masala. This place had the tandoori, chicken tikka masala as well as chicken curry, goat curry and two other chicken dishes. I was pleasantly surprised with this. I tried a little of everything, not bad, very average tasting Indian fare. The palak paneer was just ok and I thought the rice was a bit dry. The naan was good but thinner than I'm used to. I would come back here if I'm in the area and in the mood for Indian but would not make a special trip out here. It's worth a try!"], ["Kathy C.", "There are a couple of go-to Indian restaurants for us when we have craving for Indian food.  But we decided to branch out, be adventurous... and try some place new.  We went to Masala on a week night and the place had several tables already.  When we walked in, the friendly host/server, seated us a nice little table by the window behind the host stand.  We thought that was cool, until we realized that it may be the \"forgotten\" corner lol....Anyways, we ordered our standard fare, naan, buttered chicken, and tandoori fish.  Then we decided to try lentil chicken.  The food was a bit slow coming to us and what made it worse was, the lady who brought us our food, took our small plates (for the pre-entree chip/bread) and said she will bring us larger dinner plates.  And then, we waited... and waited... as we drool over the food on the table.  She never came back.My husband finally got up and went over to the bar to ask we could have some plates (after unsuccessfully trying to wave a server to our 'hidden corner').  That was the repeated scene the entire meal.  We want water?  We wave and wave and wave.  We want our check, we wave and do chicken dance... well not really, but had to really try and grab someone to acknowledge us.Were the people friendly?  Yes, they were.  They weren't 'trying' to ignore us... I think they just... well... forgot there is a table behind the host stand.  Unfortunately the food was decent but not good enough for us to make the trek over to this side of town instead of our go-to places.  And the service sure won't motivate us either."], ["Christine M.", "What a wonderful restaurant! My very first experience with Indian cuisine (with the exception of yummy samosas purchased at RAM from The Bread Company) was at Masala and, boy, did I fall in love! The restaurant has an inviting atmosphere with a warm color scheme and 'private' booths. Televisions play Indian pop music videos, which I love. The vocals are beautiful and the choreography is so interesting that I get distracted, but then I remember the delicious fare I have before me and I'm right back to nomming!The servers are nice, and the food has always come out promptly and piping hot when I've been. They have a pretty comprehensive selection of different Indian cuisine preparations (curry, tandoori, makhani, korma, and much more!) My favorite is the Shrimp Masala, Indian hot please! Goat curry is awesome, as well. The crispy roti has a nice flavor, accompanied by fresh chutney. Not the best samosas, but they're still tasty. I like that they put cumin seeds and peas in the basmati. And of course, flavorful and fresh naan varieties! It's a personal mission to try something from every part of the menu, I need to become more knowledgeable of Indian cuisine.My visits have only been for dinner, but I want to go for their lunch buffet soon! Definitely going to try a lassi (Indian smoothie) next time, too!"], ["Tom A.", "We were in flirida on business trip and decided to try the food  here. Awesome food! Excellent service!  Will come back again!!!!!"], ["Brad P.", "I visited the restaurant thanks to watching Man Vs Food, which was featuring some Indian curry.  I hightailed it to the closest restaurant.  When the gentleman greeted me and asked me what I wanted, I honestly had no idea.  I just told him I like it spicy, and it can be either chicken, lamb or goat.  Eventually, I just told him to surprise me.  I was very pleasantly surprised.  Normally when I tell someone I like it spicy, they usually dismiss it and make it mild (at least to my taste.)  It was the perfect spice level.  It got me sweating without absolutely burning my mouth.  I know it was lamb, but for the life of me I couldn't tell you much more than that, other than it was damn tasty!If I don't go back this week, I'm definitely going next week!"], ["Steve G.", "We had our first visit tonight to Masala..... And we used a $10 for $15 Yelp Deal with no problem.We started with the Somosa as an appetizer. It came with 2 dipping sauces... A tamarind and a mint. I wanted a straw for the sauces.... So damn good! And the Somosa was pretty damn tasty.... And fresh too.As the previous reviewer stated.... The garlic naan was crazy good!!! we had the chicken tika masala, and a paneer coconut curry dish. Both very different intense flavors. You really need to let the food sit in your mouth for a few seconds to taste the different levels of flavor. For dessert we had the mango moose.... Large serving, great for sharing. Intense flavor.Service was great! Get the Yelp deal before going to save a few bucks!"]], "India's Restaurant": [["Heather W.", "Best Indian food in JAX that we have found so far!The Bengan Bhartha was amazing- a lot like aloo matar but delicious in its own right"], ["D'man D.", "India's Restaurant is the first of the many Indian restaurants that you will encounter when you enter Baymeadows rd. from the Southside blvd. The unimaginative name doesn't help much nor does the fettered welcoming of the sardarji. However, all bad things end there.The place is decent sized and has nice and clean seating area with buffet tables on the top right corner. The weekdays buffet at 6.99 is more than a bargain with small varieties from both the Veg and non-veg world.The pulao rice was flavorful. The fresh-cut of salad vegetables, mint chutney veg-samosa, pakora, and raita were good starters. The samosa was good but veg-pakora was alright. The daal makhnai was good, chana daal could have been better. Most of the other veggie items like spinach, beans were good but was somewhat disappointed with the kadhi, I expected that to be good for restaurants from North, nonetheless, I felt the vegetarian options were pretty good and unlike other restaurants of the area, distinctly lacked the abundance of oil and spice, in a good way.The tandoori chicken was fresh, moist and flavorful but butter chicken was something to forget.The goat curry, albeit, a little salty than I prefer, was one of the best I've tasted so far in Jacksonville. I would go there just to eat rice and goat curry.The great tasting rice pudding/kheer was a nice way to end the meal.The service was unassuming and attentive. Overall, not a bad place to sample the Indian staple but sardarji and et.al could learn to smile to make it a better place."], ["Allie A.", "This is probably my favorite Indian place in town. I've seen some varied reviews about the buffet, which I can't speak to, as I've only been in for dinner. And I've been to dinner several times over the past 5 years, but it was before I started Yelping, so when a friend told me she was craving Indian, I suddenly started craving it too (funny how that happens, right?) so off we went. There were four of us, all with pretty adventurous palates, and my only demand (and the one thing I always just have to order) is saag paneer. (Spicy spinach and cheese, please!) We decided on two combo dinners for two: the vegetarian and meat platter. The saag paneer is SO GOOD. So good, I would have been fine with just that, but the lentil and lamb additions were delicious as well, and you get a sampler platter of appetizers (both meat and veggies) that really hit the spot, and there was not a thing I didn't really like. Well, the tandoori chicken was a bit dry, but still had a good flavor. Add a sip of my friends mango lassi, a few Indian beers, and we were completely and delightfully stuffed, with plenty to take home for lunch the next day. Even though this place has been around for awhile, it still appears clean, and the same set up from what I remember. The gal taking care of our drinks was friendly and smiling, but the guy, well... he seems super traditional, and not very outgoing, but I think he adds to the overall experience, and don't let it throw you off. I just wish we lived a bit closer so we could visit more often. (But we did hit up the Indian Grocery next door, so we can cave to our cravings at home when we don't feel like driving or heading out."], ["Dilpreet K.", "If you been to different indian restaurants like i have,you would know that EVERYTHING thats in the menu tastes amazing! The mango lassi tastes 100 times better than all the other restaurants lassis'. The saag paneer is so good! I honestly have nothing bad to say about india's restaurant. Hands down the tastiest food ever.will definitely come back again!"], ["Mrs. Marisol R.", "I am floored by the high reviews on Yelp. I don't know if I walked into a dimensional shift and ate in an alternate universe where burnt dry fritters that tasted like old rancid oil are de rigueur or what! But the reviews on Yelp in no way reflected my experience. Twilight Zone people...There was no paneer anything and very, very few entrée/appetizer options. Whenever I eat buffet, I always take about a teaspoon of any item that looks appealing and go back to my table to taste and see what I want to eat. My plate looks pretty usually, like an artists paint palette. Only a couple items looked edible. None were. the Channa Masala had NO FLAVOR and it looked like it was in a pale orange sauce that had zero spices in it.  I've never done this before, but I could not bring myself to eat there. I left, and I will not ever be back."], ["Kristina K.", "I started eating at India's Restaurant because my roommate (Daisy S) loves it and sometimes you just need a night of take out Indian food with your roommate. I've actually never eaten in the restaurant (though I would like to try their lunch buffet) but have picked up take out many times.When it comes to Indian food, I tend to stick to my chicken tikka masala and theirs is fantastic. Nice, big chunks of white meat, a great tasting sauce (I don't get it spicy but it has tons of flavor) served with a container of really nice basmati rice.  The dinner serving size is huge (the last time we got food there I was able to eat it for 3 separate meals). Generally there are one of two brothers up front running the register. One is very stoic and slow moving but the other one is quick and a little more outwardly friendly. It's so funny because they look a lot a like but behave totally differently. This area is full of Indian restaurants but this is probably my favorite."], ["Lindsay M.", "The best indican food I have ever had. Every time I come home to visit Jacksonville I can't get it out of my mind! I want it every day! Coconut curry with shrimp is my favorite! The garlic naan is delicious. Favorite Indian food in Jacksonville hands down, no contest!"], ["Eleanor C.", "Only my second time trying Indian cuisine, and will definitely be returning for more! Everyone ordered something different so we could get a good taste since it was dinner and the buffet is only during lunch time. The goat curry, lamb saag, chicken biryani, shrimp curry, and the chicken curry were all delicious, and different. We also got the garlic naan, and the keema naan-soooo yum! Making it a point to go back and do the lunch buffet which is offered Mon-Sat from opening until 2:30. At $6.99, who can resist? Oh, and the staff was so very friendly and sweet. My daughter loved the mango lassi, too!"], ["Kim F.", "This is the best Indian restaurant in Jacksonville! The food is fantastic, the best saag paneer ever!!! We love Indian food and have eaten at every Indian restaurant in town and this one is by far the best! Also the owner and staff are very nice, I've read a couple of reviews stating other wise, and while they don't show extremely overt ( phony) emotions, but they are very polite and friendly."], ["Vinayak K.", "I've been eating the goat and lamb curries from here for the past 3 years - at least once every 4 weeks, when I visit. This is a very interesting restaurant - the décor is sparse, the owner can seem a bit rude (he really isn't, its just his personality), but their food is phenomenal.Don't come here for the ambience... come here for the foodP.S. I once asked the owner if I could have an extra plate... he asked me why :) I cracked up, laughing :)"], ["Valerie C.", "LOVE THIS PLACE. Crave their saag paneer all the time dude, forreal. And it's not a rip-off either! 12 bucks an entree and they even include dessert.... Even if you're taking out!! Same people always working there always ready to offer me a knowing smile. They know their food is excellent at an amazing price. They even do a buffet but to be honest I don't even see how the prices could be lower, it's such good food.  Try the garlic naan to add to your meal... I really want some right now. Eat it for me in spirit."], ["Fernando S.", "Authentic Indian food! Exotic flavors and aromas. Staff are courteous, attentive, and prompt. A little wait for our meal, however totally acceptable and worth the wait. Highly recommend this restaurant. Great selection for vegetarians and omnivores alike."], ["B M.", "I have been a frequent guest at all three of the major indian restaurants in Jax (India House, 5th Element and India's Restaurant) and this one is a really close second, but have to put it 3rd on my list. The food is quality but the variety is limited. The saag is the best in town. Full, thick and rich in flavor. Very hearty. The rice pudding is TOPS in terms of dessert. Tastes like an explosion of fruity pebbles in your mouth. The restaurant environment is never overcrowded. The lack of variety is the only downfall. Otherwise this is a really great restaurant."], ["Jessica P.", "Great Indian cuisine! The food was delicious and the service was great! Authentic Indian food done right. The place seems to be family operated which I really appreciated. I got the chicken tikka masala and I loved the sauce. The garlic naan was good. The bottom line: A great spot for a decent bite at a fair price."], ["Jaime S.", "Please take into account that this is a family owned and operated restaurant and everything is made fresh and to order so there is a little bit of a wait but the food is well worth the wait, in fact I just went here and the coconut chicken was amazing as always. The food is always fresh and served piping hot. Best place to eat by far. My only complaint is that I ate way to much and now I am tired."], ["Nikhil M.", "Great food but poor on the overall experience. Not a friendly owner , only 2-3 ppl running the restaurant and hence the service is a little slow and the place itself is quite small . Tried the salted lassi....Please do not try it ...absolutely no flavour...The lamb vindaloo , the chicken makhani and the chicken biryani were all excellent ...Do try those out."], ["Beverly H.", "I love the food here. You cannot go wrong. There's just something so delicious about everything I have tried. I love SPICY food and so I usually order my meals as hot as I can get. It's delicious and their ice tea is good too (my main drink of choice). You really can't go wrong, but make sure you save room for dessert. Every single dessert ( and yes I have tried them all) is amazing! Plus the prices are just right!"], ["Nish S.", "Best butter chicken in Jax! We over 20 minutes just for their take out."], ["Savannah B.", "I've lived in Jacksonville my entire life and this is hands down my favorite restaurant in the city. The service is great and the food is amazing. I've had Indian all of the US and I've never found a place I liked as much as this one!"], ["Michael C.", "Very clean. Extensive Dinner Menu. The Children's meal is actually an adult plate with a few bucks off. The Appetizer sampler is a veggie/non veggie mix of 6 or 7 different items and bread that maybe one of the most incredible deals around. Service was brutally cold but efficient. Almost like East German border guards did a training in the restaurant."], ["Xale D.", "I like that the place is run by a stoic man. I come in, he greets me briefly. We waste no time exchanging pleasantries. I order what I always order -- chicken tikka masala. I'm not even sure if this is Indian food, but who cares? It's chunks of chicken breast cooked in a herby-tomatoey-heavy cream sauce. Did I mention the heavy cream? I'm lactose intolerant, so my toiletry bills go through the roof after a week of eating this stuff. What a perfect combination. The sauce:It's rich, bold, creamy, creamy, and creamy. The rice is soft, fragrant, and fresh, it reminds you of mom's freshly washed hair as she softly whispered you into sleep."], ["Jason B.", "This is hands down the best Indian place in the entire Jacksonville area. The lunch beuffet has everything you could ever want on it and the staff are as authentic as it comes and very service oriented. This is the place to go in Jacksonville for Indian food."], ["Steve G.", "I only was here for the lunch buffet...it's pretty cheap per person....but it's soooo good. I really enjoyed the tandoori chicken and the tika masala. The naan they make is really good. Good service, good food, good prices....A winning combo."], ["Richard R.", "Foods consistently good, love the atmosphere. My family and I usually put all the meals in the center of the table and go at it.  Naan is just the top of everything especially the sweet naan bread"], ["Elisha V.", "Most authentic Indian food in Jax! My husband and I have been eating here for almost 15 years. Very consistent!"], ["L H.", "This is one of my favorite places. I love the lunch buffet. Everything is fresh and delicious. Looking forward to the next time!"], ["Chad L.", "I cannot tell you how great this place is. The food is amazing. Naan is always cooked to perfection, I cannot get enough of Coconut Chicken. Cheaply priced and definitely the best Indian restaurant in all of Jacksonville. I try to go at least once a week. Definitely worth your time and taste buds! Service is very attentive to your needs as well."], ["Ccwriter V.", "This was our second visit to this restaurant in a strip mall. The most noticeable aspect at first, is it's very clean. We tried the garlic and plain naan. Both arrived hot and were very good. We shared the chicken korma-mild version, served with basmati rice and a small cup of lettuce with tomato, cucumber,and a fresh yogurt sauce.  Portions were more than enough and not overwhelming. One of us tried the lamb skewers and also chicken tikka masala.  All come with the same sides. This is a very charming spot and worth the visit.  Indian music was playing in the background.  Another nice touch."], ["Barbara H.", "We have been coming here for years and we love it. The family is so sweet. The food is so excellent. I can't even detail how great and tasty the food is. I love it. I think I said that."], ["Brentley S.", "After trying most, if not all of the Indian places on Baymeadows India's has the best Saag around. Hands down. It's to the point where even when I'm eating it I'm craving it. The lunch buffet is pretty decent with all the basics for a nice price of $7, and Saag is always there so of course that means I give it 5 stars. If you get there early you can get some amazing naan, when it's super hot and fresh!"], ["Marla R.", "My husband absolutely loves this place. The food is reasonably priced and great quality. The service can be a but dry but your water will never be empty neither will you have empty dishes for too long. One time one of the waiters offered a beer to my father in law in surprisingly good Spanish! Best Indian food I've had!"], ["Karen W.", "I absolutely love the food that they serve here! The chicken makani is sooo delicious as well as their nan!! The service is great and the establishment itself is very quaint and quiet. I highly recommend India's restaurant to any looking for AMAZING Indian food!"], ["Caron S.", "7 of us went for the $6.99 lunch special, which is mostly vegetarian items and a few (3) chicken items. Not nearly as diverse as what I remember at nearby Flavors' buffet or Apna on Beach Boulevard. For the price, it was decent and the atmosphere is inviting and clean. There's ample seating though it never got too crowded when we were there.Everything on the buffet was fresh and good but nothing stood out or really wowed me.I enjoyed the rice pudding for dessert - a slightly sweet way to end the meal."], ["Leslie D.", "Very good Indian food, although I really cannot compare as this is my first time eating it. The food was very flavorful and delicious. We ordered the vegetarian sample plate and were not disappointed. We will be back."], ["Ganesh V.", "Not very tasty but I feel cost is little low compare to any other I paid $7 for buff."], ["Jenny G.", "We came in at the end of lunch and the place was pretty quiet. The man & woman running the dining room both seemed friendly and our service was slightly above average. I had the lunch buffet, chai tea, & garlic nann my date had the chicken bryani. It was delicious, hot, & sooo tasty.      Bonus: Lunch buffet is very affordableI'll definitely be back.  :-)"], ["Chris P.", "Have been going for years and I regret not going for the fist ten years , mild and pure taste . very good vegetarian and meat dishes.  I love the chicken and would say the salad is good quality too. Simply best Indian cuisine in JAX"], ["Sheba S.", "We had a delicious meal of chicken tikka masala and eggplant. The rice was tasty and the samosa were flaky with a creamy filling of mashed potatoes. Service was okay and the staff is not particularly friendly but they are efficient."], ["Michael P.", "New to the Jacksonville area, we very much enjoyed our first dining experience here.  Sandy was a friendly and knowledgeable server that helped us to navigate the extensive menu and find suitable vegan options.  We were impressed and pleasantly surprised by the options available to us.  The gluten free chickpea flatbread with dips was light and crispy.  We shared a 4 entrees:  a yellow lentil dahl, and cauliflower and potato dish, an okra bindi masala and a spectacular smoky eggplant dish.  All were delicious.  We loved that the flavors were intricate and not overly spicy.  Also appreciated was that he food had a light quality and was not overly oily.  You can bet we'll be back here soon."], ["Vetey D.", "I love Indian food and this is by far one of the best in Jacksonville that I've tried. I've tried about 3 others... I usually am skeptical about the lunch buffet but had to try it since it was so cheap. I was not let down at all. It was flavorful and warm and had some selections that I liked. Their entrees are always fairly priced and leaves you full and satisfied. My sister in law, who's really picky about Indian food, loves this place as well. From now on, if I want Indian food, this is where I'll go!"]], "India Cuisine Art": [], "Kalyaan Market": [["Peter Y.", "We love shopping at Indian groceries stores to get items we use on a regular basis and to try new things. It also seems their spices are cheaper than a regular American grocery store. Kalyaan has a great selection of both packaged items and fresh produce. It is clean and well organized. Be wary of their snacks though. I bought a bag of something and while it was good, it could have possibly set my head on fire because it was so spicy. A great try of a new item though."], ["D'man D.", "Unlike it's other Indian cousins at Baymeadows, this one is located in a relatively quite strip mall at the intersection of Philips Hwy and Shad Rd.As you enter, it becomes noticeable that this place is big. It has a cavernous feel because of its high ceiling and it does have nice big lights throughout the store hanging from it.You will find all sort of Indian grocery items that you desire with big section for frozen items. They do have frozen fish of different varieties and meats like chicken and goat.There wasn't much varieties of produce and what was on display was old and wilted. I got a packet of turmeric, didn't feel good about it upon using; not sure if it was expired.Seems like it is run by few members of a family and judging by looking at the produce and fruits shelves it feels like they are trying to sell whatever is remaining, no matter how old the stuffs are before bringing the new batch.I would rather go a little further and explore the better choices."], ["Danielle M.", "I have numerous Asian influences from my Mum's side of the family and thusly grew up exposed to a wide range of foods and cultures (my treasured memories are my lazy Saturday afternoons spent at my grandparents' house watching wailing, joyful Bollywood films and eating my Nana's homemade Burmese-influenced Chow Mein).The Hublet has tried to ease me into my 4k mile relocation as much as possible, so takes me to as many Asian stores that he can find so that together we can explore the shelves.The Kalyaan Market was quite a lovely find, located just off of Phillips Highway shortly before the Regal Cinema at The Avenues.Entering the store through the doors on the right-hand side of the building, you're immediately struck with how big and spacious it is, with high ceilings that create odd echoes throughout the building.Make sure you don't overlook any of the aisles as they carry a great range of products, from curry sauces and pastes to imported drinks and a huge array of herbs, seasonings and spices.The chilled, frozen and seafood sections are located to the back of the store, the fruit and vegetables are laid out on the left side and in containers before the check-out area and the rice and dried legumes are on the left side near the fresh produce.On the first aisles on the right they stock some of those fantastic metal dishes you generally see in Indian restaurants.They stock a great range of rice, including Basmati, Jasmine and Brown, all in varying sized packs from small cupboard-friendly bags to huge sacks.They also have an excellent variety of frozen Asian cuisine including Parathas, a flatbread that you simply drop onto a heated non-stick pan and cook until done and are a great side dish that go wonderfully with any wet or dry curry.To the rear of the store on the left-hand side, in the chilled section you'll find boxes of Indian Sweets (which are incredibly sweet and too many will put you into a sugar coma), however the few times I've purchased these from the Kalyaan Market I've found them a little old and stale.  If you have a sweet tooth and haven't tried Indian Sweets before, I politely recommend that you choose elsewhere for your first time.There's obviously a lot going on behind the scenes as I rarely see many staff covering the shop floor and you may find yourself waiting a little longer than you're used to for someone to 'man' the check-out.Despite the slightly slow service, they have a great variety of Asian produce and this is a great store in which to discover some fantastic Asian finds, leaning more towards Indian and Pakistani cuisine than Japanese, Chinese, Thai or Korean."], ["KC F.", "Friendly staff and a good selection of items including fresh produce. I shop here often."]], "Shell First Coast Energy Store 1018": [["Dalton N.", "Shell gas station a little off the freeway. Nice and big. Has lots of gas stalls. Somewhat decent pricing for diesel. The store is pretty clean with clean bathrooms. I like!"], ["Jessi X.", "I wish I could put ZERO star. I went to the post office in the gas station to drop off my package . There was a lady in front of me and it looks like she's been waiting for a while . The only person work in the store , this Indian lady . She's helping a guy checking out at the other side . 5 mins later she get back to the post office side and helped the lady in front of me. Then there's a guy walked in and she turned right over there and told me to wait. Then I waited at least another 15 mins . And there's another girl in the line behind me waiting . Then she finally helped out him . And boom ! There's an othere 2 guys walked up to the register . Of course she kept us waiting over here and checking out the other guys!! So after I let 3 ppl cut in front of me and waited at least 20mins , she finally walked back to us and she took a look at my package and said \" did you paid the postage already ?\" I said yes, then she said \" you can just drop it off and leave \" I told her I wanna make sure she scan it . And she says\" ya I'll scan it \" . Then she turned back to the register and left my package on the table , and SHR DID NOT FU**ing SCAN IT !!!! I was so shocked and pissed ! The lady behind me looked and her and we were both shaking our heads for this \"awesome \" customer service they have here !"]], "5th Element": [["Raj T.", "Excellent  food. Tastes great. North and south indian were excellent.Nice ambience. Great choices to choose from."], ["Cam F.", "Well priced and nicely presented lunch buffet on a Sunday . A great selection of veggie and meat dishes. The curry goat was fantastic , grilled chicken kebabs , chicken curry, lentils, and a delicious eqq plant fry  were stand outs. Some dishes, like the sagg paneer had too much cream in them for my liking , but this is the case for most Indian restaurants. Naan was OK but not the best . Very good chutneys and riatas, and popadoms. Interesting deserts. All round very good!"], ["Elizabeth M.", "So I've hesitated to write my review for this place because I had just come to accept that service would be *meh* in most Indian restaurants I frequent however I've had my eyes opened and realized that I did not have to deal with it. Came in with the hubby and child and we were just taken to a table. No idea if we were supposed to serve our own drinks or where to find silverware. We saw some people getting served and others were ignored. We were in the ignored category. The food was decent but the naan had a lot of burnt parts, and not the good kind of burnt.  The food selection was typical but nothing special. I think the fact that service was so weird that we couldn't thoroughly enjoy our food with the lack of silverware, napkins and beverage. Or if I was supposed to do everything self serve then i would have been okay with it but I should have been forwarned. The goat was good but had lots of bone. Maybe it was more 60-40 with 60% being bone and 40% meat. Overall it wasn't a horrible experience but it wasn't great either. Not sure if I'll be back anytime soon again."], ["Matthew V.", "Came here for lunch with coworkers and was unimpressed.  They had a variety of your staple indian cuisine but it really didn't feel like anything set it apart from other buffets.  I tried plates with chicken tikka masala, the chicken biryani, and the goat carne (along with the expected rice and naan) but nothing jumped out as outstanding or even remotely distinguishing.  The servers were mildly attentive with regards to filling up water but that was the extent of the service we received, not that any more is really necessary for a buffet.  Price wise it was middle of the road for a lunch at 9$ but given the mediocrity I'll keep looking for my go to indian restaurant of the area.Bottom line?  Nothing remarkable here."], ["Simon B.", "Very good butter chicken! Hayward's 5000 is a nice strong beer. Had a nice big plate of leaven naan bread, rice and chicken with a delicious sauce that left me wanting more. Don't bother with the unleaven naan however as a $1.99 app they will add to your bill. The atmosphere is really nice, while not everyone would appreciate it, the bollywood televisions are fun to watch. Buffet is lunch only 11am to 2:30pm I believe."], ["Dmachop C.", "Looks like a typical North Indian restaurant -  Dim lit halls, busy during weekends and improper communication with the service ( with the exception of a few who converse well in English, otherwise difficult to understand what they say) and sumptuous food. No worries regarding the food but you may be surprised for the low number of items that are missing from a normal indian joint. But the unique flavours backed up with ample quantity leaves you completely satisfied."], ["Carlo D.", "Excellent place, kind and detailed attention, delicious food, abundant portions, great prices. This is my second visit and I ordered a vegetarian platter, which has nine small samples of dishes, a bowl of rice and one flat bread. It was enough to share with my wife. We also had some delicious hot tea. A great dinner experience."], ["Burj S.", "Went there for the Saturday Lunch Buffet, regarding the variety, taste and service just one word says it all \"Amazing\"I would highly recommend this place anytime to both the Regular Indian food lovers and any Newbies to Indian foods!There are 2 separate buffet set ups Veg and Non-veg and both have over 10 dishes to chose from and included is Kulfi, all the soft drinks you want and limitless Massala Tea!This is the best place I have ever been too and very reasonable too (under $11 per person)When in the area we will definitely be back!"], ["Ashish S.", "Best indian buffet in town. Nice variety for everyone. South Indian, North Indian, Snacks, Desserts they have all.They should work on their ambience and their utensils a bit as it seems quiet old.All in all good value for money. Would always prefer for buffet vs dine in."], ["Suryateja Y.", "sorry to say the food quality and taste was not good.. definitely not going to recommend to anyone.."], ["Johnelyn C.", "I had the chicken tikka masala. Really good and full of flavor. I was a bit hesitant because I wasn't in the mood for tomato sauce but don't regret it at all. Will come back. Just wish the dish came with less rice and garlic naan instead."], ["Jase H.", "This is the best Indian restaurant in Jacksonville. Wonderful lunch buffet. Always fresh, always full of options, always wonderful service. Some days the cooks are a little heavy handed with the spices, which I love.Shrida and his team are great."], ["Raiza R.", "Absolutely amazing place. If you like authentic Indian food this is definitely the place to go. They have an awesome lunch buffet! If you can't make it to lunch the Chicken Makani or the Chicken tiki masala are both awesome with a smooth, creamy tomato base that is perfect with their rice or some delicious garlic naan. If your vegetarian there's this giant wrap with potatoes and 3 dipping sauces that's incredible. Don't forget to try their mango ice cream!! It's the best!!!"], ["Jitan K.", "To me, generally Indian food from restaurants is bland and tasteless, not here!I really enjoy the fact that a Indian like me can go to a Indian restaurant and modify what I order (the more spice and garlic the better). The staff is very friendly and accommodating.With many places to choose from on Baymeadows Rd. I always advise anyone from out of town to try this place out."], ["Alok D.", "One if the better Indian restaurants in the town specially when u know that many are not around.i would recommend coming here for dinner to get a better dining experience.Had the chicken tikka,paneer kadhai and chicken biryani.All the dishes were warm well cooked and liked the paneer and biryani specially.They changed there chef recently it seems as the food tastes a lot better and delicious."], ["Anna H.", "I love Indian food!  Not knowing where in town was the best or even good after more than one poor choice on my part, I would ask my Indian work mates where they went to eat they gleefully told me Olive Garden, Carrabbas, Longhorn or some other  chain name.  No, No  for Indian food!  Ah, they all go home to their mothers, cook their own or come here. Well no one ever invited me for dinner with mom or took pity and invited me so I gave this a shot.   Once I tried it I knew this was my spot.  No much has changed in 3 years except when you show up for Sunday Lunch the mothers are already sitting down with the grandmothers and children galore are happily eating one of everything.  There is always a good selection of mild warm and I guess what most americans consider hot. I love hot spicy make my eye, water food and this almost gets me there. Indian spice is very different from Thai or Jerk. I never look at the names I look at the food to make my choices. I have developed some definite faves though; Goat Madala, Lamb Jalfraize (head rush) Yellow Dal and Aloo Gobhi.  After you taste buds are totally overloaded, a giant cup of Mango Ice cream or Kulfi will soothe you.  I am not a fan but there is Chai and Lassi...I took some first timers to this food style they are now believers.  Several of them went back so many times I thought possibly they were getting ready for a Zombie apocalypse,  but they ate everything.  No to go plates for this group!"], ["Jyoti R.", "We go to 5th element atleast once a month. The food here is delicious and tastes authentic. Their rates are reasonable and the best part is that they offer you a choice of rice or bread with their entrees. We have never seen any Indian restaurant giving this option. This easily lowers your bill as you don't need to order extra breads and take home the leftover rice. They even give you a choice of tea or mango ice cream for free (and you get to make your own cone).Their buffets are also good and have a huge variety of veg and non veg dishes. Plus its very reasonable. If you are trying Indian food for the first time, go for their buffet as you will get to try various dishes and make your choice then."], ["Michael H.", "My wife says 4 stars, I say 3.  And perhaps I'm being a bit tough here.  The crisp bread (can't recall the actual name but ubiquitous at Indian restaurants and brought immediately when one is seated) was stale.  The waiter, very polite, didn't write down the order and so I wasn't surprised that he failed to deliver our starter.  My main dish was aloo ghobi, which is unfair for me to judge because I don't even really like it - very bland potatoes.  I love cauliflower.  Potatoes - meh.  Someone who liked the dish might have been over the moon with this rendition, so lets not even count it.  My wife reminded the waiter about our starter - Vegetarian Manchurian, and I am so happy she did - it was delicious, but not for the faint of heart - very spicy.  The naan was also top notch and my wife's dish, Nav rattan korma, was also very yummy.  Other than the glitch with the starter our waiter could not have been more polite and attentive.  Would i go back?  Absolutely.  We are just passing through, and knowing how way leads on to way, I doubt if we will ever.  So, I would say good to very good, but closer to good - 3 stars."], ["Tracey G.", "Love this place. My husband introduced me to Indian cuisine here and I have yet to try another place. Decent prices for delicious food keeps me coming back. I love the chicken tikka masala with white rice or naan. The naan always comes out soft, warm and buttery. I recently came for the lunch buffet (around $9) and the chicken masala wasn't as good/flavorful as it is when I order it for dinner. Might be because of how much they need to cook for the buffet. I was able to try 2 different desserts, the rice pudding (SOO YUM!!) and what seemed to be a whipped mango yogurt dish which was equally as delicious. The icing on top of the cake is their mango soft serve (free with your dinner). Love 5th Element!"], ["April Z.", "The food was good but I will NEVER come here again.  Me and my dad came here for a lunch buffet.  When we were finished, my dad went to use the restroom.  We were the only patrons remaining in the restaurant once we were finished eating.  A few minutes went by, then all of a sudden the staff turned off all the lights except for the area where I was sitting.  There were three televisions on.  They turned off the television that was facing me and left the other two on.  I immediately got the hint they wanted us to leave.  I had no idea if they were closing or not, because none of the staff said anything to me or my father the entire time we were seated except when one of them came over to us and asked if we were finished with the buffet.  None of them said anything about closing.  Even if they HAD told us they were closing, that was extremely rude for them to turn off all the lights and only turn off the tv that was facing me, when they knew I was waiting for my dad in the restroom."], ["Jimmy P.", "Went with my coworkers for lunch. I'm not much into curry and spicy dishes so this place is OK.  Some dishes are mild. I like the desserts though. It's a nice Indian restaurant with friendly staff.  $7.99 for a lunch buffet.  If asked, I'll eat there again."], ["Caron S.", "Went today for a group lunch and previously I'd only been to India's Restaurant, Apna and Flavors. All had been good, so I was curious where 5th Element would fit in to my ranking. It had the most options (up there with Flavors, who also had a ton of variety) - easily 2, maybe 3x the amount that India's Restaurant (better atmosphere @ India's - large windows, taller ceilings, simple decor) has. Variety was the name of the game at 5th Element. Some of the items were spicy (I found myself lightly dabbing my brow at one point) and some were mild. There was one with peas and cashews that really stood out. The naan was always fresh and chewy. I loved all the dipping sauces - the tomato one, mint one and tamarind were all great. The coconut one left something to be desired. There were quite a few chicken dishes today and no goat curry, which someone had told me was excellent.Dessert offerings on the buffet included warm chai (definitely sweeten it - super bland without some sugar), a tasty rice pudding with cardamom, mango frozen yogurt (looked like mango color but didn't taste quite like it), a mango creme type dessert AND small doughnut-like holes. The atmosphere isn't anything special but it was clean and the buffet was expansive. I'd definitely recommend for lunch - $8.55 and hours later we're still stuffed!"], ["Jade N.", "It all started the year I moved to Jax, when the cool evenings began & the orange-red ombre leaves oscillating in the trees gave way to the ground.  We meet through a mutual friend.  We took him out to Thai one night & he decided to take us out to Indian.  That was when I met her, 5th Element.  As Hindi music was playing in the back ground, we made an instant connection.  However the time passed too quickly & we had to say our goodbyes.  I thought I'd never see her again, as the years passed on I occasionally thought about her.  Wondering how she was doing and if she thought about me as well.  It was only this past Friday that we met again, since those three years ago.  She aged gracefully but you can see the ware the years chipped away at her.  We reconnected as if we never lost touch, an old flame rekindled.  She still offered her veggie Marsala, jasmine rice, naan with varying sauces for dip, and others that I didn't know the name too.  One important thing, she didn't forget that I love her mango ice creme.  It was a great ending to our rendezvous.  As we said our good byes and made our departure, I could feel the curry pulsing through my veins.  I think that was the closest thing to nirvana that I've felt up to this point.  It wasn't our final goodbyes but a welcome back to my life.  Oooooh 5th Element, how I dream of thee."], ["Raghu A.", "Firstly, I was surprised to see $7.99 for an Indian Buffet. Secondly a bit more surprised after tasting the Chicken Biryani with Mutton Curry (My Fav Combination) . Even some of the vegetarian items like Okra Fry, Uttappam with Sambar is great :D You even get a coke with the Buffet ;) Non-Vegetarian items : Chicken Biryani, Mutton Curry is great. Chicken curry is good. Vegetarian Items : Okra Curry, Chana Curry with puri, Uttappam with Sambar stands apart. I heard some other curries are good. Desserts : Gulab Jamun is ok, Rice Pudding is great, Custard Salad is great, Ice cream is good. Overall I give 5/5 rating for this restaurant as you wont get this quality food for this cheaper price. Thanks,RaNa"], ["John S.", "Loved the food. I had dinner with my family here three days ago and I'm still thinking about. How many times have you been to a restaurant and still think about it after 3 days - yes, it's that good. This place is will tease your senses of taste, smell, and sight with their colorful food with rich favors. Make sure you bring a big group with you you can try everything. I can't wait to come back and try out their lunch buffet."], ["Deidre B.", "I ordered the lamb vindaloo. I took one bite and realized that it was chicken.  The texture and color of the meat was also a dead giveaway.  My husband kept trying to flag down the waiter, but he was pretty much ignored. When the waiter finally did come to our booth, he kept arguing with me and kept telling me that it was lamb until I told him that lamb is a red meat and the \"lamb\" that I had was white. He then said \"oh, they must have made your order wrong\". My husband ordered a platter that is supposed to come with a variety of different meats. He received a total of 4 pieces of chicken and one smushed meat stick (contents unknown).  Two pieces of chicken was cooked in a red sauce and the other two pieces of chicken was cooked in a green sauce. They only took my untouched meal off the bill because my husband had to ask them.  I left the restaurant hungry and peeved.  Fortunately, I was only visiting for that weekend, so I will never come back to this restaurant. I love Indian food and based on the previous reviews that I had read on yelp, I was expecting great food.  I can deal with mediocre service, but when the food that a customer orders isn't even what it is, it really makes me question the owner(s)/management(s) business ethics. Future diners, your experience may be different and hopefully better than mine, but this is one Indian restaurant I will never be going back to again."], ["Kim H.", "The food wasn't hot at the buffet and it seemed dirty at the table...I love Indian food and have definitely had better in Jacksonville...."], ["Harmony T.", "My husband and I go here for their wonderful lunch buffet - $7.99 M-F. We've never been for dinner.  It is busy around lunchtime, but you still will find parking and be sat at a table immediately. I like a busy buffet because fresh food is brought out often. Their lunch buffet has a huge selection of options and has two tables of food available, vegetarian entrees on one table and meat on the other. I think that they do a better job on the vegetarian entrees, as sometimes the chicken dishes are overcooked. It's a lot of fun to try the different foods available, and the lunch buffet never seems to be exactly the same way twice. I like to try a little bit of everything -- I'm pleasantly surprised often! Typically if something is really spicy they label it as such. My husband loves spicy foods and his favorite thing is the Chicken 65. My favorite is whatever sauce they are putting those little chunks of homemade cheese in.  If something is a bit too spicy for me I eat a little bit of curd rice and it cools it right off. The buffet also has hot chai tea (add your own sugar, it's not sweetened) and mango ice cream. They're a great finishing touch. Additional fun: the TVs inside are always playing Bollywood music videos. The price of the buffet here is the same as to two other places I've been in Jax for Indian lunch buffets, but 5th Element has more food options and is by far my favorite."], ["Angela D.", "I dream of this place! If I don't visit for over a month I just crave this place.  They have a great selection of vegetarian dishes.  I love their lamb korma when I go for dinner.  However, for lunch I always get the buffet.  It always has a great assortment.  Everything is always full of flavor.  So great for the price!"], ["Lakshmi R.", "It's nice Indian restaurant. Place is so big and good enough for parties too. I liked this place. They have decent buffet in the afternoon. I visited this place twice. If you want nice south Indian flavour in the food. Don't forgot to visit this place"], ["Jackson V.", "Quality -great. Ambience -so so. Prices - reasonable. Staff - grumpy but cooperative. Take out pricing - sky high. Seating -great.How often do I go there- average once a week. Which other Indian restaurants do I prefer - almost none ( Flavors, India's restaurant etc nearby all suck big time). Competition - Zesty on Baymeadows Rd is one serious contender."], ["Deepan M.", "Probably the best indian food I have had in Jacksonville.  Lots of variety on their buffet with each dish having it's own gravy and seasoning.  If you go into an Indian restaurant and it is filled with Indians then they are doing something right!"], ["Ayushi B.", "V nice food :) v tried South Indian dishes :) they were simply amazing :) above all it has a nice ambeience. :) overall the food is really nice :)"], ["Khaled A.", "I am a regular costumer, and my review is:-The staff is normal and very shy sometimes.  6/10 -The location is good and there are a lot of parking lots. 7/10-The restaurant size is very good. 8/10-The food is just amazing, I tried many Indian restaurants and this one is really the one. The best dish for me is the boneless chicken biryani. 10/10- The prices are really reasonable. 10/10"], ["Prag S.", "Very good food and service. Lunch is always well served with alot of options. Haven't been to dinner so can't say much about it. It is more traditional Indian then any other Indian restaurant in town. The environment is good and has TVs in there with nice indian songs on."], ["Mindy S.", "This was only the 4th time I've had Indian food and it was great! Had their food at a private catered party. My favorite was the chicken on the bone MURGH MALAI KABAB, a cauliflower and potato dish called ALOO GOBHI and a chicken dish called CHICKEN VINDALOO. Must order the chi tea to go perfectly with these dishes. These were so good I must go back and order again soon. YUM!"], ["patty h.", "I could eat at this place every day for lunch and never get bored.  The idea of buffets may scare some people but 5th element has a HUGE variety of textures and flavors.  What makes it even more awesome is the abundance of vegetarian dishes as well as a separate meat buffet line.5th element is very large, clean and the staff is very quick to refill drinks and clear plates.  The buffet is replenished quickly and the staff is very kind.  The worst is to be at an Indian buffet and trays stay empty and is never refilled.The buffet cost $7.99 for lunch.  You cannot beat it.  The food is fresh and so tasty.  In my opinion, the veggies outshine the meat at the lunch buffet with the chickpeas and the cauliflower being the stars  The mint chicken and chicken tikka masala are divine. So ridiculously good.  Suprisingly, you will see Chinese influences in the rice and occassional noodle dish in addition to a scallion pancake.I use to frequent India's Rest as well as Flavors.  These two places have predictable buffet.  India's Rest buffet has stayed the same for years.  Flavors chicken pieces turned into m&m size chicken where you would have to search for the chicken.  You think it's chicken and then realized you were duped with an onion or a potato.  Flavors also moved to a much smaller space and I feel very claustrophobic in there.Definitely give this place a try for lunch.  Lunch buffet allows you to taste everything without having to pay dinner prices.  5th element is a wonderful addition and my favorite on Baymeadows."], ["Kara P.", "I've been to this place more times than I might have since I moved to Jacksonville. Indian food is the kind of food I forget about until I randomly get a craving and it's all I can think about for weeks on end. Luckily, I was turned on to this place and I've gotta say, I'm a huge fan.I've been here for dinner a couple times and the lunch buffet once. I'm pretty boring and I stick with the Chicken Tikki Masala for dinner along with an order of Bullet Naan. I'm sure the other things on the menu are just as good, but I can't seem to stray from \"my usual\". I was impressed by the selection of the lunch buffet, had I had known how much there was to choose from, I probably would have made sure I was hungrier before I went there. The people who work there are always super nice and are in good spirits when I accidentally spill water on the table or toss my menu at my dinner companions (this is a warning for any new person who might go to dinner with me, this happens a lot). Go here for dinner first and then hit up the lunch buffet the second time."], ["Monica S.", "There is so much more to try at 5th Element!  This is AUTHENTIC Indian cuisine for sure.  I couldn't pronounce 98 percent of the menu items, and hadn't experienced the majority of them either.  There is a huge selection here ranging from Tandoori dishes to a dozen different kind of Indian breads!I had the mixed veg Pakora - which was essentially fried onions and what appeared to be a cornbread textured cake, encasing a hot pepper.  It was a huge portion for $3.99, but there wasn't enough veg variety for me to get super jazzed about this appetizer.  The Tangdi Kabeb was another story!  This was beautifully flavored Tandoori drumsticks! ($11.99) Absolutely delicious!I had the eggplants cooked in a peanut sauce and cream(?), and while this was a very rich dish I wasn't exactly sure how to eat it.  I scooped the sauce over rice and that did the trick.  This dish was a little spicy, but there was an undertone of peanut oil perhaps that gave the dish a little 'overly roasted' taste.  Not bad, but not my favorite.  The eggplant was really good in this dish however!I am definitely going back here as there is sooooo many dishes I would love to sample, but I think next time I will bring an aficionado of Indian cuisine to interpret the menu items!!"], ["Mollie K.", "This place is a nice quiet and mellow restaurant. The food was good I had a certain dish that I haven't heard before and it turned out pretty good. I will definitely come again."]], "Cedar Hills Athletic Association": []}