{"Casa Dora Italian Cafe": [], "Carmines Pie House": [], "Perard's Pizza and Italian Cuisine": [["Matt T.", "We stopped by for dinner and it was great, it started off with wonderful garlic rolls and I honestly think they were the best part of the meal not that the pizza we had was not good but those rolls were amazing"], ["Izzy F.", "Very nice friendly service pizza was home made to order. We were driving on i10w it was off the exit. Wish they had one in south FL"], ["Jessica L.", "I love the pizza but the employees can be pretty rude and they don't deliver anymore"], ["Jason H.", "After a second 10 hour day of driving south, we rolled into a nearby Jacksonville hotel ready to relax and eat. We picked Perardi's over Cracker Barrel for a change of pace; had Cracker Barrel for breakfast. Kind of a laid-back sports bar-esque Italian/pizza joint, the place was clean; service was good; the food was decent; and the price was spot on. Not a bad stop for the hungry traveler."], ["Sarah G.", "Perard's is fantastic!  Everything I've ordered from this restaurant has been wonderful and fresh.  Best pizza in town by far.  If you make it to Perard's, make sure to order the garlic knots, you won't regret it."], ["Jillian L.", "The quest for good pizza may be over. This place is a few twists and turns down the road from me and had yelp not existed I wouldn't have found it. We went a little over board this time, testing our \"usuals\" pepperoni pizza, Italian sub, spinach calzone ( don't knock it till you try it) and a meatball sub. The pizza, I opened the box and I said \" looks good\" it was good, very good, the sauce was tasty and the dough mmmm the cheese like I like, thick and chewy, I could have used more of that yummy pepperoni though, and it's great breakfast pizza. The calzone was sooo good, I actually tasted the ricotta, it was creamy and tasty, the spinach was a little squishy but still very good (you gotta use frozen spinach to get the right texture) all this needed to blow off the back of my head was a little feta just a little it adds salt and tang. The meatball was good and cheesy seemed like proper meatballs not the frozen crappy ones found elsewhere, the Italian was good but I ate it for breakfast, I'll have to try it fresh before I can judge it. Ultimately this was really freaking good, I was starting to lose hope about finding a decent slice in a 20 mile radius. I will be going back here, oh yes. Side note if you need gluten free deliciousness they have a pie for you. See you soon perard's"]], "Picasso's Pizzeria": [], "Toscana Little Italy": [["Lizzy C.", "My husband and I are new comers to the San Marco area and decided to try Toscana when we weren't feeling like battling Saturday night crowds at the more popular chain restaurants. We made the right decision! The dining room is dimly lit, romantic & comfortable and they even had a musician playing the piano to set the mood. There was no wait for a table on Saturday at 7:30, a rarity. The service was excellent and we were brought our drinks and fresh bread right away. The bread was some kind of italian herbed rolls. It came out fluffy & piping hot. Yum! I ordered the spahetti toscana, It was a lighter dish with fresh tomatoes, peppers, olives with a simple olive oil sauce. You could tell the pasta was home-made. My husband had the tour of italy, complete with lasagna, chicken parm & alfredo. It was all perfectly prepared & seasoned. We will definitely be returning to Toscana, as there were so many items on the menu that we wanted to try."], ["Ron D.", "Terrific family owned neighborhood Italian restaurant. Food and service was the best."], ["Steve P.", "Great little Italian place.  I enjoyed the Salmon Teresa.  Shared some Calamari with the table - and topped it off with some red velvet cake.  Next time, though, need to try the Tiramisu (it's made in the restaurant)."], ["Jim R.", "Went here based on the wonderful reviews.  Our Tuscan soup was thin and not exceptional in any way.  All four  entrees were Pedestrian at best, as was the waiter.  Sorry, but outstanding does not apply to the food or the establishment.  Give me Olive Garden any time."], ["Bob S.", "Quaint dining, extensive menu.  I had the chicken piccata, and it was very good, the chicken was cooked through, but not over cooked.  The dish was served with vermicelli, and the sauce included artichokes and a little bit of pimento, in addition to the capers.Seemed to be a good crowd on a Friday evening, many people came to pick up to-go orders while I dined.Desserts included tiramisu, cheesecake, red velvet cake, and... I forgot.  None of the choices caused me to abandon my pseudo-diet.  I was a little disappointed that they did not have any port for after dinner -- they offered me coffee, but I am not a caffeine based lifeform.On Hendricks @ San Jose, same strip mall as Player's Grille."], ["Steven G.", "This place is really good. Hot bread great pizza and really good salads. As good as enza's but cheaper."], ["Jim B.", "Great food and great atmosphere.  Wait staff are awesome."], ["William R.", "A great neighborhood restaurant that never disappoints. One of the best Italian eateries in North Florida. Priced right with a nice ambiance. The host is a great guy, always dressed like he just came from NYC or Vegas. You can't go wrong at Toscana."], ["Paul H.", "We decided to try Toscana's tonight and  we were glad we did. It was a later dinner do to the bad weather that rolled in tonight. By the time we got to restaurant it was after 8:30pm. The restaurant was about 35% full. The atmosphere was nice, not loud. The old school maitre 'd was a nice touch. The server was attentive and did provide suggestions. We started with the crab stuffed portabella mushroom and the calamari. We thought the crab stuffed mushroom was excellent. The Calamari was better than average but but not outstanding. The batter was light and not greasy and it was cooked correctly. It just was missing something to put it over the top. The main courses were Veal Florentine, Fruitti Di Mare, Steak and Cheese Calzone and the Medallion Al Cacciatore. We sampled each of the dishes. The Veal was very nice and tender and had a lovely light sauce. The Fruitti Di Mare (Muscles, Claims, Calamari and shrimp on a bed of risotto). The seafood was all cooked perfectly and tasted wonderful. There was a good amount of butter on this dish but it did not affect the flavor or make it oily. The Medallion was steak in a red wine sauce with mushrooms and onions. The flavor in this dish was the overall winner as best of the evening. The meat was nice and tender as well. As for the Calzone that is a basic simple item. Meat and cheese rapped in dough they are pretty hard to screw up or make it outstanding so no further comments are needed. Overall we are very pleased with this find and the fact that it is so close to home makes it a great find for us. If you are looking for a good evening that is not in an overly crowded neighborhood this should be on your radar."]], "Maggianos Little Italy": [], "Primi Piatti": [], "Mama Mia's Pizzeria and Italian Restaurant": [["Bryan B.", "Great food and great service. Very authentic food. It was a really nice and quiet place to have some really good Italian food"], ["Jared S.", "Heart warming. I went in to pick up my order of Stromboli and mozzarella sticks and there were three kids in the kitchen with chefs hats making their own pizzas with the biggest smiles on their faces. Not only the kids but the woman helping them had the most fulfilment on her face I've ever seen at a restaurant. This place is truly a family owned business doing what they love. I'm here on business and wish I had a place like this near me.My Stromboli was excellent with great flavor. Only gripe is the mozzarella sticks were cold and not homemade which this place can easily do. I'd like to see them do that. All around great experience!"], ["Ruthie C.", "My favorite \"what do you want to eat\" place. Mama Mia's is a family run business that cherishes the close family ties to ensure fresh quality in every order. Homemade pizzas to order from Mama up front, and delicious main courses from Papa in the back kitchen. Such a warm environment that keeps you feeling like your part of the family. Highly recommend to stop in and share a story."], ["Parker N.", "Great pizza, fresh and great flavor! Would recommend to all, the higher price is worth it."], ["Beth C.", "We ate here for our 18th anniversary. Didn't announce it, we like low key. My husband's  chicken cacciatore could feed our family of four alone! I got Mama's  seafood special, so delicious it was gone the next morning. Big plates, good food & great service. recommend!"], ["Darrah R.", "My husband and I ordered take out for our first time. I had a calzone with pepperoni and meatball. It was delicious!! The bread had just a touch of crunchy, not an overcooked crunchfest like most places. I think there is two different kinds of cheeses mozzarella, rocotta, and some yummy garlic. The meatballs were amazing little chunks of goodness, not slices or large balls. Their marinara is awesome too. Definitely my favorite calzone so far for takeout near my home. My husband had baked ziti that he let me try. I was not impressed, didnt see a lot of mozzarella, no meat and a little bland for my taste. I'll stick to the calzone and be back!"], ["Joe G.", "My wife and I have been eating here for a couple of years now. The pizza sauce is like liquid gold on a plate. In the 4 years we have been eating at Mama Mia's we have never had a bad experience with food quality or service. They do get busy at times and service my slow down but the quality and standards are always there. I would highly recommend the Stromboli or the double stuff pizza. Lunch is also very affordable and always hot and crispy. Emily our server has always been pleasant and even remembers our order before we even need to say anything. Overall this has been one of the most consistent restaurants that we have been to here in Jacksonville."], ["Megan P.", "We ordered pizza from Mama Mia's and it was really good. The white pizza is good and the meat pizza had really fresh ingredients. The pies are a good deal for the price. Everyone there was very nice when we ordered takeout and the dining room was full. That's normally a good sign that it's tasty. There were lots of families and the atmosphere seems very kid friendly."], ["Cole H.", "Being fairly new to Jacksonville and not knowing the local restaurant scene that well, my wife and I decided to try Mama Mia's based on mostly positive reviews online. Unfortunately our experience wasn't a good one. The service was fine and the employees were friendly but the food was just awful. My wife had the manicotti and I tried the lasagna. The best way I can describe the food was bland. It literally had zero flavor and the texture suggested that the food isn't made from scratch. Supposedly the pizza is good but I'm not willing to go back to find out. There's plenty of great pizza in Jacksonville.Mama Mia's needs some serious help in the kitchen. They would be a perfect candidate for \"Restaurant Impossible.\""], ["Renee T.", "Was really hoping to order delivery pizza from here today. Yelp said it was only 4.3 miles from my home, so that sounded perfect since they deliver up to 5 miles. Well, I called in just now and they told me that THEIR computer says it's \"5.1\" miles away and the actual driver refused to deliver! ARE YOU SERIOUS?! First off, you just basically said I was wrong and called me a liar. Then, you refuse my business because it's a supposedly a block too far outside your delivery area?! You must not want my money or business that bad!"], ["Jodie D.", "Hubby and I stopped in last night after reading other reviews.  We weren't disappointed! We got a Sicilian pizza and regular with a side of wings for take out.  We were extremely impressed and will definitely go there again.  The staff was also very friendly and helpful."], ["Cassie P.", "Garlic knots.  They're like a little kiss from heaven.  And Mama Mia's has them.Stopped here with some friends before braving a BJ's trip.  Atmosphere was casual, but nice. Service was friendly and attentive.  Food hit the spot.  Our plates consisted of Eggplant parm, salad, soup, and pizza.  All were quickly devoured.  I don't live in Jacksonville- but my friend who I was visiting lives right around the corner and I suspect we'll be back often. Be advised that the gluten free options are very limited here.  Other than salad and soups, everything on the menu was breaded or served with pasta."], ["James R.", "If you want pizza, this is likely a great place as most tables had it. If you want any other Italian meal, be prepared to have it heated in a microwave. Ever had veal or chicken parmesan cooked normal and then overcooked when reheating in a microwave? It's chewy, hard and unappetizing and that's what you get here. I asked about it and was told that everything except pizza is heated in the microwave, there is only one cook... Diners, beware."], ["Rob S.", "After my first trip in for lunch we decided to stop in for dinner.. once again the food was decent I got the wings which were good but nothing mind blowing.. I never figured there food for amazing just good and cheap.. well this was the same for dinner but the service was horrible.  The one young girl who is the waitress is horrible.. she is super nice but took forever to get our drinks once we ordered we got our food in stages. My wings were first then couple mins later my wife and sisters pasta then 10 mins later my sons pizza.. IMO the pizza should have been first out.. how long does it take to make a simple cheese pizza.. like a stated the wings were good nothing mind blowing. The wife's fettuccine Alfredo seemed to be missing something just wasn't much flavor. Of course the pizza was good. I think I am going to stick to just pizza from here and probably just for lunch.. if they got the service figured out it would be back up to 4 stars for sure. ."], ["Vincent G.", "The absolute BEST italian in Jacksonville!!!! And there Pizza is the best you'll find in this entire area! Service is impeccable and very friendly, plus the cost is waaaaayyyyyyy cheap! Being in a strip mall might deter you but your missing out big time!"], ["David B.", "I am reviewing only the NON-pizza half of the menu.  Apparently, the pizza here has many fans.  But my experience with the regular menu was so disappointing that I will not return to try the pizza.  Besides, my taste in pizza leans towards the pizza at Pele's and at Your Pie.  The photos people have posted of Mama Mia's pizza indicate this style of pizza is not my preference (to each his/her own!) I dislike intensely writing a negative review.  However, it has been years since I left so much food on my plate.  A friend recommended that I try this place (she did not mention that perhaps I only should try the pizza).  It has plenty of stars on Yelp.  I wanted eggplant parmesan so that's what I ordered.  While waiting for it to be prepared, I enjoyed the rolls and the light house salad with their Mama Mia's own balsamic vinaigrette.  I was surprised at the poor flavor of their iced tea (gosh, when have I ever complained about iced tea?  Never!)  Still, I was not prepared for what was to come.  The eggplant parmesan had a healthy helping of unadorned spaghetti to the side, which was cooked al dente.  Nothing wrong with the pasta.... I dug into the main course, which was buried under a mountain of mozzarella and tomato sauce.  The first bite made me cringe, it was so awful.  I couldn't believe how poor this was -- and this is only my personal opinion, of course.  Please understand that I have made eggplant parmesan myself many times using the recipe at Patsy's in Manhattan.  The version at Mama Mia's was in no way similar.  It was difficult to find the eggplant and almost impossible to taste it.  While searching my brain for an explanation why I found this dish inedible, the only thing that made sense to me was that they must have drowned the breading in very low-quality olive oil (or olive oil that was spoiled, or about to spoil).   The tomato sauce and mozzarella did not taste very good to me either.  I did not expect such a casual inexpensive Italian place to be superb.  But I didn't expect it to use such poor quality ingredients (how else to explain the poor flavor?) In any event, I tried 8-10 miserable bites, paid the friendly server and left in confusion.  How could my friend recommend this place to me?  How could it get such good reviews on Yelp?  Why would I have to write such a negative review (which gives me no pleasure)?  I hope people continue to enjoy Mama Mia's pizza.  For everything else Italian, I'll simply go to Sorrento's on St. Augustine Rd, which uses good ingredients and is always dependable..."], ["David C.", "Pizza is awesome. We also got stuffed mushrooms, and they were mediocre. Don't think I'd order them again."], ["chris h.", "The pizza is good, but it is really expensive good pizza. The lager Sicilian is gigantic and will feed a family for days."], ["Diana M.", "We ordered a pizza for take out from here and it was very good!  Probably in the top 3 that we have tried in Jacksonville.  Everyone behind the counter was super nice when I went in to pick up the order, I'm guessing they were all members of the family who owns the restaurant.  I'm disappointed that I lived right by this place for over a year and never noticed it - they should do some advertising!!I want to come back and eat at the restaurant and try a few more dishes."], ["Lauren B.", "Fantastic pizza!  Fantastic family that runs the place.  Always our go-to for pizza cravings.Other menu items are pretty good, but you can't beat the pizza here.  I only wish they would tear down the bar/kitchen wall and let us watch \"Mama\" hand make her pizzas!"]], "Taverna": [], "Leci's Italian Cafe": [], "Moon River Pizza": [["Mylon P.", "Order: Typicaly a White pizza with tomatoes or the Maui Wowee with jalapeñosPrice: $16-ish per pizzaPros: Some of the best hand tossed pizza ever, size of slices/pies, good selection of beer on tap. Cons: When you are eating in and it's busy the line can be a little long (5-15 minutes to order and 20-30 for the pizza). Thoughts: This is another of Jacksonville's awesome restaurants, and definitely in my list of places that you must try. It is the quintessential pizza parlor, the atmosphere is just what you would imagine walking into a local pizza place is like. Crowded when busy, loud from everyone talking and hanging out, and when they are really busy there is a long line to order. They have a few large TVs about the place with sports or other movies on and about 8-9pm the old school white disco ball starts spinning. Once you get to the food things get even better; they do hand tossed pizzas which you can order whole or by the slice and this stuff is the real deal. The large pizza are huge, easily enough for 3-4 people, and they don't skimp on any toppings. While everything I've had there is awesome a few of my favorites include the White pizza with added tomatoes, and the Maui Wowee (their version of the Hawaiian pizza). I'm personally think its a bit too much meat but my friends who like meat lovers pizza love the T-Rex (their version of the meat lovers) and comes piled high with sliced meatballs, ham, bacon, and ground beef.While I don't drink out much they also have a pretty good selection of beers including several local favorites. On top of being one of the best places for pizza in Jacksonville it might be the best restaurant to hang out, catch up with those you haven't seen in a while, or just grab a beer and a slice with friends."], ["Riley B.", "Finally got to try Moon River, although I did not eat in. My family and I decided to order in some pizza for MNF so I figured why not try Moon River finally.Since we didn't eat in, all I can really talk about is the pizza which was very good. Probably not my favorite in Jacksonville, but very good. I think we may have erred by asking for well done (my dad really hates underdone pizza) and it got a little overdone, but that is our fault and not theirs as we requested it. When I order again I'm not asking for well done. Still excited to eat in and will return soon."], ["Danielle K.", "Everyone tells me to try Moon River and I've been trying for months. On a whim, my plans got canceled last night and the kids requested pizza. This is where we went. (2 adults, 2 children)Parking is horrendous; however, I was fortunate enough to find a spot after several of the other businesses closed. I can see how miserable it would be on a busy day though. The environment walking in was insanely laid back and very casual. It's complete with brightly colored walls, a functioning disco ball and 70's decade music. Very helpful, younger looking employees. Also seemed appropriately staffed with no 'Help Wanted' signs.  Menu is on a large board to the immediate right with several options; pizzas coming in large, medium and slice options. There were also vegetarian options, calzones and salads. Beer and fountain drinks available. My children gravitated to the T-Rex pizza due to its name alone. An all meat, extra cheese pizza. Also had a half garden salad to share. The salad wasn't anything great- typical rabbit food but it was freshly cut if nothing else. The pizza looked like it was covered in sandwich ham, 6 pepperonis and cheese. 6 slices to a medium and while the slices were huge, I didn't know where the meat was. For something that sounded so carnivorous, it wasn't. There was a magnanimous amount of cheese on the pizza which really made it salty. The crust was thin, crispy and incredibly flavorful. All that said, this was on par for good pizza. I'm praying the lack of meat under the layer of cheese was due to an off night. Also able to try a bite of white- excellent. Also visited the bathroom for handwashing. Restroom was kept very clean with no exposed cleaning products or lack of paper products. Single person restroom. All in all, 5/5 stars for staff friendliness and helpfulness. Food was better than most run of the mill pizza joints in Jacksonville. Restaurant and restrooms were clean with no obvious health violations in sight. Family friendly and extremely laid back. We'll see if the pizza is still good in the morning. ;)"], ["Terra S.", "My little brother suggested we stop here while we were in the area.... He doesn't always have the best suggestions but surprisingly he didn't do to bad this time. We ordered pizza by the slice. I added onions and green peppers on mine, he added pepperoni and sausage on his. It was cheap, fast, and rather tasty. Totally worth another stop if I'm in the area and craving a slice."], ["Ellen K.", "Really great pizza and the pesto sticks are amazing!  I love going on Mondays because they have the old school special where you get a large one topping and a pitcher of beer for $20.  Plus they are super friendly about changing the channel on one of the TVs to allow me to watch my favorite sports team. Love it!"], ["Cheryl S.", "We had a joyous and wonderful evening at Moon River. You can eat at your own pace the food is incredible and the staff is professional and personal. The prices are moderate. Go a try it and I promise you will love it!!!!!!!"], ["Joe K.", "Oh my god Becky look at her pizza! It's just so round and filled with toppings. I love Moon River and have eaten a different item on the menu each time. Last night we had the Special and of course it was delicious. The staff is always friendly and the customers are happy. Next time I'm going to try the calzone with spinach."], ["Leah A.", "I really love this quirky little neighborhood pizza place.  I've eaten here a couple of times and had their specialty pizzas.  The atmosphere is unpretentious & the pizza and salads I've had were pretty simple, but tasty.  My favorites:  1) The White topped with mozzarella, feta & parmesan cheese, extra virgin olive oil, oregano, black pepper and fresh garlic 2) The Vegetarian loaded with fresh roma tomatoes, onions, green peppers, mushrooms.  Then topped with green & black olives, mozzarella and garlicI'm a huge garlic fan and you really can't go wrong with my faves. Overall, this is a solid place to eat that uses fresh ingredients and caters to people with all kinds of diet restrictions.  The prices are decent and the food is consistent.  And a place that actually uses fresh garlic opposed to the jarred kind gets them an extra star.  :)"], ["Chuck L.", "5 Stars no doubt the best pizza in town !!!What I love most is you can order by the slice or whole pie, calzones, salads... Tge Gorgonzola salad is off the chain !!!The T Rex pizza (Meat Lovers) has the best flavor and mix of cheese and meats"], ["Carly R.", "Went to Moon River on a whim while visiting friends in Jacksonville. Almost went to Carmine's but chose Moon River because it was slightly cheaper with slightly better reviews on Google. Being from Gainesville, I'm used to quirky restaurants; they're plentiful here. Moon River was the perfect amount of quirk and made me feel right at home. Plus, the staff was super friendly, from the wait staff to the pizza chefs, and they came around regularly to check on our drinks. Instead of being waited on at a table, you order at a counter and then pick a seat while the pizza is made. The wait staff then delivers the pizza to your table. The dining area was large with lots of tables; we didn't have to wait to find a seat, even on a busy Saturday night after the FL/GA football game.My fiance and I split a medium white pizza. I'm not kidding; this was THE best white pizza I have ever had in my life (and I've had a lot of white pizza). The combination of oil and spices was superb. I really wanted to eat the whole thing, but the medium was more than enough for us. Usually leftovers aren't as good the next day, but by some sort of moon magic, my leftovers were damn near perfect the next day. (Pop in the microwave for 1 minute, bake in the toaster oven for 5 minutes, then broil in the toaster oven for 5 minutes = perfection.)Anyway, this place is great, and I really wish they would open a store in Gainesville. It's better than any pizza I've had in my own city and the culture/vibe of the place would fit in perfectly here. I would definitely return if I'm ever in the area again."], ["David H.", "The service was really good. My pizza had a lot of dough. If you love dough this is the place. The toppings were fantastic. They were packed and I am not sure if they were rushing pizza to get them out, but part of my dough was not cooked. I had a piece of someone else's pizza in our group and it was much better. I will be back to give them another chance. Only 2 in a group of 16 had problems and it was only with too much dough in the pizza. Next time I will see if they have a thin crust. This is worth a try."], ["Ashley K.", "Never disappointed when I come here. The pizza is always amazing! 5 stars hands down."], ["Oscar A.", "It's Vegan friendly and the pizza is great. Go for Gluten free pizza, tempeh and fresh garlic. Atmosphere is on the hipster side. Great local gem."], ["Heather W.", "I really don't even eat here in a bind. I know it's a popular spot and the decor is cute but I'm not a fan of the pizza. I am from the northeast so solid New York style pizza is my fave, then after that there needs to be some artistry with cheese and toppings that this place is lacking. It's a bummer cause it's so close to my house too and I also want it to be more than what it is."], ["Tim L.", "Really good pizza.  Period.That's really not all there is to say about this gem of a pizzaria on the outskirts of riverside.  It's really cool that you can buy by the slice, and it is fresh made to  your order - no stale pizza waiting to be rescued and eaten!  The crust was crunchy outside, fluffy inside - all ingredients tasty on mine (T-Rex meat lover pizza). My wife had the The Pizza and my aunt the Special and both had good things to say. Great atmosphere and helpful staff. Can't wait to go back!!"], ["B M.", "Great beer, great music, great pizza.   A very nice additional to a cool neighborhood (Murray Hill)!"], ["Debbie L.", "Moon River has ok pizza.  I find most northerners love it.  We often get it for lunch because its convenient to work.  The restaurant is clean and staff is helpful.  It's worth a checkout if you love Pizza."], ["Samantha M.", "Moon river pizza is the place to go for a delicious slice and a good beer. I have been here several times and have nothing but good things to say about it. The pizza is hot and the ingredients are fresh. It's quite affordable and, unlike the Mellow Mushroom in the area, you can order a slice anytime. I just love this option. My favorite has to be the Maui wowie pizza-the veggie pie is my number two go-to when I need to satisfy that pizza craving. The wait staff is always friendly and cool and they have a few TVs which definitely offers an incentive to go when a game is on. The atmosphere is casual and laid back, it feels very comfortable inside. This place has a lot of good things going for it, and I have heard great things about the calzones, although I have not gotten around to trying them, yet. Moon River is a great casual lunch or dinner spot and is definitely worth a visit."], ["Styx S.", "A hipster haven in Jacksonville!On a recent work trip, I found myself being sent from fried fish camp to fried fish camp and I had had enough. I found this place (on Yelp) when looking for pizza. The food was excellent, the staff was friendly and you cannot beat half price beers on Wednesday. I had a hard time deciding on what to order. I got a small salad, two special slices and the killer whale cream ale. It was so nice to eat somewhere that I could tell they took care with their ingredients and loved what they were making. The crowd was diverse with young and old, small families, large groups and couples. Everyone seemed to be happy to be there. I know I was!"], ["Andrea A.", "I'm mad that I forgot to take a picture, I ate the pizza too fast. I had white pizza with tomatoes and pepperoni as toppings. Very tasty pizza, I just prefer thinner pizza. This location has a really cool look and it's great for groups."]], "La Cena Ristorante & Wine Bar": [["Ross S.", "We had a family dinner at La Cena two nights ago and it was DELICIOUS! The pasta is homemade and tastes so fresh. I ordered Trenette de Julianna and I highly recommend it. My husband ordered the Trennete de Cornelia and is was equally as good. Our son got the grilled steak and he loved every bite. I highly recommend this restaurant!"], ["Aime P.", "My only choice to go when I get the luxury of being spoiled for a quiet and fantastic dinner in downtown Jacksonville is La Cena. This is my favorite restaurant and I am so happy that Chef Gerry has continued to serve amazing Italian delicacies for me throughout my life.As a child, La Pasta Fresca...La Cena's predecessor and one of Gerry's first restaurants, was the only place you could go to truly have an authentic, fresh, and tasty dining experience. What La Pasta Fresca lacked in ambiance has been made up for 100 times over. Seated quietly in the enchanting lower level seating area, a glimpse through the front doors of the beautiful historic downtown architecture combined with the fabulous wines and the remarkable menu makes the guest feel that they may just be in another big city, certainly not Jacksonville.The food is truly fresh and the presentation is always beautiful.  My favorite meal, not on the menu usually, and created upon my special request....Cappelletti Rosato....(thanks Gerry!) is always perfect. The Frutti di Mare is one of the specialties and seems to be a favorite...though I will never know more than a few bites of because I always get the same thing! I try and try to make it through to the desserts, because they are incredible, too, but the portions are big. This is a good thing, so I can enjoy the leftovers for breakfast the next day....yummy...nothing like cold pasta for breakfast!I cannot say enough about this all time favorite of mine. Any chance I have to get prettied up for an evening out, especially for birthdays and special occasions, I always say La Cena and I will follow Gerry anywhere he goes. You must try this place and you will love it too."], ["nom nom nom T.", "Pray to god you don't get the Asian waitress named Marlene(?) who works there.  I was here during a work conference, the atmosphere was quiet and cold. The other waitresses were friendly but the service was lacking. Marlene was pretentious and rude when I asked her questions; she was not friendly whatsoever but gave an attitude and looked down at our table like we were idiots.  I had already mentioned that this was our first time coming in. We were the first customers of the evening with my table of 4 and it took over an hour for entrees to be served. When I asked for any dinner or drink specials the waitress looked at me like I was crazy. When I asked for recommendations or popular menu items she was neither helpful or attentive. My glass of water had to be filled by another waitress even after someone reminded her that our table needed refilling services. The prices per entree ranged from at least $25+. If you're on a $50 a day per diem I wouldn't spend it here. The only positive comment that I would have to say is that their portions are huge but its definitely what you're paying for. Service and food go hand in hand, if one's lacking I would not waste my time on returning or trying this place out, as mentioned in previous reviews that they obviously treat their returning customers better than ones that haven't been before."], ["Philip K.", "Great food, slow but friendly service, atmosphere is not great"], ["Elle P.", "My husband and I love this restaurant. We rarely go downtown but this place is well worth it.    The staff is very attentive to your needs and the food is unbelievable for Jacksonville.  if you are visiting, give this place a try, I feel like I am back in NY when you go there. My husband loves the veal dishes, I love the Emiliana Cappeletti, Mussels Posilipo and the Ellie Fish.  Call ahead for reservations as sometimes they are 100% booked and sometimes totally open, our downtown is so unpredictable!"], ["Sam S.", "Good food but both of our young female servers were very rude."], ["Jodi C.", "I had a horrible experience, along with the group that joined me at La Cena for a friend's birthday celebration.  We were so excited to try this place but were so disappointed with the service and lack of respect for our group.  The food wasn't worth the price and was mediocre at best. But what really ruined our experience was the service, or lack there of.  The staff, I believe a family run restaurant, was so rude to us that I would never step foot in this place again."], ["Kurt M.", "Great food and fantastic staff. Every dish was great. I just wish that this restaurant was located next door to my apartment in NYC!"], ["Jay L.", "La Cena, which I think, must mean something like \"the dinner\" in Italian was a nice surprise for us the other night.  Ok, surprise may not be the right word, since I've had multiple people tell me that this place is worth a try.If you're looking for mushy, never ending bowls of starch with a salty sauce, then this isn't your place.  Also, if you're looking for a huge platter of stuff that tastes just like your companion's even though you ordered different things, then again, this ain't for you either.I've been to Italy a few times and I can't say that this was anything like the Italian food I've had.  Then again, it's all very regional and perhaps this was from a part of Italy I've not been to.Anyway, the decor was cozy, we had the entire joint to ourselves.  The chairs could be more comfortable, but that's really the only thing that's a drawback.  Overall, a very nice ambience, with earthy tones, white table cloths and flickering candle light.  Not 5 star, but nice.The service was friendly and not pretentious at all.  I'd read on another review site that it was.  Our waitress was friendly and very casual (almost too much so).  She recommended a nice wine that I can't recall the name of.We started with Shrimp Carbonata (of course) which was about 8 butterflied shrimp with a light breadcrumb crust.  It had a smoky flavor what was different and very good.  The crusty bread that comes with the meals was also nice, although slightly dense.  I do like olive oil with my bread and this was not offered.I had the Ceasar salad and Glabella had a house.  Mine was over dressed in a orangish, creamy sauce.  No anchovies were really noted, but it was cheesy.  Glabella liked it, but I've had better.  The house was a standard house salad with a vinegarette.My entree was really quite good.  I had Veal Caprese, which came as 3 pounded, lighltly but crisply fried veal steaks, each with a tomato slice, basil and mozarella melted on top.  I had broccolini and an eggplant/olive sautee as a side.  Glabella was forced to skip her shrimp mainstay and went with a chicken and eggplant dish that I can't recall the name of.  It was very good, almost excellent.  Large, juicy breasts covered by a slice of pan fried eggplant in a tomato sauce.  It was remarkable because I don't usually enjoy eggplant.Both of our dishes were of large portions and we opted to take some of it home.  The waitress was nice enough to include some more bread in our take home bag.We were so full we couldn't even look at desserts.  Truly a travesty.This is the kind of place that really should do better and I can't figure out why it doesn't.  I think perhaps the pricing is a little steep for most of the simple country folk we have here in Jax.  haha.  Entrees were almost all $20-30 each.  Not exactly easy for the average person to fork over, including myself.  I think I'd go back...but there also are a bunch of other spots I'd like to try first."], ["Paul C.", "After trying several other Italian restaurants in all of NE Florida, and coming back a few times since my last rating I must go to four stars now.  In Italian I would say 'multa tutti bene ristorante' !"], ["Lisa L.", "Don't let this tiny storefront fool you - there's a lower level just past the bar with a decent sized dining room that could probably fit about thirty people or so.  Cozy, which is nice, but better when they turned up the lights and we could actually read our menu.The menu looks complicated, but it's not - the heading tells you what the meat is, and the multiple choices are how you want it prepared.  I got the fish, which had about a dozen options, all of which sound amazing.  I opted for the seafood mix and it was all I could have dreamed... there was so much seafood, they had to put the pasta is a separate bowl!Definitely not a place to come in a hurry, since there was about a forty-five to an hour wait for our food after we ordered, but if you do have the time, worth the wait.  Hot, pungent, delicious, and here I am trying to cut down my portion size.  A terrible place to go for sensible eating, but I'm coming back all the same."]], "Brio Tuscan Grill": [["Danielle R.", "Amazing food and service. I'm a cheapo and I can only eat small portions of food so I  have only been to happy hour at the bar, it works perfect for me. A few months ago it was $3.95 but now they have a new happy hour special menu that runs from $4-$6, still an amazing deal for the quality of food. The bartenders are always friendly and call you by your name. They are very attentive and conversational. The interior of the establishment is just beautiful and very classy. My favorite dish is the Pepper Shrimp over fried eggplant. The pepper cream sauce is amazing and a must try!!"], ["Joel T.", "Awesome service food was great, I had the wedge salad with the Gorgonzola cheese which was so flavorful as an appetizer. For my entree I had their lasagna, at first sight it looked intense with loads of cheese. But after my first bite I got an explosion of flavor which I enjoyed very much! Would definitely recommend this place the server was great too... Thanks Winter!"], ["Jorge C.", "Great place to eat and awesome service.  Lobster & Shrimp Ravioli was amazing!!! :)"], ["Lance D.", "I just can't believe how long it's been since I've had outstanding service from any restaurant in a long time. Not only was my waitress nice and friendly, but the entire staff were quite welcoming as well. The menu had plenty of items that I wanted to try, but I can only have one. I had the Pasta Pesto for my dinner, and it was so scrumptious. But what was really amazing was that the meals for my group came out within seven minutes after ordering. Those chefs must be extremely talented to cook all that food that fast, and to complete perfection as well. And I must say the restaurant itself is so gorgeous, especially with the amazing tall ceilings. I'm looking forward to returning to this restaurant."], ["Lindsey H.", "I have eaten here before which is why I have given it two stars instead of just one. The food is pretty good for a chain. It's nothing special, but the prices make it decent.Let me start by saying that Kaitlyn, the hostess whom answers the phone is extremely sweet and very good at her job! The \"group coordinator\" however, was so not worth the trouble of speaking with today. What a huge bust for a hire with this one. I hope she doesn't get paid a salary for her job. I have worked in MANY restaurants over the past 10 years, and still can't believe the tone I experienced within the first seconds of our phone call. After telling me how inconvenient it would be to host my party of 40, and how the servers would not be able to get around our group, we would make the entire restaurant heat up, we would be too loud, and how we would just all around be a massive inconvenience to the other guests who are trying to enjoy their meals, she tells me that if I drop it to 35 she would be happy to accommodate me.Well, who knew that five people made such a massive difference to the temperature and noise inside of a restaurant.What I don't understand is why a simple, \"we don't have the space to accommodate your group\" response is not what I received. Don't worry love, if our group drops to 35, you still couldn't pay me to give you our business. Your attitude and lack of class is most certainly NOT appreciated."], ["Joe L.", "I want to say that we went here expecting a good meal. What we got was a great meal. And the service was very good, highly recommended."], ["Erin D.", "I was hungry, and on a whim, I decided on Italian. I found this place through Yelp, and it looked decent. It was late, probably about 8PM, so I parked with ease and was seated right away with no problem.Service was prompt. I ordered the shrimp fra diavolo ($19.74 incl. tax), and it was delicious. Not too spicy, not too under-spiced. There was a large portion. I liked how the pasta was unlike any kind I've eaten. It wasn't your standard grocery store kind (like penne or angel hair) - definitely unique!The ambience was great with low lighting, candles, and a huge room. Free wifi was available as well. I would come back to this place to eat again!"], ["Danielle M.", "If any of you were in Jacksonville this Saturday just gone you will know that the weather was all kinds of awful and completely piddling down with rain, therefore Sunday came as a wonderful surprise as it was warm, dry and absolutely gorgeous with not a cloud in the blue, blue sky.The Hublet and I had a lot of chores and tasks to tackle, some delayed by Saturday's weather, so after an early start on Sunday we were rushing around like headless chickens trying to get stuff done.Then my belly decided to roar and let everyone know it needed lunch.The weather was so nice that we decided to try to find somewhere with outdoor seating, and as we were at the St. John's Town Centre we weighed up our options, narrowing it down to either the Brio Tuscan Grille or Ovinté (neither of which we've visited before).Brio won the competition purely because our car was on their side of the road and we saw their outdoor seating area.Entering the restaurant we were immediately hit by the absolutely amazing a/c which on such a hot day was a relief.The interior was a lot larger than the exterior would have had me believe, very well lit and open, with well-spaced booth seating and some private dining areas off from the main dining room.Although the terrace seating area was clearly very popular, we managed to get a small table that had recently been vacated.The outdoors seating is nicely spaced out as Brio thankfully haven't tried to cram in as many seats/tables as possible and you're not sitting elbow-to-elbow with your neighbour.  Our table didn't have an umbrella, however we were close enough to a larger table to benefit from their shade, which is how I managed to get my magnificent one-shoulder tan on Sunday with my body being half in/half out of the shade.The Hublet chose sparkling water with lemon and Pasta Pesto (described as angel hair pasta, grilled chicken, caramelised onions, tomatoes and roasted peppers). I ordered a Peach Palmer (Arnold Palmer with peach puree) and a Grilled Salmon Salad (described as mixed greens, Roma tomatoes, feta, asparagus, crispy shoestring potatoes and a balsamic vinaigrette).His Pasta Pesto was very tasty, with a generous amount of grilled chicken and the vegetables roasted just enough to bring out their sweetness, the caramelized onions not overdone and the pasta perfectly cooked.My Grilled Salmon Salad was lovely: the salmon was firm without being dry, the asparagus spears were blackened without the flavour being ruined but there was no sign of the promised feta cheese and the 'crispy' shoestring potatoes seemed stale and chewy and were pushed to the side.  My Peach Palmer was a little sweet but benefited from free refills and the accompanying lemon slices helped cut the sweetness.   Service was initially excellent: our food came out very quickly and arrived fresh and hot, our server was topping up our drinks before we had the chance to notice the levels were getting low and although our server did seem to go A.W.O.L while we waited for the check, the lunch rush had just started and therefore I completely understood them getting a little busy.This is a great spot for lunch: the outdoor seating area is lovely and the indoor area looks excellent, Brio doesn't have a chain restaurant feel to it and is a very elegant place to eat; however the food quality is very good without making the leap to excellent, and the prime location means you'll be paying a little more than usual."], ["Sofia L.", "Extra good. Always delicious and the service is on point. The terrace is perfect with this Spring weather."], ["Lisa S.", "Great atmosphere for a party or a date night. Food is awesome and the staff is amazing!"], ["David K.", "The salmon portion for lunch today was teeny for an $18.95 lunch entree.  Perhaps the size of a deck of cards.  If it had been Copper River or some other wild caught -- maybe worthwhile.  But the menu didn't indicate anything special about the salmon.  And the waitress seemed to be recovering from a Friday lunch rush, so we didn't even bother her to ask.Our last visit was right in the middle of noon rush.  We had a larger party, and things came out really slow and piecemeal.  Some members of the party were nearly done before others got their food. This place is usually a bit better than that for business lunches.  I've had a few better experiences than the last two.  Nice menu and very flavorful salads and entrees.  Some nice somewhat lite fare, and really something for anyone.  More chipper and attentive wait staff.  But there's some pretty stiff competition in the field of chain Italian restaurants and other lunch choices in the area.  These guys had better get on the ball so they don't become the let's-go-to-Brio-since-we-know-it-will-be-less-crowded restaurant."], ["Keith D.", "Tired of your typical Chinese takeout? Step it up and enjoy food the way it's suppose to taste. Brio Tuscan Grill is your place.  Great food, atmosphere and design located right in St John's Twon Center.  Starting with the Hostess - Chelsea, she is so wonderful and always has a smile on her face. The bartender - Jenette is friendly and can make any drink you desire. She can recommend the Espresso Martini that has my name on it. My top 3 waitresses to ask for (in no particular order)? Shannon, Taylor or Jessica. Each can provide their special care and service. The rest are close and cannot compare to my  top three.I would describe this place as an upscale version of the best and healthiest of foods."], ["CJ S.", "My first encounter with Brio was in Columbus, Ohio. To my delight they opened in Jacksonville. The restaurant is gorgeous, decorated more out of New York than Jacksonville, which is an A++++ for me. It is not blah nor is the food. The food is wonderfully delish. My favorite item is the crab and shrimp cakes with their veggies seasoned and cooked to perfection, Chicken salad, cheesecake, Pasta ala Vodka which are like pillows filled with ricotta and covered with vodka sauce, and their spinach dip. It is definitely better  than any chain or small place that I have ever patronized in Jax for Italian. Speaking as a New Yorker, this is great Italian short of going to New York to Little Italy for the real thing!Good food plus beauty is a recipe for love in my book!"], ["Itcher S.", "We came out here for our wedding anniversary dinner celebration. Overall experience with 3 kids was excellent. The food starting from the appetizers to the dessert was excellent. It was pricey but worth it."], ["Stephanie J.", "This is one of my favorite brunch locations! Yesterday we were without a reservation for Mother's Day as it was reservation only. We, however, were able to be quickly served at the bar and I was able to enjoy my favorite dish... the French toast with berry compote. The price is always reasonable and the frozen peach Bellini was EVERYTHING!"], ["Laura B.", "The beau and I made a same-day reservation and were seated immediately. The hostess was friendly and had a great entree recommendation (Chicken Milanese). Then we met our hostess who was consistent and friendly. We started with the calamari - best we've had in a long time and a dry Caesar salad (not recommended). I ordered the White Peach Sangria (looking for the recipe), he ordered a Blue Moon. Next, entrees. He ordered lamb chops. The sides were great, chops a little too fatty- we've never had them before so can't say if that's normal or not. I got the Chicken Milanase and it was fantastic. We also ran into another friend who got some delicious Fennel Sausage Pasta (yes, I snuck a bite).No dessert, but we did get another sangria to share."], ["Tanya B.", "Super great place! Amazing food! Carbanara is amazing! Chicken under the brick is always a favorite. More upscale place! Great service! Clean! Get email updates and ull get a free bruschetta! Enjoy!"], ["James R.", "Dinner was fantastic! Their calamari was amazing, salad was nothing spectacular, lasagna was out of this world. Kind of abnormal because it was made primarily with alfreado sauce but it makes sense when you realize this restaurant is all inspired by northern Italy. The chicken risotto was watery though and not thick and creamy like it was a year ago. Service was great! I will go again soon."], ["Janis Z.", "We dined there on our way to southern Florida and had a very good experience. The food was tasty but our waitress was one of the best we have ever had. I cannot remember her name but she is pregnant and was just so happy. She had the best personality and was very customer service oriented. She made our evening special."], ["Dan M.", "Ok so Brio is not \"that real shit\" you would want if you were new to Jacksonville and trying to get some culture, but Brio is nice Italian food kind of in the way that Epcot's Italy is a nice tourist destination. A solid 3.5.It's a chain restaurant within a sprawling cluster of chain restaurants, but if it's nice enough for the back patio, request that, get a Tito's martini with blue cheese olives and put your feet up because you've found a nice little oasis away from St. John's Town Center's bloated mass of consumerism. The waiters are all bored and going through the motions, but they are competent. Tip them out of pity if anything.And while some of the food is overpriced and way bad for you I'm sure, I usually order the Pasta Pesto - a tasty, filling little dish that clocks in under 550 calories and $14.Blackfinn is overrated anyway, and filled to the fedora brim with douchebags. Try here first."]], "Bella Vita Italian Restaurant": [], "Siena's Italian Cuisine": [], "Enza's Italian Restaurant": [["Yo S.", "After the long day and missing breakfast and lunch, I needed to eat now but when it comes to eating out, I don't feel like spending money on something I can cook way better with much less cost at nice clean house we live. I saw this place in yelp near where we were at the moment. Usually Italian in USA isn't my choice. I'm very spoiled with Italian food in japan which is very authentic and good. Anyway, as soon as we walked up to the door, we were greeted by a gentleman in Italian taste suit. The smell of restaurant was filled with good aroma. MmmI don't want to bore you with my long review so I'll keep it short.  Food was great, service was excellent. Ms. Linda was our server and she definitely add good element to our meals. She was very professional and friendly, attentive. Not just her but all the other people in restaurant were. Three people beside servers came to our table to greet, including Ms. Enza herself.  Experience there was really good one. We will be going back not just for the food but the whole experience :)"], ["Meagan H.", "Best Italian food I have had in Jacksonville. Clean, great service, the whole nine yards. Even have live music (pianist)! I order the Veal Saltimbocca every time and it's absolutely delicious. Unlimited garlic bread, and most meals are around $20, and come with a salad. I highly recommend this restaurant to anyone!"], ["Steve G.", "I am a HUGE fan of Enza's!!! This is one of my favorite restaurants in Jacksonville. The owner, Enza is a sweetheart and makes you feel so welcome. I feel like a guest in her home. Bobby the general manager is very hospitable. The food is phenominal! We have not had a bad meal here is our several visits.  My favorite is the half pound meatball for an appetizer. I love the pasta carbonara, the veal masala, and the lobster ravioli. Friday and Saturday nights are bonus nights as the live music acts they have playing on the bar side of the restaurant are incredible! Listening to them just makes me happy, and the food taste so much better."], ["Brian S.", "This place was pretty good--not great, but pretty good.My date and I ordered a bottle of wine and a caprese.  For our meals we ordered a chicken marsala for me with the parmesan for her.  Both were good--not great, but not bad, either.I think I need to give this place another chance before I pass judgment either way, but the meal that I had (again, while good) lacked passionate cooking.The desserts were the real star here.  If you want diabetes, this is the place to start and you'll enjoy the journey while you do!  :)The overall experience was good, because this place has the romantic dinner thing down to a science!"], ["Natalie G.", "My fiancé and I ate here on Tuesday night and we were not impressed. We both started with Caesar Salad and the lettuce was soggy. The croutons were clearly not homemade and we could barely taste the dressing. The \"garlic bread\" was bland and not worth even writing about. Their red sauce is overly sweet (sickening sweet) and did not taste homemade at all. I'm Italian and I know true, real Italian food. This was terrible. Not sure how this place has such high reviews? We will not be returning."], ["Laura H.", "Amazing!    Everything from the second we walked in the door was excellent.  It was very busy, but it didn't feel like it at all.  First of all.... I went straight from work.... in nurse scrubs! Totally dressed down.  We wouldn't have been treated any different if we had went in our Sunday best.  Total respect. Amazing staff.  The manager, Bobby, spent a lot of time talking to us about the history and such of the establishment.  The food was perfect.  Authentic Italian, very delicious and made to order.   Many items on the menu are things they will run out of.  I love fresh, made to order food.     I had the Chicken Piccata and it was the best I've ever had.   Perfect tender chicken and amazing flavor.  He had the Chicken Alla Enza.  We had read reviews on it being the best, and we completely agree.   He got it spicy.  He said it's his new favorite :)    We finished it off with the Tiramisu.  Not like any I've ever had.  Absolutely awesome.  Excellent service, amazing food, drinks and dessert for 2 for around $50..... seriously who does that!   Can't wait to go back with friends!"], ["Brad B.", "Best Italian restaurant in Jax, and it's not close! The food is fantastic, and the service is even better. It's got a mom & pop Italian feel and they go above and beyond to be sure everyone is happy. You have to try the ravioli appetizer, and the Alfredo sauce is the best I've ever had. You won't be disappointed!"], ["Jennifer S.", "My fiancee and I came here to celebrate our recent engagement, I've been looking for a great Italian restaurant and I found one. Everything was delicious, the food is seasoned well, great ambiance, friendly staff. Recommend for a nice night out, I suggest going to the Comedy Zone after to end the night!"], ["Chelsey S.", "I really, really wanted to love Enza's, but I'm not there yet.I'm not a big fan of the strip mall location, though popping over to Kirklands afterwards (with 15% off after showing my Enza's receipt) was nice. I wouldn't waste your time on the caesar salad, but the minestrone was delicious, as was the lasagna. And the tiramisu, yum!I will compliment the complimentary garlic bread, and the music scene on for a Saturday night date was great.  Enza's seems to bring in a little bit of an older generation. Overall I'm not sure if I would go back. If you do, make sure to make reservations!"], ["Greg F.", "The food was about average, the setting and service were a bit below average. The food was pleasant. My favorite dishes were ones others ordered, which I just sampled: the chicken marsala followed by the osso buco, a special. My next favorite was probably the Italian wedding soup, which incurred a $2 supplement fee. Those dishes were probably worth ordering again. The other dishes were pleasant but I wouldn't order them again. They were three shared appetizers, cheese ravioli, meat ravioli, and calamari; my entree linguini alla rosa; and creme brulee for dessert. I added a scallop to my linguine for $6 (at least it was a big scallop). The entrees include soup or salad. I'd say serving size is larger than average, e.g. the ravioli appetizers were more than most people would want to eat alone for an appetizer. The setting was decent but too noisy for me (79 db according to my smartphone). On this busy Saturday night there was live music, but it was too loud for me even when the music wasn't playing. We were in the west dining room/banquet room. The center dining room is where the bar and music is. The east dining room looked nice to me and was the quietest, at least when I visited it with the music playing. They seated our group of 7 (reserved for 8 but one didn't show) at two round tables, pushed together, which wasn't optimal. There were more children at this restaurant than most I visit: it seems a real family-oriented place. The performer sang happy birthday twice while we were there. The maitre d's bright blue suit and showy shoes made me smile. The service was decent but below average. When I got there I asked that the bottle of wine I brought be put on ice right away (corkage fee: $12). When it appeared on our table a while later (they wouldn't seat us until at least half our party was there) it wasn't on ice. A while later, after I asked about it, it was put in a wine chiller. Garlic bread was promised at the beginning of our meal but didn't appear until after our main courses, when someone may have asked for it to sop up their sauce. Our waiter was rude at one point after someone told him she thought we'd only ordered one creme brulee: he curtly corrected her, pointing out what desserts each person had ordered. They weren't able to split up dishes on different bills any way we wanted, as restaurants with the best equipment (e.g. Taverna) can. My water was never refilled. If I visited here again I'd try for a quieter time and place, and perhaps try one of the meat dishes my dining companions ordered that I liked (or the meatballs app, which an acquaintance says is her favorite dish at her favorite restauant)."], ["Gabie R.", "The service here is phenomenal--you feel like royalty the moment you reach for the door. I have never tipped the server on a take out order nor found Italian food worth dining out for until I met this place. I suspect I never will anywhere else."], ["Brittany W.", "I can't attest to the food, because the service was atrocious. My boyfriend and I had heard the food was good here and decided to try on a Saturday night. We called ahead to make sure it wasn't reservation only or call ahead seating, and the hostess told us to come on down - we would be seated immediately. We get there, and the hostess asks if we had a reservation; of course we said no. She then tells us to wait for her manager, who arrives and tells us they were completely full (there were empty tables in the restaurant!). He also said, \"Well I have a table but a reservation is booked for 6:00; I don't want to give these people 40 minutes to eat (it was around 5:15 when we arrived).\" He couldn't even talk directly TO us, more like AT us.Frustrated that we were told one thing on the phone, then basically turned away upon arrival. The hostess tried to tell us to take a high-top table in the bar area, but by then we already had a bad taste in our mouths about it, especially when the establishment is decorated like it's supposed to be high class."], ["Morgan L.", "This place is fantastic. I mean it. I crave their food sometimes, late at night, and wish that I lived closer. The food is fantastic every time I've been, I always have the chicken francese on angel hair noodles and it is spectacular. I love that it's a nice place but I don't feel like I have to dress up super nice (I've gone in jeans and a t-shirt to watch a football game and felt very comfortable). I love that the staff is so friendly. I just wish I could move it closer to my house."], ["Edith G.", "The service here was excellent. Everyone from the greet desk to the server were attentive and helpful. Everyone was happy with their order but a few things I wanted to point out:- the water tasted funny. probably best to go with bottled option (which I never do) here- the bruschetta goat cheese appetizer was not bruschetta. It was more like a mini pizza. Which they should just call goat cheese pizza appetizer. - I ordered the Enza Grouper thinking it would be the healthiest dish besides a salad. The fish comes covered in a sauce with a few pieces of spinach in it. Not on the side like the description. The grouper tasted good but it definitely was not as healthy as the description made it out to be. The description makes it seem like it's fish with lemon and capers and spinach on the side. If I had been paying for dinner I probably would have sent this back but since I was with coworkers I let it go. - the pistachio gelato was amazing. I'm not even a big fan of gelato usually. The cheesecake and tiramisu were just okay. The show steeler was the cannoli and gelato. For a restaurant that totes authenticity I would have liked to see some in house made desserts. If you're traveling in this area for work this place is a good option for a large group. The good is good and the service is top notch."], ["Heather D.", "Wonderful family owned and operated Italian restaurant. Pasta tasted like it was house made. Service was outstanding with friendly greetings from everyone. Nice bar area."], ["Waheed B.", "When I'm not enjoying my Southern culinary roots, I like to let my Italian cuisine side show and I'm a big supporter of pasta and sauce joints. My latest kick is to order/eat handmade pasta if I am not the one preparing the food, and unfortunately this place does not make their own--sad face.Whatever you get it will taste good and the servers are good and everything seems pretty good, so I can't rave about it being the most amazing place you will eat. I think it's great for larger groups because they have a banquet room, and the live music on Friday night is a nice touch. However, the restaurant had a strange layout as if it was separate portions in the shopping center that were put together. This place is so popular that parking can mean a walk in unseasonably cold FL weather. But this is an independent, non-chain establishment and it's a favorite of locals so I anticipate I will be back.Recommendations include any of the ravioli (lobster is good but pricey) and the pasta fagioli soup when you are tired of salads."], ["Phyllis G.", "The worst experience at a restaurant I have ever had. Made reservations for 3-28-15 for my daughter's 30th birthday.  We had a party of about 18. We arrived and were seated at around 6:45 pm and drink orders were taken and received as well as apps. The problem arose when we ordered entrees and did not receive them until 9:30. Two hours we waited for them. We ask twice about them and were told they were being plated. We ask at 8:00 and then again at 9:00. Once we received our food it was cold and over cooked. The owner of Enza's called me on Sunday and told me it was our fault that our food was so long getting to our table and for it being cold because we had wanted to sit together and we had some that were running behind due to work. I am disappointed in the way it was handled and will not be going back there again."], ["Mark R.", "The food is good, but far from great.  And the garlic bread is some sort of magical pan, as it looks and smells great, but has no flavor to speak of.Worst of all, it's totally overpriced.I feel sorry for everyone in Jax that thinks this is great Italian food.  It is one of the best in town (for the best, go to Piccasso's), but - sadly - that's not saying much."], ["Annie H.", "I love Enzas! We go at least once to twice a month! Food is always fantastic & the waitstaff is wonderful."], ["Cristina A.", "A very sorry excuse for Italian food. The red sauce taste like tin and whatever Mozzarella cheese they are using is the cheapest ever.  To add insult to injury we were served mussels that were old and tasted and smelled as if they had been in the trash for 2 days and the only concerned person was a bus boy who only tried to convince me that seafood should be served as an appetizer??? Im not sure why he would try and explain serving spoiled shellfish but not one person apologized for what could have been a bad case of food poisoning. A place only senior Caucasian Americans would find enjoyable as they were the only ones in attendance this Friday night We were the only Hispanics in there and they wanted to seat us in the worst table in the house because of reservations??? Lol. (There were plenty of booths available)I'm not sure who would reserve a table here but they were very pretentious for a place that has such extremely mediocre food and the only good thing thing about Enza's is literally the bread and oil.  And the olive oil garlic parsley dip I ordered only because I saw it on another table because the bread they were serve is literally a hero sandwich bread with a pre bought garlic spread and when I asked our waitress for some she has the audacity to tell us she didn't offer it because it was a dollar more.  Wow.... This restaurant only had good lighting a delightful entertainer and an interesting doorman, we should have stuck to Carrabbas."], ["Cathy O.", "I would highly recommend Enza's for good Italian food in Florida. The food was excellent.  The service was excellent. The waitress made good suggestions for dinner. The prices were reasonable. I would recommend making a reservation on Yelp for this restaurant, especially on the weekends."], ["Dave L.", "Had no idea Enza's would be that busy! certainly able to serve our group of 6! Very fresh everything,...amazing staff,..at first i thought over staffed but once I saw the crowd and the attentive service I knew why!   veryone loved their choices, no two alike at our table!!! Drinks are strong and food is tasty!!! Great little stop, you wouldnt expect! Bathroom poster of Godfather Movie with a handwritten note \"check behind toilet\" AWESOME,...favorite movie! great food, good drinks, priced right,..who could ask for more!"], ["Leslie D.", "Just tried out Enza's because we were both craving some good Italian food. Enza's did not disappoint! We started with their homemade mozzarella balls that were fried and served with a marinara sauce. We both had Enza's salad that had plenty of feta cheese, but not overpowering. I had the chicken alla rosa and the guy had the veal saltimboca. Both the chicken and veal were so tender and the sauces that accompanied them were delicious. We decided to get both the tiramisu and the spumoni. They were the perfect end to a perfect meal. We will be going back!"], ["William K.", "This is quite simply the best Italian restaurant in the Jax area, in my humble opinion.  So many times you visit this type of place, and everything is in order, except - they cannot do red sauce.  No red sauce, no Italian restaurant.  It's that simple.Enza's red sauce is divine.  We order the sauce out occasionally and use it for dinner parties at the house - and are happy to admit to guests that it is Enza's recipe.  It's that good.  And when the red sauce is that good, and when the owner has the heart for customers as does Enza, and when you've got people in the kitchen who SERIOUSLY know what they are doing, then 1 plus 1 plus 1 equals a wonderful dining experience.The star attraction is the fresh fish board, which they will make anyway you like, with any of their toppings, sauces, and sides.  The Grouper Aglio Olio will change your life.  The Enza's Salad is, well, just perfect.Top notch in every respect.  They just acquired the space next door and increased their staff, which helps with the wait on busy weekend nights.  Lovely live piano music on weekends.  Great for parties of 6 to 20, too.As good as it gets for Italian in Jacksonville!!!"], ["Rita M.", "This place is fantastic!  We have been going here for a long time and everything is amazing. My favorite dish is the Veal Parm. So tender and a HUGE portion, you will want to take the rest home.  Monja!"], ["Ryan H.", "I had high hopes for this place and it was only sub-par for me. Called in to ask the hostess if we could get reservations she said we weren't allowed to make reservations, even though we had a party of 4. I went online to open table and was able to make reservations. FYI you better make reservations they are always booked an hour out from fr-sun. Received our menus which were all loose and out of place. The paper and paper protecting the covers for the menus had all fallen out of the leather bound books they reside in. Granted it was an easy fix, but come on ... for the price per plate this place charges they should have better menus! The menus are incredibly heavy and feel like a thick novel. The chairs are incredibly uncomfortable (low backs and hard wood seats), and the tables made me feel as if I was 5 years old again. They have paper sheets covering the tables as if they have no confidence in their patrons to control their food. I ordered the Chicken Parmesan, which was somewhere near 20 bucks I think maybe 16-17 was what the menu said. It certainly didn't taste like a 17 dollar dish to me. The worst part was our waiter. He didn't seem to pay much attention to our table. Took him forever to get us our check and refill our drinks when needed. We waited about an hour for our food and in my opinion wasn't that impressed for an hour worth of wait and a 120 dollar bill for 4 people."], ["Lynn E.", "I'm Italian and I'm from New York.  So, if I'm giving a 5-star rating to an Italian restaurant, you know this is the place to be!  We had heard great things about Enza's and have been meaning to try it out for months.  We finally got around to it a couple of weeks ago and are still kicking ourselves for waiting so long!Enza and her husband are from Italy and have been in the restaurant business their entire lives.  They are hands-on both in the kitchen and in the dining room, greeting customers and making sure their dining experience is as good as it can possibly be.  Their daughters cheerfully work as servers and make recommendations on the wine and food.  One review we read warned that it can sometimes be difficult to get seated quickly without a reservation and we now see why!  There is nothing on the menu that is not absolutely outstanding.  You seriously cannot go wrong here!  We ordered 2 appetizers, the carpaccio and the fried ravioli.  Both were superb.  In fact, my husband has often been frustrated with how carpaccio is served in other restaurants, but was super excited about how Enza's got it so right.  The ravioli portion was huge for an appetizer, so I was lucky enough to bring half of it home for the next day's lunch!  For the entree, I ordered a grouper almondine special served over sauteed spinach and asked for a side of fettucini alfredo.  The flavors perfectly complimented each other, the fish was absolutely perfectly cooked, and the alfredo sauce was, quite literally, the best I have ever tasted.  My husband ordered the rigatoni bolognese, where he was given a choice between the two bolognese sauces on the menu.  There's the \"ordinary\" sauce, and then there's the special sauce made with beef, veal, and lamb and simmered for 5 hours: the house special.  His report was that it was exceptional in meatiness and complex flavor.We will probably make Enza's a monthly tradition and hope to try everything on the menu!  Since so many of us transplanted Yankees complain that the South doesn't seem to get Italian right, I'm going to call this a \"must-do\" restaurant.They're closed Mondays and don't open until 4:00 p.m. other days.  Reservations can be made by leaving a voice mail or on their website."], ["Ted A.", "The bar has been set. Make sure if available you get Phil, he is terrific.  I thought he was the owner - this guy really cares, everyone there really cares. Phil is from Boston and he is ready to give advice on food or drinks and he finds out what you want and then he gets you in the zone.  Your not ordering from the menu, you're meal is being tailored to your interests, that's the Enza difference. Then comes the food, the stuffed peppers were incredible.  Enza was back there working the meal and we showed up 3 minutes before closing, and Enza herself took care of cooking our meal.    Enza your amazing. Grouper Parmesan was fantastic and the fish was cooked perfect.  You see with all my traveling a kitchen is at its weakest just before closing or just after opening, when the staffs guard is down, however here we were at closing and these guys nailed it!  We were there on a Tuesday night and they had a 1/2 off wine deal.  We weren't in the mood for drinking, but we got one anyway - it was like 15$ - who could resist a little splash."], ["Jeff P.", "The chicken parm and the Spaghetti and meatballs are really good. our friend got the lasagna and was not happy with it."], ["Andrew K.", "Food, service, and atmosphere were all on point. Calamari, tortellini carbonara, chicken parmesan, tiramisu, and ice cream. Perfect for a date night!"], ["Crystal W.", "Enza's is our ONLY place for Italian food! If you've ever been there, you'll know why!We have been dining here for a few years now, and I cannot express how fantastic this place is! My husband and I have tried at least half the items on their menu and I must say that everything I've ever tried is top-notch, authentic Italian food. My favorite is the chicken alla rosa and my husband is a huge fan of their chicken parmesan and veal chop.This place has an excellent staff and Enza herself knows how to keep her customers happy. She is extremely personable and always makes her way around the dining room to greet her guests and make sure everything is satisfactory with their experience.Although their entire staff is fantastic, my husband and I always ask for the same server, Amanda. She is professional, courteous and ALWAYS delivers great service!!If you've never tried this place, I HIGHLY recommend that you do...you won't be disappointed!!!"], ["Ed J.", "Great food and service.  Brittany waited on us and was great.  Visited on a Friday night had reservations arrived early and was seated immediately. I had the chic parm, wife had the veal parm both great dishes with enough to take some home.  The only negative was my wife's Ceasar salad was warm not cold.This was our first visit, but will not be our last!"], ["R L.", "Worst Italian restaurant I have ever been to.  For the prices that you pay and the no tastes in their food, its very sad.  You can still do healthy dishes and have them taste amazing.  I've had italian food in NYC, BOSTON, SF, MIAMI, LA and others in JAX, what a let down.  Also looked like place was understaffed despite being very busy.  I would not go back to this place."], ["Deb S.", "Don't let the strip retail shopping center location fool you.  Charming on the inside, great feel, live piano music in the background, very good food and service.  We had a large group (16-18) and the server didn't miss a beat.  We were well taken care of and I believe everyone was satisfied with their meal.  The Chicken Stefanie was wonderful! Highly recommend."], ["Jason C.", "Great place to eat! Some of the best italian food that I have eaten in Florida. I have been going here for years and it just gets better and better. I had the Veal Parmesan and it was fantastic. My wife had the fetticuine alfredo and it was great as well. The garlic bread is wonderful along with their new garlic/olive oil dipping sauce. Their sauce is great as well. I can't say enough good things about this place."], ["Trish D.", "So we had to come up with a place to have my 76-year-old mother's birthday party and she loves Italian.  Not wanting to do this at Olive Garden (her usual favorite place), we started searching on yelp for a little more upscale restaurant.  Enza's came through with flying colors last night - Stephanie's awesome!!They had the table for 12 all set up when we got there, allowed us to have 3 separate checks, served the cake and sang to my mother.So the service is flawless!The food was absolutely out of this world!  We started with the fried calamari (best I've ever had), fried ravioli (yum), the special stuffed red pepper (double yum) and the antipasti.  All delicious with no complaints.The bread came out warm and perfect.All of our entrees were done excellently without exception - the Chicken Parmesan, Chicken Stephanie, Penne Ryan, Veal Marsala, Baked Manicotti, Spaghetti Carbonara, Grouper, Veal Parmesan, etc. All wonderful!The house wines were very good - we tried the pinot grigio and pinot noir along with the New Zealand savignon blanc.  All very good and the pinot grigio was so good we ordered a carafe.My sisters, brother and I cannot thank the staff, especially Stephanie, enough for your attention, service, and hospitality and it made our mother's birthday perfect!  OUSTANDING!!"], ["Walt B.", "Authentic, homemade Sicilian style food. Absolutely delicious. Ensa personally checks in on you. Very accommodating. My absolute favorite in Jacksonville."], ["rebeca a.", "Reservations  or having your name on the preferred list, does NOT help at this restaurant. I went there last night and when I arrived, I was told I need to  wait about 20 min. About 40 min., later I went to talk to the hostess. Right when I was about to get to the front of the line, another woman cut me off and told the hostess that she was going to the bar and to please push her name to the top of the list.  The hostess said: \"no problem\". The person was also on the preferred list, but listed much below me as she arrived 20 min after I did. So, they do not respect the waiting list. They manage it for whomever they want to. Then why have a list???  When  I asked the hostess how much longer it was going to be, she said it could be between 20-50 more min. Mind you, that I had already waited 40 min and I was originally told it was going to be only 20 min. They give preferrential treatment to people, do not respect the order in which the guests arrive and cannot manage the timing of their tables. So not guest  worth the wait. Respect other people's time and do not be so corrupt with the guest list! Never going back."], ["Eric C.", "Every time we have gone to Enza's the food has never dissapointed us. The owners are super friendly and last time gave us a complementary dessert. This is excellent authentic italian food."], ["Paul C.", "Both dinners ordered were good, although mine (Veal Milanese was too salty).  Bar is just OK, nice live piano player, comfortable seating,plenty of parking, very clean too (same strip mall as Whole foods). Prices are reasonable.  My biggest complaint was we it was obvious  were being rushed out by waitress to leave for another seating."]], "Nero's Cafe Italian Cuisine": [["Kaley B.", "Have picked up pizza several times - always good. Ate in - loved the stuffed mushrooms and the service has always been good. Definitely a good family traditional Italian Restaurant."], ["K L.", "Bummed man! I love this place been here many many times but I haven't been here in a while so when my fiance suggested coming here I was in! Well to bad it wasn't the neros I remembered food was bland and my fiances salad lettuce was bad! The only good thing was our server she was on point! To bad the food sucked!"], ["Maya C.", "This place has been in Arlington for as long as I can remember but I've only been able to experience it as an adult. If you want good \"mom and pop\" Italian restaurant with no frills, this is the place. The food is excellent. The main dish I always get is the Shrimp Ravioli because I love both. I highly recommend the Pasta Combination for those who want to sample all their main pasta dishes. You can easily make two meals out of it."], ["Amanda C.", "Nero's is an Arlington staple. I've lived here my whole life and have many fond memories here. Tues & Thurs the 2 for 1 large pizza is a steal of a deal. These pies are extra largo and extra delicious. You definitely want to call in your order ahead of time and be prepared to wait 45 min to an hour, because this deal is so popular and everyone in Arlington has been cashing in on it for years. It's been several years since I had anything else but pizza here, but if memory serves, the other food was yummy too!"], ["Bill K.", "An old Arlington favorite Italian restaurant with large portions of good food. I hadn't been here in about 10 years or  because we had just moved so far away. But on a whim tonight I decided to give them a try and it's like nothing had changed from the last time I was there. I ordered the Shrimp & Scallops Rosata and it was very good. The service was prompt and quite helpful."], ["Nicolas D.", "Love the pizza.  Great customer service.  Very good lasagna.  One of my favorite places.  They will not disappoint you."], ["Carol Z.", "Nero's has been around since the mid to late 1980's, but this was my first visit. If you were there in the 1980's, it may not have changed much in terms of menu or interior, however, the food is EXCELLENT!Two of us had the crab cake salad, one had a hoagie, and another had the Greek salad with meatballs on the side.FRESH, FRESH, FRESH was the food! The french fries that came with the hoagie were NOT frozen, somewhat of a surprise these days.  The crab cake salads came with three shrimp, and were full of garden fresh veggies, a very nice alternative to hot house tomatoes, and other \"forced\" veggies to grow out of season.I recommend you give  it a try next time you are in the area."], ["Ruby A.", "Cute, family owned restaurant.  The interior is outdated, but the food makes up for it. They have one of the best antipasto salads I've ever had! :)"], ["Erin C.", "First, I am absolutely blown away with the negative reviews. We have been going for years & never have we had bad food or service. The bogo pizza is wonderful and is always served hot & quickly, the stuffed mushroom appetizer is WONDERFUL! I have also had the spaghetti, lasagna, carbonara, chicken alfredo, eggplant parmesan and all of it was fantastic.  And we like the rustic atmosphere, especially when it is just my hubs & I on date night, it is quiet & laid back. Prices cannot be beat."], ["Lovie T.", "First off, I really cannot fathom how anyone would give this place 5 stars. I will admit my standards can be high, but there is no way this is \"as good as it gets.\" Not even in Jacksonville ... not even in Arlington! If Gordon Ramsey came here, he would LOSE HIS MIND!! The decor is beyond tragic, which can sometimes be charming if the food is really good. But, it's not. The salad was a typical terrible iceberg lettuce plate with a slice of cucumber, tomato and onion. The dressing on the side came in a little plastic cup. It was $5 all you can eat spaghetti on Wednesday, so my husband got that. It was pretty bad, but at $5 you can't be too upset. I went with the $15  chicken mushroom alfredo.  $15 for the \"pasta\" dish I was served is insane. Bland, overcooked pasta; weak bland sauce; sad frozen chicken pieces. I can't overstate how pathetic it was. Really. I ordered a Moretti to make things better. Beer was fine - it's a bottle of beer, hard to mess up. When I ordered a second, they were out. There were probably 10 people in the restaurant - how did they run out of this beer?! (PS. The wine selection was so sad.)The iced tea tasted like they don't clean the brewer properly.I won't give them 1 star because I haven't gotten sick from it yet. Really though, I'd eat a frozen spaghetti before I'd go back here because at least the frozen food would be cheap."], ["Jay D.", "Good food, if it is served hot, but usually not due to the extremely poor service. Do you enjoy seeing everyone that came in after you get served first? Do you like very poor service? When you complain about waiting forever for the food to arrive, do you enjoy the waiter to arguing with you? Do you like cold food that should be hot? If so, this is your place."], ["Nina I.", "Great bogo deal on large pizzas. 15 bucks for 2 large pies, can't beat that!  Regular menus items are nothing to write home about, taste is plain and is frozen dinner like.  Great place to order pizza for take out but I do not recommend it for a 'nice dinner out'."], ["Kali S.", "Just so everyone can know, Nina is an employee of this restaurant so no surprise there that she wrote a positive review.   I spent $30 on 2 strombolis with 3 toppings: 2 meats and mushrooms. Both strombolis were filled with CANNED mushrooms. Not ordinary grocery store canned mushrooms either, these were extremely tough (rubbery) and completely inedible. We ordered both strombolis to go to feed our entire family who were over for the evening and everyone ended up picking them off and being left with mostly just pizza dough and maybe 1/8 cup of meat in all for both.   I called the manager on duty, and she informed me that the only thing that could be done was that both strombolis could be remade IF we brought back both whole strombolis. I told her repeatedly that everyone (including the children) were already eating it. I finally told her on the phone that I would bring back the all the picked off mushrooms. She agreed to remake them.  When I got to the restaurant she told me she could not give me the ALREADY COOKED strombolis. She told me they always used canned mushrooms and customers have to request fresh ingredients. She proceeded to call the owner, Lenny, and he said he would only refund the $4 for the mushrooms.  Don't choose Nero's if you expect a fresh, enjoyable meal or decent customer service or you will surely leave as frustrated and upset as I am. Italian restaurants are abundant in Jacksonville- take my word for it and choose another one."], ["Karen H.", "Had another wonderful, delicious meal last night at Nero's.  It was Wednesday night, and their special is AYCE Spaghetti, and almost everyone in the restaurant was getting bowl after bowl.  Mom and I decided we would have dessert, so we did not get another bowl, but I did eat every noodle.  Another good tasting basket of garlic bread.  Glad we have started returning to Nero's.  Much better than Olive Garden.  If only they were near the airport and not JU we'd enjoy this restaurant more often."], ["Hilary L.", "Nero's is an Arlington staple... back in the days when Arlington was an up and coming neighborhood with its own independent movie theater [RIP Gazebo], an intellectual community surrounding Jacksonville University, and tons of riverfront property, Nero's was one of the most loved neighborhood restaurants. I have so many memories of coming here after swim meets with the swim team, riding up on my bike [before that was \"dangerous\"] with my friends for the salad bar [it was so good that even kids wanted it], and playing the arcade games in the bar with my sisters. This is such a great place, and I am happy to say that, even with the slow demise of the Arlington neighborhood, this place has stayed a delicious, family friendly restaurant. They were just ranked as having the #4 Best Pizza in Jacksonville by the Florida Times Union, and I am not surprised! Their pizza is delicious. Mmmm. New York style with large slices, thin and chewy crust, and salty tomato sauce [not too salty]. I haven't had their salad bar recently, but I used to LOVE it. I still kind of get a little mouth watery just thinking about it. And my love for stuffed shells also developed here. Also, the prices are really inexpensive considering the decor. It looks much more expensive on the inside than it is.Great Italian, great pizza, great place."], ["Sandra D.", "Great food, very reasonable prices, friendly folks. I have friends from Atlanta who come to visit and ALWAYS ask me to take them to Nero's every time they are in town. Fantastic food...the\"but\" is the atmosphere - the lighting is harsh and uninviting. I have given this feedback several times and they continue to install bare and extremely bright bulbs. I just get takeouts instead - which is a shame because my Atlanta friends would really like to eat at the location, but won't because of the lighting. Too bad."]], "Shiraz Pizza & Italian Grille": [["Clay P.", "Great - garlic knots 5/5 Perfect size with just enough oil and garlic top soft chewy and with the marinara i could eat them like  popcorn.Stromboli excellent.meaty but with plenty cheese too. No hollow or just dough ends either and sauce has nice spicy kick I like.Pizza wss OK toppings were good and plentiful  but was bit disappointed crust wasn't more like knots or Stromboli - crisp bottom but kind of leathery texture. Service prompt and friendly and the take out order feature on yelp page is easy mistake free."], ["Cate D.", "I am pickier than most as I've still spent the majority of my life as a New Yorker, but I really liked this pizza. Better than Renna's, and DEFINITELY much better than Al's (Al's is only good for their $1 slices between 2-5P)  We had the NY thin style pizza with pepperoni, on which the crust struck just the right balance of tender and crispy, with delicious sauce and cheese. We also had the baked manicotti and it was really good as well- tubular pasta was perfectly al dente with the right ratio of pasta, sauce and cheese. The prices are very reasonable and the staff was very friendly. Can't wait to go back to try the desserts and more entrees."], ["Thomas H.", "This honestly used to be my favorite place. Even when food was late or order was wrong. The disrespect and calling us cheap and telling us to go to little ceasers ended that"], ["Ronald C.", "Family owned and operated Italian restaurant. Five star on their pizza.  The best pizza I've ever had I have a lot of pizza throughout the world."], ["Janel B.", "Ok yall know how I am about my pizza come look at me thought I'd stop by Shiraz I like to see my Pizza joint up close before I order online. Owner was great he took the time to explain how they make their pizza and even gave me wings to try when I ask to see if we're good if the pizza is anywhere as good as the service I am going to be a happy camper"], ["April L.", "Shiraz Pizza is our absolute favorite pizza,  EVER.   My 5 year old longed for it during our entire vacation!   I can't get enough of the Margherita Pizza.   Sky's crust is To. Die. For.   The wings are beyond delicious (we get them mild),  and I have also heard raves about the Meatball and the Chicken Parmesan Subs.  I believe Sky even bakes his own bread!  I am telling you,  you won't be sorry.  Shiraz is TOPS in our book!"], ["Nick M.", "Wow, stopped after some good reviews. Enjoyed new York style pizza, fantastic! My wife is a lasagna snob, who is, more often than not disappointed with restaurant lasgna thoroughly enjoyed the lasagna here.  Finally, garlic knots were awesome!"], ["Nina S.", "Very nice place to have your dinner. The pizza is very delicious and the environment is so comforting. I'm so happy to find here."], ["Troy B.", "Staying in Jax for the weekend and craving Italian. This place reminded of a favorite spot in Gainesville. Locally owned and authentic, so we gave it a shot. Had a pizza and chicken parm. Both were very good. Staff was friendly."], ["Deb C.", "We went there last year when we were in Jax for The Players Championship. We found it again and thoroughly enjoyed. Real Italian food like NJ and NY. Owner cooks everything. Chicken Parm, eggplant Parm, Pizza and salad were AWESOME!! Good wine too. Prices so low you won't believe it. Definitely try this place!!"], ["Melissa B.", "We ordered the garlic knots and a medium grilled chicken pizza.  The garlic knots were ok on flavor but lacked in quantity.  The pizza had crunch to the crust and tasted fine, but nothing that stands out from any other private owned pizza place."], ["Elyse G.", "I love this restaurant! I have had their pizza and baked dishes - both amazing! This has quickly become one of my new favorite places to eat!"], ["Rachel P.", "Excellent food and a wonderful staff. I tried the veggie pizza the crust was perfectly crispy and it was loaded with toppings. I recently moved to the area and will be frequenting it much more."], ["Richard W.", "Awsome Pizza, friendly Staff!!  Perfect neighborhood pizza place... BTW, You must try the garlic Knots!!  Yummy!!!"], ["Celeste G.", "Food was great! Homemade taste. I had the lasagna and garlic knots. Super fast delivery"], ["Melanie J.", "Delivery should never take two hours when quoting customers 45 minutes!! They didn't offer to rectify the situation. Horrible customer service!!! Safe to say my family will never order from Shiraz again!!!"], ["Sam B.", "I ordered a Garden salad & Sicilian deluxe pizza for delivery thru yelp. I choose the garden salad because of the extra veggies, unfortunately they didn't put green peppers, olives or mushrooms on the salad. The pizza ingredients were very fresh but the crust was a bit burnt and the pizza wasn't hot. I think I'll try to call my order in next time."], ["Patrick C.", "Still my favorite pizza restaurant on Southside. It's a shame we moved 20 minutes away as now we rarely get to enjoy this delicious pizza. I would love to send the owner a million people because it doesn't get any better. A must eat pizza place!"], ["Gregg K.", "Really good pizza, just the way I like it. Tons Of Cheese!!! There Garlic Knots are amazing. And the owner and staff are super friendly. Just moved to this side of town and very happy I found my local pizzeria."], ["Betsy M.", "Excellent! We had Sicilian and it was fresh & tasty! Great service, very friendly atmosphere!"]], "Carrabba's": [["Jenni A.", "Tonight's visit was an unexpected detour from the beach due to a thunderstorm. We selected Carrabba's for the convent location & ambience (avoiding the bright, loud weekend party crowd) and it proved to be a good choice. Long wait before our server came to take our drink order but delivered it quickly & with bread. Our salad & soup came soon after we finished all the bread (which our server refilled). I had the house salad which was ok. My husband & son each had the delicious sausage lentil soup (our favorite soup here!). Our youngest ordered the Kids Quatro Ravioli & our son ordered the Bake Ravioli Parmesan which are about the same dish except you pay&get more with the non-kid version. My husband had the Carrabba Italian Classics but was not thrilled by the lasagna it came with. I however enjoyed the Fettuccine Weeze & would order again. Overall a good dinner with lot of food for a family of 4 for a little below 70$."], ["Rogelio M.", "The pasta carraba is the best since it has peas and mushrooms.  Food always taste fresh."], ["Rebecca N.", "They are good, but very expensive! Good for specials occasions. The service, food and drinks are \"A-Plus\" in my book!"], ["Chris P.", "Carrabba's has lovely atmosphere and for a national chain decent food standards. Typically I go with the Lobster Ravioli and a flat bread.  The Onion / Bacon Flatbread is good combination of sweet and salty flavor profiles. I like to sit at the high top near the kitchen prep area.  Overall, very delicious food."], ["Deb S.", "My mother had never been to Carrabba's and it was her choice for her birthday celebration.  My initial call to ask about reservations was handled professionally and was advised because of the size of the party to call ahead because reservations couldn't be made...no problem did so and we were seated with little to no wait. The host/hostess were great but then it went downhill from there.  Our servers  were preoccupied, obvious they were rushing to get our order, one in particular (male) seemed annoyed with having to answer questions about the selections, appetizers appeared quickly, but the bread and the meals took forever to arrive.  The one server who was borderline rude eventually bailed leaving a party of 12 to one server...she did the best she could but she couldn't keep up. The food was well, chain food.  Nothing stood out as outstanding. Shame considering it was  my mother's 71st birthday and she had been looking forward to dining there for weeks prior to her birthday.  My thought was we could have gotten the same level of service at the Olive Garden down the street for a lot less money. Sorry guys...won't be back."], ["Kevin C.", "Food was great, service started off great but she got lost when it came time for us to leave.  We had to wait for our check which I didn't appreciate."], ["Stephanie D.", "Just discovered this chain and fell in love with it. We don't have any franchise in Canada but certainly wish they would expand the brand there! I love my italian food and this is great quality food, made from scratch daily and at fine prices. I strongly recommend!"], ["Alen L.", "I've been to Carrabba's quite a few times and have loved the experience every time. The ambiance and decor is one of the best I have ever experienced, which is impressive for a fairly casual chain restaurant. The wait staff is always friendly, knowledgeable, and efficient. You could make a meal out of their bread and olive oil alone - it is absolutely outstanding. The menu has a large selection of seafood, steak, pizza and pasta. I'd personally recommend the Spiedino di Mare, a delicious shrimp and scallops dish. A very good choice for a causal night out. Expect to spend $20-30 per person."], ["Aimee F.", "Our dinner was delicious. The calamari was hot and tasted very fresh. The blackberry sangria was smooth, fruity but not too sweet. I had the tomato pasta, just ok. The chicken Bryan was out of this world. Our server was very good."]], "Tommy's Brick Oven Pizza": []}