{"Cafe Kabob": [["R G.", "The food was pretty good, and the service was very attentive. They had a group at another table and since it was going to be a little while before we got our food they gave us a free appetizer."], ["Donna P.", "Our family LOVES Cafe Kabob.  The food is spectacular and the staff is so friendly.  All they need is a \"frequent diner\" program because we can't stay away!  Highly recommended to anyone who wants to experience international cuisine in a fun atmosphere.Love it!!!"], ["Kristy W.", "The food is fantastic!  Very fresh and authentic.  We highly recommend this place for Persian food."], ["Ali S.", "Great restaurant! parivash is a great host! This is a must come place, I will definitely come here again. The \"Aj\" dish tastes so goooood."], ["Jila M.", "Great food. The rice was absolutely mouthwatering. We had the combination with the chicken and beef kabobs and enjoyed it all. The salad was fresh and the service friendly and prompt. We will be going back!"], ["Bob B.", "Absolutely amazing!  Ate more than needed to and wanted more.  The basil hummus was the best hummus we have ever had.  The beef, lamb and chicken kabobs were perfect.  Succulent, tender, juicy and loaded with flavor.  I would order the eggplant stew every time.  We had the chocolate mousse and baklava.  Both good beyond description.  We will be back again and again and again."], ["Staci C.", "Best hummus I've ever had! Food is so yummy and fast. I'm currently pregnant and crave this place...owner is lovely. When I told him how much I loved the hummus he asked me to try a new one he had developed...fresh basil and a few other spices...amazing."], ["Sarah G.", "Best kabobs in town. Very reasonable prices and everything is fresh and delicious. I ate there twice and both times it was great."], ["Ava A.", "I stopped by here with lots of family on our way back to MD from south FL. I was searching for kabob/iranian places around Jacksonville when I stumbled upon this place. A group of 10 of us came here, ordered everything from kabobs, chicken kabobs, yogurt, salad, stews (ghorme sabzi & gheymeh) and even doogh and tea with baklava. Everyone was very happy and satisfied with all the food. Out of all the kabob places I have eaten in DC/MD and LA, cafe kabob was definitely amongst the top. We didn't think it was possible to get good kabob in FL. If you're in the area, I would strongly recommend this place. The staff is also very polite and friendly."], ["Tamim S.", "Went to this restaurant about three months ago looking for a good persian/Mediterranean restaurant, which I must add is hard to find in jacksonville. Spoke with the owner while my meal was being prepared. Very friendly and conversational guy. He assured me I would be satisfied with the meal, and I agreed politely thinking all owners say that. I got the kobideh(ground beef ) and chenjeh (tenderloin) with rice and grilled tomatoes. I have to admit I was pleasantly surprised at how good the kabobs were. I have tried many persian restaurants while living in Los Angeles,  and thid one reminds me of persian restaurants from my hometown. I eat at this place at least once or twice a week. Do yourself a favor and try it for yourself. You can thank me later."], ["Joseph C.", "The service was phenomenal!  I think it was the owner who even played and engaged with our children.   The food was fantastic and you couldn't beat the price.   I wish we lived closer."], ["Brooks S.", "Great food at a very reasonable price. Staff was very friendly and accommodating, they brought us free appetizers for being backed up in the kitchen (only about 10 minutes from ordering). The \"AJ platter\" had enough food to stuff two grown men and it came with all the accoutrements you would expect with a great Persian meal. The interior was very funky, so don't expect a classy experience, but the father-son waiting duo had enough charm to make up for it."], ["Karissa D.", "They take immense pride in their food as they should.  They take great detail to tell you about the ingredients and traditional way of eating it.  The food was wonderful and in generous portions.  Tried the kabob sampler (I think it's called the AJ).  It serves two.  The baklava was the best I've had.  Try a cup of tea with it.  The waitress was wonderful!"], ["Loqman S.", "good food"]], "Athens Cafe": [["Samantha K.", "Easily the best Greek food I've had since moving down to Jacksonville from NY, with excellent service and good prices as well. The chicken lemon soup was really good, the tzatziki was unique but totally on point, there was chewy, delicious bread with an herb oil that came with the meal, and my dolmades were very fresh and tasty. Service can't be beat--my waitress was so friendly and efficient and simply improved my experience. Living on the west side means I won't be close by to Athens cafe often, but when in the area again for work I will definitely be back for lunch."], ["Lindsay M.", "I loooove this restaurant. One of my favorite things are the combination platters with various appetizers (spanakopita, tirikopita, calamari) and the grilled octopus is to die for. You can't go wrong here and the staff are amazing :)"], ["Scott T.", "We went on a rainy Tuesday night early; there were 2 groups (private) in the restaurant by 6PM.  No one other than myself and wife were in main dining room.  The server was very friendly and was from Greece.  The owner was playing cashier.  She told me they have been there for 20 years and there are numerous awards for charity that they have done.The food was very good and I really enjoyed the braised lamb shanks.  My wife got a dish with artichokes and some other vegetables.  I tasted teh artichokes and thought they were probably canned as the had that slightly salty taste that led me to believe they were not fresh or fresh frozen, but the meal tasted fine.I thought the prices were a bit high and the waitress said that lunch is much less expensive, but I don't know how the menu changes.I would go back -- they served fresh hot bread with an olive oil/ Greek spices which was fine."], ["Shoe S.", "Very good food, amazing Lentil soup, hospitable owners and attractive wait staff! Quaint and great music! ;)"], ["Tiffany I.", "Every meal, every visit, is on point. Wait staff is kind, Mama is inviting, and the restaurant is kept clean. I recommend the appetizer sampler and the lemon chicken soup. The spaghetti and meatballs are really good, the chicken souvlaki are yummy, and even the bread basket is special. Definitely recommend!"], ["Andrew R.", "Service could not be better. Very nice.Soup was really really really really tasty. Definitely worth a lunch."], ["Julia H.", "Stopped by this afternoon after picking up a friend from the airport to visit the owner (Georgia), and, as usual, she welcomed us in with open arms, despite the fact that I hadn't seen her in years. Unfortunately the kitchen had just closed from lunch, but we were able to order some drinks and baklava. It's been a number of years since I've had it, but it's hands-down the best I've ever had. My girlfriend ordered Greek coffee, coffee addict that she is, and she's now determined to find some where we live because she liked it so much! You can't beat Georgia's Greek hospitality though. It's part of why the restaurant is so welcoming, I think. Truly enhances the experience! I'll definitely be going back more often, especially since I'm dying to get my hands on a good gyro! I have no doubt it'll be amazing."], ["Tracy D.", "One of my favorite places. Georgia is a gracious hostess and the food is always great. The stuffed eggplant and bean soups are exceptional. If you order a whole fish, they even offer to debone it table side. There's a reason they've been around 20 years."], ["Rick P.", "Started with a salad and dolmades.  Love the dolmades.   They make them very good here at Athens.  I was also hungry for a gyro  the gyro came and everything was perfect.  The pita was soft and buttery tasting.  Tzakziki sauce was very good. Becky had filet mignon with white mushroom sauce.  Service was great.   The final touch was the mini drumsticks ice cream.   Always a good place for a Greek fix."], ["Richard R.", "My mom and stepfather introduced me to this restaurant years ago. Since then my family and I are greeted by the owner everytime. The atmosphere is calm with Greek music in the background. When the restaurant fills you see couples and families enjoying conversations.The food is to die for. My favorite is Pastichio (a light cheese on top of seasoned meat and pasta) with a side of chicken soup (Greek style)."], ["Chris C.", "This was my first visit in a few years.  The food and service were both excellent.  We had the Dolmades ( grape leaves stuffed with meat in rice in a creamy lemon garlic sauce), the Three meat Greek salad ( grilled pork, sliced lamb shanks, and Gyro meat)  and the Stuffed Eggplant with meat.  The eggplant was stellar!  A creamy Feta cheese  and tomato topping with buttery soft eggplant and a nicely spiced meat filling.The meal came with fresh bread with a nice crust and  a plate of olive oil and herbs for dipping.  The salad and Dolmades were also very good. For  dessert we had the Tiramisu, wonderfully fragrant with espresso, sweetened cream filling and airy Lady Fingers.  We did order the Kok, a cream filled chocolate topped pastry also but it was too dry for me and I swapped it for the wonderful Tiramisu.  Our server was  a very polite and warm young man with a big smile, he took good care of us during our visit."], ["T. W.", "The food was prepared with an old world authenticity that was just perfect. The service is excellent and the atmosphere is also great. The music was subdued and authentic (much better than the annoyingly loud Eurodisco other Greek joints play) and the hostess who greeted us was very personable and welcoming. The eggplant and scallop dishes were out of this world, and the tzatziki was great too. Definitely going back to try other courses on the menu. Efharisto!"], ["Toni J.", "Excellent Greek food (and from what I can tell, it's pretty authentic too)! Got the Greek Combo and chicken, lemon, rice soup. The soup and bread were super yummy! I wanted seconds, I was even tempted to swap out my entre for more soup and bread! But the Greek Combo was good too, I definitely recommend it. Their Spantokpia (part of the GC) was a bit on the oily side, but overall I enjoyed it. Definitely recommend and coming back here!"], ["Katie D.", "The Grouper Mykonos is absolutely the best!  For comfort food the leg of lamb can't be beat!  The service is good & friendly.  We love eating here! Enjoy!"], ["Sandy J. W.", "Normally, I would give this place five stars, but I had a bad experience a couple of weeks ago.I pulled a hair out of my mouth that was in my food!  Thank goodness the waitress, Mandy (who is awesome!  She knows everything on the menu - a real pro!), witnessed this and went to replace my meal right away.  When I told the owner about the hair, she got defensive and told me to check her kitchen - that there was no one in her kitchen with long hair.  I had to pay for the meal.This was the second time I found something in my food that should not have been in it.  I almost cut my mouth on metal that was in my seafood combo a year earlier.With the patronage I have shown this place and the fact that I kept going back even after the metal experience, I should not have had to pay for that meal, and the owner should have apologized.I go to this restaurant two or three times a month and love the food, love the owner and love the staff.I will not go back anytime soon.  I will miss it, because they have the best grilled grouper I've ever tasted."], ["Les M.", "Great authentic Greek food go there for lunch all the time!"], ["Connie H.", "Incredible authentic Greek food served by the most friendly, kindhearted people I know.  Everything is yummy, and they will accommodate special requests without a problem.  It's a super fun family friendly atmosphere, and Georgia, the owner will greet you at the front and remember exactly who you are.  You'll feel like you're in a friend's home.  Can't beat that!!"], ["John S.", "Had a gyro.  It was good.  This out of the way place is worth trying, if you are in the area, but I wouldn't travel there just for the eats."], ["Miranda M.", "Amazing authentic Greek food. Run by a Greek family that treats everyone that walks through the door like one of their own. The service was efficient and food served piping hot. I had the tilapia sunset, which was the special, that was tilapia in a lemon cream sauce with roasted sweet peppers, Greek olives, mushrooms, and feta along with orzo. Delicious! We had a party of 8 and it was refreshing to not be charged an automatic 18 percent gratuity. I have been here many times and will return again."], ["Gaby G.", "When you're in Jacksonville and looking for authentic Greek Food...this is the first place you should go.  Georgia will greet you at the door and welcome you in with hospitality that goes beyond what most restaurants offer.  I can't recommend one item as everything on the menu is good.  Just beware, dinner portions are large so bring your appetite.  Yia Sas!"], ["William R.", "Tasty Greek and Mediterranean food at very favorable prices. The ambiance is a bit old fashioned, but the staff is friendly and the food is consistently good. Dependable place to take friends for lunch or dinner. Give it a try and you'll become a regular."], ["Peter K.", "Have eaten here several times and am always well satisfied by the experience. Friendly staff."], ["Brian F.", "...was back at Athen's recently. Haven't been in a while. The food was as good as ever... The Greek combo was hard to resist -- mmm cheese pie!"], ["Paul C.", "Great food, portions, and service for the money.  Their lamb dishes are very good.  Greek decor, great lunch spot!  Smart & frugal locals eat here."]], "Wally's Gyros & Subs": [], "Choban Grill": [], "Casbah Cafe": [], "Hala Cafe & Bakery": [], "Zodiac Bar & Grill": [], "Amsterdam Mediterranean Grille": [], "Ariana Kabob & Grill": [["Juan Rafael S.", "It was time for lunch and I was very hungry. Being from out of town, I was feeling adventurous so I asked Yelp for help. It said that Ariana's was close by, but more importantly, it had a 5 star rating. But Ariana's is an Afghani restaurant, something I had never had. There is a first time for everything and today was Afghani day and I was not dissapointedThe first thing you will notice is that the place is spotless. Call me weird but I always try to visit the bathroom first. Why? Cleanliness. It's a reflection of how the restaurant, and usually, how the food is prepared. And I was right.I began in a very tasty variation of Baba Ghanoush. The flavors were amazing! Had to stop eating because my lamb plate came, extra spicy. Yum. The rice was full of flavors and spices. Wish I remembered the name. The land was tender and juicy.Being that I travel for work 10-12 days out of a month, I eat out often. Taste and freshness is my priority. Arianna has bothif you live here, you are very fortunate to be able to visit anytime you want. If you are visiting, make it a point to stop by. I know I will in 2 weeks, when I return to JAX."], ["Luis J.", "Totally amazing! I whent for the kabob combo #2 which includes one of everything. My favorite was the chaplee which is a very tender and perfectly spiced beef Patty. It's fork tender spicy and just melt in your mouth deliciousness. The chicken kabob was very tasty and grilled to scrumptious perfection. You have to try the warm eggplant appetizer it's almost like an Afghan vegetarian fajita dish. Service is five star the gentlemen that helped me was patient attentive and made great recommendations. Restaurant is very clean as well. I wish I lived closer so I could come back again soon."], ["Cheuk K.", "Small restaurant, delicious middle eastern food, friendly owner. I certainly wouldn't have found this place without Yelp even though it's less than five miles from where I live, and I'm glad I did. It's obscurely located in a small strip mall on the side of Atlantic Blvd. The restaurant is very small and can probably only fit 20 something people, but it's very clean and the air conditioning is awesome.The owner was friendly, and the service was fast.I ordered the Tandoori Chicken Shawarma, and I loved it. The presentation of the food was very beautiful and full of colors. The meal comes with rice, tahini, chopped onions/tomatoes/parsley, and a basket of pita bread. It also comes with a side of super sour yogurt sauce. The chicken was slightly spicy & sour and flavorful. The veggies had lemon juice on it and was sour. I put the tahini sauce on the pita bread, veggies on top of that, and then the chicken shawarma. Then I proceeded to dip it into the yogurt sauce, and it tasted delicious. Or you could just use rice.The vimto soda is a cream soda with black currant and raspberry juice, and it is also very tasty. You should definitely give this place a try when you're in the mood for some middle eastern food."], ["Aaron L.", "Middle Eastern Magic!  What a great find.  Found through Yelp and will definitely be back.  Delicious homemade food.  I devoured everything.  Buy a side kabob and small humous with pita to mix and match with other foods.  Sauces delicious.  Tahini sauce available too.  Mantu was delicious with wonderful sauce. Wish I lived closer.  Magically delicious!"], ["Dice H.", "Staff is very friendly and food is delicious. Restaurant is also clean. Never had Afghan food before this. Try the mantu!"], ["Jill C.", "I have been hearing great things about Ariana Kabob from my foodie/blogger friends, so we all took a trip out there to check them out. They are a very small restaurant located on Atlantic Blvd just east of St Johns Bluff. As soon as we walked in we were greeted by the owners and took a seat. We all decided to get a bunch of food and try everything (because that's how we roll!) We started with Mantu, which are steamed dumplings filled with onions and ground beef, topped with yogurt, split peas, and ground beef. I absolutely loved these. The flavor combination was perfection and I thought the yogurt sauce was a nice zing thrown into the mix.We also ordered Sambosa, which is fried pastry stuffed with ground beef, onion, and cilantro. These were also wonderful, but the star of this dish was the dipping sauce. I'm not sure what all is in there, but I want it to put on everything that I eat from now on. I kept the leftover sauce and dipped everything I could in there, and it tasted great on everything! The dumplings were not greasy as you might expect from a fried dish, and the filling was plentiful and very flavorful. There are two versions of this appetizer, so next time I will try the other so I can compare (it is a meatless option that includes potatoes in the filling).One of my friends at the table ordered the Grape Leaves. I am not a huge fan of grape leaves in general, but I thought these were very good.For my entrée I got the Falafel Platter, which includes basmati rice, hummus, and tabbouleh. For starters, the hummus is some of the best I have had! It is very creamy and has a pleasant flavor to it, not too much garlic like some other places in town. The tabbouleh was also a pleasant surprise with it's rich lemon flavor and the basmati rice was plentiful and delicious. The owner told us that he uses a higher quality rice, and it really shows in the final product. I also was a fan of the falafel (which I dipped in that green sauce!) Even with my plate being all vegetarian, I didn't feel like I was missing anything at all! All of the items on the plate had their own distinctive flavor and tasted different than the same dishes from other restaurants.My friend Nate got the Lamb Shwarma Platter. Just like mine, it came with basmati rice, hummus, and tabbouleh. I am new to lamb, but I took a piece and thought it was really good. I loved the flavor and the spices that it was cooked with were great. Others at the table have declared this lamb to be the best they have ever had!While I was paying I happened to see the baklava just sitting there asking to be bought, so I happily obliged. I noticed too late that there were also some interesting looking pastries in a case and asked the owner what they were. He told me it was an elephant ear and gave me one to try. I thought that was so nice of him! When I got home I tried both, and they are both great! The baklava is nice and sweet and the elephant ears were sweet and crunchy. It was a great way to end the night!Verdict: Loved it!!I am so happy that I tried Ariana Kabob because I now have a new favorite place! Everything was super authentic and fresh and the prices were very good. The owners were very friendly and kind, and they can sure cook some delicious food! I can't wait to go back and try some of the other things on the menu!"], ["Kaley B.", "Highly recommend starting with the Mantu.  Everything was so fresh and delicious. My husband and I both enjoyed the Tandori chicken and Gyro wraps-both were excellent. Very clean and service was excellent."], ["Au S.", "My new favorite place! You can tell that everything is made fresh!!!! Their meat is also imported where there is no \"blood\" when buy them.....this was really interesting, yoou can ask the owner and he'll give you the process....very interesting to hear...And the owners are soooooo down to earth especially hearing their journey....to hear that they almost close last year....MUST VISIT AND TRY their food"], ["Matt M.", "I have driven by here dozens of times and stopped in for lunch one day. It was Christmas Eve, so the place was all ours. My daughter was hesitant, but in the end she appreciate the adventure.First impression, counter service restaurant with no frills dining room. Since we knew what to expect, we were not suprised.  My daugher ordered a hamburge and I had a Kabob.  Both were delicious and we had fun sampling each other's food.  We started with a Hummus and Pita Bread dip, but that was the weakest point of the meal.  My daughter then declared her burger \"best ever\".No frills, but nothing spectacular either."], ["Samuel Y.", "Fresh and delicious food. This is our third visit in just 1 week!! Don't miss it, it worths your try!!!"], ["Martha H.", "Don't let the location fool you, this is a must try. The food was excellent and service was top knotch. It's well worth the 20 minute drive for me!"], ["Ray B.", "It's a winner!!  We saw positive reviews both on Facebook and Yelp, and decided to give this hidden gem a try, and so glad we did. This restaurant definitely has some of the most unique flavors offered in Jacksonville. We were greeted by the very friendly owner. His restaurant is impeccably clean, with a pleasant atmosphere.  We tried and loved 1) Mantu - steamed dumplings filled with onions and ground beef, topped with yogurt, split peas, cilantro and blended spices 2) Sambosa Goshiti - Deep fried pastry stuffed with ground beef, onion, and cilantro and served with spicy cilantro dipping sauce.3) Qabili Palau - tender chunks of lamb with seasoned rice, topped with sweet carrot and raisins.4) Biryani Chicken - chicken with rice and special sauce (I asked for it \"medium\" on the spice side. It was perfectly spiced with the right amount of heat. Enough to make your nose run a bit, but not too much to make you cry ;)We can't wait to go back and try some of his other dishes. Ariana's will stay on my radar as one of my go to places, and top recommendations when someone is asking for something different."], ["Diana A.", "I visit this hidden gem today and I was not disappointed. . They are clean.. I had the Sambosa and Banjon Borani and it was delicious. . I am looking forward to my next visit. .."], ["Wendy F.", "The service was great, the food was fresh and delicious and the place is very clean. We order a dish with chicken, rice and potatoes and a fresh and simple salad on the side. We also tried a eggplant dish that was outstanding. The cheese steak was delicious and the seasoned French fries were perfect. We will definitely be back. So glad we found this neighborhood secret!"], ["Ryan S.", "First off the restaurant is super clean and the owner is amazingly friendly. Listen to his suggestions he wont lead you astray.Now for the food I tried the tandoori chicken cheese steak thats is fantastic just the right amount of spiceThe lamb cheesesteak is just amazing perfect flavor balance. Chicken cube kabobs we perfectly tender and seasoned well. Add on that they cook it without fat very very goodBaba ghanoush here is top notch.And HOLY COW THE FRIES ARE THE BEST I HAVE EVER TASTED."], ["Jake I.", "The only place in the area with middle eastern food of decent quality, since the hookah bars are known for having shoddy kitchens. The lamb was good in both the kebab and Shwarma, if a little on the pricier side. The Mantu was very good and flavorful. The pita is amazing warm but once it hits room temperature it's extremely tough and hard to chew. I will say I was very disappointed with the Baklavah, because there was little to no honey (which I've always thought is part of what makes the dessert so good), and since it's their only dessert on the menu you may want to go somewhere else after your meal for a sweet treat. Overall not a bad place, and no alternatives for this cuisine in the area mean a fairly high rating."], ["Mark B.", "I have seen this place on Facebook and Yelp and today was the day. I finally found the place cause looking at the map it put you in the shopping center down the road. I tried once before and gave up and went to a place that I knew was there an open. Today I was a little more persisted and I found it. I walk in and the place was almost empty but it was between lunch n dinner. I was greeted by the owner Younus Zury. I'm and he just glad I didn't have to say it I could just type it. He was so nice and so nice and offered some suggestions. But, I went with the combo. It is a little pricey but after I finished it, it was worth it. I got a kebob of Lamb, Chicken, and Kefta. The kefta is a middle eastern spiced ground beef and everything was grilled to tender juicy goodness. Everything I ate was very tasty and you could really taste the wood fire grill. Now the star of the show for me was the rice. It had the same wood fired taste that I cant quite figure out how they got. It was very tasty and I will be back for it again."], ["Gina M.", "I ordered delivery from here tonight. The food was everything I had hoped it would be...and more! I got the chicken kabobs, baba ghanoush, and baklava. All of it was really fresh and you totally get your money's worth! Great portions. I will definitely be ordering again and coming back."], ["Grace F.", "Awesome hole in the wall! Great fusion of different cultures. I had the tandoori chicken wrap and it was fabulous! Very nice owners!"], ["Kevin W.", "Found a new dish. Try the Banjon Borani. Quite possibly the most delicious thing I've ever eaten! It's so good!"]], "Karams": [["Sarah P.", "The quantities are huge, the staff is very friendly, and best thing is that the prices are very reasonable. Cool hang out spot! Next time we go to JAX we will def be visiting again. The cherry on top: food was delicious! Authentic gyro meat and best hummus I've ever tried."], ["C S.", "Stumbled on this place by accident, just saw the sign and decided to stop since we were all hungry.  What a lucky break.  Some of the best middle eastern food I've had.  Hummus was so creamy and delicious.  Kufta kabab sandwich was tasty.  The falafel was unbelievably light and tasty and smelled so appetizing when it came hot out of the frier.  Small place doesn't look like much when drive by and it's small, so easy to miss.  Don't miss it you'll be glad you stopped by."], ["Ahmad F.", "Great food for great price, i always get the chicken shawrma with garlic, hummos and fatoosh Really recommend this place, the earlier you go the better since they run out of food sometimes."], ["Shannon K.", "Today was my first time eating here and it was so delicious I will be back! I ordered the Meat Shawarma combo which includes 3 sides, all for under $12! For the sides I chose Hummus, Moussaka and the Fettoush Salad. Fettoush Salad includes lettuce, cucumber, onion, tomato, crispy pita and sumac spices and is wonderfully tangy and delicious. The hummus and moussaka were also great choices.The Meat Shawarma came carved straight off the spit and had some nice and crispy bits and was wonderfully seasoned. YUM!The service was also excellent. It did not take long for my food to be ready for take away from when I ordered it. The staff was friendly and they welcome their repeat customers by their first names and with a big smile. You can tell they truly love their customers and with most of them that were in there during my short time there, they were repeat customers. I will also soon be known there on a first name basis :)Closed Sundays."], ["Jennifer F.", "Without a doubt the best Mediterranean food I have ever had.  I agree with the other reviewers:  quantities are huge, good value, not fancy and great service.  I've had most everything on the menu and its all amazing!  My favorite is the chicken shawarma & babou ghanoush.  The beets and peppers that come on the side are heavenly.  The pita bread is always fresh!"], ["Christina M.", "I ordered them through doorstep delivery.  I had never tried them before until then.  I can honestly say, they have amazing food.  the meat (lamb) tastes great.  the hummus is beyond delicious and the tabouli is just wonderful.  it all tastes so fresh and I love that they include some jalapeños on the rice.  the menu is simple and easy to choose from.  glad I found them, and their prices are very reasonable.  I keep ordering from them and I will continue to do so."], ["K K.", "Unbelievably good food. What a treasure. I had a chicken shawarma plate and am now only regretting that my time in Jacksonville is short, otherwise I would eat at this place every chance I could get!"], ["Ferrin G.", "It's one of my favorite places to eat and every time I'm the area I swing by there for lunch and it never disappoints."], ["Ira R.", "I went there for the first time on Tuesday and I loved it. It's not a fancy place but the food is really good. It's filling and you want more after. I had the veggie wrap with tabouli and garlic sauce. Their garlic sauce, either you can request it inside the food or on the side, is one of the best sauce I've had. The only sad part is, the owner is leaving back to his country and wants to sell the place. I hope this place and staff stays here. I wouldn't want my first to be my last time."], ["Scott P.", "First timer at Karam's. I had a meat shawarma, and was very impressed. The meat is well seasoned and grilled so that the tips and ends are nice and crispy. Delicious."], ["Todd W.", "I love.. love.. love this place.. The schwarma plate is always great, the hummus is always great.. I've gone here to eat as many times as three days in one week. It's excellent.. definitely worth going if you want to try good Mediterranean food.  When I have company from out of state, I make them try it.. no one has ever been disappointed."], ["Juliet K.", "man, i really wanted to like this place, and maybe its the lack of other mediterranean food in the area that makes this place have so many stars.... i ordered the mixed shawarma plate which comes with chicken and beef/lamb and 2 sides. the chicken was pretty decent, but the beef/lamb was SOOOO overcooked that it was really dry. even the extra yogurt sauce i got did not save it. the garlic sauce was really good though and so was the yogurt sauce. and the side were GREAT. i got hummus and something with eggplant. maybe the chicken shawarma wrap would be better, or the kabobs. but i'm not sure i would want to go back to even try it...."], ["Amber A.", "Good falafel and hummous with very good tabouli and babou ghanoush.  Good value, a lotta food for decent price.  Deli style atmosphere."], ["Lauria T.", "The best baba ganoush around! Delightful and delicious family run eatery.  Great Shawarma, too!"], ["Michael F.", "This place has the spinning meat!If you are familiar with european kabob restaurants or Mediterranean shawarma then you have found your home away from home with Kamal's. If you are unfamiliar with good real Mediterranean food(not like Hovan) than you owe it to yourself to come here. This is a family owned restaurant an you can tell they make authentic great food. I had lunch and everything was delicious. New favorite lunch place in jax."], ["Linda W.", "I could just write \"fabulous\" several times and feel like it aptly describes this place, but I guess I should explain why I'm calling it fabulous.  This was our first time eating this type of food and neither of us were impressed at first glance of the little building with very little (apparently) going on..... I decided to go in and have a quick look around, smell the smells and ask for a togo menu before we committed to coming in and eating.OMGosh it smelled heavenly and the man at the counter (the owner I believe) was so friendly and understanding when I said I was just looking.... he has a huge smile and combined with the smell of the food I decided we had to try it.And I am so glad we did! I had a shawarma pita and all I can say is that shawarma pita has a firm spot in my top 10 list of favorite foods.  It was absolutely delicious with a fabulous mix of hot and cold, crunchy fresh lettuce and very flavorful meat... a lovely pita and the sauce was just plain delicious. This shawarma pita was one of those things that make me salivate just thinking about it. I plan to go back as often as possible.My husband had a plate of something that he really liked, but honestly, I was so wrapped up in my food that I forgot to ask him what he had!The restaurant is small and comfy, the service is OUTSTANDING, and everything is clean. It does not get any better than this!  (Only improvement the owner could make would be to get a website :-)"], ["Eryn S.", "I love this place. My friend suggested it to me. And thank you to her! I can never decide what I want. Everything is great. The prices are very reasonable. The owner is the most friendly I've ever encountered. The grape leaves, hummus, kebabs, and french fries are some of the things I normally get. I hope everyone goes there. It's a little small like a take-out Chinese place but there is plenty of seating. Get the combo if you can. It comes with 1 main dish and 3 sides. It's really too much food for one person but everything is very easy to reheat and still tastes just as good. Enjoy!"], ["Virginia M.", "I enjoyed my lunch here very much. I love their hummus!"], ["Candace M.", "After driving by Karam's about a hundred times, I decided that I was going to finally make a point to stop in and see what they had to offer.  I dragged the fiance out to run errands with me and told him that we were going to lunch.  He asked where, I wouldn't tell him because I didn't want him to voice any hesitation about venturing to a new restaurant.We wandered in on a Saturday afternoon and there were only three other tables of patrons in the restaurant.  Sounds like that's not alot, but there are only six tables in the restaurant.  We were promptly greeted at the door by the folks behind the counter - it's a family run business and all immediate members of the family were there behind the counter.  The fiance decided to try a shish kabob sandwich  and kibbee balls.  I tried the chicken shawarma plate with yogurt salad and tabouleh.   The shish kabob was delicious - perfectly cooked, perfectly seasons, shish kabob heaven.  My chicken shawarma was amazing.  I had to fight off the fiance because he kept leaning over the table forking away pieces of my chicken.  The yogurt salad was very good - and I'm not one who normally likes yogurt ... and the tabouleh was super fresh.  Oh - and my pitas were freshly made and amazing.  The family asked if we'd even like additional pitas after we devoured the ones that came with our meal.The prices are very reasonable, most sandwiches are $4.99 plates are $7.99 and come with two sides, combos are $9.99 and come with three sides.  It's very cheap considering the amount of food that comes out on the plate.  Homemade desserts are available and they're freshly made and catering is also available.I'd definitely go back - and I will.  I'm eager to try the falafel.  I'm hesitant to hit enter and actually post this review because I want to be able to get a seat when I visit Karams ....   You folks don't bombard them now!"], ["David R.", "Karams is my favorite place in Jacksonville to get my Middle Eastern food fix.  They make their own gyro meat and chicken shawarma.  I have eaten there dozens of times with friends and family without ever being disappointed.  We usually order chicken shawarma, lamb kabob, hummus, baba ghanouj, falafel, tabbouleh and fetush salad.  Yes, we make it a buffet party when we go there. It is owned and operated by a very friendly and helpful family."]], "Tabouleh Cafe": [["Eliana S.", "I simply encourage people to come to Tabouleh restaurant.. The chef loves what she does & her food is just plain amazing! You'll feel like you're actually eating homemade food.. That's how amazing it is.. & her baklava is all homemade also... If I had to pick a place to go eat mediterranean food.. Well this is the right destination ;) oh and the shawerma.. Just like back home!"], ["Grant F.", "One mustn't start the meal without hummus: nutty, creamy, a generous swirl of EVOO and pita to dip it up. But the roast lamb over rice that was perfectly perfumed: perfection! The lamb was hand-shredded (roughly) and accented with a sprinkling of toasted almonds. The salad added the acidity to cleanse the pallette for the next bite of lamb and rice. I won't be able to finish it all, so some is going home with me."], ["Gerrald L.", "Incredible Mediterranean food the place is clean and they have great baklava, and the owner was friendly"], ["Caron S.", "DELICIOUS. Everything is made in-house. Even the hummus, and all the desserts.Extremely friendly staff. I tried the tabouleh rider (it's pressed, mmm!) with a side of baba ganoush and two cheese pies on my recent visit and both were great. Portions are good, price is comparable with other mediterranean spots in town and the restaurant is very clean. It's tucked away in a strip mall but it's a nice space. I can't wait to go back and try other items."], ["Dave G.", "First, the negative... I've lived near JU for years and am just now finding this place. Now, the positives... We stopped in for a quick lunch on a Thursday and had the grape leaves, lamb shawarma (me), chicken gyro (mrs.), and the Armenian meat pie (the 3year old).Everything was so good and tasted genuine, not like the McShwarma that you get at other \"Middle Eastern\" restaurants. It reminded me of travels abroad. I'm so glad to add this to my rotation of local restaurants. Go. Eat. Be Happy."], ["Benjamin M.", "Authentic, and absolutely delicious!ATMOSPHERE: The interior needs a touch-up, particularly the flooring. The art on the wall is nice but there's a lot of it. One or two matching pieces is a bit more relaxing and less overbearing. The chairs and tables make no sense together. Simply getting matching chairs and tables and repainting the floor and de-cluttering the walls would dramatically improve the restaurant. The fridges that show the fresh hand-made baklava, felafel and other dessert is nice for a cafe style.The music is a *touch* on the loud side, but enjoyable for what it is intended to do. SERVICE: Unfortunately, because this restaurant is so unheard of we were one of just one or two customers in the course of the entire hour. That said, it made for immaculate and punctual service, unsurprisingly. Tabouleh really needs to make a greater effort to reach out to the community and get people through the doors. People should be breaking the doors down for their baklava!FOOD: Absolutely delicious. I ordered the Caesar salad with the Chicken Gyro. The chicken had just the right amount tapered off perfectly with the sour cream. I couldn't stop eating. The chicken was thinly sliced but perfectly cooked and moist, and as any cook knows, that's hard to achieve. The baklava was delicious, a tad runny, (you eat it by picking it up they do not provide a fork; I admit it seems a bit pretentious for them to expect you to eat baklava with your hands). I would have preferred a fork to avoid the runniness. OVERALL: This place is a place I will frequent. I think a lot of improvements should be made, especially to bring more customers in, (nothing would break my heart more than to see this place close). A note to the front of house manager if he ever sees this, advertising is just one way of reaching out to your community. There are a plethora of things you could be doing with the delicious food at Tabouleh, from competitions, to taste tests. The possibilities are endless."], ["Dara H.", "Very, very good food and very fresh. I had the chicken gyro and Mediterranean salad as a side. The only reason I can't give them a five is because they took so long. It took 30 min for my order to be done."], ["Sharon S.", "Bought the kifta kabob it was undercooked.... First thing I saw when I cut them piece of kabob was pink! I hate medium rare or undercooked meat... Not only that but the sides were just diced up tomatoes mixed with mint, the smell is very overwhelming and not something pleasant to smell... And the plate was just a very messy plate, didn't really enjoy the mayo on top of the meat either, especially for someone who doesn't like mayo they should really ask or have an option to put it on the side. The flavors were good but the undercooked meat killed it for $25 for just two plates it wasn't worth it. I had higher expectations for this place, since there prices were so high. Not only that! I walked over to my car to wait for the food to be done I was in my car for no more than 5-10min what the food normally takes to be done at these kind of places....I was walking and the guy was standing outside of the door of the restaurant looking at me and was upset, and I quote him \"I don't know where you were at inside or outside i was looking for you to give you the food.\"either way I had already paid for the food he could've just waited inside for me to come back and get the food, its not like I wasnt coming back for something I had already paid for. And the owner was being quite rude, I did have some questions that I wanted answered but its typical to ask questions at a place you've never been too."], ["Mike H.", "Great food! I get the steak in a sack and Melanie gets the Mediterranean platter.  I've also highly recommend the baklava and the kabobs are good too."], ["Bill K.", "Ate here last Tuesday because my go to Gyro place was closed for Ramadan. As mentioned in another review \"The interior is plain, and western in style, but you come here to eat, not live.\" The owner and cook are very friendly and accommodating. I ordered a Gyro with onions and light tahzeki sauce and fries. The pita bread was very fresh, as was the tahzeki sauce, the gyro meat was good but bland with no discernible taste. The fries were excellent, hot, crisp and fresh, and the sweet tea vas good also. Will I et here again, probably but not a gyro, unless Wally's is closed again for some reason. Even though Wally's is further away from me the gyro quality makes the extra drive worth it."], ["Gary Y.", "Very clean, friendly, good prices. Fantastic food! Great stop for vegetarians and vegans, but they should have something for all tastes."], ["Craig E.", "This is a great little authentic middle eastern restaurant.  Nothing fancy, but they know how to cook.  For my first visit, I ordered the sampler - fresh tabouleh, house-made stuffed grape leaves, falafel, kibbeh, and hommous.  Everything was perfectly seasoned and high quality.  Actually much better than some of the better known middle eastern places here in Jacksonville.  I will definitely be back to sample more, but I have little doubt that I will be very happy with the food.  Highly recommended."], ["Natalie M.", "Was pretty excited to eat here based off some positive reviews and the photos. We ordered the lamb shuwarma dinner plate, Mediterranean sampler and the Mediterranean dinner plate. Ended up getting one thing right (med dinner plate) but got a lamb gyro and no appetizer. The food was fairly good but was really disappointed with the mess up considering there wasn't a single person eating there but is. In addition, I think the rice wasn't fresh because when I asked for a side of rice, I had noticed that he put water in it to hear it up...?"], ["Mark D.", "I eat here often and the food is always delicious. I'm Greek and my wife and I are extremely picky with Mediterranean food. Ask the cook to surprise you and she will make something you will come back again for. I'm a fan of the Lamb Kebab and my wife is a fan of the Wholly Hummus with a side of Tabouleh Salad."], ["Eugene F.", "I was visiting florida and came here with an arabic friend. the first thing i noticed about the place was the waitress' clothes were rather stained. i thought, ok, no big deal, she probably works in the kitchen too. I ordered the beef gyro, as recommended by the waitress, which, was actually pretty tasty. it came with humus and one small slice of pita bread. ok, not so bad so far. i asked for a little more pita bread since the original piece was redicuoulsy small.when i went to pay for my order, as my friend was chatting with the waitress lady in arabic as she ringed us up, i noticed the cook in the kitchen through the window seperating the dining area and kitchen. to my shock, as he was done pasting some spread on someone's pita or gyro, he casually proceeded to lick the spoon he was using, then put it back into the tray he was using. then, walkign over to the stove area, he licked all his fingers, one by one. since i was in a new place and my friend was being so chatty with the waitress (owner ?) , and added with my shock, i did not say anything. i regret not speaking up.to add insult to injury, she charged me extra for the little extra pita bread she brought me.I felt disgusted after leaving the place."], ["David R.", "Some of the best hummus, tabouleh, and baba ganoush I've ever eaten. Try the Mujaddara, a lentils and rice dish - fantastic! My friends were raving about the lamb kabobs as well. A great find, especially as a biz traveler."], ["Jay D.", "Ordered several items from the menu and everything was outstanding. Turkish Coffee was great.Owners really know how to cook. As good as it gets in jacksonville."], ["Johnny C.", "The food here is good and that's what people will come here for. I had the gyro and the tabouleh salad with an appetizer of falafal.  I would definitely come back here for the gyro great flavor with just enough sauce and it melded great with the fresh pita.  Really awesome pita.  Okay the Felafal was good for felafal, but four small pieces for about $5.  No! definitely not worth it.  I was expecting some pita and something else to go along with it but nothing just four small mouthful pieces.  Not saying it was bad, but damn that's a bit expensive for my taste.  I had a taste of the hummus with the pita bread.  That was some good hummus, smooth and great flavor.  I also had some Turkish coffee.  Interesting to say the least.  It was spicy, tangy, and had bits of herbal/citrus hints too it.  It was worth trying very tasty and I am not even a coffee guy.  Maybe not for your average Starbucks drinker, but very interesting.OVERALL:  Good food, friendly owner. small mom and pop feel, but certain dishes may be a bit pricey for the quality.  Would recommend."], ["Andrew W.", "Terrific spot. Plain, unpretentious, but friendly and fun! Middle Eastern music played quietly in the background as my wife and I savored the namesake dish, a Greek dip with pita, two kinds of kabobs (chicken and ground beef \"Kifta,\" both served with a tasty basmati rice and very fresh Mediterranean salad), a few beers and baklava that's the best we've tasted in North America. Great spot."], ["Beth W.", "The Mediteranean food here is great and the service is superb. The staff is happy to tweak the menu to prepare exactly what you want. There is a pretty good menu with many options, the gyro and the baba ganousch are my favorites!"]], "Mediterrania Restaurant": [["Rahul C.", "We were looking for a Mediterranean eatery in jacksonville and we wanted to try this place upon the positive reviews. From outside its not that impressive but the decor and the ambiance inside is warm and cosy. We ordered steaks and calamari dishes, the appetizers were ok, but the steak was awesome the flavor and meat was really good, we decided that this would be our place for steaks only. Very friendly staff the price vs portions are very very good."], ["Cherish B.", "Our party of 7 arrived shortly after 7pm on Friday night.  Our server was very friendly, and the restaurant was maybe half full.  No one ordered apps, but we did share 2 bottles of wine while enjoying the bread and oil.Our salads came out fairly quickly, but our entrees took quite a while.  When they did come out, they were delicious.I had the Grouper Piccatta.  Lightly breaded, yummy sauce (could have used some of the bread to scoop it all up, side of spinach.  The spinach reminded me of canned, with some type of seasoning added.He had Lamb Shank with onions, tomatoes, pepper, feta cheese and capers.  One of the better lamb dishes he has had, he said.Everyone else seemed to enjoy their meals, as well.We ordered dessert, to-go.  Cheesecake Creme Brulee.  Rich and creamy, but not heavy.Strong possibility we will go back next time we are in town to visit family."], ["Peter Y.", "Very nice surprise. The strip mall this place is in is kind of run down but this little restaurant is a gem. Inside the decor is pleasant, the service very nice and attentive and the prices are reasonable. The soups we found a little uninspired but the entrees were excellent. From the roasted chicken to the roasted lamb, it was excellent all the way around. And as a surprise they don't treat their sides as plate filler. They were so good they almost stole the show from the protein. Overall, a very nice evening here at this little restaurant. We'll be back."], ["Kevin C.", "I've live here most of my life and have driven past this pass hundreds of times.  I had a guest in from out of town and he wanted to try this place out.  We stopped in and I was pleasantly surprised.  Loved the food and the service was great.  I will go back.  Oh, the Gyro platter is great!"], ["Doug R.", "Been eating here since the 80's...usually on a special occasion. Very good, very fresh, tasty, consistent food and side dishes. Best rack of lamb around, I skeptically chose the flank steak instead of the lamb the other night and was not disappointed.! The cheese that they light on fire (forget the name) is a great appetizer.  The restaurant is one of my top favorites in town."], ["Jim C.", "The best chicken  grill and potatoes in the city. Great service.  I now have lunch there once a week. The soup is always good  but  I liked the chicken rice the best.Get the  special."], ["Wanda M.", "The Greek salad and the bread along with the service was excellent. However the gyro was burnt. It was like they pre-sliced the meat, grilled it along with the pita and it had a grilled burnt taste.  The decor was adorable inside, however the exterior had much to be desired. I never judge a restaurant by appearance so this did not bother me. The menu offered a choice of other traditional Greek foods and pasta dishes which we may return to try. But if a Greek restaurant can't master a gyro, you have to think twice about giving it another try. If we return it will be only because we liked the warm reception from the staff."], ["Rich H.", "Excellent family owned place. Real Greek atmosphere (for Jacksonville). Great service, good food, some nice Greek wine. A good experience."], ["Katie C.", "Solid lunch in the Baymeadows Area. I love Mediterranean food and this spot does the trick with staples like Spanakopita (listed as Spinach Pie on the menu), Gyros, Greek Salads, and more. The atmosphere is inviting with red tablecloths and spacious booths, and the service is friendly and efficient. I opted for the Spinach Pie and while it was a very generous portion, the flavors didn't really wow me. It was overly mushy and filled with too much spinach. I could be biased though because the pastry part is my favorite component of this dish! Their tzatziki sauce is great and they give you tons of it with the Spanakopita, so that was a plus. I'd definitely go back for another go at Mediterrania Restaurant, but for now I'm leaving it A-OK."], ["Damon F.", "Best callimari!  This is a wonderful family owned and run restaurant specializing in Greek and Italian food.  There were so many things on the menu that my wife and I wanted to try that we were stuffed and had lots to bring home.  We ate the hummus, cheese flambe', and callimari for appetizers.  The callimari was not chewy at all and the batter was light and not heavy with grease.  They served it with a white sauce that was a refreshing change from marinara.For entrees we had the Greek Combo with grape leaves, spinach and feta stuffed filo, and an eggplant, meat and potato item.  Sorry I don't remember the Greek names for the dishes - but I remember that they all tasted fresh and delicious!  We also had a special that was seafood and pasta with a white sauce.  I'm looking forward to the leftovers because I didn't have room to do more than eat a scallop - but the scallop was tender and perfectly cooked.This is definitely a new favorite restaurant that I will come back to regularly."], ["Paul G.", "This is our favorite restaurant. Period. Great choice of Greek or Italian dishes, perfectly prepared. We are treated like family when we come to this family owned and operated restaurant. Great warm ambiance. A little Greek music playing. Decent but not deep wine list. Highly recommend."], ["Kathy C.", "Ok, maybe we ordered the wrong things on the menu... maybe my taste buds are just off... I don't know but whatever it is, we were very unimpressed by the food.The decor, the atmosphere, and the serve staff were all great.  Upon walking in, we were greeted warmly by the hostess and every server that we walked by.  The menu pretty much is even between the number of Greek vs Italian dishes.  We were craving Greek, so that's pretty much what we ordered.Saganaki - Not bad at all.  The server flamed the cheese and squeezed lemon by table side.  The portion is a lot bigger than what we are used to having in other Greek restaurants.  The taste is good, a bit salty, but good.Calamari - Lightly battered.  We were half-expecting tzatziki, I mean, Mediterranean restaurant and all... but it came with a mayo / chipotle type sauce.  But not bad.  We like how the squid is lightly battered.Minestrone Soup (came with entree) - Ok, this soup I did not get at all.  I can't really call it Minestrone soup... it was more like a weak tomato soup with loads and loads of bland & soft veggies.Chicken & Rice Soup (came with entree) - I liked this soup.  Not what I expected (which I thought would be a light brothy chicken, veggie, rice soup) but instead, a thick rice soup with chunks of chicken.  Almost like a congee from a Hong Kong restaurant lol... A bit salty though....Greek Combo Entree - The combo comes with Domaldes, Spanakopita, and Mousaka.  The Mousaka was the best in this combo, and it was just mediocre.  The Spanakopita was very salty.  And the Domaldes was just... terrible.  I had a bite of 1 of the 3 Domaldes and had to give it back to my husband.  I just couldn't eat it.  The grape leaf had a very strange taste, it was wrapped very loosely / falling apart and the filling was just bad.  Lastly, the tzatziki was so disappointing.  It was very weak, lacking the flavor you would expect.  Flank Steak - Ok, so when the server plopped the dish down, all my attention went to the GIANT PILE of... very dark, very green, very mushy looking (I think) kale.  I cannot, seriously cannot, imagine anyone's appetite being enticed by this very GIANT PILE of green stuff (unless you like green mush...)  The steak was a bit over seasoned.Ack, we really wanted to like this place.  It's been a while since we had great Greek food.  But this restaurant just fell short.  Overall, we found the dishes over salted and just... off.  Again, the staff was so friendly and the restaurant so cute. Maybe the Italian side of the menu is much better than the Greek? If we ever make it back there, we'll give the Italian a try...."], ["Susan P.", "Chicken lemon rice soup was good but lacked lemon flavor. I had chicken florentene it was very good. My husband had the veal rolentene, he said it was very good. Although I thought his was a very small piece of meat. The restaurant was on the cold side and if you needed to go to the bathroom, you had to go into the adjoining room which was pitch dark. All you could see was like a light at the end of the tunnel.  I was in shock the room was very cold and you could not see were you were walking. I don't think we will be back. Service was slow and I felt a bit over priced."], ["Don F.", "Great find. I had the salmon, Mom had a Greek salad with grilled shrimp, Susan and Bill both had steak. everything was cooked to perfection and really seasoned well. I'm In town until Saturday, sooooo I'm going going back for lunch because Chef Eddie is cooking his famous chicken soup, yummm."], ["Ryan M.", "Everything about this place is great.  The old world, small, hole-in-the-wall, family-owned atmosphere makes for a great experience.  The service was very attentive and genuine.We got the house wines, which were just fine.  The bread and oil were addictive.  Salad dressings (ranch and the really good oil and vinegar) were homemade with excellent, green leafy lettuce. The lasagna was superb!  Very very cheesy and exactly what we wanted.  The Italian Combo (lasagna, eggplant parmesan, and manicotti) was similarly amazing.  Lots and lots and lots of cheese, on and in everything.  The eggplant was nothing short of incredible.We are pretty critical on restaurants, but will definitely head back to Mediterrania!"], ["Lucas H.", "Very nice little place. Waitstaff was kind & accommodating. Minestrone was fine for me. Price was decent."], ["Jeff P.", "family Restaurant with good food definitely worth a stop"]], "Sahara Cafe": [], "Kabob E": [["Matt R.", "Great place for a gyro! I have an office nearby and called today with an order for about 10 people... gyros, platters, chicken schwarma, etc... and I picked this place because of the great reviews here on Yelp. The food was good, everyone enjoyed their selection. The gyro meat was cooked and sliced just right and rich in flavor. The tzatziki sauce wasn't great, it had an unusually sweet taste, but that was the only thing about the meal I didn't love. The real reason for the 5 stars would be for the service. The fella that helped us out (the owner I think), provided excellent customer service. He got our entire order exactly correct (there were a lot of details) and he even walked the order out to the car for me.I'll definately be back.BOTTOM LINE: Great food, unusually sweet tzatziki sauce, and FANTASTIC customer service."], ["Ric D.", "Ok, let me start by saying that I am completely and utterly frustrated with Kabob-E right now. I would love to give it 1 star, but that may not be fair, so I'm going with \"2\" for below average. But I can't even say that's representative of the place, because I haven't eaten there.Tonight we decided we wanted Mediterranean food. We narrowed our list down to three places, which all had pretty good Yelp reviews. None of them are very close, so it was a toss-up.  We decided to drive to Kabob-E because the menu seemed to have a lot and the prices were good.  Upon arriving, we saw the \"Closed Mondays\" sign (hanging right above the stenciled, more permanent lettering that says \"Monday - Thursday 11:00 am - 9:00 pm\".  This same information is also displayed on the restaurant's website, as well as on the Google informational listing.  As much as I love good Mediterranean food, we will probably never be back, as I know of 2 other places that are the same distance and apparently just as good.  I mean, if they want to be closed on Mondays, fine, but why not update their information? Imagine if I had driven much further...  Too bad, because we'd probably have become weekly customers."], ["Timothy G.", "I wrote a review for this place last May, 2014, and I have to write a follow-up. I and my wife and daughter visited a few weeks ago around 5pm on a weekday. It was NOTHING like I remember from the previous year. Completely deserted. It looks like somebody different has taken over management or ownership. The very first thing I noticed were hand-written notes posted EVERYWHERE. Some were advertisements for menu items, but a lot of them were admonishments: \"Do not enter!\" next to the counter - do you really have a problem with customers going behind the counter? Our service was quite poor and we actually needed to get some things ourself since we weren't getting any attention at all, so maybe that's why people were going back there? Oh, and on the register \"Sauce is 50 cents each. How many do you want?\" Very inviting. In the past we were always served sauce with our dishes - I understood it was part of the dish. Nickle-and-diming the customer is always a sign of going downhill. We spent about $40 there... my daughter got a \"salad\" which was a plate of iceberg lettuce with one thing of dressing, my wife ordered the gyro platter which was a mound of rice with some dried out gyro shavings on top and nothing else, and I spent $14 on a platter which consisted of only 2 ounces of tasty lamb meat on a huge mound of rice, no sauce (that's extra now I guess), 3 thin slices of raw green pepper, and a handful of raw onions, which was served to me about 15 minutes after my wife and daughter got their food. We also got 3 cans of soda. They have a fountain which is out in the customer area like most restaurants, but there is a sign on it saying that refills cost money... once again, the manager or owner is now grubbing for money and it is such a turn-off. I cannot believe that this place we went to a few weeks ago is the same restaurant we loved so much in May of 2014. It must be under different ownership or management. Anybody who walks in can immediately tell that this restaurant is there to make the owner money and nothing else. There is no customer-centeredness, there is no focus on putting out good food like before. I would say I'm never going back, but I would bet my next paycheck this place will be out of business by the end of the year. It's sad too, because this was one of the first restaurants that caught my attention when we moved to the area, and I was so excited to have a high-quality Afghani restaurant right by our house. Now... so sad."], ["Cheuk K.", "I ordered a mixed gyro platter for pick up here, and it was done in 10 minutes. I only went into the store briefly to pick up my order, but the owner warmly greeted me and he was very friendly. There was a sign on the cash register that says $10 minimum for credit cards, but the owner lets me use my card anyway even though my order was only ~$9.50. Very good customer service.Overall, the platter was delicious, and there's plenty of food. The meats were tender, and the rice was cooked just right. The white sauce was very tasty and tied the dish together. I wish the platter came with more sauce. The only thing I didn't like was that the bread was too hard/tough as if it's been sitting out for a while. Another thing is that these platters are very greasy (though delicious) and you probably shouldn't come here if you were trying to lose some pounds. I ate the meal at 8pm, and I still feel stuffed at 1:30am! This is a good place in the area to get some Mediterranean food."], ["Jebs M.", "This place is such a disappointment!! After reading all the great reviews we decided to come here for lunch and I really wish we hadn't!! I ordered the mixed gyro platter, the rice was so dry, chicken and lamb were also dry! My fiance ordered kabob special and said the same thing..everything was dry! We know our Greek food and middle eastern food and this place left a bad taste in our mouth!!  We left pissed off! Do yourself a favor and skip this place."], ["Sean W.", "Ordered over $45 in food two Gyros, a beef kabob etc. and the food was horrible. The beef kabob was dry rolled ground beef. I wish I could get my money back."], ["Memo M.", "This time I get mix shawarma It's really good ..."], ["Fran B.", "We have been coming to Kabob-e for over a year now. The food is always fantastic. The gyro platter is a must try. The hummus is always great, too. Quick service, and friendly owners."], ["Jennifer U.", "By far, the best hummus on the planet! By the time my gyro platter arrived, I had over indulged in warm pita and way too much hummus. Hello to go box! Hubby had the chicken gyro platter; the aromatic basmati was bursting with flavor and perfectly tender.We were thrilled with our meal and the impeccable service just iced the cake. The nicest, most courteous gentlemen checked in on us to make sure we were happy, and suggested sauces that I wish I could bottle up and bring home with me.We will definitely be back!"], ["Brenda R.", "Geesh I feel like I write reviews on a lot of food places. But this place is another one that deserves one. Food is absolutely delicious. I love food that comes from different cultures and this one captures the taste of middle east. The place doesn't represent the food well so it's more of a quick eat or to go spot. But deff. Worth trying especially if you love gyros."], ["Virginia M.", "I stopped in here for lunch the other day and ordered the chicken Shawarma and chick pea korma with pita bread. I enjoyed everything! The place was packed when I came in, so that is a good sign. You can tell that they make everything to order. I would return!"], ["Christina G.", "Service is always super friendly and helpful. Food is also delicious as always, and presented just like the pictures."], ["Jon O.", "I have been looking for a great gyro spot for a good minute. I happen to be driving down Beach like I do nearly everyday and caught the sign out the side of my eye. Pulled over and BAMM!!! I found this great hidden treasure! The gyro platter was amazing! It's basically an open faced gyro on top of a bed of basmati rice! It was simply delicious! I can't wait to try some of their other treats including the baklava."], ["Jerry T.", "I should really come back and try some of the kabobs, but the reason for my stop at Kabob-E was the gyro. There aren't many places to find those whirling meat torpedoes in this bold city, but Kabob-E makes a really good one.I stopped by at dinner after a long day at the office. Nothing brightens my day quite like the smell of fat crisping away in front of a broiler. I ordered a gyro with fries and a bottle of water, which came out to 8 bucks and change. I watched as the cook carved away a ton of gyro meat for me, and assembled everything on a freshly griddled pita.Kabob-E is not shy with their meat(!) and I was really happy with the amount of protein stacked on this bad boy. The gyro was piled high with lettuce, tomato, thinly sliced onions and a delicious tzatziki sauce. The tzatziki was a little thin, but overall the gyro was very good.It came out atop a mound of piping hot french fries. They were just crinkle cut french fries but they were tasty. I'd like to think I'll come try some of the other items, but I know that I'll never be able to say no to the gyros when I walk in."], ["Miss C.", "Perfectly courteous and attentive customer service. Super tasty food (I had the gyro platter over rice - delicious!!!)Very clean placeDefinitely recommend it!! If you haven't been, you must go!"], ["Amanda I.", "I lived in Sweden for six months and absolutely fell in love with its Kebabtallrik. Literally translated to kebob plate; French fries topped with kebab meat, lettuce, tomato, onion, pepper, red and white sauce. I must have gained 50 pounds from eating this 4 times a week.  I have looked everywhere, in the states and other places in Europe for this elusive delicacy to no avail. I drive past Kebob-e daily on my way to/from work and have been meaning to stop in. Today I did.So, here I am devouring my gyro platter with a side of fries. Phenomenal. Meat is perfect, white sauce is exactly as I remember it, and the rice is a really good compliment.  Owners were also so nice and friendly!Not quite my Svenska Kebabtallrik, but I'm going to have to up my workout routine because this place will definitely become a staple of my diet."], ["Amanda A.", "This place is wonderful! I have food allergies that don't allow me to eat peppers and whenever I called to order they know my voice ( shows how many times I order :-)  and say no peppers right? :-)They're wonderful people working here ....and as someone that's going to cancer treatment it's nice to have great food with great people at great prices that's close and that's absolutely delicious. . Their chicken kebab with brown rice is absolutely amazing and their salads are always super fresh. Also they have this dessert called firni, that is absolutely jaw dropping delicious... It is  something I crave after treatment and could eat it everyday... But all their desserts are great. Give this place a try, you'll become a regular :-)"], ["Ale G.", "Delicious and very authentic. Owner recommended her 2 favorite dishes, the beef kabob platter and the mixed gyro platter, both were great! Highly recommend everyone try this place!"], ["Patricia L.", "I've gotten the three stews as a platter every time and it's so delicious I haven't been able to order anything else! My husband raved about his gyro, this food is very high quality."], ["Hyder A.", "A local favorite,  love this afghani cafe, the simplicity and dedication of the management, and the food is excellent. One of the better shawarma places I've seen in the area. Floored by the hummus and falafel combo. I have yet to try all the items in the menu,  but based on what I've sampled so far, I am looking forward to it. Great job!!"]], "Mandaloun": [["Tammera S.", "****** RESPONSE*********Sir, I love when management responds to reviewers. Yes, it was my first time. Mom and I are in Jacksonville often. Yes, I absolutely will try your restaurant again.Thank you!The 5 stars are for you responding."], ["Mylon P.", "Order: Side of hummus, and two chicken gyros with a side of lentil soupPrice: about $30Pros: Absolutely THE BEST tapas (hummus, grape leaves and falafel specifically), their Turkish coffee is amazing, they have wonderful outside seating, they happen to be in the same center as a different phenomenal coffee shopCons: The \"normal\" Greek food is only \"good\", sometimes the service can be pretty slow (especially sitting outside), lot of people do smoke outside towards that coffee shop so if you're sensitive then sit insideThoughts: I absolutely love the hummus here, it is easily the best I've ever had (short of this place in Tobago). In fact all of their tapas are phenomenal but I'm a particular fan of their hummus and grape leaves, they just do it so well. On top of that their Turkish coffee....oh my god....so stinking good. Top this all off with outdoor seating and this is a favorite spot to hangout for a while with tapas, friends and coffee.Unfortunately I've had several different entrees and none of them hit quite the same level of awesomeness as their tapas. It's not that its bad, it's just that I always end up thinking I should have just gotten more hummus. I'll also say that while I love outside seating the people at the coffee shop further down the way tend to smoke a lot so if you're allergic you may want to sit inside.Ultimately this place is AMAZING for tapas, and you should definitely go...just order more tapas rather than more food."], ["Alyssa P.", "We dined in around 4:30 or so think we were the only table there.  Ordered the hummus, calamari, and Chicken Kabob.Hummus - was ok; definitely not the best. The pita was really good and tasted homemade. Calamari - my daughter liked it a lot bc she said the batter tasted like mozzarella stick batter. I agree on the batter taste. Texture was chewy and sauce tasted like salsa, not marinara. For nearly $10, I expected it to taste better with more pieces. Shish Taouk (Chicken Kabob) - Dish was colorful, veggies cooked perfectly. Chicken pieces very tender and flavorful. They also removed the pieces from the skewers which made it effortless to eat. I can make very similar kabobs at home so for almost $15 I feel it's over priced and besides it's just chicken. The dish price is comparable with an entrée that contains seafood. Service was fine lol since we were the only table there."], ["Angelo K.", "Food is good. Server smells like a bottle of VODKANever stop by to the table HORRIBLE. Giving 2 stars beacuse of the Food. If they will fix the service this place will rock n roll!!!"], ["George I.", "My first time dining here was a delight. Both, my mother and brother, enjoyed this restaurant, as well. The service was exceptional, the food was remarkable! It has a fancy feel to it, a restaurant where you would have dinner and show at. We ordered the hummus, which was warmed up and served with pita (which our server kept refilling every 5 minutes)! It tasted a bit better than the hummus I usually purchase at Publix. Then we moved onto the main course. We ordered the mixed grill and beef and chicken shawarma. The mixed grill comes with 3 meats: beef, chicken, and lamb. We chose the seasoned potatoes on the side, which turned out to be exquisite. The meats in the shawarmas were excellently cooked and seasoned. I highly recommend this restaurant. It's a nice setting, excellent food, and you'll be thinking about it long after the meal is over."], ["Michael A.", "My first time at Mandaloun Mediterranean Cuisine was an overall positive experience. You really can't judge a book by the cover is the motto that I would use with this place. The outside appearance of the strip mall where this restaurant is located is deceiving because the inside decor is really well put together. The inside was very clean and nicely arranged. The ambiance created by red walls (#50shadesofgrey) mixed in with the fresh flowers at the table and slightly dimmed lights give a nice ROMANTIC vibe. I would really recommend this place for a date!The service that I experienced wasn't as pleasant as other reviewers may have experienced. My date and I went there around 8pm, and the restaurant wasn't too busy. But, I believe our waiter was maybe new or maybe they were short staffed at that time because the wait to get our order placed was pretty excessive (~20mins). There was also times where my glass of water stayed emptied for a period of time. HOWEVER, when the waiters were there, they were super friendly and nice. I would HIGHLY recommend the MIXED GRILL! Each one of the grilled meats were very TENDER and very well SPICED! If you are unsure of what to order, I would recommend this plate too because it gives you variety of different meats just in case you don't like one! I doubt that you wouldn't like any of them ;) The appetizer that I recommend is the COMBO PLATTER. You get to select different types of dips and items to use with your pita bread. I picked the Hummus ( very good! made from fresh chickpeas), Tabbouleh (very delicious-It was my favorite!!!), Labneh (tasted very fresh and it was some of the best that I've tasted), and Fatayer. I went on a Friday, so we got to enjoy a belly dancing show. The dancer was very good and interactive with the customers. She didn't seem to bother anyone by being able to see what customers wanted to interact with her. Very professional and good show. HANDS DOWN... YOU MUST TRY THE BAKLAVA!!! IT IS AMAZING!! I am not for sure if they make it freshly there, but it was the best tasting Baklava that I have EVER tasted!! I would highly recommend this place to anyone."], ["Jesse C.", "The owner was friendly but I guess they had to be. Food was great but kinda expensive for me $24 for 4 pieces of tiny 3in lamb chops.. Would be back for special occasions. Be careful when you change your sides within 2-3 minutes they'll still charge you even if the item has not come out of the kitchen :-) but if they mess up they make it up."], ["Sonia T.", "The food was great! I wasn't excited about the falafel but at least I can say I tried it. The hummus was the best hummus I've ever had. I was hoping the Fatayer was similar to a Spanikopita but it wasn't. It was ok. The service was superb and the main entree was perfection. The ambiance inside of the restaurant is very relaxing and welcoming. There were multiple door stop delivery people picking up orders there so I knew the food had to be worth it. The salmon was full of flavor and not overcooked. The vegetables and potatoes were perfect. The yellow rice had a lot of flavor but I like the potatoes over the rice. The mixed grill was tender but next time I'll order two chicken kabobs instead of the lamb. We usually love lamb but the minced lamb wasn't my favorite. The next time we're hoping to try a dessert."], ["Steve G.", "My wife and I have been here several time in the last few months.... for both dinner and the lunch buffet. It is my Top 5 list of favorite restaurants in JAX. We almost always get the Grand Mezze...  it's $60 for 2.... but OMG.... so much GOOD food... there is plenty to take home. And all the things you get in the Grand Mezze are great as left overs. The food is ALWAYS fresh.... you can tell. And the owner Pierre is ALWAYS walking the room making you feel so welcome. Service is great. The prices are good for what you get. One dish I tried on our last visits was their version of moussaka.... and they make it in a Lebanese tradition, which is different than what you will normally fin d at a Greek restaurant. It was amazing! Pierre will \"custom\" make pretty much make whatever you ask. For instance, my daughter is Glutton Free... and he made several 'refinements' to a dish she wanted to try... all with glutton free ingredients. He even had half way decent glutton free bread he served in a separate basket. Please do not let the (what I think) unattractive exterior of the building deter you from giving Pierre and the Mandaloun restaurant a try. You will be happy you did. As a side note... I like to walk next door and get a cup of after dinner coffee from the little cafe to the left of Mandaloun. Great coffee drinks, and its small and independently owned."], ["Vanessa T.", "Went here for dinner, we have been a few times and I really love the food, actually the whole experience.  Its tucked into a strip mall off Baymeadows the inside is decorated nicely.  The owner is always there walking around talking to people, making sure you like everything.  I think on fri and sat nights they have a belly dancer also.Now to the food.........its all so good!  We started with an appetizer of the combo plate where you could pick 4 different apps.......there are alot of options in the appetizer area, cold, hot, baked, salads, they have names that are probably unfamiliar also so best bet is to ask server to help in this area, but the combo plates are great to sample a few things.....we got meat pies, cheese/spinach pie, kibbe, and Fatoosh.....WOW everything soooooo good!  I really love the Fatoosh Salad, its a salad with toasted pita mixed in, its just so good....my husband who is a picky eater really liked all the apps.The entrees:  we got  Mixed Grill, which is three kabobs (lamb, beef, and chicken) and a side ( rice, potato, veggies)....the meat was marinated and cooked perfect.  Just perfect!!We also got the grouper which was in a lemon butter sauce...we both didnt really  like this too much, too lemony for our taste.We left stuffed and happy!"], ["Michael C.", "Located in a busy but non descript shopping center, this is an authentic Mediterranean spot in the middle of suburban hell.Lunch time offers a substantial buffet with several main entrees along with plenty of side dishes and a few deserts. The menu, which is available for lunch and dinner, runs the gamut of expected meals and of the several we tried, all were good.Service was friendly and competent and the owner came out to great several tables which we felt was a nice touch."], ["Brian S.", "It is hard to write a review about this place without writing something as long as War and Peace, so I will try to keep it brief.I came in thanks to Groupon, and was blown away by this place!  It is a great date spot (and one that I have in my arsenal to use soon), or just for a casual dinner.  Their wine selection was okay, but the food is the star.  Tabbouleh, homemade hummus, and/or grape leaves are the way to start, and everything after that is guaranteed to be a winner.  They even have non-Mediterranean dishes (like Chicken Cordon Bleu) for those who are not excited by exotic/delicious food.Stop in and prepare to be impressed!"], ["Rasha A.", "Terrible experience, I am not sure why people love this place! I bet it used to be much better than it is now because the food was so terrible I could not eat anything I ordered. On a good note, the desserts were actually good and were served to us on the house to make up for the very bad service and this is why I give it 2 stars."], ["Lynn P.", "We walked in with great music and belly dancer. Not the greatest service. We waited for a while for someone to come and give us water and took our orders. We waited a while for them to come and take our order for desserts so we decided not to get any. The food was edible. We got grape leaves and we were not able to eat it. Not sure how it was suppose to taste but I was so sour we  couldn't take another bite. I got the beef kabob and it tasted like any other beef. Nothing really special about this dish. My friend got chicken kabob and it was ok. We did however enjoyed the culture music and dancing."], ["Jenna G.", "They have the best hummus ever. It's a good Lebanese restaurant, not the best I've ever been but it's very good, especially for Jacksonville. Very child friendly which is great for my husband and I."], ["Anna H.", "Wow what a knock out time we had last night at Mandaloun. The usual suspects  (9 of us) assembled to test out the food flavors from Lebanon.  I can assure everyone this is far and beyond the usual \" Mediterranean\" food I have found in Jacksonville.  After we were seated our person of the night Casey served us water and quickly brought us Pita with dipping oil for the table.  The bread was fresh, warm and the oil light and salty on the tongue.  Just about that time Chief Pierre introduced himself to us, inquired if we had any questions about the menu and suggested we may allow him to put together a combination of many items family style for the group.  I found this a brilliant move since many of the diners had never experienced this cuisine before but it was voted down.  There are so many wonderful choices on the menu I was willing to let him decide.  I started with the Foul Madames a delightful combination of  Fava beans specially prepared with garlic olive oil and lemon juice.  This warm dish brought out all the flavors of the Fava beans @ $8.50 there was enough for everyone to taste test and still have extra.  Others on the line up for Mezz were the Falafel (6 pieces)   Crispy deep fried of ground chickpeas, broad beans, herbs, spices and tomato. Served with 1 side of tahini. Again perfect in every way and we shared. Hummus, Tabbouleh, Baba Ghanoush. and Grape Leaves we were all in, the the dishes were flying around the table to groans of delight.  When it came time for the entrees one of the owners assisted us in our decision, pronouncing the dish as it should be, explaining the heat, taste and flavors of what we were selecting.  This made life easy, what was not easy was the actual decision.  But here we go.  I am not going to bore you with all the ingredients, that way if this review sparks you go and try it.  Just know that nothing was left, there were 9 separate dishes and several converts to this particular restaurant if not the food.  Outstand dishes the Lamb, Veggies grilled, Beef Shawarma, and Mixed Grill.  Rice served with the entrees was probably the best tasting rice in any restaurant I have tried here.  Pierre continued to check on us through out the meal, which is pretty extraordinary.  Some brave souls ordered dessert to go.  I did ask it they could put together a small sampling of the dessert menu for us to share and they accommodated us immediately. This type of service is common in Europe and the Middle East not so much here in Jacksonville, so another 5 stars.  We were presented with 2 plates of traditional food stuff,  Baklava, Maamoul, Rice Pudding made with Rose Water,  what a new taste treat and Layally Beirut.  I was happy they did not serve the Tiramisu.  Is that on every menu in the world?  This is definitely a go back to restaurant.  Look at the website, get a group of good friends together and set off to be impressed."], ["Maggie O.", "Hummus is great and the wait staff was amazing.Didn't care for the sauce on the chicken Schwarma though. Nice quiet atmosphere."], ["Erika B.", "My husband and I went here for date night because I scored a $25 restaurant.com giftcard for $3. We were a little confused as we were walking in because it appeared that there was a DJ set up at the end of the sidewalk near the end of the building. Um, club Baymeadows anyone? We went in around 8:30pm, seated immediately but had to wait about 10 minutes before we were acknowledged for a drink order. After that, our service was vastly improved. We had two appetizers, the grape leaves and the spicy lamb sausage. Both were amazing. I opted for the mixed grill and my husband went with the fried fish. Both dishes came out fresh and extremely tasty. It was a fabulous atmosphere for a date night and we will definitely be returning! (Although, still extremely confused by the DJ and young kids all hanging out in front)"], ["Fina L.", "I asked the lady server if they have mussels and she walked off stating \"I don't know' Yes the service sucks, 6 king prawns medium size are ok but not worth $18...I finished my prawns with pieces of carrots & zucchini ...they forgot to serve my salad, they must serve salad asDessert...would not recommend!!!"], ["Sheldon M.", "The food was great. The ambience was nice. The evening entertainment (belly dancer) was a pleasant surprise. This is my first time there and had a great time with friends as I celebrated my birthday. Great experience and recommend for a couples date night or a small group gathering."]], "The Tent Hookah Lounge": [], "Hovan Gourmet Mediterranean Restaurant": [["Nicholas G.", "My two friends and I were in Jacksonville from San Francisco  for a conference staying by the Jacksonville landing. We decided to go out one night to and happened to come across this place prior to going out. This was by far the best meal we had during our entire five night stay. The food here so flavorful and reasonably priced. The three of us ordered a platter with four appetizers and when we asked to order more the very cute and funny server told us that we already were ordering a lot of food. We did not take her advice and ordered two entrees to share. Needless to say we ended up taking two full take out boxes of leftovers with us to the bar. This place has great food, reasonable prices and amazing customer service. The wine was priced affordably too! If I ever return to Jacksonville I would definitely return here."], ["Katie C.", "Thus begins my reviewing spree of restaurants in my new neighborhood! After hearing great things from numerous people about Hovan, I decided to check it out for lunch today. Falafel, gyros, grapeleaves, I'm a fan of it all, and Hovan delivers in an authentic and no-frills way. My lunch buddy and I arrived and stepped up to the counter to make our picks. My eyes were greeted by a bevvy of sides like hummus, tabouli, babaganoush and fresh fruit. I went with a Falafel Sandwich combo with tabouli and grapeleaves. My food was ready by the time I was done paying (a very reasonable $9!) and we headed outside to snag a table. The weather was fabulous and the leaves were falling on the bustling 5 points corner, making it feel more like a warm day in September despite the fact that we're inching into December. The falafel was crisp on the outside and flavorful, soft and warm on the inside, just as it should be. The tabouli was refreshing and crunchy, and I guess the grapeleaves were good, but I really just need to admit to myself that I don't like grapeleaves and stop ordering them. They just look so good! But yeah, they were acidic and mushy as usual, so I guess that means they were made well? All in all, the experience at Hovan was great. This is a place I've driven by a thousand times, and I'm so glad I finally went in and enjoyed it for myself. I'd highly recommend the falafel and a table on the patio to anyone interested in trying this spot out!"], ["Jim B.", "Delicious catering for our daughter's 1st birthday. Very easy to work with the friendly folks at Hovan. We got more compliments on the Hovan food than some of our more expensive catering ventures! Only wish we had more leftovers for clean up the next day."], ["Edward J.", "Good stuff"], ["Kim W.", "While doing a little shopping in the area, we found ourselves hungry. I checked this place out on Yelp, and the Yelpers were right. This place is great. I tried the falafel with some hummus on the side. It has to be the best falafel I have ever had. It is crispy on the outside and light and fluffy inside. So many are hard as rocks. A delicious lunch awaits you."], ["Mae M.", "We were told to check out 5 points because it was a tourist attraction.  We were hungry, so Anna and I checked this place out.  We actually just passed up a gelato place and decided to check this out because it didn't look totally deserted like the other restaurants around the area.  It's a small place, with some really friendly people.  I got the gyro plate combo (with 2 sides), and Anna got the grape leaves combo.  We chose the same sides - chick peas hummus and egg plant hummus.  They were both good.The service was superb.  They were very friendly and attentive.  They got our food out to us right away.  I'm a slow eater, but I managed to scarf my food down immediately.  It was that tasty!  The hummus (which came with a little bag of pita chips) was to die for!  I enjoyed my plate.We were actually in Jacksonville on business, and had to have a conference call in the middle of our meal.  The music inside was too loud so we asked the server to watch our belongings while we did our call in the outside patio of the restaurant.  They were really courteous and even cleaned our area up while we were working. If I ever return to Jacksonville, I will definitely pay this place a visit.  I totally loved it!"], ["David B.", "Mediocre food at a high price. Go to the Casbah if you want to eat Mediterranean food worth swallowing."], ["Hilary L.", "Good Mediterranean food is one of my favorite things and Hovan delivers.  Its a perfect place to go for lunch because the food is fresh, quick and affordable. I usually go for the Falafel Wrap meal [the falafel is always crisp and tasty], which comes with a choice of sides.   The hummus is a must-have for me, and its often the craving that gets me in here.  Hovan's hummus and baba ganoush is a little more acidic and tangy than most places in town and that suits me fine.  Make sure to save a little for an afternoon snack.The atmosphere is a little awkward on the inside, with most of the seating crammed along the side of the wall [essentially in a hallway] or all the way behind the kitchen, but the outdoor seating is great! It looks out over Five Points Point and you will definitely witness some interesting characters and clumsy drivers navigating the miniature roundabout.Healthy and priced right, this is the kind of treat you can afford both physically and financially."], ["Sharon Y. C.", "We just ate at Hovan last night. It's never crowded and always very good food and service. Very reasonably priced wine and beer. I really like their hummus and taboulli. My hubby usually has the lamb kabobs. Prices in general are very reasonable and we recommend it to friends who want a casual Greek meal."], ["Hunter B.", "I love dolmades/dolmathes and a good gyro. And now I also love Hovan Mediterranean Gourmet, because they did such a fine job with both of them. I'd like to return the favor with a very strong three stars. I'd give it four, but Hovan isn't an amazing place just shy of outstanding, five-star eateries (13Gypsies or Tento, for instance). The interior is all about plastic tablecloths and paper napkins; our sandwiches came in plastic baskets. It's like a fast-food joint with local art inspired by the Mediterranean. Actually, according to their website, Hovan is a small franchise chain found throughout the southeast that began in Atlanta. Thanks, Atlanta.Lackluster interior aside, Hovan puts together a fine meal, serves it up fast, and barely dents your wallet. That's why it should probably get four stars for knowing what it is and doing it quite well.I've had some nasty dolmades (looking at you, 3rd Street Diner -- how can you coat them with Hollandaise sauce?!?) and some amazing ones (Saad's in West Philly -- why didn't he start franchising?). The LDC and I agreed that Hovan's dolmades fell near the higher end of the scale. The tzaziki sauce had plenty of pep and wasn't as lifeless as it can be at many places. LDC's lentil soup was thick and yummy. She also loved her vegan Hovan Roll with hummus and tabbouli salad. My gyro was excellent. The meat was tangy, the sandwich arrived nice and hot, and the salad was fresh. Topped it off with a $3 Shock Top beer. Prices are reasonable compared to similar places.Hovan also has some shaded outdoor tables that seemed perfect for a sunny day lunch or dinner. A fine choice in Five Points. Recommended."], ["Matt A.", "This place was pretty good. I was a bit surprised at the prices, but the gal steered me towards a sandwhich that was in my price range. It was pretty good."], ["R. G.", "I've been here a few times and here's my overall opinion of this place.  It is alright but not noteworthy.  I'll go back to it, but I just wish a few things were different.      Pros:-They have some healthy options on the menu.-Good place to eat if you are a vegetarian or with a vegetarian.-Side salads are a good size and consist of romaine lettuce and several veggies.-They have a nice outdoor seating area that faces 5-points intersection and is great for people watching.Cons:-They seem a bit overpriced at $7 for a falafel or gyro sandwich (without sides).-The gyro meat is sliced very thin and the other toppings in the sandwich seemed to overpower the flavor of the meat.  -The lentil soup is watery and lacks enough spice.  -The service can be somewhat slow so if you are eating on a work lunch break and are short on time, get the food to go or you may be sitting for a little while waiting for your bill."], ["Andrea R.", "I get the same thing every time I come here.  I should probably switch it up, but the gyro is just too good to pass up.  I get it as a combo with Mediterranean salad and hummus.  The gyro wrap is enormous and half of it can easily serve as a meal.  The Mediterranean salad is chock-full of tomatoes, cucumbers, and olives.  I don't normally enjoy cucumbers but I love them in this salad.  The hummus is spot-on and is a far cry from any store-bought version.  The pita chips are nothing special, but I'll give it some credit for helping me consume the hummus!  The baklava is no different that what I've had in other places.  It is a messy thing to eat and is guaranteed to stick to the roof of your mouth, but it's delicious!  To maximize your experience, go on a day when you can comfortably sit outside and people-watch."], ["Dan M.", "I had the hummus and the falafel sandwich here, and they were great and vegan friendly.  My husband had the moussaka, and I have never seen him eat so much short of Thanksgiving dinner in my life.  I highly recommend trying out this place.  Although all food is not created equal here (my husband's meal was better than mine),  it is worth coming here to find something you may like."], ["Nara W.", "Excellent service, a tasty Mediterranean salad that was crisp and refreshing, surprisingly flavorful lentil soup, and it didn't break the bank.  Baklava seemed the standard store-bought, but overall this place has firmly made it into my list of dependably good five points eateries.  I'm looking forward to returning!"]], "Istanbul Grille": [["Thomas C.", "Lunch with a friend. Place could use an upgrade in furnishings but food looks and smells authentic. Service was satisfactory and will definitely stop by their hookah bar to try out later."], ["Mima M.", "We went on a Sunday, not knowing they had a lunch buffet, and went for that. The food was really good. The buffet was around $15 so it was pricey for a family, but the food was delicious. Will go back sometime for a weekday lunch buffet, which apparently is half the price."], ["Christine C.", "Never ate Mediterranean before, but this place was awesome. Nothing frozen, friendly service and interesting eats (at least for me). Would definitely go again!"], ["Jean G.", "Wow!!  What a treat. Fresh, fresh and delicious. Not ONE offering on buffet was debatable. So good!!!!!!  I stopped for lunch to sample and ended up with two plates. Nice cold Corona with lunch. Fresh turkish coffee for dessert. Couldn't even find room for sweets. Of NITE, I was greeted my a smiling face who gave me a tour of buffet. I'll return. And bring friends"], ["Elvin B.", "I came here for my first time yesterday. The food was excellent, but the service was kind of lacking. I'll try it again, as everyone has a bad dy."], ["Daija P.", "I stopped in there the other night just looking for a place to lounge and I remember I had this place bookmarked to try! I didn't get to try the food, I stuck to the hookah. The flavors to try were pretty standard, except for the alcoholic inspired flavors that seemed to blend well. (For example you could get a margarita or daiquiri flavored shisha). The staff was attentive, the music wasn't bad, and the overall atmosphere was laid back. I will make a comment that the belly dancer was a plus, but i agree with another reviewer before who said the music is just ridiculously loud when the belly dancer comes out...like i get it....you can turn that music down a tad hahaPop in and enjoy the atmosphere! The prices are pretty reasonable and it's a good way to lay back and kill a coupe of hours.3 stars because...well I just moved here from the middle east! what can i say, i've been spoiled overseas!"], ["Ernest H.", "I get the buffet EVERYTIME!!! I have had menu items, but most of the food is on the line ha ha. Their falafel and kebebe is fantastic. This is also a family friendly place."], ["James R.", "Good service, buffet was 10.99$, 2 sexy girls walked in during a slow day for them, no Hookahs on lunch buffet side, great food, and for the good variety of quality food for the price it could be a once a week maybe."], ["Caitlin M.", "The lunch buffet is great however the service is hit or miss and the music they play is too loud and terrible"], ["rebeca a.", "Amazing!!! Love Middle Eastern, especially Turkish and the food was DELICIOUS!!! Super nice and good service. The lunch buffet is a bargain!!"], ["DeeDee H.", "This place was suggested by a new friend, who had never been there!  Glad she suggested it because it was wonderful!Appearance wise, it looked a little worn but not trashy.  I'm thinking it could probably use a good once over.I've never had Mediterranean food before so I was a little unsure of what to get.  I read the menu over and decided on the Urfa, spicy beef, in a wrap.  You can get it in a pita or a wrap.  It was deliciouso! It came with a side of fries, they were seasoned perfectly as well.  To my knowledge, everyone at the table was very happy with their food.  Three of them had the buffet.The server was very friendly, but she was kind of slow when it came to checking on us.  I sat with an empty glass for about 15 minutes!  When she finally came to refill it, she brought it back with soda. I had water, originally.  One of the other ladies at the table called the server over and had her switch it out for me.  Kinda weird because nobody at our table ordered soda, so I'm not sure where she got that from.I got out of there spending $12, including tip.  So I'd say that was pretty fair!I will most definitely be back, next time with my honey bunny!"], ["Karly D.", "This used to be a favorite of mine.  The buffet was great; lots of items and yummy desserts.  But recently it has gone downhill.  The desserts are \"meh\" now and the service is just...bad.  It's like pulling teeth to get a refill.  The staff always appears to be more concerned about chatting it up near the register than taking care of customers.  I'm lucky if I get one refill and when I do I'm treated as if it's a huge inconvenience.  Then it takes forever to get the check. We have to keep flagging them down.  I really want the old experience back."], ["James T.", "The food is great. I would have given a higher rating but the service has declined somewhat lately."], ["Mama C.", "They must have changed owners again. My husband says it's the cook. This was my 3rd visit and my last. My first visit, a waitress basically talked about how bad the owner was in running the business. My entire meal was listening to this conversation between her and a family member. We were the only customers (early dinner) The food was good and even still the waitress was very helpful to us. I really like the rolled eggplant and a chicken/ mushroom/ cream dish. The baba ghanoush and hummus was also very good. Second visit, everything on the buffet was the same. There was an older man who spoke to my husband and his friend throughout the entire meal. Again, a different waitress kept up on our table. It was also a good experience. This last visit, not so much. The waitress kept up with clearing plates. There were three other tables besides us. The baba/ hummus and grape leaves were on par as my previous visits. The lentil soup seemed more watered down than before. The rice was on the mushy side. My favorite rolled eggplant- UGH. Now it is just eggplant and a sliver of cheese drowned in vegetable oil. Before, there was peppers and onions and olive oil. Now it's greasy, bland and yuck. The creamy chicken dish was not good either. More bland than before and soupy. The grilled veggies now how some sour ingredient added (lemon or citric acid, I don't know) but it was off putting and very sour. I did enjoy the spicy version of the grilled chicken breast though I must have gotten an old one because my first two were extremely good and the third was dried out like jerky. I didn't eat much at all because I could taste the differences in my last visit. I didn't enjoy anything. Except for the hot tea and the appetizers. I don't mind change, but when you expect certain things and then they are completely different- that's another story. The new cook/ owners aren't trying the food because it totally lacks flavor or care. Overcooked rice and bland everything else, I'm good. I'll go elsewhere next time or just wait for the holidays spent with my husband Arabic family. Also, the desserts have always been store bought- today they were also old as the baklava had no crisp at all."], ["Shell A.", "There's a bug zapper hanging on the wall right above the buffet tables. Enough said..."], ["Eric Y.", "Worst service ever at the Hookah lounge.... I've been for lunch 6 times and the resturant  has always been good but the Hookah bar staff was rude and lazy I will never go back or recommend"], ["Dennis C.", "Do not eat the buffet. It was horrible. We came for dinner and the service was bad the food was left out and stale. When I told the owner to put out fresh food he said oh sorry and did nothing. I will never go back again."], ["Larry B.", "So an update... our favorite place is no more,  at least not to us.  WAY too many bad restaurant inspection reports.  When you visit,  you can tell,  it's just not a clean place."], ["Mercedez V.", "I'm believe this was the best food I've ever had in my life. It was my first time ever trying mediterranean food before other than baba ghanoush so I kind of had it coming. Drove all the way from Fernandina to try this place because of the reviews and overall atmosphere that this place seemed to hold. We had the buffet and absolutely EVERYTHING was AMAZING. I wish they would've had a few different level-spiced sauces at the end of the bar that people could grab to up the heat but our server Kelly was more than happy to find something in the kitchen for us and it was great too. I had a Liquid Marijuana drink and it was so well mixed and delicious!!! Baklava to finish the evening off and I just can't even express how yum that was! Let me tell you this was the first time in a long time I felt like my meal was worth every dollar. Please ask for Kelly she was so hospitable. A real gem who understands customer service that I can't seem to find anywhere in Fernandina.  LOVE THIS PLACE"], ["Renda H.", "this is an update because the ownership has changed in the last year or less but they kept pretty much the same recipe so everything is still really good except for the falafel which was very dry the last two times I went...the buffet is $10.99 which is worth it even if it's lunchtime because it's very good. :-) definitely you should check it out"]], "The Olive Tree Mediterranean Grille": [["CB D.", "So effin' good..! The falafel here, is in fact, the best I've had. Today, I had the pleasure of the grilled shrimp :-D My coworkers were telling me about the food here for months now; I shouldn't have waited so long to get in here myself!"], ["Dean H.", "Greek salad with grilled chicken ... fresh and tasty.  Warm pita comes along side meditetanuan sides.Baklava crisp with just enough sweetness.   Turkish coffee well served.Friendly and helpful staff."], ["Ashley B.", "This looks like a hole in the wall place and as they advertise \"hookah\" from the outside, I was hesitant to enter for fear of smoke. There was no smoke however. It's a clean, plain-Jane, lil place. The good: The food is incredible. Tabbouleh is wonderful and full of fresh parsley and other herbs with just a bit of the cracked wheat. The hummus is smooth and just ever so slightly spicy with the after-taste. The falafels are dark on the outside with soft green (herbed) garbanzo filling. The potato salad has the slightest taste of mint and is very refreshing. The not so good: The pita left something to be desired, I think it's packaged out of a bag. I wish they served baba ganoush. The grape leaves are so-so. (This may be because I'm accustomed to having them served cold, but they heat them up here.)"], ["Annie F.", "Best fresh, fast delivery in San Marco! Never had a bad meal delivered which is hard to say for deliveries (nothing like soggy fries or cold pizza).  The chicken shawarma wrap, lentil soup, hummus, tabouli, gyro wrap and French fries are all tasty!  We'll continue to order delivery from here."], ["Anna-Marie W.", "The Olive Tree Mediterranean Grille sits south of downtown Jacksonville in the San Marco neighborhood.  Chad had eaten here before and liked it enough to take me.  We visited on a Friday afternoon, in between the lunch and dinner hour and they were still quite busy.  Besides their normal menu there is a blackboard at the entrance with a list of daily specials.I went with the Veggie Platter with falafel, spinach pie, veggie grape leaves, hummus and two sides.  I chose an extra side of hummus and the Mediterranean potato salad as my two sides.  It was a little pricey at almost $13 but it was a lot of food.My favorite part was the Veggie Grape Leaves with its tangy rice and spicy lemon flavor.The Hummus was delicious as well.  Creamy and spicy and served with a side of pita bread.The Mediterranean Potato Salad was good.  The addition of mint and lemon made it \"Mediterranean\" and it was quite tasty.  The potatoes weren't swimming in mayonnaise and it was seasoned very well.The Falafel was OK.  They were slightly dry but the side of tahini sauce made them a little better.Chad had ordered the Falafel Pita Platter.  Falafel was stuffed into pita bread and drizzled with a tahini sauce.  He also ordered hummus as one of his sides, the other was Mediterranean rice.We liked The Olive Tree.  It's nothing fancy.  It is more like a casual Greek sandwich shop with Gyros, Kiftah and Tabouleh.  This is the perfect place if you want something quick and authentic."], ["Jeniah J.", "I went here with coworkers. It was OK. The food wasn't exceptional. It wasn't bad either."], ["None T.", "I've been back three (or more) times since my first review. Food is lackluster and lacking the specialness I think it had when they first opened. They're not paying attention or purposely ignoring the quality of their food preparation.The oil they use for frying always taste old. The soups are over salty. They've lost their way.lklk"], ["Shawn M.", "I literally, seriously it started annoying my son, said a small \"Mmmm\" after almost every bite. The falafel platter with hummus and tabouli was great. I also had the pita with the chunks of the flavorful ground meat, I forget what it's called. My son had the blackened basa fish over a bed of tabouli. He said the fish was fantastic. I will be back. The people were very nice."], ["David T.", "Great good and EXCELLENT service from none other than the owner herself. The falafel was wonderful as was everything else. Highly recommended."], ["Rhea P.", "I don't understand all the hype about this place.  I have had better falafel. Mine was a little too dry actually.Sure it's friendly and casual, and the prices are great.  While it s filling, I can not say that it was mind blowing.  There's a superb place on university I much rather prefer."], ["John R.", "Great food, friendly service, no frills. If you want fresh food, skip the expensive places and come to what I would call \"the Middle Eastern family diner\". They have all the foods the other places have: kibbeh, falafel, etc.. The exception is that it's cheap, fast, and hot.  And the people who make it are friendly, another great plus.  No gimmicks, no hookah, no belly dancers, just great food at great prices. My one request would be that they open a little later, as I have to drive across town to eat there. If you read my my other reviews, you'll see that I can get quite harsh. Not this time!  We ate like kings!Give this little place a try."], ["Steven N.", "Super great food.. Good service,too. Prices are decent considering it's authentic Greek/Mediterranean food. I'd definitely eat there again..I got a gyro w a side of hummus and rice. All the food was pretty amazing:)"], ["Kurtesi N.", "Best Mediterranean food in town hands down . I had the falafel sandwich with a side of hummus and the Mediterranean rice . The falafel were really the best I have ever tasted you can taste the spices and it's served with a very nice home made sauce and they were fried perfectly , pita bread was nice and fresh also.  I had them at a few local spots here in jax but nothing compares. The rice I could tell was made fresh and I also liked that there was vegetables in it . Hummus very tasty and excellent texture . What made me happy the most was the service I got ordering and when I got my food very friendly family that owns it and will make sure you are satisfied . It's a must that you check it out !"], ["David B.", "Hands down the best falafel in town. I love this place and eat here multiple times per week. The falafel, lentil soup, and grape leaves are what I usually get, but I've never had a bad meal there. The family who owns it are extremely friendly and helpful and go out of their way to make sure you get what you want for your meal. If you are looking for good, affordable mediterranean food look no further than this local gem."], ["J J.", "Had the gyro platter which was rather bland overall. Also, the kibbeh appetizers were just okay. Overall, I'm not jumping at the bit to go back anytime soon."], ["Risa Y.", "You must go!! I tried Falafel Wrap with the side of Potato Salad and it was delicious. Only $7 and I was really satisfied. Staff were friendly, informative, and service was quick! I will be a regular if I lived here!"], ["Anna J.", "The Olive Tree is across the street from our office and is definitely an office favorite! The food is fairly priced, delicious and authentic, and the employees are very friendly. The restaurant itself is very casual (not the ambience you would be looking for on a date or anything), but its perfect for the quick lunch spot. The falafel is absolutely unbeatable -- the best falafel I've ever had! Additionally, you can alter the meals without any hassle from the employees (the side greek salad with chicken is almost as big as the large!). As far as greek restaurants go, they are very welcoming - not abrasive or rushing."], ["Abby A.", "Amazing Mediterranean food! I absolutely hate garlic and often have a difficult time eating Mediterranean food because of it. This is the first place I've been that has minimal garlic.Everything tastes fresh and homemade. The falafel was delicious and super crispy! I got the Mediterranean Chicken Sandwich and I would definitely order it again."], ["Don R.", "I have to say that my visit to day was a another lackluster one.  Is the food cheap, no.  Inexpensive?  Yes. The restaurant has a foul odor...a musty smell throughout.  I had the Mediterranean chicken pita with a side of hummus and fries.  Let's discuss these items from good to worse.  The french fries were hot and crispy with just the right amount of seasoning, so 5 stars on the fries.  The hummos was a good texture but relatively bland. It was moist with some olive oil and the pita bread served with it was cold and dry, so 3 stars on the hummus. The chicken pita was full of moist chicken with a flavorful seasoning.  Unfortunately, there was nothing else on the sandwich besides the seasoned chicken and the pita. If they were to add some traditional sauce, and maybe some mint, or lettuce and tomato, the sandwich would have been very good, but as it was served it's 2 plus stars for the moist chicken, bit total lack of cohesiveness as a sandwich. My husband loves taboulleh, hummus and grape leaves.  Unfortunately, taboulleh is not considered a side item as \"the cost of produce is up.\"  This is unfortunate as it just makes it more difficult for the customer to eat what they want without feeling stressed about ordering. Still, he ordered the grape leaves which were served hot and \"had an interesting texture\" with a side of hummus that received the same review as mine above. I have to admit that my greatest disappointment is to find yet another Mediterranean restaurant that has gyros with the bastardized gyro meat that is far removed from the traditional meat cut off the rotating skewer; like cheap lunch meat making a horrible gyro. I did not order it this time, but had it on my first visit and confirmed they still serve this inferior product (which is why I did not order).This is defintely an okay diner that serves passable food for the most part.  However, they could really be a little gem of San Marco if their food would reflect a little more passion and cohesiveness.  I'm still hoping for this place, but I'm unlikely to return."], ["Michael C.", "Basic sit down joint in the heart of San Marco. Loved the family that runs the place. Very clean. Wide variety of menu items. The homemade sauce was excellent, and my wife loved her falafel. I was only so-so with the shrimp I had, although my grape leaves were delicious."]], "Wafaa N Mike Cafe": []}