{"Los Portales Mexican Grill": [], "Tequila's Mexican Restaurant": [["Cletus ..", "Order the chimichangas with chicken, carnitas burrito, and a side of guacamole.  Not a single complaint - very mild on the heat (I like my food incredibly spicy, but was digging a mild night), great cheese, expected sides (beans and rice), and the guac was smashing (pun intended).Was crowded inside with a 20-25 minute wait, but no wait to eat outside.  As it was hella loud with kids and large tables inside, took them up on the no-wait option.  While there was a smoker part way through the meal, no impact on the quality of food or service.Would recommend!"], ["Shaina Y.", "I never actually have eaten here because I usually fall victim to the BOGO margs. The house margarita (rocks or frozen) give me life and everyone should get them. Side note- chips and salsa are pretty tasty"], ["Gregg K.", "Really good food at a great price. Beers are always 2 for 1.Tacos are fantastic, and the chicken fajitas were one of the best I've had.Also really good queso. Only complaint was server was not very attentive once the food came out.But we will be back."], ["Jeniah J.", "This restaurant has friendly staff, reasonable prices, a large selection of drinks, and great food. There are several televisions around the bar area in case you want to go somewhere where your date will ignore you because he's watching the game. I ran in here unplanned one evening out with a friend and coworker and really enjoyed the food and atmosphere."], ["Meg H.", "Very Quick!I had the steak quesadilla and it was pretty good, but pretty small.The queso was really really good, and the salsa was quite spicy!Fiance had a margarita and said it was quite good.Service was kind of blah, but the queso and margs were good!"], ["Janel B.", "Came here on the recommendation of a friend I'm from Texas was told tex me style.. was solid not the best but solid and great drink specials...had fajitas. .will try something else before any final recommendation"], ["Federico L.", "I enjoy much this restaurant. I have dinner at least once a month. I always order Panzon Burrito, my favorite.  Is a delicious pork burrito. The best thing about this restaurant is that they always gave Margaritas 2 for 1.Last friday this place was completely full. Despite that, service was fast."], ["Drew A.", "Absolutely delicious food. The portions are extremely generous and excellent quality. I went with the Enchiladas Suizas which is a chicken enchilada, beef enchilada, and cheese enchilada. Their salsa is full of flavor and just the right spice. Prices are slightly higher than others but that's offset by the portions. Muy bueno, Tequilas!"], ["Julie M.", "2 for 1 Margaritas, need I say more?In case you are not convinced, I was skeptical about eating Mexican food in Florida while traveling here from Texas, but this was close to a good thing.  The Salsa and Queso were both very tasty.  I would visit again."], ["Morgan H.", "I'm a big fan of this place. It's fun! They have great service! And the drink prices are on point!On Saturday nights, one of the servers actually sings all night (it's karaoke) and he alternates b/n Spanish songs and English ones and he is really entertaining. I have only had the Queso Fundido as far as food goes, but it was also delicious!I know the new trendy taco locations are all the rage right now, but if you're looking for a good old fashioned Mexican restaurant then you should definitely hit up Tequilas!"], ["Kristina K.", "Today when my boss asked if I wanted to do Mexican food for lunch, I practically shouted \"YES!\" She introduced me to Tequila's. I had the shrimp burrito. I've never had shrimp in a burrito so I was intrigued. It came covered in what they called chipotle sauce (not spicy!), sour cream, lettuce, and tomatoes with rice and beans on the side. It was very tasty and the serving was quite large. After the chips and salsa they started us with, I didn't come anywhere near cleaning my plate. The decor is nice, very clean. The service was fine, nothing special. A nice alternative spot for some fast Mexican food that isn't  La Nop. I'll be coming back for sure!"], ["Nicole T.", "Great food, great service, & great atmosphere! My friend is a regular here, so every time I'm in town we make it a point to stop. The 2-for-1 house margaritas are a steal, and the queso is delish!"], ["Kelly M.", "Honestly, the best quesadilla I've ever eaten.  Maybe because it was grilled on both sides, or because it was completely packed with steak and cheese goodness inside, or both.  The food was very fresh and the staff is very friendly.  Our food was delivered to us within 10 min. I'll be craving this food soon."], ["Marie F.", "Beautiful restaurant. Awesome attentive staff. Great margaritas that paired with the common chips and salsa. I was feeling buzzed off my first drink - I have no tolerance - but I know a good drink when I start seeing double. Everyone enjoyed their food. I especially enjoyed my meal because I was finally was able to check something off my Yelp's 10 Firsts list and try the Chile Relleno - loved it. But I wish it was offered alone. They had it paired with a burrito and an enchilada and no surprise it was just too much food for a late Friday night. But who would ever pass up left overs?I asked a server if they had live performers or dancing offered throughout the week. He said on occasion the restaurant does cater to those extra (normally on the weekends) but they still keep pretty limited hours. Either way good food, good drinks, and good prices with good people makes for a great night."], ["Imraan S.", "Place fucking sucks. Zero service, waiter doesn't know jack shit. Got up and left. And of all 8 people there, no one had food. DONT WASTE YOUR TIME!"], ["a d.", "Came back again several times, always consistant. Shrimp burrito is loaded with shrimp and flavor. Chips are good, love the hot spicy salsa. You have to ask for it."], ["Crystal G.", "I've been to Tequila's a few times but this is my first time eating here. I ordered the Fajita Quesadillas and they were delicious! 2-4-1 margaritas and bottled beer, all day everyday. We also got the queso fundido and it was amazing. Definitely coming back here!"], ["Kalvin K.", "Absolutely amazing. The restaurant was busy even during the early evening hours on a weekday. There is tremendous value with the menu here. The portions are extremely large for the price. I paid about $15 for a steak fajita and a side of guacamole that could easily feed two!They accept American Express as well!"], ["Susan K.", "This place is awesome! We live close and eat here once a week. The staff is super friendly. We always order the #10. Taco, burrito, and enchilada combo. We eat an 'early dinner' since the portions are generous. I like the white meat chicken. Some places cut cornerswith dark meat. Food comes out quick so let them know if you want to chill and eat their super thin and warm taco chips. Salsa is perfect. Fresh. We sit at the bar and chat with the staff who knows us very well! Keep up the excellent service and food !Oh and $2.25 for an ice cold Corona! Love Tequilas."], ["Michael G.", "If you want great food at a great price with friendly and prompt service, you will go to Tequilas. We have always left satisfied."]], "Burrito Gallery": [["Larry W.", "While at One Spark ... we went by a table and listened to their presentation and was told if we voted while standing there we could get a cup of free beer from this restaurant. We voted and got our tickets ..worked out 4 me because my lady doesn't drink beer! The scenery was nice while we didn't eat we looked over the menu took one home and plan to be back."], ["Vashone H.", "Oh My Gosh!!!! How can something so good be hidden like this!? You are missing a true jem if you pass this place by. Don't make the mistake."], ["Josh G.", "Played in town at Burro Bar. Excellent food and staff. A must try. Do the carnitas for sure."], ["James D.", "Consistently on-point burritos. The difference between Burrito Gallery and the chain joints is local ownership. Support local business. It's a fun place to grab a bite to eat, and they're open late. They have a side bar with a back patio and sometimes have live music. The cajun fish burrito and curry chicken burritos are some of my favorites. I'll always eat here over Moes or etc, it's better quality and it's local."], ["Ct W.", "I normally do not give 4Stars freely but this was a fun and tasty little joint. Erin, the bartender, was super friendly and made great suggestions. Our party had fish tacos, shrimp tacos, chicken curry tacos and steak tacos. All food was very good and out quickly."], ["Corey D.", "The teriyaki tofu burrito is the best thing to eat in downtown Jacksonville and the ambience is great as well! Definitely one of my favorite eateries in Jax."], ["Thomas C.", "Burrito Gallery is like an old friend that never lets you down in a time of need, but never surprises you with club seats to the Jags game, either. They know what they do and they do a pretty good job doing it. Their burritos are tasty and well seasoned and there are many options to make it your own. Their salsa and sauces can be hit or miss depending on who makes it that day, but normally they are pretty good. Sometimes I wish it was a bit spicier, but that's just me. Chips are always freshly made and well salted.Burrito Gallery is a neat place nestled in downtown that is big on supporting local artists. Their prices are fair, if not a little high, but food quality is good. The fish tacos are always a safe bet. If you haven't been to Burrito Gallery, check it out. It's worth the short walk if you're already downtown or plan to be down there. But it's probably not worth making a special trip just to eat there."], ["David P.", "Wow wow wow! Extremely tasty! Got a large steak burrito and som BG nachos really good food and the service was good as well! Good thing I'm not a local or I would be 500lbs ratting here everyday."], ["H M.", "Food is delicious, I ordered two tacos one with chicken, one with steak. But we're very good, came with chips as a side. But you do have to pay for any guac or salsa to go with your chips. Definitely somewhere to come back too! And their guacamole is the best I've had! I think I'll go for a burrito next time, more food and same price!"], ["Amy L.", "I am a fan of this local, easy atmosphere taco spot. The food is great - fresh ingredients, good flavor combinations, reasonable portions, and consistent presentation. You order at a counter then find a place to sit - if it's peak hours that might be a bit challenging, but the type of people who frequent this place seem more than willing to share a table. Also during peak there might be a shortage of clean tables because they are customer-bussed. But the atmosphere is nice, there's a bar for some adult beverage, and, again, the food is on point."], ["Sunny P.", "Food is always on point I love the tempeh tacos. Erin D makes the best drinks and is always a babe."], ["Michelle M.", "Fresh, filling and oh so good. The soft taco anything is superb (but the fish is my favorite  followed by the shrimp). The guac is fine fine and my kids never argue with me about eating everything on their plate when we dine here. My only issue is the loud scrapey metal chairs jack hammering across the concrete floor. Yes, I realize I made up an adjective but when you go you'll hear what I mean. The people behind the counter are usually pretty friendly and only once did I get a whiff of \"you're not cool enough\" but I wasn't in the mood to show my tats or various body piercings to prove my hipster cred. Regardless, the bar and burrito combination is a sweet one and I haven't yet  tasted something I didn't like there--and I doubt I ever will."], ["Steffanie W.", "This place was perfect for afternoon lunch on the patio.  Prices are soooo low.  5.95 for a \"small\" curry chicken burrito.  Husband had a carnitas burrito.  His was better because the carnitas was more tender and had better flavor.  Overall a good meal for a good price with REAL ingredients.Service wasn't very good but it's the norm for this place and you just go with the flow.  I like to take people here when they come to visit because it's casual and affordable."], ["Kyle S.", "This is one of the best restaurants in Jacksonville, hands down. Do yourself a favor and get tacos, a bunch of different kinds, rather than a burrito. Food is delicious, great casual atmosphere, fast, and when we were there the owner made sure to stop by each table and ensure everything was good and he bussed tables. Wanted to eat there each night during my trip - and it was a mistake not to."], ["Ron A.", "Got into Jacksonville late and just wanted something other than burgers for dinner. Yelped and found this funky, cool place. Ordered the Cajon Fish Tacos and grabbed a beer from the bar in the back. The fish tacos were outstanding. The fish was fresh and grilled perfectly with just a hint of cajon spice. They had great flavor with a nice fresh crunch of lettuce and tomato. Given that the only thing I ate was the fish tacos, tough to make a complete rating. However, I'm a big fan of great first impressions and this place nailed it. Funky, local place with great food."], ["Kamal K.", "The memory of my first Burrito Gallery experience involves unwrapping the foil of an $8 burrito while \"Treat Her Better\" by Mac DeMarco hauntingly echoed within a mostly empty building, right in the center of an equally empty Downtown Jacksonville. Each bite of the burrito unleashed an abundant flood of cumin infused brown rice and steak, hints of the skimply topped cheese attempting to make its way into the forefront once in a while. The sad jangle of DeMarco's guitars seemed to correspond with my tastebuds trying to comprehend what exactly was going on in this huge burrito. It suddenly occurred to me that during my order, I forgot to add in all of the burrito essentials - sour cream, salsa and guacamole. Welcome back to the world of non-assembly line fast burrito world. Although the format throws myself (a Chipotle addict) off track, the format does allow for a more complex/creative menu. What other place in Jacksonville has East Asian-inspired burritos? Even though the building and downtown were still empty, I left this place quite full. Huge burritos.3.5/5"], ["Laura F.", "A different taste of spanish food.. really good.. recommend it 100%.. we ended up here from a guy working at the beer festival that recommended this place to us.. we do don't regret it at all and were very pleased with their food.. their steak quesadillas are awesome..!"], ["Emily V.", "I was in Jacksonville for work and this place was recommended by a friend of mine. I liked it a lot! It has funky decorations. The cajun shrimp taco was to die for! I liked tofu taco too. The queso was quality. All of my friends were really happy with their food and the price is right. Recommended!"], ["Bryan G.", "Above average burrito joint with a bar in the back. Killer hot sauce selection. I'm a bit surprised at the negative service reviews and the attacks on the veggie burrito. Both were stellar. The chick behind the counter helped me save a few bucks on my order and the dude slinging the burritos was nice as hell. The barkeeps in the back were attentive and helpful. I can only assume this eateries detractors are the Tebow enthusiasts of the city.The most difficult part of eating here is not laughing at a room full of people wearing Jaguars jerseys."], ["Samantha M.", "It's okay. I really loved their nachos (fresh ingredients, hot jalapeños!) and they had killer whale on tap (my current fave). I did not think the tacos were very good, the chicken curry one was okay but I did not like the fish taco. Perhaps next time I will try a burrito, since that seems to be what they are famous for. Another odd thing I noticed is that either the bar is higher than usual or the chairs are too short, so I felt like I was a little kid at a big table, having to raise my elbows awkwardly to eat (I am 5 foot 7, I'm not a shorty). My boyfriend also noticed this. I will give it another shot at some point and see if their burritos live up to their reputation."]], "La Nopalera San Marco": [], "La Nopalera": [["Ernest-Nyesha P.", "I am a huge fan of La Nop. This one is my favorite for food.  The building is small, old, and kind of run down. It is not as nice as the other locations around Jacksonville, however; the food at this one is the best of them in my opinion. I love the quesdilla supreme and the california buritto. Your food is up with lighttning speed. Its great for lunch during the week."], ["Stacy T.", "Yum Yum! I am not usually a big fan of Mexican food, but this place is great for anything south of the border! Go now and fuggedaboutit! Free chips and salsa, fresh, fast, hot food. Ole!"], ["Arian A.", "It's your typical Mexican joint - Dos Equis on draft and soccer on the flat screens ... food wasn't anything extraordinary--My taco fell apart from the bottom as soon as I took a bite out of it and my friend ordered a quesadilla; the cheese was almost non-existent."], ["Ling S.", "La Nopalera is a decent restaurant if you're looking for your standard Mexican food. The portions are good and the prices fair. There's also unlimited chips and salsa.  There's a full bar and there's always a soccer game on the television. The place seems like a great place for birthday parties. The day we went, there was a party of 20 celebrating. They set up a huge table front and center for the party. I was a little worried at first our service would be hindered because of the large table. But the La Nopalera staff were still just as efficient and friendly. They also do that thing, where they carry like 13 plates out at a time on one arm! I don't know how to manage to do it. And the food came out super warm. A friend and I split the carnitas, which were not bad at all. The meat was a little too crisp for my liking on the outside, but once you get past that.. The center was nice and juicy. They have a great mango margarita. I would also suggest getting the white queso dip."], ["Kassity N.", "My husband and i go there a few times a month, hes a hot sause and salsa addict. the salsa has good taste to it but not spicy at all. queso dip is very good and the combo meals are huge! there is not much of a taste to any of the carne asadas or pork, wish they would add some spices to it because it would make it alot better! the wait is never long and hostesses are always nice. the servers are not very friendly, but the service is alway good."], ["Alen L.", "Eh. It's an overhyped restaurant, if you ask me. I've heard nothing but amazing things about it and finally got to eat here a few days ago with my girlfriend's family. My favorite part about the meal was the chips and salsa served as an appetizer. The entree (Quesadillas Supreme) was nothing special, and the service was literally nonexistent save for our orders being taken and our food being delivered."], ["Jason M.", "Great lunch spot. Quick and cheap and good."], ["Tony H.", "OMG! I can't believe there are only 5 reviews for this place!   I remember coming here for lunch when I worked at JCPenney's, and even before that!  I love.. LOVE this place.  I don't know exactly what it is... o. wait. that's right, their food is awesome! I don't even like spanish rice or whatever it is they have there, but I love theirs.  I'm pretty sure all my friends love this place too considering we all eat there A LOT! The staff there are always super friendly and prompt when serving/clearing and refilling!  I'm pretty sure I'll always eat/drink here."], ["Ryan M.", "The BEST Chili Relleno's Ever!  Staff always watching soccer on the TV's.  Good salsa"], ["E K.", "The location at Beach and San Pablo has the worst margaritas. They are so watered down you never taste any alcohol!"], ["Matt S.", "There was a place just like this where I grew up, and I at it all the time.  Overall, it's pretty standard, inexpensive Mexican food, but that's not to say that it isn't really good.  I probably go here once a month.  The service has always been prompt and adequate,  and the food has always come out quickly.  Gotta love complimentary chips and salsa as well!  You really can't go wrong here."]], "La Nopalera Mexican Restaurant": [["John S.", "This is an awesome location! The food is always hot, fresh, and great tasting.... The service is very good here; the servers are very attentive, making sure to keep drinks refilled....The portions of food here are huge.... Unless you eat a lot like me, plan to take home leftovers... This one is well worth a at least one visit if you haven't been already..."], ["Kurious K.", "My favorite local Mexican food place!  We eat here at least once a week and are extremely  rarely disappointed, service is quick when they are busy. However, I did call in at lunch once and it was not crowded...slowest service ever! Went to pick up order and waited an additional 15 minutes after the 10 minute waite time I was told to expect my order to be ready. So I would recommend eatting in for a nice dinner meal.The soft chicken tacos are addictive! Order a side of tomatoes and guacamole to go with it.The Shrimp Cocktail is heavenly, served in a HUGE beer mug and stuffed with shrimp and avocado...couldn't ask for more, couldn't make it through half of this delicious meal!Husband loves the enchilada meal.Order a pitcher of margaritas, they are fabulous and a bargain as opposed to ordering per glass. Best margaritas around!  I do not recommend the beef fajitas, but thats the only menu item I've ever been disappointed with.I give highest ratings to this particular location, don't confuse it with other locations carrying the same name."], ["Leah A.", "My experience here was OK. It is the standard LaNop version of Mexican food. Their portions are also quite sizable and served pretty fast. I enjoy the chips and salsa the most here when they're fresh.The last time I came here, they were about to close and started cleaning before we finished our dinner. I was overcome by the noxious smells of chemicals and to me, that's just not acceptable. Bad decision."], ["Sara M.", "Note well, folks: this 5 star rating is SOLELY for the Saint Johns Ave location. The San Marco La Nop warrants about 3 stars based on the food, not anything else.My husband and I ventured here on bikes the other night. I really love the ambience of this place. The soft, pleasant lighting given off by the festive light fixtures hanging above the booths and the terra cotta \"roofed\" section in the center give it a fun, authentic feel--like you've stepped into a quiet Mexican cantina!To start, chips and salsa were brought immediately to our booth as menus were placed on the table. Yes, free, mega-tasty [unlimited] chips and salsa. Take that, Lola's. Fermine was our server and I will be asking for him specifically when we return. We told him we were taking our time and just planned on relaxing with a beer before ordering our meal. He advised us on the draft beer specials, which you can't go wrong with: $3.99 for 27 ounces, even the imported Mexican varieties! Mine arrived just as I like it--ice cold in a frozen glass mug with a lime wedge. YUM!On to our dinner. We ordered the California burrito with pork to share. (My husband and I really love burritos. In fact, I think 3 of my most recent reviews include burritos as the entrée!) That is one over-the-top burrito. It is a giant 12-inch flour tortilla stuffed full of tender chopped marinated pork, rice, beans, cheese, lettuce, lot's of guacamole and sour cream. (My mouth is watering right now just thinking about it.)It was a great first experience at a spot we can easily bike to. So, to sum it up, THIS La Nopalera location is a major win in my book!"], ["Meliisa C.", "This is the worst La Nop I've ever been to. Our food was soggy and greasy and we didn't get chips (to go order). And not in that \"greasy hangover cure\" way, everything was much greasier than any other location we've been to. We'll stick with our usual La Nop"], ["carissa h.", "As a SoCal bred and claiming Mexican but not having Tapatio hot sauce is a basic. Your only option here is Valentina and shredded American cheese instead of crumbled queso blanco"], ["Madison S.", "This is the best and definitely most consistent La Nopalera. Their fajita arroz is perfect, everything tastes fresh, and the margaritas are on point. I would give it more than five stars if I could. The other locations pale in comparison to the St. John's location. In fact, I drive further just so I can dine here instead."], ["Waheed B.", "On my continuous search for satisfying Mexican food, this establishment had been mentioned many times. With so many locations, why this one? Easy: I was driving by.In short, this place is simple, nothing fancy. My original intent of a to-go order changed to eating at the bar so I could watch the world series game and inhale the tasty chips and salsa. It was great how they just appeared in front of me when I picked up a menu. This place is efficient!I ordered the special of the evening--a chille relleno quesdailla. I have never had one before, and it was discounted, so why not? I enjoyed this tasty quesadilla with chicken and its generous serving of lettuce, sour cream and guacamole.Is this the best Mexican food in the world? Hardly, and why would you think that anyway when you can hop on a plane and be there in hours. But this is good, reliable and consistent food with a staff that speaks Spanish (that can't hurt, right?).I would eat at La Nop (as the cool kids call it) again."], ["Jiordyn B.", "If you've never had true authentic Mexican food then this is the place for you. Being from California I found their menu quite comedic. Like what is 'Carne Azada'? I had the so called California burrito and it was worse than TexMex. It was slander to my states name. I asked for nothing in my burrito aside from guacamole, sour cream and cheese but I could smell the lettuce as soon as the plate hit the table. Don't dilute your culture to appease these people. On the up side, chicken wasn't terrible."], ["Lynn F.", "I used to enjoy this place but this time everything was tasteless! I was with two other people who felt the same. I ordered extra with the idea of reheating for the next day. Asked for a to go container and split my meal before I even tested it. The container came home with me but went to the garbage. I recommended this as they wanted to go to The Metro down the street. I should have agreed!"], ["Jon M.", "Salsa tasted like tomato ketchup. Men's rooms missing urinal. Awful. Tacos al pastor is like tacos al sloppy Joes."], ["Amy S.", "A review for another La Nop in Jacksonville.  La Nop, how do I love thee?  Let me count the ways...  1 one thousand, 2 one thousand, 3 one thousand!When I'm craving Mexican, La Nop is where I usually head.  Occasionally, I'm lazy and don't want to make the 10 minute drive, so I hit El Potro which is closer to home.  But usually I do make the drive because I want me some La Nop!As I mentioned in my review for another of their locations, I'm amazed at the portion size of their steak fajitas.  HUGE!  Totally enough to feed two people.Best white cheese dip I have found in all of Jacksonville.  I can eat 2 bowls of that stuff all by myself.  And this little Miss. Piggy usually does!  :DLove their chimichangas.  Nom nom nom.  The rice is rather so-so on its own, but I have found if I dip my fork into the white cheese dip and then scoop up some rice it becomes pure heaven to my taste buds!  Try it!Hubby is a big fan of their taco salads.  They are huge.  Hubby eats A LOT and I have yet to see him finish one.Hubby is also a big fan of their enchiladas.The restaurant is huge and clean.  They have a full bar.  The servers are absolutely great.  We usually always manage to get the same one.  I think his name is Danny?  There's also a nice, laid-back family atmosphere going on.  Prices are extremely reasonable!While I've tried other La Nops in jax and love them, this particular location is my favourite which is why it gets the full 5 stars from me!If you haven't tried La Nop......  what the hell are you waiting for?!  :P"], ["Allie A.", "Oh, La Nap. If you are discussing Mexican food in Jacksonville, the name is bound to come up. With several different locations in town... some folks love it, some love to hate it. I am on love part of that scale. While it may not all be the most authentic Mex in town, this is a perfect example of... sometimes you just have to appreciate things for what they are. And if you are looking for fast, cheap, Mexican eats, you've found it. Don't expect 4-5 star service. If it's busy, you may have to wait a bit, or flag your server down for a refill of a check... but the good news? When you do order, your food is coming out in about 5-10 minutes max. I really dig the complimentary salsa and warm salted chips. The salsa has a nice spice and a decent amount of cilantro. I love cilantro. The white queso is a pretty darn good cheese dip as well (nothing fancy)... but our habit is to dip the chip in the salsa, then in the cheese. So delicious! I can be a creature of habit as well, so I normally go with the chili relleno option, whether it's the lunch special #1 or the dinner plate. This relleno is stuffed with cheese and ground meat, so vegetarians be warned! I found this out the hard way a few years ago.  It's not very spicy, until you get a little closer to the top of the pepper, of course, but not bad. I am a fan of their rice... which as others mentioned can be a bit dry sometimes, so I just pour a little of their salsa on top. I tried the fajitas once, and wasn't really a big fan... and the margaritas.... ugh. Just ugh.  I'll stick with a Negra Modelo, and if it's dinnertime, the BIG size. :) If we are hitting up La Nop, were are usually starving.... and devour the chips, salsa and queso, and since the food comes out so quickly, end up eating like it's the last day on earth. About 10 minutes in, we are completely stuffed, and ALWAYS need a box for leftovers. So, La Nop. It is what it is, and I think I like it. :)"], ["Lisa-Kevin C.", "Best Mexican restaurant chain in Jax. Great food, great price. House margaritas are awesome!"], ["Anthony Z.", "Hey this place was great,  friendly waitstaff,  got to make a request directly to the cooks and food was authentic and salsa fresh.  Price point spot on...  I had three authentic tacos,  AL pastor was really good and chicken was grilled but not dry.  Even the Carne asada was tender and juicy, which is hard to come by anywhere.  It is usually over cooked.  I will be going back and in fact just filling out this review makes me want some right now!"], ["Fred C.", "Great food and the portions are really big. We usually have enough left over for lunch or dinner the next day.  I definitely recommend. I would have given 5 stars but the last two times we were there the service has been lacking."], ["Carol P.", "First trip was by chance on way home from work. SALSA was amazing. Stopped tonight on a Tuesday,  craving that salsa, and got not much more than tomato sauce. Meal was mediocre too, chili relleno and enchilada. No flavors. And as empty as it was could get not server to take my order for at least 5 minutes. And beer is gone, food plates pushed aside and can't get check. I won't be coming back."], ["Samantha P.", "Been to a few of their locations. While I have no idea what's \"California\" about their California Burrito (having been born and raised there) I will say it is AMAZING. And enough for 3 meals, at least for me. I've always gotten lovely service and been satisfied overall with their food. Absolutely recommend."], ["Mike W.", "Love love love this place.  I've been going here for years.  Food excelent.  Atmosphere excellent.  Service Outstanding.  Take Out Wondeful.  If you wander why!  I'm born and raised in San Antonio Texas."], ["Marty C.", "I love eating here today I'm trying the enchiladas, last time I was here I had the fajitas and they were delicious."], ["Sarah W.", "Not happy. I've heard such good things about this place only to be sorely disappointed.  Perhaps I made the mistake of ordering take out instead of eating in, but the girl who took the order was way to interested in her phone and was slightly snappy and rude. Also the food was all smashed together when I finally got it and nothing was even warm, it was cold and kinda gross. Won't be coming back here again that's for sure."], ["Bill N.", "The Legendary La'Nap was a huge disappointment. I have been to other locations but found this one to be in disrepair and filthy. There is no urinal for the men's restroom it appears to have been ripped out of the wall. The floors are dirty and nasty everywhere you look especially around the kitchen area. Makes you wonder about the quality and cleanliness of the food. Updated hair was found in the beef quesadilla. To their credit however the margaritas are very good."], ["Kim S.", "Let me be heard. I am a Texan. La Nop is suffice, but they are no Tex Mex. Food is just ok. They don't have sour cream enchiladas which I think is so strange. They always bring a plate out with your food that has a big ol' plop of sour cream on top of shredded lettuce with a big slice of tomato (weird, right?). When we first moved here their salsa was much better-something happened and it is not the same, it lacks spice. This being said I don't totally dislike La Nop, and it's the closest thing to a Tex Mex restaurant in Jax. Honestly, I feel like Chipoltes or Chilis represents Mexi food a lot more. I hate to mention this as well, but a cock roach was crawling around the floor last time we ate. I understand though being that i have worked in the restaurant industry-still really nasty though. Viva la Mexico...."], ["Lance D.", "This restaurant needs better service. When I first walked in, it took about 7 minutes for someone to walk to the hostess station to seat me and my family. On top of this, the entire restaurant has a completely messy floor, which took forever for a crew to clean it up. The restrooms are horrible, and completely messy. The urinal in the men's bathroom almost overflowed because it's severely clogged up. As for what I had to eat, the enchiladas were definitely good, but for what my family had, they didn't enjoy the food as much. The next time I go to La Nopalera's, I'll be going to the Kingsley Avenue's location in Orange Park. That location is much better."], ["V3 J.", "Food is good. However, service is inconsistent. Restrooms need to be updated. During our last visit, server accidentally dropped some food on the table and floor. She cleaned the table but not the floor. Someone could have stepped and slipped on that."], ["Phyllis W.", "The taco salad is yummy! Very friendly and clean. Go here all the time! Take out is fast. Addicted to the hot cheese dip! Meals are a bit to large but some of it comes in smaller sizes."], ["Ashley B.", "Ample parking lot, clean interior.  It seemed a little dark inside.The staff was friendly, food service was good.  I sat at the bar around 9pm, was greeted with complimentary chips&salsa, which are always a nice greeting.  I ordered a bottle beer and was advised it was cheaper to get it on draft, which I decided to do.  It was nice of the bartender to tell me that.  Ordered the fajita salad which is absolutely amazing."], ["Anna T.", "San Marco location is the best. This one cannot get a simple to go order correct. Terrible. Cross the bridge and go to San Marco location."], ["Alex F.", "Supreme beef quesadilla was pretty good it has mushrooms also it was delicious the only bad thing is no agua de horchata"], ["Carter S.", "I am dumbfounded by these other reviews, and they inspired us to go in the first place.  From start to finish our meal was unpleasant.  Pasty, inexplicably salty salsa.  Seasonless steak in the tacos that looked and tasted like it had been sitting in the bottom of a bin for hours upon hours.  California burrito was an absolute mess - completely unappetizing once I cut into it.  Our server never checked on us after getting our order wrong and I had to flag down someone else just to (begrudgingly) pay and escape this disaster of a restaurant choice.  Never again."], ["Angela D.", "I am from southern California so I believe I know good Mexican.  I have been here muliple times (none of them my idea) each time it gets worse.  Last weekend, I ordered the al pastor tacos.  It comes with 3.  1 taco was all fat!  It was so disgusting.  It was also stone cold.  My mom ordered enchiladas. The cheese wasn't even melted.  When I sent mine back, they microwaved it and brought it back.  My dad's food was brought 10 minutes after ours! The waiter wouldn't acknowledge my concern until he finally brought his!  I have been through this time and time again. I am always severely dissapointed. Ended up taking the tacos home to the dogs."], ["Sean M.", "Fast, cheap, and good! I love this place.  If you're really brave and hungry try the California Burrito. You might have some leftovers!"], ["Anthony L.", "Based on the other reviews, I must be really picky.  The service here is absolutely horrible.  To the point where I think it has to be some kind of joke.  I've gotten the wrong food 4 times, I've had plates tossed onto my table and food land on me 3 times, I've been ignored at my table for over 10 minutes without even asking what I want to drink at least 3 times, I had to walk to an ATM to get cash because their credit card machine wasn't working (which they knew when they seated us), I never get a fork, they never follow up to see if everything came out ok, etc..   It's just horrible.  I wish my friends would stop choosing to eat here.  Onto the food.  I think my waitresses head almost exploded when I asked if the kitchen could assemble my taco salad in reverse order. Lettuce on the bottom, meat on top. The way they usually make it gives you about 10 minutes to eat it before the bottom of the shell starts to leak.  What came out if the kitchen? A taco salad shell filled with lettuce and a little tomato wedge. Normally poor service and long waits means amazing food. But nothing I've had there has been all that special. The salsa is too wet, the cheese is really bland, and half the dishes are indistinguishable from each otherPoor serviceMediocre foodLong waitsBut sure enough I'll find myself back there giving them my money to be annoyed."], ["Mary L.", "I've been in Jacksonville a little over 1.5 years now and I *finally* made it to a La Nopalera! It could be because I'm from California and a little picky about my Mexican food or because of La Nop being in the news for some big problem when I first arrived in town. Anyway, last night my husband and I were too tired to make our own tacos and I'm so glad it gave us a chance to try this place!We came for dinner on a Monday night around 7:30pm (after visiting the Pet Supermarket next door - great place but that's another review) and were seated immediately. We loved the crispy thin tortilla chips and the salsa. We both ordered the Tacos Especial which comes with 3 corn tortilla tacos with your choice of meat. We ordered carnitas (pork) and asada (grilled beef). Anyone can do chicken - I like to judge a Mexican restaurant by these two standards. The tacos came with a plate of Mexican rice (rice cooked in tomato sauce) and refried beans, and a condiment plate for each of us with a quarter of lime, chopped onions, cilantro, and a salsa verde that was really good and had a nice little kick to it. Because each taco came with 2 corn tortillas, it was really like having 6 tacos per plate since there is enough meat to split each taco. Also, a word about the tortillas - I was so happy that (a) the server did not ask me if I wanted flour or corn tortilla because IT SHOULD BE A CORN TORTILLA and (b) the tortillas are heated with grill marks instead of being served cold like Tex Mex places tend to do. Our meats were both really tasty and flavorful. The carnitas did have a chunk of fat in them (as commented on by a preview Yelper) but you know what? Just take that piece out if you don't want it. We took home enough leftovers for at least another meal!The service was fast and our server checked on us a few times. You get the check then pay up front at the register. There was a little bit of a line but I was happy to finish off the chips and salsa while my husband waited in line to pay for our meal. :-)I'll be back to try other stuff on the menu!"], ["Jessie M.", "Much better than the Kingsley location in terms of food. The Chile Relleno here is amazing."], ["Charles S.", "I have been to most of the La Nops in town. Can't comment much on the slow service because I haven't been to this location during very busy hours. However, the food is consistent and service was good in my experience. Quantities are huge and you cant beat free chips and salsa with a pitcher of Margs."], ["K. D.", "They are one of my favorites for 'tex-mex\", but I have noticed a downturn in their chicken recipe  lately for some reason.  The chicken in all dishes is tender and well flavored but on the downside, only as of late, they are adding way too much on the green pepper side to the point that I have to pick it out of my chicken tacos.The flour tortillas are always fresh.  The chips are crisp.  The guacamole is delicious.  Fresh tomatoes, crisp lettuce.Shrimp cocktail is heaven!  It comes in a HUGE beer mug, lots & lots of delicious shrimp, yummy avocado, flavorful sauce.Margaritas are to die for and plenty strong.  Buy a pitcher, it's the best deal around.I don't really care for the beef, tried the beef fajitas twice and the meat was tough both times. My husband likes their rice and beans with the burrito combo.In general, you can expect great food, excellent service and an enjoyable atmosphere. I am an avid fan and recommend this location."], ["Chris P.", "We went on Friday night of all times and surprisingly only had a three minute wait.  NIce Service and we feel this is a good location of this chain.  We prefer this location.  We love the chips and salsa to start and usually get the Chimichango Dinner and Fajitas Nopalera have mix of four meats ( Shrimp, Chicken, Streak, & Chorizo) Ask for lime with the  Modelo."], ["Kerry C.", "If we had known how good this restaurant was, we would have come here long ago.We were the first in the door when they opened on a Saturday, 11:00 a.m., so the food was very hot & fresh and took little time to prepare (a plus!).  The price is comparable to other similar places in town, but the portions are more than generous - I advise future customers to plan on taking a leftover box home. LOLWe definitely are going back a second time (and a third, and a fourth...)."], ["Bob S.", "I'd say if you've been to one La Nop, you've been to them all.  This one is less dingy than the San Marco location, but it's -dark-.  Took several minutes for my eyes to adjust, and I still had trouble reading the menu.The food came out pretty quickly, and was as ordered.  The waitstaff was attentive, but it took several minutes to actually pay and leave -- nobody was staffing the cash register.  There were several parties (at least 3, maybe more) waiting to pay and go.  The cashier had apparently been pressed into service filling some phoned-in  to-go orders.   Fortunately, I was the first in line to pay, but everyone behind me was grumbling about it.This was mid-afternoon, 2 or 3pm.  If there's only one person who can run the register, then train someone else how to do the take outs."], ["Megan C.", "Best la nop in jax. Their chicken is awesome!"], ["David B.", "Went here once when my colon owed me money. A week later I was paid back in full. Get the fish, it's great."], ["Ernie M.", "Although I have been in this restaurant many times, I have had an experience that I cannot let go.  On the 17th of Jan., I and friends went in for dinner at 5:30pm.  We entered but there was no one to greet us.  After about a minute I realized that the greeter was at the closest table playing video games on his hand held with another employee.  After I announced that this was going on, he reluctantly got up and said follow me.  He seated us in the over flow section when there were plenty of booths in the main dining room and walked away without saying a word.  We didn't even sit down but left immediately and went to Harpoon Louies.  I have written the General Manager Mario Leon about this experience and will try the restaurant in six months to see if anything has changed.  I like the food and the wait staff is fine, but this was just too crazy to believe."], ["Ben W.", "Cheap Mexican food. Cheap beer. Cheap (strong) margaritas. La Nop is Jacksonville culture. Awesome."], ["Phil G.", "Lees than average Americanized Mex food. Guac was paste. Marguerita was lime-aid with a shot of tequila. Pass on this one."], ["Carolyn S.", "I've been going here for years. I love it, and always have. It's a great place to get together with friends with really good food....and AWESOME margaritas!!!"]], "Si Senor Fresh Mex": [], "Mi Veracruz Restaurant": [], "Margaritas Mexican Grill": [["Kristy V.", "We've been looking for good Mexican food in Jax for a long long time, and after visiting Margarita's, our wait is over!My friends, hubby and I ventured over after reading reviews on Yelp.  We ordered some jalapeño margaritas at the bar, which had a little kick but mostly had that good pepper taste that complemented the sweetness of the drink - yum!  Highly recommend.We were seated in a booth and immediately served with fresh chips and salsa.  Enrique, our server, was attentive and made some excellent suggestions for dinner.  I ordered the chicken Acapulco, hubby got the chicken poblano fajitas, and friends got the Tijuana chicken and the carne asada.  All were prepared with fresh ingredients and were very flavorful - a refreshing change from the overly salted and greasy fare that is standard around here.I'm adding some pics because they are worth a thousand words - can't wait to go back again!"], ["Misty S.", "Pretty good mexican place.  Living in Los Angeles somewhat spoiled me, so I've been looking for a great place since I moved here.  The service was good, bartender was nice.  The margarita was a little weak, but all in all, it was pretty good.The food was really good and the portion sizes were nice.  It also wasn't too spendy, so that's always good.  I did like the chips and salsa as well, which is always my first love :)I think I will go back and try something a little different (I played it safe with a tostada)....but a lot of the drinks looked interesting and the menu looks pretty big with good options.  Stay tuned...."], ["Brian S.", "Came here for a CMYE after party and had a blast.  They have a very large number of flavored margaritas, a stereotypical selection of Mexican dishes, but a quality that makes them stand out and stand apart from your stereotypical Mexican restaurants.Service was great, and our waiter was incredibly patient with the picky folks in our group.  This makes four good restaurants in the same shopping center.  A winner for this wannabe foodie!Their pricing is in line with others, which means that your wallet will not hate you at the end of the night, which makes this one a big winner."], ["Jaime C.", "So I know the quaint Mexican restaurant has \"been done\" but, I honestly enjoy this place above most. I posted about the frozen margaritas bc they aren't shy with the tequila. :) And the price is right when it comes to a pitcher. This might be the American in me jumping out but their cheese is some of the best EVER!!! Not just the queso dip. But the actual shredded cheese as well. If you've read any of my previous comments you know by now I only leave reviews if I like a place. Their wait staff is so efficient and sweet!! Our waitress was awesome!! It's not going to be some fancy date night dinner, but it IS a \"let's have some tacos and frozen margaritas bc the day was long\" kind of place. It's just a fun little spot. Try it out."], ["Leah A.", "What a fun place to meet up with friends!  The staff here is phenomenal and really caters to their customers. They accommodated a big group of us for late night bites and drinks.  Although I'm not a huge drinker, their margaritas were very tasty and served ice cold.  You can order them over ice or blended frozen with many kinds to choose from on the menu.  They were served in a big festive glass complete with the salt rim.  Super refreshing!Overall, the drinks were constantly coming and I'll definitely be back to try a full meal.  FYI: The burritos I saw coming by me were HUGE so bring your appetite and get ready for a fiesta!"], ["Joe K.", "Now this is real Mexican food! First of all, I wanted to mention that the service is excellent. I always expect average service when I go to a new place and love to be pleasantly surprised. The entire staff was attentive, kind and genuinely warm. The food portions are large and the cost is low. I can usually tell how good the food will be by trying the chips and salsa. Others choose a bean and cheese taco or the restaurants guacamole as their litmus test. Well the salsa didn't disappoint. It was fresh, had plenty of flavor and had just the right amount of heat (possibly a little too hot for some weaker tongues). I decided to \"go all the way\" with this date and go for the gold; I ordered the fajitas. They were good but did suffer from SMS (Skinny Meat Syndrome). It was forgivable since the flavors were so good! My only gripe is that they didn't include any of the standard fajita sides like sour cream, cheese or guacamole. All of that has to be ordered additionally. I did order the guac and it was decent. Nothing to write home about. Over all I was really impressed with Margaritas. I will definitely return and try the fish tacos, tacos al pastor and Fajita Aguacate. Just writing this review as I start my day is leaving my mouth watering and stomach growling. Looks like that day will be today. See you in a few hours Margaritas."], ["Kim M.", "Great little spot hidden in a shopping plaza for margaritas. Over 20 flavors to choose from. We were gathered for a group get together and had awesome service. The green salsa is hot but  so amazingly delicious you find your taste buds begging for more but your tongue is crying and your face is sweating. Although we weren't ordering food at this visit, the fajitas at the table next to us were exploding with a sensational scent and looked fabulous. Great place."], ["Nyla S.", "5 stars for their customer service alone!! Something about the way everyone greeted me made me feel like this was going to be a good dinning experience, and it was.Soooooo... Let's get the cons out of the way: the Chile rellano was my least favorite, the peppers in our burrito and nachos could've been cut way smaller and the drinks could've been a little stiffer.I had to fish for awhile to even come up with those little cons. The food was quick and amazing, the drinks were good and the customer service was through the ROOF!!! I had a couple peach margaritas and a sweet tea, all of the drinks were good, but the great part was the lightly sweetened sweet tea: some people overdue it!The complimentary chips and salsa was great, it has this spicy kick that will have you going back for more. I also ordered the chicken California burrito and a Chile rellano and they were both HUGE, so needless to say I definitely have another meal sitting on the counter.My friend ordered the fajita nachos and a taco, she loved the taco and said she'd definitely be returning.If anyone is looking for authentic Mexican cuisine, stellar customer service and a all around satisfying experience, I suggest you give this restaurant a try. This is definitely my favorite Mexican restaurant in Jacksonville (at least for right now).Happy Yelping..."], ["Brandi F.", "Spur of the moment we decided to try this place and we are so glad that we did! I am from California and I am convinced that, that is where the best mexican food is... haha so naturally, when I saw their California Burrito I had to give it a whirl.  I was pleasantly surprised that it lived up to it's name. I had to eat the whole thing it was delicious. My husband enjoyed his enchiladas and my son ate all his quesadilla which was half price since it was Sunday. The staff was wonderful and of course, the complimentary chips and salsa we're a great start to a fantastic meal! We'll be back for sure!"], ["Aaron S.", "Was in the mood for tacos, but got here and couldn't get the idea of taco salad out of my mind and boy was I glad I decided on the taco salad!  This thing is definitely priced right, and the healthy portion was perfect for my appetite!Will definitely be adding this place to the rotation!"], ["Hope J.", "Dinner tonight was Fantastic! Greeted very friendly as soon as when we entered. Seated in a booth quickly. While the waiter was taking our drink orders another server brought us some fresh warm chips and salsa. I ordered The Patron Margarita, the Man ordered a Watermelon margarita, both on the rocks. The Patron Margarita was on point...smooth! I tasted the watermelon but I'm not a fan of sweet drinks,but he loved it! Next came the dinner he had Pollo Loco - grilled chicken with fixins, rice, tortilla guacamole. He is a picky eater and he ate everything on his plate! So yeah! I ordered Fajita Aguacate- an avocado stuffed with steak or chicken and cheese(I chose steak), breaded with a panko crust. If you love avocado then you have to try this dish. It was amazing! I intend to become a regular at this restaurant! Also, happy hour 2-7 Regular Margaritas 2.99. But with so many other choices of margaritas, I'm going to have to work my way through those before enjoying the happy hour prices. ;)"], ["Han L.", "I can't believe this place is two dollar signs! The majority of their dinner menu costs between $8-$12 dollars! That's pretty affordable in my book, especially since the portions were generous. Margaritas' dinner selection is vast! Additionally, they offer a great drink menu; plenty of margaritas (of course!). It's a great place for large parties. The staff is friendly and attentive. We came here for a friend's birthday. I casually mentioned it to our server and they surprised him with a birthday song and a drink. They also decked him with a sombrero :)"], ["Federico L.", "It took me five minutes to love this place. Look at the pics. Place looks great. The staff is very friendly. This place opened up two months ago or in october 2014'I am waiting for my meal, but having chips and salsa and a margarita. Wow, the margarita is loaded and the salsa is extremely delicious.For $10.99 I am having the Special Dinner, which it comes with a chalupa, chile relleno, taco, enchilada, tamale, and rice and beans. This is one dish, but feeds two.Well, this is great, excellent, delicious....dont know what else to say.Come to this restaurant and enjoy great food! This is best Mexican restaurant in Jacksonville."], ["Allie A.", "Adding a star for the unbelievable customer service tonight. and craft made to order margaritas. the jalapeño is perfect: not too sweet bi tangy and spicy: and the chorizo queso?!!!!! JUST DO IT! so good!"], ["Richard H.", "I stopped in for lunch the other day and was pleasantly surprised at the atmosphere and the owners willingness to make you feel at home. I've been to many Mexican restaurants and this place stands out from the crowd in a big way! The owner was very pleasant and gave recommendations on some items he enjoyed from the menu. I went for the chicken burrito and chicken enchilada with rice and beans on the side and everything came out hot and fresh tasting and the chicken inside both was juicy and seasoned to perfection. Chips and salsa of course are complementary but don't let the free chips and salsa for you, they are fresh and delicious as well. I will definitely be back again and again and I wish them nothing but success as they grow and gain more regulars like myself."], ["Mrs. Marisol R.", "It was not bad.  It's hard I guess when your main experience with Mexican food is in Southern California. For Jacksonville, I'd say its pretty good. I love that I was able to order a Kahlua Coffee. and I like that they have plain tacos that aren't drowning in sour cream and such, but the carnitas were very dry and my daughter's steak was tough. Chips were addictive and the guacamole was excellent... full of avocado, not a bunch of other stuff some places fill it with to save money. Staff is friendly and wants to provide a great experience, but the meat needs a little help."], ["Jeanne D.", "This is a very friendly local restaurant.  I loved the complimentary chips and salsa, and the tacos I had were very good.  I think the staff here are extremely friendly and helpful, and the food was good too!  I definitely think  this is worth a try if you are in the area."], ["Martha H.", "This place has great food, tasty margarittas and exceptional service. Try this place and  you will never go back to LaNop!"], ["Nery V.", "If I could give this place 10 stars..I would!   GREAT customer service. .the best I've ever experienced in a restaurant!   I love it!"], ["Kim C.", "My once favorite local Mexican place has been slipping since my initial review. Incorrect orders, lukewarm food, and hair in the salsa (TWICE) have made us steer clear lately. It's hit or miss, but too many misses lately to continue being loyal customers (not to mention a credit card snafu that had me furious)! I've also read a couple health inspector's reports that made me cringe. Oh, how I wish I loved to cook at home:) I guess it's time to start!"]], "Tijuana Flats": [], "El Potro Mexican Restaurant": [], "Hola Mexican Restaurant": [], "Cantina Laredo": [["Misty S.", "Great happy hour on Saturdays.  I really like sitting at the bar because they have specials, but also the food is fresh and the bartenders are always friendly.I love the nachos and enchiladas and their house margaritas are actually REALLY good.  I would suggest the regular or the fresh strawberry.Definitely a fun place to go with a group of friends or before you start shopping at Town Center."], ["Shaina Y.", "Ask for Nile to be your server! He gave excellent service and was very knowledgable with the menu. Food and drink were all excellent!"], ["Berthina M.", "OK...I cant give many detail about his restaurant because I only came for drinks...i promise to update this review..I cant even talk about prices because I didnt see the menu...again..i will update.I did however have a dessert and man oh man....fancy fancy fancy apple pie. Such a presentation. The server brought out a hot single no handle skillet. He first poured a brandy butter sauce on skillet....yes it sizzled. Then he placed the hot apple pie on the skillet and then cinnamon ice cream....yummy folks.The presentation itself made me say...YUMMMMMMMMMMMMMMMM.....Its a shareable dessert..or made for a single person...but since Im not a super dessert fan ..im ok with sharing...update coming soon..."], ["Kasey G.", "Cantina Laredo has some of the best Guacamole I've eaten, and their Salsas are also very good. Their Fish Tacos were decent, but their Apple Pie redeemed them. I highly recommend their Apple Pie which comes out on a hot cast iron skillet, with sizzling Bourbon Butter, and melting Cinnamon Ice Cream on top. Delicioso!"], ["Rick P.", "went there for lunch.   the place is really nice.  Service was very good.  Our waiter was pretty knowledgeable about the menu.   One thing you need to try is the top shelf guacamole.   They make it right at your table.   everything is fresh and yes, it is very very good.I had the spinach enchiladas.  I know, i always give grief to the my vegetarian friends but this sounds good.   it came with rice, zucchini and very good sauce over the enchilada.   very good, filling too.   My friend had the chimichanga.  that looked also good.   the food was fresh, fast for lunch, and looked perfect.   They did a really good job.   I was looking at the bar and seeing what they had for drinks.   One thing I know I will get is the Cabo Wabo.   forget the patron tequila, go with Cabo Wabo.   You will not be disappointed.   Unfortunately I had to head back to work."], ["Samantha M.", "We stopped by after a long day of shopping and were pleasantly surprised at what we found! First off, the drinks are fantastic!! The margaritas and sangria were top notch and it is worth going just for a drink. The queso is absolutely delicious. I'm a big fan of anything cheesy and this was the cheesiest! The salsa for the chips was fresh-one was very spicy and the other was mild, so all preferences can be met. For dinner, I had the spinach and mushroom enchiladas. The mushrooms were perfectly cooked-not too soggy, not too \"crunchy,\" and the spinach was seasoned well. The cream sauce complemented the enchiladas and the mixed veggies were perfectly seasoned and served al dente. Our server, Ryann, was extremely attentive and made sure our glasses were full and anything we needed was addressed. Every recommendation she made was stellar! She came by to check on us frequently but didn't overdo it. I will request to sit in her section next time. My boyfriend had the special-a steak and shrimp dish that was cooked very well-it was a great recommendation! We were too full to try the apple pie, but several people nearby us ordered it and it looked amazing- it is something we will definitely come back to try. I went in not expecting too much and left feeling glad that we gave this place a shot. We will definitely be back soon."], ["Pamela D.", "Definitely a solid restaurant if you're in the mood for a ameri-mexican cuisine; not my favorite however. I want to love this place so bad because the location, great service and overall atmosphere but for me the food is just alright. There are so many other places, so the competition is there.Really, this place shines in their drinks. Pricey, but there is a magic combination those bartenders are working with. It must be the grade of tequilas they use; each drink is seamless variety of flavors. I'd come here for late-night drinks, but would rather spend my dinner money on a meal that is more flavorful."], ["Valerie W.", "Holy guacamole.... I'm a sucker for good guac. I've been here multiple times but only once have I actually eaten a meal since I'd rather stop and fill up in the freshest guac ever!!!! My only concern is that I feel the servers are not very attentive. The bartender was nice but didn't give us our check until we had to interrupt her 30 minute margarita mix making.Also, getting chips and guac to go is always super fast and you still get a lot of their salsa(the hot one is my favorite!). This is a bit pricer than say, chipotle, but it's super fast, extra fresh and other all better for the price for the amount and quality. My only complaint is that the size of the to-go guac seems to vary a lot in size, generally seeming smaller than in the restaurant. Sorry I can't say much more about the food besides rave about guacamole!"], ["Jaye T.", "When I walked in to get on the list (more on that in a moment), it was like walking into a concert in full swing. I was supposed to be here for a date and I could not imagine trying to get to know someone over dinner and drinks... and that noise. I also can't imagine trying to spend time with my friends in that sonic cyclone. Cantina: invest in some acoustic panels. Seriously.I walked up to the hostess stand and greeted her. She looked at me like she had no idea why I was there. No welcome, no greeting back, just a blank stare. \"So, is there a waiting list?\" She responded that there was.... and then nothing else. \"Can I get on it, please?\" Oh, of course. At this point, there was no \"of course\" about it. I wasn't sure she even knew where she was. Seemed like a sweet kid, so maybe just overwhelmed. That's a management oversight, if they're not adequately training or supporting her.Then at 7 PM on a Tuesday, I was handed a notification device and told it would be 50 minutes. \"Fifteen?\" I asked. \"One-five?\" It was so loud I wasn't sure I'd heard her correctly.\"No, fifty.\"\"Five-zero,\" I confirmed.\"Yes.\"\"Okay.\" If I hadn't agreed to meet my date here, I'd have left then. But he was parking and we'd agreed, so I took the pager and stepped back outside. Even in the Florida summer, it was refreshing to close the door behind me. My ears were ringing. Luckily, my date arrived and had a similar reaction to the noise level and wait time. We turned in the pager and went to Wasabi instead.The two stars aren't for the wait, it should be noted. They are for the noise level and the poor service, one each. Why restaurants think \"louder is better' is absolutely beyond me. When I'm out having a social occasion with my friends, I don't want to have to wear ear plugs like it's Freebird Live and I don't want to go home with a sore throat from screaming at them like a lunatic all evening.I don't care how good the food is. I looked at the menu online: it's overpriced (probably because of the location and the trendy factor); it's loud; and it's got staffing issues."], ["Pam S.", "We always search for one of these restaurants and we were so happy there was one in Jacksonville. We treated our three adult children and were blown away once again with the amazing flavors. Thanks for going above and beyond in this business. We really appreciate everything this restaurant has to offer."], ["Andrew C.", "Great Mexican food, although the table we were seated at backed up to the kitchen and had a strong smell like sour feet.  Suggest getting that area fixed as it makes it difficult to enjoy the food.  Also,  just a bit of a suggestion,  adding to your menu that your ceviche contains green olives would be great,  as those are a strong flavor and quite overpowering."], ["Laura S.", "Best food ever couldn't have chosen a better place to eat! The avacodo enchiladas are the best ever and the service is wonderful and the place is very clean. The patio view is nice too."], ["Terry T.", "My wife is a sucker for good guacamole and here, they make it fresh at your table.  The tortilla chips seem house made.  I liked my tacos which seemed like a fusion of mex-mex and tex-mex (soft tortilla with lime on the side) and my wife enjoyed her fajitas.  Looking around it is a very nice restaurant and the ambience is intimate and upscale.  We'll have to visit someday after work to check out the drink menu."], ["Jack B.", "Not their fault, but since Nordstrom's has come to Town Center, they now own all the parking that used to be for Cantina Laredo, so when you go to this restaurant, valet park, you won't have to wait 10 minutes to find a place to park. Our food was good, server was nice and it was a great event to celebrate an event with the family. I'd have rated the place more stars, but you have to go and hunt for a place to park and CL could make it easier by placing a sign at the intersection showing that there is free valet parking (this way), hunting for a spot took the fun out of it. Food was good, had chicken tacos, for 10 bucks, was very bland on a plate, no cheese provided with chicken tacos, like they do for the enchiladas. Just OK to me."], ["David F.", "Amazing place! Great food, fajitas were awesome! Gotta have the Mexican Apple Pie!!! Will recommend and go again."], ["Ac B.", "Enchilada Veracruz with sour cream poblano is amazing. Also the chimichanga is really good. Get the sour cream poblano sauce so good!!! This place is so good. Servers are awesome. We visit jax once a year and love this place."], ["Travelwriter_Tom J.", "Pricey, OK--not great food.This place is OK.  But if you're looking for top shelf Mexican or Tex-Mex-like food, look elsewhere.   It's overpriced and the quality of the food is not worth it.  We stopped in for dinner.  It was our first visit to this area in about 8 months.  We presume this place is new, as we don't recall seeing here in the St. John's Town Center mall heretofore.DetailsPros:1) Nice ambiance: beautiful layout and atmosphere.2) Excellent service.Cons:1) Alcoholic drinksMargarita's cost $12.95!  I might expect to see this price at the Waldorf Astoria, but not here.   We saw the size of the serving glasses.  They're not \"double-sized\" for the price.  Unless they're making Margarita's that can garner the Guinness Book of World records prize, there is no rationale why a customer should wish to pay this price.2) AppetizersThe chips and dipping sauces were tasteless.  This is exactly the contrary experience a customer should experience at this type of restaurant.  The chips and dip should be SO good that a customer experiences difficulty controlling the urge to overeat and \"spoil\" enjoyment of the entrees.3) EntreesThey were OK, but not great.  Carne Asada costs $19.99.  The flavoring of the meat was superb.  But the portion was skimpy -- about 25% the thickness of steak we've come to expect from restaurants in these categories elsewhere around the world.  The taste of the attending portions of vegetables were not in harmony with the meat.  A slice of avocado was placed on the side.   It was tasteless.  We were left wondering if this was our \"punishment\" for not ordering a guacamole side dish -- a $10.95 add-on as a side.Spinach enchilada costs $11.98.  This is reasonable.  The problem is the dish was largely tasteless.  My wife didn't like it at all.  I thought it had some merit.SummaryIn retrospect, we're troubled by the high (4-star) ratings this place enjoys.  We presume there are no good restaurants in this category in the Jacksonville patrons can compare this place with.  Certainly, it would be great if there were an Uncle Julio's chain (Rio Grande Cafe) or Guapos-like restaurants (found in the DC Metro areas and elsewhere) were nearby.  The sign on the outside of this restaurant bears the word \"gourmet\" amidst the name.  This simply is not the case.  There is nothing gourmet about this restaurant.  This simply is, marketing bravado.If you decide to visit, you can limit your costs by avoiding expensive add-ons like alcoholic drinks and desserts.  I hope your experience is better than ours.  There's nothing \"wrong\" with this place.  Given the prices they charge, one would expect a superb dining experience.  That didn't happen for us.  And given the other reviews I've read about this place, it appears we are not the first to draw this conclusion."], ["Lisa S.", "Went for lunch today. Food was great and service was excellent! Our waitress was on point. We didnt have to ask for anything. I had the enchiladas and it was filling. Took some home. I highly recommend."], ["Eugene L.", "Great tacos, meat quality is tremendous (i love their cheesburger sliders and carnita tacos, and the mix and match fajitas are delicious) , customer service is wonderful and two margaritas will have you on the floor."], ["Bob M.", "Great Gourmet Mexican!Ask for the Bartender Sarah ! She has a great Tequila inventory and can offer great recommendations.Sit at the bar and talk to the great staff."]], "Mr. Taco": [], "Las Tapatias": [["Jose R.", "Great food, prices and atmosphere its not a place for a first date. Its that hole in the wall the gets you great food"], ["Christopher W.", "Well, tonight my girlfriend, roommate and I decided if we were going to spend money on food, we were not going to get the same mundane delivery or fast food meals we usually do. After some research, we decided to go to Las Tapatias, a restaurant I have driven past many times but never knew it was actually a restaurant. The outside of this place looks like somewhere you might get shanked and when you walk in you just look around and think to yourself \"There's no way I'm getting a good meal\" in here. Well boy, are you wrong.The food is DELICIOUS. You will get chips and salsa when you arrive, which is average at best. We ordered the supreme nachos to share and it was easily big enough to probably be a meal for two. Steak on one side, chicken on the other with a pile of lettuce, tomato, beans, sour cream, cheese, and guacamole. Very simple, yet very satisfying. I ordered the two taco, rice, and beans combo which was meh. My girlfriend and roommate ordered the Cazuela Las Tapitias, which is basically a cavalcade of meats cooked with tomatoes, green peppers, and onions and served fajita style with corn tortillas. Oh. My. God. It's amazing. They ordered the potion \"for two\" but it's easily enough for 3-4 people, even without the nachos beforehand. We ended up taking about a 3 lb. box home. I cannot wait to go back and try some new things! Everyone needs to go here. Now."], ["Daija P.", "You know what, they're not bad, but not great in comparison to my other favorites around town. The tacos are pretty basic; meat, onions and cilantro only. Prices are SUPER cheap. You can get 3 tacos and a beer for about $7. The dining area is small...it's just an overall meh. It's like eating your food in the middle of a convenience store. If you need a quick bite on the cheap and are craving Mexican come check it out."], ["Leslie B.", "Thanks yelpers for rating this place. I have driven past it a few times and thought it was a dump so never went in, but man was I wrong! As everyone else has said, you literally have to walk thru a store which sells cowboy boots, soccer cleats, tons of sodas, and fried pork rinds! To the left of this stuff are tables. Just sit down and someone will be right with you. The menu is in English, most people working there speak Spanish. Just point and order! The supreme nachos are on the lunch menu but we were able to order them for dinner for $1 extra. They were amazing!! You have to get these nachos. My husband and I also ordered four tacos and left complete stuffed! All for the whopping price tag of $16. It was great and we will definitely be back!"], ["Mary C.", "It was decent but fell far short of the rave reviews below. I had the Lengua Torta (tongue sandwich) and it was dry with chunks, not slices of meat, lettuce, beans, and jalapenos on a very dry roll.My husband had what turned out to be a wet burrito with pork that was actually pretty good. A pet peeve of mine is when the server does not come back to ask how everything is shortly after you get your food. Our server didn't ask until she thought she could take away some plates. I had to ask for a fork, ask for more water, ask for hotter salsa, well you get the idea.On the good side we both got out of there for under $20.00."], ["Andi R.", "The food here was pretty horrible and far from authentic. I saw the other one star comment, but still decided to give it a try based in the overall rating and pictures.The chips were stake and the salsa was way too salty and had an overpowering taste of onion. I absolutely love salt so that's saying something. Our burrito was soaked in sauce that tastes like it had a very strong ketchup base taste. I got a taco in a hard shell... I've never gotten that before from any Mexican food place that called itself authentic. Ha!The rice was bland and the beans were burnt. I don't know what kind of tortilla was used to wrap the burrito, but it was also disappointing. The food is inexpensive, but I've paid less for better."], ["Jeremy K.", "Four stars for authenticity.  This place is in the back of a Mexican food store (as many have mentioned).  We walked in and sat down, then got back up to pick our drinks out of a cooler.  I think we may have been the only non regulars there.  The food was good, and better than most Mexican I've had."], ["Keith B.", "Super cool find!      Actually looking for a Tijuana flats per the GPS (we were out of town) we saw this place.  Quick yelp indicated we should try it.   First you walk in and it's a convenience store, so i could buy cowboy boots and a pack of razors.    To the left is the little restaurant with coolers of beer.       Originally decided to take out, I grabbed a beer and then decided to stay in.    Good cheap tacos, flavorful.     Seemed pretty authentic to me."], ["Janice J.", "Truly one of the closest thing to traditional mexican food in Jacksonville, Fl."], ["Debbie F.", "I can eat authentic mexican food everyday and many times I do. This place is unnoticed from the outside to most people but when you find it you never let go. I love there Tacos and Tortas! Its a great To Go place!"], ["Abby A.", "Super sketchy place with THE BEST Mexican food in Jax. I don't even care that I'm eating in a grocery store when I come here. Fajitas for 2 is enough food to feed 3 or 4 people, EASILY.The portions are huge, the prices are low and the beer is cold!"], ["Allie A.", "My stomach is so happy that my fellow Yelpers directed me to this place!!! I had a serious hankering for some authentic Mex... so I put on my \"eatin dress\" and we headed down to my old neck of the woods on Baymeadows. Everything great that has been written about this place is true. Yes, you walk into a little store, but we had the heads up and took a turn to the tables on the left. Beer, Mexican sodas and drinks are in a cooler like a convenience store, and our server gave us the go ahead to grab one if we liked. Not a huge variety of beers, but the usual suspects were available, so I grabbed a Modelo and my man grabbed a Corona.  I actually panicked for a moment when I didn't see the hyped nachos on the menu... so I asked our server, who directed me to the lunch menu on the back. Phew! Nachos Supreme ordered and first on the agenda. They were out in a flash and WOW, are these things huge! A ginormous platter plate just heaping with goodness. These are not your pick up a little chip variety and require a fork. They were loaded with tender and juicy, perfectly seasoned shredded chicken and strips of steak...the juice melds perfectly with the queso and creates what my boyfriend called \"Mexican gravy.\"  Fork on a dollop of sour cream, quac, lettuce and beans for the ultimate mouth watering bite. I know people tend to use \"they were the best I've ever had\" a lot, but these nachos are a serious contender. We could have made a complete meal out of these for two people and almost bumped heads about five times hovering over the plate for big bites. Amazing. We were both pretty full about 1/4 of the way through, but went ahead and ordered entrees anyway: I had the Chili Colorado, beef chunks smothered in red chili sauce and the boy went for the carnitas. The Chili Colorado was tender, only a tad spicy, and salty, which when placed on a fresh tortilla made for a perfect balance. The carnitas were a bit dry, compared to everything else, but had a great flavor.... and honestly we were still thinking about those nachos. Seriously authentic with fast no-fuss service, I highly recommend and will return. And take a stroll through the store before you head out... some interesting products offered, everything from cowboy boots, to dried shrimp and tons of spices."], ["Robert C.", "Like other reviewers have stated, this place is not the classiest in decor.  I wouldn't take a first date here; but my wife, sure.  Who doesn't like eating in a store with a bad depiction of the Last Supper hanging on the wall?I've been here twice and it's pretty good Mexican food, for Florida.  I'm from California, so I know real Mexican food.  (I've yet to find a decent Carne Asada burrito) The portions are big for the price.  Their red sauce has some kick to it.  Chips and Salsa were fresh and tasty.Service is ok too.  Seating could be an issue if you have more than 5 in your party.I will go back occasionally, but I like to have Tequila with my burritos and this place only has bottled beer.I would say try it out and come to your own conclusion."], ["Ashley B.", "This place is absolutely amazing and very authentic.As a few other people have mentioned... when you first walk in you may think you walked into the wrong place.... actually at first my friend and I did walk into the pizza place next store!When you first walk in it looks like an old convenience store.  They sell everything from Mexican soda, to food, to clothes, to cowboy boots (which looked very cute).  If you are brave enough and not too nervous you continue walking and a familiar sight of tables will be within view.  This is a small place, it has two tvs usually playing Mexican soap operas.... about seven-ten tables, and a run down atmosphere.  As soon as you sit down you'll be greeted with fresh chips and salsa, always a plus!  The menu is in English, and very authentic.  We got the nachos as an appetizer and ended up having them for the majority of our meal.  The nachos were huge and absolutely amazing.  Highly recommended.  They come fully loaded with chicken and beef.  After munching on our nachos we ordered three sets of tacos: tripa(tripe), lengua(tongue) and chorizo.  All three were amazing and not your typical tacos.  They come on soft shells, which was also a plus!All in all this place is five stars all the way.  If you like Americanized Mexican this isn't the place for you.  And if you are into fancy clean restaurants, this also isn't the place for you.  The food is delicious, the prices are cheap, and the atmosphere is authentic.Highly recommended.My friend and I have been talking about those nachos for two weeks now and how we cannot wait to make a trip back!"], ["Bob N.", "Came in for lunch and it was as advertised. Nothing fancy, just great authentic tasting Mexican food at a very reasonable price!"], ["Henry L.", "Happen to be in the area again, and it was just as delicious as when I first came in 2012."], ["Richard S.", "This place has very good mexican food me and my coworkers are from California out here doing a job and all the Florida mexican food places do not compare to what we are use to in downtown Los Angeles but this place tops all local mexican restaurants."], ["Julian D.", "Best Mexican food in town, I highly recommend this place.Tacos is a must and the chili was perfect.Mexican atmosphere and great service.Authentic Mexican food."], ["Al N.", "I had the chorizo tacos and they were excellent. The food seems legit but the service was not good. The decor is not and issue..its simply a good food place sharing space with a mini mart type of store. There plenty of \"mexican\" place to woof down nachos and get drunk.  This is not one of them. If you go here you go for the food. This place would be a 5 if it wasnt for the server."], ["Robert R.", "What?? There's a restaurant here??? Passed it 1000 times, never knew. Tried the nachos per Yelp users. AWESOME!! Don't bring your first date here, or there won't be a second!! But do bring your better half an appetite!! Had to stop eating to write this so that I could make room to finish these nachos!!"], ["Matias H.", "This is the only Mexican restaurant that I know off in the area that serves authentic tacos.  For $2 each, they are fantastic anyway you like them.  They are served on a soft shell with onions, cilantro, and lime.  We usually eat them with carnitas or carne asada.  You have to try their Salsa Verde and Red salsa they keep in the refrigerator.  I know you walk into the place and it might look like just the store but if you keep walking left, there about eight tables and full kitchen.  If you want authentic Mexican, stay off the gringo menu.  Also, take a look at their specials board."]], "Pepe's Hacienda & Restaurant": [], "Los Loros Mexican Restaurant": [], "Lupita's Mexican Food": [["Frank A.", "Great food. We been coming here sense our daughter was 6months old. Now she 4 going on 5 and they pretty much watched her grow up. Love the service and food. Can't pass this place up."], ["Michelle M.", "I can't believe I haven't yet sung the praises of this family owned and run restaurant. Service isn't fast but it's friendly. She doesn't just know me but she also recognizes my extended family too. It's almost embarrassing how often we go. Actually, Mexican is not my favorite. Not a fan of Mexican food but for some reason Lupita's is an exception. Maybe it's the chile relleno that makes me say \"yes Ma'am, may I have another?\" My kid loves the California which is roughly the size of a small baby swaddled tightly in a burrito. I laugh every time they haul it to the table. So look...all the snide remarks about Old Arlington, personal ethnic background, or a  CA zip code aside...go for yourself and  check it out."], ["Rebecca N.", "Lusitania and her Husband are as sweet as can be. The food is authentic, the prices are good. No margaritas will be found here, but I do believer they have beer and maybe wine. I love supporting my favorite places, Mom & Pops establishments. I dare you to try it."], ["Nyla S.", "Unfortunately I did a factory reset on my phone and deleted the pictures that I took at the restaurant, but soon I will return and upload pictures!Let's get started:Lupita's has this authenticity about it, from the aroma to the waitress, and cook. We came in around 5pm maybe 6pm and it was a bit dirty. Let me explain dirty though, there were tables that needed to be cleared and a pile of dirty dishes stacked up along the wall. There's also quite a bit of clutter.BUT the complimentary chips and salsa were amazing! And the nacho supreme appetizer was good as well.... Oh, and the Mexican cheese is to die for! My boyfriend's California burrito with steak was AMAZING! It's so big that three people could've shared it! Oh how I wish I still had that picture! We will definitely be returning solely for that burrito!I ordered the carnitas, it was okay. In my opinion Ole Mexican Restaurant on Atlantic near Regency Mall has a way better pork! Flavor and all!But, if you're in the Arlington area and you're craving Mexican, come to Lupitas for their California burrito. They offer a chicken, steak and seafood one!Happy Yelping..."], ["Angela B.", "This place has the best cocktel de mariscos. Their fish tacos are yummy too. It's a hole in the wall but I recommend them if you like seafood. The owner is a sweetheart too!"], ["La K.", "Food was ok not really what I expected but I guess it's because I choose a salad. I recommend the burrito which my husband had it was good."], ["Amanda T.", "This place is literally a hole in the wall. Even more because it's located in Arlington. Not too sure about cleanliness of the place but sometimes you can view that before you even sit down. And if you know it before you order, than your fault. Run by a husband and wife who are very kind. The California burrito is uh massive. When I say massive I mean it, I think I posted a photo with a size of a chip next to it. It's good but the real high light is the tacos!! If we ever get back over there it's the tacos we'll always order. Fresh ingredients and quirky place. If you lived in Jax I'd tell you to check it out but it's not a place I'd take you to if you were an out of towner."], ["Anthony Z.", "Man you know,  this place really has potential.  I truly believe we came at the worst possible time.  Long long wait.  LONG!  But it was in fact the owners only that were working.  And pops was hustling around the kitchen.  But people we are talking a long time.. I got 3 tacos authentic.  Carne asada and AL pastor.  Burnt.  Man I was hoping for so much here.  It has the vibe,  the people behind the counter(not tonight lol)  authentic.  But it was a bad time.  Someone didn't show up,  possibly one of the children.  Who knows.  The fajitas texanos was huge and and although the skillet burnt the onions in the end the steak and chicken were pretty good and juicy....  Going back!"], ["Hilary J.", "As a Californian, I am extremely picky with Mexican food. Poor Lupitas just didn't cut it. If you like Americanized Mexican food, Lupitas is a good choice.We were given a good amount of chips and salsa, but we had to load the salsa up with salt and pepper and it was still boring. Our nachos supreme and fajita quesadilla were loaded with lettuce, which is super not-authentic. The nachos had ground beef.The fajita quesadilla was better, even though the steak was chewy. Overall the food was fine, though I wouldn't be excited to come back and eat here. There were three saving graces: a cold bottle of sangria and the restaurant is clean and the walls have fun murals. And the staff was very kind and spoke Spanish with me."], ["Terra S.", "This little unexpected building serves up some good authentic Mexican food. When me and my brother came we were the only customers at the time so I was a little eery but I'm glad we stayed. We got two meals and two sodas for $20. Our server who's probably the owner or someone close to it was sooooo sweet and she actually spoke Spanish, and being that I've lived the past 5 years in Miami I felt like I was right at home! Two thumbs up"], ["Ashley H.", "Lupita's is a gem! Delicious, made to order Mexican food. It's not much to look at but don't be fooled... this is some of the best Mexican food that I have ever eaten! The only reason I gave 4 instead if 5 stars is because the service is very slow. Don't go on your lunch break unless you want to get in trouble with your boss!"], ["Bill K.", "Took my wife here for lunch today on the advice of one of her co-workers. I'm so glad that we went there, the place was that good. The place was very clean and the staff spoke accented but nearly flawless English. I ordered the #17 lunch special (steak burrito) and my wife had the #2 lunch special (beef burrito,) both were very good. The rice and re-fried beans were very tasty and hot, the Mexican salad with a dollop of sour cream and guacamole was very fresh. The total cost of our meal with 2 iced teas was $15.25 a real bargain for what we received. Lupita's is located in the old University Diner building 1/4 mile north of Arlington Expressway on University Blvd N.I highly recommend Lupita's Mexican to anyone who wants good Tex-Mex food, at a good price."], ["Penny M.", "Authentic , awesome and delicious! We had the California burrito and it is big enough for two people. Family friendly little place tucked away in Arlington .very reasonable pricing and good service . I have also had the lunch fajitas and they are good too. It does have that \"hole in the wall\" that scares some people."], ["Stephanie T.", "My mom lives right next to this place, so Lupita knows us and we're regulars.I absolutely love the food, the service and the atmosphere. My mom always gets the chile relleno and she loves it. She tends to avoid meat when she can and this chile relleno has small amounts, if any.I always switch it up. The enchiladas suiza is delish though. Spicy green sauce on top and portions for the undefeatable! There is also an option to get a whole fried fish. My brother opts for this usually and although you have to do the work yourself - it's literally fresh fish tacos - right off the fried fish. CHECK THIS PLACE OUT!!"], ["Redner S.", "Lupita's is a little hole-in-the-wall in the Arlington area. The California Burrito was huge and had great flavor. Additionally, the customer service was great! It did take a bit of time to get the food but it is because everything is made fresh and Lupita is running pretty much everything in the restaurant. Lupita is such a sweet lady!"], ["Mrs. Marisol R.", "Our daughter went to see Sleeping with Sirens at the Pit across the street and so we needed to occupy ourselves for a bit of time. I was disappointed with the food, but it wasn't as bad as Nopalera.Pros: * Very, Very friendly staff, I mean just very sweet* Safe feeling environment considering the neighborhood* Band came in and ate before their show. Polar Bear Club I recall - that gave it a fun and funky vibe.Cons: * Guacamole had so many BIG chunks of onion, it should have been called green colored onion dip. May have been good if it were onion dip people actually eat (like French onion dip), but no one makes a dip out of 1 inch cubes of raw onion.* The California burrito was not a California burrito. I am very confused on why the Mexican places here think a California burrito is a wet burrito but here is what a California burrito is: Meat, Cheese, Avocado, Lettuce, Tomatoes, Sour Cream and FRENCH FRIES!! yes, french fries. How do I know this? Because I lived in California for 24 years and that is what people in California call a California Burrito. Sorry for the rant... Okay, The rest of the food was pretty good. The salsa was okay, the mexican tacos were just that, and my fish taco was very, very good. Food was a 2, attitude bumped it up to 3"], ["Rolando O.", "Not being from the area had a heck of a time navigating through Jacksonville to get over into Arlington, but we were glad to find it. A nice maintained clean little whole in the wall type of place. Seems like a place the locals know, waitress was very friendly and accommodating. Menu has lots of typical items you would expect. I had the chorizo breakfast, which was a plentiful portion good mixture of eggs and the Mexican sausage. Came with typical refried beans and rice. The chorizo was the right amount of spicy and the beans where creamy with a nice layer of cheese covering them. Not a bad place when you really want some authentic Taqueria food in the Jacksonville area."], ["Damian D.", "Very quaint family-run, home cooked food. Lupita herself waits tables and her husband cooks your food.So they've Americanized their family recipes a bit to suit the Jax area. It's still fresh cooked and with plenty of love.We had the spicy delicious Shrimp Diabla, a decent fish taco, and the seafood platter. Paired with salsa (I added some yucateco hot sauce from the bottle on the table) and ice cold Negra Modelo's it was a satisfying lunch."], ["Samantha K.", "I really like lupitas. The service is friendly and fast, the food tastes authentic, and the prices are good--especially the lunch specials. I love their beans and rice. Chips and salsa come automatically to the table when you sit down. The atmosphere is nothing fancy but it goes with the food and prices."], ["Ruby A.", "My niece and I were craving Mexican food, so I Yelped the nearest Mexican restaurant and ended up sitting our happy butts in this lil joint.  I had the tacos al pastor, which was soooo yummy!!! Will come back when I'm around that area :)"], ["Nina I.", "Family business, with one waitress.  She dosnt speak much English. We have visited here a few times.  Recommend visiting during lunch hours, or if they are busy.   Food is freshly prepared.  When I am craving 'real' tacos (not crappy taco bell tacos) this is the place to go.  The salsa is yummy too."], ["Erin K.", "My new favorite Mexican restaurant. I had the chicken taco salad and flan-- both delicious and fresh."], ["Jay S.", "Perhaps it's because I moved here from sunny San Diego where you can get real authentic Mexicsn food, but this ain't it folks.In the rather dicey Arlington/university area in a kinda run down building, this sit down restaurant is pleasant inside and the waitress that served me was very sweet natured.She served a basket of a bit greasy and stale tortilla chips along with a bottle of salza...mostly chopped tomatoes with a touch of onion and cilantro.I ordered a steak burrito lunch plate that consisted of mostly shredded lettuce, some Spanish rice with a small dollop of cream fresca and chunky guacamole. The burritto should be more accurately described as a burrittocito it was so small, doused with an odd cheese sauce and partially filled with bland chopped steak of some kind.Lunch prices were good but Chipotle is a much better food value.With these great reviews here on Yelp for Lupitas  I was hoping to find myself a good Mexican but I doubt I will be back anytime soon."], ["Steve Z.", "Visiting from Cincinnati and gave Lupita's a repeat visit.  Excellent Mexican food; huge California Burrito and perfect Relleno with right level of spiciness as two examples.  All five in our party (who are picky and not easy to please) were happy and full.  The service was incredibly slow however - maybe they were just short staffed.  Will continue however to pick Lupita's for Mexican when we are in town."], ["Eric S.", "I've been to this place numerous times and food taste good to great most of the time. It tastes home cooked and like the steak quasadilla the best. Many Hispanic folks go here too so that seems to be a good sign. However, service can really be slow during lunch hour as they seem understaffed. Oh, parking space is also relatively small"], ["Lauria T.", "Best Mexican We've found in Jax!  Family run with a really good chef. Homemade corn tortillas! Yummy! We go all the time. Super affordable too."], ["Harrison J.", "Lupita's Mexican Food is a great Mexican place. I simply love Lupitas. The food is great and the staff is quick and courteous. Summary: this place is great. Go there for lunch with a few friends, get a fish taco, rice, and beans. Enjoy the good Mexican good.Read on for more detailed review: Food: I suggest the fish tacos. They are amazing. They are all I order nowadays. The fish is crispy and lightly fried. Also, the tamales are quite tasty. What ever you get, get it with a side of rice and beans. My only issue with the food is that the enchiladas and the burritos look and taste the same. Drink: Sodas and water come in a giant cup (ie, you aren't going to need a refill) which is nice if you like your soda. I haven't tried the beer there but I imagine they are priced well. Refills come quickly.Staff: the staff is nice. They are quick to take your order and they are quick to bring the bill. Atmosphere: the place generally doesn't have many people in but don't let that put you off. There are plenty of places to sit down. The place is a bit dark. Parking: Parking @ Lupitas is a bit tricky. They have their own lot in front but there is no dedicated turn lane to turn into the lot from the other side of the street. Keep this in mind, you may choose to use the middle lane anyway. The traffic can be bad so be prepared."], ["John F.", "I've lived in San Diego most of my life and I can testify that this is the best Mexican food in Jacksonville and probably all of Florida. If you like real Mexican, try this place."], ["Jennifer V.", "I love this place. Being half Spanish half Mexican and to find real mexican food is great they are very friendly and the portions are great!"]], "Lola's Burrito Joint": [["l b.", "The empanadas are very tasty and equivalent to about 3 regular size ones! A good deal and nice appetizer. I can't wait to go again to try the other varieties of this tasty treat. The fish taco was average; nothing special in the flavors or preparation. The fish was improved by the sauce but couldn't stand alone. My fiance enjoyed his giant burrito, which he ate nearly 2/3 of and took the rest home. Neat atmosphere with the recycled auto art on the walls."], ["Andrew G.", "By far one of my favorite places in the Riverside area! Great food, love the tacos the most!  And great drinks, even tried a one of a kind guacamole tequila shot one night.  We come anytime day or night and get great service."], ["Trixy G.", "2nd time...amazing macho nacho...Chooie'sChimmy ..mex. Street corn..shut up...I have a food buzzzzz...food & atmosphere a 5...service a 3.5.."], ["Billy D.", "This restaurant is truly something special!  The entire staff (bartenders, servers, kitchen staff and the owner) consistently go the extra mile to ensure the food is excellent, drinks are fantastic and hospitality is first class."], ["Mailena O.", "The food is good but the customer service is awful!!! You don't tell people in wheelchairs that they cannot be at the end of the booth as it was blocking the servers from accessing the tables. Walk around!!!!! Seriously!!!! You are a public establishment that should be able to serve your customers able bodied or not!"], ["Kathleen P.", "Great service! I had the shrimp but no papers burrito and it was exceptional! My husband and I shared the chips and queso and it was so good I took the leftover dip home!"], ["Thais A.", "Worst staff ever! Honestly, the food here is pretty good. I've had their pineapple salsa and chips, the skinny fries and the chicken nachos. Everything was delicious and so were the drinks. Nicely prepared and the combinations are super unique. With all this being said I don't think I will be coming back again. The first time I came here it was a 45 minutes before closing. The server was non-existant. Kept rushing us to put in an order practically kicked us out the door after we paid our bill. I was pissed but I understood where they were coming from. This week I tried the place out again. I cam in the afternoon, around 3pm. There was no one at the front so I looked at the bartender and he told me to sit wherever I liked. I waited 10 minutes before the server came over to the table. I ordered a beer and again waited another 15 minutes before the beer arrived. I asked the bartender to switch the channel and it took him 20 minutes to find the time to do so. They were not busy. I counted a total of 5 tables in the restaurant including the table outside. Everyone just had a lousy attitude. Like they were having the worst day of their lives and the last thing they wanted to do was be there. I'm not sure who owns this place or who the manager is but it seems like they need to find a way to treat their employees better. Like I said before, the food is good, but I just cannot handle the poor service and attitude from the staff."], ["Mike P.", "Great little restaurant for anything Mexican! We hit this place for brunch one day and were super surprised of how good it was. Fried corn on the cob, the yucca fries, and probably the best shrimp tacos I've ever had! I would definitely recommend this place morning noon or night and we will definitely be back! Btw, my two children are probably the pickiest eaters I've ever met, and they couldn't get enough of the cheese and meat kids tacos."], ["Leticia C.", "Kitchen service sucked messed up my order three times! Waiter didn't even try to comp bill or discount tab because they're not a 'chain' restaurant, I had to suggest to him to get manager to see b/c that was ridiculous! But they finally decided to split 1/2 of burrito price"], ["Sally K.", "Our go-to spot in Jacksonville. Half off margaritas from 4-7 on weekdays.I recommend the Pablo Cu-cumbian with a dash of extra Tabasco. Also. The cheese dip is super addictive. And the pineapple salsa equally delicious. As far as tacos, try the fish or shrimp taco. Burritos: if on a date, make it interesting and try to split the wet Willie. Empanadas, the sweet potato is yummy with some local hot sauce on top. Seriously. It's all delicious. Friendly staff. Some of the best in Jacksonville."], ["Jason L.", "Great food, great service.  Got the quesadillas they were excellent.  Its in Riverside and you can actually park there. We will be back."], ["Caron S.", "After reading many subpar reviews, we were skeptics and stayed clear of Lola's for the last few months. Finally, last night we bit the bullet and were pleasantly surprised.3.5 solid stars. It's not life-shatteringly amazing but it was indeed good, and our food was tasty and portions were generous.While we paid for chips and salsa to start, they were good. We also ordered queso and it was good - thick and way too much for the amount of chips. We couldn't finish it all, even after inhaling the chips.The ragin' cajun gator taco was the standout. My ginger tofu and his carnitas weren't worth ordering again, and were plain. Ragin' cajun is a must! The cabbage isn't shredded on any of them; rather it's cut into small confetti-like cubes. The sweet potato and black bean empanada was another hit: slightly sweet, slightly crunchy, and equally parts delicious. Would order this again.The man had a burrito - which he asked for enchilada sauce and sour cream - both extra costs. Our waitress was nice to let us know this up front before placing the order, after he'd asked for them. The burrito, complete with chips, was massive. He didn't finish it. He also ordered a side of rice, which was an ample serving. Again, too much food.The atmosphere was laid-back and they had a nice beer selection. Our servers and the bussers were friendly, knowledgeable and attentive. It appears they've worked out many of the kinks other reviewers have noted."], ["Kevin L.", "Love the shrimp burrito smothered in queso. You must try the pineapple salsa for the right kick.  Get there early on Friday because they get a crowd."], ["Kelli P.", "Had the Mexican sweet corn.   It has potential based on the menu but fell flat.  The shrimp taco was not flavorful.   Service was just okay.  Will not be back."], ["Victoria V.", "A great little place in Riverside! My boyfriend and I checked this place out on a whim and we were very pleasantly surprised. The food is awesome and as a plus they have a wide selection of beers. On this go around I had the baa baa baa which is two lamb tacos which were delicious but they could have used just a little less of the yogurt chimichurri sauce. The lamb was cooked nicely and the tortillas tasted nice and fresh. The leaping lizard that he ordered was so good, which if you haven't figured it out, this is a burrito with rice,fried gator, black beans and an amazing cajun ranch sauce. The service was great, especially considering we came in after 7pm on a Saturday night. We will definitely be back to try more of the menu."], ["Anna H.", "Ok I was just here 4 days ago, and this was the week I proclaimed a moratorium on eating out for a spell.  Well so my  for resolve.  It's way overrated anyway.   I needed comfort food so I came for the corn and burgers.  The couple across from us insisted we need to have the deep fried pork chops.   That sounded a little too dangerous for me so  I was compelled to look at something other than burgers.  My companion only  there to support me kept it simple. 1 Corn and 1 Baby taco.  Not me I was emotional and needed food;  1 Corn and the Chillies Relleno; chicken, poblano pepper, deep fried with jalapeno cheese sauce.  Hell I should have had the fried chops!  Well being a well  documented non Mexican food fan I now will happily cross that boarder and expand my thinking.  Deadly is the onky word that comes to mind.  And I mean that in the very best way possible.  Server with the most well seasonedl black beans I have ever tasted and a side of mixed greens covered in the cheese sauce as well.  WOW....I'm sold. I do have one negative statement, more  a pet peeve and I will use this experience as the example:  we both ordered the corn, servers and kitchen staff PAY ATTENTION! !!!  Don't bring 2 painfully obvious different portion sizes.  Bring 2 big or 2 small.  My friend had the big corn and I had this anemic cob that looked to young to be eaten.  Nevertheless the experience was A#1 and I will rejoice in Mexican fare at Lol as in the near future."], ["Mandie M.", "The first time that I had Lola's it was picked up and taken out. I didn't feel that I could write a review without having actually experienced the place itself. Today was the day that I finally experienced Lola's in a sit-down perspective. I went with a friend and we both ordered burritos. My burrito was tasty. I got the BBQ Chicken with no cheese. It was perfectly spicy and sweet at the same time. If I needed additional spice, there was hot sauce on the table (three different kinds, actually), but it was not required as the burrito was just right. The chips that came with my burrito were an excellent addition as I used them to scoop up any droppings on my plate. The serving is huge and I could only eat one half of my burrito and had to bring the rest home. The only qualm that I have was that my burrito seemed to be on the soggy side. I hope it's not too bad when I go to have the rest for dinner.The waitresses were kind and friendly; very welcoming. The place was packed for lunch, but there were a few open tables left plus the bar. The waitresses did not seem stressed at all with such a full house. As it was in the middle of a week day, I did not partake in any alcohol, although, I did glimpse their drink list and it is huge. I really dig their deco. The Day of the Dead female mannequin on a motorcycle, in the middle of the restaurant, is my absolute fave."], ["Cari B.", "Oh Lola the things you do to that street corn could drive a woman insane !! It's deep fried rolled in some kind of creamy delicious sauce then coated with cheese and sprinkled with cilantro ... Geez so flippen good !! The carnitas taco was very tasty as well . The salsa you do have to pay for but to me it's one of the best in jax so I don't mind . This is def a cool little place with a fun vibe . I'll be back for sure cuz Lola has me wrapped around her little finger w/ that street corn ."], ["Ariel M.", "So I stumble cross this burrito joint after fighting my way out of the mad house that is tacolus out by the beach. Very cozy. First thing you notice is a giant motorcycle hanging from the ceiling. Second thing is the oversized booths (which I'd come back just for that) seriously you can fit at least 8 friends in one. But on to the food. Very speedy prompt service. Clear cut menu. Cost for cheese a little steep but great place to eat. Watch the game and listen to an AWESOME playlist. Definitely come here. We ordered the wet Willie burrito(2lbs of delicious) and mucho nacho with chicken"], ["Jack B.", "Went back last night, as we usually do for this place. we go at least once a week. We had queso, chirizo and chips and a few drinks and that was enough. We normally sit at the bar, but its a great place to sit anywhere and enjoy the atmosphere and people coming and going. Nice to see this neighborhood place doing so well."]]}