{"Antojitos Colombianos Panaderia Bakery": [["Shawntae W.", "I needed something to eat really quick but I had no clue what was around I pulled into the parking lot and saw all these people running in and out. I went in and never wanted to come out. I had the fried pork, it looked like a very thick piece of bacon, my GAWD it was good!!! And a potato ball with meat inside and empanadas, I'm sad because I think they're closed today. I can't wait to try more. The place is as big as a closet but HONEY the taste is as big as a MANSION!! Love it love it love it"], ["Alyssa P.", "Place is very small and had a handful of food items on display. I wanted to try the empanadas but there was only one left. I was told 6 mins for a fresh batch. I also ordered a baked cheese bread since that was going to be done around the same time. I ate the bread as soon as it came out of the oven and it was very good. Interior was gooey with cheese. Wished I had ordered more than 1. Ate the empanadas at home. The beef and potatoe filling was seasoned to perfection and crust was nice and crispy. Went well with the green hot sauce that you have to ask for. The one sweet item I ordered had cream cheese filling. I wasn't a fan, had a strong dairy smell and cream cheese wasn't sweet enough. I would definitely order the empanadas and cheese bread again. Staff was helpful and friendly."], ["Vanessa T.", "I love columbian food.....in saying that... Everything I have ever gotten from here has been delicious!   The cheese bread  (pan de buno ? ) and empanadas are rediculously  good.    But we usually stop in for lunch and just get the special..... What ever it is it will be good........ Funny story.. Neither me or my husband speaks Spanish.. I know a Lil Spanish pertaining to the food because I love it so much.....we went in for lunch.... I ordered especial,  my hubby tried to order something else,  they just looked at him and said \"especial? \" lol.... I told him you're getting the special..... They don't speak much English in here and menu in Spanish,  hopefully someone in there can help translate. Another thing is they only make so much food each day,  so when they run out that's it for that day,  so go early if your set on one thing."], ["Mrs. Marisol R.", "I came here a bit late in the day. Around 3:30pm on a Friday. I knew many of the pastries would likely be gone, just having read some of the Yelp reviews. I had two distinctly opposite reactions to the menu being entirely in Spanish. The menu was on the wall only, so if someone was behind you, and you can't speak a lick of Spanish, it can feel a bit unnerving. I ordered the only two things I recognized and sat down. I had read about the empanadas and the cheese bread. So that is what I ordered. I felt the flare of frustration in trying to read the menu. I felt like they could probably make more money if all the customers could read the menu. On the other hand, not speaking Spanish forced me out of my comfort zone. I struck up a conversation with a lady who was there with her two teenage kids ; she was friendly and helpful. She even translated for me when the owner came over to discuss my satisfaction. This is a good thing... interacting and depending on the kindness of others. The individual cheese bread was very good. I did order a full family sized loaf to go, but it had a different texture from the smaller \"puffs\". I much preferred the individual cheese breads. The empanadas were fried just right, with a crispy exterior and a melt in your mouth potato and beef filling. I was not expecting this filling, as all empanadas I have eaten in the past were made with ground beef (my gringo side talking here probably). Still, its what I'm used too and I missed it. The sauce that came with them was spicy, but not too spicy and fragrant with cilantro. The perfect accompaniment. Sadly, I thought that it came with the cheese breads too, but it did not :(All in all I really enjoyed it and plan on bringing the family for a breakfast one day. I hear they are off the chain."], ["Elizabeth M.", "I can in here with the hubby on his birthday just to get some Colombian pastries to go with our boba. I don't know why but I felt a little awkward walking in, maybe it was the way the lady at the counter was just staring at me or the fact that as we tried to walk in we had to walk  around the bar stool that was in the way of the front door. Next step were the bakery item, they looked delicious!! We got two cheese pastries, two guayaba and cheese and then one that was just guayaba. We also got a buñuelo, and two beef and cheese empanadas. All in all we paid a little under $12 for all those goodies and that is an awesome price in my book!Now the taste test, the empanadas were delicious!! Although the inside was more of a beef and cheese mash, not what I had expected but good none the less. The cheese pastry was good too it could use a little more cheese but it was good nome the less. It was soft and chewy and I think my sugar crystals kinda melted with the florida humidity because it was almost like a sweet syrup glaze in the outside of my pastries. The buñuelo I was not so hot for. I asked what it was and she said it had cheese inside, now I can overlook the fact it had no cheese but let's just say it didn't get eaten while the rest was devoured. Overall I'll definitely be going back to try the food since they passed the bakery test. Now if they could not make me feel awkward when I walk in or at least put on a smile while I'm ordering."], ["Danielle R.", "This would have gotten 5 stars if the arepas were available for lunch. I came here craving some areaps and was so excited when I saw all of the different varieties on the menu, only to be quickly disappointed when the server told me they were out of all of the arepas and that they only had them for breakfast. I settled on some empanadas, which were filled with meat and had a thin and crispy crust, very close to the ones I recently had in NY so I was super excited about them and for the price I definitely was not complaining.I suppose if my areapa craving does not go away soon I will wake up extra early to stop in during breakfast and get them while they're hot!"], ["Ernesto M.", "Excellent empamadas colombianas. The chicharron, arepas, pan de bono, everything is good and the people are very friendly"], ["Sayaka B.", "I'm a Japanese but I love South American food which was hard to find in Japan. I never seen any colombian restaurant in Japan so I was curious. I love Pan de bono, Arepa con queso and chicharron!!! I highly recommend pan de bono for a light snack!"], ["Ingrid S.", "I love this Colombian place. The staff is very nice and they make you feel like home."], ["Paul G.", "Very delicious food. It has homemade flavor to it and then some. The place might be small, but it constantly had people coming in and it wasn't slowing down. The meals were exquisite and served in a timely fashion even when they were slammed. The Saturday special Mondongo soup actually contains plenty of meat, something the Mondongo that many restaurants in the area that serve it, lack.It is a bit far from where I'm at, but I'll  be sure to try it whenever I'm in the Baymeadows. It looked a bit messy, when I first came in. The only table available at the moment was full of empty soda bottles, but an employee came and cleaned it before I even approaches them about it."], ["Dani V.", "Finally! A legit Colombian place where I can fill my craving of empanadas and not have to fly to Colombia. Even though that would really be the best bet. Being half Colombian and half German, I was given the German looking genes so I certainly don't look Hispanic. Nonetheless, right when I walked in they greeted me in Spanish which was a lovely touch. Their empanada were fresh and warm, the pandebono were cheesy and moist, perfect for dipping in your coffee. We got here around 8:30am when they opened, on a Sunday, and I thought \"man, this place is like a little tienda in Bogota!\" It was little and quiet and quick. However, around 9am, after that 8am mass, all the Colombians start rolling in. this place is meant for about 20 people sitting and there was definitely a lot more than that filing in. Everyone knew every, per typical Latin style, and it was nice to walk through the door and for a few minutes feel like you're back in Colombia."], ["Alexandria B.", "Great local Colombian restaurant. Every time I have gone it's been pretty packed which is understandable because the food is good. The restaurant is pretty small but quaint. You can't go wrong with any of the baked goods or the soup!"], ["Hugh P.", "Great Columbian food and this small homely restaurant/bakery. You will be very happy you tried it. The owner,staff, and patrons are very friendly. I will be back again. See my pictures taken here."], ["Lina M.", "Went for breakfast on a Sunday and it was awful. Got two breakfast specials. The straps came out cold. COLD. WITH CONGEALED CHEESE ON TOP. We didn't get our coffees and ended up drinking the ones we brought. The fried egg came out cold. It was so utterly disappointing. Everything tasted bland except the salty carne Asada. Guess I'll stick only to the empanadas if I ever come back. Literally one person worked the front and one worked the back. Poor customer service and food quality."], ["Billy L.", "The owner was an asshole I guess thats the way to be is rude when your trying to buy a whole bunch of food the chorizo was good but it was fairly cold didn't seem very fresh. Drive to miami for some good colombian food and bake goods seems worthy for the better customer service and cleaness of the facility."], ["Jeff P.", "This place is great! Anything Colombian and it is yummy! Make sure to stop by but keep in mind it is a very small place and they get busy be patient its worth the wait."], ["I'm S.", "FABULOUS!  I was made in America with Colombian parts and have to say this is very good authentic Colombian food. I can make my own pandeyuca but when the lazy bug sets in I come here and stock up on these and the pan de bono. It's definitely my go to for comfort food taking me back to my roots. The service was just okay..the place is teeny tiny small and they tend to run out of pandeyuca on the weekends but they say you can call in an order. That's nice but when I'm craving I'm craving and I want it now!! Best is to come just as soon as they open when the baked goods are hot and fresh. On another visit I had the ajiaco and it was excellent. I love that they serve the chicken separate from the soup because I am vegetarian but I will still have this soup and just not eat the chicken. I don't eat chicken but I don't mind chicken juice and it's what really makes this soup authentic. I will be coming back often."], ["Eryn S.", "I highly suggest trying everything on the menu. This place gets super packed around lunch time. They only cook the breads once a day unless you call and specifically ask for one. The owners are very kind.The empanadas and the cheese bread are crazy delicious. The fried cream cheese desert is amazing. Please go to this place and order at least one of everything. The speak Spanish and English. YUM!"], ["Robert H.", "excellent pan the bono!"]], "Saucy Kitchen": [["Elizabeth M.", "Holy cow this place is soo good!!! The hubby, grand parents and I were just blown away by how good the food is here. The prices are amazing and really worth the portions that they give. First the ladies at the counter were very very patient with us as we decided what to order. They even offered to let me order a side of Mac and cheese for the kiddo. I got the turkey dinner sandwich and it was seriously good. The turkey slices I got were big, thick juicy slices of turkey. They were seriously as thick as my thumb! The mashed potatoes were creamy and it had the right amount of stuffing! The cranberry sauce was on the bottom of the bread and some on top too which added just the right amount of sweetness. My husband got the skirt steak sandwhich with peppers, onions and mushrooms and cheese which was really good too. For both these sandwiches the bread was toasted.My grandpa got the chicken salad sandwich and he said it had the perfect amount of chicken and that the dressing was really good too. My grandmother got the fruit and nut salad which was also really good too. The portion will really blow you away so make sure you can eat a lot of salad before getting the larger one. It was loaded with tons of fruits and lots of nuts. Really tasty.Overall, I am ashamed that I had never been to this place before but I definitely plan on coming back to this place to try other delicious sounding sandwiches because there are many yummy options and it was hard to pick just one."], ["Kaneil Smith S.", "At first a was in love with SK but now that the euphoria is gone and I have explored pretty much the entire menu. Now I'm kinda bored. The last thing I had was the steak and cheese. The steak was overpowered by the layers of cheese and it felt muddled. I also wish they had more beverage options and also more dessert. Realistically I'd say 3.5 stars."], ["Ferrin G.", "Saucy kitchen is a fine sandwich/lunch joint. Today I had the Cobb salad and it was perfect. Tons of cucumbers, tomatoes, blue cheese, bacon, and chicken. I got the mini me salad which is a full size salad for most restaurants. I've gotten the \"wow\" size and it's huge, you can easily get 2 meals out of it.Sandwiches are good but nothing that really wows me."], ["Arwyn W.", "Prices are well. Service was great and the cooks even asked how were things. The soup in my opinion was the worst I've ever had but the salad was superb. The cookies are gigantic but I didn't care for them it seemed like it had an after taste. I would definitely return for another fruit salad. Wished they stayed open longer instead of closing at 2pm."], ["Ronald C.", "I never been disappointed in any sandwiches I've tried.  The Reuben is my favorite.  From what I've seen the salads are good portion."], ["Daija P.", "I really hate to leave such a meh review but I just couldnt shake the feeling that I was eating a bag salad with dressing and soup from the can. Yes, it was ok. Yes, the presentation was fantastic, but it was just okay. My bf grabbed the cuban, but he kept comparing it to the cuban sandwhiches he's gotten from Cuban restaurants in Miami. We just left underwhelmed. I will say that the atmosphere was cute and trendy but if I stop back, maybe I'll try some of the mac n cheese or something else. This place seems to cater to the business lunch crowd, so I see why it's popular among that crowd. I'll give it another try some time later."], ["Regina C.", "Regina ChannelleThe food is great, the prices are reasonable and the desserts are awesome!"], ["Edward B.", "This place is one of the best! Huge portions, and everything always taste fresh. I have tried almost everything on the menu and I don't have not one bad thing to say about this place.  The cookies are a must, you will not be disappointed. This is one of the few places that have really good red velvet cookies. The staff is friendly and the place is always clean (which is a must in my book). This place isn't that big, but they do have outside seating as well as a few tables on the inside. I wouldn't suggest bringing a large group of people here. Keep in mind the hours of operation, (they close at 2pm with no weekend hours) it's a bad feeling when you pull up to a place that's closed."], ["Nancy S.", "Fabulous food. Reasonable prices. Great service!!! Excellent lunches and enough to share or take home for dinner! Definitely a spot you need to try."], ["Matthew G.", "It's a good place to eat sandwiches and things. I think it might be a little over priced for some of the sandwiches. Small area to eat at so you might have to eat outside. Good selection of food sandwiches though. You do get a lot of food on your plate."], ["Mark B.", "I have seen this place for a longtime now. I know it is #2 in the top yelp list. Today I made it a point to try this place once and for all. I will say that it is not the  easist place to find. it is kind of tucked away in a strip center. it is also near my favorite fish store so I knew where it was. The place is let's say loud in color.   Bright florescent green as a matter of fact.The people were helpful is making my decision on what to eat. The jacked up pastrami was me in between bread. Rye bread, pastrami, cole slaw, mustard, but they lost my at potato strings. That one didn't do anything for me with the sandwich.the pastrami is a store bought roll that maybe they slice it themselves. I'm sorry I'm a stickler for fresh made meat products. They don't make it but not many folks do. The sandwich as a whole was pretty good it was just like everyone else's. I will be back I'm sure but it won't be for the all jacked pastrami. Maybe something else."], ["Rob R.", "Great place to eat, great quality and was prepared quickly.  Great service too. Will be back and will tell coworkers"], ["Asher P.", "I rarely, if ever, pay $9.00 for a sandwich and feel that I got my money out it. But I felt as if I got every last penny out of my Double meat BBQ sandwich from Saucy Kitchen.I'm new to Jax and this was first time coming to the Saucy Kitchen. I will definitely return to try some more sandwiches."], ["Kelly M.", "I'm not going to lie, I've eaten the Fruit and Nut salad 3 times this week. We had it delivered to work and there has been no complaint! Everything my co-workers have ordered, they have loved, but I haven't made it past my salad. Huge portions and very fresh ingredients!"], ["Kym G.", "AMAZING food! I had the mac and cheese. It was enough for about 2 people! Big portions!! It was creamy and so good! The bread was not soggy and its toppings complimented it well! I also had the strawberry limeade to drink. That was also very good! For dessert, we had the cookies. They were giant! Nothing short of amazing. I will be going back for more!"], ["D W.", "This was my first visit. Had the Tex Mex sandwich with a side salad. The sandwich was very good. The roast beef was tender and the combination of black beans and yellow rice with melted cheese had a great taste. The bread was not real hard, lightly toasted so it didn't feel like i was chewing on a brick. The salad was fresh and the balsamic dressing was really good. Saucy Kitchen is on the menu for lunch from now on."], ["Marko M.", "I think I've eaten more shellfish in the past 3 days, than I have my entire life out here in Jacksonville. That being said, it was time to switch it up a bit. I found this AWESOME little joint called \"Saucy Kitchen.\" This place is IT.  Open-face gourmet sandwiches at their finest! I only visit this part of the state every so often, so this is going to be a \"must-have\" whenever I'm here! I ate: Double meat BBQ fork & knife sandwich, with all the fixins. Side salad instead of potato chips. The portions are great, a big guy like me handled the meal and was totally satisfied at the end. Service was quick, and curtious. Food was fresh and hot too. Go!!!!"], ["Christian H.", "Bring your appetite. Excellent crave-able lunch with healthy light options as well. Perfect spot to come with coworkers or grab a to-go order."], ["Moni A.", "This place is GOOD!!!!! From the moment we walked in we felt good, we were greeted with genuine smiles, we asked lots of questions and the cashier was so pleasant and friendly. You order and take a seat and then the very friendly server brings your food. I like this order for lunch because it's just lunch. Well, the food was GOOD! We ordered tomato Gouda soup, rich and creamy. I had mushroom Brie soup.. So good ... Side Cobb.. No bleu cheese for my liking.. They kindly kicked it off for me with no prob. Thanks for not judging my taste buds saucy! AND WE GOT THE CUBAN, yum. AND WE GOT THE REUBEN, can you say tasty?? The portions were very generous and the chef came out and said hello. The staff is very attentive and busy.. Not all over you but glad you are there. I can't wait to go back!!!"], ["Julie C.", "Great little lunch spot. I had the mushroom Brie soup (really good), and the fruit and nut salad. The salad had honey roasted peanuts on it, which was kinda weird, but good otherwise. Everything seemed very fresh and the staff was friendly. I would definitely go back to try other menu options since everything looked tempting."]], "13 Gypsies": [], "Pisco's Restaurant": [["Irene M.", "It was a bad idea to choose this place for dinner today. We waited 45 minutes for food because waiter put wrong order in. It can definitely happen but wasn't handled well. Food was OK, not great. I really don't care if I get an oversize meal if is not that good. Second time there, first wasn't a good experience and second was awful. Not going back. By the way I believe Server had major issues and got most of the responsibility.. I m not sure there is management because we did not see anybody else who we could talk to."], ["Carla C.", "Was AMAZING! really good food i recomend 100% we ate Papa a la huancaina, Ají de gallina, Arroz con mariacos and tallarines verdes. And i from Perú so i know! que ricoooo!"], ["Lucy H.", "This place called my attention based on previous reviews, but I came here myself and tried out lomo Saltado. The meat was very bland and no flavor or spices that I'm used to on this typical plate and way more potatoe on the plate then meat. El arroz con marisco was lacking marisco as well and the rice was over cooked. They do not have traditional \"Peruvian cremas\".  Maybe they were not having a good day."], ["Sharra S.", "Im sooooo glad Pico's is still open. After recently traveling through Peru, it takes me back there and i have a whole new appreciation! Just incredible dishes and the staff is very nice."], ["Debbi C.", "Well....I'm going to start with service; it was great. Very friendly and made suggestions,as well as, brought us some very good  freshly made hot sauce.It was quite busy for 230 on a Sunday. Only one table was open. The food was fresh and authentic I'm sure. My husband had aji de gallina (chicken and potatoes in a nutty sauce) and I had lomo saltado(beef, onions, tomatoes and fries with done kind of sauce.)  Both came sides of rice. Neither looked very appetizing but tasted good. Mind you, we have never had Peruvian food. It was good, but I can't see going out of my way to come here again. It just wasn't our thing. If you like Peruvian food- go! By all means. The bathrooms were clean. Decor lacked but the food and service were good so it must work for them."], ["Gayle S.", "Delicious! Ceviche Mixto was great! Stir fried rice Mixto, yum!  Food came quickly, so service issues seem to be resolved. Friendly, helpful wait staff. Would definitely come back!"], ["Kevin C.", "Solid Peruvian food in Jacksonville.This is the only Peruvian restaurant my girlfriend and I go to.  We've never been disappointed with the food. I would say the only thing that stops us from coming here regularly is the prices.  Prices are a bit too high to come here very often or as often as we would like, but whenever we decide to go we are always very pleased with the food.I've tried a number of their dishes, my girl friend loves the ceviche (sometimes she would like more tigers milk...the citrus juice the ceviche sits in).  We always order the chicha morada when we visit... awesome purple corn drink.  I always order the lomo saltado, bistek ala pobre, or pollo ala pobre.  We always start with the papas a la huancaina.Giving 5 stars for being the only Peruvian restaurant we go to where food tastes like authentic Peruvian cuisine and also being conveniently close.  The food is great, prices are competitive."], ["Tyson G.", "First time attempting Peruvian food but was pleasantly surprised. Many seafood and unique dishes to attempt. I left the decisions up to the staff who were more than eager to let me sample a few of their signature items.  I snacked on a roasted corn dish as I waited on a tripe and rice entree.  Both were fantastic with some accompanying sauces with some kick. The tripe was much more tender and seasoned than some French attempts I've had in the past. Great staff with some traditional knowledge. A wonderful place to try some new things."], ["Christine I.", "My boyfriend and I were searching for some fresh seafood this past Friday night and came across this gem on Yelp. I love finding holes in the walls like this where everything is so fresh!  We went straight for the ceviche, and, upon our waiter's recommendation also ordered a fried fish/shrimp/calamari platter adorned with pico de gallo. If you do not like onions or lime, this place is not for you! However I love everything soaked in  onions and lime, so this is great. Every piece of seafood was a good size portion and fresh. The fried fish was so crispy yet lightly breaded enough it didn't take away from the flavor. We finished off with the rice pudding, which was a great ending to the meal."], ["Whitney O.", "Great food and so much of it. I got the Peruvian Chicken & Rice and I have enough left over for 2 more meals. Friendly staff. Plain decor but clean. Will be back, soon!"], ["Little B.", "Fun bilingual staff and good food -- very cool mix of Ecuadorian and Peruvian and other South American flavors. The beef stew will cure your cold and the imported sodas are hilarious."], ["Matt M.", "Okay, thank you to other Yelpers who helped me find this jewel. The food was authentic, delicious, and reasonable. Service could not have been better and I have gone back twice since my first visit to take others for lunch.Now, do not go expecting a high class swanky Latin restaurant, because that is just not it. It is a no frills Peruvean restaurant that serves terrific food in a strip center storefront. But for me, that is where the best food can be found, because it is about taste rather than ambiance and glitz. Now do not get me wrong, I have eaten at a few restaurants over the years that are nationally ranked in cities like San Francisco, Chicago, New York, London, Paris, etc. But sometimes you just want a good \"joint\" than can blow you away with interesting food.Why not five stars? Well if you have read my other reviews, there were no cloth napkins and table cloths. So enjoy the food."], ["C J.", "Hungry?...Come ready for the BIG portions and authentic food. I tried the Chaufa  de pollo and lomo saltado and both are great. I definitely recommend the lomo over the Chaufa. Who doesn't like beef with a flavorful sauce and French fries?"], ["Jenny E.", "Great service! We were seated  at a lg table for 6 even though we were just 4. This was our first time at this restaurant.  Our waiter did take our order and he guided me away from the ceviche de pescado  to the arroz con mariscos ( yellow rice with shrimp, octopus, calamari, & mussels). It was amazing. The portion was huge and I'm taking half home for lunch tomorrow. I am gluten free and the waiter took the time to help me find something to eat.  My husband ordered jalea personal which is calamari, shrimp & fish all deep fried served on a salad with yucca & plantains. This was the prettiest dish that came out. Plenty of onions! He loved it. My son ordered the fried chicken and I've never seen a larger piece of chicken.  It was rolled thin and battered then fried. He loved it.  My daughter ordered a pulled chicken and potatoes in a curry sauce. It also was a huge portion. She said the sauce was slightly spicy and very delicious. If you are looking for great service,  really good fresh food this is the place for you. This is now one of our fav. Places"], ["James S.", "The food is great I had the Pescado a la Chorrillana and really liked it. The decor is kind of plain but it is well lit and clean."], ["Clyde B.", "This is one of my favorite spots for lunch.  The portions are enough for two people and the flavor is unmatched.  My favorite dish is the Chaufa de Pollo with a side of the hot sauce Ms Vikki makes.  I usually get the Mango con Letche to go with it."], ["Chelsea S.", "I tried Pisco's for the first time tonight. I have to say, I was very unimpressed. It was disappointing because it has such race reviews from a lot of other people. This was my first time trying Peruvian food so maybe that's just not my thing but I expected better. I ordered a typical light Peruvian beer, which was the best part of my meal. The main dish I ordered was the ahi de gallina, it was described as a yellow creamy nutty sauce on the menu. I have no idea what the flavor was that they were going for but it wasn't my favorite. It should have been served in a bowl, very hot, on top of a lot of rice. Instead, it was slopped on a plate with a scoop of rice barely enough to slop up half the sauce they put on the plate. There were two random pieces of boiled potato, a random hard boiled egg, and one very out-of-place olive. It certainly wasn't the worst thing I have eaten but not even close to the best. They could have made it spicy and sweet and it would have improved the dish tremendously. I also ordered some sweet plantains, it's pretty hard to mess those up. Their plantains may have been a little past ripe. Not the best. I may return to give the ceviche a try, maybe I should have ordered that today, but I won't plan on being a regular here."], ["Jennifer G.", "I first had Peruvian food at Ceviche Jax, and  fell in love with the Lomo saltado and the the chicha morada that they had as their drink, so I decided to try Pisco's since it's so much closer to my house! Their lomo saltado is a great dish and one of new favorites, the ceviche is stellar and I could eat it for every meal!! The service is very personable and friendly, the restaurant itself is in a strip mall in what seems to be like a hole in the wall... but you know what they say some of the best food you will ever eat comes from the unlikeliest of places. The food comes out in huge portions, or at least the lomo saltado does, so just a warning their.... It's really good, but so much food, so if you plan on trying to finish the whole plate while your there make sure to wear you stretchy pants so you'll have room to expand...LOL! The only reason I didn't give them five stars was because they don't have the Chicha morada, other wise I would have given them five!"], ["Katie C.", "Thank you Yelp for leading me to this great little hole in the wall! I've always wondered if Jax had an authentic Peruvian spot, and now I know that yes we do. Located on the corner of an unassuming strip mall on Southside Blvd, Pisco's is serving up a host of authentic Peruvian dishes with a mom-and-pop feel. A friend and I split the ceviche and a crazy veggie and french fry chicken platter with rice and I really dug both dishes. BUT MAN that ceviche was delightful! You can go with all fish, but we did a shrimp, fish, and calamari combo, and it knocked my socks off! So tart and tangy, but not overly-limed. Just fresh, pure, light, melt-in-your-mouth seafood served up with pickled onions, corn, and white and sweet potatoes. Yum! I can't wait to go back and try some more of their extensive menu, but I doubt I'll ever pass up on the fishy stuff when I'm there. Also loved their piping hot sweet plantains! Another treasure discovered thanks to Yelp!"], ["Chad W.", "Excellent hole-in-the-wall!  Some of the best Peruvian food I've tasted.  I highly recommend the ceviche.  Don't expect a beautiful ambiance or excellent service, but the food itself is worth the trip!"]], "Matthews Restaurant": [["Maisha R.", "Around my father's birthday my parents came in town to visit. Having arranged an incredible culinary tour through Manhattan around his birthday last year, the pressure was on to take them to the best restaurants Jacksonville has to offer. I'd been told that Matthew's just had to make that list. I arranged for an early Friday evening dinner and when we arrived, we were the third party in the small dining area. We were greeted warmly upon entering by the hostess but we weren't impressed by our server who, although helpful, showed little personality or excitement about the food or our dining there. The meal started off great with the homemade focaccia bread and the olive loaf. Both were delicious. The chef prepared a non-dairy preparation of the escargo with prosciutto, which was fabulous! The veal and short rib meatball was good, but not spectacular and the scallop, which was baked in a puff pastry with pate was very unique in its preparation and even better on the palate. I had the pork chop with a bacon jelly on top which was tender and juicy to the bone. The brussel sprouts were lightly fried and the kale with onions was cooked well but the truffle fries were the worst of the sides that we tried.But, forget the fries, the real issue was that it took about 45 minutes for our main courses to arrive after we'd finished our appetizers. The chef came to the table to apologize, which was a nice gesture and she offered desserts on the house. The waiter then came out to bring a round of celebratory drink and strawberry sorbet for us and he tipped the tray and spilled the beverages all over the table and onto our clothes and purses. Sigh, it was a bit of a disaster. Everyone in the restaurant turned to look at us.I'm guessing that since most people love Matthew's, our experience was an anomaly. While the food was definitely excellent, it was the other issues that forced me to dock a few stars."], ["Joe C.", "A high quality, upscale eclectic italo-french restaurant that impressed my clients, and me.  The menu is filled with unique, creative dishes, and is not presenting \"standards.\"  There is a pasta section with 5 selections, and I actually had the most conventional of them all, a bolognese radiatore (though they were out of radiatore) though I gave their bolognese only a 3.5/5, It was serviceable and tasty.  I was intrieged by the Bucatini with vegetables and lemon zest, but was just in the mood for a sugo.  Their desserts expressed the same aesthetic as the rest of the menu, I had a Souffle with elderflower liquer in the souffle batter and a blueberry sauce.  It was perfectly executed and the flavors were very well matched.The wine list was extensive and on Monday nights, half price!.  Now that works for me.  We had a Gundlach Bunchau Cab (the last one), another Alexander Valley cab and cali chard which I don't remember!The owner, Matthew helped me out a few weeks afterwards when I needed a copy of the recipt.  He was courteous and a pleasure to speak with.  I would unhesitaingly recommend this restaurant to anyone interested in an upscale dining experience in Jacksonville."], ["Malik B.", "Amazing food and waiter had excellent knowledge of wines. Great atmosphere..We tried the Chefs Tasting adventure and it was awesome even though we asked for adjustments to the ingredients"], ["Mike B.", "We did the tasting menu here on Friday night with the wine pairing.  $125 a person and more or less left hungry.  The food was good and the wine was good, but what gives... give me a little more of some food please.  The service was decent, the waiter we had kept stumbling over what he was bringing us and was not very confident at all.  For the price I would have expected a but more."], ["Jacob B.", "Best service in Jacksonville, hands down. Very romantic setting. Pretty expensive, but not to the point where is unbelievable.  The food was great.  Not something that I can see myself craving, but it was really good.  Overall, you're definitely paying for the experience and Matthews didn't disappoint."], ["Lauren S.", "I went here in a group with 50 people so the service was rather slow, but I will not hold that against them. Serving a huge group is hard.For an appetizer, I had caprese salad. The tomato was slightly roasted and there was pesto instead of basil. I even ate the mozzarella, which I don't usually like.The bread is really good and the butter is SCRUMPTIOUSI had steak which was very delicious. For dessert I had chocolate cake which was good. If I am ever in Jacksonville again I will go here."], ["B M.", "I ate dinner at Matthew's twice in three days.  The first night I went with a co-worker. We agonized over the menu choices, but Brian helped us make our final decisions. The escargots in a cream sauce with shallots, mushrooms and spinach was divine. The pork belly was perfect, seared off and served with a sweet potato purée, a cardamom vanilla syrup and huckleberries. It was magic, the best bite of the night. We ordered the loup de mer (bronzino, a flaky sea bass) and the wild boar. Also fantastic. For dessert, we had a pumpkin soufflé with a creme anglaise sauce. The wine list is extensive. The second night we had a party of 24. We had a prix fix menu. Highlights were the salmon crudo, curried butternut squash soup, the scallops, the beef tenderloin, the pumpkin semifredo and the flourless chocolate torte. Everyone loved the food.Service is attentive and the food is delicious. I don't live in Jax, but I'm making a beeline for Matthew's next time I'm down there."], ["Rick D.", "Pavel and April were wonderful...... Rebecca and her desserts have set a beautiful stadard"], ["Don R.", "We have been regulars at Matthews for the past year.  Our last visit was completely unacceptable and Matthews simply does not seem to care about their customers.  Upon arrival we found no valet.  Our server had to be prompted several times to share the details of the chef's tasting menu.  Of course, the server did not memorize it and had to read it off from a cheat sheet.  The menu here is pretty stagnant from the viewpoint of being a regular customer.  Even though the menu barely changes, they were out of 2 items from their menu early in the evening (6pm).  I ordered the \"sushi grade Ahi tuna\" cooked rare.  It was so incredibly full of sinew that I could not cut through it with the sharp steak knife they provided.  I did return the Ahi and ordered the ribeye, cooked medium rare, which took 20 minutes to come out of the kitchen (long after my spouse had finished eating).  My ribeye was mostly medium rare except it was completely burned (not seared) on one side...so much so that I actually was able to cut the completely burned layer off and leave it on my plate.  The beverage service was inattentive, and the quality of check backs by the server was poor.  A manager, nor anyone from the kitchen, took the time to both verify the complaint about the tune and visit our table to apologize.  And clearly, no one was watching for quality control over my ribeye.  Most of the other items were plated sloppily as well.  I've tried contacting Matthews, but I can't get anyone to answer the phone during the time I am calling and I'm usually too busy during the evening. I would send them a message through their facebook page, but my message months ago never received a reply.  I can no longer recommend Matthews due to poor service, food and management.OLD REVIEW: I have to say that the food was absolutely 5 star, but there were some things lacking based on the targeted demographic.  First, it was absolutely frigid in the restaurant during our visit.  With entrees in excess of $50, I expect to sit in comfort while dining.  Second, the attentiveness of the service was spotty.  Our server was very professional, and appropriately friendly, but we had already eaten our appetizer before being offered a beverage, and a request for another piece of bread was forgotten and then still not offered to any other guests when finally brought to the table.  Still, the food was absolutely stellar, but we will not return when the temperature outside is cool and will request an attentive server (which is not an appropriate thing to have to ask at a fine dining restaurant).UPDATE:  We have been an additional 2 times since the first review.  They are very consistent in my assessment that the kitchen needs to taste food for seasoning prior to sending it out to customers.  We now know to ask for salt, but some dishes are literally perfect, whereas others are simply sans salt from the kitchen.  Of course, salt is critical to bringing out the flavors in most foods...so you be the judge.I'm also happy to report that the service was better on our 2nd and 3rd visit.  Ironically we have been seated at the same exact table on all of our visits, regardless of our request for a booth, and the temperature has been an issue during all visits.Another thing that stood out is that on both our most recent visits, the servers had to read the chef's tasting menu off from a cheat sheet.  This is a 4 Diamond restaurant, and reading specials off from a cheat sheet is something I don't expect to see.Finally, another thing I think shows a lack of care at this grade of restaurant, or any restaurant for that matter, is when they are out of menu items.  They were out of 2 menu items when we went the last time, and normally at this type of restaurant the menus for the small dining room would simply be reprinted to exclude the missing items so as not to disappoint customers.We have tried visiting this place on the spur of the moment, but beware that they are often closed for special events and they do not seem to update their hours with anyone, including their own facebook page."], ["Lizzy C.", "My husband & I chose Matthews for our annual Christmas date, as we were planning on seeing a play in nearby San Marco square after dinner/drinks. Upon entering the restaurant, we were greeted by a beautiful ambience. There was white, modern furniture, bright lighting & a beautiful bar with the different liquors show cased. Immediately, we knew this place was classy.We decided to sit at the bar & take part in happy hour, which is 5-7pm daily, with $5 select wines & $7 martinis. I chose the petit syrah (which was poured very generously), while my husband chose Duke Brown Ale, a Jacksonville home-brew. For food, we started with the cheese plate. Not really sure exactly the types of cheese on the plate but it seemed like a gorgonzola, brie, sharp cheddar & brie. This platter was a piece of art & came with crostini, candied nuts, a date, some grapes.  Following the cheese plate, we chose seared beef tips over country grits & buffalo calamari with blue cheese dipping sauce. The beef tips were cooked to a perfect medium & were so juicy. The calamari was spicy, but not over powering. My husband says \"this is the best calamari I've ever had\". Appetizers were priced reasonably ($6-$10) & the service was outstanding. Would definitely return. Also, for all of you Jaguar season ticket holders, there is a teal deal for Matthews...$20 off purchase of $50!"], ["Nicole W.", "Almost did not come to Matthew's because of some negative reviews. Decided to go anyway and we were extremely happy we did! Started with escargot which was absolutely delicious. I ordered the duck breast for my entree which was very good but this dish had an amazing duck confit bread pudding that was bursting with a ton of flavor! Also ordered a great side dish of Brussel sprouts. My boyfriend ordered the a duck confit curry pasta dish that was AMAZING! This was defiantly a great restaurant with good service. Although the Brunette hostess and bartender are pretty rude and unwelcoming. Overall worth the price!"], ["Brian W.", "Superb setting that yells classy that was matched by true proseesional service at every level accompanied by outstanding food. Had to fault this place, in fact i can't. I had Foie gras then Sea Bass & finished with Berry Souffle and each dish was simply first class."], ["Eric M.", "Visited Matthew's Restaurant for a dinner to honor a father-son textbook author team so we were in a private room.  The appetizers were pre-picked and delicious: tomato and cheese on a cracker, scallops, and steak (sorry, didn't catch the fancy names for them).  Good thing we' didn't fill up on them.  Had a choice of soup or salad and opted for the crab and corn chowder.  Very good!  Not too rich or heavy.  Perfect with their rolls.Had a choice of fish, vegetarian, and steak for the entree so went for the steak.  Not a huge cut but certainly enough and filling given the appetizers and soup that preceded it.  Very tender, even for tenderloin.  Others seated near me who had the steak agreed it was the most tender steak any of us could remember.  It was perfectly seasoned and served with a light red wine based sauce and potatoes.  Was really full at this point but there was still dessert.Dessert was either an apple cobbler (I love apples) and chocolate cake.  I opted for the cobbler but that was a mistake.  The apples were way too tart for a dessert.  Luckily, one of my colleagues wasn't going to eat dessert and ordered the cake just in case.  So she gave me her cake.  It was good but nothing to write home about.  A very-moist chocolate brownie (with no nuts) is a pretty accurate comparison.  But that wasn't really a problem since most of us were full after the entree and were just over-stuffing ourselves by that point."], ["Ron C.", "Awesome cheese and meat starter!  More than enough for 2. Great atmosphere and service !"], ["Jeremy S.", "OMG!  This place really stands out to me.  I've been waiting for a special occasion to go here and I'm so mad at myself for waiting.  Service A+, Food A+++, Atmosphere A+.  Hands down, this takes my number one restaurant in Jacksonville award.  I had a steak dish which doesn't sound very exciting until you ask the waiter to explain it to you.  Best steak in town hands down.  Marinated in herbs and spices that will knock your socks off.  If you don't feel like a formal dinner, sit at their bar which looked awesome and enjoy the live music.  Otherwise, enjoy their formal dining room which will make for one of the best meals you have had in a long time.  ENJOY!"], ["Lee H.", "This was our 38th anniversary celebration. Probably the best food we've ever had at a restaurant. The use of herbs and spices was elegant - powerful flavors laced delicately but not subtly with the main ingredients gave a learning experience as well as an incredibly delicious meal. We were overwhelmed with service, not only waited on by two people hand and foot, but informed by them at our every whim, answering our questions about the recipes as well as about the fresh ingredients. We ordered two salads, both wonderful, but the one made of fennel root at a major ingredient was not even close to anything we've ever had. The tempura fried olives \"for the table\" started us out, again something I've never even imagined, and ambrosia to the palate. Kudos to David and Nathan, and the crew of smiling chefs under Matthew's direction!"], ["Laini T.", "My husband and I went to Matthews for our Valentine's Day dinner, but chose to go a few days later so that we could enjoy a normal tasting menu instead of the abbreviated Valentine's Day one.  I am a huge fan of tasting menus and love to be able to try whatever the chef thinks are his best ingredients and combinations of the night.  In DC, these menus are everywhere, but Matthews is the only place we've found thus far with a tasting menu in Jacksonville.  They also have top notch service, down to offering both a light and dark napkin depending on your ensemble.We started off  with a very light course - I can't remember the word for the cooking style, but it was similar to ceviche, and featured a slice of a scallop and a bit of a white fish.  It was very tasty, but I was worried that if all of the courses were this light, my husband was going to be very hungry when we left.The next course was AMAZING - the best one.  A half of a fresh lobster tail, burrata, eggplant compote with three different caviars.  I've never had such delicious lobster tail - SO good.Next was a pasta course, with mussels, lumb crab, and a white wine sauce.  It was tasty, the mussels were very clean, and the crab was a nice touch.  Next was a swordfish and then, to be honest, I can't remember what came after that.  We finished with an olive oil pound cake with homemade ice cream which was fantastic.Every course was paired with a great wine which is likely why I can't remember the later courses as well.  We will definitely be back - this was a great meal and a great experience."], ["Jonathan K.", "Simply amazing.  Went with my daughter and our waitress was just awesome.  The food was incredible.  Definitely recommend."], ["David G.", "Pleasurable atmosphere and top-notch staffing. Not a huge fan of the brie, but the rest was a 10. Enjoyed our anniversary dinner, thanks so much!"], ["Thomas C K.", "We dined here on Monday, April 8. Overall a vey enjoyable dining experience. We both contemplated the Tasting Menu but felt that perhaps the offerings were not special enough. My wife, as a Starter, took the Hudson Valley Foie Gras which was simply outstanding - cooked to perfection - slightly crunchy on the outside and buttery on the inside - delicious! I took the Blue Fin Tuna which also was outstanding. For the Entree my wife took the Grass fed veal scaloppini which was sumptuous. I took the Skate wing turbo with a side of fried Brussels sprouts - outstanding! The meal was spaced appropriately and the service impeccable. Definitely a gem on the Jacksonville dining scene!"]], "La Mancha Restaurant": [["Meghna P.", "Great food, ok service. 1st visit: my friend and I shared the Churrasca na tabau, it was so delicious and enough food for more than 2 people!  My friend knew the people so had a great experience!!  2nd visit: my husband ordered pollo medina, the sauce was so sour and over-powering but chicken was perfectly cooked and he liked it, so that's what matters.  From tapas menu, I had lamb meatballs, which were very good and I also had the eggplant rolled and stuffed with crabmeat. The eggplant was undercooked and the taste was too crabby for me. Their Sangria is perfect!  Flan is also good."], ["Julie V.", "Amazing food and great service! So glad we took the chance to try it! The paella was amazing!"], ["Wendy E.", "very delicious!  been to Barcelona and this morningreminded me of the tastes! great sangria!"], ["Ch J.", "The food is unbelievable and we'll worth the price. Go during nights that they have live music or specials.  So so good!"], ["Dave D.", "Not sure what the hype is on this one.  This place is very expensive for what you get.  I ordered the Grouper with scallops and they were both cooked within an inch of their life, VERY well done fish (yuk).  Not terrible food, but when you are paying 4 star prices and getting mediocre food, I would not be back."], ["Liz B.", "We live in St Mary's..right over the border in Ga. This evening we visited LaMancha for dinner. What an excellent experience!   We made our meal from tapas..shrimp in a coconut milk sauce, scallops, crab cakes of a sort and a spicy sausage dish. The last was flaming when brought to the table. Our waiter David was outstanding. He made a suggestion for the wine that was perfect. We had dessert despite our best intentions. Excellent cakes. All in all, they exceeded our expectations by far. We'll be back."], ["Megan W.", "I ordered a platter of Quijotera a la Mancha - basically meats, cheeses, veggies, and olives - and it was the best thing about my trip to the Island.  It was gigantic and delicious.  There was no way I could finish it but I wish I could have.  I had sangria and it was delicious as well.  I came down from D.C. for work and this restaurant was far superior to the Spanish tapas restaurant that we have here, which is owned by a James Beard winner."], ["Arisa P.", "Excellent seafood and tapas. The service is prompt and thoughtful, and the food is all delicious and fresh. If I had any complaint, I'd only wish the portions were smaller so I could try even more things on their menu."], ["Jerry N.", "Excellent... I got the churrasci en tabua... Omg... Don't judge a book by its cover... Food is really good! Also try the Sangria..."], ["Richard H.", "Really pleased with entire experience. Quiet Tuesday night which made it very intimate. Food excellent and beautifully presented. A unique, authentic menu (lived in Italy, traveled in Spain). Terrific service. Will return!"], ["Michele B.", "We are thrilled to find a new restaurant, with a new type of cuisine, at LaMancha.  Having been to Brazil, and loving the food, we were game to try. Don't be put off by its location in front of the Days Inn, in what was a Shoneys. The food was flavorful and plentiful, with a casual friendly atmosphere.Highly recommend!"], ["Scott T.", "We went here for dinner on vacation for my fiance's 40th birthday. It is very nice on the inside. The owner said they were going to add a patio in the front in the future. We had several small plates and they were all great. We had paella for the main course and it was outstanding. We will come back during our next visit."], ["Van S.", "The food here is of good quality, the staff is very attentive and you walk away feeling full and statisfied!"], ["Earl G.", "Dined at LA Mancha to celebrate a birthday (14 year old granddaughter). She chose La Mancha on her own from a previous experience eating tapas. Our dining experience was excellent. Presentation was impressive. Service was satisfactory. The special that night was paella with an \"all you can eat' feature. Normally that means a buffet but this was prepared special for the evening in a huge baking pan and served by the chef personally. Of course there was an expansive menu of other Spanish dishes. Likewise the Spanish guitar music, live, provided the appropriate background for enjoyment and table talk. All in all, a good addition to Fernandina Beach.My suggestion to the owner, choose a different exterior paint décor. My initial thought was a Taco Bell restaurant which is a disservice to what you encounter inside."], ["Cathy P.", "What a disappointing experience! We've been to Spain many times and had high hopes given the reviews. The lamb meatballs were hard as rocks, the shrimp mondragano was mediocre but the shrimp were a bit dry and the paella was also a bit dry. We went on Sunday night which was advertised to be Fat Sunday with all you can eat paella for $21.95; however, the bill came with paella at full price. We told our server who talked to the manager who said the price had changed but they hadn't had time to update their table tents (or clearly the server who told us it was $21.95 at the start of our meal)."], ["Vicki T.", "Amazing cuisine with unique flavors. Everything is cooked with character and presented with flair of the finest dining. Try the shrimp pineapple tapas and the calamari mango salad."], ["Poppy M.", "Beach towns aren't always known for either varied choices in dining or particularly dazzling choices.  We found both at La Mancha.  Reservations were easy - we used Open Table, but you can call them also.  Between the two of us, we had the Tortilla Flamenca $9 (layers of sliced potatoes, spinach and manchego bound with eggs and baked) - very good, filling and lots of cheese!; Mussarela de Bufala $15 (imported buffalo-milk mozzarella layered with basil, tomato slices, drizzled extra virgin olive oil & a balsamic glaze) - if I had known how good the buffalo moz would be, I would have made this my appetizer, dinner and dessert! The only downside, while not THAT important: the basil was pretty wilted; Scallops Mondragon $13 (panko-encrusted scallops on a bed of creamy roasted poblano pepper sauce) - fabulous also; Almondegas de Carneiro $12 (lamb meatballs served with Spanish blue cheese sauce) - a little on the dry side, but extremely flavorful.  The plate should probably been dressed a little better as it was just brown meatballs in a white sauce - no color, very drab; Snapper a la Dulcinea $28 (snapper filet topped with sautéed shrimp, lemon, butter, kalamata olives and caper sauce) - this was a very pleasant surprise in that it was cooked perfectly.  I'm always a little nervous about ordering a thinner fish in restaurants because they can be overcooked very easily.  This was not!Since there was a little mix-up about whose table we were, we waited a little longer to order than we cared, but the owner caught it and asked the waiter to make sure we received complimentary desserts.  Very nice, but hardly necessary if you review our selections above!  Either way, our waiter didn't ask what we'd like (we'd have said \"thanks, but no thanks!\") and just plopped a flan down in the middle of the table with two spoons.  Nothing heinous, but it stood out to me as someone who had spent over 20 years in the B&B/restaurant/catering/bar business.None of the little hiccups would stop me from recommending La Mancha to everyone!  I hope the owners/chef are fabulously successful and that Fernandina has welcomed them with open arms!"], ["Chris C.", "It doesn't look like much from the outside but it's decorated very cute and the food is really good.  I had a Caprese and fried goat cheese salad which was great. The tres leches was good but not my favorite. I would def recommend this place to anyone."], ["David S.", "Good portions, good flavors, steaks were a little too charred for my liking, but dishes across the board were served quickly and piping hot. Compact wine-list has a good variety of styles and prices. We were pleasantly surprised after reading some poor reviews."], ["John R.", "Absolutely loved it!  We did the tapas, and they were all terrific. My favorite was the flaming Portuguese sausage."]], "Ovinte": [["Paulette A.", "Ovinte is an incredible addition to Jacksonville!We have enjoyed so many amazing dinners and Sunday brunch as well. Huge fan of the Butternut Squash risotto, the Raviolo del Giorno, Clams, Bacon wrapped dates (yum) and the marinated beets. I think the Allen Bros. Filet is absolutely delicious along with the 50/50 sliders and the addicting French fries. Should I continue?The Pappardelle Bolognese is another favorite!To round things out, definitely go for the Limoncello Bread Pudding. Sunday brunch is equally as tasty, but I'm partial to the Lemon Ricotta Mass Pancakes and Ovinte Benedict. Chef Ian Lynch deserves credit for his innovative and exciting menu!"], ["Elizabeth M.", "Coming here I had no expectations except that I knew it would be on the more expensive side given that it's on the fancier side of the town center but honestly my server was probably a big reason why I left unhappy. We were sat outside which was fine because that's what the group wanted but the lighting outside could be better. We basically depended on the light of the nearby street lamp. The server tried to be funny and while some of the women who are older than me thought it was cute or funny, to some of us it came off as rude. Especially when my co worker asked to be skipped during the entree ordering and he responded with a \"it will be my pleasure\". Maybe it's just me but to me that sounds rude. We started off with drinks and I initially ordered the sailors cider. It was very sweet and it just did not suit me. My coworker went ahead and told our server that I wanted to swap out my drink because I didn't think it was good. She also told him that someone at the table was willing to drink it instead of throwing it away in case he wanted to be nice enough to leave it. Well he left it and then decided to charge me for it. I understand that he had every right to charge me for it because someone else did drink it but in my defense I asked him to take it back even after he had made a recommendation to me. While he did take it off the bill when I questioned him about it he only did so after making me feel like some cheap skate trying to pull a fast one on him. The food: we had the hangar steak which was absolutely delicious. Steak was cooked perfectly and the mashed potatoes were delicious as well. The pollo feliz was not a very happy chicken. The dish itself is poorly presented. The chicken was cooked perfectly  and it was all on top of a soupy mess of fingerling potatoes. It would have been fine but because the chicken was cooked perfectly it became the fall off the bone juicy kind of chicken, which led to lots of little bones being all in the dish. Taste was there but poor execution on how it should be presented, and possible choking hazards with the poor lighting. The s'mores were served cold. Awful and I didn't enjoy them at all. The best thing I had was the limoncello bread pudding. If I happen to go back it would be for that. Overall, had my server treated me better instead of doting on my nice coworker who treated us to a lot of nice apps, I might have had a better experience."], ["DeeDee H.", "So we had a couple of hours to waste before the yelp elite event... we run into the amazing Allie, who suggests Ovinte.  So we go...Great looking place, very clean and kinda on the upscale side of things.  We were greeted right away, but instead of a ... just the two of you? Would you like a table, the bar, ect???  We got a How can I help you???  Weird!  But of course in my crazy husband fashion... his immediate response is... No, just browsing!  Seriously, of course you can help, we would like to dine in... at the bar, please.We grab a couple of beers and the chorizo empanada app... We were excited because we are huge chorizo fans.  He liked it, I was on the fence.  I guess it was too modernized for me.  Hey, I like the way my Mexican gramma makes chorizo!We also shared the sliders... which were extremely yummi!  and the shrimp and grits app...now that was delicious! and definitely worth coming back for.While we were there, we noticed that this place is where the 'locals' go.  They were greeted with loud Hey you guys! and hugs... so when the manager went around giving high fives and hugging just about every person at the bar... my sweet husband went in for his hug and well... let's just say... he was left disappointed! lol we had a good laugh and decided maybe we are out of place! and well, it was time for our event, so we scooted outta there!I will say that I love the comfy couches and the relaxed atmosphere.  It's a groovy place and if we lived closer, we would probably frequent the place often."], ["Greg F.", "3-4 star. I didn't like the food as much as last time, but, looking at the menu, you still want to try everything here. My bacon-wrapped dates ($5) didn't blow me away like last time, but they were still nice. Perhaps they were overcooked compared to last time. My French toast (this was brunch; $9) was nice, but not one of the better French toasts I've had. Perhaps I should have asked for more than the small bowl of maple syrup they gave me. It was a bit too loud for my tastes, especially when the live music was playing, but even when it wasn't and they had recorded music on. I prefer conversation to music at a restaurant. They were on the slow side serving us, and our dishes came out at different times."], ["Ivy Z.", "This review is for Ovinte's Sunday brunch, not their regular tapas menu (which I will definitely be back to try!)Pros:- Every Sunday there's live music: very enjoyable and would definitely recommend this- There are tables, a bar, an outside patio, as well as some couches indoors. Ovinte has nailed the atmosphere: I know I will be back to enjoy some Sangria with friends while sitting on those couches.- Herb Truffle fries were delicious- Pitchers of sangria, mimosas, etc. livened up the drink menuCons:- We came as a group of four on Sunday at 11:30 and there was no wait (very empty at the time). We had a reservation, and asked to be seated at a circular booth that was supposed to seat six - the hostess said no, and we were smushed at a small square table. The circular booths remained empty the entire morning.- Asked for mustard on the side, and it didn't happen- Food was a little underwhelming in terms of flavor: concepts were great, wild mushrooms delicious, but could have benefitted from more flavors.Overall, I would definitely be back at Ovinte for tapas/drinks, but might not come again for brunch."], ["Pamela D.", "One of my favorite places to unwind after a good pay day... Elegant, plush and overall beautiful. Mingle at the bar, keep it comfortable and intimate in the lounge, or enjoy the summer evening's breeze in the outside...you can't lose no matter where you sit.A few of my favorite things to order: The cheese plate with any combination....it comes with a fresh honeycomb, marcona almonds and fruit; bacon wrapped dates; wild mushroom risotto; delicious 50/50 sliders;  local fish ceviche (last time I was here the catch of the day was Grouper), and any of their desserts.Service is classy and very friendly; they will never rush you out or make you feel like you should eat and go. You can sit with your friends or a fun date drinking wine, sharing small bites and talking the night away; you will feel like you just happen to have waiters/waitresses at home. I've only been here for late night rendezvous', but I hear the brunch is pretty good. More to come!"], ["Jake S.", "Never again....In the interest of employees and their families who may be negatively impacted by a less than stellar review, I will spare you the details... BUT, I will say this, never again, and if you are aiming to impress clients or friends look elsewhere."], ["Shera B.", "Finally a trendy , fusion classy place in jacksonville and in the towne center .90% of the restaurants there are chain/generic . This is a spainard fusion american bistro style Amazing cheese and meat boards Excellent wine selection The classic cocktails and bartenders are great but their own cocktails are not so good. The brunch is amazing I recommend the french toast Their daily quiches are a good portion ad very good I do not recommend the pumpkin ravioli or potato and beet hash, not very good. The canelones del mar is amazing !!Check it out"], ["Cora C.", "When Ovinte opened a couple of years ago I was really impressed - it was what the Town Center was really missing. And to this day it's still one of my favorite meet-up spots. They keep the menu fresh and seasonal but still have a few staples that I know I can look forward to, like the s'mores (dark chocolate and sea salt - swoon!), and the bacon wrapped dates. The atmosphere is high-end but very inviting and comfortable and they have a killer wine list. I can't go to the town center without making it a point to stop in. Thanks Ovinte!"], ["Paula R.", "This is the best place I've eaten in Jacksonville. The garlic shrimp is outstanding. Ask for bread to soak up the sauce. Awesome.  End the night with the bread pudding.  Its wonderful.  The atmosphere is enjoyable and intimate.  This is a great place for a date or with a group."], ["Brian S.", "Whoa buddy!This place is exactly what you imagine when you think of a chic wine bar.  And, oh by-the-way their tapas are out of this world!Their servers are knowledgeable enough about wine to point you in the right direction, and the selection is first rate.It's a trendy wine bar, so the pricing is high but worth the price."], ["Maya C.", "This was my first visit to Ovinte and after hearing rave reviews my expectations were pretty high. I met a group of friends here and we were hoping for a larger group to come out that that didn't happen. Due to our small party, we decided to sit in the lounge area, which is open seating. It was a little difficult to hear what everyone was saying due to being right by the bar but we made the best of it. I ordered a glass of Moscato and decided to start off with one appetizer and one small plate. Both came out at the same time, the bacon-wrapped dates and the lamb meatballs. OMG the dates were delicious! I should've taken bites from the toothpicked bacon dates but I stuck the whole thing in my mouth not thinking that they would be so stuffed with Mahon cheese. It was still go either way. I did wish I had more than three though. I originally thought the lamb meatballs were kinda plain in the sauce but the goat cheese packed a lot of flavor and eating it with the meatball made up for it. It was very good. Still kinda hungry, I ordered the Shrimp and Grits. Mannnnn those grits were bangin'! There called Anson Mills stone-ground grits. The Mayport shrimp were so good too. Almost forgetting about dessert and still on my second glass of Moscato, I asked about the Chocolate Roulette. Apparently they are little chocolate truffles all with different flavors based on the chef's choice. I picked it out of curiosity and I didn't get steered wrong. One was a little spicy, one was made of coconut, and the other from espresso. Delicious and simple. My other dining companions had Carciofo (crispy asparagus) which was a big hit as she kept saying \"Oh My God\" after each bite, grilled seasonal vegetables (very good), chorizo al vino tinto (tasty), tres leches cake (ok, but dry towards the center), and the limoncello brioche bread pudding (dear goodness that was heaven sent!!!)If I come back, I'd like to go for brunch or maybe even sit outside on the patio if it's nice. It was just too noisy for me in there."], ["Ryan H.", "This place rocks. I've had the lamb meatballs, pumpkin ravioli, filet mignon, bacon wrapped dates, polenta, goat cheese stuffed peppers, Prosciutto wrapped melon, hanger steak, and the 50/50 sliders. You will not try something here and dislike it. Reallllllly good food, good drinks, great atmosphere, and very classy. Not overly fancy but \"smart casual\" as they call it. Great spot to bring a date and have conversation all night.Have been here multiple time since my initial review. Has quickly become one of my top 10 spots in Jacksonville. They've also recently redone their entire menu since my initial review and it's still very good."], ["Donna S.", "Definitely come for brunch on the weekends. It is delicious. I met up with one of my good friends to catch up over bloody Mary's and churros. That euros were melts in your mouth delicious and then on top of that we dip them in melted chocolate. Definitely was off my diet today. They were both divine and our server was attentive but  didn't helicopter around our table. We also had two entrées. I had the salmon platter. it was divine."], ["John R.", "Get ready to have your sense of sight, smell and taste pleasured because this place is amazing. My girlfriend and i went to this restaurant for valentines day and i was blown away and everything was cooked perfectly and the staff were very helpful. It is pricey but you get what you pay for and you will not have a bad experience.This is my favorite place as of yet in jacksonville"], ["Jason M.", "It was extremely average and exactly what you'd expect. It's not bad, nor is it good, like an episode of'Dukes of Hazzard'.  Waitstaff is awesome but clearly open to the potential of something greater. The food is underwhelming, but better than Applebee's."], ["Adrienne C.", "One of Jacksonville's best! I visit Ovinte at least once a month. They're fantastic for a night out with friends, a date or celebrating with family. I love that the cocktails and cuisine are consistently changing with the season while preserving a few clutch staples. The ingredients are fresh, the concept is creative and their execution is on point. Come hungry and with a sense of adventure and you won't be disappointed--it's best to try between 4-6 of the small plates, but save room for dessert, the s'mores are the stuff dreams are made of!"], ["Matt D.", "Between four of us, we shared a ton of plates, some were great and others weren't.  It's a common problem with tapas restaurants:  they're eventually going to have a bad plate.The ravioli, ceviche and and lamb were excellent, while the calamari, bruschetta and shrimp were not.  I agree with many others about the bread pudding:  amazing.  That's coming from a guy that doesn't like bread pudding.Well worth a try, but be careful about what you pick."], ["Kim P.", "I absolutely adore Ovinte! The decor is very chic and the lounge offers a very modern, comfortable atmosphere. The 50/50 sliders (sweet yet savory) & truffle fries are delicious! I also enjoyed the Brioche Bread Pudding & the S'mores! The brunch options are great as well. (Drink Recommendations: Fountain of Youth) The live music on Sunday's creates a relaxing ambience (Easy listening, Blues-esque music)! Ive visited Ovinte on multiple occasions and there was only one visit where the service was not up to par. The prices are also fair for the quality of the food & the atmosphere! Overall, I love it!"], ["Ben G.", "I really enjoyed my experience here.  We started with the fried artichokes which were served with a citrus aioli, worth trying but won't be a go too.  Next were the pork skewers served with some cooked Georgia peaches over a bed of greens.  This dish was fantastic and i will not just order it again but probably get two for us.After the apps came the cheese plate.  We got the 5 year Gouda, the cured pork shoulder, and I think it was casa de cambre or something like that.  All delicious and served with fruit, toasted baguette, and honey comb.  Totally awesome.Finally, we had the duck and the sliders for entrees.  The duck was fantastic, it came with some delicious capers and cooked down blueberries along with a goat cheese and chorizo bread pudding.  I really admire the creativity in this dish.The sliders...well, I won't be having those again.  They seemed to have been grilled shortly and then steamed to melt the cheese over the onions on top of the sliders but they steamed them too long. All in all, I highly recommend checking this place out, just skip the sliders, there are so many more incredible offerings!"], ["Richard P.", "My wife and I recently tried Ovinte for their brunch.  The food was pretty good.  We ordered the meat and cheese tray shared with two other friends.    I had their masa and ricotta pancakes and wife got the brioche French toast.  Mine was not bad, though nothing special.  My wife's French toast was really delicious.  The atmosphere was great though.  There was a live performance so we opted for outdoor seating.  Overall it was a nice experience.  It's slightly on the pricey side, but it's expected for an upscale restaurant at the Tome Center."], ["Marc K.", "this is a nice looking place that over promises and under delivers. the empanada  app looked like it came straight from the freezer at costco! really?"], ["Jamie I.", "This weekend started the festivities to celebrate my birthday this Monday. Those of you who have the day off from work, you're welcome.  Ovine has been on my list to try and after perusing the menu, my desire for a cheese plate meant a visit.Ovinte is located in the Town Center across from Tigerdirect in the old Original Pancake building. The decor is modern and comfortable with a large lounge area. A small parking lot meant I took advantage of the complimentary valet.My dinner date and I chose the patio since it was a nice evening and they have heaters outside. We were in a bubbly mood and enjoyed a glass of prosecco.  We started with the cheese plate and chose the manchego, aged gouda, and bellatoir. The plate came with local honey, grapes, Marconi almonds and toasted baguette. I died and went to cheese plate heaven. Maybe it just filled a massive craving, but damn, was it good. The bellatoir, a soft French cheese, was the winner of the evening.We then moved on to sharing bacon wrapped dates, crab cakes, and chorizo empanadas. I love dates and these didn't disappoint. The crab cakes were very good with little filler and the empanadas were crispy without being overly greasy.  For dessert, we had the homemade s'mores with a generous dusting of sea salt on top. Inside got crazy busy and was super loud. I'm glad we choose the patio. It allowed for a more quiet, leisurely dinner. If you haven't visited yet, I recommend it!"], ["Matt B.", "We have been here a few times and the atmosphere is really cool. The food is good but on small plates and the service has been really good. The only negatives I found are the don't have tea. Sweet or un. And when your the designated driver there fabulous wine and drink selection does you no good."], ["Melissa M.", "Amazing food. My first experience of tapas dining went above and beyond what I had expected! Very creative dishes. The cheese and meat combos you can try are amazing! The local honeycomb was a perfect touch. Thank you for a wonderful evening!"], ["Kamni G.", "I have had this place on my list of places for try for a while. So when we met a fellow yelper (Waheed) and made plans to meet up, we obviously chose ovinte! They do take brunch reservations but it didn't seem like it was necessary when we arrived. The hostess was amazingly helpful and patient. She never hesitated to refill the processco or let a water re fill lapse. She was there before you knew you needed her there. The food, now it was good but not amazing. I do adore their fries and they are yummy! With 4 stars, this place now moves into places to try for dinner list however not when st johns town center is at it's busiest. Give this place a try, between the friendly service, good food, live music, amazing decor... You may forget where you are and relax for a while."], ["Mahalie H.", "The food was amazing for my first time. I had the shrimp, scallop,  and crab meat crepe with a butter wine sauce. Then a meat and cheese tray along with a refreshing ginger beer cocktail. The atmosphere was very nice and unique. I will be visiting again."], ["Stephanie A.", "Very nice ambiance and a very creative menu. I love the small plates they offer. This way you can try many more options. The staff was extremely attentive. I found the music was good but could be turned down just a bit for better conversation.My husband and I really enjoyed our entire meal. We definitely will return."], ["Han L.", "According to our server, this is the only non-chain restaurant in the Town Center. Ovinte is a tapas restaurant that offers brunch on the weekends. I highly recommend this place for people who enjoy non-traditional brunch options, as it has several latin-inspired and latin-fusion brunch options. Although it doesn't apply to me, I appreciate the vegetarian and gluten-free options available on the menu. I had my first Michelada, here. *GUSHING* it's basically a bloody mary made with beer instead. it makes for a fine libation when you add a little hot sauce to it. yummayyy. Some of the brunch options are also tapas style, so you may have to order more than one item to satiate your appetite. As with other tapas restaurants, I recommend going with 3 or more ppl to maximize the experience. We ordered the tamale and the salmon plate. The tamale will definitely not fill you up. The salmon platter is great for sharing. It was served on a wooden board with capers, red onions, peppers, eggs, and bread. I liked the presentation of the foods. The ambience is great. It's quite contemporary, but inviting. In the center of the restaurant are sofas for dining and groups. There is also outdoor seating. I would definitely come back to enjoy the tapas during the evening. This would be a great place for gno."], ["Martha G.", "I love wine, hence I love Ovinte...it's that simple. However, since I wouldn't be a true Yelper without a longer review here I go. So why Ovinte? Well, first of all the wine selection is amazing. From their by the glass or half bottle selection of wines, to their \"Wine Emotion Cards\" where you preload them with $25 and you can sample as many wines as your card takes you from their wine emotion machine.  Its a lovely contraption that I would love to have at home, basically is like beer on tap, except its bottles of wine and all it takes is your little \"wine emotion card\" to serve yourself.Anyway, besides the wine, Ovite has a full bar for non-wine drinkers and great tapas selection so that you don't end up all liquored up. :-)  I expecially love their Cheese / Charcuterie plate, the crab cakes, and the\" Chorizo al Vino Tinto\" which is slice  spanish chorizo (sausage) served with grilled bread...yumm.In addition to the wine, and great food.  The atmosphere inside and outside is very relaxing and makes a nice stop after work, after a hard day shopping at the mall, or just as a good excuse to hang out with friends."], ["Diane A.", "Had tapas last night for dinner after work and became a fan of Ovinte at the St. John's towncenter. A good crowd was in for happy hour on a Monday. We had dinner consisting of tapas - truffle fries, seared scallops, shrimp, grilled bread slices, and ceviche. All the tapas were cooked perfectly and well prepared. We ended our evening with Limoncello bread pudding just to reminisce our Italian honeymoon & the constant indulging in limoncello. The ice cream on top of the bread pudding was a slight lemon flavor but not typical \"limoncello\" flavor that Italy is famous for. Service was great and we were greeted by the host staff and server. Food was priced well along with a great happy hour atmosphere. I'd come back often!"], ["Sumi W.", "I wanted to check this place out so bad since I followed them on Instagram. When I finally got the chance, I got the worst waitress ever! She double carded us, didn't know the menu items thoroughly, and didn't how to pour alcohol in a glass (spilled it all over the table)... Seriously who hired her? She belongs in the back washing dishes. With that being said I haven't gone back here and I even unfollowed them on Instagram. They lost two customers for sure. I'm still mad she double carded us. Who does that in a restaurant? That's for a store like Total Wine to double card us which would make sense."], ["Daisy D.", "We had walked into Ovinte one night to check it out, but the place was bouncing so we bounced ourselves right back to our car. Finally made it back with a girlfriend after work to check the place out. Grabbed a beer at the bar while I waited for her. We were seated on the porch. Very excited to see one of my favorite waiters from Orsay would be waiting on us.We started with an order of the Herbed Truffle Fries to snack on while we perused the rest of the menu. I ordered the Heirloom Tomato Salad special. It was a stack of gorgeous tomatoes topped with a goat cheese fritter. It was delicious. The tomatoes were dressed just right and the goat cheese added just the right amount of richness and tang. For our next course, I ordered the shrimp & grits and my dining partner had the seared scallops special. My plate was good, but I can't say it was amazing. It wasn't at all bad, I just think unfortunately I have a very high bar for making a serious impression when it comes to shrimp & grits because I've had it almost everywhere in Jacksonville. I tasted a bite of one of her scallops, they were seared perfectly and melted like butter on your tongue. As they should.For dessert we had an order of the s'mores and the limoncello bread pudding. Both were delicious and I've finally come to appreciate bread pudding as a part of my life. Didn't like it as a kid, but love it now. I would order the bread pudding again if I was sharing, but if I just wanted a little sweet treat to wrap up my meal, the s'mores are the way to go.Can't wait to take my husband back. He's been eyeing this place forever and we just haven't been able to make it work."], ["Katrice S.", "Ovinte may very well become me and my friend's regular meet-up spots for \"Girls Night Out\"!  When we walked we were instantly impressed with the decor and the lounge set-up!  Perfect for our girls night out gathering.  The atmosphere was very relaxing, the music was awesome, and our server was the best (Hi Hunter!)  This made for a wonderful dining experience.  There were a lot of things on the menu we wanted to try and lucky for us, the menu options are tapas and small plates.  This made it easy for us to share so we ordered a few different things to satisfy all of our palates, and we made sure  my friend got her \"cheese\" LOL!  Here's what we had: Cheese & Charcuterie Ofcourse, the cheese and fresh fruit were good but the honeycomb and Marcona almonds were divine!Herb Truffle FriesThese were my favorite!  I was gobbling them down like I was in a fries eating contest!   These shoestring cut fries were dusted with sea-salt, fresh herbs, parmesan, and truffle oil.....YUM!Bacon Wrapped DatesThese were amazing...they were so good we placed a second order of them.  The little mahon cheese surprise inside of the dates and the apple wood bacon did it for us!Chorizo Al Vino TintoAnother amazing choice!  The chorizo had a nice spiciness to it that wasn't overwhelming and the wine and herbs it was cooked in was heavenly!  It was perfect to dip our grilled bread in ...and fries. Empanadas de ChorizoThese were our least favorite of everything.  A little too doughy perhaps and not much flavor.  Pretty to look at though.  :)Moroccan-Spiced Pork SkewersThese were very good especially with the arugula salad!  The meat had the perfect blend of moorish spices.We all agreed Ovinte would be our new ladies night out meet up spot!  The atmosphere is perfect, the wine and food is amazing, and the staff are wonderful!  I can see this place becoming a favorite and I look forward to returning!Check out the full review with pics highheelsgoodmeals.blogs…"], ["Maxine M.", "I used their online app to book a table Monday night for my sons 19th Birthday.  They sent me an email an hour AFTER my 615 table time to tell me that it was canceled.  They also called while I was IN route  to dinner but  was using a map app so couldn't answer my phone. They blamed the table time app for allowing me to make a reservation. When we arrived we were told that they were closed for a private event  but if I wanted to come back at 9pm (3 hours later?) They would buy  us a drink. Thanks for offering to buy my 19 year old alcohol. We won't ever go back. I am also enjoying telling the 200 plus patients who come in weekly to my office how we were treated. I love when marketing works that way..word of mouth is everything! !  His birthday  was saved by J'alexanders! ! It won't let me give less than 1 star :("], ["Aaron H.", "We tried a variety of menu items all of them were excellent, the waiter was very knowledgeable and ready and willing to explain everything to us, it was a great date night experience for me and my wife. The bruschetta sampler was amazing, everything was very fresh and delicious!"], ["Allie A.", "A group of friends had been planning this outing to Ovinte for over a month, and this past Saturday we finally got together to make this it happen. We all know that Town Center parking can be a pain in the ass, but they offer complimentary valet, which is great. No driving around in circles and fighting with folks for a spot. Nice touch. Certainly a bit swanky on the inside, but I didn't feel it to be in a pretentious way. It's smaller than I would have thought from the outside, but plenty of seating, couches, tables and the patio has the same seating offering outside as well. There were 9 of us that met around 7 pm on a Saturday night and we were lucky enough to score one of the couch areas outside.... an upscale South Beach feel with the dark wicker, cozy cushions and huge umbrellas. Our server was excellent and hilarious, even when he walked into some crazy conversations we were having! He did a fantastic job of going through the menu, explaining the different wines to the group and was just an all around enjoyable guy. My boyfriend and I started with a cheese and charcuterie plate... we really wanted a broad range so went with seven options, four cheeses and three meats. The group ordered quite a few different things, including the sliders, truffle fries, pork skewers, clams, and probably a few I am forgetting. :) Cheese and charcuterie was great.... the boy loved the prosciutto and the platter also had spiced almonds and a honeycomb.  Everything was great and the possibilities for different flavors and varieties made for a great experience. Our friends enjoyed a few bottles of wine, and me being a beer girl for life, was pleased with the selection of craft beers. I also really dug the music that was playing: downbeat, dreamy electronic that sounded just like my favorite Pandora station. Very laid back, hip and chill. We were still a bit hungry after the platter. After taking in the scene and enjoying the company for about two hours, everyone ordered the s'mores for dessert and a few espressos. The s'mores were simple, but amazing. Just two grahams filled with marshmallow, with one side dipped in chocolate with a bit of sea salt sprinkled on top. Soooooo good in the melt in your mouth kinda way. There was no talking for about five minutes. :) The sliders our friends ordered looked incredible so we ordered them to go. Topped with sautéed onion and cheese, these little guys were cooked perfectly, and still had pink in the center. A lot of sliders I've had elsewhere can be a bit on the smaller side and overcooked, but wow, these were excellent. Overall, the food was on point, maybe a tad pricy for the smaller portions, but the vibe of Ovinte offered a lot to the experience. Will definitely return.Forgot to add on the first post: Although we did not have this particular server, my friends were adamant about mentioning Chelsea, their server from a different visit... they highly recommend asking for her!"], ["Robert P.", "You can't tell from the street but this place is fantastic. Great variety in the menu and loads of flavored you've never tried before. Only a few beers on tap but you're not missing anything with the great wine list they have.  The ambience is great and is the perfect after work spot. The patio is excellent as long as it's dry outside. A hidden gem!"], ["Leah A.", "I had a chance to meet the chef and try a sample of his amazing shrimp eggrolls @ The 4th Annual Slow Down with Slow Food First Coast at Intuition Ale Works.  All I can say is this was one of my favorite taste bites of the event.  If this is any indication of the rest of their food menu, I can't wait to sit down for a full meal here very soon!"], ["James Y.", "This is one of my favorite places in Jax.  The food is traditional tapas (small plates) but do not let that turn you off.  It's a great way to try several things.  I was most impressed with their very reasonable wine prices.   A bottle they sell for 55 is typically closer to 90 at other spots. I highly recommend the meat and cheese tray with a nice bottle of wine.  Follow that up with a piece of lemon bread pudding and you won't be disappointed."], ["Eat Fresh A.", "Love the vibe and great selection of wine cocktails! First time here and I'll definitely will be coming back!"], ["Claire L.", "The perfect romantic date spot. The wine selection is fabulous, lots to choose from. We ordered a cheese plate to compliment the wine. We enjoyed it so much that we decided to make a tapas style dinner. The servings are small which make them perfect for sharing. My favorite was the special that night: seared scallops with arugula over truffle whipped potatoes in an ox tail reduction. The small size was perfect for this indulgent dish! The waiter had spot on service and was in tune to our needs without interrupting our night.The only thing I don't get is the valet. It's a small restaurant with an immediately available parking lot. I feel silly valeting when my legs work just fine."], ["Debbi C.", "Service bumps this place to a 5. The food is consistently good. Tried the steak tonight and liked it. My hubby had fun trying all the wines. The valets are great. Steven always treats us right. Chelsea is a great waitress and remembered us. I hope she didn't dread having us again. HahahaChad- the owner-came and remembered us, as well. He made sure several times all was good. He's great! I'm so excited to have this great place as a new regular!!!"], ["Jeanne D.", "This little gem is well worth finding if you are at the Town Center and would like a relaxing, sophisticated, light meal or snack.  They also have a full bar and a good wine selection and this is the perfect place to meet up with other people for drinks and appetizers.  I especially love the large comfortable lounge area for groups to converse on and linger over their drinks.  We split a half bottle of wine and were very happy with this selection; I look forward to going back and seeing if more of their choices are this good!  The food we shared was excellent, we had French fries (my weakness), sliders, and  a flat bread.  It was all wonderful, I especially loved the flat bread - it was every bit as good as what I have had in Rome.  I am looking forward to returning here, This is really a great addition to the Town Center, I am looking forward to many more return visits."], ["Kevin L.", "Great experience for Sunday brunch.  Live music and outdoor seating made our meal 5 stars.  I am generally not a huge fan of tapas given my appetite, but the food was quality.  Certainly going to make it here regularly.  Whoever that duo was playing outside was legit and I hope they have a cd out on spotify or iTunes."], ["Einar J.", "Love this place for Brunch. Their tapas are excellent. Even the ceviche, is acceptable and this is a hard thing to get acceptable if you are not a ceviche place. Love the music, Chris Thomas makes it fun. Seen very well behaved kids there also."], ["Ruby A.", "Ok, so let me start by saying there are 3 business entries for this location.  Obviously, I'm going to pick the one with NO review so I can get a 1st to Review sticker LOL :PI'm totally loving and diggin' this new place.  The wine menu is filled with wines from some of the best regions.  I like that they have an extensive list for wines by the glass.  They also serve beer, but I was bummed to see they only highlight one local brewery (Intuition) instead of several of the local breweries.  In addition to the wine and beer, they have a mouth-watering cocktail menu.  Lastly, they have FOOD - regular portions, tapas, and dessert!  My sis and I were only able to stuff ourselves with the cheese plate and a glass of red wine each.  (I have the names of these items and more pictures on my camera, so I'll have to update this review later.)  The prices for both the food and drinks are reasonable.  The ambiance is hip - dimmed lights, cozy settings, metal with natural color combo...  There are several different seating arrangements to choose from: tables inside, tables outside, or sofa lounges inside for the more intimate or bigger gatherings.  The service was excellent.  The valet guys greeted and opened the door for us upon arrival, the hostess greeted us right away and explained the concept of the restaurant, our waitress was very knowledgeable of all the menu items, and our waitress came by often to check on us.I'm looking forward to more outings here.  Next Yelp Event????"], ["Cathy C.", "Every glass of wine, every meal and small plates are over the top wonderful. Especially love going to Sunday brunch and relaxing with a glass of champagne and a special breakfast."], ["Rhoda A.", "Really amazing place for brunch, or a lounge atmosphere. They have an extensive wine selection that will suite any taste or budget. I've had brunch there and was not disappointed. Great place to take business associates, out of town friends, or any large gathering. Dined with members of the Jacksonville Foodies Club."], ["Erika G.", "Amazing. Was in Jacksonville on business and found this place on yelp. It's upscale, classy, fairly priced, food is delicious, and service was excellent. Would definitely recommend this spot to anyone. It was just what I was looking for!"], ["Carl B.", "Don't let the Mall location fool you!  Great destination night out - fantastic lounge area, great wine list and very nice Tapas selection.  Can get a little loud on the weekends but highly recommend it if you enjoy the Tapas experience"], ["Matt B.", "If you like great wine, good atmosphere, and small portions this place will be perfect.  We had both highlights, and low-lights....but overall found the food lacking bold flavor, and the restaurant too loud and crowded.  We were still hungry after 2 hours and 100.00.  The ravioli(yes it's just one) was delicious, the paella, clams, and artiCHOKE hearts were not."], ["Brent Z.", "I really love this place, which could be good or bad because I live across the street.  Great cocktails!  Great wine selection including some of my favorite lesser known California wineries.  Great bourbon selection too!  Already some of my favorite things.  And the food is very good too, particularly if you order correctly.  A couple of the small plates are, uh, very small, but that's probably my biggest criticism.  The brunch is excellent, and they have a very good take on the michelada made with Fat Tire.  Definitely a place to check out particularly if you like a hip social scene that is nice at the same time."], ["Amanda J.", "Super impressed! I hate that I missed the yelp outing but have been eyeballing this place since before it opened. The hubs and I tried the pick three charcuterie plate, then the bacon wrapped dates, the prosciutto wrapped artichoke hearts, the truffle herbed fries, and the chorizo cooked in red wine and herbs.   The place has a swank decor, and is very \"hipster\" but not too classy to pop in wearing nice jeans loved it.the space was bright and open, very modern, and had cool plush chairs and couches to sit and chill besides tables and booths.  The drink glasses are a bit small, but the portion of food for them to be considered tapas is perfect!  The bill for the two of us to share 5 plates was just about $45  not including a tip. I truly find this reasonable. Service was quick, friendly and totally hospitable. I'd say all in all this chef has completely changed my mind about chorizo! I've always had it crumbled, greasy and not very flavorful in most Mexican preparations. This soaked in wine was the most flavorful I've ever had! I sopped up the bread in the wine after the meat was gone. Absolutely delish.  Another high point were the bacon wrapped dates! Almost warm and candy like. The bacon was a welcomed hint of saltiness.  I have already planned to go back for my anniversary in September, so I can't wait!! I'm also super pumped to try a place similar to this one in Vegas in December called Jaleo. More reviews coming soon."], ["Tim C.", "Our recent visit to Ovinte exceeded our highest expectations. From the valet service at the door, to the menu, to the amazing wine list of by the glass and bottle, to quality ingredients and perfect presentation, start to finish was an awesome experience. While the entire service staff seemed to be spot on, our server, Carlo was the best. Ask for him when you book a table, you'll not be disappointed. We tend to compare dining experiences against our many years living in Napa Valley and enjoying constant 4-5 star dining. Ovinte easily matches up to many spots out there and surpasses quite a few of them in the total package. Eager to return and enjoy the outdoor patio, rain kept us inside this visit. Kudos to the entire team, it is very obvious that Ovinte is well managed."], ["Kevin P.", "Ovinte,  was a last minute option, however,  after dinning here this will be my first choice when I visit Jacksonville again.The food is great,  the service was impeccable."], ["Leighton D.", "2.5 starsMy wife and I went here while at SJTC, I want to recommend this place, honest I do, but I had one BIG issue. Because of that issue, I wanted to wait a few days to see if my reflection of the issue waned of if it grew... Unfortunately, it grew. So here is the review. The good. The food was great! Great presentation and flavor. The portions are a bit small, even for Tapas, with many of the tapas being 3-5 bites as opposed to 5-7 bites as with most other restaurants. Also, expect to pay about $1-3 more for a similar item that you would normally get elsewhere. Enter in the $15 ($14.50) shot of Don Julio? REALLY? I could understand if it was the \"70\" but regular Anejo, where at most places it is between $9-12? I guess you are really paying for the atmosphere... Which was really nice.Beautiful layout, designed for groups or smaller gatherings. Great patio, and I was impressed to see that you could have your pet on the patio, which goes back to SJTC being one of the most pet friendly areas that I have been to in the state. The inside and outside are ideal for intimate and upscale social gatherings. A nice place to meet for drinks after a day at the office. And Office attire is pretty much what you would want to be in most of the time when you visit. So why the 2 star review? The first impression. When we came in through the doors, the greeter looked at us and said, \"Can I help you?\" Not, \"Welcome to Ovinte, will you be joining us this evening?\" or any other variation of the standard greeter greeting, but in a tone as if we were LOST! REALLY?!?!?! As if to say \"Wendy's is across the street.\" While my wife was dressed a little more casual than I was, we were no where close to the folks that were there in shorts and flip flops, so I don't think that was the issue. And I really don't think any racial component played at all, so the only thing I can think of, is that the greeter was in a serious need of an emergency colorectal surgery to remove whatever object that found its way in to make her attitude so \"Sh***y.\" That first impression will be a lasting impression. The plus side of it was that our server was A++ Awesome! Portia actually made us feel welcomed and have us considering coming back. The other servers seemed to be pretty chill as well. Given that this is a place where you can EASILY drop $75 for a light meal for two, and probably go well in excess of $200 if you made an evening of it, I feel that the experience given should be top notch. Frankly, it wasn't. So that puts me in the position of whether to recommend or not recommend. If friends are wanting to go, I will have no problem going, but for NOW, I would rather go to Cap Grille if I am going to spend that kind of money, and get the outstanding service and experience that I would expect. Tip: MUST TRY THE BREAD PUDDING!!!ps. If/when I do go back, I will update this review accordingly."], ["Anthony N.", "This place was always on my list of spots to hit up. It definitely is a great spot and veers away from cookie cutter restaurants at the Town Center area. It was a first date evening and my date loved it. We started with tapas (crab cakes & bacon wrapped dates). Both were really good & season well. Crab Cakes came with a Romesco sauce. It really didn't even need it b/c the Crab Cake was so good. We had the braised lamb shank & Filet Mignon. The filet came out cooked perfectly & the lamb was nice and moist. I like the plating, instead of big massive plates. They came out in sizes that compliment the food. I am a chef, so I am very picky about places to eat at. I will definitely be hitting Ovinte up again. Might even make it my go to spot."], ["Anne P.", "This is a really attractive spot!  We ate on the patio, which was great considering we had a mellow after-the-storm type evening.As with any tapas place, if you go ravenous you could rack up a hefty charge, but the serving sizes are in line with this kind of place and the prices aren't bad. I really enjoyed my foam-enhanced mushroom risotto, very flavorful. There is a good selection of wines by the  glass and half-bottle and the full wine list looks quite extensive.  Our server was very attentive. Dishes were brought out by separate food runners, which  probably helps efficiency.My only real caveat: the seating areas near the bar inside could make conversation a challenge: everyone was super civilized but the conversation volume was up there."], ["Vetey D.", "Love the different decor and atmosphere! My husband and I really enjoyed the cheese and charcuterie. Spelling off? Haven't tried their entrees, but we were impressed with the service and atmosphere. Definitely going back :)"]], "Tres Leches Eatery": [["Sophia M.", "Great, authentic Latin cuisine and desserts, albeit somewhat slow on getting food out.Haven't been there since the remodel, so I can't say if that's effected the kitchen being able to prepare btter, but the last few times I've been here the kitchen seems to staffed by only one chef, which meant patience was were required.However, the deliciousness of the fresh made empanadas, and perfect goat cheese salad I received made up for it.Certainly worth checking out, and a worthwhile addition in riverside's expanding food scene."], ["Mariko S.", "What a cute little place! They were pretty busy for lunch on Saturday. We waited around a little for Tue table. Tue staff was very friendly. Small lunch menu perfect for small little place. I had eggplant lasagna. It was very oily. I'm not unhappy with it but probably won't order the same thing but would like to try other things. A lot of fresh veggies. Corn soup was delicious! I will definitely get that again ! They also have cakes and cookies and fudge available to purchase. It looks really good ! I would have gotten it if I wasn't on diet !"], ["Hunter H.", "This Stockton Street gem..never disappoints. The intimate setting allows for a unique and authentic experience. Every menu item is carefully planned and executed perfect...VERY AUTHENTIC. I always feel great appreciate from the owners when I visit. You can tell they take extreme pride in their crafty cuisine. It's a must go to show friends what Tres Leches is all about!"], ["Samantha M.", "My boyfriend and I went to Tres Leches last night for dinner after getting an advertisement on our doorstep describing their tapas and paella. The interior of this corner spot is inviting, with unique photos of their desserts displayed on the walls. I did notice that the indoor tables and chairs seemed to be made out of plastic, which for me didn't seem to fit the food or the overall atmosphere for dinner.We were immediately greeted by a very friendly man who I discovered was one of the owners of the place. He gave great recommendations and we started with their sangria. The sangria alone is worth a visit-I had to have two of them, it was so delicious. We were given some bread and olive oil to dip it in, which was also filling and very tasty. We already knew we wanted the paella, and were recommended the tapas sampler platter to go with it. We ordered that as well, to get a taste of all of the tapas they offered. The sampler came with a handful of olives, cheese slices, shrimp, crustinis, a garbanzo bean soup, chorizo slices and the best meatballs I have ever had. I am probably missing something else, but there were quite a few options. The paella came out quickly and wasn't like any paella I have had before. It almost looked like risotto with squid and mussels mixed in. I have to say, it was delicious. I would have ordered the mussels tapas on their own if I had known how good they would be.For dessert, we ordered the strawberry cake (all desserts are handmade in-house by the wife, we were told). It was very rich, full of strawberries, and the portion size was so large we had to get a to-go box for it. The service was extremely friendly. The husband and wife team came by our table quite often and It felt like we were at home or among friends. I absolutely loved the vibe and could tell the owners take a lot of pride in their business. They really should be, it was a lovely experience and I am looking forward to returning soon!"], ["Tiffany I.", "We really, really wanted to like their dinner but it was not good. We came for Paia and paid over $20 a plate to eat overcooked rice, no seasoning, and barely any seafood. The bakery items are decent but eh, not worth it."], ["Lael M.", "Love, love, love this place!!! We were greeted by such a friendly hostess. As first timers, my friends and I weren't sure what to expect but I'd say expectations were exceeded tremendously. The place is set amongst the chill hipster vibe that comes with the 5 points area. Our friendly and vibrant hostess greeted us with charisma and lots of advice and information on their selection. I was most appreciative of her demeanor and it made the visit that much more enjoyable. Between the three of us we shared the Marquesa, Pavlova, and the Carrot Cake. All of them were definitely delicious! I'd come back to this place in a heartbeat. You should totally check them out."], ["GT W.", "Nice local gem in Avondale/Riverside part of Jacksonville. Staff and owner were extremely outgoing and made a concerted effort to engage with us. Cuban sandwich was quite good, menu is small and tightly knit. Desserts are all homemade and in nice smaller portions. The interior is set up in such a way that looks like a bakery and eatery. Really nice lunch and brunch spot I'd say, have not been for dinner."], ["Cris S.", "Very attentive service from Lucky and great food. Spinach empanada with summer quinoa salad (yum) and chicken empanada with red rice. Beautifully presented and tasty. I'd definitely come again - maybe for Sunday brunch."], ["Daisy D.", "Had not taken the opportunity to make it over to Tres Leches since the Sunday Brunch Elite event until the other night. We had wrapped up dinner and were craving a sweet nightcap for the evening. It was hard to decide what to get as each option sounded more intriguing than the last. I went with the Chocolate Marquesa. Multiple layers of almond & chocolate deliciousness. It was a large slice of cake, but so light and airy. A perfect end to the evening. My husband went with their namesake - the Tres Leches. It was quite a large portion and would have been more than enough for the two of us to share. Tres Leches is a great little corner place in a great little neighborhood. Jacksonville should be proud."], ["Julie A.", "If you are a fan of meringue and desserts, then you are missing out if you haven't stopped in. I am in love with their chocolate marquesa cake. Namely because it is the only thing in Jacksonville that comes close to eating pavlova with the softness and the textures. (And I dream about pavlova everyday...)Tres Leches has come a long way. The first time I discovered them, they were only available during artwalk. I always made sure to grab a few meringues to bring home. Then a few months after that, I found out they had a tiny store front and I stopped in to get some sweet treats and savory offerings. Finally, in their current location they have much more room and a broader menu. I stopped in last year for the Yelp event, and I was impressed with their sandwiches and sangrias. They have weekend brunches which are a bit more than what I'd like to pay but still a tasty treat. I took my son here for Mothers Day since they were open later than other brunches around town.  We definitely picked the best place. They offered a nice variety including a dish called cachapas and pulled pork (cachapas are similar to arepas), crabcakes, several other dishes, as well as more traditional brunch comfort eats like pancakes and french toast.The creole crabcakes were delicious and satisfying, especially with the remolade sauce and mild kick of heat. Along with the main hot dish, brunchers can help themselves to the fruits, pastries, and grits."], ["William E.", "Found this place on a meandering road trip. Jacksonville, at least to a tourist, seems dead asleep on a Sunday, so didn't have any great expectations. I was pleasantly surprised. My cachapas were a great mixture of sweet and savory. My wife's crab cakes were a little small, but full of flavor. My favorite though, the grits bar. Perfectly done grits with the toppings you want. Not sure if this is a thing but more restaurants should do this (just ask tres leches how to cook the grits). Reasonably priced and the staff was truly delightful. I would definitely seek it out again."], ["Marie F.", "If someone gives me a tres leche cake I will love you forever. And the best Tres Leches cake has that pool of milk at the bottom. (check the star rating) Delicioso!I'm hooked and I can't help myself. I feel like I come in every other week to try something new on the menu but I ALWAYS get some Tres Leches. And for $6 you get a huge and heavenly tasty piece of cake. Besides the cake my absolute favorites so far ...Chicken waldorf salad - tender cooked chicken, sweet firm grapes, and served on fresh biscuit soft spinach bread. MUST TRY ITPumpkin Squash soup -  I found this almost as good as the Soup Joumou that we eat in Haiti for New Years. Although this was vegetarian friendly it remained very flavorful.Heavens forbid you are ever disappointed in your food - I can never see you being disappointed in the customer service. Staff is so genuinely friendly. It just feels so family - like and that appeal is very hard to fake."], ["Sasha Z.", "I came here a few days ago for lunch.  This is a Spanish/Venezuelan restaurant.  I ordered the El Pabellon and a Tres Les Leches Pastele (which happens to be my favorite type of cake).  El Pabellon is a traditional Venezuelan dish similar to the Cuban dish Ropa Vieja.  It consisted of a beef stew with rice and some vegetables.  It was delicious and better than any Ropa Vieja dish that I ever had.  The Tres Leches was absolutely delicious and probably the best version I ever had.  The restaurant was clean, had nice tableware and had a very warm, welcoming ambiance which I have not experienced anywhere else in Jacksonville.  The service was also excellent.  In terms of quality this restaurant can compete with the best Venezuelan/ Latin American restaurants in the Miami area.  My only issue with this restaurant is that the prices are too high.  The El Pabellon was $15 and only consisted of one serving.  The Tres Leches was $7!  This dessert dish is usually around $3 elsewhere in the country.  That's why I am giving them four stars as opposed to five.  This restaurant is definitely worth trying out especially for the dishes that I ordered."], ["Tess B.", "Every time I've been here, there has been something veggie friendly. I appreciate that. Service is quick and genuine. The facilities have never been dirty, tables always promptly cleared after someone leaves.They really try to reach out to the community, with special nights and brunches. I need not even mention the food, it's that phenomenal. It really speaks for itself. (I may go into food at a later update, when I've more energy to collect my thoughts). I have never, ever been disappointed by tres leches. And I doubt of ever will.What are you waiting on? Go give em a shot to wow you too. ;-)"], ["Michelle M.", "I have a massive sweet tooth that creates some problematic addictions for me. The restaurant's name comes from a dessert so delectable that if I were lactose intolerant I would still throw caution to the winds and eat an entire bowlful. The sandwiches are always fresh and tasty the soup is always divine. Subway and Firehouse has got nothing on Tres Leches. It's a bit too veggie for my carnivorous husband but I love everything they have. The owners are super welcoming and always nice. You can tell their food is made from the heart."], ["Emma D.", "It was a little hard to find, but the waitstaff were nice and they had nice desserts.  I had a handmade popsicle which was really good, although the lemonade wasn't as good as I expected.  I liked the atmosphere; it was comfortable and intimate but not crowded.  It smelled a little weird, though..."], ["Michael F.", "Came here for lunch on a weekday and was very impressed. The wait staff is very knowledgable about every dish and passionate about the food they serve. I'm not a fan of focaccia, but it was some of the best bread that I've ever had with a sandwich. The pulled pork sandwich is awesome. Their desserts look great too and I'm looking forward to their breakfast/brunch."], ["Anna H.", "So tonight is just for update and to add a well deserved Star to Eddie, Irene and the staff.  They are the consummate hosts!!!I sold the group ( 14 intrepid diners) on the Friday special Paella.  A flavorful dish not often available here in Jax.  There were a few who were curious about the other menu items and opted for; Tapas Plate a nice sampling of lamb & chorizo meatballs, shrimp, a chick pea and spinach gumbo, Serrano ham, manchego cheese and olives. There were mixed reviews some wanted more spice some less but over all the dish was rated a 10. Also presented Solomillo a pairing of splendidly presented medallion s of pork over Hasting potatoes and carrots.  But the star of the evening was the Signature Paella.  Made from Irenes family recipe no one was unhappy with the choices they made.  The wait staff keep the glasses full of water and most important for those of us drinking full of Sangria.  Flavorful, chocked full of chopped fruit and ice cold.   One might think after all that food we were done. Not!  This is Cake heaven and we indulged and shared; carrot cake, decadent raspberry chocolate cake, key lime pie, and finally very berry Mongolia cake. Whats left to say, oh yes once again thank you Eddie Irene and staff your combined effort and talent made this a great evening."], ["Tessa G.", "Went here tonight for my sister's birthday.  What can I say, except to say the service was abysmal.  It started out ok, it took a while for several in our party to receive their meals, but the food was good.  I never received my meal at all.  When I finally was able to catch one of the harried servers running around, everyone was done eating, so I just cancelled it.  They then took over thirty minutes to give us our checks which were all wrong.  They apologized and took a percentage off our bill, but it was very disappointing nonetheless.  I've been here before, and it's been fine, but this was my first time to go on a Saturday night.  I don't think they are equipped or trained to handle crowds and it definitely showed with the chaos surrounding the kitchen and wait staff."], ["Jessica F.", "Get the desserts! The various desserts are obviously made with care using fresh ingredients. They almost taste homemade! They have a number of vegetarian options that taste pretty good. The arepas are a real treat, especially with queso blanco!The brunch is an interesting hybrid of cooked options as well as a fruit/pastry/grits bar that is self-service. I've only been for Lunch and Brunch, but Tres Leches always impresses me. The staff tries very hard to make sure that everyone leaves happy."]], "Latin Creations": [], "Pollo Tropical": [["Diana M.", "This is a fresher take on fast food.  It is a Caribbean  style chain that serves up some different types of \"fast\" food.  Be careful on your choices, however, if you are looking for something truly healthy.  Some things that look low in calories may not really be!!"], ["Anthony H.", "Pollo Tropical is always a favorite for me. I always seem to get the trio with the chicken wings, 1/4 chicken piece and ribs. The corn soufflé is the side I selected which was a nice and fully combination if kernels and cornbread. I am not a huge fan of pinto beans but my wife selected them and they are average. The guava BBQ sauce is by far my favorite condiment there. I would lather everything in it if I had the chance."], ["Glenn E.", "I really like Pollo Tropical.The food is good especially for the price and its one of the quickest places my wife and I can get beans, rice and yucca!!Delicious!"], ["Gregory D.", "I'm not usually a big fan of Caribbean food. In fact, if given the choice between Caribbean and Mexican, I'll choose Mexican every time. However, my family and I visited here a few days ago and I must admit that I was not disappointed. Everybody else seemed to like it as well. In my particular case, I ordered a TropiChop, which is a made to order rice-based dish that you can add your own choice of toppings to and finally a sauce of your choosing to finish it off. The one I ordered was yellow rice with vegetables topped with fried onions and roast pork. As I had expected, from my previous experience with Caribbean food, it was a little on the bland side. But then I visited the sauce bar to choose a sauce to top it off with. I chose the cilantro garlic, a white sauce, and once I added it to my dish the character of the flavors changed entirely. It was really good. The atmosphere reminded my wife of a Caribbean version of Boston Market. I'm pretty certain that we'll be back."], ["Chris B.", "Mojo Roast Pork was awesome, but the fried yucca was horribly overcooked and hard as a rock."], ["Chelsea S.", "The Pollo Tropical in Mandarin is better."], ["Dave C.", "Ohhhhhhh how I love me the Pollo!  I love the guava BBQ sauce and the corn.  I wish we had a Pollo in Raleigh I would definitely eat there once a week!"], ["Gene C.", "pretty good"], ["Karen H.", "What a great place for a quick lunch or dinner.  This new restaurant is quickly working out \"new place jitters\" because our dinner last night was very good.I had the Riblets, corn & Cesar salad (disappointed in salad, needed a little more dressing for my taste) but the riblets were terrific, very tender and tasty, my mother had the Ques. Chicken Salad and she really liked it and it looked good, the chicken was tender and juicy, and my daughter had the Ques chicken wrap with waffle fries, she ate every bite and was the first to finish looking around at what she could sample from our plates (this is very rare for her).  Mom's salad was so big she took 1/2 of it home.My absolute favorite taste last night was the Mango Tea!  I had read on reviews on other Pollo Tropical restaurants how good it was, so I had to try it, and it is delightful.  I will return just for this tea!The staff could not have been more helpful and kind and were extremely busy.  It was pretty obvious they go through lots of training.And, believe it or not, a fast food restaurant with food on real plates & bowls, and with real utensils wrapped in a nice napkin (not the cheapo ones, those are by the soda machine)!  They also have beer and wine including their own Sangria in a large glass urn on counter. I'm not sure about other bar drinks.If I go back and it is this good then, I'll have to give this place one of my rare 5 stars."], ["Milika M.", "One of my crew said it was ehh\".. I had to try... I like it! Sometimes you need to try things yourself! I enjoyed every bite and prices are reasonable! Never trust another person taste...until you try it! 3 stars for me! Chicken was succulent and the brown rice with red beans are terrific! Many choices if you are on a strict diet!"], ["Wendy m.", "I have been eating at Pollo tropical for at least 17 years or more now. I have been many times to one of the first locations in Miami near the airport and have frequented orlando area locations 50+ times.  All I can say is I felt out of place here. I'm white but my  husband is puerto rican so I know all the dishes and pronunciations even though I speak almost no Spanish and I felt too Spanish for this place. I was the only one in the restaurant not eating mashed potatoes or mac and cheese. So yeah that shouldn't effect my ratings but may be a reason no one ordered plantains or red beans both were the worse I've ever had at a pollo tropical. Beans were mushy watery unflavored and the plantains tasted like they were made hours earlier  and were soggy.  I personal don't like the table service of new pollo tropicals. I feel like I need to tip and I hate being interrupted while I eat at a fast food place. The location was clean and sauce bar was well stocked. This location does serve sangria and beer which is a nice touch. The kids meals come with Ice  cream which is a nice perk."], ["Justin N.", "So I love Pollo, but my most recent visit was actually pretty terrible. Found hair in my mac and cheese and my wife didn't get dressing or chicken on her salad. The couple next to us didn't even get the sides with their meal. However, a good note, their wait staff was excellent."]], "Cooper's Hawk Winery & Restaurant": [], "Puerto Plata Restaurant": [], "Mi Pueblo": [], "Havana-Jax Cafe": [], "Restaurant Orsay": [["Matt M.", "Orsay has always gotten great reviews, but it is very far from my house at the beach that we have never made the trek to try it. However, someone gave us a gift card so there was no reason not to give it a try. We opted for a Valentine's brunch, which was perfect for us. First let me say that parking was a little confusing, but an empty lot and parking near the entrance were fine once I figured it out. They also may have valet at night, but don't quote me on that. My wife wanted to try two dishes, so on VD who am I to argue?  Yes, she ordered two dishes and we shared them. Mostly I ate the Steak Frites, and the steak was wonderfully prepared and flavorful. The frites were also tasty, well seasoned and very plentiful.  But the star of the show was the aioli that accompanied the steak, it was delightful and I was trying to get the recipe or sneak some home to my top secret reverse recipe lab. Our other dish was Steak and Eggs with the eggs served in a hollandaise sauce.  The eggs were perfect and if my wife let me try the sauce, I am sure it would have been tasty because she ate every drop. An added bonus was the freshly squeezed Orange Juice, DELICIOUS. In end, I realized I left my gift card back at home so another visit will be in order."], ["Jamyal L.", "Drove in from out of town for my GF bday. She had the porkchop which she hasn't stopped raving about. I had mussels as an appetizer and they were fresh.  For my entree I had scallops. They were incredible and the plating was phenomenal. Dessert was cheesecake bites, macaroons and the fried waffle. Now I probably have diabetes. Best restaurant I have attended by far."], ["Aubrie T.", "This is my favorite restaurant in Jacksonville. They have a great happy hour with reduced price drinks and apps. My favorite app is the cheese plate. My bf loves the oysters. We wash it all down with a glass of wine or a dark and stormy."], ["Austin F.", "Took my beautiful girlfriend here last night for dinner. Ambiance is great, we were seated immediately and picked The French Mistake for drinks. Shared the sauteed calimari (tasted great), she got the Duck Breast which was excellent, I had the lobster pot pie. All of the above was superb. Then topped it all off with a great peanut butter torte. Knocked it out of the park, we had a great time and are sure to return. Highly recommended!"], ["Elizabeth G.", "Ok, this is a short review because I only ate at the bar table. Everything I had was great (rillettes, etc.), the service was fantastic (Jamie brought us this great stuff)  and the drinks are excellent. This was a last minute decision so we hadn't made a reservation, but it was wonderful and fun. It's very lively and comfy at the same time. When I eat dinner here I'm sure it will get its next star."], ["Sara P.", "Went there recently for our anniversary. Great service and excellent food. The food came out quickly. The ambiance was really romantic. Ordered the pan seared fish. TO DIE FOR. Will be back there soon."], ["Joseph G.", "Hands down the best restaurant in Jacksonville.  Nothing even comes close. They have an exquisite French inspired menu. I have been here numerous times and they have never disappointed. I have taken risks and ordered things which I would not usually eat and am continuously blown away. This is going to sound crazy but my favorite dish which they serve is the Beef Stroganoff. I don't typically enjoy beef stroganoff but Restaurant Orsay's is take on it will knock your socks off.    On a personal note, one time I arrived at Orsay and needed to run back out to my car to get something. It was pouring rain outside and I had my umbrella. On my way back from my car I noticed someone from the restaurant's kitchen carrying a heavy container out to the trash so I held the umbrella over him so he would not have to work the rest of the evening soaking wet. Once I sat down at the table our waiter brought us a plate of scallop tartare and steak tartare. He told us it was on the house because I helped out one of their employees and they wanted to show their appreciation. I thought that was very kind of them to do that and it really made me look good on my date ;-) It work out for them too because the steak tartare was absolutely delicious and I ordered it every time I went thereafter.     The Truffle Mac and Cheese is a must order. It is to die for. I usually frown upon restaurants trying to do fancy macaroni and cheese but Orsay's is no joke. Definitely indulge in a few of their signature cocktails. They also do a Sunday brunch that is incredible. They have a quiche dish that is different every week based on whatever it is the chef feels like making that day. Needless to say every week it's more delicious than the week before."], ["Suave G.", "Great food Brian is a great server.Very fine use of words when describing food. Not many servers in this industry that understand food like him."], ["Maya C.", "Another wonderful time at Orsay! We were up Park Street at the River City Pride Parade and couldn't resist the urge for appetizer's and cocktails until we got over to our side of town. Traffic cleared up and streets were unblocked and we were on our way. Both parking lots, Orsay's and the one next door, were pretty full but we were able to find a spot. We knew it would be busy when we saw people sitting at the outside tables. Inside was hopping for dinner. We were hoping to get a table in our favorite waiter's section but there was no tables left at the time, only seats at the bar. We were fine with that since we weren't having a full dinner. The bar area was very clean and the bartenders were very attentive. My friend and both ordered French Pear Martinis, a restaurant favorite apparently. This drink is delish and goes well with anything. We ordered a few apps: oysters, mussels, steak tartare, and marinated calamari. I hadn't had oysters in a long time so I kinda forgotten what they tasted like. At the very first bite, it all came back to me. I LOVE oysters! These oysters tasted like they just came out of the ocean. They were so fresh and ocean-salty, I almost wanted to order more. The steak tartare was good but different. It didn't occur to me that it was raw beef when my friend ordered it and I agreed I would share it with her. I ate it anyway because Orsay can do no wrong in my eyes. Everything mixed in with with made it delicious. The mussels are good as well. The broth that the were cooked in made for a good dipping sauce  for our complimentary bread. The marinated calamari was fantastic! I always get this when I come here. This has to be the best calamari in Jacksonville. We initially didn't want dessert but let's be honest, it's Orsay! I got the Blueberries and cream and it was soooo creamy and decadent. My friend had the Banana Bread Pudding and she loved it. I had a taste of it and I was very good. It was still busy when we left so we didn't get a chance to say bye to our favorite waiter, but we knew he'd see us again."], ["Ellen K.", "This restaurant has a great atmosphere and amazing food.  We took my parents here while they were visiting us for the weekend and we thoroughly enjoyed our experience.  The raw oysters were fresh and shucked perfectly, the escargot appetizer was sublime.  Megan was our server and she was wonderful.  She gave spot on recommendations and was very knowledgeable on their wine and cocktails.This is definitely one of my new favorite places to go in JAX."], ["Terri B.", "Exceptional food. Great drinks. Good service. James beard 2015 semi-finalist. Definitely warranted this type of accolade. Highly recommend the lobster pot pie.....based on my fellow diner \"sopping\" the gravy out of the bowl with what was left of biscuit. Our group enjoyed numerous appetizers including the trois foie mousse, however the mousse was over salted. The other appetizers including the olives and the sautéed calamari were extraordinary. Table entrees included the Orsay meatloaf, the stroganoff and the fish (flounder) special. The meatloaf should definitely be labeled as a comfort food with a slight twist/use of duck and liver.....an absolute delight. Drinks varied from old fashions to more contemporary libations, however the beer list was broad but shallow. We ended the meal with the dessert tower which proved to be underwhelming hence the 4 stars. Overall - I would recommend this restaurant all day!"], ["Matt R.", "Very good meal. A great selection of alcohol and wine. I would recommend asking the bartender to take it easy with the ice."], ["Stephen M.", "I have been here several times. It is consistently a great experience. I have had the vegan Shepards pie (both fall and spring items which feature seasonal vegetables) and it is one of my favorite dishes. The staff is very friendly and help make it a special occasion. It is pricey, but well worth it."], ["Emely W.", "West coast meets Jax.After being in Jax for business for two days, was pretty disappointed on food options. Till I came across Orsay.Everything on the menu is caught daily. An array of local farms was listed from which the meat, fish, vegetables, fruits came from. Nice to see establishments recognizing and working with farms instead of giant distributer who God knows where everything is from. The scallops melted. My jalapeño martini amazing. Ambiance fresh. For a minute I forgot I was in... Jacksonville.Thank you for making this trip much sweeter.A must go."], ["Jack B.", "Great staff, and I really mean it, we know the owners and see staff come and go, but the existing staff do an excellent job at training the new staff. People spend some good money at Orsay, so they expect great service. Very good staff at Restaurant Orsay.Was just up there for some Champagne, sat outside with our friends, I had some scotch from the bar, neat and the service was amazing just as the products were too. My favorite appetizer is the Steak Tartare. If I am eating a meal, the pork chop is one of the best anywhere. The croque madame reminds us of Paris every time we are there. We have our favorites for sure!"], ["Amanda A.", "This was my first trip to Orsay.  I have heard a lot about it, and it was highly recommended.  It definitely lived up to the expectation. The food was amazing our server was amazing.  Everyone from the hostess to the chef (Who came out and talked to us about the preparation of the filet mignon) was incredible. We ordered cocktails and a bottle of Chianti.  Decided on a combo of meat and cheeses.  I ordered the mushroom bisque soup, it had a creamy and velvety smooth texture and earthy delicious taste. My date ordered the French onion soup, he said it was great, it was extremely rich and full of flavor. Our entrée was delayed so our waiter offered an appetizer while we waited, we ordered the sea scallops and the waiter recommended the steak tartar.  The steak tartar was my favorite. So flavorful yet light, wonderful texture, I highly recommend. My entrée was the filet mignon, perfect crust and perfectly cooked medium rare.  Was so tender you could cut it with a spoon. My date ordered the lobster pot pie which he devoured.  The mushrooms were amazing in the dish. I was a little too full to have a real bite, but somehow we saved just enough room for desert and espresso. We ordered the crème brulee, which had the perfect hard crust on top. It was creamy and flecked with vanilla bean seeds. I thoroughly enjoyed our night at Orsay and we will definitely return soon. No doubt one of the best restaurants in Jax."], ["Anna H.", "I learned about Restaurant Orsay several years ago while stuffing myself some of the best sushi ever. I was talking with the owner of Sushi Pop in Oviedo Fl.  and told him I was visiting and lived in Jax. Thats when I learned about Orsay.  As soon as I returned, I was there and have been a regular ever since.   I thought finally a restaurant in Jacksonville that will shake up the true foodies of the city.  Well it's only gotten better.  Yesterday was my first brunch experience but will not be my last.  Starter; French Pear Martini, or two.  Let's get to the food;  Three dollar Deviled Eggs perfect presentation tasty yolk and just the perfect tip of crisp asparagus.   I am not a fan of truffle oil but the acid cut the usual chemical taste I always experience.  Next I moved to the Lobster Mac & Cheese  now I have tried this on every menu I seen here in town and make my own but this was a beautiful dish full of bite sized pieces of lobster and a sweet combination of Parmesan Reggiano & Gruyere.  I ordered the small portion but by the time my companions tasted it there was nearly not enough left.  Lesson:  never share!  Next the Duck Confit Hash.  I have only had Duck Confit in France but the moment I put the meat in my mouth the memories came flooding back. The fingering potatoes were browned to perfection and succulent with the duck fat.   OMG did I say Duck Fat.  I had to order another Martini to quell the rush..  Well realizing   I am already into Augusts calories I should go ahead and have desert;  Chocolate Guinness Mousse Cake..  Marvelous presentation the mousse had just the correct amount of tart/sweet, light and airy combined with the slight  tartness of the cherries made this a perfect choice.I have to also give Daniel 5 Stars.  He was so attentive,  funny, knowledgeable about the menu.  I can't rember a time when there has been better servive.  Thank you Daniel!!!!"], ["Anthony S.", "What is NOT to love about this restaurant. In my opinion, the best in Jacksonville and would be tops in most any other city, big or small. I have yet to experience a local restaurant that seamlessly blends ambiance, service and knowledge with world class food. Weather for happy hour (try the duck prosciutto) or dinner (take your pick) ALWAYS 5 star!  If you live at the beach, grab an UBER, take the short drive to Riverside and enjoy the best Jax has to offer. Wine selection is fantastic."], ["Alex M.", "Best restaurant in Jax, hands down my favorite overall. The food is so good and the drinks can't be beat. The staff is so down to earth, and polite they make you feel like you're part of a family when your there. Well maybe its just me or the drinks that make me feel that way, because the drinks here are second to none. They are creative, ridiculously good, and I can never have less than three of them, because they are just that good. Food wise, I've had the olive and cheese tray every time I go, it's a must. And I know it's known to be a steak place but everything I get is over the top with flavor, always cooked to perfection. If I had to sum up all of my experiences here with one word, it would be perfection. Spent multiple New Years here, each time better then the last. Will be going back. Now I had to think long and hard to a downside. Couldn't come up with one. Then it hit me. The location and parking. It's a bit out of the way, not really in any majorly trafficked part of town like the town center, or the beaches. It's also not downtown or in riverside. More like on the outskirts of Avondale. At the same time that also adds to its hidden gem feel and persona. However the parking leaves a bit to be desired, and the empty gym next door where most patrons are forced to park has little or no lighting. Makes me happy I have my concealed  carry when I have to walk through that empty, dark parking lot late at night. Overall I love this place and am always talking it up. If your on the fence about it, or never been GO! And you can thank me later."], ["Terence D.", "You're not going to find a better restaurant in Jacksonville, FL.  One of those establishments that would compete favorably with the best in a city like NY, but without the fancy restaurant attitude or snob factor.  Friendly, approachable staff, excellent food with traditional French influence with an innovative edge.  Fantastic and creative cocktails.  We'll keep coming back."]], "Tapa That": [], "El Ranchito": [["Maisha R.", "So, I went looking for a great lunch during one of my first days in Jacksonville this past Summer.  Yelp helped me find this cute little family-owned restaurant.  I got the lunch portion of the signature Colombian dish - bandeja paisa. Despite being warned by the owner that the \"lunch-sized\" portion was essentially half the size of the regular portion, I was pleasantly surprised by the hearty helping!  What a variety of food - sirloin steak over rice and red beans, pork rind, avocado, plantain, fried egg and a corn cake, all for $7.99. It was a great deal!  The pork rind and plantain were exceptionally good.  I only wish that I'd grabbed a side order of plantains to snack on for the rest of the day!  Unfortunately, the corncake (which needed more seasoning) and the soursop smoothie didn't fare anywhere near as well.  Despite the guy being very nice and really encouraging me to try it, after one sip I knew that I couldn't drink anymore.  He was nice enough to refund my money.  Overall, I really enjoyed the food and the 1/2 portion was enough for lunch and a snack!"], ["Cameron D.", "If you're looking for some real Cuban food, this is your best bet in the Jax Beach area. The Ropa Vieja and Lechon Asado are both just tremendous. The Carne Asada and cuban sandwich are both okay, but the strength of El Ranchito is definitely the above stewed dishes and the Bandeja Paisa (traditional Colombian dish).The prices are quite nice, especially for lunch ($7-9 for a generous entreé with rice, beans & sweet plantains)."], ["Debra P.", "One of my fav restaurants in Jax! Food is excellent and you can tell its a family owned restaurant!!!"], ["Monica S.", "I just love when I find these little hole in the wall places!!!  This ethnic delight is an itsty bitsy, tinee tiny, crazy delicious Columbian food restaurant tucked beside the Big Lots on Beach Blvd.  There are maybe 10 tables here.Chips and salsa were served prior to the meal.  The salsa was homemade and tasted like fresh veggies! YUM!!I had a lunch sized Bandeja Paisa which was around $8.00 or so.  Really tender, thinly sliced, beautifully seasoned, sirloin steak over a bed of red beans and rice, avocado, homemade white corn cake patty, traditional Columbian pork rind, plantains and a fried egg on top of the sirloin.  Whew!This was a meal fit for a Foodie Queen!....Like me!  Great, AUTHENTIC Columbian fare here."], ["Rob M.", "Overall: Food was fresh and tasty.  Service was excellent.  I will be back.  4 stars (see below)Ambiance:  Not much in the way of ambiance.  Nothing fancy.  Very small.  It seemed pretty clean. (3 Stars)Service:  Very good.  Freindly and attentive.  (4 Stars)Food:  I had empanadas and an arepa.  Wife had Ropa Veija.  We shared flan for dessert.  Chips and salsa were served as well.  Empanada was very good.  tasted fresh.  I did not like the arepa, but I concede that it may be because I was expecting it to be more like the arepas they serve at fairs.  The ropa veija was very tasty as well.  Both my wife and I loved the flan.  It was very good (and I usually don't like flan).  The chips were average.  I prefer them to taste a little fresher.  The salsa was good too.  They had a selection of latin beers on the menu, but only had Aguila in stock.  They did bring out a frosty mug without me having to ask, which I appreciated.  This isn't a bar, so  I'll give them a pass.  (4 stars)"], ["Debbie M.", "First of all, the restaurant is in a sort of run-down strip mall (lots of empty storefronts, etc.), but I don't say that to deter you. I'm just preparing you. This isn't a fancy-night-out kind of place. What you will get at El Ranchito is friendly service and good food.  I'm from South Florida, so I'm pretty fond of all kinds of Hispanic food. To pleasant surprise, El Ranchito is a mix of Cuban, Colombian, and Mexican (although they do Mondongo on Fridays, which I think is Dominican??). Anywho, my husband and I split the Cuban-style empanadas, which were really good. Fresh, not frozen. I wasn't too impressed with the arepa con queso. That could be my tastes though since these were also very fresh. I just didn't think the arepa itself had much flavor. For our entree we split the ropa vieja, which is my favorite. I was not disappointed. Finally, we had the flan, another of my favorites. Fan-freakin-tastic. That is all."], ["Sivam R.", "Great Columbian/Mexican food, great people. So far this is my favorite Mexican restaurant in Jax. Definitely worth a visit."], ["Dawn N.", "The food is fresh and authentic."], ["Robert G.", "Very good food and value for the money, especially the lunch specials.  The owner, who is from Central America, takes the orders and serves up the food and drink.  His wife, who is from Columbia, is the cook.  Their son helps his dad.  Very nice people."], ["Ashley O.", "My fiancee and I had a delicious dinner here tonight. We had an order of the bandeja paisa, which was huge. Rice, sweet plantains, steak, and chorizo, egg, beans, and pork rind. Yum. I had a side of the aji colombiano to have with my steak - highly recommend. It's delicious!He had the ropa vieja, a type of pulled pork with vegetables, some maduros (the sweet plantains), and rice. His plate was clean :-)Generous portions, great service, and an overall excellent experience! We'll be back."], ["Younjin L.", "Great Bandeja Paisa!"], ["Bob S.", "I've found a new favorite restaurant.  Only wish it wasn't so far from my house!The menu here is Columbian / Mexican.  Everthing is made in-house, including the flan and tres leches.  I had the Bandeja Paisa, and I probably shouldn't have eaten it all.  It filled me up.  The chips and salsa were very tasty, and the salad (shredded carrots and cabbage, with slices of tomato and avocado) had a great dressing that really complimented the flavors.Ceviche, tostones, congri, chicharrones... and attentive and engaging service.  I'll be back for sure.  I may have to bump this one to five stars."], ["C N.", "Family owned the food is good, very friendly staff the food comes out quickly and very tasty,"], ["Mary B.", "This is a great family owned restaurant.  My husband loves it too.  he gets the flank steak and I usually the lechon asada (pork).  Both are amazing. Very friendly family running the place too."], ["Jeff P.", "This place is just delightful in so many ways. Family run business with great service and awesome food. Looking forward to my next visit"], ["Meredith H.", "Monica is right! This is an amazing hole in the wall place!  I went here for the first time with a Colombian friend of mine because he wanted me to try an authentic Bandeja Paisa.  This place definitely pulls out all of the stops. The pork rind is cooked and seasoned perfectly.  It's has a delicious crispiness that really makes it a treat!  THe rice and beans are cooked to perfection as is the steak.  The patacones were sweet and just slightly crispy on the edges and they just melted in your mouth.I also ordered the flan and for once, it wasn't the premade custard that you can find at just about every latino restaurant for hundreds of miles.  This is like the one Grandma made.  It's rich and velvety like cheesecake.  It's small, but dense, and after the huge entree portions, it's best served with two spoons. The only thing that might have been better than the food was the service!  It seems to be a family run establishment.  The server was friendly, informative, attentive, and it spread through the small restaurant.  People between the tables were quick to announce their favorite dishes on the menu.Jacksonville is really short on amazing little places like this, so we need to what we can to keep them around! Next time you are thinking of hitting up La Napolera a few doors down, take a risk on something non-chain by giving El Ranchito a chance instead - you won't be disappointed!"], ["Kristina D.", "Wonderful food and the owner is a sweetheart! Try the Bandeja Paisa or the Masas de puerco. Both are so good!!"], ["G B.", "Food was good but not something I'd write home about. Good prices, clearly family-owned.  The Colombian style empanadas were probably the best part of our meal. Mexican salsa was so-so, mostly tomato, and cost extra. Stick to the Colombian specialties, try to avoid busy times (they were understaffed when we came, but friendly), and you're likely to leave happy."], ["Jesus S.", "This is a small 'hole-in-the-wall' type of place with several tables, Colombian music in the background, and relaxing ambiance. Do not think twice, just go! You won't regret it! This is an excellent mom & pop shop with authentic Colombian and Cuban food. Highly recommend the Bandeja Paisa and the 'Masas de Puerco' (Pork chunks)."], ["Lauren J.", "Fabulous Latino food.  The chips and salsa are as good as any Mexican restaurant in the U.S., but what really makes this place stand out are the Colombian specialties.  The empanadas are wonderful.  The chicarrones are crispy cubes of pork attached to a strip of crunchy, delicious pork rind aka crackling, and if you've never tasted real pork crackling, boy are you in for a treat!  All I can say is that if we have another revolution in this country, one of the items I'm bringing to the table is why they don't sell more fresh pork belly with the rind attached here like they do in other countries.  Yes, there are better things to do with it than make bacon and this is one!  Wait, let me wipe the drool off my chin and calm down.  OK.  That's better.  Lest you think this review is pork centric, oh no.  There is plenty of yummy stuff on this menu so that your vegetarian sister-in-law can also have an excellent meal.  Beans (red or black), rice, plantains, salads, and all kinds of wonderful fruit drinks (again, why do other countries cuisines do this so much better than we do?)  be daring, go beyond the orange juice and try guava or pineapple or raspberry or even more exotic fruits.  You probably won't need it to cool down the heat, though, as most of the (non-Mexican) food isn't that spicy, just tasty.  The bandera paisa is easily enough food for two people.  And just to put the icing on the cake de tres leches, this place also is excellent value for money."]], "Tapas Old World": [], "Espana": [["Patrick W.", "Wonderful food and great staff.  Exceeded high expectations!  Go there!"], ["Heidi R.", "Such a GREAT place!  The food was amazing and the staff was equally great!  You MUST try the paella!!  A special thank you to Wendy at the front who got us in without a reservation and helped us to forget our bad SC tapas experience!"], ["Elisha R.", "I dined here with a group of 12, which included 6 kids. They did have a children's menu although it isn't a paper menu, they do offer meals such as chicken tenders and fries, spaghetti with marinara sauce, and fried shrimp and fries for the kids. I had the tapas offerings of the coconut shrimp in a sweet and spicy sauce, their house side salad, and the potato, crust less quiche. My shrimp were delicious and the coconut Thai styled sauce was so good I ate the sauce even after my 6 shrimp were history. If those shrimp was all I would have  eaten then this place would get a 4.5 star rating, but...the advertised crust less potatoes, cheese, and veggie quiche left much to be desired. It was very bland and probably could use a buttery crust, more cheese, and salt. The asparagus in the quiche was overcooked and I would have preferred them less mushy and with more sea salt! The salad was a salad. For this to be a \"fine dining\" establishment, I didn't feel like my $30 was well spent."], ["David C.", "This was not my first visit to Espana. The atmosphere and staff are amazing and the food superb. I try to never order the same thing because everything is incredible. Sadly I am allergic to shellfish so the most amazing looking dishes I have to stay away from. Easier to get seated when you make a reservation!  If you are in the area Espana is a must!"], ["Kaitlin C.", "Yes, yes, yes. By far my favorite dinner during my husband and I's recent trip to Amelia Island. Great ambiance and DELICIOUS food from start to finish. It was busy and we had to wait a while for a table (make a reservation!), but totally worth it. Definitely give it a try!"], ["Rob C.", "Recommended by the concierge and did not disappoint.  We shared the shrimp ceviche, mozzarella salad, and then the snapper special with shrimp, scallop, rice, zucchini and onion and other goodness. :) Shrimp and mozzarella salad was very good and the special was excellent!  Our server was very nice and helpful. The only reason we are not given 5 stars was that the hostess was not very friendly, and that seating us seemed an inconvenience to her. Definitely recommend and they should make the snapper a permanent menu item!"], ["Jim C.", "Don't miss this authentic Spanish restaurant when you are on Amelia. Service is outstanding and the food is stunning. The snapper with poblano creme sauce is outstanding"], ["Ashley J.", "Bottom line- Disappointed by the service & Beware of the specials!!! It's their way of rebranding spoiled food.  I was visiting Amelia Island on vacation with friends and Espana was recommended by the B&B. We ordered a few tapas: Calamares Fritos, Caracoles, Chorizo Encebollado  and Picadinho were good; but much to my bewilderment the \"mussels special\" was AWFUL, as some of them had clearly spoiled!  This situation was worsened by slow service and the fact that the mussels began to emit a rotten fish smell as they sat on the table. Eventually, the waiter came and took the plate away, but no apology was offer from the waiter or anyone else; which I believe was the least they could have done."], ["Robert A.", "The Food and the service was amazing. A wonderful experience.. The Tapas  were out of this world.."], ["George H.", "This restaurant was recommended by the owner of one of the shops. He is a foodie, and he said it was his favorite place. We were not disappointed. The service was very good and knowledgeable.  My wife and I had shrimp Mozambique and shrimp Costa Brava. Both were excellent. Next we had the mussels and the special empanadas.  Empanadas were stuffed with pork the chef had roasted on the green egg out back. Both also very good.  Decent wine selections by the glass. We would highly recommend this place for food, service and ambience.  The only negative note for us was the bread.  Both of us love bread, but we didn't like the crumb.  It was too soft. But, a tiny complaint considering the rest of the meal."], ["Alcy M.", "Impeccable service from all of the staff here at Espana. Our server Jeremiah was one of the best servers my mother and I have ever had. He was extremely knowledgeable of the menu and definitely did his research on Spanish cuisine. We were very impressed before the food even arrived."], ["Michelle M.", "Had the antipasto to start; amazing meats cheeses and olives. Yum. Then shared the Fishermans Stew for two. Badass. The best seafood stew either of us has ever had. Super fresh, spicy, and boiling upon arrival. Had the Evodia Granache bottle to go with; paired perfectly. Our server also surprised us with a champagne split for our anniversary. Sweet!"], ["Benjamín S.", "It's been long enough since I dined at Espana that the only thing that jumps out about the meal was the Gambas Mozambique - far and away the best dish (out of four) that I sampled, and based on other reviews a dish that should absolutely be ordered if dining here.  The other dishes were okay - not great.  One was too salty, and one had only mild flavor.Fun fact - the restaurant's acoustics trend towards the loud, and I overheard not one but *two* blatantly and offensively racist conversations at neighboring tables.  Yay northern Florida?"], ["Viv S.", "Espana is the best restaurant on the island hands down. The food is so fresh, so tasty and the staff could not be more pleasant & professional. The ambiance is as fun as you want it to be, or as romantic as you wish. Order the Shrimp Mozambique, and don't forget to dip your bread in the sauce. My favorite entree is the Tenderloin with blue cheese. My husband's favorite is the Paella. Great wine list, or order the Sangria, which is delicious. Seriously, if you are looking for a perfect dining evening, look no further."], ["Reed R.", "For our first dinner at Espana we chose from the hot and cold tapas selections.  Our choices were recommended by our waiter, 4 of the 5 were seafood, all were spectacular.  The empanada was admittedly my first, but definately not my last.  It's crust was a a baked delight with beef and goat cheese filling.  We skipped desserts as the above and a bottle of Gascon Malbec rounded out our meal completely.  For our next trip we will most certainly try the Fisherman's Stew.  A bowl for two was delivered next to us, and it looked and smelled like an interesting choice."], ["Sarah E.", "We have been to Espana twice - once two years ago and once this past week.  Both times we really really enjoyed it.  The paella is delicious!  The atmosphere is really sweet and cozy as well and the service was excellent. Definitely a must-visit when staying on Amelia."], ["Tim G.", "Amazing. Do not miss this place. The fisherman's stew is wonderful. Staff is great. Service is great. Wine was affordable and fit dinner perfectly."], ["Meredith W.", "Loved the food and the ambiance. Gamba appetizer was the best part of the meal. The paella was a little burned on the bottom. Otherwise we loved it"], ["Mary L.", "I come to Espana every year for my birthday and it never disappoints.  Last night we decided to get tapas and basically sampled almost every appetizer they have.  Everything, as usual, was delicious. They have recently upgraded the interior and it is beautiful.  The owners are very nice and will do everything they can to make your experience memorable.  It's just so good!"], ["Denise L.", "Amazing dinner! Looks lile it is a local favorite. Make a reservation! We had the fisherman's stew, so good. It was better than any meal we had in Barcelona. Presentation was good. A relaxing 2 hour meal. Off the main street."]], "The Brick Restaurant": [["Tiffany H.", "Hands down one of the best restaurants in Jacksonville. No doubt.I've been to The Brick for brunch and for lunch, and each time seems better than the last. The eggs benedict is a meal I swoon over in my head even weeks and months after the experience. They have several variations -- a tomato-mozz, spinach feta, etc. I love choices and variety so this in itself makes me extremely happy. The bloody mary's and mimosas are spot on. They do several different omelets and other brunch dishes that you'll be talking about for days.For lunch, they have a lot of excellent salads, the best (in my opinion) being the kale with grilled salmon. I don't know what they do to their kale, but I have never before or since had kale that was so tender, flavorful, and pleasant to eat. People and their bad kale jokes, be damned! Come to The Brick and see why kale is one of the best leafy greens you can get. The salmon is super delish and always cooked to perfection. Be prepared for a decent check, but it's truly not as expensive as it could be for what you get. A fantastic meal, very classy ambiance. If you're feeling underdressed, sit outside! Get in some people-watching on St. John's Ave, where you'll see hipsters and Ralph Lauren polos alike. If you've never been to The Brick.....do it now!!!"], ["Ouida P.", "I don't have anything but great things to say about this place. The food was delicious, the ambiance beautiful, and the service spot on. On our first trip, my hubby and I had the shrimp and grits and the prime rib sandwich. Both were delicious but nothing tops the shrimp and grits. Within a week, we were back arguing over who would get to order the shrimp and grits. The appetizer is the better deal and you should definitely get your shrimp blackened. We tried the larger portion and shrimp made a different way...we realized quickly, we needed to heed the advice of our first server. There's something about the flavor fusion with the portion size that just polished the equation of the dish. Don't get me wrong, the prime rib sandwich was very flavorful and certainly worth consideration. I think hubby had a sandwich on another trip as well. All DELISH. For me though, the signature (for now) is the s&g. There was also live music on one of the nights we went. I can't remember which night because I was probably s&g wasted by the time they started to perform. Nutshell: A great casual date night spot for grown folks craving...wait for it...shrimp and grits!"], ["Marie L.", "We love this restaurant; it never fails us. The service is always great and the food is not only delicious but consistent. They have the best Ginger Mojitos and best of all, they serve real food in until midnight on the weekend. We like the Caprese and the Poke Salad. The salmon (both types) is wonderful and the scallops are awesome. It does get really busy during peak dinner hours but they serve pretty quickly and move people out as long as they aren't campers. Although they turn over tables quickly, you never feel rushed.This is one of our favorite restaurants. Oh yeah, the patio is ultra dog friendly."], ["Linda B.", "This is our 2nd try here, just in case they having a bad day or something... The food just isn't that great here. Honey got  huevos rancheros and I ordered smoked salmon Benedict. The best thing I can say about my dish was that the poached egg was good. The sauce was very dense and thick, the English muffin was hard in spots, but didn't absorb the egg or the sauce. The salmon was very scarce, but that was ok since it was so fishy tasting. I order fruit as a side, instead of potatoes or grits. The service is still not great either. We saw the server to order, then waited more than 30 minutes for our food to be delivered, then she showed up afterwards to refill the drinks. There was no lack of staff. I do have to say the place was much cleaner and less dusty than the last time we were here. We were there at 3pm and the place was almost empty. I'm pretty sure we won't be back for visit #3."], ["Lab L.", "In town for a professional conference and a local recommended checking out the options in the Avondale section. The Brick was highly recommended. Great service. Great food. Highly recommend the crab cake appetizer (including a surprisingly delicious slaw), calamari, and the special flatbread with mushrooms and caramelized onions. My friends had a steak and the salmon salad. Both were very pleased with their entrees, too."], ["Lora H.", "We were in the mood for some late morning breakfast and had remembered a friend of ours who said that this restaurant had a great brunch service.  So off we went.  We were greeted with smiles that morning, and perused the menu to see what they had that was something unique that we probably could not have found elsewhere.  Needless to say we were not disappointed.  This place has a great brunch menu and I had to narrow my choices down to one of the Benedict offerings that they had.  (My plan is to go back and try the other one that was on my eenie-meenie-minee-mo list).  I ended up going with the smoked salmon Benedict and I was not disappointed.  The eggs were done perfectly, even to the point that I could have, if I had wanted to, rolled the yolk out of the egg on to my plate.  That may sound strange, but to me that is exactly how the egg was supposed to be cooked.  I licked my plate clean and wish I had another piece of bread to clean the plate even more.  It was a perfect helping and a perfect choice."], ["Morgan H.", "I personally think The Brick is great (however a tad bit overpriced). We stopped by here for brunch opting to sit outside since it was so pretty out. I selected the Biscuits & Gravy and it was delicious and a huge serving. I had no trouble finishing it all though :) I also had a mimosa (and bought one for a friend)....bill total $16 (for a breakfast dish that consists of 2 biscuits with gravy and 2 mimosas I think that's a little much). I will be back however b/c the service is good. And they have an awesome turkey sandwich on their menu."], ["Janna T.", "Awesome menu packed with unusual items like Kale salad with maple glazed Salmon, Baseball cut Hawaiian Sirloin and Prime rib poblano pepper quesadillas. Good happy hour pricing and Wednesday is ladies nite all nite long."], ["Elizabeth M.", "I gotta say that I wasn't wildly impressed with this place. The food was good, and pretty but nothing I would rave about. Our party got a few things so we could share and try out the variety but nothing really stood out. We got some calamari that was extremely chewy, so chewy that I felt like I was pulling a fruit chew away from my mouth. It was also fried a bit to long that it was very dark. When we mentioned it to the server he just said that its always like that, needless to say we sent it back and got the baked Brie. The Brie was pretty good. Came with fresh fruit and bread but again, nothing to rave about. We all had coffee and seriously we could not  figure out for the life of us why our server would not fill up our cups. He would fill it 2 thirds of the way and it got a bit on our nerves but we didn't complain because maybe its policy or some thing. The one thing that really did stand out were the grits. They were really good. Perfect flavor and consistency. The French toast was also pretty good but again nothing memorable or amazing. The variety of eggs Benedict was good and the food was good but I don't know, something just didn't rub me the right way about the service. Maybe I'll go back and give them a try again."], ["Jean L.", "Great place for breakfast.  This was my first time here and I plan on returning."], ["Chris G.", "Excellent service. Caesar salad was good, grilled mahi sandwich was very good."], ["John M.", "My margarita, lobster spring rolls, scallops, asparagus, wine, and bread pudding were great!  I even enjoyed the water.I, however, disliked the service that I received at Brick.  After arriving, I waited 20 minutes before a waiter came to my table.  It was annoying to watch half a dozen waiters walk past my table with no word of when someone might help me.  This needs to be fixed because good service is the reason why I do not mind spending a little more for a nice meal.  You can have good food, but it doesn't mean anything if you mistreat your patrons."], ["Justin N.", "Delicious food, amazing staff, and a great setting/environment. I will return. Has brunch consisting of juevos rancheros and home fries. Also had the Champaign mojito."], ["Morgan F.", "We have really enjoyed every experience we've had here. We have never had to wait too long for a table, and the service is efficient. We have tried multiple items on the menu and enjoyed them all. In the evenings some nights there is live music, which is nice. You can sit inside or outside. I would recommend this restaurant!"], ["Peter Y.", "A last minute decision to try this cool place turned out to be a winner. The service was exceptional but the ginger seared sea scallops were simply over the top good. We had a large party of guests and we spent much of our time with the, \"Oh you have to try this\"! Talk. Personally I really liked the quintet band they had. So much nicer than just another guitar band. Well done in every aspect."], ["Katy S.", "Hey brunch, hey!I'm a brunch freak and was happy to get a chance to sample the Brick during brunch time.  I love the set up of this restaurant with the beautiful brick wall.  Located in the heart of Avondale, this place is a visual delight.Based on Yelp photos I ordered the French Onion Soup which was absolutely perfect.  So cheesy and delicious on a cool Saturday.  I also hit up the Caesar Salad (also yummy) and washed it down with a Peach Bellini.Everyone at the table liked their meal.  My spouse got the Beef Carpaccio and really enjoyed it.  The dinner menu looked a bit expensive, but would be a great date night spot.  Very good experience!"], ["Jeff A.", "Brick continues to be one of my favorite restaurants in the area. I have been coming here for over 3 years and it is consistently fantastic. I love sitting outside on the patio in the evening. They never rush you so you can take your time and enjoy your meal and your drinks. It is a very casual but upscale environment. Our server Allison was great, we had such a good time there last night!"], ["Andrea J.", "I've always heard many great things about Brick - a hidden gem in Avondale. As a first time diner, I can definitely say that I was pleased. The restaurant itself is tucked away in cozy landscape accented with decorative lights and ambiance to match. If you know anything about the Riverside/Avondale area, you're aware that each store, shop, or restaurant has its own individual, yet unique, style. All of the menus differ in the area, offing items that cater to any palate. Brick's menu offers a variety of selections ranging from seafood to steak and chicken. I know that I am usually the hardest one to please in a crowd when it comes to restaurant choices, but when I looked at the menu at Brick, I was able to pick out multiple options that I knew I wanted to try. I started with the shrimp and grits appetizer which DID NOT disappoint. The grits were perfectly creamy, and the 5 jumbo shrimp were succulent. As our attentive server explained the appetizer portion, she described it as being enough for two people (it was) and mentioned that it had bacon and butter drizzle on top. The bacon was requested to be on the side, however when the bill arrived, there was a $2 charge for bacon. No big deal in the end, but it was something that sounded as if it were the slandered when ordering the appetizer, not as something added on. For the entree I ordered the maple glazed salmon with a jumbo baked potato - highly recommended!! The salmon was smoked, sweet but not too sweet, and was all-around delicious. My only thought was that the plate could use a little more garnish or greenery. The garnish provided on the plate was a tomato slice. I'm not a fan of tomatoes so I skipped on it, but if the taste of the rest of the meal was any indication of the tomato was, I'm sure it was amazing. The restaurant also offers live music. I'm not sure when this takes place. I dined on a Sunday evening and nobody was there performing. I'd love an opportunity to return and have the full \"Brick Experience\". As far as service goes, all of the waitstaff was highly attentive. Beverages were refreshed without having to chase someone down, food arrived in a timely manner, and management was on the floor conversing with guests as they entered and exited. This is certainly a restaurant that has won over a new loyal guest."], ["Cari B.", "The Brink is one of my go to restaurants for a casual dinner lunch or brunch . The staff is always friendly and knowledgeable bout the menu . All in all the food is really good . My last visit I was in the area for brunch and at the last minute had to change up where we had planned to eat and ended up at the Brick . I've had dinner/lunch several times and always been pleases with the experience but this was my first time here for brunch . Like all my other visits I was disappointed . I'm a french toast junky so I had to try that also ordered a side of bacon and cheese grits that wasn't listed on the menu but they gladly made for me . The french toast was delicious thick slices of Texas toast like bread with a side marinated strawberries and syrup . Simple yet amazing . The bacon was the perfect thickness and nice and crisp . The cheese grits fabulous , I want to say were the highlight of the meal but I don't want to down play anything else . Also had a strawberry Bellini which was to die for . After the meal I was quite honestly glad my other plans had fallen through and I got a chance to sample the brunch here . It's nice to have a neighborhood restaurant that's not just a one treat pony ."], ["James H.", "Ehh it's okay. Nothing special. Drinks took way too long and the food was not as listed. Crab cake didn't come with onion as told and the server forgot the sides. Home fries a bit cold. The poached eggs were way over cooked (they should be runny in the center). A lot of potential. Just needs better execution and attention to the basics."], ["Erica J.", "I have been going to this restaurant for year. The food is consistently good. Here are a few of my favorites:1. Crab cakes- one of the best in Jax-lump crab meat with fresh sake and a great aoli sauce2. Shrimp and grits- I prefer mine blackened and served with shredded cheese and bacon. It is served in crispy tortilla shell.3. Prime rib and roasted pablano quesadilla- amazing flavor4. Prime rib- for dinner this is a wonderful option."], ["Matt B.", "I've eaten here many times over the years and the food is very good.The French onion soup may be the best I've ever had. It's that good. I also enjoy there wedge salad with blue cheese. It's been a staple on the menu for as long as I can remember. The service can be a little slow at times but for the most part they are pretty good."], ["Ryan H.", "Decent place to eat and drink or for a date. Great decor and very clean spot in avondale. The food was alright too nothing to complain about and the service was great. I would come back here, but i bounce back and forth between 3 and 4 stars. Need to try more food to give a better review."], ["Daisy D.", "I had been hearing about the Shrimp & Grits at The Brick for some time now, so when I finally had a chance to make it over to Avondale for bite to eat, I knew an order of S&G would be given. As we met our dining partners and placed our drink orders, we ordered two orders of the Shrimp & Grits appetizer. I was told it would be necessary for each couple to have their own. And boy were they correct! The shrimp were plump, the grits were creamy, and the tortilla bowl served as a nice scoop when we broke it up. I could easily order this for a meal and go home a happy camper. Meal was off to a good start so far. For my entree, I had the cuban sandwich with sweet potato fries. The fries were delicious and some of the better ones I've had. The sandwich was good, but I was only able to eat half as I wasn't as hungry as I originally thought. Our server - who's name fails me - was great and played along very well with our usual shenanigans. We find ourselves in the Riverside/Avondale area more & more these days, so we'll definitely have to keep The Brick in our regular rotation."], ["Fred B.", "We really enjoyed The Brick.As opposed to some other reviewers, we were unimpressed with the dining room.  The openness and brick interior were ok, but the blonde wood and cheap Formica tables are only 1 notch above Applebees.  The high backed booths were nice, though, because they cut down the noise in a fairly loud room and enabled us to have a very nice conversation during dinner.Service was friendly and attentive.Nice outdoor seating with fans and cooling misters.So... you ask... then why did you give The Brick 4 stars then?!?Well, THE FOOD is damn good. We had a prime rib quesadilla with poblano peppers and queso that was so good I'll crave it.And Shrimp and Grits that, while not the very best I've ever had, was really really good... good enough to order again and again. And the homemade bread pudding was very tasty.For once, kitchen's talent is far better than the attractiveness of the dining room build out.  If I have to choose, I'll take great food and a slightly lame dining room over lame food in a gorgeous dining room.Well deserving of 4*'s...  We'll be back, soon."], ["Jay M.", "From an architectural and atmosphere viewpoint, The Brick does a great job injecting modern sophistication into the heritage of this storied neighborhood.The feeling is upscale and warm here, with the edifice's trademark bricks playing against golden woods inside, and the lively sidewalk dining scene along St. Johns Avenue (thanks in large part to this epic haven for dog watching). The colorful bar and live entertainment (Thursday through Saturday nights) solidly bridge the two. It's a neighborhood kind of place where you're bound to run into people you know and like.Simply put, the Brick feels like quality. But does the quality of the food keep pace?The lunch and dinner menus are merged onto a single sheet, where you'll find starters, salads, sandwiches/burgers, more complex entrees, sides and desserts. A dedicated gluten-free menu, a subset of the main menu, is available on request. On the flip side are your wines by the glass (21 at last count), by the bottle and draft and bottled beers (largely devoid of real crafts, but Bold City makes the cut).We began last night's dinner with the Wine Plate ($14), a collection of meats, cheeses, olives (pitted ... thank you!), red grapes and crostini thins that was suitable for picking. The Havarti Dill and Smoked Gouda selections were mild and blended well but, as you might expect from these choices, didn't go the extra mile in the flavor department.My Veggie Burger ($10) was an oversized multigrain patty brimming with standard-issue garnish veggies and a side of chilled couscous salad. Even sliced in two, it was a challenge to tame this beastly faux-burger, but it was a satisfying achievement with the melted provolone the most enjoyable part of this plate. My wife's Kale Salad with Maple Glazed Salmon ($15) was ample, unassuming and ... well ... very green, with what I perceived to be a relatively small plank of glazed salmon anchoring the middle of the plate.My wife's aunt and uncle shared a Rack of Lamb ($28) with side of asparagus. Even split in two, the portion sizes were quite adequate, with no complaints reported regarding flavor or tenderness, just a confident \"very good.\"Beyond last night's visit, my main beef (pardon the pun) with the Brick is that the menu comes across as largely non-offensive, chock-full of standards but nothing that seems willing to stick its neck out for flavor or even name recognition (cue Metro Diner's \"Yo Halla on the Square\"). Flavors are polite, courteous and for the most part homogeneous. To some this might be A-OK comfort food -- you know what to expect and you have a favorite or two. I think there's a better way.On food quality alone, the Brick is in solid 3-star territory. By and large, you get a fair amount of food for your dollar, and the standards are competent and done well. Its intangibles, including atmosphere and sheer location in the heart of the Shoppes of Avondale, earn it an extra star in my playbook."], ["Jack B.", "I am kind of shocked by some of these poor reviews in 2015. The Brick has been an institution in Avondale since 2003. They do have a lot of the same items on the menu since then, but they change and add a few things too. I live a couple of blocks from The Brick and we have seen a lot of good people, managers and staff, come and go from The Brick, over the last 11 years. We have found the food to be consistently good. Its not like eating at Matthew's, but then again, you are not paying for Matthew's either. Try and order off the menu. Want a Bacon, Salmon sandwich, ask for it. Want a burger on a salad, ask for it. The nice thing about the Brick is that they are always willing to do whatever it takes to make your experience a great one. By the looks of the place on a nightly basis, the neighborhood loves them and enjoys the food, music and the community feeling. Every year, they have community events that help raise money for charities, there on Ingleside. It is nice to see a local restaurant that gives back to the community as well."], ["Anthony N.", "After attending the Riverside Art Market I was looking for somewhere to eat with a brunch menu. This idea landed me at Brick (Yelp app). I am big on brunch,well let's say I am big on breakfast. It is a suitable meal throughout the day. So when I get a chance, darn gone it, I take it. The restaurant is very spacious, tall ceilings. Restaurant has plenty of seating inside and out. They have artwork sprawled along the walls. We were seated in the booth in the back. They hand you their regular menu and the brunch menu. Their Saturday Brunch menu is from 10:30am to 3:00pm. After overlooking the menu I decided to pick the Country Omelet. They have more intricate and desirable things on their menu. But, you can judge a good restaurant on how they make eggs. The omelet was very fulfilling. They didn't skimp on the filling of ham, bacon, sausage, and cheese. Along with the omelet I ordered home fries as the side. It was either that or their grits. As you can see for $11 they give a good amount of food. I definitely didn't complain. The omelet along with the home fries were very good. Lots of flavor, a good ratio of filling to egg. Definitely something I would get again, no doubt about it. I definitely want to try more of their brunch menu. The only reason why I didn't give more stars is b/c of the service. (The food was definitely 4 stars). The lady I had bless her heart was really nice and informative of the menu. But once we put in the kids order (which was first), she didn't return until the kids food came out. Which took a little bit over 10 minutes. It's like she put in the order and waited in the kitchen for them to cook the whole meal. She did come and check on us periodically which helped her cause a little bit. I never let the service ruin any good time I may have. It's all about the food for me. It wasn't bad service, just something that could have been done a lot better. Also upon leaving the restaurant I noticed our server was also handling tables outside. To me that was part of the problem. Handling tables outside and tables in the back of the restaurant, to me, isn't the smartest idea. Don't let my story detour you. The restaurant was busy and who knows, they could have been short staffed. There is great eats to be had at The Brick. Sir Anthony will be back!"], ["Rob K.", "Came in the Sunday after the FL/GA game with a huge party (12) and appetite. Service for our large group was great, waters never stayed empty long and the wait for food was reasonable.I got spinach feta Benedict with cheese grits and a memosa muffin. The muffin was huge and did indeed have a mimosa flavor (and the honey butter was an awesome addition). The rest was good, and the rest of the party seemed to enjoy their food too.Worth visiting."], ["Lori A.", "I had a blast at the Brick. The food was spectacular. I had the tenderloin carpaccio, tuna tartare & poke salad. Everything was to die for."], ["Khaleesi T.", "I've attended the restaurant on a Saturday, there was a live band and a lovely atmosphere. We've only had to wait for about 15 minutes and they've these cute little booths.  The water (tap) is horrible!, I've got to say that I normally don't drink tap water and I remembered why! Not to worry I just ordered a lovely bottle of sparkling water. I've ordered the caramelised brie & bread! and it was amazing! so yummie. For my main I've ordered the Kale salad with Maple Glazed Salmon. I totally forgot to take a picture as I just dig in the food.The band was lovely and the food was good. I will definitely be back."], ["Whitney A.", "I came here for lunch with co-workers last week and the food was amazing. I ordered the warm turkey sandwich. The sandwich didn't look like much since it was only turkey, canalized onions and cheese but let me tell you it was so good. The onions gave it a sweet flavor which made it easy to hide the fact there was no condiments on it. I like my sandwiches to have condiments but in this case it was perfect without them. My co-workers mostly got the burger and salads. The burgers were huge and looked delicious. The salads were of big portions and they too looked really good. I can't wait to try the burger the next time I come back."], ["Katrice S.", "A friend came in town last weekend to celebrate her 30th birthday and  I was put in charge of the weekend festivities so Friday night I decided we'd go to Brick Restaurant to kick off her birthday celebration!   I love Brick because on the weekends there is always live music and the atmosphere is perfect for when you're meeting up with friends!  This band was awesome!  We even got them to play a jazzy rendition of the \"Happy Birthday\" song for my friend.  For starters we got the caesar salad which was amazing! Brick makes their dressing in house which is always a plus! Another friend ordered the calamari.  It was seasoned just right and lightly fried.  The calamari itself had good texture. Three of the four of us ordered one of my all time favs from Brick, the shrimp and grits!!!  The grits are soooo creamy and I love the fried tortilla shell it comes in and of course the shrimp are succulent!  The sweet potato fries on the side were amazing too! We also ordered the crabcakes with fries.  Brick probably has some of the best crab cakes in town!  They are FULL of CRAB!  Not a bunch of breaded filling.  I love that!  They were pretty tasty too!  Overall,  Brick was a great choice to start off the weekend with friends!"], ["Eddie Z.", "This place is beyond awesome they are very accommodating the food is top notch the price is unbelievably low and the staff is awesome if you coming to Jacksonville you definitely have to come over here"], ["Latisha C.", "This a great place for date night or GNO. There's a good wine selection and a full bar. The food is delicious with great plate presentation.  It's also good for large parties."], ["Allie A.", "The Brick is SOLID. Always. It makes for an easy choice if deciding where to eat is particularly hard that day. I've taken large groups for here for dinner, worked from the patio during weekdays, and taken the boyfriend and the mom for the Saturday and Sunday brunch. Since we just adopted a pup, we opted to head to The Brick for Sunday brunch yesterday. Plenty of tables available for outside seating, with nice fans to put a little damper on the Florida heat. Our server was awesome; she brought out a water bowl just for our furry baby. Love it.  The pup was quite a hit... everyone wanted to come and say hello to her... and being the 5 month year old loving pup she is, she wanted to say hello to everyone right back! :) No one minded that she wanted to jump up and kiss everyone... which was a relief since she is still learning her manners.The Habenero Bloody Mary is a must if you are a fan of a drink that bites back.  Well, not too much bite, maybe just a little love bite. It has a nice kick with the pepper vodka, nice size olive, pepperoncini and stalk of celery. Yes, please!  Even the boyfriend, who is not a fan of spicy or the Bloody Mary, enjoyed a nice long sip. We ALWAYS start with their shrimp and grits. And we just learned on the last visit you could customize them up a bit (with cheese, bacon and blackened shrimp.) Not that they need it though... and I'll go ahead and say it, they are, without a doubt, my favorite shrimp and grits in town. You would think that they are loaded with cheese, but they are not, they are just that creamy and full of flavor. There are never any left on the plate.  We did opt for the extras this past visit, but you can't go wrong either way. For brunch, the array of benedicts usually reel me in. I've had the caprese and the spinach and goat cheese (both excellent.) This past Sunday, I tried the smoked salmon: Chilled smoked salmon, cream cheese, capers, diced red onion, and Hollandaise. The cream cheese chilled out the saltiness of the salmon... and the runny yoke drizzling down everything made for a perfect bite. Add some home fries to sop up the rest and sit back, cause you're gonna be stuffed. The boyfriend has been craving my margaritas for a week now, so he ordered the prickly pear... it was a bit salty, but I think that was just due to a bumpy walk to our table, and some of the salt rim got into the drink prematurely.  It was sweet, with a little tang... I will order one of these on one of my next visits. And if you are headed this way for dinner, I would recommend the seafood tower. Unbelievable presentation and taste to match."], ["Sayaka B.", "well, food was not that good even though presentation was great. it's hard to find the parking,... I might have to get back and try another dish for weekend brunch since my friend told me the egg Benedict was yummy."], ["Jane K.", "Service was so so  but the food and price was worth"], ["Amanda C.", "I went her for an early dinner/late lunch on mothers day. For one, the location is so cute!! I love the street it's on in avondale, there are so many shops and restaurants in addition to old historic houses. I also like that they have tables outside on the sidewalk, which gives it a European flair. We had reservations at 4:30 and were seated promptly. I got nervous and thought we might not have a good experience because no waiter ever came to the table and we had been sitting down for almost 10 minutes at this point. But then a super cute and fun girl noticed we were all looking around and asked us if we had been helped yet and if she could get us started. She ended up just taking our table even though we were not in her section and she was just lovely, very personable and sweet. We had some ahi tuna cracker appetizers and a crab cake, both of which were delicious! For my entree I ordered the Hawaiian sirloin which is marinated in teriyaki, soy, orange and ginger. It was cooked perfectly to my liking of medium rare and oh so juicy. The flavors were so prominent, it had to have been marinating for hours. Everyone else also really loved their food, which were other steaks, lamb and a bacon cheeseburger. The only down side really is that it took a while to get our food and they were not very busy. It was fine though, we were just talking and enjoying our family time together. After the meal she offered us coffee on the house which I gladly accepted. My mom got creme brulée for dessert (which I tasted) and it was really yummy too. If it were not for Kryshta our visit could have been bad with the way it started, but she took such good care of us! (my steak was realllly good too) I would definitely come back and bring friends from out of town. It is a little pricey in my opinion so not an any ol' day type of place, but a nice place to come."], ["Suz G.", "First impression was Wow, they are really pricey...the atmosphere does not match these prices...then I discovered the food didn't measure up, either. Aside from the linen napkins, everything else was downscale- bare bones decor, a 1-page plastic menu, loud room, and ugly restroom. The staff was average, and did not seem happy to be there. Now, as for the food - disappointed. Seemed like they were trying to pass off a Philly cheese steak as a French dip; it was brown/overcooked meat, not like sliced prime rib, and had provolone cheese.  My son's chicken with feta and artichokes wasn't bad, a little dry, but not bad.  I was underwhelmed by the shrimp & grits - thank goodness I got the starter portion (which was plenty) for $17 vs. entree for $30. (TIP: You want good shrimp & grits, go to Black Sheep in Riverside - Amaaazing!).To summarize: Way overpriced for this level of quality and service. If I return, it would be to try other items on the menu like the crab cake or seared tuna. But that's a big If."], ["Janice H.", "Didn't like the food, egg benedict didn't taste well, the waitress was so nervous!! Dissapointed... love better Sweet Pete's Brunch!"], ["Ariel D.", "We were a group of five dining at the Brick.For starter we had the carmelized Brie & bread which was creamy and tasty. For main course I had sesame crusted tuna and garden salad. Both were good but the Tuna was too soft and the sauce on it didn't add any special flavor to the dish. Another thing I would change is putting less sesame on the tuna, it was just too much covered with it. My partner had the roasted salmon which was way too dry and that's bad for a salmon fish ( or any other fish) the asparagus was great and perfectly made, so does the artichokes.Service was very good and professional. I would expect the bar tender to make sure that Next time there is no lipstick marks of the wine glass :-/"], ["Marty C.", "My rack of lamb was to die for..  The Kobe burger was supposed to be med rare and it was brought out well. We had to send it back. I finished my meal and the burger still has not showed up. The girl asked if we wanted it to go. No we want to eat it here or we would have ordered our food togo"], ["Amber A.", "Cozy booths, casual bar area, and fun outdoor seating fitting any mood   Quality food appealing to all.  Hearty appetizers: my faves are the stacked tomatoes and mozzarella dish topped with a tasty sauce and the plate with 3 types of hummus.   Delicious casual comfort food options like the best warm turkey sandwich with cous cous or fries.   If you want something more formal try the scallop dinner or Asian baby back ribs.   This place is an Avondale neighborhood staple.  Best to go during the weeknight early dinner on the weekend."], ["Mark R.", "Always a disappointment.  It's one of those places you reallllly want to be great; the atmosphere, location, and ambiance are great, but the food......Mediocre - at best; several years running.  Fix it already!!!"], ["Adrian M.", "Wait time. Not enough to order a drink at the bar. Plus.Service. Our waiter was good but not great. Had to wait a few times for drinksFood. Prime rib was on point kale salad interesting.Would be back. Nice scene in a cool area."], ["Wolf D.", "This is another favorite of mine in Avondale.  It's a classy place, and the prices reflect that.  They pour one of the better whiskey sours that I've drunk in Jax so far.  I have never gotten anything but the french dip sandwich and the calamari, but people I have taken with have gotten steaks, burgers, and salads and were very pleased with them.  Back to the french dip, it is loaded with meat and served with piping hot au jus.  The calamari is lightly breaded and fried, but isn't served with marinara, it comes with a house made \"rose sauce.\"  Not sure what's in it, but it has a zing to it marinara doesn't and I am now a convert.  They have really nice outdoor seating and you can bring your dog.  And in the winter they have large gas heaters so you can sit outside year round, which is good for smokers.  (not me, I quit in 2009) I would definitely recommend this place as good date restaurant.  Oh and try the flourless gluten free chocolate decadence cake.  They also have New York style cheese cake.  Go, try it!"], ["Leah A.", "We went here again on Sunday with my boyfriend & another one of our friends.  The whole atmosphere here is always super relaxing & inviting. Food-wise, I love their fish tacos because they are delicious, but decided to order the MEDITERRANEAN SALAD this time.  The salad itself was perfectly dressed, big enough to share & I was very please with the flavors and the amount of fish served with my salad.  I highly recommend this one!  The boys both ordered sandwiches--I had a bite of the veggie burger which was a little too \"beany\" for me--I've definitely had better.   And I didn't have a bite of our friend's FRENCH DIP AU JUS, but his looked very good.  I just wasn't in the mood for red meat.  On a previous visit, I had half of my boyfriend's WARM TURKEY SANDWICH (caramelized onions, Swiss cheese on ciabatta bread and chef's dressing ($10).  If you are in the mood for something comforting, that sandwich is perfect.  It is super flavorful & I will probably order that one next time I visit.  I want to give props to JESSE, our waiter.  We are sometimes not an easy group (two of us from LA & one from NYC), but Jesse's service was on point!  Very attentive, but not overkill & he certainly had a great attitude.  He made our outside patio dining experience a true pleasure.  I really enjoy patronizing The Brick; however there is always room for improvement.  If they could:  1) really take their desserts up a notch (more creativity or just go ahead & bring cupcakes in from Sivada's because it would save me a trip).  I mean I shouldn't feel like I want to walk over to Biscotti's and order dessert there  AND 2) offer fresh peach nectar or puree for my friend's Bellinis instead of using canned peach particles and peach schnapps.  Although Jesse served a juice the bartender sent out to compensate, I have to agree that using peach schnapps in Bellinis is pretty lame.  Check the cocktails served at The Hungry Cat (sunset & vine, hollywood, ca).  Their unique cocktails are made fresh with hand-pressed juice.  And it could be so simple since we have all the fresh citrus here in FL & peaches up in GA.  I know I was all over the place with this review, but overall the Brick's food is consistently very good & I always leave feeling very satisfied."], ["Anna J.", "It's not hard to get a good meal at The Brick. There are tons of great things about this restaurant. It's a great atmosphere no matter where you sit (outside, at the bar, or in the dining room). The service is always top notch and there is a variety of food options. This place is a little pricy, but I think the ingredients and presentation of the food allow for that. I have to say, my favorite thing to get at the Brick is the brunch. It is a Benedict lover's dream. The smoked salmon Benedict is just about everything I love in one breakfast item. They use high quality salmon, and the cream cheese/hollandaise is not overwhelming. Another great option - the caprese Benedict. It is topped with hand-made pesto hollandaise! The other great brunch option is the baked eggs. Order spicy habanero bloody Mary with brunch (it's a little overpriced though). For lunch or dinner, I would recommend one of their salads. The salmon and kale salad is amazing and a great healthy alternative - the way they cook their kale makes it so flavorful. The seared ahi tuna salad or the grilled chicken salad are also great alternatives."], ["Samantha K.", "After living in riverside for over a year, I finally got a chance to check out the brick. My partner and I had dinner there on a Saturday night, and did have to wait 40 minutes for a table, but they do provide a pager and we were able to go to mojos down the block for a drink. Actually, it wasn't too bad that there was a wait--it just made our night feel a bit longer and we got to go to two places! Anyways.....Service was very good. Despite how busy they were we did not feel neglected. Our server was very polite and helpful. Food wise, the meal did not start well but it was made up for and we ended up still enjoying it very much. We ordered the calamari as an appetizer. When it came out it was very, very over cooked. The breading was extremely crispy but crumbled right off the calamari. The calamari itself was hard. Neither one of us could eat it and had to send it back. Luckily the server took it back promptly and we ordered the crab cake instead. That turned out to be a great choice and it was delicious. For our meals I ordered the Mediterranean salad with shrimp and it was delicious. My boyfriend ordered a steak. We both really enjoyed it. I also ordered a bottle of red wine which was a good choice (the goldeneye) from there extensive wine list. All in all I will definitely be back again!"], ["Terry M.", "Great service and great food. This place has never disappointed me and I travel for a living and therefore eat out a lot. It's nice to have a go-to place at home. From the food to the drinks, the hostess to the server, it's obvious everyone here understands how to treat customers."], ["Stephanie J.", "This venue was perfect for late night dining. I visited for my birthday this year and my favorite dish are the lobster spring rolls. Absolutely delightful. The lighting is a bit poor which makes it hard to see, but the taste of the drinks make up for my loss of sight. lol"], ["Lara F.", "Cant seem to get anything right with me. We can walk to this restaurant but rarely go unless we are meeting people there for a glass of wine. Id like to say the service is good but they cant seem to get it right!I always order the same food and due to my allergies I know what ingredient to leave out. Its a salad so its no big deal. Do not put the artichoke on my salad and no dressing..nothing..dry..no oil..nothing. Cant seem to get it right. Had a large party that we hosted here and after long talks, our own limited menu creation and meeting with management,  at the party I was served something im allergic to. My husband would have hit the roof so I played it off, quietly medicated myself and drank wine for dinner. They are priced right for this area and I love the atmosphere. ..if only they could get one salad right."], ["Rich L.", "I have been here several times since we love around the corner. And everytime I leave I am just meh. Nothing terrible, but nothing spectacular either. Will I go again, probably, but I never just \"crave\" this place."], ["Richard D.", "It's hard not to like the area. Really good service with a lot of smiles. French dip keeps me coming back. The blackened Mahi is excellent as well."], ["E H.", "I was really impressed with their brunch. The eggs Benedict was perfectly prepared, and the strawberry mimosa complemented it well. Our waiter was friendly and didn't rush us. Good atmosphere for catching up with a group of friends."], ["Marlon M.", "Ambience is always great, but food is going down hill, unsure if theres a new chef or new mgnt, we wont be coming back anytime soon sorry to say food was  bland and cold , slow service just last Sunday had to send my breakfast back mines the  Benedict and my wife the Rancheros,  manager didn't even bother to come and check our table.The Fox across the road much better breakfast choice? Get you act together"], ["Judie N.", "Loved it from beginning to end! Our waiter Jerimiah was on point throughout the meal! We started with a bottle of wine and the carpaccio! Delicious! To die for! I am not a wine expert but I love wine and we had a nice bottle reasonably priced. On to our meal. I had the rack of lamb. Cooked to perfection. My daughter had the crab cakes which were CRAB! No fillers! They also were very accommodating to my 1 year old grandson's needs. Jeremiah brought him crackers and smiley face fries.  Dipped in ranch(of course). I do wish I invented ranch dressing! Oh I can't forget the kale salad!! So delicious and fresh with a very light lemon vinegarette dressing. We finished with the goat cheese cheese cake. Unique and oh so good. I visit my daughter in Jacksonville from time to time. The Brick is a must while I am here. I look forward to my next visit!  Do I recommend The Brick? Absolutely! Don't miss it! Yummmmmm!!!"], ["Rodney M.", "I had the Kobe burger which wasn't up to par for Kobe price along with fries. It tasted like Angus or Chuckbut not Kobe. I ordered medium well & got medium rare & the food temp was not hot enough. My companion had the sea scallops with jazmine rice & sweet potato fries & her meal was excellent. The service was very good along with the atmosphere. A live jazz band played which was very nice & added positively to the dining experience. I think the drinks are over priced but fairly typical for this type establishment. Overall it was nice."], ["Matt J.", "Good food.Decent service.Go here for brunch.done son!"]]}