{"Fuji Sushi": [], "Sushi Factory": [], "Fujiyama Japanese Steak & Sushi Restaurant": [["Maryagnes J.", "Fujiyama was an excellent choice.  The restaurant was clean, service expedient.  My husband had the steak & shrimp hibachi, I had the vegetable tempura bento box...both were excellent.  Both accompanied with delicious Miso Soup and a crisp salad with ginger dressing.  Sorry I did not have my camera to take pictures."], ["Tamika H.", "We came here for the first time last weekend, not our pick. I feel like once you've been to one Japanese-styled hibachi grill restaurant you've been to them all. Same food selections, same taste, same corny chef jokes and same ridiculous prices.We went here for lunch and got hibachi for 3 & spent $75.00. Granted that included gratuity & if it was for dinner that would have been one thing but for just lunch? That's also considering that my husband and I only ordered chicken and my daughter ordered shrimp. I will say that their service was good, they kept our drinks full and their establishment was well-maintained. Other than that, there's nothing spectacular about it but if you like or are looking for a hibachi grill on the Northside of Jax this place will deliver to your expectations."], ["Nyla S.", "I'm giving them 5 stars for their customer service alone! Our drinks never got too low, everything we requested came out promptly and our food was hot and flavorful.We had a ten minute wait and the restaurant was packed when we got there. Seriously, every seat was occupied and for the first time I didn't mind. Our waitress and waiter were amazing, yes we had two of them, maybe three or four. Every employee was concerned about our dining experience and I can appreciate that.Their dynamite roll was AMAZING! One of the best sushi rolls I've tasted in Jacksonville. My auntie and I both agreed on that. Their fried rice was also great, seriously I could eat it alone. It was bursting with flavor but had no meat, I was definitely surprised.The shrimp, chicken, filet mignon and scallops were all cooked to perfection.The bottom line is that this place is definitely packed for a reason. Their food was hot and flavorful, their customer service is amazing and the dining experience with our family was very memorable. The ONLY con would be that drum they bang for birthdays, after the second birthday I was over it! Seriously, there were like ten birthdays during the time we were there. Ugh!We will definitely be returning.Happy Yelping..."], ["Dorothy C.", "Airport roll is a must!!!   Great sushi, good service!!!  Will keep coming back!!Best sushi in Northside of Jacksonville."], ["Ataya P.", "On vacation, we went here on a recommendation of a friend, since Koja Sushi is now closed down. (I'm devastated by that, by the way.)  We only ordered sushi rolls, no hibachi that night.  I have no complaints about the sushi, it was good.  Seemed fresh.  The drink specials were a great addition to the night! The service was ok. But our waitress seemed a little confused or maybe annoyed? I suppose it was the end of the night... maybe she was ready to go home?Not saying this was a bad place at all or even a bad visit. Just saying it didn't leave an impression on me that would make me want to eat here the next time I come back down to visit. Try it for yourself... you never know, maybe you'll like it!"], ["Catherine C.", "Really disappointing. My boyfriend and I ordered six rolls. When they came the rolls were so small. Maybe as big around as around as a finger. The amount of meat in the sushi was slim. We ordered a soft shell crab roll and a dancing eel and to be honest most rolls contained none of the meat. Just cucumber. 40 dollars spent and we weren't even slightly full. It wasn't even that full. The portions were really poor. Not satisfying."], ["Rebecca V.", "We ordered the katsu chicken and the hibachi steak lunches. The fried rice is bland. The steak had a good taste to it, but not much...the plate was large but filled with some kind of fries....I think zucchini.  They were really good. The chicken was pretty typical. ..nothing special.  The soup was pretty good. The salad was good too. Service was great. The best thing about the meal. The restaurant was clean and a nice environment."], ["Debra B.", "We had sushi (not the teppan table). The Godzilla is fantastic! The American Dream was good - but not as good as the Godzilla. I would avoid The Green Hornet, as it was a bit mushy."], ["Kate W.", "I come here once a month by myself since I work nearby. Service is always great. I love their bento box..what a steal for $7.99. Rice, gyoza, sushi, vegtables, teriyaki chicken plus ginger salad and soup! They even always provide a side of shrimp sauce. My only complaint is that I wish they had a rewards program or coupons that I could actually use."], ["Michelle C.", "Waited to be seated and then when we were the hostess would not allow us to sit where we requested. Then we waited some more and some more and some more, finally we left."], ["Nancy S.", "The food was expertly prepared. Divine. Absolutely amazing. Loved the service, the food, and the personnel. Will be back."], ["Russ K.", "The food wasn't tasty at all. I ordered salmon hibachi and it was over cooked. It came with vegetables and they were bitter tasting. It was entertaining however. That's the reason I gave them two stars. Other than that I would have given them one star."], ["Allie A.", "We ventured to Fujiyama last Friday to start the weekend and for a friends bday dinner. It's located in the Rivercity shopping center, by the airport, which seems to be just blowing up as far as eating and shopping are concerned. We started with a sushi roll while we were waiting for the entire party to arrive. It was a crab, cream cheese tempura creation, the name escapes me, but I can say it was pretty good. Soon we were one to ordering our hibachi entrees... and the signature soup and salads starting making their way to our party. Clear soup was ok... salad was not anything special... even with the ginger dressing. Our server was a bit forgetful and un-attentive, and Mr. Yelp decided to clear his own plate by setting it on a shelf behind us. LOL. So the hibachi chef came out.... he was absolutely hilarious. We were all in good spirits and he laughed and played along with all of our jokes... and did the normal hibachi presentations. (Volcano, shrimp toss etc.) I ordered the shrimp, and they were a tad overcooked. But the veggies and rice were pretty good. There was a bottle of sake ordered at the table, and I did love there was a cucumber slice in the sake glasses... it was a nice mellow addition and I am definitely jumping on the cucumber cocktail bandwagon. Other than that, this place wasn't really anything super special. The staff did come around to sing happy birthday and the birthday boy got a free dessert."], ["Janice H.", "We loved it! had an amazing time, fun and the food tasted great!! Good portions!!! It is not cheap but for the price is worth it!!"], ["Diana M.", "I have been meaning to stop in here for a long time.  I finally got my change with a lunch group and I was pretty happy.  Their hibachi was top notch and their shrimp sauce was excellent.  My one complaint would be the ginger dressing...it was just missing something..."], ["Amanda N.", "I've been here a few times and it's usually pretty good. Wish they had happy hrs. Nothing. Last night was a bit odd. Seriously checked on every 5 min by everyone. Very overwhelming. Give me a min to decide. We each ordered a salad. I ordered the spicy salmon and enjoyed it. Great taste and texture. She ordered the spicy seaweed. First off the waitress out in the wrong salad knowing this she brought it over anyway and tried to pawn that off on her instead of what she ordered. Still wanted her to pay for it too. She chose to stick w what she ordered. Which she didn't like. Looked like intestines. Most times spicy seaweed just has peppers etc added to it but this was covered in red sauce. The sushi rolls were pretty tasty except one had cucumber overload. Hoping next time I go back the experience is better."], ["Nat G.", "Amazing sushi! We are from out of town and had some extra time before heading to the airport! Found this place and I highly recommend it!! The sushi is outstanding! So fresh and great taste! The sushi chefs were so nice and the service was fast!! Great find highly recommend it!!!!!"], ["Jim B.", "Very good sushi and Japanese hibachi grilled shrimp, chicken and beef. A good easy stop for those traveling up or down 95."], ["Mark B.", "Happy Birthday Jimmy. I really think you had a good time. I hope your food was better then mine. First the place was slow with the service but we did have a chance to talk and get to know each other. So no foul there. I personally thought it was weird that they would bring out one app and later ask if someone else wanted anything. The chef was pretty funny but you can tell that these places are almost all the same. Food: the fried rice was pretty good once I added some flavor to it with the crab sauce and garlic sauce. The tuna was so over cooked almost tough. the shrimp that he added was charcoaled. The scallops that my wife got were cooked nicely but did lack the char or PC caramelized for texture I guess. I did really like the vegetables.  I will say that the best thing of the evening was the company. Tess you did a good job so jimmy keep her and keep her happy. She might weld you into something. Jo El it was nice to meet you two but we were on opposite ends of the grill. Allie, you an Adam were a joy again. So I liked the people around the meal but not the meal around the people. Sorry, now Black Sheep."], ["Nerissa R.", "We just moved to this side of town and wanted to celebrate our anniversary with Japanese food.  We heard from a good friend that the food was \"phenomenal.\"  We were easily seated at the hibachi grill.  The two hibachis next to us had birthday parties which made the atmosphere fun.  Had they not been there it would have been a quiet Sunday.Our hibachi chef did the standard grill tricks and was relatively quiet.  Our food was very well on the grill. Our waitress was good.  We could barely hear her because of the other tables, but in a good way.  She was very attentive.Definitely will be back again."], ["Chelsea S.", "Pretty awesome Sushi!  We havent been inside yet we've always called for delivery."], ["Linda B.", "Happy Birthday Jimmy! I heard that your food was cooked great. That's a good thing cause ours was over cooked pretty badly. We all met and were seated by one person and then another came over and got one couples app orders and off she went. When theirs was cooked she took someone else's order and off she went. The service wasn't worth a darn. One young man in our group ended up going and getting another adult beverage himself. The Chef was funny and very scripted. You know thrown the egg at folks and then the onion volcano Jimmy did get a bunch of mini birthday cakes. So we were not very impressed with the Fujiyama meal."], ["B H.", "Great Sushi at a very reasonable price.   Fujiyama is one of those Japanese restaurants that is split between a Japanese Griddle Steakhouse and a Sushi Restaurant.  Their Grill is typical Mall food, but their Sushi side is wonderful! I really feel this is one of the best Sushi joints in North Jacksonville.   Try the Spicy Salmon Roll for a test, very savory...  Their special sushi bar menu is always really creative and tasty.   Service at the Sushi side of the house is above average for Jax."], ["Mariko S.", "It was ok. What can I say ... Nothing can compare to real sushi in Japan. The server was really nice. I will probebly go back when my son feel like sushi. He ordered spicy tuna and regular tuna. He wanted me to rated 4 .... :/ but... He doesn't know what real Japanese food is. I had tempura udon. Tempura was on the side with weird sweet sauce which.... Isn't actual  tempura sauce .... Udon soup.... Never seen asparagus in udon in my life til today. Oh well... What can I say .."], ["Alex V.", "By far the best we've found in Jax so far - we've tried maybe 4 and returned to this one 4 times.  The service is great, the chef's are always entertaining, always too much to eat, and the sushi menu is top-notch.  The pricing is a bit cheaper than the other few we've tried in the area but the service and food-quality far succeeded them.  Great experience, and will and have been back!"], ["Jackie B.", "The service here was good, and since the restaurant is close to us, I really wanted to like it, but I just couldn't do it...  We had hibachi from the kitchen. Steak and shrimp/scallops. All of the shrimp were overlooked, rubbery, and a little fishy. The scallops were tiny, very rubbery, and very fishy. The vegetable portions were very small. The only sauce they served was shrimp sauce. You could ask for ginger, which was decent, but when I asked for mustard sauce, they looked at me like I had a third eye. We had high hopes, but won't be going back. Have Thai at the Green Papaya next door if you're in the area instead!"], ["Nisheka C.", "This place is absolutely amazing. I just moved to Jacksonville from San Diego, and I did not have to look far to find a place that served amazing sushi. The Godzilla roll is to die for. The service is amazing, fast and friendly. I don't have any complaints about this place."], ["B M.", "This restaurant is becoming one of my regular dinning spots. The service is excellent (owners brother is great!) and the food is always excellent."], ["Ryan D.", "My friends and I, we love Japanese steak houses. We've been to many places in town and it's all been a hit and miss. We've been back to Fujiyama the most because we get great service here, and the food here tasted good. The only drawback I have about this place is the amount of food you get for the price. Portions here are much much smaller than other places, even the meat and shrimp portions. Other japanese steakhouses gives you a much more decent amount of rice, shrimps, and meat for the price."], ["Colleen H.", "Great experience.  Good food.  We were passing through the area and Yelp brought us here. I wanted to add to the reviews.  Honestly....strip mall sushi scared me, but it was GREAT!!"], ["Alanna L.", "Stopped into Fujiyama tonight for our daughter's 7th birthday (she chose sushi for her birthday dinner) and had a great time. The sushi was wonderful and the hibachi dinner was great. Huge portions and everything tasted good.  I'm only taking off one star for basically being rushed out the door, we weren't even half way through eating when the waitress was asking if we needed boxes and were ready for the check."], ["Reyer J.", "Best Sushi from south Jax to GA. Decently priced, well presented, and always consistent. The sushi bar gentlemen are always talkative and love to see your reaction makes the place a good one."], ["A S.", "This place is not suggested at all. I went with a few friends today when I went to the bathroom a COCKROACH was running around. The MOST DISTURBING thing I have ever seen and when we went to go tell the front desk they acted like it was okay. Thank god we hadn't ordered yet because who knows how well they really deal with the health violations. Absolutely disgusting."], ["Jana O.", "Great lunch for 8$. Bento box with shrimp tempura came with California roll, salad, the ginger dressing was excellent, miso soup, and dumplings. Dear hubby had the chicken teriyaki and enjoyed his very much too. I think the chicken was on the dry side.The decor is warm dark and intimate. The wait staff pleasant ."], ["Scott W.", "The shrimp tempura was excellent.  The tempura was fresh and crispy but not too greasy.  The sushi is fresh.  I have to say that it's some of the best in the area.  Check out the noodle dishes as well. Very good too."], ["Mharz P.", "great customer service , the sushi/ sashimi are very delicious and they are freshly made. the place are clean and has great ambience, the only thing that is down side to this sushi bar is they need to make the sushi and sashimi a little bit more bigger serving just like other sushi bar has to offer."], ["Kathy C.", "This review is solely on the sushi side of the restaurant.On the rare occasion that we are on the north side of Jacksonville, we decided to give this place a try.  We are still searching for the hamachi collar (as Sekisui closed down... /cry)  So imagine our surprise when we saw it on the menu here, but wait... $10.95?  That's about the highest I've seen a hamachi collar dish.  But maybe, wishful thinking, maybe it's priced that high because they give you BOTH sides of hamachi collor???So we eagerly ordered our food.  As usual, trying out a new sushi place, we ordered hamachi sashimi, tamago, spicy tuna roll... and then, I saw the spicy scallop roll, and just had to try it.  Topped it all of with fried calamari and a hamachi collar.The fried calamari came out first.  They were HUGE rings of squid lightly battered (Japanese tempura style) and fried to perfection.  Delicious!Then the sushi came... The hamachi sashimi were two huge slices of fish, not bad at all.  Tamago was decent.  But that ended the good streak for us....  The spicy tuna roll was grinded up tuna mixed with spicy sauce.  So I do prefer my fish a bigger piece instead of grinded, but I've tried spicy tuna roll both ways before.  And have had good experience even when the tuna was grinded up like this.However, what is disappointing here is that the sushi rice was terrible and the knifework was ... unacceptable.  Both rolls have very sloppy presentation.  There were 8-9 pieces per order, which tells me the sushi chef decided to, for whatever reason, cut the pieces small.  They were uneven, and some parts of these rolls were not covered with rice (i.e. showing seaweed wrapper).  I do have to say though, that the spicy scollop roll was tasty, if you ignore the rice...So while we were finishing up the not-so-impressive rolls, I saw someone from the kitchen brought a plate of something to the sushi bar.  And then, I saw the sushi chef vigorously putting all kinds of sauces on that plate.  I was thinking to myself, \"I feel sorry for the poor bastard who is gonna get that soaked sushi plate mess of a dish....\"  Guess what, we were that poor bastard!  That was the hamachi collar....I've had hamachi collar from several different places, this is the first time we had to \"rescue\" the hamachi collar from a soupy mess.  It was a nicely flamed fish, tender and juicy, but topped, no, bathed in variety of sauces.  The roe was a nice touch though.  After our initial panic, we lifted the collar off from it's original dish and set it on the sushi dish (now empty)... and did enjoyed it afterwards.  But no, it was a regularly portioned hamachi collar for $10.95... I guess the extra 4 bucks was the effort the sushi chef made to \"decorate\" the collar....We probably will not... go back again, given the location (too far from where we live) and the display of sushi.  The price of hamachi collar was just too high (now that we found another, decently priced, Japense restaurant for the collar)."], ["Crystal B.", "Absolutely amazing. Gorgeous presentation and sushi taste ridiculously aaaaaanazing!!!!!"], ["Roderick C.", "I had the Shrimp Hibachi. The vegetables were fresh, the fried rice had the right amount of sauce, and the shrimp were prepared tastefully. However the portion size was really small in my opinion. Not really sure I got my money's worth. However it does provide a great atomosphere for family and friends which picks up where the value of the food lacks."], ["D Y.", "Update: 1 Dec 09Just as we thought....my SO and I visited Fujiyama again when our daughter was in town.  We did not have sushi, we sat at the Teppan tables for dinner and a show.  so, my previous review was 4 out of 5 stars b/c it was the grand opening. We were impressed at the size portions and the quality of food.  That was 30 Oct 09. NOW, the portions were much, much smaller -- I guess the newness has worn off and in comes the extreme portion control.  The rice this time was a long grain rice that was dry where it did not stick at all and jumped on the teppan table for lack of moisture. We each ordered Steak and something combo's. Seems my SO's steak portion was given to another customer -- mine seemed to be the normal portion, but he had less than half a portion. hhmmm.....This chef 'tried' to be funny but wasn't.  He kept calling all of the women \"Mamee\" throughout his entire presentation.  He served the shrimp appetizer LAST, veggies next to last;  Rice and then meats were served first. Kind of backwards??? Needless to say, I'm only giving 2 stars b/c I've had much, much better service, portions and have had more entertaining at other places. Also PRICELESS was the little boy's face (His big brother brought him) when he watched the fire and the spinning utensils."]], "Indochine": [], "Kaika Teppanyaki": [], "Fuji Sushi & Grill": [["Rose B.", "Foods almost always spot on. Have ate there many times and would recommend as a great local bite to eat. Hibachi is always good here!"], ["Miranda G.", "Hands down, worst hibachi ever. It didn't even qualify as hibachi. It was Chinese food in Chinese food containers that they threw zucchini in, charged double for & called hibachi. Gross! Never again."], ["Rachael L.", "DO NOT EAT HERE!! I seriously love this place but tonight I ordered a roll to go and go home. I get home and I'm picking at my roll putting the ginger and shrimp sauce on it when I go to grab a piece there's something in it.. it's a STAPLE, yes metal thing you pierce paper with to keep them together. I am so pissed, I can't return the roll because they're closed and I'm sure no one will understand. how is a restaurant so careless that they have a staple end up in their food. had I or someone of ate it, it probably would of done some damage. do not eat here!!!!"], ["Mari G.", "I attended  a week long business thing near here and went here almost every day. I wouldn't say that they are the most organized, but they get it together enough. First time in here, it was like the guy had never seen a register. It wasn't busy at all-- well, they did have people coming in to pick up orders over the phone, so maybe they were.The ambience here is pretty casual. It's clean, smells nice and pretty decent capacity in the seating area. I like how they organized the place.I had the sushi box twice-- once as to go and once dine-in. Go ahead and dine-in, you get more. Plus, the service is just fantastic! They check up on you without being annoying. They recommend dishes after legitimately listening to your preferences. I would suggest a new source for their fish. It just doesn't taste as fresh as other places I've been to or flavorful. I wouldnt go so far as to say bland, but it definitely could be better.Their shrimp sauce is fantastic, too."], ["Mark B.", "We love us some Fuji Sushi. We have been eating at Fuji so long they know our voices on the phone. We normally get 3-4 of the same rolls and then one we have never eaten or what the chef recommends. On this particular  trip we went with a dynamite roll, spicy tuna, New York roll, Fuji roll, and they added a fried shrimp roll. They all were great as usual but the shrimp sauce was a little running for me. All in all it is a good place with some great sushi."], ["Chad S.", "Went here based on the other two good reviews.  it's a small dive looking place in a strip mall.  you either score a great find, or end up getting sick at a place like this.had tuna tataki and a house salad.  both were good and I was pleasantly surprised.then came the sushi.  a polar bear and a Fuji roll.  sushi was warm and squishy.  fish did not taste fresh and overall was very bland.  would not recommend at least what I ate.  not sure why the other reviews have such a high rating..  feel bad for them as they've obviously never had pod sushi.service was very friendly and prompt."], ["Keely P.", "My husband and son LOVE this place. I stick to the basics here, clear soup and ginger salad and im always content! The boys eat sushi, sashimi, tempura, you name it! My only complain is i think sometimes the tuna taste funny-thats why i stick to my usual!"], ["Mindy M.", "We're not sure why but they rolled out the red carpet for us at lunch today. We had lo  mein, seaweed salad and other things from the sushi menu. It was all very good and the service was excellent."], ["Lori D.", "Great food, great service, lovely people. Would highly recommend!"], ["Samantha M.", "Best sushi on the Northside. Staff friendly. Manager likes to provide complimentary samples of various salads and appetizers, it's neat to try new things in that way."]], "Oishii": [["Maya C.", "A friend of mine wanted to celebrate her birthday at Oishii. She had been there more than a few times and absolutely loved it so why not invite the newbies?I didn't realize it until I pulled up to the door that it was the old Yo Sushi location. I loved what they did with the place. I sat down with my party at two tables in the middle of the restaurant and we chit-chatted as our servers took care of us very attentively. I checked out the menu and was going to settle on getting ramen but since I hadn't had sushi in a while, I ordered 4 rolls hahaha. I spontaneously ordered the Sweetheart Roll and the Spicy Tuna and Banana Tempura Roll. Let me tell you I loved the presentation of the sweetheart roll. It came out as 4 hearts placed to look like a 4-leaf clover. Awwww! The tuna and banana roll, while sounding anything but good, was actually wonderful. The tuna wasn't a strong tuna taste and the banana overpowered the whole thing. I was happy. The other 2 rolls I got were the Spicy Mango Shrimp Roll and the Philadelphia Roll. The Philly roll is my staple. I love smoked salmon so there's now way I could not order it. No frills, the roll was good. Now the mango shrimp roll? That was excellent! It wasn't that spicy at all and I liked that. I was able to taste Octopus Sashimi and some Tonkotsu Ramen and both were awesome. For dessert, I shared a Mango and Green Tea mochi with my foodie bestie. God I wish I had gotten some to go.    I really enjoyed this outing and I found a great sushi place nearby. I'm definitely up to join my friends here again."], ["Kevin G.", "Kind of disappointed... there is a picture of spicy tuna Onigiri, but come to find out its  not on the menu. The owner requested it and took a picture, but when I requested it, was told they couldn't make it for me..... Will edit when food arrives"], ["Ataya P.", "Yummy!! I love sushi and I can be a snob sometimes.  But this place definitely made my list!  I wanted sushi after we came from the movies. I found this place with many thanks to a Yelp search. (Yep, flexing my Yelp muscles!) From the outside, it looks like a typical strip mall restaurant.  However, once inside, it looks like a lounge! A very intimate space.  Perfect for lunch.  Not so sure that it will be as comfortable for dinner, considering it may get crowded.The staff were nice and patient with us.  It also help a ton that there are pictures of popular sushi and rolls posted on the wall at the table!I recommend for lunch.  Even better for an early date night!"], ["Cheuk K.", "We came here for lunch Friday at around 1pm. There wasn't any customers at the restaurant. It was dark inside, and I really liked their lighting and their modern design. I ordered the Tonkotsu ramen because it was recommended to me by a friend. My wife got the shrimp tempura roll and the Fire Dragon roll.Tonkotsu ramen: 4 out of 5I was really looking forward to this all week, but I ended up not liking it as much as I thought I would. The noodles themselves were of superior quality. The texture of the noodles were chewy and slightly firm, and I liked it. What I didn't like was the broth. I found it not very flavorful and bland. But overall, I still enjoyed the ramen. However, for the price of $12, I expected it to be a whole lot better! You could get an order of Pho with a lot of meat and noodles for $8 at PK noodles. But this is ramen, and I think this is the only restaurant in the area that has it. On the other hand, my wife loved the ramen, and said it's one of the best/highest quality ramen she has ever had. She enjoyed the broth as well. Shrimp tempura roll: 4 out of 5Pretty tasty! I really loved how the sushi rice was done, and it was probably the best sushi rice I've had in Jacksonville. We were surprised they put LETTUCE in shrimp tempura roll, so we thought it was going to be gross. It turned out that the lettuce was sweet & fresh, and it went really well with the shrimp tempura. My wife originally ordered shrimp tempera roll as a side for her Fire Dragon roll, but she ended up liking the shrimp tempura roll more.Fire Dragon Roll: 3 out of 5It was okay. It tasted very bland, and the only thing we tasted was the tsukemono (japanese sweet pickle). One good thing about this roll was that they used real tobiko on the sushi.  It was still very disappointing considering it costs $9.00!Pros:Very fresh and high quality ingredientsGood sushi riceReal Japanese sushi chefPlays Japanese musicNice decorations and good atmosphereCons:Some of their food were a little blandThe prices were a lot more expensive than Japanese restaurants around hereI would come here again and try some of their sushi rolls with raw fish and perhaps some salmon sashimi."], ["Suzi R.", "This place was great! My tried and true Fuji decided to be closed on Sunday's (because no one wants sushi on Sunday ) and I had been meaning to try  oishii for awhile now. We were feeling the munch and went for the croquette and calamari appetizers, seaweed salad to start. Croquette was as described yet so much better. Warm potato inside a light crispy exterior, taste was bursting with umami, reminded me of okonomiyaki. Would probably skip the calamari next time, it was a little tough. Seaweed salad was fresh with good flavor, not too briny. Had the mermaid roll, which was fresh, simple and good with 3 types of fish inside. Eel avocado role was silky and delightful. On point. One of the best dishes was my husbands entree. Don Katsu pork with curry. The pork was so tender and well fried, curry was absolutely delicious. Can't wait to try the ramen!"], ["Kara R.", "Sorry no pics...I guess I was hungry and wasn't really thinking about pictures :)This place is pretty nondescript on the outside (in the strip mall at Tinseltown just south of the Gate gas station and Burger King), but WOW when you walk in.  Beautifully decorated, small but able to make you feel like your table is \"private\", and then there's the food! We only had sushi and we were very impressed.  They have photos of some of their sushi rolls so you have an idea of what you're getting into (helps to try new things).  I judge most sushi places based on their Tuna Tataki - Oishii has some of the most tender, like butter on your tongue tuna.  I usually like more ponzu sauce and did not with this one - just delicious.Had the Naruta (very well made - most other places do not slice the cucumber thin enough or do not wrap it tight enough and it falls apart, not so here), Oishii special roll (fried, batter was light and didn't overpower the roll, very good), Rainbow roll (my least favorite and I'd still order it again), and the Crazy Pizza roll (very big, neat looking, triangle thing! I like to eat my sushi in one bite and this is too challenging with this one - good but not a one bite roll).  All in all, very impressed and will go again.  All were beautifully presented."], ["Parris P.", "The Tonkotsu ramen is the BEST!! So flavorful and savory!!! I finished it off pretty quickly.I also got to try the Pork Katsu (by stealing my friends food xD) and it was seasoned and cooked perfectly. So good!The sushi and gyoza are also really yummy.I would definitely recommend it to anyone wanting to try quality Japanese food!"], ["S. C.", "Had croquette and tonkatsu ramen for lunch. Both excellently prepared and served in timely fashion by a very polite staff. The pork in the ramen seemed to be in Chinese style, not breaded pork cutlet as one might expect, though the dish was never the less delicious! I will be back as they have fresh uni on Thursdays!"], ["Elizabeth M.", "This place is pretty good but it definitely has some room for improvement. I've been here twice already and I never leave unhappy but I also never leave very happy. Hence why I'm giving it the three stars. Last night I came in with my brother, his girlfriend and my daughter. My daughter was pretty hungry so they brought out her chicken udon noodles first. The noodles were pretty tasty. They gave me the option of one vegetable in the noodles after I asked. I requested broccoli for my daughter which was perfectly cooked. Still had a bit of crisp which was nice. The chicken strips were also cooked well. Not to dry and they were pretty soft. The only problem with the noodles was that the udons were all cut up into little pieces. Not sure if this was done because my child is little or if this is how it's normally served. The chicken tempura dinner was okay. Just fried veggies and chicken strips. I am normally okay with that but there was not a single piece of panko breading on this dish. The breading was light and fluffy but not typical of good tempura. The veggies were also a bit oily and soaked thru the batter. They were nice enough to switch the salad for soup since neither me or my daughter would eat it. The staff was friendly but somehow we couldn't get any napkins for the table. I definitely wouldn't turn down coming here with a group of friends but I also won't be making any special trips."], ["Jeana L.", "Great place to eat sushi and ramen. I had the Pink Lady Roll, the Mermaid Roll, and Naruto Roll. Very well prepared and delicious with or without the white shrimp sauce. The Mermaid roll has tuna, salmon, yellowtail, tobiko (the tiny orange fish eggs) avocado, cucumber, and scallion wrapped with a white soybean paper. The pink lady has shrimp tempura, avocado, spicy crabmeat (not that spicy to me), cucumber wrapped with pink soybean paper. The Naruto roll, you can choose between tuna, salmon, crab, spicy tuna or spicy salmon wrapped in very thin slices of cucumber and no rice (very good for low-carb). I had the tuna Naruto roll and it comes with a special sauce (forgot the name of it, but was good) not tempura sauce or soy sauce. I really enjoyed my dinner and the staff were friendly and attentive."], ["Richard P.", "I have been to Oishii a couple of times and thought the food was ok.  I have tried their ramen, several different sushi rolls, curry, and habachi plate.  The ramen was not the best I've had.  Not even close.  But given it's in Jacksonville, where there is no dedicated ramen shop and that this is really a sushi restaurant, I thought it was decent (though very pricey).  My wife ordered their scallop and steak hibachi one time and asked for 'medium' on the steak.  Well, the steak was cook beyond well done.  The scallops were seared on one side only (i.e. good coloring on one side and no color on the other).  As for the sushi, there are some really good, creative sushi rolls and then some we didn't enjoy.  But that's just something to experiment and find out what your preferences are."], ["Keely K.", "I had never been here before or heard anything about it before I went. The service was great and the food was so delicious! I will definitely be back."], ["Daisy D.", "Great solid sushi place on Southside Blvd. After burning some calories and then imbibing some calories, we were in search of food. We were all in the mood for sushi & using our trusty little app we found a place that wasn't too far away. We decided to each pick out two rolls and would share everything at the table. Definitely offers a lot of variety.  For this round we went with the Lion King, Sweet Heart, Mexican, Black Angel, Fire Dragon, and Oishii Special. The Black Angel sticks out in my mind as it was the last to arrive to the table and it was piping hot. Definitely a couple of these I would order again, but I might venture to try more on the menu first. And like others have said, the plates were beautifully presented. Yes, I know, purists believe sushi shouldn't be cooked. But this was delicious. I will definitely have to remember this place the next time we're in the Tinseltown area and want to grab a bite to eat."], ["Valarie C.", "So amazing! Bento was packed so me and my bf looked up this place on Yelp and stopped in for the first time. What a pleasant experience! The people were so friendly our server was very sweet and helpful. The food was very good. We tried crab rangoons, the ramen, rock and roll roll,south side roll and the fusion roll. I would recommend all of the above. And the price was also very fair so that was nice too!At the end of our lovely meal the waitress gave us a box of pocky for a Valentine's Day treat.I've never been to Japan or anything but his place just felt very authentic. The decor was also very aesthetically appealing.If you want some good sushi, Japanese food and just a good atmosphere overall give this place a try!!!!"], ["Brian S.", "This place was a mixed bag.  Definitely has potential for being my local, inexpensive sushi/hibachi place, but has some room for improvement.For starters, the service was great; fast, attentive, courteous, and not overwhelming.  Our server did a great job!The food was good, the portions were good, and the presentation (while just slightly over-done) was pretty good.  BUT (you knew it was coming, right?) my steak and shrimp combo from the hibachi arrived with a steak that was *perfectly* cooked... but luke warm to the touch.  Did they cook it first and let it sit on the plate while they finished the rest of the meal?  If so, then that is a major disadvantage when compared to 'table-side' hibachis like Kan Ki, Sakura, Shogun, and Mikado.That is my only \"complaint\" (I'd rather use the phrase of 'good opportunity for improvement').  Another Yelper noted the decor was a little weird, and I have to agree.  They are right in the middle of an upscale, hip restaurant, and the cheesy Chinese take out I used to go to in college.  I say: ditch the photos stapled on the wall, along with the comic posters (which I have no earthly idea why they are there in the first place), and brighten up the room just a tad.Those things and a better, uniform temperature of the food on the plate will make it 5-stars--these guys have *all* the ingredients to be a rock star restaurant, now it's just time to get them cooking!Oh, and ditch the rice scoop!  :)"], ["Kelly L.", "Not impressed I ordered the lunch special today 2 rolls spicy shrimp and spicy shrimp with mango. What I got was a rice roll filled with Panko breading. You can barely see a very very small piece of shrimp and even smaller piece of mango. If I wasn't starving and already back at work id take it back. Also these rolls everywhere else come with steamed shrimp not fried so I'm just overall disappointed."], ["Laura V.", "Awesome place for sushi.  Small and intimate yet modern design. Fair prices tooWe had the lion king roll, the spider roll, Alaska roll, and rock n roll roll. Absolutely delicious. beautifully plated. we weren't in at a crowded time, but the service was quick  too! very nice little place. each roll was fresh and portioned well. I really liked oishii. I can't speak for the hibachi or ramen, but will be back soon to try more."], ["Kellie S.", "I visited on a Sunday evening after I checked into my hotel. The place was empty the entire time I was there. The staff was attentive (why wouldn't they be? I was the only one there) and the food was great. I ordered a bento box for dinner and agedashi tofu. My absolute favorite entree of the night was the agedashi tofu. The presentation was beautiful as it was delicious. I would definitely come back if I am ever back in Jacksonville."], ["Joseph G.", "Some people just want sushi and others want more authentic options beyond what you would find in your run of the mill Japanese restaurant. This gem of a restaurant on Southside is everything you want and more. My date and I haven't had a tremendous amount of sushi here, but she and I both judge a sushi bar by the freshness of its ikka or squid. Here, it is very fresh, not tough, and quite tasty where usually it is a bland protein. With the fresh ginger that accompanies it, the squid is amazing.But what I really really love about this place is its ramen which comes with all the proper accoutrements like fish cake and a few greens, seaweed, etc. I can't even begin to describe the different flavors in each type of broth. The shoyu broth is light but flavorful, nebeyaki udon broth is more intense and feels heavier but is also delicious. Wasn't a big fan of the tonkotsu but I can see why people would like it. The service is great, decor is family style and not fancy. But for your neighbohood sushi stop, this is your best bet in Jacksonville. 5 easy stars!!"], ["Allie A.", "After a few post workout beers, we needed some nibbles to soak up our sips and were craving something light, and I remember this place had quite a few Yelp fans, so off we went! The three of us were able to be seated right away, and beers and miso was ordered all around. Now I love a good broth-y soup, and this miso was packed with great flavor. It hit the spot and as we said at our table, it really \"warmed the soul.\" We ordered two rolls a piece, with a plan to share so we could sample a bit of everything: the sweetheart, black angel, Mexican, spicy dragon, Oishii, and lion heart. All tasted pretty fresh, and the black angel and Oishii were my favorites, with the Mexican coming in a close third. While we had a good dinner, the ambiance was cool, and service was right on, the flavors in the rolls weren't anything extraordinary, but solid.... so that is why I'll give it 3 stars. A-Ok, but I don't see myself making a special trip."], ["Ed M.", "I am so sorry for what has happened to this place.  It WAS only the third sushi place we had encountered in NE FL (out of how many hundreds?) with both excellent sashimi and sushi.  A month or so ago we were disappointed with the quality -- the sashimi had been \"chunked\", as though cut for bait -- and inquired.  We received a long, glowing review for the new chef from our server, the center of which was \"he is from JAPAN!\"  We treated this with a bit of skepticism as a chef's country of origin is not important... But training, temperament, and artistry IS.  Our next visit: none of the sashimi was fresh.  Not even the salmon or tuna.  The waitress (who is great!) remembered how I wanted my fish cut (she called it 'thin'... Though I didn't want it cut 'thin' as much as \"well\" or \"skillfully\").  But the sashimi was still against the grain and chewy.  The sushi was all wet.  A careful sushi chef would NEVER serve rolls that were sitting in a puddle of water (from cucumber, mango etc having condensation).  Even from Looking at the man, he is large, gruff, and a bit sloppy.  If being Japanese is his primary qualification, I would wholeheartedly suggest a samurai lifestyle over that of a sushi chef.  Unfortunately, we won't be coming back, though this was a tough loss for us as well as for all true sushi enthusiasts (who would rather try the uni than eat 'lava fries'.  Oh, jacksonville.)."], ["Lydia F.", "Great food , clean and fast. Nice people and great service. Curry was tasteful just like Japan."], ["Todd F.", "Not sure why this place doesn't have more great reviews. Maybe I just went on a good night, but I'm never going to another sushi place in Jacksonville if it keeps to this standard.Crazy Sushi (my previous fave) is good. It's tasty sushi at a reasonable price. And I'm not a person who suffers bad sushi.Oishii is a cut above that. The fish is fresher. The rice is more perfect. The service is better. The menu more interesting and varied. This is the place you go when you want to have an *experience* eating sushi.For basically the same price, I'll take Oishii every time."], ["Mark A.", "Delicious ramen bowls and the hibachi dishes are very good! For some reason, the plain white rice was amazing! Try the Oishii Roll, delicious sushi roll."], ["Mijo K.", "I had ramen and it was just okay. My husband ordered Mexican roll but it was fair at best, not spicy. Not four stars."], ["Aunt R.", "This place is just what I like all around. Great serve, flavorful food, and right in the neighborhood. I been here a dozen times and I've had a great experience every time. My favorite dish Raman and the hibachi!"], ["Lisa S.", "Great lunch specials. Excellent sushi with soup or salad for a reasonable price and fast, friendly service."], ["Mike Henry H.", "I tried the spicy tonkosu and it was good. Probably the better one that JAX has to offer. I wish it had the same flavor as you would find back in Japan. The Hamachi Cama fish was good. I've never tried that fish before. Good flavor of fish since it was my first time. A bit pricy though."], ["Jenny Z.", "Great find whilst on a work trip! Easy walk over from my hotel. Service was phenomenal--very nice sushi chef and waitress. Went on a Thursday so it was dead (read: I was their lone customer), but I am never one to doubt my fellow Yelpers. Salmon, white tuna, shrimp, and red snapper tasted very fresh! The salmon and white tuna melts in your mouth. The regular tuna was the only one that was a little questionable, but I still ate it anyways because my mother told me to never waste food. All in all, very pleased. Definitely an upgrade from the Asian buffet I had last night... Why I thought that was a good idea... I've got nothing."], ["Ashley B.", "They recently re-opened under this new name.  I give this place five stars all the way. My friend got sushi and I got the chicken hibachi.... both meals were absolutely amazing.  The staff is super friendly, the restaurant a little small but personable and clean, the food top notch.  Will be back again soon!"], ["Kayla N.", "Got take out a while back, everything was superb! They were kind and took care of us even though we were just picking up! Definitely will be coming here again."], ["Aaron J.", "Dined here for lunch and had the 3 roll sushi combo which included a salad. 13 bucks. Sushi was good. Solid 4 stars. Ambience was good and service also."], ["Katie B.", "The husband and I loved this place!We came on a whim after finishing up some errands and were very happy with the results. I ordered the bamboo roll and the husband ordered the spicy shrimp mango roll which he loved so much he wouldn't stop talking about it!Also concerning the decor and one previous reviewer's comment about \"the comic posters\", the posters are wanted posters from the anime One Piece. They are a minute bit cheesy but we both thought it was pretty amusing so we rather like them.My only suggestion would be to pick some more ambient music. It seemed like it was on a random playlist and I really don't want to hear country music while I eat sushi. : /"], ["Sydney B.", "Originally found this place on Yelp and my boyfriend and I have returned multiple times, we absolutely love it!! The staff is friendly, the decor is perfect for date night, and the sushi is the best in Jacksonville. Try the River Roll, it's our favorite!"], ["Jeff F.", "I have to say that after all the reviews I may have built up my expectations rather high. I wasn't blown away and it may have been the rolls I ordered. I had the sweet heart roll which was good and the crazy pizza that I wasn't crazy about. The rice was cooked well but i was hoping for. 4.5 star experience and didn't get it. Service was fine and the restaurant is clean. I would come back."], ["Jennifer S.", "I came here because it was the only place in Jax that had ramen on the menu, and it did not disappoint! They have amazing lunch specials that I can't wait to try next time I come visit, which will definitely happen."], ["Matthew C.", "Traditional and authentic!  After living in Japan for three years, I must say this place gets an A (it should, the chef is from Tokyo). Excellent ramen and sushi. Some traditional dishes you won't find at most places. They can make specialty items during the busy days only since that's when the chef is there. Small place, quiet, clean and very nice. Will for sure go back for tonkatsu ramen, onigiri and sushi!"], ["Jade N.", "Finally decided to come back here since I've been on a hiatus since Feb. of their grand opening.  Upon entering it was more intimate since I last remembered.  The black shades over the windows created a cozy atmosphere which were aided by the ambient dim blue & white lights.  Tres chic!  Sadly, the modern decor was detracted by the hand mounted pictures that displayed the walls of each both.  Why ruin a good thing you had going?  The images would have been better off in a picturesque sushi booklet.  Regardless these seemed to be minuscule offenses.Our waitress immediately made us feel welcomed & took our drink orders.  She was very attentive & gave recommendations on what new sushi rolls I should try.   Our orders didn't take too long to come out.  I greatly enjoyed the house special seafood salad, while the husband had miso soup & ginger salad.  My soy wrapped mermaid roll & the spicy yellow tail sushi came out soon thereafter.   It was so good I almost finished everything except the four rolls of the yellow tail.  The S.O ordered the beef hibachi bento box.  Very generous portions of beef with steamed rice.  It also came with other sides such as the flavorful juicy pork gyoza (I tried one), California roll, & tempura veggies.  Very fulfilling.  Service was impeccable & food was fresh + delish = frelish!!!  There are surprising few things my husband hates and one of them is Japanese food.  I'm glad to say he enjoyed it here.  Plus, I've saved some of the waitress' recommended suggestions so that means we will be back soon enough.  Will try the fire roll next time."], ["J C.", "Nice, friendly staff. Love the noodles. Also came here for lunch ordered the steak hibachi and received a good size."], ["Linda W.", "I been to many buffet placses.this is one of them I like .but it better if they make it a little less salt."]], "Philip Sushi": [], "Sushiko Japanese Restaurant": [["Austin R.", "Amazing service, atmosphere and food. Amazing flavor combinations with the specialty rolls. Will definitely be back for the Katsu."], ["Gerrald L.", "Incredible sushi, lots of variety I had the Albacore roll, the yellow monster and the kill bill roll all were great.Great looking servers too."], ["Ash A.", "Love love love this place. The staff is amazing and our meal is always on point!! Thank you!!!!"], ["Douglas W.", "Nice presentation, good selection of fusion rolls but poor quality ingredients.  I won't be back."], ["Oly C.", "Full vegan sushi menu, excellent tempeh fried rice. Always very nice, quick, and delicious!"], ["Bryson M.", "Awesome place!! This is my second time back and every time the service has been prompt (even though there were to servers working the whole dining room) the food comes out so quickly, and most importantly it's fresh and delicious EVERYTIME!!  We have tried a number of different items from the menu and I can honestly not say anything bad about any of them. I know my review is quite vague, but trust me, go there and pick whatever sounds appealing to you and you won't be disappointed.  They give you free soup when you sit down, as well as fried Oreo's for dessert. And for us Yelpers, the offer a free appetizer when you check in."], ["La K.", "This place never lets us down! This Japanese restaurant has some amazing SUSHI! Tried their Ichiban roll and we are hooked! Today we tried their May special roll Super Mario, loved it! So refreshing and yummy. This is the spot for sushi I don't care with no one says! These chef know what they r doing! Thanks for another amazing dinner!"], ["Susan S.", "My friends and i went to Sushiko the other day..one of our group arrived before the rest and was happily drinking a beer when we got there..we were greeted when we walked in and instantly offered a drink..very friendly staff from begining to end..two of the group had hibachi, which looked delish, and will have to be tried on a later visit..the other two including myself stuck to the sushi, and it was AWESOME..the flavors and textures were on point, and everything tasted really fresh.  We had a coupon that was apparently a misprint, and did not offer the discount we thought we were getting, so they brought out a free order of fried oreos which were really tasty! overall nice place, clean relaxed atmosphere, and great food!"], ["Gabe F.", "Very good sushi rolls and great service. We loved the presentation too. Our sushi rolls were served in a big wooden boat. Its not a big place, not a ton of seating, but the atmosphere is cozy and nice ...so be sure to get there early! We had several different rolls and all were great. I highly recommend this restaurant and plan to be back again soon!"], ["HeaLa N.", "I am so excited about the newly expanded vegan menu! Everything I have tasted so far is spectacular. My family of non-vegans still absolutely loved everything on my plate :)"], ["Gregor V.", "Favorite sushi in Jacksonville. Ellie and the others on staff are extremely welcoming. The sushi is always top quality. The pricing is accurate. The presentation is consistently well done. It's the only place I'll go for sushi in JAX."], ["Sophia M.", "Ali is the best! Great time at Sushiko, delicious and fresh food as always, and the best server."], ["Amy W.", "The R33.......Jimmy Smith Roll is fabulous.  The lunch bento box is only 9.95. We love this place."], ["Leah A.", "This is a top notch new sushi spot that serves exceptional food.  The service is wonderful, the atmosphere is quaint and the presentation is gorgeous.  We ordered individual pieces of sushimi and some of our favorite rolls including the Eel & Avocado Roll, the Super Crunch Roll and the Ichiban Roll.  Wash it all down with a Sapporo and you are golden!  Highly recommend - 5 STARS! :)"], ["Sam B.", "Great food. Fun upbeat place. We took 30+ people and they kept up with service and gave great food."], ["Sam B.", "It's a nice little place to eat. I went with my Chinese friends who love Sushi. The fried sushi is great. I didn't like the Tempura very much, hought it was kinda oily. The ginger sauce was a little bitter too. But they made up for that with the other foods we tried and their service was excellent. I got a free appetizer for checking in. I have no idea what it was but it was awesome! We got soup to start our evening and a free dessert to end the night. I will be back."], ["Ariel T.", "I absolutely love this place!  It's the best sushi restaurant in Jacksonville. The sushi is very fresh and full of flavor. The staff are all super nice."], ["Jerry T.", "Finally found an amazing sushi restaurant near Downtown/Riverside/Avondale. When we entered, we were seated quickly and immediately brought soup. Ordered some sushi, a couple special rolls and regular (always a good measure on how to compare sushi restaurants). Everything was delicious. The presentation was great, complete with a smoking cup of soup illuminated by a glowing ice cube! Very cool. We were given a complimentary plate of fried oreos, which I'm not a big fan of, but these were PERFECT. This will definitely be our go to place. I am beyond excited to have found this restaurant."], ["Andrea F.", "I don't leave the beach often but Sushiko is worth the drive. Definitely will be back again and again and again. Very large separate vegan menu."], ["Paige C.", "Best sushi restaurant in Avondale, San Marco, Riverside area! The farm roll, Luna roll, and what I like to call the tornado (a hand roll with spicy tuna are my favorites!)  The owner is super friendly, and adorable. She enjoys giving me my lemons, and is really good at chanting for Sake bombs. Give this place a try and you you won't roll away."]], "Sumo Sushi": [], "Tokyo Sushi & Grill": [], "Sashimi Fusion": [["Brenda M.", "Love this place.  Decided to try it a while back and it was amazing.  What I don't understand is why this is ranked \"$$$\" because I think the prices are awesome for the portions!"], ["Chris S.", "My girl and I decided to try this sushi bar on a whim last night and we weren't disappointed. They have a huge menu. I was overwhelmed by all of the selections that were there.  It will definitely take several visits to dig through their whole menu. LolWe ordered onion soup, ginger house salad, bubba roll, mango tango roll and a salmon bento box.  All of the portions were huge!  The rolls were amazing and extremely flavorful.  The bento box was enough to feed two.  All in all the service was amazing, the staff was very friendly and the food was delicious. We will definitely be going back.  Although the price was a bit much $55 for all of the above."], ["Cheuk K.", "Interior design is very similar to Oishii on Southside Blvd near Tinseltown, but I think I like the design here better because it's more spacious and there are tons of booths. Each booth can fit about six adults comfortably. There were not many customers on a Wednesday lunch, so there was only one server and one sushi chef in the front. Service was fine, but it took about 20-25 minutes for food to get to our table after placing the order even though there were only two other tables. We ordered Bubba Roll, Catepillar Roll, and a Salmon Box from the lunch menu. The presentation of the sushi and my lunch Salmon Box were both beautiful and tasted delicious.Caterpillar Roll - 5 out of 5 starsI really love this roll and would probably eat this for breakfast, lunch, and dinner if I could. It has spicy salmon (raw), cucumber, and tempura crunch on the inside. It is topped with avocado, honey wasabi sauce, and momiji sauce. However, I didn't get it with cucumber. Both the avocado and salmon tasted really good and fresh, and all the ingredients went very well together. This is one of the best Caterpillar Rolls I've had in Jax (I'm probably a little biased since I love raw salmon). My wife didn't like it as much because there is a noticeably strong wasabi taste due to the honey wasabi sauce. So if you don't like wasabi, be sure to notify your server before hand. Bubba Roll - 4 out of 5 starsIt's a fancy, upgraded shrimp tempura roll! Shrimp tempura and cream cheese inside, wrapped in rice paper; steamed shrimp, avocado, tempura crunchy, and spicy mayo + eel sauce on top. I don't really like rolls with lots of cream cheese, but my wife enjoyed it. The only complaint she had was that the tempura crunchy was a bit old.Salmon Box from Lunch Menu - 5 out of 5 starsYou're going to love this if you like Salmon Sashimi. This meal came with a clear soup and ginger salad, and they were average. The Salmon Box actually came on a plate, and it had Mango, Spicy Salmon with tempura crunchy + three slices of avocado on top, Salmon Kobachi, and steamed rice. The salmon were raw and fresh just to my liking. The Kobachi was covered in a sweet sauce. Our only complaint was that there was too much sauce (both on spicy salmon and the kobachi), and it interfered with the taste of delicious raw salmon. And once again, the tempura crunch on the spicy salmon was old. TL;DR - Beautiful interior design with lots of booths, great sushi, fresh salmon, but long wait for the food"], ["Mary B.", "This sushi joint is out of this world! Tucked away you would barely notice it if you didn't look closely! The decor is very appealing to the eye as is the food! Not only is it delicious but also beautifully presented. The wait staff is friendly and very attentive. Try the avocado salad- it's delicious! Also- be daring and try some unique sushi, you won't be disappointed!"], ["Honesty R.", "Best sushi in town hands down! They have the best tasting and looking rolls. They really put an effort in their craft. They have a full service bar that is equally great. Friendly service you can't beat it. If your looking for the best sushi in Jacksonville then this is your place."], ["Yo S.", "Oh my gosh! It's so awesome every time I'm over, either to sit and eat or to go.  There's no other place like here. No one can top their quality and price and variety for sushi/sashimi. They are always so generous. The sake! Mmmmmm! If you are sake beginner this \"Kurosawa nigori sake\" is very good place to start. It pleasantly light and a bit sweet with citrus like end. It's strange for nigori (unfiltered). Ones I'm used to is rough and harder to drink if you are new to sake. But this one is very good.  We are so satisfied and full, mentally and physically :D. Thank you!!!"], ["Andrew R.", "I judge a server by my drink being full. I never saw it get below 1/2.Great sushi. Do it"], ["Khoa H.", "It was quiet a mix feeling for me and my lad as first , the atmosphere was little dim and private . A mix with bar and liquor store . It seems little smaller than we were expected .Move down to the menu , it wasn't anything to extraordinary , however after received our dishes , which included : love boat for 2 , mega lobsters roll , krab cream cheese roll . The dishes came with a surprise element .Anything was well coordinated and pleasure to an eyes . The taste was  phenomenal in the first bite , mega lobsters roll really stood out , I still can feel it crunchiness  .Lovely staff and services . I will definitely recommend this place to all sushi lovers out there , and future visit"], ["Adam W.", "Really neat and unique atmosphere. Large eclectic menu (\"Mexican sushi\"? Yes please!) with really good food.Definitely get the seaweed salad and the island fire rolls.The wife and I have a new favorite place close to home for a good, relatively inexpensive lunch. And we'll likely come back for a family dinner."], ["Monique H.", "My husband and I love to frequent this place a couple of times a month. The fish is a thicker, richer cut and not grimy or chewy (which is not good) like other places.  The service of two waiters we get are excellent - Reza (sp?) and James. Terry, the sushi chef (and I think he's owner as well) takes awesome direction and was able to make a requested roll not other restaurants prepare as well when requested. He also takes great care of us when we are there. The tempura batter for that special roll was perfect. Hands down our favorite sushi spot in Jax!"], ["Dorothy C.", "Great food & service!!!  Will come back for more with my family!!  Sushi was fresh and the hibachi was pretty big portion.  Nice drinking atmosphere at night as well.   (Good for date nights)"], ["Susan A.", "Excellent sushi! Hawaiian poke bowl was delicious as well. Great service and fun atmosphere. I would have never gone in if it had not been for the great Yelp reviews. I have been about four times now and never been disappointed."], ["Meanole M.", "This place is really good. Right down the street from our home. Had a ton of sushi and the steak hibachi. The hibachi was outstanding and the sushi was pretty good. We actually got takeout and the service was amazing. Food was ready in 15 minutes and staff was very friendly.  Definitely will be going here again and will eat in next time."], ["Colleen F.", "The food was great; very fresh and arranged beautifully. We went for lunch on a Monday, and there were only a few people besides us. The wait staff were very friendly and helpful in explaining menu options. Decor is very cool; rough stone walls with fiber optic lights, so I'm guessing it's busier for dinner.  I definitely recommend this restaurant for sushi and will be going again.  It's not in my neighborhood, but worth the drive."], ["Kim S.", "The hubby and I have been to Sashimi Fusion several times since they've opened and I feel like they've finally hit their stride and warrant review. We had James wait on us at our most recent visit and appreciated prompt and genial service. He apologized for the brief waits we experienced during our stay due to it being a busy night at the restaurant. We didn't notice or mind as we were enjoying our conversation but appreciated that he noticed enough to mention it. All of his recommendations were delicious as we combed through their rather large menu. They have everything from sushi and katsu, to udon and soba, to habachi and bento dinners! I've now tried a sampling from each of these categories over my visits and haven't been disappointed.I decided on the Yaki Udon with Seafood Noodle Soup Bowl and it was great. James suggested the seafood over the shrimp only and I thought the broth had tremendous flavor. The noodles were cooked to slightly chewy perfection (as you want with udon) and he even offered to sub the miso soup (which would normally come with the meal) for a double ginger salad. Great! My only comment for the seafood was the krab stick (which I knew it would come with) was still in it's complete \"stick\" form. I would like to see it cut down even a bit, if for not ease of eating (I'm not afraid to slurp!) then for presentation. And there was a soft boiled egg on top, too. My favorite!Hubby had the Chicken Katsu Don which I've ordered twice on previous occasions. This is a fried chicken breast (katsu style) over rice with vegetables and egg served with yummy broth poured all over so it has quite a lot of liquid in the bottom of the bowl. I personally love this dish. The broth is deliciously savory and the chicken portion has always been large. I bring up the liquid portion of the dish as it's not mentioned on the menu and other yelpers may not be familiar with the preparation. If you've never tried it, take a chance! It's so yummy!Finally, we met Chef Terry later in the evening. After the crazy rush earlier, he came out to meet and greet a few of the tables and was genuinely interested in our feedback for our meals. For example, he noticed I had picked off some of my seaweed garnish (only so I could get to the egg underneath more easily!) and made sure I knew it was no problem to modify my order in the future. He was quite lovely to speak with and obviously cares a lot about his restaurant. Finally, my soup was such a large portion that James boxed up my leftovers to go. For a million server points he carefully separated the noodles and seafood from the broth for me in separate containers and set them in a small box so they wouldn't tip over in the bag. You go, Glenn Coco!So glad to have these folks in the neighborhood (I could walk there!) and hope they continue to thrive at the Publix in the shopping center continues to undergo renovation. Looking forward to many happy returns!"], ["Meghan N.", "Such an awesome dining experience. The food was very very good and was pleasing to the eye, the service was perfect and never went without anything.  The ambiance was great. We had an all-in-all great experience.  Definitely recommend"], ["Robert B.", "Excellent service, very yummy sushi made fresh to order. I have to come here at least once a week."], ["Chris M.", "I went here for lunch with my boss who is a regular here. I read several Yelp reviews that backed up his claims of the amazing sushi!As everyone else has said, you really wouldn't think that this place exists here due to all of the construction going on. Unfortunately they aren't able to have a real sign outside, I'll include a storefront photo for reference. The inside looked very different for what you would expect - the tables and booths were very nice and there were many different colored lights all throughout the restaurant.  It had a clubby feel to it at first. The Rock Shrimp appetizer was amazing! The shrimp were very flavorful and was complimented with the right amount of sweet chili sauce. I ordered the Sushi Regular entree with Clear Soup instead of Miso. The soup was really good; it was a little darker and the mushrooms were cooked more than most other places. The entree had several types of fish and was really fresh!  The dish is a chef's choice with your choice of a California or Tuna roll, I went with Tuna. This was more than enough food for a lunch portion but it was so worth it! Presentation plays a big role here, you really feel like you're eating art. My boss previously had a dragon roll that came out looking like a dragon!  The \"Terry Special\" that he had today included sea urchins, it didn't sound appealing to me but he said it was delicious!"], ["Kimberly V.", "One of my favorite sushi places. Amazing sushi & awesome staff. We ordered sushi online to-go and arrived early. They were busy but We didn't mind the wait at all and we let the server it wasn't a big deal because we arrived early. The cashier gave us a free roll and free soup/salad for the wait. Excellent customer service!!"], ["A J.", "Came in tonight for a take out order. I had been waiting at least 40 mins. I ended up leaving without it bc actually my order had been sitting there for a while and I wasn't told or heard anyone ask.. it was sushi so I was not happy about taking it knowing it was sitting out waiting. I love this place so it's really hard for me to complain but I wasn't the only one.... More than one person sitting next to me had been waiting for over an hour for their take out order. Maybe they didn't anticipate the dinner rush tonight? I don't know but this was my first bad experience and I have dined here several times and everything is always delicious. They need more help and more organization on the weekends! Very very disappointed."]], "Hana Yori": [["Christy C.", "Definitely worth what you pay!! I got the chicken and shrimp hibachi, which was by far the best hibachi ive found in jax (especially compared to \"tokyo\"), and it came with soup and salad, not to mentiona hefty portion veggies and rice. My boyfriend got the sashimi platter and said it was to die for. (I can tell, because he ate it so slowly, savoring it lol) His came with rice, soup, and salad too! Decor is nice, with cute decorated blocks on the wall from previous customers. Very clean place overall. My only small complaint might be that our waitress seemed a little rudely-fast, taking our orders at the speed of light and saying nothing when our food was brought out, but thats just me being nit-picky. Overall, beyond expectation!"], ["Rosilyn L.", "Great place to have sushi! Everything was fresh and delicious and they even have a if you can't think of it we will make it sushi  definitely stop by if you are in the area"], ["Kevin M.", "Perfect hibachi food without the traditional steak house setting that takes 3 hrs to get a meal. They also have an awesome and unique selection of sushi--no joke the sushi is so erotic that I ate a baby octopus. And I don't mean octopus tentacles like you \"brave\" sushi eaters like myself enjoy, I literally was served a full baby octopus, head and all. The head was the weirdest part, the taste of it's brains sent a chill down my spine and left me feeling if what I had just done was ethical. I'll let you decide my yelping friends, am I wrong for what I did to that baby octopus? Do I need mental health treatment or is what I did perfectly acceptable? Writing this review is making me hungry for another, all part of my blood lust for natural protein :o)"], ["Janeen J.", "Hana Yori has the best sushi and hibachi. The food is always super fresh and is made to perfection. I refuse to go anywhere else for sushi or hibachi. The prices are very reasonable.  Not only is the food amazing, but the staff and Mr. Tony are always so welcoming! We eat here at least once a week. I've even introduced family to the restaurant and they love it also. Best restaurant ever!"], ["Kelly M.", "I LOVED this place. My friend, Kaneil S. told us about this place.  Our group arrived about 35 min before closing. They were more than happy to seat us and the sushi chef came to our table to ask us how everything was. The sushi was great. Some of the best I've had in Jax so far. Delicious."], ["Christine M.", "Chef Tony, his wife and the rest of their crew have got it GOIN' ON.I've never been disappointed with Hana Yori. EVER. Honestly the only downfall this restaurant could possibly possess is its somewhat limited open hours and non-business on Mondays. And I don't. Give a. Hmmm... ;)The food is awesome. Fresh-to-death and tasty. The menu isn't long at all, which I love, especially when it comes to sushi. Best hibachi I've ever had, and it doesn't even need a show. I can't stand sushi rolls that can't be eaten in one bite and are doused in sauces, which this place does NOT offer. Awesome! But you can also create your own roll! Even the clear soup, in my opinion, is richer than any I've gotten at other hibachi/sushi restaurants. Yum.  Service is on point, dine-in or take-out. So nice!They're expanding soon. I can't wait!"], ["Chris J.", "First time going to this place my girlfriend and I waited about 20 minutes before being seated. For a Friday night I would say that's pretty good. However, once we sat down we waited another 15 minutes without ever hearing who our waiter was. My girlfriend saw a group of 4 come in after us and were immediately waited. Having seen this my girlfriend and I decided it was better to take our business elsewhere. Needless to say this was our last time coming to this place."], ["Virginia M.", "Thank you Yelpers for finding this place! I have had dinner and lunch here. The lava fries are delicious! Spicy, but not overpowering. I also enjoyed the Russian silk roll and tuna roll and sashimi from here. I am also a fan of their  chicken hibachi. The open kitchen concept is great, I would return!"], ["Tim C.", "I've seen Hana Yori as long as I've lived in Jacksonville, but I never had the urge to check it out until my friends suggested we eat there.I ordered a couple nigiri pieces as well as a chicken and shrimp hibachi as my entree. The nigiri was good, and the hibachi was even better - one of the better ones I've had around time - and the portions were great for the price as well.I'm glad I finally got the chance to try it, and I'll be sure to check it out often."], ["Marlaina G.", "I called ahead my order for tempura chicken, a sashimi plate, salmon roll, and rainbow roll.  I called them at 7:01pm...I was told it would be ready in twenty minutes.  Let's be honest I was asking for fried chicken and raw fish...shouldn't take too long to cook.  I arrived at 7:20 pm and was told that the tempura was done but they were behind on the sushi bar...I stood around for 30 more minutes and they still had not even started my order.  When I asked if the tempura was going to be crunchy after having sat for almost an hour, the woman suggested I just heat it up when I get home.  Um...yeah anyone ever nuke tempura...it turns to mush.  Finally I said forget the sushi.  I had to take dinner home to my family.  I wasn't even offered a percentage off my meal for the inconvenience or wait.  Meanwhile, when I got the meal home the tempura was in fact no longer crunchy.  And I only live on Kernan.It seemed cute family owned and operated, but warranting the 5 star review, I'm sorry ambience doesn't get it and neither does hour old tempura."], ["Donna R.", "My friends was looking for a new sushi spot and came here based on Yelp.  I ordered Chicken hibachi with a shrimp tempura roll.  My friends ordered sushi something.....Although compared to our other spot, this place is a close 2nd. We will definitely come back to check out the lunch menu"], ["Andrew B.", "If I ever die and become a fish, please let me get cut up and be served on most amazing sushi rice and subsequently dipped in soy sauce at Hana Yori. Essential sushi place rules for an 'murican:- The sushi is fantastic- The waitstaff speaks perfect English- The man at the grill is Mr. Miyagi's brother- there are sushi options that are both traditional and some that are also covered in mayo- everything is fresh, clean, and very inviting-and they even let you scribble on wood to bootMy mother has always said that \"I don't like seaweed in between my toes; I will not like it in my mouth.\" Not to worry mom, there's amazing steak dishes and chicken dishes to please everyone. Come to Hana Yori. Not only will you experience the most amazing food, but your math score will increase just by osmosis."], ["Jeff W.", "So far so good,  service a little slow but not bad.  Soup and salad good. Lava fries were good bit spicy but not bad.  Down side no kids menu.  You have to order a hibachi Chicken 10$ for a 5 year old. Hibachi Chicken redeemed it's flavorful. Not dry like other hibachi grills.  4 stars for not having a kids menu."], ["Jenna B.", "We went because of all the great reviews online. But we're unfortunately unimpressed. The service was slow (although it was very busy and we were trying to be understanding). The hibachi was pretty good. The sushi was just generic. I got the Panko fried shrimp roll which everyone talked about, and it was mostly breading and felt like filler. The lava fries were creative and tasted pretty good but kind of weird. We were glad we tried them but won't get them again. I was very excited about this place and was unfortunately just not impressed."], ["Beverly H.", "The Chef/owner is very nice and knows how to make delicious Japanese food. However, I went there,was thinking this would be one of my favorite places to eat, ordered several sushi roll, one included an unagi (eel) roll. I almost died eating it, because there was an entire eel vertebra in my sushi roll. I almost died choking on it. When I brought it up to the manager (owners wife) all she said in broken english was it's not a bug, it's just bones no big deal. Then took the evidence that was in my mouth with her bare hands and went to throw it away. I was in such disgust and shock...I told the server and asked the Chef/owner to come out. He apologized and said that they would look into. He told me if I get sick or have to go to the hospital he would pay for it. However, he didn't take the roll off the bill and I didn't eat any of it. Horrible customer service. The food was good other than that, but I will never ever be back."], ["Randy C.", "Lava fries are awesome. Their calamari and shrimp hibachi is really good. Great dining atmosphere. Will certainly eat here again."], ["Jess M.", "We decided to try this place based on the reviews and I'm not sure how it has 41/2 stars. We went on a Saturday, which was a busy night and immediately walked into a cluster of people standing at the door. The wait area was full and we barely squeezed in. When we got to the hostess, we weren't even acknowledged. We stood there for five minutes while a young lady was pecking away at the register buttons and not once did she say she'd be right with us. Then, a woman came and finally asked our name and party size. By this time, I was already turned off. We got seated and our waiter was extremely pleasant. He would be the only reason I give this place 2 stars. He was so sweet and attentive. He made up for the lack of customer service we had previously encountered. Now on to the food. This is not your traditional Japanese hibachi place. Not only do you NOT get noodles with your hibachi meal, you also have to pay $2.50 if you want mushrooms!!! Aside from that, the shrimp sauce didn't even taste like your normal shrimp sauce. The lava fries were \"OK\" nothing worth having again. And to top it off, the fried calamari doesn't even look like calamari! They looked like fish sticks and even had a fish texture. Call me crazy but, aren't calamari typically ring shaped?? Moral of the story, if you're looking for your traditional Japanese hibachi, this isn't the place!"], ["Mike Henry H.", "This restaurant has habachi style food. There is only one grill you can sit at that only holds three people. They have another grill that is unoccupied by customers since that grilled is used to cook the various customer's habachi food on it. I ordered the calamari and white fish from the habachi menu. The squid was soft and wasn't chewy. There wasn't really any flavor to the squid and it tasted very bland. The white fish was bland as well. Not really tasty at all. The miso soup was good. The salad was good with the dressing. It had a different good taste that I haven't ate before from the other Japanese restaurants I've been to. The fried rice was okay but not up to par with other fried rice. The vegetables in the habachi didn't taste that good. There was no sauces to dip in that you would be normally a custom to at a habachi restaurant. I ordered a rainbow sushi roll. The sushi wasn't really that fresh."], ["Theresa P.", "Just had the soup and it was delicious. The salad with ginger dressing was kind of boring but we didn't go for the salad. Our server recommended the shrimp and scallops. We watched the owner/ head chef whip it up in front of us. He said the key to cooking scallops is to not over cook them. He made them to perfection. The flavor off the grill with the seasonings he used blend perfectly. Lunch was delicious. If I lived in town I'd be a regular at this place"], ["Kari R.", "We just recently discovered this place and love the food.  The hibachi style dishes have always been cooked perfectly (filet mignon and shrimp) and the sushi is amazing.  Great attentive service.  Definitely recommend it.Favorite Japanese in Jax for sure."], ["Robert H.", "Have lunch here all the time. Great staff and owner Tony knows his stuff."], ["Ben R.", "Sushi was good but not great. Seated fairly quickly but took over 25 minutes to bring out the order. Chef did apologize for the delay, but got the impression the order was misplaced. Maybe hit them on an off night. Server was friendly but not too attentive. Wouldn't go back. Wasn't a bad experience but there's better available."], ["Becky H.", "I've driven by Hana Yori more times and possible to count but stopped in because of the Yelp reviews. Hana Yori is a very nice little spot to check out. With only one hibachi table and maybe around 10 tables, it isn't a huge place. The atmosphere is great and they are very welcoming/attentive. The restaurant is run by an authentic Japanese couple and it shows in their food. Everything ordered was good. I really like the Hana Yori roll and can't wait to try more!"], ["John M.", "This place is great! Been here 5 times in the past month and will continue to come back!"], ["Brentley S.", "For date night or filling inexpensive lunch Hana Yori is your main man for hibachi that won't break the bank. The food is tasty, hot and fresh, and if you're lucky you'll get a small wooden square to make your mark on. Variety of hibachi that comes with soup and salad for about $10. For those vegetarians out there the vegi tofu hibachi at Hana Yori rocks!"], ["B Q.", "After looking and looking for delicious Japanese in the area, we finally found it here. My husband and I were seated immediately, and offered quick service. The food was delicious as I had the hibachi chicken and he had the hibachi steak. Both meals came with soup and salad and all in all the food was perfect. My only wish is that they had more shrimp sauce at the table, our waiter didn't mind running back and forth to bring us more but putting it in the small sushi soy sauce containers is not enough for a huge plate of Japanese food.We will be back and can't wait to try the sushi and other menu items!!!!!!"], ["Alan B.", "Absolutely loved the food! Lava fries were great, as was the sushi. The service was a bit slow however and it was not very busy. I will go back again for sure."], ["Alex G.", "We were thoroughly impressed by this place. Excellent food, even better value. Definitely not what we would expect from a restaurant in a strip mall. The tampa roll is the best I've had since I left Tampa Bay."], ["Kelsey W.", "I'm only giving if 4 stars because the forgot my napkins on my Togo order haha, but seriously best sushi and service around. I've eaten in 3 times and taken Togo at least 4.  Every time our order is spot on.  Not to mention the restaurant is always clean servers always polite and timely. First time we sat at hibachi grill and the owner was the chef he is awesome and very friendly!! Thanks Hana Yori you guys rock!!"], ["Victoria V.", "I will definitely be back! We went to try this place on a whim and so glad we did! The prices are great, the service is very friendly and the sushi was delicious! For a Friday night, we didn't have to wait long for a table at all. The lava roll is my personal favorite which is a California roll with a spicy crab salad on top and for 6.99 it's a great deal!"], ["Nate M.", "I just got off work and to me there is no hunger like after work hunger. I called up Mimi I. and she just happen to be hungry! She said she was nearby and craving sushi. I recline my chair in my car and start searching Yelp until she gets here. I was at the Town Center and of course there's Bento, Sushi House, Sake House....booorrring. I stumble across a place called Hana Yori. 4.5 stars, review highlights: Lava fries are amazing! (checks out picture of Lava fries, ok ok), Reviews: My friend Becky has been there (I didn't even know she used Yelp, ::adds her as friend), Morgan H. says: \"you won't be dissappointed\" and I trust Morgan ::fist bump Morgan! Mimi finally pulls up and of course...she wants to go to Bento or one of the sushi houses, I insisted on Hana Yori and we hit the road! My GPS got me lost, but eventually I saw the light. Hana Yori is tucked away in a lil shopping plaza on the right side, right after the Alahambra Dinner Theatre. We get in and get seated. My attention immediately shifts to the walls. They have these little wooden \"placards\" that you get to custom \"sharpie\" up. Then, after your done eating they will stick it up and you'll be in their Wall of Fame. I couldn't stop looking at everyone's designs and thinking about what I was going to put on my little wooden panel. The lava fries are the truth! Next time I would skip everything and get 3 orders of it. If you've had Carne Asada fries in California this is the Japanese version. It's just shredded crabmeat, like a shrimp sauce, and french fries. Don't let the simple ingredients fool you, because with there powers combined will blow your socks off! The owner came around and I basically interviewed him. I told him how surprised i was that the Sake we ordered was only $5.50. He said they want everything to be affordable. He told me that the couple beside us, he's been serving for 10 years and when they came in they don't even need menus. I asked him how did you get the idea for the placards on the wall? He said that he wanted a way to get the community involved (which is genius when you see it, its like leaving a piece of you in the restaurant), he said that he had over 3,000 placards to put up!  He told me the different meanings of Hana which means flower, one, victory, or heaven. Yori I will have to fill you in later cause I forgot and there closed today lol. I will update this as soon as i can. The food is great, prices are perfect, the ambiance is legit, the owner is cool and he really cares! What more can you ask for? and get the damn Lava Fries!"], ["Jay K.", "Dear customers, the owners are not Japanese. They're Korean."], ["Michael C.", "Great prices for good quality sushi.'Staff is great. Amazingly soft octopus, which is hard to do.No pun intended.I'll be coming back."], ["MaryAnn J.", "It's a nice, clean looking place for a casual dinner with friends and family. When we walked in, we were greeted by a nice lady in front. We told her that we wanted to have dinner at the sushi bar, she said no problem, but then took us to this table by the corner near the server station. (????) we quietly sat down, ordered our food, soups and salads came, everything was great until we've overheard some of the workers there talking, seem to be talking about us, because of how we dressed and how we looked and what we ordered was cheap (hibachi chicken and hibachi vegetable and some other sushi rolls). I was very offended because it's not like I'm a rich college student or anything. It's not like I wasn't going to tip them at least 20%. The entire restaurant was not busy at all. In fact we were one of the other 4 small tables they had. What grossed me out even more was that I accidentally watched one of the waitstaff made salads with BAREHANDS. This point I wished I didn't eat the salad they gave. Food was alright, the chicken was too salty and hard at one point. I don't know why the hibachi vegetable was charged the same price was the chicken. Does tofu cost the same price?Anyways, this experience wasn't what I was expected from what others said. I wouldn't come back to dine in, probably, MAYBE get a take our over the phone."], ["Lori G.", "Sit at the bar...Tony will entertain you with his bright smile and charm.  Great food.  Great prices.  Getting Eric as your server is an added bonus.  First time visitors...don't forget to leave your mark on the wooden wall."], ["K U.", "We eat at Hana Yori at least once a week sometimes more and the food is consistently very good. The service is always exceptional too.  I like that instead of having to get the entire hibachi meals, you can order the hibachi meats as sides. (On the back of the menu) We always get sushi appetizers then the side hibachi shrimp (I get the filet steak, it is awesome!) and a side of the grilled mushrooms and it is plenty! Looking forward to our next trip!"], ["Jeff P.", "Just a quick update they now offer soup and salad when ordering there is a min amount you must spend to get the salad for free its not that much and I order two rolls and it always covers it. They have also added more sushi rolls and the crispy Philly is very good and I am slowly making my way through the rest. Once again I recommend Hana it food and service is always consistently good."], ["Erikka N.", "Very good sushi, very friendly staff!! You can create your own roll too!"], ["Robby D.", "One word amazing!!!"], ["Lindsay B.", "Yelp! to the rescue, yet again. Boyfriend & I were desperately seeking to fulfill a sushi craving while on vacation in JXV. We opted to give this little gem a shot based on its outstanding reviews.    We walked in and were greeted by a small yet friendly staff in an immaculate, modern interior. Off to a great start.   I quickly placed an order for the infamous Lava Fries (holy moly!) and began to peruse the offerings on both the sushi & hibachi menus. I settled on the Lava Roll and Spicy Tuna Tempura Roll (I think that's what it was called). Boyfriend got hibachi chicken. About 10 minutes later: the moment of truth...   I'm not exaggerating when I say that every single bite was nothing short of perfection! Seriously. (The artfully crafted plate presentations were an added bonus.)   Boyfriend asked for mustard sauce and the waitress seemed a bit perplexed. The head chef overheard his request & quickly chimed in that he could make something up on the spot that would taste like mustard sauce. We both started to decline politely, not wanting to trouble him...but before we could respond he was already heading over to our table whisking up a small bowl of ginger dressing & wasabi. Sounds weird, but the flavor was unbelievably spot on! This man was a true pro...knowledgeable yet unpretentious. He smiled as we both delighted in his spur-of-the-moment creation and simply said: \"You like it. That's all that matters to me\" and off he went, back to the grill.   Boyfriend & I spoke very little between bite after bite of sheer sushi/hibachi bliss; pausing only to share knowing looks of \"OMG, this food is fantastic!!\"    The one & only drawback: We don't live closer. 5 stars!"]], "Fusion Sushi": [], "Kazu Japanese Restaurant": [], "Crazy Sushi": [["Lorine W.", "The best lunch deal for sushi on the southside. There are other places but for the price this place is the best!For $7 you get two basic rolls off a pretty good short list, salad and soup. You cannot beat that in my opinion.  I would have taken a picture but it was so yummy I ate it all!The salad is always fresh and crunchy. Shrimp sauce is also flowing! Staff is nice and attentive and service is fast. Unless you are going to a big sit down place for your meal this is the next best thing you could do. Believe me you will not be disappointed."], ["Jimmy M.", "So I ate here the other day because of the great reviews they had on yelp. I had the seaweed salad and the chirashi bowl. I love to eat sushi and this place didn't disappoint me. The seaweed salad was very tasty and not too hard to eat. Most places the seaweed is really hard to chew. I five that a 9/10. The chirashi bowl listed that it came with 16 pieces of sushi. I thought to myself.. wow that is a lot. Turns out they cut a normal size sashimi into 2. It was still very good. The salmon tasted really fresh. The presentation could look nicer. That's about it."], ["Nichole H.", "Great sushi :) Yummmay!"], ["Mandi R.", "Went here for the first time yesterday on my lunch. The lady up front gave me some suggestions when I told her it was first time the rest. My eel and avocado roll was amazing. They forgot the spicy mayo, but it was still good without! Will definitely be back soon!"], ["S B.", "Service was prompt, servers were attentive & nice. Atmosphere is casual & relaxed! Ordered my food, came with soup & salad that were out to me in less than 5 minutes & the rest of the meal kept coming in perfect timing! I ordered some sushi & a few rolls & the waitress asked, \"would you like shrimp sauce?\" Ummmm.... my mind quickly raced.... What is this shrimp sauce you speak of? I said, \"yes please!\" Okay the sauce is the most delicious sauce there is to go w/ some of the rolls! If you are here ask for a side of shrimp sauce it's on the house! Great experience! When I'm back in the area I'll return to Crazy Sushi! By the way the food tasted fresh & was delicious!"], ["Zarir M.", "Road warrior love sushi. Eat sushi every place you can imagine. Warrior like this place. Freshest sushi warrior ever have. Nice service and price for warrior wallet. Me love this place. Warrior Be Back.Warrior came back two times, Warrior very happy again"], ["Mike Henry H.", "Sushi is good but fish isn't fresh. I would probably recommend going to another place that has better sushi. They offer free miso soup and salad for lunch."], ["Michelle B.", "Love, love, love this place! I've been going to Crazy Sushi for years now. One of my favorite sushi restaurants in Jacksonville. The homemade ginger dressing they put on their salad is like no others. I used to buy it separately for my own salads I make at home since its so good. There's so many delicious rolls to try. The Cold Roll is very refreshing since its wrapped in cucumber. I love the sushi sandwich since it has a little bit of everything (spicy tuna, eel, salmon, avocado) that's layered so it's not your typical roll. A few other good ones are caterpillar (if you like fresh seaweed), Florida roll (cooked), spicy octopus, EST roll, and Snow White. There's so many other ones but those are just a few that I order on a regular basis. I definitely recommend trying Crazy out if you love Sushi! You won't be disappointed."], ["Rachel D.", "If you love Japanese food this is the real deal. They're sushi is so freakin delicious I swear it sets it apart from all other Japanese restaurants I've been too. I recommend their grilled salmon teriyaki with  either steak, chicken, scallops, or shrimp. Get the combo so you can try a little of everything. It's grilled to perfection and the teriyaki sauce omg it's perfect. Not runny or too thick. You can really savor with each bite.I have been to this restaurant for a decade now and I have seen many other restaurants come up but none are as good as this. Plus pricing is decent. I can't go on about the food because I have tried basically everything and the whole menu is just that good. They don't have a cooking show apart from other Japanese restaurants but their recent extension improved the place overall. Trust me from a Japanese food addict. If you want the best sushi in Jacksonville, this is it!"], ["Sarah D.", "This is my favorite sushi restaurant in Jacksonville! I have yet to find a place better than this. I always order the Crunch roll and a spicy tuna roll while my husband orders the spicy red rose and sakura rolls. We typically start off with clear soup and salads with ginger. Crazy Sushi is always busy but I have never had to wait to be seated since they expanded....which makes my experience even better when i go.  The wait staff are very pleasant and the sushi is always made exactly how we ordered it and quickly. We even took our French exchange student here and the waitress was very patient as we had to translate what was in the rolls to out student. She even brought other diners orders to show her what each looked like. We go here at least once every other week and I don't see that changing any time soon."], ["Jennifer W.", "Fresh sushi, clean atmosphere, friendly wait staff."], ["Ryan C.", "Order pick up quite frequently from crazy sushi and my girlfriend and I love it. Dining in is great also because they always have enough staff for the business to operate smoothly with great customer  service. My go to sushi place  near my house."], ["Stacey H.", "Been my go-to for years.  Best sushi and hibachi."], ["girl a.", "The food was average. Disappointing because of the numerous reviews raving about the food. The portions were generous, but when the food is lacking in flavor it doesn't really matter the portion size was large. The service was slow. The waitress never asked how the food, offering soda refills after we finished. Only 2 other tables so I'm not sure why we never saw her."], ["M N.", "My family has been eating their top notch food since early years of spring breaking here in Jacksonville . Now as a resident, we can't get enough of Crazy Sushi!!! We have tried everything on their menu and nothing has disappointed us. Very friendly staff whether dining in or taking out."], ["Lisa C.", "This is our go to spot for Sushi in Jacksonville. The food is priced well. The food is always great. And you really walk out of there with a full stomach and a happy wallet. We typically splurge on the edamame and the gyoza and two or three sushi rolls. The only thing I feel they can improve on is the service. Nearly everytime we go we have to flag down a server when/if we need something.. Being regulars this is really an annoyance."], ["Robert M.", "My server was very prompt, nice and even helped me with my order. I had the Jaguar, Tampa Bay and the Nobody Home rolls. The Tampa Bay is baked and the Nobody Home is tempura deep fried. It was my favorite of the three. My only tip is to make sure to eat it first as my last two pieces were too cooled off and had a stale bite to them.  But the first part of the roll was delicious.The only downside was that do not have any baked muscles and I was craving muscles."], ["Nhi T.", "Excellent sushi!!!!! Enough said! It got a 4 star rating due to awkward service. Had multiple waitresses ask the same question over and over....and we had no idea which sushi roll was which! But it was good! Also, soup and salad is free! :)"], ["Jeff T.", "Crazy Good Food - great fresh sushi selections - great ala carte choices - great meal choices! Staff are very nice and efficient."], ["Jen R.", "Some of the best sushi I've had in Jax to date!PARTICULARLY accommodating to large groups. Any time my friends and I have a birthday, this is our place of choice to celebrate. Happily and easily takes care of groups of 16+. Everyone is always pleased with delicious food and fantastic, friendly service! Some of my faves are the tuna tataki, and the salmon skin rolls!"]], "Sake House": []}