{"Green Papaya Pan Asian Cuisine": [], "Rice Bowl": [["Danette L.", "Used to come here when it was Chan's.  This is much better.  Lighter tempura batter so you can actually taste the meat inside.  Fast friendly service"], ["David F.", "Thought Chef Chan was the best Chinese in Jax but not anymore. Rice bowl is fresh delicious and the service is great, this is my new go to Chinese."], ["D. F.", "We are from out -of-town and found this restaurant on the net.    If we get back in town we will be back.  Good menu selections, attractively kept.  Excellent service, and excellent food."], ["Sam R.", "Greasy overpriced food here. We went based off all the great reviews, but it was a huge disappointment."], ["Jim C.", "Had a really delightful meal there, recently, and just before closing, to boot. Attentive service, huge portions (the size of the shrimp, scallops and other seafood was equally impressive), and decent pricing make this a place we'll visit again the next time we're in the area. GREAT spot!"], ["Magen Z.", "Our visit began a little rocky when we walked through the door and were given the one finger up, wait a moment acknowledgment while they hurriedly took to-go orders. It wasn't long before a server approached us and we were seated. After a few minutes our drink orders were taken, it seemed like it took an unusually long time given we were one of three tables but we were decided on staying. After placing our orders we  sat back and watched as everyone hurried about, we noticed the food brought to the other tables and had already decided we would be back to try other dishes that looked and smelled amazing. Several tables came after us, it seemed we had come just in time. When our food arrived one of our orders was wrong, chicken instead of shrimp, we did send it back. Not only did our serve handle it very well but another server (assumed to be senior or possibly management working the floor) came to check on us, made sure I got a knife I had requested and made us aware they had many new team members and they were still in training. Quickly our proper order arrived and we continued to enjoy our meals. My singapore mei fun was very good. Surprisingly when it was time for our check the more senior server/manager? brought it to us, informed us she had double checked it for accuracy along with giving us a discount for our \"trouble\". We were impressed with the way things were handled, along with the quality of our food. We will be back!"], ["Yihang Y.", "We ordered Fried Tuna roll, jumbo shrimp, beef pad Thai and chow fun Noodle. The food is super yummy!!"], ["Alexander H.", "This place was amazing! We had the Curry Casserole and Thai Basil Chicken. Both I will get again along with other things on their menu. The atmosphere is slightly romantic with white table cloths and roses on the table. Great staff that greats you and waits on you. The kitchen is super clean. Our last table had a view of it and everything that came out looked awesome!!! The drinks were a little expensive but my wife got the cheapest wine and it was really good. I had the house saki and I have to say it was better than most. We go here at least once a week now. One of our favorites!!!"], ["Royce K.", "So happy that this restaurant is near & fairly priced! better than Bento's & tastes even better!"], ["Donald H.", "Outstanding service and the food is fresh and delicious.  Would highly recommend this restaurant.."], ["Ava L.", "Fantastic food and service! They make you feel at home and their fried rice is amazing and made fresh. The garlic chicken was spot on. I'm glad I decided to stop here for a quick lunch break. I will most definitely be back!"], ["Joan C.", "We heard about this restaurant from friends, worth the drive from the beach. Was a delicious dinner.  We all tried soups to start- all really good, but absolutely try the wonton. If you like Asian noodles, you'll love this place. The owner suggested a thick noodle dish (odan?) was wonderful. One friend had shrimp/scallops, was also great. Everyone was very happy and we all ordered very different dinners. We will all be back, service-, cleanliness, price, and good worth the trip!"], ["Elaine C.", "Rice bowl open every day , they use fresh vegetables. They use jumbo shrimp ,good beef and steak. The chicken is all white meat. All sauces are homemade. Gluten free menu. Very friendly environment. Anything the customer request they make it."], ["Andy W.", "Food was excellent, quiet atmosphere and creative dishes made to order. Their servers were very friendly. We ordered egg rolls which were crispy and light and came with a terrific home made duck sauce and spicy mustard."], ["Kathleen H.", "Red Curry Chicken was an amazing blend of sweet coconut milk and spicy curry. Veggies were crisp and fresh. Loved the fried rice which was light with no oily after taste. My friend had the Cashew Chicken which was light and very fresh. Miso soup was also very good. Definitely will eat there again."], ["Dan S.", "Rice Bowl might be the best takeout in Jacksonville, full stop. We have eaten inside as well, but the takeout value is unmatched. The pad thai is three (delicious) meals itself, and everything is nicely packaged. The roti,  spring rolls, sesame chicken, and red curry were all fantastic as well. Can't go wrong here."], ["Todd A.", "Wow their food was awesome!  Lets get my negative (but not actually bad) comment out of the way.  If you like spicy food, it's lacking.  However, that can easily be fixed with a side of sriracha.  Not everyone loves spicy so it's probably a good thing!  Next their bang bang shrimp was great!  It had fried bean thread noodles on it to add some crunch. Their fried rice has a scent and flavor that I've never tasted in the US.  When I was in India, I had some indo-chinese food there.  I recognize the flavoring from the indo-chinese food.  I noticed this \"flavor\" in the fried rice, and in the Malaysian roti.  I was assuming that the roti might just be pre-made frozen ones, but it seemed very high quality and fresh, flakey!  The curry platter was very tasty, and creamy.  Each dish was flavored perfect, and nothing needed changed (unless you want spice).  I was told that the owner created their recipes, and I think it's possible that the owners wife came to each table to ask what we thought of the food.  Not only did she ask, she made conversation.  Two other tables also asked about our food.  It seemed like a very social and friendly environment.  Before coming here, I initially thought \"why go to a non-buffet when there is much more variety there??\".  I realized last night why.... because RICE BOWL's FOOD is soooooooo much more flavored!   Don't go for quantity when you can instead have quality!  Our waitress was also very friendly!"], ["Alban B.", "Great food at an awesome price. Love all the Chinese and Thai dishes. Wife and I started coming about 3 months ago and haven't stopped coming since. Really friendly wait staff. 5 stars!"], ["Kevin W.", "Great Food and service. Not your typical blah Asian food. Fresh ingredients. Love the Egg Rolls"], ["Alison A.", "Very nice atmosphere,  excellent service, inexpensive food and it tasted great! I highly recommend!"]], "Buddha Thai Bistro": [["Erin K.", "Good service, nice atmosphere, great good. I was with a large party, We ordered some appetizers of spring rolls and crab rangoons. I had a chicken curry and was able to choose the amount of heat I wanted. My favorite Thai restaurant so far!"], ["Ryan D.", "Buddha Belly is a great Thai restaurant! The ambience inside made me feel like I was actually in Asia, rather than in Florida. Pretty nice. The waiter we had was very helpful and nice, except she accidentally charged my card three times that evening! Everything was resolved immediately which shows great service. The food was very good! I had their Tom YumSpicy soup with mushroom, tomato, onion and bell pepper. You can order the soup with Tofu, Chicken, shrimp, or seafood combination. I had the shrimp along with the soup. The soup it self was very flavorful and was a decent amount per serving. As for main entree ordered their Panang curry which is curry infused with coconut milk and garnished with holy basil, bell pepper, and lime leaves. You can order the curry with different combinations as well such as shrimp, tofu, seafood, chicken. I had the tofu. The curry is served with rice. The curry it self was amazing, loved every bit of it! Buddha Belly is my new favorite Thai restaurant in the Jacksonville area. I highly recommend this place."], ["Andrea N.", "We placed an online order on Valentine's day, get to the restaurant and they notified me that they had stopped taking to go orders 1/2 hour ago.  When I asked about how to be reimbursed the hostess said we would have to contact the online agency and then said \"who's next\" like the soup Nazi from Seinfeld.  They didn't care one bit about the inconvenience or my starving belly.  It's a shame because they typically have good food, however it's clear management was not prepared for valentine's day, and there needs to be a better process in place if management continues to use online vendors to place orders that are not directly tied to the restaurant.  Based on the poor customer service and inconvenience I will not be coming back as there are plenty of other thai restaurants in the area that I'm sure would be happy to have my business."], ["Anton G.", "Where to begin. This place is excellent in every way except for the food. I've never seen a restaurant so well capitalized and place so little emphasis on authenticity and food quality - which is ironic given the note from the owner about it being the most authentic there is. They have knives laid out at the tables - which is a big no-no in thai restaurants but this was the smallest of there transgressions.The coconut soup was a disgrace and tasted like it came from a can. The chicken, and everything else came in huge chunks making it impossible to eat with a spoon. For the mains, my girlfriend and I ordered green curry and pad thai. The pad thai had a cool concept where it was incased in a thin omelette but the noodles were thick, the tofu was mush and tasted like the noodles, and the whole thing was drenched in fish sauce. Fish sauce is central to thai cuisine, but in moderation. The story doesn't get better with the green curry. The \"jasmine\" rice which didn't have the slightest hint of jasmine was bone dry and the eggplant was completely under cooked. It's almost impossible to over cook eggplant. Leave it in an extra 5 minutes if you're not sure. Furthermore, there were all these unnecessary flourishes like cucumbers cut in the shape of stars and a rose made out of a radish. Who cares about stuff like that when your dinner isn't edible??Worst of all is that this restaurant is beautiful inside and the staff was very friendly and had great energy. Someone put a lot of money into making this place and just said \"F it\" when it came to the kitchen. I don't want to recommend anything specifically here, but to say that there are multiple MUCH better thai restaurants within blocks of this place could be the understatement of the year."], ["Yoniel F.", "My wife and I were on a late night Thai food hunt. We could not have been more disappointed in EVERYTHING about Buddha Belly. It started with the hostess, who's personality was that of a doorknob. We stood there waiting on her to greet us as she walked past us at least 3 times in what appeared to be an empty restaurant. Yes, we were there close to closing time but 45 minutes to get our food seemed more then ample. After spending a few minutes trying to figure out where to seat us, in a room full of empty tables, we chose to sit against the wall. The waitress quickly placed tap water on our table while the hotness was asking us what kind of water we wanted. Clearly the waitress was already annoyed! She wasted no time in asking us if we were ready. When we asked what she would recommend she appeared bothered and she went along with everything we asked about. She was an exceptionally poor waitress. The waitress never offered anything after our brief encounter in placing our orders. The food was marginal and presentation was non existent! Finally, the ambience was ruined. 10 minutes to closing they turned all the lights on to let us know it was time for us to go. The check was brought out to us shortly after our dinner was placed on the table. This was our first and last time dinning at Buddha Belly and we recommend it to NOONE!!! Sincerely 2 dissatisfied customers!!"], ["Marisue A.", "I have been going here since it opened. Up untill a year ago I would have said it was excellent.   The last 3 times it has been awful...cold food..you order a 3 and it is a 0. The food doesn't even look the same. they must have a new chef..I won't go back."], ["Jennifer S.", "service is horrible: WHY DO THEY HAVE 5 WAITRESS/WAITORS DOING NOTHING???AND ANOTHER JUST TAKING PHONE CALLS AND SEATING..?the most inefficient place i've been.will be treated poor here and will wait a long time before food is delivered.the ambience and decor is clean.the food is not authentic. a fusion for most part.try sala phad thai down the street, they are much better and authentic!!"], ["David C.", "Loved this place.  Highly recommended.  Great Thai place, and I have been to many.Out server was great.  Very helpful and friendly.  She made great recommendations.We had a number of dishes.  All were very good.  Happy hour is 3 to 7 every day.  Nice summer rolls.  A quick note on those.  Usually they have mostly noodles.  These had mostly lettuce and mint.  Some of the best I have had."], ["Andy L.", "I thought I have already reviewed this place, but I guess not.  Short summary.... Best Thai Restaurant in town.I've eaten in the restaurant and I've gotten it to go and it was very good both time.  I can't remember what exactly we ate, but we got a bunch of different stuff and everything was great.  When we ate in the restaurant, our baby was going crazy and the waitstaff was very understanding.I'll definitely go back and I'll recommend this to anyone who asks."], ["Amanda G.", "Great Thai Food!I have eaten here five times -all for dinner- the food is always great and comes out in a timely manner (even during their Thai New Year celebration), the staff is friendly and helpful, and the atmosphere is better that most. Each time I have visited Buddha's Belly I brought different friends, on every occasion they had a great experience too."], ["Patrick G.", "OMG.  Such a great place.  Fun people, great food.  TRY THE PRA RAM!!  They have tofu, soy shrimp, soy chicken... and it's all amazing (They have \"real\" meat, too... just not for me)."], ["Leah A.", "The restaurant & service was fine (nice decor, attentive staff,  good service, great presentation), but again, I think I will have to lower my expectations of restaurants @ Jax  Beach.   I am a big fan of AUTHENTIC Thai food & I definitely have my favorites.  But I've learned to judge my Thai restaurants by the tenderness & flavor of their Chicken Satay & Panang Curry.  The satay was a bit dry & my friend ordered the yellow curry instead which was OK.  I had to ask for the sauce tray to doctor it up.  I have nothing terrible to say about this place except that I feel they really \"Americanize\" their dishes here where there's not enough spice here or lacking in flavor there, etc. I hate when restaurants do that.  It is so unneccessary.   SO....2 STARS ** Meh, I've experienced better..... :("], ["Cameron D.", "All the filtered reviews for this place (5 currently) throw the other current 4- and 5-star ones into a bit of a suspicious light for me, so I felt the need to provide somewhat of a counterpoint ...I've eaten at Buddha's Belly 3 times (all for lunch) as I work nearby. Each time I've had some variant of beef curry (green, red, Panang).Well, the prices are up there - standard lunch runs (I believe) $10-12 plus tip, rather than the $6-7 that I was used to before moving here, but maybe that's just how the beach area rolls.The curry itself is pretty average - not particularly bland, but not as rich as I prefer. Portions are not great for the aforementioned price. The lunch special also comes with a soup, which, last time I was there, was some sort of creamy business that was fairly inedible; it just reeked of fish sauce. No-one at our table ate more than a couple of spoonfuls.And the service is iffy. Not sure how I feel about ordering Thai food from a extremely non-asian wait staff, but I suppose it is fancier than your average small-time curry joint.So, there you go. If you're hard up for curry, it's one of your only choices in the area, so expect to shell out a few extra bucks, don't expect anything super-amazing, and you'll be fine."], ["Megan B.", "This place is not very good. The service is slow and pretty incompetent. The food is not very good either. For Thai in the Jax Beach area, I much prefer Tuptim Thai, down near the Ponte Vedra area."], ["Jason W.", "My wife and I eat at Buddha's Belly approximately twice a week - either eating in or taking out.  Honestly, it is the best Thai food we've found in Jacksonville, and outside of a few spots in San Francisco, it is our favorite Thai restaurant all around.We typically order either Pad Thai, Pra Ram, or some kind of Curry.  The satays are good here as well.  Great sake prices on happy hour as well."], ["cigale b.", "During the weekend my girl friend and I frequent Budda's Belly.  Their food is normally very good.  Since TPC is going on in Ponte Vedra this weekend, traffic going home is some what impossible, so i decided to try a quick bite of food.  The restaurant has a lunch menu,  soup, salad, app and main on tray.  The service is fast at lunch, the salad came out very quickly and just a touch too much salad dressing.  The soup is always very good, fresh and hits the spot!  As far as the main on tray, the Phad Thai pork was sticky, no fresh veggies, warm and dried out pork.  I asked the waitress, what was going on with the \"Pork Phad Thai' she stated they cook the pork ahead of time and place the pork (chips, that's what they looked like)  on top of the noodles. The meal was bland and very bad.  Have had much better food else where! May not return."], ["Ariel T.", "The food is is fantastic! Start out with the Crab Rangoons or the Chicken Satay. For entrees, I suggest the Green Curry or the Garee Yellow Curry. If you are not a curry fan, the Hawaiian Fried Rice is a great entree. It is served in a half pineapple shell. Very cool! The inside is decorated nicely.  A great place for families, couples, singles, etc. They have a bar if you are just looking for a place to go for drinks. The staff is super friendly and very attentive."], ["Shaun M.", "Been a long time since we've had \"Thai\" this bad. Ordered the \"Belly\" appetizer. This was a sampler, and even the spring rolls were fried. Everything...fried. Ordered the Kahlua ribs out of curiosity. Standard, saucy braised (and lukewarm) ribs in an over-sweet sauce. Came with coconut rice which was decent. Wife had a tofu/vegetable entree. Zero presentation, dish was a mess of veg/tofu with a bizarre brown sauce. I'm not sure what this is, or who is cooking...but it's abysmal. Seriously, get a Thai cook. If you have one...you need a better one."], ["Connie W.", "I stopped in for a quick bite right before the lunch rush.  Got the Won Ton soup and Egg Rolls.  Okay, Okay, I know what your thinking,   \"Really?\" at a Thai place.  What can I say, I was in hurry and on a budget.  Both of the orders were good, nothing out of the ordinary, but for a quick lunch, I still didn't get out of there for under $10.  Their claim to fame is that they are an organic Thai restaurant.  Only one at the beach.The restaurant is very pretty and clean.  Upscale for the strip mall that it is in.  I was surprised.  The entrance are solid wood double doors with a designed glass inserted into the center.  The interior decor is just as impressive.My service was attentive and friendly, but I was there early.  I will have to try them at dinner and get back to you......"], ["Dawn N.", "Best pad thai"]], "Indochine": [], "Simply Tasty Thai": [["Jackie M.", "YummySurprisingly Fresh.I have not yet had a bad experience"], ["Linda J.", "This is the only Thai restaurant where you get free refills of your thai iced tea. Let that sink in...When you pull up to the building you're probably a bit hesitant. You will tell yourself that this will either be really good or really bad (hole in the wall). I looked at my friend and told her the same. But I also said that these unassuming places are usually the best. It helped that it was very close to our hotel and we were spent from playing on the beach all day.The food is delicious. Service was pretty good. The rice comes to you in the shape of a star which to me, it's all about the little things. Decor is nice and it's pretty spacious inside. I was a bit surprised because again, we didn't know what we were walking into. I'll definitely be back if I'm ever in the neighborhood again. We were both too full to order desert but they have a good selection!"], ["Misty S.", "Having lived in Los Angeles for 22 years, I have  experienced great Thai food. Living here, I've been looking for a Thai place for awhile. I can't say this one will be it. I tried the sampler for $9.00. Supposed to be veggie rolls, lumpia and crab Rangoon. Definitely NOT worth even $9.00 and the taste was extremely bland. My hubs got the yellow chicken curry with extra chicken. Meh. Again, just not a lot of flavor. We ordered take out, so I may give it another shot and eat there. However, for $28 for two items, I was not impressed. The chicken satay on the sampler looked really old, I almost didn't even try it. Nothing was terrible, but nothing was great.  either."], ["Jeremiah H.", "My friends and I go out for dinner every Tuesday as a group we are always looking for great places to dine. Amazing food and elite service.  Best Thai food I have had since actual Thailand.  Recommend the Duck and the Ribs.  The Egg Drop soup is out of this world.  The owner came out when we were eating.  Great personality!! Our server was simply the best since I moved to Jacksonville 10 years ago. I am torn about telling people about this place I want people to experience this AMAZING PLACE but want to keep this little slice of heaven to ourselves."], ["Melanie T.", "Love, love, love the shrimp pad thai!!  Try the soup with shrimp...medium!!!Definitely, hits the spot!!"], ["Ronald D.", "Pretty good thai food spot in Florida. I tried their fried calamari, tom kah kai soup, pad see ew and thai ice tea and all were good, I would definitly eat here again.The soup was a little watery then what im used to but still delicious and I think I ordered the cuo instead of the usual bowl fountain with the fire underneath that I enjoy but there will be a next time. If you like thai food this is the spot."], ["April S.", "First time here and we really enjoyed it. The perfectly seasoned papaya salad was nice and crunchy. Drunken noodles stir fried with just the right amount of oil to ensure they didn't stick together while not overly greasy.  The Larb was also very tasty. It was well minced and seasoned with a lime and herb mixture which didn't over power the meat. The pineapple fried rice was moist and mounted beautifully in a halved pineapple shell.If you are a vegetarian, give the spicy garlic eggplant and tofu a try.Dishes were well presented and service was attentive.Be sure to check out the artwork on the wall and the fun miniatures in the display case.We will return and try to save room for desserts next time:)"], ["Austin F.", "Simply Tasty Thai is doing a lot correctly. Fresh rolls were jam packed with some of the freshest veggies I've had in a while. Clean clear flavors.Deboned crispy duck was well prepared- crispy skin, succulent meat- sauce was a tad overseasoned- think it would be better with the curry sauce. Heat index was on point though (we ordered everything thai spicy)Curry was good- however all flavors were right at the threshold of too much, not the tightrope you necessarily want to walk. Salt was heavyhanded.Then the pad see ew. Spice level was there and portion size was decent for the highish price tag- but there was NO WOK SEAR at all- this one detail is what separates the ho-hum from the delicious- and they are missing the mark on this detail. Turn up your woks people and let those sugars turn brown and black- otherwise we can all do this at home. Dessert was banana lumpia- obviously frozen and then refried- not good.Overall- a decent meal for a higher than usual price-tag. The search for authentic thai continues..."], ["Ann Marie K.", "I would have never just stopped in here but because of Yelp we decided to give it a try. I am so glad we did! Wow what a hidden gem. The food was amazing. We order the #2 appetizer that gave us an opportunity to try things we wouldn't have. The Tom Yum soup was the BEST I've ever had. We stayed traditional in entrees with Se Ew and Pad Thai. The only suggestion I have is don't try to be cool with the heat. My hubby and I both love spice but my #2 was a usual #3 and his #3 had him sweating and beet red. The other plus was the team. They were funny and relaxed and knowledgable. This is my new Thai home."], ["Mona E.", "Delicious food. Nice atmosphere. Friendly wait staff. We will be back. We started with steamed dumplings and a cucumber salad. After my husband ate the last bite of the salad he said it would be worth the trip just to have that salad, fresh crunchy cucumbers with a perfect balance of vinegar, pepper flake, green onion and sweetness. Then he had a giant bowl of tom yum soup and I had choo chee with chicken.  We also ordered a side of roti bread, a flat bread that reminded me of a doughnut but it wasn't sweet. We shared back and forth arguing as to who's was tastier.  I can't wait to explore the rest of the menu."], ["Mitzi B.", "Simply Tasty Thai  is becoming a habit - a delicious undertaking that never fails to satisfy the hunger for a well-seasoned fire-in-the-belly (esp in this very cold winter weather)  Thai dining experience. Going thru the menu every time I visit , and Chef-Owner Nancy is always nearby to explain and encourage trying out new items.I am at 2 peppers with my preferred level of \"heat\" although I have family and friends who routinely order 5 peppers (Thai-Hot!!!) level. At any level, Nancy's cuisine spiced up with her home-grown herbs and spices spell Thai Knockout!!!"], ["Shawn W.", "This was our second visit to Simply Taste Thai. On our first visit we weren't wowed by the food but the owners hospitality was very inviting. So, we decided to give it another try.On our second visit we brought along a couple of friends. We were on a Thai Cuisine Mission... Appetizers, Dinner and Dessert. I was excited to try the Coconut Mango Rice, heard it was amazing. Upon our arrival we were sat by a stylish younger Asian women. (Here is where the train wreck started) I asked for a booth and lost our chance to have her as our waitress. Our new waitress greeted us with a blank face and a feeling of obligation to take our order. At one point she asked if we were ready to order and as my wife prepared to give her order, the waitress walked away. Upon her return 2 people in our party asked for suggestions. Her response was as boring as the misspelled menu. Shortly after we ordered, apps rolled out and were amazing, Crab Rangoon and Money Bags. My taste buds water as I type. (Guess I may still be hungry cuz the portions are SMALL.) As dinner arrives the wind was taken out of my sails. Their was a hair of questionable origin on my plate and in my food. Rather than ruin everyone's meal, I handed the plate back to the food runner and point at the hair. I sent it back and decided to share with my wife. The Chicken Pad Thai was alright. I'd compare it to cheap Chinese take out with a Thai twist. No worries though, I'm ready for desert. As I look up the waitress was pushing my check in my face. I asked to place my desert order and was shut down with finding out they had closed the kitchen. Ummmm, I thought they would have at least asked if we would like deserts before closing out our tabs. As we pay out, the over aged food runner returns. He asked us if everything was ok. I kindly told him I would write a yelp review. He pressed me to tell him how I felt about my visit. I declined and again said I would write a proper review. Long story short, he chewed me out for not wanting to write a favorable review. He also told me no one will care about my review. I sum the spot up as a low budget Thai restaurant that has Lemongrass or indochine     pricing. Step up your game and drop your attitude."], ["Cody S.", "This place makes some delicious Thai food! It has been my go to place for Thai for about the past year and not once have I been disappointed. If you are looking for great Thai food in this area, this is the place to go."], ["Ataya P.", "Eh, it was ok.  We were on vacation staying at the Best Western across the street and ordered for delivery.  But we were told they weren't delivering and we had to pick it up.  Bummer, but no big deal, we're across the street. I ordered the chicken pad thai, but they were out of chicken.  Really?! I ending up ordering the shrimp pad thai instead.  It wasn't horrible, but I definitely got heartburn the next day.  Maybe a little too much peanut sauce?  The restaurant looked decent and clean. No complaints here.  I can't say that I recommend it though.  Try it for yourself, maybe I was having an off day."], ["Annie K.", "I honestly live like a minute from here and finally decided to try it. My husband and I went in and sat at the small little bar in the front. The decor was great, lots of interesting pictures. We were greeted by a friendly woman (that I think was one of the owners) that welcomed us with menus and took our drink order. My husband got the jasmine hot tea and I got the lucky Buddha  beer because it sounded cool and actually was delicious! It was a light beer and very refreshing in a really cool bottle that I ended taking home. We were doing something light because we knew we were going to dinner tonight so we ordered a bunch of appetizers to try and get a taste of how their food is. We ordered the lumpia, spring rolls and calamari also The steamed dumplings. Everything was so delicious the calamari was so tender and the dumplings you could tell were homemade steamed to perfection  with a great dipping sauce. We also ordered the Spring rolls that came with a fresh cucumber salad in a spicy sweet sauce that were addicting.All the prices on the menu are very reasonable and the food looks amazing. There are so many things I want to try! The banana lumpia with ice cream for dessert sounds amazing! There was a lady that came out with dishes from the kitchen that talked to us about the food and told us that she makes it fresh just like in the Philippines. She told us the different ingredients she uses and described how she cooked them. It was really cool to hear about how everything is homemade because you can't really find that to many places. Simply tasty Thai is a great little spot that I think everyone should check out. The service was excellent the food is authentic and definitely worth trying if not over and over again. The small, intimate family feel you get from the staff is so comforting. I love places like that, you really feel appreciated as a customer to their business. So glad that we tried this place and we will definitely be back soon."], ["Chelly S.", "Still coming to this really great Thai place. I would recommend it to anyone. There is also a nice little Vietnamese joint called Pho Viet in the area that is also excellent. The neighborhood is really improving thanks to years of effort by the City of Atlantic Beach and local business owners. I see a bright food future for Mayport Road. Update: Simply Tasty Thai restaurant has expanded and now it has, shazam, ambience too. Since my last review, lots of people have discovered this gem. I am still giving it five stars. This place is one if the best eateries at the Beaches and may have the best Thai in all of Jacksinviile. Plus, they put Nam Sod on the menu, my favorite!!! Try it for lunch!Update: I went to Simply Tasty Thai for my birthday dinner with family on March 24, 2015 and had a fantastic meal. Everything was wonderful. This restaurant just keeps getting better! DO NOT MISS IT! UPDATE JUNE 2015:  The crispy duck is awesome!!! The nam sod is wonderful! Dining partners report that the shrimp stir fry is delicious!"], ["Jennifer S.", "Based on reviews we tried this placeIt lacks the depth of taste. Good ambience However the food lacks flavor and too salty.Either you feel like you are eating chunks of salt (everything is salty there) or re-fried spring rolls from second time around. I'd recommend going to sala Phad Thai on beach. The most authentic Thai cuisine you willl taste. Best pad Thai at sala Phad Thai!"], ["Meanole M.", "Another great meal here. Pad Se We, Green curry, Ginger chicken and a couple of appetizers.  It was all so good. Not too crowded on a Saturday night. No wait.  Service was very good."], ["Kristal C.", "My top Thai spot in Jax. Always nice and quick. This is my go to Thai place. Try the Choo Chee! You won't regret it."], ["Joel C.", "OMG ... Had a fantastic meal tonite with my best friend. We have been regulars for a few years now. This is a family run place that is clean, fresh, fast, and VERY good. Located on mayport rd. In front of the Navy Exchange/Comm. If you think you know good Thai food. Try this... If you never have tried Thai food. Try  this... This place is very, very good. We ordered our usual ap ' Thai sampler' and a new item 'Crab roll' .Entrees where new item's 'curry trio' and 'beef short ribs' both of us had brown rice. Pics can't tell you how good it was. WOW... Service at this place is wonderful. They have a hubby and wife team. Very knowledgeable and polite. Owner ' Nancy' is a wonderful cook and talented artist. Her art work is all over the walls.I hope after reading this y'all will try Simply Tasty Thai. Awesome Food."], ["Frankie A.", "Walked in randomly. ..best decision of the night...customer service was key to this night....out the gate they were very nice and welcoming and not in a stuffy condescending way but im a genuine hey we appreciate your business and by that we are going to show you a good time...Chris and his staff were very nice and insightful on the menu and were very friendly. ..now on to the food...it was BOMB!!!...very good ...I had the pad se ew...very good...def coming back!!!"], ["Shawn S.", "I grew up around Filipinos and lived in PI for a year. This is some of the best Filipino food I have had in a long time. The pancit was amazing and the lumpia to die for. Great service, great value, and great food."], ["Audiejohn P.", "Great food. Great portions. Can't go wrong with this place. The padthai and pad seew are great noodles and my personal favorite is the peanut sauce (rice or noodle). If you love Thai food. You should check this place out!"], ["Charlene C.", "Delish!"], ["Brian D.", "This is on behalf of my wife and her parents.They all agree that everything is perfect and they especially liked the attention of the owner and the fact she recalled my name MONTHS later after I had been there. I'll certainly be back next time I take a break from Vermont and head to Jax Beach! Thank you for the extended hospitality!Mr. Brian!"], ["Cristina V.", "They are in the process of expanding! Still a great little family-owned restaurant, still consistently great food, same portions, same good prices."], ["Jen R.", "Very small, very charming! I've been eating here regularly for quite a while now, and have never been even remotely disappointed. The food is fantastic, definitely the best pad thai in Jacksonville, in my opinion! The servers are always exceptionally sweet and attentive. They have recently opened up the second half of the restaurant; I love the decor and atmosphere!One small complaint, and something for new customers to be aware of. When you ask for water, they will automatically bring you a bottled water. If you want that free cup of tap water, make sure you specify."], ["a d.", "Went here for lunch last week due to all the good reviews.  Was not impressed wirh the food. Many people at the restaurant ordered the buffet,  but it didnt look appetizing to us. We ordered off the menu. Ordered tofu in a panang curry sauce.  No veggies other than slivers of cabbage almost non existent.  The curry taste was good but the vegetables I was told would be in the dish was not there. Also, we ordered the pad thai, also no vegetables other than rhe old hard carrot garnish. Portion was smaler than expected too. The soup we ordered was loaded with large pieces of lemon grass which are not edible. Waitress was ok but seemed bored.  We will stick with Sala Thai and the others around town. This place has potential,  I hope they see how good it could be."], ["Seth B.", "I've eaten here a few times and must say that the Pancit is amazing. However, my most recent visit and this review reflects the poor service. I ordered a coke, lumpia, and pancit. The glass served with the coke was chipped. Ok, no problem, I'm still going to enjoy my coke. The pancit arrived in good time but the lumpia never made it. I realized I didn't have any utensils to eat my food. The pancit was brought to the table by someone who worked in the kitchen, and he did not stop or hear me ask for chop sticks. So I waited. I made eye contact with both waitresses and raised my hand to get their attention. Neither one responded. When a waitress finally came over, she didn't notice anything wrong with the situation...a full plate of food with an increasingly annoyed customer. I asked for chop sticks and I received them. After ten minutes, I was too pissed off to finish my food. I asked for the check, which included the lumpia. It was removed after I pointed out that I never received it. The waitress didn't seem to care. Fine, here's your tip in pennies and a promise that I won't return. The finest food in the world will always taste horrible when combined with poor service."], ["Tracy M.", "My husband and I recently moved here and will miss our favorite Thai place in San Antonio very much. We were on the lookout for a new spot and tried this place. We ordered pineapple fried rice, pad see ew, and pineapple curry. We ordered all of the dishes \"hot\". I won't order the fried rice again, it was kind of bland. Pad see ew wasn't bad but the pineapple curry was REALLY GOOD! It was nice and spicy and the vegetables in the curry were delicious. If we do go back, I would order that and try some other dishes."], ["Javier G.", "Food was excellent, served fresh and hot. My husband had the fried chicken and I had the pad Thai. We would recommend this restaurant to any one. We will come again on our next visit to Jacksonville."], ["Michael Hosto H.", "Really really really really really really really really good food. Healthy. Nice owners."], ["Lucas J.", "Married a Filipino bc I love the food so much, and I've been to the Philippines twice. This place is called tasti Thai but has many Filipino dishes most being the closet thing I've had to my wife's families food. Everything on the menu is good and made fresh. I would recommend this place to anyone."], ["Janet P.", "My friend and I tried the Chicken Pad Thai and Curry Chicken, both were good, we ate everything and left satisfied. The Curry Chicken dish was made a med. spicy and any spicier and we both agreed we probably wouldn't have enjoyed it, personally I'd like something a bit more on the mild side. The Pad Thai was pretty good but I wouldn't say it was the best I've ever had, the chicken in it seemed a bit dry.The two ladies working were both friendly and gave good service (I think the lady manager was interviewing someone at the time at the table across from me, which felt a little awkward). The place could probably use an update and is a bit small...perhaps 10 tables in the place so I'd recommend this as more of a take-out spot. It was a smidge weird walking by all their stocked condiments on my way to their one shared bathroom."], ["Addie M.", "Everything here that I've tried is great.  I've gotten authentic Thai while living in NYC and this place rivals any I've tried.  Everything is cooked to order and is always hot and fresh.  Amazing yellow chicken curry. Wonderful flavorful sauce, perfectly cooked chicken and veggies."], ["Andres B.", "Best Pad Thai in Jacksonville Beach area, tried my fare share around and there is no comparison. Friendly staff, always happy, great service. Great environment and always busy without delays in service."], ["Brian W.", "Just what it says.  Tasty Thai.  Beware- when they say it is hot, it is hot!"], ["Katie P.", "I can not believe that I have gone on this long without reviewing this amazing little place.  I absolutely love Simply Tasty Thai.  My husband and I were introduced to this unique little place through some friends.  The food has never disappointed us.  We took my parents there once when they were in town a few months ago and my dad has not stopped asking for us to take them back when they're in town next.  As for the food, it is superb.  We have been there many times and yet I continue to get the same entree because it is so tasty.  I love the Red Curry with chicken, made Thai hot.  Now don't go ordering your food Thai hot unless you LOVE spicy food, because it does have a KICK to it!  The sauce is so tasty that it explodes in your mouth.  The entree is served with white rice, but I tend to opt for the brown rice to pour my delicious curry over.  I also recommend getting an order of the Roti (Thai version of the Indian naan)-For an additional $1.50 you obtain an additional vessel, which is delicious on its own, to scoop the curry into your mouth!  The owner is so nice and often comes out to say hi and make sure that the food is up to par.  On nights where I feel lazy and I don't want to cook, I have even been known to drive about a half hour to pick up this tasty meal and drive it home to enjoy while in my pajamas!  I don't believe that you can go wrong eating here!"], ["Marjie C.", "This used to be my mom's old Filipino restaurant (Pampanguena) in 1997-2002...Anyways, Thai food is starting to become a big thing in Jacksonville. Knowing the owner, I know the food is good. I don't come down here often but when I do, I know what I'm getting. Definitely come try it out, especially if you live around the beaches/Mayport Naval Base area!"], ["Food Lover S.", "Thank you for all support."]], "Lime Leaf Thai Restaurant": [], "Maithai Restaurant": [], "Lemongrass Thai Restaurant": [["Leah R.", "Very good food, service and presentation.  The bangin shrimp were good and the mixed vegetables with chicken stir fry were as well."], ["VJ N.", "I have been to my share of Thai restaurants in JAX and this is not the best or worst. For the price you are paying, I am definitely on fence.  I personally did not liked the taste of the food that had ordered ( I ordered pad thai ) and my wife had yellow curry fried rice and it was okay."], ["Angela D.", "I love this restaurant. I have never had bad service and was actually a bit shocked to read some of the reviews. I have probably been close to ten times and have always had exceptional service. The food is always fresh and full of flavor. I have always had very good cuts of lean meat. I always get the amount of heat I want (usually hot) I can't comment on it being authentic as I have never been to Thailand but for what I have had, I am very happy with it. The decor is nice. It's never too loud and everyone usually looks to be enjoying themselves. I will continue to go here. FYI... The appetizer sampler is a must!  The crab Rangoon is better than anywhere. The spring rolls and summer rolls are great too!"], ["Kristina K.", "When I first walked in, I almost turned around and walked out. First off, let me say, I am not someone who is typically shy about eating alone in a restaurant. That said, I tend to lean toward more casual places when doing so. I didn't expect such a \"professional\" feel (for lack of a better term). The decor is very nice and most of the people eating were in suits.I was sitting quickly and given water right away, which is always nice. I decided quickly on the chicken pad ba mee (normally I stick with pad Thai but I liked the idea of something similar but with more veggies). The food came out relatively quickly (especially considering the other review comments about the service). When my waiter first brought out the food, the noodles reminded me of packaged ramen so I was a bit worried that it would not have much flavor. I was totally wrong. The flavor was fantastic. The veggies were cooked but still crunchy (I hate mushy veggies) and the noodles were great. There wasn't much chicken but it was enough. The serving size was enough to be filling without being too much.I would come back but probably only with other people."], ["Dana S.", "Best Pad Thai and terrific service-always treated like royalty and I feel like I am their one and only customer whether dining in or getting take-out.... just outstanding service!!"], ["Jaci L.", "There food was not that good,when I order there Thai tea,it did not taste like it,when I order there soup it sucks,finally the main course,I order the pad Thai,it was to sweet,I know that pad Thai is not suppose to be that sweet,I know because I tried pad Thai in Orlando,which was 5 stars"], ["Paige S.", "Best drunken noodles I've ever had... The flavor was out of this world! And I've been to most Thai places in Jacksonville. The owner is so incredibly sweet and goes out of her to make sure you are taken care of. With all the other Thai places around Baymeadows, this is the one to try."], ["Tuan V.", "Consistency is something that many restaurant does not have.  I have been to lemongrass about 5 time within a year.  They provide great service and advice.  Quick and speedy and is one of the best Thai restaurant in Jax.  The whole snapper (with the head on) is by far my favorite."], ["Sunny V.", "Nice and clean place. Nice collection of wine and beer. Their Chicken Grill Sate is the best I have ever had. I recommend this place. Customer service is also good and their recommendation to food is also great. I will definitely visit again."], ["John H.", "Quite atmosphere, great wait staff, and delicious food. Modern interior with just right light level for dining. Love the spicy drunken noodles and the bang'n shrimp appetizer.  Price a little high for the portion size. But if you are in the mood for Asian food and looking for a quite place for adult dining, it should not disappoint."], ["Niya D.", "It seems like we aren't the only ones with \"snooty\" \"rude\" \"inattentive\" server.  There is one female server we noticed was excellent, attentive, and engaging. Another male server, was attentive and busy...so we guess you have a one in three chance of having a bad experience.  33.3333% Bad Service. Like others have said:- Waited 5 minutes to be acknowledged...in a nearly empty environment.- Food was served sporadically. Long (5-10 minutes) waits between appetizer, soup and entree.- Server rushed us out. He actually grabbed the plate and fork from my hand, as I was putting my food in the to go container, so he could, \"Clean the table faster.\"  Overall, the food was decent...Not bad.. but not the best.The service was just outright bad.  He had attitude, and turned us off from ever wanting to go back or even recommend this place.Sad since back in 2010, it was the best of jacksonville."], ["Robert H.", "Just ok service.... Friendly but slooooow. The quality was good, the quantity was just ok. The restaurant was clean and with modern look. The meal was slightly over priced.Service wasn't as helpful as I wished either. It would have been better if the waiter had given better information on seasoning. My dinner would been better if spiced up a bit!"], ["Brian C.", "I have been enjoying Lemon Grass for about 8 years now.  Every time I go there it has a nice, relaxing environment.  The service has always been prompt and friendly, and the food has been delicious.  The entrees have a slightly different tastes than I have experienced at other Thai restaurants, but in a good way.  The portions are generous, and we always leave with leftovers."], ["Vivek Reddy M.", "Worst restaurant ever. I stay in the vicinity and I have been visiting this place for the past four years. Apart from good food, there is not a single thing praiseworthy. For a restaurant that prices itself at $$$ and has white table cloth I expect a hostess at the front of the house and good service. I am not demanding excellent service, I can handle mediocre, but not rude. Never in my four years, I repeat NEVER, there was a hostess when I went in. The waiters and the manager ignore you even if you are standing there. I do not mind waiting but I have never seen a place where they ignore a waiting customer so nonchalantly. The same applies to the waiters. There are too proud to be polite. Something is really wrong with the morale of this place. This is not just my testimony but even my secretary started hating to bring a pick up for me from here. Every-time she visited, she came back and complained about the rudeness at this place.Even a hole-in-the-wall kinda place will have a chef/owner who prides himself in serving and being inviting.I rarely write reviews, but do understand why I would write such a scathing review.This place needs to grow up. Will NEVER VISIT again. Will NEVER recommend to anyone."], ["Sunnie B.", "Best Thai food in Jacksonville. I went late and got great service. The restaurant was nice and cozy. They usually have groupons, but if they didn't, I would still visit."], ["Michelle S.", "We were passing through on our way to Sarasota and thought we'd give Lemongrass a try. Awesome decor and wonderful food. We eat Thai often and this was as good as any first rate Thai restaurant we've been to. Highly recommend."], ["Amanda J.", "This place is one of my Thai food go to places when I'm not broke. I've been here a number of times, and actually was the first or second place I ever tried Thai food ..period. The atmosphere is trendy and upscale for Jacksonville, and welcoming. I've only ever come here after dark so I love the vibe of the green interior. I always try the sampler to start, then either pad Thai or one of their curries. I like the fact that there's a little bit of curry powder in their crab Rangoon pouches, yum! The portions of rice that come with the curries are quite small, and the potatoes here in the curries are always al dente but the flavor makes up for it. If I'm in a dessert mood, the xango or coconut cake are always yummy and made freshly."], ["William M.", "I started with Tom Yum Goong and it was excellent. I spent quit a few years in Thailand and haven't found very many places in the states that can do this dish justice, but I have to say that Lemongrass pulled it off with flying colors. I then had Phrik Pow Gai.  This dish was again excellent with just the right amount of heat from the chillies and sweetness from the sweet basil, vegetables and other ingredients.  And the staff are actually Thai, so they are super friendly and make you feel at home as only those from the \"Land of Smiles\" can do.  I will be back."], ["Matthew W.", "Lemongrass Thai seems a little out of place in the small strip mall where it is located. Don't let the low rent building fool you. Once you walk through the door you will be met by a gracious and professional staff in a well decorated and peaceful place to eat. Unlike a lot of cheesy Thai restaurants, Lemongass Thai was decorated by somebody who understood the need for balance between elephant sculptures and more subdued decorations. There are wonderful statues all around but they don't over take the atmosphere of the place. Now on the important stuff!DrinksLet's start with the drinks. Lemongrass offers a wide variety of good wines. I have only partaken in wine on one of my three visits to LGT. That being said, the wine I had was recommended by my waited and paired excellently with my dinner. Every other time I order the Thai Cream Tea. It is excellent. The milky, sweet flavor provides just the right amount of relief from the sometimes spicy Thai food. I highly encourage some of you to give it a go. In addition to Wine and their speciality drinks, LGT offers a small but robust selection of somewhat local and craft beer in addition to the usual domestic (read: boring) offerings. FoodThe food here is pretty good. I would argue that it is a little inconsistant. I have been 3 times as I said before and each time the quality has been from 3-5 star worthy. That being said, know that you will get a good meal every time. The Pad Thai, everyone's classic favorite it seems, was very good. They'll make it spicy if you ask for it. Wash it down with the Thai Cream Tea and you'll have  a wonderful meal. The Pad See Ew was excellent as well. This is a favorite place among my friends and I. ServiceThe service is always fantastic. The servers are just very professional and will chat with you if you like. Other than that, not much to say in the service department.Three stars for the good food, service, and decor. I don't give it five due to a lack of consistency and the location. Other than that it's a great place."], ["Chawaratt G.", "Nicely decorated restaurant with ambient atmosphere but food and service was subpar. I'm thai so I know what I'm talking about. Honestly, I can cook better food than this place. Anyhow, if you like Thai-American food with high markups this might be the place for you. My waiter made a mistake with my order so he had to take it back into the kitchen to add the right ingredient. Imagine, if I weren't Thai I wouldn't know what's missing. It is scary!!I had to wait really long time at least 15-20 minutes for my check when there was only 3 tables with customers. I walked up for my check, waiter had me waited so he can answer the phone. Seriously! I had me wait while he's taking someone's order on the phone. Then he decided to swipe my card while he still on the phone and signaled me to sign. OMG! This is an ultimate rudeness. I've been here once and the experiences was bad but this time it reached the height of the worst. Never again to waste my spirit."]], "Thai Spice Kitchen": [], "Pattaya Thai on King": [["Donna H.", "Dashed in to get take out.  Got the Padt Thai which is delicious.  Very fast service and employees great.  Only complaint it had 5 shrimp in it (maybe that all that it has) and I found the medium is too hot for me.  Will go back to take out, trying different options.  Over all delicious food, and my bad for not going with the wimpy mild, that i need.  Thanks for quick service!"], ["Mylon P.", "Order: Pork Wonton as an appetizer, Red Curry and Pad ThaiPrice $36Pros: Extremely helpful and friendly waitstaff, fast service (slightly uncommon for a thai restaurant)Cons: Food was a little on the salty side (especially the pork wontons), the pork wontons were a little too fried, Thoughts: I've heard several people mention the (relatively) new Pattaya Thai location, and it is only a few miles from our house so we decided to give it a go. I'll start off by saying that that Jacksonville has a quite a few Thai restaurants and several of them are quite good so the bar is pretty high in my opinion. We went for dinner and was surprised to see how small the location was. While we were there no one else showed up to eat in but several people did pick up take out. I would probably say that between indoor and outdoor seating they could probably seat 30-40 people max.Our waitress was incredibly friendly and very helpful. She talked to use about their spiciness levels (this changes A LOT between different Thai restaurants so I always recommend asking), and the different \"specialty\" options. They also had incredibly fast food service and if you've even been to a Thai restaurant you know this is not always the case. While I actually enjoy sitting and chatting with friends during dinner, anyone that is in a \"hurry\" may find their speed a service really helpful. For example it is very difficult for my wife and I to get a Thai lunch during a work due to only having an hour, but it would be completely possible to do that here.Now for the less than positive points; the pork wontons were a little overly fried. They weren't burnt just a little too hard and crunch like they have been left in just a little too long. All of their food was a little too salty for my taste as well. I have mentioned in previous posts that I might be a bit more sensitive than most to salt as I don't really cook with it but I would still say that should hold back on it a bit. I expect cheap chines food to be salty and it make the dishes overall seem a bit lacking in \"Thai\" flavor. I also thing that the portion sized were a little smaller than other Thai restaurants I've eaten at.Overall I think that Pattaya Thai was just \"ok\". I don't think I'd call it out for being bad, but I would probably send someone elsewhere if they really wanted excellent Thai. This would be my go to if I REALLY wanted Thai take out, or didn't have time to commit to a full meal. Other than those circumstances though, I've had better."], ["KyIeranne T.", "Good food, great service!!!!! Will be back!! Thank you pattaya Thai!! I was in town for vacation and wanted some Thai food so I stopped in!!!  This place will do great:)"], ["Samantha M.", "I read that Pattaya had recently opened on King and was excited to check it out. Upon arrival, it was clear that there was a line and quite a lot of confusion with to-go orders from people who were waiting for large orders, and I noticed a few people leaving that seemed to be quite upset. After about ten minutes of watching the confusing situation in front of me, we placed our order. They were out of chicken (gasp!) so I went with plan b-the red curry with tofu. The boyfriend ordered shrimp pad Thai and we both grabbed a beer from the fridge before looking for a table. By the way, a tip on the ordering etiquette/process-the protocol is to order at the counter FIRST, get a number, and THEN get a seat. Don't send your girlfriend or pals to hog that one table outside when there are fifteen people in front of you who will undoubtedly eat and leave before you even order. You'll get a seat. Calm down.But I digress...Back to the experience. Our order was out to our table very quickly, even with how busy they were-literally within five minutes. Unfortunately, my order was wrong; I ordered the red curry with tofu but was served green tofu with chicken (the protein they were out of), by mistake. They fixed my order and brought the correct curry the second time. Now to the food:It was good. It was flavorful. It was VERY spicy. I requested a medium spice level and the boyfriend requested very hot. There was honestly no difference between the two levels-both were eye-watering hot. If you are averse to extremely spicy food, I recommend you ask for mild!The curry was sweet and, while I would have preferred a different protein, I felt the flavors were well balanced. The pad Thai tasted like classic pad Thai. Good, solid flavors and the portions were massive.While I did enjoy slurping away at my almost-too-spicy curry, I did not enjoy slurping it from the cheapest plastic spoon that has ever been made. Pattaya does offer food to-go, but there is clearly a seating area with booths, tables, and even a bar. Patio seating is also offered. So it's not like one of those in-and-out stops with one small table that people sit at while they wait for their food. Additionally, their prices do not really reflect a to-go atmosphere. Their specials are about 19 bucks and I was a little surprised. Two beers, a coke, a pad Thai, and a red curry cost almost fifty bucks. If you're going to charge high prices, at least give me a spoon that I don't have to worry about melting the moment I put it into scalding hot curry. I feel their pricing and their atmosphere don't exactly mesh up. It feels like a spot that wants to be a sit-down restaurant but also wants to focus on take out. Given the size of the place, I can see how this might be tricky. Despite being slammed, they were very quick and I was thankful that their kitchen was so fast. I know they are new and are working out their kinks, and I will most likely try them again in a few months to see what changes, if any, have made. It's worth checking out for yourself. Bring your wallet-and a fork from home-when you do."], ["Patrick L.", "Warning: They charge $2.50 for tap water! When brought to the server's attention she stated that was the store policy, even after spending $30 on entrees. One star and customer lost on principle."], ["Matt M.", "Fabulous Thai food, just like their restaurant on Baymeadows Road. Try it once and you will be hooked, even if you are not a Thai expert. On our visit, we tried the Chicken Pad Thai and Shrimp Pad Thai. Service was friendly and efficient and the food came out hot in minutes, very impressive. The flavor was magnificent and a short time later, both of our plates were clean. Getting food out that hot and that fast and that good is not an easy chore, so kudos to the owners. Now remember the restaurant has only been open a few days, but here are some things they are going to need to work on. Service - service was efficient, but my sweet tea was served in a disposable cup and NEVER refilled. With only half a dozen eaters at the post 1:30 lunch crowd, asking for refills would have been appropriate as well as a sturdy cup. The second thing is \"lunch portions\" - unlike the Baymeadows restaurant, this location has a much younger demographic that wants smaller portions in exchange for a smaller prices. I have a feeling the the two Basa filets for $22 and the whole fish for $30 are not ordered often. However if they halved the portions and halved the price, people might discover these are two of the best things on the menu. However, the food remains simply fabulous."], ["Fooooood L.", "Love the cleanliness. Check inspection reports compared to other restaurants in the area.m.news4jax.com/news/rest…"], ["Phunk M.", "This place is the best hands down. Just like the bigger sister location on baymeadows, this place pumps the same quality food in a way smaller space. I do admit is small, butYou'll soon forget that when your licking your plate clean waiting to get your mango cobbler!! Staff are swift and friendly. When I was there after closing, the chef came by and asked us how our meal was. He even gave us a round of beers on the house!! That's class!! I do recommend if you're not feeling the smaller space, you can do take out and enjoy this amazing food from the comforts of your home. Will be back."], ["Christian M.", "Best Thai food I've had EVER. Had the Tom Kai ga (Coconut soup), pad thai, pork wontons, yellow curry and the duck green curry, they were all FANTASTIC and service was great as well. Highly recommended!!!!"], ["Bob S.", "Located in the former Soup's On location on King Street, a block off of Park.  Same menu and portions as their other location.  I had the Thom Yum Spicy Sour soup with chicken, and there were generous portions of breast meat, mushrooms, tomatoes, and onions in the nicely flavored broth.I thought $2.50 for a soft drink was a bit pricey, but.. I suppose prices are rising everywhere.  Friendly staff take your order at the counter and then bring your meal to you at your table.  Outside dining available, limited seating inside. (5 or 6 two-tops)Worth a repeat visit."], ["Maureen D.", "Food was delicious! I ordered off the lunch menu, and the portions were perfect. However, for those portions, it was pretty pricy. Which is why I gave it 4/5. I got the vegan summer rolls and the vegan tofu padt Thai, medium heat. Plus a drink, the total came to around 17 dollars. The food is high quality, but still a lot for the smaller lunch portions. The summer rolls were a nice little appetizer for one, and the padt Thai was extremely good- but the medium is a little hotter than I expected. Next time I will just get the mild. What really makes this place great is the staff. Everyone was so nice, and really went out of their way to make sure everything was great. I'll be back!"], ["Lina M.", "I like the original restaurant better. This place is tiny with only about 4 tables. The food came out really fast. Kind of overpriced though for the portion. Staff at the front is kinda curt."], ["Deena B.", "Happy to have a Thai restaurant so close to my work! I've had this at their restaurant on Baymeadows and loved it so this was exciting! I really loved my meal there today, but if I have one gripe its that their menu said that they have brown rice and they don't. Next time I will bring my own if they don't have it."], ["Lindsey B.", "Some friends and I ordered take out for the first time last night. We ate outside on our home patio and enjoyed every minute of it! It was absolutely delicious! We are all so excited to have an authentic Thai restaurant in the neighborhood. Everything from the green and red curry to the pad Thai and crab rangoons were amazing. We cannot wait to try something else on the menu. A must try!!!!"], ["Brian A.", "Bottom line was sticker shock... I was so excited for this place to open and then the result was delicious food at exorbitant prices :( so sad for a neighborhood joint that I was so hoping to make a regular stop. Having been fortunate enough to visit Thailand several years ago the green curry chicken was spot on and brought back wonderful memories of my month in the land of smiles. Too bad the owners have decided to pursue an agenda of making as much $ as they can off of 1st time visitors rather than encouraging and developing  a fiercely  loyal neighborhood clientele. I will be back to enjoy the delicious food  but grudgingly. My hope and prayer is  that the restaurant will change. Thank you."], ["Lynda T.", "If you're looking for great Thai, skip this place and head over to Indochine. Both dishes we tried (Padt Kee Mau and Kow Thom Ginger Rice Soup) lacked flavor and were underwhelming. As others mentioned, this place is pricey and unfortunately not worth the markup. Hopefully they'll rework some of the recipes based on feedback. Until then, we will not be back."], ["John R.", "Quite possibly the best Thai food I have had in all of Jacksonville.  Got the chicken pad thai medium spiced to go.  It was hot and ready when I came to pick it up and just phenomenal. Big piece of chicken, perfectly spiced.  Inside isnt anything to write home about but id rather have good food!"], ["Jamal H.", "Let me star buy saying that not many restaurants exceed my expectation in terms of food flavor around here; this one has! I had the Padt Kee Mau with the crazy sauce. The sweetness/citrusy flavor blended with the firing hotness of the peppers was the perfect combination for that dish. I totally recommended but if you can't handle the heat, order it with regular sauce."], ["David M.", "When I was in Thailand, I ate  lad na' at least once a day. It was that good. Since 2010 I have searched and searched for something that would be as good as my trip over seas. Well , I found it!!!!!!!!!. The meat was in the lad na was juicy besides being in a delicious broth, the veges , broccoli, and asparagus are cooked to perfection, and the noodles are delicious. I also had the mango pie desert make sure you get the coconut ice cream. Some yelpers are getting sticker shock, that is a testament to how good the food is. Now i can get great thai food near my house?!?!?!? Worth it. If you want to save money the appetizers are a very good bargain. Good job Pattaya Thai!!!!"], ["Brian K.", "Great food. Glad to have a Thai place in the neighborhood.  Definitely have an order of the Crab Rangoon."]], "Osaka Thai Asian Grill": [], "Elephant Thai Restaurant": [], "Pattaya Thai Grill": [], "Thai Orchid Restaurant": [], "Pho A Noodle Bar": [], "Tuptim Thai": [["Angela D.", "The atmosphere is beautiful.  The thai tea was so tasty.  I wanted a curry that wasn't on the menu and they offered to make it!  It was very good.  I really enjoy this place.  They are reasonably priced."], ["Matt M.", "Okay, this is not too far from my office so I went there when it was first opened and was not very impressed.  But today I went back and what a difference a few months made. Service was attentive, but not rushed and the food was outstanding!Met a friend for lunch and he started with Crab Rangoon and he was delighted with his choice. With lunch you get a cup of noodle soup and a small crispy spring roll. The spring roll was \"eh\", but the soup was surprisingly good and I took it all the way down to last drop.For our entree, my table mate had Pad Thai with a side of Satay Sauce, while I had Thai Fried Rice with shrimp. Both got high marks, as did refilling of water and tea and a simple request for additional napkins. Glad I gave it another try and what a difference it made. By the way, I would probably give it a 3.5, just because the ambiance was not as good as other Thai restaurants in the area, but the food quality made rounding up an easy task."], ["Lai S.", "Good food good lunch specials sometimes their sauce is overwhelming because they put too much.. But never nasty.. I would like to rate them. 3 1/2 unfortunately it isn't possible.. Their soup that comes with each meal is good so is their fried spring roll I would say their appetizers are a bit pricey for the size and amount.. My husband and I eat here often because its down the st from NAS JAX"], ["Jim L.", "Very good food and service. Great value. I like the lunch specials although they would not swap out the chicken soup for a clear  the food was good. A bit salty but delicious  I will be back"], ["Tony K.", "The food and service was fantastic, would definitely recommend this restaurant if you love authentic Thai food...I give them three thumbs up!"], ["Joel V.", "I can't complain about the wait staff. They were good.The new shrimp roll appetizer I had was good.The Thai Iced Tea was just like any other good one out there.The Chicken Pad See Ew (my favorite Thai dish ever ever) was either a black sheep mistake or the cook uses almost triple the flavor ingredients to make their particular Pad See Ew dish compared to others. It was just unenjoyable. Skip that dish and try something else if you do come.Oh, the prices here should probably be listed as \"$\" rather than \"$$.\" Sad Pad See Ew fan, out."], ["Jeanne D.", "This was a wonderful dining experience that I can't wait to repeat.  I had the Tofu Pad Thai and it was superb.  The tofu was seasoned expertly and the vegetables were of high quality and a very generous quantity.  The sauce was just right, spicy and not too hot nor too sweet.  The decor of this restaurant is beautiful, I felt like I was transported from a common little strip mall to an elegant place in Thailand.  I would advise you not to sit between the door and the takeout counter (if you can avoid it) because this restaurant does a lot of takeout orders and the constant walking in and out of takeout patrons is distracting when you are concentrating on a great meal!  This restaurant is hard to find, it is just north of the Naval Air Station on US 17 (Roosevelt Boulevard) and is in the same strip mall as the Hurricane restaurant.  I think, if you like Thai food, that you will find it is worth checking out for yourself."], ["Tron C.", "Been here a couple of times for lunch, the food is pretty good and the prices are very reasonable. The décor is traditional and the wait staff is polite."], ["Charles J.", "I used to love this place. The food is amazing and it comes fast. However, for the past few months the experience has gone downhill.  Aparaentely the young man and his wife have begun to bring their baby to work with them and the baby runs all over the restaurant screaming. One of the waitresses carries the baby while trying to take orders from customers, which everyone knows this is not possible. If this was not bad enough, the baby was placed on the counter by the father and the baby began to run around on the counter where food for to go is placed. The mother was feeding the baby while the baby was running on top of the tables and counter.  And the worst of it was the young waitress screaming like a madman while chasing the baby throughout the isles of the dining room.  I have been patient over the past few months as I dine here all the time, however, as much as I love the food, not sure me or my friends will be coming here again. Screaming babies, babies walking ontop of tables and counters where people eat and food is placed and the worst screaming waitresses playing with babies in a fully seated restaurant. I have never seen a mother and father allow such a thing in a place of business."], ["E M.", "My husband and I stopped here for lunch and had a very enjoyable meal. Servers are attentive and friendly. Food was excellent."], ["William S.", "Very good food.  Great Service and very comfortable dining experience.  Very good  value."], ["Chuck F.", "I think this Thai place is as good a value as anywhere in Jax.  I wish it were closer to Riverside/Avondale, but hopefully we can keep them in business (unlike 3 previous Thai places in the vicinity).  The super-spicy stuff REALLY is super-spicy (but evidently it's great according to my wife and sis-in-law).  Other big hits are \"The Amazing\" and the Pad Thai is on par or superior to most I've had.  NOTE:  was told Pad Thai didn't have fish sauce, but have now been told it does...so it's not vegetarian evidently."], ["Chad L.", "This might be one of the closest places to get Thai food if you live around Riverside and Avondale and the food is great. This is an authentic thai restaurant with a lot of vegetarian options. I would recommend their Massaman Curry."], ["Nathan T.", "The ambient was good, the hostesses were friendly. I ordered Tom Yum Shrimp but it didn't taste like Tom Yum at all. It was missing lemon grass flavor and many other ingredients to be the true Tom Yum. I also ordered Pad Thai chicken. The dish looked and smelled great.  Took a first bite and I was surprised how good it tasted but the noodle was too chewy. I asked the hostesses and they both replied that the noodle was supposed to be like that. Living in Los Angeles and near Thai Town I know pad thai noodle is not supposed to be that chewy. 3 stars for good services and tasty food."], ["Bingle W.", "The décor in this place is Thai to the nth level.  I'm talking wood paneling, sequined elephant wall hangings, carved wood booths with silky pillows, and you can't swing a dead cat without hitting a bamboo plant.  It's a visual overload. And the Thai really know how to pick out a mango.  Every authentic Thai restaurant I've been to have the best damn mangos in their sticky rice desserts.  It could be the dead of freakin' winter and the mangos are always in season and taste like they've just been picked from a tree growing in some tropical, summer climate.  What is up with that?  Okay, so the mangos are good, the decoration is seizure-inducing, and the panang curry will burn your lips off.  And that's a little weird, because I didn't ask for additional heat and the menu said that all of the dishes are prepared mild unless told otherwise and it didn't have a little picture of a chili pepper next to the dish on the menu.  So, either they thought, \"Eh... she looks Asian.  She can handle it\" and snuck in some atomic peppers into the curry or they lied.Also ordered were the tuptim puffs (kind of a cross between a fried wonton and lumpia) which were okay and the pad khing which tasted like every other pad khing I've ever had, and the tom kha gai which was overloaded with uncooked red onions.  The presentation was nice.  Oh, and instead of mints, they gave out tamarind candy with the check and that just made my day.By the way, if you're tall, I would not recommend sitting at the booths because the tables are pretty low and the benches are pretty high, so you'll be doubled over eating your food."], ["Carol B.", "Love this place! Only negative is that it's not totally consistent.  There are definitely times the food is outstanding and the next time it will be just okay."], ["F W.", "Best thai food in Jacksonville.  I have been going here for years, and LOVE the food.   My only complaint is the music.  They seem to play the same  three instrumental songs over and over again every time I am there.  Helpful tip:  they do take-out orders.  \"The Amazing\" is... AMAZING!"], ["Katherine M.", "Today, my family took my mom out for Mother's Day to Tuptim Thai on Roosevelt, and it was such a lovely experience, I actually felt like I owned THEM something- which leads me to writing this awesome review. It is quaint but elegant with friendly service. The atmosphere is gorgeous and relaxed. The food is delicious and the price is reasonable. My mom commented on how detail oriented they are with everything and I would have to agree. From the intricately carved wood wall decorations to the crafted rose made from vegetables that adorn every plate- this place puts a lot of work in giving every customer an experience that makes them feel like they stepped into their own Thai paradise."], ["Beth W.", "I love Tuptim Thai. I am usually not a Thai food fan but I get the Amazing every time I go and enjoy it so much I never want to try anything else! The staff and service are very good and the meal comes with soup, a spring roll, and the main dish so is a fair bit of food. The peanut sauce is great."], ["D Y.", "Step in to Tuptim Thai and be greeted by a warm 'Sawadee-ka' as one of the friendly staff takes you to your table. Decor was of carved rosewood and rich silk tablecloths that gives one a feel of being somewhere near the orient.   Menu has an ample selection of traditional items. My friend and I went during lunch. She ordered the pineapple fried rice and I got a #1 heat factor (closest to wuss as one can get besides a zero but still up for a tiny flavor challenge). The lunch prices are very affordable!! Our server brought us each a soup and a tightly wrapped spring roll about the size of a chapstick dispenser with sauce. This was, of course, a 'teaser' if you ask me, since they were GONE in less than 60 seconds! Both lunch dishes looked great with it's floral-like garnish made of carrots and thin strings of beet. The fried rice was delish! But the Pad Thai noodles were just slightly overcooked  to the point they were a little too stuck together. The #1 heat factor was mild and I think this wuss could have gone to 2. I also had a Thai milk tea. If you've never had one, you should try it once. It's also good with Boba balls, but unfortunately, they do not have the boba tapioca balls. Decor, service and Thai milk tea, spring rolls & fried rice get a 4, while I give the Pad Thai a 2.  And that's because if the overcooked noodles."]], "Indochine San Marco & Buddha Lounge": [["Katy S.", "Re-review as I came back in for a meal.We were seated in the upstairs area, which was a nice quiet area with traditional Thai decor.  Our waitress arrived momentarily after we were seated and promptly brought us drinks.  This level of service continued throughout the meal.The food was great!  We started with the crab rangoons.  I had never had a rangoon with a curry flavor and everyone really enjoyed them (even my sister who does not normally like crab).  For my meal I got the drunken noodles with chicken, 5f heat.  It was a great combination of noodles, veggies, and meat and there was enough for 2 meals.  Everyone at the table enjoyed their individual meals and the price point was good.If I lived in Jacksonville, this would be my go to Thai spot!"], ["Helen W.", "Wow, just wow.  $13 for chicken pad thai that is nothing different from ordinary pad thai. For that price, I would expect it to be phenomenal. I really need to try the specialty dishes because the regular entrees are so not worth it.This is why trendy Asian fusions are such a rip off. Serve the same dish, charge an extra 5 dollars."], ["Jenny R.", "The atmosphere here is cool. The downstairs, where you enter is more active and lively with a bar and open area with a some tables. The upstairs was quiet, good place for groups. The decor was traditional Thai, it's a nice place to have a date. The food was ok. We ordered crab rangoons, there was nothing special about it. Our laab came and it was too salty for my liking. For our entrees, we ordered the spicy curry whole fish and the duck curry. The fish was good but my duck curry was lacking more flavor. I also thought the duck was overcooked. The service was great. Our waiter was helpful, accommodating and came to check on us regularly. Parking was not great. The San Marco area can be hard to find parking, we had to park a block away in a neighborhood and walk. I'm not sure I would go here again if I didn't have a Groupon because the food didn't intrigue me as much as I thought it would."], ["Courtney Z.", "Went here last night with people from work and loved it! We ended up sitting upstairs, and it was pretty quiet.   The only down side was you couldn't get happy hour specials upstairs.   I did get the pomegranate martini, which was delicious! I wish I could of gotten it as a happy hour special though.   I did order the chicken Pad Thai, even though the server recommended the drunken noodles.   I love Pad Thai, so he really wasn't going to change my mind.   It was a decent size and had a great flavor.   When we were leaving we saw a band setting up downstairs, which would make a great date night.  I will definitely be returning since it had a great atmosphere, food and drinks!"], ["Marie F.", "------THE VENUE-----If you are anywhere in San Marco you should stroll past. On cool nights the doors are normally propped out with live music flowing. You can choose to sit on the outdoor patio and get cocktail service as your people watch folks stalking for parking. Many times I smile at the people walking pass that slow their pace or end up doing uturns to peek their heads inside to see what's the big event. They do allow smoking on the patio so sometimes I'm forced inside when the weather is too cold and the smoke is too much. Lighting usually remains pretty dim at all hours. There are Buddha inspired design and a variety of symbolic wall art cover the space inside and several tvs broadcasting sporting events. The only upset would be the bathrooms. Stalls are ? weird. Tiles on the floor were broken and the lightening isn't much brighter then the main room. ------THE NIGHTLIFE-----Monday - Martini Mondays (just like it was when this place was Square One) It's not a big place, but transforms perfecting from a late lunch/dinner spot to a small dance floor. Live music performances 8pm to about 10:30pm followed by DJ playing until close. I thought they closed at midnight but I've been here way past that on some Monday's. Very nice way to start the week. Great place to relax after a long day. Decent bartenders, everyone seems to have a favorite. Take a few drinks, listen to nice music, do a little two step, and still get plenty of sleep for the next work day. Hip Hop / Top 40 music. Listen to 93.3 for the vibe. There are times that I come in after work for dinner, but end up chatting and listening to the live music that I almost forget that I want food. ------THE FOOD-----Great Thai cuisine at all hours of the day. They do limit items to a bar menu after 8 but just chat with a waitress to see if anything from the dinner menu might still be available.  The food is extremely good. With the last visit, I was sadden that I couldn't get any sushi because they were without a sushi chef! That's my only sour note with the food. When they are out of something/can't provide ...it's normally because the person that cooked it quit? So I wonder what's going on in the kitchen?? That aside - must haves ... Drunken Noodles, Tom Kha Gai, Pad Thai, and calamari with sweet chili sauce.  All generous portions."], ["Larry W.", "We stopped in as a change of pace and we had a Groupon. We started with some drinks I had a whiskey sour w/ Jameson for the first time in a while it was near perfect, just enough sour that it did not overpower the whiskey. I ordered the fried rice with shrimp. The dish was tasty and they were not stingy with the shrimp, only thing is the tips weren't cut and I had to cut them off myself (not used to that). The portion was a little snack size in my opinion. My Fiance ordered beef stir-fry and when it came out it looked like soup, it was in a bowl and the beef looked boiled and not stir-fried at all. All in all the food was good, the service was great. Also there was a singer who played the flute and was accompanied by a gentlemen on the guitar. The scenery was nice with artwork throughout."], ["Heide T.", "This was my first stop after a 21-day cleanse. Food is amazing. Had the whole snapper in Thai curry, so flavorful! Then, after dinner went downstairs for dancing...it was the best!"], ["Morgan H.", "This was my 2nd visit to this location and I would definitely consider coming back again if already in the area. We sat outside which was nice. They offer a decent menu of food and drinks. The one thing I didn't care for was the fact that you have to walk upstairs to get to the hostess stand only to then walk back downstairs if you want to sit outside. I really think they would benefit from having a 2nd hostess downstairs for those situations. All in all I enjoyed the atmosphere and vibe that Indochine is offering and the food was pretty good too."], ["Han L.", "I am actually quite torn about my rating. 3.5 stars is more accurate, but alas, I round up bc the staff is friendly, albeit slow at times. This location is definitely more spacious than the downtown location. However, the ambience is very similar. I came here on a dxb date on a Saturday evening. I called ahead to make reservations for 4 at 7:30. The place was actually pretty empty when we arrived, but I always feel better about calling ahead and making reservations. There was live music downstairs near the bar. Two musicians were playing that evening. We were seated upstairs so we couldn't hear them. I was disappointed and found it odd this location does not serve green curry (one of my favorite Thai dishes). The server told me, they simply don't serve it and he doesn't know why. I opted for my second choice, the red curry. I think the food here is pretty good and the portions are ginormous. It's not the most authentic, but that doesn't mean it's not good. The spring rolls appetizer flavor and sauce was a little off for me, but my friends seemed to enjoy it. The calamari appetizer was great; lightly battered and fried. However, I found the sweet and sour sauce an interesting accoutrement. I like how you can request levels of spiceness. They generally serve up to level 6 spiciness, but the server told us there have been ppl who's requested level 25 spiciness. Cray cray! My ldr bf was thrilled the beer here was so cheap! So I am happy that made him happy. The server and the rest of the staff were very friendly."], ["Michelle M.", "I am fortunate that I can take my lunch hour whenever I want to and I choose to come here after 1 to avoid the lunch crush. Andrea is usually our server and she is sans pareil in my book. She is upbeat without being fakey, is always there to make sure my drink never goes dry and makes you feel like a family friend. Her attention never feels overdone and her timing is perfect. I adore Thai food. Adore it. I like everything and everything about it. Drunken noodles good, curry yummy. I will always come back with or without a groupon."], ["Justin L.", "Yum salad is fantastic.  The duck as an entree is also good.  Service is great and it looks like the band is setting up for some live music on a Friday night!  Prices are reasonable, spice chart is right on, levels 1-6.  I'm sitting outdoors and the weather is great, lovely evening for dinner!"], ["Susan S.", "The Tuesday Lunch Club decided on Indochine to celebrate the birthday of one of our members..This location could not get any better..right in all the action of San Marco..always a plus!When I arrived, two of the 5 were already seated, and I was showed to the table..the decor here is really cozy and welcoming, a lit up Buddha, a plush couch, the exposed brick and wood go well together..its all just perfect..Our server was Andrea, and she was very attentive and answered all our questions about the menu..I will say that the water glasses are TINY..not that this matters to most people, but I will always drink a ton of water..she brought me a pint glass, and left the water bottle on the table, problem solved!When we all had arrived, there was a drink ordered for the birthday gal, some teas, a few beers, and of course, the water for me!!We ordered appetizers, the calamari, the crab rangoons, and the steamed dumplings.  All were outstanding, with the table favorite being the crab rangoons, they put curry in them, and they come with a red sauce that isnt your typical sweet and sour, it has a kick to it.Next we ordered our entrees..for myself I tried the Drunken Noodles with shrimp as my protein and a heat level of 3F..im glad i went with the three, it was spicy but not overwhelmingly so..i might try a 4F in a future dish, well see..my gal pals ordered the following: Drunken Noodles with chicken, Pad Thai with scallops and Pad See Ew with chicken, all level 3F as well, and a Yellow Curry with chicken in level 4F..also there was an order of Prik King to go that my friend advised me was amazing later on as well! We arrived at 11, and were only one of two tables..well let me tell you it filled up FAST ..there are two sides, and both were at max capacity!! Our food was boxed up for us, and we asked for our check, and then the server brought out a cake for the birthday girl and we all sang..perfect touch!!I can not say that I understand the price point here..the atmosphere is out of this world awesome..the food is cooked fresh every day and was hands down the best Thai Ive had, yet the prices are alarmingly low..Im not complaining about this, dont get me wrong, I was just very surprised..I will definitely be coming back, perhaps for a dinner to see the club downstairs grooving, and I think i will check out the Adams St location as well to see the comparisons.."], ["Brian S.", "This is another great find that has taken me far too long to experience!I came here with my date, and at 6:30pm on a Friday we were immediately seated in a comfortable booth and in a room that was Asian fusion meets San Francisco hip.Everything about this experience was urbane, but still trendy.Our server came over immediately and took our drink order (their wine list is pretty decent, and full of modestly-priced selections, including their by-the-glass offering).  Our drinks never got below half-full and he always was there at the exact moment we needed something.  The staff here is one of the best I have come across in Jax.We ordered the pan fried dumplings to start with, and they can only be described as fantastic--way better than the ones I make, and I thought mine were pretty good!For dinner, I ordered the Panang Curry with Scallops, and my date ordered the Cashew Chicken, which was also delicious--and what I am probably going to order the next time I go.For dessert, we ordered the coconut creme brulee, which was the only \"okay\" part of our experience.  I thought it was a little too heavy on the coconut (coconut slivers everywhere!), and it did not appear to be fresh (I got the impression that it had been made the day before and refrigerated until just before torching.  I am a huge creme brulee fan, and that is the only reason I gave this place 4 stars instead of 5.This is well worth the price, and you would be the wiser (and happier) to spend an evening there for dinner.  The experience and the food are worth it!"], ["Vanessa T.", "This is a very cool spot, it looks beautiful, when you walk inside the bar in directly in front of you, if you want to eat in the restaurant you go upstairs and its decorated great.   The food is also delish!  We started with some appitizers the crab rangoon- which were really good, the cream cheese tasted like it was mixed with curry which gave it a different taste...the spring rolls were good fried rolls.     For dinner we got the red and the yellow curry.....we both liked the yellow curry better.    You pick what protein you want then basically what style and sauce you want it cooked in, then usually comes with white rice but you can sub out noodles if you want.   We both enjoyed and will be back for another Thai fix!"], ["Victoria L.", "This place is located upstairs from a bar that has live music. We missed out on the music, but could hear a bit of the band setting up and doing a sound check. We would have enjoyed eating and hearing the live music so if you would then plan for a later dinner. We arrived at 6:30 and left about 7:45. My fiancé had ice tea to drink which he saidwas watered-down. I had water was room temperature. The glasses were very small so there wouldn't have been any room for ice. We started out with the Chicken Satay. We then had the beef stir fry which they split between 2 plates and brought out to us without us needing to ask. Both were good, but nothing spectacular. We were going to go somewhere else for dessert. The waitress then told us what desserts they have. She mentioned a coconut cream creme brulee, but we decided to go with the deep fried banana cheesecake. It was to die for. We would go back again, but probably just for the dessert.Total cost was $34.24, not including tip"], ["Candice R.", "Average food, decor, service. Bad lighting.  Crappy greenery, crooked art.  Bland broth. Yay summer rolls and liquor drinks. How about some ambience?? Lighting?? Music?"], ["Jessica F.", "Indochine has 2 locations: Downtown and San Marco. The two locations are very similar, so this is a review for both of them.The ambiance is \"dark and fancy non-specific Southeast Asian\". The tables have nice linens and cloth napkins. The music is very quiet, almost to the point of being non-existent at times, so you can have a nice conversation with your table mates. I like this feature a lot. The service is usually pretty good. The servers and hostesses are polite and try to be helpful. To-go orders are done very quickly at either location, even though the busyness of the location will obviously affect timing. That said, I've always been satisfied. The food is pretty good, but not the best Thai food in town. It's not bad by any stretch, it's just not the best. I'm still happy to eat there, no problem. I like to get the Prik Pow, made vegan with tofu. At the Downtown location, I order spiciness level 4; in San Marco, I order spiciness level 5. (Downtown is on fire, literally!) I am always happy with my food from either location. The food is usually out quickly and I've never had a messed up order. The prices are a little high, but I figure that I'm paying for ambiance, so I don't worry about it. A lot of the time I get my order to go, so I also chalk it up to paying for convenience. Indochine is the most convenient spot for me to get Thai food from home or work, so I end up there fairly frequently. If only they would expand their empire and open a spot in Riverside, Avondale or Murray Hill..."], ["Jeremy K.", "Having been to the downtown location and not being impressed, I found this location to be a much better experience.  I went for a friend's birthday and had a party of 20.  They handled it really well. I understand this can be challenging for restaurants, especially on Friday nights.  I ordered PRIK KING (string bean, red bell pepper & ginger in a dark spicy chili garlic sauce) at a spice level 3 and really enjoyed it with Scallops. Great flavor. The dark and stormy coctail was too sweet for my taste, but otherwise it was a great experience."], ["Linsey J.", "I love this restaurant for the mellow ambiance and dynamic food. Cool seats with pillows to sit on, Buddhist embellishments in the decor, low lighting, and a friendly wait staff are what you have to look forward to. The food is delicious. My favorite is the red curry with exotic veggies and scallops. And the crab Rangoon is delightful. Less crowded than the downtown location, but this one stopped serving sushi, which I miss!"], ["Jessica I.", "Food and service is very average and overpriced.  Let me put it this way...We asked for extra sauce because the noodles were dry and they charged us for it.The entrance  is awkward since the space is empty with a bar in the middle.  The bartender gave us a dreary welcome.  You have to go upstairs for the dining area.  At 6pm the place is empty."]], "Taste of Thai": [], "Thai Cuisine & Noodle House": [], "Sala Thai Restaurant": []}